{
    "id": "37170100-5209-4eca-a6f7-f0a045c17959",
    "created_at": "2022-10-25T16:48:20.500221Z",
    "updated_at": "2025-03-27T02:16:01.203109Z",
    "deleted_at": null,
    "sha1_hash": "19f54a38d2ed9761f4ee9d7f70a06619eb453df1",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-05-29T01:16:36Z",
    "file_modification_date": "2020-05-29T01:16:36Z",
    "file_size": 7351093,
    "plain_text": "# The “Silent Night” Zloader/Zbot\n\n_by_ _[@hasherezade (Malwarebytes) and @prsecurity_](https://twitter.com/hasherezade)_ _(HYAS)_\n\n_May 2020 - Version 1.1_\n\n\n-----\n\n## Foreword\n\nZeuS is probably the most famous banking Trojan ever released. Since its source code\n[leaked, various new variants are making the rounds. In the past we wrote about one of its](https://blog.malwarebytes.com/cybercrime/2017/01/zbot-with-legitimate-applications-on-board/)\nforks, called Terdot Zbot/Zloader.\n\nRecently, we have been observing another bot, with the design reminding of ZeuS, that\nseems to be fairly new (a 1.0 version was compiled at the end of November 2019), and is\nactively developed. Since the specific name of this malware was for a long time unknown\namong researchers, it happened to be referenced by a generic term Zloader/Zbot (a\ncommon name used to refer to any malware related to the ZeuS family).\n\nOur investigation led us to find that this is a new family built upon the ZeuS heritage, being\nsold under the name “Silent Night”. In our report, we will call it “Silent Night” Zbot.\n\nThe initial sample is a downloader, fetching the core malicious module and injecting it into\nvarious running processes. We can also see several legitimate components involved, just\nlike in Terdot’s case.\n\nIn this paper, we will take a deep dive into the functionality of this malware and its\nCommand-and-Control (C2) panel. We are going to provide a way to cluster the samples\nbased on the values in the bot’s config files. We will also compare it with some other Zbots\nthat have been popular in recent years, including Terdot.\n\n\n-----\n\n## Table of content\n\n- Appearance and description\n\n- Distribution\n\n- Elements\n\n- User manual\n\n- Behavioral Analysis\n\n- C2 Communication\n\n- Traffic analysis\n\n- Inside\n\n– Obfuscation\n\n– Used static libraries\n\n– Execution flow\n\n       - The loader\n\n       - The core bot\n\n– Plain loader vs antiemule loader\n\n– Storage\n\n– Manually loading PEs\n\n– VNC Server\n\n– Commands: implementation\n\n– Hooks\n\n– Man-In-The-Browser local proxy\n\n– Stealer functionality\n\n- Comparison\n\n- Panel\n\n- Builder\n\n- Client clusters and IOCs\n\n\n-----\n\n## Appearance and description\n\n[The banking Trojan called “Silent Night” (perhaps in reference to the xXx 2002 movie,](https://www.imdb.com/title/tt0295701/)\nwhere Silent Night was the name of Soviet-made binary chemical weapon) was announced\non November 9th 2019 on forum.exploit[.]in, one of the Russian underground forums. The\nseller’s username is “Axe”.\n\nThe announcement date is very close to the compilation date of version 1.0 that we were\nable to capture.\n\n\n-----\n\n_Compilation timestamp of bot32.exe (743a7228b0519903cf45a1171f051ccfaaa4d12c),_\n_version 1.0_\n\nThe author described it as a banking Trojan designed with compatibility with ZeuS\nwebinjects. Yet, he claims that the code is designed all by him, based on his multiple years\nof experience - quote: “In general, it took me 5+ years to develop and support the bot, on\naverage about 15k ~ hours were spent.”.\n\nThe price tag is steep, especially for the Russian audience where 500 USD is an average\nrent for a small 1 bedroom apartment in the outskirts of Moscow:\n\n- 4,000 USD/month for unique build\n\n- 2,000 USD/month for general build\n\n- 1,000 USD/month extra for HVNC functionality\n\n- 500 USD/14 days to test\n\nIn a reflection post by Axe, he talks about his experience developing a banking bot a few\nyears prior. Rough translation of the text in the image:\n\n_“A few years prior: My previous banking Trojan had a lot of issues and was hard to maintain_\n_because of the poor architecture and C-code. The best course of action was to rewrite the_\n_whole thing, and I have done just that. The development took a few years, and I went through_\n_a couple of iterations. Finally, with the experience learned from the first version and all the_\n_customers’ feedback, I was successful at making the ideal banking trojan.”_\n\nIn fact, we can confidently attribute his previous work to be Axebot. Same user Axe has\n[another thread on the same forum around 2015-2016 where he advertised another](https://forum.exploit.in/topic/91661/)\nbanking bot.\n\n\n-----\n\n[Comparing Axe Bot 1.4.1 and Zloader 1.8.0 C2 source codes, we note that all of their custom](https://github.com/RomaniukVadim/hack_scripts/tree/cc801b36ea25f3b5a82d2900f53f5036e7abd8ad/Dark%20soft/AXE%20Bot/axe_1_4_1_stable)\nPHP functions have the prefix CSR, which can either be a naming space or a developer’s\nhandle.\n\n\n-----\n\n_AxeBot global.php:_\n\n_Zloader global.php (deobfuscated):_\n\nThe description and functionality described in the thread also closely match the capabilities\nof the Zloader sample. Among the advertised features we find:\n\n\n-----\n\n```\nWeb Injections and Form Grabber\nSupport for browsers \"Google Chrome\", Firefox, \"Internet Explorer\".\nHiddenVNC\nWorks on all OSs with the latest browser versions except Edge.\nSOCKS5\nThe session starts in one click on the bot page in the admin panel.\nThe server-side utility for the backconnect works only under Windows.\nKeylogger\nMonitors keystrokes in browsers.\nSearch by keylogger reports is possible by process name, window title and\ncontent.\nScreenshots\nIt takes screenshots in the area of clicking the mouse button with a size of\n400x400, it fires when you enter the url you need.\nScreenshots can be searched by process name and window title.\nCookie Grabber\nSupport for browsers \"Google Chrome\", Firefox, \"Internet Explorer\".\nCookies are available for download in NETSCAPE, JSON and PLAIN formats.\nPasswords Grabber\nFrom Google Chrome.\n\n```\nAxe also claims to use an original obfuscator, described in the following way:\n```\nProtective gear\nAn obfuscator was written for the bot, which morphs all code and encrypts\nstrings + all constant values in the code.\nThis is not only a banal replacement of arithmetic operations with analogs,\nbut also decomposition of all instructions, including comparison operations\nby functions to processors that perform the operation we need, and we get a\nvery confusing code at the output.\nDecryption of lines occurs on the fly on demand, which will be stored\ntemporarily on the stack.\nDecryption of constant values also occurs on the fly, for each of which has\nits own unique function of decryption.\nAll WinApi calls are made through a handler that searches for the hash API we\nneed.\nCreates fake WinApi calls during code obfuscation, so the bot stores a random\nimport table.\nCritical code (cryptographic algorithms) works in a stacked virtual machine,\nVM code also morphs, virtualization is necessary to complicate the analysis.\nThus, with each assembly we get a unique file and any signature will be\nknocked down in one click.\nPerformance was not critically affected.\n\n```\n\n-----\n\n## Distribution\n\n[On Dec 23 2019, this Zloader was observed being dropped by the RIG Exploit Kit (source).](https://www.malware-traffic-analysis.net/2019/12/23/index3.html)\n\nAt the beginning, since it was soon after the first release of this malware, the campaigns\nwere small, and appear to be for testing purposes. The spreading intensified over time, and\nthe distribution switched to mostly phishing emails.\n\n[In March 2020, it was delivered in a COVID-19 themed spam campaign, as reported by](https://twitter.com/VK_Intel/status/1241187512409903104)\n[Vitali Kremez.](https://twitter.com/VK_Intel/status/1241187512409903104)\n\nAt that time, the attachments used for dropping the malware were mostly Word documents\nwith malicious Javascript. The document is a lure trying to convince the user to enable the\nactive content.\n\n_[dcaded58334a2efe8d8ac3786e1dba6a55d7bdf11d797e20839397d51cdff7e1 - source](https://www.virustotal.com/gui/file/dcaded58334a2efe8d8ac3786e1dba6a55d7bdf11d797e20839397d51cdff7e1/detection)_\n\nLater, the spam with the Invoice template started to be used.\n\n[On Apr 21, 2020 a big campaign was reported by ExecuteMalware](https://twitter.com/executemalware/status/1252384340404649989?s=21)\n\nThe used attachments were mostly Excel Sheets with macros embedded on a VeryHidden\nXLS sheet. After enforcing the hidden sheet to be displayed, we can see the commands in\nthe cells:\n\n\n-----\n\nThey were downloading the malicious loader from the embedded URLs.\n\n_Details on deobfuscating this type of loader has been presented in the video by_\n_[DissectMalware.](https://www.youtube.com/watch?v=QBoj6GB79wM)_\n\nAnother variant of the attachment was a VBS script, where the Zloader was embedded\ndirectly, in obfuscated form:\n\n_[80bb2ee42974630e746bc1cf36e7589a5283ee4532836b66be2c734acbe308df](https://www.virustotal.com/gui/file/80bb2ee42974630e746bc1cf36e7589a5283ee4532836b66be2c734acbe308df/detection)_\n\nSince the distribution may vary, and the campaigns are probably run by third parties (the\nclients who rented the malware) we will not go into their details in this paper.\n\n\n-----\n\n## Elements\n\nThe distributed package contains the following elements - malicious as well as harmless,\nthat are used as helpers:\n\n**Name** **Functionality**\n\nloader-bot32.dll/.exe Loader/installer of the core element\n\nantiemule-loader-bot32.dll/.exe Loader/installer of the core element, with antiemulator evasion techniques\n\nbot32.dll the core element (main bot) - version for 32 bit\nsystem\n\nbot64.dll the core element (main bot) - version for 64 bit\nsystem\n\nhvnc32.dll Hidden VNC (32 bit)\n\nhvnc64.dll Hidden VNC (64 bit)\n\n_zlib1.dll_ harmless: Zlib compression library\n\n_libssl.dll_ harmless: an SSL library for secure communication\n\n_sqlite3.dll_ harmless: an SQLite library for reading SQL\ndatabases\n\n_nss32.dat_ A package containing following harmless PEs:\ncertutil.exe, libplds4.dll, msvcr100.dll, nss3.dll,\nsqlite3.dll, nssdbm3.dll, libnspr4.dll, smime3.dll,\nnssutil3.dll, nspr4.dll, softokn3.dll, freebl3.dll,\nlibplc4.dll\n\nServer-side elements:\n\n**Name** **Functionality**\n\nbcs.exe a server-side Back-Connect utility (deployed on\nthe machine of botnet operator)\n\nThe same binaries are served to all the clients in standard releases, and the only\ncustomization is available via hardcoding a custom configuration. In addition to this, the\nauthor offers custom builds for specific clients.\n\n|Name|Functionality|\n|---|---|\n|loader-bot32.dll/.exe|Loader/installer of the core element|\n|antiemule-loader-bot32.dll/.exe|Loader/installer of the core element, with anti- emulator evasion techniques|\n|bot32.dll|the core element (main bot) - version for 32 bit system|\n|bot64.dll|the core element (main bot) - version for 64 bit system|\n|hvnc32.dll|Hidden VNC (32 bit)|\n|hvnc64.dll|Hidden VNC (64 bit)|\n|zlib1.dll|harmless: Zlib compression library|\n|libssl.dll|harmless: an SSL library for secure communication|\n|sqlite3.dll|harmless: an SQLite library for reading SQL databases|\n|nss32.dat|A package containing following harmless PEs: certutil.exe, libplds4.dll, msvcr100.dll, nss3.dll, sqlite3.dll, nssdbm3.dll, libnspr4.dll, smime3.dll, nssutil3.dll, nspr4.dll, softokn3.dll, freebl3.dll, libplc4.dll|\n\n|Name|Functionality|\n|---|---|\n|bcs.exe|a server-side Back-Connect utility (deployed on the machine of botnet operator)|\n\n\n-----\n\n### Samples\n\nThe current analysis focuses on the following samples, captured in live campaigns:\n\n**loader-bot.exe :**\n\n- [becacb52a50004d42538cfe82c8f527f1793727c5f679f46df7f96eade272962 – loader](https://www.virustotal.com/gui/file/becacb52a50004d42538cfe82c8f527f1793727c5f679f46df7f96eade272962/detection)\n#1 (dropped by RIG EK)\n\n- [0c1b74345e0300233db0396f78ca121e7589deda31b7bc455baa476274e3f2e5 –](https://www.virustotal.com/gui/file/0c1b74345e0300233db0396f78ca121e7589deda31b7bc455baa476274e3f2e5/detection)\nloader #2 (downloaded from: 45.72.3.132/web7643/test2.exe)\n\n- [3648fe001994cb9c0a6b510213c268a6bd4761a3a99f3abb2738bf84f06d11cf - loader](https://www.virustotal.com/gui/file/3648fe001994cb9c0a6b510213c268a6bd4761a3a99f3abb2738bf84f06d11cf/details)\n#3 (packed, from malspam)\n\n– [3648fe001994cb9c0a6b510213c268a6bd4761a3a99f3abb2738bf84f06d11cf -](https://www.virustotal.com/gui/file/3eb18cd9033735bc04aa02671e9bd94c4e4d6664107799ba593c5b646dd966ef/detection)\nloader #3 (unpacked)\n\n**bot32.dll :**\n\n- [6460f606f563d1fe3c74b215e1252dc7466322e4d2b55b898b9da1bd63454762 -](https://www.virustotal.com/gui/file/6460f606f563d1fe3c74b215e1252dc7466322e4d2b55b898b9da1bd63454762/detection)\nsample #1\n\n- [df60102fff5974a55fb6d5f4683f2565b347a0412492514e07be9b03c7c856b7 –](https://www.virustotal.com/gui/file/df60102fff5974a55fb6d5f4683f2565b347a0412492514e07be9b03c7c856b7/detection)\nsample #2\n\n\n-----\n\n## User manual\n\nFollowing the address of the C2 (Command and Control server) we found an open\ndirectory.\n\nOne of the files contained a manual for the bot operator:\n\n\n-----\n\nThanks to this manual, we could start the analysis by understanding thoroughly what the\nfeatures intended by the author were. The functionality is typical for a banking Trojan,\nwithout much novelty. In a subsequent part of this post, we will present how each feature is\nimplemented in the bot.\n\n[Not surprisingly, there is an overlap between this manual, and the classic Zeus Bot manual,](https://github.com/Visgean/Zeus/blob/translation/manual_en.html)\navailable with the leaked source.\n\nThe main panel of the C2 is written in PHP.\n\n\n-----\n\n### Backconnect\n\nOne of the described features is backconnect. This feature means that the malware opens a\nreverse connection, allowing the operator to interact with the infected machine in spite of\nthe Network Address Translation (NAT) being in use.\n\nThe server-side utility for the backconnect is implemented as an additional executable:\n[bcs.exe (hash 9a77409eac7310b0492915aba04f23dafa9f4990dab588df0ab8ffe0871daae8).](https://www.virustotal.com/gui/file/9a77409eac7310b0492915aba04f23dafa9f4990dab588df0ab8ffe0871daae8/detection)\nThe bot operator must run it with Administrative privileges on their own machine, and\nthen fill the IP address in the Config section of the C2 panel.\n\n### Commands\n\nAccording to the author, the bot accepts the following commands:\n\n- `user_execute [URL] [parameters] - download an executable into the %TEMP% folder`\nand run it (optionally with parameters)\n\n- `user_cookies_get - steal cookies from all known browsers.`\n\n- `user_cookies_remove - removing all cookies from all known browsers.`\n\n- `user_url_block [url_1] [url_2] … [url_X] - block URL access for the current user.`\n\n- `user_url_unblock [url_1] [url_2] … [url_X]`\n\n- `bot_uninstall - complete removal of the bot from the current user.`\n\n### Webinjects and Webgrabbers\n\nThe bot allows for stealing contents of the opened pages (webgrabber), as well as for\nmodifying it (webinject). The format of webinjects is typical for ZeuS. Example:\n```\nset_url * G\ndata_before\n<title>\ndata_end\ndata_after\n</title>\ndata_end\ndata_inject\nINJECT\ndata_end\n\n```\nFormat of setting condition that executes webinject/webgrabber on a selected page:\n```\nset_url [url] [options] [postdata_blacklist] [postdata_whitelist]\n[matched_context]\n\n```\nOptions are defined by following characters:\n\n\n-----\n\n```\nP - run on POST request.\nG - run on GET request.\nL - if this symbol is specified, then the launch occurs as an HTTP grabber,\nif not specified, then as an HTTP injection.\nH - complements the \"L\" character, saves content without HTML tag clipping.\nIn normal mode, all HTML tags are deleted, and some are converted to the\nnewline or space character.\nI - compare the case-sensitive url parameter (for the English alphabet only).\nC - compare case insensitive (for the English alphabet only).\nB - block execution of the injection.\n\n## Behavioral analysis\n\n```\n[Sandbox analysis of the component dropped by RIG EK is available here.](https://app.any.run/tasks/9d63a526-bab1-4794-a957-0c6775471625/)\n\nAs we can see in the diagram, the malicious executable first makes an injection into\n```\nmsiexec.exe - which is a very common target of malware based on (or inspired by) ZeuS.\n\n```\nFurther injections are made to other running processes. It also installs a custom certificate\nwith the help of certutil.exe.\n\n[The initial component of this malware (i.e. d93ca01a4515732a6a54df0a391c93e3) is a](https://www.virustotal.com/gui/file/becacb52a50004d42538cfe82c8f527f1793727c5f679f46df7f96eade272962/details)\ndownloader/installer. So, in order to reveal its malicious intent, we need to run it on a\nmachine connected to the internet, and make sure that we have access to the live C2 server.\n\nThen, the malicious implant running inside msiexec attempts to connect to the C2 server,\nand download the important elements from there. The communication with the C2 goes\nover HTTPS, but is also additionally encrypted.\n\n\n-----\n\n-----\n\nThe sample content of request-response:\n\n_The analysis of the decrypted traffic is presented in the traffic section._\n\nThe bot creates multiple directories with random names inside the %APPDATA% directory.\n\n\n-----\n\nIn some of them we can find files with encrypted content:\n\nIn addition to it, it creates registry keys with pseudo-random names, under\n```\nHKEY_CURRENT_USER\\Software\\Microsoft. Example:\n\n```\n\n-----\n\n### Persistence\n\nThe malware achieves persistence with the help of an Autorun registry key, which is a very\npopular, and easy to detect method.\n\nThe key points to the loader component that was dropped into a custom folder created in\n%APPDATA%:\n\nThis way of storing components (creating multiple random-named directories in\nAPPDATA, and storing the encrypted components there) is typical for malware with ZeuS\nheritage.\n\n_During the execution the malware was updated, dropping an alternative loader:_\n_[8e73a8a4a35ebfcc3e900ec4255cb296](https://www.virustotal.com/gui/file/eafbd21a0f9f082fa2e94e010569d7fa8512d978087c2633d652b865b922465a/detection)_\n\nOnce the initial executable is run, it performs injection into msiexec and then terminates.\n\n\n-----\n\n_The view from Process Explorer shows how the initial executable (yddieb.exe) runs msiexec_\n_and terminates._\n\nThe component implanted into msiexec continues running, and performs further injections.\n\nAt the beginning of its execution it reads the registry key with the saved configuration.\n\nThen, it reads components that are saved in the folders inside %APPDATA%.\n\nIt loads the next stage modules from the previously dropped encrypted files, and then\ninjects them into msiexec, and into other processes.\n\n### Implants\n\n[We can extract the implanted modules by scanning the system with Hollows Hunter.](https://github.com/hasherezade/hollows_hunter/)\nDepending on the process, the injected components may vary. Four different schemes of\ninjections have been observed, depending on the target process.\n\n1) `msiexec`\n\nInside the msiexec the core component of the malware runs. We can find several DLLs\nimplanted there.\n\n\n-----\n\n_The implants and reports dumped by Hollows Hunter._\n\nThe implant at 70000.exe is the loader. Depending on the variant, it can be delivered as an\nEXE or DLL. If the loader was implemented as a DLL, the initial redirection (from msiexec\nto the loader implant) may be a bit different than in case of the EXE.\n\nFor example, in one of the observed cases, the Entry Point of msiexec was patched. The\npatch then redirected the execution to the implanted DLL\n[(893d85faac45de4ef4bc43e81907e74a ):](https://www.virustotal.com/gui/file/23fba90136c705201e757bec9225f55a37db35f92aed49bfc000cb5fa64120a0/detection)\n\n\n-----\n\nThe EAX is filled by the address of the loader’s Entry Point, and the call redirects the\nexecution the implant:\n\nThe next module: 550000.dll in the dump - is the main module of the bot (bot32/64.dll).\nWe can also see several other DLLs. By looking at their export tables we can identify them\nas: hvnc32.dll, sqlite3.dll, libssl.dll, zlib1.dll.\n\nThe libssl.dll is loaded by hollowing mshtml.dll.\n\n2) Other processes (except msiexec)\n\nAll accessible processes have implants installed for the purpose of interception of selected\nAPI calls.\n\nWe can find there a similar scheme of implants:\n\n_The implants and reports dumped by Hollows Hunter._\n\nThere is one malicious DLL (identified as the core component of the bot: bot32/64.dll).\nAdditionally, two DLLs are hooked: NTDLL, and User32. Their execution is redirected to the\nimplanted DLL.\n\n[Sample report is given below (where 7430000 is the bot32/64.dll):](https://github.com/hasherezade/pe-sieve/wiki/3.1.-Investigating-hooks-and-patches)\n\n\n-----\n\n- ntdll.dll\n```\n45778;NtCreateUserProcess->745decf[7430000+2decf:(unnamed):1];5\n\n```\n- user32.dll\n```\n164c7;TranslateMessage->745e6d9[7430000+2e6d9:(unnamed):1];5\n\n```\nThe beginning of the function NtCreateUserProcess is patched, and starts by the\nredirection into the implanted DLL:\n\nThe jump at the beginning of NtCreateUserProcess leads to the following function inside\nthe implant:\n\nThe hook at the beginning of the function TranslateMessage in User32.dll also starts by\nthe redirection to the implant:\n\n3) Browsers: iexplore (Internet Explorer), firefox, chrome.exe (Chrome)\n\nBrowsers processes have implants installed for the purpose of interception of selected API\ncalls. Just like most of the processes, they have the main bot injected (bot32/64.dll), yet\ntheir hooking scheme is extended. The additional hooks are installed in ntdll.dll.\n\nSample report is given below (where the 180000 is the bot32.dll):\n\n- ntdll.dll\n```\n45778;NtCreateUserProcess->1adecf[180000+2decf:(unnamed):1];5\n45858;NtDeviceIoControlFile->1ae0cb[180000+2e0cb:(unnamed):1];5\n\n```\n\n-----\n\n- user32.dll\n```\n164c7;TranslateMessage->1ae6d9[180000+2e6d9:(unnamed):1];5\n\n```\n4) `iexplore (Internet Explorer), chrome.exe (Chrome)`\n\nIn Internet Explorer and Chrome, the implants are almost the same as mentioned in the\nprevious paragraph (“browsers”). Yet there are additional hooks in crypt32.dll, that\nwere not observed i.e. in Firefox.\n\nSample report (where 180000 is the bot32.dll implant):\n\n- crypt32.dll\n```\n16ccf;CertGetCertificateChain->1ae635[180000+2e635:(unnamed):1];5\n1cae2;CertVerifyCertificateChainPolicy->1ae6a6[180000+2e6a6:(unnamed):1];5\n\n```\n- ntdll.dll\n```\n45778;NtCreateUserProcess->1adecf[180000+2decf:(unnamed):1];5\n45858;NtDeviceIoControlFile->1ae0cb[180000+2e0cb:(unnamed):1];5\n\n```\n- user32.dll\n```\n164c7;TranslateMessage->1ae6d9[180000+2e6d9:(unnamed):1];5\n\n```\n_The detailed analysis of the hooks, and how they are installed, is presented in the hooks_\n_section._\n\n### Modules\n\n[Let’s have a closer look at all the modules dumped by the HollowsHunter.](https://github.com/hasherezade/hollows_hunter)\n\n[First, the core DLL (bot32/64.dll) (ab756f154d266c8ba19bdfa8bcaf1b73) will be](https://www.virustotal.com/gui/file/df60102fff5974a55fb6d5f4683f2565b347a0412492514e07be9b03c7c856b7/detection)\ndownloaded. It is implanted into the initial msiexec but also into all the accessible\nprocesses. This model of injection is atypical in comparison to most malware seen\nnowadays, and very invasive: usually, malware selects only one or two processes where it\ninjects.\n\nIn addition to the injected core, in the main malware process, running under the cover of\n```\nmsiexec we will find more modules, including legitimate DLLs: sqlite3.dll, libssl.dll,\n\n```\nzlib1.dll.\n\n\n-----\n\n_sqlite3.dll – fragment of the Export Table_\n\n\n-----\n\n_libssl.dll – fragment of the Export Table_\n\n\n-----\n\n_zlib1.dll – fragment of the Export Table_\n\nThe sqlite3.dll is used for the purpose of reading and stealing cookies from the browsers’\ndatabases. The libssl.dll – for establishing the encrypted connections, but also generation of\nthe custom certificate, that will be used for the purpose of Man-In-The-Browser attacks.\nThe zlib1.dll is for compression and decompression of data sent and received over HTTP\n(gzip).\n\nOne more malicious DLL is a VNC module\n[(f3d2e4606a8964b8910dd8172b5c98e02f27e00b6082d7af220e2edfdbf7eb40) – that](https://www.virustotal.com/gui/file/f3d2e4606a8964b8910dd8172b5c98e02f27e00b6082d7af220e2edfdbf7eb40/detection)\nallows to open a hidden VNC connections to the victim machine.\n\n\n-----\n\n**Modules for 64 bit system**\n\nOn a 64-bit system, Zloader uses one more DLL for the purpose of injections\n(64_gate32.dll). It is a 32-bit PE that can access a 64-bit environment with the help of the\n[Heaven’s Gate technique. Its usage and technical details will be explained in the further](https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/)\npart of this post.\n\n- [e0a3355b40e6660e35037da9680fcaabef458ee8a6ef7c7cc742324124c8e39](https://www.virustotal.com/gui/file/e0a3355b40e6660e35037da9680fcaabef458ee8a6ef7c7cc742324124c8e396/detection)\n\n\n-----\n\nThere is also a 64-bit version of the main module that will be injected into 64-bit processes:\n\n[3aa6edf03880493e9e16cc5ee1cf79996901c814cbe6e43b001327b6897eea59](https://www.virustotal.com/gui/file/3aa6edf03880493e9e16cc5ee1cf79996901c814cbe6e43b001327b6897eea59/details)\n\nSimilarly, a 64-bit version of the VNC is being used.\n\nLooking at the modules, we can find many analogies to banking trojans based on ZeuS.\n\n### Pairing with a browser\n\nThe main module inside msiexec runs a local server, to which the other implanted modules\nare connecting, and sending the stolen data.\n\nThe image below represents the view from Process Explorer, listing the connections opened\nby msiexec as well as the ones open by Firefox. One of the connections established by\nFirefox links it with the local server, running inside msiexec. We can see a pair of\nconnections where the msiexec uses local port 18301 and remote 49937 (which is the port\nopen by Firefox), while Firefox uses local port 49937 and remote 18301 (which is the port\nopen by msiexec).\n\n\n-----\n\n### Fake certificates\n\nThe malware installs a fake certificate for the Man-In-The-Browser attack. This is how the\nconnection with the fake certificate looks like in various browsers:\n\n_Fake certificate in Firefox_\n\nFirefox doesn’t show anything alarming at first glance, but when we click on the details of\nthe connection we will find the message “Mozilla does not recognize this certificate issuer. It\n_may have been added from your operating system or by an administrator”. More advanced_\nusers may get suspicious at this point.\n\n\n-----\n\n_Fake certificate in Internet Explorer_\n\nIn the case of Internet Explorer nothing like this occurs, and only a closer analysis of the\nIssuer and Certification Path may raise concerns that the certificate is not legitimate.\n\n\n-----\n\n-----\n\n_Fake certificate in Chrome_\n\nIn the case of Chrome, the situation looks very similar like in the Internet Explorer. We\nneed to see the certificate’s details, read the Issuer and the Certification Path to find out the\nfraud. For the less advanced users, it may be too difficult to notice the alarming indicators.\n\nThe differences between how Firefox displays the certificate versus Internet Explorer and\nChrome, are caused by a different way in which the malicious certificate is installed. In the\ncase of Internet Explorer and Chrome, the malware author patched the functions in\n```\ncrypt32.dll responsible for validation of the certificate in order to bypass the security\n\n```\nmeasures. In the case of Firefox, it just installed the malicious certificate with the help of\nthe certutil tool.\n\nWe will see the implementation of those techniques in the further part of this post.\n\n\n-----\n\n### Webinjects\n\nWhen we visit one of the targeted sites, we can also observe a malicious script being\ninjected into the original website content. In the example below, the login page of\nScotiabank was implanted with a skimmer. The malicious javascript is inlined in the header\nof the website.\n\n_The highlighted line shows the malicious script injected in the header._\n\nThe difference can be noticed when we compare it with the original source:\n\nThe content of the elements that are going to be injected is defined by templates that are\ndownloaded from the C2.\n\n## Inside\n\nThis analysis details on 32-bit modules of the bot. Most of the 64-bit modules are\nanalogical. Yet, the 64-bit modules are going to be referenced whenever they introduce any\nfunctionality that is not present in the 32-bit version.\n\nThe initial sample (loader) that is distributed in campaigns, is usually packed with the help\nof some underground crypter. The used crypters change periodically, and most likely\n\n\n-----\n\ncreated by a third-party. That’s why this analysis will not include analysis of the packing in\nthis report. Automated unpacking of the used samples was done with the help of PE-sieve.\n\n### Obfuscation\n\nIn order to make analysis more difficult, all of the malicious modules of this Zbot are\nobfuscated. The characteristics of the obfuscation indicates that it has been applied on the\nsource-code, pre-compilation. It contrasts with most malware, where the only protection is\nthe layer added post-compilation, with the help of a crypter/protector.\n\nEach release of the bot contains randomized obfuscation. Although the resulting code is\ndifferent, yet the patterns are similar every time. This indicates that the same code\nobfuscator was used for each release, and the generated obfuscation artifacts are being\nrandomized on each use.\n\nAccording to the advertisement on the underground forum, the obfuscator is custom,\ndeveloped by the author of the bot themselves.\n\n**Constants**\n\nMany of the constants used in the code are obfuscated. Instead of being hard-coded, they\nare calculated just before use, by a unique, obfuscated function.\n\nFor example, instead of giving a parameter as a value of 2, the dedicated function is being\ncalled to calculate it:\n\nInside the function calculating the value of 2 we can find calls for various other functions,\nand use of globals that may need to be pre-initialized.\n\nThis makes emulation of those functions challenging.\n\n\n-----\n\n**Arithmetic operations**\n\nVarious arithmetic operations used by malware, as well as comparisons, are also\nobfuscated. Instead of being implemented in a standard way, they are managed by multiple\ndedicated functions, each of them is obfuscated.\n\nExample:\n\nInstead of using a comparison operator == the malware implements its own function\n```\nis_equal(val1, val2), and this function is internally obfuscated, in order to make its role\n\n```\nnon-obvious.\n\nTo make things more complicated, various parts of the code use diverse versions of the\n```\nis_equal function - and each of them is obfuscated in a randomized way.\n\n```\n\n-----\n\nSome versions also contain redundant parameters.\n\n\n-----\n\nIn between, we can encounter redundant API calls. In the below example, before the\ncomparison is made additional conditions are being checked, and meaningless calls to\n```\nRealeaseDC and GetStringTypeW are made.\n\n```\n\n-----\n\nDeobfuscation is difficult also because of the huge diversity of implementations of those\nsimple functions. A list of various instances of is_equal function in one of the analyzed\nsamples shows the diversity:\n\n\n-----\n\nThe same is done for other comparators, as well as arithmetic operators such as +, -, ^, &\netc.\n\n**Imports**\n\nIt is a common practice among malware authors to obfuscate API calls. Often imported\nfunctions are fetched by their pre-calculated checksums, and mapped to their addresses\njust before use. Similarly it is implemented in the analyzed case - yet, it is more complicated\nin some ways.\n\n\n-----\n\nBefore the new function can be fetched by a checksum, the initialization of the retrieving\nfunction is required. During this step, addresses of functions LoadLibraryA and\n```\nGetProcAddress are filled into a global structure. \n\n```\nThe import is fetched just before use, by a call to the dedicated function. In the example\nbelow, we can see two parameters being pushed on the stack before the retrieving function\n(load_func_by_checksum) is called: the DLL’s ID (0), and the function’s checksum\n(0x1FEDC07). Based on those two parameters, a needed API is retrieved - in this case it is\n```\nGetWindowsDirectoryW.\n\n```\nThe retrieving function has the following prototype:\n```\nFARPROC __cdecl load_func_by_checksum(DWORD lib_id, DWORD checksum);\n\n```\nInternally this function selects a proper DLL by an ID (and eventually loads it if missing),\nand then calls a function directly responsible for mapping the checksum to the appropriate\nAPI. Prototype of the called function:\n```\nFARPROC __cdecl load_function_from_lib_module(HMODULE library, DWORD checksum);\n\n```\nIn case of failure to retrieve any import, the bot just terminates its execution.\n\n\n-----\n\nUsually, the DLL is fetched from the libraries loaded in a typical way (using LoadLibrary).\nBut there are 3 DLLs that are supposed to be loaded manually: libssl.dll, zlib1.dll,\n```\nsqlite3.dll. (It matches the previous observations, done during behavioral analysis.).\n\n```\nTheir addresses are supposed to be filled in the internal list.\n\nIn common scenarios of malware analysis, once we understand the import loading\nmechanism, and know the checksum calculation algorithm, we can easily write a\ndeobfuscator which will do a reverse lookup, mapping checksums back to function names.\nBut in this Zbot things are more complicated. The obfuscator diversified the way in which\nthe checksum is retrieved. Sometimes, the explicit value is hardcoded (as in the example\nabove). Yet, in many cases, they are calculated first by dedicated functions. For example,\nthis is how in one of the cases VirtualAlloc is resolved: we don’t know the checksum until\nthe function that calculates it returns the result.\n\nAnother example - fetching the select function. This time neither DLL’s ID nor the\nfunction’s checksum is hardcoded - both are unknown until they are calculated by the\nobfuscated functions (denoted on the picture as calc_dll_id(),\n```\nchecks_socket_select()).\n\n```\n\n-----\n\nIn such cases, even having the import-retrieving function re-implemented won’t help. We\nwould be forced to re-implement each and every checksum-calculating function - so that\nwe could retrieve proper parameters first. Those checksum-retrieving functions are also\nobfuscated, and diversified, so reimplementing them would be a laborious task. Example of\nthe function retrieving the checksum:\n\n[Such problems can be solved with libPEconv. We can call original functions from the](https://github.com/hasherezade/libpeconv/)\nmalware, just by defining their prototypes and supplying their offsets.\n\nDue to the fact that many constants in the code are obfuscated, it is not even possible to\nguess the called function by looking at the passed parameters. The given example shows\nhow the call to VirtualAlloc may look like: not only is the function name obfuscated, but\nalso many of the passed arguments.\n\n\n-----\n\n**Strings**\n\nMost of the strings used by malware are also obfuscated. There are two separate\nobfuscation functions: one for ANSI strings, and another for UNICODE. Prototypes of both\nare analogical:\n```\nDWORD __cdecl decode_cstring(const char *in_buf, char *out_buf, int length);\nDWORD __cdecl decode_wstring(const wchar_t *in_buf, wchar_t *out_buf, int length);\n\n```\nSimilarly like in the case of retrieving imports, values of some of the parameters can be\ncalculated just before the use, by unique, obfuscated functions. So, for example, we don’t\nknow what the address of the input buffer is until we execute the dedicated function\nretrieving it. This makes automatic deobfuscation difficult.\n\nYet, the string deobfuscation functions alone are pretty simple. After cleaning the\nredundant instructions we can see, that all what they do is XORing the input buffer with the\nhard-coded key:\n```\nconst char g_StrXorKey[] = \"fgK#I6#D!NtdI#!J\";\nchar *decode_cstr(char* in_buf, char* out_buf, int length)\n{\n  for (size_t i = 0; i != length; ++i)\n    out_buf[i] = g_StrXorKey[i % 16] ^ in_buf[i];\n  return out_buf;\n}\nwchar_t *decode_wstring(const wchar_t *in_buf, wchar_t *out_buf, int length)\n{\n  for (size_t i = 0; i != length; ++i)\n    out_buf[i] = wchar_t(g_StrXorKey[i % 16]) ^ in_buf[i];\n\n```\n\n-----\n\n```\n  return out_buf;\n}\n\n```\n**Deobfuscation**\n\n[With the help of a libPEconv library, along with IDA scripts, we managed to deobfuscate all](https://github.com/hasherezade/libpeconv/)\nthe strings and imports used by the malware. The libPEconv library allowed to import the\nconstant-generating functions directly from the malware, without the need of\nunderstanding and rewriting the obfuscated code. Then, IDA scripts helped to automate the\n[process of extracting the needed values. As a result we got the following listings, which can](https://github.com/hshrzd/zbot_material/tree/master/csv)\n[be applied on a binary, i.e. with the help of IFL Ida Plugin. This is how the code with applied](https://github.com/hasherezade/ida_ifl)\ntags may look like - strings, as well as the fetched imports, has been added as comments:\n\nAfter deobfuscation of the bot, we can analyze it statically, i. e. in IDA.\n\n### Used static libraries\n\nLooking at the strings of the module, we can see artifacts hinting that some of the known\n[open source libraries have been used. For example, the MinHook library:](https://github.com/TsudaKageyu/minhook/blob/master/include/MinHook.h)\n\n\n-----\n\n[There are also HTTP messages that suggest usage of HTTP parser from NodeJS.](https://github.com/nodejs/http-parser)\n\n### Plain loader vs antiemule loader\n\nAs mentioned in the introduction of the malware elements, the loader can come in one of\ntwo flavors: plain or anti-emule. They do not differ in terms of the core functionality.\nHowever, an anti-emule loader comes with additional loops of junk code that are supposed\nto maximally slow down the analysis, if the malware is being executed by an emulator.\n\nBelow you can see fragments of logs generated when both flavors of the loader (the same\nversion number) have been deployed via PIN tracer.\n\n\n-----\n\nIn the case of the plain one, the core functionality of creating the msiexec process, and\ninjecting itself there, starts right away after the loader is deployed. In case of the anti-emule\none we see a long trace of redundant instructions being called in a loop, before the real\naction starts.\n\n### Execution flow\n\nIn this part we will follow through the malware execution, starting from the component\n[d93ca01a4515732a6a54df0a391c93e3 that was dropped by the RIG Exploit Kit. The](https://www.virustotal.com/gui/file/becacb52a50004d42538cfe82c8f527f1793727c5f679f46df7f96eade272962/community)\nversion of the analyzed package is 1.0.8.0. Occasionally we will refer to other samples\n(higher versions) in order to present the updates.\n\n**The loader (loader-bot32.exe)**\nThe below diagram shows the components of the malware running in particular processes,\nat the loading stage.\n\n\n-----\n\nFirst the loader executable is deployed. It runs msiexec, and injects itself there. It\nretrieves the next stage (bot32/64) either from local storage, or from the C2 server, and\ninjects it in the same instance of msiexec.\n\n_The loader’s execution steps:_\nA) Initial run (original executable, original entry point)\n\n- inject itself into msiexec and run\nB) Inside msiexec (changed entry point)\n\n- initialize internals:\n\n– init imports loader (store pointers to LoadLibraryA and GetProcessAddress in\nglobal variables, that will be used to load import by hash)\n– walk through the Import Table and load all the imports (they were not\ninitialized by the loader component)\n– decrypt internal configuration (including C2 URL) with a hardcoded RC4 key #1\n(in currently analyzed sample it is fgnukdkakyldcgqnleqe)\n\n- check if compiled as debug: if yes, show an info: BOT-INFO-> It's a debug version..\nCheck if Proxyfier.exe is running. If Proxifier detected, show a MessageBox informing\nabout the collision with internal proxy: BOT-INFO->Proxifier is a conflict\n```\n  program, form-grabber and web-injects will not works. Terminate proxifier\n  for solve this problem..\n\n```\n- try to retrieve the installation data from the registry\n(HKCU\\Software\\Microsoft\\<installation_key>) - names of the keys are unique for\na particular version of the bot), i.e. HKCU\\Software\\Microsoft\\lolo -> ystu. Decrypt\nthe value with RC4 key #2 retrieved from the hardcoded configuration.\n\n- if the installation key is not found, install itself: generate the installation data block and\nsave it in the registry under HKCU\\Software\\Microsoft\\<installation_key>.\nInstallation block includes RC4 context (initialized with randomly generated RC4 key\n#3) that will be used for encrypting files, as well as paths that will be used for storing\nthose files (in %APPDATA%)\n\n- try to retrieve the core module (bot32/64.dll) saved on the disk (in encrypted file in\n```\n  %APPDATA%). Validate the file. If validation was successful, store the payload internally\n\n```\nfor further loading.\n\n\n-----\n\n- If the core module could not be retrieved, try to download it from the C2, following the\nURL from the internal configuration. (In older loaders only the hardcoded URLs were\nused. In newer versions, also DGA is used)\n\n- If downloading was successful, save the module on the disk (in\n```\n  %APPDATA%/<generated_path>)\n\n```\n- Manually load the core module and redirect execution there, or exit on failure.\n\nImplementation details of the selected actions will be given below.\n\n_Injection into msiexec_\n\nThe loader can be implemented as a DLL or as EXE. Below we will walk through the process\nof loading of the loader implemented as EXE.\n\nAt the beginning of loader’s execution we can see a code responsible for creating a new\nmsiexec process:\n\n\n-----\n\nThe full loader’s PE is copied into a buffer, and obfuscated by XOR:\n\nWhen we run the downloader we can see that it injects its copy into msiexec, along with\nshellcode.\n\n_The memory regions highlighted in the image are the implants: the obfuscated PE and the_\n_shellcode._\n\n\n-----\n\nThe injected copy is XOR obfuscated at first, with a random DWORD-sized key. The role of\nthe additional shellcode is to deobfuscate it, and then redirect execution there. Fragment of\nthe shellcode processing XOR obfuscated copy of the module presented below:\n\n_The loop in the shellcode processing the obfuscated PE._\n\nAfter applying the XOR key, the PE is revealed. We can find that it is a copy of the initial\nloader - yet, its Entry Point has been replaced: on this run, the execution starts from a\ndifferent address.\n\n\n-----\n\n_After the decoding loop finishes the execution, the PE is revealed._\n\nBeginning of the main function, where the execution starts inside the msiexec:\n\n_Loader’s main function_\n\nLoader’s main function starts from the initialization, involving several steps.\n\n\n-----\n\n_The init function of the loader, view from x64dbg._\n\nThe loader goes through its own Import Table and fills the imports. In addition to the\nfunctions from the Import Table, imports loaded by hashes are going to be used. The\nalgorithm used for fetching them is the same as explained in the “obfuscation” section.\n\nThe malware comes with RC4 encrypted configuration, which is first decrypted with the\nhelp of the hardcoded key (key#1).\n\n\n-----\n\nWe can find there i.e. the ID of the botnet, and the URLs of the C2 gates which are going to\nbe queried. At the end of the configuration there is another RC4 key (key #2). The details of\nthe malware configuration and storage are explained in the dedicated section.\n\nAfter the initialization phase, the malware proceeds with the installation. First, it queries\nthe special registry key, which is used for storing installation data of the bot.\n\n\n-----\n\nIt also RC4 decrypts a hardcoded 16 byte value, converts it into GUID and uses it as a mutex\nname.\n\nThen, it generates a bot ID in a format: %s_%08X%08X consisting of the machine name, and\ngenerated machine ID. The algorithm used for its generation will be presented further.\n\nIn case the core bot was already installed, the paths for the components are fetched from\nthe installation data block. The core bot component is being read from the dedicated files,\nand decrypted.\n\n\n-----\n\nThe decrypted data contains the PE file per-pended with the header. The header contains\nthe bot version - in the current case it is 1.0.8.0. The version must match the one hardcoded\nin the loader. Just before the PE content, its size, and then the CRC32 checksum is stored.\nThe checksum will be verified before the bot is loaded.\n\nIn case if the bot could not be retrieved, the loader will try to download it from its C2\nserver.\n\n_Downloading modules from the C2_\n\nThe malware opens internet communication:\n\n\n-----\n\nFirst it beacons to the C2:\n\nAnd it downloads and decrypts the next stage DLL.\n\n_[Decrypted payload ab756f154d266c8ba19bdfa8bcaf1b73](https://www.virustotal.com/gui/file/df60102fff5974a55fb6d5f4683f2565b347a0412492514e07be9b03c7c856b7/details)_\n\nThe details about downloading modules are given in the “Traffic analysis” section.\n\n\n-----\n\nRedirecting the execution:\n\n_The DGA_\n\nIn the newer versions of this malware, in addition to the hardcoded C2 URL, a Domain\nGeneration Algorithm (DGA) is being used. The generated URLs are being queried one after\nanother, till the successful connection is established.\n\nThe Domain Generation Algorithm uses the supplied seed.\n\n\n-----\n\nReconstruction of the DGA code is given below:\n\n\n-----\n\n```\n#include <iostream>\n#include <Windows.h>\nvoid generate_domains_list(DWORD seed, size_t count)\n{\n  DWORD _seed = seed;\n  char _next = 0;\n  while (count--) {\n    size_t len = 1;\n    do\n    {\n      _next = _seed % 0x19 + 0x61;\n      std::cout << _next;\n      _seed = seed ^ (_next + _seed);\n    } while (len++ < 0x14);\n    std::cout << \".com\\n\";\n  }\n}\n\n```\nAt once DGA generates 32 domains.\n\nThe seed is generated based on the local time.\n```\nunsigned long long make_seed()\n{\n  SYSTEMTIME local_time = { 0 };\n  GetLocalTime(&local_time);\n  local_time.wHour = 0;\n  local_time.wMinute = 0;\n  local_time.wSecond = 0;\n  local_time.wMilliseconds = 0;\n  FILETIME file_time = { 0 };\n  SystemTimeToFileTime(&local_time, &file_time);\n  unsigned long long *a1 = (unsigned long long*) &file_time;\n  return compress_time(*a1);\n}\n\n```\nThe following function is used to convert the retrieved time into a DWORD:\n```\n#define LODWORD(a1) (a1 & 0x00000000FFFFFFFF)\n#define HIDWORD(a1) (a1 & 0xFFFFFFFF00000000)\nunsigned long long compress_time(unsigned long long file_time)\n{\n  unsigned long long compressed_time = file_time - 0x19DB1DED53E8000i64;\n  DWORD a2 = 0x989680u;\n  unsigned long long v3 = LODWORD(compressed_time) + (HIDWORD(compressed_time) %\na2);\n  unsigned long long result = LODWORD(v3 / a2) + (HIDWORD(compressed_time) / a2);\n  return result;\n}\n\n```\n\n-----\n\nThen, the RC4 algorithm with the key from the config (key #2) is applied on it:\n\nThe final value is the seed for generating the domains. The strings generated by the\nalgorithm are appended with .com domain extension, and the gate address post.php.\nSumming up, the used DGA is a client-side implementation of the same algorithm that is\nused in the panel.\n\nThose domains are filled in an internal structure, and then they are picked one by one, till\nthe responding domain is found.\n\n\n-----\n\n_The generated domains are aggregated in an internal structure, and queried one by one._\n\n**The core (bot32.dll)**\nThe below diagram shows the components of the malware running in particular processes,\nafter the execution got redirected to the main bot (running inside msiexec).\n\n\n-----\n\n_The bot’s execution steps:_\nA) Starting execution at Entry Point (after being loader by the previous - loader \ncomponent)\n\n- initialize internals:\n\n– init imports loader (store pointers to LoadLibraryA and GetProcessAddress in\nglobal variables, that will be used to load import by hash)\n– walk through the Import Table and load all the imports (they were not\ninitialized by the loader component)\n– init a CRC32 table\n– WSA startup (initialize WinSock 2.0)\n– decrypt internal configuration (including C2 URL) with a hardcoded RC4 key #1\n(in currently analyzed sample it is fgnukdkakyldcgqnleqe)\n– InternetSetOptionA: INTERNET_OPTION_MAX_CONNS_PER_SERVER -> 10\n– read installation data stored in the registry:Software\\Microsoft\\<hardcoded\n```\n     key> (in the currently analyzed version it is lolo->ytsu). If found, decrypt the\n\n```\ninformation. The data stored in the registry key is encrypted/decrypted with\nthe help of the RC4 key #2, retrieved from the C2 configuration (in the analyzed\nsample it is 90f1e19e2306648e9e22059d47f36016). Those data contains paths\nto encrypted components stored in unique directories created in %APPDATA%\n– get Volume CLSID for the unique identification of the infected machine\n– init default UserAgent string: Mozilla/5.0 (Windows NT 6.3; Win64; x64)\n```\n     AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.88\n     Safari/537.36)\n\n```\n- fetch path to the VNC module from the information saved in the registry\n\n\n-----\n\n- fetch the unique Bot ID saved in the registry and store it in a global variable for further\nuse\n\n- run threads responsible for particular malicious actions, such as:\n\n– command parsing loop: parse commands sent to the bot, and deploy demanded\nactions\n– upload to the C2 files where the stolen data were collected\n– steal data from browsers SQLite databases (cookies)\n– install a fake certificate and run the local proxy\n– a loop monitoring the processes and injecting the modules in them\n– run VNC server\n\nImplementation details of the selected actions will be given below.\n\n_Core bot’s main function_\n\n_[Analysis based on sample: ab756f154d266c8ba19bdfa8bcaf1b73](https://www.virustotal.com/gui/file/df60102fff5974a55fb6d5f4683f2565b347a0412492514e07be9b03c7c856b7/details)_\n\nThe execution of the core bot starts by the initialization phase.\n\nThe initialization function prepares various elements of the bot for the further\nfunctionality. First, the imports lookup is initialized:\n\n\n-----\n\nDue to the fact that the loader component didn’t fill the import table, the payload needs to\ndo it on its own. It walks through the import table and fills the thunks.\n\n\n-----\n\nThen we can see the initialization of the socket, and of the decryption of the stored\nconfiguration:\n\n\n-----\n\nThe bot collects some data about the execution environment, and retrieves the previously\nsaved information from the registry:\n\nAfter the initialization succeeded, the bot continued the execution of the malicious\noperations, by deploying various threads.\n\n\n-----\n\n-----\n\nIn the newer versions, one more thread has been added for querying the information about\nthe network settings.\n\nThe data is retrieved simply by querying commands such as:\n```\nipconfig /all\nnet config workstation\nnet view /all /domain\nnltest /domain_trusts\nnltest /domain_trusts /all_trusts\n\n```\nThe output is reported to the C2.\n\n### Storage\n\nThe bot keeps its data in encrypted files, stored in %APPDATA%, in directories with\npseudo-random names. In order to keep track of what files are in use, and what are their\npurposes, it uses a special structure. This structure is generated at the moment of bot’s\ninstallation, and kept in the encrypted format in a dedicated registry key, which is also\nencrypted.\n\nLet’s take a look at the full logic of the malware’s storage.\n\n\n-----\n\nBoth, the loader and the bot, comes with an internal configuration that resides in the .data\nsection of the PE, and is encrypted with the hardcoded key (key#1).\n\nAfter decrypting this configuration, we can see data such as the campaign ID, C2 URL, and\nalso another RC4 key (key#2) - which will be used i.e. for communication with the C2.\n\nThis key (key#2) is also going to be used for encrypting/decrypting of the installation\ninformation block, stored in the registry, and shared between the loader and the bot.\n\nAt the moment of installation, the first malicious module (loader) creates the installation\nregistry key, and fills it with the encrypted content of the installation information block.\n\n\n-----\n\nThe loader generates a 0x28 bytes long RC4 key (key#3), that will be further used for\nencrypting dropped files:\n\n_The RC4 context is initialized with the random 0x28 byte long key._\n\n\n-----\n\nThe generated context:\n\n_The buffer shown on the picture is the RC4 context data that was initialized with the given_\n_key._\n\nInstead of storing this key (as it would be done in typical scenarios) the RC4 context data is\nstored inside of the installation data block.\n\n\n-----\n\n-----\n\nThe installation block contains the list of the files used by the malware, as well as other\nused registry keys. Overview:\n```\nheader:\n- malware version (DWORD)\n- size of the data (after the header) (DWORD)\n- CRC32 of the data (DWORD)\ndata:\n\n```\n- CLSID of the main VolumeID (retrieved by GetVolumeMountPoint): 16 bytes\n\n- unique bot ID: <machine name>_<generated_machine_id> (Unicode string)\n\n- name of the Autorun key (Unicode string)\n\n- RC4 context initialized with the key#3 (it that will be used for decryption\n```\nof the files)\n\n```\n- list of the files (relative to `%APPDATA%`)\n\n- additional registry keys (relative to `HKCU/Software/Microsoft`)\n```\npadding: random bytes after the data\n\n```\nThe referenced components (files and registry entries) are encrypted with the RC4\nalgorithm, using the stored RC4 context (initialized by the loader with RC4 the key#3).\nAdditionally, some of them are encrypted with a custom, XOR-based algorithm called Visual\nEncrypt (described in details in a section C2 Communication ).\n\n### Bot ID\n\nThe bot ID consists of two components. First is the string, which is simply a machine name,\nretrieved by GetComputerNameW. If the name could not be retrieved, a string UNKNOWN will be\nused instead.\n\n\n-----\n\nAfter that, the numerical identifier is generated. First the OS version is retrieved by\n```\nGetVersionExW. Then two keys under Software\\Microsoft\\Windows NT\\CurrentVersion\n\n```\nare read: InstallDate and DigitalProductId.\n\n\n-----\n\nThe malware calculates CRC32 checksums from those elements and combines them\ntogether by formatted print.\n\n\n-----\n\n### Retrieving installed modules\n\nAs mentioned before, the files used by the malware are stored in dedicated directories in\n```\n%APPDATA%. The names of the files, as well as names of the directories are randomly\n\n```\ngenerated at the installation phase. In order to keep track of them, and load them on\ndemand, the malware keeps a dedicated structure (installation data block). It is stored in\nthe registry, and decrypted on demand each time it is used, with the help of the RC4\nalgorithm and the key from the configuration (RC4 key#2).\n\n\n-----\n\nExample of the files list fetched from the installation data block:\n\n\n-----\n\nThe module is retrieved from the structure by its ID. The following function is responsible:\n\nEach IDs denotes a specific file. The PE modules are denoted by the following IDs:\n\n  - 0 : The core bot\n\n  - 1 : 64-bit memory reader (only for 64-bit installations)\n\n  - 3 : VNC component\n\n  - 7 : libSSL\n\n  - 8 : Zlib1\n\n  - 9 : Sqlite\n\n  - 10 : Certutil package (certutil.exe + dependencies)\n\nElements stored in the installation data structure of the analyzed case:\n\n|ID|Path|Encryption|Role|\n|---|---|---|---|\n|0|Guuga\\ugef.hi|RC4|PE module: zbot.dll|\n|1|Gefu\\bihad.by|RC4|64-bit memory reader (empty on 32 bit system)|\n|2|Gefyf\\yddieb.exe|not encrypted|Zloader PE|\n|3|Yceho\\ugcud.daig|RC4|hvnc.dll|\n\n\n-----\n\n|4|Ybaf\\ofdaofu.gucub|?|report (empty for now)|\n|---|---|---|---|\n|5|Ecob\\deidicy.ifb|5 bytes + encrypted content (RC4 + Visual Encrypt)|report (including screenshot)|\n|6|Badabe\\buif.ihceg|5 bytes + encrypted content (RC4 + Visual Encrypt)|report|\n|7|Agafh\\ofgyoc.edeg|RC4|libssl.dll|\n|8|Ygubo\\acbei.idi|RC4|zlib1.dll|\n|9|Hioh\\ifahibif.ihudy|RC4|sqlite3.dll|\n|10|Heib\\dafi.hu|RC4|certutil + DLLs|\n|11|Buuge\\byadf.efg|5 bytes + encrypted content (RC4 + Visual Encrypt)|certificate|\n|12|Buguuha||registry path at HKCU/Software/Microsoft|\n||ceefhuod|RC4 + Visual Encrypt|registry value #1 (under HKCU/Software/Microsoft/ Buguuha): C2 data + fake cert|\n||difi|?|registry value #2 (under HKCU/Software/Microsoft/ Buguuha)|\n\n\n### Uploading of the reports\n\nThe data stolen from the victim is aggregated in encrypted files, at the specific paths. One of\nthe threads deployed by the malware is dedicated to regular uploading of those files to the\nC2.\n\nBefore the upload, the data is decrypted, and encrypted by a different RC4 key: the key\nfrom the config (key #2), along with Visual Encrypt.\n\n\n-----\n\nIn the early versions of the malware, some related debug strings were left, and even a\npopup on the upload failure:\n\n\n-----\n\n### Manually loading PEs\n\nMany of the additional PE modules (including the aforementioned legitimate DLLs: zlib1,\nlibssl, sqlite3) are loaded manually. The following function is responsible:\n\nAfter the DLLs are being manually loaded, the pointer to their bases is added into the\ninternal list, referenced by the function that retrieves the functions by hashes. Then, the\nfunctions from them are retrieved analogically to the functions from the DLLs loaded in the\nstandard way.\n\nThe same PE loading function is also used to load further modules belonging to the\nmalware, such as VNC Server.\n\n\n-----\n\n### VNC Server\n\nThe VNC server is an additional module of the malware. As mentioned before, its role is to\nopen a hidden VNC on the attacked machine, giving the attacker remote access. The module\nis implemented as a DLL, exporting two functions:\n```\nint __stdcall VncStartServer(DWORD *a1, QWORD *a2);\nBOOL __stdcall VncStopServer(LPVOID vnc_struct);\n\n```\nIt is stored in one of the encrypted files (as explained in “Execution flow” paragraph). It is\nfirst read from the file, then decrypted and manually loaded.\n\nLet’s first take a quick look at how the VNC server is run by the main bot.\n\n\n-----\n\nThe function VncStartServer is fetched from the loaded module, and called with the\naddress of the local host and port.\n\n\n-----\n\nThe VNC server operates in the background when the malware is running. When it is\nstopped, the termination function is called.\n\n\n-----\n\n### Inside the VNC component\n\nIn contrast to the core component, the VNC DLL does not use obfuscation of API calls. Yet, it\nuses obfuscation of some arithmetic operations. We can see inside multiple functions\nrelated to managing a virtual desktop that will be used by the attacker to access the victim’s\nmachine via graphical user interface.\n\n\n-----\n\nIt also gives access to the keyboard and clipboard of the victim.\n\n\n-----\n\n### Commands: implementation\n\nOne of the threads runs a continuous parsing and executing of the commands received\nfrom the C2 server.\n\nThe received command is compared with the hardcoded one, and when the match is found,\na particular function is executed.\n\n\n-----\n\nThe complete list embedded in the module is given below:\n\n- `user_execute`\n\n- `bot_uninstall`\n\n- `user_cookies_get`\n\n- `user_cookies_remove`\n\n- `user_passwords_get`\n\n- `user_files_get`\n\n- `user_url_block`\n\n- `user_url_unblock`\n\nThe supported list covers the commands described in the User manual, yet, it contains\nsome additional ones, such as fetching files, and passwords. It suggests that the authors\nkeep extending the functionality of the bot.\n\nDetailed explanation of the stealing implementation is described in the further paragraph\nstealer functionality.\n\n\n-----\n\n**user_cookies_get**\n\nThis command is responsible for searching databases where cookies of particular browsers\nare stored, opening them, and extracting content by SQLite queries. The following queries\nare used:\n```\nselect `host`, `name`, `value`, `path`, `expiry`, `isSecure`, `isHttpOnly`,\n`sameSite` from `moz_cookies`\nselect `host_key`, `name`, `encrypted_value`, `samesite`, `path`, `expires_utc`,\n`is_secure`, `is_httponly` from `cookies`\n\n```\nThe analyzed version of the bot searches for cookies from two browsers: Chrome and\nFirefox.\n\n**user_passwords_get**\n\nExecution of this command triggers stealing passwords saved in the attacked browsers.\nCurrently only Chrome is supported. The following query are executed:\n```\nselect `origin_url`, `username_value`, `password_value` FROM logins\n\n```\n**user_files_get**\n\nExecution of this command triggers the operation of searching and uploading documents of\nthe victim (.txt, .docx, .xls, wallet.dat).\n\n### Hooks - code analysis\n\nThe overview of the installed hooks was presented in the behavioral analysis, section\n**Implants.**\n\nAs it was mentioned, almost every process in the system was hooked:\n```\nntdll.NtCreateUserProcess and user32.TranslateMessage were affected.\n\n```\nIn browser processes (iexplore.exe, chrome.exe) we could find additional hooks\ninstalled: ntdll.NtDeviceIoControlFile and crypt32.CertGetCertificateChain,\n```\ncrypt32.CertVerifyCertificateChainPolicy.\n\n```\nIn firefox.exe only the additional hook in ntdll was applied\n(ntdll.NtDeviceIoControlFile).\n\nLet’s connect those observables with the code within the bot that was responsible for\ninstalling them. First, the function (RVA 0x2D81B in the analyzed bot32) is responsible for\ncollecting the APIs to be hooked. We can find out how different processes are affected.\n\n\n-----\n\nIn all the processes:\n\n  - `ntdll.dll`\n\n    - `NtCreateUserProcess -> bot32.write_payl_into_process`\n\n  - `user32.dll`\n\n    - `TranslateMessage-> bot32.grab_forms_and_screenshot`\n\nDepending on Windows version, it may also install:\n\n  - `ntdll.dll`\n\n    - `NtCreateThread -> bot32.write_payl_into_process_v2`\n\nIn firefox.exe, chrome.exe, iexplore.exe\n\n  - `ntdll.dll`\n\n    - `Nt/ZwDeviceIoControlFile -> bot32.pass_trafic_through_local_proxy`\n\nIn chrome.exe, iexplore.exe\n\n  - `crypt32.dll`\n\n    - `CertGetCertificateChain -> accept_cert_unconditionaly1`\n\n    - `CertVerifyCertificateChainPolicy -> accept_cert_unconditionaly2`\n\nThe details on the hooks functionality will be explained in the further paragraph.\n\n**The injector and the hooking engine**\n\n_Initialization_\n\nOne of the threads run in the main function of the bot is responsible for continuous\nmonitoring of the processes.\n\nIf the current module is 32 bit, and runs on a 64 bit system as Wow64, in order to make\ninjections into 64 bit processes one more module is used: 64_gate32.dll. This DLL was\npresented briefly in section “modules for 64 bit system”. It is an additional DLL of the\nmalware, manually loaded into the current process.\n\n\n-----\n\nJust as the name suggests, this 32-bit DLL enables an access to 64-bit environment, using\n[the Heaven’s Gate technique. Below - fragment of the DLL’s code calling the “Heaven’s Gate”](https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/)\nin order to switch to 64-bit mode:\n\nThis DLL exports a simple API, with self-explanatory names:\n\n  - `CmpMem64 - compare 64-bit memory`\n\n  - `GetMem64 - get 64-bit memory`\n\n  - `GetTEB64 - get 64-bit TEB (Thread Environment Block)`\n\n  - `X64Call - perform a 64-bit call`\n\nThose functions are being called whenever any access to a 64-bit environment is required.\n\n\n-----\n\n_The example shows the function GetTEB64 being fetched from the manually loaded DLL, and_\n_then called._\n\nIf preparation of the injection engine was successful, the malware enters into a function\nthat enumerates running processes and performs the injection.\n\n\n-----\n\n_The injecting loop_\n\nThe injecting function starts by taking a snapshot of all running processes, using\n```\nCreateToolhelp32Snapshot, and then walks through it.\n\n```\nIt injects the current module (main bot) into all accessible processes, except for Microsoft\nEdge. When the injection into explorer.exe has failed, information about it will be\nappended to the report that is later sent to the C2.\n\nAlthough the injected payload is the same PE as the current module, yet it’s execution flow\nwill be different. It is because its execution will start from a different Entry Point.\n\n\n-----\n\n_Fetching the new Entry Point for the implant_\n\nThe function at the new Entry Point is the one responsible for installing hooks inside the\nprocess where the implant was injected.\n\n_The implant’s main function_\n\nAs mentioned in the previous paragraph, the installation of the API hooks is performed by\nthe implanted copy of the bot, with an alternative Entry Point.\n\n_The function at the Entry Point for the implant has three blocks representing the three phases:_\n_initialization, main actions, and the exit._\n\nAs before, the execution starts with the initialization function. Then there is a call into a\nsingle function responsible for deploying the main actions. Among few other actions, it is\nresponsible for hooking the API of the DLLs loaded in the current process.\n\nThe API hooking function is run as first.\n\n\n-----\n\nThen, the bot deploys a thread responsible for communicating with the local server, run in\nthe main component implanted in msiexec.\n\nThe implant checks if it has been installed in the explorer.exe - and if so, it reports about\nit (“Inject to explorer success.”).\n\n\n-----\n\nThis report is then being sent to the C2. Although all the accessible processes (except Edge)\nare being injected, only the injection into explorer is being reported.\n\nAnother condition that is checked inside the same function, is, if the implant runs inside\n```\niexplore.exe - if so, it may deploy an additional thread for deleting URL cache.\n\n```\nYet, the most important and interesting function that is being deployed, is the hooking\nability.\n\n_The hooking process_\n\nDepending on which process the implant is running, the different hooks will be selected to\napply.\n\n\n-----\n\nThe addresses of the functions to be hooked are retrieved in a typical way - by calling\n```\nGetModuleHandleW + GetProcAddress. Thanks to this, we can easily follow what functions\n\n```\nare being hooked in particular cases.\n\nThe function writing hooks takes 3 arguments: the original function (target to be hooked),\nthe intercepting function, and the trampoline function (which redirects back to the original\n[function that is being intercepted) - just like the function MH_CreateHook from MiniHooks](https://github.com/TsudaKageyu/minhook/blob/8fda4f5481fed5797dc2651cd91e238e9b3928c6/include/MinHook.h#L111)\n[library which artifacts we noticed in the former part of this analysis:](https://github.com/TsudaKageyu/minhook/blob/8fda4f5481fed5797dc2651cd91e238e9b3928c6/include/MinHook.h#L111)\n```\n  // Creates a Hook for the specified target function, in disabled state.\n  // Parameters:\n  //  pTarget  [in] A pointer to the target function, which will be\n  //          overridden by the detour function.\n  //  pDetour  [in] A pointer to the detour function, which will\noverride\n  //          the target function.\n  //  ppOriginal [out] A pointer to the trampoline function, which will be\n  //          used to call the original target function.\n  //          This parameter can be NULL.\n\n```\n\n-----\n\n```\n  MH_STATUS WINAPI MH_CreateHook(LPVOID pTarget, LPVOID pDetour, LPVOID\n*ppOriginal);\n\n```\nThe hooking is not done by an atomic write. Instead, in order to avoid concurrency issues,\nthe hooking function first suspends all the other threads of the current process. After the\nhook is set, the threads are resumed.\n\nThis model: suspending -> hooking -> resuming is also typical for the MinHook library\n[(example: functions Freeze and Unfreeze from MinHook are responsible for suspending](https://github.com/TsudaKageyu/minhook/blob/8fda4f5481fed5797dc2651cd91e238e9b3928c6/src/hook.c#L307)\nand resuming threads.\n\n_Reporting to the main component_\n\nAfter the hooking is done, the malware establishes the connection to the local server, that is\nrun by the main instance of the malware (implanted in msiexec). The connection is made to\nsend the information recorded via hooks to the central component.\n\n\n-----\n\nExample: a captured screenshot (JPG) being sent via local socket:\n\nIt also ensures that the main instance is alive. In case if it has terminated, all the hooks are\nbeing removed.\n\n\n-----\n\n_Hook implementation - example:_\n\nStep 1. The hook installed at the beginning of the function redirects the execution to the\nfunction inside the bot32.dll:\n\n\n-----\n\nStep 2. Each time the hooked function (i.e. CertGetCertificateChain) is called, the\nexecution is redirected to the function inside the bot. The original function\n```\nCertGetCertificateChain will be called from inside, via additional shellcode containing a\n\n```\nsmall wrapper/trampoline function.\n\n\n-----\n\nThe content of the “trampoline” in the additionally allocated memory is presented below. It\nis a small wrapper containing the function’s prolog “stolen” from the original version,\nbefore it has been overwritten by the jump instruction:\n\nThat’s how the intercepting function still uses the original function\n```\nCertGetCertificateChain, and just adds a filter on the top of it.\n\n```\n**Functionality of the hooks**\n\n_user32.TranslateMessage_\n\n- The hook of the function user32.TranslateMessage:\n\nredirects into a function responsible for keylogging and making screenshots.\n```\nTranslateMessage is used by the GUI elements to process the events triggered by some\n\n```\nactions, such as refreshing of the component, moving a mouse etc. The malware has filters\n[set on two messages: WM_KEYDOWN and WM_LBUTTONDOWN - to monitor user typing or](https://docs.microsoft.com/en-us/windows/win32/inputdev/wm-keydown)\nclicking in the windows. Any other events - and also a WM_KEYDOWN event, if the pressed key\nwas ESCAPE - are being skipped, and the navigation goes back to the original\n```\nTranslateMessage function via trampoline.\n\n```\n\n-----\n\nOtherwise the malware proceeds to record what is happening on the screen: by capturing\nthe title of the active window, recording the keyboard state, and, eventually making a\nscreenshot showing the performed activity.\n\n\n-----\n\nCapturing the window title:\n\n\n-----\n\nProceeding to make a screenshot:\n\nThe collected information is filled into an internal buffer. The content of this buffer is later\nbeing then sent to the main component via the previously opened connection.\n\nAfter recording of the action finished, the execution goes back to the original\n```\nTranslateMessage function via trampoline.\n\n```\n_ntdll.NtCreateUserProcess_\n\n- The hook in ntdll.NtCreateUserProcess:\n\nredirects into a function that writes the payload into the process. First the redirection\nfunction executes the trampoline, and allows the new process to be created. Then, it\neventually implants the bot inside and executes it. Again, the Microsoft Edge is being\nskipped from this injection by the check on the created process’ name.\n\nAs before, the bot injects the copy of itself, yet its execution starts from another variant of\nEntry Point.\n\n\n-----\n\n[The redirection is done via changing the context ( SetThreadContext ) of the main thread of](https://github.com/hasherezade/demos/blob/master/inject_shellcode/src/patch_context.h#L6)\nthe newly created process.\n\n\n-----\n\nThe values highlighted red on the above image are the modifications of the original context\n[that was retrieved before. We can see the VA](https://stackoverflow.com/questions/2170843/va-virtual-address-rva-relative-virtual-address) of the implant’s Entry Point being written. VA:\n```\n0x61277 -> 0x31277 (Entry Point RVA) + 0x30000 (the implant Base Address).\n\n```\nThis redirection model uses the fact that in case if the process didn’t start yet, its original\nEntry Point is filled in a register (in case of a 32 bit process it is the register EAX). If we\noverwrite the EAX in the frozen thread’s context by the value of the implant’s Entry Point,\nthis will be the first address executed when the thread resumes.\n\nThis variant of the implant’s Entry Point is almost identical to the one described in the\nsection about the hooking implant. It also sets API hooks, communicates with the main\nmodule, etc. The only difference is that this function calls the Entry Point of the original\napplication afterwards. It happens because the injection model was a bit different than the\nformer case: now the process was just created, and it’s fresh context was changed, so its\noriginal Entry Point yet has to run.\n\nAs we can see, this hook allows the implant to propagate to newly created processes. Not\nonly the main module is responsible for injections - but each instance of the injected\npayload has the ability to inject itself further.\n\n_ntdll.NtCreateThread_\n\nThis hook is used to propagate the payload - analogically to hook at NtCreateUserProcess.\n\n_crypt32.CertVerifyCertificateChainPolicy_\n\nFor policies other than SSL (CERT_CHAIN_POLICY_SSL) uses the original version of the\nfunction. For SSL, it cleans the error flag unconditionally, approving any certificate as valid.\n\n_crypt32.CertGetCertificateChain_\n\nAccept the certificate unconditionally.\n\n\n-----\n\nFirst the original function CertGetCertificateChain is called via trampoline. The\n[retrieved CERT_CHAIN_CONTEXT is modified in such a way that its status is always set as](https://docs.microsoft.com/en-us/windows/win32/api/wincrypt/ns-wincrypt-cert_chain_context)\nvalid:\n```\nTrustStatus.dwErrorStatus -> CERT_TRUST_NO_ERROR\nTrustStatus.dwInfoStatus -> CERT_TRUST_IS_PEER_TRUSTED\n\n```\n_ntdll.ZwDeviceIoControlFile_\n\nThis function is used to bypass the traffic generated by the browsers through the local\nproxy.\n\nHook on this function is very common in case of malware intercepting network traffic. It is\nbecause ZwDeviceIoControlFile is a low level function that is called from the well-known\nwinsocks functions, such as connect, send, recv, etc. With the help of\n```\nZwDeviceIoControlFile those functions communicate with afd.sys (Ancillary Function\n\n```\n[Driver) that executes the network operations.](https://www.file.net/process/afd.sys.html)\n\nThe function prototype:\n```\nNTSYSAPI NTSTATUS ZwDeviceIoControlFile(\n HANDLE      FileHandle,\n HANDLE      Event,\n PIO_APC_ROUTINE ApcRoutine,\n PVOID      ApcContext,\n PIO_STATUS_BLOCK IoStatusBlock,\n ULONG      IoControlCode,\n PVOID      InputBuffer,\n ULONG      InputBufferLength,\n\n```\n\n-----\n\n```\n PVOID      OutputBuffer,\n ULONG      OutputBufferLength\n);\n\n```\nOne of the passed parameters is an IOCTL number for the driver. This number identifies\nthe operation that will be requested.\n\nThe malware is interested only in two IOCTLS: 0x12007 -> AFD_CONNECT (Connect) and\n```\n0x120C7 -> AFD_X32_CONNECT (SuperConnect). If any other is used, the execution returns\n\n```\nback to the original version of the ZwDeviceIoControlFile, via dedicated trampoline.\n\nAt the moment when this IOCTL is sent, the driver establishes the connection with the\nremote host, the address of which is given in the input buffer. If the malware replaces the\naddress of the remote host with the address of its own, the connection will be established\nwith the local proxy instead.\n\nBut before the function decides it the traffic should be bypassed in a particular case, some\nadditional checks are being made.\n\nFor example, only connections at port 80 (HTTP) and 443 (HTTPS) are intercepted.\n\n\n-----\n\nFinally, the host is being replaced:\n\nBut the function does not end on this, but also verifies the result of\n```\nZwDeviceIoControlFile. If establishing the connection to the proxy was not successful, the\n\n```\nimplant will try to troubleshoot the issue. First it tries to connect to the main component of\nthe malware. If the server is not responding, it means that probably the main component\n\n\n-----\n\nwas killed or crashed. In order to not draw the attention of the victim by preventing further\nconnections, the hook is removed.\n\n### Man-In-The-Browser local proxy\n\nAmong the main features of the malware there is formgrabbing as well as webinjects. The\nfirst feature allows attackers to steal data from the open browser windows. The other\nfeature allows them to modify the content of websites displayed to the victim.\n\n[In order to be able to perform those actions, the malware has to deploy a Man-In-The-](https://en.wikipedia.org/wiki/Man-in-the-browser)\n[Browser](https://en.wikipedia.org/wiki/Man-in-the-browser) (MITB) attack, (which is a variant of Man-In-The-Middle). As mentioned before, in\norder to do this, the malware has to install its own (fake) certificate, and to run a local\nproxy. This part is done by the main bot component, running in the msiexec - while the\ncomponent implanted into browsers is responsible for redirecting traffic via this proxy. In\nsome browsers, additional hooks are being installed, which are responsible for pretending\nthat the certificate is valid.\n\nIn the previous sections, we focused on the hooks. In this section we will focus on how this\nproxy is implemented on the side of the main bot.\n\n\n-----\n\n**Deploying the proxy**\n\nIn the main function of the core bot component we can find a function responsible for\nrunning the proxy in a new thread:\n\nLet’s enter this thread's start routine.\n\nAt the beginning, the malware has to load additional DLLs that are going to be used: zlib1\nand libssl. The zlib library will be needed for encoding and decoding the gzip\ncompressed traffic, while libssl will be responsible for certificate management, and\nencryption of HTTPS traffic. Both of those libraries are among the modules of the malware,\nand they are going to be loaded in the same manner as others: decrypted from the\nencrypted module, and then manually loaded.\n\nAfter this initial step is done, malware tries to find and load the certificate that was\npreviously installed. It is also saved in the encrypted form. If loading the certificate was not\nsuccessful, it will try to generate a new one, and then save it in the appropriate data\ncontainer.\n\n\n-----\n\nAfter the certificate is initialized, the malware will run the local proxy server, using this\ncertificate for traffic encryption.\n\nAfter that it will read and delete the cache of Firefox, and of Chrome.\n\n\n-----\n\nWhile in Chrome and Internet Explorer the validation of certificates is performed via\nhooking, in Firefox it cannot be implemented in the same way. That’s why, in this case, the\ncertificate will be just installed in the local store. First malware enumerates the certificates\nthat are already in the store, to check if the installation is required. If the malware’s\ncertificate was not found, it will drop and run certutil.exe that performs the installation.\n\nThe installation is run in a loop that is executed till success.\n\n\n-----\n\nWe can see the certutil commands being deployed here - the same that we observed during\nbehavioral analysis.\n\n\n-----\n\n```\n9b2b0,\"\\certutil.exe\"\n9b250,\"cert9.db\"\n9b2d0,\"\\\"%s\\\" -A -n \\\"%s\\\" -t \\\"C,C,C\\\" -i \\\"%s\\\" -d \\\"%s\\\"\"\n9b330,\"\\\"%s\\\" -A -n \\\"%s\\\" -t \\\"C,C,C\\\" -i \\\"%s\\\" -d sql:\\\"%s\\\"\"\n\n```\nThe dropped certificate is being added into Firefox's cert9.db.\n\n\n-----\n\n**Inside the proxy**\n\nTwo parallel threads are run, one serving as a proxy for HTTP, and another for HTTPS\ntraffic.\n\nThe proxy parses the traffic that passes through - that’s why it needs to decompress the\nresponses that are gzip compressed. After parsing (and eventually modifying, in case of\nwebinjects) it is compressed back.\n\n\n-----\n\nThe grabbed content is being stored in the report that is first saved into a local file (using\nappropriate path in %APPDATA%, from the malware’s directory structure).\n\nThose files are then uploaded to the C2, by another thread.\n\n### Stealer functionality\n\nIn addition to grabbing information directly from the browsers via MITB attack, this bot\ncan work as a classic stealer, retrieving and uploading the data saved on the disk. The\nstolen data is copied into a report, which is further uploaded to the C2.\n\nOne of the threads run by the main function is responsible for stealing cookies, saved\ncredentials, and files. The actions that are accumulated in this thread, can be also executed\nseparately, on demand, by deploying dedicated remote commands.\n\n\n-----\n\nSince the early versions of the bot, the cookies and credentials were stolen from Firefox\nand Chrome. Newer versions introduced improvements, by supporting Chrome version 80\nand above, and also targeting Outlook credentials.\n\nThe described analysis of this functionality will be focused on version 1.2.23, which was\nthe latest at the time of writing.\n\nSince in the process of stealing the local SQL databases are going to be queried, the bot has\nto load its sqlite3.dll. It is done at the beginning of the stealing function:\n\nIf the loading of this module has failed, the stealing will not continue, and the information\nabout the failed attempt will be saved in the report which is going to be uploaded to the C2.\n\n**Stealing from Outlook**\n\nA new addition to the bot is the capability of stealing outlook credentials.\n\n\n-----\n\n[The presented methods are similar to the ones described here. The relevant registry keys](https://securityxploded.com/outlookpasswordsecrets.php)\nbeing queried:\n```\n696e0,\"Software\\Microsoft\\Internet Account Manager\\Accounts\"\n69750,\"Identities\"\n696e0,\"Software\\Microsoft\\Internet Account Manager\\Accounts\"\n69766,\"Outlook\"\n69780,\"Software\\Microsoft\\Internet Account Manager\"\n697e0,\"\\Accounts\"\n69800,\"Software\\Microsoft\\Office\\Outlook\\OMI Account Manager\\Accounts\"\n69880,\"Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows Messaging\nSubsystem\\Profiles\\Microsoft Outlook Internet Settings\"\n69970,\"Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows Messaging\nSubsystem\\Profiles\\Outlook\"\n69a30,\"Software\\Microsoft\\Office\\15.0\\Outlook\\Profiles\\Outlook\"\n69766,\"Outlook\"\n\n```\n**Stealing Chrome passwords**\n\nThe malware steals saved Chrome credentials. First, it searches the \\Google\\Chrome\\User\n```\nData directory.\n\n```\nThe retrieved database is queried by the following SQL query:\n```\nselect `origin_url`, `username_value`, `password_value` FROM logins\n\n```\n\n-----\n\nThe URL, username, and password are saved into the report that is further uploaded to the\nC2.\n\nIn the version 1.0.8 of the bot (the previous analyzed), only one method was used for\ndecoding the password. It just retrieved the data from Login Data and decrypted it with\nthe DPAPI encryption system.\n\n\n-----\n\nDecrypting the password:\n\nSince this method doesn’t work for the Chrome >= v80, no surprise that the author pushed\nthe update in the next releases.\n\nFollowing the update in Chrome, first the encryption key must be retrieved from Local\n```\nState (more details described here). The encrypted_key is fetched from JSON.\n\n```\n\n-----\n\nCurrently two methods for decrypting the passwords are used: DPAPI encryption system\nfor the older Chrome versions, and AES256-GCM algorithm for the newer.\n\n\n-----\n\n[The retrieval of the Chrome passwords is similar to the one described here.](https://xenarmor.com/how-to-recover-saved-passwords-google-chrome/)\n\n**Stealing Chrome cookies**\n\nStealing of the Chrome cookies again starts by searching the \\Google\\Chrome\\User Data\ndirectory. When found, the Cookies file is retrieved.\n\n\n-----\n\nThe retrieved database is queried with the following SQL query:\n```\nselect `host_key`, `name`, `encrypted_value`, `path`, `expires_utc`, `is_secure`,\n`is_httponly` from `cookies`\n\n```\nAs it was in case of passwords, also in case of cookies the decryption will differ in old and\nnew (>=80) versions of Chrome. Decoding of cookies follows analogical paths: the updated\nbot will use DPAPI encryption system for the older Chrome versions, and AES256-GCM\nalgorithm for the newer.\n\nIn order to not block access to the files, the Chrome process may be terminated.\n\n\n-----\n\n**Stealing Firefox cookies**\n\nThe other targeted browser is Firefox. The template of the stealing function is similar like\nin the case of Chrome. First the directory is being searched. This time it is\n```\n\\Mozilla\\Firefox\\Profiles. The name of the file containing the SQL database with\n\n```\ncookies is cookies.sqlite.\n\n\n-----\n\nThe retrieved database is queried with the following SQL query:\n```\nselect `host`, `name`, `value`, `path`, `expiry`, `isSecure`, `isHttpOnly`,\n`sameSite` from `moz_cookies`\n\n```\n**Stealing files**\n\nStealing files is deployed in a new thread.\n\nFirst the list of all the dives is being fetched:\n\nThen, for each drive a new thread is being deployed, responsible for searching files at this\ndrive.\n\n\n-----\n\nAmong the targets are wallets for cryptocurrencies:\n\nBut also documents, that are searched by extensions: .txt, .docx, .xls\n\n\n-----\n\nThe files are first copied to the directory in the %TEMP% folder, and further uploaded by\nanother thread.\n\n\n-----\n\nThe function for stealing documents didn’t seem to evolve across the compared versions.\n\n## Comparison\n\nAs mentioned before, the described Silent Night Zbot is based on ZeuS legacy. There is an\nongoing naming confusion between this Zbot and the other ZeuS-based malware that have\nbeen popular in recent years, such as Sphinx or Terdot.\n\nIn this chapter we will sum up the most important similarities and differences between\nthose specific families.\n\nThe reference material:\n\n1. The classic ZeuS source-code\n2. The Terdot analysis papers:\n\n- [Terdot: Zeus-based malware strikes back with a blast from the past - by Bogdan](https://labs.bitdefender.com/2017/11/terdot-zeus-based-malware-strikes-back-with-a-blast-from-the-past/)\nBotezatu and Eduard Budaca from Bitdefender\n\n- [Zbot with legitimate applications on board - by Hasherezade from Malwarebytes](https://blog.malwarebytes.com/cybercrime/2017/01/zbot-with-legitimate-applications-on-board/)\n3. Terdot Zbot samples:\n\n- 611d0954c55a7cb4471478763fe58aa791dc4bbf345d7b5a96808e6d1d264f96 loader (unpacked)\n\n– bd44645d62f634c5ca65b110b2516bdd22462f8b2f3957dbcd821fa5bdeb38a2\n\n       - payload.dll\n– f76e614723432398d1b7d2c4224728204b3bd9c5725e8200a925e8cbf349344\nc - client32.dll\n4. ZeuS Sphinx samples:\n\n- 07ff5290bca33bcd25f479f468f9a0c0371b3aac25dc5bb846b55ba60ca658ed original sample (packed)\n\n– 2890ba2b242191f762e8f480a854d4b8985593935157026f3984df07071d8b6\n3 - unpacked core\n– 4c150ec8583d9455eb6f64020bb8dbe0267ba94e76e5c19e9c2389457979f103\n\n      - Tor module\n\n### Silent Night (SN) vs classic ZeuS\n\nSimilarities:\n\n  - Definitions of webinjects typical for ZeuS\n\n  - Similar set of commands, and their format\n\n  - Similar format of configuration storage\n\n  - [Similar pseudo-random names generator](https://github.com/hshrzd/Zeus/blob/translation/source/common/malwaretools.cpp#L21)\n\n  - [Usage of RC4, CRC32, Visual Encrypt](https://github.com/hshrzd/Zeus/blob/translation/source/common/crypt.cpp)\n\n  - [Encrypted strings - separate function for ANSI and Unicode. Yet, the algorithm in](https://github.com/hshrzd/Zeus/blob/c55a9fa8c8564ec196604a59111708fa8415f020/source/client/cryptedstrings.cpp#L285)\n\n[ZeuS code is different from the one used in Silent Night.](https://github.com/hshrzd/Zeus/blob/c55a9fa8c8564ec196604a59111708fa8415f020/source/client/cryptedstrings.cpp#L285)\n\n  - Usage of random padding\n\n  - Hook on TranslateMessage in order to deploy on-click screenshot and keylogging\n\n\n-----\n\n  - Hooks in NtCreateThread and NtCreateUserProcess for the purpose of propagation\n\ninto new processes\n\n  - Functionality: backconnect, VNC\n\n  - Similar server-side backconnect component\n\nIn the leaked ZeuS version (2.0.8.9), the cookie stealing component is not implemented,\nhowever the code contains a placeholder for it, while both Silent Night and Terdot have it\nimplemented.\n\nThe original ZeuS code also contains API hooks that are not present in Silent Night.\n\n### Sphinx overview\n\n[Sphinx is a Zbot using Tor. It’s first version (1.0.0.0) was released in 2015. The sample that](https://securityaffairs.co/wordpress/39592/cyber-crime/sphinx-variant-zeus-trojan.html)\nwe used for the comparative analysis\n[(07ff5290bca33bcd25f479f468f9a0c0371b3aac25dc5bb846b55ba60ca658ed), tries to](https://www.virustotal.com/gui/file/07ff5290bca33bcd25f479f468f9a0c0371b3aac25dc5bb846b55ba60ca658ed/detection)\nconnect to the URL: kdsk3afdiolpgejs.onion/sphinx/config.bin in order to fetch config.\n\n[It doesn’t use API obfuscation. Strings are obfuscated by the algorithms typical for ZeuS.](https://github.com/hshrzd/Zeus/blob/c55a9fa8c8564ec196604a59111708fa8415f020/source/client/cryptedstrings.cpp#L285)\n\nIn contrast to Silent Night, and Terdot, Sphinx doesn’t need to download the main\ncomponent - it is shipped directly inside the initial executable. In the .data section of the\nmodule, there is yet another PE - UPX packed (used for Tor connections). This is a very\ndifferent model than in case of Silent Night, where each and every module is downloaded\nfrom the C2, and then kept in a separate, encrypted file.\n\nThe main component\n[(2890ba2b242191f762e8f480a854d4b8985593935157026f3984df07071d8b63) is](https://www.virustotal.com/gui/file/2890ba2b242191f762e8f480a854d4b8985593935157026f3984df07071d8b63/detection)\ninjected into explorer.exe (differently than Silent Night, where it is injected into\nmsiexec.exe). Sphinx runs and infects two instances of explorer.exe.\n\nOne of the instances is run without any parameters. The other’s command-line is:\n```\nexplorer.exe socksParentProxy=localhost:9050 - suggesting that this instance is\n\n```\nconnecting to the local proxy at the given port. Indeed we can find this port open in the first\ninstance.\n\nAs most of the ZeuS based malware, it uses %APPDATA% as its base directory. It creates\nthere subfolders:\n\n\n-----\n\nThe directories in %APPDATA% are used for the purpose of keeping its modules, as well as\nthe stolen data, in encrypted form.\n\n\n-----\n\nAs in the case of Silent Night and Terdot, it creates the key under\n```\nHKCU\\Software\\Microsoft.\n\n```\nThe original sample is copied into a new folder created in %APPDATA%, and the original\ncopy is deleted by a batch file, dropped in a %TEMP% directory (i.e. tmp07810f8b.bat).\n```\n@echo off\n:d\ndel \"C:\\Users\\tester\\Desktop\\<initial_sample>.exe\"\nif exist \"C:\\Users\\tester\\Desktop\\<initial_sample>.exe\" goto d\ndel /F \"C:\\Users\\tester\\AppData\\Local\\Temp\\tmp07810f8b.bat\"\n\n```\nPersistence is achieved by the registry key, leading to the copy of the original sample,\ndropped in the new directory, in %APPDATA%.\n\nOnce it is run, it injects the main bot into other processes, and hooks API. The hooking done\nby Sphinx is very invasive - many more API hooks are being installed than in case of Terdot\nor Silent Night. The listing of detected hooks is given below.\n\n\n-----\n\n[Hooks found](https://github.com/hasherezade/pe-sieve/wiki/3.1.-Investigating-hooks-and-patches) in explorer.exe:\n\nRedirections to the main component of the malware, injected at 1830000:\n\nIn ntdll.dll:\n```\n45778;NtCreateUserProcess->19f4ed5[19e0000+14ed5:(unnamed):1];5\n622b8;LdrLoadDll->19f4ffe[19e0000+14ffe:(unnamed):1];5\n\n```\nIn ws2_32.dll\n```\n3918;closesocket->19f5ed8[19e0000+15ed8:(unnamed):1];5\n4406;WSASend->19f5f31[19e0000+15f31:(unnamed):1];5\n6f01;send->19f5f10[19e0000+15f10:(unnamed):1];5\n\n```\nIn wininet.dll:\n```\n1a33e;HttpQueryInfoA->19f7d16[19e0000+17d16:(unnamed):1];5\n1ab49;InternetCloseHandle->19f7c1e[19e0000+17c1e:(unnamed):1];5\n1b406;InternetReadFile->19f7c61[19e0000+17c61:(unnamed):1];5\n25e5d;InternetQueryDataAvailable->19f7cea[19e0000+17cea:(unnamed):1];5\n2ba12;HttpSendRequestW->19f7a3e[19e0000+17a3e:(unnamed):1];5\n34a3d;HttpSendRequestExW->19f7ae6[19e0000+17ae6:(unnamed):1];5\n4ae46;InternetReadFileExA->19f7ca0[19e0000+17ca0:(unnamed):1];5\n91812;HttpSendRequestExA->19f7b82[19e0000+17b82:(unnamed):1];5\n918f8;HttpSendRequestA->19f7a92[19e0000+17a92:(unnamed):1];5\n\n```\n\n-----\n\nIn crypt32.dll\n```\n90ddc;PFXImportCertStore->19f536e[19e0000+1536e:(unnamed):1];5\n\n```\n_This hook in crypt32.PFXImportCertStore is present in original ZeuS code, but neither in_\n_Terdot, nor in Silent Night._\n\nIn user32.dll\n```\n476b;SwitchDesktop->19f6933[19e0000+16933:(unnamed):1];5\n5c39;OpenInputDesktop->19f68e3[19e0000+168e3:(unnamed):1];5\n6293;RegisterClassExA->19f6d41[19e0000+16d41:(unnamed):1];5\n9dc7;GetCapture->19e9a62[19e0000+9a62:(unnamed):1];5\na4b3;GetCursorPos->19e9934[19e0000+9934:(unnamed):1];5\na575;GetUpdateRect->19eb6e5[19e0000+b6e5:(unnamed):1];5\nbb1c;DefWindowProcA->19f6997[19e0000+16997:(unnamed):1];5\nbc6a;RegisterClassA->19f6ca2[19e0000+16ca2:(unnamed):1];5\ned4a;RegisterClassW->19f6c55[19e0000+16c55:(unnamed):1];5\n10162;RegisterClassExW->19f6cef[19e0000+16cef:(unnamed):1];5\n11899;GetMessageA->19e9b29[19e0000+9b29:(unnamed):1];5\n119a5;PeekMessageA->19e9b7c[19e0000+9b7c:(unnamed):1];5\n11b3c;CallWindowProcW->19f6b87[19e0000+16b87:(unnamed):1];5\n12d57;GetDCEx->19eb5cc[19e0000+b5cc:(unnamed):1];5\n14ab7;GetWindowDC->19eb666[19e0000+b666:(unnamed):1];5\n1507d;DefWindowProcW->19f6951[19e0000+16951:(unnamed):1];5\n15421;ReleaseDC->19eb6a5[19e0000+b6a5:(unnamed):1];5\n1544c;GetDC->19eb627[19e0000+b627:(unnamed):1];5\n15d14;BeginPaint->19eb51c[19e0000+b51c:(unnamed):1];5\n15d42;EndPaint->19eb58c[19e0000+b58c:(unnamed):1];5\n1634a;PeekMessageW->19e9b51[19e0000+9b51:(unnamed):1];5\n164c7;TranslateMessage->19f1cda[19e0000+11cda:(unnamed):1];5\n1cde8;GetMessageW->19e9b01[19e0000+9b01:(unnamed):1];5\n22ba7;GetClipboardData->19f1e40[19e0000+11e40:(unnamed):1];5\n271e4;DefDlgProcA->19f6a23[19e0000+16a23:(unnamed):1];5\n3150a;DefMDIChildProcW->19f6afb[19e0000+16afb:(unnamed):1];5\n3152b;DefFrameProcW->19f6a69[19e0000+16a69:(unnamed):1];5\n31c07;GetUpdateRgn->19eb778[19e0000+b778:(unnamed):1];5\n325b7;DefFrameProcA->19f6ab2[19e0000+16ab2:(unnamed):1];5\n325db;DefMDIChildProcA->19f6b41[19e0000+16b41:(unnamed):1];5\n32bd3;CallWindowProcA->19f6bd0[19e0000+16bd0:(unnamed):1];5\n35bc1;DefDlgProcW->19f69dd[19e0000+169dd:(unnamed):1];5\n36703;GetMessagePos->19e9902[19e0000+9902:(unnamed):1];5\n36932;SetCapture->19e99b8[19e0000+99b8:(unnamed):1];5\n369f2;ReleaseCapture->19e9a12[19e0000+9a12:(unnamed):1];5\n4c1b0;SetCursorPos->19e997b[19e0000+997b:(unnamed):1];5\n\n```\nIn kernel32.dll\n```\n4273d;GetFileAttributesExW->19f50e7[19e0000+150e7:(unnamed):1];5\n\n```\n\n-----\n\nAs we can see, the hooks installed are very different than in case of Silent Night, and they\nsuggest different mechanics behind this malware.\n\n### Silent Night (SN) vs Terdot\n\nSimilarities:\n```\nC - common for various malware families\nZ - found in ZeuS code, common for ZeuS-based malware\nT - found in Terdot, but not in original ZeuS code\n\n```\n|Category|Silent Night & Terdot|\n|---|---|\n|Data storage|subkeys in HKCU\\Software\\Microsoft (T), encrypted files in %APPDATA%\\<random directory> (Z)|\n|Bot ID|in format %s_%08X%08X, generated by the same algorithm: hostname (string) and a number generated with InstallDate and DigitalProductID read from the registry. CRC32 algorithm applied. (Z)|\n|Encryption algorithms|Visual Encrypt (Z) and RC4 (Z,C)|\n|Key to encrypt files|RC4 context stored in the installation data in the registry|\n|Webinjects definitions|ZeuS-styled (Z)|\n|MitM proxy|yes, HTTP and HTTPS with a custom certificate (Z,C)|\n|installation of the certificate|in Firefox: by certutil.exe, in other browsers: by hooking API|\n|Hooks in the browsers|The same APIs hooked within in the browsers, analogical functionality of the hooks (T) : crypt32.CertVerifyCertificateChainPolicy , crypt32.CertGetCertificateChain, ntdll.ZwDeviceIoControlFile - redirect to the local MitM proxy|\n|Hook implementation|Using MinHook library [1]|\n|Stealing cookies|Chrome , Mozilla - yet, using different queries [2]|\n\n\n-----\n\n1. Terdot (client32.dll) using MinHook library:\n\n2. Queries used by Terdot versus queries used by Silent Night:\n\nTerdot:\n```\nselect `host_key`, `name`, `encrypted_value` from `cookies`\nselect `baseDomain`, `name`, `value` from `moz_cookies`\n\n```\nSilent Night:\n```\nselect `host_key`, `name`, `encrypted_value`, `samesite`, `path`,\n`expires_utc`, `is_secure`, `is_httponly` from `cookies`\nselect `host`, `name`, `value`, `path`, `expiry`, `isSecure`, `isHttpOnly`,\n`sameSite` from `moz_cookies`\n\n```\nDifferences:\n\n|Category|Silent Night|Terdot|\n|---|---|---|\n|Persistence|Run key leading to the loader executable (plain PE)|A. Run key leading to the loader executable (plain PE) ; B. Entry in StartMenu leading to the PHP script, which is run by a dropped php.exe. The script deobfuscates and runs the initial component, which is never stored on the disk as a plain PE.;|\n|Obfuscation|API, strings, arithmetic operations, added redundant calls|strings (similar algorithm like classic Zeus), many strings are in plain-text|\n|SQL module|manually loaded sqlite3.dll|statically linked SQLite|\n|SSL module|manually loaded libssl.dll|statically linked OpenSSL|\n|Zlib module|manually loaded zlib1.dll|statically linked Zlib 1.2.5|\n\n\n-----\n\n|Names of components|loader-bot32.dll/.exe, antiemule-loader- bot32.dll/.exe - loader ; bot32/64.dll - core|payload.dll - loader ; client32/64.dll - core|\n|---|---|---|\n|Injection order|msiexec.exe(bot- loader.exe/.dll) -> msiexec.exe(bot32/64.dll) - > browsers and other processes (bot32/64.dll)|explorer.exe(payload.dll) - >msiexec.exe(client32.dll) -> browsers and other processes (client32.dll)|\n|DGA|based on a current date (year, month, day of the week, day); 20 characters long; 32 domains generated|based on a current date (year, month, day); 16 characters long; 128 domains generated; different algorithm than SN|\n|Verification of downloaded modules|checksum only|RSA signature, validated with hardcoded public key|\n|Targeted browsers|iexplore.exe, chrome.exe, firefox.exe,|iexplore.exe, microsoftedgecp.exe, chrome.exe, opera.exe, firefox.exe, WebKit2WebProcess.exe|\n|Watchdog|No|Yes, in explorer.exe|\n|Commands|bot_uninstall, user_execute, user_cookies_get, user_cookies_remove, user_passwords_get, user_files_get, user_url_block, user_url_unblock|bot_uninstall, user_execute, bot_httpinject_disable, bot_httpinject_enable, user_url_block, user_url_unblock|\n|Heaven’s Gate|Yes, in a separate DLL|Yes, in the main component|\n\n\n### Comparison summary\n\nSilent Night bot is distinct from Terdot. Yet, the existing similarities go beyond the\nsimilarity that is obvious due to the common ancestor, ZeuS. They both use a model:\nZloader -> Zbot. The core module is being downloaded from the C2, and kept in encrypted\nform. Also the way in which they attack browsers has significant overlap: exactly the same\nhooks are being set, and the implementation of the intercepting functions is analogical.\nThere exists a possibility that the author of Silent Night was also familiar with Terdot’s\ncode, or involved in its development. Those two Zbots have many similarities on a\nconceptual level, but in comparison to Terdot, Silent Night is written with focus on\nmodularity, and well obfuscated.\n\nSphinx is different from both of them, and probably based on an unrelated fork of ZeuS.\n\n\n-----\n\n## C2 Communication\n\n_[You can try this yourself by using the zLoader communications Jupyter notebook for CP 1.0.8.](https://github.com/prsecurity/zloader_c2_comms/blob/master/zloader_comms.ipynb)_\n\n### Communication encryption\n\nThe bot talks to C2 over an encrypted channel. There are two types of encryption used:\n\n- RC4\n\n- Visual Encrypt\n\nVisual Encrypt is simply XORing each character of the string with the preceding XORed\ncharacter:\n```\ndef v_encrypt(data):\n  _len = len(data)\n  for x in range(_len):\n    data[x] = data[x] ^ data[x-1]\n  return data\n\n```\nRegular bot’s communications are encrypted with both RC4 and Visual Encrypt, while the\nbinaries use plain RC4.\n\n### The message composition\n\nThe message contains the header and the body. Currently, the header only stores the md5\nhash of the message body.\n\nThe body is further split into records. Each record contains a header with the following\nfields:\n\n- Record ID\n\n- Unused\n\n- Body Length\n\n- Unused\n\nExample of code creating a complete message:\n```\ndef pack_data(data):\n  body = []\n  for record_id, content in data.items():\n    record_header = struct.pack('IIII', record_id, 0, len(content), 0)\n    body.append(record_header + content)\n  finished_body = b''.join(body)\n  header = b''.join([b'0'*(md5_size), hashlib.md5(finished_body).digest()])\n  return b''.join([header, finished_body])\n\n```\n\n-----\n\n### Record IDs\n\nRecord IDs are randomly generated per panel version and stored in core/gen.php, for\nexample CP 1.0.18 defines the following fields:\n```\nCOMP_ID_MAX_CHARS = 100\nBOTNET_MAX_CHARS = 20\nMARKER_MAX_CHARS = 20\nGATE_MAX_CHARS = 64\nMAX_NUM_GATES = 10\nMAX_SRC_PATH = 1000\nSBCID_BOT_ID = 10001\nSBCID_BOTNET = 10002\nSBCID_BOT_VERSION = 10003\nSBCID_NET_LATENCY = 10005\nSBCID_PING = 10006\nSBCID_OS_INFO = 10012\nSBCID_LANGUAGE_ID = 10013\nSBCID_PROCESS_NAME = 10014\nSBCID_PROCESS_USER = 10015\nSBCID_IPV4_ADDRESSES = 10016\nSBCID_IPV6_ADDRESSES = 10017\nSBCID_PROCESS_LIST = 10020\nSBCID_DEBUG = 10022\nSBCID_INTEGRITY_LEVEL = 10023\nSBCID_NUM_MONITORS = 10024\nSBCID_MARKER = 10025\nSBCID_MD5_BOT = 10026\nSBCID_TIMEZONE = 10027\nSBCID_NET_INFO = 10028\nSBCID_BUILD_ID = 10029\nSBCID_MD5_WEBINJECTS = 10030\nSBCID_SCRIPT_ID = 11000\nSBCID_SCRIPT_STATUS = 11001\nSBCID_SCRIPT_RESULT = 11002\nSBCID_SCRIPTS = 11003\nSBCID_COUNT_SCRIPTS = 11004\nSBCID_ADV_SERVERS = 11010\nSBCID_WEBFILTERS = 11011\nSBCID_WEBINJECTS = 11012\nSBCID_HTTP_PROXY = 11013\nSBCID_GET_FILE = 11014\nSBCID_GET_FILE_VER = 11015\nSBCID_INJECT_STATUS = 11016\nCSR_BOT_FILE = 1000\nCSR_BOT64_FILE = 1001\nCSR_LIBSSL_FILE = 1002\nCSR_SQLITE_FILE = 1003\nCSR_ZLIB_FILE = 1004\nCSR_NSS_FILE = 1005\n\n```\n\n-----\n\n```\nCSR_BOT32_FILE = 1006\nCSR_HVNC32_FILE = 1007\nCSR_HVNC64_FILE = 1008\nSBCID_LOADER_UPDATE = 11020\nSBCID_LOADER_UPDATE_SUCCESS = 11021\nSBCID_WEBINJECTS_UPDATE = 11022\nSBCID_WEBINJECTS_UPDATE_SUCCESS = 11023\nSBCID_LOG_ID = 11030\nSBCID_LOG_ID_EXT = 11031\nSBCID_LOG_ERR_CODE = 11032\nSBCID_LOG_MSG = 11033\nSBCID_BC_IP = 11040\nSBCID_BC_CLIENTPORT = 11041\nSBCID_BC_HVNC_CLIENTPORT = 11042\nSBCID_NUM_REPORTS = 100000\nSBCID_BOTLOG = 200000\nSBCID_BOTLOG_TYPE = 300000\nSBCID_SOURCE = 400000\nSBCID_TITLE = 500000\nSBCID_TIME_SYSTEM = 600000\nSBCID_TIME_TICK = 700000\nSBCID_TIME_LOCALBIAS = 800000\nBLT_UNKNOWN = 0\nBLT_HTTP_REQUEST = 1\nBLT_HTTPS_REQUEST = 2\nBLT_GRABBED_HTTP = 3\nBLT_FILE = 5\nBLT_COOKIES = 6\nBLT_KEYLOGER = 7\nBLT_PASSWORD = 8\nBLT_SCREENSHOT = 9\nBLT_SOFTWARE_MAIL = 10\nCSR_POST_MAX_SIZE = 10\nCSR_BACKCONNECT_CRYPT_KEY = 0x55\nLOG_ID_LOADER_UPDATE = 1\nLOG_ID_WEBINJECTS_UPDATE = 3\nLOG_ID_INSTALL_NSS_CERT = 4\nLOG_ID_CHECK_POST_MAX_SIZE = 5\nLOG_ID_BOT_DETECTED = 6\nLOG_ID_PELOADER = 7\nLOG_ID_PROCESS_INJECT = 8\nLOG_ID_STEALER = 9\nLOG_ID_COLLECTOR = 10\nPROCESS_INTEGRITY_UNKNOWN = 0\nPROCESS_INTEGRITY_LOW = 1\nPROCESS_INTEGRITY_MEDIUM = 2\nPROCESS_INTEGRITY_HIGH = 3\n\n```\n\n-----\n\nSpecifically, the following types of messages are processed based on the gate’s logic:\n\nAlways set:\n\n- `SBCID_BOT_ID`\n\n- `SBCID_BOTNET`\n\nNew Bot:\n\n- `SBCID_OS_INFO`\n\n- `SBCID_BOT_VERSION`\n\n- `SBCID_IPV4_ADDRESSES`\n\n- `SBCID_PROCESS_LIST`\n\n- `SBCID_INTEGRITY_LEVEL`\n\n- `SBCID_NUM_MONITORS`\n\n- `SBCID_MARKER`\n\n- `SBCID_MD5_BOT`\n\n- `SBCID_TIMEZONE`\n\n- `SBCID_WEBINJECTS`\n\nScript Report:\n\n- `SBCID_SCRIPT_ID`\n\n- `SBCID_SCRIPT_STATUS`\n\n- `SBCID_SCRIPT_RESULT`\n\nReport:\n\n- `SBCID_BOTLOG_TYPE`\n\n- `SBCID_SOURCE`\n\n- `SBCID_TITLE`\n\n- `SBCID_BOTLOG`\n\nFile request:\n\n- `SBCID_GET_FILE`\n\n- `SBCID_GET_FILE_VER`\n\nLog:\n\n- `SBCID_LOG_ID`\n\n- `SBCID_LOG_ID_EXT`\n\n- `SBCID_LOG_ERR_CODE`\n\n- `SBCID_LOG_MSG`\n\nPing:\n\n- `SBCID_PING`\n\n\n-----\n\n### Response padding\n\nTo further randomize the signal, each response from the C2 is padded with a random\nstring:\n\n## Traffic analysis\n\nIn this section we will follow a flow of a typical network traffic generated by the Zbot, and\nshow how to decrypt the particular parts.\n\n### Downloading elements\n\nFirst, the loader element beacons to the C2, in the attempt to download the core bot. Then,\nthe core bot is loaded and run. It establishes its own connection with the C2: downloads\nfurther modules, and runs a thread that is responsible for data exfiltration.\n\n\n-----\n\nThe first request sent to the C2 is a beacon. It is encrypted with RC4 (key#2) and Visual\nEncrypt. After decryption we can see its content:\n\nIt contains the following elements: header, data, and a random buffer (of random size). The\nrandom buffer is used only as a padding. The hash of the data buffer is stored in the header.\n\nThe data is composed of records, which carry various meanings. Each record a header, and\nis identified by its specific ID. The fragment of the panel’s code responsible for processing it\nis given below. The length of the item header is 16 bytes (4 DWORDs).\n```\n$list = array();\nfor ($i = HEADER_SIZE; $i < $dataSize; ) {\n  $k = unpack(\"L4\", substr($data, $i, ITEM_HEADER_SIZE));\n  $itemSize = $k[3];\n  $item = substr($data, $i + ITEM_HEADER_SIZE, $itemSize);\n  $itemId = $k[1];\n  $list[$itemId] = $item;\n  $i += (ITEM_HEADER_SIZE + $itemSize);\n}\n\n```\nIn the presented packet the following items are present: Botnet ID, Bot ID, and a ping item\n(this request is identified as a ping). Compare the IDs with the complete list available in the\nearlier part of this report: C2 Communication: Record IDs.\n\n\n-----\n\n_Fields marked in red represent the record ID. Fields marked in light blue represent content_\n_size. The content size is followed by the content_\n\nAfter processing the items, the decision is taken should the bot be given C2 response. There\nare several criteria used to decide if the bot is blacklisted. The deciding factors are: the\ncountry, the IP, or the bot ID.\n```\nif (!CheckAllowCountry($country) ||\n     CheckBlockCountry($country) ||\n     CheckBlockIp($ipStr) ||\n     CheckBlockBot($botId))\n{\n  SaveLog(\"Block bot {$botId}, {$country}, {$ipStr}\");\n  die();\n}\n\n```\nIf the bot was not blacklisted, the C2 responds to the beacon with a buffer that is also\nencrypted with RC4 (key#2) and Visual Encrypt. The decrypted content contains a similar\nheader and eventual data, and is padded with a buffer of random characters:\n\nThe presented packet does not carry any data, and is used as a “keep-alive” message for the\nbot.\n\n\n-----\n\nAfter that the malware sends another request, formatted and encrypted by the same\npattern like the previous one:\n\nThis time it is a request for a module:\n\n_Fields marked in red represent the record ID. Fields marked in light blue represent content_\n_size. The content size is followed by the content: marked in dark blue._\n\nThe C2 responds sending the first PE module. This time the response is encrypted with RC4\nonly. Decrypted buffer contains the PE per-pended with a 21 bytes long header (containing:\nthe module ID (DWORD), the module version (DWORD), ? (DWORD), the size of the PE\n(DWORD), and the CRC32 of the PE (DWORD) which is used for the verification), and one\nNULL byte for padding:\n\n\n-----\n\nThe same cycle (when the malware sends a request, and C2 responds with a particular\nmodule) repeats till all the modules are downloaded.\n\nIn between, the bot downloads also a configuration file for the webinjects. This file is\nencrypted with RC4 + Visual Encrypt.\n\n\n-----\n\n[The content of webinjects.txt follows the standard introduced by ZeuS. After the file](https://gist.github.com/hshrzd/7032d8239d76a5512470a2bc3da1d85f#file-webinjects-txt)\ncontent there is a “keep-alive” content appended.\n\n\n-----\n\n### Data exfiltration\n\nAfter all the modules are downloaded, the traffic contains mostly the exchange ping-keep\nalive, bot’s reports about performed actions, and exfiltrated data. This time the traffic\nbetween the bot and the C2 is all the time encrypted by the same manner as the beacons:\nRC4 (key #2) + Visual Encrypt.\n\nSample overview of the captured traffic:\n\nEach time after the report from the bot was received, C2 responds with a “keep alive”\npacket:\n\nExamples of some interesting reports given below.\n\n\n-----\n\nA path of the target file: Firefox certificate database:\n\n\n-----\n\nReport about a successful injection into Explorer:\n\nList of active processes:\n\n\n-----\n\nInformation if the Cookies database was not found:\n\nA longer report containing: 1) stolen Firefox cookies\n\n\n-----\n\n2) a series of screenshots in JPEG format (each screenshot has a fixed size 500 x 500\n\npixels)\n\n\n-----\n\n3) the title of the active window:\n\nThose exfiltration operations work in a loop, deployed in one of the threads. In addition to\nthis, malware can receive and execute commands from the C2, deploying some of those\noperations on demand.\n\n## Panel\n\nWe will review the latest Control Panel available at the time of writing version 1.0.18 by\ninstalling it locally and looking at its capabilities.\n\n### Installation\n\nTwo interesting features to note:\n\n1. Username Admin is constant\n2. RC4 encryption key is set during install and remains constant by design (unless\nsomeone changes through DB). This is useful because Zloader samples can be\nclustered based on RC4 keys in the same fashion we cluster Emotet samples on public\nkeys. At the end of this paper we provide a list of all C2s grouped by RC4 keys found in\nthe samples for the past 4 month.\n\n\n-----\n\n### Bot config\n\nTo experience the panel, we need a bot. The easiest way to get one is to replace the config\nin an existing sample. There are two types of payloads that you may encounter, the general\nbuild and unique private builds for premium customers (who pay $4k/month).\n\n\n-----\n\nFor the sample version 1.2.23, the general built has the config at offset 0x29c08 and the\nconfig RC4 key at the offset 0x29ef7:\n\n[Regardless of the version, the config can be easily decoded and replaced with cyberchef.io:](https://gchq.github.io/CyberChef/#recipe=From_Hex('Auto'/disabled/breakpoint)RC4(%7B'option':'UTF8','string':'ydxcqilakhhdexevnzce'%7D,'Hex','Latin1')To_Hexdump(16,true,false)&input=MEYwMzdCRkU1OEI2MEQ1MDQ3OEQwNzIyODU1Q0EwNTY4Qzg4QThCQTI3NDUyMDMxMEUzRTk3RjQ3RTE4MjBEQUIzQ0M1MDg4RkFGNTgwOEN)\n\n\n-----\n\n### Stats\n\nThe statistics window shows typical data points for all malware, such as number of bots,\nmarkers, etc.\n\n\n-----\n\n### Bots\n\nIn addition to the typical bot info, Silent Night also collects network information by running\nand saving the output of the following commands:\n```\nipconfig /all\nnet config workstation\nnet view /all\nnet view /all /domain\nnltest /domain_trusts\nnltest /domain_trusts /all_trusts\n\n```\nThe bot collects the process list, and allows you to launch SOCKS5/HVNC services via its\nbackconnect server. Interestingly, the port for them is generated at random from C2 and\nfed to the bot, so in theory, you can tell the bot to open up any port on the backconnect\nserver.\n\n\n-----\n\n### Backconnect\n\n\n-----\n\n### Tasks\n\n Reports\n\nThe reports are geared towards banking theft. The reports could be of HTTP/S traffic, key\nlogs, screenshots, cookies, passwords and mail. Reports could be filtered by botnets, bots,\ntitles, keywords and dates. The functionality is somewhat inconvenient, for example there\nis now way to go directly from a bot check-in to its reports.\n\n\n-----\n\n### Webinjects\n\n\n-----\n\n### Jabber\n\nThe panel admin can choose to be notified via Jabber about certain events. Triggers could\nbe online status of a bot, arrival of any or specific logs from any or specific bots.\n\n### Panel config\n\nThe panel configuration is really the bot configuration. Builder address, license key,\ntimeout and C2 addresses are fairly straightforward. It’s important to note that the bot can\nonly communicate via HTTP/S, so if your network requires proxy authentication for web\ntraffic, the bot simply won’t be able to ping back to the C2 (as of version 1.2.25). Thanks to\n[sS55752750](https://twitter.com/sS55752750) for pointing this out.\n\n\n-----\n\n### Domain Generation Algorithm\n\nNewer releases of Silent Night also support a Domain Generation Algorithm.\n\n\n-----\n\nThe DGA is a function of a date (timestamp) and the bot’s encryption key. Below is PHP\ncode that generates one sample:\n```\nfunction dga2($timestamp, $encryption_key) {\n  $domain = pack(\"L\", $timestamp); \n  CsrRc4Crypt($domain, $encryption_key);\n  $ipWPG = unpack(\"L\", $domain);\n  $packed_timestamp_1 = $packed_timestamp_2 = $ipWPG[1];\n  $oAXrC = '';\n  $counter = 0;\n  while ($counter < 20) {\n    $char = 97 + abs($packed_timestamp_1 % 25);\n    $oAXrC .= chr($char);\n    $packed_timestamp_1 += $char;\n    if ($packed_timestamp_1 > 0xffffffff) {\n      $packed_timestamp_1 &= 0xffffffff;\n      $packed_timestamp_1 ^= $packed_timestamp_2;\n      ++$counter;\n    } else {\n      $packed_timestamp_1 ^= $packed_timestamp_2;\n      ++$counter;\n    }\n  }\n  var_dump(\"{$oAXrC}.com\");\n}\n\n```\n\n-----\n\n### Builder\n\n Updater\n\n\n-----\n\n### Blacklist\n\n Users\n\nThe Users menu allows for granular user permission management. Potentially, this allows\npanel owners to delegate tasks or sell access to their bots, which makes each C2 a\ncollaborative environment.\n\n\n-----\n\nThe command and control panel is written in PHP. The version that is distributed to the\n[clients is obfuscated with YAK Pro.](https://github.com/pk-fr/yakpro-po)\n\n\n-----\n\n## Conclusion\n\nThe bot has been designed using the ZeuS code as a template, yet, a lot of work has been\nput into its modification and modernization. Conceptually, it is very close to Terdot, yet\nrewritten with an improved, modular design. We don’t have enough data to say if the\nauthor of Silent Night was previously involved in developing Terdot, or just got inspiration\nfrom it. What we can say is that not all similarities among those two come from the\ncommon ancestor, ZeuS.\n\nThe design of Silent Night is consistent and clean, the author’s experience shows\nthroughout the code. Yet, apart from the custom obfuscator, there is not much novelty in\nthis product. The Silent Night is not any game changer, but just yet another banking Trojan\nbased on ZeuS.\n\nBased on the analysis of the bot’s configurations, we may confidently say that there is more\nthan one customer of the “Silent Night”. However, comparing the frequency of new builds\n(based on the variations of the config files) and the different level of sophistication between\nthe actors, we can say that some users are more proficient than others.\n\nConsidering the absence of activity on the exploit.in thread where the bot was originally\nsold and the success of previous campaigns, we predict with moderate confidence an\nevolution of the bot from something that anyone with a budget can buy, into a vehicle for\none group to conduct banking theft at scale.\n\n\n-----\n\n## Client Clusters and IoCs\n\nBy extracting the configs from the samples and clustering the C2 addresses around RC4\nkeys, we were able to discover 20 unique C2 panels. Below is the list of RC4 keys and\nassociated C2 addresses.\n\n### 41997b4a729e1a0175208305170752dd\n\n- ldhly[.]com/wp-parser.php\n\n- 185.180.198[.]32/abbyupdater.php\n\n- todiks[.]xyz/milagrecf.php\n\n- liangzizhineng[.]cn/wp-parser.php\n\n- zgpqjzwrb[.]pw/gravitels.php\n\n- lifeprimary[.]site/wp-parser.php\n\n- botiq[.]xyz/milagrecf.php\n\n- nmttxggtb[.]press/wp-config.php\n\n- gdexordsb[.]icu/wp-config.php\n\n- hwbblyyrb[.]pw/wp-config.php\n\n- aquolepp[.]pw/milagrecf.php\n\n- vfgthujbxd[.]xyz/milagrecf.php\n\n- bhajkqmd[.]xyz/milagrecf.php\n\n- heartsmobileautorepair[.]com/redir.php\n\n- hormonas[.]comegico[.]com[.]mx/wp-parser.php\n\n- rswtgmhf[.]pw/wp-config.php\n\n- cristinneese[.]xyz/gravitels.php\n\n- apprdlbtb[.]pw/wp-config.php\n\n- fwgdhdln[.]icu/wp-config.php\n\n- dcaiqjgnbt[.]icu/wp-config.php\n\n- xyajbocpggsr[.]site/wp-config.php\n\n- gynrhcoe[.]pw/wp-config.php\n\n\n-----\n\n- heartsmobileautorepair[.]com/123.php\n\n- zoraokorol[.]xyz/gravitels.php\n\n- xaprgnve[.]icu/wp-config.php\n\n- www.wuaiwan[.]cn/wp-content/uploads/2020/04/123.php\n\n- eoieowo[.]casa/wp-config.php\n\n- marlodubberly[.]xyz/gravitels.php\n\n- horatiobrotherton[.]xyz/gravitels.php\n\n- dierdreswensson[.]xyz/gravitels.php\n\n- rizoqur[.]pw/milagrecf.php\n\n- home[.]comegico[.]com[.]mx/wp-parser.php\n\n- soficatan[.]site/milagrecf.php\n\n- jewellerydesigns[.]co[.]za/wp-parser.php\n\n- nncpsedsb[.]host/wp-config.php\n\n- wlqaqife[.]icu/wp-config.php\n\n- ooygvpxrb[.]pw/wp-config.php\n\n- kuaxbdkvbbmivbxkrrev[.]com/wp-config.php\n\n- artiealtiery[.]xyz/gravitels.php\n\n- axelerode[.]club/stuck.php\n\n- jzfozxqe[.]site/gravitels.php\n\n- ydmfemfe[.]pw/gravitels.php\n\n- pqayjeenbbt[.]icu/wp-config.php\n\n- nurgsozebt[.]pw/wp-config.php\n\n- axelerode[.]host/stuck.php\n\n- msrtuhctb[.]pw/wp-config.php\n\n- japanjisho[.]info/wp-parser.php\n\n- blazeseher[.]xyz/gravitels.php\n\n- gavrelets[.]ru/wp-parser.php\n\n\n-----\n\n- dhteijwrb[.]host/milagrecf.php\n\n- brewaz[.]club/milagrecf.php\n\n- verobani[.]website/milagrecf.php\n\n- maxbiler.dk/wp-parser.php\n\n- basorkiq[.]host/milagrecf.php\n\n- ltuywjafbt[.]icu/wp-config.php\n\n- heartsmobileautorepair[.]com/redir.php\n\n- brihutyk[.]xyz/abbyupdater.php\n\n- avnjila[.]website/stuck.php\n\n- dxdeedle[.]host/gravitels.php\n\n- hopime[.]com/wp-parser.php\n\n- twinsors[.]xyz/gravitels.php\n\n- bwambztl[.]xyz/milagrecf.php\n\n- irfanhaber[.]net/wp-parser.php\n\n- rubense[.]xyz/milagrecf.php\n\n- lgepubbf[.]icu/wp-config.php\n\n- 933988[.]com[.]tw/redir.php\n\n- dcgljuzrb[.]pw/wp-config.php\n\n- siloban[.]pw/milagrecf.php\n\n- fflxcsbtb[.]pw/wp-config.php\n\n- tepbfiafbtt[.]pw/wp-config.php\n\n- luckystatus[.]com/wp-parser.php\n\n- lesson.musicentrance[.]com/wp-parser.php\n\n- ch.theblissbinder[.]com/wp-smart.php\n\n- buhjike[.]host/milagrecf.php\n\n- jtppbycsb[.]space/wp-config.php\n\n- glsunzdf[.]casa/wp-config.php\n\n\n-----\n\n- barbeyo[.]xyz/milagrecf.php\n\n- leaben[.]pw/milagrecf.php\n\n- ajvwdjtebb[.]pw/wp-config.php\n\n- wgyvjbse[.]pw/milagrecf.php\n\n### dvjh7gIy78g3biuh7wgvH8gFJSHF87HI\n\n- 62.109.2[.]250/gate.php\n\n### 34v5436b4356b4564561\n\n- far.spargroarr[.]org/tv/x.php\n\n- roo.purcererya[.]org/tv/x.php\n\n- far.spargroarr[.]org/tv/x.php\n\n- roo.purcererya[.]org/tv/x.php\n\n### s4sd!@dss2QW11sdsdsa\n\n- adslsticker[.]world/click.php\n\n- adslstickerf1[.]world/click.php\n\n- 213.155.31.199/wwp/gate.php\n\n- adslstickerfone[.]world/click.php\n\n- adslstickerf[.]world/click.php\n\n### Dkj9DsjvyAdue\n\n- ffclubs[.]net/erors.php\n\n- iphonexr[.]top/erors.php\n\n- vipstore.pp.ua/erors.php\n\n- vitog502[.]live/erors.php\n\n- iphonexsmax[.]top/erors.php\n\n- vitog502.digital/erors.php\n\n- calife[.]best/erors.php\n\n- happyiphoneusr[.]top/erors.php\n\n- vitog502[.]life/erors.php\n\n- bluecheese[.]top/erors.php\n\n\n-----\n\n- vitog502[.]world/erors.php\n\n### 326_M*8*~;2s3252G\n\n- www.deephousesets1.de/music.php\n\n- www.eurodancehitslatm.de/music.php\n\n- www.trancepartysets.de/music.php\n\n- www.danceeruohitslatm.de/music.php\n\n### 90f1e19e2306648e9e22059d47f36016\n\n- 45.72.3[.]132/web7643/gate.php\n\n### 03d5ae30a0bd934a23b6a7f0756aa504\n\n- kasfajfsafhasfhaf[.]com/web/gate.php\n\n- dsdjfhdsufudhjas[.]com/web/gate.php\n\n- dsjdjsjdsadhasdas[.]com\n\n- dskdsajdsahda[.]info/gate.php\n\n- kdsidsiadsakfsas[.]com\n\n- dsjadjsadjsadjafsa[.]info/gate.php\n\n- oajdasnndkdahm[.]com/web/gate.php\n\n- kasfajfsafhasfhaf[.]com\n\n- idisaudhasdhasdj[.]com\n\n- kdsidsiadsakfsas[.]com/gate.php\n\n- jdafiasfjsafahhfs[.]com\n\n- fdsjfjdsfjdsdsjajjs[.]info/gate.php\n\n- dksadjsahnfaskmsa[.]com/gate.php\n\n- dsjdjsjdsadhasdas[.]com/web/gate.php\n\n- iloveyoubaby1[.]pro/gate.php\n\n- dasifosafjasfhasf[.]com\n\n- idisaudhasdhasdj[.]com/web/gate.php\n\n- oajdasnndkdahm[.]com/web/gate.php\n\n- fdsjfjdsfjdsjfdjsfh[.]com/web/gate.php\n\n\n-----\n\n- idisaudhasdhasdj[.]com/gate.php\n\n- dasifosafjasfhasf[.]com/web/gate.php\n\n- dsdjfhd9ddksaas[.]pro/gate.php\n\n- fslakdasjdnsasjsj[.]com/gate.php\n\n- dsdjfhdsufudhjas[.]com/gate.php\n\n- fdsjfjdsfjdsdsjajjs[.]com/web/gate.php\n\n- dskdsajdsadasda[.]info/gate.php\n\n- fdsjfjdsfjdsjfdjsfh[.]com\n\n- 188.127.226[.]197/gate.php\n\n- dsjdjsjdsadhasdas[.]com/gate.php\n\n- oajdasnndkdahm[.]com/gate.php\n\n- idsakjfsanfaskj[.]com/gate.php\n\n- idisaudhasdhasdj[.]info/gate.php\n\n- djsadhsadsadjashs[.]pro/gate.php\n\n- dasifosafjasfhasf[.]com/gate.php\n\n- dsdjfhdsufudhjas[.]pro/gate.php\n\n- oajdasnndkdahm[.]com\n\n- fdsjfjdsfjdsdsjajjs[.]com/gate.php\n\n- kdsidsiadsakfsas[.]com/web/gate.php\n\n- jdafiasfjsafahhfs[.]com/gate.php\n\n- dsdjfhdsufudhjas[.]com\n\n- dsdjfhdsufudhjas[.]info/gate.php\n\n- kasfajfsafhasfhaf[.]com/gate.php\n\n- fsakjdsafasifkajfaf[.]pro/gate.php\n\n- dskjdsadhsahjsas[.]info/gate.php\n\n- jdafiasfjsafahhfs[.]com/web/gate.php\n\n- fdsjfjdsfjdsjfdjsfh[.]com/gate.php\n\n\n-----\n\n- fdsjfjdsfjdsdsjajjs[.]com\n\n### M9ihiu7887n78n\n\n- bdr.ubibancaa[.]host/stat.php\n\n- bdr.ubibancaa[.]website/stat.php\n\n- 185.185.24[.]49/gate.php\n\n- bdr.ubibanca[.]pro/stat.php\n\n- bdr.ubibancaa[.]space/stat.php\n\n- bdr.ubibanca[.]xyz/stat.php\n\n- bdr.ubibancaa[.]fun/stat.php\n\n### hZRk7754w3VPlf\n\n- dij49jf39fjd340d[.]com/jbYm9bt/NlGkb4ivk.php\n\n- qwd8s3j8s23h8s[.]com/jbYm9bt/NlGkb4ivk.php\n\n- sldeodjiweiswi[.]com/jbYm9bt/NlGkb4ivk.php\n\n- 23d8s23hs89j239sj23[.]com/jbYm9bt/NlGkb4ivk.php\n\n- 40j9f2j9sj32ssoj[.]com/jbYm9bt/NlGkb4ivk.php\n\n- idjwidj8f4f5ge[.]com/jbYm9bt/NlGkb4ivk.php\n\n- 4f394j89d3j4d89j34d[.]com/jbYm9bt/NlGkb4ivk.php\n\n- 238ehs823s8h23[.]com/jbYm9bt/NlGkb4ivk.php\n\n- s28hs823hs823js[.]com/jbYm9bt/NlGkb4ivk.php\n\n- js823hs23js[.]com/jbYm9bt/NlGkb4ivk.php\n\n- d823hrd9239sdj2[.]com/jbYm9bt/NlGkb4ivk.php\n\n- sifeiwdjiesde[.]com/jbYm9bt/NlGkb4ivk.php\n\n- ifjedssofllvcr[.]com/jbYm9bt/NlGkb4ivk.php\n\n- wd23h8qsh8qhs823qs[.]com/jbYm9bt/NlGkb4ivk.php\n\n- 3reh8rd23js9[.]com/jbYm9bt/NlGkb4ivk.php\n\n- d9j49dj923993[.]com/jbYm9bt/NlGkb4ivk.php\n\n- isfjiaaodwsoi[.]com/jbYm9bt/NlGkb4ivk.php\n\n\n-----\n\n- oidjweidj34rd3[.]com/jbYm9bt/NlGkb4ivk.php\n\n- mslfiedjssfdes[.]com/jbYm9bt/NlGkb4ivk.php\n\n### 981ojqJqpMamw2K2m191b742jq\n\n- j2888hennene[.]site/library/topikpost.php\n\n- islacangrejo[.]fun/library/topikpost.php\n\n- hostww.enne/gate1.php\n\n- hahwuUmkwioq[.]site/library/topikpost.php\n\n- thoughtlibrary[.]top/library/topikpost.php\n\n- host.ff/gate1.php\n\n- gertibaeronjdkwp[.]site/library/topikpost.php\n\n### f0feba219b4c1b7fc383fd65880dae50\n\n- representis[.]xyz/gate.php\n\n- representis[.]icu/gate.php\n\n### fkdoue9g3WE#g3233dgfd\n\n- givlonest[.]org/tv.php\n\n- givlonest[.]com/tv.php\n\n### kZieCw23gffpe43Sd\n\n- rehoterv[.]org/sound.php\n\n- hustlertest[.]com/sound.php\n\n- penaght[.]org/sound.php\n\n- brosmasters[.]com/sound.php\n\n- teslatis[.]org/sound.php\n\n- lonehee[.]com/sound.php\n\n- polild[.]org/sound.php\n\n- chorbly[.]org/sound.php\n\n- 2.57.38.157/sound.php\n\n- 217.138.205.135/sound.php\n\n- postgringos[.]com/sound.php\n\n\n-----\n\n- tarsilh[.]com/sound.php\n\n- soceneo[.]com/sound.php\n\n- nexycombats[.]com/sound.php\n\n- banssa[.]org/sound.php\n\n- mioniough[.]com/sound.php\n\n- sigmark[.]org/sound.php\n\n- horcinx[.]org/sound.php\n\n- dandycodes[.]com/sound.php\n\n- smoash[.]org/sound.php\n\n- adird[.]org/sound.php\n\n- sandyfotos[.]com/sound.php\n\n- penaght[.]org/sound.php\n\n- unwer[.]org/sound.php\n\n- dolax[.]org/sound.php\n\n- hesaista[.]org/sound.php\n\n- tilyn[.]org/sound.php\n\n- 162.241.70.164/sound.php\n\n- weako[.]org/sound.php\n\n- welefus[.]com/sound.php\n\n- gilantec[.]org/sound.php\n\n- rutom[.]org/sound.php\n\n- coult[.]org/sound.php\n\n- footmess[.]com/sound.php\n\n- finuclier[.]com/sound.php\n\n- flopperos[.]org/sound.php\n\n- tarynak[.]org/sound.php\n\n- detid[.]org/sound.php\n\n\n-----\n\n- zernel[.]org/sound.php\n\n- purots[.]com/sound.php\n\n- 185.236.202.226/sound.php\n\n- milsop[.]org/sound.php\n\n- hibsurf[.]com/sound.php\n\n- knalc[.]com/sound.php\n\n- pacallse[.]com/sound.php\n\n- greenrumba[.]com/sound.php\n\n- imosey[.]com/sound.php\n\n- perditta[.]org/sound.php\n\n- hinurs[.]org/sound.php\n\n- banog[.]org/sound.php\n\n- loots[.]org/sound.php\n\n- norpy[.]org/sound.php\n\n- zonaa[.]org/sound.php\n\n- shatskie[.]org/sound.php\n\n- surgued[.]com/sound.php\n\n- rarigussa[.]com/sound.php\n\n- aracp[.]org/sound.php\n\n- evahs[.]org/sound.php\n\n- eirry[.]org/sound.php\n\n- lildor[.]com/sound.php\n\n- rayonch[.]org/sound.php\n\n- retualeigh[.]com/sound.php\n\n- adran[.]org/sound.php\n\n- ginibenio[.]com/sound.php\n\n- bluslias[.]com/sound.php\n\n\n-----\n\n- calul[.]org/sound.php\n\n- vanagitah[.]com/sound.php\n\n- cersubego[.]com/sound.php\n\n- obeaf[.]com/sound.php\n\n- ficutept[.]com/sound.php\n\n- 185.236.202.235/sound.php\n\n- 51.83.171.27/sound.php\n\n- adandore[.]com/sound.php\n\n- peermems[.]com/sound.php\n\n- buhismus[.]com/sound.php\n\n- vacontd[.]com/sound.php\n\n- maremeo[.]com/sound.php\n\n- 185.236.202.146/sound.php\n\n- gorab[.]org/sound.php\n\n- geost[.]com/sound.php\n\n- smeack[.]org/sound.php\n\n- airnaa[.]org/sound.php\n\n- dentatox[.]org/sound.php\n\n- ciconuati[.]com/sound.php\n\n- finib[.]org/sound.php\n\n- smenard[.]com/sound.php\n\n- spensores[.]com/sound.php\n\n- itachaphi[.]com/sound.php\n\n- starterdatas[.]com/sound.php\n\n- ergensu[.]com/sound.php\n\n- pitinjest[.]org/sound.php\n\n- pitinjest[.]org/sound.php\n\n\n-----\n\n- ronswank[.]com/sound.php\n\n- klill[.]com/sound.php\n\n- 217.138.205.159/sound.php\n\n- tetraslims[.]com/sound.php\n\n- grually[.]com/sound.php\n\n- giril[.]org/sound.php\n\n- lotio[.]org/sound.php\n\n- naght[.]org/sound.php\n\n- baatiot[.]com/sound.php\n\n- stagolk[.]com/sound.php\n\n- 162.241.115.242/sound.php\n\n- etized[.]org/sound.php\n\n- veckeard[.]com/sound.php\n\n- rhald[.]org/sound.php\n\n- disrelure[.]com/sound.php\n\n- zelacarths[.]com/sound.php\n\n- trebitmore[.]org/sound.php\n\n- spardanos[.]com/sound.php\n\n- invesund[.]org/sound.php\n\n- tirdo[.]org/sound.php\n\n- emearibys[.]com/sound.php\n\n- watae[.]org/sound.php\n\n- 217.138.205.136/sound.php\n\n- namilh[.]com/sound.php\n\n- fotonums[.]com/sound.php\n\n- teamper[.]org/sound.php\n\n- sentspiels[.]com/sound.php\n\n\n-----\n\n- fibulu[.]org/sound.php\n\n- adobe[.]com/sound.php\n\n- postxer[.]com/sound.php\n\n- kodray[.]org/sound.php\n\n- pheia[.]com/sound.php\n\n- lipurf[.]com/sound.php\n\n- bunap[.]org/sound.php\n\n- tremood[.]com/sound.php\n\n### Ts72YjsjO5TghE6m\n\n- shotroot[.]xyz/data.php\n\n### JuXbeO5P20ewnefR4LZ81NIOZIc80IN\n\n- 124331[.]com/success.php\n\n- 209711[.]com/process.php\n\n- baj3tu[.]xyz/image.php\n\n- mayinakh[.]xyz/plugins.php\n\n- 106311[.]com/comegetsome.php\n\n- baj3tu[.]xyz/thread.php\n\n- 105711[.]com/docs.php\n\n### q23Cud3xsNf3\n\n- april30x3domain[.]com/post.php\n\n- iawfqecrwohcxnhwtofa[.]com/post.php\n\n- nmqsmbiabjdnuushksas[.]com/post.php\n\n- cmmxhurildiigqghlryq[.]com/post.php\n\n- march262020[.]store/post.php\n\n- march262020[.]best/post.php\n\n- pwkqhdgytsshkoibaake[.]com/post.php\n\n- march262020[.]site/post.php\n\n- march262020[.]tech/post.php\n\n\n-----\n\n- onfovdaqqrwbvdfoqnof[.]com/post.php\n\n- ojnxjgfjlftfkkuxxiqd[.]com/post.php\n\n- marchadvertisingnetwork3[.]com/post.php\n\n- marchadvertisingnetwork6[.]com/post.php\n\n- fyratyubvflktyyjiqgq[.]com/post.php\n\n- wmwifbajxxbcxmucxmlc[.]com/post.php\n\n- nmqsmbiabjdnuushksas[.]com/post.php\n\n- marchadvertisingnetwork[.]com/post.php\n\n- march262020[.]club/post.php\n\n- april30domain[.]com/post.php\n\n- marchadvertisingnetwork10[.]com/post.php\n\n- marchadvertisingnetwork9[.]com/post.php\n\n- march262020[.]network/post.php\n\n- cmmxhurildiigqghlryq[.]com/post.php\n\n- fvqlkgedqjiqgapudkgq[.]com/post.php\n\n- march262020[.]online/post.php\n\n- marchadvertisingnetwork4[.]com/post.php\n\n- marchadvertisingnetwork8[.]com/post.php\n\n- marchadvertisingnetwork2[.]com/post.php\n\n- march262020[.]live/post.php\n\n- fyratyubvflktyyjiqgq[.]com/post.php\n\n- march262020[.]com/post.php\n\n- marchadvertisingnetwork5[.]com/post.php\n\n- snnmnkxdhflwgthqismb[.]com/post.php\n\n- nlbmfsyplohyaicmxhum[.]com/post.php\n\n- marchadvertisingnetwork7[.]com/post.php\n\n\n-----\n\n### 82732qpweiowe82782732qpweiowe827\n\n- erbscactus[.]at/noagate.php\n\n- representis[.]icu/noagate.php\n\n- interurbanpu[.]at/noagate.php\n\n- representis[.]xyz/noagate.php\n\n### das32hfkAN3R2TCS\n\n- czadvokat[.]info/gate.php\n\n- 195.154.119[.]165/gate.php\n\n- akrisko[.]info/gate.php\n\n- penaz[.]info/gate.php\n\n- advokat-hodonin[.]info/gate.php\n\n### Dg3k4u3rUyEwXQsak4u3rU\n\n- insceos[.]com/post.php\n\n- grimberks[.]com/post.php\n\n- monbrase[.]com/post.php\n\n- plemopomps[.]com/post.php\n\n- pearlsolutionis[.]com/post.php\n\n- onregcan[.]com/post.php\n\n- pressrealbox[.]com/post.php\n\n\n-----\n\n## About us\n\nMalwarebytes\n\nMalwarebytes is a cybersecurity company that millions worldwide trust. Malwarebytes proactively protects\npeople and businesses against malicious threats, including ransomware, that traditional antivirus solutions\nmiss. The company’s flagship product uses signature-less technologies to detect and stop a cyberattack before\n[damage occurs. Learn more at www.malwarebytes.com.](http://www.malwarebytes.com/business)\n\nHYAS\n\nFounded by a team of world-renowned security researchers, analysts and entrepreneurs, HYAS enables\nenterprises to detect and mitigate cyber risks before attacks happen and identify the adversaries behind\nthem. HYAS Insight is a threat intelligence and attribution platform that improves visibility and productivity\nfor analysts, researchers and investigators while vastly increasing the accuracy of their findings. HYAS Protect\nuses domain-based intelligence and attribution at the DNS layer to proactively and preemptively protect\nenterprises from cyberattacks, independent of protocol or attack vector. Utilized by multiple Fortune 100\nenterprises, HYAS fundamentally changes how companies counter, hunt, find, and identify adversaries,\nenabling a proactive approach that allows enterprises to identify adversaries specifically targeting them. For\n[more information about HYAS, visit www.hyas.com.](https://www.hyas.com/)\n\nCopyright © 2020, Malwarebytes. All rights reserved. Malwarebytes and the Malwarebytes logo are\ntrademarks of Malwarebytes. Other marks and brands may be claimed as the property of others. All\ndescriptions and specifications herein are subject to change without notice and are provided without\nwarranty of any kind.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://resources.malwarebytes.com/files/2020/05/The-Silent-Night-Zloader-Zbot_Final.pdf"
    ],
    "report_names": [
        "The-Silent-Night-Zloader-Zbot_Final.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1590714996,
    "ts_modification_date": 1590714996,
    "files": {
        "pdf": "https://archive.orkl.eu/19f54a38d2ed9761f4ee9d7f70a06619eb453df1.pdf",
        "text": "https://archive.orkl.eu/19f54a38d2ed9761f4ee9d7f70a06619eb453df1.txt",
        "img": "https://archive.orkl.eu/19f54a38d2ed9761f4ee9d7f70a06619eb453df1.jpg"
    }
}