{
    "id": "3722d82c-71ca-4d09-b0d8-1db79520bd00",
    "created_at": "2023-01-12T15:02:17.671979Z",
    "updated_at": "2025-03-27T02:06:02.122313Z",
    "deleted_at": null,
    "sha1_hash": "b6c9e8d6d9783bfb9d50a1aa8004883447df44e3",
    "title": "2021-07-15 - What is Cyber Threat Intelligence-",
    "authors": "",
    "file_creation_date": "2022-05-29T01:31:18Z",
    "file_modification_date": "2022-05-29T01:31:18Z",
    "file_size": 3111277,
    "plain_text": "# What is Cyber Threat Intelligence?\n\n**gca.isa.org/blog/what-is-cyber-threat-intelligence**\n\n[All Posts](https://gca.isa.org/blog/all)\n\n[Tweet](https://twitter.com/share)\n\n_This blog is the first in a three-part series defining Cyber Threat Intelligence (CTI). The_\n_second part features an in-depth explanation of practical uses for the Diamond Model in CTI_\n_[analysis. The third part covered recent activity in Dragos Threat Groups.](https://gca.isa.org/blog/recent-activity-in-dragos-tracked-activity-groups)_\n\nCyber Threat Intelligence blends traditional intelligence operations and analysis techniques\nwith current issues in cybersecurity. [Threat intelligence is knowledge—or the outcome of an](https://www.dragos.com/wp-content/uploads/Industrial-Control-Threat-Intelligence-Whitepaper.pdf)\nanalytic process using hypothesis-led and evidence-based analysis from a variety of data\nsources. Cybersecurity for this research will be defined as all that encompasses the\ntechnical, sociological, and psychological aspects of cyber threats today. Traditional\nintelligence operations and analysis is comprised of both theoretical and practical aspects. At\nits core, intelligence focuses on collecting information and synthesizing it into actionable data\nfor policymakers or organizations.\n\n\n-----\n\n## Traditional Intelligence vs. Cyber Threat Intelligence as a Discipline\n\nTraditional intelligence typically falls into two distinct categories: Strategic and Tactical. Both\nderive information for policymakers to assist in the complex international relations decisionmaking process. Strategic intelligence is the production of short and long publications, which\npolicymakers use for such decision-making. Tactical (operational) intelligence is the\ncollection of information from the field used to answer specific questions in what is commonly\nknown as the intelligence community.\n\nCyber Threat Intelligence is categorized into three types: Tactical, Operational, and Strategic.\nCTI uses a third category, tactical, to describe the technical indicators and behaviors used to\ninform network level action and remediation. Operational intelligence is the work threat\nhunters and incident responders perform to catalogue adversary behavior, advise holistic\nremediation, and show examples of threat hunting processes. Finally, strategic threat\nintelligence places threats into a business context and describes the calculated impact,\n[informing risk management and organizational direction.](https://www.dragos.com/wp-content/uploads/Industrial-Control-Threat-Intelligence-Whitepaper.pdf)\n\nAll intelligence focuses on the collection of information to make informed decisions.\nSometimes in CTI this is referred to as “telemetry.” Telemetry is key in CTI, as it provides the\nbest picture of any given cyber event in real or near real-time. CTI collection is ever evolving,\nand many companies exist now that collect up-to-the-minute telemetry data.\n\nTradecraft used in cyberattacks or cyber breaches is key to mitigation. In this way, tradecraft\nused to construct [zero-day threats or](https://www.techopedia.com/definition/27451/zero-day-threat) [malware can, with the assistance of reverse](https://searchsecurity.techtarget.com/definition/malware)\nengineering, provide clues to the most efficient mitigation techniques. While traditional\nintelligence focuses on securing nations, CTI focuses on securing organizations and critical\ninfrastructure from breaches, attacks, and compromises.\n\nIt may seem like the two disciplines or paradigms are sufficiently different to exist on their\nown. However, traditional intelligence is the foundation of CTI, and as such, CTI benefits\nmuch from the classical definitions of traditional intelligence and the associated collection\nprocesses.\n\n## Elements of Cyber Threat Intelligence\n\n[According to Caltagirone, the four elements of good (cyber) threat intelligence are:](http://www.activeresponse.org/the-4-qualities-of-good-threat-intelligence/)\nCompleteness, Accuracy, Relevance, and Timeliness. Completeness means the analyst\nmust mine, research, and otherwise provide all relevant information to detect the threat in an\neffort to ultimately prevent it. Accuracy means success always outweighs errors and\nmistakes. Relevance means that the threat must be pertinent to the organization. Timeliness\nmeans that corrective actions must be broadcast quickly and to large audiences to prevent\nfurther intrusions or compromises.\n\n## The Diamond Model\n\n\n-----\n\n[Further research by Caltagirone shows that the Diamond Model provides an atomic event of](https://www.activeresponse.org/wp-content/uploads/2013/07/diamond.pdf)\nany intrusion activity. The Diamond model is composed of four core features: Adversary,\nInfrastructure, Capability, and Victim. Strictly speaking, if an analyst can find three of the four\naxes, the analyst should report it. But in practice, many CTI analysts report with only one or\ntwo axes defined. The model establishes a formal method applying scientific principles to\nintrusion analysis—those of measurement, testability, and repeatability—providing a\ncomprehensive method of activity documentation, synthesis, and correlation.\n\n\n-----\n\nDr. Tom Winston\n\nDr. Tom Winston is a director of intelligence content for Dragos. Tom has over 25 years of\nprofessional experience in many areas to include cybersecurity, ICS/SCADA systems,\nCritical Infrastructure protection, academics as well as systems and network engineering. He\njoined Dragos after serving for several years as a professor of cybersecurity engineering at\nGeorge Mason University. Prior to that Tom served in a 15 year-long career at the CIA as an\noperations, digital forensics, and ICS/SCADA expert. His experience focused on threats to\ncritical infrastructure (ICS/SCADA) systems, as well as foreign cyber intelligence and threat\nanalysis. Tom has extensive experience in mobile device, removable/fixed media digital\nforensics, as well and has visited over 30 countries worldwide, and speaks over a dozen\nforeign languages.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-15 - What is Cyber Threat Intelligence-.pdf"
    ],
    "report_names": [
        "2021-07-15 - What is Cyber Threat Intelligence-.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535737,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653787878,
    "ts_modification_date": 1653787878,
    "files": {
        "pdf": "https://archive.orkl.eu/b6c9e8d6d9783bfb9d50a1aa8004883447df44e3.pdf",
        "text": "https://archive.orkl.eu/b6c9e8d6d9783bfb9d50a1aa8004883447df44e3.txt",
        "img": "https://archive.orkl.eu/b6c9e8d6d9783bfb9d50a1aa8004883447df44e3.jpg"
    }
}