{
    "id": "375c27d2-4307-4925-9664-f239a8ae71d4",
    "created_at": "2023-01-12T14:59:52.583243Z",
    "updated_at": "2025-03-27T02:05:31.202863Z",
    "deleted_at": null,
    "sha1_hash": "362371a94f2d692b18199dea315369bd7454b705",
    "title": "2020-12-03 - How to Beat Nefilim Ransomware Attacks",
    "authors": "",
    "file_creation_date": "2022-05-29T10:38:33Z",
    "file_modification_date": "2022-05-29T10:38:33Z",
    "file_size": 797548,
    "plain_text": "# How to Beat Nefilim Ransomware Attacks\n\n**[picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks](https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks)**\n\n### Keep up to date with latest blog posts\n\n## A Detailed Walkthrough of Nefilim Ransomware TTPs\n\nOver the course of 2020, the number of ransomware attacks has increased enormously. As an emerging ransomware\nfamily, Nefilim has caused dozens of high profile breaches since March 2020. In this blog post, we provide tactics,\ntechniques and procedures (TTPs) utilized by the Nefilim threat actors, since detecting and blocking TTPs used by a\nthreat is the most effective method to prevent that threat. TTPs allow us to detect potential intrusions and analyze the\nbehavior of those attempting to intrude.\n\nOur analysis uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) version 8\n[framework. See the ATT&CK for Enterprise version 8.1 for all referenced threat actor tactics and techniques.](https://attack.mitre.org/techniques/enterprise/)\n\nThis blog describes:\n\nTTPs used by the Nefilim ransomware, categorized under MITRE ATT&CK tactics and techniques.\nAn example threat in the Picus Threat Library that can be used to simulate the TTP.\nAn example mitigation rule in the Picus Mitigation Library that can be used to prevent/detect the given TTP.\n\n1. Initial Access\n\nAdversaries use Initial Access techniques to gain a foothold in the target network.\n\n**_1.1 MITRE ATT&CK T1190 Exploit Public-Facing Application_**\n\n\n-----\n\nNefilim operators exploit public facing applications for initial access. They mainly use the `CVE 2019 19781 Remote`\nCode Execution vulnerability affecting Citrix ADC/Gateway. Picus Threat Library includes 600+ vulnerability\nexploitation threats associated with the relevant CVE (Common Vulnerabilities and Exposures) identification number.\n\nFollowing threats in the Picus Threat Library can be used to simulate this TTP:\n\n**Threat ID** **Threat Name**\n\n321318 Citrix Application Delivery Controller (ADC) and Gateway Path Traversal Vulnerability Variant-1\n\n311195 Citrix Application Delivery Controller (ADC) and Gateway Path Traversal Vulnerability Variant-2\n\nFollowing mitigation signatures can be used to prevent CVE-2019-19781 exploitation:\n\n\n**Security**\n**Product**\n\nCheck Point\nNGFW\n\nCisco\nFirepower\nNGFW\n\n\n**Signature ID** **Signature Name**\n\nasm_dynamic_prop_CVE_2019_19781 Citrix Multiple Products Directory Traversal (CVE-201919781)\n\n1.52512.2, 1.52603.1 SERVER-WEBAPP Citrix ADC and Gateway arbitrary code\nexecution attempt\n\n\nF5 BIG-IP 200004998 Citrix NetScaler NSC_USER Remote Code Execution\n\n\nForcepoint\nNGFW\n\nFortiGate\nIPS\n\nFortiWeb\nWAF\n\nMcAfee\nNSP\n\nPalo Alto\nNetworks\nNGFW\n\nTippingPoint\nTPS\n\n\nHTTP_CRL-Citrix-Path-Traversal-CVE-2019-19781\n\n48653 Citrix.Application.Delivery.Controller.VPNs.Directory.Traversal\n\n090501033 Known Exploits\n\n0x45272800 HTTP: Citrix ADC Arbitrary Code Execution Vulnerability\n(CVE-2019-19781)\n\n57497 Citrix Application Delivery Controller And Gateway Directory\nTraversal Vulnerability\n\n36876 HTTP: Citrix Application Delivery Controller (ADC) Directory\nTraversal Vulnerability\n\n\n1. Execution\n\n**_2.1 MITRE ATT&CK T1106 Native API_**\n\nNefilim directly interacts with the native OS application programming interface ( API ) to execute behaviors\n\n\n-----\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n338852 Execution through API Attack Scenario 8418 New Process Creation via CreateProcess API Call\n\n1. Defense Evasion\n\n**_3.1 MITRE ATT&CK T1055 Process Injection_**\n\nThe Nefilim ransomware creates a new `wermgr.exe (the Windows error reporting manager) process and injects its`\n[payload to evade process-based defenses. You can read our process injection blog post for a detailed description of](https://www.picussecurity.com/blog/picus-10-critical-mitre-attck-techniques-t1055-process-injection?hsLang=en-gb)\nthis method.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n481103 Process Injection Attack Scenario 6443 Reflective Portable Executable Injection\n\n**_3.2 MITRE ATT&CK T1574.002 Hijack Execution Flow: DLL Side-Loading_**\n\nNefilim uses `WerFault.exe and` `wermgr.exe for DLL Side Loading, a defense evasion technique used by`\nadversaries to execute malicious payloads by hijacking the library manifest used to load DLLs. `Werfault.exe is the`\nWindows Error Reporting binary used by many different programs to report errors.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n286264 DLL Side-Loading by using Xwizard.exe 6042 Arbitrary DLL Load\n\n**_3.3 MITRE ATT&CK T1562.001 Impair Defenses: Disable or Modify Tools_**\n\nThe Nefilim ransomware uses a batch file to stop services and kill processes in the local host. This batch file abuses\n```\ntaskill.exe using CMD to kill predefined services and processes in the target host. Nefilim distributes this batch\n\n```\nfile to multiple hosts using two batch files. One of the batch files uses the ‘copy’ command, and the other one uses\nWMI with hard-coded admin credentials.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n650331 Stop Service Attack Scenario 8863 Critical Services Termination with TaskKill Tool\n\n**_3.4 MITRE ATT&CK T1070.004 Indicator Removal on Host: File Deletion_**\n\nNefilim removes itself from the target systems after infection with the following code:\n\ndel \"C:\\Users\\admin\\AppData\\Local\\Temp\\<ransomware_file_name>.exe\" /s /f /q\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n-----\n\n681453 Indicator Removal on Host Attack\nScenario\n\n\n6467 Defense Evasion by Windows Security Event Log\nDeletion\n\n\n**_3.5 MITRE ATT&CK T1497.003 Virtualization/Sandbox Evasion: Time Based Evasion_**\n\nNefilim uses the following ‘timeout’ command to delay the execution of the ‘del’ command. Adversaries use this\ncommand also to evade sandbox analysis.\n\n\"C:\\Windows\\System32\\cmd.exe\" /c timeout /t 3 /nobreak\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n744943 Virtualization/Sandbox Evasion by using Timeout\nCommand in Command-Line Tool\n\n1. Credential Access\n\n\n2313 Sandbox Evasion by Pausing The Command\nProcessor via Timeout Command\n\n\nNefilim threat actor uses hard-coded admin credentials to utilize PsExec and WMI to execute commands and binaries\nin remote hosts (lateral movement). Since these credentials are hard-coded in the batch files, it must be stolen before\nthe attack with some credential access techniques.\n\n**_4.1. MITRE ATT&CK T1056.001 Input Capture: Keylogging_**\n\nThe Nefilim ransomware creates a `DirectInput object using the` `DirectDrawCreateEx function to capture`\nkeystrokes.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n431235 Input Capture Attack Scenario 5924 User Input Capture via PowerShell Script\n\n**_4.2 MITRE ATT&CK T1003 OS Credential Dumping_**\n\nNefilim uses the Mimikatz tool to obtain username and password information useful in gaining access to additional\nsystems in the target network.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n393510 Credential Dumping using Mimikatz Tool 4920 Password and Hash Dump via Mimikatz\n\n1. Discovery\n\nInterestingly, the batch files used by Nefilim include hard-coded Internal IP addresses, admin credentials, services,\nand processes. This means that Nefilim attacks are highly targeted attacks as the hard-coded information requires an\nintensive discovery operation prior to attacks. Dynamic analysis of the Nefilim ransomware samples shows that the\nfollowing techniques are used by Nefilim to discover the required information.\n\n\n-----\n\n**_5.1 MITRE ATT&CK T1518.001 Software Discovery: Security Software Discovery_**\n\nThe Nefilim ransomware uses `IsDebuggerPresent,` `CheckRemoteDebuggerPresent, and`\n```\nNtQueryInformationProcess API functions to check if a user-mode debugger is running. Debuggers are used by\n\n```\nsecurity analysts to inspect malware’s behavior at the run-time. In the presence of a debugger, malware samples\nexhibited less malicious behavior. Moreover, Nefilim uses the `NtSetInformationThread API function to evade`\ndebugging.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n112771 Security Software Discovery Attack Scenario 3379 Security Software Discovery\n\n**_5.2 MITRE ATT&CK T1018 Remote System Discovery_**\n\nNefilim reads the hosts file ( C:\\Windows\\System32\\drivers\\etc\\hosts ) to get a listing of other systems by IP\naddresses and hostnames on the network that may be used for Lateral Movement from the current system.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n101233 Gather Windows Host\nFile\n\n\n6813 Remote System Discovery by Obtaining Mappings of IP Addresses to Host\nNames\n\n\n**_5.3 MITRE ATT&CK T1082 System Information Discovery_**\n\nThe Nefilim ransomware queries volume information (disk volume name and serial number) and Cryptographic\nMachine GUID. Ransomware families use Cryptographic Machine GUID and volume serial number to generate a\nunique identifier for the host for encryption/decryption processes.\n\nNefilim obtains Cryptographic Machine GUID by querying the value of `MachineGuid in the following Registry key:`\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n793307 Query Cryptographic Machine GUID\nin Registry\n\n\n6886 System Information Discovery via Querying MachineGuid Key\nValue in Registry\n\n\n**5.4 MITRE ATT&CK T1083 File and Directory Discovery**\n\nLike a typical ransomware TTP, Nefilim enumerates files before encrypting them. It uses some FileAPI functions such\nas `FindFirstFileW,` `lstrcmpiW and FindNextFileW to discover files.`\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n286738 File and Directory Discovery Attack\nScenario\n\n\n4771 Sensitive Information Discovery by Searching\nFilenames\n\n\n-----\n\n1. Lateral Movement\n\nLateral Movement refers to a tactic that adversaries use to move through a network to access and control remote\nassets in the network. To accomplish Lateral Movement, adversaries may use legitimate tools with valid accounts as\nwell as their remote access tools.\n\n**_6.1. MITRE ATT&CK T1570 Lateral Tool Transfer_**\n\nThe Nefilim ransomware downloads the `Psexec.exe tool, and it also abuses the Windows built-in` `WMI (Windows`\nManagement Instrumentation) utility for lateral movement. PsExec is a free Microsoft tool that can be used to execute\ncommands and binaries on remote systems and download or upload a file over a network share. Nefilim uses PsExec\nand WMI with hard-coded admin credentials to remotely execute the batch files and the ransomware file in remote\nhosts.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n526471 Remote File Encryption with PsExec 3244 PsExec Tool Remote Command Execution\n\n1. Collection\n\nAdversaries use the techniques in the Collection tactic to gather information relevant to their objectives. Various data\ntypes such as text, audio, and video are collected from multiple sources such as local system cloud, network drive,\nremovable media, and clipboard. The next goal after data collection is often to exfiltrate the data.\n\n**_7.1 MITRE ATT&CK T1056.001 Input Capture: Keylogging_**\n\nThe Nefilim ransomware creates a `DirectInput object using the` `DirectDrawCreateEx function to capture`\nkeystrokes. Keylogging is both a Credential Access and Collection tactic.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n431235 Input Capture Attack Scenario 5924 User Input Capture via PowerShell Script\n\n1. Exfiltration\n\nAdversaries use techniques in the Exfiltration tactic to steal data from your network. They encrypt or compress the\ndata to be exfiltrated and use different channels and protocols to avoid detection. For example, the Nefilim\nransomware compresses collected files and exfiltrates them to cloud storage.\n\nData loss protection is one of the top priority issues for CISOs today. Organizations utilize DLP solutions to protect\nand secure their data and comply with regulations. Picus simulates the exfiltration of a wide range of data over\ndifferent channels to test the effectiveness of both network and endpoint-based data loss prevention (DLP) solutions.\nPicus Threat Library includes hundreds of data files consisting of different types of information mapped to standards\nand regulations, including PII, PCI DSS, PHI, GDPR, HIPAA, PIPEDA, confidential files such as password files of\nOSs, and Intellectual Property (IP) data.\n\nSome examples of data exfiltration attacks in the Picus Threat Library are given in the following table:\n\n\n-----\n\n**Picus Threat Library - Threat**\n\n107307 Italy PCI and PII Information Exfiltration including Full Credit Card Info\n\n893939 Italy PII Info. Exfiltration including Codice Fiscale\n\n727983 IBAN Numbers of 100 Countries Exfiltration in XLSX Format\n\n**_8.1 MITRE ATT&CK T1567.002 Exfiltration Over Web Service: Exfiltration to Cloud Storage_**\n\nNefilim operators use the `MEGAsync application to exfiltrate data to cloud storage. MEGAsync application`\nsynchronizes folders between the infected computer and an adversary-controlled MEGA Cloud Drive.\n\n1. Impact\n\nThe Impact tactic covers techniques that manipulate, interrupt, or destroy your systems to disrupt availability,\ncompromise integrity, or cover a confidentiality breach.\n\n**_9.1 MITRE ATT&CK T1486 Data Encrypted for Impact_**\n\nLike other ransomware threats, Nefilim encrypts files on the target system using AES-128 and adds NEFILIM,\nNEPHILIM, MERIN, TRAPGET, MEFILIN, TELEGRAM, SIGARETA, or OFFWHITE extension to encrypted files. It\nuses an RSA-2048 public key embedded in the ransomware executable to encrypt the AES encryption key. It also\nadds a file that includes the ransom note to the root directory, such as `C:\\NEFILIM-DECRYPT.txt .`\n\nNefilim abuses Microsoft's Enhanced Cryptographic Provider to import cryptographic keys and encrypt data with API\nfunctions such as `CryptImportKey,` `CryptAcquireContext,` `CryptCreateHash,` `CryptHashData,`\n\n`CryptDeriveKey,` `CryptReleaseContext,` `CryptDestroyKey,` `CryptEncrypt` .This behavior is a very specific\nTTP of ransomware.\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n767981 File Encryption with PowerShell 4737 Cryptography Encryptor and Decryptor Utilization via PowerShell\n\n**_9.2 MITRE ATT&CK T1490 Inhibit System Recovery_**\n\nDeleting volume shadow copies is very typical behavior of ransomware. The Nefilim ransomware uses `WMIC with`\nthe following command to delete all volume shadow copies on the system to prevent recovery. WMIC is a commandline utility to access WMI.\n\n\n-----\n\nwmic shadowcopy delete\n\nNefilim also uses bcdedit.exe twice to disable automatic Windows recovery features by modifying boot configuration\ndata.\n\nbcdedit /set {default} recoveryenabled No\n\nbcdedit /set {default} bootstatuspolicy ignoreallfailures\n\nMoreover, the Nefilim ransomware uses wbadmin to delete the backup catalog:\n\nwbadmin delete catalog -quiet\n\n**Picus Threat Library - Threat** **Picus Mitigation Library - Detection Rule**\n\n\n205796 Inhibit System Recovery by Deleting All Volume Shadow\nCopies with WMIC\n\n562990 Inhibit System Recovery by Disable Automatic Windows\nRecovery Features with bcdedit\n\n407822 Inhibit System Recovery by Deleting Windows Backup\nCatalog with Vbadmin\n\n### Nefilim TTP Map\n\n\n7087 Shadow Copy Deletion via WMIC\nTool\n\n3165 Disabling Windows Recovery\nFeatures via Bcdedit Tool\n\n7067 Deleting Windows Backup Catalog\nvia Vbadmin tool\n\n\nTTP Map of Nefilim that is created with TTPs detected from dozens of Nefilim ransomware samples can be found in\nthe table below.\n\nAlthough these TTPs are determined from the Nefilim samples, they are common in most ransomware families. The\nred techniques are very specific ransomware TTPs.\n\n\n-----\n\n### Conclusion\n\nWe analyzed dozens of Nefilim ransomware samples to determine tactics, techniques and procedures (TTPs) utilized\nby Nefilim. Continuously monitoring adversary TTPs within a company’s IT system allows companies to discover\nadversary behaviors and stop them before they can go any further. Picus emulates adversary TTPs and gives\nactionable mitigation information for each TTP for building a proactive defense against adversaries and their\nmalware.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-03 - How to Beat Nefilim Ransomware Attacks.pdf"
    ],
    "report_names": [
        "2020-12-03 - How to Beat Nefilim Ransomware Attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535592,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653820713,
    "ts_modification_date": 1653820713,
    "files": {
        "pdf": "https://archive.orkl.eu/362371a94f2d692b18199dea315369bd7454b705.pdf",
        "text": "https://archive.orkl.eu/362371a94f2d692b18199dea315369bd7454b705.txt",
        "img": "https://archive.orkl.eu/362371a94f2d692b18199dea315369bd7454b705.jpg"
    }
}