{
    "id": "3799f481-76bf-4d34-b686-07e58c3faa45",
    "created_at": "2023-01-12T15:04:44.247833Z",
    "updated_at": "2025-03-27T02:09:17.922032Z",
    "deleted_at": null,
    "sha1_hash": "e183d5633bce1995b51f76aa913e9ee2b65ca94c",
    "title": "2022-04-26 - Conti and Emotet A constantly destructive duo",
    "authors": "",
    "file_creation_date": "2022-05-25T12:22:35Z",
    "file_modification_date": "2022-05-25T12:22:35Z",
    "file_size": 216726,
    "plain_text": "# Conti and Emotet: A constantly destructive duo\n\n**intel471.com/blog/conti-emotet-ransomware-conti-leaks**\n\nThe relationship between Trickbot, Emotet and Conti has been well documented, with many\nsecurity researchers showing how threat actors have used the malware combination to\nlaunch a plethora of schemes. This relationship has come into greater focus in recent weeks,\nas the Conti Leaks show just how interdependent Conti affiliates are on Emotet. Through a\ncombination of information pulled from those leaks and Intel 471’s technical monitoring of\nEmotet campaigns, we now have a clearer understanding on how criminals are using Emotet\nin concert with Conti.\n\nIntel 471 assesses with high confidence that Emotet malware operators’ spam targets will\n[enter a pool of potential Conti victims. Intel 471 analyzed Conti ransomware incidents from](https://intel471.com/glossary/ransomware)\nDec. 25, 2021, to March 25, 2022, and discovered over a dozen targets that were recipients of\n[Emotet malspam. While what Intel 471 measured was based on known attacks, the true](https://intel471.com/glossary#:~:text=M-,Malspam,-Malicious%20spam%20is)\ndegree of correlation between Emotet spam recipients and Conti ransomware breach victims\nmay be greater, since not all Conti victims are publicly listed on the name-and-shame blog for\na variety of reasons, including victims opting to pay ransoms to remain anonymous. Intel 471\nbelieves it’s likely that Emotet is highly relied upon by Conti ransomware operators to find\ntheir current victims.\n\nThe chart below shows the dates of Emotet showing up on systems, followed by a\nransomware attack where Conti was used.\n\n\n-----\n\nThe negative numbers on the table above indicate that some victims were still receiving\nEmotet malspam after a ransomware incident was already listed on Conti’s blog. This is an\nimportant point to highlight as it gives great insight to the overall operation of the Conti\nransomware group and Emotet operators.\n\nWhile Emotet has been linked in concert with Trickbot and Conti, Emotet does not operate\nunder the same leadership umbrella (unlike Trickbot, which Conti “acquired” earlier this\nyear) as the other two forms of malware. The Emotet malspam operation is independent and\nmassive, with some parts running in an automated manner. What’s likely occurring is that\nmost Emotet spam recipients are not strictly targeted by a ransomware affiliate using Conti.\nInstead, Emotet is used by Conti affiliates to gain initial access. Once access is obtained, the\norganization is placed into a pool of potential ransomware targets, where ransomware\noperators can select their next victim based on the system information extracted by Emotet.\n\nEven though Emotet operates outside the boundaries of Conti’s leadership, the ransomware\ngroup has made it a key part of their attack chain, specifically as part of the relaunched\nEmotet we observed in November 2021.\n\nThe previous Emotet operation consistently launched malspam campaigns that dropped\nseveral malware families including IcedID aka Bokbot, Qbot and Trickbot. However, the\nupdated Emotet malspam operation has been observed dropping only Cobalt Strike payloads\nor intermediary payloads, such as SystemBC, to drop Cobalt Strike. We know due to the\nConti Leaks that the group leveraged Cobalt Strike: independent journalist Brian Krebs\n[reported that Conti invested US $60,000 in acquiring a valid Cobalt Strike license in 2021.](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-iii-weaponry/)\n\nThe leaks further revealed evidence that certain members of the Conti team were responsible\nfor handing Trickbot and Emotet development. The leak revealed the actor “veron” aka\n“mors,” who directs the Emotet malware spam operation, reports to a senior manager in the\nConti organization, who uses the “stern” handle. This information aligns with our own\nobservations and long-term monitoring of Emotet and TrickBot malware campaigns. In past\ncampaigns, only bots with the Trickbot group tag (gtag) “mors” received commands to\ndownload and execute Emotet. This suggests “mors” added the gtag to Trickbot.\n\nWhen any organization finds a successful operational process, it leans on it as much as\npossible. The Conti Leaks have shown how this group conducts itself like a legitimate\nbusiness, adopting well-worn practices that allow it fulfill its goals. These leaks show just how\ncrucial Emotet has been to Conti’s ransomware schemes. While not every instance of Emotet\nmeans that a ransomware attack is imminent, our research shows that there is a heightened\nchance of an attack if Emotet is spotted on organizations’ systems. By being proactive against\nEmotet, defenders can save their organizations from further issues that could cause\nsubstantial damage to their operations.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-26 - Conti and Emotet A constantly destructive duo.pdf"
    ],
    "report_names": [
        "2022-04-26 - Conti and Emotet A constantly destructive duo.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535884,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653481355,
    "ts_modification_date": 1653481355,
    "files": {
        "pdf": "https://archive.orkl.eu/e183d5633bce1995b51f76aa913e9ee2b65ca94c.pdf",
        "text": "https://archive.orkl.eu/e183d5633bce1995b51f76aa913e9ee2b65ca94c.txt",
        "img": "https://archive.orkl.eu/e183d5633bce1995b51f76aa913e9ee2b65ca94c.jpg"
    }
}