{
    "id": "37a2edf4-4c9c-485e-9fc1-7cabdc1ff11f",
    "created_at": "2023-01-12T15:07:03.959076Z",
    "updated_at": "2025-03-27T02:05:23.708242Z",
    "deleted_at": null,
    "sha1_hash": "acd731331a1e811acbf623f77626527f5d316094",
    "title": "2021-10-15 - Ransomware Operators Found Using New -Franchise- Business Model",
    "authors": "",
    "file_creation_date": "2022-05-28T15:56:54Z",
    "file_modification_date": "2022-05-28T15:56:54Z",
    "file_size": 105116,
    "plain_text": "# Ransomware Operators Found Using New \"Franchise\" Business Model\n\n**[trendmicro.com/en_us/research/21/j/ransomware-operators-found-using-new-franchise-business-model.html](https://www.trendmicro.com/en_us/research/21/j/ransomware-operators-found-using-new-franchise-business-model.html)**\n\nOctober 15, 2021\n\nShared infrastructure\n\nTo date, we have found fifteen onion addresses used by at least four different servers, and\nthree others still unknown.\n\n**Onion Address** **Server**\n\nw6ilafwwrgtrmilorzqex6pgpvfsa667fydca2wpoluj6sajka225byd[.]onion A\n\naccdknc4nmu4t5hclb6q6kjm2u7u5xdzjnewut2up2rlcfqe5lootlqd[.]onion A\n\nc6zkofycoumltpmm6zpyfadkuddpmlqk6vyd3orrfjgtq3vrgyifl6yd[.]onion A\n\n3klsbd4dwj3yqgo4xpogfgwqkljbnbdxjryeqks2cjion5jj33wvkqyd.onion B\n\nyk7erwdvj4vxcgiq3gmcufkben4bk4ixddl5j2xvu7gurtdq754jmiad.onion B\n\nz4cn6lpet4y4r6mdlbpklpcrjdruwb6kiuvxn6gsiuoub23z6prlx6ad.onion B\n\nibih5znjxf2cqgo737xmooyvmxhac45wd4rivh6n5hd7fysn42g3fayd.onion B\n\nikrah6fb4e6r2raxkyvyoxp22jam5z6ak5ajfnzxutmassoagvr2bhad.onion B\n\nhceesrsg6f5p4gcph4j6jv6vl4mkmaik735oz4r45lgjfyedsxfoprad.onion B\n\nqfgh2lpslhjb33z3wsenmqrxcdragelinvcpowlgkbjca6yig5zloeyd.onion B\n\n\n-----\n\nx4mjvffmytkw3hyu.onion C\n\ntpze4yo74m6qflef.onion D\n\nevl425tkt4hkwryyplvqu6bn6slfow3fa4xwgvwe5t4zf6gizs3ewuyd.onion Unknown 1\n\nxingnewj6m4qytljhfwemngm7r7rogrindbq7wrfeepejgxc3bwci7qd.onion Unknown 2\n\nzckdr5wmbzxphoem77diqb2ome2a54o23jl2msz3kmotjlpdnjhmn6yd.onion Unknown 3\n\nTable 1. The onion addresses used by the different servers\n\nAnd here is how they relate to the group:\n\n**Server** **XingLocker** **AstroLocker Team**\n\nA x\n\nB x x\n\nC x x\n\nD x\n\nUnknown 1 x\n\nUnknown 2 x\n\nUnknown 3 x\n\nTable 2. The different servers in relation to XingLocker and AstroLocker Team\n\nWhile this is not a sophisticated innovation, it is important to highlight that ransomware\n[groups are looking for new ways to run their affiliate programs and RaaS businesses. This](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/ransomware-double-extortion-and-beyond-revil-clop-and-conti)\nform of shared infrastructure and code can make things harder from an investigative point of\nview. It is not uncommon to find XingLocker samples detected as Mount Locker, or identify\ntwo different onion addresses pointing to the same onion service but used by different\ngroups. Investigators should be aware of these factors when researching ransomware.\n\nWhy is this important? Most RaaS models operate by affiliates working with the ransomware\ngroup to install a specifically named ransomware on as many machines as possible, then\nsplitting the profits. This is advantageous for the attackers because when victims look up the\n\n\n-----\n\nransomware and see many reports about it, they are more likely to pay. As a disadvantage,\naffiliates are largely anonymous and can’t use these attacks as the basis of THEIR own\ncriminal business. They are just like managers in a burger chain.\n\nIt seems likely we have now observed a new \"franchise\" RaaS model involving XingLocker,\nAstroLocker and Mount Locker. In this model there seems to be a main RaaS (in this case\nMount Locker), and then affiliates license the ransomware and release it under their own\nname and brand.\n\nIn this scenario, the affiliates are like managers of their own local burger joint, getting\nproducts from a generic food supplier. The products are provided by the parent company, but\nthe individual operators conduct business under their own branding, with unique names and\nimages. This method gives more flexibility and recognition for the affiliates, especially midtier aspiring criminal gang leaders. One disadvantage is that it means less brand recognition\nfor specific ransomware, so victims may be less inclined to pay. Of course, from an\ninvestigation point of view, this method adds confusion in terms of naming and makes\ntracking harder.\n\nHow to Defend Against Ransomware\n\nRansomware is a continuously evolving threat, and organizations should be vigilant in\nmaintaining the best and most effective security policies and practices. Protection\nframeworks set by the [Center of Internet Security and the](https://www.cisecurity.org/controls/) National Institute of Standards and\nTechnology can help organizations prevent and mitigate the impact of ransomware attacks:\n\nAudit and inventory: Take an inventory of all organizational assets and data, and\nidentify authorized and unauthorized devices, software, and personnel accessing\nparticular systems. Audit and monitor all logs of events and incidents to identify\nunusual patterns and behaviors.\nConfigure and monitor: Deliberately manage hardware and software configurations,\nand only grant administrative privileges and access to specific personnel when\nabsolutely necessary. Monitor the use of network ports, protocols, and services.\nImplement security configurations on network infrastructure devices such as firewalls\nand routers, and have a software allow list to prevent malicious applications from being\nexecuted.\nPatch and update: Perform periodic vulnerability assessments, and conduct regular\npatching or virtual patching for operating systems and applications. Ensure that all\ninstalled software and applications are updated to their latest versions.\nProtect and recover: Enforce data protection, backup, and recovery measures.\nImplement multifactor authentication in all devices and platforms used whenever\navailable.\n\n\n-----\n\nSecure and defend: Perform sandbox analysis to examine and block malicious emails.\nEmploy the latest version of security solutions to all layers of the system, including\nemail, endpoint, web, and network. Spot early signs of an attack such as the presence\nof suspicious tools in the system, and enable advanced detection technologies such as\nthose powered with AI and machine learning.\nTrain and test: Perform security skills assessment and training for all personnel\nregularly, and conduct red-team exercises and penetration tests.\n\nTrend Micro Solutions\n\nOrganizations can benefit from security solutions that encompass a system’s multiple layers\n(endpoint, email, web, and network) not only for detecting malicious components but also for\nclose monitoring of suspicious behaviors in the network.\n\n[Trend Micro™ Vision One™ provides multilayered protection and behavior detection,](https://www.trendmicro.com/en_us/business/services/managed-xdr.html)\nspotting questionable behaviors that might otherwise seem benign when viewed from only a\n[single layer. For an even closer inspection of endpoints, Trend Micro Apex One™ offers](https://www.trendmicro.com/en_us/business/technologies/control-manager.html)\nnext-level automated threat detection and response against advanced concerns such as\nfileless threats and ransomware. This allows detecting and blocking ransomware early on\nbefore it can do any real damage to the system.\n\nWith techniques such as virtual patching and machine learning, Trend Micro™ Cloud One™\nWorkload Security protects systems against both known and unknown threats that exploit\nvulnerabilities. It also takes advantage of the latest in global threat intelligence to provide upto-date, real-time protection.\n\nRansomware often gets into the system through phishing emails. Trend Micro™ Deep\nDiscovery™ Email Inspector employs custom sandboxing and advanced analysis techniques\nto effectively block ransomware before it gets into the system.\n\n[For the Indicators of Compromise, please see this document.](https://documents.trendmicro.com/images/TEx/blogs/IOCs-Ransomware-Operators-Found-Using-New-Franchise-Business-Modelh7RHcuA.txt)\n\nRansomware\n\nWe found a relatively new and interesting ransomware operation that takes inspiration from\nfranchise business models. It seems that the operators are rebranding a \"supplier\"\nransomware before deployment instead of simply distributing it under the original name.\n\nBy: Fernando Merces October 15, 2021 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-15 - Ransomware Operators Found Using New -Franchise- Business Model.pdf"
    ],
    "report_names": [
        "2021-10-15 - Ransomware Operators Found Using New -Franchise- Business Model.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536023,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653753414,
    "ts_modification_date": 1653753414,
    "files": {
        "pdf": "https://archive.orkl.eu/acd731331a1e811acbf623f77626527f5d316094.pdf",
        "text": "https://archive.orkl.eu/acd731331a1e811acbf623f77626527f5d316094.txt",
        "img": "https://archive.orkl.eu/acd731331a1e811acbf623f77626527f5d316094.jpg"
    }
}