{
    "id": "37d1e043-e87e-4e75-8119-3c439dbdf425",
    "created_at": "2023-01-12T15:06:19.341409Z",
    "updated_at": "2025-03-27T02:05:37.874702Z",
    "deleted_at": null,
    "sha1_hash": "cd14a45f963edf893fb268e388d0d3db6733ecd3",
    "title": "2021-10-21 - ​​Raccoon Stealer Under the Lens- A Deep-dive Analysis",
    "authors": "",
    "file_creation_date": "2022-05-27T23:06:07Z",
    "file_modification_date": "2022-05-27T23:06:07Z",
    "file_size": 4098045,
    "plain_text": "# Raccoon Stealer Under the Lens: A Deep-dive Analysis\n\n**[blog.cyble.com/2021/10/21/raccoon-stealer-under-the-lens-a-deep-dive-analysis/](https://blog.cyble.com/2021/10/21/raccoon-stealer-under-the-lens-a-deep-dive-analysis/)**\n\nOctober 21, 2021\n\nStealer malware is becoming the weapon of choice for Threat Actors (TA) to steal credentials from victims’ devices.\nThis malware family has the capability to steal the cookies, credentials, credit card (CC) information, crypto\nwallets, and other sensitive details stored on the victim’s device. To accomplish this task, the malware uses various\ntechniques to extract information from the victim’s machine.\n\nCyble Research Labs has harvested the latest variant of Raccoon Stealer to study the stealer malware\nfamily behavior and the techniques that it uses for infection. The TA behind the Raccoon Stealer has posted the\nmalware’s capabilities on a cybercrime forum, wherein he has mentioned that the malware can run on both 32- and\n64-bit systems without .NET dependencies, and the logs are collected in RAM instead of the disk, among others.\n\n\n-----\n\n_Figure 1 TA Post on Cyber Crime Forum_\nRacoon Stealer has been observed in the wild since April 2019. Until then, the TA behind the Stealer had been\nworking on enhancing the techniques used by this malware. At the time of writing this analysis, Virus Total has more\nthan 9K samples of Racoon Stealer with 5+ positive detection.\n\nThe figure below shows the high-level execution flow of the Raccoon stealer malware. Initially, it connects to the TA’s\nTelegram channel to get the Command and Control (C&C) IP. Further, the malware downloads the configuration data\nand other payloads/modules to extract the credentials from the victim’s device and conduct the data exfiltration.\n\n_Figure 2 High-Level Execution Flow of the malware_\n\n## Technical Analysis\n\nCyble Research Labs analyzed this sample. Upon performing the static analysis, we found that the malware is x86\narchitecture Portable Executable (PE) binary written in C/C++ and compiled on 2020-06-24 05:58:17.\n\n\n-----\n\n_Figure 3 Static Information of Malware_\nUpon the initial execution of the malware in our research environment, we noticed that the malware was trying to\ncommunicate to a telegatt[.]top domain and did not show any other behavior, as shown in the below figure.\n\n_Figure 4 Traffic Analysis of Malware_\nUpon further investigation, we determined that the malware was trying to access the “jdiamond13” channel on\nTelegram using the services provided by telegatt[.]top, as shown in the figure below.\n\n\n-----\n\n_Figure 5 TA’s_\n\n\n_Telegram channel_\nThe figure below showcases the infection flow of Raccoon stealer malware.\n\n_Figure 6 Infection flow of malware_\nThe figure below depicts the Process tree created by the malware.\n\n\n-----\n\n_Figure 7 Process Tree created by malware_\nAfter data exfiltration is completed, the Stealer removes its foothold by removing malware binaries and data files. The\nfollowing command is executed to perform self-delete.\n\ncmd.exe /C timeout /T 10 /NOBREAK > Nul & Del /f /q\n“C:\\Users\\MalWorkstation\\Desktop\\e28a6d3bdcfdad9ff4c37e6c22c1a52018e5076ec65b128614bcf0e8eb711171.exe”\n\n### Code Analysis and Debugging\n\nInitially, during the code analysis, Cyble Research Labs found that the malware was packed. The malware decrypts\neach segment during execution, performs self-injection, and does dynamic import loading. The figure below shows\nthat the malware has created a new binary in a newly allocated memory, and file execution will be transferred to the\ndecrypted binary.\n\n_Figure 8 Malware unpacking_\nFurther, the malware performs a GET request to telegatt[.]top/jdiamond13 to access the Telegram bot profile page. If\nthe telegatt service is down, it uses other hardcoded domains to reach the profile, as shown below figure.\n\n_Figure 9 Services to access TA’s Telegram channel_\n\n\n-----\n\nThe malware copies the value _e7dd0fV46cjQG7jcdYm3TS3xk8CWP0R0zIw_ _25 v1f from the Telegram bot_\ndescription page shown in Figure 5, and then shifts characters to align in proper\nencrypted data. i.e., “fV46cjQG7jcdYm3TS3xk8CWP0R0zIw==”.\n\nThen the malware uses RC4 encryption to decrypt the above string using\nthe hardcoded key “c5d49434634bb8485382d61999573882“.\n\nA quick RC4 decryption revealed the URL of C&C, which is http[:]//185[.]163[.]45[.]162.\n\n_Figure 10 Decryption of encrypted data received from TA’s Telegram channel_\nOnce the malware has the C&C URL, it generates a unique ID for the victim device and encrypts it using\nRC4 encryption using the key “iV8+pT5$yP7{“, then it sends the unique ID to the attacker’s C&C.\n\n_Figure 11 Victim’s Unique ID sent to C&C_\nAs shown in below figure, Once the C&C receives the above Victim ID as a request, it sends the RC4 encrypted\nconfiguration data to the victim’s machine, which is then decrypted using the same key shown above.\n\n_Figure 12 Encrypted Configuration data received from C&C_\nThe configuration data contains the below details, which Stealer uses to perform further actions.\n\n**Configuration** **Description**\n\n\n-----\n\nURL Paths URL Paths to download additional modules\n\nVictim Details IP, Location, Longitude, Latitude, etc\n\nBrowser Path Various paths from which stealers can extract sensitive details.\n\nCrypto Wallet Crypto Wallet details for extraction\n\n_Table 1 Configuration data present in the table._\nUpon parsing the configuration file, the malware extracts the URL Paths for the first module and sends a request to\ndownload the module.\n\n_Figure 13 Additional Payload Download from C&C_\nUpon receiving the PE file as a response, the malware uses CreateFile/WriteFile Application Programming Interface\n(API) to write the binary onto the “AppData\\LocalLow” location as “sqlite3.dll”.\n\n_Figure 14 Saving the PE file as sqlite3.dll_\nAt this stage, the stealer copies various SQLite DB files from application locations like the browser present in the\nvictim machine and then uses “sqlite3.dll” to parse and extract the sensitive contents from the DB file, as shown in\nthe figure below.\n\n\n-----\n\n_Figure 15 Malware Parsing the Browser SQLite DB file for credentials extraction_\nLater, the malware sends another request to the C&C URL to download the additional modules. The figure below\nshows that the malware downloads the modules compressed as a ZIP file.\n\n_Figure 16 Additional payloads downloaded from C&C_\nThe below figure shows the additional modules (2nd Modules) required by the Stealer to extract credentials.\n\n\n-----\n\n_Figure 17 Modules required by malware for extraction of credentials._\nOnce the credential extraction is done, the Stealer creates a ZIP file and stores the victim’s credentials. Then, it\nsends these credentials to the attacker’s C&C, as shown below.\n\n_Figure 18 Malware sends the victims details to the attacker C&C_\nIn the below figure, we can see the data uploaded by the malware on our emulated environment.\n\n_Figure 19 Content received from_\n\n_malware_\n\n\n-----\n\nThe figure below shows sample data that the Raccoon stealer has uploaded on the C&C.\n\n_Figure 20 Sample Logs uploaded by Raccoon Stealer_\nFinally, the malware calls CreateProcess API to execute the command for self-destruct.\n\ncmd.exe /C timeout /T 10 /NOBREAK > Nul & Del /f /q \\”C:\\\\Users\\\\MalWorkstation\\\\Desktop\\\\xxx\\\\Fileexe.bin\\\n\nCode for self-destruction\n\n_Figure 21 Malware is calling command for self-delete._\n\n## Conclusion \n\nThreat Actors use similar kinds of stealer malware to steal sensitive data from victim devices. Presently, these\nStealers have been misused for malicious purposes across the globe. The malware has explicitly been spread\nthrough pirated software and phishing campaigns.\n\nIn the past, we have observed that the TAs behind such stealers have targeted many businesses via their\nemployees for stealing credentials.\n\nCyble Research Labs will continuously monitor emerging threats and targeted cyber-attacks.\n\n## Our Recommendations\n\n- We have listed some essential cybersecurity best practices that create the first line of control against attackers. We\nrecommend that our readers follow the suggestions given below:\n\n- Use strong passwords and enforce multi-factor authentication wherever possible.\n\n-Turn on the automatic software update feature on your computer, mobile, and other connected devices.\n\n-Use a reputed anti-virus and internet security software package on your connected devices, including PC, laptop,\nand mobile.\n\n-Refrain from opening untrusted links and email attachments without verifying their authenticity.\n\n-Conduct regular backup practices and keep those backups offline or on a separate network.\n\n## MITRE ATT&CK® Techniques\n\n\n-----\n\n**Tactic** **Technique ID** **Technique Name**\n\n**Initial Access** [T1566](https://attack.mitre.org/techniques/T1566/) Phishing\n\n**Execution** [T1204](https://attack.mitre.org/techniques/T1204/) User Execution\n\n\n**Credential Access** [T1555](https://attack.mitre.org/techniques/T1555/)\n\n[T1539](https://attack.mitre.org/techniques/T1539/)\n\n[T1552](https://attack.mitre.org/techniques/T1552/)\n\n\nCredentials from Password Stores\n\nSteal Web Session Cookie\n\nUnsecured Credentials\n\n\n**Collection** [T1113](https://attack.mitre.org/techniques/T1113/) Screen Capture\n\n\n**Discovery** [T1087](https://attack.mitre.org/techniques/T1087/)\n\n[T1518](https://attack.mitre.org/techniques/T1518/)\n\n[T1057](https://attack.mitre.org/techniques/T1057/)\n\n[T1007](https://attack.mitre.org/techniques/T1007/)\n\n[T1614](https://attack.mitre.org/techniques/T1614/)\n\n\nAccount Discovery\n\nSoftware Discovery\n\nProcess Discovery\n\nSystem Service Discovery\n\nSystem Location Discovery\n\n\n**Command and Control** [T1095](https://attack.mitre.org/techniques/T1095/) Non-Application Layer Protocol\n\n**Exfiltration** [T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over C2 Channel\n\n## Indicators of Compromise (IoCs): \n\n**Indicators** **Indicator**\n**type**\n\n**e28a6d3bdcfdad9ff4c37e6c22c1a52018e5076ec65b128614bcf0e8eb711171** SHA256\n\n**/jdiamond13** Channel\nName\n\n\n**Description**\n\nRaccoon Stealer\n\nTelegram Bot ID for\ngetting the C2 URL\n\n\n**http[:]//185[.]163[.]45[.]162** C&C C&C URL\n\n##  About Us \n\n[Cyble is a global threat intelligence SaaS provider that helps enterprises protect themselves from cybercrimes and](https://cyble.com/)\nexposure in the Darkweb. Its prime focus is to provide organizations with real-time visibility to their digital risk\nfootprint. Backed by Y Combinator as part of the 2021 winter cohort, Cyble has also been recognized by Forbes as\none of the top 20 Best Cybersecurity Start-ups To Watch In 2020. Headquartered in Alpharetta, Georgia, and with\noffices in Australia, Singapore, and India, Cyble has a global presence. To learn more about Cyble,\nvisit [www.cyble.com.](https://cyble.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-21 - ​​Raccoon Stealer Under the Lens- A Deep-dive Analysis.pdf"
    ],
    "report_names": [
        "2021-10-21 - ​​Raccoon Stealer Under the Lens- A Deep-dive Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535979,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653692767,
    "ts_modification_date": 1653692767,
    "files": {
        "pdf": "https://archive.orkl.eu/cd14a45f963edf893fb268e388d0d3db6733ecd3.pdf",
        "text": "https://archive.orkl.eu/cd14a45f963edf893fb268e388d0d3db6733ecd3.txt",
        "img": "https://archive.orkl.eu/cd14a45f963edf893fb268e388d0d3db6733ecd3.jpg"
    }
}