{
    "id": "380bc7ae-0220-4982-afd0-104b907f942a",
    "created_at": "2023-01-12T15:09:11.743183Z",
    "updated_at": "2025-03-27T02:11:47.781384Z",
    "deleted_at": null,
    "sha1_hash": "066ded95aaf6f00ea7c7c103561b4ed452e4f7ee",
    "title": "2020-06-24 - Glupteba malware hides in plain sight",
    "authors": "",
    "file_creation_date": "2022-05-27T21:51:23Z",
    "file_modification_date": "2022-05-27T21:51:23Z",
    "file_size": 714423,
    "plain_text": "# Glupteba malware hides in plain sight\n\n**news.sophos.com/en-us/2020/06/24/glupteba-report/**\n\nAndrew Brandt June 24, 2020\n\nThis morning, [SophosLabs is publishing a report on a malware family whose infection](https://news.sophos.com/wp-content/uploads/2020/06/glupteba_final.pdf)\nnumbers have been steadily growing since the beginning of the year. This malware, with its\nhard-to-pronounce name, has been getting regular updates and feature enhancements that\nseem to be focused on its ability to conceal itself from detection on infected computers.\n\nIn our report, we’ve taken a deep dive into what makes the Glupteba malware distinctive.\nThe core malware is, in essence, a dropper with extensive backdoor functionality, but it is a\ndropper that goes to great efforts to keep itself, and its various components, hidden from\nview by the human operator of an infected computer, or the security software charged with its\nprotection.\n\nTo accomplish these tasks, the creators of Glupteba have opted to take a modular approach\nto their malware, which can download and execute payloads intended to extend the\nfunctionality of the bot. Many of these payloads are exploit scripts and binaries that originate\nin open source tool repositories, like Github, and have been lifted whole-cloth from their\narchives to be leveraged against the victim’s computer.\n\n\n-----\n\nOne of the ways Glupteba uses these exploits is for privilege escalation, primarily so it can\ninstall a kernel driver the bot uses as a rootkit, and make other changes that weaken the\nsecurity posture of an infected host. The rootkit renders filesystem behavior invisible to the\ncomputer’s end user, and also protects any other file the malware decides to store in its\napplication directory. A watcher process then monitors the rootkit and other components for\nany sign of failure or a crash, and can reinitialize the rootkit driver or restart a buggy\ncomponent.\n\nThat watcher process also gets used to deliver a surprising amount of bug reporting\ntelemetry back to Glupteba’s creator(s). After all, an application crash is a very noticeable\nevent, and if the goal of the malware is to maintain its stealth, then avoiding crashes is of\nparamount importance.\n\n\n-----\n\nThe malware also uses the Windows Registry to its advantage, storing many of its\nconfiguration options under unobtrusive Registry key names. The names of some of these\nconfiguration values also provide a clue about Glupteba’s overall goals. For instance, the bot\nstores the name(s) of its command-and-control server(s) under a key labeled “CDN” – a term\nof art in the hosting industry that refers to a Content Delivery Network, a type of business\nthat caches frequently-requested data so it can be retrieved more rapidly by a large\npopulation.\n\nWe can infer from the bot’s propensity to self-protection and stealth, and this CDN label, that\nGlupteba’s creators intend this malware to be part of a service offering to other malware\npublishers, giving them a pay-per-install business model for malware delivery.\n\n## Where does Glupteba come from?\n\nWe found Glupteba in a large number of downloads that claimed to be installers of pirated,\ncommercial software, but these are not likely to be the only sources of this malware.\n\n\n-----\n\nThe Glupteba installers we found all share certain distinctive characteristics. Their filenames,\nfor example contained one of two unique strings of text, either -rtmd- or -fmld- in the middle\nof the filename. These strings turned out to be indicators the malware used to set certain\nparameters when first launched on the victim’s computer.\n\nThese installers were technically droppers, which dropped then executed other components\nof the infection into specific directories on the infected system. The malware then protected\nthese directories using the rootkit driver, which it installs to the DRIVERS folder under\n%system% on Windows computers. These drivers, under Windows 10, are usually named\n**winmon.sys, winmonfs.sys, and winmonprocessmonitor.sys, but the dropper contains**\nother versions that run on older Windows operating systems as well.\n\n\n-----\n\nThe dropper component also sets up Registry keys where it stores configuration data. These\nare located under the Registry path HKEY_USERS\\<SID>\\Software\\Microsoft\\TestApp (in\nwhich SID represents the user account SID that executed the malware). The malware then\nprofiles the infected system, produces a small report about the configuration of the system,\nand connects to a command-and-control server to upload the data and “register” the bot\nwithin the Glupteba botnet.\n\nThe bot also spends a significant amount of effort attempting to shut down various protective\nmeasures built into Windows, and also attempts to terminate the processes of a long list of\nsecurity or analysis tools that might otherwise alert a user to the infection, or prevent it from\ntaking hold. As to how much success the bot achieves killing its adversarial processes, we\ndon’t have all the data to know.\n\n### Who watches the watchers?\n\nOnce the bot is set up and configured, it initializes a process we call the “watcher” that,\nbasically, continuously polls each of the other installed components to ensure they’re still\nrunning. If the watcher process (windefender.exe) finds that a driver or component has\ncrashed, it will attempt to reinitialize/execute the payload.\n\nShellcode embedded in the Glupteba dropper that the bot injects into other processes\nThere are watcher components that monitor the core dropper and its own service entry, the\nstate of Windows Defender (which the bot attempts to halt), a network proxy component the\nbot uses to communicate to the outside world, and the XMRig cryptocurrency miners it\n(currently) delivers as a payload.\n\nThe watcher components keep an eye on the dropper for another reason: The dropper’s\nsecondary function is to use the initial infected machine as a foothold from which it will scan\nthe internal network wherever it is installed in search of vulnerable machines to which it can\n\n\n-----\n\nlaunch an EternalBlue exploit against, spreading the dropper laterally across the network to\nany other machines it can find.\n\nThe Glupteba bot will\n\ntry to use two different implementations of EternalBlue to spread itself around the network\nThe dropper actually contains both the “original” leaked implementation of EternalBlue as\nreleased by the Shadow Brokers hacker group, as well as an alternate implementation it will\nattempt to use if the first one fails.\n\nOnce all the setup, spreading, and initial communication with the C2 is complete, the bot\nrelaxes into a mode where it continuously polls the C2 server for instructions, and\nperiodically sends telemetry about the functioning state of the Glupteba dropper and its\ncomponents. The bot also begins scanning the public internet for routers made by MikroTik,\nand attempts to exploit any it finds using scripts embedded into the dropper.\n\nIf any of the watcher components detect a crash, they retrieve the crash dump and,\nperiodically, upload those dumps as well as a count of the number of crashes (labeled in the\nsubmission with the Russian text Количестводампов, which translates to “number of\ndumps”).\n\n### Updating the C2 from the blockchain\n\nOne of Glupteba’s more intriguing features is the way that it retrieves an updated list of the\nservers where it downloads payloads (which it refers to as a “CDN,” or content delivery\nnetwork). It does this by querying one or more bitcoin transaction IDs hardcoded into the\nbinary.\n\n\n-----\n\nThe JSON response to Glupteba’s blockchain queries includes the encoded string (“hex”)\nthat updates the C2 server addresses.\nInside the specific wallets it reads, the transaction data contains a long string of letters and\nnumbers. The servers it queries return a JSON-formatted file that contains a field labeled\nOP_RETURN. The bot parses and decrypts the contents of this OP_RETURN field, which\ntranslates into one or more domain names, which the bot then adds to the Registry keys\nwhere it stores its configuration data.\n\nFor a malware that delivers a cryptocurrency miner, it’s an interesting choice. After all, the\nbot’s payload is already communicating with bitcoin wallets and the blockchain, so perhaps\nthe bot’s creators thought they would be able to sneak one additional connection past that\nnobody would notice.\n\nAll the details about how the bots parse and decode the domain names out of these\nblockchain transaction logs are in the report.\n\n### Preventing or detecting Glupteba\n\n\n-----\n\nThe Glupteba installers we ve seen appear to be pirated software installers. End users may\nprevent infection by obtaining properly licensed software from official sources, rather than\npirated copies of unknown provenance.\n\nGlupteba and its components, including the rootkit driver, are detected by Sophos endpoint\nproducts. The EDR team has [built a list of queries that users of Sophos EDR 3.0 can use to](https://community.sophos.com/products/intercept/early-access-program/b/blog/posts/detecting-glupteba-malware-with-sophos-edr)\nperform proactive threat hunts against machines on their network. Those queries can be\nfound on the Sophos Community forum.\n\nIndicators of compromise for the samples associated with this analysis can be found on the\nSophosLabs Github.\n\n## Acknowledgments\n\nSophosLabs acknowledges the work of Luca Nagy, assisted by Gábor Szappanos, Ferenc\nLászló Nagy, Vikas Singh, and Ronny Tyink, to produce this research.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-24 - Glupteba malware hides in plain sight.pdf"
    ],
    "report_names": [
        "2020-06-24 - Glupteba malware hides in plain sight.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536151,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1653688283,
    "ts_modification_date": 1653688283,
    "files": {
        "pdf": "https://archive.orkl.eu/066ded95aaf6f00ea7c7c103561b4ed452e4f7ee.pdf",
        "text": "https://archive.orkl.eu/066ded95aaf6f00ea7c7c103561b4ed452e4f7ee.txt",
        "img": "https://archive.orkl.eu/066ded95aaf6f00ea7c7c103561b4ed452e4f7ee.jpg"
    }
}