{
    "id": "380e01fe-9d83-4f6e-8528-93ce64271289",
    "created_at": "2023-04-05T02:08:44.251463Z",
    "updated_at": "2025-03-27T02:05:40.726713Z",
    "deleted_at": null,
    "sha1_hash": "ca834ae3aaab12faeaf5cf313a75a6c87b5d84e7",
    "title": "2022-10-05 - Analysis of LilithBot Malware and Eternity Threat Group",
    "authors": "",
    "file_creation_date": "2023-04-03T08:49:54Z",
    "file_modification_date": "2023-04-03T08:49:54Z",
    "file_size": 1763218,
    "plain_text": "# Analysis of LilithBot Malware and Eternity Threat Group\n\n**[zscaler.com/blogs/security-research/analysis-lilithbot-malware-and-eternity-threat-group](https://www.zscaler.com/blogs/security-research/analysis-lilithbot-malware-and-eternity-threat-group)**\n\n## Introduction\n\nThreatLabz recently discovered a sample of the multi-function malware LilithBot in our database. Further research revealed\nthat this was associated with the Eternity group (a.k.a. EternityTeam; Eternity Project), a threat group linked to the Russian\n“Jester Group,” that has been active since at least January 2022. Eternity uses an as-a-service subscription model to\ndistribute different Eternity-branded malware modules in underground forums, including a stealer, miner, botnet, ransomware,\nworm+dropper, and DDoS bot.\n\nThe LilithBot we discovered was being distributed through a dedicated Telegram group and a Tor link that provided one-stopshopping for these various payloads. In addition to its primary botnet functionality, it also had built-in stealer, clipper, and\nminer capabilities. In this blog, we’ll provide a deep analysis of the LilithBot campaign, including a look at several variants.\n\n## Key Features of this Attack\n\nThreat groups have been enhancing their capabilities and selling them as Malware-as-a-Service (MaaS) in exchange for\na membership fee. One such cyber criminal group, dubbed “Eternity,” has been found selling the malware “LilithBot”\n“LilithBot” is distributed by Eternity via a dedicated Telegram channel from which we can purchase it via Tor. It has\nadvanced capabilities to be used as a miner, stealer, and a clipper along with its persistence mechanisms.\nThe group has been continuously enhancing the malware, adding improvements such as anti-debug and anti-VM\nchecks.\nThe malware registers itself on the system and decrypts itself step by step, dropping its configuration file.\nLilithBot uses various types of fields such as license key, encoding key, and GUID which is encrypted via AES and\ndecrypts itself at runtime.\nIt steals all the information and uploads itself as a zip file to its Command and Control.\n\n## Summary\n\nIn July 2022, Zscaler’s ThreatLabz threat research team identified a multifunctional malware bot known as LilithBot, sold on a\nsubscription basis by the Eternity group. In this campaign, the threat actor registers the user on its botnet and steals files and\nuser information by uploading it to a command-and-control (C2) server using the Tor network. In this campaign, the malware\nuses fake certificates to bypass detections; it acts as a stealer, miner, clipper, and botnet.\n\nIn this blog, ThreatLabz will explain various aspects of the LilithBot threat campaign.\n\n## About Eternity\n\nEternity Project is a malware toolkit which is sold as a malware-as-a-service (MaaS). These malware are distributed via the\nTor proxy. Eternity advertises via a dedicated Telegram channel named @EternityDeveloper and has an email address of\n\n[[email protected][.]org. They have different types of services:](https://www.zscaler.com/cdn-cgi/l/email-protection)\n\nStealer\nMiner\nClipper\nRansomware\n\n\n-----\n\nWorm Dropper\nDDoS Bot\n\nEternity usually operates via Telegram and accepts payments through popular cryptocurrencies including BTC, ETH, XMR,\nUSDT, LTC, DASH, ZEC and DOGE.\n\nThey provide customized viruses and will create viruses with add-on features if the customer desires.The price of the malware\nranges from $90-$470 USD.\n\nThe below screenshot of the Eternity Telegram channel illustrates the regular updates and enhancements the group makes to\ntheir products.\n\n\n-----\n\n_Fig 1. Eternity Telegram Channel_\n\n\n-----\n\nThe Telegram channel is dubbed “Eternity Channel.” Basic account details are shown below.\n\n\n-----\n\n_Fig 2. Telegram Home Page_\n\n\n-----\n\nThe Eternity group regularly directs clients to their dedicated Tor link, in which their various malware and their features are laid\nout in detail.\n\n\n-----\n\nFig 3. Tor link mentioned in Telegram\n\nThe Tor link leads to the below homepage, which explains the various products and modules available for purchase.\n\n_Fig 4. Tor site for Eternity group_\n\nThe highest priced product for sale is their Ransomware, described in the below screenshot. The ransomware encrypts\ndocuments and files of the targeted user. The Tor page includes a dedicated video on how to generate the ransomware\npayload.\n\n_Fig 5. Features of payloads_\n\nIn summary, Eternity has a very user-friendly service that is:\n\n**Easy to purchase and operate via Tor, with a wide range of popular crypto currencies accepted for payment.**\n**Customizable to fit clients’ specific needs.**\n**Regularly updated at no additional charge. They also offer many add-on discounts and referral rewards to their**\ncustomers.\n\n\n-----\n\n## Comparison Between Two Variants\n\nAs the LilithBot malware has evolved, we have observed slight differences in the main function of different releases.\n\nSeveral commands that were present in earlier variants are not present in the newest variant that we have received. These\nfunctions include:\n\nChecking for the presence of various DLLs by iterating via arraylist and returning a Boolean value.The DLLs mentioned\nare related to virtual software like Sandboxie, 360 Total Security, Avast, and COMODO AVs.\nChecking for Win32_PortConnector which represents physical connection ports such as DB-25 pin male, Centronics, or\nPS/2. This ensures that it’s on a physical machine rather than a virtual machine.\n\n_Fig 6. Comparison between variants_\n\nIt is likely that the group is still performing these functions, but doing so in more sophisticated ways: such as performing it\ndynamically, encrypting the functions like other regions of code, or using other advanced tactics.\n\n## Technical Analysis\n\nThe entry point starts with registration of the bot. The malware initially checks with a Mutex named “8928a2d3-173b-43cb8837-0e2e88b6d3b1” and subsequently checks for a file in the Startup folder.\n\nIt then copies the same into the Startup folder if the file does not exist. The function StartupFilename then checks whether a\nfile has been created which with an extension of “.exe”,”.com” or “.scr”; if not, it will append “.exe” to the filename and add this\nfilename in the Startup path.\n\n\n-----\n\n_Fig 7. Mutex Creation_\n\n_Fig 8. Checks Startup Files_\n\nThe image below shows that the bot has successfully registered when the response to the decrypted data has the string\n“registered successfully” present in the register bot function, when checking the array data value.\n\n\n-----\n\n_Fig 9. Steals User Information_\n\n_Fig 10. Registered Successfully_\n\nThe Initialize function can be used to extract the value of different fields in a config file, as shown below. After decrypting the\naes cipher, we can see all the important fields present in the config file. The following are the fields present inside the config\nfile:\n\n_\"Lilith\": {_\n\n_\"CommandsCheckInterval\": 14_\n\n_},_\n\n_\"BotKiller\": {_\n\n_\"Enabled\": false_\n\n_},_\n\n_\"Stealer\": {_\n\n_\"Enabled\": true_\n\n_},_\n\n_\"Clipper\": {_\n\n\n-----\n\n_Enabled : true,_\n\n_\"Addresses\": {_\n\n_\"XMR\":_\n_\"493eic71yTX23KnxuC1FimhkW5kEv1G2aMcE1spdBYot5BLo2ZdDbUcPCLdXMQPgLpgkNxLH4FWDRLjcdxmvG6ba4D8saKg\",_\n\n_\"BTC\": \"bc1qd8e4maz97mv23slmgg7d4je2mydslkl5m56vdz\",_\n\n_\"ETH\": \"0xFf7f57a2c7952fD9550A5E0FE53d4F104886403A\"_\n\n_}_\n\n_},_\n\n_\"Miner\": {_\n\n_\"Enabled\": false,_\n\n_\"Pool\": \"pool.minexmr.com:4444\",_\n\n_\"Wallet\":_\n_\"493eic71yTX23KnxuC1FimhkW5kEv1G2aMcE1spdBYot5BLo2ZdDbUcPCLdXMQPgLpgkNxLH4FWDRLjcdxmvG6ba4D8saKg\",_\n\n_\"Password\": \"x\",_\n\n_\"MaxCPU\": \"40\"_\n\n_}_\n\n_Fig 11. Decrypted Config File Found in memory_\n\nWe also came across a function that confirms the malware is using its own decrypting mechanism so that it can’t be decrypted\nmanually.\n\nAll the encrypted data goes through the function “DecryptBytesToString” on which we can extend our breakpoint to know all\nthe values of the decrypting data using dynamic analysis.\n\nWe can see that the C2 server has the IP address: 77.73.133[.]12 with the port no. 4545 with the api gate/ and which expects\ncertain arguments for field {0} and {1}. The key and data are hidden inside the Hex array which we can see in the memory\ndump.\n\nWe can decrypt the encoded key which translates to the value c4d8c7f433c1e79afe4eff3a4b05c7c9.\n\nWe also observed a license key field which has the value 59BE0ABAF3BC570D8F6F88A597C64B85. This is the decrypting\nfunction; the below image shows the decrypted text for the corresponding values.\n\n\n-----\n\n_Fig 12. Decrypted License Key and Encoded Key_\n\nThe sample also defines a function which gets the response of the body. If the response is not null, it then checks to make\nsure both the C2 server and the target’s network are online. Then, it will then generate the GET request by checking a few\npermissions.\n\nThe malware further checks whether the hostname contains the onion domain. After checking the permissions, it downloads\nthe Tor bundle and connects to the IP. The Upload File function combines the hostname with the client, name of the file, and\ndirectory as parameters.\n\n_Fig 13. Checks if bot is online or offline_\n\n\n-----\n\n## Network Artifacts\n\nLilithBot malware shows 3 requests to the Host ip:77.73.133[.]12 with port 4545.The user agent shows the relation of the\nmalware with LilithBot.\n\nThe first request is to register the bot with /registerBot API with the mutex name prepended.\n\n_Fig 14. Sends Request to Register Bot_\n\nThe second request is an API to download the file contents according to the plugin settings ‘admin_settings_plugin.json’.\n\n_Fig 15 Requests plugin settings_\n\n\n-----\n\nWe see another request to upload the file in a ZIP format named as “report.zip” with dir parameter as ‘Stealer’. The zip file\ncontains multiple directories that store information typical of a stealer, including the browser history, cookies, and personal\ninformation such as pictures stored in the C:\\Users\\[user]\\Pictures folder, and much more.\n\n_Fig 16.  Uploads report file_\n\n_Fig 17. Contents inside Report.zip_\n\n## Fake Certificates\n\nA legitimate Microsoft-signed file is issued by the “Microsoft Code Signing PCA” certificate authority, and will also display a\ncountersignature from Verisign. However, we have seen that the fake certificates in LilithBot have no countersignature, and\nappears to have been issued by “Microsoft Code Signing PCA 2011” which was not verified.\n\n\n-----\n\n_Fig 18. Fake certificate issued by Microsoft_\n\n## Sandbox Report\n\n_Fig 19. Zscaler Sandbox report_\n\n**Zscaler's multilayered cloud security platform detects indicators, as shown below:**\n\n[Win64.PWS.LilithBot](https://threatlibrary.zscaler.com/threats/0c1b5b09-f1ef-4628-9ec8-5f6917dc7ba0)\n\n\n-----\n\n## MITRE ATT&CK\n\nID Tactic Technique\n\nT1003 Credential Access OS Credential Dumping\n\nT1552.002 Credential Access Credentials in Registry\n\nT1114.002 Collection Remote Email Collection\n\nT1005 Collection Data from Local System\n\nT1204 User Execution User interaction\n\nT1268 Conduct social engineering Uses social eng to install payload\n\nT1222 Defense Evasion File Directory Permissions Modification\n\nT1027 Defense Evasion Obfuscated Files or Information\n\nT1016 Discovery System Network Configuration Discovery\n\nT1012 Discovery Query Registry\n\nT1018 Discovery Remote System Discovery\n\nT1057 Discovery Process Discovery\n\nT1047 Execution Windows Management Instrumentation\n\nT1059 Execution Command and Scripting Interpreter\n\nT1037.005 Persistence, Privilege Escalation Startup Items\n\nT1071 Command and Control Application Layer Protocol\n\n## Indicators of Compromise (IOCs)\n\n0ebe8de305581c9eca37e53a46d033c8 Executable using microsoft signed certificate\n\n1cae8559447370016ff20da8f717db53 Executable using microsoft signed certificate\n\ne793fcd5e44422313ec70599078adbdc Executable File\n\n65c0241109562662f4398cff77499b25 Dll File using microsoft signed certificate\n\n77.73.133.12 C&C\n\n\n-----\n\n45.9.148.203 C&C\n\n91.243.59.210 C&C\n\n195.2.71.214 C&C\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-05 - Analysis of LilithBot Malware and Eternity Threat Group.pdf"
    ],
    "report_names": [
        "2022-10-05 - Analysis of LilithBot Malware and Eternity Threat Group.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660524,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1680511794,
    "ts_modification_date": 1680511794,
    "files": {
        "pdf": "https://archive.orkl.eu/ca834ae3aaab12faeaf5cf313a75a6c87b5d84e7.pdf",
        "text": "https://archive.orkl.eu/ca834ae3aaab12faeaf5cf313a75a6c87b5d84e7.txt",
        "img": "https://archive.orkl.eu/ca834ae3aaab12faeaf5cf313a75a6c87b5d84e7.jpg"
    }
}