{
    "id": "382087aa-1fdc-439d-9dda-6b627dff6654",
    "created_at": "2023-01-12T15:04:32.083196Z",
    "updated_at": "2025-03-27T02:05:46.793433Z",
    "deleted_at": null,
    "sha1_hash": "07a914bad2d8047ef5f5c0cacb7a0ebba54a8bf9",
    "title": "2014-09-22 - Tinba Malware Reloaded and Attacking Banks Around the World",
    "authors": "",
    "file_creation_date": "2022-05-28T18:00:38Z",
    "file_modification_date": "2022-05-28T18:00:38Z",
    "file_size": 1667839,
    "plain_text": "# Tinba Malware Reloaded and Attacking Banks Around the World\n\n**[securityintelligence.com/tinba-malware-reloaded-and-attacking-banks-around-the-world/](http://securityintelligence.com/tinba-malware-reloaded-and-attacking-banks-around-the-world/)**\n\nSeptember 22, 2014\n\n[Home&nbsp/](http://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nTinba Malware Reloaded and Attacking Banks Around the World\n\n\n-----\n\n[Banking & Finance September 22, 2014](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Assaf Regev co-authored by Tal Darsan 5 min read](https://securityintelligence.com/author/assaf-regev/)\n_Julia Karpin contributed research for this blog._\n\nIBM Security Trusteer researchers, in addition to those from Avast, recently identified a new\nvariant of the [Tinba malware, which had its source code leaked in July. The variant is](https://securityintelligence.com/tinba-worlds-smallest-malware-has-big-bag-of-nasty-tricks/)\nexhibiting some interesting new features, including techniques to bypass automated security\ncontrols and the ability to “phone home,” even if the original command-and-control (C&C)\ncenter has been taken down.\n\nInitially, only a handful of financial institutions were targeted. However, at the time of this\nposting, this attack had broadened to include a larger number of banks globally — including\nthe United States and Canada. Our research teams have been tracking and flagging these\nfiles as malicious with a combination of low (2/55) and high (22/53) detection rates in\nVirusTotal (VT) in addition to samples that have yet to be submitted to VT.\n\nAccording to an analysis conducted by IBM Trusteer researchers, the malware seems to\nhave been assembled from the leaked source code of the well-known Tinba malware, one of\nthe most sophisticated financial malware toolkits available today. Since the leak of Tinba’s\nsource code in July, new functionality has appeared, improving malware stealth, recovery\nmechanisms against takedown attempts and new behavioral changes.\n\nTinba’s new behavioral changes include:\n\n**[Domain Generation Algorithm (DGA): Refers to a fallback mechanism for a bot to](https://en.wikipedia.org/wiki/Domain_generation_algorithm)**\n“call home” in case of the original C&C has been taken down.\n**Public Key Signing: Refers to a verification mechanism guaranteeing that a message**\ncould only be sent from authentic bot herder.\n\n\n-----\n\n**Preloaded Configuration: The malware is configured to attack at time of infection**\n(even with no C&C connectivity).\n**Advanced Encryption Methods: An additional (machine-dependent) encryption layer**\nhas been added.\n**User-Mode Rootkit Capabilities: A means of hiding its traces and evading detection,**\neven from advanced users.\n\n## Technical Analysis: From the Dropper to the Browser\n\nAfter the dropper is executed, it generates a folder name using a hard-coded key XORed\nwith the machine’s volume-serial number. The resulting hexadecimal string is used both in\nthe malwares’ folder and mutex names. (The malware executable file name is hard-coded\nand hasn’t changed since the original Tinba).\n\n\n-----\n\nFollowing that, the malware installs hooks on functions such as NtResumeThread,\nNtCreateUserProcess and NtCreateThread, which allow it to stealthily propagate in the\nsystem. Furthermore, it hooks NtQueryDirectoryFile and NtEnumerateValueKey in order to\nhide its folder and run key from advanced users.\n\n\n-----\n\n## Tinba Malware Phones Home\n\nTinba is joining Gameover Zeus in an attempt to improve communication capabilities with the\nC&C by having a fallback in the form of a DGA. Initially, it attempts to communicate with a\nhard-coded C&C server, and in case of failure, it starts using one of its fallback-generated\ndomains.\n\n\n-----\n\n-----\n\nAn additional feature of the new strain is the usage of the crypt32 Windows library in order to\nauthenticate the server against a challenge response. The infected machine sends a request\ncomprising several time stamp counters (counting the number of CPU cycles since reset)\nconcatenated together. This technique ensures a unique challenge is sent every time, so\nintercepting one challenge does not suffice to impersonate as the C&C server. This message\nis encrypted with RC4 (like all of Tinba’s communication) and then sent to the server. A hash\nof the message is created using SHA-1. The hash is then encrypted with a private key on the\nserver’s side and returned as part of the response. The response itself is authenticated by\nthe malware using the Windows API CryptVerifySignatureA with a hard-coded public key.\n\n\n-----\n\n-----\n\n-----\n\nIt is important to note that without proper authentication, the communication routine will not\ncontinue, and the authentication process will repeat forever. Following a successful\nauthentication, the communication routine repeats itself several times and then attempts to\nauthenticate again. This is done in gradually expanding intervals.\n\n## Configuration\n\nAs opposed to previous Tinba strains, the new one comes with a preloaded configuration. If\nthe browser is launched while the malware was unable to download a configuration, the\npreloaded, hard-coded one will be used instead.\n\nIn addition, on top of the RC4 decryption layer used in previous strains, the new strain adds\na pre-step of XOR with the volume serial and a post-step of decompression using aPLib.\n\n\n-----\n\n## Automatic Transfer System Engine\n\nIn some recent configurations, we’ve discovered an interesting gem: the use of an\nATSEngine panel, similar to the latest versions of Zeus, such as Citadel and ZeusVM.\n\nTinba configuration contains webinjects of external malicious Javascript code, as seen\nbelow:\n\nThis malicious code is capable of applying dynamic webinjects in a large number of online\nbanking websites. It adjusts the webinject to the exact look and feel of the original website.\n\n\n-----\n\nThese dynamic webinjects are part of the ATSEngine infrastructure that enables the attacker\nto collect multiple data elements, such as the victims’ credit card type (credit, debit), CVV,\nPIN and SSN. The fraudster can then use a man-in-the-browser attack to transfer the\navailable balance to a third party (a money mule), who withdraws the funds and sends them\nto the attacker in an untraceable way.\n\n\n-----\n\n## Sample MD5s\n\nMD5 First seen Campaign\n\n29f83c2c462deac10f3d06c42cc82f7e 09/09/14 Canadian\n\nf5b486f92d336a5f3385314a70373ded 30/08/14 Global\n\nbc6ede0ee763a67a016642f737d07bd6 28/08/14 Global\n\n## Conclusion\n\nSince the Tinba source code leak in July, Tinba has been spotted in various locations across\nthe globe with new features and functionality. This serves as a reminder that cybercriminals\nare fully aware of reverse engineers and researchers analyzing their products; they are\nconstantly developing new tactics and methods while attempting to stay under the radar and\nbypass automated and human security controls.\n\nIBM Security Trusteer researchers and threat analysts are closely monitoring this variant\nwhile providing appropriate protection against this new threat, using either IBM Security\nTrusteer Rapport or [IBM Security Trusteer Pinpoint Malware Detection to provide protection](https://www.trusteer.com/products/trusteer-pinpoint-malware-detection)\n[against this type of financial malware and many others. These solutions can detect, mitigate](https://www.ibm.com/us-en/marketplace/trusteer-fraud-protection-suite)\nand remediate infections to protect the enterprise and your customers.\n\n[Assaf Regev](https://securityintelligence.com/author/assaf-regev/)\n\n\n-----\n\nAssaf Regev serves as the product marketing manager for the web fraud portfolio of\nTrusteer, an IBM Company, part of IBM’s Security Systems division. Assaf...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-09-22 - Tinba Malware Reloaded and Attacking Banks Around the World.pdf"
    ],
    "report_names": [
        "2014-09-22 - Tinba Malware Reloaded and Attacking Banks Around the World.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535872,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653760838,
    "ts_modification_date": 1653760838,
    "files": {
        "pdf": "https://archive.orkl.eu/07a914bad2d8047ef5f5c0cacb7a0ebba54a8bf9.pdf",
        "text": "https://archive.orkl.eu/07a914bad2d8047ef5f5c0cacb7a0ebba54a8bf9.txt",
        "img": "https://archive.orkl.eu/07a914bad2d8047ef5f5c0cacb7a0ebba54a8bf9.jpg"
    }
}