{
    "id": "382df139-74f4-4cae-b00d-150ba33d9a3a",
    "created_at": "2023-01-12T15:09:05.522712Z",
    "updated_at": "2025-03-27T02:16:26.555996Z",
    "deleted_at": null,
    "sha1_hash": "d92d1111cbd0eae00e1517179b6ac841efc410b0",
    "title": "2017-10-13 - DoubleLocker- Innovative Android Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:06:04Z",
    "file_modification_date": "2022-05-28T18:06:04Z",
    "file_size": 741929,
    "plain_text": "# DoubleLocker: Innovative Android Ransomware\n\n**[welivesecurity.com/2017/10/13/doublelocker-innovative-android-malware/](https://www.welivesecurity.com/2017/10/13/doublelocker-innovative-android-malware/)**\n\nOctober 13, 2017\n\nDoubleLocker can change the device’s PIN, preventing victims from accessing their\ndevices, and also encrypts the data it finds in them - a combination that has not been seen\npreviously in the Android ecosystem.\n\n[ESET Research](https://www.welivesecurity.com/author/esetresearch/)\n13 Oct 2017 - 10:55AM\n\n\n-----\n\nDoubleLocker can change the device’s PIN, preventing victims from accessing their\ndevices, and also encrypts the data it finds in them – a combination that has not been seen\npreviously in the Android ecosystem.\n\n**_ESET researchers have spotted the first-ever ransomware misusing Android_**\n**_accessibility services. On top of encrypting data, it also locks the device._**\n\nDetected by ESET products as Android/DoubleLocker.A, the ransomware is based on the\n[foundations of a particular banking Trojan, known for misusing accessibility services of the](https://news.drweb.com/show/?i=11381&lng=en)\nAndroid operating system. However, DoubleLocker doesn’t have the functions related to\nharvesting users’ banking credentials and wiping out their accounts. Instead, it has received\ntwo powerful tools for extorting money from its victims.\n\nDoubleLocker can change the device’s PIN, preventing victims from accessing their\ndevices, and also encrypts the data it finds in them – a combination that has not been seen\npreviously in the Android ecosystem.\n\n“Given its banking malware roots, DoubleLocker may well be turned into what could be\ncalled ransom-bankers. Two-stage malware that first tries to wipe your bank or PayPal\naccount and subsequently locks your device and data to request a ransom… Speculation\naside, we spotted a test version of such a ransom-banker in the wild as long ago as May,\n2017,” comments Lukáš Štefanko, the ESET malware researcher who discovered\nDoubleLocker.\n\n## Distribution\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/odSWGPLEqt0\n\nDoubleLocker spreads in the very same way as its banking parent does. It is distributed\nmostly as a fake Adobe Flash Player through compromised websites.\n\nOnce launched, the app requests activation of the malware’s accessibility service, named\n“Google Play Service”. After the malware obtains the accessibility permissions, it uses them\nto activate device administrator rights and set itself as the default Home application, in both\ncases without the user’s consent.\n\n“Setting itself as a default home app – a launcher – is a trick that improves the malware’s\npersistence. Whenever the user clicks on the home button, the ransomware gets activated\nand the device gets locked again. Thanks to using the accessibility service, the user doesn’t\nknow that they launch malware by hitting Home,” explains Štefanko.\n\n## Locking both device and data\n\nDoubleLocker, once executed on the device, creates two reasons for the victims to pay.\n\nFirst, it changes the device’s PIN, effectively blocking the victim from using it. The new PIN\nis set to a random value which the attackes neither store nor send anywhere, so it’s\nimpossible for the user or a security expert to recover it. After the ransom is paid, the\nattacker can remotely reset the PIN and unlock the device.\n\n\n-----\n\nSecond, DoubleLocker encrypts all files from the device s primary storage directory. It\nutilizes the AES encryption algorithm, appending the extension “.cryeye”. “The encryption is\nimplemented properly, which means that, unfortunately, there is no way to recover the files\nwithout receiving the encryption key from the attackers,” says Štefanko.\n\nThe ransom has been set to 0.0130 BTC (approximately USD 54 at time of writing) and the\nmessage highlights that it must be paid within 24 hours. However, if the ransom is not paid,\nthe data will remain encrypted and will not be deleted.\n\n\n-----\n\nFigure 1: Encrypted files on a device compromised by with DoubleLocker\n\n\n-----\n\nFigure 2: A part of the DoubleLocker ransom message\n\n## How to get rid of it?\n\nIn the ransom note, the user is warned against removing or otherwise blocking\nDoubleLocker: “Without [the software], you will never be able to get your original files back”.\n\n\n-----\n\nTo prevent unwanted removal of the software, the crooks even recommend disabling the\nuser’s antivirus software.\n\n“Such advice is irrelevant: all those with a quality security solution installed on their devices\nare safe from DoubleLocker,” explains Štefanko.\n\nThe only viable option to clean the device of the DoubleLocker ransomware is via a factory\nreset.\n\nFor rooted devices, however, there is a method to get past the PIN lock without a factory\nreset. For the method to work, the device needed to be in the debugging mode before the\nransomware got activated.\n\nIf this condition is met, then the user can connect to the device by ADB and remove the\nsystem file where the PIN is stored by Android. This operation unlocks the screen so that\nthe user can access their device. Then, working in safe mode, the user can deactivate\ndevice administrator rights for the malware and uninstall it. In some cases, a device reboot\nis needed.\n\nAs for the data stored on the device, there is no way to recover it, as mentioned earlier.\n\n“DoubleLocker serves as just another reason for mobile users to have a quality security\nsolution installed, and to back up their data on a regular basis,” concludes Štefanko.\n\n**Hash:**\n\n01d962f809ae061d1895cf71db9eeb07900929b8\n\n13 Oct 2017 - 10:55AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-13 - DoubleLocker- Innovative Android Ransomware.pdf"
    ],
    "report_names": [
        "2017-10-13 - DoubleLocker- Innovative Android Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536145,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653761164,
    "ts_modification_date": 1653761164,
    "files": {
        "pdf": "https://archive.orkl.eu/d92d1111cbd0eae00e1517179b6ac841efc410b0.pdf",
        "text": "https://archive.orkl.eu/d92d1111cbd0eae00e1517179b6ac841efc410b0.txt",
        "img": "https://archive.orkl.eu/d92d1111cbd0eae00e1517179b6ac841efc410b0.jpg"
    }
}