{
    "id": "3833ee83-c247-4038-bfe9-4a3369f22fc3",
    "created_at": "2023-01-12T15:10:56.018169Z",
    "updated_at": "2025-03-27T02:16:47.151072Z",
    "deleted_at": null,
    "sha1_hash": "66a2ba31e8b64acc4ff4d79b3d921bed6806310d",
    "title": "2022-09-13 - New Wave of Espionage Activity Targets Asian Governments",
    "authors": "",
    "file_creation_date": "2022-10-02T12:19:28Z",
    "file_modification_date": "2022-10-02T12:19:28Z",
    "file_size": 478527,
    "plain_text": "# New Wave of Espionage Activity Targets Asian Governments\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments)**\n\nThreat Hunter TeamSymantec\n\nA distinct group of espionage attackers who were formerly associated with the ShadowPad\nremote access Trojan (RAT) has adopted a new, diverse toolset to mount an ongoing\ncampaign against a range of government and state-owned organizations in a number of\nAsian countries. The attacks, which have been underway since at least early 2021, appear to\nhave intelligence gathering as their main goal.\n\n## Targets\n\nThe current campaign appears to be almost exclusively focused on government or public\nentities, including:\n\nHead of government/Prime Minister’s Office\nGovernment institutions linked to finance\n\n\n-----\n\nGovernment-owned aerospace and defense companies\nState-owned telecoms companies\nState-owned IT organizations\nState-owned media companies\n\n## Tools\n\nA notable feature of these attacks is that the attackers leverage a wide range of legitimate\nsoftware packages in order to load their malware payloads using a technique known as DLL\nside-loading. Usually, the attackers used multiple software packages in a single attack. In\nmany cases, old and outdated versions of software are used, including security software,\ngraphics software, and web browsers. In some cases, legitimate system files from the legacy\noperating system Windows XP are used. The reason for using outdated versions is that most\ncurrent versions of the software used would have mitigation against side-loading built-in.\n\n[DLL side-loading is a well-known technique that involves attackers placing a malicious DLL](https://attack.mitre.org/techniques/T1574/002/)\nin a directory where a legitimate DLL is expected to be found. The attacker then runs the\nlegitimate application themselves (having installed it themselves in most cases). The\nlegitimate application then loads and executes the payload.\n\nOnce a malicious DLL is loaded by the attackers, malicious code is executed, which in turn\nloads a .dat file. This file contains arbitrary shellcode that is used to execute a variety of\npayloads and associated commands in memory. In some cases, the arbitrary shellcode is\nencrypted.\n\nThe attackers also leverage these legitimate software packages to deploy additional tools,\nwhich are used to further aid in lateral movement. These tools include credential dumping\ntools, a number of network scanning tools (NBTScan, TCPing, FastReverseProxy, and\nFScan), and the Ladon penetration testing framework.\n\nAttacks usually unfold in the following manner:\n\nOnce backdoor access is gained, the attackers use Mimikatz and ProcDump to steal\ncredentials. In some cases, the attackers dump credentials via the registry.\nThey then use network scanning tools to identify other computers of interest, such as\nthose running RDP, which could facilitate lateral movement.\nThey leverage PsExec to run old versions of legitimate software, which are then used\nto load additional malware tools such as off-the-shelf RATS via DLL side-loading on\nother computers on the networks.\nThe attackers also use a number of living-off-the-land tools such as Ntdsutil to mount\nsnapshots of Active Directory servers in order to gain access to Active Directory\ndatabases and log files. The Dnscmd command line tool is also used to enumerate\nnetwork zone information.\n\n\n-----\n\n## Case Study: An unfolding attack\n\nIn April 2022, the attackers targeted a government-owned organization in the education\nsector in Asia and managed to stay on its network until July. During the period of the\ncompromise, the attackers accessed computers hosting databases and emails and\neventually made their way to the domain controller.\n\nThe first sign of malicious activity occurred on April 23, when a malicious command was\nexecuted via imjpuex.exe (SHA256:\nfb5bc4baece5c3ab3dabf84f8597bed3c3f2997336c85c84fdf4beba2dcb700f). The file\nimjputyc.exe is a legitimate Windows XP file that was used by the attackers to side-load a\nmalicious DLL file (imjputyc.dll), which in turn was used to load a .dat file (payload imjputyc.dat). Following this activity, imjputyc.exe was used to launch a network service via\nsvchost.exe, likely created by the malicious payload.\n\nCSIDL_SYSTEMX86\\svchost.exe NetworkService 7932\n\nAdditionally, around the same time, the attackers leveraged Imjpuex.exe to install and\nexecute an eleven-year-old version of Bitdefender Crash Handler (file name: javac.exe,\nSHA256: 386eb7aa33c76ce671d6685f79512597f1fab28ea46c8ec7d89e58340081e2bd).\nWhile Crash Handler was used for side-loading in this attack, it is just one of many old\nversions of applications that have been used by this group in recent months.\n\nThe same Crash Handler executable was copied to\nCSIDL_SYSTEM_DRIVE\\xampp\\tmp\\vmware.exe and executed.\n\nThe attackers then installed and executed ProcDump in order to dump credentials from the\nLocal Security Authority Server Service (LSASS):\n\np.exe -accepteula -ma lsass.exe lsass2.dmp\n\nThe attackers then launched several command prompts while reloading Crash Handler. This\nwas likely done in order to install additional tools.\n\nShortly afterwards, a file called calc.exe (SHA256:\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9) appeared on\nthe machine and was executed by the attackers. This was a renamed version of Mimikatz\nthat the attackers then used to dump credentials:\n\ncalc.exe \"\"privilege::debug\"\" \"\"sekurlsa::logonpasswords full\" \" exit \"\n\nOn April 26, further malicious activity occurred when the attackers ran the Crash Handler\nexecutable and installed a file called cal.exe (SHA256:\n12534f7014b3338d8f9f86ff1bbeacf8c80ad03f1d0d19077ff0e406c58b5133) on the\ncompromised machine.\n\n\n-----\n\n[This file was LadonGo v3.8, a publicly available penetration testing framework that is written](https://github.com/k8gege/LadonGo)\nin Go. The attackers appear to have used LadonGo to scan the internal network for\nmachines with RDP services running and attempted to exploit or log in to those machines\nusing the credentials they stole several days earlier. There was also some evidence of bruteforce login attempts against machines of interest.\n\nOn May 6, the attackers resumed their attack and ran the Crash Handler executable (this\ntime named svchost.exe) and installed a new variant of Mimikatz named test.exe (SHA256:\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9). This was\nlikely done in order to obtain more credentials. The attackers then ran LadonGo and\n[attempted to exploit a Netlogon vulnerability (CVE-2020-1472) against two other computers](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2020-1472)\nin the organization in order to elevate privileges.\n\nOn May 16, the attackers increased their level of activity and began moving laterally across\nthe organization’s network from the initially compromised computer (Computer #1).\n\nOn a second computer (Computer #2), the attackers launched a command prompt and\nexecuted a variant of Mimikatz (file name: test.exe, SHA256:\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9). The\nattackers then deployed a number of Knowledge Base files (e.g. kb0394623.exe) on the\ncomputer. These files are legitimate copies of the Windows command prompt (with 16 bytes\nof the rich header modified).\n\nOn a third computer (Computer #3) the attackers used PsExec to execute the same older\nversion of Crash Handler used on Computer #1, this time named javac.exe. A copy of this\nexecutable was then made to csidl_program_files\\windows mail\\winmailservice.exe and was\nexecuted.\n\nThe attackers then ran dnscmd.exe (SHA256:\n67877821bf1574060f4e45ab8be62e28f54fb40a23ce70b86a6369a4d63db5bc), which was\nused to enumerate DNS configuration information on the compromised computer:\n\nDnscmd . /EnumZones\n\n[Dnscmd is a Microsoft command-line tool for managing DNS servers. It can be used to script](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd)\nbatch files to help automate routine DNS management tasks or to perform routine setup of\nnew DNS servers. The enumzones command is used to list the zones that exist on the\nspecified DNS server. If no filters are specified, a complete list of zones is returned.\n\nCrash Handler was then used to install imjpuex.exe in the csidl_common_appdata\\veritas\ndirectory which in turn was used to side-load a DLL file of the same name and load a .dat file\nto execute an unknown custom payload.\n\n\n-----\n\nShortly after this, the attackers attempted to list the records of multiple specific zones by\nspecifying the domain on the command line:\n\nDnscmd . /ZonePrint [REDACTED_DOMAIN]\n\nOn a fourth computer (Computer #4), the attackers used PsExec to execute Crash Handler\n(this time named test.exe). They then installed and executed two KB files in the %TEMP%\ndirectory.\n\n-      SHA256:\n5c4456f061ff764509a2b249f579a5a14d475c6714f714c5a45fdd67921b9fda\n\n-      SHA256:\nded734f79058c36a6050d801e1fb52cd5ca203f3fd6af6ddea52244132bd1b51\n\nAgain, both of these files were modified versions of the Windows command prompt.\n\nOn May 17, the attackers deployed several more modified Windows command prompt\napplications on Computer #4. They also deployed the side-loading technique on Computer\n#5 to execute the legitimate svchost.exe application, possibly to facilitate some process\ninjection.\n\nOn May 19, the attackers returned to Computer #5 and used svchost to launch\nNetworkService. The attackers then used a variant of Mimikatz named calc.exe, which was\npreviously used earlier in the attack (SHA256:\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9). Mimikatz\nwas used to dump credentials from the compromised host.\n\nOn May 24, the attackers turned their attention to Computer #3, using PsExec to execute the\nwhoami command and determine the currently logged-in user. They then ran an unknown\nbatch file name t.bat via PsExec.\n\nIt is likely the following commands were executed from this script in order to create a new\nuser account:\n\nnet user [REDACTED]\nCSIDL_SYSTEM\\net1 user [REDACTED] Asd123.aaaa /add\nnet localgroup [REDACTED] [REDACTED]/add\nCSIDL_SYSTEM\\net1 localgroup [REDACTED] /add\nCSIDL_SYSTEM\\net1 user [REDACTED] Asd123.aaaa /add\n\nThe script uses net.exe to check if a specific user account already exists. It then attempts to\ncreate a user account with the password Asd123.aaaa and add it to the local group on the\nmachine. Several minutes later, the task manager was launched followed by a command\n\n\n-----\n\nprompt. The attackers then ran the following command to mount a snapshot of the active\ndirectory server.\n\nntdsutil snapshot \"mount c2b3e2c6-1ffb-4625-ba8e-3503c27a9fcb\" quit quit\n\nThese snapshots contain sensitive information such as the active directory database (i.e.\nuser credentials) and log files. The string c2b3e2c6-1ffb-4625-ba8e-3503c27a9fcb is the\nindex number of the snapshot.\n\nThe attackers then moved to Computer #5, where they used ProcDump (file name: p.exe,\nSHA256: 2f1520301536958bcf5c65516ca85a343133b443db9835a58049cd1694460424) to\ndump credentials from LSASS:\n\np.exe -accepteula -ma lsass.exe lsass2.dmp\n\nOn May 26, the attackers returned to Computer #1 and executed a file called go64.exe. This\nfile was a copy of Fscan. The attackers ran the following command to mass scan for any\nmachines within the compromised network (specifically a class C scan against machines in\nthe IP range 10.72.0.0 → 10.72.0.255) with RDP services:\n\ngo64.exe -h 10.72.0.101/24 -pa 3389\n\nThere is also evidence that the attackers leveraged Fscan in order to perform exploit\nattempts against other machines on the network, including leveraging one of the ProxyLogon\n[vulnerabilities (CVE-2021-26855) against an Exchange Server. Suspicious SMB activity also](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-26855)\noccurred around this time, suggesting the attackers may have also leveraged other exploits\n(likely EternalBlue) against any open SMB services.\n\nOn June 6, the attackers ran PsExec on Computer #3 to launch the previously used old\nversion of Crash Handler (file name: winnet.exe) from the %USERPROFILE%\\public\\\ndirectory.\n\nThey ran the Dnscmd utility again to enumerate all available zones, before executing\nwinnet.exe again and a copy of Crash Handler located at APPDATA%\\t.exe to load additional\nmalicious payloads (likely used to install ProcExplorer):\n\nDnscmd . /EnumZones\n\"CSIDL_COMMON_APPDATA\\t.exe\"\n\nSeveral hours later, ProcExplorer (64-bit) was launched:\n\n\"CSIDL_PROFILE\\desktop\\processexplorer\\procexp64.exe\"\n\nThe last known malicious activity occurred on July 8 on Computer #3. The system hive file\nwas dumped from the registry in order to dump user credentials.\n\n\n-----\n\nreg save HKLM\\SYSTEM system.hiv\n\n## Payloads\n\nWhile this group of attackers was previously using ShadowPad, it has since moved on and\nhas been deploying a range of payloads.\n\nOne of the payloads used was a previously unseen, feature-rich information stealer\n(Infostealer.Logdatter), which appeared to be custom built. Its capabilities included:\n\nKeylogging\nTaking screenshots\nConnecting to and querying SQL databases\nCode injection: Reading a file and injecting the contained code into a process\nDownloading files\nStealing clipboard data\n\nOther payloads used by the attackers included:\n\nPlugX/Korplug Trojan\nTrochilus RAT\nQuasarRAT\nLadon penetration testing framework\nNirsoft Remote Desktop PassView: A publicly available tool that reveals the password\nstored by the Microsoft Remote Desktop Connection utility inside .rdp files\nA Simple Network Management Protocol (SNMP) scanning tool\nFscan: A publicly available intranet scanning tool\nNbtscan: A command-line tool that scans for open NETBIOS name servers\nFileZilla: A legitimate FTP client\nFastReverseProxy: A reverse proxy tool\nWebPass: A publicly available password collection tool\nTCPing: A publicly available tool that enables pings over TCP\nVarious process dumpers\nVarious keyloggers\nA number of PowerSploit scripts\n\n## Links to earlier activity\n\nShadowPad is a modular RAT that was designed as a successor to the Korplug/PlugX Trojan\nand was, for a period of time, sold on underground forums. However, despite its origins as a\npublicly available tool, it has since been closely linked to espionage actors. The tool was only\nsold publicly for a very short period of time and it is believed that it was only sold to a handful\nof buyers.\n\n\n-----\n\nThere is limited evidence to suggest links to past attacks involving the Korplug/PlugX\nmalware and to attacks by a number of known groups, including Blackfly/Grayfly (APT41)\nand Mustang Panda. For example, the attackers leveraged a legitimate file called\nHPCustParticUI.exe, which was developed by HP for digital imaging applications. This\n[previously occurred in attacks involving Korplug/Plug X. Furthermore, the attackers used a](https://unit42.paloaltonetworks.com/thor-plugx-variant/)\nfile called hpcustpartui.dll as a likely loader. The same loader was used in a long-running\ncampaign involving Korplug/Plug X targeting the Roman Catholic Church.\n\nThe current campaign uses a legitimate Bitdefender file to side-load shellcode. This same file\n[and technique were observed in previous attacks linked to APT41. We have also observed](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/)\n[the same keylogging tool deployed in previous attacks against critical infrastructure in South](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/critical-infrastructure-south-east-asia-espionage)\nEast Asia.\n\nThe use of legitimate applications to facilitate DLL side-loading appears to be a growing\ntrend among espionage actors operating in the region. Although a well-known technique, it\nmust be yielding some success for attackers given its current popularity. Organizations are\nencouraged to thoroughly audit software running on their networks and monitor for the\npresence of outliers, such as old, outdated software or packages that are not officially used\nby the organization.\n\n## Protection/Mitigation\n\n[For the latest protection updates, please visit the Symantec Protection Bulletin.](https://www.broadcom.com/support/security-center/protection-bulletin)\n\n## Indicators of Compromise\n\nIf an IOC is malicious and the file available to us, Symantec Endpoint products will detect\nand block that file.\n\n**Legitimate applications abused for side-loading**\n\n386eb7aa33c76ce671d6685f79512597f1fab28ea46c8ec7d89e58340081e2bd – Bitdefender\nCrash Handler (2011)\n\n**Loaders**\n\n1a95c0b8046aafa8f943bd6b68f3de550177f8df8c382f12468c4dcb416b12bc – log.dll\n\n138c82c81ed7b84378a821074c88157c489d29d5ef66080baea88f5de0e865e6 – log.dll\n\n704e6eb9bded6d22feab88fa81e6b0b901bee7a451a290c20527c48c235ebf52 – breakpad.dll\n\n7a25b21df9fa93a694f15d18cd81c9f9be6fc078912924c91c645f75a5966881 – breakpad.dll\n\n1d6aabf2114f9e6367b515d4ebfc6e104511ff4b05bd51a56fa52070c1d40e25 – breakpad.dll\n\n\n-----\n\n5bedd1b05879b900b60a07abc57fab3075266ee7fa72385ced582699a51f1ec7 – breakpad.dll\n\n49c23a187810edd3c16689ee1766445ec49a7221507dbe51e7b5af8ec46a91ee –\nbreakpad.dll\n\ne51fc50defd89da446ddc0391e53ace60b016e497c5cb524fd81efdeadda056d – breakpad.dll\n\n**Payloads**\n\n2237e15b094983a79f60bc1f7e962b7fb63aae75cbf5043ee636be4c8fdb9bee – Korplug\n\nb7f6cf8a6a697b254635eb0b567e2a897c7f0cefb0c0d4576326dc3f0eb09922 – Korplug\n\n1c7e2d6ae46ff6c294885cb7936c905f328b303d6f790b66d7c4489f284c480a – QuasarRAT\n\nc3ae09887659cde70d636157c5a0efd36359efdfb2fe6a8e2cdd4e5b37528f51 – TrochilusRAT\n\n**Additional tools**\n\nfa7eee6e322bfad1bb0487aa1275077d334f5681f0b4ede0ee784c0ec1567e01 – NBTScan\n\nd274190a347df510edf6b9a16987cea743d8df0e4c16af10787a31f0fec66da2 – NBTScan\n\n20c767d32304ed2812ed8186dc14ddaaae581481c6dee26447a904fcaa67db2a – NBTScan\n\ncf5537af7dd1d0dbb77e327474aa58b2853cb1a1d4190991ac3d9ca40b7841aa – NBTScan\n\ndf9a2471c23790a381e286bb96ea3401b94686b7ca067297a7920a76a7202112 – NBTScan\n\n05fb86d34d4fa761926888e5347d96e984bbb1f3b693fe6c3ab77edb346f005b – FScan\n\naba3e885768a6436b3c8bc208b328620f001c63db7a3efe6142e653cdf5dfbf7 – FScan\n\n0f81c3850bc82a7d1927cf16bfad86c09414f8be319ef84b44a726103b7d029d – Powerview\n\n9f04c46e0cdaa5bce32d98065e1e510a5f174e51b399d6408f2446444cccd5ff – TCPing\n\n12534f7014b3338d8f9f86ff1bbeacf8c80ad03f1d0d19077ff0e406c58b5133 – Ladon\n\n23d0eff3c37390d38e6386a964c88ac2dafbace92090a762ae9e23bd49510f09 – WebPass\n\n3e53deb5d2572c0f9fae10b870c8d4f5fdc7bd0fe1cc3b15ca91b31924373136 – WebPass\n\n2f1520301536958bcf5c65516ca85a343133b443db9835a58049cd1694460424 – ProcDump\n\n912018ab3c6b16b39ee84f17745ff0c80a33cee241013ec35d0281e40c0658d9 – Mimikatz\n\n\n-----\n\n38d4456b38a2896f23cad615e3c9167e65434778074a9b24af3cbc14d1e323bf – cmd.exe\n(tampered copy of legitimate cmd.exe)\n\n77358157efbf4572c2d7f17a1a264990843307f802d20bad4fb2442245d65f0b –\nProcessExplorer\n\n**Network**\n\n88.218.193.76 (used to host malware)\n\n8.214.122.199\n\n103.56.114.69\n\n27.124.17.222\n\n27.124.3.96\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to\ninvestigate targeted attacks, drive enhanced protection in Symantec products, and offer\nanalysis that helps customers respond to attacks.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-13 - New Wave of Espionage Activity Targets Asian Governments.pdf"
    ],
    "report_names": [
        "2022-09-13 - New Wave of Espionage Activity Targets Asian Governments.pdf"
    ],
    "threat_actors": [
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1691c25f-1aa4-4168-8ce2-7aa8f23246e7",
            "created_at": "2024-06-04T02:03:07.724221Z",
            "updated_at": "2025-03-27T02:05:17.284601Z",
            "deleted_at": null,
            "main_name": "BRONZE PRESIDENT",
            "aliases": [
                "Mustang Panda ",
                "Red Lich ",
                "Temp.Hex ",
                "HoneyMyte "
            ],
            "source_name": "Secureworks:BRONZE PRESIDENT",
            "tools": [
                " Cobalt Strike",
                " ORat",
                " PlugX",
                " RCSession",
                "China Chopper"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536256,
    "ts_updated_at": 1743041807,
    "ts_creation_date": 1664713168,
    "ts_modification_date": 1664713168,
    "files": {
        "pdf": "https://archive.orkl.eu/66a2ba31e8b64acc4ff4d79b3d921bed6806310d.pdf",
        "text": "https://archive.orkl.eu/66a2ba31e8b64acc4ff4d79b3d921bed6806310d.txt",
        "img": "https://archive.orkl.eu/66a2ba31e8b64acc4ff4d79b3d921bed6806310d.jpg"
    }
}