{
    "id": "3834142f-ca23-4f33-911f-34ccc0f4092c",
    "created_at": "2023-01-12T15:02:00.258778Z",
    "updated_at": "2025-03-27T02:09:29.362216Z",
    "deleted_at": null,
    "sha1_hash": "80938492b2ec503d934846a75059531acb19da65",
    "title": "2022-12-15 - BrasDex- A new Brazilian ATS Android Banker with ties to Desktop malware",
    "authors": "",
    "file_creation_date": "2022-12-29T00:31:05Z",
    "file_modification_date": "2022-12-29T00:31:05Z",
    "file_size": 4201739,
    "plain_text": "# BrasDex: A new Brazilian ATS Android Banker with ties to Desktop malware\n\n**threatfabric.com/blogs/brasdex-a-new-brazilian-ats-malware.html**\n\nBlog\n\n15 December 2022\n\n## A varied and wild landscape\n\n\n-----\n\nThe mobile malware landscape of the LATAM region, more specifically Brazil, has recently risen to prominence in the\nnews due to families like Brata and Amextroll, extending their reach all the way to Europe. ThreatFabric has already\nreported in length about these families. However, not all malware developed in South America targets the European\nmarket.\n\nIn fact, ThreatFabric analysts discovered an ongoing multi-platform malware campaign, targeting both mobile and\ndesktop Brazilian users, with thousands of infections and with an estimated loss of hundreds of thousands of\n**Brazilian Reals (R$), which corresponds to tens of thousands of USD.**\n\nThis campaign involves a highly flexible novel Android malware dubbed BrasDex by ThreatFabric, featuring a complex\nkeylogging system designed to abuse Accessibility Services to extract credentials specifically from a set of Brazilian\ntargeted apps, as well as a highly capable Automated Transfer System (ATS) engine.\n\nWhen analyzing BrasDex, our team found the evidence of some desktop malware controlled through the same backend.\nOur analysts were able to identify the malware samples related to the same campaign targeting Brazilian users as well:\nit involves [Casbaneiro, a well-known malware family known to be active in Latin America.](https://www.welivesecurity.com/2019/10/03/casbaneiro-trojan-dangerous-cooking/)\n\n## BrasDex: a trend switch away from overlay attacks\n\nThe malware has been active for more than a year, initially posing as Android settings applications and targeting\nBrazilian banking applications. In its latest campaign, it started posing as one specific Banking application (Banco\nSantander BR), but continuing to target the same subset of applications as its previous versions.\n\nBrasDex abuses accessibility services to keylog the information that is input in the target application, veering away from\nthe traditional overlay attack mechanism that we have observed for years now, towards what seems to be the next\nstandard in Android banking malware.\n\nThis follows a trend that we have started to see in the past year, where different malware families have started\nabandoning the use of overlays, which require continuous update and additional downloaded data, in favour of more\nlean and flexible solutions. For example, in the case of Vultur this solution was to perform screen-recording and\nsubsequently accessibility logging, in the case of Cabassous it was to load the real target login page in a browser\ncontrolled by the malware, with JavaScript enabled.\n\n\n-----\n\nHowever, in most cases, malware families are starting to rely heavily on accessibility logging to exfiltrate logging\ncredentials and other PII from infected victims. This is also the case for BrasDex. This malware family is able to log not\nonly credentials, but also other important information, like account balance, and then use it to perform a DTO (Device\nTakeOver), which allows criminals to perform fraudulent transactions using the infected device.\n\nWhat sets BrasDex apart from many other malware families is its ATS (Automated Transfer System) capabilities. ATS\nallows malware to programmatically use the information stolen from the victim to initiate fraudulent transactions in an\nautomated way, making the whole infection and fraud chain more flexible and scalable.\n\nThreatFabric has mentioned ATS before in our blogs, as one of the most dangerous features present in modern day\nmalware, specifically when speaking about Bankers such as Gustuff, the first Banker to implement this technique in\n2018, and more recently SharkBot.\n\n## Targets\n\nBrasDex is a malware family strictly focused on the Brazilian market. The malware contains checks to make sure it only\noperates on devices from Brazil. To do so, it programmatically checks that the SIM used by the device is operating in\nBrazil, and only then it properly completes its operations and configurations. If the device has a SIM card from anywhere\nelse, the malware shuts down and never contacts its C2 server.\n\nThis hard complete dedication to a single market might be motivated by the fact that BrasDex uses its features to abuse\none specific subset of transactions within the Brazilian banking ecosystem. BrasDex specifically abuses the Pix\npayment system. Pix is a fast payment system from the Central Bank of Brazil that went live in 2020, and allows users\nto perform payments to other users just by knowing their identifier (which can be an email, CPF, phone number, or\nrandom ID).\n\n**NOTE:** **ThreatFabric wants to point out that the Pix system is not vulnerable. Actors are not exploiting any**\n**vulnerabilities in the Pix System, but rather abusing the fast payments system and Android known issues to**\n**make fraudulent transfers**\n\n\n-----\n\nBloomberg referred to the Pix app as “ubiquitous” in Brazil in October 2021, a year after Pix’s release. As of November\n2022, Pix has been reported to perform an average of more than 2 million monthly transactions, with a user base of\nmore than 120 million people. Only in November 2022, Pix was used to perform transactions corresponding to a\n**volume of more than one billion Brazilian Reals (R$), which equals to more than 180 million USD ($).**\n\nFor each targeted bank, the step in the ATS script which is responsible for the actual fraudulent transfer performs it\nthrough the Pix technology, not the traditional bank transfer that many other malware families use.\n\n\n-----\n\nThe script will find the UI element corresponding to Pix payments within the banking application, use it to start the\ntransfer procedure, and then navigate through the different screens, selecting the beneficiary and the amount,\nauthenticating with the stolen credentials.\nThis kind of instant payment does not require Multi Factor Authentication, as it\ncan be authorized directly through the banking application itself, making it the perfect target for an Android Banking\nMalware.\nWe will later cover in detail an example of a transfer procedure with such technology.\n\n## Capabilities\n\n### Keylogging\n\nThe keylogging technique used by BrasDex abuses the accessibility services privileges, and is able to detect and log a\nlarge quantity of information from the Operating System. With this technique, BrasDex is able to log and send to its C2\nall the information that is shown on the device’s UI, including both credentials typed by the user, as well as other\ninformation that is displayed by the application itself, like account balance.\n\nIf the application on the foreground is one of the banking applications included in the target list, BrasDex also notifies its\nC2 of events such as opening the application, inserting passwords, or if the malware is incapable of extracting the\nrequired information.\nThe malware notifies the C2 whenever one of the following events is detected, with the indicated\ncodes:\n\n**Event Code** **Description**\n\n(No code) The malware successfully performed a transaction\n\nSTART The banking application was started\n\nPW Password typed (followed by the password as event value)\n\nSTUCK The malware encountered an error and is frozen\n\nABORT The malware aborted its operation for lack of permissions or outdated APIs\n\nThe logged message is formed in the following way (in case of no parameters, the message ends with the event code):\n\n\n-----\n\n```\n----------------------------------------------\nEXAMPLE:   ITA  -   PW   -   1234\n\nEXAMPLE:   BRA  -  START\n\n```\nThe information that is collected by the keylogging module is stored locally and sent to the C2, and is automatically fed\nas parameters into the ATS scripts downloaded with the malware configuration when the malware is first launched.\n\n### ATS\n\nWhat really sets apart this newly discovered malware family from its competition, is its advanced and flexible ATS\nframework. First abused by Gustuff, enhanced and diffused with SharkBot, Automated System Transfer allows the\nmalware to programmatically use the stolen credentials, detect the amount of funds that are available in the account,\nand then initiate and approve a transaction, all from the infected device itself.\n\nIn the case of BrasDex, the infected device receives multiple scripts, one per targeted application, and each containing\nall the necessary steps to login and perform fraud. Each script is made of multiple actions, which contain the following\nfields:\n```\n{\n\n  \"stageId\": n,\n\n  \"conditions\": [\n\n    \"<Condition>-<Parameters>\",\n\n    ...\n\n  ],\n\n  \"run\": [\n\n    \"<Command>-<Parameters>\"\n\n    ...\n\n  ]\n\n}\n\n\n```\n**stageId is an integer number which corresponds to the current step of the script. Actions are executed in**\nconsecutive stageId numbers and scripts feature multiple actions with the same stageId, in order to support\nmultiple alternative execution patterns (e.g. different login procedures based on the kind of PII exfiltrated).\n**conditions is a list of “Condition-Parameters” combinations. These make up the conditions required to initiate the**\nactions.\n**run is a list of “Command-Parameters” combinations. These are the actual actions executed by the malware.**\n\nHere is an example of a real action implemented by one of the scripts:\n\n\n-----\n\nBrasDex is able to check for values and type of data contained in all the different fields of the UI (for example if\nan account contains any funds). It is also able to understand and check if UI elements can be clicked, and if they contain\nspecific strings used to identify useful information (like finding the “Continue” or “Cancel” button).\n\nIf the conditions for an action are satisfied, it also able to navigate within the UI to highlight and focus the wanted\nelements, wait a set amount of time, assign specific values to password fields or beneficiary fields, click buttons within\nthe app.\n\nIn the [Appendix of this blog, you can find the full list of accepted conditions and commands supported by the bot.](https://www.threatfabric.com/blogs/double-trouble-in-latam.html#appendix)\n\n### Pix Transfer example\n\nAs previously mentioned, BrasDex targets the Pix payment system to perform its fraud.\n\nIn the image below you can see a few of the different screens that the malware needs to navigate and interact with to\nsuccessfully perform a successful transaction using Pix.\n\n\n-----\n\nWe report here a subset of the actions described in the ATS script, which interact with the UI elements highlighted in red\nin the above image:\n```\n{\n\n  \"stageId\": 2,\n\n  \"conditions\": [\n\n    \"textC-Pix. Item\"\n\n  ],\n\n  \"run\": [\n\n    \"clickCurrentNode\"\n\n  ]\n\n},\n{\n\n  \"stageId\": 3,\n\n  \"conditions\": [\n\n    \"textCL-cpf\",\n\n    \"acc-CPF\"\n\n  ],\n\n  \"run\": [\n\n    \"clickCurrentNode\"\n\n  ]\n\n},\n{\n\n  \"stageId\": 4,\n\n  \"conditions\": [\n\n    \"textC-+100\",\n\n    \"className-Button\"\n\n  ],\n\n  \"run\": [\n\n    \"next\",\n\n    \"BRASetVal\"\n\n  ]\n\n}\n\n\n\n```\nAs you can see from the above JSON objects, BrasDex in this case transfers funds to an account identified by a CPF\ncode (“Cadastro de Pessoas Físicas”, a unique individual taxpayer identifier in Brazil).\n\n\n-----\n\nThis is another peculiarity of Pix: it allows to perform transactions to accounts which can be identified by CPF, but\n**also phone numbers, emails, or simple unique identifiers.\nThe ATS scripts uses the following codes to identify**\nwhich kind of mule it will be using for the transaction (which is communicated by the C2 during its initial config):\n\n**Destination Code** **Description**\n\nCEL Phone number\n\nEMAIL Email address\n\nCPF Cadastro de Pessoas Físicas\n\nAll kinds of accounts identifiers have been observed being used by BrasDex mules.\n\nOnce the malware finally inputs the necessary passwords to finalize the transaction, funds are transferred to the\ndestination mule account.\n\n## Panel\n\nWhile investigating this malware family, ThreatFabric also managed to get certain visibility of the Panel hosted on the C2\nserver.\nBased on the information displayed on the panel, the malware seems to be quite successful, more than a\nthousand of reported infections.\nThe panel contains multiple pages, e.g. the list of infected devices with extensive\ninformation, which includes the service providers, the device model, and the Android version. In another page, actors\ncan access logs obtained from the infected devices, with the exfiltrated information, as well as reports of successful\ntransactions.\n\nHowever, what really caught our attention was the main landing page. Here, we found a dashboard reporting extensive\ninformation about a different malware campaign, only this time targeting Desktop devices.\n\nThis discovery lead to another investigation, which allowed us to connect this malware family to another malware family:\n**Casbaneiro.**\n\n## Casbaneiro: old but gold\n\n\n-----\n\nThe analysis of the drop points used to distribute BrasDex lead us to a campaign of desktop samples distributed through\nsimilar links in Q1 2022. We analyzed those samples and identified Casbaneiro, infamous Windows banking Trojan\ndiscovered in 2018, as the partner of BrasDex.\n\nSince the campaign is quite old, it could be just a coincidence, but our analysis showed clear similarity between\nBrasDex and Casbaneiro in regards to the communication with their C2 (namely the common use of a specific header).\n\nHowever, to put an end to the debate, while writing our blog we discovered an ongoing campaign of BrasDex and\nCasbaneiro distributed through the same drop point, thus allowing us to conclude that Casbaneiro is the a desktop\nmalware operated by same actors behind BrasDex.\n\nThe latest desktop campaign is the same in MO as previous ones, and we will briefly highlight the most notable parts of\nthe desktop campaign.\n\nIt was delivered through phishing e-mails about a failed delivery, pretending to be from the Brazilian postal service and\ncontaining a link to a form to be filled in.\n\nWhen the victim clicked the link, a ZIP archive was downloaded. This archive contained a Microsoft Software Installer\npackage (MSI). When analyzing the file, we discovered that it contains an obfuscated script that will download the next\nstage of the malware.\n\n\n-----\n\nThe downloaded file is an archive containing AutoIt interpreter and obfuscated AutoIt script. When launched it will\ndownload another archive containing another AutoIt script.\nThe new script is bigger as in contains binary data encoded\nin hex strings. This is the final payload that is decoded and executed by the script.\nThus, this multi-staged process\nresults in the a Delphi payload running on the Windows machine:\n\nWhen analyzing the final payload, our analysts identified it as Casbaneiro, based on the same communication protocol,\nstrings and obfuscation mechanisms used. The sample analyzed uses the same decryption algorithms for string and\npayload decryption as in previously described campaigns. The latest sample analyzed has a compilation date of\nDecember 5th, 2022.\n\n\n-----\n\nCasbaneiro is a Windows banking Trojan written in Delphi that targets users of online banking as well as users of\ndesktop banking applications. It is able to collect the data about the infected device, take screenshots and perform\nkeylogging, hijack clipboard data, etc.\n\nThe following Bitcoin wallet is hardcoded in Casbaneiro to be used to replace a cryptocurrency wallet copied by victim in\nclipboard:\n```\nbc1q23dsv7wnngxj3prwjdegk9e2j6c4rs39qg86xk\n\n\n```\nWhen running, Casbaneiro monitors the launched processes and opened URLs to find those related to banking\napplications. It also downloads bank-specific pictures from Google Drive, and uses them to steal 2FA codes from victim.\nThis last step is done to authenticate to banking application on the actors’ device. For one of the banks such pictures\ncontain QR-codes generated by the actors; the victim is tricked into scanning them with the mobile banking application\nand as a result, a new desktop device (controlled by cyber-criminals) will be authenticated and will have access to\nvictim’s banking account.\n\n## Conclusion\n\nBeing independent and full-fledged malware families, BrasDex and Casbaneiro form a very dangerous pair, allowing the\nactor behind them to target both Android and Windows users on a large scale.\n\nMoreover, the appearance of convenient payment systems not only makes payments comfortable for customers but\nalso opens an opportunity for cyber-criminals to use it for fraudulent operations. The BrasDex case shows the necessity\nof fraud detection and prevention mechanisms in place on customers devices: fraudulent payments made automatically\nwith the help of ATS engines appear legitimate to bank backends and fraud scoring engines, as they are made through\nthe same device that is usually used by customer. Thus, a proper solution is needed on the very first border to identify\nsuspicious behavior during the transaction combined with visibility of threats present on customer’s devices.\n\n## Fraud Risk Suite\n\nThreatFabric’s Fraud Risk Suite enables safe & frictionless online customer journeys by integrating industry-leading\nmobile threat intel, behavioral analytics, advanced device fingerprinting and over 10.000 adaptive fraud indicators. This\nwill give you and your customers peace of mind in an age of ever-changing fraud.\n\n\n-----\n\n## Appendix\n\n### BrasDex Samples\n\n**App Name** **Package name** **SHA256**\n\n\nGoogleDocs\nXML APK\n\nGoogleDocs\nXML APK\n\nSantander\nAtualização\n\n### BrasDex C2\n\n**Url**\n\nbrasdex[.]com\n\n\ncom.mydocs.documents 7747a9912e2605b64430a27e3c5af3556c26b4cb04c7242ca4e2cad5b6b33363\n\ncom.mydocs.documents 26ea3906cd0c724b0e0adb5b6c00144e59aa89aac18cd608c6e5a22c28c8d644\n\ncom.mydocs.documents b549733ed3b77d97c7b2f9f651f22abc4df50899c01612a28ec6809d1a2c0040\n\n\n### BrasDex Targets\n\n**Package name** **Application name**\n\ncom.picpay PicPay: Pagamentos, Transferências, Pix e Cashback\n\ncom.itau Banco Itaú: Gerencie sua conta pelo celular\n\ncom.nu.production Nubank\n\ncom.bradesco Bradesco\n\nbr.com.gabba.Caixa CAIXA\n\ncom.santander.app Santander Brasil\n\nbr.com.original.bank Banco Original\n\nbr.com.intermedium Inter: conta digital completa\n\nbr.com.bb.android Banco do Brasil\n\ncom.binance.dev Binance (not fully developed ATS Script)\n\n### BrasDex Conditions\n\n**Conditions** **Description**\n\nenabled Is enabled\n\ntextEqL Text is equal (lowercase)\n\nprevNodeDescC Previous Node Description contains string s\n\ndescCL Node Description contains\n\ndescEq Node Description equals\n\nprevNodeTextC Previous Node Description contains\n\n\n-----\n\n**Conditions** **Description**\n\ngetBlc Get balance value\n\nprevNodeTextEqL Previous node text equals (lowercase)\n\ntextCL Text contains (lowercase)\n\ntextEq Text equals\n\ngetChildsChildDesc Get description of child of child node\n\ngetChildsChildText Get text of child of child node\n\nisClickable Node is clickable\n\nclickNodeVerify Click node passed as parameter\n\ngetChildDesc Get child node description\n\ngetChildText Get child node text\n\nclassName Get className\n\nacc Check type of account (EMAIL,CPF,CEL)\n\nblc Check balance\n\nclickNodeParentVerify Click parent node\n\nisParentClickable is parent node clickable\n\ndescC Description contains\n\nhintC Hint contains\n\nisNum Is number\n\nnoBlc Check if no balance\n\ntextC Text contains\n\ndisabled Is disabled\n\nresName Get view id resource name\n\nprevNodeDescCL Previous node description contains lowercase\n\nprevNodeDescEq Previous node description equals\n\nprevNodeTextCL Previous node text contains lowercase\n\nprevNodeTextEq Previous node text equals\n\ngetCounter Get saved value of specified string\n\nclickCurrentNodeVerify Click current node\n\nisStuck Check if engine is stuck on some action (100 secs)\n\ngetNodeListSize Get node list size\n\n### BrasDex Actions\n\n**Actions** **Description**\n\n\n-----\n\n**Actions** **Description**\n\nBRASetVal Set value for com.bradesco\n\nclickNode Click node\n\naddCounter Create/add new counter\n\nORISetVal Set value for br.com.original.bank\n\ntemplate Set colors for template to overlay\n\nfinish Finish execution and send data to c2\n\naddNode Add node to node list\n\nclickNodesParent Click nodes parent\n\nclickCurrentNode Click current node\n\nreturn Stops recursive search in nodes\n\nsetAcc Set account\n\nsetBlc Set balance value (from either text or description)\n\nNUSetVal Set value for com.nu.production\n\nINTSetVal Set value for br.com.intermedium\n\nclickCurrentsChildNode Click current node child\n\nCXSetVal Set value for br.com.gabba.Caixa\n\nSetPwCharAt Set password char by char\n\nact Give accessibility focus to the node\n\nback Press back\n\nhome Press home\n\nnext Press next\n\nwait Wait set time\n\nsetPw Set password value\n\nincreaseCounter Increase specified counter by one\n\nlogTemplate Present window to log specific data\n\nSANSetVal Set value for com.santander.app\n\nfocusCurrentNode Get action focus to the current node\n\nrecents Press recents\n\nsetBlcBB Set balance value for banco do brasil bank\n\nITASetVal Set value for com.itau\n\nfocusNode Get action focus to the specified node\n\nsleepTolerance Set sleep tolerance before aborting\n\nsetBlc2 Set balance value (from either text or description)2\n\n\n-----\n\n**Actions** **Description**\n\nsetText Set Text\n\n### Casbaneiro samples\n\n**SHA 256**\n\n5a3b2128c550829ab357abd7c830506df73893e204a8e2578fc1e61a72de3df5\n\n519d76eb6fea8b1a699c3a543b5f5eafab883ed92f6d207b8fa0189482b72ba1\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-15 - BrasDex- A new Brazilian ATS Android Banker with ties to Desktop malware.pdf"
    ],
    "report_names": [
        "2022-12-15 - BrasDex- A new Brazilian ATS Android Banker with ties to Desktop malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535720,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1672273865,
    "ts_modification_date": 1672273865,
    "files": {
        "pdf": "https://archive.orkl.eu/80938492b2ec503d934846a75059531acb19da65.pdf",
        "text": "https://archive.orkl.eu/80938492b2ec503d934846a75059531acb19da65.txt",
        "img": "https://archive.orkl.eu/80938492b2ec503d934846a75059531acb19da65.jpg"
    }
}