{
    "id": "3839974a-d672-486c-a26e-8b4642215fd3",
    "created_at": "2023-01-12T15:01:34.698414Z",
    "updated_at": "2025-03-27T02:16:26.461777Z",
    "deleted_at": null,
    "sha1_hash": "5c79906e9d2678778b5b448887a95a5d5b224b27",
    "title": "2019-02-20 - Combing Through Brushaloader Amid Massive Detection Uptick",
    "authors": "",
    "file_creation_date": "2022-05-27T21:31:40Z",
    "file_modification_date": "2022-05-27T21:31:40Z",
    "file_size": 1796576,
    "plain_text": "# Combing Through Brushaloader Amid Massive Detection Uptick\n\n**[blog.talosintelligence.com/2019/02/combing-through-brushaloader.html](https://blog.talosintelligence.com/2019/02/combing-through-brushaloader.html)**\n\n## Executive Summary\n\n\n-----\n\nOver the past several months, Cisco Talos has been monitoring various malware distribution\ncampaigns leveraging the malware loader Brushaloader to deliver malware payloads to\nsystems. Brushaloader is currently characterized by the use of various scripting elements,\nsuch as PowerShell, to minimize the number of artifacts left on infected systems.\nBrushaloader also leverages a combination of VBScript and PowerShell to create a Remote\nAccess Trojan (RAT) that allows persistent command execution on infected systems.\n\nBrushaloader is an evolving threat that is being actively developed and refined over time as\nattackers identify areas of improvement and add additional functionality. We have identified\nmultiple iterations of this threat since mid-2018. Most of the malware distribution activity that\nwe observe associated with Brushaloader leverages malicious email campaigns targeting\nspecific geographic regions to distribute various malware payloads, primarily Danabot.\n[Danabot has already been described in detail here and](https://www.welivesecurity.com/2018/09/21/danabot-targeting-europe-adds-new-features/) [here, so this post will focus on the](https://www.welivesecurity.com/2019/02/07/danabot-updated-new-cc-communication/)\nanalysis of Brushaloader itself. Talos has recently identified a marked increase in the quantity\nof malware distribution activity associated with Brushaloader, as well as the implementation\nof various techniques and evasive functionality that has resulted in significantly lower\ndetection rates, as well as sandbox evasion.\n\n[The advanced command-line auditing and reporting available within ThreatGrid make](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nanalyzing threats such as Brushaloader much more efficient. Threats such as Brushaloader\ndemonstrate the importance of ensuring that PowerShell logging is enabled and configured\non endpoints in most corporate environments.\n\n## History of Brushaloader\n\nThe first Brushaloader campaign that caught our attention was back in August 2018. It was\ninitially notable because it was only using Polish language emails targeting Polish victims.\nAlthough it is common to see threats target users in multiple languages, attackers typically\ndon't target a single European country. Below is a sample of one of the emails from that\ninitial campaign and shows the characteristics that we would come to expect from\nBrushaloader: a RAR attachment containing a Visual Basic script that results in a\nBrushaloader infection ending in the eventual download and execution of Danabot.\n\n\n-----\n\nThere is one other characteristic of this email that will remain a thread throughout all\nBrushaloader campaigns: \"Faktura,\" or the Polish word for invoices. There will be a few\nvariations of this over the next several months, but regardless of language, invoices and\nbilling will always play a vital role in these spam campaigns.\n\nAs far as the attachment itself, it typically consists of a RAR file with a filename that contains\nthe word \"faktura.\" The RAR files typically contain a VBScript that reaches out for additional\npayloads. The script itself already had some interesting techniques associated with sandbox\nor network simulation evasion, which we will discuss later in the blog. This script wasn't\nheavily obfuscated, and efficiently established command and control (C2) communication\nwith a hard-coded IP address via HTTP using wscript. The specific URL being queried in this\nparticular campaign was:\n\n_http://162[.]251[.]166[.]72/about.php?faxid=446708802&opt=._\n\nOver time, a pattern started to emerge: The campaigns would run for a week or two and then\ngo quiet for a couple of weeks before restarting. The modus operandi for the actor was\nlargely the same throughout, Polish language spam campaigns related to invoices or\n\"Faktura\" that contained a RAR file with malicious VBScript inside. One thing of note about\nthese campaigns is in the downtime changes and improvements were being made to the\nway the VBScript tries to evade detection and analysis or how the C2 communication was\nestablished. Let's walk through some examples.\n\n### Network simulation evasion, multi-path C2 implemented\n\nThe second major campaign we analyzed had already added some functionality. Initially, the\nthreat was trying to connect to a non-existent domain to check for things like network\nsimulation. This second campaign implemented an \"infinite\" recursive loop that continues to\n\n\n-----\n\nrepeat itself if that GET request resulted in an HTTP/200 indicating a successful request.\nHere is a quick screenshot showing that new functionality.\n\nThis simple snippet of code includes the GET request to a non-existent domain\n(www[.]dencedence[.]denceasdq) (1), the steps taken if an HTTP/200 is provided in\nresponse to that request (2), and finally enters an \"infinite\" recursive loop when an HTTP/200\nis found (3). This is an elegant, simple way to determine if network simulation is occurring\nand delaying malicious execution. These simple techniques can be incredibly effective at\navoiding some types of detection and analysis.\n\nA campaign that launched just a few days later had already gone through some additional\nrevisions. Early versions of the script only communicated via hard-coded IP address. This\ncampaign implemented a random choice between a domain and a hard-coded IP. Below is\nan example of this type of evolution.\n\n\n-----\n\nThe function at the top of the capture shows the initial C2 request. You can see that request\nincludes some new variables and functionality (1) which randomly choose one of the two\noptions listed further down in the DaLoweRsxMinsa function (2). It is here you can see both\nthe hard-coded IP address (192[.]3[.]204[.]226) and a domain (emailerservo[.]science)\nhosted on a different server that responds to the same path. This particular functionality\nwould remain for the next couple of months with some subtle changes as time progressed.\n\n### Legitimate URLs added to obfuscate\n\nOver the next couple of campaigns throughout the rest of September and early October,\nthere were subtle changes around the non-existent domains being used, and the ways they\ntried to obfuscate the C2 communication, but no significant changes. In early October, the\nactors added a third legitimate domain to the round robin, which can be seen below:\n\nHere, the actors have added google[.]com to the potential sources of C2 communication.\nOver the next several months, the legitimate site changed to include such sites as\nwww[.]ti[.]com and www[.]bbc[.]com, among others. This was yet another simplistic approach\n\n\n-----\n\nat sandbox evasion where, periodically, the VBScript would do nothing more than send a\nrequest to a legitimate domain.\n\n### Streamlined version emerges\n\nThere were more significant changes taking place during October 2018, including the\nremoval of the non-existent domain check and instead implementing what appears to be a\nregistry check in wscript to try and read a value from the registry. It appears to be using this\nfor some permissions check, but all users of all privilege levels would be able to query the\nkey HKEY_CURRENT_USER. Below is a screen capture of this check as it was\nimplemented.\n\nThis check and functionality were relatively short-lived, since in the last couple days of\nOctober, the actors shifted away from WScript entirely and shifted the majority of the\nfunctionality to Internet Explorer directly. In addition to switching to Internet Explorer for web\ncommunications, the VBScript was streamlined considerably and went from being a 4KB text\nfile to being less than 1KB. Below is a screen capture of the entire VBScript. A majority of the\nchecking and evasion techniques were removed, except some extended sleep commands to\ntimeout some sandbox technologies.\n\n\n-----\n\nNote the highlighted section shows the creation of an invisible IE instance for the script to\nuse to communicate with the C2 server. Additionally, the actors stopped using domains\naltogether and returned to hosting everything using hard-coded IP addresses.\n\n### New campaign, new languages targeted\n\nIt was also around this time that Cisco Talos started to observe the spam campaign\nbeginning to target languages besides Polish. The first campaign involving multiple\nlanguages included launched around this same time, an example of the German campaign is\nshown below.\n\n\n-----\n\nThe subject of this particular campaign appears to focus on income tax returns. However, the\nbody of the email is making references to an attachment of unpaid bills and threatens the\nrecipient with legal action if payment is not remitted. The actors also took advantage of the\nfact that \"Faktura\" translates to billing in German, as opposed to invoices in Polish.\n\nAfter a couple more weeks, around mid-November, the actors began to re-implement some\nof the non-existent domain checking an example of which is shown below.\n\nIn this particular instance, the actors would craft an HTTP request to\nhttp://someserver/folder/file[.]pdf and implements a loop in an HTTP/200 if found. A few days\nlater, the actors shifted again and moved from using hard-coded IP addresses to leveraging\ndomains for the initial C2 communication.\n\n### End of November overhaul\n\nThe campaign at the end of November brought a full re-work of the VBScript implementing\n\n\n-----\n\nseveral improvements. The first change is that the VBScript begins by creating a file system\nobject, which allows the actors to start reading and writing files to disk.\n\nThe script initiates the function below which immediately makes use of the file system\nobjects.\n\nThe WriteFile and readFile functions are shown below and allow a file to be written to the\nsystem and read back by the script. Note there are a few seconds of sleep between these\ncalls.\n\n\n-----\n\nThe WriteFile function specifically creates a file in the temporary folder and then writes the\nASCII text \"test\" to the file with reference to vbCrLf, this is a remnant of the early days of\nVBScripting and will return the value \"\\r\\n\" effectively creating a new line. The readFile\nfunction then reads the line containing \"test\" and stores it in a variable strLine for usage later.\n\nThe actors then referenced what is effectively a sleep function and then called the function\nHttpsSend. This is where some of the significant changes occurred in the C2 communication.\nBelow is that HttpsSend function.\n\nThere are a couple of critical changes here to note. First is the adversaries have moved to\nHTTPS traffic and are utilizing a domain instead of a hard-coded IP. Additionally, the type of\n\n\n-----\n\nrequest has changed from a GET to a POST. After the request is made, the response is\nstored and eventually makes its way into an array. At this point, another quick sleep of 10\nseconds is implemented before another function Emulator is called, which is shown below.\n\nThe Emulator function is checking to ensure that the file that was created and written earlier\nin the script worked and the stored line that was read from the file has a value of \"test.\" If the\nfile has the expected contents, then the script will execute whatever command was sent by\nthe C2 server queried above and stored into the array \"ArrAddMyArray.\" Going back to the\nprimary function, you can see this is done in a while loop that would allow for repeated\nrequest and execution providing a simple framework for some level of additional infection.\n\n\n-----\n\nAll of the various campaigns that have been described in this section were of moderate\nvolume and ceased toward the end of November. The actor and loader would remain quiet\nfor all of December and most of January. However, in late January and early February that\nchanged.\n\n## Current Campaigns\n\nA new spam campaign kicked off in late January delivering malicious RAR files containing a\nVisual Basic script (.vbs). At the time the majority of the spam messages were in Polish and\nappeared to be targeting Polish users. All of the filenames and subjects were centered on\ninvoices, commonly using \"Faktura\" or some similar term. This campaign began with\nprimarily Polish-based emails, as is typical for this loader, an example of which is shown\nbelow.\n\nThis follows the standard template we've come to expect from brushaloader campaigns,\nthemed around \"Faktura,\" in Polish, and with an attached RAR file containing the malicious\nVBScript file. One other interesting aspect of this campaign was the presence of multiple\nother languages in the campaign. Most notably, we identified additional Italian language\nspam messages as well, an example of which can be found below.\n\n\n-----\n\nThere are a couple of subtle differences in the Italian language version. Specifically, they use\n\"Fattura\" instead of \"Faktura,\" largely because \"Fattura\" is the word for \"invoices\" in Italian.\nThe basic template is the same and contains an invoice-themed RAR file containing a\nmalicious VBS file.\n\nAs far as the attachments are concerned, there have been a couple of additional\nimprovements from the previous version in late November, but the overall functionality is\nprimarily the same.\n\nOne of the most significant changes in this campaign was the move toward PowerShell and\naway from wscript that was previously used to execute commands, gather system\ninformation, and provide additional payloads. Additionally, this campaign was on a scale we\npreviously hadn't seen from Brushaloader and could be an indicator the loader may be ready\nfor more widespread distribution, with the potential to have reach outside of just Europe. The\nfull detail of the new functionality will be covered in a later section of the blog, providing a\ndeeper dive into the HTTPS C2 communications that occurred.\n\nThis campaign ended the first week of February and the activity has been mostly dark since\nthen. Over the last half year, Brushaloader has gone from a new VBScript-based loader with\nsome basic evasion techniques to an increasingly advanced and increasingly distributed\nthreat. The timeline below illustrates how aggressive the development of Brushaloader has\nbeen. If the past is any indication, Brushaloader will be an interesting threat to follow going\nforward.\n\n\n-----\n\n## Evasion/anti-analysis techniques\n\nIn many corporate networks, files that are introduced into the environment are automatically\nsubmitted to automated analysis platforms, such as sandboxes, that will execute the file and\nobserve system activity to determine if the file is malicious or benign before allowing the file\nto be transmitted to the system for which it was initially destined. Threat actors are aware of\nthese security controls and often employ creative mechanisms for bypassing them. In most\ncases, these mechanisms are designed to minimize the amount of malicious file activity so\nthat automated analysis platforms do not detect the file as malicious and allow it to be\ntransmitted further into the network environment.\n\n\n-----\n\nSome techniques include the use of sleep() timers that will cause the malware to wait for a\npredefined period before resuming malicious execution. In other cases, malware distributors\nmight leverage password-protected email attachments that require the user to input\ninformation prior to opening the attachment. These techniques are often successful, as many\nautomated detection and analysis platforms are not designed to interact with sample\nsubmissions in these ways and as a result are not able to properly initiate the infection\nprocess. Brushaloader is no different, and we have recently observed multiple techniques\nbeing leveraged to maximize the success rate of Brushaloader infections.\n\n### User interaction\n\nOne of the changes we have observed over the past couple of months of Brushaloader\ncampaigns is the use of malware downloaders that require user interaction before the\nexecution of malicious behavior on infected systems. Attackers will often make use of\ninfection processes that require user interaction as a way to bypass automated analysis\nplatforms such as sandboxes.\n\nIn the case of Brushaloader, the malicious emails contain RAR archives. The RAR archives\ntypically contain a VBScript (VBS) that is responsible for making an HTTP request to an\nattacker-controlled distribution server to download a malicious PE32 executable. The\nVBScript calls a dialog box that prints various characters of the Fibonacci sequence:\n\nBy default, when the VBS is executed, the following dialog box is presented on the system.\n\n\n-----\n\nThe downloader functionality present within the VBS file does not activate until the OK button\nis selected. This requirement for user interaction could cause issues in many automated\nanalysis platforms that are not configured to handle this sort of requirement properly. This\napproach often results in significantly lower detection rates compared to the downloaders\nused by most commodity malware distributors.\n\n### Fake domains\n\nThe downloader scripts leveraged in various Brushaloader campaigns have also made use\nof invalid domains as a way to determine whether or not the downloader is executed in an\nanalysis environment where network simulation is occurring. In many malware analysis\nenvironments, network simulation is used to allow analysts to interact with malware samples\neven when resources that the malware requests are not available. This is especially helpful\nwhen C2 infrastructure is no longer available, or when analysis is occurring in an\nenvironment that lacks internet connectivity. There are several utilities available that provide\n[this functionality — two of the most commonly used are inetsim and](https://www.inetsim.org/) [FakeNet-NG.](https://github.com/fireeye/flare-fakenet-ng)\n\nIn the case of Brushaloader, they even went so far as to use non-existent TLDs like\nwww[.]weryoseruisasds[.]oedsdenlinsedrwersa or just hostnames instead of legitimate\ndomains like someserver. Obviously, neither of these domains should resolve and it makes\nfor a simple test to determine if this network simulation is in use. In some ways, this\n\n\n-----\n\ntechnique could also be used to aid in the detection of potentially compromised hosts and\nprovides another reason why logging DNS resolutions can be an invaluable tool for analysts\nand security teams.\n\n## Loader functionality\n\nOnce the initial infection process starts, the previously described multi-stage VBS execution\nbegins. The infected system makes an HTTP POST request to the C2 infrastructure. The\nscripting engine then executes the response to the HTTP POST request. This loop is\ndelayed by the server sending WScript.Sleep commands.\n\nThe first stage VBS is responsible for the execution of the following encoded PowerShell\ncommand:\n\nThis encoded PowerShell is executed three times and decodes to:\n\nThis results in an HTTP request to the C2 infrastructure and an additional set of PowerShell\ncommands to be retrieved and executed.\n\n\n-----\n\nThis PowerShell, once decoded, looks like this:\n\nThis code is responsible for establishing a remote, interactive session with the infected\nsystem that is then used to execute commands on the infected system retrieve the command\noutput. At this point, the script loops, waiting for any additional command execution sent from\nthe C2 infrastructure. This communications channel is also used to facilitate the retrieval and\nexecution of various Powershell command that are responsible for using gathering and\ntransmitting information about the system.\n\n\n-----\n\nThe above Powershell is passed to IEX and executed, with the results transmitted back to\nthe C2 server:\n\nAs can be seen in the screenshot above, the loader attempts to enumerate the following\ninformation about systems being infected:\n\nProcessorId\nWindows operating system version\nCurrently logged in Username\nInstalled Antivirus Products\nSystem Make/Manufacturer\nPowershell version\nIP address information\nAvailable memory\nCurrent Working Directory\nSystem Installation Date/Time\nDisplay Adapter Information\n\n\n-----\n\nAll of this information can then be used to determine whether to infect the system with\nadditional malware payloads, or what modules should be delivered to the system in the case\nof a modular malware framework, such as Danabot. In the infections that we observed, this\nwas the final payload delivered to infected systems.\n\nThe Powershell process running on the infected system also achieves persistence by\ncreating a Windows shortcut (LNK) which is added to the Startup directory on the system:\n\nThe LNK shortcut contains Powershell, which is responsible for querying the contents of a\nregistry key for additional commands to execute each time the system is rebooted.\n\nThis registry location contains the following Powershell:\n\nThe above Base64 encoded Powershell decodes to:\n\nThis causes the malware to reach out to the C2 server via HTTPS, likely to retrieve any\navailable commands that the C2 sends to execute in the future.\n\n## Campaign distribution over time\n\nCisco Talos has been monitoring malware distribution campaigns associated with\nBrushaloader since mid-2018. Historically, these campaigns have been relatively low volume\ncompared to other commodity malware distribution campaign activity, such as [Emotet. In](https://blog.talosintelligence.com/2019/01/return-of-emotet.html)\nmost of the cases we analyzed, the majority of the distribution activity occurred towards the\nend of each month. This recently changed — we have observed a significant increase in the\nvolume and duration of the malspam campaigns.\n\nBelow is a graph showing current distribution activity when compared to the volume seen in\ncampaigns observed throughout most of 2018.\n\n\n-----\n\nIn addition to changes in the volume with which distribution activity is occurring, we have also\nobserved changes in the demographic data associated with the intended recipients of\nmalicious emails. Initially, these campaigns appear to have used relatively narrow targeting,\nwhich the majority of the emails tailored toward recipients in Poland, we have observed\nnewer campaigns branching out to target recipients in Germany, Italy, and other countries as\nwell.\n\n## Conclusion\n\nThe threat landscape is ever changing — this is true for both the malware and the\nmechanisms to deliver the malware, like Brushaloader. This blog outlines yet another key\nexample of how these loaders are changing and evolving constantly. The things that make\nBrushaloader stand out are how quickly threat actors evolved the loader, indicating it is\nactively in development. Additionally, it's interesting to note that after the long break over\nDecember and most of January, the loader has exploded onto the scene. Going from smallscale campaigns targeting exclusively Polish users to branching out in both scale and\ncountries being targeted. It's not common to see regional specific usage of loaders, which\nBrushaloader does.\n\nThis is also a key example of the levels of obfuscation and sophistication these loaders can\nposses. This simple VBS based campaign implemented several clever evasion and\nobfuscation techniques in a minimal amount of code, showing that adversaries will continue\nto think outside the box and develop novel ways to deliver threats to users. This is why users\nneed organizations with visibility around the world, since it's just a matter of time until this\nsuccessful loader starts being sought out by other attackers looking to deliver threats. We will\ncontinue to monitor this threat and the payloads it provides and will continue to be vigilant in\nprotecting our customers from any evolutions that will inevitably occur.\n\n\n-----\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), andMeraki MX can detect malicious activity](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## Indicators of Compromise\n\nThe following Indicators of Compromise (IOCs) have been observed as being associated\nwith various campaigns leveraging Brushaloader to install malware on systems.\n\n(Thank you to [Kafeine for sharing additional sample data.)](https://twitter.com/kafeine)\n\n\n-----\n\n### Malicious Attachments\n\nThe following IOCs are associated with the malicious attachments observed as part of\nmalicious spam campaigns.\n\n**RAR Files**\n\n[A list of hashes associated with the malicious RAR archives can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5c6d7a32eda38.txt)\n\n**VBS Files**\n\n[A list of hashes associated with malicious VBS files can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5c6d7a4e78bd6.txt)\n\n### Domains\n\ncheapairlinediscount[.]site\n\nemailerservo[.]science\n\nfaxpctodaymessage[.]press\n\nfaxpctodaymessage[.]space\n\nfaxpctodaymessage[.]website\n\nfaxzmessageservice[.]club\n\nfazadminmessae[.]info\n\nhousecleaning[.]press\n\nhrent[.]site\n\nirepare[.]site\n\nmacmall[.]fun\n\nmanagerdriver[.]website\n\nmantorsagcoloms[.]club\n\nmediaaplayer[.]win\n\nmobileshoper[.]science\n\nplomnetus[.]club\n\nppservice[.]stream\n\nprogresservesmail[.]science\n\nproservesmail[.]science\n\nproservesmailing[.]science\n\nsearchidriverip[.]space\n\nservemai[.]science\n\nservemaining[.]science\n\nserveselitmail[.]science\n\nserveselitmailer[.]science\n\nservesmailelit[ ]science\n\n\n-----\n\nservesmailerpro[.]science\nservesmailerprogres[.]science\nservespromail[.]science\nservicemaile[.]science\nserviveemail[.]science\nservoemail[.]science\nservomail[.]science\n\n### IP Addresses\n\n107[.]173[.]193[.]242\n\n107[.]173[.]193[.]243\n\n107[.]173[.]193[.]244\n\n107[.]173[.]193[.]246\n\n107[.]173[.]193[.]247\n\n107[.]173[.]193[.]248\n\n107[.]173[.]193[.]249\n\n107[.]173[.]193[.]250\n\n107[.]173[.]193[.]251\n\n107[.]173[.]193[.]252\n\n107[.]173[.]193[.]253\n\n162[.]251[.]166[.]72\n\n172[.]245[.]159[.]130\n\n185[.]212[.]44[.]114\n\n192[.]3[.]204[.]226\n\n192[.]3[.]204[.]228\n\n192[.]3[.]204[.]229\n\n192[.]3[.]204[.]231\n\n192[.]3[.]204[.]232\n\n192[.]3[.]204[.]233\n\n192[.]3[.]204[.]234\n\n192[.]3[.]204[.]235\n\n192[.]3[.]204[.]236\n\n192[.]3[.]204[.]237\n\n192[.]3[.]207[.]115\n\n192[.]3[.]207[.]116\n\n192[.]3[.]207[.]117\n\n192[.]3[.]207[.]118\n\n192[.]3[.]207[.]119\n\n192[.]3[.]207[.]120\n\n192[.]3[.]207[.]123\n\n192[.]3[.]207[.]124\n\n\n-----\n\n192[.]3[.]207[.]125\n192[.]3[.]207[.]126\n192[.]3[.]31[.]211\n192[.]3[.]31[.]214\n192[.]3[.]45[.]90\n192[.]3[.]45[.]91\n192[.]3[.]45[.]92\n192[.]3[.]45[.]93\n192[.]3[.]45[.]94\n64[.]110[.]25[.]146\n64[.]110[.]25[.]147\n64[.]110[.]25[.]148\n64[.]110[.]25[.]150\n64[.]110[.]25[.]151\n64[.]110[.]25[.]152\n64[.]110[.]25[.]153\n64[.]110[.]25[.]154\n\n### Fake Domains (Sandbox Evasion)\n\nwww[.]analiticsmailgooglefaxidload[.]onlinsedsa\n\nwww[.]wewanaliticsmailgooglefaxidload[.]oeenlinsedsa\n\nwww[.]lovisaaa[.]oedsdenlinsedrwersa\n\nwww[.]weryoseruisasds[.]oedsdenlinsedrwersa\n\nwww[.]dencedence[.]denceasdq\n\nwww[.]goooglwas[.]freesaf\n\ndgdfgdfgdfg\n\nfaxdaytodayd\n\nmailsssssssssssdddaas[.]com\n\nmailsmessage[.]comssaaa\n\nmailsmaasessage[.]comssssaaa\n\nsssaaalllsaallsaaaasssaaa[.]comssssaaa\n\nlvelalslllasaasss[.]lllassaassaa\n\n1122212121212[.]1221212\n\n00000000000000[.]11111111\n\n11111[.]222222222222\n\nsomeserver\n\nsomeserversdfdfdf[.]111\n\nwww[.]wikipedia[.]000212[.]nl\n\nwikipedia[.]112000212[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-20 - Combing Through Brushaloader Amid Massive Detection Uptick.pdf"
    ],
    "report_names": [
        "2019-02-20 - Combing Through Brushaloader Amid Massive Detection Uptick.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535694,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653687100,
    "ts_modification_date": 1653687100,
    "files": {
        "pdf": "https://archive.orkl.eu/5c79906e9d2678778b5b448887a95a5d5b224b27.pdf",
        "text": "https://archive.orkl.eu/5c79906e9d2678778b5b448887a95a5d5b224b27.txt",
        "img": "https://archive.orkl.eu/5c79906e9d2678778b5b448887a95a5d5b224b27.jpg"
    }
}