{
    "id": "384f96e1-c4b4-4c20-a2f9-2df922b7e4c3",
    "created_at": "2022-10-25T16:48:19.933155Z",
    "updated_at": "2025-03-27T02:05:30.834243Z",
    "deleted_at": null,
    "sha1_hash": "8df1840dd0b1f01264da0b9d90fa6d7eabff892d",
    "title": "Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and",
    "authors": "CISA",
    "file_creation_date": "2022-03-15T09:36:58Z",
    "file_modification_date": "2022-03-18T01:26:18Z",
    "file_size": 1314150,
    "plain_text": "**TLP:WHITE** Product ID: AA22-074A\nMarch 15, 2022\n\n# Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability\n\n## SUMMARY\n\nThe Federal Bureau of Investigation (FBI) and\n\n**Multifactor Authentication (MFA):**\n\nCybersecurity and Infrastructure Security\n\n**A Cybersecurity Essential**\n\nAgency (CISA) are releasing this joint\n\nMFA is one of the most important\n\nCybersecurity Advisory (CSA) to warn\n\ncybersecurity practices to reduce the risk of\n\norganizations that Russian state-sponsored\n\nintrusions—according to industry research,\n\ncyber actors have gained network access\n\nusers who enable MFA are up to 99 percent\n\nthrough exploitation of default MFA protocols\n\nless likely to have an account compromised.\n\nand a known vulnerability. As early as May\n2021, Russian state-sponsored cyber actors Every organization should enforce MFA for all\ntook advantage of a misconfigured account set employees and customers, and every user\nto default MFA protocols at a non-governmental should sign up for MFA when available.\norganization (NGO), allowing them to enroll a\n\nOrganizations that implement MFA should\n\nnew device for MFA and access the victim\n\nreview default configurations and modify as\n\nnetwork. The actors then exploited a critical\n\nnecessary, to reduce the likelihood that a\n\nWindows Print Spooler vulnerability,\n\nsophisticated adversary can circumvent this\n\n“PrintNightmare” (CVE-2021-34527) to run\n\ncontrol.\n\narbitrary code with system privileges. Russian\nstate-sponsored cyber actors successfully exploited the vulnerability while targeting an NGO using\nCisco’s Duo MFA, enabling access to cloud and email accounts for document exfiltration.\n\nThis advisory provides observed tactics, techniques, and procedures, indicators of compromise\n(IOCs), and recommendations to protect against Russian state-sponsored malicious cyber activity.\n\n\n**TLP:WHITE** Product ID: AA22-074A\n\n\n_To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact_\n_your local FBI field office at_ _[fbi.gov/contact-us/field-offices, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855)](http://www.fbi.gov/contact-us/field-offices)_\n_[292-3937 or by e-mail at CyWatch@fbi.gov. When available, please include the following information regarding](mailto:CyWatch@fbi.gov)_\n_the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment_\n_used for the activity; the name of the submitting company or organization; and a designated point of contact. To_\n_request incident response resources or technical assistance related to these threats, contact CISA at_\n\n_[report@cisa.gov.](mailto:report@cisa.gov)_\n\n_This document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information_\n_carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public_\n_release. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction._\n_For more information on the Traffic Light Protocol, see_ _[cisa.gov/tlp/.](http://www.us-cert.gov/tlp/)_\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\nFBI and CISA urge all organizations to apply the recommendations in the Mitigations section of this\nadvisory, including the following:\n\n     - Enforce MFA and review configuration policies to protect against “fail open” and re-enrollment\nscenarios.\n\n     - Ensure inactive accounts are disabled uniformly across the Active Directory and MFA\nsystems.\n\n     - [Patch all systems. Prioritize patching for known exploited vulnerabilities.](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\n\n[For more general information on Russian state-sponsored malicious cyber activity, see CISA's Russia](https://www.cisa.gov/uscert/russia)\n[Cyber Threat Overview and Advisories](https://www.cisa.gov/uscert/russia) webpage. For more information on the threat of Russian statesponsored malicious cyber actors to U.S. critical infrastructure as well as additional mitigation\n[recommendations, see joint CSA Understanding and Mitigating Russian State-Sponsored Cyber](https://www.cisa.gov/uscert/ncas/alerts/aa22-011a)\n[Threats to U.S. Critical Infrastructure](https://www.cisa.gov/uscert/ncas/alerts/aa22-011a) [and CISA’s Shields Up Technical Guidance](https://www.cisa.gov/uscert/shields-technical-guidance) webpage.\n\n[For a downloadable copy of IOCs, see AA22-074A.stix.](https://www.cisa.gov/uscert/sites/default/files/publications/AA22-074A.stix.xml)\n\n## TECHNICAL DETAILS\n\n### Threat Actor Activity\n\n**_Note: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 10. See appendix A for a_**\n_table of the threat actors’ activity mapped to MITRE ATT&CK tactics and techniques._\n\nAs early as May 2021, the FBI observed Russian state-sponsored cyber actors gain access to an\nNGO, exploit a flaw in default MFA protocols, and move laterally to the NGO’s cloud environment.\n\n[Russian state-sponsored cyber actors gained initial access [TA0001] to the victim organization via](https://attack.mitre.org/versions/v10/tactics/TA0001/)\n[compromised credentials [T1078] and enrolling a new device in the organization’s Duo MFA. The](https://attack.mitre.org/versions/v10/techniques/T1078/)\n[actors gained the credentials [TA0006] via brute-force password guessing attack [T1110.001],](https://attack.mitre.org/versions/v10/tactics/TA0006/)\nallowing them access to a victim account with a simple, predictable password. The victim account had\nbeen un-enrolled from Duo due to a long period of inactivity but was not disabled in the Active\nDirectory. As Duo’s default configuration settings allow for the re-enrollment of a new device for\ndormant accounts, the actors were able to enroll a new device for this account, complete the\nauthentication requirements, and obtain access to the victim network.\n\nUsing the compromised account, Russian state-sponsored cyber actors performed privilege\n[escalation [TA0004] via exploitation of the “PrintNightmare” vulnerability (CVE-2021-34527) [T1068]](https://attack.mitre.org/versions/v10/tactics/TA0004/)\nto obtain administrator privileges. The actors also modified a domain controller file,\n```\n   c:\\windows\\system32\\drivers\\etc\\hosts, redirecting Duo MFA calls to localhost instead of the\n\n```\n[Duo server [T1556]. This change prevented the MFA service from contacting its server to validate](https://attack.mitre.org/versions/v10/techniques/T1556/)\nMFA login—this effectively disabled MFA for active domain accounts because the default policy of\nDuo for Windows is to “fail open” if the MFA server is unreachable. Note: “Fail open” can happen to\n_any MFA implementation and is not exclusive to Duo._\n\nAfter effectively disabling MFA, Russian state-sponsored cyber actors were able to successfully\nauthenticate to the victim’s virtual private network (VPN) as non-administrator users and make\n[Remote Desktop Protocol (RDP) connections to Windows domain controllers [T1133]. The actors ran](https://attack.mitre.org/versions/v10/techniques/T1133/)\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\ncommands to obtain credentials for additional domain accounts; then, using the method described in\nthe previous paragraph, changed the MFA configuration file and bypassed MFA for these newly\ncompromised accounts. The actors leveraged mostly internal Windows utilities already present within\nthe victim network to perform this activity.\n\nUsing these compromised accounts without MFA enforced, Russian state-sponsored cyber actors\n[were able to move laterally [TA0008] to the victim’s cloud storage and email accounts and access](https://attack.mitre.org/versions/v10/tactics/TA0008/)\ndesired content.\n\n### Indicators of Compromise\n\nRussian state-sponsored cyber actors executed the following processes:\n\n     - `ping.exe` − A core Windows Operating System process used to perform the Transmission\nControl Protocol (TCP)/IP Ping command; used to test network connectivity to a remote host\n\n[[T1018] and is frequently used by actors for network discovery [TA0007].](https://attack.mitre.org/versions/v10/techniques/T1018/)\n\n     - `regedit.exe` − A standard Windows executable file that opens the built-in registry editor\n\n[[T1112].](https://attack.mitre.org/versions/v10/techniques/T1112/)\n\n     - `rar.exe` [− A data compression, encryption, and archiving tool [T1560.001]. Malicious cyber](https://attack.mitre.org/versions/v10/techniques/T1560/001/)\nactors have traditionally sought to compromise MFA security protocols as doing so would\nprovide access to accounts or information of interest.\n\n     - `ntdsutil.exe` − A command-line tool that provides management facilities for Active Directory\nDomain Services. It is possible this tool was used to enumerate Active Directory user\naccounts [T1003.003].\n\nActors modified the c:\\windows\\system32\\drivers\\etc\\hosts file to prevent communication with\nthe Duo MFA server:\n\n     - `127.0.0.1 api-<redacted>.duosecurity.com`\n\nThe following access device IP addresses used by the actors have been identified to date:\n\n     - `45.32.137[.]94`\n\n     - `191.96.121[.]162`\n\n     - `173.239.198[.]46`\n\n     - `157.230.81[.]39`\n\n## MITIGATIONS\n\nThe FBI and CISA recommend organizations remain cognizant of the threat of state-sponsored cyber\nactors exploiting default MFA protocols and exfiltrating sensitive information. Organizations should:\n\n     - Enforce MFA for all users, without exception. Before implementing, organizations should\nreview configuration policies to protect against “fail open” and re-enrollment scenarios.\n\n     - Implement time-out and lock-out features in response to repeated failed login attempts.\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\n     - Ensure inactive accounts are disabled uniformly across the Active Directory, MFA systems\netc.\n\n     - Update software, including operating systems, applications, and firmware on IT network\nassets in a timely manner. Prioritize patching [known exploited vulnerabilities, especially critical](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\nand high vulnerabilities that allow for remote code execution or denial-of-service on internetfacing equipment.\n\n     - Require all accounts with password logins (e.g., service account, admin accounts, and domain\nadmin accounts) to have strong, unique passwords. Passwords should not be reused across\nmultiple accounts or stored on the system where an adversary may have access.\n\n     - Continuously monitor network logs for suspicious activity and unauthorized or unusual login\nattempts.\n\n     - Implement security alerting policies for all changes to security-enabled accounts/groups, and\nalert on suspicious process creation events (ntdsutil, rar, regedit, etc.).\n\n**_Note: If a domain controller compromise is suspected, a domain-wide password reset—including service_**\n_accounts, Microsoft 365 (M365) synchronization accounts, and krbtgt—will be necessary to remove the_\n_[actors’ access. (For more information, see https://docs.microsoft.com/en-us/answers/questions/87978/reset-](https://docs.microsoft.com/en-us/answers/questions/87978/reset-krbtgt-password.html)_\n_[krbtgt-password.html). Consider soliciting support from a third-party IT organization to provide subject matter](https://docs.microsoft.com/en-us/answers/questions/87978/reset-krbtgt-password.html)_\n_expertise, ensure the actor is eradicated from the network, and avoid residual issues that could enable follow-on_\n_exploitation._\n\nFBI and CISA also recommend organizations implement the recommendations listed below to further\nreduce the risk of malicious cyber activity.\n\n### Security Best Practices\n\n     - Deploy Local Administrator Password Solution (LAPS), enforce Server Message Block (SMB)\nSigning, restrict Administrative privileges (local admin users, groups, etc.), and review\nsensitive materials on domain controller’s SYSVOL share.\n\n     - Enable increased logging policies, enforce PowerShell logging, and ensure antivirus/endpoint\ndetection and response (EDR) are deployed to all endpoints and enabled.\n\n     - Routinely verify no unauthorized system modifications, such as additional accounts and\nSecure Shell (SSH) keys, have occurred to help detect a compromise. To detect these\nmodifications, administrators can use file integrity monitoring software that alerts an\nadministrator or blocks unauthorized changes on the system.\n\n### Network Best Practices\n\n     - Monitor remote access/RDP logs and disable unused remote access/RDP ports.\n\n     - Deny atypical inbound activity from known anonymization services, to include commercial\nVPN services and The Onion Router (TOR).\n\n     - Implement listing policies for applications and remote access that only allow systems to\nexecute known and permitted programs under an established security policy.\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\n     - Regularly audit administrative user accounts and configure access control under the concept\nof least privilege.\n\n     - Regularly audit logs to ensure new accounts are legitimate users.\n\n     - Scan networks for open and listening ports and mediate those that are unnecessary.\n\n     - Maintain historical network activity logs for at least 180 days, in case of a suspected\ncompromise.\n\n     - Identify and create offline backups for critical assets.\n\n     - Implement network segmentation.\n\n     - Automatically update anti-virus and anti-malware solutions and conduct regular virus and\nmalware scans.\n\n### Remote Work Environment Best Practices\n\nWith the increased use of remote work environments and VPN services, the FBI and CISA encourage\norganizations to implement the following best practices to improve network security:\n\n     - Regularly update VPNs, network infrastructure devices, and devices used for remote work\nenvironments with the latest software patches and security configurations.\n\n     - When possible, implement multi-factor authentication on all VPN connections. Physical\nsecurity tokens are the most secure form of MFA, followed by authenticator applications.\nWhen MFA is unavailable, require employees engaging in remote work to use strong\npasswords.\n\n     - Monitor network traffic for unapproved and unexpected protocols.\n\n     - Reduce potential attack surfaces by discontinuing unused VPN servers that may be used as a\npoint of entry for cyber actors.\n\n### User Awareness Best Practices\n\nCyber actors frequently use unsophisticated methods to gain initial access, which can often be\nmitigated by stronger employee awareness of indicators of malicious activity. The FBI and CISA\nrecommend the following best practices to improve employee operations security when conducting\nbusiness:\n\n     - Provide end-user awareness and training. To help prevent targeted social engineering and\nspearphishing scams, ensure that employees and stakeholders are aware of potential cyber\nthreats and delivery methods. Also, provide users with training on information security\nprinciples and techniques.\n\n     - Inform employees of the risks associated with posting detailed career information to social or\nprofessional networking sites.\n\n     - Ensure that employees are aware of what to do and whom to contact when they see\nsuspicious activity or suspect a cyber incident, to help quickly and efficiently identify threats\nand employ mitigation strategies.\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\n## INFORMATION REQUESTED\n\nAll organizations should report incidents and anomalous activity to the FBI via your local FBI field\n[office or the FBI’s 24/7 CyWatch at (855) 292-3937 or CyWatch@fbi.gov](mailto:CyWatch@fbi.gov) and/or CISA’s 24/7\n[Operations Center at report@cisa.gov](mailto:central@cisa.dhs.gov) or (888) 282-0870.\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----\n\n**TLP:WHITE** FBI | CISA\n\n## APPENDIX A: THREAT ACTOR TACTICS AND TECHNIQUES\n\n[See table 1 for the threat actors’ tactics and techniques identified in this CSA. See the ATT&CK for](https://attack.mitre.org/versions/v10/techniques/enterprise/)\n[Enterprise for all referenced threat actor tactics and techniques.](https://attack.mitre.org/versions/v10/techniques/enterprise/)\n\n_Table 1: Threat Actor MITRE ATT&CK Tactics and Techniques_\n\n|Tactic|Technique|\n|---|---|\n|Initial Access [TA0001]|Valid Accounts [T1078]|\n|Persistence [TA0003]|External Remote Services [T1133]|\n||Modify Authentication Process [T1556]|\n|Privilege Escalation [TA0004]|Exploitation for Privilege Escalation [T1068]|\n|Defense Evasion [TA0005]|Modify Registry [T1112]|\n|Credential Access [TA0006]|Brute Force: Password Guessing [T1110.001]|\n||OS Credential Dumping: NTDS [T1003.003]|\n|Discovery [TA0007]|Remote System Discovery [T1018]|\n|Lateral Movement [TA0008]||\n|Collection [TA0009]|Archive Collected Data: Archive via Utility [T1560.001]|\n\n\n**TLP:WHITE** FBI | CISA\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/xlvqxbk7fgpgz8zzu38u0ppaobq3nvg3"
    ],
    "report_names": [
        "CISA_AA22-074A_Russian_State-Sponsored_Cyber_Actors_Gain_Network_Access_by_Exploiting_Default_MFA_and_PrintNightmare(03-15-2022)"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1647337018,
    "ts_modification_date": 1647566778,
    "files": {
        "pdf": "https://archive.orkl.eu/8df1840dd0b1f01264da0b9d90fa6d7eabff892d.pdf",
        "text": "https://archive.orkl.eu/8df1840dd0b1f01264da0b9d90fa6d7eabff892d.txt",
        "img": "https://archive.orkl.eu/8df1840dd0b1f01264da0b9d90fa6d7eabff892d.jpg"
    }
}