{
    "id": "38da71bd-48a9-4ab8-8581-3c815736d978",
    "created_at": "2023-01-12T15:05:53.653857Z",
    "updated_at": "2025-03-27T02:10:04.29508Z",
    "deleted_at": null,
    "sha1_hash": "32fe1626e67a51f0a207c0c5b4c3f9aa8b9ac0f6",
    "title": "2019-05-16 - GozNym Closure Comes in the Shape of a Europol and DOJ Arrest Operation",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:33Z",
    "file_modification_date": "2022-05-28T03:52:33Z",
    "file_size": 1481181,
    "plain_text": "# GozNym Closure Comes in the Shape of a Europol and DOJ Arrest Operation\n\n**[securityintelligence.com/posts/goznym-closure-comes-in-the-shape-of-a-europol-and-doj-arrest-operation/](https://securityintelligence.com/posts/goznym-closure-comes-in-the-shape-of-a-europol-and-doj-arrest-operation/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nGozNym Closure Comes in the Shape of a Europol and DOJ Arrest Operation\n\n[Advanced Threats May 16, 2019](https://securityintelligence.com/category/x-force/threats/)\n\n\n-----\n\nBy [Limor Kessem 4 min read](https://securityintelligence.com/author/limor-kessem/)\nTwo and a half years after the initial arrest of a major member of the GozNym cybercrime\n[gang, Europol and the U.S. Department of Justice (DOJ) joined forces to reach additional](https://www.europol.europa.eu/newsroom/news/goznym-malware-cybercriminal-network-dismantled-in-international-operation)\ngang members who used the Trojan to pilfer large amounts of money from companies in the\nU.S. The operation was crowned “unprecedented,” having successfully dismantled what was\nleft of the gang that attempted to steal well over $100 million.\n\n## A Two-Headed Beast Emerges\n\nIn April 2016, IBM X-Force researchers came across a new banking Trojan that seemed a\nlittle too familiar. After taking a closer look at what seemed to be a pretty sophisticated,\n[modular code, our team announced that a Trojan hybrid was spawned from the Nymaim and](https://blog.threatstop.com/2016/04/07/nymaim/)\n[Gozi ISFB malware.](https://securityintelligence.com/gozi-banking-trojan-upgrades-build-to-inject-into-windows-10-edge-browser/)\n\n[X-Force named it GozNym, representing its two major components, having realized that the](https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-and-nymaim/)\nlikely operators of Nymaim — a malware loader used mostly in ransomware attacks —\nrecompiled its source code with part of the Gozi ISFB source code, creating a combination\nthat they launched into attacks targeting the customers of more than 24 U.S. and Canadian\nbanks. GozNym-facilitated fraud attacks amounted to over $4 million in losses within the first\nfew days of its activity.\n\nWhat was the purpose of this odd combination? It is likely that those behind the GozNym\nproject aimed to marry the best of both Nymaim and Gozi ISFB to create a powerful new\nTrojan. GozNym leveraged the Nymaim dropper’s stealth and persistence and the Gozi ISFB\nparts added the banking Trojan’s modules and its capabilities to facilitate wire fraud on\ninfected user devices.\n\n[Technical information about this hybrid was released by X-Force research in July 2016, when](https://securityintelligence.com/two-heads-are-better-than-one-going-under-the-hood-to-analyze-goznym/)\nGozNym started spreading to additional geographies.\n\n## Takes the World by Storm\n\nVery soon after activating their campaigns, GozNym’s operators were not waiting. They\n[teamed up with the Avalanche botnet (Avalanche was taken down by Europol in late 2016,](https://www.us-cert.gov/ncas/alerts/TA16-336A)\nleading to the exposure of some of GozNym’s major operators) to spread the malware and\nlink up with other elite cybercriminals, and started moving the project into additional\ncountries.\n\nWithin no more than a week after launching aggressive attacks on online banking users in\n[North America, GozNym was equipped with redirection attacks and set loose in Poland.](https://securityintelligence.com/time-is-money-goznym-launches-redirection-attacks-in-poland/)\nMalware-facilitated redirection is a sophisticated way to hijack online banking users to an\nobscure replica of their bank’s website and there, away from their bank’s security controls,\n\n\n-----\n\ndupe them into divulging their account credentials, personal information and secondary\nauthentication codes. In the background, a fraudster is initiating a fraudulent transaction and\ncompletes it using the freshly stolen data.\n\n[In June 2016, GozNym redirection attacks spread to the U.S., targeting the business banking](https://securityintelligence.com/goznym-launches-redirection-in-the-united-states/)\ncustomers of major financial institutions in the country. By August 2016, GozNym was off to a\nEuro-trip of sorts, [launching redirection attacks on banks in Germany.](https://securityintelligence.com/goznyms-euro-trip-launching-redirection-attacks-in-germany/)\n\nSpreading out this quickly and efficiently is no small feat. To begin, creating and maintaining\nredirection attacks is a resource-heavy endeavor. But going beyond that technical hurdle,\nspreading a banking Trojan to countries with a unique language, such as German or Polish,\nfor example, where banking systems differ, entails people on the streets. It means that\nGozNym collaborators had the contacts to help them craft and spread quality malspam in\nthose languages, work the redirection attacks simultaneously in different parts of the world,\nreceive backing from local organized crime to facilitate cash-out, and move the money out\nquickly.\n\nBut as they stormed through different parts of the globe, GozNym’s operators did not realize\nthey had garnered a lot of attention from the security research industry and from global law\nenforcement agencies.\n\n## Wham Bam — GozNym’s Down\n\nWith multiple operations across the globe, the GozNym crew was having a heyday. In\nNovember 2016, X-Force research was tracking campaigns in the U.S. and Germany, likely\noperated by two groups in tandem. In Germany, the malware continued to focus on business\nbanking, and in the U.S., where the holiday season was in full swing, the group lined up the\ntop electronics retailers, e-commerce sites, e-wallet providers, telecommunications vendors\nand payment card providers, adding them to spruced up configuration files in preparation of\nnew infection campaigns.\n\nBut while all this activity was keeping GozNym operators busy, Europol was busy taking\ndown the notorious Avalanche botnet, a major cybercrime infrastructure that served as a\nbulletproof hub for spreading some of the world’s worst malware gangs. One of those gangs\nwas GozNym.\n\nThe takedown was announced by Europol on Dec. 1, 2016. On Dec. 12, 2016, the DOJ\n[released the notice about the arrest of one of GozNym’s major players, a Bulgarian national](https://www.justice.gov/usao-wdpa/pr/bulgarian-charged-goznym-malware-attacks-us)\nnamed Krasimir Nikolov — the group’s master account takeover specialist, versed in stealing\nmoney from compromised accounts. At the time, Nikolov was the sole defendant, but the\nGozNym team was very quick to react and disband. Campaigns immediately died out and\nGozNym attacks ceased, never to return again.\n\n## Pinning Down the Ghosts of the GozNym Operation\n\n\n-----\n\nWas it the arrest of Nikolov that led to additional information on the remaining members of\nwhat used to be one of the most brazen and aggressive cybercrime gangs? Possibly. Either\nway, international law enforcement did not rest on its laurels after that first arrest, knowing all\ntoo well that a gang so prolific can bring many more people to justice.\n\nProviding additional closure to this chapter in cybercrime history, Europol, in collaboration\n[with the DOJ, have managed to reach and arrest gang members in Bulgaria, Georgia,](https://www.europol.europa.eu/newsroom/news/goznym-malware-cybercriminal-network-dismantled-in-international-operation)\nMoldova and Ukraine and serve up criminal prosecutions in Georgia, Moldova, Ukraine and\nthe U.S. — in total, 10 defendants in five countries, accounting for attacks on more than\n41,000 victims, mostly businesses across North America and Europe.\n\nThis successful operation is a meaningful event. It underlines the evolving capabilities of law\nenforcement to collaborate on such complex operations to bring cybercriminals to justice,\nand serves as a warning to both existing and would-be criminals of the future.\n\n[It is also a reminder that the quick sharing and democratizing of threat intelligence is a critical](https://exchange.xforce.ibmcloud.com/#/)\npart of fighting cybercrime. The IBM X-Force team is proud to have played its small role in\ngetting the eyes of justice focused on GozNym.\n\n## What’s Next for Cybercriminals Post-GozNym?\n\nAfter GozNym departed the cybercrime arena, our team has seen the TrickBot malware fill\n[that void, having emerged in 2016. In 2018, X-Force noted much tighter collaboration](https://securityintelligence.com/the-business-of-organized-cybercrime-rising-intergang-collaboration-in-2018/)\n[between the leading malware gangs, specifically TrickBot and IcedID, which was also](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)\ndiscovered by IBM Security.\n\nOver the course of 2018, IcedID took on more obfuscation techniques used by TrickBot,\nwhile TrickBot began to also drop IcedID malware on infected machines. It appears that\nintergang collaboration is still trending, and likely for the same reasons: criminals coming\ntogether to create something more powerful than what they have separately. Lest we forget,\ndoing the same as defenders is what makes all the difference.\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-16 - GozNym Closure Comes in the Shape of a Europol and DOJ Arrest Operation.pdf"
    ],
    "report_names": [
        "2019-05-16 - GozNym Closure Comes in the Shape of a Europol and DOJ Arrest Operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535953,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1653709953,
    "ts_modification_date": 1653709953,
    "files": {
        "pdf": "https://archive.orkl.eu/32fe1626e67a51f0a207c0c5b4c3f9aa8b9ac0f6.pdf",
        "text": "https://archive.orkl.eu/32fe1626e67a51f0a207c0c5b4c3f9aa8b9ac0f6.txt",
        "img": "https://archive.orkl.eu/32fe1626e67a51f0a207c0c5b4c3f9aa8b9ac0f6.jpg"
    }
}