{
    "id": "38f53cc7-bef6-4ca7-9325-70aa06a8828b",
    "created_at": "2023-01-12T15:09:36.523457Z",
    "updated_at": "2025-03-27T02:05:43.228207Z",
    "deleted_at": null,
    "sha1_hash": "efa4cff59bbdc20be29a54c3ec884f6ed271e364",
    "title": "2020-01-09 - Man jailed for using webcam RAT to spy on women in their bedrooms",
    "authors": "",
    "file_creation_date": "2022-05-27T22:52:26Z",
    "file_modification_date": "2022-05-27T22:52:26Z",
    "file_size": 107292,
    "plain_text": "# Man jailed for using webcam RAT to spy on women in their bedrooms\n\n**[tripwire.com/state-of-security/featured/man-jailed-using-webcam-rat-women-bedrooms/](https://www.tripwire.com/state-of-security/featured/man-jailed-using-webcam-rat-women-bedrooms/)**\n\nGraham Cluley January 9, 2020\n\nA British man has been jailed for two years after police caught him using a notorious Remote\nAccess Trojan (RAT) to hijack the webcams of young women, and spy upon them.\n\n27-year-old Scott Cowley, of St Helens, Merseyside, was arrested last November as part of\n[an international investigation into purchasers of the Imminent Monitor RAT.](https://unit42.paloaltonetworks.com/imminent-monitor-a-rat-down-under/)\n\nImminent Monitor (also known as IM-RAT) had been sold online since 2012, purporting to be\na legitimate remote access tool.\n\n\n-----\n\nImminent Monitor’s claims of legitimacy, however, are somewhat undermined by some of its\nabilities – such as the ability to allow remote users to disable a subject’s webcam light while\nthey are being monitored. One version of the software even introduced the ability to mine for\ncryptocurrency on victim’s PCs.\n\nSecurity researchers at Palo Alto Networks claim that they have observed Imminent Monitor\nbeing used in attacks against its customers on over 115,000 unique occasions.\n\nInternational law enforcement agencies were finally able to dismantle the infrastructure\nbehind Imminent Monitor last November, in an operation that executed 85 warrants, seized\n434 devices, and arrested 13 people.\n\nAnd, of course, when police cracked the IM-RAT’s distribution network they were also able to\nseize records detailing thousands of purchasers, which resulted in the arrest in Merseyside\nof Scott Cowley.\n\nAt Liverpool Crown Court prosecutors described how the Cowley had used a PayPal account\nconnected to his own name and personal email address to buy the IM-RAT software. Cowley\nsuccessfully managed to have the software installed on the computers of three women, and\n[seized remote control of their webcams in order to allow him to secretly film them as they](https://www.tripwire.com/state-of-security/security-data-protection/cyber-security/eight-years-of-hell-but-no-end-in-sight-for-victim-of-cyber-stalker/)\nundressed and had sex.\n\nSpecialist police officers from the North West Regional Organised Crime Unit (NWROCU)\nwere able to forensically examine Cowley’s own laptop computer, finding the software as well\nas furtive video recordings of his victims.\n\nThe court found Cowley guilty, and sentenced him to two years imprisonment for computer\nmisuse and sexual offences.\n\n\n-----\n\nToday we welcome the sentencing of Scott Cowley who used highly technological\nmethods to obtain private videos and images of innocent victims for his own sexual\ngratification. This conviction demonstrates that despite the high tech nature of the\nCyber Crime, offenders have no place to hide,” said Detective Sergeant Steve Frame\nfrom the NWROCU. “We take all reports of cybercrime seriously and are absolutely\ncommitted to tackling and undermining this evolving threat. If you have been the victim\nof a similar crime, or suspect somebody is involved in committing this type of crime\nplease call 101 and report it to your local police force.”\n\nNo doubt police investigations into the users of IM-RAT will continue, and we can hope for\nmore successful prosecutions for those who preyed on innocent computer users.\n\n**Editor’s Note:** _The opinions expressed in this guest author article are solely those of the_\n_contributor, and do not necessarily reflect those of Tripwire, Inc._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-09 - Man jailed for using webcam RAT to spy on women in their bedrooms.pdf"
    ],
    "report_names": [
        "2020-01-09 - Man jailed for using webcam RAT to spy on women in their bedrooms.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536176,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653691946,
    "ts_modification_date": 1653691946,
    "files": {
        "pdf": "https://archive.orkl.eu/efa4cff59bbdc20be29a54c3ec884f6ed271e364.pdf",
        "text": "https://archive.orkl.eu/efa4cff59bbdc20be29a54c3ec884f6ed271e364.txt",
        "img": "https://archive.orkl.eu/efa4cff59bbdc20be29a54c3ec884f6ed271e364.jpg"
    }
}