{
    "id": "390a7d25-3ecb-4f4d-94ba-759ae75914f3",
    "created_at": "2022-10-25T16:48:20.158987Z",
    "updated_at": "2025-03-27T02:16:09.28935Z",
    "deleted_at": null,
    "sha1_hash": "d1a406b5f3f4da0e835a7a2615a75c39dc97625e",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-07-19T06:02:52Z",
    "file_modification_date": "2019-07-19T06:02:52Z",
    "file_size": 1005786,
    "plain_text": "[Trend Micro](https://www.trendmicro.com/)\n[About TrendLabs Security Intelligence Blog](https://blog.trendmicro.com/trendlabs-security-intelligence/about-us/)\n\n[Home  »  Malware  »  Spam Campaign Targets Colombian Entities with Custom-made ‘Proyecto RAT,’](https://blog.trendmicro.com/trendlabs-security-intelligence/)\nUses Email Service YOPmail for C&C\n\n# Spam Campaign Targets Colombian Entities with Custom-made ‘Proyecto RAT,’ Uses Email Service YOPmail for C&C\n\n[Posted on:July 18, 2019 at 5:01 am](https://blog.trendmicro.com/trendlabs-security-intelligence/2019/07/)\n[Posted in:Malware, Spam, Targeted Attacks](https://blog.trendmicro.com/trendlabs-security-intelligence/category/malware/)\nAuthor:\n[Trend Micro](https://blog.trendmicro.com/trendlabs-security-intelligence/author/trend-micro/)\n\n0\n\n**_by Jaromir Horejsi and Daniel Lunghi (Threat Researchers)_**\n\nWe observed a recent campaign that primarily targets financial institutions and governmental organizations in\nthe South American region, particularly in Colombia. This blog post covers the activities we observed, the\nremote access tools (RATs) used, the campaign’s techniques and procedures, and its indicators of compromise\n(IoCs). Our findings indicate that the campaign appears to be the work of a group involved in business email\ncompromise (BEC) or cybercrime, and unlikely to be an advanced persistent threat (APT).\n\nIt’s worth noting that the group uses YOPmail, a disposable email address service, for its command and\ncontrol server (C&C). The payload, written in Visual Basic 6, is a customized version of a remote access tool\ncalled “Proyecto RAT.” Our in-depth analysis of the malware is detailed in this **[appendix.](https://documents.trendmicro.com/assets/Appendix_Spam_Campaign_Targets_Colombian_Entities_with_Custom_made_Proyecto_RAT_Uses_Email_Service_YOPmail_for_C&C.pdf)**\n\n## The delivery emails\n\nThe infection starts with an email sent to a target, as seen in the screenshot below (Figure 1). In multiple\ninstances, we noticed the attacker used open or compromised mail servers in South America to facilitate the\ncampaigns. The attacker also connected to the compromised servers from IP addresses that were linked to\ndynamic domain names used as C&Cs by the delivered payloads. This suggests that the attacker uses the\nsame infrastructure to send emails and control victims.\n\nThe sender of the email is usually spoofed, and we saw multiple email subjects enticing the receiver to open\nthe attachment, which is an RTF file. Examples of such subjects are:\n\n“Hemos iniciado un proceso en su contra por violencia laboral.” (Loosely translates to “We have filed a\nl i i f k l i l ”)\n\n\n-----\n\naccounts are going to be blocked. )\n“Almacenes exito te obsequia una tarjeta regalo virtual por valor de $500.000.” (Loosely translates to\n“Exito shops offer you a virtual gift worth $500.000.”)\n\n_Figure 1. Delivery email_\n\nThe attached RTF file contains one line of text and a link. The text relates to the email subject, such as “You\ncan see the complaint against you below.” or “See the complaint online.” Note that the link to the malware\nuses the URL shortener cort.as, which belongs to the El País newspaper. Unfortunately, this service only\nenables statistics on demand, and the attacker never enabled them.\n\n_Figure 2. RTF document attached to the delivery email_\n\n_Figure 3. URL shortener cort.as_\n\nClicking on the link redirects the victim to a file on a file-sharing service. The file is a delivery document that\ncontains macros.\n\n\n-----\n\nThe majority of the documents we analyzed were in MHTML format, which contains macros. The macro\ncode is a simple downloader for the payload. However, Office files in [OLE format were also observed. Most](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-oleds/fdc5e702-d09e-4344-a77f-eb079d41f23f)\nof the document designs have already been [published in Qihoo360’s blog post; this post will discuss designs](https://ti.360.net/blog/articles/apt-c-36-continuous-attacks-targeting-colombian-government-institutions-and-corporations-en/)\nthat the post did not cover. The documents, which appeared between 2017 and 2019, all asked users to enable\nmacros. The macros will download and execute a RAT.\n\n_Figure 5. Delivery document purports to come from Migración Colombia, a government website for the_\n\n_Colombian migration authority_\n\n_Figure 6. Delivery document purports to come from DataCrédito, a service that allows access to credit_\n\n_history and profile_\n\n\n-----\n\n_Figure 7. Delivery document with a generic Adobe Flash Player Installer_\n\n## First stage payload: Remote Access Tool (RAT)\n\nThe main payload is usually Imminent Monitor RAT; however, at the beginning of 2018, we also observed\nthe use of LuminosityLink RAT, NetWire RAT, and NjRAT. In a case in June 2019, we also noticed Warzone\nRAT being used. [Warzone RAT is the newer RAT from the list and supports keylogger, web browser-, and](https://www.kernelmode.info/forum/viewtopic.php?f=16&t=5525)\nOutlook password-stealing features in addition to standard RAT functions.\n\nAll of these RATs are standard malware that can be bought for under US$100 or downloaded from various\nmalware repositories.\n\nAfter the download of Imminent Monitor RAT and observing its network behavior, we noticed an instruction\nto download and execute another executable file, which is the second stage payload.\n\n_Figure 8. Imminent Monitor RAT traffic_\n\n## Second stage payload: Proyecto RAT\n\nThe second stage payload is written in Visual Basic 6, and has an interesting feature — a C&C URL address\nacquired from the disposable email service YOPmail. The malware connects to a mailbox, reads the only\navailable email message, parses it, and then extracts the subject of the email. The C&C server URL is\nbetween the ‘¡’ characters (upside-down exclamation sign), a character used in the Spanish language. This is\nthe first time we noticed disposable email services being abused this way.\n\n\n-----\n\nDuring our analysis, we found three mailboxes related to the malware. We have since reached out to\nYOPmail and informed them of this threat. YOPmail has responded, saying that they would place specific\nrestrictions.\n\nA detailed technical analysis of the classes, forms, and modules revealed when the malware is decompiled\ncan be found in this **[appendix.](https://documents.trendmicro.com/assets/Appendix_Spam_Campaign_Targets_Colombian_Entities_with_Custom_made_Proyecto_RAT_Uses_Email_Service_YOPmail_for_C&C.pdf)**\n\n## Searching for the malware family\n\nSeeing the [many features of the malware, we tried to match it to a known RAT.](https://documents.trendmicro.com/assets/Appendix_Spam_Campaign_Targets_Colombian_Entities_with_Custom_made_Proyecto_RAT_Uses_Email_Service_YOPmail_for_C&C.pdf)\n\nThe communication between client and server is via TCP, is unencrypted, and uses pipe “|” characters and\n“¡@#@!” as a separator. This description fits quite well with Xpert RAT. Searching for the x86 hex string\nfrom cTimer class also leads to links with Xpert RAT. [This tweet from a malware researcher even mentions](https://twitter.com/James_inthe_box/status/1066067567247155200/photo/1)\nXpert RAT.\n\nAn online search found two versions of Xpert RAT were found: “XpertRAT v3.0.10 By Abronsius” and\n“XpertRAT v3.0.9 By Abronsius”. After building the payload and infecting the test machine, we could\nobserve the communication in figure 10. Notice the different colors between the incoming and outgoing\ncommunication and the separator between both communication streams. However, in Xpert RAT builder, we\ndid not notice any reference to a disposable email, searches for banking website captions, or information\nwritten to the configuration file. In addition, Xpert RAT samples generated by the builder have even more\nfunctions such as keylogger, runPE, WebCam, Audio, Wipe module, and Remote Desktop.\n\n_Figure 10. Original Xpert RAT communication snippet_\n\nIt seems that the aforementioned Visual Basic malware is an old and limited version of the Xpert RAT —\neither a custom modification of Xpert RAT or a malware with source code based on Xpert RAT’s.\n\n\n-----\n\n_Figure 11. Xpert RAT builder_\n\n_Figure 12. Functions available to an Xpert RAT operator_\n\nWhen searching for class names from the Visual Basic malware, the keyword “ClsRemoteRegistry” leads to a\ndiscussion on a Spanish hacking forum (Figure 13). The user, who in his profile offers Prodigy Bot, an IRC\n[bot written in VB6, has a question related to the code from Leandro Ascierto’s project called “Proyecto](http://leandroascierto.com/blog/explorador-remoto-proyecto-en-marcha/)\nRAT.”\n\n\n-----\n\n_Figure 13. Discussion about ClsRemoteRegisty class on a hacking forum_\n\nAfter downloading and examining the project, we noticed familiar class names, delimiters, strings, and more.\n\n_Figure 14. Proyecto RAT website_\n\n_Figure 15. Familiar class, form, and module names_\n\n\n-----\n\n_Figure 17. Hex code from cTimer class, with original comments in German, because this code was taken from_\n\n_a different project_\n\nBased on these details, we believe this is a customized version of Proyecto RAT.\n\n## Affected regions and verticals\n\nColombia is by far the most targeted country, with other South American countries added to the list. This is\nconsistent with the fact that this actor uses the Spanish language in all the spear phishing documents we\nobserved. However, we also noticed targets in other countries:\n\n_Figure 18. The regions targeted by the spear-phishing documents_\n\nIn one instance, the attacker used the URL shortener bit.ly, which confirmed that Colombia is the main target.\nAs anyone can follow the link, some of these countries could also be the result of researchers’ sandboxes.\n\n\n-----\n\n_Figure 19. Clicks and locations related to the bit.ly link_\n\nRecent campaigns targeted different industries. The most prevalent were government entities,\nhealthcare/pharmaceutical institutions, followed by financial/banking/insurance and agroindustry/food/packaging organizations.\n\nNotably, we noticed that multiple employee savings funds (called “Fondo de empleados” in Colombia) were\ntargeted. These entities barely have access to sensitive information, but they are likely to possess a reasonable\namount of money.\n\n## Conclusion and mitigation\n\nXpert RAT [reportedly first appeared in 2011. The first version of “Proyecto RAT” was published at the end of](https://www.veronicavaleros.com/blog/2018/3/12/a-study-of-rats-third-timeline-iteration)\n2010. Both projects share similarities, and it is likely that “Proyecto RAT” was inspiration for Xpert RAT and\nat least a few more malware projects, including the Visual Basic malware in the campaign we previously\ndescribed.\n\nWe can’t say for sure what this actor is particularly looking for, but multiple facts lead us to believe it is\ndesigned for BEC or cybercrime rather than as an APT:\n\nThese campaigns are noisier and more prevalent than usual APT campaigns.\nThe same IP address, which is dynamic, is used to send spear-phishing emails and act as C&C. This is\nmore common to cybercrime.\nSome of the targeted industries might not have access to sensitive information, but are likely to handle\na decent amount of money.\nThe windows titles that are listed in the configuration file are almost all related to financial services.\n\nOur research shows that this campaign can deliver malware with multiple capabilities that can affect different\norganizations and industries. It also highlights the importance of securing online infrastructures, particularly\nthe email gateways, to avoid targeted spam campaigns. Organizations should [adopt best practices on](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\nmessaging-related threats and regularly update systems to prevent attackers from taking advantage of any\n[security gaps. Employing additional security mechanisms such as](https://www.trendmicro.com/en_us/business/capabilities/intrusion-prevention.html) [enabling firewalls and](https://www.trendmicro.com/vinfo/us/security/news/security-technology/best-practices-deploying-an-effective-firewall) intrusion detection\nand prevention systems will help prevent suspicious network activities that may lead to data exfiltration or\n\n\n-----\n\nSuites and Worry Free [Business Security. Both solutions can protect users and businesses from threats by](https://www.trendmicro.com/en_us/small-business/worry-free.html)\n[detecting malicious files and spammed messages as well as blocking all related malicious URLs.](https://www.trendmicro.com/en_us/business/products/network/advanced-threat-protection.html) Trend Micro\nDeep Discovery™ has an email inspection layer that can protect enterprises by detecting malicious\nattachments and URLs.\n\n[Trend Micro™ Hosted Email Security is a no-maintenance cloud solution that delivers continuously updated](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/cloud-email-gateway-services.html)\nprotection to stop spam, malware, spear phishing, ransomware, and advanced targeted attacks before they\nreach the network. It protects Microsoft Exchange, [Microsoft Office 365, Google Apps, and other hosted and](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/cloud-app-security.html)\non-premises email solutions.\n\nOur technical analysis of the malware, IoCs, and other spam email samples related to the campaign can be\nfound in this **[appendix.](https://documents.trendmicro.com/assets/Appendix_Spam_Campaign_Targets_Colombian_Entities_with_Custom_made_Proyecto_RAT_Uses_Email_Service_YOPmail_for_C&C.pdf)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.18.Proyecto_RAT_Colombian/Spam%20Campaign%20Targets%20Colombian%20Entities%20with%20Custom-made%20Proyecto%20RAT.pdf"
    ],
    "report_names": [
        "Spam Campaign Targets Colombian Entities with Custom-made Proyecto RAT"
    ],
    "threat_actors": [
        {
            "id": "98b22fd7-bf1b-41a6-b51c-0e33a0ffd813",
            "created_at": "2022-10-25T15:50:23.688973Z",
            "updated_at": "2025-03-27T02:00:55.524322Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "APT-C-36",
                "Blind Eagle"
            ],
            "source_name": "MITRE:APT-C-36",
            "tools": [
                "Imminent Monitor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bd43391b-b835-4cb3-839a-d830aa1a3410",
            "created_at": "2023-01-06T13:46:38.925525Z",
            "updated_at": "2025-03-27T02:00:02.95302Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "Blind Eagle"
            ],
            "source_name": "MISPGALAXY:APT-C-36",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "be597b07-0cde-47bc-80c3-790a8df34af4",
            "created_at": "2022-10-25T16:07:23.407484Z",
            "updated_at": "2025-03-27T02:02:09.784411Z",
            "deleted_at": null,
            "main_name": "Blind Eagle",
            "aliases": [
                "APT-C-36",
                "APT-Q-98",
                "AguilaCiega"
            ],
            "source_name": "ETDA:Blind Eagle",
            "tools": [
                "AsyncRAT",
                "BitRAT",
                "Bladabindi",
                "BlotchyQuasar",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Jorik",
                "LimeRAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "Warzone",
                "Warzone RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1563516172,
    "ts_modification_date": 1563516172,
    "files": {
        "pdf": "https://archive.orkl.eu/d1a406b5f3f4da0e835a7a2615a75c39dc97625e.pdf",
        "text": "https://archive.orkl.eu/d1a406b5f3f4da0e835a7a2615a75c39dc97625e.txt",
        "img": "https://archive.orkl.eu/d1a406b5f3f4da0e835a7a2615a75c39dc97625e.jpg"
    }
}