{
    "id": "391b3419-0ddb-4912-ad8f-c9deab508ef1",
    "created_at": "2023-01-12T15:03:13.314532Z",
    "updated_at": "2025-03-27T02:17:23.701358Z",
    "deleted_at": null,
    "sha1_hash": "c06395ede563fd69e26b51b9392eaaf3a846d756",
    "title": "2017-05-22 - WannaCry- Ransomware attacks show strong links to Lazarus group",
    "authors": "",
    "file_creation_date": "2022-05-28T18:21:09Z",
    "file_modification_date": "2022-05-28T18:21:09Z",
    "file_size": 1168532,
    "plain_text": "# Endpoint Protection\n\n**[symantec.com/connect/blogs/wannacry-ransomware-attacks-show-strong-links-lazarus-group](https://www.symantec.com/connect/blogs/wannacry-ransomware-attacks-show-strong-links-lazarus-group)**\n\n[A L Johnson](https://community.broadcom.com/symantecenterprise/network/members/profile?UserKey=cbd453fd-3ce1-4c47-af77-d746256f9bc4)\n\n\nMay 22, 2017 06:19 PM\n\n\n[Tools and infrastructure used in the WannaCry ransomware attacks have strong links to Lazarus, the group that was responsible for the](https://www.symantec.com/connect/blogs/what-you-need-know-about-wannacry-ransomware)\ndestructive attacks on Sony Pictures and the theft of US$81 million from the Bangladesh Central Bank. Despite the links to Lazarus, the\nWannaCry attacks do not bear the hallmarks of a nation-state campaign but are more typical of a cybercrime campaign. Our analysis only\nallows us to attribute these attacks to the Lazarus group. The technical details do not enable us to attribute the motivations of the attacks to a\nspecific nation state or individuals.\n\n[Prior to the global outbreak on May 12, an earlier version of WannaCry (Ransom.Wannacry) was used in a small number of targeted attacks](https://www.symantec.com/security_response/writeup.jsp?docid=2017-051310-3522-99)\nin February, March, and April. This earlier version was almost identical to the version used in May 2017, with the only difference the method of\npropagation. Analysis of these early WannaCry attacks by Symantec’s Security Response team revealed substantial commonalities in the\ntools, techniques, and infrastructure used by the attackers and those seen in previous Lazarus attacks, making it highly likely that Lazarus\nwas behind the spread of WannaCry. These earlier versions of WannaCry used stolen credentials to spread across infected networks, rather\nthan leveraging the leaked Eternal Blue exploit that caused WannaCry to spread quickly across the globe starting on May 12.\n\n## Summary of links\n\nFollowing the first WannaCry attack in February, three pieces of malware linked to Lazarus were discovered on the victim’s network:\nTrojan.Volgmer and two variants of Backdoor.Destover, the disk-wiping tool used in the Sony Pictures attacks.\nTrojan.Alphanc, which was used to spread WannaCry in the March and April attacks, is a modified version of Backdoor.Duuzer, which\nhas previously been linked to Lazarus.\nTrojan.Bravonc used the same IP addresses for command and control as Backdoor.Duuzer and Backdoor.Destover, both of which have\nbeen linked to Lazarus.\nBackdoor.Bravonc has similar code obfuscation as WannaCry and Infostealer.Fakepude (which has been linked to Lazarus).\nThere is shared code between WannaCry and Backdoor.Contopee, which has previously been linked to Lazarus.\n\n## February attack\n\nThe first evidence Symantec has seen of WannaCry being used in the wild was February 10, 2017, when a single organization was\ncompromised. Within two minutes of the initial infection, more than 100 computers in the organization were infected.\n\nThe attackers left behind several tools on the victim’s network that provided substantial evidence into how WannaCry spread. Two files,\nmks.exe and hptasks.exe (see Appendix C: Indicators of Compromise), were found on one affected computer. The file mks.exe is a variant of\n[Mimikatz (Hacktool.Mimikatz), a password-dumping tool that is widely used in targeted attacks. The latter file, hptasks.exe, was used to then](https://www.symantec.com/security_response/writeup.jsp?docid=2012-042615-3731-99)\ncopy and execute WannaCry on other network computers using the passwords stolen by mks.exe.\n\nThe spread of WannaCry by hptasks.exe was a two-stage process. In stage one, when run, hptasks can be passed a target list of IP\naddresses as an argument. When given this command, hptasks reads previously stolen credentials from a file called cg.wry and uses them to\nconnect to every computer in the set of IP address ranges. All connection attempts are logged into the log.dat file. If a successful connection\nis made to a remote computer, and there is no file with a .res extension in either the Admin$, or C$\\Windows folders, then hptasks.exe will\ncopy the files listed in Table 2 onto the remote computer.\n\n**File name** **Remote locations** **Type**\n\n\ncg.wry \\\\%s\\Admin$\\, \\\\%s\\C$\\Windows\\ where %s the remote\nsystem\n\nr2.wry \\\\%s\\Admin$\\, \\\\%s\\C$\\Windows\\ where %s the remote\nsystem\n\nt1.wry \\\\%s\\Admin$\\, \\\\%s\\C$\\Windows\\ where %s the remote\nsystem\n\ntaskmsgr.exe \\\\%s\\Admin$\\, \\\\%s\\C$\\Windows\\ where %s the remote\nsystem\n\n\nConfiguration details\n\nMessage to the user with instructions on how to pay\n\nMessage to the user, for example \"Most of your files are\nencrypted...\"\n\nApplication for displaying the messages in t1.wry and t2.wry\n\n\n-----\n\n**File name** **Remote locations** **Type**\n\n\ntaskschs.exe \\\\%s\\Admin$\\, \\\\%s\\C$\\Windows\\ where %s the remote\nsystem\n\n_Table 1. Files copied by hptasks.exe onto target computers_\n\n\nWannaCry encryption application\n\n\nAfter hptasks.exe executes WannaCry on the remote computer, the second stage begins. hptasks can pass several arguments to the\nWannaCry installation on the remote computer, including a new set of IP addresses. If WannaCry is run with these IP addresses as\narguments, it does not encrypt the files on the local computer. Instead, it connects to the IP addresses passed, accesses the Admin$ and C$\nshare on those computers using the credentials embedded in the resource section in a file called c.wry, and then remotely encrypts those\nfiles.\n\nIn addition to hptasks.exe and mks.exe, five other pieces of malware were discovered on a second computer on the victim’s network. Three\n[of these tools are linked to Lazarus. Two were variants of Destover (Backdoor.Destover) a tool used in the Sony Pictures attacks. The third](https://www.symantec.com/security_response/writeup.jsp?docid=2014-120209-5631-99)\nwas [Trojan.Volgmer, malware that has previously been used by Lazarus in attacks against South Korean targets.](https://www.symantec.com/security_response/writeup.jsp?docid=2014-081811-3237-99)\n\n## March and April attacks\n\nBeginning on March 27, at least five organizations were infected with a new sample of WannaCry. There does not appear to have been a\npattern to those targeted, with the organizations spanning a range of sectors and geographies. These attacks revealed further evidence of\nlinks between those behind WannaCry and the Lazarus Group.\n\n[Two different backdoors were used to deploy WannaCry in these attacks: Trojan.Alphanc and](https://www.symantec.com/security_response/writeup.jsp?docid=2017-052206-5950-99) [Trojan.Bravonc. Alphanc was used to drop](https://www.symantec.com/security_response/writeup.jsp?docid=2017-052206-5428-99)\nWannaCry onto computers belonging to at least two of the known victims, with a slightly modified version of the malware deployed to each\nvictim.\n\n[Alphanc shares a significant amount of code with Backdoor.Duuzer, a sub-family of the Destover wiping tool used in the Sony attacks (see](https://www.symantec.com/security_response/writeup.jsp?docid=2015-082113-4423-99)\nAppendix B: Shared Code). In fact, Symantec investigators believe Alphanc is an evolution of Duuzer. Duuzer has also previously been linked\nto the activity of [Backdoor.Joanap and](https://www.symantec.com/security_response/writeup.jsp?docid=2015-092507-0410-99) [Trojan.Volgmer, which have both been previously linked to Lazarus.](https://www.symantec.com/security_response/writeup.jsp?docid=2014-081811-3237-99)\n\nSymantec researchers were able to establish a detailed timeline of the activity of Alphanc on one of the victim’s systems, from the time it got\non the system to when WannaCry was deployed.\n\n### Timeline of Alphanc activity\n\nAlphanc was deployed on the target computer as armsvc.exe and minutes later copied itself to a new name, javaupdate.exe. The sample\nexecuted from this location:\n\n_cmd.exe /c \"copy c:\\Users\\Administrator\\AppData\\armsvc.exe c:\\windows\\system32\\javaupdate.exe >_\n_C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK15DA.tmp\" 2>&1_\n\nMinutes later, mks.exe, the same credential dumper used in the February WannaCry attacks, was created and executed. There was no\nactivity for three days, until the attackers returned and deployed a version of RAR and created a password-protected archive. Moments later a\nnetwork scanner called g.exe ran. This performed a DNS lookup for all IP addresses in the IP address range selected by the attackers,\nprobably to determine computers of interest. A two-day gap in activity followed before the attackers returned to profile the local network.\nExamples of commands used include:\n\n_cmd.exe /c \"net view > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK2301.tmp\" 2>&1_\n\n_cmd.exe /c \"net view /domain > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK6C42.tmp\" 2>&1_\n\n_cmd.exe /c \"time /t > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NKC74F.tmp\" 2>&1_\n\nThen, the file taskhcst.exec was created by javaupdate.exe. This was the WannaCry ransomware. The .exec extension is renamed to .exe,\nas illustrated blow. This was likely a safety check so that the attacker would not mistakenly execute the file prematurely.\n\n_cmd.exe /c \"ren C:\\Windows\\taskhcst.exec taskhcst.exe > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK833D.tmp\" 2>&1_\n\nApproximately 45 minutes later, the attacker copied the javaupdate.exe backdoor to a remote computer. A file called bcremote.exe was then\nalso copied to this computer; this was the same tool that was called hptasks.exe in the February attack, and was used to spread WannaCry\nacross the network. The configuration file for this file was then copied, and finally WannaCry itself was copied over:\n\n_cmd.exe /c \"net use \\\\REDACTED\\ipc$ REDACTED /u:REDACTED > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK2E.tmp\" 2>&1_\n\n_cmd.exe /c \"copy c:\\windows\\system32\\javaupdate.exe \\\\REDACTED\\c$\\windows\\javaupdate.exe >_\n_C:\\Users\\REDACTEDAppData\\Local\\Temp\\NK3E49.tmp\" 2>&1_\n\n_cmd.exe /c \"copy c:\\windows\\beremote.exe \\\\REDACTED\\c$\\windows\\ > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK4DD5.tmp\" 2>&1_\n\n_cmd.exe /c \"copy c:\\windows\\c.wry \\\\REDACTED\\c$\\windows\\ > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK7228.tmp\" 2>&1_\n\n_cmd.exe /c \"copy c:\\windows\\taskh*.exe \\\\REDACTED\\c$\\windows\\ > C:\\Users\\REDACTED\\AppData\\Local\\Temp\\NK7DCF.tmp\" 2>&1_\n\n\n-----\n\ne sa e p ocess too p ace o a seco d se e o t e et o, a d e t e bc e ote e e co a d as e ecuted, a aC y as\nspread across the network.\n\n### Trojan.Bravonc\n\nFewer details are available about the operation of Trojan.Bravonc, but it was used to drop WannaCry onto the computers of at least two other\nvictims, and displays some fairly definitive links to the Lazarus group.\n\nIt connects to a command and control (C&C) server at the IP address 87.101.243.252, which is the same IP address used by a sample of\nDestover, a known Lazarus tool. This IP address was also referenced in Blue Coat’s [From Seoul To Sony report.](https://www.bluecoat.com/security-blog/2016-02-24/seoul-sony)\n\nDuuzer has also been observed using this IP address as a C&C server. Bravonc and a variant of Destover also share cryptographic related\ncode (See Appendix B: Shared Code). In addition, Bravonc’s method of spreading (over SMB using hardcoded credentials), was the same\ntechnique used by Joanap, another Lazarus-linked tool.\n\n## May attacks: WannaCry goes global\n\nOn May 12, [a new version of WannaCry was released which incorporated the leaked “EternalBlue” exploit that used two known vulnerabilities](https://www.symantec.com/connect/blogs/what-you-need-know-about-wannacry-ransomware)\n[in Windows (CVE-2017-0144 and](https://www.symantec.com/security_response/vulnerability.jsp?bid=96704) [CVE-2017-0145) to spread the ransomware to unpatched computers on the victim’s network and also to](https://www.symantec.com/security_response/vulnerability.jsp?bid=96705)\nother vulnerable computers connected to the internet.\n\nThe incorporation of EternalBlue transformed WannaCry from a dangerous threat that could only be used in a limited number of targeted\nattacks to one of the most virulent strains of malware seen in recent years. It caused widespread disruption, both to organizations infected\nand to organizations forced to take computers offline for software updates. The discovery and triggering of a kill switch by security blog\nMalwareTech halted its spread and limited the damage.\n\nThe earlier versions of WannaCry and the one used in the May 12 attacks are largely the same, with some minor changes, chiefly the\nincorporation of the EternalBlue exploit. The passwords used to encrypt the Zip files embedded in the WannaCry dropper are similar across\nboth versions (\"wcry@123\", \"wcry@2016\", and \"WNcry@2ol7\") indicating that the author of both versions is likely the same group.\n\nThe small number of Bitcoin wallets used by first version of WannaCry, and its limited spread, indicates that this was not a tool that was\nshared across cyber crime groups. This provides further evidence that both versions of WannaCry were operated by a single group.\n\n## WannaCry links to Lazarus\n\nAside from commonalities in the tools used to spread WannaCry, there are also a number of links between WannaCry itself and Lazarus. The\n[ransomware shares some code with Backdoor.Contopee, malware that has previously been linked to Lazarus. One variant of Contopee uses](https://www.symantec.com/security_response/writeup.jsp?docid=2016-021515-4543-99)\na custom SSL implementation, with an identical cipher suite, which is also used by WannaCry. The cipher suite in both samples has the same\nset of 75 different ciphers to choose from (as opposed to OpenSSL where there are over 300).\n\n[In addition, WannaCry uses similar code obfuscation to Infostealer.Fakepude, malware that has previously been linked to Lazarus; and](https://www.symantec.com/security_response/writeup.jsp?docid=2016-040409-4542-99)\nTrojan.Alphanc, malware that was used to spread WannaCry in the March and April attacks and which has been linked to Lazarus (see\nabove).\n\n## Fortuitous leak turned WannaCry into global threat\n\nThe discovery of a small number of earlier WannaCry attacks has provided compelling evidence of a link to the Lazarus group. These earlier\nattacks involved significant use of tools, code, and infrastructures previously associated with the Lazarus group, while the means of\npropagation through backdoors and stolen credentials is consistent with earlier Lazarus attacks. The leak of the EternalBlue exploit was what\nallowed the attackers to turn WannaCry into a far more potent threat than it would have been had they still been relying on their own tools,\nsince it bypassed many of the steps the attackers previously had to take, removing both the need to steal credentials and copy it from\ncomputer to computer.\n\nThanks to Symantec’s Network Protection Research Labs for their contribution to this research.\n\n## Appendix A: WannaCry and Lazarus shared network infrastructure\n\nThere are a number of crossovers seen in the C&C servers used in the WannaCry campaigns and by other known Lazarus tools. For\nexample, during the attacks against Sony, a malware family called Backdoor.Destover was deployed. Later variants of Backdoor.Destover\nwere seen to use the IP address 87.101.243.252 for command and control. The Trojan.Bravonc sample discovered dropping WannaCry also\nconnects to this IP address. Other shared network infrastructure is listed below:\n\n**C&C** **Used by** **Comments**\n\n\n-----\n\n**C&C** **Used by** **Comments**\n\n87.101.243.252 Trojan.Bravonc,\n\nBackdoor.Duuzer\n\nBackdoor.Destover\n\n84.92.36.96 Trojan.Alphanc Also used by a backdoor program which shares an additional C&C with Lazarus-linked\nBackdoor.Cuprox\n\n184.74.243.67 Trojan.Alphanc Also seen used by entaskloader.exe which drops a network scanning tool used in March attacks\n\n203.69.210.247 Trojan.Alphanc\n\n196.45.177.52 Backdoor.Cuprox Also seen used by a backdoor program dropped by a document called\n“discussion_QuadrigaCX.doc”\n\n_Table 2. Infrastructure shared by WannaCry and other Lazarus tools_\n\n## Appendix B: Shared Code\n\n### Shared network code between Trojan.Alphanc and Backdoor.Duuzer\n\nTrojan.Alphanc and Backdoor.Duuzer use similar code to generate the buffer being sent out after connection to the C&C server is\nestablished. This code is part of what could be referred to as a \"Fake SSL\" handshake. This is similar in concept to the code identified by\nGoogle, but different in implementation. Both samples generate a random number, and use that number to lookup a table for additional data\nto send. That table is identical across both samples. In addition, both samples will prepend the same value, 0x16030100, to the start of the\nbuffer sent to the C&C server.\n\n_Figure 1. Backdoor.Duuzer sample with the hash fa6ee9e969df5ca4524daa77c172a1a7_\n\n\n-----\n\n_Figure 2. Backdoor Alphanc sample with the hash E8C6ACC1EB7256DB728C0F3FED5D23D7_\n\n### Common strings between Trojan.Alphanc and Backdoor.Duuzer\n\nThe following table demonstrates the common strings between Trojan.Alphanc and Backdoor.Duuzer.\n\n\n-----\n\n_Figure 3. Common strings between Trojan.Alphanc and Backdoor.Duuzer_\n\n### Cryptographic number related routines between Backdoor Bravonc and Backdoor Destover\n\n\n-----\n\n_Figure 4. Trojan.Bravonc sample with the hash 55dd9b0af2a263d215cb4fd48f16231a_\n\n_Figure 5. Destover variant with the hash 0f246a13178841f8b324ca54696f592b_\n\n### Shared function identified by Neel Mehta\n\nOn May 15, Google researcher Neel Mehta tweeted the following:\n\n\n-----\n\nThe first hash, 9c7c7149387a1c79679a87dd1ba755bc, is a Ransom.WannaCry variant and ac21c8ad899727137c4b94458d7aa8d8 is a\n[variant of Backdoor.Contopee, a backdoor used in attacks against several banks. The samples referenced in the tweet contain shared code.](https://community.broadcom.com/symantecenterprise/viewdocument?DocumentKey=8ae1ff71-e440-4b79-9943-199d0adb43fc&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments)\nThis shared code is part of a custom SSL implementation, using an identical cipher suite. It could be described as \"fake ssl\". Each cipher\nspecifies an option for key exchange, authentication, bulk encryption, MAC. The Contopee sample and WannaCry sample have almost\nidentical pieces of code that reference an identical cipher suite. The cipher suite in both samples has the same 75 different ciphers to choose\nfrom (as opposed to OpenSSL where there are over 300).\n\n## Appendix C: Indicators of Compromise\n\n**MD5** **SHA256** **File**\n\n21307227ECE129B1E12797ECC2C9B6D9 8A4D2BAA8CF519C7A9B91F414A0A9D8BA2B9E96D21D9E77DA7B34ED849830A36 mks\n\n6F0338AF379659A5155B3D2A4F1A1E92 CA8DC152DC93EC526E505CF2A173A635562FFBF55507E3980F7DC6D508F0F258 hpta\n\n0489978ffa3b864ede646d0470500336 2A99BCB5D21588E0A43F56AADA4E2F386791E0F757126B2773D943D7CBF47195 ENT\nCrea\n\na1ffca7ba257b4eca7fe7d1e78bac623 3C86FC0A93299A0D0843C7D7FF1A137A9E799F8F2858D3D30F964E3C12C28C9E forti.\n\nf27cf59b00dacdd266ad7894a1df0894 92b0f4517fb22535d262a7f17d19f7c21820a011bfe1f72a2ec9fbffbdc7e3e0 java\ng.ex\n\na1ffca7ba257b4eca7fe7d1e78bac623 3C86FC0A93299A0D0843C7D7FF1A137A9E799F8F2858D3D30F964E3C12C28C9E g.ex\n\n511778c279b76cac40d5d695c56db4f5 91146EE63782A2061701DB3229320C161352EE2BC4059CCC3123A33114774D66 svch\nlsas\n\nf774c0588da59a944abc78d5910be407 A7EA1852D7E73EF91EFB5EC9E26B4C482CA642D7BC2BDB6F36AB72B2691BA05A lsas\n5079\n\n8386379a88a7c9893a62a67ea3073742 7F8166589023CD62AE55A59F5FCA60705090D17562B7F526359A3753EB74EA2F 5079\ntask\n\n3bc855bfadfea71a445080ba72b26c1c 043E0D0D8B8CDA56851F5B853F244F677BD1FD50F869075EF7BA1110771F70C2 task\nWan\n\nF27CF59B00DACDD266AD7894A1DF0894 92B0F4517FB22535D262A7F17D19F7C21820A011BFE1F72A2EC9FBFFBDC7E3E0 arms\njava\n\nE8C6ACC1EB7256DB728C0F3FED5D23D7 524F8F0F8C31A89DF46A77C7A30AF5D2A1DC7525B08BFAFBED98748C3D8A3F1C jusc\n\n1D4EC831292B611F1FF8983EBD1DB5D4 41E9D6C3374FD0E78853E945B567F9309446084E05FD013805C70A6A8205CD70 msin\n\nD0CE651A344979C8CD11B8019F8E4D7E 436195BD6786BAAE8980BDFED1D7D7DBCCCB7D5085E79EBDCC43E22D8BAE08A8 goyq\n\n9A5FA5C5F3915B2297A1C379BE9979F0 9F177A6FB4EA5AF876EF8A0BF954E37544917D9AABA04680A29303F24CA5C72C exld\n\n86759CE27D0FE0B203AAA19D4390A416 AE8E9FF2DC0EC82B6BAE7C4D978E3FEAC93353CB3CD903E15873D31E30749150 oled\n\nFCF3702E52AE32C995A36F7516C662B7 FC079CEFA19378A0F186E3E3BF90BDEA19AB717B61A88BF20A70D357BF1DB6B8 bitss\n\ne117406e3c14ab8e98b27c3697aea0b6 2BA20E39FF90E36086044D02329D43A8F7AE6A7663EB1198B91A95EA556CF563 00be\n\n[For additional information from Symantec regarding the WannaCry virus, visit our dedicated WannaCry Ransomware page.](https://www.symantec.com/outbreak/?id=wannacry)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-22 - WannaCry- Ransomware attacks show strong links to Lazarus group.pdf"
    ],
    "report_names": [
        "2017-05-22 - WannaCry- Ransomware attacks show strong links to Lazarus group.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535793,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653762069,
    "ts_modification_date": 1653762069,
    "files": {
        "pdf": "https://archive.orkl.eu/c06395ede563fd69e26b51b9392eaaf3a846d756.pdf",
        "text": "https://archive.orkl.eu/c06395ede563fd69e26b51b9392eaaf3a846d756.txt",
        "img": "https://archive.orkl.eu/c06395ede563fd69e26b51b9392eaaf3a846d756.jpg"
    }
}