{
    "id": "3930c0b9-83ce-4cd7-b5f8-2908caa0faf7",
    "created_at": "2023-01-12T15:02:02.72573Z",
    "updated_at": "2025-03-27T02:09:30.131905Z",
    "deleted_at": null,
    "sha1_hash": "ca65ae16e4f2196ccdc9e627566f102cd7734b6e",
    "title": "2021-07-06 - Understanding REvil- The Ransomware Gang Behind the Kaseya Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T15:42:47Z",
    "file_modification_date": "2022-05-28T15:42:47Z",
    "file_size": 1383416,
    "plain_text": "# Understanding REvil: The Ransomware Gang Behind the Kaseya VSA Attack\n\n**unit42.paloaltonetworks.com/revil-threat-actors/**\n\nJohn Martineau July 6, 2021\n\nBy [John Martineau](https://unit42.paloaltonetworks.com/author/john-martineau/)\n\nJuly 6, 2021 at 2:50 PM\n\n[Category: Ransomware,](https://unit42.paloaltonetworks.com/category/ransomware/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [GandCrab,](https://unit42.paloaltonetworks.com/tag/gandcrab/) [Kaseya,](https://unit42.paloaltonetworks.com/tag/kaseya/) [ransomware threat report,](https://unit42.paloaltonetworks.com/tag/ransomware-threat-report/) [REvil,](https://unit42.paloaltonetworks.com/tag/revil/) [Sodinokibi](https://unit42.paloaltonetworks.com/tag/sodinokibi/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/revil-threat-actors/)\n\n## Executive Summary\n\nREvil has emerged as one of the world’s most notorious ransomware operators. In just the\npast month, it extracted an $11 million payment from the U.S. subsidiary of the world’s\nlargest meatpacking company based in Brazil, demanded $5 million from a Brazilian medical\ndiagnostics company and launched a large-scale attack on dozens, perhaps hundreds, of\ncompanies that use IT management software from Kaseya VSA.\n\n\n-----\n\nWhile REvil (which is also known as Sodinokibi) may seem like a new player in the world of\ncybercrime, Unit 42 has been monitoring the threat actors tied to this group for three years.\nWe first encountered them in 2018 when they were working with a group known as\nGandCrab. At the time, they were mostly focused on distributing ransomware through\nmalvertising and exploit kits, which are malicious advertisements and malware tools that\nhackers use to infect victims through drive-by downloads when they visit a malicious website.\n\nThat group morphed into REvil, grew and earned a reputation for exfiltrating massive data\nsets and demanding multimillion dollar ransoms. It is now among an elite group of cyber\nextortion gangs that are responsible for the surge in debilitating attacks that have made\nransomware among the most pressing security threats to businesses and nations around the\nglobe.\n\n[Earlier this year, we released a threat assessment tying REvil/Sodinokibi to GandCrab. Here,](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/7/)\nwe provide insights gleaned from Unit 42 cybersecurity consultants who worked over a\ndozen REvil ransomware cases in the first six months of 2021. We hope these accounts of\nREvil’s tactics and steps taken to counter this threat will help organizations better defend\nagainst future ransomware attacks. We also encourage you to review the 2021 Unit 42\nRansomware Threat Report for further insight into REvil and other ransomware operators.\n\n[Palo Alto Networks WildFire,](https://www.paloaltonetworks.com/products/secure-the-network/wildfire) [Threat Prevention and](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [Cortex XDR detect and prevent REvil](https://www.paloaltonetworks.com/cortex/cortex-xdr)\nransomware infections.\n\nIf you think you may have been impacted, please email unit42investigations@paloaltonetworks.com or call (866) 4-UNIT42 to get in touch with the Unit 42\nIncident Response team.\n\n## Ransomware as a Service\n\nREvil is one of the most prominent providers of ransomware as a service (RaaS). This\ncriminal group provides adaptable encryptors and decryptors, infrastructure and services for\nnegotiation communications, and a leak site for publishing stolen data when victims don’t pay\nthe ransom demand. For these services, REvil takes a percentage of the negotiated ransom\nprice as their fee. Affiliates of REvil often use two approaches to persuade victims into\npaying up: They encrypt data so that organizations cannot access information, use critical\ncomputer systems or restore from backups, and they also steal data and threaten to post it\n[on a leak site (a tactic known as double extortion).](https://www.paloaltonetworks.com/resources/whitepapers/ransomwares-new-trend-exfiltration-and-extortion)\n\nThreat actors behind REvil operations often stage and exfiltrate data followed by encryption\nof the environment as part of their double extortion scheme. If the victim organization does\nnot pay, REvil threat actors typically publish the exfiltrated information. We have observed\nthreat actors who are clients of REvil focus on attacking large organizations, which has\nenabled them to obtain increasingly large ransoms. REvil and its affiliates pulled in an\naverage payment of about $2.25 million during the first six months of 2021 in the cases that\n\n\n-----\n\nwe observed. The size of specific ransoms depends on the size of the organization and type\nof data stolen. Further, when victims fail to meet deadlines for making payments via bitcoin,\nthe attackers often double the demand. Eventually, they post stolen data on the leak site if\nthe victim doesn’t pay up or enter into negotiations.\n\n## 2021 Trends – Something Old, Something New\n\nUnit 42 has worked over a dozen REvil ransomware cases so far this year. While some of\n[the tactics cited in our 2021 Unit 42 Ransomware Threat Report have remained the same,](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/)\nwe have seen a few deviations from REvil’s standard attack lifecycle. For a quick reference,\n[we have generated Actionable Threat Objects and Mitigations (ATOMs) to display REvil’s](https://unit42.paloaltonetworks.com/atoms/revil-ransomware/)\ntactics, techniques, procedures and other indicators of compromise (IOCs).\n\n### How REvil Threat Actors Gain Access\n\nREvil threat actors continue to use previously compromised credentials to remotely access\nexternally facing assets through Remote Desktop Protocol (RDP). Another commonly\nobserved tactic is phishing leading to a secondary payload. However, we also observed a\n[few unique vectors that relate to the recent Microsoft Exchange Server CVEs, as well as a](https://unit42.paloaltonetworks.com/microsoft-exchange-server-attack-timeline/)\ncase that involved a SonicWall compromise. Below are the five unique entry vectors\nobserved thus far in 2021.\n\nA user downloads a malicious email attachment that, when opened, initiates a payload\n[that downloads and installs a QakBot variant of malware. In at least one case, the](https://unit42.paloaltonetworks.com/tutorial-qakbot-infection/)\nversion of QakBot we observed collected emails stored on the local system, archived\nthem and exfiltrated them to an attacker controlled server.\nIn one instance, a malicious ZIP file attachment containing a macro-embedded Excel\n[file that led to an Ursnif infection was used to initially compromise the victim network.](https://unit42.paloaltonetworks.com/tag/ursnif/)\nSeveral actors utilized compromised credentials to access internet-facing systems via\nRDP. It’s unclear how the actors gained access to the credentials in these instances.\nAn actor exploited a vulnerability in a client SonicWall appliance categorized as CVE2021-20016 to gain access to credentials needed to access the environment.\n[An actor utilized the Exchange CVE-2021-27065 and CVE-2021-26855 vulnerabilities](https://unit42.paloaltonetworks.com/exchange-server-credential-harvesting/)\nto gain access to an internet-facing Exchange server, which ultimately allowed the\nactor to create a local administrator account named “admin” that was added to the\n“Remote Desktop Users” group.\n\n### How REvil Threat Actors Establish Their Presence Within an Environment\n\nOnce access is obtained, REvil threat actors typically utilize Cobalt Strike BEACON to\nestablish their presence within an environment. In several instances we observed, they used\nthe remote connection software ScreenConnect and AnyDesk. In other cases, they chose to\ncreate their own local and domain accounts, which they added to the “Remote Desktop\n\n\n-----\n\nUsers group. Further, the threat actors often disabled antivirus, security services and\nprocesses that would interfere with or otherwise detect their presence within the\nenvironment.\n\nBelow are specific techniques we observed thus far in 2021:\n\nOnce the actor had access to the environment, they utilized different toolsets to\nestablish and maintain their access, including the use of Cobalt Strike BEACON as well\nas local and domain account creation. In one instance, the REvil group utilized a BITS\njob to connect to a remote IP, download and then execute a Cobalt Strike BEACON.\nIn several incidents, Unit 42 identified the use of “Total Deployment Software” by REvil\nthreat actors to deploy ScreenConnect and AnyDesk software to maintain access\nwithin the environment.\nIn many instances, the REvil actor(s) created local and domain level accounts through\nBEACON and NET commands even if they had access to domain-level administrative\ncredentials.\nUnit 42 observed common evasion techniques across all engagements in which REvil\nthreat actors used [1-3] alphanumeric batch and PowerShell scripts that stopped and\ndisabled antivirus products, services related to Exchange, VEAAM, SQL and EDR\nvendors, as well as enabled terminal server connections.\n\n### How REvil Threat Actors Expand Access and Gather Intelligence\n\nIn most cases, REvil actors need to gain access to additional accounts that have a wider set\nof privileges in order to move further within the victim environment and carry out their\nmission. They often use Mimikatz to access cached credentials on the local host. However,\nUnit 42 also observed the SysInternals tool procdump as a means to dump the LSASS\nprocess. Unit 42 also found it common for this threat actor to access files with the name\n“password” within the filename. In one instance, we observed an attempt to gain access to a\nKeePass Password Safe.\n\nDuring the reconnaissance phase of attacks, REvil threat actors often utilize various open\nsource tools to gather intelligence on a victim environment and in some cases resort to\nutilizing administrative commands NETSTAT and IPCONFIG to gather information.\n\nBelow are specific observations of REvil’s behavior in 2021.\n\nNetwork reconnaissance tools netscan, Advanced Port Scanner, TCP View and KPort\nScanner were observed in over half the engagements Unit 42 responded to.\nThe threat actors often use Bloodhound and AdFind to map out networks and gather\nother active directory information.\nIn two engagements, Unit 42 observed the use of ProcessHacker and PCHunter in\nwhat appeared to be an attempt to gain insight into processes and services running on\nhosts within the environment.\n\n\n-----\n\n### How REvil Threat Actors Move Laterally Throughout Compromised Environments\n\nIn general, REvil threat actors utilize Cobalt Strike BEACON and RDP with previously\ncompromised credentials to laterally move throughout compromised environments.\nAdditionally, Unit 42 observed use of the ScreenConnect and AnyDesk software as methods\n[of lateral movement. While we have seen other ransomware groups employ these tactics, we](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/3/)\nobserved REvil threat actors retrieving these binaries from file sharing sites such as\nMEGASync and PixelDrain.\n\n### How REvil Threat Actors Complete Their Objectives\n\nFinally, we observed REvil threat actors moving to the final stage of their attack, encrypting\nnetworks, staging and exfiltrating data, and destroying data to prevent recovery and hinder\nanalysis.\n\nRansomware Deployment\n\nREvil threat actors typically deployed ransomware encryptors using the legitimate\nadministrative tool PsExec with a text file list of computer names or IP addresses of the\nvictim network obtained during the reconnaissance phase.\nIn one instance, a REvil threat actor utilized BITS jobs to retrieve the ransomware from\ntheir infrastructure. In a separate instance, the REvil threat actor hosted their malware\non MEGASync.\nREvil threat actors also logged into hosts individually using domain accounts and\nexecuted the ransomware manually.\nIn two instances, the REvil threat actor utilized the program dontsleep.exe in order to\nkeep hosts on during ransomware deployment.\nREvil threat actors often encrypted the environment within seven days of the initial\ncompromise. However, in some instances, the threat actor(s) waited up to 23 days.\n\nExfil\n\nThreat actors often used MEGASync software or navigated to the MEGASync website\nto exfiltrate archived data.\nIn one instance, the threat actor used RCLONE to exfiltrate data.\n\nDefense Maneuvers\n\nDuring the encryption phase of these attacks, the REvil threat actors utilized batch scripts\nand wevtutil.exe to clear 103 different event logs. Additionally, while not an uncommon tactic\nthese days, REvil threat actors deleted Volume Shadow Copies in an apparent attempt to\nfurther prevent recovery of forensic evidence.\n\n## Conclusion: Evolve\n\n\n-----\n\nWhile the REvil operational group may target large organizations, all are potentially\nsusceptible to attack. As we draw closer to a post COVID-19 environment, IT and other\ndefenders of networks should take time to learn what’s normal in their environments and\nnotice and question abnormalities. Investigate them. Question your defenses. Do all users\nneed to be able to open macro-enabled documents? Do you have endpoint visibility and\nprotections to, at minimum, alert you to secondary infections such as QakBot? If you\nabsolutely need RDP, are you using tokenized MFA? And don’t question just once – question\nroutinely. Think like the attacker. You might be able to stop your organization from being the\nnext victim and escape being in the headlines for the wrong reasons.\n\nPalo Alto Networks customers are protected by:\n\n[WildFire: All known samples are identified as malware.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[Cortex XDR with:](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nPrevention for known REvil indicators\nAnti-Ransomware Module to prevent REvil encryption behaviors.\nLocal Analysis detection to prevent REvil binary executions.\nBehavioral Threat Protection, Anti-exploitation modules and Suspicious Process\nCreation to prevent REvil techniques.\nXDR Analytics, Analytics BIOCs and BIOCs to detect REvil techniques.\n[AutoFocus: Tracking related activity using the REvil tag.](https://www.paloaltonetworks.com/cortex/autofocus)\n[Cortex XSOAR: “Kaseya VSA 0-day - REvil Ransomware Supply Chain Attack”](https://www.paloaltonetworks.com/cortex/xsoar)\nplaybook. Playbook includes the following tasks:\n\n1. Collect related known IOCs from several sources.\n2. Indicators, PS commands, Registry changes and known HTTP requests hunting\n\nusing PAN-OS, Cortex XDR and SIEM products.\n3. Block IOCs automatically or manually.\n\n[Unit 42 Incident Response Services: Experts to help you respond and recover.](https://www.paloaltonetworks.com/unit42/incident-response)\n\n## Additional Resources\n\n[Threat Assessment: GandCrab and REvil Ransomware](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/7/)\n\n[2021 Unit 42 Ransomware Threat Report](https://start.paloaltonetworks.com/unit-42-ransomware-threat-report)\n\n[Breaking Down Ransomware Attacks](https://unit42.paloaltonetworks.com/breaking-down-ransomware-attacks/)\n\n[Ransomware’s New Trend: Exfiltration and Extortion](https://www.paloaltonetworks.com/resources/whitepapers/ransomwares-new-trend-exfiltration-and-extortion)\n\n[Cortex XSOAR playbook documentation](https://xsoar.pan.dev/docs/reference/playbooks/kaseya-vsa--0-day---r-evil-ransomware-supply-chain-attack)\n\n_Updated July 7, 2021 at 10:50 a.m. PT_\n\n\n-----\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-06 - Understanding REvil- The Ransomware Gang Behind the Kaseya Attack.pdf"
    ],
    "report_names": [
        "2021-07-06 - Understanding REvil- The Ransomware Gang Behind the Kaseya Attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535722,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653752567,
    "ts_modification_date": 1653752567,
    "files": {
        "pdf": "https://archive.orkl.eu/ca65ae16e4f2196ccdc9e627566f102cd7734b6e.pdf",
        "text": "https://archive.orkl.eu/ca65ae16e4f2196ccdc9e627566f102cd7734b6e.txt",
        "img": "https://archive.orkl.eu/ca65ae16e4f2196ccdc9e627566f102cd7734b6e.jpg"
    }
}