{
    "id": "393f041d-cd75-4664-9a44-118ae3e91a02",
    "created_at": "2023-11-15T02:06:06.773743Z",
    "updated_at": "2025-03-27T02:17:11.189563Z",
    "deleted_at": null,
    "sha1_hash": "aed53f16c085e33ed7c65ba8b81b682c5e66bee7",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-10-25T18:02:20Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 2487153,
    "plain_text": "# CAMPAGNES D'ATTAQUES DU MODE OPÉRATOIRE APT28 DEPUIS 2021\n\n## ILLUSTRATION DE LA MENACE ET RECOMMANDATIONS DE SÉCURISATION\n\n##### 1.0 26 octobre 2023\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n## Sommaire\n\n**1** **Résumé . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **3**\n\n**2** **Tactiques, techniques & procédures . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **4**\n2.1 Reconnaissance . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n2.2 Développement des capacités . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n2.3 Accès initial . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n2.4 Exploitation, persistance & élévation de privilèges . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n2.5 Collecte & mécanismes de commande et de contrôle . . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n2.6 Exfiltration . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 8\n\n**3** **Recommandations . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **9**\n3.1 Sécurité des échanges par courriers électroniques . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n3.2 Sécurité des données d’authentification . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n3.3 Sécurité des postes utilisateurs . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n3.4 Sécurisation de l’accès aux contenus hébergés sur Internet . . . . . . . . . . . . . . . . . . . . . . . . 19\n\n**4** **Bibliographie . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **21**\n\n26 octobre 2023 Page 2 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n## 1 Résumé\n\nLors de ses investigations, l’ANSSI a analysé plusieurs chaînes de compromission du mode opératoire d’attaque\n(MOA) APT28 [1] utilisées à des fins d’espionnage. Certaines campagnes ont été dirigées contre des organisations\nfrançaises, dont des entités gouvernementales, des entreprises, des universités, ainsi que des instituts de recherche\net des groupes de réflexion (think tanks).\n\nSi les attaquants poursuivent leurs campagnes d’attaque par force brute et d’exploitation de vulnérabilités, l’ANSSI\nconstate par ailleurs que les attaquants réduisent le risque de détection en compromettant des équipements peu\nsurveillés et situés en périphérie du réseau [2]. Dans certains cas, aucune porte dérobée n’est déposée sur le réseau\ncompromis.\n\nCe document s’appuie sur des rapports techniques publiés en source ouverte et des éléments collectés durant des\nopérations de réponse à incident réalisées par l’ANSSI. Il détaille les tactiques, techniques et procédures (TTP)\ncaractéristiques des activités du mode opératoire depuis la seconde moitié de l’année 2021 (section 2) et propose\nune série de recommandations pour se prémunir contre ce type d’attaque (section 3).\n\n1. Également connu sous les noms de UAC-0028, Fancy Bear, FrozenLake, Sednit, Sofacy ou encore Pawn Storm.\n2. Routeurs, passerelles et serveurs de messagerie, pare-feux, etc.\n\n26 octobre 2023 Page 3 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n## 2 Tactiques, techniques & procédures\n### 2.1 Reconnaissance\n\nDurant ses investigations, l’ANSSI a identifié différentes techniques de reconnaissance employées par APT28.\n\nLe mode opératoire repose sur l’utilisation de comptes de messagerie compromis pour mener ses campagnes d’ha[meçonnage [T1597] [1, 2, 3, 4]. Dans certains cas, les identifiants et mots de passe de ces comptes sont présents dans](https://attack.mitre.org/techniques/T1597)\ndes bases de fuites de données.\n\n_[APT28 est également employé dans des attaques par force brute [T1110.003, T1110.004]. Les opérateurs du MOA](https://attack.mitre.org/techniques/T1110/003)_\nciblent très largement des comptes de messagerie personnels [2, 5, 6, 7, 8, 9]. Ces campagnes sont destinées à récupérer massivement des informations de connexion (credentials harvesting) afin d’alimenter des dictionnaires d’attaque.\nCes informations sont ensuite réutilisées pour cibler des comptes d’employés.\n\nDans une campagne documentée fin avril 2023, les opérateurs d’APT28 ont diffusé des courriels d’hameçonnage\nindiquant aux utilisateurs de mettre à jour leur système en exécutant des instructions en langage PowerShell [8].\nCes instructions permettaient de télécharger et d’exécuter un script contenant deux commandes :\n\n  - tasklist, qui permet de lister l’ensemble des processus en cours d’exécution;\n\n  - systeminfo, qui permet d’afficher les informations de configuration détaillées d’un ordinateur et de son système d’exploitation. Ces informations contiennent par exemple la liste des correctifs de sécurité installés.\n\nLe script contenant les deux commandes ci-dessus était hébergé sur « mocky[.]io ». Le résultat des commandes était\nenvoyé en direction de « mockbin[.]org ». MOCKY et MOCKBIN sont des services publics permettant de générer\ndes points de terminaison web afin de tester, suivre et simuler une requête ou une réponse HTTP. L’objectif des\nopérateurs du MOA était probablement de récupérer des informations sur l’environnement informatique de leurs\ncibles afin de mener ultérieurement une attaque de plus grande envergure contre ces systèmes d’information [8].\n\n### 2.2 Développement des capacités\n\nL’ANSSI identifie au moins trois axes de développement de capacités d’APT28 :\n\n[• la recherche de vulnérabilités du jour zéro (0-day) [T1212, T1587.004];](https://attack.mitre.org/techniques/T1212/)\n\n[• la compromission de routeurs et de comptes de messagerie personnels [T1584.005, T1586.002];](https://attack.mitre.org/techniques/T1584/005)\n\n[• l’utilisation d’outils disponibles en source ouverte et de services en ligne [T1588.002, T1583.006].](https://attack.mitre.org/techniques/T1588/002)\n\n[Les investigations de l’ANSSI confirment qu’APT28 a exploité la vulnérabilité 0-day CVE-2023-23397 affectant le](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\nproduit Outlook pour Windows à partir de mars 2022 et jusqu’en juin 2023.\n\nSelon d’autres partenaires, sur cette période, le MOA aurait par ailleurs exploité d’autres vulnérabilités, comme\n[celle touchant Microsoft Windows Support Diagnostic Tool (MSDT, CVE-2022-30190, aussi appelée Follina) ainsi](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2022-ALE-005/)\n[que celles ciblant l’application Roundcube (CVE-2020-12641, CVE-2020-35730, CVE-2021-44026) [1, 2, 10].](https://nvd.nist.gov/vuln/detail/CVE-2020-12642)\n\nLes opérateurs du MOA constituent et maintiennent une partie de leurs infrastructures d’attaque en compromettant\ndes routeurs et des comptes de messagerie personnelle de particuliers et d’entreprises (cf. section 2.1). Ces accès\nservent principalement de rebond pour atteindre des cibles stratégiques. Les opérateurs du MOA utilisaient en\neffet les comptes de messageries compromis pour envoyer des courriels malveillants et les routeurs compromis\npour récupérer des données exfiltrées.\n\n[Durant la campagne d’exploitation de la vulnérabilité CVE-2023-23397, l’ANSSI a pu confirmer qu’APT28 employait](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\nau moins douze comptes de messagerie appartenant à des entreprises et onze routeurs Ubiquiti compromis :\n\n26 octobre 2023 Page 4 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\nÉmetteur MD5 du fichier Date d’envoi URI Routeur compromis\n\nmaint[@]goldenloafuae[.]com 9f4172d554bb9056c8ba28e32c606b1e 2022-03-18 \\\\5.199.162.132\\SCW 5.199.162.132\n\naccounts[@]regencyservice[.]in 3d4362e8fe86d2f33acb3e15f1dad341 2022-04-14 \\\\101.255.119.42\\event\\2431 101.255.119.42\n\nvikram.anand[@]4ginfosource[.]com f60350585fbfc5dc968f45c6ef4e434d 2022-05-17 \\\\101.255.119.42\\mail\\a5b3553d 101.255.119.42\n\n_Inconnu_ 92e22b7e96aca3f9d733ca609ab0b589 2022-10-05 _Inconnu_ 213.32.252.221\n\nfranch1.lanka[@]bplanka[.]com 43a0441b35b3db061cde412541f4d1e1 2022-10-25 \\\\168.205.200.55\\test 168.205.200.55\n\nmdelafuente[@]ukwwfze[.]com 9a97c56c9ea6d9ebde0968580ea28ea9 2022-10-25 _Inconnu_ 213.32.252.221\n\nkarina[@]bhpcapital[.]com e68cbd4930e2781e0c1b19eb72ec0936 2022-10-26 _Inconnu_ 213.32.252.221\n\nm.salim[@]tsc-me[.]com b21dde4c19e2f6fc08a922e25de38cf5 2022-12-01 \\\\185.132.17.160\\aojv43 185.132.17.160\n\nashoke.kumar[@]hbclife[.]in b5d82be5813c7dacbd97ef5df073b260 2022-12-14 \\\\69.51.2.106\\report 69.51.2.106\n\njayan[@]wizzsolutions[.]com 2bb4c6b32d077c0f80cda1006da90365 2022-12-29 \\\\113.160.234.229\\istanbul 113.160.234.229\n\nm.yasser[@]egymatec[.]ae 238334590d0f62d2a089bd87ad71b730 2023-03-15 \\\\85.195.206.7\\lrmng 85.195.206.7\n\ncommercial[@]vanadrink[.]com 7ee19e6bd9f55ebc0dd6413c68346de6 2023-03-17 \\\\85.195.206.7\\power 85.195.206.7\n\ncommercial[@]vanadrink[.]com 3b698278f225f1e5bace9d177a1a95e0 2023-03-21 \\\\61.14.68.33\\rem 61.14.68.33\n\n_Inconnu_ ce65c51078b7c69a6f50b0b37a36293f 2023-03-28 \\\\24.142.165.2\\req 24.142.165.2\n\nm.nash[@]islandsailors[.]com 65fdbc35bc8c3a2f0e872dbbfd32c7a7 2023-03-29 \\\\42.98.5.225\\ping 42.98.5.225\n\n[Fig. 2.1 – Liste des courriels identifiés par l’ANSSI exploitant la CVE-2023-23397.](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\n\nLors de réponses à incident, l’ANSSI a pu confirmer l’utilisation des outils malveillants Mimikatz et reGeorg par\n_APT28 :_\n\n  - Mimikatz est un outil qui peut notamment servir à extraire les mots de passe (ou leurs empreintes) stockés\nen mémoire sous Windows;\n\n  - reGeorg est un outil de création de tunnels exploitant un serveur HTTP compromis sur lequel un script\n(PHP, ASPX, JSP, etc) spécifique est installé pour relayer du trafic pour d’autres protocoles (exemple : RDP,\nSSH, SMB) et ainsi contourner certaines règles de filtrage.\n\nDes rapports publics indiquent qu’APT28 aurait utilisé le cadriciel Empire, disponible en source ouverte, lors du\ndéploiement de l’implant Graphite, spécifique au mode opératoire [11].\n\nL’emploi de ces outils s’inscrit dans une utilisation plus large de services disponibles en source ouverte. APT28 s’appuie en effet sur plusieurs services d’hébergement comme « neocities[.]org », « frge[.]io », « tinyhost[.]fr »,\n« mockbin[.]org », « mocky[.]io », ainsi que le service d’hébergement gratuit INFINITYFREE [5, 8]. D’autres services du même type ont pu être utilisés par APT28. L’ANSSI observe également la réutilisation de noms de domaines\net de serveurs entre différentes campagnes depuis 2021.\n\nEnfin, APT28 s’appuie sur un ensemble de services de réseau privé virtuel (VPN) pour ses activités malveillantes\n(connexions à des comptes, attaques par force brute, exploitation de vulnérabilités). Ces fournisseurs de services\n_VPN acceptent les cryptomonnaies et mettent en avant la non-traçabilité des données [12, 13]._\n\nUne liste non exhaustive des services VPN employés par le MOA est disponible ci-dessous :\n\n26 octobre 2023 Page 5 sur 23\n\n|Col1|Émetteur|MD5 du fichier|Date d’envoi|URI|Routeur compromis|Col7|\n|---|---|---|---|---|---|---|\n||maint[@]goldenloafuae[.]com|9f4172d554bb9056c8ba28e32c606b1e|2022-03-18|\\\\5.199.162.132\\SCW|5.199.162.132||\n||accounts[@]regencyservice[.]in|3d4362e8fe86d2f33acb3e15f1dad341|2022-04-14|\\\\101.255.119.42\\event\\2431|101.255.119.42||\n||vikram.anand[@]4ginfosource[.]com|f60350585fbfc5dc968f45c6ef4e434d|2022-05-17|\\\\101.255.119.42\\mail\\a5b3553d|101.255.119.42||\n||Inconnu|92e22b7e96aca3f9d733ca609ab0b589|2022-10-05|Inconnu|213.32.252.221||\n||franch1.lanka[@]bplanka[.]com|43a0441b35b3db061cde412541f4d1e1|2022-10-25|\\\\168.205.200.55\\test|168.205.200.55||\n||mdelafuente[@]ukwwfze[.]com|9a97c56c9ea6d9ebde0968580ea28ea9|2022-10-25|Inconnu|213.32.252.221||\n||karina[@]bhpcapital[.]com|e68cbd4930e2781e0c1b19eb72ec0936|2022-10-26|Inconnu|213.32.252.221||\n||m.salim[@]tsc-me[.]com|b21dde4c19e2f6fc08a922e25de38cf5|2022-12-01|\\\\185.132.17.160\\aojv43|185.132.17.160||\n||ashoke.kumar[@]hbclife[.]in|b5d82be5813c7dacbd97ef5df073b260|2022-12-14|\\\\69.51.2.106\\report|69.51.2.106||\n||jayan[@]wizzsolutions[.]com|2bb4c6b32d077c0f80cda1006da90365|2022-12-29|\\\\113.160.234.229\\istanbul|113.160.234.229||\n||m.yasser[@]egymatec[.]ae|238334590d0f62d2a089bd87ad71b730|2023-03-15|\\\\85.195.206.7\\lrmng|85.195.206.7||\n||commercial[@]vanadrink[.]com|7ee19e6bd9f55ebc0dd6413c68346de6|2023-03-17|\\\\85.195.206.7\\power|85.195.206.7||\n||commercial[@]vanadrink[.]com|3b698278f225f1e5bace9d177a1a95e0|2023-03-21|\\\\61.14.68.33\\rem|61.14.68.33||\n||Inconnu|ce65c51078b7c69a6f50b0b37a36293f|2023-03-28|\\\\24.142.165.2\\req|24.142.165.2||\n||m.nash[@]islandsailors[.]com|65fdbc35bc8c3a2f0e872dbbfd32c7a7|2023-03-29|\\\\42.98.5.225\\ping|42.98.5.225||\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\nVPN observés Confiance\n\nSurfShark Forte\n\nExpressVPN Forte\n\nCactusVPN Forte\n\nProtonVPN Forte\n\nPrivateVPN Modérée\n\nIPVanish Modérée\n\nNordVPN Modérée\n\nWorldVPN Faible\n\nPureVPN Faible\n\nVPNSecure Faible\n\nFig. 2.2 – Liste des services VPN probablement utilisés par APT28.\n\n### 2.3 Accès initial\n\nL’ANSSI observe trois principales méthodes d’accès initial employées par le MOA depuis 2021 :\n\n  - l’envoi de courriels d’hameçonnage redirigeant vers une fausse page d’authentification;\n\n  - l’envoi de courriels exploitant des vulnérabilités dans le client de messagerie;\n\n  - le ciblage d’interfaces d’authentification par l’utilisation d’identifiants valides ou d’attaques par force brute.\n\n_[APT28 a été employé à de nombreuses reprises pour conduire des campagnes d’hameçonnage ciblé [T1566]. Ces](https://attack.mitre.org/techniques/T1566)_\ncampagnes s’appuient notamment sur des techniques d’ingénierie sociale pour rediriger les victimes vers des pages\nde récupération d’informations de connexion. Les opérateurs du MOA ont par exemple créé des pages d’hameçonnage imitant la page de connexion Office 365 des entités ciblées.\n\nLe MOA a également diffusé des courriels d’hameçonnage dans le but d’exploiter des vulnérabilités dans le client de\nmessagerie. Certaines vulnérabilités [3] ne nécessitent pas d’action de la part de l’utilisateur. L’objet de ces courriels\nest souvent construit autour d’un terme unique : « Silence. », « Celebration », « Interest. », etc.\n\nCes observations corroborent les activités d’hameçonnage liées au mode opératoire et documentées en source ouverte par des homologues de l’ANSSI et des éditeurs de solutions de sécurité, dont le CERT-UA, CLUSTER25 et\nTRELLIX [2, 3, 14, 15, 11].\n\n[Depuis au moins 2020, les attaques par force brute sont une des méthodes les plus employées par APT28 [T1190].](https://attack.mitre.org/techniques/T1190)\nLes investigations de l’ANSSI confirment que le MOA a conduit ce type d’attaque contre des serveurs de messagerie\net des pare-feux exposés sur Internet en utilisant des dictionnaires de mots de passe.\n\nDans d’autres cas, le MOA a identifié des comptes légitimes et s’y est connecté une fois l’attaque par force brute\n[ou par énumération de mots de passe courants (password spraying) réussie (cf. section 2.1) [T1078]. Ces actions](https://attack.mitre.org/techniques/T1078)\nsont menées au travers de services de VPN ou du réseau d’anonymisation Tor avec des infrastructures pouvant\ncomprendre plus de 1 000 adresses IP différentes [16, 13].\n\n### 2.4 Exploitation, persistance & élévation de privilèges\n\nLe mode opératoire APT28 est en mesure d’exploiter des vulnérabilités afin de gagner en privilège sur les postes\nclients, les serveurs ou les équipements compromis.\n\n[Dans l’un des incidents impliquant le MOA, l’ANSSI a identifié l’exploitation des vulnérabilités CVE-2020-0688 et](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2020-ALE-007)\n[CVE-2020-17144 à l’encontre d’un serveur Exchange exposé au travers d’une interface Outlook Web Access (OWA). Le](https://www.cert.ssi.gouv.fr/avis/CERTFR-2020-AVI-808)\n\n[3. Dont la CVE-2023-23397.](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\n\n26 octobre 2023 Page 6 sur 23\n\n|VPN observés|Confiance|\n|---|---|\n|SurfShark|Forte|\n|ExpressVPN|Forte|\n|CactusVPN|Forte|\n|ProtonVPN|Forte|\n|PrivateVPN|Modérée|\n|IPVanish|Modérée|\n|NordVPN|Modérée|\n|WorldVPN|Faible|\n|PureVPN|Faible|\n|VPNSecure|Faible|\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\nMOA a exploité ces vulnérabilités depuis un compte valide afin d’exécuter du code à distance sur le serveur. L’outil\n**[reGeorg a notamment été utilisé pour pérenniser l’accès au serveur [T1505.003].](https://attack.mitre.org/techniques/T1505/003)**\n\n[Pour se maintenir sur le réseau compromis, APT28 crée par ailleurs des comptes utilisateur [T1136] qui imitent par](https://attack.mitre.org/techniques/T1136)\nexemple l’identité de l’entité ciblée ou encore utilisent des termes génériques comme « guest », « admin », etc.\n\nAu-delà de ces observations, le MOA est connu pour avoir utilisé des techniques plus avancées. L’implant Graphite\nd’APT28 emploierait par exemple une technique de Component Objet Model (COM) Hijacking [4] [[T1546.015] comme](https://attack.mitre.org/techniques/T1546/015)\nmécanisme de persistance [11].\n\nLes opérateurs du MOA identifient généralement des zones non surveillées dans le système d’information de la\nvictime pour se maintenir et effectuer des actions de collecte et d’exfiltration. Certains implants du MOA comme\n**CredoMap et les codes déployés pour l’exploitation de vulnérabilités dans l’application Roundcube collectent et**\nexfiltrent directement les informations recherchées sans mettre en place de moyen de persistance.\n\nCependant, l’ANSSI a pu constater dans ses réponses à incident que plusieurs campagnes d’APT28 n’employaient\naucun code ou mécanisme spécifique pour maintenir un accès sur le réseau de la victime, gagner en privilège ou se\nlatéraliser. Dans certains cas, l’attaquant procède directement à l’exfiltration de données (cf. section 2.6).\n\n### 2.5 Collecte & mécanismes de commande et de contrôle\n\nPour collecter des données, APT28 utilise à la fois des outils génériques et un ensemble de codes malveillants propres\nau mode opératoire. Durant la campagne d’attaques contre des serveurs Exchange, l’ANSSI a pu observer l’utilisation de TTP déjà documentées en source ouverte [13, 17], parmi lesquelles :\n\n  - la récupération des secrets d’authentification stockés dans la mémoire du processus LSASS, soit en utilisant\n[l’outil Mimikatz, soit en faisant appel à la fonction MiniDump de la bibliothèque « comsvcs.dll » [T1003.001];](https://attack.mitre.org/techniques/T1003/001)\n\n  - l’utilisation d’utilitaires natifs comme « ntdsutil.exe » pour récupérer le contenu de la base de données\nActive Directory [5] [[T1003.003];](https://attack.mitre.org/techniques/T1003/003)\n\n  - l’emploi de l’outil « certutil.exe » pour être en mesure de télécharger des ressources distantes dans l’environnement compromis[5] [[T1105];](https://attack.mitre.org/techniques/T1105)\n\n  - la récupération du contenu des boîtes de courriels de personnalités d’intérêt probablement identifiées en\namont.\n\n[L’ANSSI a procédé à l’analyse de la CVE-2023-23397 suite à la publication par MICROSOFT [18]. L’exploitation par](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\n_APT28 consiste en l’envoi de courriels ou de demandes de réunions Outlook afin de déclencher une connexion_\nSMB [4, 19]. Les comptes ciblés réalisent automatiquement une tentative d’authentification auprès d’un service\nSMB contrôlé par l’attaquant. Cette authentification lui permet de récupérer le condensat d’authentification NetNTLMv2. L’attaquant est ensuite en mesure de relayer cette empreinte auprès d’autres services supportant ce type\n[d’authentification [T1528].](https://attack.mitre.org/techniques/T1528)\n\nL’infrastructure de commande et de contrôle (C2) d’APT28 repose notamment sur des services légitimes. À titre\nd’exemple, les implants Graphite et DriveOcean employés par le MOA s’appuient respectivement sur des services\nOneDrive et Google Drive [14, 20]. Cette technique permet aux attaquants de réduire le risque de détection. Il est\négalement plus difficile pour une entité d’interdire le trafic vers ces services.\n\nEnfin, le MOA récupère probablement un ensemble de données d’accès via ses campagnes d’hameçonnage contre\ndes boîtes de courriels de particulier ou l’utilisation de son implant CredoMap, qui permet de collecter des identifiants et des cookies de navigateurs. Ces données sont probablement utilisées a posteriori pour mener des compro[missions à plus large échelle ou s’installer durablement dans un système d’information [T1555.003, T1539] [5].](https://attack.mitre.org/techniques/T1555/003)\n\n4. Les objets COM sont des mécanismes WINDOWS permettant à des logiciels d’interagir entre eux au travers du système d’exploitation.\n5. « certutil.exe » et « ntdsutil.exe » sont des binaires légitimes présents sur le système dont l’utilisation est ici détournée (couramment\nappelé Living Off The Land Binary et abrégé LOLBin).\n\n26 octobre 2023 Page 7 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n[Fig. 2.3 – Schéma présentant les possibilités d’exploitation de la CVE-2023-23397 par APT28.](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\n\n### 2.6 Exfiltration\n\nL’ANSSI a observé le MOA APT28 appliquer différentes techniques d’exfiltration concentrées uniquement sur la\nrécupération de courriels.\n\nLors de ses investigations, l’ANSSI a constaté la compromission d’une passerelle de gestion de courriel opérée par\nun infogérant de la victime. Les opérateurs du MOA ont analysé pendant plusieurs semaines les courriels échangés\navant d’appliquer des filtres sur des modèles spécifiques afin d’exfiltrer du contenu d’intérêt. Au moyen d’une règle\nd’archivage, chaque courriel correspondant à l’un des filtres était archivé sur un serveur contrôlé par l’attaquant.\n\nDans certains cas, le MOA utilisait les secrets de connexion de la boîte de messagerie de sa victime afin d’accéder\nau contenu d’intérêt sans mettre en place de mécanisme d’exfiltration automatisé.\n\nCes TTP s’inscrivent dans la continuité des opérations du MOA documentées en source ouverte, à l’instar de la compromission des serveurs hébergeant l’application Roundcube. Dans cette campagne, le MOA a exfiltré le contenu\ndes boîtes de messagerie électronique par le biais de règles de redirection [10].\n\nL’implant CredoMap utilise un compte de messagerie compromis pour exfiltrer les données de navigateurs récupérés via le protocole IMAP [6] [2, 20, 21]. Dans d’autres campagnes, le MOA a utilisé des services en ligne comme\nPIPEDREAM, MOCKBIN ou MOCKY pour récupérer le contenu exfiltré [3, 5, 6, 7, 22].\n\nL’ANSSI observe un ciblage accru par le MOA à l’encontre d’infrastructures de messagerie à des fins d’espionnage\nstratégique. Ce ciblage est réalisé au travers de différentes techniques, démontrant la capacité du MOA à collecter\ndes informations sur la victime en amont afin d’adapter le niveau de sophistication de ses attaques.\n\n6. Internet Message Access Protocol (IMAP) est un protocole permettant d’accéder et de manipuler des messages électroniques sur un serveur.\n\n26 octobre 2023 Page 8 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n## 3 Recommandations\n\nPour faire face à ce type de menace, l’ANSSI rappelle l’importance d’avoir une approche globale de la sécurité,\nnotamment via la réalisation d’une appréciation des risques. Celle-ci doit permettre d’identifier :\n\n  - les actifs devant être protégés;\n\n  - l’état actuel du système d’information les supportant et du niveau de compétence des personnes l’utilisant ou\nl’opérant;\n\n  - la nature des menaces vis-à-vis desquelles il convient de se préparer;\n\n  - et par conséquent les mesures de sécurité appropriées devant être mises en œuvre et surtout entretenues dans\nle temps.\n\nDans cette section, les mesures de sécurité suivantes seront détaillées :\n\n  - Sécurité des échanges par courriers électroniques\n\n     - Confidentialité des échanges par courriers électroniques\n\n     - Plateforme d’échanges sécurisés\n\n     - Réduction des risques de détournement de courriels depuis la boite de messagerie utilisateur\n\n     - Réduction des risques de détournement des courriels en transit\n\n     - Usurpation d’identité l’envoi de courriels piégés depuis ou vers des interlocuteurs\n\n     - Réduction de la surface d’attaque des interfaces de messagerie web (webmail)\n\n     - Réduction du risque de latéralisation depuis les serveurs Microsoft Exchange\n\n     - Architecture de messagerie sécurisée\n\n     - Capacités d’investigation pour identifier des courriels malveillants\n\n  - Sécurité des données d’authentification\n\n     - Réduction des risques engendrés par les bases de fuites de données\n\n     - Réduction des risques engendrés par les attaques par force brute en ligne\n\n    - Réduction des risques liés aux campagnes d’hameçonnage\n\n     - Réduction des risques engendrés par les attaques ciblant NTLM\n\n  - Sécurité des postes utilisateurs\n\n     - Logiciels et pilotes malveillants ou détournés à des fins malveillantes\n\n     - Limiter les possibilités de latéralisation depuis un poste utilisateur compromis\n\n  - Sécurisation de l’accès aux contenus hébergés sur Internet\n\n     - Mise en œuvre d’un serveur mandataire et inspection TLS maitrisée\n\n     - Identifier et limiter l’utilisation détournée de services spécialisés en ligne\n\nCes recommandations sont issues des guides suivants :\n\n  - « Guide de la méthode EBIOS Risk Manager » [23];\n\n  - « Recommandations relatives à l’authentification multifacteur et aux mots de passe » [24];\n\n  - « Recommandations relatives à l’interconnexion d’un système d’information à Internet » [25];\n\n  - « Recommandations-pour la mise en oeuvre dune politique de restrictions logicielles sous windows » [26];\n\n  - « Recommandations de sécurité pour l’architecture d’un système de journalisation » [27];\n\n  - « Recommandation de sécurité pour la journalisation des systèmes Microsoft Windows en environnement\nActive Directory » [28];\n\n  - « Points de contrôles Active Directory » [29];\n\n  - « Classe de vulnérabilités en environnement Active Directory » [30]\n\n26 octobre 2023 Page 9 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n### 3.1 Sécurité des échanges par courriers électroniques\n\nLe MOA APT28 s’intéresse aux courriers électroniques qui peuvent être échangés au sein d’une entité. Le courriel\nest un support de communication d’apparence ordinaire, mais qui peut se révéler être une source d’information\nd’intérêt (négociations en cours, commandes, documents stratégiques, rapports, documents économiques et administratifs, rendez-vous, etc.) pour un MOA s’intéressant à une entité et son écosystème (prospects, clients, fournisseurs, partenaires commerciaux comme non-commerciaux, autorité de régulation, conseils, etc.).\n\nMalheureusement, il est souvent difficile, voire impossible, de garantir qu’aucun des serveurs assurant le routage\ndes courriels (agents de transfert de courriels, passerelle de filtrage, passerelle de gestion des messages, serveurs de\nmessagerie) n’est piégé pour obtenir une copie des échanges ou pour les altérer.\n\n#### Confidentialité des échanges par courriers électroniques\n###### R1\n\nMême si sa mise en œuvre peut s’avérer complexe et ne peut être systématique, la mesure de\nsécurité la plus efficace reste le chiffrement de bout en bout des courriels ou des pièces jointes\nsusceptibles de contenir des informations sensibles (par exemple via Zed!, S/MIME, PGP, archive\nchiffrée). À noter que les secrets ou données d’authentification utilisés pour le (dé)chiffrement\ndoivent être partagés avec les interlocuteurs au travers d’un autre canal, sécurisé.\n\nLors de la mise en œuvre de ce type de mesure de sécurité, il ne faut pas oublier de mettre en place un\nséquestre des secrets de chiffrement : si le ou les porteurs de ces secrets venaient à être indisponibles\nde façon ponctuelle ou permanente, la continuité d’activité pourrait en être affectée.\n\n\n#### Plateforme d'échanges sécurisés\n###### R2\n\nL’emploi d’une plateforme d’échanges sécurisés en complément des courriels est également recommandé afin d’y faire transiter les informations sensibles. La sécurisation de ce type de plateforme\ndevra faire l’objet d’un soin particulier (par exemple : authentification multifacteurs, réduction de\nla surface de fonctionnalité et donc de la surface d’attaque au strict nécessaire, purge à intervalles\nréguliers des données en transit, chiffrement à la volée, etc.)\n\n#### Réduction des risques de détournement de courriels depuis la boite de messa###### R3 gerie utilisateur\n\nDe nombreuses applications de messagerie permettent aux utilisateurs de créer des règles de copie\net redirection automatique des courriels reçus ou émis. Le MOA APT28 se sert parfois de ce type de\nmécanisme lorsqu’il compromet les boîtes de messagerie de ses cibles. La fonctionnalité étant déjà\nprésente, son activation peut souvent se faire de façon discrète et rester longtemps inaperçue de\nl’utilisateur légitime.\n\nLorsque les applications le permettent, et si ce type de mécanisme n’est pas nécessaire pour un\nmotif impérieux, l’ANSSI recommande dans la mesure du possible de les désactiver. À défaut, de\nles rendre configurables uniquement aux personnes ou services en ayant absolument besoin.\n\nL’ANSSI recommande par ailleurs une revue périodique de ce type de configuration de redirection\nafin de s’assurer de leur légitimité.\n\n26 octobre 2023 Page 10 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Réduction des risques de détournement des courriels en transit\n###### R4\n\nIl est important de ne pas oublier qu’un attaquant peut choisir de s’attaquer directement aux\npasserelles de filtrage de courriels se situant en amont du serveur de réception d’une entité.\nAinsi, en cas de soupçon de compromission des courriels et en l’absence de traces suspectes sur\nle système d’information, il est important d’investiguer sur ces briques amont. Tout d’abord, en\nvérifiant que leur configuration est cohérente et n’a pas été altérée (filtrage, sélection, redirection,\netc.), par exemple pour réaliser une copie de tout ou partie des courriels vers un serveur tiers.\nPuis, en vérifiant que ces passerelles sont à jour de leurs correctifs de sécurité ou n’exposent pas\npubliquement d’interface d’administration, susceptibles d’offrir une porte d’entrée à un attaquant.\nLe cas échéant, il conviendra de procéder à des investigations numériques à la recherche de traces\nde compromission.\n\nDans le cas où des services sont externalisés ou opérés par un prestataire, il est nécessaire de s’assurer\nque le service intègre tous les mécanismes de sécurité et les options de configuration répondant au\nbesoin, en particulier les points suivants :\n\n         - chiffrement des communications;\n\n          - cloisonnement, même logiciel, avec les autres clients;\n\n          - journalisation des événements et auditabilité des configurations;\n\n          - capacités de détection des incidents de sécurité ou d’événements inhabituels.\n\nSi des doutes persistent, des investigations numériques complémentaires avec le prestataire sont à\nréaliser.\n\n#### Usurpation d'identité lors de l'envoi de courriels piégés depuis ou vers des inter###### R5 locuteurs\n\nSans avoir à compromettre un compte de messagerie, il est aisé pour un attaquant de contrefaire\ndes courriels avec le nom de domaine d’une entité ou de ses interlocuteurs. Ce stratagème peut\nêtre utilisé pour tromper la vigilance d’un utilisateur en lui envoyant des courriels qui, d’apparence,\nsemblent provenir d’un contact habituel. Pour limiter la nuisance de ces courriels, en amont de\nleur réception par les utilisateurs, l’ANSSI encourage à mettre en œuvre certains protocoles ayant\npour rôle de vérifier l’authenticité et l’intégrité des courriels. Ils nécessitent une configuration, non\nseulement par l’entité expéditrice sur les enregistrements DNS de ses noms de domaine, mais aussi\npar l’entité destinataire sur ses serveurs SMTP de réception. Ces protocoles sont :\n\n          - Sender Policy Framework (SPF) qui permet de spécifier les adresses IP des serveurs autorisés\nà émettre les courriels d’un domaine;\n\n         - DomainKeys Identified Mail (DKIM) qui permet l’authentification du domaine de messagerie\nd’un courriel à l’aide d’une signature cryptographique;\n\n        - Domain-based Message Authentication, Reporting and Conformance (DMARC) qui permet notamment à une entité de définir une politique de traitement de ses courriels envoyés\nen fonction des résultats de conformité SPF et DKIM.\n\n26 octobre 2023 Page 11 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n\n#### Réduction de la surface d'attaque des interfaces de messagerie web (webmail)\n###### R6\n\nLes interfaces de messagerie web sont des cibles de choix en raison de leur surface d’attaque très\nimportante, liée à leur richesse en fonctionnalités. Ces trois dernières années ont été particulièrement marquées par la découverte et la publication de nombreuses vulnérabilités affectant plusieurs\nde ces services. Nombre de ces vulnérabilités ne nécessitaient aucune authentification préalable\net parfois l’accès à un seul compte suffisait pour mettre en péril l’ensemble de l’applicatif. APT28,\ncomme de nombreux autres acteurs, s’est massivement servi de ces brèches. L’ANSSI a traité et\ncontinue de traiter de nombreux cas de compromission ayant comme point de départ ce type de\nservice.\n\nLorsque des interfaces de messagerie web sont mises en œuvre, l’ANSSI recommande fortement de\nne pas les exposer publiquement sur Internet et de ne les rendre accessibles qu’en interne ou via un\nVPN pour les personnes en situation de nomadisme ou de télétravail.\n\nNéanmoins, si pour d’impérieuses raisons opérationnelles ces accès doivent être exposés, il est recommandé, sur la base de l’appréciation des risques, de mettre en œuvre une chaîne d’accès avec\ndes ressources dédiées, des restrictions d’accès aux seules boîtes de messagerie concernées et une\nstratégie renforcée de détection, par exemple :\n\n          - un serveur d’exposition (exemple : portail de messagerie web) hébergé au sein de la zone de\nservices exposés;\n\n          - la configuration d’accès aux seules boîtes de messagerie concernées;\n\n          - la protection du serveur d’exposition par un serveur mandataire inverse (reverse proxy), voire\nun pare-feu applicatif, hébergé en zone de services relais;\n\n          - la mise en œuvre d’une authentification double facteur pour les utilisateurs, éventuellement\navec la fourniture d’un certificat électronique;\n\n          - la définition d’une stratégie renforcée de détection (géolocalisation des connexions, nombre\nd’authentifications échouées, volumes de courriels échangés);\n\n          - une veille rigoureuse sur la publication de vulnérabilités affectant ce type d’application et une\nréactivité appropriée seront elles aussi déterminantes.\n\nCependant, il est important de noter que dans le cadre d’une infrastructure Microsoft Exchange, il\nn’est pas possible de dissocier les fonctionnalités de messagerie Web des autres fonctionnalités d’un\nserveur ou cluster Microsoft Exchange. Or, par nature, un serveur Microsoft Exchange dispose d’une\nemprise très forte dans un écosystème Microsoft, car il permet notamment la gestion de tous les\ncomptes (à l’exception, de ceux constituant le Tier 0 d’un domaine Active Directory) et ce au-delà\ndu simple périmètre de la fonction de courrier électronique. Par conséquent, la compromission d’un\nserveur Microsoft Exchange, par exemple au travers de son interface web, mettra en péril le Système\nd’information.\n\n#### Réduction du risque de latéralisation depuis les serveurs Microsoft Exchange\n###### R7\n\nEn raison d’une mauvaise configuration ou d’une configuration historique, un serveur Microsoft\nExchange peut disposer de droits privilégiés dans un environnement Active Directory (AD). En cas\nde compromission, un attaquant peut abuser de cette situation pour élever ses privilèges et prendre\nle contrôle d’un annuaire AD, entrainant de fait la compromission du système d’information associé.\nDans une logique de sécurité en profondeur, l’ANSSI encourage à vérifier que l’annuaire AD a été\ndurci pour éviter les risques d’élévation de privilège en cas de compromission d’un serveur Microsoft\nExchange [29].\n\n26 octobre 2023 Page 12 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Architecture de messagerie sécurisée\n###### R8\n\nAfin de protéger le système d’information interne des courriels malveillants (phishing, spear\n_phishing, etc.), il est recommandé de construire une architecture en s’appuyant sur des serveurs_\nrelais de messagerie au sein d’une passerelle sécurisée [25].\n\nPour les besoins de messagerie externes à l’entité (c’est-à-dire avec une interconnexion à Internet),\nau moins un serveur SMTP doit être positionné au sein de la passerelle Internet sécurisée. Néanmoins, en tenant compte de la complexité et coûts associés, il est recommandé de dédier un serveur\nSMTP pour l’envoi et un autre pour la réception de courriels (par exemple : deux machines virtuelles\ndistinctes) au sein de la passerelle Internet sécurisée. Ils doivent être configurés en conséquence :\n\n          - un serveur SMTP d’envoi n’accepte les courriels que depuis une liste de serveurs autorisés (serveurs relais internes ou serveurs de boîtes aux lettres) et assure des fonctions de nettoyage des\nen-têtes afin de limiter la divulgation d’informations pouvant être réutilisées par un attaquant\n(par exemple, par la suppression des en-têtes « received » ou « X-»);\n\n          - un serveur SMTP de réception applique les premières politiques de sécurité, assure des fonctions d’analyse protocolaire et de contenu, qualifie les courriels nécessitant une mise en quarantaine et transmet in fine les courriers à un autre serveur relais de l’entité ou à un serveur\nde boîtes aux lettres;\n\n          - un serveur relais au sein du système d’information interne chaîné aux serveurs d’envoi et de\nréception exposé à Internet au travers de la passerelle sécurisée.\n\nÀ noter que si finalement un seul serveur est positionné au sein de la passerelle Internet sécurisée\npour assurer cette fonction d’interface entre l’interne et l’externe, la logique de configuration des\nfonctions d’envoi, réception et relais reste applicable.\n\nPour les besoins de messagerie interne (c’est-à-dire sans interconnexion à Internet), déployer au\nmoins un serveur relais au sein du système d’information interne qui sera dédié au besoin interne\nuniquement. Ce serveur ne doit être en aucun cas chaîné à un serveur SMTP exposé sur Internet.\n\n26 octobre 2023 Page 13 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Capacités d'investigation pour identifier des courriels malveillants\n###### R9\n\nLes dispositifs de sécurité et de filtrage disposés en amont des serveurs de messagerie ne sont pas\ninfaillibles, et des messages malveillants peuvent être reçus par les utilisateurs. Il est alors important\nde connaître les capacités de journalisation et de recherche. Ces mécanismes pourront être mis à\ncontribution lorsque, sur la base d’un signalement, un ou plusieurs courriels suspects et les activités\nassociées devront être recherchés.\n\nAinsi, lorsque des indicateurs de compromissions (Indicator of Compromise ou IoC) sont partagés,\nceux-ci portent le plus souvent sur :\n\n          - une ou plusieurs adresses émettrices/destinataires;\n\n         - un domaine malveillant ou détourné;\n\n          - l’objet du courriel;\n\n          - le corps du courriel contenant un texte, lien, un ensemble de mots de clés;\n\n          - une période d’émission/réception.\n\nConcernant les pièces jointes, les indicateurs portent le plus souvent sur :\n\n        - nom;\n\n          - extension;\n\n        - métadonnées;\n\n        - empreintes MD5/SHA1/SHA256;\n\n         - contenu.\n\nCes IoC peuvent être précis ou encore porter sur un schéma caractéristique recherchable par\nexemple au travers d’une expression rationnelle ou d’une règle Yara.\n\nL’identification d’un courriel malveillant doit être vue comme un point de départ d’une investigation\net ne doit pas seulement se résumer à une action de suppression. Dans la mesure du possible, il est\nrecommandé d’essayer de répondre aux questions suivantes :\n\n          - est-ce que le courriel malveillant a été bloqué ou non par les dispositifs de filtrage amont? Dans\nun cas comme dans l’autre, quelles ont été les conclusions d’analyse de ces solutions amont?\n\n          - est-il possible d’en récupérer une copie?\n\n          - est-ce que plusieurs utilisateurs ont reçu ce même courriel?\n\n          - existe-t-il d’autres variantes de ce courriel dans l’environnement?\n\n          - est-ce que la ou les personnes concernées ont effectivement reçu, ouvert, supprimé, transféré\nle courriel ou ses pièces jointes? Si oui quand, comment, à qui?\n\n          - est-ce que des activités système ou réseau suspectes depuis le compte ou le poste de ces utilisateurs ont été observées suite aux actions précédemment identifiées?\n\nPour répondre à ces questions, il est nécessaire de disposer de différents points de journalisation\ncollectables et pouvant être corrélés : passerelle de filtrage, serveur de messagerie, poste utilisateur,\nproxy réseau, pare-feu, annuaire Active Directory (le cas échéant). Ces évènements ayant pu\nsurvenir plusieurs mois en arrière, il est donc recommandé, en accord avec les contraintes légales\nou réglementaires et les capacités de l’entité, de dimensionner suffisamment la conservation de\ncette journalisation.\n\nEnfin, échanger avec la ou les personnes concernées sur les actions qu’elles ont pu réaliser autour\nde ce courriel est également important. En effet, certains courriels ne contiennent parfois aucune\ncharge ou lien malveillant, mais seulement une liste d’instructions à effectuer par l’utilisateur. De\nplus, celui-ci peut parfois être en mesure d’expliquer le contexte précédant la réception du courriel\nmalveillant.\n\n26 octobre 2023 Page 14 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n### 3.2 Sécurité des données d'authentification\n\n#### Réduction des risques engendrés par les bases de fuites de données\n###### R10\n\nComme de nombreux MOA, APT28 exploite des bases de fuites de données à la recherche de mots\nde passe toujours valides.\n\nPour faire face à ce type de risque, plusieurs mesures complémentaires sont recommandées [24] :\n\n          - mettre en œuvre de l’authentification multifacteur;\n\n          - privilégier l’utilisation d’un mot de passe fort bien mémorisé et pour lequel l’utilisateur est\nconscient de sa sensibilité, plutôt que le renouvellement à intervalles courts (par exemple,\ntous les 90 jours) comme recommandé autrefois;\n\n          - sensibiliser à l’utilisation de secrets d’authentification distincts pour accéder à différents services, et encourager à l’utilisation de coffre-forts de mots de passe sécurisés;\n\n          - favoriser la mise en œuvre de service d’authentification unique (Single Sign On) comme Kerberos, afin de limiter le nombre de secrets d’authentification à mémoriser;\n\n          - auditer à intervalles réguliers la robustesse des mots de passe utilisateur et demander un renouvellement si nécessaire.\n\n\n#### Réduction des risques engendrés par les attaques par force brute en ligne\n###### R11\n\nAfin de réduire les risques de compromission des comptes utilisateurs sur des services en ligne, il est\nrecommandé [24] :\n\n          - de s’assurer que les comptes et mots de passe par défaut ont été désactivés ou changés;\n\n          - de définir une politique de mots de passe forts, incluant la vérification à la saisie;\n\n          - d’implémenter de l’authentification multifacteur;\n\n          - d’implémenter des mécanismes détectant les essais multiples d’authentification depuis une ou\nplusieurs adresses IP distinctes, qui soient en mesure de les bloquer ou de réduire le nombre\nde tentatives possibles;\n\n          - d’auditer à intervalles réguliers la robustesse des mots de passe utilisateurs et de demander un\nrenouvellement si nécessaire.\n\n26 octobre 2023 Page 15 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Réduction des risques liés aux campagnes d’hameçonnage\n###### R12\n\nL’hameçonnage reste une valeur sûre pour les attaquants. Lorsqu’il est réalisé de manière élémentaire, les taux de réussite peuvent néanmoins être élevés. Lorsqu’il est réalisé avec soin, même un\nutilisateur expérimenté peut se faire piéger. Si les campagnes d’hameçonnage par courriels malveillants restent une voie classique très prisée, il ne faut pas oublier les autres formes de campagnes\nd’hameçonnage possibles. Par exemple :\n\n          - via des messages sur les réseaux sociaux;\n\n         - via des messages par SMS ou messageries instantanées (WhatsApp, Signal, Telegram, TikTok,\nSlack, Discord, Facebook Messenger, etc. );\n\n          - via des appels téléphoniques;\n\n          - via des attaques par redirection de connexion lorsque la navigation Internet est effectuée en\nHTTP.\n\nIl faut donc former les utilisateurs à savoir reconnaître les différentes formes d’hameçonnage, mais\négalement les éventuelles pages d’hameçonnage. Cette sensibilisation doit tenir compte du scénario\noù les moyens de communication d’un contact ont été détournés par un attaquant.\n\nLa séparation des moyens de communication professionnels et personnels est une mesure de\nsécurité importante, car elle permet de réduire les risques de confusion entre les canaux de\ncommunications susceptibles d’être visés par des campagnes d’hameçonnage.\n\nMême si elle n’est pas infaillible, l’utilisation de mécanismes d’authentification multifacteurs pour\nprotéger l’accès aux services est une mesure de sécurité particulièrement efficace pour lutter contre\nles scénarios courants de vols de secrets de connexion par hameçonnage.\n\nLe succès de certaines campagnes d’hameçonnage repose sur l’usurpation de l’identité de marque.\nMettre en œuvre des moyens techniques, organisationnels et juridiques pour y faire face est souvent\nnécessaire pour :\n\n          - filtrer les courriels usurpant des adresses d’une entité (cf. supra);\n\n          - détecter, bloquer et faire fermer les domaines malveillants jouant sur les fautes de frappe\nopportunistes (typosquatting);\n\n          - détecter, bloquer et faire fermer les sites ou pages malveillantes usurpant l’identité d’une entreprise.\n\n26 octobre 2023 Page 16 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Réduction des risques engendrés par les attaques ciblant NTLM\n###### R13\n\nÀ l’instar de l’utilisation par le MOA APT28 de la vulnérabilité CVE-2023-23397, les attaques\nciblant les secrets et défis-réponses NTLM sont très courantes. Elles ouvrent en effet des possibilités\nd’attaque hors ligne par force brute en vue d’obtenir des mots de passe utilisateurs et permettent\npar ailleurs de mener des attaques de type relais NTLM. Dans le cadre de cette vulnérabilité,\nune hygiène réseau correctement implémentée permet d’invalider l’exploitation telle qu’elle a été\ndécrite plus haut dans ce document. En effet, le MOA a besoin que la victime puisse établir une\nconnexion SMB depuis son poste vers une machine qu’il maîtrise (en l’occurrence, des routeurs\ncompromis). Or, sauf cas très particulier, aucun flux SMB ne devrait être autorisé en sortie d’un\nréseau d’entreprise. Le pare-feu du poste utilisateur ou en périphérie du réseau doit bloquer cette\ntentative et attirer l’attention des équipes sécurité. Cependant, si pour des motifs impérieux l’établissement de connexions SMB vers l’extérieur doit être permise, une liste blanche des destinations\ndevrait être établie.\n\nPar ailleurs, les connexions sortantes du système d’information interne ne devraient pas par défaut\nutiliser l’authentification unique interne (Single Sign On / SSO); pour ce faire une liste de domaines\nautorisés à s’appuyer sur le SSO interne devrait être établie et appliquée sur l’ensemble du système\nd’information.\n\nLes secrets et défis-réponses NTLM sont par nature vulnérables aux attaques par force brute\nvisant à essayer de retrouver les mots de passe associés. Une politique de mots de passe forts et de\nnon-réutilisation de mots de passe doit donc être appliquée [24].\n\nLa désactivation globale de l’authentification NTLM au profit d’une utilisation exclusive de Kerberos rend également ces attaques inopérantes. Il s’agit d’une mesure générique particulièrement\nefficace. Cependant, l’authentification NTLM reste souvent nécessaire au bon fonctionnement de\ncertaines applications non migrées vers Kerberos, et il n’est donc pas toujours possible d’interdire\nNTLM globalement. Pour tenir compte de cette complexité de mise en œuvre, des évolutions\nprogressives portées par Microsoft (par exemple au travers des versions récentes de Windows 11), et\ndes contraintes d’étalement dans le temps d’une telle migration, l’ANSSI encourage à commencer en\npriorité par les services les plus critiques ou assurant une fonction de gestion de parc informatique,\nen désactivant pour ces serveurs les connexions sortantes utilisant NTLM (par exemple pour les\nserveurs et services suivants : contrôleurs de domaine, Microsoft Exchange, Microsoft Endpoint\nConfiguration Manager, System Center Configuration Manager, etc.).\n\nL’ANSSI tient à disposition sur le site du CERT-FR une page dédiée au sujet [30].\nEnfin, Microsoft a mis à disposition un ensemble d’outils et recommandations pour aider à l’investigation d’une potentielle exploitation de la vulnérabilité CVE-2023-23397 [31].\n\n26 octobre 2023 Page 17 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n### 3.3 Sécurité des postes utilisateurs\n\n#### Logiciels et pilotes malveillants ou détournés à des fins malveillantes\n###### R14\n\nAPT28 dispose de son propre arsenal d’outils malveillants. Toutefois, comme de nombreux acteurs\nmalveillants, le MOA emploie aussi dans le cadre de ses attaques des outils légitimes importés par\nses soins ou disponibles par défaut sur les systèmes visés. Le détournement de ces derniers à des fins\nmalveillantes vise à complexifier la détection et ainsi à renforcer son niveau de discrétion. Ainsi,\nplusieurs lignes complémentaires de défense en profondeur sont nécessaires.\n\nEn premier lieu, il convient d’utiliser les lignes de défense élémentaires intégrées au système d’exploitation ainsi que les solutions antivirales et d’activer :\n\n          - la détection des applications/programmes potentiellement indésirables (Potentially Unwanted\n_Applications/Programs (PUA/PUP));_\n\n         - la détection des pilotes et microprogrammes compromis;\n\n          - l’intégrité de la protection mémoire;\n\n          - Microsoft Defender Application Guard [32];\n\n          - Credential Guard.\n\nDe plus, le suivi des alertes de détection qui seront levées est indispensable afin d’être en mesure\nde réagir promptement le cas échéant.\n\nEn second lieu, il convient d’utiliser des lignes de défense avancées pour limiter l’efficacité des logiciels malveillants ou détournés non détectés par les solutions antivirales :\n\n          - définir et mettre en œuvre une politique de restriction logicielle afin de restreindre l’exécution\nà une liste de programmes ou emplacements dûment autorisés (par exemple : dans le cadre\nde la mise en œuvre d’une liste noire en bloquant les répertoires temporaires depuis lesquels\nsont ouvertes les pièces jointes des courriels) [26];\n\n          - définir une politique de filtrage réseau rigoureuse au niveau poste utilisateur, afin tout d’abord\nde bloquer de façon stricte les flux entrants à l’exception des flux dûment autorisés, puis en\nrestreignant les flux sortants en fonction de leur nature et destinations;\n\n          - mettre en place un système de journalisation efficace et sécurisé [27, 28];\n\n          - mettre en place une supervision de ces journaux et implémenter des heuristiques de détection\nvisant à rechercher des détournements d’applications légitimes à des fins malveillantes.\n\nL’identification et le suivi dans le temps des applications et pilotes détournables à des fins malveillantes peuvent se révéler être une tâche fastidieuse. Des projets communautaires existent [33,\n34].\n\n26 octobre 2023 Page 18 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Limiter les possibilités de latéralisation depuis un poste utilisateur compromis\n###### R15\n\nLorsque le MOA APT28 parvient à la compromission d’un poste utilisateur, celui-ci ne se contente\npas uniquement d’exfiltrer l’information disponible, mais peut aussi chercher à se latéraliser au sein\ndu système d’information. La gestion des risques de l’entité doit inclure un ou plusieurs scénarios\nsur la compromission de postes utilisateurs et doit prendre en compte l’importance de la résilience\nde l’infrastructure face à ce risque. Ce travail doit déterminer, de façon cohérente et maintenable,\ndifférentes stratégies de segmentation :\n\n          - réseau,\n\n          - applicatives,\n\n          - fonctionnelles (par exemple : utilisateurs, utilisateurs privilégiés, administrateurs, administrateurs AD, etc.)\n\n          - physiques et logiques,\n\n           - etc.\n\nL’ANSSI rappelle que dans le cadre d’un environnement Microsoft AD, l’annuaire doit au minimum\nposséder un niveau de sécurité basique non affaibli depuis son installation (ce qui correspond par\nexemple au niveau 3 du référentiel ANSSI) [29].\n\n### 3.4 Sécurisation de l'accès aux contenus hébergés sur Internet\n\n\n#### Mise en œuvre d'un serveur mandataire et inspection TLS maitrisée\n###### R16\n\nIl est essentiel d’éviter tout accès direct depuis un poste utilisateur ou un serveur vers Internet.\nPour cela, un serveur mandataire (proxy) Web doit assurer le rôle de relais et mettre en œuvre des\nfonctions de sécurité : authentification, contrôle d’accès, analyse de contenus, journalisation, etc.\nTous les accès aux contenus hébergés sur le Web doivent être authentifiés de manière individuelle\npour les utilisateurs et non ambiguë pour les services.\n\nLe nombre de sites accessibles en HTTPS est en constante augmentation et constitue une avancée\nmajeure dans la sécurisation des communications dans la mesure où la configuration TLS associée\nest à l’état de l’art. La contrepartie est que, s’il s’agit d’accès à des sites d’hameçonnage (phishing)\nou d’hébergement de codes malveillants, il est théoriquement impossible de détecter le contenu\nsuspect dans l’ensemble du trafic chiffré. Pour pallier cela, la mise en place d’inspection TLS est une\npossibilité. Celle-ci doit permettre in fine d’analyser le contenu et de s’assurer de la conformité protocolaire des échanges. L’inspection TLS répond donc au besoin de détection de codes malveillants\net doit, le cas échéant, être mise en œuvre de façon sécurisée au sein de la zone de services relais. Le\nchoix de l’équipement réalisant cette inspection est structurant; celui-ci doit notamment permettre\nune configuration des paramètres cryptographiques à l’état de l’art [25].\n\n26 octobre 2023 Page 19 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n#### Identifier et limiter l'utilisation détournée de services spécialisés en ligne\n###### R17\n\nIl existe en ligne de nombreux services permettant de simuler des points de terminaison\npersonnalisables (« mockbin[.]org », « mocky[.]io », « pipedream[.]com », « frge[.]io »,\n« webhook[.]site », etc.). Ces services légitimes spécialisés peuvent être utilisés de façon détournée à des fins malveillantes par exemple pour mener des campagnes de phishing ou pour réaliser\nde l’exfiltration de données. Il est à noter que ces services répondent à des besoins métier très\nspécialisés. Il convient de s’interroger sur le besoin d’accéder à ce type de service et le cas échéant\nd’autoriser au cas par cas leur accès.\n\nLes mécanismes de sécurité détaillés dans la recommandation précédente, permettent de mettre en\nœuvre les politiques de filtrages adéquates ou la recherche a posteriori en cas de besoin d’investigation.\n\n26 octobre 2023 Page 20 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n## 4 Bibliographie\n\n[1] MALWAREBYTES. Russia’s APT28 Uses Fear of Nuclear War to Spread Follina Docs in Ukraine. 21 juin 2022.\n[URL : https://www.malwarebytes.com/blog/threat-intelligence/2022/06/russias-apt28-uses-](https://www.malwarebytes.com/blog/threat-intelligence/2022/06/russias-apt28-uses-fear-of-nuclear-war-to-spread-follina-docs-in-ukraine)\n```\n   fear-of-nuclear-war-to-spread-follina-docs-in-ukraine.\n\n```\n[2] CERT-UA. Attaque informatique du groupe APT28 à l’aide du code malveillant CredoMap. 20 juin 2022.\n[URL : https://cert.gov.ua/article/341128.](https://cert.gov.ua/article/341128)\n\n[3] CERT-UA. Attaque informatique du groupe APT28 à l’aide du code malveillant CredoMap_V2. 6 mai 2022.\n[URL : https://cert.gov.ua/article/40106.](https://cert.gov.ua/article/40106)\n\n[4] SOCRADAR. Microsoft Fixes Exploited Zero-Days in March Patch Tuesday (CVE-2023-23397 & CVE-2023-24880).\n15 mars 2023.\n[URL : https://socradar.io/microsoft-fixes-exploited-zero-days-in-march-patch-tuesday-cve-](https://socradar.io/microsoft-fixes-exploited-zero-days-in-march-patch-tuesday-cve-2023-23397-cve-2023-24880/)\n```\n   2023-23397-cve-2023-24880/.\n\n```\n[5] SEKOIA. APT28 Leverages Multiple Phishing Techniques to Target Ukrainian Civil Society. 5 mai 2023.\n[URL : https://blog.sekoia.io/apt28- leverages- multiple- phishing- techniques- to- target-](https://blog.sekoia.io/apt28-leverages-multiple-phishing-techniques-to-target-ukrainian-civil-society/)\n```\n   ukrainian-civil-society/.\n\n```\n[6] CERT-UA. Attaques par hameçonnage du groupe APT28 visant à obtenir des données d’authentification pour des\n_services de messagerie publique. 8 juillet 2023._\n[URL : https://cert.gov.ua/article/5105791.](https://cert.gov.ua/article/5105791)\n\n[7] CERT-UA. Campagne d’hameçonnage utilisant le thème du service UKR.NET et des QR-codes. 16 mars 2022.\n[URL : https://cert.gov.ua/article/37788.](https://cert.gov.ua/article/37788)\n\n[8] CERT-UA. Attaque informatique d’APT28 : diffusion de courriels contenant des « instructions » pour la « mise à\n_jour du système d’exploitation ». 28 avril 2023._\n[URL : https://cert.gov.ua/article/4492467.](https://cert.gov.ua/article/4492467)\n\n[9] GOOGLE. Threat Horizons. 7 décembre 2021.\n[URL : https://services.google.com/fh/files/misc/gcat_threathorizons_full_nov2021.pdf.](https://services.google.com/fh/files/misc/gcat_threathorizons_full_nov2021.pdf)\n\n[10] RECORDED FUTURE. BlueDelta Exploits Ukrainian Government Roundcube Mail Servers to Support Espionage\n_Activities. 20 juin 2023._\n[URL : https://go.recordedfuture.com/hubfs/reports/cta-2023-0620.pdf.](https://go.recordedfuture.com/hubfs/reports/cta-2023-0620.pdf)\n\n[11] CLUSTER25. In the Footsteps of the Fancy Bear : PowerPoint Mouse-over Event Abused to Deliver Graphite Im_plants. 23 septembre 2022._\n[URL : https://blog.cluster25.duskrise.com/2022/09/23/in-the-footsteps-of-the-fancy-bear-](https://blog.cluster25.duskrise.com/2022/09/23/in-the-footsteps-of-the-fancy-bear-powerpoint-graphite/)\n```\n   powerpoint-graphite/.\n\n```\n[12] CLUSTER25. A Not so Fancy Game Exploring the New Skinnyboy Bear’s Backdoor. 4 juin 2021.\n[URL : https://blog.cluster25.duskrise.com/2021/06/03/a-not-so-fancy-game-apt28-skinnyboy.](https://blog.cluster25.duskrise.com/2021/06/03/a-not-so-fancy-game-apt28-skinnyboy)\n\n[13] NSA. Russian GRU Conducting Global Brute Force Campaign to Compromise Enterprise and Cloud Environments.\n1[er] juillet 2021.\n[URL : https://media.defense.gov/2021/Jul/01/2002753896/-1/-1/1/CSA_GRU_GLOBAL_BRUTE_FORCE_](https://media.defense.gov/2021/Jul/01/2002753896/-1/-1/1/CSA_GRU_GLOBAL_BRUTE_FORCE_CAMPAIGN_UOOO158036-21.PDF)\n```\n   CAMPAIGN_UOOO158036-21.PDF.\n\n```\n[14] TRELLIX. Prime Minister’s Office Compromised : Details of Recent Espionage Campaign. 25 janvier 2022.\n[URL : https://www.trellix.com/en-gb/about/newsroom/stories/threat-labs/prime-ministers-](https://www.trellix.com/en-gb/about/newsroom/stories/threat-labs/prime-ministers-office-compromised.html)\n```\n   office-compromised.html.\n\n```\n[15] SECURITYSCORECARD. A Deep Dive Into the APT28’s Stealer Called CredoMap. 28 septembre 2022.\n[URL : https://securityscorecard.com/research/apt28s-stealer-called-credomap/.](https://securityscorecard.com/research/apt28s-stealer-called-credomap/)\n\n[16] MICROSOFT. STRONTIUM : Detecting New Patterns in Credential Harvesting. 11 septembre 2020.\n[URL : https://www.microsoft.com/en-us/security/blog/2020/09/10/strontium-detecting-new-](https://www.microsoft.com/en-us/security/blog/2020/09/10/strontium-detecting-new-patters-credential-harvesting/)\n```\n   patters-credential-harvesting/.\n\n```\n[17] NCSC-UK, CISA, FBI ET NSA. Advisory : APT28 Exploits Known Vulnerability to Carry Out Reconnaissance and\n_Deploy Malware on Cisco Routers. 18 avril 2023._\n[URL : https://www.ncsc.gov.uk/files/Advisory_APT28-exploits-known-vulnerability.pdf.](https://www.ncsc.gov.uk/files/Advisory_APT28-exploits-known-vulnerability.pdf)\n\n[18] ANSSI. Bulletin d’alerte du CERT-FR : vulnérabilité dans Microsoft Outlook. 15 mars 2023.\n[URL : https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/.](https://www.cert.ssi.gouv.fr/alerte/CERTFR-2023-ALE-002/)\n\n26 octobre 2023 Page 21 sur 23\n\n\n-----\n\n###### PAP:CLEAR\n\n\nCampagnes d’attaques du mode opératoire APT28 depuis 2021\n\n[19] MICROSOFT. Guidance for Investigating Attacks Using CVE-2023-23397. 24 mars 2023.\n[URL : https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-](https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/)\n```\n   attacks-using-cve-2023-23397/.\n\n```\n[20] TREND MICRO. Pawn Storm’s Lack of Sophistication as a Strategy. 21 décembre 2020.\n[URL : https://www.trendmicro.com/en_us/research/20/l/pawn-storm-lack-of-sophistication-as-](https://www.trendmicro.com/en_us/research/20/l/pawn-storm-lack-of-sophistication-as-a-strategy.html)\n```\n   a-strategy.html.\n\n```\n[21] TRELLIX. Growling Bears Make Thunderous Noise. 6 juin 2022.\n[URL : https://www.trellix.com/en-us/about/newsroom/stories/research/growling-bears-make-](https://www.trellix.com/en-us/about/newsroom/stories/research/growling-bears-make-thunderous-noise.html)\n```\n   thunderous-noise.html.\n\n```\n[22] CERT-UA. Attaque informatique d’APT28 : msedge utilisé comme loader, TOR et les services mockbin.org/website.hook\n_utilisés comme centre de contrôle. 4 septembre 2023._\n[URL : https://cert.gov.ua/article/5702579.](https://cert.gov.ua/article/5702579)\n\n[23] ANSSI. Guide de la méthode EBIOS Risk Manager.\n[URL : https://cyber.gouv.fr/ebios-rm.](https://cyber.gouv.fr/ebios-rm)\n\n[24] ANSSI. Recommandations relatives à l’authentification multifacteur et aux mots de passe. 8 octobre 2021.\n[URL : https://cyber.gouv.fr/guide-authentification.](https://cyber.gouv.fr/guide-authentification)\n\n[25] ANSSI. Recommandations relatives à l’interconnexion d’un système d’information à Internet. 19 juin 2020.\n[URL : https://cyber.gouv.fr/guide-interconnexion-si-internet.](https://cyber.gouv.fr/guide-interconnexion-si-internet)\n\n[26] ANSSI. Recommandations-pour la mise en oeuvre dune politique de restrictions logicielles sous windows. 13 janvier 2017.\n[URL : https://cyber.gouv.fr/guide-windows-restrictions-logicielles.](https://cyber.gouv.fr/guide-windows-restrictions-logicielles)\n\n[27] ANSSI. Recommandations de sécurité pour l’architecture d’un système de journalisation. 28 janvier 2022.\n[URL : https://cyber.gouv.fr/guide-journalisation.](https://cyber.gouv.fr/guide-journalisation)\n\n[28] ANSSI. Recommandations de sécurité pour la journalisation des systèmes Microsoft Windows en environnement\n_Active Directory. 28 janvier 2022._\n[URL : https://cyber.gouv.fr/guide-journalisation-windows.](https://cyber.gouv.fr/guide-journalisation-windows)\n\n[29] ANSSI. Points de contrôles Active Directory. 18 octobre 2022.\n[URL : https://cert.ssi.gouv.fr/dur/CERTFR-2020-DUR-001/.](https://cert.ssi.gouv.fr/dur/CERTFR-2020-DUR-001/)\n\n[30] ANSSI. Classe de vulnérabilités en environnement Active Directory. 18 octobre 2022.\n[URL : https://cert.ssi.gouv.fr/dur/CERTFR-2021-DUR-001/.](https://cert.ssi.gouv.fr/dur/CERTFR-2021-DUR-001/)\n\n[31] MICROSOFT. Guidance for investigating attacks using cve-2023-23397. 24 mars 2023.\n[URL : https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-](https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/)\n```\n   attacks-using-cve-2023-23397/.\n\n```\n[32] MICROSOFT. Microsoft Defender Application Guard vue d’ensemble. 13 juillet 2023.\n[URL : https://learn.microsoft.com/en-us/windows/security/application-security/application-](https://learn.microsoft.com/en-us/windows/security/application-security/application-isolation/microsoft-defender-application-guard/md-app-guard-overview)\n```\n   isolation/microsoft-defender-application-guard/md-app-guard-overview.\n\n```\n[33] LOLBAS-PROJECT. Projet communautaire : Living Off The Land Binaries, Scripts and Libraries.\n[URL : https://lolbas-project.github.io/.](https://lolbas-project.github.io/)\n\n[34] LOLDRIVERS. Projet communautaire : Living Off The Land Drivers.\n[URL : https://www.loldrivers.io/.](https://www.loldrivers.io/)\n\n26 octobre 2023 Page 22 sur 23\n\n\n-----\n\n1.0 - 26 octobre 2023\n\nLicence ouverte (Étalab - v2.0)\n\n**AGENCE NATIONALE DE LA SÉCURITÉ DES SYSTÈMES D’INFORMATION**\n\nANSSI - 51 boulevard de la Tour-Maubourg, 75700 PARIS 07 SP\ncert.ssi.gouv.fr / cert-fr@ssi.gouv.fr\n\n\n-----",
    "language": "FR",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.cert.ssi.gouv.fr/uploads/CERTFR-2023-CTI-009.pdf"
    ],
    "report_names": [
        "CERTFR-2023-CTI-009.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1700013966,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1698256940,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/aed53f16c085e33ed7c65ba8b81b682c5e66bee7.pdf",
        "text": "https://archive.orkl.eu/aed53f16c085e33ed7c65ba8b81b682c5e66bee7.txt",
        "img": "https://archive.orkl.eu/aed53f16c085e33ed7c65ba8b81b682c5e66bee7.jpg"
    }
}