{
    "id": "39511b06-7fb7-4d75-a320-a4b37004c8c2",
    "created_at": "2023-01-12T15:02:40.947922Z",
    "updated_at": "2025-03-27T02:06:15.436219Z",
    "deleted_at": null,
    "sha1_hash": "1c2661d434be33dd084df5683f1cdc72fc9a6f22",
    "title": "2022-03-02 - Conti Ransomware Group Diaries, Part II- The Office",
    "authors": "",
    "file_creation_date": "2022-05-28T04:11:55Z",
    "file_modification_date": "2022-05-28T04:11:55Z",
    "file_size": 2974163,
    "plain_text": "# Conti Ransomware Group Diaries, Part II: The Office\n\n**[krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-ii-the-office/](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-ii-the-office/)**\n\nEarlier this week, a Ukrainian security researcher leaked almost two years’ worth of internal\nchat logs from Conti, one of the more rapacious and ruthless ransomware gangs in\noperation today. [Tuesday’s story examined how Conti dealt with its own internal breaches](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-i-evasion/)\nand attacks from private security firms and governments. In Part II of this series we’ll explore\nwhat it’s like to work for Conti, as described by the Conti employees themselves.\n\nThe Conti group’s chats reveal a great deal about its internal structure and hierarchy. Conti\nmaintains many of the same business units as a legitimate, small- to medium-sized\nenterprise, including a Human Resources department that is in charge of constantly\ninterviewing potential new hires.\n\nOther Conti departments with their own distinct budgets, staff schedules, and senior\nleadership include:\n\n–Coders: Programmers hired to write malicious code, integrate disparate technologies\n\n–Testers: Workers in charge of testing Conti malware against security tools and obfuscating\nit\n\n–Administrators: Workers tasked with setting up, tearing down servers, other attack\ninfrastructure\n\n–Reverse Engineers: Those who can disassemble computer code, study it, find\n\n\n-----\n\nvulnerabilities or weaknesses\n–Penetration Testers/Hackers: Those on the front lines battling against corporate security\nteams to steal data, and plant ransomware.\n\nConti appears to have contracted out much of its spamming operations, or at least there was\nno mention of “Spammers” as direct employees. Conti’s leaders seem to have set strict\nbudgets for each of its organizational units, although it occasionally borrowed funds allocated\nfor one department to address the pressing cashflow needs of another.\n\nA great many of the more revealing chats concerning Conti’s structure are between “Mango”\n— a mid-level Conti manager to whom many other Conti employees report each day — and\n“Stern,” a sort of cantankerous taskmaster who can be seen constantly needling the staff for\nreports on their work.\n\nIn July 2021, Mango told Stern that the group was placing ads on several Russian-language\ncybercrime forums to hire more workers. “The salary is $2k in the announcement, but there\nare a lot of comments that we are recruiting galley slaves,” Mango wrote. “Of course, we\ndispute that and say those who work and bring results can earn more, but there are\nexamples of coders who work normally and earn $5-$10k salary.”\n\nThe Conti chats show the gang primarily kept tabs on the victim bots infected with their\nmalware via both the Trickbot and Emotet crimeware-as-a-service platforms, and that it\nemployed dozens of people to continuously test, maintain and expand this infrastructure 24\nhours a day, 7 days a week.\n\nConti members referred to Emotet as “Booz” or “Buza,” and it is evident from reading these\nchat logs that Buza had its own stable of more than 50 coders, and likely much of the same\norganizational structure as Conti.\n\nAccording to Mango, as of July 18, 2021 the Conti gang employed 62 people, mostly lowlevel malware coders and software testers. However, Conti’s employee roster appears to\nhave fluctuated wildly from one month to the next. For example, on multiple occasions the\norganization was forced to fire many employees as a security precaution in the wake of its\nown internal security breaches.\n\nIn May 2021, Stern told Mango he wanted his underlings to hire 100 more “encoders” to work\nwith the group’s malware before the bulk of the gang returns from their summer vacations in\nCrimea. Most of these new hires, Stern says, will join the penetration testing/hacking teams\nheaded by Conti leaders “Hof” and “Reverse.” Both Hof and Reverse appear to have direct\naccess to the Emotet crimeware platform.\n\nOn July 30, 2021, Mango tells stern the payroll has increased to 87 salaried employees, with\nmore hires on the way. But trying to accurately gauge the size of the Conti organization is\nproblematic, in part because cybersecurity experts have long held that Conti is merely a\n[rebrand of another ransomware strain and affiliate program known as Ryuk](https://en.wikipedia.org/wiki/Ryuk_(ransomware))\n\n\n-----\n\nFirst spotted in 2018, Ryuk was just as ruthless and mercenary as Conti, and the FBI says\nthat in the first year of its operation Ryuk earned more than $61 million in ransom payouts.\n\n“Conti is a Targeted version of Ryuk, which comes from Trickbot and Emotet which we’ve\nbeen monitoring for some time,” researchers at Palo Alto Networks wrote about Ryuk last\nyear. “A heavy focus was put on hospital systems, likely due to the necessity for uptime, as\nthese systems were overwhelmed with handling the ongoing COVID-19 pandemic. We\nobserved initial Ryuk ransom requests ranging from US$600,000 to $10 million across\nmultiple industries.”\n\nOn May 14, 2021, Ireland’s Health Service Executive (HSE) suffered a major ransomware\nattack at the hands of Conti. The attack would disrupt services at several Irish hospitals, and\nresulted in the near complete shutdown of the HSE’s national and local networks, forcing the\ncancellation of many outpatient clinics and healthcare services. It took the HSE until Sept.\n21, 2021 to fully restore all of its systems from the attack, at an estimated cost of more than\n$600 million.\n\nIt remains unclear from reading these chats how many of Conti’s staff understood how much\nof the organization’s operations overlapped with that of Ryuk. Lawrence Abrams at\n[Bleeping Computer pointed to an October 2020 Conti chat in which the Emotet](https://www.bleepingcomputer.com/)\nrepresentative “Buza” posts a link to a security firm’s analysis of Ryuk’s return.\n\n\n-----\n\n“Professor,” the nickname chosen by one of Conti’s most senior generals, replies that\nindeed Ryuk’s tools, techniques and procedures are nearly identical to Conti’s.\n\n\n-----\n\nadf.bat — this is my fucking batch file, Professor writes, evidently surprised at having read\nthe analysis and spotting his own code being re-used in high-profile ransomware attacks by\nRyuk.\n\n“Feels like [the] same managers were running both Ryuk and Conti, with a slow migration to\n[Conti in June 2020,” Abrams wrote on Twitter. “However, based on chats, some affiliates](https://twitter.com/LawrenceAbrams/status/1499046186942144523)\ndidn’t know that Ryuk and Conti were run by the same people.”\n\n## ATTRITION\n\nEach Conti employee was assigned a specific 5-day workweek, and employee schedules\nwere staggered so that some number of staff was always on hand 24/7 to address technical\nproblems with the botnet, or to respond to ransom negotiations initiated by a victim\norganization.\n\nLike countless other organizations, Conti made its payroll on the 1st and 15th of each month,\nalbeit in the form of Bitcoin deposits. Most employees were paid $1,000 to $2,000 monthly.\n\nHowever, many employees used the Conti chat room to vent about working days on end\nwithout sleep or breaks, while upper managers ignored their repeated requests for time off.\n\nIndeed, the logs indicate that Conti struggled to maintain a steady number of programmers,\ntesters and administrators in the face of mostly grueling and repetitive work that didn’t pay\nvery well (particularly in relation to the earnings of the group’s top leadership). What’s more,\nsome of the group’s top members were openly being approached to work for competing\nransomware organizations, and the overall morale of the group seemed to fluctuate between\npaydays.\n\nPerhaps unsurprisingly, the turnover, attrition and burnout rate was quite high for low-level\nConti employees, meaning the group was forced to constantly recruit new talent.\n\n“Our work is generally not difficult, but monotonous, doing the same thing every day,” wrote\n“Bentley,” the nickname chosen by the key Conti employee apparently in charge of\n“crypting” the group’s malware — ensuring that it goes undetected by all or at least most\nantivirus products on the market.\n\nBentley was addressing a new Conti hire — “Idgo” — telling him about his daily duties.\n\n“Basically, this involves launching files and checking them according to the algorithm,”\nBentley explains to Idgo. “Poll communication with the encoder to receive files and send\nreports to him. Also communication with the cryptor to send the tested assembly to the crypt.\nThen testing the crypt. If jambs appear at this stage, then sending reports to the cryptor and\nworking with him. And as a result – the issuance of the finished crypt to the partner.”\n\n\n-----\n\nBentley cautioned that this testing of their malware had to be repeated approximately every\nfour hours to ensure that any new malware detection capability added to Windows Defender\n— the built-in antivirus and security service in Windows — won’t interfere with their code.\n\n“Approximately every 4 hours, a new update of Defender databases is released,” Bentley\ntold Idgo. “You need to work for 8 hours before 20-21 Moscow time. And career\nadvancement is possible.” Idgo agrees, noting that he’d started working for Conti a year\nearlier, as a code tester.\n\n## OBSERVATIONS\n\nThe logs show the Conti gang is exceedingly good at quickly finding many potential new\nransomware victims, and the records include numerous internal debates within Conti\nleadership over how much certain victim companies should be forced to pay. They also show\nwith terrifying precision how adeptly a large, organized cybercrime group can pivot from a\nsingle compromised PC to completely owning a Fortune 500 company.\n\nAs a well-staffed “big game” killing machine, Conti is perhaps unparalleled among\nransomware groups. But the internal chat logs show this group is in serious need of some\nworkflow management and tracking tools. That’s because time and time again, the Conti\ngang lost control over countless bots — all potential sources of ransom revenue that will help\npay employee salaries for months — because of a simple oversight or mistake.\n\n\n-----\n\nPeppered throughout the leaked Conti chats — roughly several times each week — are\npleadings from various personnel in charge of maintaining the sprawling and constantly\nchanging digital assets that support the group’s ransomware operation. These messages\ninvariably relate to past-due invoices for multiple virtual servers, domain registrations and\nother cloud-based resources.\n\nOn Mar. 1, 2021, a low-level Conti employee named “Carter” says the bitcoin fund used to\npay for VPN subscriptions, antivirus product licenses, new servers and domain registrations\nis short $1,240 in Bitcoin.\n\n“Hello, we’re out of bitcoins, four new servers, three vpn subscriptions and 22 renewals are\nout,” Carter wrote on Nov. 24, 2021. “Two weeks ahead of renewals for $960 in bitcoin 0.017.\nPlease send some bitcoins to this wallet, thanks.”\n\n“Forgot to pay for the anchor domain, and as a result, when trying to renew it was abused\nand we /probably/ fucked up the bots,” Carter wrote to Stern on Sept. 23, 2020.\n\nAs part of the research for this series, KrebsOnSecurity spent many hours reading each day\nof Conti’s chat logs going back to September 2020. I wish I could get many of those hours\nback: Much of the conversations are mind-numbingly boring chit-chat and shop talk. But\noverall, I came away with the impression that Conti is a highly effective — if also remarkably\ninefficient — cybercriminal organization.\n\nSome of Conti’s disorganized nature is probably endemic in the cybercrime industry, which is\nof course made up of criminals who are likely accustomed to a less regimented lifestyle. But\nmake no mistake: As ransomware collectives like Conti continue to increase payouts from\nvictim organizations, there will be increasing pressure on these groups to tighten up their\noperations and work more efficiently, professionally and profitably.\n\n“We have all the opportunities and conditions, we just need to be more professional,” Mango\nwrote Stern on Aug. 27, 2021. “And we constantly have one or the other: Either we write\nnonsense in chats, or we don’t answer patients [victims] for half a day. Naturally, our affiliates\nare nervous after that.”\n\n[If you liked this story, please check out Part III in this series, which examines how Conti](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-iii-weaponry/)\nsecured access to the cyber weaponry needed to subvert the security of their targets, as well\nas how the team’s leaders approached ransom negotiations with their victims.\n\n[Part IV: Cryptocrime explores different schemes that Conti pursued to invest in and steal](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-iv-cryptocrime/)\ncryptocurrencies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-02 - Conti Ransomware Group Diaries, Part II- The Office.pdf"
    ],
    "report_names": [
        "2022-03-02 - Conti Ransomware Group Diaries, Part II- The Office.pdf"
    ],
    "threat_actors": [
        {
            "id": "059b16f8-d4e0-4399-9add-18101a2fd298",
            "created_at": "2022-10-25T15:50:23.29434Z",
            "updated_at": "2025-03-27T02:00:55.431907Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Evilnum"
            ],
            "source_name": "MITRE:Evilnum",
            "tools": [
                "More_eggs",
                "EVILNUM",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39ea99fb-1704-445d-b5cd-81e7c99d6012",
            "created_at": "2022-10-25T16:07:23.601894Z",
            "updated_at": "2025-03-27T02:02:09.882982Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Jointworm",
                "Operation Phantom in the [Command] Shell",
                "TA4563"
            ],
            "source_name": "ETDA:Evilnum",
            "tools": [
                "Bypass-UAC",
                "Cardinal RAT",
                "ChromeCookiesView",
                "EVILNUM",
                "Evilnum",
                "IronPython",
                "LaZagne",
                "MailPassView",
                "More_eggs",
                "ProduKey",
                "PyVil",
                "PyVil RAT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraPreter",
                "TerraStealer",
                "TerraTV"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535760,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653711115,
    "ts_modification_date": 1653711115,
    "files": {
        "pdf": "https://archive.orkl.eu/1c2661d434be33dd084df5683f1cdc72fc9a6f22.pdf",
        "text": "https://archive.orkl.eu/1c2661d434be33dd084df5683f1cdc72fc9a6f22.txt",
        "img": "https://archive.orkl.eu/1c2661d434be33dd084df5683f1cdc72fc9a6f22.jpg"
    }
}