{
    "id": "39548888-00ea-43b7-a4e5-1ee31197b5ff",
    "created_at": "2023-01-12T14:59:20.033389Z",
    "updated_at": "2025-03-27T02:14:05.242979Z",
    "deleted_at": null,
    "sha1_hash": "6cc6502b43f7d10e3ff2c1016e700c3e728e0e37",
    "title": "2015-02-23 - Cyber Kung-Fu- The Great Firewall Art of DNS Poisoning",
    "authors": "",
    "file_creation_date": "2022-05-28T04:05:40Z",
    "file_modification_date": "2022-05-28T04:05:40Z",
    "file_size": 608829,
    "plain_text": "# Cyber Kung-Fu: The Great Firewall Art of DNS Poisoning\n\n**[crowdstrike.com/blog/cyber-kung-fu-great-firewall-art-dns-poisoning/](https://www.crowdstrike.com/blog/cyber-kung-fu-great-firewall-art-dns-poisoning/)**\n\nFebruary 23, 2015\n\nFebruary 23, 2015\n\n[Adam Kozy](https://www.crowdstrike.com/blog/author/kozy/) [Research & Threat Intel](https://www.crowdstrike.com/blog/category/threat-intel-research/)\n\nWing Chun (咏春拳), the first Chinese martial art learned by the legendary Bruce Lee, is\noften best known for its principles of simultaneous attack and defense. This experience later\ninspired him to create his own style of “gong-fu” in the U.S., Jeet Kune Do (截拳道) –\nliterally, “Way of the Intercepting Fist”. It appears that this philosophy of interception and\nredirected attacks has come back to roost in China in cyber form. China has been using\nDNS poisoning to redirect users attempting to access censored sites to legitimate sites it\nwants to take down via Distributed Denial of Service (DDoS) attacks.\n\nRecently observed activity shows that the infamous censorship apparatus the Great\nFirewall of China (GFW – 中国防火长城) changed its method of redirecting users from sites\ndeemed dangerous by the Chinese Communist Party (CCP). Previous to early January\n2015, users within China trying to access restricted sites such as Facebook, Google, and\nTwitter were simply redirected to a block of IP addresses, many of which were nonexistent.\nAfter a short while, users would receive a timeout message or an error message saying the\nwebsite was unavailable.\n\n\n-----\n\nThis form of DNS poisoning was fairly easy to route around, since the GFW used a small\nsubset of IPs to redirect traffic; users quickly developed anti-poisoning tools[1] that\nrecognized the few fake IP addresses and automatically circumvented the block. However,\nthe new upgrade has adopted a new strategy: redirecting users to random real IP\naddresses. This makes it much more difficult for anti-censorship supporters to develop antipoisoning tools, since the IPs are random and there are no discernable patterns. Around\nthe same time, several of the most popular VPN services in China (which hundreds of\nthousands of business owners and academics use everyday to access sites like YouTube\nand Google) became unavailable as the Cyberspace Administration of China (CAC)\nappeared to tighten its grip on normal workarounds.[2]\n\nPossibly more disturbing than the idea of China once again suppressing its masses with\nremarkable efficiency is what China has been doing with its newfound method of\ncensorship. Early January 2015 reporting indicates that after the GFW was believed to have\nbeen upgraded, thousands of Chinese Internet users attempted to visit censored sites and\nwere instead directed to a variety of sites.[3] In one case, the destination was a German\npornographic site, something that would normally be outlawed in China as pornography is\nillegal.\n\nOther “random” candidates included a government site in South Korea, an American firewall\nand security company, and a French digital freedom association, among countless others. It\nwas confirmed on all victims except the South Korean government site that the traffic\ncaused a DDoS attack as servers not normally prepared to handle that kind of traffic were\nsuddenly pummeled with traffic redirected from China. Since hosting with DDoS protection\nlike Cloudflare and Arbor Networks is often not yet affordable to many of these smaller\nsites, most of these system admins were left to deal with the massive problem on their own.\n\n[4] [5]\n\nThe sites mentioned above are particularly interesting as they each hold some interesting\npossibilities for what this DNS poisoning and DDoS combination can do. The South Korean\ngovernment site shows the ability for China to potentially knock foreign government sites\noffline by simply redirecting traffic for a brief period and claiming a “glitch” caused the\nattack. This carries serious implications, especially if the DDoS attack is directed at an\nelection site, which was a tactic CrowdStrike observed several times in 2014 and that had\nan impact on democratic elections. The DDoS attack on the American firewall company was\nalso interesting as it shows the ability to gauge a security company’s response to attacks,\npossibly in advance of further cyber action against the security firm’s customers.\n\nThe most disturbing by far, however, is the attack against the French digital freedom site, as\nit shows the potential for China to not only censor its own citizens, but then also use them to\ncensor other sites that advocate digital freedom[6] with DDoS attacks, in essence becoming\na self-perpetuating censorship machine. With more than 632 million Chinese Internet\nusers[7] and a censorship juggernaut capable of censoring the majority of that population,\nChina has effectively turned the GFW into the largest botnet in the world And like all good\n\n\n-----\n\nbotnets, its host of zombie users are most likely blissfully unaware of their involvement in\nthe attacks. This was reiterated as several of the DDoS victim sites voiced their feelings of\nfrustration and helplessness in public blogs, only to have Chinese netizens respond by\nsaying they felt “ashamed” that the attacks were connected to the GFW.\n\nAll of this comes on the heels of what appears to be a giant consolidation of power by the\nCAC and new head LU Wei (鲁炜).[8] This has manifested over the past several months\nwith a December 2014 CAC takeover of the China Internet Network Information Center\n(CNNIC), which is a designated certificate authority. There were also several Man-In-TheMiddle (MITM) attacks against mail users from Yahoo, Google, and Apple during late 2014,\nbefore another attack was carried out against Microsoft Outlook in January 2015 with some\nfairly damning evidence pointing the finger at the CAC provided by anti-censorship site\nGreatFire.org.[9] Finally, the crackdown on popular VPN services in late January 2015\nindicates that this is a coordinated campaign to suppress and censor not just domestically,\nbut overseas as well. China is no longer harnessing only an attractive, rapidly growing tech\nmarket as leverage over foreign countries and companies hoping to do business in China,\nbut now also its own citizens.\n\nThe fact that the GFW sprang out of something called the “S219/Golden Shield Project”\nmakes it clear this notion of simultaneous attack and defense suits China well, and that it\nwill likely continue to use its existing strengths of a large population and the world’s most\nrestrictive censorship apparatus to its advantage.\n\nTurns out using a shield as a weapon isn’t just for Captain America anymore.\n\n[1] https://github.com/ihacku/gfw_dns_resolver/blob/master/gfw_dns_resolver.c\n\n[2] http://cn.nytimes.com/china/20150130/c30chinainternet/\n\n[3] https://en.greatfire.org/blog/2015/jan/gfw-upgrade-fail-visitors-blocked-sites-redirectedporn\n\n[4] http://blog.sucuri.net/2015/01/ddos-from-china-facebook-wordpress-and-twitter-usersreceiving-sucuri-error-pages.html\n\n[5] http://furbo.org/2015/01/28/grass-mud-horse/\n\n[6] https://benjamin.sonntag.fr/DDOS-on-La-Quadrature-du-Net-analysis\n\n[7] CNNIC June 2014 estimate\n\n[8] http://www.washingtonpost.com/blogs/worldviews/wp/2015/02/02/why-internet-users-allaround-the-world-should-be-worried-about-chinas-great-firewall/\n\n[9] https://en.greatfire.org/blog/2015/jan/open-letter-lu-wei-and-cyberspace-administrationchina\n\n\n-----\n\nRelated Content\n\nWho is EMBER BEAR?\n\n\n-----\n\nA Tale of Two Cookies: How to Pwn2Own the Cisco RV340 Router\n\n\n-----\n\nPROPHET SPIDER Exploits Citrix ShareFile Remote Code Execution Vulnerability CVE 2021 22941 to\nDeliver Webshell\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-23 - Cyber Kung-Fu- The Great Firewall Art of DNS Poisoning.pdf"
    ],
    "report_names": [
        "2015-02-23 - Cyber Kung-Fu- The Great Firewall Art of DNS Poisoning.pdf"
    ],
    "threat_actors": [
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535560,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1653710740,
    "ts_modification_date": 1653710740,
    "files": {
        "pdf": "https://archive.orkl.eu/6cc6502b43f7d10e3ff2c1016e700c3e728e0e37.pdf",
        "text": "https://archive.orkl.eu/6cc6502b43f7d10e3ff2c1016e700c3e728e0e37.txt",
        "img": "https://archive.orkl.eu/6cc6502b43f7d10e3ff2c1016e700c3e728e0e37.jpg"
    }
}