{
    "id": "396e9254-f0e2-4bf6-bda7-e9ba312500d5",
    "created_at": "2023-01-12T15:09:08.55446Z",
    "updated_at": "2025-03-27T02:05:40.467513Z",
    "deleted_at": null,
    "sha1_hash": "3142b62c9fad8fce8172daee4484243064677e32",
    "title": "2020-10-22 - Alert (AA20-296B)- Iranian Advanced Persistent Threat Actors Threaten Election-Related Systems",
    "authors": "",
    "file_creation_date": "2022-05-29T01:05:38Z",
    "file_modification_date": "2022-05-29T01:05:38Z",
    "file_size": 97188,
    "plain_text": "# Iranian Advanced Persistent Threat Actors Threaten Election-Related Systems\n\n**us-cert.cisa.gov/ncas/alerts/aa20-296b**\n\n## Summary\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of\nInvestigation (FBI) are warning that Iranian advanced persistent threat (APT) actors are likely\nintent on influencing and interfering with the U.S. elections to sow discord among voters and\nundermine public confidence in the U.S. electoral process.\n\nThe APT actors are creating fictitious media sites and spoofing legitimate media sites to\nspread obtained U.S. voter-registration data, anti-American propaganda, and misinformation\nabout voter suppression, voter fraud, and ballot fraud.\n\nThe APT actors have historically exploited critical vulnerabilities to conduct distributed denialof-service (DDoS) attacks, structured query language (SQL) injections attacks, spearphishing campaigns, website defacements, and disinformation campaigns.\n\nClick here for a [PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/Joint_CISA_FBI_CSA-AA20-296B_Iranian_APT_Actors_Threaten_Election-Related_Systems.pdf)\n\n## Technical Details\n\nThese actors have conducted a significant number of intrusions against U.S.-based networks\nsince August 2019. The actors leveraged several Common Vulnerabilities and Exposures\n[(CVEs)—notably CVE-2020-5902 and](https://nvd.nist.gov/vuln/detail/CVE-2020-5902) [CVE-2017-9248—pertaining to virtual private](https://nvd.nist.gov/vuln/detail/CVE-2017-9248)\nnetworks (VPNs) and content management systems (CMSs).\n\n[CVE-2020-5902 affects F5 VPNs. Remote attackers could exploit this vulnerability to](https://nvd.nist.gov/vuln/detail/CVE-2020-5902)\n[execute arbitrary code. [1].](https://support.f5.com/csp/article/K52145254)\n[CVE-2017-9248 affects Telerik UI. Attackers could exploit this vulnerability in web](https://nvd.nist.gov/vuln/detail/CVE-2017-9248)\napplications using Telerik UI for ASP.NET AJAX to conduct cross-site scripting (XSS)\n[attacks.[2]](https://www.telerik.com/support/kb/aspnet-ajax/details/cryptographic-weakness)\n\nHistorically, these actors have conducted DDoS attacks, SQL injections attacks, spearphishing campaigns, website defacements, and disinformation campaigns. These activities\ncould render these systems temporarily inaccessible to the public or election officials, which\ncould slow, but would not prevent, voting or the reporting of results.\n\n\n-----\n\n**A DDoS attack could slow or render election-related public-facing websites**\ninaccessible by flooding the internet-accessible server with requests; this would\nprevent users from accessing online resources, such as voting information or nonofficial voting results. In the past, cyber actors have falsely claimed DDoS attacks have\ncompromised the integrity of voting systems in an effort to mislead the public that their\nattack would prevent a voter from casting a ballot or change votes already cast.\n**A SQL injection involves a threat actor inserting malicious code into the entry field of**\nan application, causing that code to execute if entries have not been sanitized. SQL\ninjections are among the most dangerous and common exploits affecting websites. A\nSQL injection into a media company’s CMS could enable a cyber actor access to\nnetwork systems to manipulate content or falsify news reports prior to publication.\n**Spear-phishing messages may not be easily detectible. These emails often ask**\nvictims to fill out forms or verify information through links embedded in the email. APT\nactors use spear phishing to gain access to information—often credentials, such as\npasswords—and to identify follow-on victims. A malicious cyber actor could use\ncompromised email access to spread disinformation to the victims’ contacts or collect\ninformation sent to or from the compromised account.\n**Public-facing website defacements typically involve a cyber threat actor**\ncompromising the website or its associated CMS, allowing the actor to upload images\nto the site’s landing page. In situations where such public-facing websites relate to\nelections (e.g., the website of a county board of elections), defacements could cast\ndoubt on the security and legitimacy of the websites’ information. If cyber actors were\nable to successfully change an election-related website, the underlying data and\ninternal systems would remain uncompromised..\n**Disinformation campaigns involve malign actions taken by foreign governments or**\nactors designed to sow discord, manipulate public discourse, or discredit the electoral\nsystem. Malicious actors often use social media as well as fictitious and spoofed media\nsites for these campaigns. Based on their corporate policies, social media companies\nhave worked to counter these actors’ use of their platforms to promote fictitious news\nstories by removing the news stories, and in many instances, closing the accounts\nrelated to the malicious activity. However, these adversaries will continue their attempts\nto create fictitious accounts that promote divisive storylines to sow discord, even after\nthe election.\n\n## Mitigations\n\nThe following recommended mitigations list includes self-protection strategies against the\ncyber techniques used by the APT actors:\n\n\n-----\n\nValidate input—input validation is a method of sanitizing untrusted input provided by\nweb application users. Implementing input validation can protect against security flaws\nof web applications by significantly reducing the probability of successful exploitation.\nTypes of attacks possibly prevented include SQL injection, XSS, and command\ninjection.\nAudit your network for systems using Remote Desktop Protocol (RDP) and other\ninternet-facing services. Disable the service if unneeded or install available patches.\nUsers may need to work with their technology vendors to confirm that patches will not\naffect system processes.\nVerify all cloud-based virtual machine instances with a public IP; do not have open\nRDP ports, unless there is a valid business reason to do so. Place any system with an\nopen RDP port behind a firewall, and require users to use a VPN to access it through\nthe firewall.\nEnable strong password requirements and account lockout policies to defend against\nbrute-force attacks.\nApply multi-factor authentication, when possible.\nApply system and software updates regularly, particularly if you are deploying products\naffected by CVE-2020-5902 and CVE-2017-9248.\n\nFor patch information on CVE-2020-5902, refer to F5 Security Advisory\n[K52145254.](https://support.f5.com/csp/article/K52145254)\nFor patch information on CVE-2017-9248, refer to Progress Telerik details for\nCVE-2017-9248.\nMaintain a good information back-up strategy that involves routinely backing up all\ncritical data and system configuration information on a separate device. Store the\nbackups offline; verify their integrity and restoration process.\nEnable logging and ensure logging mechanisms capture RDP logins. Keep logs for a\nminimum of 90 days, and review them regularly to detect intrusion attempts.\nWhen creating cloud-based virtual machines, adhere to the cloud provider's best\npractices for remote access.\nEnsure third parties that require RDP access are required to follow internal policies on\nremote access.\nMinimize network exposure for all control system devices. Where possible, critical\ndevices should not have RDP enabled.\nRegulate and limit external to internal RDP connections. When external access to\ninternal resources is required, use secure methods, such as VPNs, recognizing VPNs\nare only as secure as the connected devices.\nBe aware of unsolicited contact on social media from any individual you do not know.\nBe aware of attempts to pass links or files via social media from anyone you do not\nknow.\nBe aware of unsolicited requests to share a file via online services.\n\n\n-----\n\nBe aware of email messages conveying suspicious alerts or other online accounts,\nincluding login notifications from foreign countries or other alerts indicating attempted\nunauthorized access to your accounts.\nBe suspicious of emails purporting to be from legitimate online services (e.g., the\nimages in the email appear to be slightly pixelated and/or grainy, language in the email\nseems off, the email originates from an IP address not attributable to the\nprovider/company).\nBe suspicious of unsolicited email messages that contain shortened links (e.g., via\n```\n   tinyurl, bit.ly ).\n\n```\n[Use security features provided by social media platforms, use strong passwords,](https://us-cert.cisa.gov/ncas/current-activity/2018/03/27/Creating-and-Managing-Strong-Passwords)\nchange passwords frequently, and use a different password for each social media\naccount.\nSee CISA’s [Tip on Best Practices for Securing Election Systems for more information.](https://us-cert.cisa.gov/ncas/tips/ST19-002)\n\n**General Mitigations**\n\nKeep applications and systems updated and patched\n\nApply all available software updates and patches; automate this process to the greatest\nextent possible (e.g., by using an update service provided directly from the vendor).\nAutomating updates and patches is critical because of the speed at which threat actors\ncreate exploits after a patch is released. These “N-day” exploits can be as damaging as a\nzero-day exploits. Vendor updates must also be authentic; updates are typically signed and\ndelivered over protected links to ensure the integrity of the content. Without rapid and\n[thorough patch application, threat actors can operate inside a defender’s patch cycle.[3] In](https://www.nsa.gov/Portals/70/documents/what-we-do/cybersecurity/professional-resources/csi-nsas-top10-cybersecurity-mitigation-strategies.pdf?v=1)\naddition to updating the application, use tools (e.g., the OWASP Dependency-Check Project\n[tool[4]) to identify publicly known vulnerabilities in third-party libraries that the application](https://owasp.org/www-project-dependency-check/)\ndepends on.\n\nScan web applications for SQL injection and other common web vulnerabilities\n\nImplement a plan to scan public-facing web servers for common web vulnerabilities (SQL\ninjection, cross-site scripting, etc.); use a commercial web application vulnerability scanner in\n[combination with a source code scanner.[5] As vulnerabilities are found, they should be fixed](https://apps.nsa.gov/iaarchive/library/ia-guidance/tech-briefs/defending-against-the-exploitation-of-sql-vulnerabilities-to.cfm)\nor patched. This is especially crucial for networks that host older web applications; as sites\nget older, more vulnerabilities are discovered and exposed.\n\nDeploy a web application firewall\n\nDeploy a web application firewall (WAF) to help prevent invalid input attacks and other\nattacks destined for the web application. WAFs are intrusion/detection/prevention devices\nthat inspect each web request made to and from the web application to determine if the\nrequest is malicious. Some WAFs install on the host system and others are dedicated\ndevices that sit in front of the web application. WAFs also weaken the effectiveness of\nautomated web vulnerability scanning tools.\n\nDeploy techniques to protect against web shells\n\n\n-----\n\nPatch web application vulnerabilities or fix configuration weaknesses that allow web shell\n[attacks, and follow guidance on detecting and preventing web shell malware.[6] Malicious](https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF)\ncyber actors often deploy web shells—software that can enable remote administration—on a\nvictim’s web server. Malicious cyber actors can use web shells to execute arbitrary system\ncommands, which are commonly sent over HTTP or HTTPS. Attackers often create web\nshells by adding or modifying a file in an existing web application. Web shells provide\nattackers with persistent access to a compromised network using communications channels\ndisguised to blend in with legitimate traffic. Web shell malware is a long-standing, pervasive\nthreat that continues to evade many security tools.\n\nUse multi-factor authentication for administrator accounts\n\nPrioritize protection for accounts with elevated privileges, with remote access, and/or used\n[on high value assets.[7] Use physical token-based authentication systems to supplement](https://us-cert.cisa.gov/cdm/event/Identifying-and-Protecting-High-Value-Assets-Closer-Look-Governance-Needs-HVAs)\n[knowledge-based factors such as passwords and personal identification numbers (PINs).[8]](https://www.nsa.gov/Portals/70/documents/what-we-do/cybersecurity/professional-resources/csi-nsas-top10-cybersecurity-mitigation-strategies.pdf)\nOrganizations should migrate away from single-factor authentication, such as passwordbased systems, which are subject to poor user choices and more susceptible to credential\ntheft, forgery, and password reuse across multiple systems.\n\nRemediate critical web application security risks\n\nFirst, identify and remedite critical web application security risks first; then, move on to other\n[less critical vulnerabilities. Follow available guidance on securing web applications.[9],[10],](https://apps.nsa.gov/iaarchive/library/ia-guidance/security-tips/building-web-applications-security-recommendations-for.cfm)\n\n[[11]](https://cwe.mitre.org/top25/archive/2020/2020_cwe_top25.html)\n\nHow do I respond to unauthorized access to election-related systems?\n\nImplement your security incident response and business continuity plan\n\nIt may take time for your organization’s IT professionals to isolate and remove threats to your\nsystems and restore normal operations. In the meantime, take steps to maintain your\norganization’s essential functions according to your business continuity plan. Organizations\nshould maintain and regularly test backup plans, disaster recovery plans, and business\ncontinuity procedures.\n\nContact CISA or law enforcement immediately\n\nTo report an intrusion and to request incident response resources or technical assistance,\n[contact CISA (Central@cisa.dhs.gov or 888-282-0870) or the Federal Bureau of](http://10.10.0.46/mailto:Central@cisa.dhs.gov)\nInvestigation (FBI) through a local field office or the FBI’s Cyber Division\n[(CyWatch@ic.fbi.gov or 855-292-3937).](http://10.10.0.46/mailto:CyWatch@ic.fbi.gov)\n\n## Resources\n\n[CISA Tip: Best Practices for Securing Election Systems](https://us-cert.cisa.gov/ncas/tips/ST19-002)\n[CISA Tip: Securing Voter Registration Data](https://us-cert.cisa.gov/ncas/tips/ST16-001)\n[CISA Tip: Website Security](https://us-cert.cisa.gov/ncas/tips/ST18-006)\n[CISA Tip: Avoiding Social Engineering and Phishing Attacks](https://us-cert.cisa.gov/ncas/tips/ST04-014)\n[CISA Tip: Securing Network Infrastructure Devices](https://us-cert.cisa.gov/ncas/tips/ST18-001)\n\n\n-----\n\nCISA Activity Alert: Technical Approaches to Uncovering and Remediating Malicious\nActivity\n[CISA Insights: Actions to Counter Email-Based Attacks On Election-related Entities](https://www.cisa.gov/sites/default/files/publications/CISA_Insights_Actions_to_Counter_Email-Based_Attacks_on_Election-Related_S508C.pdf%20%20)\nFBI and CISA Public Service Announcement (PSA): Spoofed Internet Domains and\nEmail Accounts Pose Cyber and Disinformation Risks to Voters\nFBI and CISA PSA: Foreign Actors Likely to Use Online Journals to Spread\nDisinformation Regarding 2020 Elections\nFBI and CISA PSA: Distributed Denial of Service Attacks Could Hinder Access to\nVoting Information, Would Not Prevent Voting\nFBI and CISA PSA: False Claims of Hacked Voter Information Likely Intended to Cast\nDoubt on Legitimacy of U.S. Elections\nFBI and CISA PSA: Cyber Threats to Voting Processes Could Slow But Not Prevent\nVoting\nFBI and CISA PSA: Foreign Actors and Cybercriminals Likely to Spread Disinformation\nRegarding 2020 Election Results\n\n## Contact Information\n\nTo report suspicious or criminal activity related to information found in this Joint\nCybersecurity Advisory, contact your local FBI field office at [www.fbi.gov/contact-us/field, or](http://www.fbi.gov/contact-us/field)\n[the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at CyWatch@fbi.gov.](http://10.10.0.46/mailto:CyWatch@fbi.gov)\nWhen available, please include the following information regarding the incident: date, time,\nand location of the incident; type of activity; number of people affected; type of equipment\nused for the activity; the name of the submitting company or organization; and a designated\npoint of contact. To request incident response resources or technical assistance related to\nthese threats, contact CISA at [Central@cisa.dhs.gov.](http://10.10.0.46/mailto:Central@cisa.dhs.gov)\n\n## References\n\n Revisions\n\nOctober 22, 2020: Initial Version\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa20-296b)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-22 - Alert (AA20-296B)- Iranian Advanced Persistent Threat Actors Threaten Election-Related Systems.pdf"
    ],
    "report_names": [
        "2020-10-22 - Alert (AA20-296B)- Iranian Advanced Persistent Threat Actors Threaten Election-Related Systems.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536148,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653786338,
    "ts_modification_date": 1653786338,
    "files": {
        "pdf": "https://archive.orkl.eu/3142b62c9fad8fce8172daee4484243064677e32.pdf",
        "text": "https://archive.orkl.eu/3142b62c9fad8fce8172daee4484243064677e32.txt",
        "img": "https://archive.orkl.eu/3142b62c9fad8fce8172daee4484243064677e32.jpg"
    }
}