{
    "id": "39aeceab-6143-4e14-93f2-031ff953a7db",
    "created_at": "2023-01-12T15:09:45.231111Z",
    "updated_at": "2025-03-27T02:15:46.988314Z",
    "deleted_at": null,
    "sha1_hash": "d4c2e45b71741ae3de8f2c9a5f87c10e8ab5488e",
    "title": "2019-10-03 - AVIVORE – Hunting Global Aerospace through the Supply Chain",
    "authors": "",
    "file_creation_date": "2022-05-27T22:57:51Z",
    "file_modification_date": "2022-05-27T22:57:51Z",
    "file_size": 97701,
    "plain_text": "# AVIVORE – Hunting Global Aerospace through the Supply Chain\n\n**contextis.com/en/blog/avivore**\n\n[1. Home](https://www.contextis.com/en/)\n[2. Blog](https://www.contextis.com/en/blog)\n3. AVIVORE – Hunting Global Aerospace through the Supply Chain\n\nThe Threat Intelligence and Incident Response Team at [Context Information Security has](https://www.contextis.com/en/)\nidentified a new threat group behind a series of incidents targeted at the aerospace and\ndefence industries in the UK and Europe.\n\n### By Context\n\nLeading cyber security consultancy\n\n03 Oct 2019\n\nUntil now, most prominent supply chain intrusions have been \"vertical\"; initial victims are\ntypically Managed Services Providers or software vendors leveraged by attackers to move\nup or down the supply chain. However, since summer 2018, Context Information Security\nhas been investigating a series of incidents targeting UK and European Aerospace and\n\n\n-----\n\nDefence that are best described as horizontal . Advanced attackers have been leveraging\ndirect connectivity between suppliers and partners who are integrated into each other’s\nvalue chains. We have been tracking this activity under the codename AVIVORE.\n\nAffected victims include large multinational firms (Primes) and smaller engineering or\nconsultancy firms within their supply chain (Secondaries). Context has worked closely with\nvictims, the National Cyber Security Centre (NCSC), security organisations, and law\nenforcement agencies across Europe to reduce impact and prevent further compromise.\n\n## Who is AVIVORE?\n\nContext categorises AVIVORE as a previously unknown and untracked nation-state level\nadversary, whose operators’ working hours appear to correlate to a time zone of UTC +8.\nThe primary objective for their intrusions is believed to be espionage, as well as access\nenablement through supply chain partners.\n\n[Recent reporting into incidents affecting Aerospace and Defence Primes has speculated](https://www.france24.com/en/20190926-airbus-hit-by-series-of-cyber-attacks-on-suppliers)\nthat either APT10 or JSSD (Jiangsu Province Ministry of State Security) may be responsible\nfor this activity. Whilst certain similarities between these adversaries' campaigns and those\ninvestigated by Context exist, the Tactics, Techniques and Procedures (TTPs),\ninfrastructure and tooling observed differ significantly. Whilst involvement of these named\nadversaries cannot be ruled out, available evidence suggests this campaign is the work of a\nseparate adversary group.\n\n## Capable and Adaptable\n\nAVIVORE showed themselves to be highly capable; adept at both “living-off-the-land”\n(masquerading as legitimate users) and in their operational security awareness; including\nforensically covering their tracks. They demonstrated detailed knowledge of key individuals\nassociated with projects of interest, and were able to successfully mirror working times and\npatterns of these users to avoid arousing suspicions. They were also able to manipulate\nvictim environments and security controls to facilitate and obfuscate their activities (e.g.\nmodifying firewall rules to accept RDP over alternate ports; establishing hosts within the\nvictim environment as remote access proxies). AVIVORE’s attack methodology for the\nlinked intrusions followed a relatively set-format:\n\nAccess into victim through leverage of compromised user credentials and legitimate\nexternal remote access services;\nEscalate privileges within victim environment via abuse of legitimate tools and/or\nhighly privileged service and enterprise administrator accounts;\nConduct account and host enumeration using 'net' commands;\nSchedule execution of scripts and tooling run in the context of the ‘SYSTEM’ user;\nRemove forensic artefacts of scripts & tooling, and clearing of event logs following\nexecution;\n\n\n-----\n\nUse of RDP for lateral movement around the victim environment.\n\n## Infrastructure and Tooling\n\nAVIVORE made extensive use of infrastructure providing interconnectivity between victims;\naffected Secondaries are often suppliers to multiple Primes and frequently maintain direct\nnetwork connectivity via Virtual Private Networks (VPNs) or other remote and collaborative\nworking solutions. AVIVORE exploited this relationship to bypass the (generally welldefended) perimeters of the Primes, evading critical controls and taking advantage of the\nchallenges many organisations face in cross-boundary coordination.\n\nThis technique, referred to as \"Island Hopping\", allowed AVIVORE to chain activity across\nmultiple business units (with local IT and security teams operating independently) or\ngeographical locales within victim environments. Where Context had visibility of victimfacing network infrastructure employed by AVIVORE, it primarily consisted of commercial\nVPN infrastructure located in Singapore and Japan, as well as Tor. This all served to\nobfuscate the origin of AVIVORE’s connections into victim networks and made investigation\nchallenging.\n\nAVIVORE demonstrated a preference for in-built system tooling and abuse of legitimate\nsoftware. They introduced network scanning and certificate extractions tools, as well as\nWindows SysInternals tools such as ProcDump, across multiple victim environments. These\nbinaries were renamed to imitate Windows DLLs and staged in file system locations\nassociated with compatibility and performance logging. Such tools were typically executed\non remote systems using scheduled tasks and then removed, together with their output,\nfollowing execution.\n\nMultiple instances of the PlugX Remote Access Trojan were discovered on compromised\nhosts. Evidence suggested these implants were deployed between October 2015 and\nOctober 2016. File system artefacts indicated that attackers may have interacted with them\nbetween deployment and the 2018 intrusions. Although direct interaction with these\nimplants was not observed during the investigation period, Context assess with lowmoderate confidence that they may be associated to the AVIVORE intrusions. Evidence\nindicated that some of the implants were patched in-memory, with modified configuration\nblocks injected post-execution to provide new C2 domains during times AVIVORE operators\nwere active inside victim environments.\n\n## Future Recommendations and Mitigations\n\nThough the majority of activity investigated by Context has taken place since Jan/Feb 2018,\nartefacts from some victim environments indicate that AVIVORE likely maintained persistent\naccess since October 2015, and potentially even earlier. Therefore, it is possible that this is\n\n\n-----\n\na small portion of a broader campaign. In addition to Aerospace and Defence engineering\nvictims, Context has seen AVIVORE target assets related to a number of other verticals\nincluding:\n\nAutomotive\nConsultancy\nEnergy/Nuclear\nSpace and Satellite Technology\n\nBased on the information and assets sought by AVIVORE, Context assesses with moderate\nconfidence that the objective of the recent campaign was intellectual property theft from\nvictim organisations. Although defence against advanced nation-state level actors can be\nchallenging, Context recommend the following mitigations to disrupt future AVIVORE\nactivity:\n\nImpose access limitations on supplier connections over VPNs, such as preventing\ntheir use outside of the supplier’s business hours or from IP addresses and locations\nother than those pre-agreed, and restrict access only to data and assets they require\nto perform their actions.\nEnsure that security measures, such as multifactor authentication and enhanced\nauditing/logging are deployed to hosts and services into which suppliers are required\nto connect, in order to prevent or support the investigation of any suspicious user\nbehaviour.\nEnsure that external remote access services implement appropriate log retention.\nLogs should contain enough information on the sources of inbound connections to\nenable identification of anomalies, such as concurrent log-ins with impossible\ngeography.\nEnsure that credentials for highly privileged accounts and remote services are stored\nsecurely, and their use is appropriately monitored. Hosts such as domain controllers,\nsensitive file shares and Public Key Infrastructure servers, should also be subject to\nparticular additional scrutiny and monitoring.\nWhere possible, applications, documentation and technical information related to\nnetwork infrastructure and configuration of remote access services should be made\navailable only to engineers, IT support staff and other individuals with legitimate\nbusiness need.\n\n## Webinar: Defending against new AVIVORE threat group\n\n[Learn more about the AVIVORE threat group at our Webinar on January 29, 2020 at](https://go.contextis.com/avivorewebinar.html)\n10:30GMT. (If you are unable to attend the live webinar, please do still sign up as a\nrecording will be made available and sent to you after it has ended.)\n\n\n-----\n\nThe webinar will be delivered by Oliver Fay, Technical Lead – Threat Intelligence and\nJames Allman-Talbot, Head of Cyber Incident Response. They will be joined by Context\nCEO, Mark Raeburn, who will address the challenges at an organisational level when it\ncomes to managing business and supply chain risk.\n\nThis webinar is suitable for anyone who has responsibility for cyber security, including those\nat executive/board level.\n\n[Register now](https://go.contextis.com/avivorewebinar.html)\n\n### About Context\n\nLeading cyber security consultancy\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-03 - AVIVORE – Hunting Global Aerospace through the Supply Chain.pdf"
    ],
    "report_names": [
        "2019-10-03 - AVIVORE – Hunting Global Aerospace through the Supply Chain.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "680d62c6-23e2-411b-86e9-af6dc6a64d53",
            "created_at": "2023-01-06T13:46:39.329055Z",
            "updated_at": "2025-03-27T02:00:03.052401Z",
            "deleted_at": null,
            "main_name": "Avivore",
            "aliases": [],
            "source_name": "MISPGALAXY:Avivore",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3b978023-9d82-46fb-b836-a0d011504d2c",
            "created_at": "2022-10-25T16:07:23.368134Z",
            "updated_at": "2025-03-27T02:02:09.763477Z",
            "deleted_at": null,
            "main_name": "AVIVORE",
            "aliases": [],
            "source_name": "ETDA:AVIVORE",
            "tools": [
                "Agent.dhwf",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536185,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1653692271,
    "ts_modification_date": 1653692271,
    "files": {
        "pdf": "https://archive.orkl.eu/d4c2e45b71741ae3de8f2c9a5f87c10e8ab5488e.pdf",
        "text": "https://archive.orkl.eu/d4c2e45b71741ae3de8f2c9a5f87c10e8ab5488e.txt",
        "img": "https://archive.orkl.eu/d4c2e45b71741ae3de8f2c9a5f87c10e8ab5488e.jpg"
    }
}