{
    "id": "3a5c40ff-1c58-4af6-bbe1-f6b226c7f542",
    "created_at": "2023-01-12T14:59:59.007993Z",
    "updated_at": "2025-03-27T02:05:26.17771Z",
    "deleted_at": null,
    "sha1_hash": "dcabda3e664e50227cc9d695c56b4eccb3c75b4e",
    "title": "2020-04-24 - Inside -Phobos- Ransomware- -Dharma- Past & Underground",
    "authors": "",
    "file_creation_date": "2022-05-28T21:38:30Z",
    "file_modification_date": "2022-05-28T21:38:30Z",
    "file_size": 785203,
    "plain_text": "# Inside \"Phobos\" Ransomware: \"Dharma\" Past & Underground\n\n**[advanced-intel.com/post/inside-phobos-ransomware-dharma-past-underground](https://www.advanced-intel.com/post/inside-phobos-ransomware-dharma-past-underground)**\n\nAdvIntel July 24, 2020\n\nBy Bridgit Sullivan\n\n**_What is Phobos Ransomware?_**\n\nPhobos is a type of Advanced Encryption Standard (AES) ransomware that was first seen in\nOctober 2017 but became increasingly active in 2019. Also referred to as Phobos NextGen\nor Phobos Not Dharma, Phobos ransomware is extremely similar to the Dharma and Crysis\nransomware family due to the same Dharma codebase. It is an offline file-encoding virus that\ntargets Windows operating systems Phobos is offered as a Ransomware-as-a-Service\n\n\n-----\n\n(RaaS) package on the top-tier Eastern European forums. Phobos is an increasingly\ndangerous and credible ransomware threat that usually targets business and occasionally\ncustomers.\n\n**_How Does it Work?_**\n\nThere are multiple ways for Phobos ransomware to end up on your device. The payload can\nbe distributed as an attachment through traditional phishing schemes, through open and\npoorly secured Remote Desktop Protocol (RDP) connections, and through fake system\nupdates. There are multiple ways that Phobos gains access to RDP connections: by using\nbrute-force to get RDP credentials, using stolen or bought RDP credentials, or through an\ninsecure connection on port 3389. Once deployed, the payload locks the victim’s files and\nthen places two ransom notes–one .txt and one .hta–on their desktop. In addition to locking\nthe victim’s files, Phobos deletes any shadow copies or backups of the files, as well as the\nsystem, restore point.\n\nAs soon as the victim views the .hta ransom note, which pops up automatically, negotiations\ncan begin with Phobos operators. While most ransom notes are unique to the type of\nransomware being used, the rhetoric in the ransom notes that Phobos places on the victim’s\ndesktop are identical to the one that Dharma used. The only difference between the notes is\nthat in Phobos’ ransom note they have placed their name on the note, effectively branding it\nas theirs.\n\nThe ransom note offers an email for the victim to contact the operator to negotiate the\nransom. Once the victim has reached out, the initial response from Phobos is, again, a copy\nof the initial response that Dharma used. However, Phobos has added a section that aims to\nconvince the victim to pay another 0.1 Bitcoin (BTC) for the operator to give the victim\nsecurity advice, on top of the amount in BTC the victim is being asked to pay to decrypt their\nfiles. Before paying the ransom, the victim is instructed to send 5 files below a certain size to\nbe decrypted for free.\n\nThe average ransom ranges from $5,000-$6,000, but it must be paid in Bitcoin. However,\nthis amount is because as negotiations continue and the ransom is still not paid, the ransom\nis increased from the original amount of usually $3,000. The average negotiation period\nbetween a victim and a Phobos operator lasts about 8 days. This is a longer average\n\n\n-----\n\nnegation period than other ransomware syndicates usually have, which could be due to\nunorganized and unprofessional amateur hackers using Phobos. Phobos is sold as RaaS\npackages on the Dark Web, which gives hackers and cybercriminals with little to no skill the\nability to deploy effective and established ransomware. Victims have found that it was difficult\nto get their files decrypted and on multiple occasions, the decryption tool was not provided\nafter the ransom was paid.\n\n**_Phobos and the Underground_**\n\nPhobos operates with a RaaS (ransomware-as-a-service) model. On April 11, 2019, with\nusing their representative on underground forums announced that they were looking for\naffiliate partners to use their ransomware, Phobos. This was the beginning of a long forum\nthread, with posts as recent as February 2020 that give insight into how Phobos has evolved\nover the past year. The initial post by its representative from April of last year was meant to\nentice new partners to use Phobos; they detailed how the software works, how to get in\ntouch with Phobos developers, and some of the guidelines for using the ransomware.\n\nThe post begins by describing Phobos as a “popular offline cryptolocker.” Phobos\nrepresentative continues by detailing that the software is run completely offline–it does not\nrequire an internet connection to run–and while it is running it does not attract additional\nattention. In addition, when the infected device is turned on and off, Phobos will automatically\nscan for the presence of connected external and network devices, and if it finds any it will\nencrypt their data. The Phobos representative also discussed other aspects of their software,\nincluding its productivity, automatic functions, and file encryption. They also mentioned that\nthis ransomware could not be used to target Russian or Commonwealth of Independent\nState (CIS) entities. Throughout the post, the ransomware administrator emphasized that\nPhobos is secure, easy to use and that there is a direct line of communication between\npartners and developers, no intermediaries necessary.\n\nDespite their best effort to peddle Phobos ransomware, its representative was met with\nskepticism and accusations by many prominent members of the forum. In mid-April 2019, the\nransomware representative responded to a post and defended Phobos ransomware. They\nexplained that the software had been updated on April 4, 2019, and again emphasized their\nopen channels of communication between affiliates and developers. This was not the first\ninstance of criticism and questioning of the ransomware on the thread.\n\n\n-----\n\n**_Phobos and Dharma_**\n\nOne prominent underground forum user brought up the similarities between Phobos and\nDharma. Simply put, the user asked if this ransomware was also Dharma. The ransomware\nrepresentative quickly responded that it was not. In May 2019, over a month after this\nexchange, the Phobos representative posted that a new software update had been released\nand that they were continuing to recruit affiliate partners. They were again met with\ncomments that Phobos and Dharma are the same, this time by the GandCrab themselves.\n\n_Image 1: Phobos team denies being the same as Dharma. This denial triggered harsh_\n_responses from the community, illustrating the toxicity and over-competitiveness of the_\n_current ransomware black market._\n\nFollowing this criticism, the ransomware representative posted a longer explanation of the\ndifferences between Dharma and Phobos in June of 2019. According to the group’s\nspokesperson, Phobos is based on Dharma, but it is “written from scratch” and offers better\nsecurity. They again emphasize that Phobos is constantly being updated and improved.\n\nTwo months later, on June 16, 2019, the ransomware representative again updated the\nthread and described the Phobos’ new update. They referred to the update at “version 2.7.”\nThey described the update as:\n\nStable offline cryptolocker, written in C++ without STL, MSIL, CRT.\n\nEncrypts with the AES256 algorithm.\n\nEncrypts local, removable drives and network folders.\n\nThere is the possibility of full and partial encryption.\n\nDeletes shadow copies and restore points.\n\n\n-----\n\nCloses processes blocking access to files.\n\nFile size:\n\n54kb (standard configuration with HTML page)\n\n47kb (standard configuration without HTML page)\n\nIt has a flexible configuration system, according to your desire you can configure:\n\nLists of files that are encrypted\n\nLists of critical files that are encrypted in the first place\n\nDisable partial encryption for critical files\n\nLists of exceptions\n\nLists of programs that need to be closed\n\nBypass UAC, launch offers from the administrator, or work with the privileges with\nwhich it was originally launched\n\nSecure file deletion after encryption\n\nA message in the form of a text file, in the form of HTML, or both\n\nMessage text and HTML code\n\nIf you have [large] volumes [of access logs and credentials], we can modify the\nsoftware to your needs.\n\nAgain, the ransomware representative encouraged interested parties to reach out to them via\nJabber.\n\nOn February 6th, of this year, Phobos team again posted outlining the newest update to\nPhobos, “version 2.9.” This update added a configuration file and the option for users to\nspecify exclusion files. The thread ends on February 11, 2020, when the representative\nagain works to defend Phobos from critics and reiterate that the developers are always\navailable through Jabber.\n\nThis is currently the latest version of this ransomware.\n\n\n-----\n\n_Image 2: Phobos team advertises the latest 2.9 version of the ransomware. The highlights_\n_include modular configuration as well as manual encryption folders of interest._\n\n**_Conclusion_**\n\nAs one can see from the forum threads, Phobos is continuously evolving to be more effective\nwhile simultaneously recruiting new users. From previous accounts of negotiations, many\nPhobos operators are unskilled or unprofessional, but that does not make the use of this\nransomware any less dangerous. As Phobos continues to evolve, there may be more\nupdates to come on the ransomware in the coming months and throughout the year.\n\n**Indicators of Compromise (IOCs) (MD5) [1]**\n\ne59ffeaf7acb0c326e452fa30bb71a36\n\neb5d46bf72a013bfc7c018169eb1739b\n\nfa4c9359487bbda57e0df32a40f14bcd\n\n[1] https://blog.malwarebytes.com/threat-spotlight/2020/01/threat-spotlight-phobosransomware-lives-up-to-its-name/\n\n_Bridgit graduated with her B.A. in Political Science and Russian and Eastern European_\n_Studies, with a minor in Spanish, in June of 2020. In the future, she hopes to earn a J.D. and_\n_a graduate degree in Political Science or Global Affairs. While working with Advanced_\n\n\n-----\n\n_Intelligence, LLC, her research has focussed on threat actors and the nexus between_\n_cybersecurity and humanitarianism._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-24 - Inside -Phobos- Ransomware- -Dharma- Past & Underground.pdf"
    ],
    "report_names": [
        "2020-04-24 - Inside -Phobos- Ransomware- -Dharma- Past & Underground.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535599,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1653773910,
    "ts_modification_date": 1653773910,
    "files": {
        "pdf": "https://archive.orkl.eu/dcabda3e664e50227cc9d695c56b4eccb3c75b4e.pdf",
        "text": "https://archive.orkl.eu/dcabda3e664e50227cc9d695c56b4eccb3c75b4e.txt",
        "img": "https://archive.orkl.eu/dcabda3e664e50227cc9d695c56b4eccb3c75b4e.jpg"
    }
}