{
    "id": "3ad54961-74bd-404a-8068-5a96615f9ddb",
    "created_at": "2023-01-12T15:01:02.122151Z",
    "updated_at": "2025-03-27T02:05:37.378194Z",
    "deleted_at": null,
    "sha1_hash": "b38bec8f5ffe0387017f85ce793a0d9859a9bd45",
    "title": "2021-03-29 - New ICS Threat Activity Group- STIBNITE",
    "authors": "",
    "file_creation_date": "2022-05-27T23:26:10Z",
    "file_modification_date": "2022-05-27T23:26:10Z",
    "file_size": 1418012,
    "plain_text": "# New ICS Threat Activity Group: STIBNITE\n\n**[dragos.com/blog/industry-news/new-ics-threat-activity-group-stibnite/](https://www.dragos.com/blog/industry-news/new-ics-threat-activity-group-stibnite/)**\n\nBlog Post\n\nBy Dragos, Inc.\n\n03.24.21\n\n\nMarch 24, 2021\n\n\n-----\n\nDragos first disclosed four new threat activity groups targeting ICS/OT last month in the ICS\nCybersecurity 2020 Year in Review report. In this blog post, we will provide more\ninformation on one of the new groups: STIBNITE. The fundamental assessment of threats\ntracked by Dragos is that they are explicitly attempting to gain access to ICS networks and\n_operations or are successful in achieving access, not simply trying to gain access to an_\nindustrial organization. To learn more about ICS threat activity groups and how they’re\n[created, we invite you to read our blog post “Uncovering ICS Threat Activity Groups.”](https://www.dragos.com/blog/industry-news/webinar-summary-uncovering-ics-threat-activity-groups/)\n\n**Activity Group: a set of intrusion events related with varying degrees of confidence**\n_by similarities in their features or processes used to answer analytic questions and_\n_develop broad mitigation strategies that achieve effects beyond the immediate threat._\n\n\n-----\n\n[Dragos ICS Cybersecurity 2020 Year In Review](https://www.dragos.com/year-in-review/)\n\n## STIBNITE Activity Group Overview\n\nThe STIBNITE Activity Group targeted wind generation and government entities in\nAzerbaijan. STIBNITE launched multiple intrusion operations against targets from late 2019\nthrough 2020. STIBNITE leverages spearphishing to drop a custom malware known as\n[PoetRAT. Dragos assesses with moderate confidence that the adversary performed](https://blog.talosintelligence.com/2020/04/poetrat-covid-19-lures.html)\nfocused intrusion and information gathering operations aligned with Stage 1 of the Industrial\nControl System (ICS) Cyber Kill Chain.\n\nSTIBNITE activity focuses on a region, the Caucasus, not typically observed in ICS\ntargeting. As stated in past Dragos reporting and public comments, critical infrastructure\nintrusions and ICS events can correlate to areas of latent or existing conflict. As a result,\nknown disruptive operations largely focus on existing conflict zones, such as Ukraine or the\nGulf region.\n\nSTIBNITE gains initial access via credential theft websites spoofing Azeri government\norganizations, and spearphishing campaigns using variants of malicious Microsoft Office\ndocuments.\n\n\n-----\n\nFigure 1: Diamond\n\nModel representation of STIBNITE\nThe group leverages customized malware, called PoetRAT, for information gathering\nactivities and post exploitation activity including listing files, taking screenshots, transferring\nfiles, and command execution. STIBNITE is known to use Dynamic Domain Name System\n(DDNS) and common ports for C2 traffic. Dragos also discovered that STIBNITE reused\ninfrastructure between its 2020 campaigns.\n\nSTIBNITE uses an executable package of a Python-based implementation of Mimikatz\n[(PypyKatz) and the open-source LaZagne credential collection project for credential](https://github.com/AlessandroZ/LaZagne)\nharvesting. The group also uses other open-source resources for web browser credential\ntheft and data encoding and decoding routines using the Affine substitution cipher.\nCredential harvesting tools could allow adversaries to propagate throughout the network. As\n[reported in the ICS Cybersecurity Year in Review, Dragos discovered that in 2020, 88](https://www.dragos.com/year-in-review/)\npercent of Dragos services engagements involved significant issues with network\nsegmentation.\n\nAt this time, the extent of the group’s ICS interest is limited to targeting wind generation in\nAzerbaijan. STIBNITE’s tools and targeting focus would enable transition from Stage 1\noperations to a Stage 2 intrusion given developed access and stolen information, such as\nuser credentials. Dragos tracks many threats earlier in the ICS Cyber Kill Chain because\nActivity Groups may cross over into the OT environment. It can take years for a Stage 1\ngroup to transition into OT access depending on its objectives and timeline.\n\n## Detecting and Mitigating STIBNITE Activity\n\n\n-----\n\nAlthough STIBNITE activity is currently focused on IT networks, information gathered –\nsuch as logon credentials and network information – can be used to facilitate follow-on ICS\nnetwork compromise. OT operators should look for PoetRAT activity in IT and OT\nenvironments through execution of Python and Lua.\n\nThe Dragos Platform incorporates multiple detections and analytics designed specifically to\ndetect credential reuse and malicious logon activity. Such tactics are deployed by multiple\nactivity groups tracked by Dragos, making coverage of such abuse vital for ICS network\nprotection. In the [ICS Cybersecurity 2020 Year in Review, Dragos found that 90 percent of](https://www.dragos.com/year-in-review/)\nits services customers lacked fundamental visibility into ICS environments. This means\nmost ICS asset owners and operators will be blind to threats and lack critical cybersecurity\ndata. Learn more about the value of asset visibility in building a comprehensive OT\n[cybersecurity program by downloading our OT asset visibility white paper.](https://www.dragos.com/resource/10-ways-asset-visibility-builds-the-foundation-for-ot-cybersecurity/)\n\n[Detections for all STIBNITE behaviors are available in the Dragos Platform.](http://www.dragos.com/platform)\n\n## ICS Considerations for the Future\n\nThe identified activity in Azerbaijan, while limited in scope at this time, emphasizes the\nproliferation of ICS targeting in combination with more traditional tensions. Azerbaijan\nremains at war with Armenia over the Nagorno-Karabakh region and continues to emerge\nas an alternative oil and gas provider to Europe. As interest in ICS-related cyber effects\ncontinues to increase, ICS-related intrusions such as those associated with STIBNITE will\nonly continue and grow.\n\nTo learn more about Dragos and our industrial cybersecurity products and services,\nvisit: [dragos.com/why-dragos.](http://dragos.com/why-dragos)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-29 - New ICS Threat Activity Group- STIBNITE.pdf"
    ],
    "report_names": [
        "2021-03-29 - New ICS Threat Activity Group- STIBNITE.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535662,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653693970,
    "ts_modification_date": 1653693970,
    "files": {
        "pdf": "https://archive.orkl.eu/b38bec8f5ffe0387017f85ce793a0d9859a9bd45.pdf",
        "text": "https://archive.orkl.eu/b38bec8f5ffe0387017f85ce793a0d9859a9bd45.txt",
        "img": "https://archive.orkl.eu/b38bec8f5ffe0387017f85ce793a0d9859a9bd45.jpg"
    }
}