{
    "id": "3ae8b8c2-ca1b-4933-ac0e-64b910e897fd",
    "created_at": "2023-01-12T14:59:29.159232Z",
    "updated_at": "2025-03-27T02:06:09.964093Z",
    "deleted_at": null,
    "sha1_hash": "0c77757bec218520c3aa612b200852a671705ace",
    "title": "2020-09-24 - Alert Number I-092420-PSA- Cyber Threats to Voting Processes Could Slow But Not Prevent Voting",
    "authors": "",
    "file_creation_date": "2022-05-28T00:38:18Z",
    "file_modification_date": "2022-05-28T00:38:18Z",
    "file_size": 118108,
    "plain_text": "# Cyber Threats to Voting Processes Could Slow But Not Prevent Voting\n\n**ic3.gov/media/2020/200924.aspx**\n\n## September 24, 2020 (2020-09-24T09:00:00-04:00)\n\nAlert Number\n\n## I-092420-PSA\n\nQuestions regarding this PSA should be directed to your local FBI Field Office.\n\nLocal Field Office Locations: [www.fbi.gov/contact-us/field-offices](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n\n_The FBI and CISA are issuing this PSA as a part of a series on threats to the 2020 election_\n_to enable the American public to be prepared, patient, and participating voters._\n\nThe Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security\nAgency (CISA) are issuing this announcement to inform the public that attempts by cyber\nactors to compromise election infrastructure could slow but not prevent voting. The FBI and\nCISA have not identified any incidents, to date, capable of preventing Americans from\nvoting or changing vote tallies for the 2020 Elections. Any attempts tracked by FBI and\nCISA have remained localized and were blocked, minimal, or easily mitigated.\n\nThe FBI and CISA have no reporting to suggest cyber activity has prevented a registered\nvoter from casting a ballot, compromised the integrity of any ballots cast, or affected the\naccuracy of voter registration information. However, even if actors did achieve such an\nimpact, the public should be aware that election officials have multiple safeguards and\nplans in place—such as provisional ballots to ensure registered voters can cast ballots,\npaper backups, and backup pollbooks—to limit the impact and recover from a cyber\nincident with minimal disruption to voting. The FBI and CISA continue to assess that\nattempts to manipulate votes at scale would be difficult to conduct undetected.\n\n\n-----\n\nNevertheless, cyber actors continue attempts against election systems that register voters\nor house voter registration information, manage non-voting election processes, or provide\nunofficial election night reporting. These attempts could render these systems temporarily\ninaccessible to election officials, which could slow, but would not prevent, voting or the\nreporting of results.\n\nThe FBI and CISA will continue to quickly respond to potential threats, provide\nrecommendations to harden election infrastructure, notify stakeholders of threats and\nintrusion activity, and impose risks and consequences on cyber actors seeking to threaten\nUS elections.\n\nRecommendations\n\nSeek out information from trustworthy sources.\nAlways consider the source of voting information. Ask yourself, “Can I trust this\ninformation?”\nSeek out election information from trustworthy sources, verify who produced the\ncontent, and consider their intent. Remain alert to these and other schemes which\nmay impact normal business practices.\nFor information about registering to vote, polling locations, voting by mail, provisional\nballot process, and final election results, rely on state and local government election\nofficials.\nVerify through multiple, reliable sources any reports about compromises of voter\ninformation or voting systems, and consider searching for other reliable sources\nbefore sharing such information via social media or other avenues.\nReport potential crimes—such as cyber targeting of voting systems—to the FBI.\n\n**The FBI is responsible for investigating and prosecuting election crimes, malign**\n**foreign influence operations and malicious cyber activity targeting election**\n**infrastructure and other U.S. democratic institutions. CISA helps critical infrastructure**\nowners and operators, including those in the election community, remain resilient against\nphysical and cyber threats. The FBI and CISA provide services and information to uphold\nthe security, integrity, and resiliency of the U.S. electoral processes.\n\nVictim Reporting and Additional Information\n\nThe FBI and CISA encourages the public to report information concerning suspicious or\n[criminal activity to their local FBI field office (www.fbi.gov/contact-us/field-offices) or to the](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n[FBI’s Internet Crime Complaint Center (www.ic3.gov). For additional assistance, best](https://www.ic3.gov/)\npractices, and common terms, please visit the following websites:\n\nProtected Voices: www.fbi.gov/investigate/counterintelligence/foreigninfluence/protected-voices\nElection Crimes and Security: www.fbi.gov/scams-and-safety/common-scams-andcrimes/election-crimes-and-security\n[#Protect2020: www cisa gov/protect2020](https://www.ic3.gov/Home/Egress?url=https://www.cisa.gov/protect2020)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-24 - Alert Number I-092420-PSA- Cyber Threats to Voting Processes Could Slow But Not Prevent Voting.pdf"
    ],
    "report_names": [
        "2020-09-24 - Alert Number I-092420-PSA- Cyber Threats to Voting Processes Could Slow But Not Prevent Voting.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535569,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653698298,
    "ts_modification_date": 1653698298,
    "files": {
        "pdf": "https://archive.orkl.eu/0c77757bec218520c3aa612b200852a671705ace.pdf",
        "text": "https://archive.orkl.eu/0c77757bec218520c3aa612b200852a671705ace.txt",
        "img": "https://archive.orkl.eu/0c77757bec218520c3aa612b200852a671705ace.jpg"
    }
}