{
    "id": "3afb71c8-2cb9-43de-9cec-814df4ee55e5",
    "created_at": "2023-01-12T15:08:13.325159Z",
    "updated_at": "2025-03-27T02:09:24.521059Z",
    "deleted_at": null,
    "sha1_hash": "a3f0b9464af349a1da26e73dde1d456a55298348",
    "title": "2020-01-10 - Threat spotlight- Phobos ransomware lives up to its name",
    "authors": "",
    "file_creation_date": "2022-05-29T00:58:57Z",
    "file_modification_date": "2022-05-29T00:58:57Z",
    "file_size": 487267,
    "plain_text": "# Threat spotlight: Phobos ransomware lives up to its name\n\n**[blog.malwarebytes.com/threat-spotlight/2020/01/threat-spotlight-phobos-ransomware-lives-up-to-its-name/](https://blog.malwarebytes.com/threat-spotlight/2020/01/threat-spotlight-phobos-ransomware-lives-up-to-its-name/)**\n\nJovi Umawing January 10, 2020\n\nRansomware has struck dead on organizations since it became a mainstream tool in\n[cybercriminals’ belts years ago. From massive WannaCry outbreaks in 2017 to industry-](https://blog.malwarebytes.com/threat-analysis/malware-threat-analysis/2017/07/all-this-eternalpetya-stuff-makes-me-wannacry/)\nfocused attacks by [Ryuk in 2019, ransomware’s got its hooks in global businesses and](https://blog.malwarebytes.com/threat-spotlight/2019/12/threat-spotlight-the-curious-case-of-ryuk-ransomware/)\nshows no signs of stopping. That includes a malware family known as Phobos ransomware,\nnamed after the Greek god of fear.\n\n[Phobos is another one of those ransomware families that primarily targets organizations by](https://www.malwarebytes.com/ransomware)\nemploying tried-and-tested tactics to infiltrate systems. While this ransomware may have\nbeen coined with different aliases, many consider it an off-shoot or variant—if not a rip-off—\nof the Dharma ransomware family, [which is also called CrySis. This is attributed to Phobos’](https://blog.malwarebytes.com/threat-analysis/2019/05/threat-spotlight-crysis-aka-dharma-ransomware-causing-a-crisis-for-businesses/)\noperational and technical likeness to recent Dharma strains.\n\n[Phobos ransomware, like Sodinokibi, is sold in the underground in ransomware-as-a-service](https://blog.malwarebytes.com/threat-spotlight/2019/07/threat-spotlight-sodinokibi-ransomware-attempts-to-fill-gandcrab-void/)\n(RaaS) packages. This means that criminals with little to no technical know-how can create\ntheir own ransomware strain with the help of a kit, and organize a campaign against their\ndesired targets.\n\n[However, Coveware researchers have noted that, compared to their peers, Phobos](https://www.coveware.com/blog/2019/7/15/ransomware-amounts-rise-3x-in-q2-as-ryuk-amp-sodinokibi-spread)\noperators are “less organized and professional,” which has eventually led to extended\nransom negotiations and more complications retrieving files and systems for Phobos\nransomware victims during the decryption process.\n\n## Phobos ransomware infection vectors\n\nPhobos can arrive on systems in several ways: via open or insecure remote desktop protocol\n[(RDP) connections on port 3389, brute-forced RDP credentials, the use of stolen and bought](https://blog.malwarebytes.com/glossary/brute-force-attack/)\n[RDP credentials, and old-fashion phishing. Phobos operators can also leverage malicious](https://blog.malwarebytes.com/glossary/phishing/)\nattachments, downloads, patch exploits, and software vulnerabilities to gain access to an\norganization’s endpoints and network.\n\nPhobos ransomware primarily targets businesses; however, there have been several reports\nof consumers finding themselves face-to-face with this adversary, too.\n\n## Symptoms of Phobos ransomware infection\n\n\n-----\n\nSystems affected by variants of the Phobos ransomware display the following symptoms:\n\n**Presence of ransom notes. Upon infection, Phobos drops two ransom notes in text (.TXT)**\nand in executable web file (.HTA) format. The latter automatically opens after Phobos\nfinishes encrypting files.\n\nThe\n\n[HTA ransom note, which was noted to be a re-branded version of Dharma’s ransom note](https://www.coveware.com/blog/phobos-ransomware-distributed-dharma-crew)\nHere’s a snippet of the note:\n\n\n-----\n\nAll your files have been encrypted due to a security problem with your PC. If you want\nto restore them, write us to the e-mail [email address 1]\n\nWrite this ID in the title of your message [generated ID]\n\nIf there is no response from our mail, you can install the Jabber client and write to us in\nsupport of [email address 2]\n\nYou have to pay for decryption in Bitcoins. The price depends on how fast you write to\nus. After payment we will send you the decryption tool that will decrypt all your files.\n\nAs you can see, Phobos operators are requiring victims to contact them in the event of their\nransomware infection.\n\nIn some notes from other variants, instructions to reach threat actors via Jabber are not\nincluded.\n\nAside from pertinent channels victims can reach the threat actors, this ransom note also\ncontains information on how they can acquire Bitcoins and how to install the messenger\nclient.\n\nThe\n\nTXT ransom note, which is notably shorter than its HTA counterpart. This means that nontech savvy victims would have to resort to doing their own research to understand unfamiliar\nterms. Note that while this contains the email addresses also found in the HTA file, it doesn’t\ncontain the generated ID.\n\n!!! All of your files are encrypted !!!\n\nTo decrypt them send e-mail, to this address: [email address 1]\n\nIf there is no response from our mail, you can install the Jabber client and write to us in\nsupport of [email address 2]\n\nAfter triggering the opening of the HTA ransom note, which supposedly signifies the end of\n[Phobos’ encryption, we have observed that it is an aggressive ransomware that continues to](https://blog.malwarebytes.com/threat-analysis/2019/07/a-deep-dive-into-phobos-ransomware/)\nrun in the background and encode new files it is programmed to encrypt. It can do this with\nor without an Internet connection.\n\n**Encrypted files with a long, appended string after the extension name. Phobos encrypts**\ntarget files using AES-256 with RSA-1024 asymmetric encryption. Both Phobos and Dharma\nimplement the same RSA algorithm; however, Phobos uses it from Windows Crypto API\n\n\n-----\n\nwhile Dharma uses it from a third-party static library. Upon encryption, it appends a\ncompound extension name at the end of encrypted files. This implements the format or\nformula:\n```\n.ID[ID][email address 1].[added extension]\n\n```\nIn the formula, [ID] is the generated ID number specified in the ransom note. It is a two-part\nalpha-numeric string: the victim ID and the version ID, separated by a dash. [email address\n**1] is the email address victims are prescribed to use in reaching out to the threat actors. This**\nis also specified in the ransom note. Lastly, [added extension] is an extension that Phobos\nthreat actors decide to associate their ransomware with. Below are known extensions\nPhobos uses:\n\n1500dollars\nactin\nActon\nactor\nAcuff\nAcuna\nacute\nadage\nAdair\nAdame\nbanhu\nbanjo\nBanks\nBanta\nBarak\nbbc\nblend\nBORISHORSE\nbqux\nCaleb\nCales\nCaley\ncalix\nCalle\nCalum\nCalvo\nCAPITAL\ncom\nDDoS\ndeal\n\n\n-----\n\ndeuce\nDever\ndevil\nDevoe\nDevon\nDevos\ndewar\neight\neject\neking\nElbie\nelbow\nelder\nFrendi\nhelp\nKARLOS\nkarma\nmamba\nphobos\nphoenix\nPLUT\nWALLET\nzax\n\nFor example, the new file name of sample.bmp after encryption is sample.bmp.id[23043C5D_2394].[agagekeys@qq.com].Caleb._\n\nPhobos encrypts files with the following extensions:\n\n\n-----\n\nHowever, it skips encoding the following OS files and files in the C:\\Windows folder:\n\nboot.ini\nbootfont.bin\nntldr\nntdetect.com\nio.sys\n\nPhobos fully encodes files with sizes that can be classed as typical. For large files, however,\nit performs a different algorithm wherein it partially encrypts selected portions of such files.\nThis is an effective method to severely cut down the time it takes to encrypt large files and, at\nthe same time, maximize the damage it could do to such a file if something goes wrong with\nits decryption.\n\nThis ransomware attacks files in all local drives as well as network shares.\n\n**Terminated processes. Phobos ransomware is known to terminate the following active**\nprocesses on affected systems so that no programs can stop it from accessing files to\neventually encrypt:\n\n\n-----\n\n**Deleted shadow copies and local backups. Like Sodinokibi and other ransomware**\nfamilies, Phobos deletes shadow copies and backup copies of files to prevent users from\nrestoring encrypted files, thus, forcing them to do the threat actors’ bidding.\n\n**Systems not booting in recovery mode. Recovery mode is innate in Windows systems. If**\nusers encounter a technical flaw leading to the system crashing or getting corrupted, they\nhave the option to restore the OS to its normal state by reloading its last known state before\nthe flaw. Phobos removes this option by preventing users from entering this mode.\n\n**Disabled firewall. As we already know, malware that firewalls stop could be allowed into the**\naffected system.\n\n## Protect your system from Phobos ransomware\n\n[Malwarebytes’ signature-less detection, coupled with real-time anti-malware and anti-](https://www.malwarebytes.com/business/endpointprotectionandresponse/)\nransomware technology, identifies and protects consumer and business users from Phobos\nransomware in various stages of attack.\n\n\n-----\n\nWe recommend both consumers and IT administrators take the following actions to secure\nand mitigate against Phobos ransomware attacks:\n\nSet your RDP server, which is built in in the Windows OS, to deny public IPs access to\nTCP port 3389, the default port Windows Remote Desktop listens on. If you or your\norganizations have no need for RDP, better to disable the service altogether. Critical\nsystems or systems with sensitive information should not have RDP enabled.\nAlong with RDP port blocking, we also suggest the blocking of TCP port 445, the\n[default port a Server Message Block (SMB) uses to communicate in a Windows-based](https://blog.malwarebytes.com/glossary/server-message-block-smb/)\n[LAN at the network perimeter. Note that you or your organization may have to do in-](https://blog.malwarebytes.com/glossary/local-area-network/)\ndepth testing to see how your system and/or programs are impacted by this block. As a\nrule of thumb, block all unused ports.\nAllow RDP access to IPs that are under you or your organization’s control.\nEnable the logging of RDP access attempts and review them regularly to detect\ninstances of potential intrusion.\nEnforce the use of [strong passwords and account lockout policies for Active Directory](https://blog.malwarebytes.com/cybercrime/2019/03/hackers-gonna-hack-anymore-not-keep-reusing-passwords/)\ndomains and local Windows accounts.\nEnforce [multi-factor authentication (MFA) to RDP and local account logons whenever](https://blog.malwarebytes.com/glossary/multi-factor-authentication-mfa/)\npossible.\nEnforce the use of a [virtual private networks (VPNs) if your organization allows](https://blog.malwarebytes.com/glossary/vpn/)\nemployees to work remotely.\n[Come up with and implement a sound backup strategy.](https://blog.malwarebytes.com/101/2017/04/3-2-1-go-make-backups-of-your-data/)\n\n\n-----\n\nMaintain an inventory of running services and applications on your system, and review\nit regularly. For critical systems, it’s best to have an active monitoring and alerting\nscheme in place.\nHave a disaster recovery scheme in place in case of a successful breach via RDP\nhappens.\n[Keep all your software, including OS and anti-malware, up-to-date.](http://www.malwarebytes.com/business)\n\nOn a final note, if you have all your personal or organization resources properly locked down\nand secured, and you or your organization adhere to good cyber hygiene practices, there is\nlittle to be feared about Phobos or any ransomware in general.\n\n## Indicators of Compromise (IOCs)\n\ne59ffeaf7acb0c326e452fa30bb71a36\neb5d46bf72a013bfc7c018169eb1739b\nfa4c9359487bbda57e0df32a40f14bcd\n\nHave a threat-free 2020, everyone!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-10 - Threat spotlight- Phobos ransomware lives up to its name.pdf"
    ],
    "report_names": [
        "2020-01-10 - Threat spotlight- Phobos ransomware lives up to its name.pdf"
    ],
    "threat_actors": [
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536093,
    "ts_updated_at": 1743041364,
    "ts_creation_date": 1653785937,
    "ts_modification_date": 1653785937,
    "files": {
        "pdf": "https://archive.orkl.eu/a3f0b9464af349a1da26e73dde1d456a55298348.pdf",
        "text": "https://archive.orkl.eu/a3f0b9464af349a1da26e73dde1d456a55298348.txt",
        "img": "https://archive.orkl.eu/a3f0b9464af349a1da26e73dde1d456a55298348.jpg"
    }
}