{
    "id": "3b1ba384-73e7-4f23-a15d-ef1f8be4f614",
    "created_at": "2023-01-12T15:08:51.026535Z",
    "updated_at": "2025-03-27T02:06:03.446764Z",
    "deleted_at": null,
    "sha1_hash": "896443befdbe00622049a1c20d66bd721aa167e6",
    "title": "2021-03-24 - Purple Fox Rootkit Now Propagates as a Worm",
    "authors": "",
    "file_creation_date": "2022-05-28T19:24:51Z",
    "file_modification_date": "2022-05-28T19:24:51Z",
    "file_size": 693036,
    "plain_text": "# Purple Fox Rootkit Now Propagates as a Worm\n\n**[guardicore.com/labs/purple-fox-rootkit-now-propagates-as-a-worm/](https://www.guardicore.com/labs/purple-fox-rootkit-now-propagates-as-a-worm/)**\n\n## Executive Summary\n\nPurple Fox is an active malware campaign targeting Windows machines.\nUp until recently, Purple Fox’s operators infected machines by using exploit kits and\nphishing emails.\nGuardicore Labs have identified a new infection vector of this malware where\ninternet-facing Windows machines are being breached through SMB password brute\nforce.\nGuardicore Labs have also identified Purple Fox’s vast network of compromised\nservers hosting its dropper and payloads. These servers appear to be compromised\nMicrosoft IIS 7.5 servers.\nThe Purple Fox malware includes a rootkit which allows the threat actors to hide the\nmalware on the machine and make it difficult to detect and remove.\n\n\n-----\n\n### Introduction\n\nDuring the last few weeks, the Guardicore Labs team have been tracking a new campaign\ndistributing the Purple Fox malware. Purple Fox was discovered in March of 2018 and was\ncovered as an exploit kit targeting Internet Explorer and Windows machines with various\nprivilege escalation exploits.\n\nHowever, throughout the end of 2020 and the beginning of 2021, Guardicore Global Sensors\nNetwork (GGSN) detected Purple Fox’s novel spreading technique via indiscriminate port\nscanning and exploitation of exposed SMB services with weak passwords and hashes.\n\nBy leveraging the capabilities of GGSN, we were able to track the spread of Purple Fox. As\ncan be seen in the above graph, May of 2020 brought a significant amount of malicious\nactivity and the number of infections that we have observed has risen by roughly 600% and\namounted to a total of 90,000 attacks as of writing this paper.\n\nWhile it appears that the functionality of Purple Fox hasn’t changed much post exploitation,\nits spreading and distribution methods – and its worm-like behavior – are much different than\ndescribed in previously published articles. Throughout our research, we have observed an\ninfrastructure that appears to be made out of a hodge-podge of vulnerable and exploited\nservers hosting the initial payload of the malware, infected machines which are serving as\n\n\n-----\n\nnodes of those constantly worming campaigns, and server infrastructure that appears to be\nrelated to other malware campaigns.\nIn this blog post we will detail our findings about the new worm activity and share IOCs.\n\n### Attack Analysis\n\nThe attackers are hosting various MSI packages on nearly 2,000 servers (see IOCs section),\nwhich to our assessment are compromised machines which were repurposed to host\nmalicious payloads. Our assumption is based on scanning multiple servers, looking at the\nservices that are hosted on them from the perspective of operating system versions, and\nserver versions.\n\nWe have established that the vast majority of the servers, which are serving the initial\npayload, are running on relatively old versions of Windows Server running IIS version 7.5\nand Microsoft FTP, which are known to have multiple vulnerabilities with varying severity\nlevels.\n\nAccording to our findings, there are several ways for this campaign to start spreading:\n\n1. The worm payload is being executed after a victim machine is compromised through a\n\nvulnerable exposed service (such as SMB).\n2. The worm payload is being sent via email through a phishing campaign (which could tie\n\nthe previously published findings about Purple Fox) which exploits a browser\nvulnerability. We have identified multiple samples that were submitted to VirusTotal\nthrough email scanners.\n\n\n-----\n\nOnce code execution is achieved on the victim machine, a new service whose name\nmatches the regex AC0[0-9]{1} — e.g. AC01, AC02, AC05, etc. will be created, the purpose\nof this service would be to establish persistence and to execute a simple command with a\n‘for loop’, the purpose of this command would be to iterate through a number of URLs which\ncontain the MSI that installs Purple Fox on the machine.\n\n\n-----\n\nAs can be seen in the screenshot from the Guardicore Centra platform, msiexec will be\nexecuted with the /i flag, in order to download and install the malicious MSI package from\none of the hosts in the statement. It will also be executed with the /Q flag for “quiet”\nexecution, meaning, no user interaction will be required.\n\nOnce the package is executed, the MSI installer will launch.\n\nFor analysis purposes,We have executed the MSI installer without the /Q flag (As if it’s being\nexecuted directly from an email attachment), the installer will present the following window:\n\nThe installer pretends to be a Windows Update package along with Chinese text which\nroughly translates to “Windows Update” and random letters. These letters are randomly\ngenerated between each different MSI installer to create a different hash and make it a bit\ndifficult to tie between different versions of the same MSI. This is a “cheap” and simple way\nof evading various detection methods such as static signatures. Additionally, we have\nidentified MSI packages with the same strings but with random null bytes appended to them\nin order to create different hashes of the same file.\n\n\n-----\n\nWe were, however, able to find many different versions of the same MSI and its payloads, as\ncan be seen in the following screenshot from VT graph.\n\n\n-----\n\nAs the installation progresses, the installer will extract the payloads and decrypt them from\nwithin the MSI package. The MSI package contains three files:\n\n1. A 64bit DLL payload (winupdate64).\n2. A 32bit DLL payload (winupdate32).\n3. An encrypted file containing a rootkit.\n\nAs a part of the installation process, the malware modifies the windows firewall by executing\nmultiple netsh commands. The malware adds a new policy named Qianye to the windows\nfirewall. Under this policy, it creates a new filter called Filter1 and under this filter, it prohibits\nports 445, 139, 135 on both TCP and UDP from any IP address on the internet (0.0.0.0) to\nconnect to the infected machine, we believe that the attackers are doing it in order to prevent\nthe infected machine from being reinfected, and/or to be exploited by a different threat actor.\n\nOnce the aforementioned files are being extracted, they will be executed.\n\nThis can be seen as the malware is executing the following commands:\n```\nnetsh.exe ipsec static add policy name=qianye\nnetsh.exe ipsec static add filterlist name=Filter1\nnetsh.exe ipsec static add filter filterlist=Filter1 srcaddr=any dstaddr=Me\ndstport=135 protocol=TCP\nnetsh.exe ipsec static add filter filterlist=Filter1 srcaddr=any dstaddr=Me\ndstport=139 protocol=TCP\nnetsh.exe ipsec static add filter filterlist=Filter1 srcaddr=any dstaddr=Me\ndstport=445 protocol=UDP\nnetsh.exe ipsec static add filter filterlist=Filter1 srcaddr=any dstaddr=Me\ndstport=135 protocol=UDP\nnetsh.exe ipsec static add filter filterlist=Filter1 srcaddr=any dstaddr=Me\ndstport=139 protocol=UDP\nnetsh.exe ipsec static set policy name=qianye assign=y\nnetsh.exe ipsec static add rule name=Rule1 policy=qianye filterlist=Filter1\nfilteraction=FilteraAtion1\nnetsh.exe ipsec static add rule name=Rule1 policy=qianye filterlist=Filter1 netsh.exe\nipsec static add filteraction name=FilteraAtion1 action=block\n\n```\nAdditionally, the malware will install an IPv6 interface on the machine by executing the\ncommand:\n```\nnetsh.exe interface ipv6 install\n\n```\n\n-----\n\nThis action is taken in order to allow the malware to port scan ipv6 addresses as well to\nmaximize the efficiency of the spread over (usually unmonitored) ipv6 subnets.\n\n**Important note:**\n\n_These commands can be used as Indicators of Behavior (IoBs) in order to check if your_\n_environment is compromised._\n\nAdditionally, These netsh commands have also appeared in previous campaigns and are not\nexclusive to this iteration of Purple Fox. These commands, specifically with the Qianye policy\n[name have been documented as a part of Rig EK and NuggetPhantom.](https://isc.sans.edu/forums/diary/Rig+Exploit+Kit+Delivering+VBScript/25318/)\n\nThe last step of Purple Fox’s deployment before restarting the machine is to load the rootkit\nthat’s hidden inside the encrypted payload in the MSI package.\n\n[According to our analysis, the rootkit is based on the hidden open source rootkit project.](https://github.com/JKornev/hidden/)\n\nThe purpose of this rootkit is to hide various registry keys and values, files, etc., as detailed\nby its author on the git repository. Ironically enough, the hidden rootkit was developed by a\nsecurity researcher in order to conduct various malware analysis tasks and to keep all of\nthese research tasks hidden from the malware.\n\n\n-----\n\n[This rootkit and its relationship with Purple Fox was detailed in this article by 360 Security.](https://blog.360totalsecurity.com/en/purple-fox-trojan-burst-out-globally-and-infected-more-than-30000-users/)\n\nOnce the rootkit is loaded, the installer will reboot the machine in order to rename the\nmalware DLL into a system DLL file that will be executed on boot. Since we executed the\nmalware in our lab without the /Q flag, we were presented with the following window which\nasks us to restart the machine:\n\nOnce the machine is restarted, the malware will be executed as well. After it’s execution, the\nmalware will start its propagation process: the malware will generate IP ranges and start\nscanning them on port 445.\n\nAs the machine responds to the SMB probe that’s being sent on port 445, it will try to\nauthenticate to SMB by brute forcing usernames and passwords or by trying to establish a\nnull session.\n\n\n-----\n\nIf the authentication is successful, the malware will create a service whose name matches\nthe regex AC0[0-9]{1} — e.g. AC01, AC02, AC05 (as mentioned before) that will download\nthe MSI installation package from one of the many HTTP servers and thus will complete the\ninfection loop.\n\n### Indicators of Compromise\n\n[IOCs are available in our IOC github repository](https://github.com/guardicore/labs_campaigns/tree/master/Purple_Fox)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-24 - Purple Fox Rootkit Now Propagates as a Worm.pdf"
    ],
    "report_names": [
        "2021-03-24 - Purple Fox Rootkit Now Propagates as a Worm.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536131,
    "ts_updated_at": 1743041163,
    "ts_creation_date": 1653765891,
    "ts_modification_date": 1653765891,
    "files": {
        "pdf": "https://archive.orkl.eu/896443befdbe00622049a1c20d66bd721aa167e6.pdf",
        "text": "https://archive.orkl.eu/896443befdbe00622049a1c20d66bd721aa167e6.txt",
        "img": "https://archive.orkl.eu/896443befdbe00622049a1c20d66bd721aa167e6.jpg"
    }
}