{
    "id": "3b4520e5-4bbf-4fbc-bcb9-98474f80dd4e",
    "created_at": "2023-01-12T15:04:28.581515Z",
    "updated_at": "2025-03-27T02:11:47.829338Z",
    "deleted_at": null,
    "sha1_hash": "13e16de783d46ee7600e3418585d3cf09f61611b",
    "title": "2017-07-03 - NotPetya Technical Analysis Part II- Further Findings and Potential for MBR Recovery",
    "authors": "",
    "file_creation_date": "2022-05-28T02:48:45Z",
    "file_modification_date": "2022-05-28T02:48:45Z",
    "file_size": 2501289,
    "plain_text": "# NotPetya Technical Analysis Part II: Further Findings\n\n**[crowdstrike.com/blog/petrwrap-technical-analysis-part-2-further-findings-and-potential-for-mbr-recovery/](https://www.crowdstrike.com/blog/petrwrap-technical-analysis-part-2-further-findings-and-potential-for-mbr-recovery/)**\n\nShaun Hurley and Karan Sood July 3, 2017\n\n## Update:\n\nDue to naming convention consistency in the industry, CrowdStrike is now calling this variant\nof Petya – NotPetya.\n\n## Executive Summary\n\nThis technical analysis is a continuation of the previous technical blog (NotPetya Technical\nAnalysis – A Triple Threat: File Encryption, MFT Encryption, Credential Theft) describing the\nthreat of NotPetya, a destructive malware with self-propagation capabilities. After further\nanalysis, CrowdStrike researchers discovered:\n\nHow the NotPetya DLL loads functions to ensure proper cleanup from the victim\nmachine\nThe order in which the infection process takes place\nPotential for recovery of the victim machine’s MBR and boot manager when running\none specific antivirus software\n\n## NotPetya DLL Loader\n\n\n-----\n\nThe NotPetya DLL, seen in the wild with the filename perfc.dat, takes the following steps\nduring the DLL loading process to ensure that there is no trace of the NotPetya DLL\n(perfc.dll) having being on the system:\n\nCopies file contents from disk into a buffer residing in process memory\nChecks to determine if the DLL has already been loaded\nCopies the NotPetya DLL already mapped into process memory to another buffer\nCalculates and patches the relative offsets in the NotPetya copy with a new offset\nThe new relative offset is calculated by subtracting the base address original NotPetya\nDLL from the RVAs identified in the relocation table of the NotPetya copy\nCalls the function at offset +0x94A5 located in the NotPetya copy\n\nCalls FreeLibrary to unmap the original NotPetya DLL from process memory\nOverwrites the original DLL file with null bytes\nDeletes the original NotPetya DLL from the file system\nFixes the import table of the NotPetya DLL copy\nCalls the perfc_1 (export ordinal 1) function to kick off the worm activity and\nfile/MFT encryption\n\nThe file cleanup combined with the file and MFT encryption process make it difficult to\nrecover the original NotPetya DLL.\n\n## SMB Exploitation and Infection\n\nThe EternalBlue and EternalRomance exploits are used for the MS17-010 vulnerability, and\nare subsequently used to propagate NotPetya to vulnerable hosts on the local subnet. The\ninfection process occurs in the following order:\n\n1. Test for vulnerable condition\n2. Check Windows version\n[3. Trigger MS17-010 vulnerability. For more information, please click here.](https://technet.microsoft.com/en-us/library/security/ms17-010.aspx)\n4. Deploy an SMB backdoor\n5. NotPetya infection\n\n### Test for Vulnerable Condition\n\nAs can be seen in the control flow graph, core_MS17_010 is initially called to determine if the\nexploit condition exists. If it does, core_MS17_010 is called again with slightly different\narguments to exploit the vulnerability and send the shellcode.\n\n\n-----\n\nThe following is an image and explanation of the SMB network traffic used to determine if the\nvictim is vulnerable (Victim: 172.16.1.132):\n\n1. An initial SMB_COM_NEGOTIATE request and response\n2. Session setup\n3. Tree connect\n4. PeekNamedPipe SMB transaction with FID: 0x0000\n\n1. Exploitable condition:\n\n1. Trans response, error: STATUS_INSUFF_SERVER_RESOURCES\n2. Error code: 0xC0000205\n3. Server is out of resources\n5. Close session: Tree disconnect and AndX logoff\n\nA check is then done to determine if the victim’s response is\nSTATUS_INSUFF_SERVER_RESOURCES (0xC0000205). An example of this is shown\nbelow:\n\n\n-----\n\nIf the error code does not exist, the session is cleaned up and NotPetya iterates to the next\nIP address. If the error code exists, the core_MS17_010 returns 0, and the vulnerability is\nexploited.\n\n### Check Windows Version\n\nPrior to executing the exploit code, a test ensues to determine which version of Microsoft\nWindows is running on the system. This is done by parsing the “Session Setup AndX\nResponse” packet. Once the version of the OS is identified it is mapped to a numeric value:\n\n2 – Windows XP\n3 – Windows XP Pro x64, Windows 2003, Windows 2003 R2\n4 – Windows Vista\n5 – Windows 7\n6 – Windows 2008\n7 – Windows 2008 R2\n\nNotPetya will only exploit one of the Windows versions listed above. If the version does not\nmatch one of the identified Windows versions, then the function to execute the exploit code\nreturns without executing.\n\nThe EternalBlue exploit is launched against only the following Windows versions:\n\nWindows 7\nWindows 2008\nWindows 2008 R2\n\nThe EternalRomance exploit is launched against only the following Windows versions:\n\nWindows XP\nXP Pro x64\nWindows Server 2003\nWindows Server 2003 R2\nVista\n\n\n-----\n\nThe EternalRomance code path begins at 0x10005C4C.\n\n### Trigger MS17-010 (EternalBlue)\n\nThe following image and explanation refers to the SMB network traffic that starts the\nexploitation process:\n\n1. An initial SMB_COM_NEGOTIATE request and response\n2. Session setup\n3. Tree connect\n4. PeekNamedPipe SMB transaction with FID: 0x0000\n\n1. Exploitable condition:\n\n1. Trans response, error: STATUS_INSUFF_SERVER_RESOURCES\n2. Error code: 0xC0000205\n3. Server is out of resources\n5. NT trans request\n\n1. Followed by Trans2 secondary request, FID: 0x0000\n\nThis exploitation process is followed by a series of additional SMB packets. There are three\ntypes of packets that are identified based on size:\n\nTYPE 0:\n\nTCP segment data size: 132 bytes\nThe first 10 bytes of the TCP segment data contain:\n\n0x0 – Null byte\n0x2 – 0xFFF7\n0x4 – 2 byte value based on a timing check\n0x6 – 2 byte value based on another timing check\nThe rest of the packet contains null bytes\nTYPE 1:\n\nTCP segment data size: 2920 bytes\nThis packet sends the kernel shellcode\nThis packet is sent with the same data 13 times\n\nThis first burst of requests are TYPE 0 packets.\n\n\n-----\n\nTo trigger the exploit, a 4207-byte SMB Trans2 Secondary Request, FID: 0x0000 packet is\nsent to the vulnerable machine, as depicted below. This packet is built and sent in function\nsub_10003C0A.\n\nThe exploit code is contained within the 4096 byte “Extra byte parameters” section of the\nTrans2 packet. This 4096 buffer is filled with hex byte ‘\\x54’ (‘T’). At offset 0xB within that\nbuffer, the hex byte ‘\\x51’ is used to specify the start of the data that will trigger the overflow\non the vulnerable machine.\n\nThe specific code to trigger the overflow is the 175-byte chunk of binary data within the\nNotPetya binary, starting at address 0x10010B08. The code is not encoded.\n\n**Sending the Ring 0 Shellcode**\n\nOnce the vulnerability has been exploited, the Ring 0 shellcode is sent using TYPE 1\npackets.\n\nThe ring 0 shellcode, which contains the SMB backdoor code, is the 2423 byte chunk for\nbinary data starting at address 0x1000123B0 within the NotPetya binary. The ring 0\nshellcode is encoded with a simple byte xor. The xor key is 0xCC. The shellcode starts at\noffset 0x1F1 within the TCP segment data.\n\n### Deploy SMB Backdoor\n\nThe backdoor that gets deployed onto an exploited system appears to be a modified version\n(based on network traffic) of the DoublePulsar rootkit leaked by the Shadow Brokers actors.\n\n### Network Traffic\n\nIf there is a DoublePulsar knock feature, it is not used. Once the SMB backdoor is in place,\nthe ‘Reserved’ field of the SMB Header for the response packet is set to 0x1100, as seen\nbelow. Normally this field is NULL.\n\n\n-----\n\nPrior to triggering the code to exploit the system, the “Reserved” field in the SMB header is\nchecked to see if it is set to 0x11.\n\nIf the “Reserved” field in the SMB header is set to 0x11, the staging code is built and sent to\nthe targeted machine.\n\n“Trans2 Request, SESSION_SETUP” packets are used to send the staging DLL to the\ntarget.\n\n### NotPetya Infection\n\nTo deploy NotPetya onto the system, a staging DLL is injected into “lsass.exe.” Once the\nDLL is injected into lsass, NotPetya is written to the system in c:\\windows:\n\n\n-----\n\nThe NotPetya DLL keeps the same filename the file was called when executed on the\nattacking machine (in this case, olga.dll). Once the file is written, it can be launched.\n\nThe staging DLL executes the file in the same way as psexec and wmic: rundll32.exe. As\ncan be seen below, the same arguments are passed to the NotPetya DLL.\n\n## MBR Restoration for Machines running Kaspersky Antivirus\n\nThrough analysis, it was discovered that if the victim machine has avp.exe (associated with\nKaspersky antivirus) process running, NotPetya will NOT encrypt the MFT. Victim machines\nthat have avp.exe running when impacted by NotPetya will simply have the the first 10\nsectors of the physical disk overwritten with uninitialized data. For victim machines that do\nnot have avp.exe running, NotPetya will overwrite the MBR with a custom boot loader, which\nwill then load 16-bit code responsible for encrypting the MFT.\n\n\n-----\n\nThe following displays before and after images of the MBR on a machine with avp.exe\nrunning. Notice the lack of the footer (0x55, 0xAA) in the MBR after the modification.\n\nAdditionally, analysis also shows that the NotPetya malware overwrites the 2nd sector of the\nC:\\ volume with uninitialized data as well. This sector contains the Boot Manager, which is\nloaded by the VBR (Volume Boot Record) and is needed for booting up the system.\nOverwriting this sector renders the machine unbootable. It should be noted that this change\noccurs regardless of whether the victim machine has avp.exe process running on the system\nor not. The following are the before and after images of the 2nd sector:\n\n\n-----\n\nIf the avp.exe process exists on the system, upon reboot, the victim is prompted with an error\nmessage that an operating system cannot be found:\n\n## Steps to Recover MBR\n\nAnalysis has confirmed that in the case of the presence of avp.exe process, the MBR is\nactually recoverable via the Windows repair tools. For Windows 7 and higher, the following\nsteps can be taken to recover the MBR:\n\nBoot from a Windows installation disk\nUpon system reboot, click Next → Repair Your Computer\n\n\n-----\n\nUnder System Recovery Options, click on “Use Recovery Tools”\nClick “Startup Repair”\nThe MBR should now be repaired. Users can confirm this by clicking on “Click here for\ndiagnostic and repair details” and scrolling down to the MBR section\n\n\n-----\n\nClick Close → Finish. This will reboot the machine\nSome users might receive the following error message upon reboot. This error is due to\nthe boot manager corruption\n\nTo rectify this issue, change the boot order to boot from the Windows disk image. This\ncan be achieved by going into the BIOS settings\nUpon system reboot, follow the first 2 steps and the user should then see the OS under\nSystem Recovery Options\nClick on the OS, choose the “Use recovery tools” option, and click Next\nTo repair the boot manager, click on “Command Prompt” and enter the following\ncommand:\n\n**bootrec /fixboot**\n\n\n-----\n\nUpon successful execution of the command, close the command prompt and click\n“Restart”\nUpon repairing the MBR and the boot manager, the user can boot the system without\nthe Windows installation disk and access the system\n\nThe above steps will allow the user to access the system again, but certain files (that match\nthe target extension list) on the system will still be encrypted and can only be decrypted with\na private key possessed by the NotPety authors. Analysis also shows that the malware only\nencrypts the first 1MB of file contents, if the size of the file is greater than 1MB. The\nremaining contents are left untouched and intact.\n\nAs the above image shows, line 20 compares the file size with 0x100000 (1,048,576 bytes or\n1MB). If the file size is greater than 1MB, line 26 declares variables FileSize_1 and\nFinalFileSize to be 0x100000. These values are then used in CreateFileMappingW,\nMapViewOfFile and CryptEncrypt to encode the first 1MB of the file contents. The rest of the\nfile remains untouched.\n\n\n-----\n\n## Additional Resources\n\nFor more information on CrowdStrike’s proactive protection features see the earlier\n[CrowdStrike blog on how Falcon Endpoint Protection prevents the NotPetya attack. In](https://www.crowdstrike.com/products/)\n[addition, watch a demo of CrowdStrike Falcon® detecting and blocking NotPetya.](https://www.crowdstrike.com/resources/videos/how-crowdstrike-falcon-prevents-infection-and-spread-of-the-destructive-petrwrap-attack/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-07-03 - NotPetya Technical Analysis Part II- Further Findings and Potential for MBR Recovery.pdf"
    ],
    "report_names": [
        "2017-07-03 - NotPetya Technical Analysis Part II- Further Findings and Potential for MBR Recovery.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535868,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1653706125,
    "ts_modification_date": 1653706125,
    "files": {
        "pdf": "https://archive.orkl.eu/13e16de783d46ee7600e3418585d3cf09f61611b.pdf",
        "text": "https://archive.orkl.eu/13e16de783d46ee7600e3418585d3cf09f61611b.txt",
        "img": "https://archive.orkl.eu/13e16de783d46ee7600e3418585d3cf09f61611b.jpg"
    }
}