{
    "id": "3b616618-8713-4e29-bcf2-54bb83daf75e",
    "created_at": "2023-01-12T15:01:55.412646Z",
    "updated_at": "2025-03-27T02:05:44.638578Z",
    "deleted_at": null,
    "sha1_hash": "1d70634c377c75cf0dcb859c8c468d5516f47f80",
    "title": "2017-02-18 - Hackers Selling Undetectable Proton Malware for macOS in 40 BTC",
    "authors": "",
    "file_creation_date": "2022-05-29T01:21:54Z",
    "file_modification_date": "2022-05-29T01:21:54Z",
    "file_size": 345409,
    "plain_text": "# Hackers Selling Undetectable Proton Malware for macOS in 40 BTC\n\n**[hackread.com/hackers-selling-undetectable-proton-mac-malware/](https://www.hackread.com/hackers-selling-undetectable-proton-mac-malware/)**\n\nFebruary 18, 2017\n\n[Hackers are selling a malware for Mac devices on a prominent dark web marketing claiming](https://www.hackread.com/tag/Dark-Web)\nthat it is undetectable and comes with capabilities including taking full control of macOS\ndevices by evading anti-virus detection.\n\nDubbed Proton by its developers, the malware is a RAT (Remote Administration Tool) and is\nbeing sold in one of the leading closed Russian cybercrime message boards. The discovery\nwas made by [Sixgill, a cyber-intelligence company that detects cyber-attacks and sensitive](https://www.cybersixgill.com/)\ndata leaks originating from the Dark Web before they occur.\n\nIn their [threat report, researchers at Sixgill explained that the initial price of Proton RAT was](https://www.cybersixgill.com/wp-content/uploads/2017/02/02072017%20-%20Proton%20-%20A%20New%20MAC%20OS%20RAT%20-%20Sixgill%20Threat%20Report.pdf)\n100 BTC (USD $100,000), but lately it is being sold 40 BTC (USD $41891) with unlimited\ninstallations while a license to install on a single PC with genuine Apple certifications would\nset a cyber criminal back only 2 BTC.\n\n## Capabilities of Proton RAT:\n\nProton comes with capabilities including taking full control of a targeted device, keylogging,\nObservers with SMS notifications, SSH/VNC tunneling with VPS, webcam/screen\nsurveillance, premium customer support, file uploadings, and downloads.\n\n\n-----\n\nListing\n\nscreenshot from the dark web message board\n“Proton can present a custom native window requesting information such as a credit card,\ndriver’s license and more. The malware also boasts the capability of iCloud access, even\nwith 2FA enabled,” notes Sixgill.\n\n## Proton RAT, a threat against MAC OS:\n\nSixgill’s report also highlights the threat Proton possess against Mac OS. For instance,\nhackers are selling this malware with genuine Apple code-signing signatures. This means\nthere has been a lot of sophistication behind the development of Proton.\n\n“The author of Proton RAT somehow got through the rigorous filtration process Apple places\non MAC OS developers of third-party software, and obtained genuine certifications for his\nprogram. Sixgill evaluates that the malware developer has managed to falsify registration to\nthe Apple Developer ID Program or used stolen developer credentials for the purpose,”\nreveals the report.\n\nThe report further goes on to explain that “gaining root privileges on MAC OS is only possible\nby employing a previously unpatched 0-day vulnerability, which is suspected to be in\npossession of the author. Proton’s users then perform the necessary action of masquerading\nthe malicious app as a genuine one, including a custom icon and name. The victim is then\ntricked into downloading and installing Proton.”\n\n\n-----\n\nA full list of Proton s features can be checked below:\n\nScreenshot\n\nfrom Proton’s official website – Source: Sixgill\n“Sixgill’s Dark Web intelligence platform leads the way in early detection of cyber security\nthreats when the damage can still be avoided”, said Avi Kasztan, CEO and Co-founder of\nSixgill. “Our analysts are constantly on the lookout for new and emerging threats, and we\nwork closely with law enforcement authorities to report this activity.”\n\nThe developers have also uploaded a video demonstration on YouTube explaining how\nProton works and information about its installation.\n\nAlthough the threat report identified that hackers are aiming at selling Proton malware to\ncompanies, families, sysadmins and parents; it is obvious that putting their listings on the\ndark web cybercrime message boards is an open offer for cyber criminals to take advantage\nof this malicious software.\n\n\n-----\n\nThis is not the first time when hackers have been selling malicious software on a dark web\nmarketplace. In the past, [Stampado ransomware was also sold for just for Just $39.](https://www.hackread.com/hackers-selling-stampado-ransomware/)\nHowever, researchers, later on, discovered that Stampado was not FUD as claimed by its\ndevelopers.\n\n_DDoS attacks are increasing, calculate the cost and probability of a DDoS attack on your_\n_business with this DDoS Downtime Cost Calculator._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-18 - Hackers Selling Undetectable Proton Malware for macOS in 40 BTC.pdf"
    ],
    "report_names": [
        "2017-02-18 - Hackers Selling Undetectable Proton Malware for macOS in 40 BTC.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535715,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653787314,
    "ts_modification_date": 1653787314,
    "files": {
        "pdf": "https://archive.orkl.eu/1d70634c377c75cf0dcb859c8c468d5516f47f80.pdf",
        "text": "https://archive.orkl.eu/1d70634c377c75cf0dcb859c8c468d5516f47f80.txt",
        "img": "https://archive.orkl.eu/1d70634c377c75cf0dcb859c8c468d5516f47f80.jpg"
    }
}