{
    "id": "3b63e7a5-b729-4679-a575-4c6b68c82662",
    "created_at": "2023-01-12T15:05:55.151549Z",
    "updated_at": "2025-03-27T02:13:57.303963Z",
    "deleted_at": null,
    "sha1_hash": "c674cb768b0c414d4e27f8bf42b6545b84ddd5ac",
    "title": "2021-11-19 - Is a coordinated cyberattack brewing in the escalating Russian-Ukrainian conflict-",
    "authors": "",
    "file_creation_date": "2022-05-27T23:17:15Z",
    "file_modification_date": "2022-05-27T23:17:15Z",
    "file_size": 11439828,
    "plain_text": "# Is a coordinated cyberattack brewing in the escalating Russian-Ukrainian conflict?\n\n**[ironnet.com/blog/is-a-coordinated-cyberattack-brewing-in-the-escalating-russian-ukrainian-conflict](https://www.ironnet.com/blog/is-a-coordinated-cyberattack-brewing-in-the-escalating-russian-ukrainian-conflict)**\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n[Threat Research](https://www.ironnet.com/blog/tag/threat-research)\n\n## Assessing the current threat based on the historical convergence of Russian military-cyber conflict\n\nBy Morgan Demboski\n\n\n-----\n\nNov 19, 2021\n\n## What’s the Russian-Ukrainian situation?\n\nCurrently, Ukraine – along with its allies in NATO – is highly concerned about the roughly\n90,000 Russian troops that are massing close to the Donbas (aka Donbass) region of\neastern Ukraine.\n\nThis unusual build-up of troops has prompted fears that Russia may be preparing to invade\n[the region, thus escalating the already tense situation in Eastern Europe.](https://www.aljazeera.com/opinions/2021/11/17/who-is-benefitting-from-the-poland-belarus-border-crisis)\n\nIn many of Russia’s modern military operations, it has employed cyberattacks to weaken its\nadversaries and support its strategic goals. If Russia mobilizes military action against\nUkraine in the near future, there is a very high likelihood that there will be a cyberattack to go\nalong with it.\n\n### Quick background on Russian-Ukrainian conflict\n\n[The current crisis in Ukraine first flared in 2014, when Russia invaded and annexed Crimea.](https://www.britannica.com/place/Ukraine/The-crisis-in-Crimea-and-eastern-Ukraine)\nFollowing this annexation, Russian-backed separatists in southeast Ukraine were motivated\nto seize the Donetsk and Luhansk regions, which are now collectively referred to as the\nDonbas region.\n\n\n-----\n\nDespite multiple cease-fire agreements, sporadic fighting between the Donbas separatist\nrebels and Ukrainian forces continues. With renewed potential to escalate, this conflict in\neastern Ukraine has led to the deaths of more than 14,000 people over the past seven years,\n[as estimated by the International Crisis Group.](https://www.crisisgroup.org/content/conflict-ukraines-donbas-visual-explainer#:~:text=The%20armed%20conflict%20in%20Eastern,since%20killed%20over%2014%2C000%20people.)\n\nOver the past year, Russia has significantly increased its military presence along the\nUkrainian border. In [April 2021, roughly 100,000 to 150,000 Russian troops gathered along](https://www.nationalgeographic.com/culture/article/see-why-conflict-eastern-ukraine-heating-up)\nthe border with Ukraine for about five weeks, representing the highest force mobilization\nsince Crimea’s annexation in 2014.\n\nMirroring the build-up in April, the most recent Russian troop movements have many\ncountries concerned that the conflict might escalate or – in an extreme case – lead to an allout war breaking out between the two countries.\n\n\n-----\n\n## Russian cyber-military coordination\n\nIn order to understand the probability of coordinated cyber-military activity in this potential\nconflict, it is important to review previous instances where Russia coordinated cyber\noperations and traditional military actions.\n\n### Georgia 2008\n\n[Russia-affiliated threat actors committed a series of cyberattacks in the lead up to the Russo-](https://www.army.mil/article/19351/georgias_cyber_left_hook)\nGeorgian War in August 2008, representing the first time cyber activity was coordinated with\nboots-on-the-ground operations.\n\nThe threat actors carried out two rounds of distributed-denial-of-service (DDoS) attacks\nagainst Georgian networks. Coinciding with Russian military intrusions into the separatist\nregion of South Ossetia in Georgia (which marked the beginning of the five-day RussoGeorgian War), the second DDoS attack rendered most Georgian governmental websites\ninoperable by August 10th.\n\nThe attacks, which affected a total of [54 Georgian and Western websites [PDF], were](https://www.hsdl.org/?view&did=756872)\ndesigned to prevent the Georgian government from communicating with the public and\ninternational partners during the conflict – essentially cyber-locking the country.\n\nIn an effort to avoid direct responsibility for the cyber attacks, Russian intelligence agencies\nused a proxy cyber militia to carry out the cyber operations rather than conducting the\n[operations themselves. Researchers from Recorded Future found that prior to the attacks,](https://go.recordedfuture.com/hubfs/reports/cta-2021-0909.pdf)\nRussian government agencies created a hacking forum for “patriotic” cybercriminals, who\ncould enable their own computers to join in on the DDoS attacks.\n\n### Crimea 2014\n\n\n-----\n\nRussia also coordinated its military and cyber activity during its invasion of the Crimean\nPeninsula (located in southern Ukraine) in 2014. In February of that year, Russia stationed\nalmost 150,000 troops along the Ukrainian border for what it referred to as a “military\nexercise.”\n\nIt was on March 1st that the Russian Parliament unanimously approved the use of military\nforce in Crimea, and Russia’s [“little green men” began to invade and seize buildings in the](https://www.fpri.org/article/2016/03/how-why-and-when-russia-will-deploy-little-green-men-and-why-the-us-cannot/)\nterritory.\n\nAround the same time, a DDoS attack – which was 32 times larger than the largest attack\nused during Russia’s invasion of Georgia – temporarily disrupted the internet in Ukraine and\ndegraded the peninsula’s ability to communicate with the rest of the country. Additionally,\nRussian militias on the ground took control of numerous Crimean communications facilities\nand damaged the fiber optic trunk cables of a major telecommunications company\n(Ukrtelecom JSC).\n\nThe DDoS attack and compromise of the communications facilities, in conjunction with\nRussian naval vessels carrying jamming equipment to hinder radio communications, worked\nto effectively isolate the peninsula while Russian-armed rebels seized control of the territory.\n\n### Ukraine 2021\n\nIn April 2021, 100,000-150,000 Russian troops accumulated at the Ukrainian border. Though\n[the Russian minister of defense stated the build-up was due to “training exercises” in](https://www.themoscowtimes.com/2021/04/13/moscow-takes-measures-in-response-to-threatening-nato-actions-a73581)\nresponse to threatening activities by NATO, the Russian troops were deployed for over five\nweeks — much longer than Russia’s [largest annual training exercises (which typically last for](https://sgp.fas.org/crs/row/IF11938.pdf)\naround a week).\n\nUnsurprisingly, Russia also coordinated cyber activity with this military movement; however,\nthis operation was different from the previous two instances discussed because the purpose\nof these cyberattacks was cyber-espionage instead of disruption or destruction.\n\nFrom January to March 2021, Russian advanced persistent threat (APT) Gamaredon, which\n[has been tied to Russia’s Federal Security Service (FSB), targeted Ukrainian government](https://therecord.media/ukraine-discloses-identity-of-gamaredon-members-links-it-to-russias-fsb/)\n[officials with spearphishing attempts as tensions between the two nations rose. Like many of](https://www.cyberscoop.com/gamaredon-russia-ukraine-border-primitive-bear/)\nthe other Russian spearphishing campaigns, these relatively short bursts of email spam were\nconducted in the hope of gaining initial access to Ukrainian organizations in order to collect\nintelligence.\n\n[In the midst of this in February 2021, Gamaredon also compromised a Ukrainian government](https://thehackernews.com/2021/02/russian-hackers-targeted-ukraine.html)\nfile-sharing system and attempted to disseminate malicious documents to other government\nagencies with the goal to mass contaminate the information resources of public authorities.\n\n\n-----\n\nAt this time, it s unclear if these attempts were successful; however, coordinating these\ncyberattacks prior to building up troops represents a sustained effort to destabilize Ukraine\nand exploit weaknesses in its cyber defenses.\n\n## So what could we see in this potential conflict?\n\nSimilar to troop movements in April, this current build-up may just be another attempt by\nRussia to turn up the heat and abruptly lower it to keep Ukraine and NATO tense and off[balance. However, many officials, including Secretary of State Antony Blinken, are](https://thehill.com/policy/international/581013-us-concerned-russia-trying-to-rehash-2014-ukraine-invasion-blinken-says)\nconcerned that a Russian invasion of the Donbas region is imminent.\n\nGiven Russia’s past coordination of military and cyber activity, I assess that if Russia does\ninvade Donbas or mobilize its forces against Ukraine at any point, there almost certainly will\nbe cyber operations carried out by Russian entities to support it.\n\n### Russian cyber-espionage attacks\n\nIn coordination with the build-up of troops on the Ukrainian border, Russian threat actors may\nbe carrying out cyber-espionage attacks in an effort to gain access to Ukrainian government\nnetworks and collect information about strategies, plans, and troop positioning.\n\nCyber-espionage is frequently carried out as a prelude to military or diplomatic activity, and\noftentimes the goal in espionage campaigns is to remain undetected in enemy networks for\nas long as possible. Given that it can be more difficult to detect these attacks and connect\nthem to kinetic activity, they are often uncovered in retrospect to the offensive operation.\n\n### Disruptive/destructive Russian cyber attacks\n\nRussia also could aim to weaken the Ukrainian government by compromising government\nnetworks or essential private companies that perform important services.\n\nWe have not yet seen Russia commit cyberattacks on critical infrastructure to directly support\n[military operations. However, Russia has previously compromised Ukrainian electric grids on](https://jsis.washington.edu/news/cyberattack-critical-infrastructure-russia-ukrainian-power-grid-attacks/)\ntwo occasions in 2015 and 2016 that led to temporary power outages for hundreds of\nthousands of civilians. In doing so, Russia exemplified its ability to compromise critical\nresources, and it is possible that Russia will try to inflict similar damage if it invades Donbas.\n\n### More advanced Russian TTPs and evasion techniques\n\nI predict that if Russia tries to invade and annex Donbas, it will adopt relatively similar tactics\nto those used in Crimea in an effort to effectively cut off the region from the rest of the\ncountry. In this situation, however, the threat is even more severe.\n\n\n-----\n\n[Russia s past cyber operations in Crimea and around the world have allowed Russian APTs](https://www.ironnet.com/blog/russian-cyber-attack-campaigns-and-actors)\nto gain insight into how to alter their TTPs to be more effective. Russian threat actors have\n[been known to develop more sophisticated malware variants and alter their TTPs to better](https://www.reuters.com/article/us-cyber-solarwinds-microsoft/solarwinds-hack-was-largest-and-most-sophisticated-attack-ever-microsoft-president-idUSKBN2AF03R)\ndodge defenders, meaning any future offensive cyber campaign will likely be more difficult to\ncounter and detect.\n\n### Enlisting cybercriminals\n\nAs we saw in Georgia in 2008, it is also possible the Russian government will enlist the help\nof cybercriminals and hacktivists to carry out cyber attacks. Referred to as a “safe haven for\ncybercriminals,” Russia has been reported to partner with cybercriminals living in the country\nfor various operations. To avoid the consequences of direct attribution, Russian intelligence\nagencies may recruit these cybercriminals to carry out DDoS attacks, or even more\nsophisticated attacks, in order to weaken Ukrainian cyber infrastructure.\n\n## What is the significance of potential Russian military-cyber conflict?\n\nRussia has become much more sophisticated in its cyber operations and has exemplified on\nmultiple occasions its ability to cause major damage. The country’s history of coordinating\ncyber and military activity supports the presumption that it will do the same if it engages in a\nfuture conflict with Ukraine.\n\n[The world is now entering a new conception of war-fighting, one in which “hybrid warfare” is](https://cepa.org/hybrid-warfare-of-the-future-sharpening-natos-competitive-edge/#:~:text=Hybrid%20warfare%20combines%20military%20and,lines%20between%20war%20and%20peace.)\nbecoming a key means by which countries carry out offensive operations. In the case of\nRussia, hybrid warfare has become an integral aspect of the country’s geopolitical strategy\nas it leverages disinformation campaigns, cyber operations, and kinetic attacks to deliver an\neven larger blow to its adversaries.\n\nThough influence campaigns and cyber operations can be carried out independent of other\nactivities, it is highly unlikely that Russia will carry out military operations without coordinating\nit with other non-kinetic tactics. As a result, during high levels of geopolitical tension, an eye\nmust be kept on Russia’s activity in cyberspace as it tries to gain a competitive advantage\nover its adversaries.\n\nTo read more about historical Russian cyber attacks, see \"Russian cyber attack campaigns\nand actors.\"\n\nAbout Ironnet\n\nFounded in 2014 by GEN (Ret.) Keith Alexander, IronNet, Inc. (NYSE: IRNT) is a global\ncybersecurity leader that is transforming how organizations secure their networks by\ndelivering the first-ever Collective Defense platform operating at scale. Employing a number\nof former NSA cybersecurity operators with offensive and defensive cyber experience,\nIronNet integrates deep tradecraft knowledge into its industry-leading products to solve the\nmost challenging cyber problems facing the world today.\n\n\n-----\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-19 - Is a coordinated cyberattack brewing in the escalating Russian-Ukrainian conflict-.pdf"
    ],
    "report_names": [
        "2021-11-19 - Is a coordinated cyberattack brewing in the escalating Russian-Ukrainian conflict-.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535955,
    "ts_updated_at": 1743041637,
    "ts_creation_date": 1653693435,
    "ts_modification_date": 1653693435,
    "files": {
        "pdf": "https://archive.orkl.eu/c674cb768b0c414d4e27f8bf42b6545b84ddd5ac.pdf",
        "text": "https://archive.orkl.eu/c674cb768b0c414d4e27f8bf42b6545b84ddd5ac.txt",
        "img": "https://archive.orkl.eu/c674cb768b0c414d4e27f8bf42b6545b84ddd5ac.jpg"
    }
}