{
    "id": "3b804ee8-7b27-4795-9d03-6b37fdb2bb89",
    "created_at": "2024-06-06T02:05:35.881015Z",
    "updated_at": "2025-03-27T02:17:00.202011Z",
    "deleted_at": null,
    "sha1_hash": "a55c04d39cbb604e89fed0739cb0240ce89bb716",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-12-12T16:32:41Z",
    "file_modification_date": "2023-12-12T22:38:03Z",
    "file_size": 3045872,
    "plain_text": "-----\n\n# Executive Summary\n\nBatLoader and FakeBat are two competing, Russian-speaking Malware-as-a-Service (MaaS) crime groups that\nspecialize in infecting corporate employees with malware. These services are known to infect their targets with\n\n[every type of malware from the Royal ransomware to the Gozi banking trojan.](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\n\n[eSentire’s security research team, the Threat Response Unit (TRU), has been closely tracking the two MaaS](https://www.esentire.com/resources/tru-intelligence-center)\noperations. Between September 2022 and November 2023, TRU intercepted and shut down BatLoader and\nFakeBat attacks launched at 23 of eSentire’s customers. These included companies in the manufacturing,\nsoftware, legal, retail, and healthcare industries.\n\nTRU has discovered the handles of each lead operator. BatLoader’s top operator goes by Afron, and FakeBat’s\nmain operator goes by Eugenfest. TRU has also tracked the threat actors’ online activities, going back to 2017 for\nEugenfest and 2020 for Afron. Although BatLoader and FakeBat are similar in several aspects, they are rivals, each\ncompeting to capture more of the MaaS market.\n\nBoth MaaS operations work closely with their customers to create seamless, end-to-end malware delivery using\nsearch advertisements for popular business software, yielding high-value victims for further exploitation. Both\noperations offer variable payment options for additional services, as well as assistance in running the advertising\ncampaigns, if needed. The threat actors, behind BatLoader and FakeBat, have figured out that if they provide their\ncustomers with a reliable malware loader, assist them with parts of the malware operation, where needed, and\n\nprovide the loader and their assistance for an affordable price, they will significantly increase their market share.\nThus, even the lowest-level hacker can get into the cybercrime game.\n\nThe BatLoader and FakeBat operations are referenced by the following names: BatLoader a.k.a AfronLoader,\nDefeatDefenderLoader and FakeBat a.k.a PaykLoader, EugenLoader. Both MaaS offerings were initially advertised\non Telegram and Russian-speaking underground forums, Exploit and XSS, and remain active to this day.\n\n\n-----\n\n### BatLoader and FakeBat Attack 23 Companies Across the Manufacturing, Software, Legal, Retail, & Healthcare Industries\n\nThe BatLoader service was first advertised on the hacker underground in May 2022, while the FakeBat MaaS came\n\non the scene in December 2022. As previously mentioned, TRU detected and shut down BatLoader and FakeBat\nattacks launched at 23 of eSentire’s customers, between September 2022 and November 2023. The targets\nincluded companies in the manufacturing, software, legal, retail, and healthcare industries.\n\nThreat actors who purchase BatLoader or FakeBat's services are promised a malware loader capable of evading\ndefenses and reliably infecting victims. The BatLoader operators claim the following success rate for their\n\nmalware loader: “What is the Payout Percentage, the success rate for every 100 of people that download the\nBatLoader malware, 50% end up infected with your payload.” The BatLoader operators also state that their\nmalware loader will circumvent Google Alerts, Smart Screen, and Windows Defender, and TRU has observed this.\nBoth operations also offer extended services to assist with delivering payloads via search advertisements.\n\n### Show Them the Money \n\nA customer can rent the MaaS from the BatLoader operators or the FakeBat operators for one month, for set rental\nfees. For BatLoader, as of September 2023, customers must transfer USD $3,000 one time through the Guarantor\nof the forum in which the operators and the customer are doing business. A Guarantor is a trusted middleman for\n\nbuying and selling goods and services between users on an underground forum. Guarantors are part of an\nunderground forum’s management staff, and they perform escrow services. According to the BatLoader operators,\nthe one-time payment of $3,000 is to demonstrate that the customer is serious about doing business. After the\nmoney is deposited, a profit-sharing agreement is negotiated privately between the BatLoader operators and the\ncustomer.\n\nTo rent the FakeBat MaaS, the operators are currently offering both an unsigned MSI loader for USD $2,500 per\nmonth or a signed MSIX loader for USD $4,000 per month. If a customer wants additional services, such as\npayload delivery, the services are negotiable for a minimum of USD $3,000 on top of the cost of the loader.\n\n### The MO of BatLoader and FakeBat and the Art of Deception\n\nOnce the operators have been paid their rental fees, the process works like this. The operators will create and\npurchase Google ads, promoting popular business software, such as Slack, ChatGPT, Adobe, etc. These ads are\ndesigned to entice corporate employees to websites that the BatLoader and FakeBat operators design and host.\n\nThese websites mimic legitimate software hosting sites so when corporate employees visit the websites to\ndownload the software they desire, they get infected with the BatLoader or FakeBat malware loader.\n\nOnce the loader is on an employee’s computer, the customers’ preferred payload is downloaded onto the victim’s\ncomputer, alongside an actual copy of the business software the corporate employee was seeking. To provide the\ncustomers with another layer of authenticity, the BatLoader operators claim their malware loader is always signed.\n\nThe FakeBat operators offer their customers either an unsigned MSI loader for USD $2,500 per month or a signed\n\nMSIX loader for USD $4,000 per month. The final payload can be whatever the customer chooses, whether it be\nransomware, banking trojans, password stealers, remote access trojans (RATs), or Remote Monitoring and\n\n\n-----\n\nManagement (RMM) tools. In the case of BatLoader, customers can customize their payloads specifically for\ncorporate networks, providing an efficient, flexible means of monetizing the victim machine and environment\nthrough information theft, network access, or possibly extortion.\n\n### BatLoader and the Royal Ransomware Connection \n\n[Security researchers have seen BatLoader infections lead to Royal ransomware deployment. The Royal](https://www.darkreading.com/threat-intelligence/royal-ransomware-expands-target-linux-vmware-esxi-environments)\n[ransomware gang is said to be run by top operators, formerly with the notorious Conti ransomware gang, Royal](https://www.securityweek.com/royal-ransomware-possibly-rebranding-after-targeting-350-organizations-worldwide/)\n[was behind the May 2023 breach of the city of Dallas, causing the city government to shut down some of its courts](https://www.bleepingcomputer.com/news/security/dallas-says-royal-ransomware-breached-its-network-using-stolen-account/)\n\nand the attack disrupted portions of its 911 emergency services. According to a November 2023 report from the\n[FBI and the Cybersecurity Infrastructure and Security Agency (CISA), the Royal threat actors have targeted](https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-061a)\nnumerous critical infrastructure sectors including: manufacturing, healthcare and public healthcare (HPH),\n\neducation, and communications.\n\nLaw enforcement estimates that the Royal gang has targeted 350 victims since September 2022 and has\n\n[demanded more than $275 million from these organizations. According to a separate May 2023 security report,](https://unit42.paloaltonetworks.com/royal-ransomware/)\nthe Royal gang also attacked seven local government entities, including the City of Dallas and claimed to have\ncompromised 26 manufacturers in 2023 alone. They also hit 14 educational institutions and eight healthcare\norganizations since coming on the hacker scene in 2022.\n\nThe following report details the origins of BatLoader and FakeBat and provides insight into how these malware\nservices have evolved into seamless, turn-key criminal operations, requiring their business partners to require few\ncyber skills. Readers also gain a glimpse into the psyche of the lead criminals behind these malware services, and\nhow they conduct business on the underground. Lastly, TRU provides a list of security recommendations to help\norganizations protect themselves from these threats.\n\n\n-----\n\n# Unraveling the BatLoader and FakeBat Operations \n\nSince January 2022, eSentire’s Threat Response Unit (TRU) has tracked two Malware-as-a-Service (MaaS)\noperations sometimes labeled under a common identifier known as BatLoader. This blending is likely due to the\n\nsimilarities between the two operations, whereby malicious installer files (.msi or .msix) are distributed using\nGoogle Search advertisements for popular software such as Zoom, ChatGPT and Adobe. These installation\npackages execute an embedded Batch (.bat), PowerShell (.ps), or Python (.py) scripts to install malware on the\nvictim’s machine.\n\nThere are two similar and competing MaaS operations:\n\n1. **BatLoader a.k.a AfronLoader, DefeatDefenderLoader**\n2. **FakeBat a.k.a PaykLoader, EugenLoader**\n\nThese operations were initially advertised on Telegram and Exploit/XSS forums and remain active to this day. This\nreport will explore the origins and differences between these two operations.\n\n### BatLoader Origins and Ties to MalSmoke, Zloader\n\n[The earliest mention of the loader can be traced to a January 2022 blog by Check Point Research, who](https://research.checkpoint.com/2022/can-you-trust-a-files-digital-signature-new-zloader-campaign-exploits-microsofts-signature-verification-putting-users-at-risk/)\nbacktracked the activity to November 2021. The blog describes an infection scheme whereby MSI (Microsoft\n\nSoftware Installer) files disguised as installers drop the remote monitoring tool Altera Agent followed by several\nBatch files (.bat) which add exclusions to Microsoft Defender and install Zloader as the main payload. Based on\nsimilarities in TTPs and domain registration data, researchers linked the activity to a campaign dubbed MalSmoke\n[by Malwarebytes in 2020.](https://www.malwarebytes.com/blog/news/2020/11/malsmoke-operators-abandon-exploit-kits-in-favor-of-social-engineering-scheme)\n\n_Figure 1 Comparison of Malwarebytes' (left) and Check Point Research (right)_\n\nThe MalwareBytes blog described how the MalSmoke operators shifted delivery from the Fallout Exploit kit to\nusing social engineering via fake Java MSI installer files on adult websites beginning in October 2020. That\ninfection scheme can be seen on the left side of Figure 1.\n\nThere are a few other clues that strengthen the MalSmoke/BatLoader connection. First, the threat actor we’ve\n\nlinked to BatLoader was active on Exploit forums in February 2020 promoting a pay-per-install scheme that used\nthe Fallout exploit kit (Figure 2).\n\n\n-----\n\n_Figure 2 Exploit post promoting Fallout EK installs (translated)._\n\nThe threat actor received several replies critiquing the quality of installs delivered by exploit kits, to which they\nreplied, “I can't guarantee that you'll have top companies in your logs. I don't promise that.” In a now-deleted\nadvertisement for an early version of BatLoader, they admitted drive-by exploit methods are no longer relevant.\n\n[Furthermore, the panel logo (a version of the Eye of Providence) referenced for moviehunters[.]site in the](https://en.wikipedia.org/wiki/Eye_of_Providence)\n[MalSmoke campaign (Figure 1, left) matches several favicons found in known BatLoader Panels at](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)\nshvarcnegerhistory[.]com/t1s1j1/index/login as well as countingstatistic[.]com/g00m1n/index/login:\n\n_Figure 3 Eye of Providence Logo seen in BatLoader Panels._\n\n[The “BatLoader” or BATLOADER label originates from a February 2022 report by Mandiant. The various reports](https://www.mandiant.com/resources/blog/seo-poisoning-batloader-atera)\npredating the BatLoader-as-a-service advertisements shown below suggest the threat actor(s) were working\n\nprivately with other actors before deciding to commoditize their loader. Notably, Zloader (commonly linked to early\n[BatLoader infections) was disrupted by Microsoft’s Digital Crime Unit in April 2022. TTPs and infrastructure in an](https://blogs.microsoft.com/on-the-issues/2022/04/13/zloader-botnet-disrupted-malware-ukraine/)\n[accompanying Microsoft report also align with early reported BatLoader activity.](https://www.microsoft.com/en-us/security/blog/2022/04/13/dismantling-zloader-how-malicious-ads-led-to-disabled-security-tools-and-ransomware/)\n\nCoincidentally, BatLoader was then marketed in its current form on the Exploit[.]in forum a month later. The\nrelationship isn’t immediately clear, but it’s a realistic possibility that BatLoader’s operators decided to open up\n\nthe loader and find new partners following the ZLoader takedown. Microsoft, who tracks BatLoader operators as\n[Storm-0569 (formerly DEV-0569), also raised this hypothesis in a November 2022 blog, stating “DEV-0569](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\n\n\n-----\n\n_frequently diversifies their payloads and has shifted from delivering ZLoader at the beginning of 2022, possibly in_\n_[response to disruption efforts against Zloader in April 2022.”](https://www.microsoft.com/en-us/security/blog/2022/04/13/dismantling-zloader-how-malicious-ads-led-to-disabled-security-tools-and-ransomware/)_\n\n### Zloader and BatLoader Infrastructure Overlap\n\nDuring our research we identified domains tied to ZLoader, BatLoader, or both, in public reports and malware\nrepositories. In certain cases, the same contact information was used to register domains tied to Zloader\ncommand and control and BatLoader. For example, seledka[.]prostokvash@rambler.ru registered multiple\n[imposter sites and Zloader domains listed in Microsoft’s legal filing pertaining to their actions against Zloader.](https://noticeofpleadings.com/zloader/files/Application%20for%20TRO/TRO%2004%20-%20Coy%20Decl%20ISO%20TRO%20and%20PI%20with%20Exs%201-11%20ISO%20TRO%20and%20PI.pdf)\n\nThat same email and related contact name were used to register two BatLoader domains. Another example was\n[abdel@info-electronics[.]com, which registered dozens of Zloader domains found in the aforementioned filing as](mailto:abdel@info-electronics.com)\n[well as datalystoy[.]com and websekir[.]com, both mentioned in early BatLoader reports from Walmart and](https://medium.com/walmartglobaltech/signed-dll-campaigns-as-a-service-7760ac676489)\n[Mandiant. A sampling of these relationships is visualized in Figure 4.](https://www.mandiant.com/resources/blog/seo-poisoning-batloader-atera)\n\n_Figure 4 Zloader and BatLoader overlap visualized_\n\n\n-----\n\n### “Afron” and BatLoader-as-a-Service\n\nBatLoader has been advertised on the Exploit forum under the handle “Afron” since at least\nMay 2022. Afron joined Exploit in February 2020, where they immediately began\n\nadvertising a Pay-Per-Install scheme using the Fallout exploit kit (Figure 2). It’s likely that\nAfron was active on Exploit and other forums under a different alias prior to this. Unlike\nEugenLoader/Fakebat’s vendor, Afron is seemingly more careful with their operational\nsecurity, using unique IM accounts and pushing discussions to private messages as often\nas possible. They are also careful to not directly access the forums from their personal\n\nmachine, once telling other forum members “I access the forum through a separate virtual\n_machine, and it takes 10-15 minutes just to get everything up and running”. Following the_\nEK operation and prior to marketing BatLoader, Afron’s activity on the forum was sparse,\nagain leading us to believe they operate under multiple handles or forums and use the\n\nAfron handle primarily for advertising/networking on the Exploit forum.\n\nAfron’s posts during this time revolved around seeking help from other forum members. In one request, they\nsought advice on stealing email contacts from infected machines for use in follow-on spam messages. In another,\nthey requested a contact for Gozi malware so they could rent it. Finally, in a revealing post in August 2020, they\nrequested advice for determining whether a “…bot resides on a large network” (i.e. a malware foothold in a\ncorporate vs home network). Suggestions from other forum users included querying the ARP table (a technique\n\nthat would find its way into present-day BatLoader), using NLtest (“you can try in the same powershell nltest\n_/domain_trusts /all_trusts”) among other methods._\n\nIn March 2022, Afron attempted to market an early version of BatLoader under the name\n“DefeatDefenderLoader.” The post, titled “[АРЕНДА] Приватный не резидентный лоадер с обходом Windows\n_SmartScreen-а и Windows дефендера” or “[RENTAL] Private non-resident loader with bypass of Windows_\n\n_SmartScreen and Windows Defender” has since been removed from the forum, but it describes launching an_\n.exe/.dll with admin privileges using MSI installer packages (the full translated text can be found in the Appendix at\nthe end of this report). The post begins with an admission that their prior work with exploit kits wasn’t fruitful:\n\n_We've been in this field for over a year. Initially, we worked with bundles, but since that's no longer_\n\n_relevant, we created our own loader._\n\nThe post largely mirrors that of the May thread described below but offers a Telegram channel\nhttps://t[.]me/DefeatDefenderLoader as a point of contact.\n\n### BatLoader-as-a-Service\n\nBatLoader has been advertised on Exploit forum since May 2022, with continuous updates over time. For clarity,\ntranslated excerpts from the post and subsequent discussion thread on Exploit are provided below. Screenshots of\nthe advertisement can be found below, and the full translated text can be found in the appendix.\n\n\n-----\n\n_Figure 5 Part 1 of Afron’s BatLoader Rental Post, Captured September 2023. See Appendix for Translated Text._\n\n_Figure 6 Part 2 of Afron’s BatLoader Rental Post, Captured September 2023. See Appendix for Translated Text._\n\nThe initial offering included the following:\n\n_I'm offering for rent:_\n\n_1. Loader with bypass for Google Alerts/SmartScreen/Windows Defender._\n\n\n-----\n\n_2. Bot with form grabbing/injection/Hide-VNC/socks/cookies/Stealer modules._\n\n_The rental cost includes everything:_\n\n_* Servers for the admin panel._\n\n_* Proxy server for proxying requests._\n\n_* Backup domains._\n\n_* Crypt._\n\nAs of September 2023, the offer includes both a non-persistent and persistent loader along with DanaBot banking\ntrojan:\n\n_I offer for rent:_\n\n_1. Non-resident loader for Google/Bing Ads with bypassing Google Alerts/Smart Screen/Windows_\n\n_Defender. (We are the authors)_\n\n_2. Resident loader (referred to as \"anchor\") for corporate networks (We are the authors)_\n\n_3. DanaBot banking trojan, software author is JimmBee._\n\nAfron claims the loader is always signed and loads specific payloads based on whether the infected machine\n\nresides on a corporate network:\n\n− _The loader is always signed with a valid EV certificate (no one else offers this on the forum)._\n\n− _Finally, there is full detection of corporate networks on the loader (the payload is unloaded based_\n\n_on this)._\n\nThe code signing certificates are likely acquired from other users/service providers on the forum, such as\n“arbadakarba2000” whom Afron vouched for at one point in a separate thread.\n\n#### Variable Payloads\n\nThe custom load behavior is further explained in the offer:\n\n_Different payloads are delivered depending on the network structure:_\n\n_1. User network:_\n\n          - _Loading one or several payloads._\n\n_2. Corporate network:_\n\n          - _Loading payloads only if the machine is in a domain._\n\n          - _The machine name must not match the Domain parameter._\n\n          - _ARP table contains 3+ records (parameter can be adjusted) with addresses of local subnets_\n_(192.168., 10., 172.)._\n\n          - _The domain must not be equal to WORKGROUP._\n\n\n-----\n\n[This logic matches our analysis from the fall of 2022. In that analysis, these checks were used to load variable](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-batloader)\nGPG-encrypted payloads Ursnif/Vidar/Synchro RMM and Cobalt Strike. In January 2022 (prior to marketing the\n\n[loader on Exploit), reported payloads using this scheme were AltaraAgent, Gozi or Zloader, and Cobalt Strike.](https://medium.com/walmartglobaltech/signed-dll-campaigns-as-a-service-7760ac676489)\n\n_Figure 7 Variable payload logic from https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-batloader_\n\n#### Price\n\nThe price to rent the loader has varied over time. Initially it was rented for around $4,000 per month for just the\n\nloader. In July 2022, Afron introduced a $5,000 monthly package consisting of a bot which “….includes Hidden\n_VNC, support for web injects, a stealer from all popular browsers (Chrome, Firefox, Edge), a form grabber, and an_\n_embedded loader”. Afron claims that customers are “…making hundreds of thousands of dollars with us”. As of_\nSeptember 2023, the payment model involves depositing $3,000 as a goodwill gesture, whereby a profit-sharing\nmodel is negotiated privately.\n\n#### Malvertising Vector\n\nBatLoader is marketed primarily as a loader to be distributed using search advertisements such as Google Ads:\n\n_The surfer searches and finds your advertisement, clicks, lands on the White Page, passes all checks,_\n_and your cloaker displays the Black Page on which the surfer downloads the loader._\n\nAfron is clear initially that the onus is on the renter to provide their own landing page and drive traffic to it. They go\na step farther and ensure the MSI installer matches the ad lure used by the operator:\n\n_The loader is tailored individually for each tenant, meaning I perform a complete installation of donor_\n\n_software. In the end, the surfer receives what they came for, whether it's the Brave browser, Zoom, or_\n\n_some lesser-known PDF Reader._\n\n\n-----\n\nThe overhead caused by payload customization and code signing certificates are a couple reasons why Afron is\nselective with who gets access to the loader, at one point posting “Right now, there's one spot available - all others\n_are in line, with a wait of 1-2 months for their spot”. Additionally, load throughput is raised and lowered from_\nupwards of 1,000 loads per day to as low as 50.\n\nDue to demand, Afron begins offering landing pages in August 2022:\n\n_We have our own landing pages now - already have about 10-15 for all popular software._\n\n_We'll share them!_\n\nInitially, it’s not clear if this is a free add-on. This stance is further clarified to be a paid option in an update to the\npost’s FAQ section:\n\n_Do you provide Landing Pages?_\n\n     - _Yes, this service is paid separately._\n\n#### MSI/MSIX Installer Files\n\n[As we’ve covered in various blogs on BatLoader, the primary execution method uses installer files to launch Batch,](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)\nPowerShell and Python scripts. In July 2023, Afron announced that they would be moving to MSIX, a relatively\n\nnew installer file type:\n\n_Now we use a sleek installer, MSIX, just like the Microsoft Store._\n\nThis follows the jump to MSIX by EugenLoader/FakeBat some months earlier, which we have documented in\n[several blog posts in May and August 2023. Interestingly, Afron drops MSIX in late August 2023 due to lack of](https://www.esentire.com/blog/batloader-impersonates-midjourney-chatgpt-in-drive-by-cyberattacks)\n\nsuccess with the format:\n\n_We no longer offer .msix as there won't be any conversion on corporate machines._\n\n#### BatLoader’s Panel\n\nBatLoader’s panel is relatively straightforward and includes the victim IP, country, operating system, status of the\nbot, installation status and comments.\n\n_Figure 8 BatLoader_ _Admin Panel, retrieved from Exploit forum._\n\n\n-----\n\nAs a final note, it’s apparent that Afron (and possibly others on his team) have access to logs from all tenants.\nResponding to such an allegation in February 2023, Afron says “…this is a rental, not a sale of software to you”.\n\n### FakeBat/EugenLoader\n\nAs stated at the beginning of this report, BatLoader is often mistaken for another MSI loader operation known as\n“FakeBat” or EugenLoader. FakeBat is marketed using the handle “Eugenfest” on the Exploit hacker forum. The\nloader was also advertised on XSS forums under the pseudonym “Payk_34”.\n\n#### Eugenfest’s Background\n\nEugenfest’s online activity can be traced to Russian-language carding and hacking forums dating back to 2017\nunder various aliases such as Festik, Payk_34 and M1rages (see appendix for list). The actor previously ran an\n\neBay fraud shop at fest-bay[.]com which was populated with stolen credentials obtained by brute force attacks\nagainst the service. Fest-Bay was promoted on various carding forums and Telegram channels (Figure 9 and 10).\n\n_Figure 9 Eugenfest promoting Fest-Bay eBay shop on Telegram._\n\n\n-----\n\n_Figure 10 Eugenfest promoting eBay shop on BHF (translated)._\n\nEugenfest’s past projects relied on services from other users/providers. It is highly probable that web\n\ndevelopment for Fest-bay[.]com was outsourced to Shopsn, a service offering ecommerce shop templates and\nhosting (Figure 11). eBay credentials were likely obtained for this shop using brute force tools sold by other\nmembers, such as the JKS tool in Figure 12 (Eugenfest admits to using the brute force tool but prefers an unnamed\nprivately developed tool over it).\n\n_Figure 11 Shopsn, used to create Fest-Bay_\n\n\n-----\n\n_Figure 12 Cracked version of an eBay account brute force tool shared on Exploit Forum._\n\nEugenfest has also actively sought video game keys and related objects using various pseudonyms on carding and\nhacking forums (Figure 13) dating back to 2018. These keys were then sold on sites such as G2A or Kinguin for\nprofit.\n\n_Figure 13 Eugenfest promoting their game key service._\n\n\n-----\n\nFrom 2019 onward, Eugenfest’s post history on BHF and Exploit forums indicates a shift towards malware\ndeployment and selling stolen data. In July and August 2022, they can be seen asking for traffic/loading services\n[and sought to rent the Matanbuchus loader from BelialDemon on Exploit forums. Notably, Eugenfest had praised](https://unit42.paloaltonetworks.com/matanbuchus-malware-as-a-service/)\nAfron’s loader (BatLoader) in August 2022, implying they were using it months before launching a similar service:\n\n_What can I say about this tool? It's absolutely amazing, with some mind-blowing software. It performs_\n_its function at 999%, bypassing Google Defender, and the callback is incredible._\n\nCoincidentally, during this time, Eugenfest’s post history suggests they are actively abusing Google\nadvertisements. In September 2022, they replied to an ad fraud Q&A thread asking for help:\n\n_Hello everyone, does anyone know what's currently happening with Google? All the loopholes have been_\n_patched up, and I've tried many different approaches. I'm launching with VNC, and the trust can't go_\n_any higher. It keeps giving me a suspended business practice or unpaid. I'm ready to buy information_\n_on launching through the forum's guarantor with 3 proofs of successful launches._\n\nThe loophole referenced above refers to abusing free ad credits on new accounts, a common scheme used for\npushing malicious ads. The timing of Eugenfest’s endorsement of BatLoader and comments on Google Ads\nsuggests they were an active BatLoader user prior to marketing a competing service on Exploit.\n\n### FakeBat-as-a-Service\n\nEugenfest first marketed their loader in December 2022 and currently offers both an unsigned MSI loader for\n$2,500 per month or a signed MSIX loader for $4,000 per month.\n\n_Figure 14 Eugenfest's post promoting FakeBat loader in December 2022. A full translation of the post can be found in the appendix._\n\n\n-----\n\nThe capabilities and advertised price closely match that of Afron’s loader (BatLoader), including working with\ncustomers to ensure payloads match malvertising themes. Additional services, including payload delivery, are\n\nnegotiable for a minimum of $3,000 on top of the cost of the loader. FakeBat provides several points of contact for\nrenting and support:\n\n_Tox ID for Admin:_\n_0BF0BA66030916F61BB7D9E954FB98A8F973DB6531F18EB6CEE006D7E275B906BC58EB71F358_\n_Tox ID for Support:_\n_7CB85C41D6E3FC9602FB8D79B955820AC4EEF41F29F2177B9750C129935F216FE0573DA8899F_\n_Telegram Admin: hxxps://t[.]me/payk_work_\n_Telegram Support: hxxps://t[.]me/spektr234_\n\n_Figure 15 Several Telegram handles linked in Eugenfest’s FakeBat post._\n\nOn September 6, 2023, a Telegram channel was created to communicate changes with the loader (the channel has\n36 members as of September 14, 2023):\n\n_Figure 16 Snapshot of FakeBat Telegram channel._\n\n\n-----\n\n#### FakeBat’s Admin Panel\n\nLike BatLoader, FakeBat’s admin panel contains a basic table with victim information, installation status, installed\nantivirus and a text box for comments (Figure 17).\n\n_Figure 17 Primary FakeBat admin panel._\n\nIt also includes a statistics window for viewing infection rates (Figure 18), changing payload links (Figure 19) and\nmodifying the builds and panel protections (Figure 20).\n\n_Figure 18 FakeBat includes a statistic diagram showing victim percentages._\n\n\n-----\n\n_Figure 19 Configuration window to update payload links. The blurred column contains the themes used (Zoom, Anydesk etc). This_\n_ensures the payload matches the ad theme used._\n\n_Figure 20 Build and panel configuration._\n\n\n-----\n\nAs is the case with BatLoader, it is highly probable that FakeBat operators have access to data across their\ncustomer tenants.\n\n#### FakeBat Infrastructure\n\nFakeBat’s imposter pages and panels have historically been registered using Namecheap, NameSilo and r01.ru.\nImposter pages typically contain a lookalike name and the .software gTLD (e.g. any-desk[.]software). FakeBat\npanels typically contain the strings “ads”, “job”, “adv” and “panel”. Panels are hosted on .site and .ru TLDs (rarely\n.xyz as well).\n\nThe email address johnbolton778@proton[.]me, which we associate with medium confidence to EugenFest, was\nused to register the domain ADS-CHECK[.]COM on November 22, 2022 (see below). A similar name was seen tied\nto domains in mid to late 2023.\n\n_Domain name: ads-check[.]com_\n\n_Registry Domain ID: 2740094228_DOMAIN_COM-VRSN_\n\n_Registrar WHOIS Server: whois.namecheap.com_\n\n_Registrar URL: http://www.namecheap.com_\n\n_Updated Date: 0001-01-01T00:00:00.00Z_\n\n_Creation Date: 2022-11-22T11:35:18.00Z_\n\n_Registrar Registration Expiration Date: 2023-11-22T11:35:18.00Z_\n\n_Registrar: NAMECHEAP INC_\n\n_Registrar IANA ID: 1068_\n\n_Registrar Abuse Contact Email: abuse@namecheap.com_\n\n_Registrar Abuse Contact Phone: +1.9854014545_\n\n_Reseller: NAMECHEAP INC_\n\n_Domain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibited_\n\n_Domain Status: addPeriod https://icann.org/epp#addPeriod_\n\n_Registry Registrant ID:_\n\n_Registrant Name: Private Person_\n\n_Registrant Organization: Ads_CHECKLLC_\n\n_Registrant Street: th 12_\n\n_Registrant City: New York_\n\n_Registrant State/Province: NY_\n\n_Registrant Postal Code: 30012_\n\n_Registrant Country: US_\n\n_Registrant Phone: +1.6823653636_\n\n_Registrant Phone Ext:_\n\n\n-----\n\n_Registrant Fax:_\n\n_Registrant Fax Ext:_\n\n_Registrant Email: johnbolton778@proton[.]me_\n\n[The WHOIS record also tied the domain to company “Ads_CHECKLLC”, which was used to register at least 34](https://www.whoxy.com/company/59143234)\n[domains between November 2022 and February 2023. These include panels and imposter pages for software](https://www.whoxy.com/company/59143234)\nimpersonated in malvertisements.\n\n     - ads-check[.]com\n\n     - down[.]software\n\n     - awesome-miner[.]software\n\n     - winrar[.]software\n\n     - qtorrent[.]software\n\n     - ccleaner[.]software\n\n     - mail-client[.]software\n\n     - lightshot[.]software\n\n     - top-wallet[.]software\n\n     - pdf-tools[.]software\n\n     - rufus-download[.]software\n\n     - downloaders[.]software\n\n     - any-desk[.]software\n\n     - down1[.]software\n\n     - download1[.]software\n\n     - tor-browser[.]software\n\n     - vlc-media[.]software\n\n     - adscheck[.]net\n\n     - rar-lab[.]software\n\n     - filezilla[.]space\n\n     - torrent-tools[.]software\n\n     - notepad-editor[.]software\n\n     - aimp[.]software\n\n     - kmplayer[.]software\n\n     - archiver-7zip[.]software\n\n     - awesome-project[.]software\n\n     - extremebot[.]software\n\n     - trading-terminal[.]software\n\n     - heartcores[.]net\n\n     - digmefitness[.]net\n\n     - psyclelondon[.]net\n\n     - terminal-trading[.]software\n\n     - id-cpu[.]software\n\n     - download-rufus[.]software\n\n\n-----\n\n#### Code Signing Certificate Acquisition and Collaboration with Other Actors\n\nLike Afron, Eugenfest likely acquires code signing certificates from other vendors on Exploit/XSS. Under the\nPayk_34 handle they can be seen vouching for a vendor by offering a screenshot of their transaction on XSS\n\nforum’s escrow service.\n\n_Figure 21 Eugenfest/Payk_34 vouched for an EV certificate provider on XSS forum. They provided a screenshot from the forum's escrow_\n\n_service as evidence that they had previously purchased a certificate._\n\nAnother service provider likely collaborating with Eugenfest is “Balamut Service”, who provides code signing\ncertificates and web development, among other services.\n\n_Figure 22 Overview of Balamut Service Offerings._\n\n\n-----\n\nOn the web development front, they provide web pages for phishing, anti-crawler and assistance with pushing\nmalicious ads through Google.\n\n_Figure 23 Web Development Description. Translation inserted for clarity._\n\n\n-----\n\n#### FakeBat November 2023 Update\n\nIn November 2023, FakeBat operators posted an update to their Telegram channel (Figure 24).\n\n_Figure 24 November 2023 update in FakeBat Telegram channel._\n\nThe message translates to:\n\n_Landing pages can now be proxied and also set up on Cloudflare (Transmitted data does not get_\n_corrupted)._\n\n_A new method of file delivery bypassing the browser has been added. When you click the button, the_\n_AppInstaller opens immediately, and the MSIX package downloads into it, bypassing the browser._\n_This technology has only one downside: some revisions of Windows 10 cannot be installed this way._\n_Tests have shown a drop in conversion from 52% to 48%, but again, much depends on the offer._\n_Available only to those who purchase for a month._\n\n\n-----\n\n_Video - https://www.veed.io/view/c80e52dc-7668-4690-86ef-c0f689ca2264_\n\n_Four-stage protection of the files themselves has been added:_\n_Landing pages now operate on Cloudflare._\n_Malicious code is not stored in the loader file._\n_To get the code, there is a check by IP in the database._\n_There is a check by User Agent (which is manually specified and embedded in the file, AV can obsess_\n_over the link from which the malicious code is taken endlessly, but it will be useless)._\n_Launch is possible only with the status \"Downloaded.\"_\n_99% of bots are put to rest._\n\n_A New Year's theme has been added._\n_All updates to current clients will be rolled out gradually._\n_PS Only MSIX is available, we_ _can_ _accept new_ _clients only in about 5-6 days_\n\nInformation from the video clip was traced to multiple FakeBat PowerShell scripts uploaded to VirusTotal in\nNovember 2023.\n\n_Figure 25 VirusTotal Results_\n\nExamining one of these scripts (mypackage_cloud.ps1, MD5 4bb29818c628e7b2756fbfe83f62ce4e) we see the\ncommon FakeBat structure for retrieving encrypted payloads and disabling defenses.\n\n\n-----\n\n_Figure 26 FakeBat November 2023 PowerShell script._\n\n1. FakeBat has been observed to be consistently using $LoadDomen variable.\n\n2. The check-in URL structure with the C2 remains the same\n\n“$LoadDomen/?status=start&av=$Names&domain=$domain&os=$urlEncodedOsCaption”\n\n3. New antibot function: if the response from C2 is “404 HTTP Error”, the script exits, which means the server\n\nchecks if the user’s IP, user-agent is recorded in the panel and has the status “Downloaded” (the user\n\nwent to the malicious page and downloaded the MSIX installer). If the user’s IP is not in the panel, the\nPowerShell script exits.\n\n4. The “putin” password to decrypt the GPG-encrypted file. Previously, FakeBat threat actor(s) used\n\n“putingod” as the password.\n\nThe 3010cars[.]xyz domain closely matches the one provided in the sample video on their Telegram\n(3010cars[.]site). Both domains were registered by company “John Bolton”, a pseudonym we’ve linked to\nFakeBat. We identified approximately 36 domains tied to this pseudonym between September and November\n2023. The full list can be found in the appendix.\n\nFurther analysis of the November 2023 payload reveals the use of the IDAT loader technique previously observed\n[by a threat tracked as ClearFake, including use of DLL side-loading, Process Doppelgänging, and Heaven’s Gate](https://www.rapid7.com/blog/post/2023/08/31/fake-update-utilizes-new-idat-loader-to-execute-stealc-and-lumma-infostealers/)\ntechniques. Examining the contents of mypackage.tar found in Figure 26, we immediately notice an encrypted file\nwith an IDAT header (Figure 27 below).\n\n\n-----\n\n_Figure 27 Contents of mypackage.tar_\n\nExamining the accompanying Cl.dll file, it iterates over the IDAT headers until the tag is found, then grabs the next\n4 bytes after the tag and XOR’s it with the data starting at byte 14. After XOR-ing the data, the payload is\ndecompressed to reveal the second stage, a file which includes a configuration and encrypted final payload written\nto %TEMP%. The configuration contains the persistence location, the process for the final payload to be injected\n\ninto, etc.\n\n_Figure 28 Configuration File_\n\n\n-----\n\n|BatLoader|FakeBat|\n|---|---|\n|• C2 Format: o <unique_id/user_handle>/index/<subdir>/?servername=msi (e.g. d8uuw6/index/b1/?servername=msi) • Uses MSI CustomAction to execute PowerShell/Batch/Python scripts • Host fingerprinting (domain name, computer name, ARP) and custom payload logic during initial launch • Uses Pyarmor to obfuscate Python script (since February 2023)|• C2 format: o <domain>/?status=[start|install] o E.g. /?status=start • Uses MSI CustomAction to execute PowerShell/Batch • Not observed using Python scripts • Unsigned MSI files, signed MSIX • IDAT Loader • Some payloads encrypted during transit|\n\n\nIn this case the final payload was SektopRAT also known as ArechClient2 (MD5:\n025677d90ec6b21aa1be9a8f14642b26). In more recent cases, FakeBat was seen dropping both SektopRAT and\nRisePro stealer. While there seems to be similarities between the IDAT loader used in ClearFake campaigns, we do\nnot attribute them to the same actor. It’s likely that either FakeBat or their customer(s) copied or acquired tooling\n\nto create payloads using this loader. We don’t see overlap in distribution (ClearFake uses fake browser updates,\nFakeBat fake software via ads) infrastructure or payloads between the two campaigns.\n\n### A Brief Comparison Between BatLoader and FakeBat\n\nIt is probable that Eugenfest, as an initial customer of Afron’s loader, was heavily inspired by the operation and\nsought to replicate it. Their past activity suggests they likely outsourced or are working with other actors to\ndevelop and maintain the admin panel and loader functionality and like Afron, maintain access to backend data\nfrom their panels. Despite the similarities, there are some differences with respect to code execution, script\nstructure and C2 format which are summarized below.\n\n**BatLoader** **FakeBat**\n\n       - C2 Format:       - C2 format:\n\n`o` <unique_id/user_handle>/index/<subdir>/?servername=msi `o` <domain>/?status=[start|install]\n(e.g. d8uuw6/index/b1/?servername=msi) `o` E.g. /?status=start\n\n       - Uses MSI CustomAction to execute PowerShell/Batch/Python       - Uses MSI CustomAction to execute PowerShell/Batch\n\nscripts         - Not observed using Python scripts\n\n       - Host fingerprinting (domain name, computer name, ARP) and       - Unsigned MSI files, signed MSIX\n\ncustom payload logic during initial launch         - IDAT Loader\n\n       - [Uses Pyarmor to obfuscate Python script (since February 2023)](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)       - Some payloads encrypted during transit\n\n_Figure 29 Comparison between BatLoader (left) and FakeBat (right) loaders._\n\n\n-----\n\n### Security Recommendations to Protect Against the BatLoader and FakeBat MaaS\n\n      - Organizations need to start including browser-based attacks, including those that use malicious\nadvertisements, as part of Phishing and Security Awareness Training (PSAT). Browser-based attacks are\nincreasingly leading to hands-on ransomware intrusions and infostealers that enable ransomware\nintrusions later.\n\n      - Make sure you are implementing attack surface reduction rules around script files such as .js and .vbs, but\nkeep in mind that when these attacks arrive in .ISO files, the “Mark of the Web” is lost so Attack Surface\nReduction rules won’t detect the files from the Internet.\n\n      - Employ endpoint monitoring to ensure you can catch malicious execution, when social engineering attacks\nbypass user scrutiny – and make sure that endpoint coverage is fully comprehensive.\n\n      - Employ logging to ensure you are capturing telemetry – especially for devices and services that don’t\nsupport an endpoint agent, including VPN, device enrollment, and server software for applications that\ndon’t generate endpoint telemetry, like Citrix, IIS, and cloud services).\n\n[If you’re not currently engaged with a Managed Detection and Response (MDR) provider, we highly recommend](https://www.esentire.com/what-we-do/esentire-managed-detection-and-response)\nyou partner with us for security services to disrupt threats before they impact your business. To learn more,\n[connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\nFor additional information on BatLoader and FakeBat, please see our malware analysis and other reports on both\n\nthreats:\n\n[https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-batloader](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-batloader)\n\n[https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)\n[ursnif](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)\n\n[https://www.esentire.com/blog/fakebat-impersonates-midjourney-chatgpt-in-drive-by-cyberattacks](https://www.esentire.com/blog/fakebat-impersonates-midjourney-chatgpt-in-drive-by-cyberattacks)\n\n\n-----\n\n## APPENDIX A: Translated Forum Posts for BatLoader and FakeBat\n\n### Afron’s First Exploit Post (translated), Offering Fallout EK Installs\n\n_Installation of your software._\n\n_Good day._\n\n_I offer services for installing your software worldwide (Exception - Russian Federation, Kazakhstan, Belarus, Ukraine)._\n\n_You can find countries like Saint Kitts and Nevis, Liechtenstein, Andorra, and other small countries, principalities, states with me._\n\n_Service Rules:_\n\n_I do not provide refunds. Exception - After the agreed installation start date, 3 days have passed, and there are no statistics of pairs and triples of_\n_installations._\n\n_Traffic stop is possible for orders of 1000 installations or more. Please check the functionality of your FUD (Fully Undetected) file in advance._\n\n_When ordering traffic of 1000 installations or more, 1 traffic stop of up to 6 hours is possible for every 1000 installations. For example, for an order_\n_of 3000 installations, 3 traffic stops are possible, each not more than 6 hours, or you can use all 3 stops at once for 18 hours (6 hours * 3 stops =_\n_18 hours)._\n\n_I reserve the right to refuse service to any potential customer without providing reasons._\n\n_By paying for installations, you automatically agree to my rules._\n\n_Frequently Asked Questions:_\n\n_Question: Traffic source?_\n\n_Answer: Exchanges._\n\n_Question: What statistics are installations counted by?_\n\n_Answer: Installations are counted based on the Fallout exploit bundle statistics._\n\n_Question: Minimum order?_\n\n_Answer: 200 installations._\n\n_Question: How quickly will my order be executed?_\n\n_Answer: It depends on your country, discussed in JABBER._\n\n_Question: Why is there no refund, and what if I'm not satisfied with the quality of the loads? You sell loads at a markup!_\n\n_Answer: The traffic goes to a bundle, and the bundle only installs your file. I don't use a loader, so this is a guarantee that I sell installations only to_\n_one party. Therefore, there is NO refund!_\n\n_Question: Bro, my file doesn't call home. The bundle fakes the load statistics no worse than Picasso. I just checked the crypt; I have outbound traffic_\n\n_on my wallet. Are you here to work or rip people off?_\n\n_Answer: Your file may not call home because it doesn't have a way out of the low integrity level. In this case, you need to use a loader to install your_\n_software._\n\n_Prices for 1000 installations of your software._\n\n_America:_\n\n_United States of America: $1000_\n\n_Canada: $1000_\n\n_Mexico: $800_\n\n_Europe:_\n\n_United Kingdom: $1000_\n\n_Germany: $800_\n\n_Austria: $800_\n\n_Ireland: $800_\n\n\n-----\n\n_Netherlands: $700_\n\n_France: $700_\n\n_Italy: $700_\n\n_Spain: $700_\n\n_Poland: $700_\n\n_Oceania:_\n\n_Australia: $1000_\n\n_Asia:_\n\n_Japan: $1000_\n\n_Indonesia: $800_\n\n_Philippines: $800_\n\n_Turkey: $700_\n\n_Israel: $700_\n\n_Contact:_\n\n_000911000@nologs[.]club_\n\n_000911000@xmpp[.]jp_\n\n_000911000@0nl1ne[.]at_\n\n_P.S. I answer questions in Jabber (OTR), the top is only for reviews._\n\n_PP.SS. I'm waiting for the deposit details from support@exploit[.]in in the escrow._\n\n### Exploit Forum Post for DefeatDefenderLoader Posted: 3/12/2022 Retrieved: 2022\n\n_We've been in this field for over a year. Initially, we worked with bundles, but since that's no longer relevant, we_\n_created our own loader. We've been using it for over a year and decided to bring it to the market._\n\n_Brief description of functionality:_\n\n_Launching exe/dll with administrator or system privileges._\n\n_Full bypass of Windows Defender._\n\n_No alerts from SmartScreen - the loader is trusted._\n\n_Full bypass of Chrome, even if the user has maximum security settings._\n\n_Delivering different payloads if a corporate network is detected on the system._\n\n_The loader is provided in the form of a silent installer in MSI format._\n\n_The loader works on Windows 10-11 systems._\n\n_We are also developing our own bot with hidden functionality and many other features. We can provide a trial and_\n_usage details (contact us for more information)._\n\n_The loader is intended for use with landing pages. Sending spam is strictly prohibited. For spam purposes, create a_\n_landing page where your people from the spam will visit, and then I will allow it._\n\n\n-----\n\n_The rental cost is $4500 per month. I'm willing to accommodate people if you encounter launch problems and_\n_need an extension of the rental for free._\n\n_I agree to use an escrow service for the transaction, and the buyer will cover the fees._\n\n_Contact Information:_\n\n_Telegram: https://t[.]me/DefeatDefenderLoader\"_\n\n### Exploit Forum Post for BatLoader Posted:5/13/2022 Retrieved: 2022\n\n_[RENT] Bank-Bot HVNC/Socks/Stealer/Injection/FormGrabber + Loader with bypass for Google Alerts/SmartScreen/Windows_\n_Defender._\n\n_Good day,_\n\n_I'm offering for rent:_\n\n_1. Loader with bypass for Google Alerts/SmartScreen/Windows Defender._\n\n_2. Bot with form grabbing/injection/Hide-VNC/socks/cookies/Stealer modules._\n\n_The rental cost includes everything:_\n\n_* Servers for the admin panel._\n\n_* Proxy server for proxying requests._\n\n_* Backup domains._\n\n_* Crypt._\n\n_Now the loader starts without the UAC prompt. Finally, the loader works with user privileges. We request admin privileges from_\n_the user at the very end. The payload will be executed only if the user has admin privileges._\n\n_From user privileges, there will be a callback to the admin panel. If the loader is stuck there, it means there are no admin_\n_privileges on the machine._\n\n_We can load the payload on machines without admin privileges as well, but the price will be different._\n\n_- The loader is always signed with a valid EV certificate (no one else offers this on the forum)._\n\n_- Finally, there is full detection of corporate networks on the loader (the payload is unloaded based on this)._\n\n_- Loader conversion rate is up to 80% of those who download it._\n\n_- Guaranteed functionality on Windows 10-11 systems._\n\n_- Full bypass of Windows Defender, SmartScreen, and Chrome._\n\n_- The loader finally works with user privileges without the UAC prompt._\n\n_- The loader can load any payloads, starting from .EXE, .DLL, and ending with Powershell .ps scripts and Python .py scripts._\n\n_- In conjunction with the loader, we provide a Bot (HVNC/Socks/Stealer/Injection/FormGrabber). The bot's callback from the_\n_loader accounts for approximately 50%._\n\n_- We add more than 20 exclusions to Windows Defender._\n\n_The process of converting a surfer into a bot:_\n\n\n-----\n\n_The surfer searches and finds your advertisement, clicks, lands on the White Page, passes all checks, and your cloaker displays_\n_the Black Page on which the surfer downloads the loader._\n\n_The loader is tailored individually for each tenant, meaning I perform a complete installation of donor software. In the end, the_\n_surfer receives what they came for, whether it's the Brave browser, Zoom, or some lesser-known PDF Reader._\n\n_Accordingly, along with the necessary software for the surfer, the Bank Bot is installed in their system. There is also the possibility_\n_to install the bot in parallel with your additional payload._\n\n_Loader functionality for Google Ads:_\n\n_* The loader works on Windows 10/11._\n\n_* Launching exe/dll/msi with administrator or system privileges._\n\n_* Full bypass of Windows Defender._\n\n_* No alerts from SmartScreen (trusted loader)._\n\n_* Full bypass of Google Chrome, even if the user has maximum security settings._\n\n_* Different payloads are delivered depending on the network structure:_\n\n_1. User network:_\n\n_- Loading one or several payloads._\n\n_2. Corporate network:_\n\n_- Loading payloads only if the machine is in a domain._\n\n_- The machine name must not match the Domain parameter._\n\n_- ARP table contains 3+ records (parameter can be adjusted) with addresses of local subnets (192.168., 10., 172.)._\n\n_- The domain must not be equal to WORKGROUP._\n\n_Bank Bot functionality:_\n\n_* The bot works on Windows 7/8/8.1/10/11._\n\n_* Injection into Edge/FireFox/Chrome (the required injection format is ISFB)._\n\n_* Form Grabber (real-time grabbing of forms from the browser)._\n\n_* Stealer (stealing passwords from Chrome/Edge/Firefox)._\n\n_* HVNC (Hidden VNC. When you open a browser on the victim's machine, the user won't see anything) (Chrome, Firefox)._\n\n_* Socks (setting up socks on the bot)._\n\n_* Cookie (grabbing cookies from browsers)._\n\n_Frequently Asked Questions:_\n\n_* Is the loader resident?_\n\n_- No. But it is possible to load multiple payloads._\n\n_* Can the loader be rented for spam?_\n\n_- No. The loader won't perform spam._\n\n_* Is daily or weekly rental possible?_\n\n_- No. I won't spend time on testers._\n\n_* Do you provide a landing page?_\n\n\n-----\n\n_- No. But I can give you some advice in this direction._\n\n_* Is it necessary to encrypt the loader and bank bot?_\n\n_- No. Encryption is included in the rental cost._\n\n_* Do I need to rent a server for the loader/bank bot admin panel?_\n\n_- No. The admin panel of the loader and bank bot is installed on my servers._\n\n_* Do I need to buy domains to set up proxy servers to avoid abuse on the admin panel?_\n\n_- No. I cover all expenses, servers, proxies, domains, and encryption._\n\n_* What is the callback rate?_\n\n_- Typically, it's around 50%. It depends on whether there are third-party AVs on the machine._\n\n_* Is it possible to bypass other AVs?_\n\n_- At the moment, it guarantees bypassing SmartScreen/Windows Defender._\n\n_* What is the bot's lifespan in the system?_\n\n_- Almost forever; the bot is added to the Windows Defender exclusion list. Scanning the system upon the user's request will also_\n\n_yield nothing. The claimed lifespan only applies to Windows Defender._\n\n_* Is it possible to bypass \"File is downloaded rarely, it may be malicious\" in Google Chrome?_\n\n_- Yes, this alert is bypassed by the loaders._\n\n_Rental terms:_\n\n_1. I accept payment either directly or through an escrow service._\n\n_2. You verify the claimed functionality (48 hours for testing). During testing, loading traffic is PROHIBITED! If everything claimed_\n_is present, you release the funds from the escrow, otherwise, you retrieve the money._\n\n_Rental price:_\n\n_* $4000 per month (4 weeks)._\n\n_Contact:_\n\n_* Send your Jabber or Tox contact in a private message. I do not use other messengers._\n\n_P.S. I only respond to questions in Jabber or Tox._\n\n### Exploit Forum Post for BatLoader, Updated – Retrieved 09/14/2023\n\n_I offer for rent:_\n\n_1. Non-resident loader for Google/Bing Ads with bypassing Google Alerts/Smart Screen/Windows Defender. (We_\n_are the authors)_\n\n_2. Resident loader (referred to as \"anchor\") for corporate networks (We are the authors)_\n\n_3. DanaBot banking trojan, software author is JimmBee._\n\n\n-----\n\n_I offer work based on a percentage:_\n\n_1. You transfer $3000 one-time (through the guarantee of this forum) to demonstrate the seriousness of your_\n_intentions._\n\n_2. You get the opportunity to use everything I offer for rent, including the resident loader for corporate networks._\n\n_3. Launch of the Payload with user/admin privileges._\n\n_4. The terms of work for a percentage and the percentage itself are discussed individually with each interested_\n_party._\n\n_The process of converting surfers into bots:_\n\n_The surfer searches on a search engine, sees your advertisement, clicks on it, lands on a White Page, passes all_\n_checks. Your cloaker displays a Black Page, on which the surfer downloads the loader._\n\n_The loader is customized individually for each tenant, i.e., I perform a full installation of the donor software. The_\n_surfer ultimately gets what they came for, whether it's the Brave browser, Zoom, or some lesser-known PDF Reader._\n\n_After the loader is launched, it starts working with user privileges (only if you work for a percentage), then it_\n_requests admin privileges. It detects the environment in which the loader was launched, whether it's a regular_\n_machine or a corporate network, and installs the Payload along with the desired software._\n\n_Depending on the environment in which the loader is launched, it is possible to load completely different Payloads._\n\n_For regular machines, I recommend loading the DanaBot banking trojan, and for corporate networks, my anchor_\n_(resident loader)._\n\n_Do you have custom software? No problem, the loader can load it in parallel or only that software. Any whim, but at_\n_your expense._\n\n_Functionality of the non-resident loader for Google/Bing Ads:_\n\n_- The loader works on Windows 10/11._\n\n_- Launches exe/dll/ps1/py with admin privileges (launch with user privileges is only possible when working for a_\n\n_percentage)._\n\n_- Completely bypasses Windows Defender._\n\n_- No Smart Screen alerts (the loader is signed with an EV certificate)._\n\n_- Fully bypasses Google Chrome, even if the user has maximum security settings._\n\n_- Provides different Payloads depending on the environment in which the loader is launched:_\n\n_1. Regular machine:_\n\n_- Loads one or more Payloads._\n\n_2. Corporate network:_\n\n_- Loads Payload only if the machine is in a domain._\n\n_- The machine name must not be equal to the Domain parameter._\n\n\n-----\n\n_- The ARP table contains 3+ entries (parameter can be changed) with addresses of local subnets (192.168., 10.,_\n_172.)._\n\n_- The domain must not be equal to WORKGROUP._\n\n_Functionality of the resident loader for corporate networks:_\n\n_- The loader works on Windows 10/11._\n\n_- Launches exe/dll with user/admin privileges._\n\n_Functionality of the DanaBot banking trojan:_\n\n_- Works on Windows 7/8/8.1/10/11._\n\n_- Injection._\n\n_- Keylogger._\n\n_- Formgrabber CH/ED/IE/FF/OP._\n\n_- Stealer CH/ED/IE/FF/OP._\n\n_- HVNC._\n\n_- Socks._\n\n_- Cookie._\n\n_- And much more, read further in the DanaBot Banking Trojan thread._\n\n_Frequently Asked Questions (loader/anchor):_\n\n_- Is it possible to rent the loader for spamming?_\n\n_- No, the loader won't work for spamming._\n\n_- Is it possible to rent by the day/week?_\n\n_- No, I won't spend time on testers._\n\n_- Do you provide Landing Pages?_\n\n_- Yes, this service is paid separately._\n\n_- Do you need to crypt the loader/anchor?_\n\n_- No, encryption is included in the rental price._\n\n_- Do you need to rent a server for the loader/anchor admin panel?_\n\n_- No, the admin panel for the loader/anchor is installed on my servers._\n\n_- Do you need to buy domains to set up proxy servers to avoid abuse on the admin panel?_\n\n_- No, I cover all expenses, servers, proxies, domains, encryption._\n\n_- What's the payout percentage?_\n\n_- Usually starts from 50%. It depends on whether there are third-party AVs on the machine._\n\n\n-----\n\n_- Is it possible to bypass Google Chrome's \"File is rarely downloaded, it may be malicious\" alert?_\n\n_- Yes, this alert is bypassed by the loader._\n\n_Rental terms:_\n\n_1. I accept payment either directly or through the guarantee of this forum (payment for the guarantee's services is_\n_at your expense)._\n\n_2. Payment is accepted only for the loader/anchor; payment for the DanaBot banking trojan is made directly to the_\n_author JimmBee, and you will receive the details only through PM._\n\n_3. You verify the claimed functionality (48 hours for verification). During the verification, it is FORBIDDEN to load_\n_traffic!_\n\n### Exploit Forum Post for Eugenfest’s FakeBat Posted:12/17/2022 Retrieved: 09/14/2023\n\n_Two versions of the loader are available for rent:_\n\n_MSI:_\n\n_Bypasses Google Alerts (if the domain is trusted)_\n\n_Bypasses Windows Defender_\n\n_Embeds exceptions for your malware in the defender_\n\n_Protection against VirusTotal_\n\n_Completely severs the connections between your malware and the loader; AVs do not detect the connections_\n\n_File size ranges from 2-3 MB and beyond_\n\n_Adapts to official software, meaning the software downloaded by the user, which is then installed on the system_\n\n_Video with an example of operation: Video Link_\n\n_Cons: You need to use an EV certificate to bypass SmartScreen, or you can warm up the file (your choice)_\n\n_Padings for the build are added_\n\n_Pricing:_\n\n_Monthly: $2500_\n\n_Weekly: $1000_\n\n_MSIX:_\n\n_Bypasses Google Alerts by default_\n\n_Protection against VirusTotal_\n\n_Completely severs the connections between your malware and the loader; AVs do not detect the connections_\n\n_File size ranges from 2-3 MB and beyond_\n\n\n-----\n\n_Adapts to official software, meaning the software downloaded by the user, which is then installed on the system_\n\n_Bypasses Microsoft SmartScreen by default_\n\n_The file is signed with a valid certificate_\n\n_Video with an example of operation: Video Link_\n\n_Padings for the build are added_\n\n_Cons:_\n\n_No possibility to embed exceptions for Windows Defender_\n\n_Your malware needs to be better encrypted because the loader does not trigger Defender_\n\n_Pricing:_\n\n_Monthly: $4000_\n\n_Weekly: $1500_\n\n_Injecting admin privileges at startup to add exceptions for Defender (available for $300 as a separate service)_\n\n_Meta stealer shows 85%+ success rate from loader startup_\n\n_Introduction of the project: checking for all possible alerts, setting up integration with the landing page, monitoring_\n_loader files and changing them as alerts appear, issuance on our side_\n\n_Service pricing:_\n\n_Varies depending on the complexity of the project, starting from $3000 and higher without considering the loader_\n\n_Panel features:_\n\n_Convenient web panel_\n\n_Collects various data, including IP, country, OS, browser, landing page, installed antivirus_\n\n_Statuses: Downloaded, Launched, Installed_\n\n_Blacklist by countries_\n\n_Blacklist by devices_\n\n_Subscription time displayed on the main page_\n\n_Easy on-the-fly build change from the admin panel_\n\n_Added protection via API Key; you can turn off the build on the fly_\n\n_API Key for the panel; you can't log in without it_\n\n_Contact Information:_\n\n_Tox ID for Admin:_\n_0BF0BA66030916F61BB7D9E954FB98A8F973DB6531F18EB6CEE006D7E275B906BC58EB71F358_\n\n\n-----\n\n_Tox ID for Support:_\n_7CB85C41D6E3FC9602FB8D79B955820AC4EEF41F29F2177B9750C129935F216FE0573DA8899F_\n\n_Telegram Admin: https://t[.]me/payk_work_\n\n_Telegram Support: https://t[.]me/spektr234_\n\n_Please verify the contacts, or it's better to verify through the forum's private messages._\n\n_Disclaimer:_\n\n_This software is provided \"as is,\" without any warranties, express or implied, including but not limited to the_\n_implied warranties of merchantability, fitness for a particular purpose, and non-infringement of rights. In no event_\n_shall the authors or copyright holders be liable for any claims, damages, or other liability, whether in an action of_\n_contract, tort, or otherwise, arising from, out of, or in connection with the software or the use or other dealings in_\n_the software._\n\n_Users agree to use this software for educational purposes only. Any commercial use, abuse, or illegal use of the_\n_software is strictly prohibited. Users are solely responsible for any consequences resulting from their use of this_\n_software._\n\n_Users take full responsibility for using this software, including any negative consequences that may arise from its_\n_use._\n\n\n-----\n\n|APPENDIX B: Handles|Linked to Eugenfest|\n|---|---|\n|Handle|Source|\n|Payk_34|XSS Forum|\n|Eugenfest|Exploit Forums|\n|Eugenfest|Nexus.gg|\n|Eugenfest|Lzt Market|\n|Eugenfest|Carder UK Forums|\n|@Eugenfestkey_bot|Telegram|\n|@fest_bay_buy_bot|Telegram|\n|Eugene Fest|BHF Forums|\n|@payk_work|Telegram|\n|@lola.cuferz|Vimeo|\n|@wabowej290|Vimeo|\n|festik|BHF Forums|\n|festik|DarkMoney|\n|festik|OpenCard|\n|festik|BDF Forums|\n|festik|Migalki|\n|M1rages|WWH Club|\n|M1rages|Blackbiz|\n|M1rages|Carder PK|\n|M1rages|Moon Forum|\n|M1rages|Dublikat|\n|M1rages|Bbiz|\n|M1rages|Miped|\n\n\n## APPENDIX B: Handles Linked to Eugenfest\n\n**Handle** **Source**\n\nPayk_34 XSS Forum\n\nEugenfest Exploit Forums\n\nEugenfest Nexus.gg\n\nEugenfest Lzt Market\n\nEugenfest Carder UK Forums\n\n@Eugenfestkey_bot Telegram\n\n@fest_bay_buy_bot Telegram\n\nEugene Fest BHF Forums\n\n@payk_work Telegram\n\n@lola.cuferz Vimeo\n\n@wabowej290 Vimeo\n\nfestik BHF Forums\n\nfestik DarkMoney\n\nfestik OpenCard\n\nfestik BDF Forums\n\nfestik Migalki\n\nM1rages WWH Club\n\nM1rages Blackbiz\n\nM1rages Carder PK\n\nM1rages Moon Forum\n\nM1rages Dublikat\n\nM1rages Bbiz\n\nM1rages Miped\n\n\n-----\n\n|Domain Name|Created|\n|---|---|\n|ads-check[.]com|22-Nov-22|\n|down[.]software|22-Nov-22|\n|awesome-miner[.]software|24-Nov-22|\n|winrar[.]software|24-Nov-22|\n|qtorrent[.]software|24-Nov-22|\n|ccleaner[.]software|8-Dec-22|\n|mail-client[.]software|8-Dec-22|\n|lightshot[.]software|9-Dec-22|\n|top-wallet[.]software|9-Dec-22|\n|pdf-tools[.]software|9-Dec-22|\n|rufus-download[.]software|10-Dec-22|\n|downloaders[.]software|12-Dec-22|\n|any-desk[.]software|20-Dec-22|\n|down1[.]software|20-Dec-22|\n|download1[.]software|23-Dec-22|\n|tor-browser[.]software|23-Dec-22|\n|vlc-media[.]software|23-Dec-22|\n|adscheck[.]net|8-Jan-23|\n|rar-lab[.]software|8-Jan-23|\n|filezilla[.]space|11-Jan-23|\n|torrent-tools[.]software|12-Jan-23|\n|notepad-editor[.]software|13-Jan-23|\n|aimp[.]software|13-Jan-23|\n\n\n## APPENDIX C: Other Network Indicators\n\n### Domains associated with Ads_CHECKLLC\n\n**Domain Name** **Created**\n\nads-check[.]com 22-Nov-22\n\ndown[.]software 22-Nov-22\n\nawesome-miner[.]software 24-Nov-22\n\nwinrar[.]software 24-Nov-22\n\nqtorrent[.]software 24-Nov-22\n\nccleaner[.]software 8-Dec-22\n\nmail-client[.]software 8-Dec-22\n\nlightshot[.]software 9-Dec-22\n\ntop-wallet[.]software 9-Dec-22\n\npdf-tools[.]software 9-Dec-22\n\nrufus-download[.]software 10-Dec-22\n\ndownloaders[.]software 12-Dec-22\n\nany-desk[.]software 20-Dec-22\n\ndown1[.]software 20-Dec-22\n\ndownload1[.]software 23-Dec-22\n\ntor-browser[.]software 23-Dec-22\n\nvlc-media[.]software 23-Dec-22\n\nadscheck[.]net 8-Jan-23\n\nrar-lab[.]software 8-Jan-23\n\nfilezilla[.]space 11-Jan-23\n\ntorrent-tools[.]software 12-Jan-23\n\nnotepad-editor[.]software 13-Jan-23\n\naimp[.]software 13-Jan-23\n\n\n-----\n\n|kmplayer[.]software|13-Jan-23|\n|---|---|\n|archiver-7zip[.]software|13-Jan-23|\n|awesome-project[.]software|16-Jan-23|\n|extremebot[.]software|16-Jan-23|\n|trading-terminal[.]software|19-Jan-23|\n|heartcores[.]net|8-Feb-23|\n|digmefitness[.]net|8-Feb-23|\n|psyclelondon[.]net|8-Feb-23|\n|terminal-trading[.]software|9-Feb-23|\n|id-cpu[.]software|9-Feb-23|\n|download-rufus[.]software|9-Feb-23|\n\n|Domain Name|Email|Name|Company|Created|\n|---|---|---|---|---|\n|ftofailhvgnfxgvgkjsj[.]com|wbhulhrpjymgnmumpl@pptrvv[.]com|Dlaoijs Uoksia|Private Person|28-Sep-21|\n|teambatfor[.]com|ilhtdcgyfpztdqvkqf@pptrvv[.]com|Dlaoijs Uoksia|Private Person|28-Sep-21|\n|girlspremiumporno[.]com|nqbbjenocsmxquokmm@mrvpt[.]com|Dlaoijs Uoksia|Private Person|26-Sep-21|\n|teamviewer-t[.]com|ltslheaztbibeshnfw@adfskj[.]com|Dlaoijs Uoksia|Private Person|26-Sep-21|\n|teamviewer-a[.]com|sdmtuktdtxmhgvvkoq@sdvrecft[.]com|Dlaoijs Uoksia|Private Person|23-Sep-21|\n|vhdos100[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|22-Sep-21|\n|zoomvideo-a[.]com|sdmtuktdtxmhgvvkoq@sdvrecft[.]com|Dlaoijs Uoksia|Private Person|23-Sep-21|\n|discord-a[.]com|sdmtuktdtxmhgvvkoq@sdvrecft[.]com|Dlaoijs Uoksia|Private Person|23-Sep-21|\n|zooms-video[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|21-Sep-21|\n|etjmejjcxjtwweitluuw[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|21-Sep-21|\n|fkqqhmkavarmsxnucflq[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|20-Sep-21|\n|discord-o[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|19-Sep-21|\n\n\nkmplayer[.]software 13-Jan-23\n\narchiver-7zip[.]software 13-Jan-23\n\nawesome-project[.]software 16-Jan-23\n\nextremebot[.]software 16-Jan-23\n\ntrading-terminal[.]software 19-Jan-23\n\nheartcores[.]net 8-Feb-23\n\ndigmefitness[.]net 8-Feb-23\n\npsyclelondon[.]net 8-Feb-23\n\nterminal-trading[.]software 9-Feb-23\n\nid-cpu[.]software 9-Feb-23\n\ndownload-rufus[.]software 9-Feb-23\n\n### Domains associated with seledka[.]prostokvash@rambler[.]ru/ Dlaoijs Uoksia\n\n**Domain Name** **Email** **Name** **Company** **Created**\n\nftofailhvgnfxgvgkjsj[.]com wbhulhrpjymgnmumpl@pptrvv[.]com Dlaoijs Uoksia Private Person 28-Sep-21\n\nteambatfor[.]com ilhtdcgyfpztdqvkqf@pptrvv[.]com Dlaoijs Uoksia Private Person 28-Sep-21\n\ngirlspremiumporno[.]com nqbbjenocsmxquokmm@mrvpt[.]com Dlaoijs Uoksia Private Person 26-Sep-21\n\nteamviewer-t[.]com ltslheaztbibeshnfw@adfskj[.]com Dlaoijs Uoksia Private Person 26-Sep-21\n\nteamviewer-a[.]com [sdmtuktdtxmhgvvkoq@sdvrecft[.]com](about:blank) Dlaoijs Uoksia Private Person 23-Sep-21\n\nvhdos100[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 22-Sep-21\n\nzoomvideo-a[.]com sdmtuktdtxmhgvvkoq@sdvrecft[.]com Dlaoijs Uoksia Private Person 23-Sep-21\n\ndiscord-a[.]com sdmtuktdtxmhgvvkoq@sdvrecft[.]com Dlaoijs Uoksia Private Person 23-Sep-21\n\nzooms-video[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 21-Sep-21\n\netjmejjcxjtwweitluuw[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 21-Sep-21\n\nfkqqhmkavarmsxnucflq[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 20-Sep-21\n\ndiscord-o[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 19-Sep-21\n\n\n-----\n\n|teamviewer-o[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|19-Sep-21|\n|---|---|---|---|---|\n|ugrikambal[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|19-Sep-21|\n|zoomvideo-offers[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|19-Sep-21|\n|pornoloveshd[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|17-Sep-21|\n|pornobossvideo[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|17-Sep-21|\n|zoomvideo-online[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|17-Sep-21|\n|updatemsicheck[.]com|seledka[.]prostokvash@rambler[.]ru|Dlaoijs Uoksia|dsoaikjmdn o|16-Sep-21|\n|updatescript[.]online|seledka[.]prostokvash@rambler[.]ru|dsoaikjmdn o|dsoaikjmdn o|18-Sep-21|\n\n|Domain|Email|Created|\n|---|---|---|\n|pornoxxxclu[.]com|abdel@info-electronics[.]com|5-Jan-22|\n|pornoxxxclubz[.]com|abdel@info-electronics[.]com|4-Jan-22|\n|pornoxxxclubs[.]com|abdel@info-electronics[.]com|3-Jan-22|\n|hytvejdhypibwwvqiaxc[.]com|abdel@info-electronics[.]com|26-Sep-21|\n|shhkxdewbjavgrfgkqoy[.]com|abdel@info-electronics[.]com|25-Sep-21|\n|yybysufealtubvyvuvdj[.]com|abdel@info-electronics[.]com|23-Sep-21|\n|aofacfbgxiuuxxsbiajb[.]com|abdel@info-electronics[.]com|23-Sep-21|\n|lyrqaoorgcrkwrmiwaat[.]com|abdel@info-electronics[.]com|19-Sep-21|\n|mohypixvrhydduxrrvjm[.]com|abdel@info-electronics[.]com|18-Sep-21|\n|dxieibgdelreujkvlxyb[.]com|abdel@info-electronics[.]com|17-Sep-21|\n|teamvieweronlines[.]com|abdel@info-electronics[.]com|17-Sep-21|\n|zoomonliness[.]com|abdel@info-electronics[.]com|17-Sep-21|\n|zoom-offer[.]com|abdel@info-electronics[.]com|15-Sep-21|\n|discord-offer[.]com|abdel@info-electronics[.]com|15-Sep-21|\n|teamviewer-offers[.]com|abdel@info-electronics[.]com|15-Sep-21|\n\n\nteamviewer-o[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 19-Sep-21\n\nugrikambal[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 19-Sep-21\n\nzoomvideo-offers[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 19-Sep-21\n\npornoloveshd[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 17-Sep-21\n\npornobossvideo[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 17-Sep-21\n\nzoomvideo-online[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 17-Sep-21\n\nupdatemsicheck[.]com seledka[.]prostokvash@rambler[.]ru Dlaoijs Uoksia dsoaikjmdn o 16-Sep-21\n\nupdatescript[.]online seledka[.]prostokvash@rambler[.]ru dsoaikjmdn o dsoaikjmdn o 18-Sep-21\n\n### Domains associated with abdel@info-electronics[.]com\n\n**Domain** **Email** **Created**\n\npornoxxxclu[.]com abdel@info-electronics[.]com 5-Jan-22\n\npornoxxxclubz[.]com abdel@info-electronics[.]com 4-Jan-22\n\npornoxxxclubs[.]com abdel@info-electronics[.]com 3-Jan-22\n\nhytvejdhypibwwvqiaxc[.]com abdel@info-electronics[.]com 26-Sep-21\n\nshhkxdewbjavgrfgkqoy[.]com abdel@info-electronics[.]com 25-Sep-21\n\nyybysufealtubvyvuvdj[.]com abdel@info-electronics[.]com 23-Sep-21\n\naofacfbgxiuuxxsbiajb[.]com abdel@info-electronics[.]com 23-Sep-21\n\nlyrqaoorgcrkwrmiwaat[.]com abdel@info-electronics[.]com 19-Sep-21\n\nmohypixvrhydduxrrvjm[.]com abdel@info-electronics[.]com 18-Sep-21\n\ndxieibgdelreujkvlxyb[.]com abdel@info-electronics[.]com 17-Sep-21\n\nteamvieweronlines[.]com abdel@info-electronics[.]com 17-Sep-21\n\nzoomonliness[.]com abdel@info-electronics[.]com 17-Sep-21\n\nzoom-offer[.]com abdel@info-electronics[.]com 15-Sep-21\n\ndiscord-offer[.]com abdel@info-electronics[.]com 15-Sep-21\n\nteamviewer-offers[.]com abdel@info-electronics[.]com 15-Sep-21\n\n\n-----\n\n|vnpoteigytgnnpfcjfdf[.]com|abdel@info-electronics[.]com|15-Sep-21|\n|---|---|---|\n|datalystoy[.]com|abdel@info-electronics[.]com|14-Sep-21|\n|offer-teamviewer[.]com|abdel@info-electronics[.]com|14-Sep-21|\n|offer-zoom[.]com|abdel@info-electronics[.]com|14-Sep-21|\n|kyvxtkuvghffbnkyaoic[.]com|abdel@info-electronics[.]com|14-Sep-21|\n|clkbevpidcdpwomsusvi[.]com|abdel@info-electronics[.]com|13-Sep-21|\n|checksoftupdate[.]com|abdel@info-electronics[.]com|12-Sep-21|\n|egoeedkmacyfovdadiun[.]com|abdel@info-electronics[.]com|12-Sep-21|\n|qeuptaiipealjuhotxjw[.]com|abdel@info-electronics[.]com|11-Sep-21|\n|sntpxhoaeujkmavavarm[.]com|abdel@info-electronics[.]com|10-Sep-21|\n|zoomvideo-offer[.]com|abdel@info-electronics[.]com|9-Sep-21|\n|teamviewer-offer[.]com|abdel@info-electronics[.]com|9-Sep-21|\n|oxliukycgapnhwxckbbi[.]com|abdel@info-electronics[.]com|9-Sep-21|\n|bobskijonofnkhbnoyfr[.]com|abdel@info-electronics[.]com|8-Sep-21|\n|loiyvxttcdjbfjotkogw[.]com|abdel@info-electronics[.]com|31-Aug-21|\n|wktmdwltncxmttfxskip[.]com|abdel@info-electronics[.]com|29-Aug-21|\n|klbaccpoqquilwmyaxcy[.]com|abdel@info-electronics[.]com|25-Aug-21|\n|srnooqsyspcxjtwjeydg[.]com|abdel@info-electronics[.]com|24-Aug-21|\n|umyepsquetgehkloltov[.]com|abdel@info-electronics[.]com|23-Aug-21|\n|jvuhcxipuqbrierereqm[.]com|abdel@info-electronics[.]com|21-Aug-21|\n|tcfoywhpcoyompmnbpps[.]com|abdel@info-electronics[.]com|20-Aug-21|\n|pornhubpremiuma[.]com|abdel@info-electronics[.]com|11-Aug-21|\n|lmlrvvgxbcfxvyplnito[.]com|abdel@info-electronics[.]com|11-Aug-21|\n|pornostarspremiums[.]com|abdel@info-electronics[.]com|8-Aug-21|\n|cmhxwbkplijrlvswubai[.]com|abdel@info-electronics[.]com|4-Aug-21|\n|vauodyrnlktmtlqnjifk[.]com|abdel@info-electronics[.]com|9-Jul-21|\n\n\nvnpoteigytgnnpfcjfdf[.]com abdel@info-electronics[.]com 15-Sep-21\n\ndatalystoy[.]com abdel@info-electronics[.]com 14-Sep-21\n\noffer-teamviewer[.]com abdel@info-electronics[.]com 14-Sep-21\n\noffer-zoom[.]com abdel@info-electronics[.]com 14-Sep-21\n\nkyvxtkuvghffbnkyaoic[.]com abdel@info-electronics[.]com 14-Sep-21\n\nclkbevpidcdpwomsusvi[.]com abdel@info-electronics[.]com 13-Sep-21\n\nchecksoftupdate[.]com abdel@info-electronics[.]com 12-Sep-21\n\negoeedkmacyfovdadiun[.]com abdel@info-electronics[.]com 12-Sep-21\n\nqeuptaiipealjuhotxjw[.]com abdel@info-electronics[.]com 11-Sep-21\n\nsntpxhoaeujkmavavarm[.]com abdel@info-electronics[.]com 10-Sep-21\n\nzoomvideo-offer[.]com abdel@info-electronics[.]com 9-Sep-21\n\nteamviewer-offer[.]com abdel@info-electronics[.]com 9-Sep-21\n\noxliukycgapnhwxckbbi[.]com abdel@info-electronics[.]com 9-Sep-21\n\nbobskijonofnkhbnoyfr[.]com abdel@info-electronics[.]com 8-Sep-21\n\nloiyvxttcdjbfjotkogw[.]com abdel@info-electronics[.]com 31-Aug-21\n\nwktmdwltncxmttfxskip[.]com abdel@info-electronics[.]com 29-Aug-21\n\nklbaccpoqquilwmyaxcy[.]com abdel@info-electronics[.]com 25-Aug-21\n\nsrnooqsyspcxjtwjeydg[.]com abdel@info-electronics[.]com 24-Aug-21\n\numyepsquetgehkloltov[.]com abdel@info-electronics[.]com 23-Aug-21\n\njvuhcxipuqbrierereqm[.]com abdel@info-electronics[.]com 21-Aug-21\n\ntcfoywhpcoyompmnbpps[.]com abdel@info-electronics[.]com 20-Aug-21\n\npornhubpremiuma[.]com abdel@info-electronics[.]com 11-Aug-21\n\nlmlrvvgxbcfxvyplnito[.]com abdel@info-electronics[.]com 11-Aug-21\n\npornostarspremiums[.]com abdel@info-electronics[.]com 8-Aug-21\n\ncmhxwbkplijrlvswubai[.]com abdel@info-electronics[.]com 4-Aug-21\n\nvauodyrnlktmtlqnjifk[.]com abdel@info-electronics[.]com 9-Jul-21\n\n\n-----\n\n|websekir[.]com|abdel@info-electronics[.]com|7-Jul-21|\n|---|---|---|\n|ifnprhfyflwgthmewfnm[.]com|abdel@info-electronics[.]com|7-Jul-21|\n|fqnvtmqsbrrxrltbkpxn[.]com|abdel@info-electronics[.]com|5-Jul-21|\n|novgubfisdtbtdpdvseg[.]com|abdel@info-electronics[.]com|28-Jun-21|\n|iicyxgjntvhqqwawfury[.]com|abdel@info-electronics[.]com|27-Jun-21|\n|jtdxusbkrdkforusyisi[.]com|abdel@info-electronics[.]com|26-Jun-21|\n|xdnvxapnkomttrggytcb[.]com|abdel@info-electronics[.]com|25-Jun-21|\n|pornohabspremium[.]com|abdel@info-electronics[.]com|23-Jun-21|\n|ifbtkwenidpwcpidnuri[.]com|abdel@info-electronics[.]com|23-Jun-21|\n|hpvyrsupwexkdagpwipb[.]com|abdel@info-electronics[.]com|22-Jun-21|\n|mjjtncwnvemxhreqxpmq[.]com|abdel@info-electronics[.]com|21-Jun-21|\n|lmpvjicjvvfuyhefeohy[.]com|abdel@info-electronics[.]com|20-Jun-21|\n|syklkgebottfhusikojb[.]com|abdel@info-electronics[.]com|19-Jun-21|\n|ykcqxqltrjtnckeovymb[.]com|abdel@info-electronics[.]com|17-Jun-21|\n|bsaxotnpiaadlgapkmua[.]com|abdel@info-electronics[.]com|16-Jun-21|\n|ixtjopopsynvxsvbjvtj[.]com|abdel@info-electronics[.]com|14-Jun-21|\n|gdugytcwkepvykcqxpmu[.]com|abdel@info-electronics[.]com|13-Jun-21|\n|teejdhytvemagqdfalah[.]com|abdel@info-electronics[.]com|12-Jun-21|\n|qwernxwrilhvhnaeuikn[.]com|abdel@info-electronics[.]com|11-Jun-21|\n|tdfkntyofkrhcemrlphx[.]com|abdel@info-electronics[.]com|10-Jun-21|\n|xlvddtbgobmrrmmlirjl[.]com|abdel@info-electronics[.]com|9-Jun-21|\n|srwhpvikxwoxfmgotrje[.]com|abdel@info-electronics[.]com|6-Jun-21|\n|qwqnvhnqevofauhlolmv[.]com|abdel@info-electronics[.]com|5-Jun-21|\n|jkahgubfctyrtqjfgtto[.]com|abdel@info-electronics[.]com|4-Jun-21|\n|wmwubjmjjhrtngbtwkhg[.]com|abdel@info-electronics[.]com|3-Jun-21|\n|usmsmsmsvapiikmcrnup[.]com|abdel@info-electronics[.]com|2-Jun-21|\n\n\nwebsekir[.]com abdel@info-electronics[.]com 7-Jul-21\n\nifnprhfyflwgthmewfnm[.]com abdel@info-electronics[.]com 7-Jul-21\n\nfqnvtmqsbrrxrltbkpxn[.]com abdel@info-electronics[.]com 5-Jul-21\n\nnovgubfisdtbtdpdvseg[.]com abdel@info-electronics[.]com 28-Jun-21\n\niicyxgjntvhqqwawfury[.]com abdel@info-electronics[.]com 27-Jun-21\n\njtdxusbkrdkforusyisi[.]com abdel@info-electronics[.]com 26-Jun-21\n\nxdnvxapnkomttrggytcb[.]com abdel@info-electronics[.]com 25-Jun-21\n\npornohabspremium[.]com abdel@info-electronics[.]com 23-Jun-21\n\nifbtkwenidpwcpidnuri[.]com abdel@info-electronics[.]com 23-Jun-21\n\nhpvyrsupwexkdagpwipb[.]com abdel@info-electronics[.]com 22-Jun-21\n\nmjjtncwnvemxhreqxpmq[.]com abdel@info-electronics[.]com 21-Jun-21\n\nlmpvjicjvvfuyhefeohy[.]com abdel@info-electronics[.]com 20-Jun-21\n\nsyklkgebottfhusikojb[.]com abdel@info-electronics[.]com 19-Jun-21\n\nykcqxqltrjtnckeovymb[.]com abdel@info-electronics[.]com 17-Jun-21\n\nbsaxotnpiaadlgapkmua[.]com abdel@info-electronics[.]com 16-Jun-21\n\nixtjopopsynvxsvbjvtj[.]com abdel@info-electronics[.]com 14-Jun-21\n\ngdugytcwkepvykcqxpmu[.]com abdel@info-electronics[.]com 13-Jun-21\n\nteejdhytvemagqdfalah[.]com abdel@info-electronics[.]com 12-Jun-21\n\nqwernxwrilhvhnaeuikn[.]com abdel@info-electronics[.]com 11-Jun-21\n\ntdfkntyofkrhcemrlphx[.]com abdel@info-electronics[.]com 10-Jun-21\n\nxlvddtbgobmrrmmlirjl[.]com abdel@info-electronics[.]com 9-Jun-21\n\nsrwhpvikxwoxfmgotrje[.]com abdel@info-electronics[.]com 6-Jun-21\n\nqwqnvhnqevofauhlolmv[.]com abdel@info-electronics[.]com 5-Jun-21\n\njkahgubfctyrtqjfgtto[.]com abdel@info-electronics[.]com 4-Jun-21\n\nwmwubjmjjhrtngbtwkhg[.]com abdel@info-electronics[.]com 3-Jun-21\n\nusmsmsmsvapiikmcrnup[.]com abdel@info-electronics[.]com 2-Jun-21\n\n\n-----\n\n|jealmlcfbufmqbqrauho[.]com|abdel@info-electronics[.]com|1-Jun-21|\n|---|---|---|\n|gjttxcfragwmworlsitr[.]com|abdel@info-electronics[.]com|31-May-21|\n|jeasbiecuybemhxksjjq[.]com|abdel@info-electronics[.]com|30-May-21|\n|bmesarsofaqpxnbtyyst[.]com|abdel@info-electronics[.]com|28-May-21|\n|nbomgpwekyvxtkumyesh[.]com|abdel@info-electronics[.]com|28-May-21|\n|rcoixeaaquuetirqsmhf[.]com|abdel@info-electronics[.]com|27-May-21|\n|ubfmagagaxiqdpwldfdv[.]com|abdel@info-electronics[.]com|24-May-21|\n|ilajsuyhbegomyqxckui[.]com|abdel@info-electronics[.]com|23-May-21|\n|tqvgouhfyydajdwewxuv[.]com|abdel@info-electronics[.]com|21-May-21|\n|rvpidccqxpmugpdnrqjf[.]com|abdel@info-electronics[.]com|20-May-21|\n|mbnyridtpvhnkhkpckhn[.]com|abdel@info-electronics[.]com|17-May-21|\n|jealmlcfbufmqwqnvymb[.]com|abdel@info-electronics[.]com|16-May-21|\n|husbbrkpvrqjomuyhdpd[.]com|abdel@info-electronics[.]com|15-May-21|\n|txjwlgkqcddbdwdfmawj[.]com|abdel@info-electronics[.]com|14-May-21|\n|qpspsdtevijlyxaaerug[.]com|abdel@info-electronics[.]com|13-May-21|\n|traffictrackerabj[.]com|abdel@info-electronics[.]com|12-May-21|\n|xlvddbpswohcbwxcosce[.]com|abdel@info-electronics[.]com|12-May-21|\n|cvrqiyjfuxfgbcnarxxl[.]com|abdel@info-electronics[.]com|11-May-21|\n|ptncgkjslowionfuavkf[.]com|abdel@info-electronics[.]com|10-May-21|\n|cbpeajewhmxbyhqxjqcs[.]com|abdel@info-electronics[.]com|9-May-21|\n|uhlrmxnbascpbupdhypl[.]com|abdel@info-electronics[.]com|7-May-21|\n|cpidyredfdshhkpymtqq[.]com|abdel@info-electronics[.]com|6-May-21|\n|wtrajutnmkgoxfdyhqcw[.]com|abdel@info-electronics[.]com|5-May-21|\n|gjusxadcucubsblcvhhk[.]com|abdel@info-electronics[.]com|3-May-21|\n|mjjtncwnvemxhreqxpmn[.]com|abdel@info-electronics[.]com|3-May-21|\n|cpidxonrihdjtwgbshwt[.]com|abdel@info-electronics[.]com|2-May-21|\n\n\njealmlcfbufmqbqrauho[.]com abdel@info-electronics[.]com 1-Jun-21\n\ngjttxcfragwmworlsitr[.]com abdel@info-electronics[.]com 31-May-21\n\njeasbiecuybemhxksjjq[.]com abdel@info-electronics[.]com 30-May-21\n\nbmesarsofaqpxnbtyyst[.]com abdel@info-electronics[.]com 28-May-21\n\nnbomgpwekyvxtkumyesh[.]com abdel@info-electronics[.]com 28-May-21\n\nrcoixeaaquuetirqsmhf[.]com abdel@info-electronics[.]com 27-May-21\n\nubfmagagaxiqdpwldfdv[.]com abdel@info-electronics[.]com 24-May-21\n\nilajsuyhbegomyqxckui[.]com abdel@info-electronics[.]com 23-May-21\n\ntqvgouhfyydajdwewxuv[.]com abdel@info-electronics[.]com 21-May-21\n\nrvpidccqxpmugpdnrqjf[.]com abdel@info-electronics[.]com 20-May-21\n\nmbnyridtpvhnkhkpckhn[.]com abdel@info-electronics[.]com 17-May-21\n\njealmlcfbufmqwqnvymb[.]com abdel@info-electronics[.]com 16-May-21\n\nhusbbrkpvrqjomuyhdpd[.]com abdel@info-electronics[.]com 15-May-21\n\ntxjwlgkqcddbdwdfmawj[.]com abdel@info-electronics[.]com 14-May-21\n\nqpspsdtevijlyxaaerug[.]com abdel@info-electronics[.]com 13-May-21\n\ntraffictrackerabj[.]com abdel@info-electronics[.]com 12-May-21\n\nxlvddbpswohcbwxcosce[.]com abdel@info-electronics[.]com 12-May-21\n\ncvrqiyjfuxfgbcnarxxl[.]com abdel@info-electronics[.]com 11-May-21\n\nptncgkjslowionfuavkf[.]com abdel@info-electronics[.]com 10-May-21\n\ncbpeajewhmxbyhqxjqcs[.]com abdel@info-electronics[.]com 9-May-21\n\nuhlrmxnbascpbupdhypl[.]com abdel@info-electronics[.]com 7-May-21\n\ncpidyredfdshhkpymtqq[.]com abdel@info-electronics[.]com 6-May-21\n\nwtrajutnmkgoxfdyhqcw[.]com abdel@info-electronics[.]com 5-May-21\n\ngjusxadcucubsblcvhhk[.]com abdel@info-electronics[.]com 3-May-21\n\nmjjtncwnvemxhreqxpmn[.]com abdel@info-electronics[.]com 3-May-21\n\ncpidxonrihdjtwgbshwt[.]com abdel@info-electronics[.]com 2-May-21\n\n\n-----\n\n|pornohubpromo[.]site|abdel@info-electronics[.]com|27-Apr-21|\n|---|---|---|\n|hctvtvhndvfocyposuho[.]com|abdel@info-electronics[.]com|24-Mar-21|\n|erkjwcpuavgrgcrwsavg[.]com|abdel@info-electronics[.]com|17-Feb-21|\n\n|Domain|Registar|Created|Updated|Expiry|\n|---|---|---|---|---|\n|2311forget[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|23-Nov-23|23-Nov-23|23-Nov-24|\n|2311foreign[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|23-Nov-23|-|23-Nov-24|\n|3010cars[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|4-Nov-23|30-Oct-24|\n|98762341tdgi[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|6-Oct-23|11-Oct-23|6-Oct-24|\n|2311forget[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|23-Nov-23|-|23-Nov-24|\n|2311forget[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|23-Nov-23|-|23-Nov-24|\n|3010cars[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|4-Nov-23|30-Oct-24|\n|3010offers[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|30-Oct-23|30-Oct-24|\n|3010offers[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|30-Oct-23|30-Oct-24|\n|3010offers[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|-|30-Oct-24|\n|3010offers[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|30-Oct-23|30-Oct-24|\n|3010cars[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|30-Oct-23|-|30-Oct-24|\n|2610kjhsda[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610asdkj[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610kjhsda[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610asdkj[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610asdkj[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610kjhsda[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610kjhsda[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n|2610asdkj[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|26-Oct-23|26-Oct-23|26-Oct-24|\n\n\npornohubpromo[.]site abdel@info-electronics[.]com 27-Apr-21\n\nhctvtvhndvfocyposuho[.]com abdel@info-electronics[.]com 24-Mar-21\n\nerkjwcpuavgrgcrwsavg[.]com abdel@info-electronics[.]com 17-Feb-21\n\n### Suspected FakeBat Domains Associated with “John Bolton” Pseudonym\n\n**Domain** **Registar** **Created** **Updated** **Expiry**\n\n2311forget[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 23-Nov-23 23-Nov-23 23-Nov-24\n\n2311foreign[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 23-Nov-23       - 23-Nov-24\n\n3010cars[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23 4-Nov-23 30-Oct-24\n\n98762341tdgi[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 6-Oct-23 11-Oct-23 6-Oct-24\n\n2311forget[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 23-Nov-23       - 23-Nov-24\n\n2311forget[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 23-Nov-23       - 23-Nov-24\n\n3010cars[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23 4-Nov-23 30-Oct-24\n\n3010offers[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23 30-Oct-23 30-Oct-24\n\n3010offers[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23 30-Oct-23 30-Oct-24\n\n3010offers[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23       - 30-Oct-24\n\n3010offers[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23 30-Oct-23 30-Oct-24\n\n3010cars[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 30-Oct-23       - 30-Oct-24\n\n2610kjhsda[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610asdkj[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610kjhsda[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610asdkj[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610asdkj[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610kjhsda[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610kjhsda[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n2610asdkj[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 26-Oct-23 26-Oct-23 26-Oct-24\n\n\n-----\n\n|11234jkhfkujhs[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Oct-23|19-Oct-23|19-Oct-24|\n|---|---|---|---|---|\n|11234jkhfkujhs[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Oct-23|19-Oct-23|19-Oct-24|\n|11234jkhfkujhs[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Oct-23|19-Oct-23|19-Oct-24|\n|11234jkhfkujhs[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Oct-23|19-Oct-23|19-Oct-24|\n|98762341tdgi[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|6-Oct-23|6-Oct-23|6-Oct-24|\n|98762341tdgi[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|6-Oct-23|6-Oct-23|6-Oct-24|\n|756-ads-info[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|28-Sep-23|28-Sep-23|28-Sep-24|\n|875jhrfks[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|25-Sep-23|25-Sep-23|25-Sep-24|\n|756-ads-info[.]site|NICENIC INTERNATIONAL GROUP CO., LIMITED|28-Sep-23|28-Sep-23|28-Sep-24|\n|756-ads-info[.]xyz|NICENIC INTERNATIONAL GROUP CO., LIMITED|28-Sep-23|28-Sep-23|28-Sep-24|\n|999-ads-info[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|28-Sep-23|28-Sep-23|28-Sep-24|\n|343-ads-info[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|28-Sep-23|28-Sep-23|28-Sep-24|\n|clk-brood[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Aug-23|20-Sep-23|19-Aug-24|\n|0909kses[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|25-Sep-23|25-Sep-23|25-Sep-24|\n|dns-inform[.]top|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Aug-23|7-Sep-23|19-Aug-24|\n|clk-brood[.]online|NICENIC INTERNATIONAL GROUP CO., LIMITED|19-Aug-23|31-Aug-23|19-Aug-24|\n\n\n11234jkhfkujhs[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Oct-23 19-Oct-23 19-Oct-24\n\n11234jkhfkujhs[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Oct-23 19-Oct-23 19-Oct-24\n\n11234jkhfkujhs[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Oct-23 19-Oct-23 19-Oct-24\n\n11234jkhfkujhs[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Oct-23 19-Oct-23 19-Oct-24\n\n98762341tdgi[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 6-Oct-23 6-Oct-23 6-Oct-24\n\n98762341tdgi[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 6-Oct-23 6-Oct-23 6-Oct-24\n\n756-ads-info[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 28-Sep-23 28-Sep-23 28-Sep-24\n\n875jhrfks[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 25-Sep-23 25-Sep-23 25-Sep-24\n\n756-ads-info[.]site NICENIC INTERNATIONAL GROUP CO., LIMITED 28-Sep-23 28-Sep-23 28-Sep-24\n\n756-ads-info[.]xyz NICENIC INTERNATIONAL GROUP CO., LIMITED 28-Sep-23 28-Sep-23 28-Sep-24\n\n999-ads-info[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 28-Sep-23 28-Sep-23 28-Sep-24\n\n343-ads-info[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 28-Sep-23 28-Sep-23 28-Sep-24\n\nclk-brood[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Aug-23 20-Sep-23 19-Aug-24\n\n0909kses[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 25-Sep-23 25-Sep-23 25-Sep-24\n\ndns-inform[.]top NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Aug-23 7-Sep-23 19-Aug-24\n\nclk-brood[.]online NICENIC INTERNATIONAL GROUP CO., LIMITED 19-Aug-23 31-Aug-23 19-Aug-24\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://esentire-dot-com-assets.s3.amazonaws.com/assets/resourcefiles/eSentire-Unraveling_BatLoader_and_FakeBat.pdf"
    ],
    "report_names": [
        "eSentire-Unraveling_BatLoader_and_FakeBat.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf4d333d-ef79-40aa-b233-886e6de875a3",
            "created_at": "2023-12-08T02:00:05.754609Z",
            "updated_at": "2025-03-27T02:00:03.266797Z",
            "deleted_at": null,
            "main_name": "DEV-0569",
            "aliases": [
                "Storm-0569"
            ],
            "source_name": "MISPGALAXY:DEV-0569",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d9b39228-0d9d-4c1e-8e39-2de986120060",
            "created_at": "2023-01-06T13:46:39.293127Z",
            "updated_at": "2025-03-27T02:00:03.042341Z",
            "deleted_at": null,
            "main_name": "BelialDemon",
            "aliases": [
                "Matanbuchus"
            ],
            "source_name": "MISPGALAXY:BelialDemon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1717639535,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1702398761,
    "ts_modification_date": 1702420683,
    "files": {
        "pdf": "https://archive.orkl.eu/a55c04d39cbb604e89fed0739cb0240ce89bb716.pdf",
        "text": "https://archive.orkl.eu/a55c04d39cbb604e89fed0739cb0240ce89bb716.txt",
        "img": "https://archive.orkl.eu/a55c04d39cbb604e89fed0739cb0240ce89bb716.jpg"
    }
}