{
    "id": "3ba3a7ee-878f-426c-9320-ba16c937ae80",
    "created_at": "2023-01-12T15:06:19.622106Z",
    "updated_at": "2025-03-27T02:13:16.706122Z",
    "deleted_at": null,
    "sha1_hash": "14b69eb1215daf5239f664a05e484159c30167b1",
    "title": "2019-12-19 - Inside ‘Evil Corp,’ a $100M Cybercrime Menace",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:20Z",
    "file_modification_date": "2022-05-28T04:10:20Z",
    "file_size": 2155078,
    "plain_text": "# Inside ‘Evil Corp,’ a $100M Cybercrime Menace\n\n**[krebsonsecurity.com/2019/12/inside-evil-corp-a-100m-cybercrime-menace/](https://krebsonsecurity.com/2019/12/inside-evil-corp-a-100m-cybercrime-menace/)**\n\nThe U.S. Justice Department this month offered a $5 million bounty for information leading\nto the arrest and conviction of a Russian man indicted for allegedly orchestrating a vast,\ninternational cybercrime network that called itself “Evil Corp” and stole roughly $100 million\nfrom businesses and consumers. As it happens, for several years KrebsOnSecurity closely\nmonitored the day-to-day communications and activities of the accused and his accomplices.\nWhat follows is an insider’s look at the back-end operations of this gang.\n\nImage: FBI\n\nThe $5 million reward is being offered for 32 year-old Maksim V. Yakubets, who the\ngovernment says went by the nicknames “aqua,” and “aquamo,” among others. The feds\nallege Aqua led an elite cybercrime ring with at least 16 others who used advanced, custommade strains of malware known as “JabberZeus” and “Bugat” (a.k.a. “Dridex“) to steal\nbanking credentials from employees at hundreds of small- to mid-sized companies in the\nUnited States and Europe.\n\n\n-----\n\nFrom 2009 to the present, Aqua s primary role in the conspiracy was recruiting and\n[managing a continuous supply of unwitting or complicit accomplices to help Evil Corp.](https://krebsonsecurity.com/2011/08/experienced-money-mule-will-travel/)\nlaunder money stolen from their victims and transfer funds to members of the conspiracy\nbased in Russia, Ukraine and other parts of Eastern Europe. These accomplices, known as\n“money mules,” are typically recruited via work-at-home job solicitations sent out by email\nand to people who have submitted their resumes to job search Web sites.\n\nMoney mule recruiters tend to target people looking for part-time, remote employment, and\nthe jobs usually involve little work other than receiving and forwarding bank transfers. People\nwho bite on these offers sometimes receive small commissions for each successful transfer,\nbut just as often end up getting stiffed out of a promised payday, and/or receiving a visit or\nthreatening letter from law enforcement agencies that track such crime (more on that in a\nmoment).\n\n**HITCHED TO A MULE**\n\nKrebsOnSecurity first encountered Aqua’s work in 2008 as a reporter for The Washington\n_Post. A source said they’d stumbled upon a way to intercept and read the daily online chats_\nbetween Aqua and several other mule recruiters and malware purveyors who were stealing\nhundreds of thousands of dollars weekly from hacked businesses.\n\nThe source also discovered a pattern in the naming convention and appearance of several\nmoney mule recruitment Web sites being operated by Aqua. People who responded to\nrecruitment messages were invited to create an account at one of these sites, enter personal\nand bank account data (mules were told they would be processing payments for their\nemployer’s “programmers” based in Eastern Europe) and then log in each day to check for\nnew messages.\n\nEach mule [was given busy work or menial tasks for a few days or weeks prior to being asked](https://krebsonsecurity.com/wp-content/uploads/2019/12/busywork.png)\nto handle money transfers. I believe this was an effort to weed out unreliable money mules.\nAfter all, those who showed up late for work tended to cost the crooks a lot of money, as the\nvictim’s bank would usually try to reverse any transfers that hadn’t already been withdrawn\nby the mules.\n\n\n-----\n\nOne of several sites set up by Aqua and others to recruit and manage money mules.\n\nWhen it came time to transfer stolen funds, the recruiters would send a message through the\nmule site saying something like: “Good morning [mule name here]. Our client — XYZ Corp.\n— is sending you some money today. Please visit your bank now and withdraw this payment\nin cash, and then wire the funds in equal payments — minus your commission — to these\nthree individuals in Eastern Europe.”\n\nOnly, in every case the company mentioned as the “client” was in fact a small business\nwhose payroll accounts they’d already hacked into.\n\nHere’s where it got interesting. Each of these mule recruitment sites had the same security\n[weakness: Anyone could register, and after logging in any user could view messages sent to](https://krebsonsecurity.com/wp-content/uploads/2011/08/avcompanybackoffice.png)\nand from all other users simply by changing a number in the browser’s address bar. As a\nresult, it was trivial to automate the retrieval of messages sent to every money mule\nregistered across dozens of these fake company sites.\n\nSo, each day for several years my morning routine went as follows: Make a pot of coffee;\nshuffle over to the computer and view the messages Aqua and his co-conspirators had sent\nto their money mules over the previous 12-24 hours; look up the victim company names in\nGoogle; pick up the phone to warn each that they were in the process of being robbed by the\nRussian Cyber Mob.\n\nMy spiel on all of these calls was more or less the same: “You probably have no idea who I\nam, but here’s all my contact info and what I do. Your payroll accounts have been hacked,\nand you’re about to lose a great deal of money. You should contact your bank immediately\n\n\n-----\n\nand have them put a hold on any pending transfers before it s too late. Feel free to call me\nback afterwards if you want more information about how I know all this, but for now please\njust call or visit your bank.”\n\nMessages to and from a money mule working for Aqua’s crew, circa May 2011.\n\nIn many instances, my call would come in just minutes or hours before an unauthorized\npayroll batch was processed by the victim company’s bank, and some of those notifications\nprevented what otherwise would have been enormous losses — often several times the\namount of the organization’s normal weekly payroll. At some point I stopped counting how\nmany tens of thousands of dollars those calls saved victims, but over several years it was\nprobably in the millions.\n\nJust as often, the victim company would suspect that I was somehow involved in the robbery,\nand soon after alerting them I would receive a call from an FBI agent or from a police officer\nin the victim’s hometown. Those were always interesting conversations. Needless to say, the\nvictims that spun their wheels chasing after me usually suffered far more substantial financial\nlosses (mainly because they delayed calling their financial institution until it was too late).\n\nCollectively, these notifications to Evil Corp.’s victims led to dozens of stories over several\nyears about small businesses battling their financial institutions to recover their losses. I don’t\nbelieve I ever wrote about a single victim that wasn’t okay with my calling attention to their\nplight and to the sophistication of the threat facing other companies.\n\n**LOW FRIENDS IN HIGH PLACES**\n\nAccording to the U.S. Justice Department, Yakubets/Aqua served as leader of Evil Corp. and\nwas responsible for managing and supervising the group’s cybercrime activities in deploying\nand using the Jabberzeus and Dridex banking malware. The DOJ notes that prior to serving\n\n\n-----\n\nin this leadership role for Evil Corp, Yakubets was also directly associated with Evgeniy\n“Slavik” Bogachev, a previously designated Russian cybercriminal responsible for the\n[distribution of the Zeus, Jabber Zeus, and GameOver Zeus malware schemes who currently](https://krebsonsecurity.com/?s=gameover+zeus&x=0&y=0)\nhas a $3 million FBI bounty on his head.\n\nEvgeniy M. Bogachev, in undated photos.\n\nAs noted [in previous stories here, during times of conflict with Russia’s neighbors, Slavik was](https://krebsonsecurity.com/2019/11/why-were-the-russians-so-set-against-this-hacker-being-extradited/)\nknown to retool his crime machines to search for classified information on victim systems in\nregions of the world that were of strategic interest to the Russian government – particularly in\nTurkey and Ukraine.\n\n“Cybercriminals are recruited to Russia’s national cause through a mix of coercion, payments\n[and appeals to patriotic sentiment,” reads a 2017 story from The Register on security firm](https://www.theregister.co.uk/2017/06/06/russia_cyber_militia_analysis/)\n**Cybereason’s** [analysis of the Russian cybercrime scene. “Russia’s use of private](https://www.cybereason.com/blog-russia-nation-state-hacking-the-countrys-dedicated-policy-of-strategic-ambiguity/)\ncontractors also has other benefits in helping to decrease overall operational costs,\nmitigating the risk of detection and gaining technical expertise that they cannot recruit directly\ninto the government. Combining a cyber-militia with official state-sponsored hacking teams\nhas created the most technically advanced and bold cybercriminal community in the world.”\n\nThis is interesting because the U.S. Treasury Department says Yukabets as of 2017 was\nworking for [the Russian FSB, one of Russia’s leading intelligence organizations.](https://en.wikipedia.org/wiki/Federal_Security_Service)\n\n“As of April 2018, Yakubets was in the process of obtaining a license to work with Russian\n[classified information from the FSB,” notes a statement from the Treasury.](https://home.treasury.gov/news/press-releases/sm845)\n\n\n-----\n\nThe Treasury Department s role in this action is key because it means the United States has\nnow imposed economic sanctions on Yukabets and 16 accused associates, effectively\nfreezing all property and interests of these persons (subject to U.S. jurisdiction) and making it\na crime to transact with these individuals.\n\nThe Justice Department’s [criminal complaint against Yukabets (PDF) mentions several](https://www.justice.gov/opa/press-release/file/1223591/download)\nintercepted chat communications between Aqua and his alleged associates in which they\npuzzle over why KrebsOnSecurity seemed to know so much about their internal operations\nand victims. In the following chat conversations (translated from Russian), Aqua and others\ndiscuss a story I wrote for _[The Washington Post in 2009 about their theft of hundreds of](http://voices.washingtonpost.com/securityfix/2009/07/an_odyssey_of_fraud_part_ii.html)_\nthousands of dollars from the payroll accounts of Bullitt County, Ky:\n\ntank: [Are you] there?\nindep: Yeah.\nindep: Greetings.\ntank:\nhttp://voices.washingtonpost.com/securityfix/2009/07/an_odyssey_of_fraud_part_ii.html#more\ntank: This is still about me.\ntank: Originator: BULLITT COUNTY FISCAL Company: Bullitt County Fiscal Court\ntank: He is the account from which we cashed.\ntank: Today someone else send this news.\ntank: I’m reading and thinking: Let me take a look at history. For some reason this name is\nfamiliar.\ntank: I’m on line and I’ll look. Ah, here is this shit.\nindep: How are you?\ntank: Did you get my announcements?\nindep: Well, I congratulate [you].\nindep: This is just fuck when they write about you in the news.\ntank: Whose [What]?\ntank: 😀\nindep: Too much publicity is not needed.\ntank: Well, so nobody knows who they are talking about.\n\ntank: Well, nevertheless, they were writing about us.\naqua: So because of whom did they lock Western Union for Ukraine?\naqua: Tough shit.\ntank: *************Originator: BULLITT COUNTY FISCAL Company: Bullitt\nCounty Fiscal Court\naqua: So?\naqua: This is the court system.\ntank: Shit.\ntank: Yes\n\n\n-----\n\naqua: This is why they fucked [nailed?] several drops.\ntank: Yes, indeed.\naqua: Well, fuck. Hackers: It’s true they stole a lot of money.\n\nAt roughly the same time, one of Aqua’s crew had a chat with Slavik, who used the nickname\n“lucky12345” at the time:\n\ntank: Are you there?\ntank: This is what they damn wrote about me.\ntank:\nhttp://voices.washingtonpost.com/securityfix/2009/07/an_odyssey_of_fraud_part_ii.html#more\ntank: I’ll take a quick look at history\ntank: Originator: BULLITT COUNTY FISCAL Company: Bullitt County Fiscal Court\ntank: Well, you got [it] from that cash-in.\nlucky12345: From 200K?\ntank: Well, they are not the right amounts and the cash out from that account was shitty.\ntank: Levak was written there.\ntank: Because now the entire USA knows about Zeus.\ntank: 😀\nlucky12345: It’s fucked.\n\nOn Dec. 13, 2009, one of the Jabberzeus gang’s money mule recruiters –- a crook who used\nthe pseudonym “Jim Rogers” — somehow learned about something I hadn’t shared beyond\na few trusted friends at that point: That The Washington Post had eliminated my job in the\nprocess of merging the newspaper’s Web site (where I worked at the time) with the dead tree\nedition. The following is an exchange between Jim Rogers and the above-quoted “tank”:\n\njim_rogers: There is a rumor that our favorite (Brian) didn’t get his contract extension at\nWashington Post. We are giddily awaiting confirmation 🙂 Good news expected exactly by\nthe New Year! Besides us no one reads his column 🙂\n\ntank: Mr. Fucking Brian Fucking Kerbs!\n\nIn March 2010, Aqua would divulge in an encrypted chat that his crew was working directly\nwith the Zeus author (Slavik/Lucky12345), but that they found him abrasive and difficult to\ntolerate:\n\ndimka: I read about the king of seas, was it your handy work?\naqua: what are you talking about? show me\ndimka: zeus\naqua: 🙂\naqua: yes, we are using it right now\naqua: its developer sits with us on the system\ndimka: it’s a popular thing\n\n\n-----\n\naqua: but, he, fucker, annoyed the hell out of everyone, doesn t want to write bypass of\ninteractives (scans) and trojan penetration 35-40%, bitch\naqua: yeah, shit\naqua: we need better\naqua: http://voices.washingtonpost.com/securityfix read it 🙂 here you find almost everything\nabout us 🙂\ndimka: I think everything will be slightly different, if you think so\naqua: we, in this system, the big dog, the rest on the system are doing small crap\n\nLater that month, Aqua bemoaned even more publicity about their work, pointing to a\nKrebsOnSecurity story about a sophisticated attack in which their malware not only\nintercepted a one-time password needed to log in to the victim’s bank account, but even\nmodified the bank’s own Web site as displayed in the victim’s browser to point to a phony\ncustomer support number.\n\nIronically, the fake bank phone number was what tipped off the victim company employee. In\nthis instance, the victim’s bank — Fifth Third Bank (referred to as “53” in the chat below) was\nable to claw back the money stolen by Aqua’s money mules, but not funds that were taken\nvia fraudulent international wire transfers. The cybercriminals in this chat also complain they\nwill need a newly-obfuscated version of their malware due to public exposure:\n\naqua: tomorrow, everything should work.\naqua: fuck, we need to find more socks for spam.\n[aqua: okay, so tomorrow Petro [another conspirator who went by the nickname Petr0vich] will](https://krebsonsecurity.com/2015/02/fbi-3m-bounty-for-zeus-trojan-author/)\ngive us a [new] .exe\njtk: ok\njim_rogers: this one doesn’t work\njim_rogers: http://www.krebsonsecurity.com/2010/03/crooks-crank-up-volume-of-e-bankingattacks/\njim_rogers: here it’s written about my transfer from 53. How I made a number of wires like it\nsaid there. And a woman burnt the deal because of a fake phone number.\n\n**ANTI-MULE INITIATIVE**\n\nIn tandem with the indictments against Evil Corp, the Justice Department joined with officials\nfrom [Europol to execute a law enforcement action and public awareness campaign to](https://en.wikipedia.org/wiki/Europol)\ncombat money mule activity.\n\n“More than 90% of money mule transactions identified through the European Money Mule\n[Actions are linked to cybercrime,” Europol wrote in a statement about the action. “The illegal](https://www.europol.europa.eu/activities-services/public-awareness-and-prevention-guides/money-muling)\nmoney often comes from criminal activities like phishing, malware attacks, online auction\nfraud, e-commerce fraud, business e-mail compromise (BEC) and CEO fraud, romance\nscams, holiday fraud (booking fraud) and many others.”\n\n\n-----\n\nThe DOJ [said U.S. law enforcement disrupted mule networks that spanned from Hawaii to](https://www.justice.gov/opa/pr/justice-department-announces-landmark-money-mule-initiative)\nFlorida and from Alaska to Maine. Actions were taken to halt the conduct of over 600\ndomestic money mules, including 30 individuals who were criminally charged for their roles in\nreceiving victim payments and providing the fraud proceeds to accomplices.\n\nSome tips from Europol on how to spot money mule recruitment scams dressed up as legitimate job\n\noffers.\n\nIt’s good to see more public education about the damage that money mules inflict, because\nwithout them most of these criminal schemes simply fall apart. Aside from helping to launder\nfunds from banking trojan victims, money mules often are instrumental in fleecing elderly\npeople taken in by various online confidence scams.\n\nIt’s also great to see the U.S. government finally wielding its most powerful weapon against\ncybercriminals based in Russia and other safe havens for such activity: Economic sanctions\nthat severely restrict cybercriminals’ access to ill-gotten gains and the ability to launder the\nproceeds of their crimes by investing in overseas assets.\n\nFurther reading:\n\n\n-----\n\n[DOJ press conference remarks on Yakubets](https://www.justice.gov/opa/speech/assistant-attorney-general-brian-benczkowski-delivers-remarks-yakubets-press-conference)\n[FBI charges announced in malware conspiracy](https://www.fbi.gov/news/stories/charges-announced-in-malware-conspiracy-120519)\n[2019 indictment of Yakubets, Turashev. et al.](https://www.justice.gov/opa/press-release/file/1223586/download)\n[2010 Criminal complaint vs. Yukabets, et. al.](https://www.justice.gov/opa/press-release/file/1223591/download)\n[FBI “wanted” alert on Igor “Enki” Turashev](https://www.fbi.gov/wanted/cyber/igor-olegovich-turashev)\n[US-CERT alert on Dridex](https://www.us-cert.gov/ncas/alerts/aa19-339a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-19 - Inside ‘Evil Corp,’ a $100M Cybercrime Menace.pdf"
    ],
    "report_names": [
        "2019-12-19 - Inside ‘Evil Corp,’ a $100M Cybercrime Menace.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535979,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653711020,
    "ts_modification_date": 1653711020,
    "files": {
        "pdf": "https://archive.orkl.eu/14b69eb1215daf5239f664a05e484159c30167b1.pdf",
        "text": "https://archive.orkl.eu/14b69eb1215daf5239f664a05e484159c30167b1.txt",
        "img": "https://archive.orkl.eu/14b69eb1215daf5239f664a05e484159c30167b1.jpg"
    }
}