{
    "id": "3bad4a02-e66a-4930-8d1f-04d5cf4b2b93",
    "created_at": "2023-01-12T15:03:57.436398Z",
    "updated_at": "2025-03-27T02:17:11.729881Z",
    "deleted_at": null,
    "sha1_hash": "110a9fd8f8e4b132fed2d4329e1b9536a616bdbb",
    "title": "2016-12-15 - Let It Ride- The Sofacy Group’s DealersChoice Attacks Continue",
    "authors": "",
    "file_creation_date": "2022-05-28T00:33:52Z",
    "file_modification_date": "2022-05-28T00:33:52Z",
    "file_size": 1580205,
    "plain_text": "# Let It Ride: The Sofacy Group’s DealersChoice Attacks Continue\n\n**[unit42.paloaltonetworks.com/unit42-let-ride-sofacy-groups-dealerschoice-attacks-continue/](https://unit42.paloaltonetworks.com/unit42-let-ride-sofacy-groups-dealerschoice-attacks-continue/)**\n\nRobert Falcone, Bryan Lee December 15, 2016\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Bryan Lee](https://unit42.paloaltonetworks.com/author/bryanlee/)\n\nDecember 15, 2016 at 5:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [DealersChoice,](https://unit42.paloaltonetworks.com/tag/dealerschoice/) [Sofacy,](https://unit42.paloaltonetworks.com/tag/sofacy/) [threat research](https://unit42.paloaltonetworks.com/tag/threat-research/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-let-ride-sofacy-groups-dealerschoice-attacks-continue/)\n\n[Recently, Palo Alto Networks Unit 42 reported on a new exploitation platform that we called](https://blog.paloaltonetworks.com/2016/10/unit42-dealerschoice-sofacys-flash-player-exploit-platform/)\n[“DealersChoice” in use by the Sofacy group (AKA APT28, Fancy Bear, STRONTIUM, Pawn](https://en.wikipedia.org/wiki/Sofacy_Group)\nStorm, Sednit). As outlined in our original posting, the DealersChoice exploitation platform\ngenerates malicious RTF documents which in turn use embedded OLE Word documents. These\nembedded OLE Word documents then contain embedded Adobe Flash (.SWF) files that are\ndesigned to exploit Abode Flash vulnerabilities.\n\nAt the time of initial reporting, we found two variants:\n\n1. Variant A: A standalone variant that included Flash exploit code packaged with a payload.\n2. Variant B: A modular variant that loaded exploit code on-demand and appeared non\noperational at the time.\n\n\n-----\n\nSince that time, we have been able to collect additional samples of the weaponized documents\nthat the DealersChoice exploitation platform generates. These latest, additional samples are all\nVariant B samples. Two of these samples were found to have operational command and control\nservers which allowed us to collect and analyze additional artifacts associated with the attack.\n\n[In late October 2016 Adobe issued Adobe Security Bulletin APSB16-36 to address](https://helpx.adobe.com/security/products/flash-player/apsb16-36.html) CVE-2016[7855. In early November 2016 Microsoft issued Microsoft Security Bulletin MS16-135 to address](https://technet.microsoft.com/en-us/library/security/ms16-135.aspx)\n[CVE-2016-7255.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-7255)\n\nBoth of these were in response to active exploitation of zero-day vulnerabilities thought by other\nresearchers to be associated with the Sofacy group. Additional reporting as well as our own\nanalysis indicates the exploit code for the Adobe Flash vulnerability CVE-2016-7855 was indeed\ndelivered using DealersChoice. In-house testing also reveals customers of Palo Alto Networks\nTraps end-point agent are protected by the new exploit code.\n\n## Deal Me In: Finding Live C2 Servers\n\n[In our previous blog discussing DealersChoice, we identified the steps that Variant B would take](https://blog.paloaltonetworks.com/2016/10/unit42-dealerschoice-sofacys-flash-player-exploit-platform/)\nonce executed on a victim host, but were unable to successfully interact with the command and\ncontrol (C2) server identified at the time.\n\nWe have since discovered two fully operational and active C2 servers (versiontask[.]com and\npostlkwarn[.]com) that followed the exact steps we outlined in the blog; loading the additional\nFlash exploit code into memory, following by loading the associated payload also into memory.\nFigure 1 details the workflow of victim to C2 communications.\n\n\n-----\n\n_Figure 1 Workflow of DealersChoice_\n\nThe ActionScript within Variant B will interact with the C2 server, specifically to obtain a malicious\nSWF file and a payload. This process starts with an initial beacon to the C2 server that contains\nsystem information and the victim’s Adobe Flash Player version. Figure 2 shows the beacon sent\nby the ActionScript to the C2 server.\n\n\n-----\n\n_Figure 2 Initial beacon from DealersChoice to its C2 server_\n\nThe C2 responds to the initial beacon with strings that DealersChoice’s ActionScript uses as\nvariables in upcoming actions, such as additional HTTP requests and the decryption of the\nresponses to those requests. Figure 3 shows the C2 server’s response to the beacon, specifically\nincluding k1, k2, k3 and k4 values.\n\n_Figure 3 C2 response to beacon provides DealersChoice tokens and keys needed to decrypt data_\n\nThe ActionScript then uses the k1 variable from the C2 response data as a token within the HTTP\nrequest sent back to the C2 server to obtain the malicious SWF file, as seen in Figure 4.\n\nThe C2 server will respond to this request with data that the ActionScript will decrypt using the\nvalue of the k3 variable.\n\nThe active C2 servers provided Variant B with a malicious SWF file that was the same SWF file\n[found within Variant A samples that exploited CVE-2015-7645 (addressed in October 2016 in](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-7645)\n[Adobe Security Bulletin APSA15-05).](https://helpx.adobe.com/security/products/flash-player/apsa15-05.html)\n\nc42a0d50eac9399914090f1edc2bda9ac1079edff4528078549c824c4d023ff9\n\n45a4a376cb7a36f8c7851713c7541cb7e347dafb08980509069a078d3bcb1405\n\n\n-----\n\n_Figure 4 DealersChoice HTTP request to obtain a malicious SWF file to exploit Adobe Flash_\n_Player_\n\nAfter receiving the malicious SWF file, Variant B will then issue an HTTP request using the k2\nvariable as a token to obtain its payload, as seen in Figure 5. The C2 will respond to this request\nwith data that Variant B will decrypt using the value in the k4 variable as a key. The resulting\ndecrypted data contains shellcode and a payload that the shellcode decrypts and executes.\n\n_Figure 5 DealersChoice HTTP request to obtain shellcode and payload to execute upon_\n_successful exploitation_\n\nThe active C2 servers versiontask[.]com and postlkwarn[.]com provided shellcode that decrypts\nand executes a payload which in both cases was a loader Trojan that extracts and decrypts an\nembedded DLL that it saves to the system.\n\n\n-----\n\n5dd3066a8ee3ab5b380eb7781c85e4253683cd7e3eee1c29013a7a62cd9bef8c\nfa8b4f64bff799524f6059c3a4ed5d169e9e7ef730f946ac7ad8f173e8294ed8\n\nIn both cases, the DLL saved to the system is a variant of Sofacy’s tool that uses the Carberp\nsource code.\n\n82213713cf442716eac3f8c95da8d631aab2072ba44b17dda86873e462e10421\n3ff1332a84d615a242a454e5b29f08143b1a89ac9bd7bfaa55ba0c546db10e4b\n\nThe two variants of the Seduploader tool share a common C2 domain of apptaskserver[.]com,\nwith differing backup C2 domains of appservicegroup[.]com and joshel[.]com.\n\n## Ace in the Hole: Analyzing Victim Fingerprinting\n\nIn the process of analyzing Variant B’s active C2 server, we wanted to test our hypothesis that the\nC2 server would load different exploit code dependent on victim fingerprinting. We tested this by\nproviding different responses to the C2 server.\n\nFirst, we issued requests to the C2 server from a VPN located in California, USA and the server\ndid not respond to the requests. We then connected to another VPN located in the Middle East\nand issued the same requests, at which point the C2 server responded with a malicious SWF and\npayload. This fact suggests that the Sofacy group uses geolocation to filter out requests that\noriginate from locations that do not coincide with the location of their target.\n\nWe then issued several requests to test the C2 and each time the server responded with different\nk1, k2, k3 and k4 variables, suggesting that the server randomly chooses these values for each\ninbound request.\n\nTo further test the C2 server logic we created requests that contained different values for the\noperating system and Flash player version. When we sent the HTTP requests to the C2 server\nwith the Adobe Flash Player version set to 23.0.0.185, the most recent Flash version vulnerable\nto CVE-2016-7855, the server responded with a compressed SWF file (SHA256:\nc993c1e10299162357196de33e4953ab9ab9e9359fa1aea00d92e97e7d8c5f2c) that exploited\nthat very vulnerability.\n\nFinally, when we issued requests to the C2 server indicating the victim was a macOS system, the\nC2 server served the same malicious SWF file and Windows payload as before, suggesting that\nthe Sofacy group is not using DealersChoice to check operating system type for its victims at this\ntime.\n\nIn all cases the payload delivered by the C2 server is a loader Trojan (SHA256:\n3bb47f37e16d09a7b9ba718d93cfe4d5ebbaecd254486d5192057c77c4a25363) that installs a\nvariant of Seduploader (SHA256:\n4cbb0e3601242732d3ea7c89b4c0fd1074fae4a6d20e5f3afc3bc153b6968d6e), which uses a C2\nserver of akamaisoftupdate[.]com.\n\n## Show Your Hand: Decoy Documents\n\n\n-----\n\nSix documents were collected for this wave of DealersChoice attacks, all appearing to be Variant\nB, using similar lures to what we had observed in the previous wave. The six filenames we\ndiscovered were:\n\nOperation_in_Mosul.rtf – an article about Turkish troops in Mosul\nNASAMS.doc – a document that is a copy of an article regarding the purchase of a\nNorwegian missile defense system by the Lithuanian Ministry of National Defence\nProgramm_Details.doc – a document that is a copy of the schedule of a cyber threat\nintelligence conference in London, targeting a Ministry of Defense of a country in Europe\nDGI2017.doc – a document targeted at a Ministry of Foreign Affairs of a Central Asian\ncountry regarding the agenda for the Defence Geospatial Intelligence gathering in London\nOlympic-Agenda-2020-20-20-Recommendations.doc – a document containing details of\nagreements for the 2020 Olympics\nARM-NATO_ENGLISH_30_NOV_2016.doc – a document outlining an agreement between\nthe Republic of Armenia and NATO\n\n_Figure 6. Collected decoy documents for current wave of attacks_\n\nUnlike the first DealersChoice attacks, these documents used stripped out or forged metadata in\norder to add in an additional layer of obfuscation. Two of the documents, NASAMS.doc and\nProgramm_Details.doc shared a common, unique username pain in the Last Saved By field.\nAdditionally, each of the weaponized documents continued to use the OfficeTestSideloading\n\n\n-----\n\n[technique we had previously reported on. This was the technique we had discovered the Sofacy](https://blog.paloaltonetworks.com/2016/07/unit42-technical-walkthrough-office-test-persistence-method-used-in-recent-sofacy-attacks/)\ngroup began using over this past summer as a way to sideload DLL files using a performance test\nmodule built into the Microsoft Office suite as well as maintain persistence on the victim host.\n\n\n**Filename** **Author** **Last**\n**Saved**\n**By**\n\n\n**Subject** **SHA256**\n\n\nOperation_in_Mosul.rtf Robert\nTasevski\n\nNASAMS.doc Антон\nГладнишки\n\nProgramm_Details.doc Laci\nBonivart\n\nDGI2017.doc Невена\nГамизов\n\n\n---- Turkish troops in\nMosul\n\npain Norwegian missile\ndefense system\n\npain Conference\nschedule\n\n\nНевена\nГамизов\n\n\nConference\nschedule\n\n\nOlympic-Agenda-2020-20-20Recommendations.doc\n\nARMNATO_ENGLISH_30_NOV_2016.doc\n\n\nadmin User Recommendations\nfor 2020 Olympics\n\n\nf5d3e827…\n\n1f81609d…\n\n1579c7a1…\n\nc5a389fa…\n\n13718586…\n\n\nUser User NATO agreement 73ea2cce…\n\n\nThe six first-stage C2 domains for the weaponized documents were all registered by unique\nregistrant emails. Versiontask[.]com and Uniquecorpind[.]com appear to be completely new\ninfrastructure, not sharing any artifacts with previously observed Sofacy group campaigns.\n\n\n**Type** **Domain** **Date**\n**Registered**\n\n\n**Registrant Email**\n\n\nFirst stage\nC2\n\nFirst stage\nC2\n\nFirst stage\nC2\n\nFirst stage\nC2\n\nFirst stage\nC2\n\nFirst stage\nC2\n\n\nVersiontask[.]com 2016-10-24 dalchi0@europe.com\n\nUniquecorpind[.]com 2016-10-25 yasiner@myself.com\n\nSecurityprotectingcorp[.]com 2016-08-19 ottis.davis@openmailbox.org\n\nPostlkwarn[.]com 2016-11-11 fradblec@centrum.cz\n\nadobeupgradeflash[.]com 2016-11-22 nuevomensaje@centrum.cz\n\nglobalresearching[.]org 2016-11-18 carroz.g@mail.com\n\n\n-----\n\nSix second stage C2 domains for the Seduploader payloads delivered by DealersChoice were\nidentified.\n\n**Type** **Domain** **Date Registered** **Registrant Email**\n\nSeduploader C2 Joshel[.]com 2016-11-11 germsuz86@centrum.cz\n\nSeduploader C2 Appservicegroup[.]com 2016-10-19 olivier_servgr@mail.com\n\nSeduploader C2 Apptaskserver[.]com 2016-10-22 partanencomp@mail.com\n\nSeduploader C2 Akamaisoftupdate[.]com 2016-10-26 mahuudd@centrum.cz\n\nSeduploader C2 globaltechresearch[.]org 2016-11-21 morata_al@mail.com\n\nSeduploader C2 researchcontinental[.]org 2016-12-02 Sinkholed\n\nMuch like the first stage C2 domains, the five non-sinkholed second stage C2 domains were\nregistered recently and used unique registrant email addresses previously unused by the Sofacy\ngroup. However, each of these domains used nameservers commonly associated with the Sofacy\ngroup, ns*.carbon2u[.]com and ns*.ititch[.]com. The domain akamaisoftupdate[.]com revealed\nadditional artifacts linking it back to previous Sofacy group campaigns. Based off passive DNS\ndata, we discovered akamaisoftupdate[.]com resolving to 89.45.67.20. On the same class C\nsubnet, we discovered 89.45.67.189, which previously had resolved to updmanager[.]net, a well\nreported domain in use by the Sofacy group.\n\nThe domain securityprotectingcorp[.]com was also found to have links to previous Sofacy group\ninfrastructure. It was registered a couple of months prior, but analysis of the registrant email\naddress revealed that it had also been used to register microsoftsecurepolicy[.]org, which using\npassive DNS data we found had resolved to 40.112.210.240, a sinkhole with several other Sofacy\ngroup associated domains. Several of the corresponding sinkholed domains have been used over\nthe years for multiple purposes by the Sofacy group, as C2s for multiple tools such as Azzy or\nXAgent, or to host phishing sites to gather credentials from targets.\n\n\n-----\n\n_Figure 7 Chart of DealersChoice infrastructure_\n\n## Conclusion\n\nIt appears evident at this time that the Sofacy group is actively using the DealersChoice tool,\nspecifically the Variant B, to attack targets of interest. As evidenced by the delivery of exploit code\nfor a recently patched vulnerability in Flash (which was used in zero-day attacks), we can see\nhow the malware provides flexibility in exploitation methodology and is truly a platform in itself.\nNew infrastructure does appear to have been created for DealersChoice, but as we have seen in\nthe past, the Sofacy group has a tendency to reuse artifacts from previous campaigns and this is\nno exception. Palo Alto Networks customers may learn more and are protected via:\n\nCorrectly identify associated samples as malicious in WildFire\nDealersChoice domains and C2 traffic are classified as malicious\nTraps correctly identifies and prevents exploit code to be executed\nA [DealersChoice AutoFocus tag may be used to identify and track this malware family](https://autofocus.paloaltonetworks.com/#/tag/Unit42.DealersChoice)\n\nNote that even though CVE-2016-7855 was a zero-day vulnerability, Palo Alto Networks\ncustomers would have been protected by our Traps endpoint agent as seen in Figure 8.\n\n\n-----\n\n_Figure 8 Palo Alto Networks Traps blocking exploitation of the CVE-2016-7855 vulnerability_\n\n## Indicators of Compromise\n\n**Document Hashes:**\n\nf5d3e827c3a312d018ef4fcbfc7cb5205c9e827391bfe6eab697cc96412d938e\n\n1f81609d9bbdc7f1d2c8846dcfc4292b3e2642301d9c59130f58e21abb0001be\n\n1579c7a1e42f9e1857a4d1ac966a195a010e1f3d714d68c598a64d1c83aa36e4\n\nc5a389fa702a4223aa2c2318f38d5fe6eba68c645bc0c41c3d8b6f935eab3f64\n\n137185866649888b7b5b6554d6d5789f7b510acd7aff3070ac55e2250eb88dab\n\n73ea2ccec2cbf22d524f55b101d324d89077e5718922c6734fef95787121ff22\n\n**DealersChoice C2s:**\n\nVersiontask[.]com\n\nUniquecorpind[.]com\n\nSecurityprotectingcorp[.]com\n\npostlkwarn[.]com\n\nadobeupgradeflash[.]com\n\nresearchcontinental[.]org\n\n**Seduploader C2s:**\n\nAppservicegroup[.]com\n\nApptaskserver[.]com\n\nAkamaisoftupdate[.]com\n\n\n-----\n\nJoshel[.]com\nglobaltechresearch[.]org\nresearchcontinental[.]org\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-12-15 - Let It Ride- The Sofacy Group’s DealersChoice Attacks Continue.pdf"
    ],
    "report_names": [
        "2016-12-15 - Let It Ride- The Sofacy Group’s DealersChoice Attacks Continue.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535837,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653698032,
    "ts_modification_date": 1653698032,
    "files": {
        "pdf": "https://archive.orkl.eu/110a9fd8f8e4b132fed2d4329e1b9536a616bdbb.pdf",
        "text": "https://archive.orkl.eu/110a9fd8f8e4b132fed2d4329e1b9536a616bdbb.txt",
        "img": "https://archive.orkl.eu/110a9fd8f8e4b132fed2d4329e1b9536a616bdbb.jpg"
    }
}