{
    "id": "3bd185e6-e0d7-4676-a774-1ceb8a21b597",
    "created_at": "2023-01-12T15:05:02.883729Z",
    "updated_at": "2025-03-27T02:14:39.338406Z",
    "deleted_at": null,
    "sha1_hash": "08a388e817164ee651306bbc80edcdcdbbadf14e",
    "title": "2022-06-28 - Raccoon Stealer v2 – Part 1- The return of the dead",
    "authors": "",
    "file_creation_date": "2022-07-02T23:18:36Z",
    "file_modification_date": "2022-07-02T23:18:36Z",
    "file_size": 922706,
    "plain_text": "# Raccoon Stealer v2 – Part 1: The return of the dead\n\n**[blog.sekoia.io/raccoon-stealer-v2-part-1-the-return-of-the-dead/](https://blog.sekoia.io/raccoon-stealer-v2-part-1-the-return-of-the-dead/)**\n\n[Threat & Detection Research Team\nJune 28 2022](https://blog.sekoia.io/author/tdr/)\n350\n0\n\nRead it later\nRemove\n\n12 minutes reading\n\n\nJune 28, 2022\n\n\n**Raccoon Stealer was one of the most prolific information stealers in 2021, being used by multiple**\ncybercriminal actors. Due to its wide stealing capabilities, the customizability of the malware and its\nease of use, Raccoon Stealer was highly popular among threat actors. The malware was mainly\ndistributed using fake installers, or as cracked versions of popular software.\n\nPreviously sold as a malware-as-a-service on underground forums since early 2019, its\noperations suddenly stopped on March 25, 2022. This abrupt shutdown was purportedly due to the\nloss of a developer of the project Raccoon Stealer during the “special operation”, likely in reference\n\n\n-----\n\nto the Russian conflict in Ukraine. At the time, the raccoonstealer profile stated on several forums\nthey “don’t say goodbye forever”, and that they were already working on a second version.\n\n_Figure 1. Raccoonstealer’s statement on the shutdown of the Raccoon Stealer project on the XSS_\n_forum_\n\nSEKOIA.IO kept a close eye on activities related to Raccoon Stealer as it is assessed to make a\n**strong comeback in the information stealer market.**\n\n_We have reverse-engineered the new version of Raccoon Stealer and our in-depth analysis is_\n_[available in part 2 at: https://blog.sekoia.io/raccoon-stealer-v2-part-2-in-depth-analysis/.](https://blog.sekoia.io/raccoon-stealer-v2-part-2-in-depth-analysis/)_\n\n## First signs of life\n\nOn June 10, 2022, while searching for stealers’ administration panels on the Shodan search\nengine, SEKOIA.IO analysts stumbled upon active servers hosting a web page named “Raccoon\nStealer 2.0”.\n\n_Figure 2. Server hosting a web page named “Raccoon Stealer 2.0” on Shodan_\n\n\n-----\n\nAfter analysis of the files on the server, we could assert with high confidence that these servers\nbelong to the Raccoon Stealer infrastructure. Indeed several technical artefacts suggest that this\npanel is linked to the malware:\n\nthe HTTP title: `Raccoon Stealer 2.0 ;`\nthe issued domain in the SSL certificates: `raccoonstealer[.]app ;`\nseveral references to the raccoonstealer profile in the Javascript code: contacts:\n```\n   [{title:\"Jabber\",content:\"raccoonstealer[@]exploit[.]im\"},\n   {title:\"Telegram\",content:\"[@]raccoonstealer\"}]\n\n```\nBased on this information, we came across raccoonstealer‘s publications on the underground\nforum Exploit and their Telegram channel confirming that a first release of Raccoon Stealer v2 is\nsold on Telegram since May 17.\n\n\n-----\n\n_Figure 3. Publication in the raccoonstealer’s Telegram channel advertising the malware_\n\nHowever, we were not able to find malware samples distributed in the wild at the time.\n\n[Discover our CTI and XDR products](http://sekoia.io/en/contact/)\n\n## Samples in the wild\n\n[On June 16, 2022, S2W published a comprehensive analysis1](https://medium.com/s2wblog/raccoon-stealer-is-back-with-a-new-version-5f436e04b20d) of the new version of Raccoon\nStealer. Based on a file created by the malware (System Info.txt), they attributed payloads\ndistributed in the wild to the Raccoon Stealer V2. This file contains information about the victim’s\nsystem.\n\nThe sample analysed by S2W matches a newly discovered malware family discussed on Twitter by\ncybersecurity researchers, which was later named RecordBreaker by @James_inthe_box (related\ntweet). Raccoon Stealer v2 and RecordBreaker could be two different names for the same\n**malware family.**\n\nSamples of Raccoon Stealer v2 were therefore observed in the wild since May 16, 2022. As for the\nprevious version, threat actors mainly distribute the information stealer using fake installers, or\ncracked versions of popular software. Here are a few samples faking legitimate software installers:\n\nF‑Secure FREEDOME VPN installer (F-Secure Freedome VPN\n2.50.23.0.licensesrv.exe_KaHCr.exe);\n[R-Studio Network installer (R-Studio.v9.0.190312.licencekey.exe_v3G9m.exe);](https://www.virustotal.com/gui/file/cc51445fa6bce49599b6289aff7f32b99e00c9e1e944494a039725c2999f1c1f)\n[Proton VPN installer (ProtonVPN.exe).](https://tria.ge/220618-b1q66agea8)\n\n## Malware sample attribution\n\nIn order to confirm that the sample analysed by S2W corresponds to a Raccoon Stealer v2 sample,\nwe compared the content of raccoonstealer‘s publications on their Telegram channel with our\n**technical analysis of the stealer**\n\n\n-----\n\nThe publications advertising Raccoon Stealer v2 are promoted by its developers to the user\ncommunity. The authors are therefore focused on the user experience of attackers (performances,\nlog processing, integrity, etc.) which can be embellished. However, raccoonstealer shared technical\nfeatures of their malware. In the following table, we have listed these descriptions to compare with\nour observations during analysis.\n\n**Descriptions from the**\n**_raccoonstealer‘s Telegram_** **[SEKOIA.IO‘s commentary](http://sekoia.io/)**\n\n_“the styler is written in C/C++”_ Based on the samples analysis, we observed the malware code\nwritten in C/C++ and a bit of ASM.\n\n\n_“Raccoon collects:_\n_passwords, cookies and_\n_autocomplete from all popular_\n_browsers (including FireFox_\n_x64), CC data”_\n\n_“Raccoon collects system_\n_information”_\n\n_“almost all existing desktop_\n_cryptocurrency wallets”_\n\n\nBy default (a specific configuration is not needed), the malware\nsamples collect data from browsers SQL databases.\n\nThe malware fingerprints the infected system using Windows\nRegistry queries and other WinApi functions (e.g. RAM, CPU,\ndisplay, installed softwares).\n\nIt is confirmed by the malware configuration which embeds\nmany cryptocurrency wallets browser extensions and Desktop\napps. The configuration can be customized to collect data from\nother wallets, just by setting the path and the targeted file.\n\n\n_“Built-in file downloader”_ The malware implements its own directory listening function to\ngrab files.\n\n\n_“Works on both 32 and 64-bit_\n_systems without_\n_dependencies on .NET.”_\n\n_“Private key, gate address_\n_and all other string values are_\n_heavily encrypted.”_\n\n_“HTTP for sending to_\n_handlers and file servers are_\n_encrypted.”_\n\n_“Screenshot, system info,_\n_each browser profile is sent_\n_separately. Each wallet – sent_\n_separately”_\n\n_“Reworked file grabber (…)_\n_going through all disks_\n_including usb with search_\n_depth”_\n\n\nThe malware doesn’t need any dependencies, it rather\ndownloads 8 DLLs once executed.\n\nC2 address(es) and strings are encrypted using (RC4 and\nBase64), not heavily, perhaps raccoonstealer used this term for\nmarketing? Does the private key correspond to the RC4 key,\nstored in the .rdata section?\n\nWe didn’t observed any encryption of exfiltrated data.\n\n**Quite discriminating, the malware sends data each time it**\ncollects a new one: the system information, the browsers data,\nthe wallets data (for each wallet extension/desktop found) and\nthe screenshot.\n\nThe malware implements its own directory listening function to\ngrab files.\n\n\n-----\n\n**Descriptions from the**\n**_raccoonstealer‘s Telegram_** **[SEKOIA.IO‘s commentary](http://sekoia.io/)**\n\n\n_“The weight of the executable_\n_file of the Stiller is only 50 KB”_\n\n_“We also redesigned the_\n_loader. You can now choose_\n_where to install the file (Low,_\n_Temp, AppData)._\n_CMD/DLL/EXE”_\n\n\nAll stand-alone observed samples are 55KB or 56KB.\n\nTwo ways to execute a payload are implemented in the\nmalware, but we only took a look at the downloaded PE\nexecution function.\n\n\n_Figure 4. Comparative table of features shared by raccoonstealer and the SEKOIA.IO’s analysis_\n\nAlmost all the capabilities or technical details advertised by raccoonstealer, correspond to those\nobserved during our malware analysis. Some properties of the malware are quite generic\n(collecting browser data and system information, capturing screenshot, encrypting the C2 address\nand strings) among the information stealing malware family, but others are rather specific and\nvalidate the attribution to Raccoon (sending data separately, the built-in file downloader, the file\ngrabber going through all disks, and the specific loader).\n\nIt is worth mentioning that the authors announce that Raccoon Stealer v2 exfiltrate encrypted data,\nbut we didn’t observe any encryption or obfuscation in C2 communications during our analysis.\nThis seems to be the only point that differs between the raccoonstealer‘s advertising and our\nobservations. However, it should not be forgotten that their goal is to market the malware, and they\nmight overuse some expressions to do so. Indeed, we have already seen such discrepancies on\n[the MarsTeam‘s publications about Mars Stealer on the XSS forum .2](https://blog.sekoia.io/mars-a-red-hot-information-stealer/)\n\nIn addition, the date of appearance of the first samples matches that of the aforementioned\n“Raccoon Stealer 2.0” servers, as well as the date of the publication of raccoonstealer in their\nTelegram channel (arround May 17, 2022).\n\n## Technical analysis\n\nIn the raccoonstealer‘s Telegram channel, the new version of the malware has been advertised\nwith an improved software, back-end and front-end. Raccoon Stealer’s developers rewrote the\nmalware and the administration panel from scratch, with a focus on performance and efficiency. In\nthe next part, SEKOIA.IO analysed the malware and its communication in depth.\n\n### Malware capabilities\n\nRaccoon Stealer’s capabilities are those of a classic stealer, with a focus on cryptocurrency\nwallets. The malware is also advertised as a loader and a file grabber.\n\nHere is an overview of its capabilities:\n\nTargeting of popular browsers (to steal passwords, cookies, autoforms and credit cards);\n\n\n-----\n\nTargeting of almost all desktop cryptocurrency wallets and extension for cryptocurrency\nwallets (MetaMask, TronLink, BinanceChain, Ronin, Exodus, Atomic, JaxxLiberty, Binance,\n_Coinomi, Electrum, Electrum-LTC, ElectronCash, etc.);_\nFile downloading;\nFile loading (cmd, dll, exe);\nFile grabbing in all disks;\nScreenshot capturing;\nSystem fingerprinting;\nInstalled applications listing.\n\nThe capabilities advertised on Telegram match those identified during our analysis.\n\n### In-depth analysis\n\nRaccoon Stealer v2 is written in C/C++ using WinApi. Sample size is around 56KB, working on\nboth 32 and 64-bit systems without any dependencies. The malware downloads legitimate thirdparty DLLs from its C2 server(s). The C2 configuration and strings are encrypted using RC4 and\nBase64 encoding.\n\nSEKOIA.IO reverse engineered the malware and will soon publish an in-depth analysis to share\nfurther details.\n\nIn the meantime, here is a description of the step-by-step execution of Raccoon Stealer v2:\n\n1. Dynamic Loading of DLLs;\n2. Run-Time Dynamic Linking of WinApi functions;\n3. Strings deobfuscation (base64 decoding and RC4 decryption);\n4. C2 server(s) deobfuscation;\n5. Checks (mutex, user privileges);\n6. Host fingerprint (MachineGuid, Username) and data exfiltration;\n7. Retrieving its configuration from its C2;\n8. Downloading, then loading the legitimate third-party DLLs;\n9. Fingerprint the infected host (CPU, RAM, OS version, Display info) and send this data to the\n\nC2;\n10. Collecting personal information and exfiltrating it (system information, browsers, crypto\n\nwallets);\n11. Capturing a screenshot and exfiltrating it;\n12. Removal of files created by the malware.\n\nInterestingly, during the collection stage, the malware collects the data and sends it directly in a file\nvia a POST request to the C2 server. It repeats this step for each new type of data (system\ninformation, cookies, screenshot, etc.).\n\nIt is worth noting that the malware implements almost no defense evasion techniques, such as antianalysis, obfuscation, or impair defenses.\n\n\n-----\n\n[Discover our CTI and XDR products](http://sekoia.io/en/contact/)\n\n### Network communications\n\nThe malware first sends a POST request to its C2 server with the machineId, username and\n_configurationId (which corresponds to the RC4 key). The server replies with the full malware_\nconfiguration including, as shown in the following figure:\n\nApplications to target;\nURLs hosting the legitimate third-party DLLs;\nToken used for data extraction (corresponds to the C2’s endpoint);\nFile grabber configuration, etc.\n\n\n-----\n\n-----\n\n_Figure 5. Network capture of the communication initiated by the malware on the infected machine_\n_and its C2 server_\n\nRaccoon Stealer v2 then downloads every DLLs, which are sometimes hosted on another server.\n\nFinally, it exfiltrates data by sending POST requests to its C2 server. The URLs used by the\nmalware are built using the token received in the configuration.\n\n\n-----\n\n_Figure 6. Overview of Raccoon Stealer v2 communications_\n\nTo conclude, we expect a resurgence of Raccoon Stealer v2, as developers implemented a\nversion tailored to the needs of cybercriminals (efficiency, performance, stealing capabilities, etc.)\nand scaled their backbone servers to handle large loads. In addition, the malware benefits of the\nthreat actors’ popularity gained in recent years.\n\nWe can assess with high confidence that possible future updates will implement more anti-analysis\ntechniques to avoid detection by antiviruses.\n\n## MITRE ATT&CK TTPs\n\n**Tactic** **Technique** **Description**\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nCredential\nAccess\n\nCredential\nAccess\n\n\nT1140 –\nDeobfuscate/Decode\nFiles or Information\n\nT1027 – Obfuscated\nFiles or Information\n\nT1539 – Steal Web\nSession Cookie\n\nT1555.003 –\nCredentials from\nPassword Stores:\nCredentials from\nWeb Browsers\n\n\nRaccoon Stealer v2 decodes strings and the C2 configuration in\nthe malware using RC4 and base64.\n\nRaccoon Stealer v2 uses RC4-encrypted strings.\n\nRaccoon Stealer v2 harvests cookies from popular browsers.\n\nRaccoon Stealer v2 collects passwords from popular browsers.\n\nRaccoon Stealer v2 lists files and directories to grab files\nthrough all disks.\n\nRaccoon Stealer v2 lists the current running processes on the\nsystem.\n\nRaccoon Stealer v2 queries the Windows Registry key at\nHKLM\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid to\nretrieve the MachineGuid value.\n\nRaccoon Stealer v2 lists all installed software for the infected\nmachine, by querying the Windows Registry key at\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\uninstall\n\nRaccoon Stealer v2 collects OS version, host architecture, CPU\ninformation, RAM capacity and display device information.\n\nRaccoon Stealer v2 collects the time zone information from the\nsystem.\n\n\nDiscovery T1083 – File and\nDirectory Discovery\n\nDiscovery T1057 – Process\nDiscovery\n\nDiscovery T1012 – Query\nRegistry\n\nDiscovery T1518 – Software\nDiscovery\n\nDiscovery T1082 – System\nInformation\nDiscovery\n\nDiscovery T1614 – System\nTime Discovery\n\n\n-----\n\nCollection T1119 – Automated\nCollection\n\nCollection T1005 – Data from\nLocal System\n\nCollection T1113 – Screen\nCapture\n\n\nCommand\nand\nControl\n\nCommand\nand\nControl\n\nCommand\nand\nControl\n\n\nT1071.001 –\nApplication Layer\nProtocol: Web\nProtocols\n\nT1041 – Exfiltration\nOver C2 Channel\n\nT1105 – Ingress Tool\nTransfer\n\n\nRaccoon Stealer v2 scans the disks and automatically collects\nfiles.\n\nRaccoon Stealer v2 collects credentials of cryptocurrency\nwallets from the local system.\n\nRaccoon Stealer v2 captures a screenshot of the victim’s\ndesktop.\n\nRaccoon Stealer v2 uses HTTP for C2 communications.\n\nRaccoon Stealer v2 exfiltrates data over the C2 channel.\n\nRaccoon Stealer v2 downloads legitimate third-party DLLs for\ndata collection onto compromised hosts.\n\n\nExecution T1106 – Native API Raccoon Stealer v2 has the ability to launch files using\nShellExecuteW.\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\nT1055.001 –\nProcess\nInjection: Dynamiclink Library Injection\n\nT1407 – Download\nNew Code at\nRuntime\n\n\nRaccoon Stealer v2 has the ability to load DLLs via\nLoadLibraryW and GetProcAddress.\n\nRaccoon Stealer v2 downloads its next stage from a remote\nhost.\n\n\n## IOCs & Technical Details\n\n### Raccoon Stealer v2’s C2 servers\n\n136.244.65[.]99\n\n138.197.179[.]146\n\n140.82.52[.]55\n\n142.132.180[.]233\n\n142.132.225[.]253\n\n142.132.229[.]12\n\n146.19.247[.]28\n\n146.70.124[.]71\n\n146.70.125[.]95\n\n149.202.65[.]236\n\n164.92.172[.]4\n\n167.235.245[.]75\n\n\n-----\n\n178.128.94[.]180\n179.43.154[.]171\n\n185.106.94[.]148\n\n185.225.19[.]190\n\n185.225.19[.]198\n\n185.227.111[.]81\n\n185.62.56[.]113\n\n188.40.147[.]166\n\n192.248.184[.]34\n\n193.106.191[.]146\n\n193.233.193[.]50\n\n193.38.54[.]50\n\n193.43.146[.]17\n\n193.43.146[.]26\n\n194.156.98[.]151\n\n194.180.174[.]180\n\n194.87.216[.]18\n\n194.87.31[.]186\n\n194.87.45[.]2\n\n2.58.56[.]247\n\n206.189.234[.]222\n\n213.226.100[.]106\n\n23.88.55[.]150\n\n31.13.195[.]44\n\n45.133.216[.]145\n\n45.133.216[.]170\n\n45.133.216[.]249\n\n45.138.74[.]104\n\n45.142.212[.]100\n\n45.142.215[.]50\n\n45.142.215[.]92\n\n45.144.30[.]91\n\n45.150.67[.]175\n\n45.152.86[.]98\n\n45.153.230[.]183\n\n45.67.34[.]234\n\n45.67.35[.]251\n\n45.84.0[.]80\n\n46.101.30[.]175\n\n46.249.58[.]152\n\n5.252.22[.]107\n\n5.252.22[.]62\n\n5.252.22[.]66\n\n51.195.166[.]175\n\n\n-----\n\n51.195.166[.]178\n51.195.166[.]184\n\n51.195.166[.]186\n\n51.195.166[.]201\n\n51.195.166[.]204\n\n51.210.87[.]110\n\n62.113.255[.]110\n\n65.108.20[.]64\n\n77.91.102[.]115\n\n77.91.102[.]44\n\n77.91.73[.]162\n\n77.91.74[.]67\n\n82.202.172[.]185\n\n83.149.87[.]220\n\n85.202.169[.]112\n\n89.108.102[.]157\n\n89.185.84[.]7\n\n91.194.11[.]43\n\n91.242.229[.]166\n\n93.115.28[.]51\n\n94.158.244[.]21\n\n94.158.247[.]13\n\n94.158.247[.]24\n\n94.158.247[.]44\n\n95.216.251[.]186\n\n**Raccoon Stealer v2’s SHA-256**\n\n0123b26df3c79bac0a3fda79072e36c159cfd1824ae3fd4b7f9dea9bda9c7909\n\n022432f770bf0e7c5260100fcde2ec7c49f68716751fd7d8b9e113bf06167e03\n\n048c0113233ddc1250c269c74c9c9b8e9ad3e4dae3533ff0412d02b06bdf4059\n\n0c722728ca1a996bbb83455332fa27018158cef21ad35dc057191a0353960256\n\n2106b6f94cebb55b1d55eb4b91fa83aef051c8866c54bb75ea4fd304711c4dfc\n\n263c18c86071d085c69f2096460c6b418ae414d3ea92c0c2e75ef7cb47bbe693\n\n27e02b973771d43531c97eb5d3fb662f9247e85c4135fe4c030587a8dea72577\n\n2911be45ad496dd1945f95c47b7f7738ad03849329fcec9c464dfaeb5081f67e\n\n47f3c8bf3329c2ef862cf12567849555b17b930c8d7c0d571f4e112dae1453b1\n\n516c81438ac269de2b632fb1c59f4e36c3d714e0929a969ec971430d2d63ac4e\n\n5d66919291b68ab8563deedf8d5575fd91460d1adfbd12dba292262a764a5c99\n\n62049575053b432e93b176da7afcbe49387111b3a3d927b06c5b251ea82e5975\n\n7299026b22e61b0f9765eb63e42253f7e5d6ec4657008ea60aad220bbc7e2269\n\n7322fbc16e20a7ef2a3188638014a053c6948d9e34ecd42cb9771bdcd0f82db0\n\n960ce3cc26c8313b0fe41197e2aff5533f5f3efb1ba2970190779bc9a07bea63\n\n99f510990f240215e24ef4dd1d22d485bf8c79f8ef3e963c4787a8eb6bf0b9ac\n\n9ee50e94a731872a74f47780317850ae2b9fae9d6c53a957ed7187173feb4f42\n\n\n-----\n\nbd8c1068561d366831e5712c2d58aecb21e2dbc2ae7c76102da6b00ea15e259e\nc6e669806594be6ab9b46434f196a61418484ba1eda3496789840bec0dff119a\n\ne309a7a942d390801e8fedc129c6e3c34e44aae3d1aced1d723bc531730b08f5\n\nf7b1aaae018d5287444990606fc43a0f2deb4ac0c7b2712cc28331781d43ae27\n\n### Raccoon Stealer’s C2 servers hosting administration panel\n\n45.61.136[.]191\n45.92.156[.]53\n45.92.156[.]52\n89.39.106[.]64\n109.236.82[.]58\n\nMore IoCs are available on the SEKOIA.IO Community Github: https://github.com/SEKOIAIO/Community/blob/main/IOCs/raccoonstealer/raccoon_stealer_iocs_20220628.csv\n\n## External References\n\n1 [Raccoon Stealer is Back with a New Version, S2W, June 16, 2022](https://medium.com/s2wblog/raccoon-stealer-is-back-with-a-new-version-5f436e04b20d)\n\n\n2 [Mars, a red-hot information stealer, April 7, 2022](https://3xp0rt.com/posts/mars-stealer)\n\n## Chat with our team!\n\nWould you like to know more about our solutions? Do you want to discover our XDR and CTI\nproducts? Do you have a cybersecurity project in your organization? Make an appointment and\nmeet us!\n\n**[Contact us](https://www.sekoia.io/en/contact/)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-28 - Raccoon Stealer v2 – Part 1- The return of the dead.pdf"
    ],
    "report_names": [
        "2022-06-28 - Raccoon Stealer v2 – Part 1- The return of the dead.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535902,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1656803916,
    "ts_modification_date": 1656803916,
    "files": {
        "pdf": "https://archive.orkl.eu/08a388e817164ee651306bbc80edcdcdbbadf14e.pdf",
        "text": "https://archive.orkl.eu/08a388e817164ee651306bbc80edcdcdbbadf14e.txt",
        "img": "https://archive.orkl.eu/08a388e817164ee651306bbc80edcdcdbbadf14e.jpg"
    }
}