{
    "id": "3bf9f03e-6eaa-448f-aa2d-7a60e670efe0",
    "created_at": "2023-01-12T15:11:00.356779Z",
    "updated_at": "2025-03-27T02:08:11.368644Z",
    "deleted_at": null,
    "sha1_hash": "e05308eacf050d4b7f3c0802dc8bb35b26f1962a",
    "title": "2021-06-15 - Ransomware Gang Turns to Revenge Porn",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:01Z",
    "file_modification_date": "2022-05-27T23:00:01Z",
    "file_size": 1807520,
    "plain_text": "# Ransomware Gang Turns to Revenge Porn\n\n**[vice.com/en/article/z3xzby/ransomware-gang-revenge-porn-leaks-nude-images](https://www.vice.com/en/article/z3xzby/ransomware-gang-revenge-porn-leaks-nude-images)**\n\nHacking. Disinformation. Surveillance. CYBER is Motherboard's podcast and reporting on\nthe dark underbelly of the internet.\n\n[See More →](https://www.vice.com/en/topic/cyber)\nAt least one ransomware gang has taken a rare and highly invasive step in order to convince\nits victims to pay: leaking nude images allegedly uncovered as part of their hack of a target\ncompany.\n\n\n-----\n\nThe news presents an escalation in the world of ransomware and digital extortion, and\ncomes as the U.S. government and other countries discuss new measures to curb the spike\nin ransomware incidents. Ransomware groups have recently targeted, and in some cases\nextracted payment from, [the Colonial Pipeline Company,](https://www.vice.com/en/article/bvzzez/colonial-pipeline-hackers-statement-darkside) [meat producer JBS,](https://www.vice.com/en/article/m7eb7a/cyber-attack-sabotages-worlds-largest-meat-processor) and the Irish\nhealthcare system. Locking down computers with ransomware can already have a\nsubstantial impact on business operations; leaking information on top of that can present\nvictims with another risk. But posting nude images publicly on the internet threatens to make\nextortion of organizations a much more personal matter.\n\nMotherboard is not naming the ransomware group responsible for leaking the images, so as\nto not contribute to their likely goal of intimidating the specific victim, or to bolster their\nreputation generally. As Motherboard has reported by speaking directly to digital\nextortionists, some hackers deliberately cater their own image to appear more threatening to\nvictims. Motherboard is also not naming the targeted company nor any of the impacted\nindividuals.\n\nBut there is still a public interest in showing that ransomware groups may continue to push\ntheir tactics to extremes, and what those steps may mean for policymakers, hacking victims,\nand law enforcement.\n\n**_Do you know anything else about a ransomware incident? We’d love to hear_**\n**_from you. Using a non-work phone or computer, you can contact Joseph Cox_**\n**_securely on Signal on +44 20 8133 5190, Wickr on josephcox, OTR chat_**\n**_on_** **_jfcox@jabber.ccc.de, or email joseph.cox@vice.com._**\n\nThe ransomware group regularly posts stolen documents and files from target companies on\nits dark web site. Generally, this may be done after a victim has not agreed to pay an initial\nransom amount. Hackers then steadily leak material they've obtained, and threaten to keep\ndoing so until the target pays.\n\nIn this case, the group seemingly added more material from the victim to their site, and\neventually posted the nude images of a woman.\n\nTypically the sort of material that ransomware groups leak include trade secrets, confidential\nbusiness documents, and emails. In rare cases hackers have leveraged nude images for\nextortion. In 2017, the hacking group known as The Dark Overlord stole images from a\nplastic surgery in the UK and sent those to me. Many of the images were explicit in nature.\nAt the time, the group only threatened to distribute the images further. The intent, it appears,\nwas to try and convince the surgery clinic to pay an extortion amount.\n\nIn this new extortion case, the ransomware group has posted the images publicly.\n\n[Lawmakers have pushed President Biden to pressure Russia around its harbouring of](https://www.politico.com/news/2021/06/13/biden-putin-ransomware-gangs-493563)\nransomware groups. Biden said during the recent G-7 summit of world leaders that he was\n\"open\" to Putin's alleged proposal about each country turning over cybercriminals\n\n\n-----\n\nWe call on all states to urgently identify and disrupt ransomware criminal networks operating\nfrom within their borders, and hold those networks accountable for their actions,\" a joint\nstatement issued at the end of the summit reads.\n\n**_Subscribe to our new cybersecurity podcast,_** **_[CYBER.](https://itunes.apple.com/gb/podcast/cyber/id1441708044?mt=2)_**\n\n## ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX.\n\nBy signing up, you agree to the [Terms of Use and](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/terms-of-use.html) [Privacy Policy & to receive electronic](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/privacy-policy.html)\ncommunications from Vice Media Group, which may include marketing promotions,\nadvertisements and sponsored content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-15 - Ransomware Gang Turns to Revenge Porn.pdf"
    ],
    "report_names": [
        "2021-06-15 - Ransomware Gang Turns to Revenge Porn.pdf"
    ],
    "threat_actors": [
        {
            "id": "9639c065-3fa6-432f-9cbd-5708500c4eaa",
            "created_at": "2022-10-25T16:07:23.255684Z",
            "updated_at": "2025-03-27T02:02:09.705487Z",
            "deleted_at": null,
            "main_name": "Overlord Spider",
            "aliases": [
                "The Dark Overlord"
            ],
            "source_name": "ETDA:Overlord Spider",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536260,
    "ts_updated_at": 1743041291,
    "ts_creation_date": 1653692401,
    "ts_modification_date": 1653692401,
    "files": {
        "pdf": "https://archive.orkl.eu/e05308eacf050d4b7f3c0802dc8bb35b26f1962a.pdf",
        "text": "https://archive.orkl.eu/e05308eacf050d4b7f3c0802dc8bb35b26f1962a.txt",
        "img": "https://archive.orkl.eu/e05308eacf050d4b7f3c0802dc8bb35b26f1962a.jpg"
    }
}