{
    "id": "3c23e457-bce0-49e6-a880-792da6a38fc1",
    "created_at": "2023-01-12T15:06:42.424248Z",
    "updated_at": "2025-03-27T02:05:37.283612Z",
    "deleted_at": null,
    "sha1_hash": "ae0e9e3c368edf3b918ac39a5665868d14c19579",
    "title": "2018-01-18 - The ARC of Satori",
    "authors": "",
    "file_creation_date": "2022-05-27T20:00:13Z",
    "file_modification_date": "2022-05-27T20:00:13Z",
    "file_size": 76588,
    "plain_text": "# The ARC of Satori\n\n**arbornetworks.com/blog/asert/the-arc-of-satori/**\n\nby [ASERT Team on January 18th, 2018](https://www.netscout.com/blog/asert/asert-team)\nAuthors: Pete Arzamendi, Matt Bing, and Kirk Soluk.\n\nSatori, the heir-apparent to the infamous IOT malware Mirai, was discovered by researchers in December 2017. The word \"satori\" means\n\"enlightenment\" or \"understanding\" in Japanese, but the evolution of the Satori malware has brought anything but clarity. Each new version\noffers a fresh combination of targeted platforms, propagation techniques, and attack types. Contrasted with traditional software, in which\nfeatures are added incrementally, Satori seems to go both forward and backward. Digging into the history will provide insight into this\ncontinually evolving threat.\n\n## A Short History of IOT Malware\n\nHeadlines about massive DDoS attacks first captured the public's attention on IOT security in late 2016. The malware responsible, Mirai, didn't\ntarget Windows machines like most threats – it targeted weaknesses in IOT devices and other embedded systems. These devices make great\nDDoS zombies, since often they run a stripped-down version of Linux, are directly connected to the Internet, and have limited security features.\nMirai, and its many copycats, operate with similar principles:\n\nPropagation – Infected devices will attempt to infect other, randomly chosen, devices. Mirai started by using common\nusername/password pairs via the antiquated telnet protocol. Later versions would use platform-specific vulnerabilities, like commandinjection bugs in the web interface of home routers, to spread.\nCommand-and-control – Once infected, the bot – in addition to propagating – would periodically check-in to a command-and-control site\nfor updates and attack commands.\nAttack – Once instructed by the command-and-control, bots would launch a coordinated flood of attack traffic directed at the victim. This\ncan be a flood of TCP packets with specific flags set, UDP packets, HTTP requests, or other more complicated attacks.\n\nThe authors of Mirai eventually published the source code to the malware. With it, anyone who knows how to use a compiler could setup their\nown command-and-control site and quickly build their own Mirai botnet. Those with more technical know-how could add features like new\npropagation methods, command-and-control protocols, and new attack types.\n\n## Satori\n\nResearchers first discovered Satori in December 2017 and other versions of it have been identified since. The initially discovered version of\nSatori distinguished itself from Mirai in that its propagation method targeted two vulnerabilities in IOT devices – a \"zero-day\" in Huawei's home\ngateway and a previously-known command execution vulnerability in Realtek's UPNP SOAP interface. Both were clearly intended to target two\nvery specific types of devices, unlike the more agnostic Mirai, which would infect any device with a default or easily guessable telnet username\nand password. Although there is evidence Satori re-used at least some of the public Mirai code, its precise targeting was what caught the eye\nof researchers. To perhaps further muddy the waters, other versions of Satori do indeed use telnet to propagate, but with a more sophisticated\nlist of usernames and passwords. Every IOT malware including Satori is delivered to a victim in a compiled, ready-to-run format. That means a\nLinux executable compiled specifically for the architecture of the victim. For instance – an ARM device cannot run an executable compiled for\nx86 processors. Before delivering its payload, both Mirai and Satori poke and prod the victim to determine which pre-compiled version of the\nMirai binary to download and execute. Satori raised the bar by introducing new architectures – superh and ARC. It's unclear whether the actors\nbehind Satori did this because they knew a vulnerable population existed, or only hoped that it did. Below is a chart showing the similarities\nand differences, based on ASERT analysis, between the three most recent variants of Satori. Complementary information, including additional\nIoC's, can be found in [1]-[5]. Variant 1 is not included due to its lack of functionality as discussed in [1].\n\n\n-----\n\nSatori\n\nWe distinguish the fourth variant of Satori, in part, because it appears to be the first known ARC malware. Adding the capability to run on the\nARC chip set greatly expands the potential botnet population. According to [6], an article that was written in 2014, \"ARC processor IP cores\nhave been licensed by more than 190 companies and are used in more than 1.5 billion products a year.\" Furthermore, now that this new\nground has been broken it paves the way for other malware authors to target that architecture\n\n\n-----\n\n## DDoS Mitigation\n\nSince the variants of Satori all leverage different subsets of the Mirai DDoS attack codebase, longstanding Mirai-based DDoS mitigation advice\nstill applies. See for example the ASERT Blog entitled Mirai IoT Botnet Description and DDoS Attack Mitigation [7]. Arbor customers can also\nobtain detailed Arbor product-specific mitigation advice by requesting the latest ASERT Mirai threat advisory from their account team or Arbor\nATAC. Additionally, the continued expansion of DDoS-capable malware to different processor architectures further emphasizes the need for\nnetwork operators to adopt network BCPs. While Mirai showed an affinity for IPTV cameras and DVRs with weak passwords, threat actors are\nrewarded for targeting devices others have not. As malware authors expand to ARC and other embedded processors, DDoS-capable malware\ncan subvert a wider range of Internet-connected devices such as phones, gaming consoles, etc. Network operators must re-think their\ndefensive strategies to also protect against compromised internal devices including those which can't be tracked down by following a cable.\nThe collateral damage due to scanning and outbound DDoS attacks alone can be crippling if network architectural and operational best current\npractices (BCPs) are not proactively implemented. BCP references can be found at [8] and [9].\n\n## Conclusion\n\nWhile the impact of IOT malware is self-evident, the threat landscape is constantly evolving. The weakest-of-the-weak, default usernames and\npasswords, have already been abused and attackers move on to more bountiful fruit – exploitable vulnerabilities in devices themselves. This\nreflects the harbinger that Mirai brought the world in 2016 – IOT devices are insecure and will be abused. We expect the three principles of\nIOT malware – propagation, command-and-control, and attacks – to remain the same, but become more sophisticated and evolved over time.\n\n## References\n\n[1] [https://researchcenter.paloaltonetworks.com/2018/01/unit42-iot-malware-…](https://researchcenter.paloaltonetworks.com/2018/01/unit42-iot-malware-evolves-harvest-bots-exploiting-zero-day-home-router-vulnerability/)\n\n[2] [https://research.checkpoint.com/good-zero-day-skiddie/](https://research.checkpoint.com/good-zero-day-skiddie/)\n\n[3] [http://blog.netlab.360.com/warning-satori-a-new-mirai-variant-is-spread…](http://blog.netlab.360.com/warning-satori-a-new-mirai-variant-is-spreading-in-worm-style-on-port-37215-and-52869-en/)\n\n[4] [http://blog.netlab.360.com/early-warning-a-new-mirai-variant-is-spreadi…](http://blog.netlab.360.com/early-warning-a-new-mirai-variant-is-spreading-quickly-on-port-23-and-2323-en/)\n\n[5] [https://www.reddit.com/r/LinuxMalware/comments/7p00i3/quick_notes_for_o…](https://www.reddit.com/r/LinuxMalware/comments/7p00i3/quick_notes_for_okiru_satori_variant_of_mirai/)\n\n[6] [http://www.techdesignforums.com/practice/technique/power-performance-pr…](http://www.techdesignforums.com/practice/technique/power-performance-processor-ip/)\n\n[7] [http://asert.arbornetworks.com/mirai-iot-botnet-description-ddos-attack…](http://asert.arbornetworks.com/mirai-iot-botnet-description-ddos-attack-mitigation/)\n\n[8] [https://app.box.com/s/osk4po8ietn1zrjjmn8b](https://app.box.com/s/osk4po8ietn1zrjjmn8b)\n\n[9] [https://www.cisco.com/c/en/us/support/docs/ip/access-lists/13608-21.html](https://www.cisco.com/c/en/us/support/docs/ip/access-lists/13608-21.html)\n\nPosted In\n\nAttacks and DDoS Attacks\nBotnets\nMalware\nthreat analysis\n\n## Subscribe\n\n_Sign up now to receive the latest notifications and updates from NETSCOUT's ASERT._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-18 - The ARC of Satori.pdf"
    ],
    "report_names": [
        "2018-01-18 - The ARC of Satori.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536002,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653681613,
    "ts_modification_date": 1653681613,
    "files": {
        "pdf": "https://archive.orkl.eu/ae0e9e3c368edf3b918ac39a5665868d14c19579.pdf",
        "text": "https://archive.orkl.eu/ae0e9e3c368edf3b918ac39a5665868d14c19579.txt",
        "img": "https://archive.orkl.eu/ae0e9e3c368edf3b918ac39a5665868d14c19579.jpg"
    }
}