{
    "id": "3c783209-2bf3-4484-996a-ee1d3ba4cafc",
    "created_at": "2023-01-12T14:59:03.071605Z",
    "updated_at": "2025-03-27T02:16:11.574555Z",
    "deleted_at": null,
    "sha1_hash": "71604d34248fce6612d642a12e104d20cfeaf7b5",
    "title": "2018-12-13 - The Return of The Charming Kitten",
    "authors": "",
    "file_creation_date": "2022-05-28T04:51:06Z",
    "file_modification_date": "2022-05-28T04:51:06Z",
    "file_size": 99457,
    "plain_text": "# The Return of The Charming Kitten\n\n**blog.certfa.com/posts/the-return-of-the-charming-kitten/**\n\n**A review of the latest wave of organized phishing attacks by Iranian state-backed**\n**hackers**\n\nCertfa Lab · 2018.12.13\n\nA review of the latest wave of organized phishing attacks by Iranian state-backed hackers\n\n## Abstract\n\nPhishing attacks are the most common form of infiltration used by Iranian state-backed\n[hackers to gain access into accounts. Certfa reviews the latest campaign of phishing attacks](https://certfa.com/)\nthat has been carried out and dubbed as “The Return of The Charming Kitten”.\n\nIn this campaign, hackers have targeted individuals who are involved in economic and\nmilitary sanctions against the Islamic Republic of Iran as well as politicians, civil and human\nrights activists and journalists around the world.\n\nOur review in Certfa demonstrates that the hackers - knowing that their victims use two-step\nverification - target verification codes and also their email accounts such as Yahoo! and\nGmail. As a result, Certfa believes the safest existing way to confront these attacks is using\nSecurity Keys such as YubiKey.\n\n## Introduction\n\nIn early October 2018, MD0ugh, a Twitter user,1 revealed phishing attacks of a group of\nIranian hackers against US financial institution infrastructure. According to this user, these\nattacks could possibly be a reaction to new sanctions against Iran.\n\n\nThe account mentioned a domain with the address accounts[-]support[.]services for the first\ntime. This domain is linked to a group of hackers who are supported by the Iranian\ngovernment, and that we believe have close ties with the Islamic Revolutionary Guard Corps\n(IRGC). ClearSky2 has previously published detailed reports on their activities.\n\nA month after these attacks, the administrators of accounts-support[.]services expanded their\nactivities and started targeting civil and human rights activists, political figures and also\nIranian and Western journalists.\n\n## Methods of Attacks\n\n\n-----\n\nOur investigation illustrates that the attackers are utilising different methods to carry out their\nattacks. These methods can be put into two categories:\n\n1. Phishing attacks through unknown email or social media and messaging accounts\n2. Phishing attacks through email or social media and messaging accounts of public\n\nfigures, which have been hacked by the attackers\n\nWe have also found that the hackers have collected information on their targets prior to the\nphishing attack. The hackers design specific plans for each target based on the level of\ntargets’ cyber knowledge, their contacts, activities, working time, and their geographic\nsituation.\n\nWe also noticed that, unlike in previous phishing campaigns, in some cases the hackers did\nnot change the password of their victims’ accounts in these latest attacks. This allows them\nto remain undetected and monitor a victim’s communications via their email in real time.\n\n## Fake alerts of unauthorised access\n\nAccording to the samples of phishing attacks, the main trick used by these hackers to\ndeceive their targets is that of sending fake alerts through email addresses such as\nnotifications.mailservices@gmail[.]com, noreply.customermails@gmail[.]com,\ncustomer]email-delivery[.]info etc. stating that unauthorised individuals have tried to access\ntheir accounts.\n\nFigure1. Illustration of safe and secure looking fake links\nFigure 1. Illustration of safe and secure looking fake links\n\nBy using this method, attackers pretend that the email provider has sent security alerts to the\ntargets and they should immediately review and restrict suspicious accesses. More details\nare available in the “Destination Link” section.\n\n## Fake file sharing on Google Drive\n\nSending links with titles such as share files from Google Drive has been one of the most\ncommon tricks that hackers have used in recent years. A unique point of these attacks in\ncomparison with the previous ones is that they use Google Site,3 which allows the hackers to\nshow a fake download page of Google Drive, which tricks the users into thinking it’s a real\nGoogle Drive page.\n\nFigure 2. A fake page of Google Drive file sharing page\nFigure 2. A fake page of Google Drive file sharing page\n\nFor example, the hacker had used hxxps://sites.google[.]com/view/sharingdrivesystem to\ndeceive the users and convince them the page is the authentic Google Drive as users can\nsee google.com in the address bar of their browsers. Certfa has reported this link and similar\nlinks to Google and Google has now terminated them.\n\n\n-----\n\nBy creating websites with the same design and look of Google Drive file sharing page,\nhackers pretend to be sharing a file with the user, which they should download and run\nit on their devices. They use hacked Twitter, Facebook and Telegram accounts to send\nthese links and target new users. The truth is there is not any file and the hackers use\nthis page to direct their targets to the fake Google login page, which the users enter\ntheir credential details including 2 factor authentication.\n\n## The Attack Structure\n\nMost of these attacks are currently occurring through phishing emails. As a result, it would be\nuseful to take a look the original content in recent phishing campaigns.\n\nFigure 3. An example of codes of phishing email sent to the user\nFigure 3. An example of codes of phishing email sent to the user\n\n## 1. Destination link\n\n**1.1. Trusted Stage: Internet users around the world consider Google’s main domain**\n(google.com) to be a safe and secure address. The attackers misuse this fact and create\nfake pages on sites.google.com (which is a subdomain of Google) to deceive their targets.\nGoogle’s Site service gives its users an ability to show various contents on it. The attackers\nuse this ability to send fake alerts and redirect their targets to insecure websites or\nembedded phishing pages as a iframe on those pages.\n\nFigure 4. How attackers misuse site.google.com\nFigure 4. How attackers misuse site.google.com\n\n**1.2. Untrusted Stage: Since Google can quickly recognise and eliminate suspicious and**\nmalicious links on sites.google.com, the hackers use their own website. The links of phishing\nwebsites have similar patterns to a previous phishing campaign which was launched in the\npast years. For example, attackers use words such as “management”, “customize”, “service”,\n“identification”, “session”, “confirm” etc. in the domains name and phishing URLs to deceive\nusers who want to verify their website addresses.\n\n## 2. Clickable image in emails\n\nThe hackers use an image, instead of texts, in the body of their emails, to bypass Google’s\nsecurity and anti-phishing system. For this purpose, attackers have also used third party\nservices such as Firefox Screenshot4 to host their email images.\n\nFigure 5. An example of a planted image of fake alarm in a phishing email\nFigure 5. An example of a planted image of fake alarm in a phishing email\n\n## 3. Hidden tracking image on emails\n\n\n-----\n\nThe attackers use a separate hidden image in the body of the email to notify them when their\ntargets open the email. This trick helps the hackers to act immediately after the target opens\nthe email and clicks on the phishing link.\n\n## Phishing Pages\n\nApart from the content structure of the emails and phishing links, we are sure that attackers\nuse a customized platform to create and store users’ credential details. We have also noticed\nthat they have designed the phishing pages for both desktop and mobile versions of Google\nand Yahoo! mail services and they might use other services in the future.\n\nAn interesting technique they have used in recent attacks was once their target enters their\nusername and password, attackers check those credentials on-the-fly and if that information\nwas given correctly, they then ask for 2-step verification code.\n\nIn other words, they check victims’ usernames and passwords in realtime on their own\nservers, and even if 2 factor authentication such as text message, authenticator app or onetap login are enabled they can trick targets and steal that information too.\n\nFigures 6 to 9 demonstrate some examples of the phishing pages, which have been sent to\nthe targets by the Iranian hackers.\n\nFigure 6. A fake page for entering password of Gmail accounts\nFigure 6. A fake page for entering password of Gmail accounts\n\nFigure 7. A fake page for entering 2-step verification code for Gmail accounts\nFigure 7. A fake page for entering 2-step verification code for Gmail accounts\n\nFigure 8. A fake page for entering password of Yahoo! accounts\nFigure 8. A fake page for entering password of Yahoo! accounts\n\nFigure 9. A fake page for entering 2-step verification code for Yahoo! accounts\nFigure 9. A fake page for entering 2-step verification code for Yahoo! accounts\n\n## Hacker’s Footprints\n\nOur primary reviews of the phishing websites linked to this campaign show that hackers have\nset up a remarkable number of domains. Our latest findings show that for this phishing\ncampaign in a relatively short period of time, (September to November 2018), they have\nused more than 20 domain names. The number of phishing domains has increased at the\ntime of writing this report. Closer investigation of these servers revealed how their network of\ndomain names have been used in recent attacks.\n\nFigure 10. Deep data of the attackers’ network in this phishing campaign, which gathered\nby Certfa\nFigure 10. Deep data of the attackers’ network in this phishing campaign, which gathered by Certfa[5]\n\n\n-----\n\nMoreover, our technical reviews reveal that the individuals, who are involved in this\ncampaign used Virtual Private Networks (VPNs) and proxies with Dutch and French IP\naddresses to hide their original location. In spite of their efforts, we have uncovered enough\nevidence to prove that the attackers were using their real IP addresses (i.e 89.198.179[.]103\nand 31.2.213[.]18 from Iran during the preparation phase of their campaign).\n\nAlso, some domain names and servers of this campaign are very similar to the methods,\ntechniques and targets that been used by Charming Kitten, a group of hackers who are\nlinked to the Iranian government. Consequently, we believe Charming Kitten and the Iranian\nhacker(s) belonging to this group have returned and launched new cyber attacks against\nvarious people around the world and with more focus on Israeli and American citizens.\n\n## Conclusion\n\nPhishing attacks are the most popular method of stealing data and hacking account amongst\nIranian hackers, but the most significant fact about this campaign is its timing. This campaign\nlaunched weeks before 4 November 2018 which is when the U.S. imposed new sanctions on\nIran. This campaign tries to collect information by infiltrating the accounts of non-Iranian\npolitical figures and authorities who work on economic and military sanctions against Iran.\n\nIn other words, hackers who are supported by the Iranian government pick their targets\naccording to policies and international interests for the Iranian government and also where\nIran wants to have impact indirectly.\n\nA a result, we propose a series of recommendations to tech companies, policymakers, civil\nsociety actors and internet users to effectively lessen the threat of this type of attack and\neven thwart them.\n\nOur recommendations to tech companies and policy makers:\n\nStop using 2 factor authentication by text plain message/SMS.\nStart using Security Keys (i.e. YubiKey) for 2 factor authentication for high ranking\nindividuals who have sensitive jobs or activities.\nDo not use one-tap login verification process.\n\nOur recommendations to civil society and the Iranian diaspora media:\n\nInform employees and colleagues about any phishing threats and encourage them to\nuse Security Keys such as Yubikey for 2 factor authentication and activate Google’s\nAdvanced Protection Program.\n\n\n-----\n\nAlways use company and institution email accounts instead of personal email for\nsensitive communications. Change Sender Policy Framework or SPF6 settings\naccording to the communication policy of the company/organisation such as restricting\nreceiving emails from outside of the working network. For example, G Suite allows\nadmins to block receiving emails from unauthorised address or domains .7\nEncourage the public to enable 2 factor authentication on their account by mobile apps\nsuch as Google Authenticator.\n\nOur recommendations to users:\n\nDo not click on unknown links. For reviewing suspicious activities on your account or\nchange the password, instead of clicking on any link, you can go to your “My Account”\nsettings from your email directly which is more safer.\nUse email encryption such PGP for sensitive emails which prevent hackers reading\nyour emails in the first place.\nDo not store classified and sensitive information as a plain text in your mailbox.\nHTTPS being before a domain names in a URL does not mean that the content of a\nwebsite is secure or trusted - it’s just a secure extension of the HTTP protocol. Do not\nforget many phishing websites are currently operating under HTTPS protocol too.\n\n## IOCs\n\n178.162.132[.]65\n190.2.154[.]34\n190.2.154[.]35\n190.2.154[.]36\n190.2.154[.]38\n46.166.151[.]211\n51.38.87[.]64\n51.38.87[.]65\n51.68.185[.]96\n51.38.107[.]113\n95.211.189[.]45\n95.211.189[.]46\n95.211.189[.]47\n213.227.139[.]148\n54.37.241[.]221\n54.38.144[.]250\n54.38.144[.]251\n54.38.144[.]252\n85.17.127[.]172\n85.17.127[.]173\n\n\n-----\n\n85.17.127[.]174\n85.17.127[.]175\n89.198.179[.]103\n31.2.213[.]18\naccounts-support[.]services\nbroadcast-news[.]info\nbroadcastnews[.]pro\ncom-identifier-servicelog[.]info\ncom-identifier-servicelog[.]name\ncom-identifier-userservicelog[.]com\nconfirm-session-identification[.]info\nconfirm-session-identifier[.]info\nconfirmation-service[.]info\ncustomer-recovery[.]info\ncustomize-identity[.]info\ndocument-share[.]info\ndocument.support-recoverycustomers[.]services\ndocumentofficupdate[.]info\ndocuments.accounts-support[.]services\ndocumentsfilesharing[.]cloud\nemail-delivery[.]info\nmobile-sessionid.customize-identity[.]info\nmobiles-sessionid.customize-identity[.]info\nmy-scribdinc[.]online\nmyyahoo.ddns[.]net\nnotificationapp[.]info\nonlinemessenger.com-identifier-servicelog[.]name\npodcastmedia[.]online\nrecoveryusercustomer[.]info\nsession-management[.]info\nsupport-recoverycustomers[.]services\ncontinue-session-identifier[.]info\nmobilecontinue[.]network\nsession-identifier-webservice.mobilecontinue[.]network\ncom-messengersaccount[.]name\ninvitation-to-messenger[.]space\nconfirm-identification[.]name\nmobilecontinue[.]network\nmobile.confirm-identification[.]name\nservices.confirm-identification[.]name\nmobile-messengerplus[.]network\nconfirm.mobile-messengerplus[.]network\n\n\n-----\n\ncom-messengercenters[.]name\nsecuremail.mobile-messengerplus[.]network\ndocuments.mobile-messengerplus[.]network\nconfirm-identity[.]net\nidentifier-sessions-mailactivityid[.]site\nactivatecodeoption.ddns[.]net\nbroadcastpopuer.ddns[.]net\nbooks.com-identifier-servicelog[.]name\nmb.sessions-identifier-memberemailid[.]network\nsessions-identifier-memberemailid[.]network\nsessions.mobile-messengerplus[.]network\nconfirm-verification-process[.]systems\naccounts.confirm-verification-process[.]systems\nbroadcastnews.ddns[.]net\naccount-profile-users[.]info\nus2-mail-login-profile[.]site\nus2.login-users-account[.]site\nlogin-users-account[.]site\nlive.account-profile-users[.]info\nsignin.account-profile-users[.]info\naol.account-profile-users[.]info\nusers-account[.]site\n\n## Footnotes:\n\n[1. https://s.certfa.com/q1514c](https://s.certfa.com/q1514c)\n\n[https://s.certfa.com/eNnnag](https://s.certfa.com/eNnnag)\n\n[https://s.certfa.com/ur93p2](https://s.certfa.com/ur93p2) ↩\n\n2. ClearSkye Cyber Security (2018), “Charming Kitten, Iranian cyber espionage against\n\nhuman rights activists, academic researchers and media outlets - and the HBO hacker\n[connection”. Accessed November 15, 2018. https://s.certfa.com/1ulIxk](https://s.certfa.com/1ulIxk) ↩\n\n[3. Sites. Accessed November 23, 2018. https://sites.google.com/](https://sites.google.com/) ↩\n\n[4. Firefox Screenshots. Accessed November 15, 2018. https://screenshots.firefox.com/](https://screenshots.firefox.com/) ↩\n\n[5. VirusTotal Graph. Accessed November 25, 2018. https://s.certfa.com/OgQUSC](https://s.certfa.com/OgQUSC) ↩\n\n\n-----\n\n6. Sender Policy Framework or SPF is an email authentication method to detect forged\n\nsender addresses in emails. SPF allows the recipient to check that an email claiming to\ncome from a specific domain comes from an IP address authorized by that domain’s\nadministrators. ↩\n\n7. G Suite Administrator Help (2018), “Restrict messages to authorized addresses or\n\ndomains”. Accessed November 29, 2018.\n[https://support.google.com/a/answer/2640542?hl=en](https://support.google.com/a/answer/2640542?hl=en) ↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-13 - The Return of The Charming Kitten.pdf"
    ],
    "report_names": [
        "2018-12-13 - The Return of The Charming Kitten.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535543,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1653713466,
    "ts_modification_date": 1653713466,
    "files": {
        "pdf": "https://archive.orkl.eu/71604d34248fce6612d642a12e104d20cfeaf7b5.pdf",
        "text": "https://archive.orkl.eu/71604d34248fce6612d642a12e104d20cfeaf7b5.txt",
        "img": "https://archive.orkl.eu/71604d34248fce6612d642a12e104d20cfeaf7b5.jpg"
    }
}