{
    "id": "3c9ac70a-3784-4542-807e-7e010f1cb393",
    "created_at": "2022-10-25T16:48:22.266012Z",
    "updated_at": "2025-03-27T02:16:25.591404Z",
    "deleted_at": null,
    "sha1_hash": "67024888ac7a9748a7679a2f09512011d3b54078",
    "title": "Backing Your Backup: Defending NAS Devices Against Evolving Threats",
    "authors": "",
    "file_creation_date": "2022-01-19T09:53:54Z",
    "file_modification_date": "2022-01-19T09:55:45Z",
    "file_size": 2079945,
    "plain_text": "-----\n\n**TREND MICRO LEGAL DISCLAIMER**\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro\n\nreserves the right to modify the contents of this document\n\nat any time without prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy\n\nis not guaranteed nor implied. If any questions arise\n\nrelated to the accuracy of a translation, please refer to\n\nthe original language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\nPublished by\n###### Trend Micro Research\n\nWritten by\n###### Stephen Hilt and Fernando Mercês\n\nWith thanks to\n###### Marco Balduzzi, Philippe Z Lin, Robert McArdle, Alfredo Oliviera, and Rainer Vosseler\n\nStock image used under license from\n\nShutterstock.com\n\n_For Raimund Genes (1963 – 2017)_\n\n\n### Contents\n\n#### 4\n###### Introduction\n\n#### 5\n###### Why Attack NAS Devices?\n\n#### 8\n###### Threats\n\n#### 30\n###### How to Defend NAS Devices\n\n#### 32\n###### Conclusion\n\n#### 33\n###### Appendix\n\n\n-----\n\n###### As businesses and users depend on their network-attached storage (NAS) devices for everyday operations and backup, cybercriminals are pivoting to target these internet of things (IoT) devices mainly for two reasons: the valuable data stored and the optional security provisions. As more\n manufacturers improve their device features and more users become capable of customization, there is a complacency on securing these equipment as security is not required and the operating systems used support a wide range of languages and platforms.\n\n In this research, we looked into the current infrastructure of popular NAS devices and the current features available for their respective customers such as power users (that is, IT and key tech-related personnel of their respective companies whose NAS devices are connected to the internet and their corporate networks for routine operational functions) and small- and medium-sized businesses (SMBs). We found that while many of the previous threats have been addressed by their respective manufacturers, a significant number of these devices remain vulnerable to attacks and malware infections — suggestive of the persistency and longevity of IoT malware and IoT devices as targets.\n\n We identify the latest significant threats and risks that can affect NAS devices when compromised. We also include our insights on how users and business can improve their storage and backup IoT devices’ security to prevent and mitigate the impact of these risks.\n\n\n-----\n\n## Introduction\n\nThe number of internet-connected devices is constantly increasing. The kind of devices that are online\n\nand where they are located are equally important. In our previous research, we discussed how today’s\n\nexposed internet of things (IoT) devices are involved in an ongoing “IoT worm war.” We also cited how\n\nthreat actors are working to compromise as many devices as they can, even removing other malware\n\ntypes from already-infected devices.[1]\n\nThe level of sophistication around IoT malware also warrants attention. In January 2021, we noticed\n\nthat VPNFilter, one of the most advanced IoT malware types known to date, continues to be active two\n\nyears after Cisco Talos discovered it.[2] Our joint research with the Shadowserver Foundation showed that\n\nthousands of infected devices still existed worldwide, and a good portion of this number even responded\n\nto our requests, indicating the malware is active. This clearly shows the longevity of IoT attacks — when\n\nan IoT device is infected, it stays infected.\n\nIn this research, we write about attacks on a specific range of popular NAS devices from major vendors\n\nwith worldwide presence. Recently, we observed an increase in malware families that are either written\n\nspecifically to target these devices or have been modified to support them, victimizing users, companies,\n\nand small businesses in their homes and workplaces. We cover what the real threats to NAS owners are\n\nand how they work, as well as what users and enterprises can do to protect their network based on the\n\nmost recent attack scenarios.\n\n\n-----\n\n## Why Attack NAS Devices?\n\nThere are two main reasons that attackers target NAS devices: Security is not a priority for these devices,\n\nand there are valuable data stored in them. Additionally, many users expose their NAS devices on the\n\ninternet to make remote access to data easier for them. But this convenience also makes it easier for\n\nattackers to find vulnerable devices. We cover these reasons and other aspects that make NAS devices\n\nattractive to criminals in this paper.\n\n##### Security is not a priority\n\nIt’s sad but true. When you buy a NAS device, you turn it on and it should work. Users do not expect to\n\nspend extra money on security software or invest time on complex hardening configurations. Although\n\na few vendors suggest that users enable basic security mechanisms in their NAS products, more secure\n\nsettings are not enabled by default. A good example is the warning that our QNAP TS-451+ showed after\n\nwe finished the configuration for the first time. Although it does warn the user that there are more secure\n\nconfigurations available, it does not enforce them.\n\nFigure 1. QNAP TS-451+ additional security settings warning\n\nTo make things worse, security updates are not compulsory. A user can keep using an old, vulnerable\n\nfirmware version for a long time before they receive an alert or notification that only suggests an update\n\nrather than requiring it. This opens a huge window for attackers looking for vulnerable devices to exploit\n\nor even for password brute force attacks, especially when the device is accessible via the internet.\n\n\n-----\n\n##### Valuable data\n\nA NAS device would not be useful without valuable data stored in it. More importantly, these devices are\n\ncommonly taken as the safest venues for a backup of users’ data. If a user owns a NAS, work-related files\n\nand family memories (such as photographs and videos) are likely kept together. Therefore, if criminals are\n\nlooking for a place to make an impact, a NAS is indeed a very attractive candidate. What happens if a\n\nransomware gang encrypts all the data in a NAS device used as a backup? Unfortunately, most people\n\ndo not have another backup plan for the backup device itself.\n\n##### Internet-facing devices\n\nWhile it should not happen, theory is different from practice. A quick search on the internet using Shodan\n\nreveals thousands of exposed devices, as can be seen in the following table:\n\n**Number of**\n**Vendor**\n**devices**\n\nSynology 2,889,495\n\nQNAP 422,510\n\nWestern Digital 9,625\n\nTerramaster 5,217\n\nBuffalo 44\n\nTable 1. Number of NAS devices exposed on the internet\n\nThese numbers do not mean that these devices are vulnerable. In fact, given the volatility of networks,\n\nthey are hardly exact. Still, these results give us an idea of the number of NAS devices that users connect\n\ndirectly to the internet, thereby going in the opposite direction of all security recommendations.\n\n##### Modern hardware\n\nThe fact that industry-standard processors are used in modern NAS devices makes things easier not only\n\nfor application developers, but also for malware developers. A good example is the TS-x51 series from\n\nQNAP, which features a Quad-core Intel Celeron 2.0 GHz processor. This allows both types of developers\n\nto carry out power-hungry functions such as decoding 4K video streaming. For some of our tests, we\n\nused a TS-451+ model, listed in the QNAP website as a small office/home office (SOHO) or home device.\n\n|Vendor|Number of devices|\n|---|---|\n|Synology|2,889,495|\n|QNAP|422,510|\n|Western Digital|9,625|\n|Terramaster|5,217|\n|Buffalo|44|\n\n\n-----\n\nFigure 2. Processor information from the QNAP TS-451+\n\nIn addition to gaining access to a powerful machine, today’s cybercriminals are drawn to the ability of NAS\n\ndevices to run programs in well-known platforms.\n\n##### Flexible operating systems\n\nAs the most used operating system for IoT devices, Linux is no different with respect to NAS devices.\n\nMany development tools support the Linux operating system natively, and compilers and interpreters\n\nlike Python run smoothly on this platform. This enables developers and malware developers alike to\n\ncreate programs in almost any language, use standard and well-known libraries, and leverage the stable\n\nbackend that Linux and its native tools provide. At the end of the day, cybercriminals can program faster.\n\nAdditionally, the code can be written once and then executed in different devices, even from different\n\nvendors with little or no changes.\n\n\n-----\n\n## Threats\n\nWe identify the different threats and specific malware families that we observed to be targeting or are\n\ncapable of inflicting damage on NAS devices, disrupting businesses, and making a significant impact on\n\nIoT devices’ power users.\n\n##### Ransomware\n\nWhile ransomware in general is known to inflict serious damage on their targets, we observed NAS devices\n\nto potentially be vulnerable to traditional and modern types alike. Considering the amount of data kept in\n\nthese IoT devices, these might serve as another profitable target for ransomware operators.\n\n###### Qlocker\n\nQlocker,[3] a ransomware variant that was found in April 2021, primarily affects QNAP devices. While it is\n\nnot associated with major organized crime groups, it is no less damaging and serves as a good example\n\nwhen discussing the infection routines and details common to NAS malware attacks.\n\nThis ransomware was found exploiting a vulnerability[4] in the wild in Hybrid Backup Sync (HBS) software,\n\njust like another malware type that we discuss later in this report (eCh0raix). This vulnerability was\n\nassigned as CVE-2021-28799 and allows an attacker to remotely log in to an affected device and execute\n\nany command. Once in, the ransomware uses the built-in tools to attack the system.\n\nQlocker is a Python-based ransomware that uses the 7-Zip utility to encrypt the files in the NAS with a\n\ngenerated password. The password is based on hardware information combined with a public-private\n\nkey pair.\n\n\n-----\n\nFigure 3. The public key found in Qlocker\n\nQlocker creates the password for encryption by taking the serial number of the QNAP device via a QNAP\n\nnative tool at /sbin/get_hwsn. After that, it randomly chooses 32 characters made of standard letters\n\nand numbers. This string is then prepended to the front of the serial number with a pipe (|) separator.\n\nQlocker then, encrypts the entire string with the public key. Next, the string is base64 encoded, which is\n\nan important step as this is the key that was shown to the user for putting into the ransomware gang’s Tor\n\nsite. The password for the 7-Zip is the same random 32 characters created with the random_id variable.\n\nFigure 4. Random ID creation in Qlocker\n\nIt is interesting that the entire encryption process is left entirely for the built-in 7-Zip utility to process.\n\nThe encryption function of Qlocker clearly leaves the hard part to the free software compression tool, as\n\nshown in the following image:\n\nFigure 5. Qlocker encryption routine that uses 7-Zip\n\n\n-----\n\nThe malicious actor even left a few lines of code, probably intended for debugging the code in the script.\n\nThe ransom note asks the victim to go to a Tor website and input their “client key,” seemingly showing\n\nthat attackers think about their victims almost as “customers” of their “products.”\n\nFigure 6. Qlocker code that creates the ransom note\n\nOnce the victim goes to the Tor site, they input the information provided as their key. This key then looks\n\nup a cryptocurrency wallet and presents the victim with information on how they can pay to to get their\n\nfiles back. The actor then reverses this process to extract the generated password. This password is sent\n\nback to the victim after their payment is proven, which is done by the victim entering their transaction ID\n\ninto the system.\n\nFigure 7. The Qlocker Tor site appears after the victim enters the key.\n\n\n-----\n\nWe wrote a script that would create all this information and uploaded it to the Tor site to collect the number\n\nof cryptocurrency wallets being used by the actor and keep track of changes. The script ran until the Tor\n\nsite was taken offline. The following is the list of bitcoin wallets we observed when the site was still active.:\n\n**BTC** **Amount in**\n**Wallet** **Transactions**\n**received** **US$**\n\n324YcsHLAQAyHUWPPHpBDmSmDvt4D1Hutk 0.30919541 34 14,357.09\n\n32LYU9HhwEqPi2novnFEdJRhkyXmwz1bXY 0.27953913 27 12,980.04\n\n33VuSHjLPPJ4Stw5PcYDqt3288CUUPRJdS 0.299116 23 13,889.06\n\n35v5HQFD8mMMoon2dAr3A97Q5fyPqSQXuK 0.32952745 26 15,301.18\n\n3A655NjLyZ31K3B2qG9eXx4TcwPacrJHfb 0.38010664 35 17,649.76\n\n3Aqd81YSszzjbZSSZLPRzh6WddVHdaBaFw 0.39340483 38 18,267.24\n\n3B1rN4ewmfRuRcUFAJEfEQ9gkp8QWRrQ7q 0.39149318 40 18,178.48\n\n3BDr52JBkcwqFfupbSHKzgFKhtoMYqTxUn 0.25961378 28 12,054.83\n\n3BDXP21NY5C3X966sf1UU7UrjuiEGwrUZv 0.37036124 36 17,197.24\n\n3BH3t62Wr4LBZfyr6mqGgxWRvS67a8euou 0.30001803 28 13,930.95\n\n3Bsf5EriSnH5LWGNJb54gjWuYQjyzttcNb 0.2396179 28 11,126.35\n\n3DdtVrRyNiCcTTmn6NifDdm2HXrbbsPBXH 0.44899005 41 20,848.27\n\n3DhE1iZ5Ui6HALVKuuYXW52ArZPVJjUgJA 0.29936922 30 13,900.82\n\n3FbzgA2iDiTnxtJ5a1FPoHAFK7zvtstQy8q 0.1895157 20 8,799.92\n\n3FfEjyjEiFb1HzU8VLNKkaRDH15oBsqPST 0.28304423 34 13,142.79\n\n3FmnhH58rN6LeMb6tgF4YredL6oNVicyTj 0.2398344 28 11,136.4\n\n3H9w4j1orS7CRc7MQDA8EitrVxwg9V2swL 0.27036144 25 12,553.88\n\n3JaaABhfStNroU1Zj9PbfJuccwU4G4JRS6 0.38024933 32 17,656.38\n\n3LDnsDP5SgG3K9UKSJ3YW3tynvM5uBkiXt 0.29892213 25 13,880.06\n\n3NtgDQCu7xck4UepyTf8HNSSvrMCnKZRjt 0.42975298 32 19,955.02\n\n**TOTAL:** **6.39203307** **610** **296,805.75**\n\nTable 2. Active Bitcoin wallets linked to the Qlocker ransomware operators\n\nA victim of Qlocker on the Bleeping Computer forums shared a script called “re.sh,” that might also be\n\nassociated with the cybercriminal group. This script deletes snapshots of the NAS so that a user cannot\n\nrecover files from those snapshots.\n\n|Wallet|BTC received|Transactions|Amount in US$|\n|---|---|---|---|\n|324YcsHLAQAyHUWPPHpBDmSmDvt4D1Hutk|0.30919541|34|14,357.09|\n|32LYU9HhwEqPi2novnFEdJRhkyXmwz1bXY|0.27953913|27|12,980.04|\n|33VuSHjLPPJ4Stw5PcYDqt3288CUUPRJdS|0.299116|23|13,889.06|\n|35v5HQFD8mMMoon2dAr3A97Q5fyPqSQXuK|0.32952745|26|15,301.18|\n|3A655NjLyZ31K3B2qG9eXx4TcwPacrJHfb|0.38010664|35|17,649.76|\n|3Aqd81YSszzjbZSSZLPRzh6WddVHdaBaFw|0.39340483|38|18,267.24|\n|3B1rN4ewmfRuRcUFAJEfEQ9gkp8QWRrQ7q|0.39149318|40|18,178.48|\n|3BDr52JBkcwqFfupbSHKzgFKhtoMYqTxUn|0.25961378|28|12,054.83|\n|3BDXP21NY5C3X966sf1UU7UrjuiEGwrUZv|0.37036124|36|17,197.24|\n|3BH3t62Wr4LBZfyr6mqGgxWRvS67a8euou|0.30001803|28|13,930.95|\n|3Bsf5EriSnH5LWGNJb54gjWuYQjyzttcNb|0.2396179|28|11,126.35|\n|3DdtVrRyNiCcTTmn6NifDdm2HXrbbsPBXH|0.44899005|41|20,848.27|\n|3DhE1iZ5Ui6HALVKuuYXW52ArZPVJjUgJA|0.29936922|30|13,900.82|\n|3FbzgA2iDiTnxtJ5a1FPoHAFK7zvtstQy8q|0.1895157|20|8,799.92|\n|3FfEjyjEiFb1HzU8VLNKkaRDH15oBsqPST|0.28304423|34|13,142.79|\n|3FmnhH58rN6LeMb6tgF4YredL6oNVicyTj|0.2398344|28|11,136.4|\n|3H9w4j1orS7CRc7MQDA8EitrVxwg9V2swL|0.27036144|25|12,553.88|\n|3JaaABhfStNroU1Zj9PbfJuccwU4G4JRS6|0.38024933|32|17,656.38|\n|3LDnsDP5SgG3K9UKSJ3YW3tynvM5uBkiXt|0.29892213|25|13,880.06|\n|3NtgDQCu7xck4UepyTf8HNSSvrMCnKZRjt|0.42975298|32|19,955.02|\n|TOTAL:|6.39203307|610|296,805.75|\n\n\n-----\n\nFigure 8. Bleeping Computer forum post from a victim\n\nThe user also shared part of the code that shows re.sh will first unmount drives that have the word\n\n“mapper” and “snap” in them. Next, it uses the find command to **find any file that contains the word**\n\n“snap” at the beginning of the file name in the /dev/vg* directories, and then proceeds to remove those\n\nfiles.\n\nFigure 9. re.sh snapshot deletion script source code\n\nAlso discussed on the forums is another file identified as backup.php, a PHP script that was deployed\n\nin **/mnt/ext/opt/apps/backup.php, which is a mapped drive separate from the main storage. If this**\n\ndirectory iss accessible from the web interface by going to hxxp[:]//ip.of.the.nas/backup.php, the script\n\nthen executes the commands that are passed along in the command argument as this script is a common\n\nweb shell. For example, the attacker could get a listing of the files by issuing the following command:\n\n```\n$ curl -d ‘cmd=ls’ ip.of.the.victim/backup.php\n\n```\n\nThis command will return the results of the “ls” command that is run in the victim NAS. However, while\n\nthe directory stored is not directly accessible from our testing, there are other places where this could\n\nbe placed in the system and where this PHP script might be called. This is why security solutions in NAS\n\ndevices are important, as well as why NAS devices should be considered as more than just mounted\n\ndevices for storage. Rather, they should also be safeguarded for the sake of all the files in the system to\n\nensure that no compromise happens.\n\n\n-----\n\nFigure 10. Content of backup.php file\n\nWhile this is assumed to be part of the Qlocker attacks, we could not find any evidence other than the\n\nforum posts that demonstrated these attacks. This could be part of another attack by someone else.\n\nHowever, this shows the dangers to files and systems that actors are willing to go through to ensure that\n\nusers cannot restore anything in their devices without paying the actors. While many people use NAS\n\ndevices for backups themselves, one attack like this could render all important documents or family\n\nphotos gone forever. In the case of the backdoor, this gives someone permanent access to the systems\n\neven if the ransomware is removed and the files are restored or started over from scratch, as this simply\n\ngives threat actors a way to get back in to inflict damage all over again.\n\n###### REvil\n\nOne of the most prominent organized crime groups in the world is the gang behind the REvil (aka\n\nSodinokibi) ransomware. The group, which has been active since at least 2016 when it started the Cerber\n\nransomware campaign, has been going through changes ever since. In 2018, it started the GandCrab\n\nransomware campaign and in 2020, it rebranded itself as REvil. In mid-July 2021, the REvil websites used\n\nby the gang were found to be offline. The reason for the criminal group’s disappearance is not clear, but\n\njust a few days before that, researchers at MalwareHunterTeam found a Linux version of the nasty REvil\n\nransomware.[5]\n\nDubbed Revix (maybe suggesting “REvil for Linux”), we found four different versions being distributed:\n\n**Version** **Observed**\n**number** **extensions**\n\nN/A .7rspj\n.qoxaq\n\n1.1c .rhkrc\n\n1.1d .naixq\n\n1.2a .cx2mr\n\nTable 3. Revix versions observed\n\nThe ransomware relies on an embedded JavaScript Observed Notation (JSON)-based configuration to\n\nset the parameters before it starts encrypting files in the target system. An example is shown in Figure 11:\n\n|Version number|Observed extensions|\n|---|---|\n|N/A|.7rspj .qoxaq|\n|1.1c|.rhkrc|\n|1.1d|.naixq|\n|1.2a|.cx2mr|\n\n\n-----\n\nFigure 11. REvil for a Linux JSON-based configuration\n\nSome parameters are ignored by the ransomware. The most important used ones are the following:\n\n- **pk: A 64-byte key**\n\n- **nbody: The ransomware note text-encoded in base64**\n\n- **nname: The ransomware note name**\n\n- **ext: Extension added to encrypted files**\n\nRevix is a post-intrusion type of ransomware. Actors execute it manually on a NAS device, as the following\n\nscreenshot shows.\n\n\n-----\n\nFigure 12. Revix encrypting a QNAP NAS device in our lab\n\nAfter encryption, the ransom note is created containing a unique key per victim.\n\nFigure 13. Revix ransom note in a QNAP NAS device\n\n\n-----\n\nThe changes among the different versions are minor. The important thing here is that all of them support\n\nencrypting NAS devices as advertised by the authors back in May 2021 in exploit.in forums. Another\n\nconcern is that after a period of downtime, REvil servers became active again in September 2021; we\n\ntherefore expect a new wave of ransomware attacks to follow.\n\n###### eCh0raix\n\nAlso known as QNAPCrypt as it originally targeted only QNAP NAS devices, the eCh0raix ransomware\n\ngang recently expanded its targeted NAS malware to include Synology devices.[6] Notably, the group has\n\nextensive knowledge of the inner workings of NAS devices. One sign of this expertise is the files and\n\ndirectories that it excludes from encryption, including crucial files for the NAS device and its web-based\n\ninterface to work. Here is the exclusion list for this ransomware:\n\n**Files** **Directories**\n\n        - README_FOR_DECRYPT.txt         - .system/opt\n\n        - README_FOR_DECRYPT.txt         - .system/thumbnail\n\n        - qnapSystem.php         - /boot/390625\n\n                             - /dev/\n\n                             - /etc/\n\n                             - /home/httpd\n\n                             - /mnt/ext/opt\n\n                             - /proc\n\n                             - /run/\n\n                             - /sys/1562578125\n\n                             - /tmp\n\n                             - /usr/syno\n\n                             - /volume1/@appstore/PhotoStation\n\nTable 4. Files and directories that eCh0raix does not encrypt\n\n|Files|Directories|\n|---|---|\n|• README_FOR_DECRYPT.txt • README_FOR_DECRYPT.txt • qnapSystem.php|• .system/opt • .system/thumbnail • /boot/390625 • /dev/ • /etc/ • /home/httpd • /mnt/ext/opt • /proc • /run/ • /sys/1562578125 • /tmp • /usr/syno • /volume1/@appstore/PhotoStation|\n\n\n-----\n\n|Extensions|Col2|Col3|\n|---|---|---|\n|• .@analytic • .@backup_config • .@backup_qbox • .@backup_qfiling • .@qmariadb • .antivirus • .appDB • .ascii • .asset • .bckup • .btapp • .ccbjs • .config • .cshtml • .d3dbsp • .dazip • .dhtml • .disco • .epibrw • .esproj • .forge • .gcode • .gz • .ibank • .idmap • .iwdgt • .jhtml • .lasso • .layout • .ldapdb|• .locks • .log • .lrf • .lsp • .ltx • .lvl • .lzh • .m3u • .map • .master • .max • .mcmeta • .mdb • .mddata • .mdf • .mef • .mht • .mhtml • .mpqge • .mrwref • .obml15 • .obml16 • .php_session_sys • .pkp • .prproj • .qpkg • .rflw • .rgss3a • .rofl • .rwsw • .sass|• scss • .seam • .shtm • .sidd • .sidn • .site • .sites2 • .sldasm • .sldm • .sldprt • .sldx • .step • .stml • .suck • .syncdb • .system/opt • .system/thumbnail • .tile • .tvpi • .tvvi • .vbhtml • .vfs0 • .vhdx • .vmdk • .vmem • .vrml • .wallet • .webloc • .widget • .xcf|\n\n\nTable 5. Extensions eCh0raix avoids encrypting\n\n\n-----\n\nIn the preceding exclusion list, directory paths/usr/syno can be seen. These paths are found in Synology\n\ndevices, and there are also paths related to qbox, which is used by QNAP devices.\n\nDifferent from other ransomware families, recent eCh0raix samples use a command and control (C&C)\n\nserver to download encryption keys and a cryptocurrency wallet for victims to transfer the demanded\n\nmoney to. But the criminals were careful enough to put this C&C behind an .onion domain in the Tor\n\nnetwork and mask its real physical location. The malware establishes a connection using one of the\n\nfollowing SOCKS5 proxy to be able to access an .onion domain:\n\n```\nsocks5://161.35.151.35:9100\nsocks5://176.122.23.54:9100\nsocks5://178.128.198.212:9100 (online at the time of writing)\nsocks5://185.10.68.89:9100\nsocks5://185.181.229.175:9100\n\n```\n\nOnce the connection is established, it uses one of the following custom API keys to request encryption\n\nkeys and the wallet from the C&C server:\n\n```\n-mALsyZIca2YddhHc8Mdp603Us4tiKqy\n-xS-0UcHPaAJgaQCkyE29icDiJeAakj7\n41xvlF4tQ1b3iXd5okwCNhcj7fh9gMB2\nSgs1FPmsXEg0TidoGD5nm5QDZRLCu49L\nZt8q4XxpTO9lo5A38-S4QqL4Obcn0uqP\nazL-JNqKevsFrkkGHzrNeFhvyMJTf-rQ\nchuADfBHD8hpgVs7wH8eS3S0Vv-rusj6\nhUQKZsUm9SxYmfvLyfe8dP3cOw9BZwjI\nhv3PWxhLkfOuNjE9u3eOGogbGSH2bGT0\nmqfduZUEmnXwZ67SzyDqu1mrvk6eW1K1\nujyalqzJ17mtAVkNdpBWx3lMYCMVFe13\n\n```\n\neCh0raix does not encrypt NAS devices if it cannot talk to the C&C server via a SOCKS5 proxy, which\n\nwould make room for security measurements, if any, to prevent its execution. For the samples using a\n\nC&C already down, we had to setup our own SOCKS5 proxy server and web server to verify if it can really\n\nencrypt QNAP devices as the following image shows:\n\n\n-----\n\nFigure 14. eCh0raix sample encrypting a QNAP device\n\nTo avoid double encryption, eCh0raix checks if the ransom note is present in the file system. If it finds a\n\nfile named README_FOR_DECRYPT.txtt, it aborts execution:\n\nFigure 15. eCh0raix aborting execution after finding a ransom note\n\neCh0raix is a good example of a ransomware attack that can be stopped if the right set of indicators of\n\ncompromise (IOCs) is blocked or if network defenses are in place.\n\n###### DarkSide\n\nActive since at least August 2020, the group behind the infamous DarkSide ransomware is responsible\n\nfor the Colonial Pipeline attack back in early May 2021.[7] Meanwhile, an actor in underground forums who\n\nis allegedly responsible for DarkSide has advertised that the release of this ransomware’s version 2.0 for\n\nLinux includes support for encrypting NAS devices. Part of the advertisement’s text is reproduced here:\n\n\n-----\n\nOriginal (Russian):\n\nМногопоточен (Hyper-threading, аналог i/o на windows)\n\nChaCha20 + RSA 4096, высокая скорость работы\n\n2 режима работы: Fast/Space\n\n14 параметров настройки билда в админ-панели (расширения, завершение вм и т.п.)\n\nПоддержка основных версий ESXI [5.1 - 7.0]\n\nПоддержка NAS’ов (Synology, OMV и другие (презентуем позже))\n\nIn English, this reads as follows:\n\nMultithreading (Hyper-threading, similar i/o in Windows)\n\nChaCha20 + RSA 4096, high performance\n\nTwo work modes: Fast/Space\n\n14 build settings in the admin panel (extensions, turning off virtual machines, etc.)\n\nSupport of main versions of ESXI [5.1 - 7.0]\n\nSupport of NAS (Synology, OMV, etc. (TBA))\n\nWe had a look at the Linux version of DarkSide[8] and although it looks like it is ready to start encrypting\n\nNAS devices in general, this option is not enabled yet. In a function that we named check_build_mode(),\n\nthe malware checks if a global variable is set. If it is not, the malware will always look for virtual machine\n\n(VM) disks within the /vmfs/volumes directory (common in VMware ESXi instances) and fail to encrypt\n\nanything if a disk is not found.\n\nFigure 16. DarkSide function that checks for a global variable\n\nAccording to our research, all five samples we analyzed have this variable set to zero. We are unsure\n\nabout the reason behind this, but the fact is that these affiliates of the DarkSide group should not be able\n\nto encrypt NAS devices with these samples. However, the group has high potential as with this slight\n\nchange in the source code, the actors would enable affiliates to do it. This once again shows that another\n\nof the most serious ransomware groups active today does plan to have Linux and NAS encryption in their\n\nupcoming features and business models, something up-and-coming groups are sure to emulate.\n\n\n-----\n\nFigure 17. DarkSide variable always set to zero\n\nWe would like to note that in our research, we also verified that a few other ransomware families like\n\nBlackMatter and Babuk are halfway there with samples that appear to be in development but could easily\n\nreach the point where they work in a NAS device.\n\n##### Botnets\n\nFor decades now, botnets have been a problem for many different platforms as it revolves around the\n\nconcept of an actor spreading out infections to have as many multiple hosts as possible that can perform\n\ntasks based on what the actor wishes. Most commonly on Linux, these botnets are used for distributed\n\ndenial-of-service (DDoS) attacks. In 2016, one of the first botnets for IoT devices in the modern era known\n\nas Mirai was discovered on infected routers, IP cameras, and other devices with small footprints and\n\nlimited processing power. Other IoT botnets similar to Mirai in purpose and device types that they take\n\nover are Kaiten (aka Tsunami) and Qbot (aka Bashlite and Gafgyt).[9] In 2018, a more advanced malware\n\nwas discovered known as VPNFilter, which was shown to attack routers and NAS devices (QNAP) in the\n\nhopes of then looking for industrial control systems (ICSs). As was shown, these types of systems can\n\nbe harder to patch or to clean up for infections — not to mention that for VPNFilter there are still many\n\ninfected devices connected to the internet, years after its command-and-control (C&C) servers were\n\ntaken offline.[10]\n\nNAS devices are ideal targets for attackers as there is little protection in place once an attacker has\n\ncompromised the device. This includes the lack of robust malware-removing tools as well as of protection\n\nfor operating systems as in most cases, compromise gives the attacker root access to the underlying\n\nLinux operating system. Therefore, we see that many of the same botnets are attacking routers, cameras,\n\nand other IoT devices are infecting NAS devices as well, including more obscure platforms. Because the\n\nsource code was released for Mirai in 2016, it has been taken by many criminal groups and updated to\n\ninclude new attacks and features. This has given way to a growing list of families of malware that are\n\nattacking IoT devices for the purpose of creating and growing botnets with a variety of criminal business\n\nmodels.\n\n\n-----\n\nHowever, the lack of patching on these types of devices allows these older malware families to remain\n\nprevalent today with minor changes to the main portions of the code and functionalities. In 2020, Palo Alto\n\nresearchers found a Mirai variant called Mukashi that was targeting Zyxel NAS devices.[11] NAS devices are\n\nperfect for botnets as they are more powerful than the typical IoT device such as an IP camera, and the\n\nperformance impact of the botnet might go unnoticed for a long time by the end users. However, despite\n\nthe small impact on systems, it is still a large concern as attackers have root access to the NAS and can\n\nturn to any other type of attack, or even use the NAS device as a pivot point into networks.\n\nWhile the business models of the botnets that we have described range from information theft to DDOS,\n\nproxy networks, and more, it is clear that this trend is only increasing — and with it the risk to all NAS\n\nowners. As an example, we’ll talk about a specific botnet that evolved to target NAS devices.\n\n###### StealthWorker\n\nThis botnet was first discovered by MalwareBytes[12] back in 2019, when only Windows versions were\n\navailable. However, it evolved and started targeting Linux systems. In August 2021, Synology published\n\nan article[13] saying they had noticed brute-force attacks launched from this botnet on Synology NAS\n\ndevices. We were able to find multiple samples for this botnet and verified that newer versions are capable\n\nof brute-forcing and compromising servers running the following products and systems:\n\n- WooCommerce\n\n- WordPress\n\n- OpenCart\n\n- Bitrix24\n\n- PostgreSQL\n\nStealthWorker is also designed to generically attack any web server using HTTP authentication and other\n\nNAS devices like QNAP.\n\n\n-----\n\nFigure 18. StealthWorker brute-force function targeting QNAP devices\n\nValid credentials that are found are uploaded to the C&C server, usually at port 5028/tcp.\n\nFigure 19. Infected Linux device connected to a C&C server\n\nIn the screenshot in Figure 18, we see the [stealth] process connected to an active C&C server (caaclothing[.]\n\ncom/158[.]69[.]22[.]139).\n\n##### Cryptomining\n\nCryptomining is the process of using computers, usually high-end ones, to solve complex math\n\nproblems. The result such complex math is the creation of a new “coin,” such as in the case of Bitcoin\n\nand other cryptocurrencies in use. People who perform these tasks are called cryptocurrency miners\n\nor cryptominers. Usually, cryptominers use extremely high-end computers with many graphics cards\n\nor graphics processing units (GPUs). However, there are CPU-based cryptominers as well. The types\n\nof cryptominers that go after NAS devices use CPU-based cryptomining and create cryptocurrencies\n\nthat are computationally easier. This includes Monero. These groups use security issues within the NAS\n\ndevices such as vulnerable versions of software to brute-force secure socket shell (SSH) credentials and\n\ngain access to the systems. Once they are in the system, what cryptominers do might seem harmless to\n\nsome, but as we will show, it is far from benign to the owners of the NAS systems.\n\n\n-----\n\nCryptominers target NAS systems for a couple of reasons. For one, newer NAS systems have modern\n\nCPUs s used for streaming services from the NAS, such as for playing movies that are stored on the hard\n\ndrive using software like Plex. The power of modern NAS systems to also run containerized services\n\ndemonstrates that NAS systems are not just meant as storage for your backups but are also designed to\n\nbe mini home-based servers meant to run everything from home automation suites, chat platforms, DNS\n\ninfrastructure, and anything else one can think of. The following is a screenshot of a Synology NAS sitting\n\nidle. This NAS has two CPU cores with an Intel Celeron J4025 CPU and comes with 2 GB of RAM built\n\ninto it, but it has been upgraded with an 8-GB small outline dual in-line memory module (SODIMM) for a\n\ntotal of 10 GB of usable RAM. Synology also clarifies that it regularly updates the security features in its\n\ndevices, and that most of the issues identified here do not affect Synology devices unless brute-forced.\n\nFigure 20. A comparison of an idle CPU and memory usage of Synology (left)\nto when it is running an XMRig (right)\n\nTo show the impact of cryptomining software, we downloaded XMRig directly to the NAS device and\n\nmanually ran it via SSH to the NAS device. This shows the impact made on a NAS device when the CPU\n\ngoes up to 99% utilization within seconds. While XMRig is a miner that is commonly used by criminals,\n\nit is also a piece of software that is classified as a potentially unwanted program (PUP), and it will run on\n\nmany different systems, including most major NAS systems that are given access to operating systems\n\nwith administrator access, such as SSH.\n\nWhile the act of cryptomining on a NAS seems like a minor annoyance, the attackers doing this are\n\nexploiting weaknesses in the security of NAS devices, whether that be weak SSH passwords or even\n\nexploits to the NAS systems themselves. They have full access to the system and can do much more\n\nharm than deploying a coinminer on the NAS. Many of the other sections in this paper are examples\n\nof what can be done if someone has more malicious intent. It is important to emphasize that devices\n\nthat are attacked by cryptominers are a symptom of larger security issues at play. For example, device\n\ndeployment locations to the NAS, which can be directly connected to the internet or network address\n\ntranslation (NAT) ports, can be scanned with a wide range of allowed IP addresses.\n\n\n-----\n\n###### UnityMiner\n\nDiscovered by 360 Netlab, this miner targeted QNAP users. It consists of four main components:\n\n###### Installer script\n\nThe _unity_install.sh script downloads the right next malware stage package according to the victim’s_\n\ndevice architecture (Intel or ARM). It also patches the miner configuration file depending on the number\n\nof processors available.\n\nFigure 21. unity_install script\n\nThe script also adds the next starter script to the crontab for persistence and clears out the command\n\nhistory before exiting.\n\n###### Starter script\n\nThis script replaces the manaRequest.cgi, a script responsible for handling the web requests to the QNAP\n\nadministration web interface, with a malicious one which we will elaborate on later.\n\n\n-----\n\nFigure 22. start.sh script replaces manaRequest.cgi with a malicious one\n\nThe script also renames the original manaRequest.cgi to manaRequests.cgi (with an additional “s”) to\n\npass the requests to it for proper handling.\n\n###### The malicious Common Gateway Interface (CGI)\n\nThis manaRequest.cgi calls the original script (now named manaRequests.cgi) but redirects its output to\n\na file instead. Afterward, it uses a regular expression to find the CPU usage information on the file, reads\n\nit, subtracts 50 from it, and replaces it back on the file before giving its content back to the user. This way,\n\nif a user checks the CPU usage of the infected device on the QNAP administration page, the user would\n\nsee 40% even if it is actually at 90%.\n\nFigure 23. Malicious manaRequest.cgi code to show a reduced CPU usage\n\nThe script does the same for all the other CPU metrics, including the temperature.\n\n###### Monero miner (XMRig)\n\nThe final component is the XMRig program that reads settings from a valid config.json configuration file[14]\n\ndownloaded and modified by the installer script.\n\n\n-----\n\n###### Dovecat\n\nFirst analyzed by Matthew Ruffel[15] in October 2020, this is also an XMRig-based miner; however, this time\n\nSynology users have reported finding it in their devices.[16] Dovecat does not seem to have any persistence\n\nmechanism, but actors using this malware might also use other malware types to control victims’ devices\n\nand avoid losing access to targets.\n\nDovecat uses an embedded configuration, like the one shown in the following screenshot:\n\nFigure 24. Dovecat’s embedded XMRig configuration\n\nAs of this writing, two user hashes acquired from only two Dovecot samples approximately amount to a\n\ntotal of 18 moneros (or US$5,000).\n\n###### Highly targeted attacks\n\nWe identify and show how an advanced persistent threat (APT) targets NAS devices once these groups\n\nhave identified a potential victim.\n\n###### QSnatch\n\nApart from different financially-motivated criminal gangs competing for NAS devices, there is also what\n\nwe understand as APT-level attacks. A good example is QSnatch (also known as Derek), a malware family\n\nthat targets NAS devices from QNAP only. The first campaign attributed to QSnatch, observed in 2014,\n\nwas a significantly forward-looking attack at the time, which gave some indication on the sort of group\n\nbehind it. A different campaign with different malware samples started in late 2018 and is still active to\n\ndate. A great report on recent campaigns was done by SecurityScorecard.[17]\n\nOn July 27, 2020, the National Cyber Security Centre (NCSC) and the Cybersecurity and Infrastructure\n\nSecurity Agency (CISA) jointly alerted[18] that QSnatch was still in the wild. They updated the alert on\n\nAugust 10 to add more stats on the infections. According to the report, in mid-June 2020, there were\n\napproximately 62,000 QNAP NAS devices infected with QSnatch.\n\n\n-----\n\nThis particular piece of malware is very advanced. To start things out, it disables both the embedded\n\nClamAV antivirus shipped with QNAP and the McAfee Antivirus, the security solution partner available for\n\npurchase in the QNAP store:\n\nFigure 25. Code from QSnatch that disables security products\n\nQNAP devices are shipped with a tool called MalwareRemover, which is developed and maintained by\n\nQNAP themselves. It comes in the form of a small antivirus with a few dozen hardening and detection\n\nrules. One of these rules can detect earlier versions of QSnatch, but the malware knows this and before\n\nanything else, it clears out the related MalwareRemover rules to remain undetected.\n\nQSnatch is entirely written in Linux shell script by people with deep knowledge of both Linux and QNAP\n\ndevices. Its features include:\n\n- Disabling security products\n\n- Clearing out the QSnatch detection rule for MalwareRemover tool\n\n- Stealing credentials by installing a fake login web app\n\n- Disabling firmware updates\n\n- Using its own Domain Generation Algorithm (DGA) for the C&C server\n\n- Downloading and executing a second stage payload from the C&C server\n\n- Using encryption for all network communications\n\n- Stealing user data, including passwords and multifactor configuration, if enabled in QNAP\n\n\n-----\n\nEverything in QSnatch is impressively implemented in shell scripts. Here is the routine that installs the fake\n\nlogin application from one of non-DGA C&C servers:\n\nFigure 26. QSnatch’s complex process of fake login component download and installation\n\nThe DGA changes among different versions of QSnatch. The first version is capable of generating 150\n\ndifferent domains. The second version of the DGA is bigger and much more complex.\n\nAlthough QSnatch is written in shell script, its samples are usually compiled to Linux Executable and\n\nLinkable Format (ELF) files using the shell script compiler (SHC) tool. This makes the analysis significantly\n\nharder and the whole campaign a bit more difficult to track.\n\nQSnatch does not seem to be part of a money-driven criminal campaign. We believe it was designed as\n\na form of cyber weapon developed for espionage purposes.\n\n\n-----\n\n## How to Defend NAS Devices\n\nWhile these devices are usually left alone once they are set up, there are some key things that users need\n\nto do to protect their NAS devices from attackers.\n\n- **Never connect NAS devices directly to the internet. If remote access to files is necessary, most**\n\nmajor NAS vendors set up services that allow remote access in a more secure manner. However,\n\nwhile these services offer a safer alternative, there are still risks to them, and the best option for\n\nremote access is still for users to rely on their own virtual private network (VPN) solutions to allow\n\nsecure remote access to a user’s network and therefore a user’s NAS devices.\n\n- **Never use the default credentials that come with the pre-setup on any NAS device — or any**\n\n**device for that matter. It is a must to change this as these credentials are well-known to attackers.**\n\nThis is an area where NAS devices are getting better at, as when we started this project, one of our\n\nNAS devices allowed us to use the “admin” username. However, upon a later rebuild of that system,\n\nNAS devices no longer allow users to use “admin” as their username. This is good, as that is a default\n\nusername that makes SSH brute-forcing attacks — or any brute-forcing attack on NAS credentials\n\n— more difficult.\n\n- **If your NAS device supports it, you should enable two-factor authentication (2FA). 2FA will**\n\nprevent brute force attacks as the devices will need an extra step for authentication. Most major NAS\n\nvendors support 2FA with easy setup for hardware keys, Google Authenticator, or other standard 2FA\n\nmethods.[19, 20]\n\n- **Uninstall any services that are not in use when downloading software to test and play on your**\n\n**systems to reduce the risk of compromise. Out-of-date or unmaintained software is one the primary**\n\nmethods for compromising NAS devices today. This is especially true of third-party applications that\n\ncan be installed from community stores or from the internet. When installing such applications, it is\n\nrecommended to be incredibly careful from the very beginning. It is also recommended that users\n\nstick to the applications that the NAS vendor has provided and verified, to only enable those currently\n\nbeing utilized, and remove those that are not in use.\n\nIn addition to these recommendations, we strongly suggest looking at online security guides on “best\n\npractices” provided by NAS manufacturers. These comprise a simple checklist that can be reviewed at\n\n\n-----\n\none time over the course of less than an hour. More importantly, reviewing these best practices can make\n\na considerable difference in securing NAS systems against the attacks we have listed in this research\n\npaper. We include some examples for the manufacturers we tested here:\n\n- QNAP best security practices[21] and recently released suggestions on how to best defend their devices\n\nagainst additional exposure on the internet[22]\n\n- Synology Best Security Practices [23]\n\n\n-----\n\n## Conclusion\n\nNAS devices have become a vital part of backup strategies for everyone, from businesses to consumers,\n\nas well as a central server for a business or a modern home. With increased reliance on these systems,\n\ntoday’s attackers have taken notice and are targeting these devices for anything, from cryptomining to\n\nadvanced attacks, all of which we covered in detail in this paper. Without proper security in these devices,\n\nwe will continue to see an escalation of attacks on NAS devices as they offer many benefit to today’s\n\ncybercriminal business models. For instance, these attackers can gain complete control of Linux systems\n\nthat have plenty of processing power, storage, and tools that the attacker needs. While it seems that basic\n\nattacks such as botnets and cryptominers might seem like less of a worry, having a NAS device that is on\n\nthe receiving end of these is a result of a larger issue that needs to be addressed.\n\nThese devices can also act as an ideal initial base of attack on the home network of important individuals,\n\nor to pivot to corporate machines on that same (generally unprotected) network. Utilizing the steps on\n\nhow to defend a NAS device, as well as the improvements the vendors are making all the time, these\n\ndevices are on the right track to being more secure and will hopefully limit the number of attacks we see\n\nin the future.\n\n\n-----\n\n##### Appendix\n\nWe have included a non-exhaustive reference set of the indicators of compromise (IOCs) for the threats\n\nidentified in this research.\n\n###### Qlocker\n\n- c084c0bdf62ae17bda55d91e42f23893146455f799faf9e4548dd12417d1cb35\n\n###### REvil/Revix\n\n- 3d375d0ead2b63168de86ca2649360d9dcff75b3e0ffa2cf1e50816ec92b3b7d\n\n- 559e9c0a2ef6898fabaf0a5fb10ac4a0f8d721edde4758351910200fe16b5fa7\n\n- 796800face046765bd79f267c56a6c93ee2800b76d7f38ad96e5acb92599fcd4\n\n- d6762eff16452434ac1acc127f082906cc1ae5b0ff026d0d4fe725711db47763\n\n- ea1872b2835128e3cb49a0bc27e4727ca33c4e6eba1e80422db19b505f965bc4\n\n###### eCh0raix\n\n- 178[.]128[.]198[.]212\n\n- 185[.]181[.]229[.]175\n\n- 161[.]35[.]151[.]35\n\n- 174[.]62[.]79[.]238\n\n- 176[.]122[.]23[.]54\n\n- 183[.]76[.]46[.]30\n\n- 185[.]10[.]68[.]89\n\n- 2[.]37[.]149[.]230\n\n- 64[.]42[.]152[.]46\n\n- 98[.]144[.]56[.]47\n\n- 039a997681655004aed1cc4c6ee24bf112d79e4f3b823ccae96b4a32c5ed1b4c\n\n- 0b851832f9383df7739cd28ccdfd59925e9af7203b035711a7d96bba34a9eb04\n\n- 0e4534d015c4e6691ff3920b19c93d63c61a0f36497cb0861a149999b61b98e1\n\n- 19448f9aa1fe6c07d52abc59d1657a7381cfdb4a4fa541279097cc9e9412964b\n\n- 2093952483c2c8f419eb55e0ebaec718e0a1559d1115401ef6e29edfbc02793c\n\n\n-----\n\n- 21d5021d00e95dba6e23cee3e83b126b068ad936128894a1750bbcd4f1eb9391\n\n- 230d4522c2ffe31d6facd9eae829d486dfc5b4f55b2814e28471c6d0e7c9bf49\n\n- 283b2fa0fcddff18278d924c89c68bbcd980728761bd26c5dea4ec4de69b841e\n\n- 2e3a6bd6d2e03c347d8c717465fec6347037b7f25adae49e9e089bc744706545\n\n- 2fe577fd9c77d3bebdcf9bfc6416c3f9a12755964a8098744519709daf2b09ce\n\n- 36cfb1a7c971041c9483e4f4e092372c9c1ab792cd9de7b821718ccd0dbb09c1\n\n- 3c533054390bc2d04ba96089302170a806c5cdb624536037a38c9ecb5aeea75d\n\n- 4691946e508348f458da1b1a7617d55d3fa4dc9679fff39993853e018fc28f8e\n\n- 551e03e17d1df9bd5b712bec7763578c01e7bffe9b93db246e36ec0a174f7467\n\n- 670250a169ba548c07a5066a70087e83bbc7fd468ef46199d76f97f9e7f72f36\n\n- 6df0897d4eb0826c47850968708143ecb9b58a0f3453caa615c0f62396ef816b\n\n- 74169aebae6412e5408904d8f6a2eb977113b3ac355c53dfd366e2903b428c62\n\n- 7fa8ebcccde118986c4fd4a0f61ca7e513d1c2e28a6efdf183c10204550d87ce\n\n- 8e3fdb5baeaa667862d427a67ba1fa10853f07b3c671a1bffa4952937627125a\n\n- 9d4bc803c256bd340664ce08c2bf68249f33419d7decd866f3ade78626c95422\n\n- 9f9bbbc80a2035df99abd60dc26e9b068b63e5fcc498e700b8cc6640ca39261b\n\n- a8accaab01a8ad16029ea0e8035a79083140026e33f8580aae217b1ef216febc\n\n- bb3b0e981e52a8250abcdf320bf7e5398d7bebf015643f8469f63d943b42f284\n\n- cc112184b17d65229ce20487d98a3751dceb3efbee7bf70929a35b66416ae248\n\n- ccd846a074a4a7e9ad40d11e7125322efe381bac6c25fa3cfc07b9b2941c4002\n\n- d2ebe2a961d07501f0614b3ba511cf44cb0be2e8e342e464a20633ed7f1fc884\n\n- fedcce505a5e307c1d116d52b3122f6484b3d25fb3c4d666fe7af087cfe85349\n\n###### DarkSide\n\n- 984ce69083f2865ce90b48569291982e786980aeef83345953276adfcbbeece8\n\n- 9cc3c217e3790f3247a0c0d3d18d6917701571a8526159e942d0fffb848acffb\n\n- c16fc61415f537f42b9d813cd9538898f53865e1f5b46f25db2ab26bad2dffd2\n\n- c93e6237abf041bc2530ccb510dd016ef1cc6847d43bf023351dce2a96fdc33b\n\n- da3bb9669fb983ad8d2ffc01aab9d56198bd9cedf2cc4387f19f4604a070a9b5\n\n\n-----\n\n###### StealthWorker\n\n- caaclothing[.]com\n\n- 00b522d18df034aff252a0bbf0c558ee201bcd50915f1ee61205998daaba3bfc\n\n- 011dc45c80330b74e2966ba498caf664c5ed2ec3bf42d89ff838723952d3ad80\n\n- 06f70c14fb5ef90f7d3b755ba3f0375265dd5c5514b1cd9619f97477643b19bd\n\n- 0956bee618e9559afa1054b27e32060db419dd92a5aefa536fc5eb8eaf42ae8b\n\n- 09e2959447d6915e01d9214182af442ff7ddaa85531a3d9a418a91988f05075e\n\n- 0a8b5c7ceef3068326aeba85d7682b87528768e4e719343dccae26fbb5f4ec65\n\n- 0ab92cb02b4a89cd17c41ee9b796708b63ef485b49e12e5797a9277f1fbba5a5\n\n- 0d8f0596d278ee601eff8afb6dd8b0c722a483bd70617e2d9ea0df293734463e\n\n- 10b06641dc0f7327f86928a6a806441cb7461495d86aa6995e0f933af6398430\n\n- 18289752fce41c493f8586c46305bada7dd25cd220ba46432ad0610fe3760c5c\n\n- 18919aa67020135d7a25c5b2db7771746d44aa8dd9a0fad7a55892c444829c4e\n\n- 194aca964ebdc059258f39835c85bafc41d8779655fbc3870c45efd28d986617\n\n- 198c2181bf8d83e3675995eef75b91d61a9c2762338fcc71f1a67edd35a73c29\n\n- 242c0df5f0abff4e15a25db6649ab2da6f71d5cd901ad83bcadf03f3e38d29b3\n\n- 255a59f16670cb5d959da0435e053c32036999638d22875dcbdaacea7365b0fc\n\n- 2c56667ed1671ff52999cf67e5f2fee31424a0afa3e4995ae8867b759dd49753\n\n- 2f27b57e045b963da63ccad229dd80a19589a58ca414aad12d38e438b9b96fcf\n\n- 2faf4181b6c2434df493676f87a87bda3a0d00bdaa6f57d74ddd5e139d6df71e\n\n- 3583c86517a9d7f37294ab8076595d904dd24cef6de16f6833338e559f95e327\n\n- 3c765908c64bd9e553822e3af4a06a63e1860fa4d2ea1940472aacd14c15fe08\n\n- 41b56f6faded9b15709cdc4da8773e9346f8377ce3d467289daf70a688dd177e\n\n- 4219b1e74e1e2ab07164ebf800bf479455b657b396398f08cd5f2d626c67e3bd\n\n- 4393a4e6eb41b55b83adbbbb0dab6da1a9f061f3761c4d78f279e1814807eccd\n\n- 454c4aeb965877c7e4471787c4e0501f7204b481fd9e431841aa4788297993d9\n\n- 45eabf4d2c123825ae31ebe7f29adbdc8b74471fe198e955b0c4e4097510a935\n\n- 4a3384e65f82229bde7bc08c7a999340b74a306b9b79b5cc17793ba803eeeb46\n\n\n-----\n\n- 4cb0006871d8cb7879b6cb529eaa713ef4c0f7a491c518b2278cae814aee2d14\n\n- 4e1a3bbe7e1383195cefbf9588f139d601cd42ad903d0d36060beaf17a5d8086\n\n- 5189c4e8e00d72b1aee7d791a290e77218cabaaa4e846225c5a2d7f0816ca61c\n\n- 51c5770a8fde8ecdc55c012a06563f792edf38e3c8058dbd0eaf05e86297351f\n\n- 522a0629587aeeb8f1cf1e76c3103fd62bb50c7c51859e55df7254c27aa3740c\n\n- 58a87ad85d0de2409cdb0a43c56cdc99e064f1b8f50d2d735f9147698bf2ebc8\n\n- 590d4fe4cb89e81266969a60c827ebbdf81fd0cf904bab88db770c84cdde8d73\n\n- 5b8ea3fa55874e66d54126680c475731e8c3ec9e9d81208193cc52406fc8fff7\n\n- 5ba347c3d656c3092dd79808e8de5f56c84fd3bda06726c892d67b7c4db1400a\n\n- 5c1171253f75b81c5536206cfeb04da30d691fcb4627dabc474ef7326b613ac1\n\n- 5c97d8fd565fff27af7195c05f49b02003b77ef96d6538804db5e792349674ca\n\n- 5fabc6ae7049f39921d5867dfcad0aca081fc1954142262fec23bc7fbc320c5c\n\n- 6535fcd6c18c94fa85f9c979115f902e631d8e82c863cb112e7e44b5b6a1f61e\n\n- 6582bf7b092c5d0eb8b8be9950b0874b2d3f83519344565bb6ba79cbb289ac14\n\n- 67b3b3f982e34f3ee51f3bcda5db65d89adb214e18eb134f2408dbc89c8e3adf\n\n- 6b463e18e01f47269d6cd7509aa6d2788cc2e7473bc9b8169bdb003f2f61c913\n\n- 6e7694ae8dd15e3b4e0a5a9d3131715ec2f17deb53285609d00d34cb8ffec0a8\n\n- 6faf30a11465894c125a6983d9667d82dfb183a2f1289197b55717d1424fc5b3\n\n- 73449107f1bf81972351a4ab1d2c2a535603b5c7fc13396bc99a6362d978cea7\n\n- 7477404c6e5fb07b425048598baa2af0e58f0334649e2923af250faef3241192\n\n- 75cc1c70305377ab0b86c310bc67e8c5fe86a66988c55f9f2ec5d679dee26c63\n\n- 76fbab1afd421201a25fe8b143807c9f92f6d9c9fad8594cdf146eded3e68ff9\n\n- 79cda18c2042a425d92d6bb83a42d8ba684687683c5465fba2148d421170100b\n\n- 7a2b89b67bc2af4f9941090d25d302f34010ef3e5ea3d019b1664dd77a22786c\n\n- 7fd2af75160c6ce8f41fbfffb9b895b2b3fa49ebfa80086f0f3bdc24a64a89bd\n\n- 84dfa212005b4035401a1fb2f4595550302aaf237f8306700dc597dde046e78b\n\n- 8945661affddc330564c4450282ec99a914d7daf29129adb5f9a4802138c6beb\n\n- 917aa25f8496f3b7a191523693e9cda6eaab6045894c203627a6f0b88b3de892\n\n- - 943d663609c98cbcb090b9811e987d0524dc5f2bebf69fb2005f4c2fed4e0334\n\n\n-----\n\n- 9e27260c7466320ca00a4f172f373371f3e15b53f846c0f03c4c81f8d531266d\n\n- a28302658da800b44a2cdf50c434bc7fef314b59640d597253d1b1b230c3c9c0\n\n- a4fe359f2605850b92e083b25463af91a489d65f573d9802523d0622521d3c05\n\n- a567dd30cf544f92e0011574133dcee3e212e0e2d93b2eb7b1f1568f7271ee06\n\n- a75f03ebab61b8333063d099050cbb14cc3d62f327b5d08c3dc465b3719bfa06\n\n- ae2792360d25844e752ec45c5751fe8a91d9921cc57563618f2634fae3de3d3c\n\n- ae3f551d2bbaeee5cb4d799868d23bc9e8335c6a5f1b0d57e376ad05fb24601e\n\n- b255a07089d1f5b3cb00847e8c1ac99f15b10dfc21a441cdfdf2fd8cc4574531\n\n- b30c41280d1044b179d001125cce7d5a17961b549a942a80e68ea1cd805cd330\n\n- b9545c4bea3c3889bdbb6d24575b792765a4af61a30a3f72c3655d3762009fcc\n\n- b99d1c9433845e6929fda419a735abfb8414fa9aeff4885d194259e9348aecfc\n\n- bae220e07ab8ebce0ea32067534ff5213e51cdc1158992dd48b778f4fef03a7b\n\n- c196aa480ca9933631ef21cade491d1313f205616021951a98dd549514a97dde\n\n- c43a60dad2a09dc27c047f85bccd5ada28bab9e97395e952fd398b6b0ec98d82\n\n- c7d061ad6848084a826f3df421e32d5184167f70c36687223cb3e1a2c38b8689\n\n- c8b5ec142c416456b0aea1a220a533e18c3f74a2ffbfa9d5722ac56af65a536c\n\n- c904b9b6782a9809c6e8fc88b24c6852017e50802d7d734dc6cb4c2a70513cca\n\n- ca9c1045711514d705e5f8a019ded550a6517a0627a6a91537451d8ce9ba2c82\n\n- d0ab3c1004c43276236ced367aa6bf705d580813348bd041fa4b37722d6ebc0a\n\n- d16511c9791f78060f1e958646e9a61c47c8f3052727085c907621f4ac1ab132\n\n- d309b3ba20ddc0a7d77b16fa5810750f0e514cf3f6e6408f44ab7e1f452d2446\n\n- d56f3f48bf84a65f60dc2da3ee689cf6a20be55b7aa65f7de1c942231c94e0a6\n\n- d70511f773f0b825b3e3217276fc4c05b55d1f5dc10ac5b5078fc26f82ffed50\n\n- da334829f7fafc3826334a1d8af016e9e4107d1f0c3697f6a9503ee1c86b4242\n\n- da74a02b0a2cb4aa195c03be31783b40ed0d0784843627e2f8e1f34f0e410f34\n\n- dcd1ffdbd378409bd3dbf451968288d5cd96e77ea34e453b6f06c2b4bd541715\n\n- dde51499451ccdefbc315f73a0c6ab59bc8e0af17db5f1134336249aa28b3ec3\n\n- de335bf6fca87887b1452d866eb8cd9b2202f3ca1af84a087d052dc809c01f7c\n\n- - e5a15d6dcb11297635127c486f14611a0232060736044e6dc317d6234f16085f\n\n\n-----\n\n- ee97250b4bd2801b7a82385e076fca498f14163950f84d4efae98080000b520b\n\n- f377ad557d27b764ba060d122dd0b80192e19d092887218521819f08fede2a31\n\n- f4270d32fd87a6d98a4cf82968389b2775f6ec665f1fdfcee0aa9549bc2901e9\n\n- f7225c2ee2a5555f50dce65b14de3a47917ff84236b32731db65acf323879d99\n\n- f9b87391b13215272e088a605540d2260fc2076fb237a6cdb674172a4e600555\n\n- fab29d4690765c4e6f6d7b1ea229443badc55e606eb7799f7f73833400c9b69d\n\n- fe0771b0ebca55f3b1898b7d40ee51b42735bc2ed1fe298c808e0c0c2823ba97\n\n###### UnityMiner\n\n- c[.]aquamangts[.]tk\n\n- adbd60b39b3aee3cd031995e439644583aecc4877162ac50d8d438ef77f7712b\n\n- e1f9b523dd3e2e0ff4eb90428779fde0e8241c285c771fd90240a994b8ec739b\n\n- e23c9507ee0a00cd5c7a94c43a4345f75b4793c1210ea36db1d0d84d82e5dd9e\n\n###### Dovecat\n\n- hongying[.]biz\n\n- 10c0ed6e8223e4c18475c39beec579911bb18d5e64bf33d2de051c9c59138a08\n\n- df1bf44d467ab16debfb7aedfa5e963fc567640bf96fd5837bfb2e7dd481c23f\n\n- fcf1bd7bac112481bb80751fe8121f290c172f80fe578f756c6149d6be9f60d0\n\n###### QSnatch\n\n- 0723031d53c8c1d14d3d5d531564022229b276405dc5b888e65f08c801547c35\n\n- 09ab3031796bea1b8b79fcfd2b86dac8f38b1f95f0fce6bd2590361f6dcd6764\n\n- 15892206207fdef1a60af17684ea18bcaa5434a1c7bdca55f460bb69abec0bdc\n\n- 18a4f2e7847a2c4e3c9a949cc610044bde319184ef1f4d23a8053e5087ab641b\n\n- 3615f0019e9a64a78ccb57faa99380db0b36146ec62df768361bca2d9a5c27f2\n\n- 3c38e7bb004b000bd90ad94446437096f46140292a138bfc9f7e44dc136bac8d\n\n- 473c5df2617cee5a1f73880c2d66ad9668eeb2e6c0c86a2e9e33757976391d1a\n\n- 4b514278a3ad03f5efb9488f41585458c7d42d0028e48f6e45c944047f3a15e9\n\n- 5130282cdb4e371b5b9257e6c992fb7c11243b2511a6d4185eafc0faa0e0a3a6\n\n\n-----\n\n- 525c2b85684a634cf3b43967e32eb1bf42bf65b40c78bebb4eae5a7ff3454be3\n\n- 55b5671876f463f2f75db423b188a1d478a466c5e68e6f9d4f340396f6558b9f\n\n- 5cb5dce0a1e03fc4d3ffc831e4a356bce80e928423b374fc80ee997e7c62d3f8\n\n- 62426146b8fcaeaf6abb24d42543c6374b5f51e06c32206ccb9042350b832ea8\n\n- 6e0f793025537edf285c5749b3fcd83a689db0f1c697abe70561399938380f89\n\n- 7c7bfde74607fc90d5aca245dfca751e8017f20066c4ac44dcabd8f148b54564\n\n- 7c7bfde74607fc90d5aca245dfca751e8017f20066c4ac44dcabd8f148b54564\n\n- 845759bb54b992a6abcbca4af9662e94794b8d7c87063387b05034ce779f7d52\n\n- 8fd16e639f99cdaa7a2b730fc9af34a203c41fb353eaa250a536a09caf78253b\n\n- 9526ccdeb9bf7cfd9b34d290bdb49ab6a6acefc17bff0e85d9ebb46cca8b9dc2\n\n- ab90c167bb332b0ec05a8fb555d4e00a08ec1ee1b9d89fce81795929f414a22d\n\n- b7a8c1cdb8846dd2b18861e35da4a9cd7df25ca497b2500adf5992f15708b3a2\n\n- d6017dd6db4d969b2c8b55f37f0c50f4f48506c41ced733fd90c865ebdc5713b\n\n\n-----\n\n##### References\n\n1. Stephen Hilt, Fernando Mercês, Mayra Rosario, and David Sancho. (July 7, 2020). Trend Micro Security News. “Worm War:\nThe Botnet Battle for IoT Territory.” Accessed on Nov. 22, 2021 at https://documents.trendmicro.com/assets/white_papers/\nwp-worm-war-the-botnet-battle-for-iot-territory.pdf.\n\n2. Stephen Hilt and Fernando Mercês. (Jan. 19, 2021). Trend Micro Research. “VPNFilter Two Years Later: Routers Still\nCompromised.” Accessed on Nov. 22, 2021 at https://www.trendmicro.com/en_us/research/21/a/vpnfilter-two-years-laterrouters-still-compromised-.html.\n\n3. QNAP. (n.d.). QNAP. “QNAP Statement About Qlocker Ransomware.” Accessed on Nov. 23, 2021 at https://www.qnap.com/\nstatic/landing/2021/qlocker/response/da-dk/.\n\n4. CVE. (n.d.). CVE. “CVE-2021-28799.” Accessed on Nov. 23, 2021 at https://cve.mitre.org/cgi-bin/cvename.\ncgi?name=CVE-2021-28799.\n\n5. MalwareHunterTeam. (June 29, 2021). Twitter. “REvil ransomware Linux version…” Accessed on Dec. 2, 2021, at https://\ntwitter.com/malwrhunterteam/status/1409577829289934851.\n\n6. Rucha Nigam, Haozhe Zhang, and Zhibin Zhang. (Aug. 10, 2021). Palo Alto. “New eCh0raix Ransomware Variant Targets\nQNAP and Synology Network-Attached Storage Devices.” Accessed on Dec. 6, 2021 at https://unit42.paloaltonetworks.com/\nech0raix-ransomware-soho/.\n\n7. Larry Dignan. (May 8, 2021). ZDNet. “Colonial Pipeline cyberattack shuts down pipeline that supplies 45% of East Coast’s\nfuel.” Accessed on Dec. 6, 2021 at https://www.zdnet.com/article/colonial-pipeline-cyberattack-shuts-down-pipeline-thatsupplies-45-of-east-coasts-fuel/.\n\n8. Mina Naiim. (May 28, 2021). Trend Micro. “DarkSide on Linux: Virtual Machines Targeted.” Accessed on Dec. 6, 2021 at\n\nhttps://www.trendmicro.com/en_us/research/21/e/darkside-linux-vms-targeted.html.\n\n9. Stephen Hilt, Fernando Mercês, Mayra Rosario, and David Sancho. (July 7, 2020). Trend Micro. “Worm War: The Botnet Battle\nfor IoT Territory.” Accessed on Dec. 6, 2021 at https://documents.trendmicro.com/assets/white_papers/wp-worm-war-thebotnet-battle-for-iot-territory.pdf.\n\n10. Stephen Hilt and Fernando Mercês. (Jan. 19, 2021). Trend Micro. “VPNFilter Two Years Later: Routers Still Compromised.”\nAccessed on Dec. 6, 2021 at https://www.trendmicro.com/en_us/research/21/a/vpnfilter-two-years-later-routers-stillcompromised-.html.\n\n11. Ken Hsu, Zhibin Zhang, and Ruchna Nigam. (Mar. 19, 2020). Unit 42 Palo Alto Networks. “New Mirai Variant Targets Zyxel\nNetwork-Attached Storage Devices.” Accessed on Dec. 22, 2021 at https://unit42.paloaltonetworks.com/new-mirai-variantmukashi/.\n\n12. Jerome Segura. (Feb. 26, 2019). MalwareBytes Labs. “New Golang brute forcer discovered amid rise in e-commerce attacks.\nAccessed on Dec. 6, 2021 at https://blog.malwarebytes.com/threat-analysis/2019/02/new-golang-brute-forcer-discoveredamid-rise-e-commerce-attacks/.\n\n13. _Synology. (Aug. 4, 2021). “Synology® Investigates Ongoing Brute-Force Attacks From Botnet.” Accessed on Dec. 6, 2021 at_\n\nhttps://www.synology.com/en-global/company/news/article/BruteForce.\n\n14. Config File. (n.d.). “Config File.” Accessed on Dec. 6, 2021 at https://xmrig.com/docs/miner/config.\n\n15. Matthew Ruffell. (Oct. 27, 2020). Matthew Ruffell. “Analysis of the dovecat and hy4 Linux Malware.” Accessed on Dec. 6,\n2021 at https://ruffell.nz/reverse-engineering/writeups/2020/10/27/analysis-of-the-dovecat-and-hy4-linux-malware.html.\n\n16. Yves. (Dec. 23, 2020). Synology Community. “Dovecat using processor time.” Accessed on Dec. 6, 2021 at https://\ncommunity.synology.com/enu/forum/1/post/139611.\n\n17. SecurityScorecard. (Oct. 2020). SecurityScorecard. “QSnatch Technical Report 2020.” Accessed on Dec. 6, 2021 at https://\nsecurityscorecard.com/resources/qsnatch-technical-report.\n\n18. National Cyber Security Centre. (July 27, 2020.). “Alert: Potential legacy risk from malware targeting QNAP NAS devices.”\nAccessed on Dec. 6, 2021 at https://www.ncsc.gov.uk/news/legacy-risk-malware-targeting-qnap-nas-devices.\n\n19. Synology Knowledge Center. (n.d.). Synology. “2-Factor Authentication.” Accessed on Dec. 6, 2021 at https://kb.synology.\ncom/en-global/DSM/help/DSM/SecureSignIn/2factor_authentication?version=7.\n\n\n-----\n\n20. QNAP. (Oct. 15, 2020). QNAP. “Setting up the 2-step verification to login in NAS.” Accessed on Dec. 6, 2021 at https://www.\nqnap.com/en-us/how-to/knowledge-base/article/setting-up-the-2-step-verification-to-login-in-nas.\n\n21. QNAP. (Feb. 19, 2020). QNAP. “What is the best practice for enhancing NAS security?” Accessed on Dec. 6, 2021 at https://\nwww.qnap.com/en/how-to/faq/article/what-is-the-best-practice-for-enhancing-nas-security.\n\n22. QNAP. (Jan.7, 2022). QNAP. “Take Immediate Actions to Secure QNAP NAS.” Accessed on Jan. 11, 2022 at https://www.\n\nqnap.com/en/security-news/2022/take-immediate-actions-to-secure-qnap-nas.\n\n23. Synology Knowledge Center. (n.d.). Synology. “What can I do to enhance the security of my Synology NAS?” Accessed on\nDec. 6, 2021 at https://kb.synology.com/en-us/DSM/tutorial/How_to_add_extra_security_to_your_Synology_NAS.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/pdf/wp-backing-your-backup-defending-nas-devices-against-evolving-threats.pdf"
    ],
    "report_names": [
        "wp-backing-your-backup-defending-nas-devices-against-evolving-threats.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1642586034,
    "ts_modification_date": 1642586145,
    "files": {
        "pdf": "https://archive.orkl.eu/67024888ac7a9748a7679a2f09512011d3b54078.pdf",
        "text": "https://archive.orkl.eu/67024888ac7a9748a7679a2f09512011d3b54078.txt",
        "img": "https://archive.orkl.eu/67024888ac7a9748a7679a2f09512011d3b54078.jpg"
    }
}