{
    "id": "3ca38eba-5703-4c4b-a44d-d50f16313189",
    "created_at": "2023-01-12T15:00:31.932322Z",
    "updated_at": "2025-03-27T02:08:40.488264Z",
    "deleted_at": null,
    "sha1_hash": "9f0af6837f56a5e4ba172863d7431e8e5f257b62",
    "title": "2021-06-02 - Under Attack- Protecting Against Conti, DarkSide, REvil and Other Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:45Z",
    "file_modification_date": "2022-05-27T23:11:45Z",
    "file_size": 695772,
    "plain_text": "# How to Defend Against Conti, DarkSide, REvil and Other Ransomware\n\n**[crowdstrike.com/blog/how-to-defend-against-conti-darkside-revil-and-other-ransomware/](https://www.crowdstrike.com/blog/how-to-defend-against-conti-darkside-revil-and-other-ransomware/)**\n\nJosh Dalman - Heather Smith June 2, 2021\n\nCrowdStrike predicted in 2020 that the ransomware threat would only worsen, and news\nreports since have borne this out. Stories of ransomware attacks since the start of May 2021\nalone include:\n\n_[DarkSide ransomware being used to disrupt a major U.S. pipeline that transports](https://www.crowdstrike.com/blog/falcon-protects-from-darkside-ransomware/)_\nalmost half of all fuel consumed on the East Coast of the United States\nThe [claimed theft of 3 terabytes of sensitive data from part of the Asian operations of a](https://abcnews.go.com/Technology/wireStory/ransomware-attack-hits-asian-countries-axa-subsidiary-77732646)\nglobal insurance subsidiary in attacks using Avaddon ransomware\nThe [shutting down of the IT systems of Ireland’s Health Service Executive — another](https://www.reuters.com/technology/irish-health-service-hit-by-ransomware-attack-vaccine-rollout-unaffected-2021-05-14/)\nvictim of a DarkSide attack — disrupting patient care throughout the country\nThe U.S. Federal Bureau of Investigations (FBI) alerting of a spate of _Conti_\nransomware attacks targeting American healthcare organizations and first responder\nagencies\nThe world’s largest meatpacking company finding its North America and Australia\noperations disrupted by a _REvil ransomware attack thought to have originated in_\nRussia\n\n\n-----\n\nIn addition, not all ransomware attacks make the news, as reflected in CrowdStrike[sponsored research: in a 2020 survey 56% of respondents admitted that their organization](https://www.crowdstrike.com/resources/reports/global-attitude-survey-2020/)\nhad suffered from a ransomware attack in the previous 12 months. Ransomware attacks may\ngo unreported for a variety of reasons, including a desire for confidentiality or a fear of\nnegative business effects for a company.\n\nRansomware attacks can and do occur in every industry and are increasingly pernicious.\nThe potential financial impact can be staggering. For example, the City of Atlanta estimated\n[that a single ransomware incident in March 2018 cost taxpayers up to $17 million in](https://www.crowdstrike.com/blog/the-pernicious-effects-of-ransomware/)\nresponse and recovery — an estimate that didn’t quantify the cost to the community of lost\nservices.\n\nThis blog aims to help any organization better prepare its defenses against ransomware\nattacks and explains how to properly configure your CrowdStrike Falcon® deployment for\noptimal protection.\n\n## Protecting Against Ransomware\n\nThe CrowdStrike Services team has written about a number of very effective security\ncontrols and practices that you can put in place in your organization to drastically reduce\nyour risk of a ransomware outbreak. Another great source of recommended security controls\n[can be found in SANS CIS Controls version 8. These recommendations can dramatically](https://www.sans.org/blog/cis-controls-v8/)\nreduce the risk to your operating environment.\n\n[The following recommendations are supported by what the CrowdStrike Falcon Complete™](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)\nteam has found to successfully prevent and combat ransomware. Additionally, we have\nincluded details to assist CrowdStrike customers in making the best decisions for your\nprevention policies.\n\n### Practice Good IT Hygiene\n\nFundamentally, you can’t secure what you can’t see. Blind spots, in the form of rogue assets,\napplications and users, become high-risk attack vectors (and Conti ransomware is\nparticularly good at exploiting these weaknesses). Minimizing the attack surface is critical for\nevery organization — it’s crucial that you gain visibility into every endpoint and workload\nrunning in your environment and then keep any vulnerable attack surfaces updated and\nprotected.\n\nIT hygiene’s primary benefit is to give you complete network transparency. This perspective\nprovides a bird’s eye view, as well as the power to drill down and proactively clean out your\nenvironment. Once you achieve this level of transparency, the understanding of “who, what\nand where” that IT hygiene provides has tremendous benefits for your organization. You’re\nable to:\n\n\n-----\n\n**Identify gaps in your security architecture. The clarity that IT hygiene provides**\nallows you to see what hosts are running on your environment and whether they are\nprotected. Having complete visibility enables you to effectively deploy your security\narchitecture and ensure no rogue systems are operating behind your walls. The larger\nand more distributed your environment becomes — such as with workforces going\nincreasingly remote — the harder it is to have visibility across all of your endpoints and\nidentities (including both human and service accounts). Identifying the unmanaged\nassets in your environment allows you to target vulnerabilities and protect your\nvaluable assets before attackers can reach them.\n**See what is running in your environment. By proactively identifying outdated and**\nunpatched applications and operating systems, you can manage your application\ninventory and solve security and cost problems simultaneously. Unpatched operating\nsystems and applications have serious security and cost implications — make sure to\nidentify which applications are running on your network and pinpoint unpatched apps to\nget ahead of attackers.\n**See who is running in your environment. Account monitoring allows you to see who**\nis working in your environment and ensure they’re not violating their credential\npermissions (including detection of tools or behavior trying to subvert those policies).\nSystem administrators remain highly targeted, and combined with poor password\nrenewal policies, credential theft is a harsh reality. With insight into password updates,\nyou can prevent credential creep by removing old administrative accounts or making\nsure users update their passwords regularly. Taking this a step further, visibility into\nunusual admin behavior or privilege elevation can prevent silent failure by tipping off\nyour security team as soon as something suspicious occurs.\n**Ensure user compliance. Making sure your users abide by your most up-to-date**\npassword policies keeps administrators and users compliant with your security\nrequirements. Consistent and ongoing user education can ensure that password best\npractices are followed, and ridding your network of old accounts (including service\naccounts) can mitigate the risk of “credential creep” by former employees.\n**Add defense-in-depth. Implement real-time detection policies to monitor for**\nanomalous credential behavior use, including detection of lateral movement even on\nworkstations that may not have a Falcon agent installed. In addition, enable risk-based\nconditional access to trigger MFA for human and service accounts without adding\nburden to users, ensuring higher compliance.\n\nOnce you have full visibility and understanding of your environment, your organization can\nidentify hygiene-related security deficiencies and resolve them immediately. From there,\nsecurity teams can quickly pivot to address the critical elements of comprehensive endpoint\nprotection: prevention, detection, hunting and threat intelligence. These capabilities are key\nto a complete solution that can protect your organization from the most motivated,\nsophisticated attackers. With a “hygiene-first” approach, and the right security solution in\nplace, you can protect your organization from ransomware attacks and stop breaches.\n\n\n-----\n\nIn addition to the general best practices outlined above, the following are specific IT hygiene\nsteps to take to protect against ransomware in particular:\n\n**Do not allow hosts on the internet with exposed RDP port 3389. If you must have**\nRDP internet-facing for business productivity purposes, there are many compensating\ncontrols you will want to consider (see the 2FA/MFA recommendation below).\n**Disable host-to-host communications as strictly as possible. Commonly, lateral**\nmovement occurs via authenticated SMB connections. Remote service creation allows\nfor an attacker to create a service on a remote host, then they can drop a binary into\nthe path where they’ve told the service to point to. This is a very common malware\nlateral movement technique that is also highly associated with ransomware of late.\nEnable behavioral detection controls to flag anomalous activity such as service account\nusage from workstation to workstation (and block service account usage for any\ninteractive login, such as RDP). In addition, enable key adversary tool detection use\n(like Mimikatz) through identity-centric protocol analysis.\n**Consider all administrative activities to occur via a jump host (and enable**\n**identity policy to force administrative use via jump host only). Your host-based**\nfirewall (or Falcon Firewall Management™) can be configured to allow SMB, remote\nPowerShell, etc., from your jump host IP address. This jump host should be the source\nfor your administrative activity or changes. Adversaries will know this and may target\n[that host, so we’ll point you back to SANS CIS Controls and recommend that you do](https://www.sans.org/blog/cis-controls-v8/)\nnot skip a beat on your jump host.\n**Apply two-factor authentication (2FA)/multifactor authentication (MFA). 2FA and**\nMFA are typically at the top of recommended security controls, but we regularly see\nadversaries accessing networks via single-factor VPN authentication as well as singlefactor internet-exposed RDP. Prioritizing MFA everywhere is critical to this\nconversation. To ensure use of MFA everywhere, also consider enabling conditional\naccess policies that trigger based on key conditions and risk factors to reduce the\nburden of MFA and thus wider adoption.\n\n### Configure the Falcon Platform Properly\n\n**Use Proper Prevention Policy Settings. In many organizations, security personnel must**\nbalance the needs and productivity tolerances of the business with the implementation of\nsecurity controls. The Falcon Complete team recommends enabling most, if not all, of the\nconfigurations within the Falcon platform’s Prevention Policy Settings, yet we realize this\nwon’t happen for every asset at every organization. For example, some organizations have\nassets where any disruption whatsoever could lead to thousands of dollars of revenue loss\nevery second. It’s common for the demands of productivity to require prevention policy\nsettings to be dialed back. It’s also common for attackers to find the dark corners of the\nnetwork and conduct their attacks on, or from, these types of systems.\n\n\n-----\n\n(CrowdStrike customers who would like additional information about the specific prevention\n[policy settings recommended by the Falcon Complete team can log in here.)](https://supportportal.crowdstrike.com/s/article/Situational-Awareness-Active-Ransomware-Campaigns)\n\n**Keep Up With Sensor Updates. One common miscalculation the Falcon Complete team**\nobserves organizations make is to continue to do sensor updates manually through their\nexisting solution such as SCCM. If you have a top-notch patching program and can achieve\nsensor updates when they’re made available to the Falcon platform, by all means, continue\nachieving success in this area.\n\nThe cloud-delivered Falcon platform enables the ability to quickly toggle sensor versions to\nvarious host groups. Falcon Complete recommends utilizing the N-1 methodology to update\nall systems aside from a test group where you test the latest sensor when it becomes\navailable within the platform. This configuration updates the sensor to the version released\nimmediately prior to the latest release. This allows all CrowdStrike customers to test the\nsensor for bugs, and also for you to test with a sampling of systems within your network.\nCrowdStrike is consistently updating detections, machine-learning models and functionality\nin our sensor. Going months without an update can leave your environment unprotected from\nthe latest trends that security engineers are tooling detections for.\n\n**Deploy the Falcon Agent 100%. The number one reason Falcon Complete customers**\nbecome compromised is not having the agent deployed to all compatible assets. We see\nlateral movement alerts nearly every day from that dark corner of customer networks, even\n[when an agent cannot be installed on the endpoint. The Falcon Discover™ module has a](https://www.crowdstrike.com/endpoint-security-products/falcon-discover-network-security-monitoring/)\ndashboard that can help identify “Unmanaged Assets.” Again, this piece is fundamentally\ncritical to the ransomware conversation. Spend the time to dig into the appropriate reports\nand track down assets that do not have the Falcon agent on them.\n\nWhen it is not possible to place an agent on all assets, having a CrowdStrike Falcon Identity\n[Protection solution to detect and enforce policy can stop lateral movement, detect](https://www.crowdstrike.com/cybersecurity-101/lateral-movement/)\nanomalous use of service accounts (e.g., interactive logins as seen with RDP), and detect\nthe use of certain tools such as Mimikatz that are commonly used in ransomware attacks.\n\n## Know When to Ask for Help\n\n[In the event that you believe your organization may be impacted by ransomware, calling in](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nexperts to help investigate, understand and improve the situation can make the difference\nbetween a minor incident and a major breach. In some instances, organizations become\naware of threat actor activity within their environment but may lack the visibility to address\nthe problem or the right intelligence to understand the nature of the threat. Getting educated\nabout the latest threats and seeking help by activating an incident response team or retainer,\nsuch as those offered by CrowdStrike Services, may allow for detection and remediation\nbefore the threat actor is able to deploy ransomware or exfiltrate data from the environment.\n\n\n-----\n\nIt s better yet to seek out expert assistance before you truly need it. A technical assessment\ncan help you to proactively identify and understand factors about your organization’s network\nthat could make future ransomware incidents more or less likely. It may take different forms,\ndepending on your current needs and security maturity. For instance, if you experience an\nintrusion that was confined to a specific network segment or specific business unit, an\n[enterprise-wide compromise assessment can give confidence that the attacker did not move](https://www.crowdstrike.com/services/am-i-breached/compromise-assessment/)\ninto parts of the environment that were beyond the scope of the initial investigation.\nAlternatively, an [IT hygiene assessment can identify weak passwords, Active Directory](https://www.crowdstrike.com/services/am-i-mature/it-hygiene-assessment/)\nconfigurations or missed patches that could open the door to the next attacker.\n\n**Additional Resources**\n\n_Read about recent intrusion trends, adversary tactics and highlights of notable_\n_[intrusions in the CrowdStrike 2021 Global Threat Report.](https://www.crowdstrike.com/global-threat-report/)_\n_Understand the trends and themes that we observed while responding to and_\n_remediating incidents around the globe in 2020 — download the latest CrowdStrike_\n_Services Cyber Front Lines Report._\n_[Learn more about Falcon Complete by visiting the product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)_\n_Find out more about the CrowdStrike Falcon® platform by visiting the product_\n_webpage._\n_[Test CrowdStrike next-gen AV for yourself. Start your free trial of Falcon Prevent™](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_today._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-02 - Under Attack- Protecting Against Conti, DarkSide, REvil and Other Ransomware.pdf"
    ],
    "report_names": [
        "2021-06-02 - Under Attack- Protecting Against Conti, DarkSide, REvil and Other Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535631,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653693105,
    "ts_modification_date": 1653693105,
    "files": {
        "pdf": "https://archive.orkl.eu/9f0af6837f56a5e4ba172863d7431e8e5f257b62.pdf",
        "text": "https://archive.orkl.eu/9f0af6837f56a5e4ba172863d7431e8e5f257b62.txt",
        "img": "https://archive.orkl.eu/9f0af6837f56a5e4ba172863d7431e8e5f257b62.jpg"
    }
}