{
    "id": "3cacb00c-526e-4a44-855f-b722c2bb5a40",
    "created_at": "2023-01-12T15:06:42.617392Z",
    "updated_at": "2025-03-27T02:05:58.10314Z",
    "deleted_at": null,
    "sha1_hash": "7f095c0c41179dc07b158b40b84e3393f0f4aa62",
    "title": "2020-07-20 - Shellbot victim overlap with Emotet network infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T15:20:46Z",
    "file_modification_date": "2022-05-28T15:20:46Z",
    "file_size": 844153,
    "plain_text": "# Shellbot victim overlap with Emotet network infrastructure\n\n**[hello.global.ntt/en-us/insights/blog/shellbot-victim-overlap-with-emotet-network-infrastructure](https://hello.global.ntt/en-us/insights/blog/shellbot-victim-overlap-with-emotet-network-infrastructure)**\n\nSecurity division of NTT Ltd.\n\nby Security division of NTT Ltd.\n\n20 July 2020\n\nIn the fall of 2018, the security division of NTT Ltd. added botnet infrastructure detection\ncapabilities to its Managed Security Services (MSS) and threat detection services. In the\ninitial press release, there were limited details released on how our machine learning system\nleverages our access to NTT Ltd.’s global network infrastructure. We own and operate one of\nthe world's largest tier-1 IP backbone having insight into a significant portion of the global\ninternet traffic and is consistently ranked among the top five network providers in the world.\n\nIn this blog post, we’ll explain how our threat detection analysts used netflow data captured\nfrom our global internet infrastructure to uncover overlaps of the Emotet command and\ncontrol (C2) infrastructure with a previously unknown IRC botnet.\n\n**Once upon analysing Emotet traffic**\nIt was observed by threat detection analysts that 16 Emotet command and C2s speak with\nthe IP 63.147.95.189 over port\n\nTCP/65456:\n\n\n-----\n\nA correlation search on Open-Source Intelligence (OSINT) sources uncovered the following\nfile hosted on the same IP:\n\nAnalysing foo.txt we came to the conclusion that it is an IRC Perl bot.\n\nThe settings are:\n\n\n-----\n\nSimplifying the code above one step, we can see how the C2 IP is set, which port is used,\nthe room to join and a list of admins which can send commands:\n\nWe connected to 63.147.95.189 with an IRC client in order to confirm the theory that there’s\nan IRC service running on port 65456:\n\nUnexpectedly the IRC server went down, and we laid the project to rest. However, in\nFebruary 2020, it was once again online and, this time, with a lot of fever victims connected.\nOne day, the admin connected and sent commands in the channel:\n\n\n-----\n\nAs can be seen, the actor sent various commands which all involved the uninstallation of any\nvictims still speaking with the C2. We’ll proceed with further analysis of the source code of\nthe IRC bot.\n\n**Code similarities with Shellbot**\n\nShellbot is an IRC bot which previously has been researched 1 2. The sample observed here\nstored in foo.txt has a subset of the functionalities of the Shellbot samples referenced by\nother researchers 3.\n\n\nThe bullet points over function name similarities and dissimilarities between foo.txt and the\nShellbot sample :3\n\n\n26 functions with the same name\n17 function names only seen in Shellbot sample\nFive function names only seen foo.txt\n\n\n3\n\n\n-----\n\n_Function name difference table, where green indicates that the function only exists in foo.txt_\n_and red shows it only exists in Shellbot sample :3_\n\nThroughout the code there are large code overlaps showing that the bot is built upon a\nsimilar code base but has been evolutionized by different actors over time.\nHere’s an example of a code overlap where the only difference is that the function and\n\n\n-----\n\nvariable names are in Portuguese and English:\n\nThe function name and code segment overlaps are confirmation that foo.txt is a Shellbot\nvariant. The large availability of samples makes any attribution of the actor behind this\nactivity unlikely.\n\n**Victimology**\n\nIn our backend, we’ve captured over 80 victims connecting over port 65456 to the C2. Based\non OSINT data from Shodan on these victims, we attempted to find the common\ndenominator for the likely original point of exploitation. We started by listing the used ports:\n\nAs can be seen, the most common ports show us no surprises, with port 22 used by 81%,\n\n\n-----\n\nindicating most victims to be nix variants. Port 80 and 443 also occur on most of the victims,\nwith a close to even distribution of NGINX and Apache, the ones classified as http or https\nare products unknown to Shodan:\n\nWe also tried to group by the number of victims affected by the same CVE, at most we only\nobserved five victims were affected by the same CVE:\n\n\n-----\n\nIt might be that the actor is using scanners which exploits multiple known vulnerabilities\nand/or performs password bruteforce.\n\n**Conclusion**\n\nWe consider the overlap of victims with Emotet C2s incidental. The massive amount of\nexploitation attempts which occur on the internet inevitably leads to multiple actors exploiting\nand operating on the same machines. Nevertheless, with this research we’ve been able to\nadd detection for a previously unknown C2 server for the protection of our customers.\n\nIn the recently released 2020 Global Threat Intelligence Report, NTT Ltd. researchers and\nthought leaders share statistics and trends from the previous year. A key theme in this year’s\nreport is ‘Attacks are focusing on web applications’. Read more about how attacks towards\n[web applications and open-source software is changing the threat landscape here.](https://hello.global.ntt/en-us/insights/2020-global-threat-intelligence-report)\n\n**Indicators of compromise**\n44f1bc205590b4f7f9436cf0321fb1c754611a6d7a3abf986a8e1511eb843e93\n\n63.147.95.189\n\n**References:**\n\n\n-----\n\n[https://jask.com/wp-content/uploads/2019/02/Shellbot-Campaign_v2.pdf](https://www.sumologic.com/)\n\n2 https://blog.trendmicro.com/trendlabs-security-intelligence/perl-based-shellbot-looks-to\ntarget-organizations-via-cc/\n\n3 Sample from [1] 331bafbf48e1ece5134bc42f4a9bd2be\n\nSecurity division of NTT Ltd.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-20 - Shellbot victim overlap with Emotet network infrastructure.pdf"
    ],
    "report_names": [
        "2020-07-20 - Shellbot victim overlap with Emotet network infrastructure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536002,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653751246,
    "ts_modification_date": 1653751246,
    "files": {
        "pdf": "https://archive.orkl.eu/7f095c0c41179dc07b158b40b84e3393f0f4aa62.pdf",
        "text": "https://archive.orkl.eu/7f095c0c41179dc07b158b40b84e3393f0f4aa62.txt",
        "img": "https://archive.orkl.eu/7f095c0c41179dc07b158b40b84e3393f0f4aa62.jpg"
    }
}