{
    "id": "3cc9ea0b-82bc-4add-864c-04340fe319b6",
    "created_at": "2023-01-12T15:05:36.413737Z",
    "updated_at": "2025-03-27T02:05:33.015416Z",
    "deleted_at": null,
    "sha1_hash": "99aad372b51f748b2d694bf3dec087369273de58",
    "title": "2016-10-20 - TheMoon - A P2P botnet targeting Home Routers",
    "authors": "",
    "file_creation_date": "2015-11-20T16:03:56Z",
    "file_modification_date": "2015-11-20T16:03:57Z",
    "file_size": 1172110,
    "plain_text": "### New Rules: The Evolving Threat Landscape in 2016\n\n\n-----\n\n###### The threat landscape is in a constant state of evolution and the arms race between cyber guardians and cyber criminals has been heating up dramatically over the course of the last year. Over 20 billion devices are expected to be connected in the next four years alone, forcing individuals and organizations to face an exponentially expanding attack surface, bound to a borderless cyberspace. The consequences of falling behind in this arms race can be catastrophic and have elevated the discussion of cybersecurity to the boardroom. This is a complex scenario, and complexity is the enemy of security.\n\n These predictions will provide an historical overview of the evolving threat landscape, reveal the new trends and strategies that Fortinet researchers anticipate cyber criminals will employ in the year to come, and demonstrate how Fortinet is proactively positioned to change the way businesses look at their security strategy going into the new year.\n\n# 20 billion+\n\n#### devices are expected to be connected in the next four years\n\n##### Prediction #1: The Rise of Machine to Machine Attacks\n\n\n**The Threat: The exponential increase of unmanaged, “headless devices” driven by the Internet of Things will make these types of**\ndevices a tempting target for hackers looking to secure a beachhead into more traditional devices and corporate infrastructures. We\n\nwill see a rise in the number of attacks that exploit flaws in trusted machine to machine (M2M) communication protocols.\n\n\n**Background:**\n\nnn 2015 was the first year that IoT device attacks rose into\n\nFortiGuard’s top 10 threat list.\n\nnn Point of Sale (PoS) malware also entered the top 10 list in\n\nJapan.\n\nnn Researchers Miller and Valasek demonstrated flaws enabling\n\n[them to compromise and control a connected vehicle in](http://www.wired.com/2015/07/hackers-remotely-kill-jeep-highway/)\n[motion and estimate that there are 471,000 vehicles that could](http://www.wired.com/2015/07/hackers-remotely-kill-jeep-highway/)\nbe vulnerable to attack.\n\nnn FortiGuard threat research has seen a significant increase\n\nin attacks that target connected consumer devices like IP\nCameras.\n\nnn Gartner predicts that there will be more than 20 billion IoT\n\ndevices by 2020.\n\n\n**Future Outlook:**\n\nnn Exploits and malware will be developed that target trusted\n\ncommunication protocols and APIs: Bluetooth, RFID, NFC,\nWi-Fi, Zigbee, etc.\n\nnn Land and Expand tactics start further away from defensive\n\ncore as lucrative corporate networks implement better\ncyber defenses. Hackers will target devices further into their\nemployees’ personal technology ecosystems to establish an\ninitial beachhead.\n\nnn Connected medical devices and their host applications are\n\na high-value target as the industry moves to adopt new\n[technologies like medicine pumps, hospital bed sensors, smart](http://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/ucm456815.htm?source=govdelivery&utm_medium=email&utm_source=govdelivery)\nblood pressure cuffs and others.\n\nnn Exploits in connected home automation devices like smart\n\nTVs, cameras, smart locks, lights, etc. will be used as\nan entryway into personal data and used as a vector to\ncompromise corporate-issued devices. Home routers and\n\nnetworking continue to be highly targeted by hackers.\n\n\n-----\n\n##### Prediction #2: Headless Worms Target Headless Devices\n\n\n**The Threat: Related to the rise in machine to machine attacks, the “headless devices” driven by the Internet of Things will also**\nbecome a focus of worms and viruses that are designed to independently target and automatically propagate to other devices via\ntrusted communication protocols. These viruses could be designed to cause the systematic failure of devices and the damages would\n\nbe far more substantial as the numbers of IoT devices grows into the billions.\n\n\n**Background:**\n\nnn 1971: The Creeper Virus was the first worm in history and was\n\na proof of concept of a virus autonomously spreading through\nthe TENEX Operating System.\n\nnn 1989: The Morris worm was designed to propagate through\n\nUnix operating systems and resulted in an estimated\n$100,000-$10,000,000 in damages. The first CERT team was\nestablished to combat this threat.\n\nnn Other notable worms: ILOVEYOU (2000), Anna Kournikova\n\n(2001), Slammer & Blaster (2003).\n\nnn There are various worms today that are designed to infect\n\nembedded devices such as home routers, but these have\nUser Interfaces and connectivity features that allow them to be\nmanaged and infections remediated. Two examples of similar\ntypes of worms are “TheMoon” (2014) and “Moose” (2015)\nworms that exploit vulnerabilities in specific consumer routers.\n\n##### Prediction #3: Jailbreaking the Cloud\n\n\n**Future Outlook:**\n\nnn The Morris worm struck at a time where there were only\n\n60,000 devices connected to the internet and estimates put\nthe number of infected devices at around 6,000 or 10%. This\nnumber becomes far more substantial for popular devices like\nfitness trackers that currently have tens of millions of devices\nsold and in use.\n\nnn FortiGuard’s research shows that it is possible to infect\n\nheadless devices with small amounts of code. Exploits like\nthese could lead to device to device propagation of worms,\ni.e. smartwatch to smartwatch malware, that spread through\n\ntrusted communication protocols.\n\n\n**The Threat: As adoption of virtualization and cloud strategies increases, hackers are developing strategies to break out of**\nhypervisors and infect the larger infrastructures and systems. Hackers will start targeting malware that exploits flaws in virtualization\n\nprotocols to jailbreak the cloud and gain access to wider infrastructure data.\n\n\n**Background:**\n\nnn As adoption of cloud and virtualization strategies increases,\n\nmore and more systems are utilizing hypervisor processes to\nmonitor code within end user environments.\n\nnn Known strategies to break out of the hypervisors have existed\n\nsince vmftp in 2007, along with KVM Virtunoid in 2011 and\nothers.\n\n[nn 2015: A decade old vulnerability from 2004 known as Venom](https://community.qualys.com/blogs/laws-of-vulnerabilities/2015/05/13/venom-hypervisor-vulnerability)\n\nexploited floppy disk drivers to break out of a hypervisor and\n\ngain access to host operating systems.\n\n\n**Future Outlook:**\n\nnn Cloud and virtualization adoption rates are increasing, making\n\nthis the next big target for hackers looking to extract valuable\ncorporate data and personal information.\n\nnn We expect to see malware in the wild that is designed to break\n\nout of hypervisors and gain access to host systems in order to\ninfect wider corporate networks.\n\nnn Hackers may attempt to build malware into mobile application\n\ndownloads for devices like smartphones and tablets that are\n\nused to remotely access virtual environments and resources.\n\n\n##### Prediction #4: Ghostware Conceals Indicators of Compromise\n\n\n**The Threat: As cybercriminals become the focus of investigation and prosecution in the criminal justice system, careful hackers will**\ndevelop a new variant of malware that is designed to achieve its mission and then erase all traces before security measures can detect\nthat a compromise has taken place. FortiGuard predicts that we will witness Ghostware in 2016, written to steal data and disappear to\nconceal its creators.\n\n\n-----\n\n**Background:**\n\nnn Criminal Justice agencies are doubling down on investigation,\n\nattribution and prosecution of the perpetrators of cybercrimes.\n\nnn Hackers will take a page from popular identity and content\n\nprotection services like Snapchat, developing Ghostware that\nachieves a mission and then erases all traces of its existence.\n\n[nn Fortinet predicted the rise of Blastware, first surfacing in the](http://www.fortinet.com/press_releases/2014/cyber-threats-black-hat-hacker-increase-2015.html)\n\n[form of Rombertik, which performs checks once it has been](http://www.pcworld.com/article/2918632/rombertik-malware-destroys-computers-if-detected.html)\ninstalled to determine if it has been detected, self-destructing\nand permanently crashing the host system to avoid detection.\n\n##### Prediction #5: Two-Faced Malware\n\n\n**Future Outlook:**\n\nnn New variants of Blastware will persist in targeted attacks,\n\nprimarily utilized in acts of hacktivism or state-sponsored\ncybercrime.\n\nnn Ghostware will emerge that can exploit a system or\n\ninfrastructure to extricate valuable data, then erase itself while\nleaving the host system intact.\n\nnn Ghostware attacks will enable hackers to cast a wider net for\n\ninfection while attempting to avoid identification and attribution\nfor the crimes.\n\n\n**The Threat: Malware has been continually evolving features to avoid detection as security measure like sandboxing become more**\nprevalent. As Sandboxing become more resistant to these countermeasures, we anticipate the development of Two-Faced Malware\ndesigned to execute an innocent task to avoid detection and then execute the malicious process once it has cleared security protocols.\n\n\n**Background:**\n\n[nn 2011: The Unitrix exploit executes various benign Unicode](https://blog.avast.com/2011/09/07/unpacking-the-unitrix-malware/)\n\nfeatures to mask itself from detection engines.\n\n[nn 2014: The Neutrino Botnet utilized various anti-detection](https://blogs.mcafee.com/mcafee-labs/glance-neutrino-botnet/)\n\nstrategies to avoid being discovered by antivirus and\nsandboxing features.\n\nnn Many sandbox solutions utilize a rating system based on\n\nthe observed behavior of the files they are monitoring. If the\nsandboxes observe benign and typical behaviors, they will\nassign “innocent” ratings that can be reported back through\na security vendor’s threat intelligence system. This could\neffectively enable an “all clear” that lets future versions of the\nfiles through deterrents like sandboxes.\n\n##### About FortiGuard Labs\n\n\n**Future Outlook:**\n\nnn New malware will be written that employs multiple code\n\nexecution paths that are designed to execute a benign\nprocess while under inspection and then execute its malicious\nprocess once clear.\n\nnn Two-faced Malware will be engineered to deliver counter threat\n\nintelligence and exploit the rating systems used by sandboxes\nand antivirus solutions. This counter threat intelligence can\nenable future variations of malware to bypass advanced\nsecurity protection systems.\n\nnn These malware types will require stronger scrubbing and\n\nverification systems on the security vendor end. This could\nimpact network performance and decrease the rate of\nadoption for more advanced security solutions.\n\n\nKnowledge of the threat landscape combined with the ability to respond quickly at multiple levels is the foundation of providing\neffective security. Since 2000, FortiGuard Labs have provided in-house, industry-leading security research on over 240 zero-day virus\ndiscoveries, powering Fortinet’s platform and suite of services.\n\nFortiGuard takes information from global sources through its Security Services, using analytics and machine learning to turn big data\ninto near real-time updates for Fortinet appliances, assuring some of the fastest response times in the industry to new vulnerabilities,\nattacks, viruses, botnets, and zero-day exploits.\n\n\nGLOBAL HEADQUARTERS\nFortinet Inc.\n899 Kifer Road\nSunnyvale, CA 94086\nUnited States\nTel: +1.408.235.7700\nwww.fortinet.com/sales\n\n\nEMEA SALES OFFICE\n120 rue Albert Caquot\n06560, Sophia Antipolis,\nFrance\nTel: +33.4.8987.0510\n\n\nAPAC SALES OFFICE\n300 Beach Road 20-01\nThe Concourse\nSingapore 199555\nTel: +65.6513.3730\n\n\nLATIN AMERICA SALES OFFICE\nPaseo de la Reforma 412 piso 16\nCol. Juarez\nC.P. 06600\nMéxico D.F.\nTel: 011-52-(55) 5524-8428\n\n\nCopyright © 2015 Fortinet, Inc. All rights reserved. Fortinet[®], FortiGate[®], FortiCare[®] and FortiGuard[®], and certain other marks are registered trademarks of Fortinet, Inc., and other Fortinet names herein may also be registered and/or common law\ntrademarks of Fortinet. All other product or company names may be trademarks of their respective owners. Performance and other metrics contained herein were attained in internal lab tests under ideal conditions, and actual performance and other\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Fortinet - The Evolving Threat Landscape in 2016.pdf"
    ],
    "report_names": [
        "Fortinet - The Evolving Threat Landscape in 2016.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535936,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1448035436,
    "ts_modification_date": 1448035437,
    "files": {
        "pdf": "https://archive.orkl.eu/99aad372b51f748b2d694bf3dec087369273de58.pdf",
        "text": "https://archive.orkl.eu/99aad372b51f748b2d694bf3dec087369273de58.txt",
        "img": "https://archive.orkl.eu/99aad372b51f748b2d694bf3dec087369273de58.jpg"
    }
}