{
    "id": "3cce8961-1cd3-4a36-9e4e-4fd2282b8b6c",
    "created_at": "2023-01-12T15:02:07.675112Z",
    "updated_at": "2025-03-27T02:08:40.367179Z",
    "deleted_at": null,
    "sha1_hash": "1c60951fdb7912fc38fb0328ed585201133ef96d",
    "title": "2022-03-16 - Preparing for denial-of-service attacks with Talos Incident Response",
    "authors": "",
    "file_creation_date": "2022-05-28T04:06:44Z",
    "file_modification_date": "2022-05-28T04:06:44Z",
    "file_size": 459864,
    "plain_text": "# Preparing for denial-of-service attacks with Talos Incident Response\n\n**[blog.talosintelligence.com/2022/03/preparing-for-denial-of-service-attacks.html](https://blog.talosintelligence.com/2022/03/preparing-for-denial-of-service-attacks.html)**\n\n_By Yuri Kramarz._\n\nOver the years, several extorsion-style and politically motivated denial-of-service attacks\n[increased and still pose a threat to businesses and organizations of](https://blog.talosintelligence.com/2022/03/executive-guidance-ukraine.html) [any size that can find](https://blog.talosintelligence.com/2017/08/chinese-online-ddos-platforms.html)\nthemselves in the crosshairs of various malicious campaigns.\n\nA detailed preparation plan is needed to handle attacks that might come in various formats\nand over different protocols aiming at grinding existing infrastructure to a halt.\n\nUnderstanding potential effects ahead of an attack can lead to reduced response times,\nwhich in turn would benefit business operations.\n\n## Executive Overview\n\nOver the last few years, the world has seen several attacks aiming at temporarily disabling\nthe infrastructure of the [target companies or](https://www.datacenterknowledge.com/security/denial-service-attacks-expected-get-bigger-nastier) [entire governments. These attacks, known as](https://www.engadget.com/liveuamap-ddos-213225248.html)\ndenial-of-service (DoS), or distributed denial-of-service (DDoS) use multiple network\nresources such as botnets or compromised systems to produce a staggering amount of\nnetwork traffic against the target environment causing it to become unavailable.\n\n\n-----\n\nTo create such a disruption, adversaries use multiple resources to amplify the network traffic\nand conceal the identity of an attacker, thus complicating mitigation efforts. The end effect of\na DoS or DDoS attack could vary from simply disrupting online services, to taking entire\n[commercial businesses offline. While nothing can change the nature of adversaries out](https://web.archive.org/web/20200221182149/https:/tools.cisco.com/security/center/resources/guide_ddos_defense)\nthere, and their use of different tactics, tools and procedures (TTPs) against target\ncompanies, preparation for various types of malicious activities can reduce impact and\nrecovery time thus, greatly reducing the cost of cyber incidents.\n\n## Technical overview\n\nOver the years, security professionals have observed the bandwidth of DoS attacks\nincreasing, as do their effects. In 2004, DDoS attacks used 8 Gbps on average. In 2015,\n[these attacks were already around 400 Gbps and](https://www.cloudflare.com/learning/ddos/dns-amplification-ddos-attack/) [up to 2.3 Tbps by 2017.](https://www.securityweek.com/several-ddos-attack-records-broken-2020)\n\nThis increase is mainly due to the use of amplification effects using attacks such as UDP\nfragmentation or DNS reflection, which are difficult to detect and contain without specialized\ntools. Another hard-to-identify vector observed in the wild corresponds to application layer\n[attackers, where headless browsers or Slowloris-type attacks consume resources over the](https://www.securityweek.com/several-ddos-attack-records-broken-2020)\nlife of the requests to the point where, eventually, a server runs out of available sockets to\n[create a new connection pool and is no longer accessible. Likewise, large botnets such as](https://web.archive.org/web/20200221182149/https:/tools.cisco.com/security/center/resources/guide_ddos_defense)\nMirai, use compromised IoT devices, making them capable of generating a significant\namount of traffic in short amounts of time. Instead of using reflection or protocol\nmisconfigurations, botnets generate traffic from thousands of compromised systems en\nmasse.\n\n\n-----\n\n## Types of distributed denial-of-service attacks\n\nThere are three types of DDoS attacks, and each might require different procedures. These\nattacks are measured in bits per second.\n\n### Volumetric DDoS\n\nVolumetric DDoS include the use of UDP, ICMP or other protocols that typically do not\n[require handshaking. In this attack, the adversary aims to saturate all available bandwidth on](https://en.wikipedia.org/wiki/Handshaking)\nthe target network. The magnitude of this attack can be practically unlimited since botnets or\nother zombie computers send large amounts of traffic from around the globe. Since there are\nno handshakes associated with these protocols, it’s very easy to keep sending out packets\ntoward the target. Amplification attacks also come under the same category, as they take\n[advantage of weaknesses in protocols such as Network Time Protocol (NTP) or](https://www.cloudflare.com/learning/ddos/ntp-amplification-ddos-attack/) Domain\nName System (DNS) queries to amplify requests that can then be multiplied in size.\n\n### Protocol DDoS\n\nProtocol DDoS attacks rely on protocol weaknesses, which can be exploited to perform\nattacks such as SYN Floods, Smurf or fragmented packet attacks. These types of attacks\nconsume processing power from networking devices such as load balancers or firewalls,\nthus making it nonresponsive to other entities due to use of the FIFO (first-in, first-out)\nprinciple applied for most devices processing network packets before actual servers serving\nthe application and other resources. Typically, layers 3 and 4 are targeted in protocol DDoS\nattacks.\n\n### Application DDoS \n\nApplication DoS is caused by the submission of large POST requests, GET floods, or other\napplication interaction techniques to overwhelm the application at layer 7 of TCP/IP stack.\nWhile possibly the hardest to execute, software programs (e.g., Slowloris) have been\ndeveloped to perform these types of DDoS attacks. This type of attack sends data formatted\nin a specific application protocol (e.g., HTTP, SMTP, etc.) so it passes through the initial\nfiltering on the boundary devices and reaches processing applications. As applications are\noften connected to a database, this attack may affect back-end systems, too.\n\n## Preparation for defence\n\nPlanning for DDoS attacks is crucial to Business Continuity Planning (BCP). Organizations\nneed to assess its continuity planning in a formal risk assessment procedure that reflects the\ntrue state of the business’s infrastructure and services The consequences of DDoS can be\n\n\n-----\n\nonly understood and appreciated when the true attack surface of available services (i.e.,\nnetwork, connectivity, bandwidth, and devices) is known by the business.\n\nAs adversaries can shift their targets rapidly through botnets (i.e., Mirai), it’s important to\nprepare for various scenarios when planning protections against DoS attacks.\n\n### Assess external attack surface by performing a formal asset discovery\n\nIdentify assets and the criticality of these assets as they relate to business continuity. This\nexercise should identify the systems that need to stay connected and any effects on the\nbusiness should these systems face a DoS attack. The list of critical assets will be required\nto create an appropriate mitigation plan. Identify where the organization is most vulnerable\nfrom the attacker’s point of view by reviewing network diagrams, business products sites,\npublic IP addresses, exposed NAT addresses, database lists, system hosting details, IPAM\nand other data sources.\n\n### Assess the impact of the DoS attack on back-end systems such as databases, routers, and switches \n\nDraw a dependency tree and data flow mapping between exposed infrastructure and various\nback-end systems to understand a worst-case scenario when under attack. This exercise\nshould help you to understand the ‘what-if’ scenario before a full-scale attack is experienced\nby an organization.\n\n### Identify any systems that are a single point of failure\n\nBased on the previous steps of identifying dependencies and dataflow mappings, ensure that\nany systems identified as a single point of failure can be brought up from backup whenever\nneeded. If systems go down, a quick restore procedure can bring them up again. Test\nbackup and restore procedures on a regular basis as part of at least annual BCP exercises.\nWhere feasible, create a long-term strategic plan to migrate systems deemed as a single\npoint of failure to a more resilient state.\n\n### Review your incident response (IR) plan\n\nDocument a solid business continuity plan that can be triggered when under attack and\n[follow additional guidance in the incident response plan. Ensure that employees can use](https://talosintelligence.com/incident_response/plans)\nexternal systems and enable alternative routes into the network (e.g., a separate VPN with\nmulti-factor authentication (MFA)) and notify them about attacks via out-of-bound methods\nsuch as text messages. Also, you'll want to document a process for notifying law\nenforcement or the local Computer Emergency Response Team (CERT) about the attack in\nprogress.\n\n### Ensure that ISP contact details are known\n\n\n-----\n\nAn organization s ISP will be crucial to mitigating some of the volumetric attacks when they\nappear. Communication with the ISP should be part of the IR plan by ensuring the ISP can\ncontact appropriate technical leads for warning signs. Technical leads must understand the\nmeasures the ISP can perform to assist or mitigate a DDoS attack.\n\n### High-performance DDoS devices should be deployed externally to auto- mitigate DDoS attacks. \n\nEstablish contracts and service-level agreements (SLAs) for DDoS protection with\ncompanies who have the appropriate infrastructure and services to assist in the event of an\nattack. Cisco Secure Firewall appliances easily integrate with Radware, a Cisco Partner, to\nprovide this for end customers. Business entities providing DDoS mitigation or protection\nservices typically have different capabilities to absorb the DDoS traffic, which protects their\ncustomer networked environment from being saturated or forced offline.\n\n### Harden external devices, including operating system and application stacks\n\nEnsure that applications and other components are stress-tested to handle exceptional traffic\nin a secure manner. Organizations need to focus on supporting libraries being patched and,\n[where possible various hardening options deployed for underlying software.](https://www.cisecurity.org/cis-benchmarks/)\n\n### Reduce “noise” in your environment through proper device configuration. \n\nAs system administrators and security personnel fight, an increasing number of automatic\nalerts are produced by an ever-growing number of devices in their environment. To avoid\nunnecessary noise in the environment, invest time in the hardened configuration with alert\ndefenders with high fidelity alerts. If needed, involve the vendors and external service\nproviders in fine-tuning the configuration. Revise the default settings and adjust various\nconfigurations to ensure that low-fidelity alerts are handled automatically.\n\n### Use Content Delivery Networks (CDNs) for static content.\n\nPublish external content via CDNs, as these usually have DDoS protection enabled via\nservices such as Cloudflare, Akamai or others.\n\n### Ensure that the organization is ready for an incident\n\nBy executing [IR readiness assessments,](https://talosintelligence.com/incident_response/readiness) [tabletop and](https://talosintelligence.com/incident_response/tabletop) [other exercises aimed at identification](https://talosintelligence.com/incident_response)\nand preparation of appropriate procedures for when an incident does happen, your\norganization and its stakeholders can test its resilience before a real-world attack happens,\nand create awareness about their role in the organizational response.\n\n## Mitigation during a DDoS attack\n\n\n-----\n\nWhile only a limited amount of mitigation techniques are possible without the involvement of\nspecialized providers or tools, here are a few suggestions to reduce any unnecessary risk of\nbeing affected by DDoS attacks:\n\nNote that even with IPS in place, a large amount of traffic can overwhelm security\ndevices. But it may be possible for defenders to block the attack at the external firewall,\npossibly with the added protection of an intrusion prevention system (IPS) like\nSNORT®. This is especially important for Layer 7 DDoS attacks. Reflective attacks will\nnot be stopped by IPS, so other steps might be needed if this type of attack is executed\nagainst an organization.\nOrganizations could also add on auto-scale resources where possible, especially when\nfrontend servers, databases, or applications are cloud-based to increase CPU, memory\nand/or bandwidth.\nWork with ISP to redirect Volumetric DDoS to blackhole infrastructure, thus mitigating\ntraffic that exceeds the organization’s bandwidth.\nUse reverse path forwarding (RPF) on external routers to ensure that IP address\nspoofing is mitigated.\nDeny geolocation connections originating from countries where an organization does\nnot have any business.\nPlace limits on the traffic when feasible by configuring burst size and traffic priority on\nindividual packet types. Where possible, deploy global ACL that can help to deprioritize DDoS traffic to boundary devices if these are not overwhelmed by traffic\ncoming through.\nApply limits for ICMP, SYN packet rates and DNS TTL for exposed systems.\nGet a list of attacking IPs from logs and sort by traffic volume. Attempt to profile the\ntraffic based on sample packet capture from perimeter devices. As the number of\nattackers might be quite substantial this might not always be feasible, however.\nNotify the executive board or CISO about the attacks and, if customers are impacted,\nissue a public statement describing the attack to inform them to ensure that the\nswitchboard or IT support are not flooded with requests to assist.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-16 - Preparing for denial-of-service attacks with Talos Incident Response.pdf"
    ],
    "report_names": [
        "2022-03-16 - Preparing for denial-of-service attacks with Talos Incident Response.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535727,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653710804,
    "ts_modification_date": 1653710804,
    "files": {
        "pdf": "https://archive.orkl.eu/1c60951fdb7912fc38fb0328ed585201133ef96d.pdf",
        "text": "https://archive.orkl.eu/1c60951fdb7912fc38fb0328ed585201133ef96d.txt",
        "img": "https://archive.orkl.eu/1c60951fdb7912fc38fb0328ed585201133ef96d.jpg"
    }
}