{
    "id": "3ce5fd99-5bf6-4bba-9cb5-a91fa0766979",
    "created_at": "2023-01-12T15:01:18.747652Z",
    "updated_at": "2025-03-27T02:09:10.962352Z",
    "deleted_at": null,
    "sha1_hash": "007e2deddeb06516dc30a4e353fd3fbdde4762d9",
    "title": "2017-05-04 - Behind The Mystery Of Russia's 'Dyre' Hackers Who Stole Millions From American Business",
    "authors": "",
    "file_creation_date": "2022-05-27T21:55:34Z",
    "file_modification_date": "2022-05-27T21:55:34Z",
    "file_size": 161488,
    "plain_text": "# Behind The Mystery Of Russia's 'Dyre' Hackers Who Stole Millions From American Business\n\n**[forbes.com/sites/thomasbrewster/2017/05/04/dyre-hackers-stealing-millions-from-american-coporates](https://www.forbes.com/sites/thomasbrewster/2017/05/04/dyre-hackers-stealing-millions-from-american-coporates)**\n\nThomas Brewster May 4, 2017\n\nThis article is more than 5 years old.\n\nPaint maker and retailer Sherwin-Williams Company was a victim of one of Russia's most active cyber...\n\n[+] gangs in 2014, according to a search warrant. (AP Photo/Pat Wellenbach)\n\nAround Halloween 2014, Ohio-based building materials and paint company Sherwin-Williams\ngot an expensive scare - a cyberattack. Seven suspect wires worth around\n$6.45 million were sent from its French subsidiary's corporate account at Morgan Chase to\norganizations across China, Latvia, Liechtenstein and the Netherlands between October 27\nand 30. They were not legitimate transactions. And those organizations were being used as\npart of a huge illegal operation.\n\nThis is according to a just-unsealed search warrant unearthed by Forbes, which revealed the\n$30 billion-valued Sherwin-Williams was hit by one of the Russia's most successful criminal\ngangs, known as Dyre. A source with knowledge of the fraudulent transfers confirmed the\nfacts outlined in the FBI warrant.\n\n\n-----\n\nIt seemed that the Dyre crew s rapid rise to prominence was curtailed in late 2015, when\nRussia's FSB made multiple arrests of individuals suspected of being part of the group. Now\nsources say the hackers are likely active again with Trickbot, new but remarkably similar\nmalware. Those sources also tell Forbes they believe many of those arrested for the multimillion criminal operation were released without being charged. And those allegations have\nonly intensified fears that the Russian government does little to stop hackers carrying out\ncostly cyberattacks against foreign businesses.\n\n**The rise, demise and rebirth of Dyre**\n\nFor Sherwin-Williams, which boasts annual revenues of circa $10 billion, the cyber heist was\npocket change. But it was a significant coup for Dyre, also the name of its own brand of\nbanking malware that replaced infected victims' bank login pages with an imitation website to\nsteal account passwords. According to the search warrant, unsealed in April by an Ohio\ncourt, Dyre swindled another major Ohio-based organization, Miba Bearings US, robbing the\nengine parts manufacturer of $4.8 million, its money transferred to bank accounts in China\nand Hong Kong. Sherwin-Williams declined to comment. Miba acknowledged Forbes' emails\nbut hadn't provided comment at the time of publication. Neither had previously disclosed the\nbreaches.\n\nA phishing email containing the Dyre malware, designed to steal bank logins.\n\nPhishMe\n\nMiba and Sherwin-Williams are just two of many victims. At its height, Dyre was the most\nactive financial malware on the web, stealing tens of millions from firms across America, the\nU.K. and Australia. Another major victim was the budget airline RyanAir, which was\nreportedly robbed of $5.5 million. By the time Sherwin-Williams was hacked, not long after\nDyre first appeared in mid-2014, 45,000 U.S.-based PCs were infected with the group’s\nmalware (also known as Dyreza), out of a worldwide total of 133,000, according to the\nwarrant.\n\nThe scope of the operation was extraordinary in both its aggressive expansion and its\nprofitability. To dupe companies, the Dyre attackers used some particularly aggressive\ntactics. Where the target didn't enter their banking passwords into the fake web page, the\nhackers would call them directly over Skype, pretending to be the bank and encouraging\nthem to hand over login information. On at least one occasion, according to the search\nwarrant, a Dyre agent pretended to be a law enforcement officer.\n\nA configuration file for Dyre showed the criminals created as many as 1,100 phishing\nwebsites, imitating login pages for all major Western banks, from Goldman Sachs to Wells\nFargo to the Royal Bank of Scotland. They also went after customers of major platforms like\nSalesforce, which holds financial information such as payrolls.\n\n\n-----\n\nDyre topped the list for most active bank malware in 2015, but has been out of action since 18... [+]\n\nNovember that year.\n\nIBM\n\nThe Dyre crooks ran a huge network of “money mules” -- individuals and businesses that\nfunnel funds from stolen victims through various bank accounts in a bid to prevent law\nenforcement from following the money back to the gang leaders. Dyre’s mules were situated\nin China, Hong Kong, The Netherlands and Latvia to name a few, according to the warrant.\nBut they weren’t just employed to move money through financial institutions. They also\nlaundered pilfered funds by purchasing Apple products, games consoles and military\nequipment to be resold within Russia for an amount higher than their commercial retail price,\naccording to Brett Stone-Gross, e-crime analyst at CrowdStrike. They included MacBooks,\niPads, PS4s, Xbox consoles, Roomba robot vacuums, guitars, rifle scopes and laser sights.\n\nThe whole operation came crumbling down in November 2015 when a Moscow-based film\n[company, 25th Floor, was raided and arrests made. But there’s little information on just what](https://www.forbes.com/sites/thomasbrewster/2016/02/08/russia-arrests-dyre-malware-masterminds/)\nrole, if any, 25th Floor employees played in the Dyre conspiracy. Adding intrigue to the Dyre\ntale was the fact that 25th Floor was producing a film called Botnet, a thriller loosely based\non a 2010 case involving a $3 million cybercrime. According to a source with knowledge of\nthe FSB investigation, as many as 50 arrests were made during that raid, but most were\nreleased. Forbes could not independently verify that claim. 25th Floor CEO Nikolay Volchkov,\nwho didn’t appear to be amongst those apprehended at the time, did not respond to requests\nfor comment.\n\nGlobal law enforcement agencies have continued to dismantle the campaign’s mule\ninfrastructure, as the FBI warrant, dated September 2016, attests. In November, U.K.\n[police arrested 14 individuals involved in a money mule group that laundered $14.2 million](http://www.nationalcrimeagency.gov.uk/news/948-nca-targets-international-cyber-crime-network)\nfor Dyre and another notable cybercriminal operation called Dridex.\n\n**The ghost of Dyre lives**\n\nMuch mystery remains about Dyre’s leaders. No names were ever released and no public\ncharges revealed by Russian police. Sources with knowledge of the hackers’ activities say\nthey believe some or all of the original gang members are still perpetrating cybercrimes. And\nnot long after Dyre died, TrickBot was born. Its code contains notable similarities to Dyre’s\neponymous malware and does much the same, imitating bank logins. Thus far it's been\ntargeting major financial bodies in Australia and the U.K., including ANZ, HSBC and Lloyds\nBank, according to configuration files for the malware.\n\nIt's yet to target U.S. organizations on the same scale as Dyre did, but IBM executive\nsecurity advisor Limor Kessem believes it's a matter of time before TrickBot goes big. This\nmonth, the malware went from carrying out one to three major attacks per month, up to five,\n[according to IBM data released in April.](https://securityintelligence.com/trickbot-is-hand-picking-private-banks-for-targets-with-redirection-attacks-in-tow/)\n\n\n-----\n\nThough there s no clear evidence linking the Dyre overlords with those behind TrickBot, the\ntechnical clues indicate they're the same, according to security experts and an FBI official,\nwho asked to remain anonymous as he was not authorized to talk publicly on the subject. \"I\ndo suspect that TrickBot was not created by a new team, and that at least parts of the old\nDyre team is involved in its development and operation,\" added Kessem.\n\nEvgeniy Bogachev is one of the FBI's Most Wanted and found his way onto American sanctions of... [+]\n\nRussian individuals and entities following the U.S. election hacks of 2016. Dyre is linked to his alleged\n\ncybercrime operation, The Business Club, which has been tied to espionage activity.\n\nDepartment of Justice\n\nDyre has also been linked to one of the world's biggest cybercrime gangs: the Business\nClub, a sprawling operation headed up by FBI Most Wanted, Evgeniy Bogachev. An\nindictment from May 2014 claimed he’d stolen as much as $100 million through cyberattacks\nwith the Gameover Zeus banking malware and the Cryptolocker ransomware.\n\n“We assess that [Dyre] is some or all of the same people including Bogachev,” said\nSecureWorks analyst Alex Tilley. He pointed to technical links, including the use of a\ndownloader tool called Upatre, used by both Dyre and Gameover Zeus, while noting some\nintriguing timing: “The timing is crucial from a technical point of view: the GameOver Zeus\ntakedown was in June 2014 and after a few attempts at regaining control of the malware it\ngoes quiet. Then two weeks later Dyre appears and it’s going after the same target sector as\nGameOver Zeus and is using the same types of web injects… the facts don’t point at any\nother group being setup to attack the same targets, using the same methods and evolutions\nof the same malware/tooling at that time.”\n\nGoing further down the rabbit hole, the Business Club has been linked to Kremlin-backed\nspy operations too. In 2015, Forbes revealed Bogachev was also tied by security firms\nSecureWorks and CrowdStrike to Russian cyberespionage on foreign targets, including\nsome in the U.S. The Russian government has previously denied any involvement in\nrecruiting criminals to carry out cyberespionage.\n\n**Kremlin-backed cybercrime?**\n\nIf, as sources say, some of the key Dyre operators are continuing to profit from cybercrime,\neven after the initial arrests, Western experts fear Russian agencies are backing hackers\nwho target the U.S. and other nations, without stealing from the homeland. Bogachev is\nliving freely in a city on the Red Sea, despite the accusations levelled at him, and is yet to\n[stand trial anywhere. And alleged Yahoo hacker Alexsey Belan, who was accused by the](https://www.forbes.com/sites/thomasbrewster/2017/03/20/alexsey-belan-yahoo-fbi-hacker-allegations/)\nU.S. of attacking other U.S.-based companies including Amazon and Evernote, was said by\nAmerican prosecutors to have been encouraged by FSB agents. Neither Bogachev nor\nBelan could be contacted for comment.\n\n\n-----\n\nIt s this kind of alleged collusion that political and cyber experts have long suspected, but\nwithout any official claims until the Yahoo breach indictments hit in February, two months\nafter both Belan and Bogachev appeared on the White House’s sanctions on Russian\nentities in response to the cyberattacks on the 2016 election.\n\nNeither of the two men could be reached for comment. The Kremlin, for its part, has denied\nany involvement in either the Yahoo or the election attacks.\n\nBut James Lewis, an intelligence and security specialist at the Center for Strategic and\nInternational Studies, said any digital thief residing in Russia simply has to follow some\nsimple rules if they want to live a life of crime and remain free. \"You can't operate in Russia\nunless you do what the government asks. There are three rules for Russian cybercriminals.\nNumber one, don't hack in Russia - I'm now told it's don't hack Cyrillic language targets.\nNumber two, share the wealth with the local FSB. Number three, if they ask you to do a\nfavor, do it - e.g. act as a proxy force for the Russian state.\n\n\"Follow these and you'll never go to jail.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-04 - Behind The Mystery Of Russia's 'Dyre' Hackers Who Stole Millions From American Business.pdf"
    ],
    "report_names": [
        "2017-05-04 - Behind The Mystery Of Russia's 'Dyre' Hackers Who Stole Millions From American Business.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa8d7ec6-128a-41b9-8cdc-01ad8843020f",
            "created_at": "2022-10-25T16:07:24.485077Z",
            "updated_at": "2025-03-27T02:02:10.249899Z",
            "deleted_at": null,
            "main_name": "Dungeon Spider",
            "aliases": [],
            "source_name": "ETDA:Dungeon Spider",
            "tools": [
                "Locky"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "91ff2504-6c1a-4eaa-832b-2c5e297426c5",
            "created_at": "2022-10-25T16:47:55.740817Z",
            "updated_at": "2025-03-27T02:05:17.358938Z",
            "deleted_at": null,
            "main_name": "GOLD EVERGREEN",
            "aliases": [
                "The Business Club"
            ],
            "source_name": "Secureworks:GOLD EVERGREEN",
            "tools": [
                " JabberZeus",
                " Pony",
                " Zeus",
                "CryptoLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6898c5bc-48af-4e38-917b-f9f0a41d0ee2",
            "created_at": "2023-01-06T13:46:39.00984Z",
            "updated_at": "2025-03-27T02:00:02.976363Z",
            "deleted_at": null,
            "main_name": "DUNGEON SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:DUNGEON SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535678,
    "ts_updated_at": 1743041350,
    "ts_creation_date": 1653688534,
    "ts_modification_date": 1653688534,
    "files": {
        "pdf": "https://archive.orkl.eu/007e2deddeb06516dc30a4e353fd3fbdde4762d9.pdf",
        "text": "https://archive.orkl.eu/007e2deddeb06516dc30a4e353fd3fbdde4762d9.txt",
        "img": "https://archive.orkl.eu/007e2deddeb06516dc30a4e353fd3fbdde4762d9.jpg"
    }
}