{
    "id": "3d1882be-ed8c-4360-8523-11c7f8a98b6a",
    "created_at": "2023-01-12T15:09:10.623095Z",
    "updated_at": "2025-03-27T02:16:57.953011Z",
    "deleted_at": null,
    "sha1_hash": "6f2dac4fa5c288c781a228f76e4c79ac857fcff6",
    "title": "2020-08-04 - CrimeOps- The Operational Art of Cyber Crime",
    "authors": "",
    "file_creation_date": "2022-05-28T23:36:37Z",
    "file_modification_date": "2022-05-28T23:36:37Z",
    "file_size": 91142,
    "plain_text": "# CrimeOps: The Operational Art of Cyber Crime\n\n**[sec.okta.com/articles/2020/08/crimeops-operational-art-cyber-crime](https://sec.okta.com/articles/2020/08/crimeops-operational-art-cyber-crime)**\n\n[‹ Back to blog](https://sec.okta.com/blog)\nAugust 4, 2020\nThe Grugq\n\n## Cyber Crime Innovation Is Lucrative\n\nCybercrime rewards innovative organizations. These can innovate at the tactical level (e.g.\nnew or updated tactics, techniques, and procedures (TTP)), the strategic level (e.g. new\nmonetisation methods), or at the operational level—the management of resources and\npersonnel to achieve strategic objectives. This is operational art.\n\nThe operational level, the glue that enables a group to execute well, is seldom analyzed\nbecause it is rarely visible to information security researchers. Unlike tactical TTP, where\nchanges are discovered quickly on the ground, new operational strategies only come to light\nby monitoring major shifts and trends.\n\nThe FIN7 affidavits are a unique opportunity to see inside the management of a successful\ncybercrime gang and analyze their operational art. The most detailed information in the\naffidavits covers the time period 2016–2017. The methodologies and tooling described were\ncutting-edge and trendy at the time\n\n### The Innovators—FIN7, Uber for Cybercrime\n\n[Kaspersky has been tracking FIN7 since 2015 . Despite a series of arrests in 2018–2020,](https://securelist.com/fin7-5-the-infamous-cybercrime-rig-fin7-continues-its-activities/90703/)\nand ongoing investigations, FIN7 continues to operate. FIN7 managed hundreds of victims,\nhuge volumes of stolen data, a large salaried team, development of new targets, and\nmaintaining their tool chain. That’s an organisation with a lot of moving parts. Their\ninnovations were in cyber crime operational art. The details of how this group of Russian\ncyber criminals cooperated as an organisation is fascinating.\n\nFIN7 was not and is not the most technically sophisticated threat actor. They rely on phishing\nfor access, their toolkit is just repurposed common malware, and they monetize via stolen\ncredit cards and wire transfers. Despite being only a middle of the road hacking outfit, they\n[looted an alleged 1 billion US dollars by 2018. Why was FIN7 so amazingly successful using](https://www.wired.com/story/fin7-carbanak-hacking-group-behind-a-string-of-big-breaches/)\nonly stodgy “Top 10 Infosec Risks” TTP?\n\n\n-----\n\nThe answer is FIN7 s sophisticated organisation and management capabilities. They\nadopted agile processes and a DevOps methodology. Good team coordination and project\nmanagement tools were combined with rapid iteration on their toolchain and TTP to maintain\nefficacy and operational capability. Let's explore CrimeOps.\n\n## CrimeOps: Project Management for Criminals\n\nThe secret of FIN7’s success is their operational art of cyber crime. They managed their\nresources and operations effectively, allowing them to successfully attack and exploit\nhundreds of victim organizations. FIN7 was not the most elite hacker group, but they\ndeveloped a number of fascinating innovations. Looking at the process triangle (people,\nprocess, technology), their technology wasn’t sophisticated, but their people management\nand business processes were.\n\nTheir business… is crime! And every business needs business goals, so I wrote a mock\nFIN7 mission statement:\n\n_Our mission is to proactively leverage existing long-term, high-impact growth strategies_\n_so that we may deliver the kind of results on the bottom line that our investors expect_\n_and deserve._\n\nHow does FIN7 actualize this vision? This is CrimeOps:\n\nRepeatable business process\nCrimeBosses manage workers, projects, data and money.\nCrimeBosses don’t manage technical innovation. They use incremental improvement to\nTTP to remain effective, but no more\nFrontline workers don’t need to innovate (because the process is repeatable)\n\nLet’s look at their process triangle.\n\n### People: FIN7 Team Roles\n\nThe organization had a surprisingly sophisticated range of job functions and an impressive\ndepth of capability, similar to that you'd need to [build an APT.](https://medium.com/@thegrugq/cyber-ignore-the-penetration-testers-900e76a49500)\n\nManagers\nOperators\nDevelopers\nInterpreters\n\nThe FIN7 group grew capacity by hiring people via fake front companies. Behind the facade\nof their fake information security company, the leaders of FIN7 recruited employees to work\non development and penetration testing. Prospective employees were interviewed on a\nHipChat instance (a sort of privately hosted Slack).\n\n\n-----\n\n_By 2025 there will be a projected shortage of 20,000 cybercriminals_\n_– Cyber Crime Business Weekly, probably._\n\nFIN7 is currently suffering a number of setbacks as the FBI aggressively dismantles it. The\nexecutive suite is being cleared out. Leaders of the group (the management team) have\nbeen arrested, but a large number of supporting players have escaped the long arm of the\nlaw.\n\n### Process: How to Cyber Crime and Make Money\n\nFIN7’s success comes from their effective crime process, a monetization template that easily\nadapts to different verticals and organisations. The fundamental cyber crime process used\nby FIN7 is unremarkable, but absolutely effective. It’s bread and butter cybercrime. The\nprocess that converts access to a company into a stream of valuable financial data and\nmoney transfers is:\n\n1. Select target\n2. Research potential assets in target\n3. Recruit asset over email\n4. Trick asset into deploying remote access Trojan\n5. Survey network\n6. Start continuous exfiltration\n\n1. Access business bank accounts, access point of sale or other financial\n\nprocessing\n2. Transfer money out of accounts, transfer collected data out of network\n7. Sell financial data\n\nThis is a black box that makes money. A target, as input, produces wire transfers and\nfinancial data as output. The innovation was in scaling this process.\n\nA reliable crime process enables value extraction from any victim. Therefore the business\nstrategy for this criminal enterprise is not value extraction, but growing the portfolio of victims\nthey can exploit. Essentially, once they had product/market fit, FIN7 just had to scale. The\nscaling bottleneck is not in the process, but in executing it in parallel. This is where the\noperational art of cyber crime becomes portfolio management.\n\n### Business Growth: Portfolio Management for Hackers\n\n_“Portfolio management is the selection, prioritisation and control of an organisation’s_\n_programmes and projects, in line with its strategic objectives and capacity to deliver._\n_The goal is to balance the implementation of change initiatives and the maintenance of_\n_business- as -usual, while optimising return on investment.” –_ APM Body of Knowledge\n7th edition\n\n\n-----\n\nAfter the core team standardized their process for exploiting a victim company, the bottleneck\nto maximising returns moved from “develop a process” to “run the process in parallel.” FIN7’s\ninnovation in operations, project, and resource management allowed them to grow their\nactively exploited victim portfolio.\n\nThis is portfolio management. The portfolio is a bundle of projects. Each project is a victim\ncompany moving through the monetization process with associated resources. A project\ncontains information about the victim, assigned personnel, and extracted data. The only way\nto handle hundreds of victims is with a project management software stack to track and\nmonitor the progress through the process.\n\nFIN7 also used the project management processes of its time, including agile and DevOps.\nThey used agile (iterative changes in response to feedback) to adjust and change their\ntooling as necessary to remain operational. They used DevOps as collaboration between\ndevelopers and operations with central management throughout the end-to-end engineering\nprocess.\n\n### Technology\n\nTactically FIN7 is boring. The tactical cybercrime process, the TTP which enables the\nprocess, is fairly rigid. FIN7 have been tracked by their TTP, and other groups have been\nfound duplicating the TTP (can you get a patent for a cyber crime business process?), for\nyears. There is not much room to innovate at the tactical level, and it is unlikely that\ninnovation would substantially alter their revenue because they are not bottlenecked by their\nability to penetrate or extract value. With boring but effective tactical technology, frontline\nworkers don’t have to innovate, and revenue is not dependent on their technical skills.\n\nSuccess is realized through innovative management. FIN7 used project management\nsoftware to track victims and the progress of their attacks. They used group chat software to\nmanage personnel, conduct interviews, and trade data. A separate secure chat system was\nused for sensitive operations, such as arranging salary payment.\n\nUsing JIRA, FIN7 created an issue ticket for each victim. As the attack progressed through\nreconnaissance, infiltration, lateral traversal, and target exploitation (by collecting data into\n\"loot\"), the issue was updated. Usernames and passwords, output from security tools,\nscreenshots and video captures, everything relevant to increasing their access and control\nover the victim, was added to JIRA.\n\nIt is interesting that JIRA was used as an information management tool, with a single issue\nper victim and relevant information added as comments. This is a poor use of JIRA's\ncapabilities. They did not use JIRA’s project management functionality, but instead abused\nticketing for ad hoc collaboration. This could be improved—information management would\nbe handled better with a wiki or a specialized red team collaboration tool.\n\n\n-----\n\nIt is possible that JIRA was used partially to help maintain the cover of the legitimate Combi\nSecurity company. Realistically, any penetration tester who was involved in FIN7's criminal\noperations would know that they were not conducting ethical hacking, because:\n\nProper pen tests have start times, kickoffs, and duration\nPen test customers supply information to the pen test team\nSophisticated social engineering is seldom used (because it always works)\n\nThere were overtly criminal indicators:\n\nTargeted social engineering with tailored enticements and infection vectors\nSecondary social engineering pressure (phone calls to guide victim through the\ninfection process)\nUsing malware for post exploitation\nTargeting point of sale systems\nCollecting credit card details in \"loot.rar\"\n\nReally though, the number one reason is more obvious—pen tests always result in report\n**writing.**\n\n## CrimeOps: Continuous Infiltration Pipeline\n\nWe have reviewed FIN7’s CrimeOps process triangle. Key innovations and improvements to\nstandard practice developed or adopted by FIN7 were:\n\nMove from technological innovation to business innovation\nRepeatable adaptable process\nPortfolio management to scale the processes\nProject management software to track large numbers of victims\nCapacity building to execute processes in parallel\nTeam roles, structured teams, and recruitment\nDevOps collaboration\nAgile rapid iteration on toolkit\n\nCrime pays when you move up the value chain into project management!\n\nThe Grugq is a pioneering information security researcher with two decades of experience at\nalmost every level of the field. He has worked extensively with threat intelligence,\ndisinformation, digital forensic analysis, binary reverse engineering, rootkits, mobile phone\nsecurity, Voice over IP, telecommunications and financial services security. The Grugq has\nbeen quoted and referenced routinely in The New York Times, Washington Post, Forbes,\nWired, TechCrunch, BoingBoing, VICE and BBC News. Grugq’s quotes and insights are so\nfrequently referenced at security conferences that he’s informally known as the “most quoted\nman in infosec\".\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-04 - CrimeOps- The Operational Art of Cyber Crime.pdf"
    ],
    "report_names": [
        "2020-08-04 - CrimeOps- The Operational Art of Cyber Crime.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536150,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653780997,
    "ts_modification_date": 1653780997,
    "files": {
        "pdf": "https://archive.orkl.eu/6f2dac4fa5c288c781a228f76e4c79ac857fcff6.pdf",
        "text": "https://archive.orkl.eu/6f2dac4fa5c288c781a228f76e4c79ac857fcff6.txt",
        "img": "https://archive.orkl.eu/6f2dac4fa5c288c781a228f76e4c79ac857fcff6.jpg"
    }
}