{
    "id": "3d25dc7c-c944-40d9-8429-b7fae21af7f9",
    "created_at": "2023-04-05T02:08:19.511487Z",
    "updated_at": "2025-03-27T02:16:17.361881Z",
    "deleted_at": null,
    "sha1_hash": "a244523b17c7e10b942c2d7de537699f70075884",
    "title": "2023-03-30 - Exploitation is a Dish Best Served Cold- Winter Vivern Uses Known Zimbra Vulnerability to Target Webmail Portals of NATO-Aligned Governments in Europe",
    "authors": "",
    "file_creation_date": "2023-04-03T08:59:29Z",
    "file_modification_date": "2023-04-03T08:59:29Z",
    "file_size": 4454954,
    "plain_text": "# Exploitation is a Dish Best Served Cold: Winter Vivern Uses Known Zimbra Vulnerability to Target Webmail Portals of NATO-Aligned Governments in Europe\n\n**[proofpoint.com/us/blog/threat-insight/exploitation-dish-best-served-cold-winter-vivern-uses-known-zimbra-vulnerability](https://www.proofpoint.com/us/blog/threat-insight/exploitation-dish-best-served-cold-winter-vivern-uses-known-zimbra-vulnerability)**\n\nMarch 29, 2023\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nExploitation is a Dish Best Served Cold: Winter Vivern Uses Known Zimbra Vulnerability to\nTarget Webmail Portals of NATO-Aligned Governments in Europe\n\n\n-----\n\nMarch 30, 2023\nMichael Raggi and the Proofpoint Threat Insight Team\n\n## Key Takeaways\n\nProofpoint has observed recent espionage-related activity by TA473, including yet to be\nreported instances of TA473 targeting US elected officials and staffers. TA473 is a newly\nminted Proofpoint threat actor that aligns with public reporting on Winter Vivern.\nTA473 since at least February 2023 has continuously leveraged an unpatched Zimbra\nvulnerability in publicly facing webmail portals that allows them to gain access to the\nemail mailboxes of government entities in Europe.\nTA473 recons and reverse engineers bespoke JavaScript payloads designed for each\ngovernment targets’ webmail portal.\nProofpoint concurs with Sentinel One analysis that TA473 targeting superficially aligns\nwith the support of Russian and/or Belarussian geopolitical goals as they pertain to the\nRussia-Ukraine War.\n\n## Overview\n\nResearchers have observed TA473, a newly minted advanced persistent threat (APT) actor\ntracked by Proofpoint, exploiting Zimbra vulnerability CVE-2022-27926 to abuse publicly facing\nZimbra hosted webmail portals. The goal of this activity is assessed to be gaining access to\nthe emails of military, government, and diplomatic organizations across Europe involved in the\nRussia Ukrainian War. The group utilizes scanning tools like Acunetix to identify unpatched\nwebmail portals belonging to these organizations to identify viable methods for targeting\nvictims. Following initial scanning reconnaissance, the threat actors deliver phishing emails\npurporting to be relevant benign government resources, which are hyperlinked in the body of\nthe email with malicious URLs that abuse known vulnerability to execute JavaScript payloads\nwithin victim’s webmail portals. Further, the threat actors appear to invest significant time\nstudying each webmail portal instance belonging to their targets as well as writing bespoke\nJavaScript payloads to conduct Cross Site Request Forgery. These labor-intensive customized\n\n\n-----\n\npayloads allow actors to steal usernames, passwords, and store active session and CSRF\ntokens from cookies facilitating the login to publicly facing webmail portals belonging to NATOaligned organizations.\n\nProofpoint researchers recently promoted TA473 to a publicly tracked threat actor. Known in\nopen-source research as Winter Vivern, Proofpoint has tracked this activity cluster since at\nleast 2021.\n\n## Who is TA473?\n\n[TA473 is publicly referred to as Winter Vivern and UAC-0114 by security vendors like](https://cert.gov.ua/article/3761104)\n[DomainTools,](https://www.domaintools.com/resources/blog/winter-vivern-a-look-at-re-crafted-government-maldocs/) [Lab52,](https://lab52.io/blog/winter-vivern-all-summer/) [Sentinel One, and the](https://www.sentinelone.com/labs/winter-vivern-uncovering-a-wave-of-global-espionage/) [Ukrainian CERT. This threat actor has historically](https://cert.gov.ua/article/3761023)\nleveraged phishing campaigns to deliver both PowerShell and JavaScript payloads, as well as\nconducts recurring credential harvesting campaigns using phishing emails. Proofpoint since\n2021 has observed a concerted focus on European government, military, and diplomatic\nentities in active phishing campaigns. However, in late 2022, Proofpoint researchers also\nobserved phishing campaigns that targeted elected officials and staffers in the United States.\nSince the onset of the Russia-Ukraine War, researchers have observed a commonality among\nobserved targets, social engineering lures, and impersonated individuals. Often targeted\nindividuals are experts in facets of European politics or economy as it pertains to regions\nimpacted by the ongoing conflict. Social engineering lures and impersonated organizations\noften pertain to Ukraine in the context of armed conflict.\n\n## What Does a TA473 Phishing Campaign Look Like?\n\nProofpoint has observed an evolution of TA473 phishing campaigns since 2021. This threat\nactor has been observed employing opportunistic exploits to target its victims which include\npopular 1-day vulnerabilities like the CVE-2022-30190 (“Follina”) exploit disclosed in May\n2022. However, most commonly this threat actor leverages a recurring set of phishing\ntechniques in every email campaign. The phishing tactics below have consistently been\nobserved across both US and European targets as well as among credential harvesting,\nmalware delivery, and cross-site request forgery (CSRF) campaigns.\n\n1. TA473 sends emails from compromised email addresses. Often these emails originate\n\nfrom WordPress hosted domains that may be unpatched or unsecure at the time of\ncompromise.\n2. TA473 spoofs the from field of the email to appear as a user at the targeted organization\n\nOR TA473 spoofs the from field of the email to appear as a relevant peer organization\ninvolved in global politics.\n3. TA473 includes a benign URL from either the targeted organization or a relevant peer\n\norganization in the body of the email.\n4. TA473 then hyperlinks this benign recognized URL with actor-controlled or compromised\n\ninfrastructure to deliver a first-stage payload or to redirect to a credential harvesting\nlanding page.\n\n\n-----\n\n5. TA473 often uses structured URI paths that indicate a hashed value for the targeted\n\nindividual, an unencoded indication of the targeted organization, and in some cases\nencoded or plaintext versions of the benign URL that was hyperlinked in the initial email\nto targets.\n\n_Figure 1. TA473 email including hyperlinked URL redirecting to a malicious actor-controlled_\n_resource._\n\n## Exploitation of Disclosed Zimbra Vulnerability to Target Public Facing Webmail Portals\n\nBeginning in early 2023, Proofpoint observed a trend of TA473 phishing campaigns targeting\n[European government entities that take advantage of CVE-2022-27926. This vulnerability](https://nvd.nist.gov/vuln/detail/CVE-2022-27926#match-7894056)\nimpacts Zimbra Collaboration (previously “the Zimbra Collaboration Suite”) versions 9.0.0,\nwhich is used to host publicly facing webmail portals. The vulnerability is described as a\n“reflected cross-site scripting (XSS) vulnerability in the /public/launchNewWindow.jsp\ncomponent of Zimbra Collaboration (aka ZCS) 9.0 (which) allows unauthenticated attackers to\nexecute arbitrary web script or HTML via request parameters.”\n\nIn practice, TA473 is hyperlinking a benign URL in the body of a phishing email with a URL that\nleverages CVE-2022-27926. The malicious URL uses the webmail domain that has a\nvulnerable Zimbra Collaboration Suite instance and appends an arbitrary hexadecimal\nencoded or plaintext JavaScript snippet, which is executed as an error parameter when it is\nreceived in the initial web request. The JavaScript, once decoded, results in the download of a\nnext stage bespoke JavaScript payload that conducts CSRF to capture usernames,\npasswords, and CSRF tokens from the user.\n\n\n-----\n\n_Figure 2. TA473 CSRF infection diagram._\n\nResearchers note that the exploitation of this vulnerability is very similar in practice to the\nexploitation of CVE-2021-35207, which impacts a wider cross section of Zimbra Collaboration\nversions, and specifically involves adding executable JavaScript to the loginErrorCode\nparameter of a webmail login URL. However, it is believed that this exploitation is distinct and\nlimited to CVE-2022-27926. The following variations of TA473 leveraging CVE-2022-27926\nhave been observed:\n\n1.   URL with Hexadecimal Encoded JavaScript Values\n\n\n-----\n\n_Figure 3. CyberChef decoded hexadecimal JavaScript._\n\n2.   URL with PlainText JavaScript Values\n\n## Customized Cross-Site Request Forgery\n\nProofpoint researchers have identified several instances of what appear to be customized\nCSRF JavaScript payloads with delivery achieved through both the above-mentioned CVE2022-27926 exploitation and earlier delivery mechanisms, such as TA473-controlled\ninfrastructure delivery stemming from the hyperlink of benign URLs in the body of the phishing\nemail. These CSRF JavaScript code blocks are executed by the server that host a vulnerable\nwebmail instance. Further, this JavaScript replicates and relies on emulating the JavaScript of\nthe native webmail portal to return key web request details that indicate the username,\npassword, and CSRF token of targets. In some instances, researchers observed TA473\n[specifically targeting RoundCube webmail request tokens as well. This detailed focus on which](https://urlscan.io/result/b127f19a-7795-47d1-ad28-dfe6024ff2b6)\nwebmail portal is being run by targeted European government entities indicates the level of\nreconnaissance that TA473 conducts prior to delivering phishing emails to organizations.\nThese next-stage TA473 CSRF JavaScript payloads also utilize several layers of Base64\n\n\n-----\n\nencoding to obfuscate the functionality of the JavaScript. The actor inserts three nested\ninstances of Base64 encoded JavaScript to complicate analysis of these delivered payloads.\nHowever, decoding the script is trivial to reveal the intended malicious functionality.\n\n_Figure 4. Base64 encoded CSRF JavaScript payload (excerpted for length)._\n\nEach identified malicious JavaScript payload heavily incorporates the legitimate JavaScript\nthat executes in a native webmail portal. To not identify the specific European governmental\norganizations impacted by these campaigns, Proofpoint researchers have focused on the highlevel functionality of the scripts, and specifically the portions inserted by TA473 to achieve\ncross-site request forgery. Researchers observed a malicious JavaScript delivered in February\n2023 with the following capabilities:\n\n1. Steal usernames\n2. Steal user's password\n3. Steal an active CSRF token from a cookie in the web request response\n4. Caches the stolen values to the actor-controlled server\n5. Attempts login to the legitimate mail portal with active tokens\n6. The script utilizes the additional URLs in its functionality:\n\n1. Displays Pop3 and IMAP instructions hosted on actor-controlled server\n2. Attempts logins to legitimate webmail portal via the native URL\n\nAn extended sequence of the observed script’s actions is as follows:\n\n1. Establishes the malicious server domain for the cache of stolen user values\n2. References a targeted account name\n3. Gets date and time\n\n\n-----\n\n4. Gets account name variables\n5. Sets time out window at 1000s\n6. Function to send credentials \"on click\"\n\n1. Sends username and password in URI encoded fashion\n2. If password fails with a length of 0 (AKA no password), the script prompts user with:\n\n\"The username or password is incorrect. Verify that CAPS LOCK is not on, and\nthen retype the current username and password.\"; return;\"\n3. The script then logs the username, the password, and the CSRF token from the\n\nweb request response.\n7. The JavaScript again attempts to identify an unsuccessful login, displays an actor\npopulated error message and posts the logged CSRF token to the legitimate web mail\nserver (login attempt)\n\n1. If that attempt fails, the script again attempts to post to the targeted server and\n\nfetch an ElementbyID \"lic34yo8o\" and remove this element tagged \"body\" in the\nresponse\n2. It then again attempts to save the “accountname” variable, username variable, and\n\npassword variable.\n8. The script attempts to login to the legitimate webmail portal using custom hardcoded URI\n\nstructures that appear to be unique to the targeted domain and appends a username,\npassword, and CSRF token to the URI structures which were previously captured.\n9. The script also has a function to login with stolen credential and token content.\n10. The script has a function to show Zimbra Pop3 and IMAP login information page hosted\n\non actor-controlled infrastructure.\n11. The script has a function to show the legitimate webmail portal login window.\n12. The script has a function to \"initLoginField\" which appears to input the username and\n\naccount name to the legitimate webmail login window.\n13. The script has a function to logoff of the mail server and attempt to retrieve the CSRF\n\ntoken at logout, which is then sent to an actor-controlled server.\n14. The script has a function to retrieve the CSRF token.\n15. The script has a function to get the CSRF token from string utilizing the DOMParser\n\nfunction that parses the element from the JavaScript request response document.\n\n\n-----\n\n_Figure 5. CSRF JavaScript snippet detailing methods of stealing CSRF token._\n\n## Advanced Capabilities May be Ideal, but When in Doubt, Persistence is Key\n\nTA473’s persistent approach to vulnerability scanning and exploitation of unpatched\nvulnerabilities impacting publicly facing webmail portals is a key factor in this actor’s success.\nThe group’s focus on sustained reconnaissance and painstaking study of publicly exposed\nwebmail portals to reverse engineer JavaScript capable of stealing usernames, passwords,\nand CSRF tokens demonstrates its investment in compromising specific targets, in this case\nthe European government sector. Rather than developing a one size fits all tools and payloads\napproach, TA473 invests time and resources to compromise specific entities with each\nJavaScript payload being custom for the targeted webmail portal.\n\n\n-----\n\nProofpoint researchers strongly recommend patching all versions of Zimbra Collaboration used\nin publicly facing webmail portals, especially among European government entities.\nAdditionally, restricting resources on publicly facing webmail portals from the public internet is\nhighly recommended to prevent groups like TA473 from reconning and engineering custom\nscripts capable of stealing credentials and logging in to users’ webmail accounts. While TA473\ndoes not lead the pack in sophistication among APT threats targeting the European cyber\nlandscape, they demonstrate focus, persistence, and a repeatable process for compromising\ngeopolitically exposed targets. Like a Vivern in medieval winter, despite having only two legs\nand a pair of wings, this is likely a threat that will persist year-round.\n\n## Indicators of Compromise (IOCs) \n\n\nIOC Type of\nIOC\n\n\nDescription\n\n\nhxxps://oscpavanguard[.]com/asn15180YHASIFHOP_<redacted>_ASNfas21/auth.js\n\nhxxps://oscpavanguard[.]com/settingPopImap/SettingupPOPandIMAPaccounts.html\n\nhxxps://troadsecow[.]com/cbzc.policja.gov.pl\n\nhxxps://bugiplaysec[.]com/mgu/auth.js\n\nhxxps://nepalihemp[.]com/assets/img/images/623930va\n\nhxxps://ocs-romastassec[.]com/redirect/?id=[target specific ID]&url=\n\n[Base64 Encoded Hyperlink URL hochuzhit-com.translate.goog/?\n_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en-US&x_tr_pto=wapp]\n\nhxxps://ocspdep[.]com/inotes.sejm.gov.pl?id=[Target Specific SHA256\nHash]\n\nocspdep[.]com\n\nbugiplaysec[.]com\n\noscp-avanguard[.]com\n\ntroadsecow[.]com\n\nnepalihemp[.]com\n\n## ET Signatures\n\n2034117 – ET TROJAN Wintervivern Activity M5 (GET)\n\n\nURLs Observed\npayload\ndelivery\nURLs\n\nDomain C2\nDomains\n\n\n-----\n\n2034116 – ET TROJAN Wintervivern Activity M4 (GET)\n\n2034115 – ET TROJAN Wintervivern Retrieving Commands\n\n2034109 – ET TROJAN Wintervivern Activity (GET) M3\n\n2034108 – ET TROJAN Wintervivern Checkin\n\n2034107 – ET TROJAN Wintervivern Retrieving Task­\n\n2034106 – ET TROJAN Wintervivern Activity M2 (GET)\n\n2034105 – ET TROJAN Wintervivern Activity (GET)\n\n[Previous Blog Post](https://www.proofpoint.com/us/blog/threat-insight/fork-ice-new-era-icedid)\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-30 - Exploitation is a Dish Best Served Cold- Winter Vivern Uses Known Zimbra Vulnerability to Target Webmail Portals of NATO-Aligned Governments in Europe.pdf"
    ],
    "report_names": [
        "2023-03-30 - Exploitation is a Dish Best Served Cold- Winter Vivern Uses Known Zimbra Vulnerability to Target Webmail Portals of NATO-Aligned Governments in Europe.pdf"
    ],
    "threat_actors": [
        {
            "id": "23226bab-4c84-4c65-a8d1-7ac10c44b172",
            "created_at": "2023-04-27T02:04:45.463683Z",
            "updated_at": "2025-03-27T02:02:10.213835Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "TA473",
                "TAG-70",
                "UAC-0114",
                "UNC4907"
            ],
            "source_name": "ETDA:Winter Vivern",
            "tools": [
                "APERETIF"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6704f3c-15d7-4e1d-b5a8-e33e7e9bd925",
            "created_at": "2023-11-04T02:00:07.660461Z",
            "updated_at": "2025-03-27T02:00:03.14916Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "UAC-0114",
                "TA473",
                "TAG-70",
                "TA-473"
            ],
            "source_name": "MISPGALAXY:Winter Vivern",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a20598c1-894c-4173-be6e-64a1ce9732bd",
            "created_at": "2024-11-01T02:00:52.652891Z",
            "updated_at": "2025-03-27T02:00:55.484584Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "Winter Vivern",
                "TA473",
                "UAC-0114"
            ],
            "source_name": "MITRE:Winter Vivern",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1680660499,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1680512369,
    "ts_modification_date": 1680512369,
    "files": {
        "pdf": "https://archive.orkl.eu/a244523b17c7e10b942c2d7de537699f70075884.pdf",
        "text": "https://archive.orkl.eu/a244523b17c7e10b942c2d7de537699f70075884.txt",
        "img": "https://archive.orkl.eu/a244523b17c7e10b942c2d7de537699f70075884.jpg"
    }
}