{
    "id": "3d59bc3e-a12e-488e-ae0e-8a64ccc6e070",
    "created_at": "2022-10-25T16:48:16.87432Z",
    "updated_at": "2025-03-27T02:13:58.842948Z",
    "deleted_at": null,
    "sha1_hash": "76c546c2e97b8e9c430d9a0678c23784f175d9d2",
    "title": "",
    "authors": "",
    "file_creation_date": "2014-11-13T13:45:08Z",
    "file_modification_date": "2014-11-13T13:48:14Z",
    "file_size": 2375136,
    "plain_text": "###### A TrendLabs[SM] Report\n\n\n# Targeted Attack Trends  in Asia-Pacific\n\n\n-----\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for\ngeneral information and educational\npurposes only. It is not intended and should\nnot be construed to constitute legal advice.\nThe information contained herein may not\nbe applicable to all situations and may not\nreflect the most current situation. Nothing\ncontained herein should be relied on or\nacted upon without the benefit of legal\nadvice based on the particular facts and\ncircumstances presented and nothing\nherein should be construed otherwise.\nTrend Micro reserves the right to modify\nthe contents of this document at any time\nwithout prior notice.\n\nTranslations of any material into other\nlanguages are intended solely as a\nconvenience. Translation accuracy is not\nguaranteed nor implied. If any questions\narise related to the accuracy of a translation,\nplease refer to the original language official\nversion of the document. Any discrepancies\nor differences created in the translation are\nnot binding and have no legal effect for\ncompliance or enforcement purposes.\n\nAlthough Trend Micro uses reasonable\nefforts to include accurate and up-todate information herein, Trend Micro\nmakes no warranties or representations of\nany kind as to its accuracy, currency, or\ncompleteness. You agree that access to\nand use of and reliance on this document\nand the content thereof is at your own\nrisk. Trend Micro disclaims all warranties of\nany kind, express or implied. Neither Trend\nMicro nor any party involved in creating,\nproducing, or delivering this document\nshall be liable for any consequence, loss, or\ndamage, including direct, indirect, special,\nconsequential, loss of business profits, or\nspecial damages, whatsoever arising out of\naccess to, use of, or inability to use, or in\nconnection with the use of this document,\nor any errors or omissions in the content\nthereof. Use of this information constitutes\nacceptance for use in an “as is” condition.\n\n\n## Contents\n\n#### Introduction\n\n 1\n\n THREAT LANDSCAPE\n\n 3\n\n TARGETED ATTACK CAMPAIGN PROFILES\n\n 10\n\n Featured Campaigns: Siesta and ESILE\n\n 11\n\n DEFENDING NETWORKs AGAINST\n TARGETED ATTACKS\n\n 14\n\n\n-----\n\n## Introduction\n\n###### Targeted attacks or threats that compromise specifically\n\n chosen targets to steal confidential information can affect\n\n organizations in various ways, ranging from brand damage\n\n to actual revenue loss. A recent Harvard Business Review\n\n study revealed that the top 3 effects of targeted attacks were\n\n potential brand damage, damage to professional reputation,\n\n and potential loss of intellectual property.[1]\n\n We continued to monitor targeted attack campaigns and\n\n trends in the Asia-Pacific region in the first half of 2014. We\n\n saw technique enhancements even though threat actors\n\n continued to exploit old vulnerabilities in various software\n\n and applications. Emails were still the most-used infection\n\n vector when instigating targeted attacks. Watering-hole\n\n attacks were also seen, just as we predicted would happen\n\n this year.[2]\n\n\n-----\n\n#### No one-size-fits-all solution exists when dealing with targeted attacks. Every network is different, which means each is configured differently. IT administrators need to fully understand the networks they manage and implement the necessary defense measures that fit their environments.\n\n##### —Spencer Hsieh, Threat Researcher\n\n\n-----\n\n## Threat Landscape\n\n\n### Refined Targeted Attack Tactics to Better Evade Detection\n\nOne of the primary goals of targeted attacks is to exfiltrate organizations’ crown jewels or confidential company\n\ndata. Based on the previously cited Harvard Business Review study, the most commonly stolen types of data\n\nwere personally identifiable information (PII) (28%), authentication credentials (21%), intellectual property\n\n(20%), and other sensitive corporate/organizational data (16%).\n\nIn the first haft of 2014, threat actors continued to refine their tactics to stay under the radar while stealing\n\ninformation. The following are just some of the notable techniques they used:\n\n**•** **Cloud-based file storage platform abuse: This June, threat actors used a Type II PlugX remote**\n\naccess tool (RAT) variant to be able to use Dropbox as a download site for a backdoor’s command-and\ncontrol (C&C) settings.[3] Abusing the cloud-based file storage platform allowed threat actors to better\n\nevade detection despite the implementation of network traffic monitoring. Even though this was not\n\nthe first time attackers abused Dropbox, it was the first time we saw them use the platform as an update\n\ndownload site for their backdoor’s C&C settings.[4]\n\n\n-----\n\np\n\n**•** **Windows® PowerShell framework abuse: Abusing the Windows PowerShell task automation and**\n\nconfiguration management framework is not a commonly seen targeted attack technique.[5] But in a case\n\nseen this May, a malicious .LNK file email attachment we detect as LNK_PRESHIN.JTT had Windows\n\nPowerShell commands that enabled it to download files and bypass execution policies to execute the files\n\ndownloaded.[6] It particularly downloaded another malicious PowerShell scripting file that downloaded\n\nthe final backdoor payload.\n\nEven though the PowerShell framework is only available on computers running Windows 7 and newer\n\nOSs, the malware used in the attack also ran on computers running older OSs such as Windows XP SP2,\n\nWindows Server 2003, and Windows Vista, if these had PowerShell installed.\n\n**•** **Sleep timer feature abuse: Apart from legitimate platform and framework abuse, we also saw a**\n\nbackdoor take advantage of built-in OS features such as sleep timer in the Siesta Campaign.[7] The said\n\nbackdoor could accept a sleep command that allowed it to remain dormant for varying periods of time\n\nbefore regaining access to C&C servers, most likely to evade detection.\n\n### Spear-Phishing Emails, Still Most Favored Network Infiltrators\n\n\nMost of the targeted attacks seen in the region during\n\nthe first half of 2014 used spear-phishing emails as\n\ninfection vector. In fact, almost 80% of the targeted\n\nattack malware arrived via email. Typically sent to\n\nemployees in target organizations, spear-phishing\n\nemails convince recipients to either click a malicious\n\nlink or download and execute a malicious file.\n\nContextually relevant subjects are always used. One\n\nsuch attack used news of Lao People’s Democratic\n\nRepublic’s Deputy Prime Minister’s death as lure.[8]\n\nIt bore the subject, “BREAKING: Plane Crash in\n\nLaos Kills Top Government Officials.”\n\n\nThe spear-phishing email used in this attack, as\n\nin similar ones, had a file attachment that served\n\nas malware carrier. Apart from spear-phishing\n\nemails, threat actors also compromise websites via\n\nwatering-hole techniques to get in to their target\n\nnetworks. A typical watering-hole attack involves\n\nthree basic steps—guessing what websites targets\n\nfrequently visit, infecting these with malware, and\n\nwaiting for targets to visit them and infect their\n\ncomputers—essentially triggering the targeted\n\nattack cycle.[9]\n\n\n-----\n\np\n\n### Microsoft office files used as attachments\n\nData from the first half of 2014 shows that Microsoft Office files are the most commonly used attachments.\n\nThis is not a surprise, as these are widely used within any type of organization. In addition, many organizations\n\nare not able to regularly patch or upgrade their versions of Microsoft Office, leaving many exploitable\n\nvulnerabilities for an attacker to target.\n\n60%\n\n57%\n\nMicrosoft Office\n\nRAR\n\nMicrosoft Office-related file types were\ncommonly used by threat actors.\n\n7-ZIP\n\n\n30%\n\n0\n\n\nZIP\n\nPDF\n\nMIME\n\nJPEG\n\n\n_Commonly seen email file attachments used in targeted attacks_\n\n### New and Old Exploits Figured in the Threat Landscape\n\nZero-day and tried-and-tested exploits both figured in the targeted attack landscape. As in the latter half of\n\n2013, threat actors continued to exploit a bug in Windows Common Controls (CVE-2012-0158) and addressed\n\nby Microsoft Security Bulletin MS12-027.[10, 11] The PLEAD campaign against Taiwan ministries, in particular,\n\nwas such an attack.[12]\n\nExploiting old vulnerabilities still worked because some IT administrators sometimes forgo the application of\n\nsecurity fixes to avoid disrupting critical business operations. Another reason could be patch testing prior to\n\nactual implementation to ensure that fixes would not have adverse effects on corporate environments.\n\n\n-----\n\n80%\n\n40%\n\n0\n\n\np\n\nCVE-2012-0158\nremained the threat\nactor favorite\nvulnerability target.\n\n_Most commonly exploited vulnerabilities related to targeted attacks_\n\n\nCVE-2009-3129\n\nCVE-2010-0188\n\nCVE-2010-3333\n\nCVE-2012-0158\n\nCVE-2012-1856\n\nCVE-2013-2729\n\nCVE-2013-5990\n\nCVE-2014-1761\n\n\nA zero-day vulnerability in Windows XP and Windows Server® 2003 was also exploited in a targeted attack\n\nthis April prior to the end of support for the OSs.[13] The said zero-day bug was patched via MS14-002 a couple\n\nof days after.[14]\n\nThe threat actors behind the Taidoor Campaign, active since 2008, took advantage of a Microsoft[TM] Office\n\nvulnerability this May.[15] Likewise, a vulnerability in Ichitaro (CVE-2013-5990), a popular word processor in\n\nJapan, was also exploited in the ANTIFULAI Campaign.[16]\n\n\n###### Microsoft Office Adobe Reader\n\n Ichitaro\n\n\n###### 53% 46%\n\n 1%\n\n\nThreat actors favored Microsoft\nOffice, Adobe Reader, and Ichitaro\nas software vulnerability exploitation\ntargets.\n\n\n_Most commonly exploited software_\n\n_related to targeted attacks_\n\n\n-----\n\np\n\n### Documents as Attachment to Targeted Attack Emails\n\nDocuments (.DOC and .RTF files) unsurprisingly work as targeted attack payload carriers, as these commonly\n\nchanged hands in any kind of organization. Unsuspecting recipients often execute attacks’ final payloads\n\nbecause they believe they are opening legitimate files from trusted senders.\n\n50%\n\nCAB\n\nCOM\n\nDLL (32-bit)\n\nDLL (64-bit)\n\nDOC\n\nThreat actors used exploits\n\nEXE (32-bit)\n\n\n25%\n\n0\n\n\nEXE (64-bit)\n\nLNK\n\nMSIL\n\nPDF\n\nRTF\n\nXLS\n\nOthers\n\n\n_Most commonly used file types in targeted attacks_\n\nMost of the malware used in targeted attacks were Trojans or Trojan spyware (53%), followed by backdoors\n\n(46%). Backdoors typically aid in establishing C&C communications and executing remote commands while\n\nTrojans and Trojan spyware aid in downloading the final payload and exfiltrating data.\n\n\n###### Trojan/Trojan spyware Backdoor Hacktool\n\n\n###### 53% 46% 1%\n\n\nBackdoors and Trojans or Trojan\nspyware were the most-used malware\ntypes in targeted attacks.\n\n\n_Most common malware types used in_\n\n_targeted attacks_\n\n\n-----\n\np\n\nThe most-used malware in targeted attacks in the first half of 2014 include PASSVIEW, RIMAGE, XTREME,\n\nDarkComet, and HCOREPWSTL.[17, 18, 19] The DarkComet RAT was used in targeted attacks back in 2012.[20] It\n\nspread through Skype chats. The Xtreme RAT was also used in targeted attacks against the U.S., Israeli, and\n\nother governments that same year.[21]\n\nThe following charts show the PASSVIEW- and DarkComet-related victim locations based on the malware\n\nused. For both malware, most victims are concentrated in the Asia-Pacific region.\n\n\n###### Japan\n\n India\n\n United States\n\n China\n\n Italy\n\n Others\n\n\n###### 16%\n\n 16%\n\n 12%\n\n 9%\n\n 6%\n\n 41%\n\n\nJapan and India were most affected\nby PASSVIEW\n\n\n_Countries most affected by PASSVIEW_\n\n_Countries most affected by DarkComet_\n\n\n###### Taiwan\n\n Japan\n\n United States\n\n Vietnam\n\n\n###### 50%\n\n 35%\n\n 14%\n\n 1%\n\n\nHalf of DarkComet’s victims were\nfrom Taiwan.\n\n\n-----\n\np\n\n### Threat Actors Chose The Right Attack Tools for Uninihibited Communication\n\nAs part of our continued monitoring of targeted attacks, we also took a look at certain campaigns. We\n\nidentified endpoints that communicated with C&C servers that were managed by threat actors.\n\n\n###### Taiwan Japan United States\n Indonesia\n China\n India\n Malaysia\n Bangladesh\n Philippines\n Canada\n Others\n\n\n###### 46% 20% 12%\n 11%\n 8%\n 6%\n 4%\n 2%\n 2%\n 2%\n 13%\n\n\n_Targeted attack victim locations_ Almost half of the endpoints that\naccessed C&C servers were located in\nTaiwan.\n\n\n###### United States Taiwan China\n\n Hong Kong Germany Others\n\n\n###### 48% 13% 12%\n\n 9% 5% 34%\n\n\n_Targeted-attack-related C&C server locations_\n\n\nAlmost half of the C&C servers we\nmonitored were located in the United\nStates (top C&C server location). Note,\nhowever, that this does not mean that\nthe threat actors were from there. It is,\nafter all, possibe for them to remotely\naccess and manage their servers.\n\n\n-----\n\n## Targeted\n Attack Campaign\n Profiles\n\n\nThe following were some of the active targeted attack campaigns we observed targeting Asia-Pacific countries\n\nin the first half of 2014:\n\n**•** **IXESHE: Active since at least 2009, this campaign targeted East Asian governments, Taiwanese**\n\nelectronics manufacturers, and a telecommunications company.[22] It is notable for its use of compromised\n\nservers for command and control to evade detection.\n\n**•** **PLEAD: This campaign has become well-known for its use of the right-to-left override (RTLO) technique**\n\nto make targets think they were opening a PowerPoint® file instead of a malicious .SCR file.\n\n**•** **Taidoor: Active since March 2009, the threat actors behind this campaign used a seemingly harmless**\n\ndocument that when opened actually executed a malicious file in the background.[23] It also used malicious\n\n.DOC files to exploit CVE-2012-0158, one of the most commonly exploited bugs up to this day.[24]\n\n**•** **ANTIFULAI: This campaign targets government agencies and privately owned companies in Japan**\n\nby exploiting a bug in Ichitaro, which allowed the execution of malicious arbitrary code. The malware\n\nrelated to this campaign successfully hid its C&C server URLs to evade detection.\n\n\n-----\n\n### Actors Behind the Siesta Campaign, Not Sleepy at All\n\nThe Siesta (Spanish term for “short nap”)\n\nCampaign was so named due to its final payload’s\n\nability to receive sleep commands, which allowed\n\nit to stay dormant for various periods of time and\n\nin turn evade detection. It reportedly targeted\n\norganizations from the following industries:\n\n- Consumer goods and services\n\n- Energy\n\n- Finance\n\n- Health care\n\n- Media and telecommunications\n\n- Public administration\n\n- Security and defense\n\n- Transport and traffic\n\nLike most targeted attacks, the threat actors\n\nbehind the Siesta Campaign sent emails to chosen\n\nexecutives in specific organizations using fake\n\nemail addresses of supposed colleagues. They did\n\nnot, like so many attacks, use an attachment. They\n\ninstead used a legitimate-looking download link\n\n_(http://{malicious domain}/ {organization name}_\n\n_/ {legitimate archive name}.zip) to compromise_\n\ntheir chosen network targets.\n\n\n## Featured Campaigns:\n Siesta and\n ESILE\n\n\n-----\n\np\n\nThe .ZIP file downloaded contains an executable file we detect as TROJ_SLOTH, a supposed .PDF\n\nfile.[25] When executed, SLOTH opens or drops a valid .PDF file to hide malicious activity running in the\n\nbackground. It has a backdoor component we detect as BKDR_SLOTH.B, which accesses the C&C server link,\n\n_http://www.micro{BLOCKED}.com/index.html.[26]_\n\nThe said backdoor waits for the following commands:\n\n**•** **sleep: Tells the malware to sleep for a certain period of time. The sample we analyzed had the command,**\n\n“sleep:120.” This told the malware to wait two hours before accessing the C&C server.\n\n**•** **download: Tells the malware to download and execute a file from a certain URL. This takes the format,**\n\n_<download_url>._\n\nAnother SLOTH variant we detect as BKDR_SLOTH.A was used in the Siesta Campaign.[27] This variant,\n\nhowever, accessed a different C&C server, skys{BLOCKED}com.\n\nThe following table lists the commands the two backdoor variants were programmed to receive and follow.\n\nBKDR_SLOTH.A BKDR_SLOTH.B\n\n**run 1 - Open a remote shell** **sleep: - Sleep for specified number of**\nminutes\n\n**run 2 - Pipe shell commands from URL 1** **download: - Download and execute**\nanother executable file from the C&C\nserver\n\n**run3 - Pipe shell commands from URL 2**\n\n**http - Pipe shell commands from the C&C server**\n\n**x**   - Sleep for a specified number of minutes\n\nDigging deeper revealed that the threat actors behind the Siesta Campaign used the name “Li Ning” to register\n\nthe C&C server, sky{BLOCKED}.com. Li Ning supposedly used the email address, xiaoma{BLOCKED}@163.\n\n_com. And that apart from the C&C server link, the same actor had around 79 more registered domains. It is_\n\nsafe to assume that “Li Ning” is a fake name.\n\n|BKDR_SLOTH.A|BKDR_SLOTH.B|\n|---|---|\n|run 1 - Open a remote shell|sleep: - Sleep for specified number of minutes|\n|run 2 - Pipe shell commands from URL 1|download: - Download and execute another executable file from the C&C server|\n|run3 - Pipe shell commands from URL 2||\n|http - Pipe shell commands from the C&C server||\n|x - Sleep for a specified number of minutes||\n\n\n-----\n\np\n\n### The ESILe Campaign Continued to Target Asia/Pacific Governments\n\nThe threat actors behind the ESILE Campaign continued to set their sights on governmental institutions\n\nin the Asia/Pacific region. They used backdoors we detect as BKDR_ESILE variants to remotely execute\n\nmalicious commands on compromised networks.[28]\n\nFurther investigation revealed that ESILE variants exploited the same bug that Taidoor malware did, CVE\n2012-0158. Note that Microsoft has patched this vulnerability in 2012. Unlike the Taidoor malware, however,\n\nESILE variants could modify the document template to have varying payloads. This targeted attack technique\n\nhas been used by other malware such as FARFLI and HORSMY. As in most targeted attack cases, ESILE\n\narrived via spear-phishing emails sporting varying social engineering lures that had to do with health care\n\nand taxes, among others. Vague filenames such as “Attachment” have also been used.\n\nProtecting networks against targeted attacks strongly calls for building threat intelligence. This can include\n\nlists of known indicators of compromise (IoCs) and C&C servers that can serve as reference to determine if an\n\norganization’s network has already been compromised, thus breaking the targeted attack chain.\n\nIT administrators would do well to check for the following known ESILE Campaign components to protect\n\ntheir networks:\n\n- Strings:\n\n_•_ _EliseDLL.pdb_\n\n_•_ _EliseDLL_\n\n- BLOB file component that is typically dropped as {random}.CAB\n\n- C&C HTTP requests that match the regular expression (regex), (POST|GET)\\s /[a-f0-9]{10}/page_[0-9]\n\n_{10}.html_\n\nPart of a bigger campaign known as “APT0LSTU,” the ESILE and EVORA Campaigns used RATs to establish\n\ncommand and control. Our findings showed that the group behind these (LStudio) had 71 C&C servers in\n\n10 countries. The ESILE and EVORA malware had the following PDB reference strings inside the malicious\n\nbinaries:\n\n_•_ _d:\\lstudio\\projects\\lotus\\evora\\Release\\EvoraDLL\\i386\\EvoraDLL.pdb_\n\n_•_ _D:\\work\\nbkkkk\\Lotus\\Elise\\EliseDLL\\Release\\EliseDLL.pdb_\n\n\n-----\n\n## Defending Networks Against\n Targeted Attacks\n\n\nProtecting networks against targeted attacks means busting common misconceptions about them. One such\n\nmisconception is that targeted attacks are one-time efforts. The truth: Targeted attacks are well-planned and\n\ncan be launched several times until they successfully compromise intended network targets.\n\nIT administrators are strongly advised to look for the following signs of targeted attacks as countermeasure:[29]\n\n- Search for injected Domain Name System (DNS) records as attackers alter DNS settings to make sure\n\ntheir malicious activity is not yet being detected by already-installed solutions.\n\n- Check accounts for failed or irregular log-in attempts because these could indicate lateral movement in\n\ntarget networks, given the fact that threat actors often brute-force their way into administrator accounts.\n\n- Check for unknown large files as these may hold stolen data ready for exfiltration.\n\n- Monitor network logs and protocols to check for abnormal connections made.\n\n- Check abnormal increases in individual employees’ email activity logs.\n\nKeep in mind that a one-size-fits-all solution to protect against targeted attacks does not exist. Organizations\n\nneed to implement what we call a “Custom Defense Strategy,” which uses advanced threat detection\n\ntechnologies and shared IoCs and intelligence to detect, analyze, and respond to attacks that are invisible to\n\nstandard security products.[30]\n\n\n-----\n\np\n\n## REFERENCES\n\n1. Harvard Business School Publishing. (2014). “Aggressive and Persistent: Using Frameworks to Defend Against Cyber Attacks.”\n\nLast accessed September 16, 2014, http://campaign.trendmicro.com/forms/Harvard_Business_Review_Report_1687.\n\n2. Trend Micro Incorporated. (2013). Threat Encyclopedia. “Blurring Boundaries: Trend Micro Security Predictions for 2014 and\n\nBeyond.” Last accessed September 16, 2014, http://about-threats.trendmicro.com/us/security-predictions/2014/blurring\nboundaries/.\n\n3. Maersk Menrige. (June 25, 2014). _TrendLabs Security Intelligence Blog. “PlugX RAT with ‘Time Bomb’ Abuses Dropbox for_\n\nCommand-and-Control Settings.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/\n\nplugx-rat-with-time-bomb-abuses-dropbox-for-command-and-control-settings/.\n\n4. Softpedia. (July 12, 2013). Softpedia. “Experts Reveal How Chinese APT Hackers Abuse Dropbox and WordPress.” Last accessed\n\nSeptember 17, 2014, http://news.softpedia.com/news/Experts-Reveal-How-Chinese-APT-Hackers-Abuse-Dropbox-and\nWordPress-367652.shtml.\n\n5. Maersk Menrige. (May 29, 2014). TrendLabs Security Intelligence Blog. “Black Magic: Windows PowerShell Used Again in New\n\nAttack.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/black-magic-windows\npowershell-used-again-in-new-attack/.\n\n6. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “LNK_PRESHIN.JTT.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/LNK_PRESHIN.JTT.\n\n7. Maharlito Aquino. (March 6, 2014). _TrendLabs Security Intelligence Blog. “The Siesta Campaign: A New Targeted Attack_\n\nAwakens.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/the-siesta-campaign\na-new-targeted-attack-awakens/.\n\n8. Maersk Menrige. (June 17, 2014). TrendLabs Security Intelligence Blog. “Template Document Exploit Found in Several Targeted\n\nAttacks.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/template-document\nexploit-found-in-several-targeted-attacks/.\n\n9. Wikimedia Foundation Inc. (August 22, 2014). _Wikipedia. “Watering Hole.” Last accessed September 17, 2014,_\n\nhttp://en.wikipedia.org/wiki/Watering_Hole.\n\n10. The MITRE Corporation. (2014). CVE. “CVE-2012-0158.” Last accessed September 17, 2014, http://www.cve.mitre.org/cgi-bin/\n\ncvename.cgi?name=CVE-2012-0158.\n\n11. Microsoft. (2014). _Security TechCenter. “Microsoft Security Bulletin MS12-027 – Critical.” Last accessed September 17, 2014,_\n\nhttps://technet.microsoft.com/en-us/library/security/ms12-027.aspx.\n\n12. Kervin Alintanahin. (May 23, 2014). _TrendLabs Security Intelligence Blog. “PLEAD Targeted Attacks Against Taiwanese_\n\nGovernment Agencies.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/plead\ntargeted-attacks-against-taiwanese-government-agencies-2/.\n\n13. Trend Micro Incorporated. (January 6, 2014). _TrendLabs Security Intelligence Blog._ “Recent Windows Zero-Day Targeted\n\nEmbassies, Used Syria-Related Email.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security\nintelligence/recent-windows-zero-day-targeted-embassies-used-syria-related-email/.\n\n14. Microsoft. (2014). Security TechCenter. “Microsoft Security Bulletin MS14-002 – Important.” Last accessed September 17, 2014,\n\nhttps://technet.microsoft.com/en-us/library/security/ms14-002.aspx.\n\n\n-----\n\np\n\n15. Trend Micro Incorporated. (May 12, 2014). TrendLabs Security Intelligence Blog. “Targeted Attack Against Taiwanese Agencies\n\nUsed Recent Microsoft Word Zero-Day.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security\nintelligence/targeted-attack-against-taiwanese-agencies-used-recent-microsoft-word-zero-day/.\n\n16. Maersk Menrige. (June 4, 2014). _TrendLabs Security Intelligence Blog. “ANTIFULAI Targeted Attack Exploits Ichitaro_\n\nVulnerability.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/antifulai-targeted\nattack-exploits-ichitaro-vulnerability/.\n\n17. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “HKTL_PASSVIEW.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/HKTL_PASSVIEW.\n\n18. Trend Micro Incorporated. (2014). _Threat Encyclopedia._ “BKDR_XTREME.SMUM.” Last accessed September 17, 2014,\n\nhttp://about-threats.trendmicro.com/us/malware/BKDR_XTREME.SMUM.\n\n19. Trend Micro Incorporated. (2014). _Threat_ _Encyclopedia._ “DARKCOMET.” Last accessed September 17, 2014,\n\nhttp://about-threats.trendmicro.com/us/malware/DARKCOMET.\n\n20. Kevin Stevens and Nart Villeneuve. (February 23, 2014). _TrendLabs Security Intelligence Blog._ “DarkComet Surfaced in\n\nthe Targeted Attacks in Syrian Conflict.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security\nintelligence/darkcomet-surfaced-in-the-targeted-attacks-in-syrian-conflict/.\n\n21. Nart Villeneuve. (November 14, 2012). TrendLabs Security Intelligence Blog. “New Xtreme RAT Attacks U.S., Israel, and Other\n\nForeign Governments.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/new\nxtreme-rat-attacks-on-usisrael-and-other-foreign-governments/.\n\n22. David Sancho, Jessa dela Torre, Matsukawa Bakuei, Nart Villeneuve, and Robert McArdle. (2012). _Trend Micro Security_\n\n_Intelligence._ “IXESHE: An APT Campaign.” Last accessed September 17, 2014, http://www.trendmicro.com/cloud-content/us/\n\npdfs/security-intelligence/white-papers/wp_the_taidoor_campaign.pdf.\n\n23. Trend Micro Threat Research Team. (2012). Trend Micro Security Intelligence. “The Taidoor Campaign: An In-Depth Analysis.”\n\nLast accessed September 17, 2014, http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp_\n\nixeshe.pdf.\n\n24. The MITRE Corporation. (2014). _CVE._ “CVE-2012-0158.” Last accessed September 17, 2014,\n\nhttp://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0158.\n\n25. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “TROJ_SLOTH.A.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/TROJ_SLOTH.A.\n\n26. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “BKDR_SLOTH.B.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/BKDR_SLOTH.B.\n\n27. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “BKDR_SLOTH.A.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/BKDR_SLOTH.A.\n\n28. Trend Micro Incorporated. (2014). _Threat Encyclopedia. “BKDR_ESILE.SMEX.” Last accessed September 17, 2014,_\n\nhttp://about-threats.trendmicro.com/us/malware/BKDR_ESILE.SMEX.\n\n29. Ziv Chang. (August 14, 2014). _TrendLabs Security Intelligence Blog. “7 Places to Check for Signs of a Targeted Attack in Your_\n\nNetwork.” Last accessed September 17, 2014, http://blog.trendmicro.com/trendlabs-security-intelligence/7-places-to-check-for\nsigns-of-a-targeted-attack-in-your-network/.\n\n30. Trend Micro Incorporated. (2014). Trend Micro. “Trend Micro Custom Defense: Proven Protection Against Targeted Attacks and\n\nAdvanced Persistent Threats.” Last accessed September 17, 2014, http://www.trendmicro.com/us/business/cyber-security/index.\n\nhtml.\n\n\n-----\n\nCreated by:\n\nGlobal Technical Support & R&D Center of TREND MICRO\n\nTrend Micro Incorporated, a global leader in security software and\nsolutions, strives to make the world safe for exchanging digital\ninformation. For more information, visit www.trendmicro.com.\n\n©2014 Trend Micro, Incorporated. All rights reserved. Trend Micro and\nthe Trend Micro t-ball logo are trademarks or registered trademarks of\nTrend Micro, Incorporated. All other product or company names may\nbe trademarks or registered trademarks of their owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/threat-reports/rpt-1h-2014-targeted-attack-trends-in-asia-pacific.pdf"
    ],
    "report_names": [
        "rpt-1h-2014-targeted-attack-trends-in-asia-pacific.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9fa9633-dfd1-458d-84ce-cc36dcdc7ce4",
            "created_at": "2022-10-25T16:07:24.188897Z",
            "updated_at": "2025-03-27T02:02:10.136127Z",
            "deleted_at": null,
            "main_name": "Siesta",
            "aliases": [],
            "source_name": "ETDA:Siesta",
            "tools": [
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "Poison Ivy",
                "SPIVY",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71b19e59-b5f7-4bc6-816d-194be0f02af0",
            "created_at": "2022-10-25T16:07:24.301036Z",
            "updated_at": "2025-03-27T02:02:10.165121Z",
            "deleted_at": null,
            "main_name": "Taidoor",
            "aliases": [
                "Budminer",
                "Earth Aughisky"
            ],
            "source_name": "ETDA:Taidoor",
            "tools": [
                "Dripion",
                "Masson",
                "Taidoor",
                "simbot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a1ce86c2-3efc-4115-a85e-92c5fa461838",
            "created_at": "2022-10-25T16:47:55.561071Z",
            "updated_at": "2025-03-27T02:05:17.261424Z",
            "deleted_at": null,
            "main_name": "BRONZE ELGIN",
            "aliases": [
                "Lotus Blossom ",
                "Lotus Panda ",
                "Lstudio",
                "Spring Dragon ",
                "CTG-8171 "
            ],
            "source_name": "Secureworks:BRONZE ELGIN",
            "tools": [
                " Lzari",
                "Elise"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d18fe42c-8407-4f96-aee0-a04e6dce219a",
            "created_at": "2023-01-06T13:46:38.275292Z",
            "updated_at": "2025-03-27T02:00:02.79092Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "Calc Team",
                "IXESHE",
                "BRONZE GLOBE",
                "BeeBus",
                "DynCalc",
                "DNSCalc",
                "Crimson Iron",
                "NUMBERED PANDA",
                "TG-2754",
                "Group 22"
            ],
            "source_name": "MISPGALAXY:APT12",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f9bb42e1-65d6-444e-8c63-21c2605b49e0",
            "created_at": "2023-01-06T13:46:38.887429Z",
            "updated_at": "2025-03-27T02:00:02.943493Z",
            "deleted_at": null,
            "main_name": "Siesta",
            "aliases": [],
            "source_name": "MISPGALAXY:Siesta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6a660ea2-1118-404a-9f8f-f0d6a1e9f184",
            "created_at": "2022-10-25T15:50:23.685924Z",
            "updated_at": "2025-03-27T02:00:55.52357Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "APT12",
                "IXESHE",
                "DynCalc",
                "Numbered Panda",
                "DNSCALC"
            ],
            "source_name": "MITRE:APT12",
            "tools": [
                "Ixeshe",
                "RIPTIDE",
                "HTRAN"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "50bd4a6c-7542-4bdd-8b37-ab468fc428ef",
            "created_at": "2023-01-06T13:46:38.998658Z",
            "updated_at": "2025-03-27T02:00:02.973354Z",
            "deleted_at": null,
            "main_name": "Taidoor",
            "aliases": [
                "G0015",
                "Earth Aughisky"
            ],
            "source_name": "MISPGALAXY:Taidoor",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "478e9b27-39b9-49e4-a3c5-81569a767275",
            "created_at": "2022-10-25T15:50:23.417339Z",
            "updated_at": "2025-03-27T02:00:55.464624Z",
            "deleted_at": null,
            "main_name": "Taidoor",
            "aliases": [
                "Taidoor"
            ],
            "source_name": "MITRE:Taidoor",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1415886308,
    "ts_modification_date": 1415886494,
    "files": {
        "pdf": "https://archive.orkl.eu/76c546c2e97b8e9c430d9a0678c23784f175d9d2.pdf",
        "text": "https://archive.orkl.eu/76c546c2e97b8e9c430d9a0678c23784f175d9d2.txt",
        "img": "https://archive.orkl.eu/76c546c2e97b8e9c430d9a0678c23784f175d9d2.jpg"
    }
}