{
    "id": "3d7cfee6-a86f-4c5f-b8b5-8bd6167210de",
    "created_at": "2023-01-12T14:59:52.074282Z",
    "updated_at": "2025-03-27T02:13:57.229241Z",
    "deleted_at": null,
    "sha1_hash": "8eeb2d5fb06b01e39665b555fb8ab27eb19c303a",
    "title": "2020-02-05 - Pro-Russian CyberSpy Gamaredon Intensifies Ukrainian Security Targeting",
    "authors": "",
    "file_creation_date": "2022-05-28T04:42:19Z",
    "file_modification_date": "2022-05-28T04:42:19Z",
    "file_size": 1942885,
    "plain_text": "# Pro-Russian CyberSpy Gamaredon Intensifies Ukrainian Security Targeting\n\n**[labs.sentinelone.com/pro-russian-cyberspy-gamaredon-intensifies-ukrainian-security-targeting/](https://labs.sentinelone.com/pro-russian-cyberspy-gamaredon-intensifies-ukrainian-security-targeting/)**\n\nVitali Kremez\n\n**The Fifth Domain: Pro-Russian CyberSpy APT Gamaredon Wages Silent War with**\n**Ukranian Military & Law Enforcement**\n\n## Executive Summary\n\nPro-Russian Gamaredon APT group has evolved over the last few months, introducing\nnew components to boost its offensive power against the Ukrainian government.\nGamaredon group has ramped up the scale of its operations, attacking a larger number\nof victims, and adapting its tools and social engineering implementation to specific\ntargets.\nGamaredon activities serve as a testing ground for the Russian military to observe the\npotential of cyber warfare in a contemporary violent conflict or in a state-wide political\nconfrontation.\n\n\n-----\n\nBy performing efficient cyber espionage actions against institutions like the Hetman\nPetro Sahaidachnyi National Ground Forces Academy, Gamaredon increases the\nmilitary preparedness of the Donbas militias and local paramilitary groups.\nGamaredon illustrates how the fifth cyber domain enables militants to continue fighting\neven when all other domains are denied by the strategic or political framework.\nCyberwarfare is a solid substitution when other offensive measures are too costly or\ndangerous.\n\n## The “Fifth” Domain\n\nIn the 21st century, cyber became an integral warfare domain joining those of the traditional\nland, air, sea, and space. Cyber attacks are currently listed among the top offensive tools of\na potential adversary along with such classic instruments as submarines or special\noperations (SpecOps) teams. The recent discussion of the Islamic Republic of Iran to\n\n\n-----\n\n[retaliate digitally for the US takedown of General Soleimani concludes that kinetic and cyber](https://www.sentinelone.com/blog/enterprise-security-what-precautions-should-you-take-against-the-threat-of-iranian-apts/)\noffense currently exists within the same framework and one could be a substitute for\nanother.\n\nThis ability to efficiently integrate cyber offense measures into the actual battlefield of a\ntraditional or asymmetric warfare model has been for years tested in the long-term military\nconflict unfolding in Eastern Ukraine since 2014. This confrontation revealed many\ncharacterful traits that may become intrinsic features of 21st-century warfare. Massive digital\nattacks on physical infrastructure, the alleged use of cyberattacks against field hardware\nincluding artillery and, of course, military reconnaissance via cyber espionage. The later\ntactics were employed by the Gamaredon group, a spyware collective that has been\nspecifically targeting Ukrainian military and security institutions in order to compromise and\nsurvey the country’s national security (NatSec) resilience and military power.\n\nGamaredon evolutionary dynamics are as notable as its operations since 2013. Through the\nlast few months, the group has introduced new components that constitute its offensive\npower. The scale of operations, the number of victims, the adaptiveness of tools, the\npersistence which the tools are applied and the accuracy with which they are tailored for a\nspecific goal, the quality of intelligence collection, and the level of human intelligence\n(HUMINT) social engineering implementation – all of these fundamental aspects of a cyber\nwarfare operation have continued to be improved by Gamaredon.\n\nTherefore, due to this important role the group plays in the current cyber threat ecosystem,\nand due to our enhanced visibility into its approach to modern security espionage, we are\noffering a deep-dive into Gamaredon.\n\n## Political Tensions: Russian Interest in Ukraine\n\n\n-----\n\nOn January 25, 2020, the Ukrainian Security Service (similar to the US FBI) officially stated\nthat in 2019 it prevented 482 cyberattacks against Critical Infrastructure and prohibited entry\ninto the country of 278 individuals involved in “propaganda of separatism.”\n\nGamaredon is exclusively targeting the Ukrainian NatSec institutions, which turns it into a\nfull-fledged participant of the ongoing political and military tension taking place in the region.\n\nThe conventional large-scale military clashes between the Ukrainian Armed Forces and the\nEastern Ukraine militias mostly ended in 2015. For the last five years, the situation has\nresembled traditional post-soviet “frozen conflicts” in which the opposing sides neither wage\nfull-fledged warfare nor agree to de-escalate the situation beyond the warzone life. Being\ndeterred from active offense with traditional armed forces, the sides are actively using\nalternative means. In this context, the Russian intelligence and the pro-Russian groups\nactive in the region are naturally shifting to cyber attacks. Groups like Gamaredon become a\npersistent tool to continue fighting without applying kinetic powers, which would naturally\ndamage any de-escalation process.\n\nIndeed, the intensification of Gamaredon seems to be contextual to the political and security\ndynamics in the region, namely, the slow but steady de-escalation and curtailment of the use\nof kinetic strikes. In December 2019, when we observed an increase in Gamaredon\nactivities, the Normandy group responsible for conflict resolution in Donbas met in Paris to\n\n\n-----\n\nadvance the long-term peace talks. The subjects discussed suggest that the Minsk Efforts (a\nframework to resolve the conflict) are advancing towards the peacebuilding stage from the\ninitial peacemaking. DDR (Disarmament, Demobilization, and Reintegration) initiatives,\nresettling of refugees, the establishment of joint armed forces and police groups, exchange\nof POWs and withdrawal of heavy-armed vehicles from Donbas – the format of such\ndiscussions suggest that applying traditional kinetic powers to win the Eastern Ukrainian\nbattlefield is not an option for either side.\n\nThis means that the military and paramilitary groups within both opposing armies now need\nto keep fighting without actually fighting. The Kremlin has recently achieved an\nunprecedented rapprochement with the French President Emmanuel Macron, a key player in\nthe Normandy group, and any outbreak of violence on the Ukrainian-Militia separation line\nmay have fatal consequences for this new partnership. This overall strategic framework\nmakes Gamaredon well-positioned for the conflict. By performing their attacks, Gamaredon\nsimultaneously achieves several goals which traditional military can not achieve while locked\nin the defensive modality implemented by the Minsk Accords.\n\n“Clergy bless graduating cadets, identified by carrying rifles, prior to their commissioning at\n_the Hetman Petro Sahaidachny National Army Academy in Lviv, Ukraine, on Aug. 26. The_\n_[Hetman Petro Sahaidachny National Army Academy was founded in 1899 and has](https://www.army.mil/article/193160/ukraine_boosts_officer_corps_with_new_graduates)_\n_continually produced military officers for no fewer than four different governments. (Photo by_\n_Staff Sgt. Eric McDonough, 45th Infantry Brigade Combat Team) (Photo Credit: Staff Sgt._\n_Eric McDonough)”_\n\n\n-----\n\nFirst, by performing efficient cyber espionage actions against institutions such as the Hetman\nPetro Sahaidachnyi National Ground Forces Academy both in Lviv and Starychy,\nGamaredon increases the military preparedness of the Donbas militias and local paramilitary\ngroups. In the case of a doomsday scenario in which the two sides clash on the battlefield\nagain, the intelligence about hardware, tactical methods, gear, and personnel gathered by\nGamaredon will serve as an edge for the separatists.\n\nSecond, by accomplishing successful attacks against the Ukrainian military, Gamaredon may\nobtain crucial information about strategic plans or internal issues. This information can be\nintegrated into the information warfare and political campaigns initiated by the Russian\nintelligence forces against Ukraine.\n\nMost importantly, Gamaredon activities are a testing ground for the Russian military to\nobserve the potential of utilizing cyber warfare in a contemporary violent conflict or in a statewide political confrontation. Several months ago, in November 2019, Secretary of the NSDC\nsecurity council of Ukraine (similar to the US National Security Council) Aleksey Danilov\nstated that the country has become a testing ground for Russian cyber attacks. It is very\nlikely that Gamaredon is operating in a larger security framework of the Russian military,\ncivilian, and intelligence agencies that meticulously analyze the group’s experience in order\nto implement it in future conflicts.\n\n## Gamaredon Victimology: Along Ukrainian Separation Line\n\nBased on SentinelLabs visibility into the APT Gamaredon victims telemetry, the group\naffected a large disposition of victims across the Ukrainian separatist line with more than five\nthousand unique Ukrainian entities affected for the recent months.\n\nThe map of Gamaredon infections indicates attacks all across Ukraine, specifically the\nconcentration of hits along the Separation Line where Ukrainian troops are being deployed.\n\n\n-----\n\n## Gamaredon Technical Enhancement\n\nPackaged as self-extracting zip-archive (.SFX), the Gamaredon malware implant\ncomponents contain a batch script, a binary processor .NET component, and Macro\npayloads.\n\nIn one of the alerts, CERT-UA previously alerted on the Gamaredon Pterodo infections as\nfollows, targeting Ukrainian state authorities:\n\n_“CERT-UA together with the Foreign Intelligence Service of Ukraine found new modifications_\n_of Pterodo-type malware on computers of state authorities of Ukraine, which is likely to be_\n_the preparatory stage for a cyber attack. This virus collects system data, regularly sends it to_\n_command-control servers and expects further commands.”_\n\nSome of their previous social engineering campaigns relied on intricate understanding of\ngeopolitical and military status in Ukraine using as lures intercepting intelligence related to\nthe military pro-Russian operation in Ukraine.\n\n\n-----\n\nGamaredon recent targeting reveals the newer .NET framework interop integrator\n“Microsoft.Vbe.Interop” with the subsequent Microsoft Office Excel and Word Macro stager.\nThe developer path found as follows:\n```\nC:UsersOpolossourcereposLoderAppLoderAppobjDebugAversome.pdb\n\n```\nNotably, the group behind the malware utilizes a system of server-side forwarders to process\ntraffic from compromised victim machines oftentimes relying on dynamic DNS providers.\n\nThe newer tool included the updated execution via obfuscated .NET application of Excel and\nWord macros with the hardcoded CLSID GUID, as in the example below:\n\n\n-----\n\n```\nMicrosoft.Office.Interop.Word.Application application3 \n(Microsoft.Office.Interop.Word.Application)Activator.CreateInstance(Type.GetTypeFromCL\nGuid(Program.BatJwAK(\"30:30:30:32:30:39:46:46:2d:30:30:30:30:2d:30:30:30:30:2d:43:30:3\napplication3.Visible = false;\n\n```\nOne of the notable features of the malware Interop component is its usage of the fake\nMicrosoft digital certificate belonging to Microsoft Time-Stamp Service.\n\nThe macro execution security registry to allow macro execution and disabling visual basic for\napplications (VBA) warnings is as follows:\n```\nCreateObject(\"WScript.Shell\").RegWrite \"HKEY_CURRENT_USERSoftwareMicrosoftOffice\" &\nApplication.Version & _\n\"ExcelSecurity\" & \"AccessVBOM\", 1, \"REG_DWORD\"\nCreateObject(\"WScript.Shell\").RegWrite \"HKEY_CURRENT_USERSoftwareMicrosoftOffice\" &\nApplication.Version & _\n\"ExcelSecurity\" & \"VBAWarnings\", 1, \"REG_DWORD\"\n\n```\nThe startup “StartExePath” execution is setup as “IndexExel.exe” in %APPDATA% with the\nStartUpPath as “IndexOffice.vbs”. The malware executable sets up as a task as “schtasks\n/Create /SC MINUTE /MO 12 /F /tn Word.Downdloads /tr” to run every 12 minutes while the\nVBS macro is every 15 minutes.\n\n\n-----\n\nThe infected bot identity is created via hexified system drive number posting with the\ncomputer name.\n\nThe malware writes the response and encodes the using “Encode” and “GetKey” functions\nas follows as text stream.\n\n\n-----\n\n## Conclusion & Outlook\n\nThe Gamaredon group recently introduced a new toolset including usage of macro payload\nexecution via the specific processor leveraging “scripting” persistence with less reliance on\nthe traditional binary malware approach. The group’s main characteristic remains its\ntechnical determination and persistent targeting of Ukrainian NatSec entities relying primarily\non targeted lures.\n\n\n-----\n\nAs for the security and military aspects of cyberattacks, Gamaredon is an illustrative example\nof how the cyber, as the fifth warfare domain, enables militants to continue fighting even\nwhen all other domains are denied by the strategic or political framework. It serves as a solid\nsubstitution when kinetic strikes are too costly or dangerous. From a military perspective,\nGamaredon offers a cost-efficiency balance in which attempts to advance on the battlefield\ndo not immediately lead to escalation and retaliation. It is a sophisticated way to opt-out of\nthe traditional zero-sum game of any military operation by achieving offensive advantage\nwithout losing a political stance in a peace process. Considering the fact that contemporary\nconflicts tend to slide towards the Donbas-like “frozen” stage, groups like Gamaredon will\nlikely become an inherent component of modern confrontation.\n\n## Indicators of Compromise (IOCs)\n\nWe provide the relevant research indicators of compromise (IOCs), available in MISP JSON\nand CSV format, on our GitHub page.\n```\nFirst-Layer Domain: masseffect[.]space\nProxy-Layer IP: 141[.]8[.]195[.]60\nProxy-Layer IP:188[.]225[.]25[.]50\nSHA-256: c1524a4573bc6acbe59e559c2596975c657ae6bbc0b64f943fffca663b98a95f\nSHA-256: 76ea98e1861c1264b340cf3748c3ec74473b04d042cd6bfda9ce51d086cb5a1a\nSHA-256: e2cb06e0a5c14b4c5f58d0e56a1dc10b6a1007cf56c77ae6cb07946c3dfe82d8\nSHA-256: 39c6884526e7b7f2ed6e47b630010508bb5957385eccf248c961cbd5bcb802c6\n\n```\n[IOCs on GitHub](https://github.com/SentineLabs/Gamaredon-APT)\n\n**Attack Pattern**\n\n\n-----\n\n```\nSpearphishing Link T1192\nSpearphishing Attachment - T1193\nCommand-Line Interface - T1059\nScheduled Task - T1053\nScripting - T1064\nUser Execution - T1204\nXSL Script Processing - T1220\nWindows Management Instrumentation - T1047\nHidden Files and Directories - T1158\nLocal Job Scheduling - T1168\nRegistry Run Keys / Startup Folder - T1060\nStartup Items - T1165\nShortcut Modification - T1023\nNew Service - T1050\nMasquerading - T1036\nAccount Manipulation - T1098\nFile and Directory Discovery - T1083\nNetwork Share Discovery - T1135\nNetwork Service Scanning - T1046\nRemote File Copy - T1105\nReplication Through Removable Media - T1091\nAutomated Collection - T1119\nData from Local System - T1005\nData from Network Shared Drive - T1039\nData from Removable Media - T1025\nCustom Command and Control Protocol - T1094\nMulti-hop Proxy - T1188\nExfiltration Over Command and Control Channel - T1041\nAutomated Exfiltration - T1020\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-05 - Pro-Russian CyberSpy Gamaredon Intensifies Ukrainian Security Targeting.pdf"
    ],
    "report_names": [
        "2020-02-05 - Pro-Russian CyberSpy Gamaredon Intensifies Ukrainian Security Targeting.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535592,
    "ts_updated_at": 1743041637,
    "ts_creation_date": 1653712939,
    "ts_modification_date": 1653712939,
    "files": {
        "pdf": "https://archive.orkl.eu/8eeb2d5fb06b01e39665b555fb8ab27eb19c303a.pdf",
        "text": "https://archive.orkl.eu/8eeb2d5fb06b01e39665b555fb8ab27eb19c303a.txt",
        "img": "https://archive.orkl.eu/8eeb2d5fb06b01e39665b555fb8ab27eb19c303a.jpg"
    }
}