{
    "id": "3d8b0c9f-ad36-48cd-ae4c-9a3e96c8d9b2",
    "created_at": "2022-10-25T16:48:19.929304Z",
    "updated_at": "2025-03-27T02:16:28.823361Z",
    "deleted_at": null,
    "sha1_hash": "35428b46bb9785b339a3459fb35e184d711dbb99",
    "title": "False flag or upgrade? Suspected sea lotus uses the Glitch platform to reproduce the attack sample",
    "authors": "Blog",
    "file_creation_date": "2022-02-21T05:28:42Z",
    "file_modification_date": "2022-02-21T05:28:42Z",
    "file_size": 3005162,
    "plain_text": "# False flag or upgrade? Suspected sea lotus uses the Glitch platform to reproduce the attack sample\n\n**mp.weixin.qq.com/s/1L7o1C-aGlMBAXzHqR9udA**\n\n[Original Red Raindrop Team Qi Anxin Threat Intelligence Center 2022-01-20 02:01](javascript:void(0);)\nIncluded in the topic #APT 52\n\nOverview\n\nThe Qi'anxin Red Raindrop team continues to pay attention to the attack activities of global\nAPT organizations, including the OceanLotus APT organization. Recently, a foreign\nmanufacturer Netskope released an analysis report on mht format files (Web archive files)\nimplanted into malware by carrying Office macros [1], because the attack methods used by\nthe samples mentioned are similar to those of OceanLotus. The report believes that the attack\nwas carried out by the Ocean Lotus organization.\n\n\nAfter in-depth analysis of such samples by the researchers of the Red Raindrop team, it was\nfound that there are some characteristics in the attack process that are different from the\nprevious attacks of Ocean Lotus. Therefore, the possibility of other attack groups imitating\nOcean Lotus cannot be ruled out. Based on the existing public information, the specific\nidentity of the gang behind the attack cannot be determined for the time being. In addition,\nwe noticed that such samples use the Glitch platform to deliver subsequent malware, and\nfurther found that they are in the same vein as the attack samples disclosed by Qi'anxin\nThreat Intelligence Center in December last year [2] .\n\nThis article will deeply analyze the samples involved in this attack, sort out other associated\nattacks, compare with the historical attack methods of OceanLotus, and summarize the\nsimilarities and unique characteristics of the attacks. Such attack samples have the following\ncharacteristics:\n\n1. The macro code will release 32-bit or 64-bit malicious DLL according to the system\nversion, and a piece of random data will be inserted when releasing the malicious DLL;\n\n2. Both the macro code and malicious DLL are obfuscated;\n\n3. The malicious DLL transmits the collected information back to the C2 service hosted by\nthe Glitch platform, and then downloads the 7z-compressed subsequent malware and\nexecutes it.\n\nSample information\n\n\n-----\n\nThe collected attack sample information is as follows\n\n**MD5** **file type** **file name**\n\n0ee738b3837bebb5ce93be890a196d3e RAR HS.rar\n\n11d36c3b57d63ed9e2e91495dcda3655 RAR Tai_lieu.rar\n\n204cb61fce8fc4ac912dcb3bcef910ad RAR TL-3525.rar\n\na7a30d88c84ff7abe373fa41c9f52422 RAR Note.rar\n\nb1475bdbe04659e62f3c94bfb4571394 RAR CV.rar\n\nb2eb3785e26c5f064b7d0c58bdd3abe0 RAR List Product.rar\n\nd8fa458192539d848ee7bb171ebed6bd RAR GiftProducts.rar\n\ne7ce1874ab781c7a14019b6a6e206749 RAR PaymentRequest.rar\n\neb6cf9da476c821f4871905547e6a2b4 RAR DeliveryInformation.rar\n\nf5ea39b70f747e34ae024308298f70ac RAR Document.rar\n\nf8d30c45ed9d3c71ec0f8176ddd7fd8f RAR Gift Products.rar\n\nThe names of the collected attack samples are basically in English, only Tai_lieu.rar is\nVietnamese, which means \"file\". The RAR file contains mht files that carry Office macros.\nThe sample execution flow is as follows.\n\n\n-----\n\nDetailed analysis\n\nTake the sample 11d36c3b57d63ed9e2e91495dcda3655 as an example for analysis.\n\n**file name** Tai_lieu.rar\n\n**MD5** 11d36c3b57d63ed9e2e91495dcda3655\n\n**file type** RAR\n\nRAR contains a mht format file Tailieu.doc with the same name as RAR, which will prompt\nthe victim to enable macros when opened.\n\n\n-----\n\nEnabling the macro will open Document.doc with no specific content, just an error message\nto confuse the victim.\n\n**VBA**\n\nAfter VBA is obfuscated, in addition to name obfuscation, it also uses Chr function to\nconcatenate key strings, and uses mixed operations of hexadecimal, octal and decimal to\nobtain constant numbers.\n\n\n-----\n\nAfter enabling the macro, first determine whether it is VBA7 and whether the system version\nis 64-bit, and save the judgment result in the global variable hPY42J6w.\n\nCreate a directory \"%ProgramData%\\Microsoft Outlook Sync\", and copy the original\nguest.bmp file in the system to the new directory to save the malicious DLL that will be\nreleased next.\n\n\n-----\n\nCall the function kPW1Jdp7d4eP95n to release the doc file and dll file saved at the end of the\nmht file. The file data spliced  at the end of the mht file are 32-bit dll, 64-bit dll and doc files\nin sequence. The file release sequence is from back to front, so the end of each file data will\nbe followed by a 4-byte data to mark the length of the file data, which can be used to locate\nthe starting position of the file data when releasing.\n\n\n-----\n\nThe hPY42J6w variable that previously saved the machine version judgment result\ndetermines which files are released: if the variable is 1, the file release operation will be\nperformed when the variable v2yHmJl5EO064cV is 0 and 2, and the doc file and 32-bit dll\nwill be released at this time; otherwise, if hPY42J6w If it is 2, the doc file and 64-bit dll are\nreleased.\n\nThe doc file and dll file data spliced  at the end of the mht file are not encrypted or encoded,\nbut the way of saving and releasing the dll file data is special. Doc file data is stored in the file\nin its complete form and extracted directly upon release.\n\nDll file data is saved in the following form: first two 4-byte data, and then the dll file removes\nthe remaining data of the first two bytes (ie 0x4D5A) as the magic number of the PE file.\nTherefore, the length of the file data saved in mht will be 6 bytes larger than the original file\nlength. When the Dll file data is released, it first reads 2 placeholders from mht for\nsubsequent repair of the DOS header and removes the remaining original file data of\n0x4D5A. Then insert a piece of random data into the read data for expansion processing. The\nposition and length of the inserted data are determined by the two 4-byte data mentioned\nabove. Finally, save the obtained data in the guest.bmp file in the\n\"%ProgramData%\\Microsoft Outlook Sync\" directory.\n\nThen the macro code copies the guest.bmp that saves the data of the dll file to\nbackground.dll, changes the first two bytes of the file to \"MZ\", thereby repairs the DOS\nheader, calls the OpenProfile function of background.dll, and deletes the guest.bmp file .\n\n\n-----\n\nFinally set the opened mht file attribute to system hidden, then close the file.\n\n**Freed DLL**\n\nThe functions of the 32-bit and 64-bit dll released by VBA macros are the same, because a\nrandom data will be inserted when the dll file is released, so the hash value of the dll file is\nnot fixed.\n\n**file name** background.dll\n\n**MD5** fca9347b37c737930d0aaa976c3e234b (not fixed)\n\n**file type** Win32 DLLs\n\n**File size** 23712256 bytes\n\nThe released dll file instructions are obfuscated, and there are two export functions, the\nfunction names are OpenProfile and SaveProfile. The functions of the two functions are to\nachieve persistence by setting scheduled tasks, and to inject subsequent payloads into remote\npuppet process execution.\n\nThe DllMain function of Backgroud.dll stores the key strings and other parameters used by\nthe exported function in global variables.\n\n\n-----\n\nThe OpenProfile function is called by VBA, which sets up a scheduled task through a COM\nobject to run another exported function of the dll, SaveProfile.\n\nSaveProfile injects the PE file embedded in the dll into the remote puppet process. The\ncommand to create the remote process is \"rundll32.exe kernel32.dll,Sleep\".\n\n\n-----\n\nThe offset of the address pointed to by the instruction register in the remote thread register\ncontext from the starting address of the memory where the injected data is stored is\n0x44C20. After the PE injected into the memory is dumped, the only exported function is the\nlocation in the disk file.\n\n\n-----\n\n**DLL injected into memory**\n\n**file name** \n**MD5** 9fd6ae7e608b3b7421f55b73f94b4861\n\n**file type** Win32 DLLs\n\n**File size** 717824 bytes\n\nThe released 32-bit dll and the 64-bit dll injected into the remote process are both 32-bit,\nwith the same file size and the same function.\n\nThe DLL is injected into memory as an unmapped file, and the only exported function of this\nDLL is to load itself reflectively in memory. After allocating memory to load the dll itself, the\nexport function executes the DllMain function twice, and the second parameter of DllMain is\n1 and 4, respectively. Malicious behavior in the Dll is only triggered when the parameter is 4.\n\n\n-----\n\nLike background.dll, key strings and other configuration data are first saved in global\nvariables.\n\nCreate a subdirectory named \"Microsoft Edge Download\" in the \"C:\\ProgramData\" directory\nto collect host information, including the MAC address of the network card, user name, host\nname, all current process names, and file and subdirectory names in the ProgramData\ndirectory.\n\n\n-----\n\nThe collected information is encrypted and sent back to the C2 service hosted by the Glitch\nplatform in a POST request. The return URL is hxxps://elemental-futurecheetah.glitch.me/afe92a2bd2P .\n\nThen get the follow-up from the C2 with a GET request, and the follow-up payload is\ntransmitted as a 7z compressed file. Get the subsequent URL as hxxps://elemental-futurecheetah.glitch.me/afe92a2bd2D. Subsequent payloads are saved in\n\"C:\\ProgramData\\Microsoft Edge Download\\properties.bin\".\n\nThe malware in the 7z archive is decompressed and saved in the \"C:\\ProgramData\\Microsoft\nEdge Download\" directory. The subsequent payload is executed by setting a scheduled task\nthrough the COM object, and the persistence of subsequent malware is achieved at the same\ntime. The name of the scheduled task is \"Chrome Update\".\n\n\n-----\n\nSince C2 is currently inaccessible, subsequent malware cannot be obtained for analysis. Use\nthe calculator program (calc.exe) in the system to simulate the acquired subsequent loads to\ndisplay the set scheduled tasks.\n\nThe dll also has a feature that uses GetCurrentThread/ GetCurrentProcess and\nWaitForSingleObject instead of Sleep to perform hibernation operations.\n\nactivity association\n\n**early samples**\n\n\n-----\n\nThe earliest such attack samples can be traced back to August 2021. The early sample\ninformation is as follows:\n\n**MD5** **file type** **file name** **VT upload time**\n\n\n6d0ab5f4586166ac3600863bc9ac493e Win32\nDLLs\n\n0bd0f1dd8b03c11b3d59da2c5fba2e45 Win32\nDLLs\n\ncc4a9d5248095e64c1f22e8a439416cc Win64\nDLLs\n\n\n2zofrncu.dll 2021/08/23 12:52:31\nUTC\n\nmslog.dll 2021/08/26 03:55:13\nUTC\n\nmslog64.bin 2021/08/26 03:57:57\nUTC\n\n\nmslog.dll and mslog64.bin correspond to the 32-bit dll and 64-bit dll released in the\naforementioned attack process, respectively. 2zofrncu.dll is the PE that mslog.dll injects into\nthe remote process. The structure and operation process of the three samples are the same as\nthe dll samples involved in this attack. The relevant URLs are as follows:\n\n**URL** **Function**\n\nhxxps://immense-plastic-pullover.glitch.me/T812P Return collected information\n\nhxxps://immense-plastic-pullover.glitch.me/T812D download follow-up\n\nIt is worth noting that the PE injected into the memory during the entire attack process does\nnot land on the disk, but the sample 2zofrncu.dll uploads VT earlier than its superior sample\nmslog.dll. Furthermore, all three samples uploaded VT from Vietnam by the same uploader.\nCombining the above information, we guess that these three samples may be early test\nsamples.\n\n**Previously disclosed attack samples**\n\nThe samples involved in this attack are strongly related to the attack samples [2] disclosed by\nthe Qi Anxin Threat Intelligence Center in December last year, and can be considered to be\nfrom the same attack group. The first is a misinformation document with the same content\nused in both campaigns.\n\n\n-----\n\nThen the code obfuscation method used by the malicious dll is the same, and the running\nprocess is the same:\n\n(1) A subdirectory with a name related to Microsoft will be created in the \"C:\\ProgramData\"\ndirectory;\n\n(2) Collect host information, encrypt it and send it back to the C2 service program hosted on\nthe Glitch platform as a POST request. The returned URL format is hxxps://[xxx]-[xxx]\n[xxx].glitch.me /[xxx]P;\n\n(3) Then obtain the subsequent payload compressed by 7z from C2 and execute it. The\nsubsequent URL format is hxxps://[xxx]-[xxx]-[xxx].glitch.me/[xxx]D.\n\n**Comparison with the historical attack method of Ocean Lotus**\n\nThe attack sample uses some historical attack methods of OceanLotus. OceanLotus has used\nmht files carrying malicious macros to release the KerrDown downloader [3] in the past\nattacks . Similarly, the malicious macros will choose to release 32-bit dll or 64-bit dll\naccording to the system version. The dll used as the KerrDown downloader also uses pictures\nThe suffix of the format file is saved on disk. In addition, the instruction obfuscation method\nused by the malicious dll involved in this batch of attack samples is similar to that of Ocean\nLotus, and the reflective loading method is also used to load the PE in the memory during the\nsample execution process.\n\nThe differences from the previous attacks of Ocean Lotus are:\n\n(1) The file name of the error message displayed by the sample is inconsistent with the\noriginal mht file name, and it is impossible to determine whether the attacker is negligent or\ndeliberate. And the file data to be released is directly spliced  at the end of the mht file without\nencryption or encoding processing. OceanLotus often saves the file data to be released in an\nencrypted or encoded form.\n\n\n-----\n\n(2) The reflection loading method used by the sample is different from that of the sea lotus\ntissue. OceanLotus often uses shellcode as the loader for reflective loading of PE, and this\nbatch of attack samples uses the exported function of the loaded dll as the loader.\n\nThe above differences may be due to either the Ocean Lotus group trying new attack\nmethods, or the attack activities carried out by other groups. Due to the lack of pertinence in\nthe sample name, the C2 service is hosted on the public platform Glitch, and the URL fails to\nobtain subsequent malware. At present, the specific identity of the attacker cannot be clearly\nidentified, and further clues and information are to be discovered later.\n\nSummarize\n\nThis type of attack sample uses malicious macros carried by mht files to implant malicious\nsoftware on the victim host. The methods used in the attack process are similar to those of\nthe OceanLotus organization, but there are also some characteristics that are different from\nthe historical attack activities of OceanLotus. Although it cannot be attributed to a specific\nattack group for the time being, by sorting out a series of related attack activities, it can be\nfound that the attackers behind them are constantly improving their attack methods and\nupdating attack weapons.\n\nNo domestic users have been affected by this attack, but precautions are essential. The\nQi'anxin Red Raindrop team reminds users not to open links of unknown origin shared on\nsocial media, not to click and execute email attachments from unknown sources, not to run\nunknown files with exaggerated titles, and not to install apps from informal sources. Do\ntimely backup of important files, update and install patches.\n\nIf you need to run and install applications of unknown origin, you can first use the Qianxin\nthreat intelligence file in-depth analysis platform\n(https://sandbox.ti.qianxin.com/sandbox/page) to determine. Currently, it supports indepth analysis of files in various formats including Windows and Android platforms.\n\nAt present, the full line of products based on the threat intelligence data of Qi'anxin Threat\nIntelligence Center, including Qi'anxin Threat Intelligence Platform (TIP), Tianqing, Tianyan\nAdvanced Threat Detection System, Qi'anxin NGSOC, Qi'anxin Situational Awareness, etc.,\nhave already supported this Accurate detection of class attacks.\n\n\n-----\n\nIOCs\n\n**MD5**\n\n0ee738b3837bebb5ce93be890a196d3e\n\n11d36c3b57d63ed9e2e91495dcda3655\n\n204cb61fce8fc4ac912dcb3bcef910ad\n\na7a30d88c84ff7abe373fa41c9f52422\n\nb1475bdbe04659e62f3c94bfb4571394\n\nb2eb3785e26c5f064b7d0c58bdd3abe0\n\nd8fa458192539d848ee7bb171ebed6bd\n\ne7ce1874ab781c7a14019b6a6e206749\n\neb6cf9da476c821f4871905547e6a2b4\n\nf5ea39b70f747e34ae024308298f70ac\n\nf8d30c45ed9d3c71ec0f8176ddd7fd8f\n\n6d0ab5f4586166ac3600863bc9ac493e\n\n0bd0f1dd8b03c11b3d59da2c5fba2e45\n\n\n-----\n\ncc4a9d5248095e64c1f22e8a439416cc\n\n**URL**\n\nhxxps://elemental-future-cheetah.glitch.me/afe92a2bd2D\n\nhxxps://elemental-future-cheetah.glitch.me/afe92a2bd2P\n\nhxxps://elemental-future-cheetah.glitch.me/559084b660P\n\nhxxps://elemental-future-cheetah.glitch.me/02d9169d60D\n\nhxxps://elemental-future-cheetah.glitch.me/02d9169d60P\n\nhxxps://confusion-cerulean-samba.glitch.me/e1db93941c\n\nhxxps://confusion-cerulean-samba.glitch.me/0627f41878D\n\nhxxps://confusion-cerulean-samba.glitch.me/0627f41878P\n\nhxxps://confusion-cerulean-samba.glitch.me/192f188023\n\nhxxps://confusion-cerulean-samba.glitch.me/2e06bb0ce9\n\nhxxps://confusion-cerulean-samba.glitch.me/55da2c2031\n\nhxxps://torpid-resisted-sugar.glitch.me/fb3b5e76b4D\n\nhxxps://torpid-resisted-sugar.glitch.me/fb3b5e76b4P\n\nhxxps://torpid-resisted-sugar.glitch.me/83a57b42f1D\n\nhxxps://torpid-resisted-sugar.glitch.me/83a57b42f1P\n\nhxxps://torpid-resisted-sugar.glitch.me/5db81501e9P\n\nhxxps://immense-plastic-pullover.glitch.me/T812D\n\nhxxps://immense-plastic-pullover.glitch.me/T812P\n\nReference link\n\n[1] https://www.netskope.com/blog/abusing-microsoft-office-using-malicious-web-archivefiles\n\n\n-----\n\n[2] https://ti.qianxin.com/blog/articles/Obfuscation-techniques-similar-to-OceanLotus/\n\n[3] https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/yaffihlkuu2yavua8gudd3ctqzikza6x"
    ],
    "report_names": [
        "mp.weixin.qq.com_Falseflag-Sea-lotus-Glitch(01-20-2022)"
    ],
    "threat_actors": [
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1645421322,
    "ts_modification_date": 1645421322,
    "files": {
        "pdf": "https://archive.orkl.eu/35428b46bb9785b339a3459fb35e184d711dbb99.pdf",
        "text": "https://archive.orkl.eu/35428b46bb9785b339a3459fb35e184d711dbb99.txt",
        "img": "https://archive.orkl.eu/35428b46bb9785b339a3459fb35e184d711dbb99.jpg"
    }
}