{
    "id": "3d8e11f4-bb68-4fb4-8c17-7e81a4089272",
    "created_at": "2022-12-04T11:59:12.844134Z",
    "updated_at": "2025-03-27T02:09:50.988585Z",
    "deleted_at": null,
    "sha1_hash": "22c29ddb65123590d0f8601a4f05626c61dd8753",
    "title": "BfV Cyber-Brief Nr. 01/2017",
    "authors": "Bundesamt für Verfassungsschutz",
    "file_creation_date": "2017-03-22T10:25:45Z",
    "file_modification_date": "2017-03-22T10:25:45Z",
    "file_size": 294171,
    "plain_text": "Köln, 22. März 2017\n\nBfV Cyber-Brief\nNr. 01/2017\n- WikiLeaks-Veröffentlichung „Vault7“ -\n\nKontakt:\nBundesamt für Verfassungsschutz\nReferat 4D2/4D3\n 0221/792-2600\n© maxsim/Fotolia.com\n\nAktuelle WikiLeaks-Veröffentlichung „Vault7“\nAuf der Plattform WikiLeaks wurden am 7. März 2017 umfangreiche Daten veröffentlicht, die nach\nAussage von WikiLeaks von einer internen Datenbank der CIA stammen sollen. Die veröffentlichten\nDaten beinhalten u.a. zahlreiche Informationen zu möglichen Cyberangriffswerkzeugen und dem\nVorgehen bei Cyberangriffen.\n\nQuelle: www.betanews.com\n\nWikiLeaks hat die technischen Parameter der beschriebenen Angriffswerkzeuge nicht umfassend\nveröffentlicht, sondern in weiten Teilen eine Anonymisierung vorgenommen. Trotz dieser Anonymisierung finden sich einige technische Parameter, die als Indikator für eine Infektion dienen können.\nDiese werden mit diesem Cyber-Brief an Behörden sowie Unternehmen verteilt, um die eigenen\nSysteme auf eine mögliche Infektion untersuchen zu können.\n\nSachverhalt\nAuf der Plattform WikiLeaks wurden am 7. März 2017 umfangreiche Daten unter der Bezeichnung\n„Vault 7“ veröffentlicht, die nach Aussage von WikiLeaks von einer internen Datenbank der CIA stammen und den Beginn einer Serie von Veröffentlichungen markieren sollen.\nDie erste Veröffentlichungsreihe mit der Bezeichnung „Year Zero“ beinhaltet 8.761 Dokumente, die\naus dem Netzwerk des „Center for Cyber Intelligence“ der CIA stammen sollen.\nDie Dokumente umfassen einen Zeitraum von 2013 bis März 2016. Aus den veröffentlichten Daten\nergeben sich u.a. zahlreiche Informationen zu möglichen Cyberangriffswerkzeugen und dem Vorgehen bei Cyberangriffen.\nLaut den Unterlagen soll die CIA beispielsweise über eine Datenbank mit ausländischer Schadsoftware verfügen. Diese soll die Möglichkeit bieten, technische Merkmale und Indikatoren fremder\nNachrichtendienste zu imitieren und für eigene Cyberangriffe zu verwenden („False Flag-Operationen“). Dies unterstreicht den Ansatz des Bundesamtes für Verfassungsschutz, dass bei der Attribution\nvon Cyberangriffen allein technische Merkmale nicht ausreichen können.\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2017\n\n2\n\nDie in den Veröffentlichungen dargestellte Schadsoftware dient auch der Kompromittierung von\nSmartphones (Apple Betriebssystem iOS sowie Google Betriebssystem Android), Windows Betriebssystemen und Fernsehern (sogenannten Smart-TVs). Viele der in den WikiLeaks-Dokumenten aufgedeckten Schwachstellen und Sicherheitslücken sind allerdings bereits von den Herstellern beseitigt\nworden.\nDarüber hinaus sind einige der benannten Schwachstellen, zum Beispiel für das Apple-Betriebssystem iOS oder Smart-TVs, lediglich ausnutzbar, wenn ein physischer Zugriff auf das Gerät möglich\nist.\nAus den Dokumenten geht bislang keine direkte deutsche Betroffenheit hervor. Weder werden\nvergangene Angriffe, noch geplante Cyberangriffe gegen deutsche Unternehmen oder Behörden\nthematisiert.\nInsgesamt ist die Veröffentlichung bei WikiLeakswie folgt gegliedert:\n\nI. Departments/Branches/Groups\nIn diesem Kapitel finden sich insbesondere Informationen zu den einzelnen Arbeitsbereichen innerhalb der CIA, die sich mit Cyberangriffen und deren Vorbereitung befassen. Zu den nachfolgenden\nEinheiten finden sich dabei Informationen:\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2017\n\n3\n\nII. Projects\nInnerhalb dieses Abschnitts werden einzelne Projekte beschrieben. Besonders erwähnenswert ist\ndas Project „Marble Framework“. Hier wird bei der finalen Kompilierung von Schadsoftware eine\nautomatisierte Verschleierung durchgeführt, um die Attribution von Cyberangriffen zu erschweren.\n\nIII. Operating Systems/Platforms\nIn diesem Abschnitt finden sich u.a. Hilfestellungen für Anwendungs- und Toolentwicklung hinsichtlich unterschiedlicher Betriebssysteme (wie z.B. IOS oder Android).\n\nIV. Development/Tools\nInnerhalb dieses Abschnitts werden diverse Tools vorgestellt, die von der CIA regelmäßig für Angriffe\nverwendet werden sollen.\n\nV. Users\nHier sind Beiträge von einzelnen (anonymisierten) Personen veröffentlicht worden, die sich mit\nzahlreichen Cyberthemen auseinandersetzen. Es finden sich hier beispielsweise Hilfestellungen für\nandere Mitarbeiter, aber auch Auflistungen von aktuellen Projekten einzelner User.\n\nDas Bundesamt für Verfassungsschutz als nationale Spionageabwehrbehörde möchte deutsche\nStellen auf diesem Wege auf die aktuelle Bedrohungslage aufmerksam machen und mit den vorhandenen technischen Informationen versehen, um die eigenen Systeme auf eine Infektion hin untersuchen zu können.\n\nHandlungsempfehlung\nUm festzustellen, ob Ihr Unternehmen betroffen ist, empfehlen wir folgende Schritte:\n•\n\nDurchsicht der Netzwerk-Logs nach den in der Anlage aufgeführten netzwerkbasierten IoC1.\n\n•\n\nSuche nach den in der Anlage aufgeführten hostbasierten-IoC.\n\nSollten Sie entsprechende Anhaltspunkte feststellen, besteht die Gefahr der Infizierung Ihrer Rechner. In diesem Fall können wir Ihre Maßnahmen mit zusätzlichen Hintergrundinformationen unterstützen und weitere Hinweise geben. Hierzu stehen wir Ihnen unter folgenden Kontaktdaten gerne\nzur Verfügung:\n\nTel.: 0221-792-2600 oder\nE-Mail: poststelle@bfv.bund.de\n\nWir sichern Ihnen absolute Vertraulichkeit zu!\n\n1\n\nIndicators of Compromise\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2017\n\n4\n\nAnlage: Indicators of Compromise (IOC)\nHashes\nmd5: 82684128dfd4a027fddb33711bd2a8ec\nsha‐256: f0d422222b6b39b4a141b6916cb4c844aeb6173fe185fe1030497d273f4e1377\nmd5: d85e26868162eefef20ca6f4aeca3a99\nsha‐256: ea042bd3a7df11273e233c423e9740e6b51001911139855ef39501472a1e5fb0\nmd5: d6eade9176d7e19454cf5e60c67574fc\nsha‐256: 7bb70ab14ad6003d77529f9edf9fa89dfde7656526f2393c07ae9d03455522f2\nmd5: d01606c6b6ee92475fa5bd4c87a8dfd0\nsha‐256: 172e496fc433592c3c7760fb97451106b5188189987477e5a33b13b5eee685e9\n\nDomains and IP-Adressen\n148.251.160[.]129\n38.86.48[.]163\n46.45.182[.]227\nbuglyter[.]net\ncharmore[.]net\ndelafrone[.]com\nequivatec[.]com\nfeduptonec[.]net\nflowhyper[.]net\nlifeinsureadv[.]com\nns1.trickmel[.]com\nns1.vesselwatcher[.]net\nns1.winterfall[.]net\nns2.flowhyper[.]net\nns2.vesselwatcher[.]net\nronket[.]com\nsightlinked[.]com\ntrickmel[.]com\nvesselwatcher[.]net\nwinterfall[.]net\nwisemip[.]net\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2017\n\n5\n\nwww.vesselwatcher[.]net\nzabbix‐tech[.]com\nwin32‐srv8.zabbix‐tech[.]com\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2017\n\n6",
    "language": "DE",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.verfassungsschutz.de/SharedDocs/publikationen/DE/cyberabwehr/2017-01-bfv-cyber-brief.pdf?__blob=publicationFile&v=5"
    ],
    "report_names": [
        "2017-01-bfv-cyber-brief.pdf"
    ],
    "threat_actors": [
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1670155152,
    "ts_updated_at": 1743041390,
    "ts_creation_date": 1490178345,
    "ts_modification_date": 1490178345,
    "files": {
        "pdf": "https://archive.orkl.eu/22c29ddb65123590d0f8601a4f05626c61dd8753.pdf",
        "text": "https://archive.orkl.eu/22c29ddb65123590d0f8601a4f05626c61dd8753.txt",
        "img": "https://archive.orkl.eu/22c29ddb65123590d0f8601a4f05626c61dd8753.jpg"
    }
}