{
    "id": "3d9347d5-3a8c-4958-9062-ab5e8be108b8",
    "created_at": "2023-01-12T15:02:09.802839Z",
    "updated_at": "2025-03-27T02:06:12.748118Z",
    "deleted_at": null,
    "sha1_hash": "5ba75f095794e1b612ed9e98feda95c58c1aef14",
    "title": "2021-12-07 - Revix Linux Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:36:04Z",
    "file_modification_date": "2022-05-28T23:36:04Z",
    "file_size": 1036635,
    "plain_text": "# Revix Linux Ransomware\n\n**[malienist.medium.com/revix-linux-ransomware-d736956150d0](https://malienist.medium.com/revix-linux-ransomware-d736956150d0)**\n\nVishal Thakur December 17, 2021\n\n[Vishal Thakur](https://malienist.medium.com/?source=post_page-----d736956150d0--------------------------------)\n\nDec 7, 2021\n\n\n7 min read\n\n[First edition published here](https://angle.ankura.com/post/102hcny/revix-linux-ransomware)\n\nIn the first half of 2021, we started to see the REvil ransomware operators targeting Linuxbased systems with a new Linux version of the more commonly seen Windows version of the\nsame ransomware. There have been a few versions of this Linux-based malware since then.\n\nIn this publication, we take a look at the latest version, 1.2a.\n\n[Malpedia link](https://malpedia.caad.fkie.fraunhofer.de/details/elf.revil)\n\n[YouTube link](https://www.youtube.com/watch?v=mDUMpYAOMOo)\n\n\n-----\n\n## YARA Rulesets\n\n[https://github.com/YaraExchange/yarasigs/blob/master/ransomware/crime_lin_revil.yar](https://github.com/YaraExchange/yarasigs/blob/master/ransomware/crime_lin_revil.yar)\n[https://github.com/YaraExchange/yarasigs/blob/master/ransomware/crime_lin_revix.yar](https://github.com/YaraExchange/yarasigs/blob/master/ransomware/crime_lin_revix.yar)\n\n## Quick Snapshot\n```\nClass: ELF64Type: Dynamically Linked Machine: X86-64Number of section headers:\n28Entry Point: 0x401650callq: __libc_start_main@plt MD5:\nc83df66c46bcbc05cd987661882ff061\n\n Introduction\n\n```\nThe execution of this malware is straight forward. It traverses through the directories targeted\nby it and encrypts the files present in those directories. Once encryption is complete, it drops\na ransom note in the directory with the usual ransom message and instructions on how to\npay the bad actors to get the decryption key.\n\nThis malware requires a couple of parameters to be passed to it in order for it to successfully\nexecute. It also requires to be run with escalated privileges in order to be able to successfully\nencrypt files on the disk.\n\nOne of the main targets for this malware is VMware’s ESX platform, which we’ve seen before\n[in a different Linux ransomware, Darkside.](https://www.trendmicro.com/en_au/research/21/e/darkside-linux-vms-targeted.html)\n\nThis malware is not able to encrypt data if being executed by a non-privileged user. It also\nchecks the files in the target directories to see if they are already encrypted.\n\n## Analysis\n\nFor the purpose of this publication, we analyse this malware both statically and dynamically.\nWe switch between the two methodologies as we go through the analysis process.\n\nA quick look at section .init:\n\n\n-----\n\nSection .text:\n\n**Functions**\n\nThe malware loads a number of functions upon initialisation. Following some of the\ninteresting ones we are able to extract useful information that can be used to understand the\nflow of execution and write some detections as we’ll see later in this article.\n\nMalware functions loaded upon initialisation\n\n\n-----\n\nFunction sequence during execution\n**Initialization**\n\nLet’s take a quick look at the program initialization:\n\nExecution initialisation\n\nParameters for the command-line arguments\n**Execution**\n\nWhen executed as a non-privileged user, the malware is not able to achieve full execution.\n\nAs we can see in the image below, the malware has been provided the directory ‘here’ for\nthe purpose of this analysis:\n\nThe malware tries to access the data in this directory for read/write and is not successful as\nthe image below shows:\n\nThe malware also tries to encrypt the test file that we have provided for the purpose of this\nanalysis in the target directory but the encryption process fails as that action requires higher\nprivileges:\n\n\n-----\n\nAs a result, the execution fails to achieve the desired outcome for the malware, as shown by\nthe result in the image below:\n\nAnother point of interest from this failed execution is that the malware attempted to execute a\nesxcli command but was not able to do so:\n\nAll of this changes when we run the malware with escalated privileges.\n\nFirstly, the malware is able to access the data in the target directory:\n\nNext, we can see that the malware is able to perform read/write functions on the data in the\ntarget directories, resulting in successful encryption of that data:\n\nWe can see from the image below that the malware is able to write the ransom-note text file\nto the disk:\n\nAnd finally, we can see that the execution is completed successfully, resulting in the data\npresent in the target directory being encrypted:\n\n\n-----\n\nThe file we provided in the target directory is now encrypted and a ransom-note is created in\nthe same directory:\n\nThe malware also checks if the data in the target directory is already encrypted. To\ndemonstrate this, we ran the malware against the same target directory one more time.\n\nUpon execution, the malware runs a check on the data present in the target directory and\nidentifies it to be already encrypted:\n\nAs a result, the execution ends up with no data being encrypted:\n\n## VMware ESX targeting\n\nThis malware also tries to use the esxcli, the command line interface for VMware ESX\nplatform. Let’s take a quick look at the parameters passed to esx as command-line\narguments.\n```\nesxcli --formatter=csv --format-param=fields==\"WorldID,DisplayName\" vm process list |\nawk -F \"\\\"*,\\\"*\" '{system(\"esxcli vm process kill --type=force --world-id=\" $1)}'\n\n```\n**vm process list**\n\nList the virtual machines on this system. This command currently will only list running VMs\non the system.\n\n**vm process kill**\n\n\n-----\n\nUsed to forcibly kill Virtual Machines that are stuck and not responding to normal stop\noperations.\n\n**— type**\n\nThere are three types of VM kills that can be attempted: [soft, hard, force].\n\n**— world-id | -w**\n\nThe World ID of the Virtual Machine to kill. This can be obtained from the ‘vm process list’\ncommand (required)\n\nSo basically what these esx command-line arguments are doing is shutting down all VMs\nrunning on the ESX platform.\n\nThe idea is to run the malware targeting the ‘/vmfs’ directory and encrypt all the data present\nin that directory so all the VMs are rendered inoperable until the data is decrypted.\n\nThis targeting is similar to that seen in DarkSide’s Linux variant.\n\n## Command-line Arguments\n\nThe malware requires the following parameters to be passed for its execution to begin:\n\n**elf.exe — path /vmfs/ — threads 5**\n\nIt also allows the ‘ — silent’ option that executes the malware without stopping the VMs\n\n**— silent (-s) use for not stoping VMs mode ***\n\n## Config\n\nThe config of this Linux version is similar to that of its Windows variant, only with less fields.\n\n\n-----\n\nHere’s an image showing the config we were able to extract from the sample we analysed:\n\n## Profiling\n\nThe malware also gathers information about the victim machine which is gathered by running\nthis command:\n\n\n-----\n\n**uname -a && echo | && hostname**\n\nAnd we can see the result in the stack:\n\nThe info is then passed through the registers:\n\nAnd the end-result is created in the form of this config with the victim information:\n\n## Encryption\n\nThe malware uses Salsa20 encryption algorithm (just like its Windows variant) to encrypt the\ndata and here’s the pseudocode for the function that implements it:\n\n\n-----\n\n## Mitigation\n\n**Detections**\n\nThe malware runs this command to determine machine info:\n```\nuname -a && echo \" | \" && hostname\n\n```\nThe malware tries to query this directory:\n```\n/dev/urandom\n\n```\nThe malware runs this command to stop VMs running on the ESX platform in order to\nencrypt the data on those VMs:\n```\nesxcli --formatter=csv --format-param=fields==\"WorldID,DisplayName\" vm process list |\nawk -F \"\\\"*,\\\"*\" '{system(\"esxcli vm process kill --type=force --world-id=\" $1)}'\n\n```\n**Typos:**\n\nIn some instances, typos that malware authors commit to the code are useful in detection of\nthe malware or similar code used in other malware. These are a couple of typos we found in\nthis variant of Revix:\n\n\n-----\n\n```\n silent ( s) use for not VMs mode to be protected by os but let s encrypt anyway…\n\n## Conclusion\n\n```\nAs we can see in the analysis notes above, the execution is a bit clunky in this variant and\nrequires multiple conditions to be met before the ransomware is successful in encrypting\ndata. The malware needs to be executed as a command-line argument with elevated\nprivileges and specified target directories and number of threads. If the malware is not run in\nsilent mode, it will try to stop the VMs which could trigger off a detection and quite possibly\nfail to encrypt data on the VMs due to reduced/restricted access.\n\n## References\n\n[ESXi 7.0 U3 ESXCLI Command Reference](https://developer.vmware.com/docs/14743/esxi-7-0-u3-esxcli-command-reference/namespace/esxcli_vm.html)\n\n[DarkSide on Linux: Virtual Machines Targeted — Naiim, M.,2021](https://www.trendmicro.com/en_au/research/21/e/darkside-linux-vms-targeted.html)\n\n[getdents64(2) — Linux man page](https://linux.die.net/man/2/getdents64)\n\n[Code Analysis details by Intezer Analyse](https://analyze.intezer.com/files/f864922f947a6bb7d894245b53795b54b9378c0f7633c521240488e86f60c2c5)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-07 - Revix Linux Ransomware.pdf"
    ],
    "report_names": [
        "2021-12-07 - Revix Linux Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535729,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653780964,
    "ts_modification_date": 1653780964,
    "files": {
        "pdf": "https://archive.orkl.eu/5ba75f095794e1b612ed9e98feda95c58c1aef14.pdf",
        "text": "https://archive.orkl.eu/5ba75f095794e1b612ed9e98feda95c58c1aef14.txt",
        "img": "https://archive.orkl.eu/5ba75f095794e1b612ed9e98feda95c58c1aef14.jpg"
    }
}