{
    "id": "3da41875-1def-442c-ac1e-6050a4788dc1",
    "created_at": "2023-01-12T15:00:03.388411Z",
    "updated_at": "2025-03-27T02:16:44.291745Z",
    "deleted_at": null,
    "sha1_hash": "6387546a798d6fd08d54e43c09d888ed355be24d",
    "title": "2021-10-18 - Profiling hackers using the Malvertising Attack Matrix by Confiant",
    "authors": "",
    "file_creation_date": "2022-05-28T03:42:16Z",
    "file_modification_date": "2022-05-28T03:42:16Z",
    "file_size": 76807,
    "plain_text": "# Profiling hackers using the Malvertising Attack Matrix by Confiant\n\n**[blog.confiant.com/profiling-hackers-using-the-malvertising-attack-matrix-by-confiant-9341838887b7](https://blog.confiant.com/profiling-hackers-using-the-malvertising-attack-matrix-by-confiant-9341838887b7)**\n\ntaha aka lordx64 October 18, 2021\n\ntah\na aka\n\n\nPhoto by on\n\n## What is Malvertising?\n\nA relatively new threat vector, Malvertising is a cyber-attack relying on ad networks and digital ads exposing virtually any internet user surfing\nthe web to the risk of infection.\n\nFrom my experience, if I have to compare with what we know from the cyber security world, I would define Malvertising as the following:\nMalvertising is a mixture of watering holes, exploit kits, web attacks and drive-by downloads all combined and run by now identifiable threat\ngroups called Malvertisers.\n\nMalvertisers rely heavily on the advertising ecosystem and its complexity to funnel their persistent and complex to detect cyber attacks.\n\nThe Modus Operandi (MO) and Tactics, Techniques & Procedures (TTPs) that we tracked so far on different malicious actors within ad\nnetworks helped shape a new kill chain.\n\n## Malvertising Kill Chain:\n\n Understanding the AD tech ecosystem:\n\nDue to the nature of this new kill-chain and the complexity of the ad tech stack, it is essential to understand how ads are displayed on a web\npage.\n\n\n-----\n\net s qu c y e p a o e c uc a p ece o t e ad tec o d, ca ed ea t **e b dd** **g o** (o at s t e p ocess a ad go t oug be o e\nit is displayed)\n\nCourtesy of Circus Street, taken from this video\n\nNote: The video link above is one of the best quick explanations I found so far, and if you are new to ad tech, I highly recommend you\nchecking it out, or continue reading below.\n\nBefore an ad is displayed on the web page, it has to go first through a complex ad stack involving DSPs, ad exchanges, and SSPs define\nbelow:\n\nDSP: or demand-side platforms are used by the buyers, media agencies, or advertisers who have a demand for ad inventory. DSP holds\ninformation from the buy-side about criteria they need: targeted audience, maximum bid price, location, etc.\nSSP: or Supply-Side Platforms are used by the sellers, media owners who are supplying ad inventory. They hold a record of the\ninventory a media owner wants to sell: the different audience segments that visit the media owner site, the minimum price the media\nowner wants to sell for, etc.\nAd Exchange: is the piece of technology that auctions off the ad inventory made available by the SSPs.\n\nThe whole process is buyers will be entered in if the inventory available matches the criteria in their DSP. The one with the maximum bid price\nwill win the auction. The auction process starts when a user opens a web page with an ad unit on it, and the ad that wins the auction appears\nat the same time that the rest of the page loads.\n\nThis whole process is what we call RTB, and all this complex process takes a fraction of a second to execute.\n\nAdvertisers and Publishers are using the technologies above to transact billions of impressions daily.\n\nLike any ecosystem that generates billions of impressions, it will be subject to hacking and cyber-attacks. Threat actors infiltrated this ad\necosystem and turned it to their advantage.\n\nAs we will see in the Kill Chain below, threat actors could be present at different steps of this RTB process.\n\n## Malvertising Kill Chain:\n\n\n-----\n\nMalvertising Kill Chain\nA typical Malvertising Kill Chain is a sequence of the following phases:\n\nInitial Access is the first step where the Malvertisers enters the Advertising ecosystem. Usually Malvertisers access the ad ecosystem by\ncreating fake agencies for the purpose of establishing relationships with ad buying platforms (DSPs) or by creating fake ad creatives.\nA tactic used by Malvertisers to execute malicious code typically via forceful redirects.\n: the step where Malvertisers persist within the ad ecosystem, ensuring their campaigns can last the longest time possible while evading\ndetection mechanisms.\n: A tactic where Malvertisers implement specific fingerprints and techniques that helps them define whether or not to cloak a landing\npage, which is the rendering/reveal of the final landing page\n: After several redirect chains, visitors end up on a final page, the landing page. Typically a landing page is the Malvertisers final\n“payload” and comes in different forms and purposes ranging from Drive-by downloads, Exploit kits, or investment scams, etc.\n\nDue to the sophistication of Malvertising cyber attacks and their deceptive nature, we have seen attackers using more tactics, not in a specific\norder, at different phases of this Kill Chain multiple times:\n\n, and can be used before and/or after the orthe phase.\nAttackers can have multiple with some/all of them using the tactic.\n\nTheis another tactic that we added to help Enterprise assess the risks of such attacks and understand whether they are of a destructive nature,\ncausing a denial of service, hijacking resources, or causing a financial loss.\n\nTherefore, we extended this model from five sequential phases to nine tactics to represent it within a matrix.\n\n## Malvertising Attack Matrix\n\n[The Malvertising Attack Matrix is derived from the MITRE ATT&CK Framework representation. Multiple techniques can be employed to](https://attack.mitre.org/)\naccomplish the same tactic, depending on the attacker’s main objective. however, not all nine tactics need to be employed.\n\nThis representation has the advantage of aggregating the techniques used in previous attacks by documenting techniques, tactics and tools\nused. This aggregation is known as behavior profile.\n\n[Based on the behaviors we identified, the Confiant security team has identified multiple threat actors like Zirconium,](https://blog.confiant.com/uncovering-2017s-largest-malvertising-operation-b84cd38d6b85) [eGobbler,](https://blog.confiant.com/massive-egobbler-malvertising-campaign-leverages-chrome-vulnerability-to-target-ios-users-a534b95a037f) [FizzCore,](https://blog.confiant.com/fake-celebrity-endorsed-scam-abuses-ad-tech-to-net-1m-in-one-day-ffe330258e3c)\n[ScamClub,](https://blog.confiant.com/malvertiser-scamclub-bypasses-iframe-sandboxing-with-postmessage-shenanigans-cve-2021-1801-1c998378bfba) [DCCBoost,](https://blog.confiant.com/persistent-malvertising-attacker-dccboost-raged-as-the-year-faded-4d09340cd3f5) [Tag Barnakle, or](https://blog.confiant.com/tag-barnakle-the-malvertiser-that-hacks-revive-ad-servers-redirects-victims-to-malware-50cdc57435b1) [YoSec along with multiple UNC groups with clusters of activity tied to Malvertising.](https://blog.confiant.com/malvertising-threat-actor-yosec-exploits-browser-bugs-to-push-malware-cve-2021-1765-3040dd3c4af1)\n\n\n-----\n\na e t s g t eat acto s p o es ca o be de t ed a d t ac ed a t e a e t s g ttac at, see be o\n\n## How to\n\n[We built a website specifically for the Malvertising Attack Matrix that can be found at this URL: https://matrix.confiant.com](https://matrix.confiant.com/)\n\nMalvertising Attack Matrix defined by Confiant\nAlong with the matrix, we have different behavior profiles aka Threat actors, that we identified and added their profiles to this Matrix. By\nselecting a threat actor profile, the matrix will show the associated Tactics and Techniques.\n\n[For example, this how the threat profile of Zirconium looks like:](https://blog.confiant.com/uncovering-2017s-largest-malvertising-operation-b84cd38d6b85)\n\n\n-----\n\nZirconium threat profile\nFollowing the same standards as the MITRE ATT&CK framework, each of the 70+ techniques of the Malvertising Attack Matrix has a page that\nincludes a brief summary of the adversarial technique, procedure examples, and references.\n\nExample of [C401]Technique of the [C400] Tactic:\n\n\n-----\n\n[C400] Browser Exploitation | [C401] By-pass Popup Blocker\n**Notations and Identifiers**\n\nEach tactic and technique have an ID. This ID is used in the contextualized information present in our STIX v2.1 feeds at different places:\n\nWe use this ID in the field of a STIX V2.1 as following:\nWe use this ID to access the webpages referenced in the STIX V2.1 field of a STIX v2.1, following this format:\n\n**Example**\n\nBelow is our malvertising feed, representing a campaign (TI 950451017) we detected from a threat actor dubbed BRS.\n\nWe can see we have three Attack-patterns with references to the matrix for additional information, enabling threat intelligence to understand\nevery attack and its full context:\n\n\n-----\n\n-----\n\nSTIXv2.1 Feed visualization of a BRS campaign TI 9504510174\n\n\n-----\n\nEvery Attack-Pattern STIX v2.1 object has an External Reference field, holding a link to its definition in the Malvertising Attack Matrix.\n\nNote: To receive these Threat intelligence feeds, our TAXII server is hosted at taxii.confiant.com.\n\nPlease reach out to us to access to our malvertising feeds at the following email : security@confiant.com\n\n## Final Notes\n\n Is Malvertising low risk?\n\nMalvertising is interchangeably used with Adware. Many security companies historically have classified Adware as low priority, low risk.\n\nThis is mainly due to PUA/PUP software that caused little to no harm to infected computers in the past.\n\nBut the truth is things have changed now, and threat actors see Malvertising as a potential new attack vector and foothold into Enterprise\nnetworks, who do not really include Malvertising into their threat model.\n\n[Adware has evolved since, and it is now weaponized with backdoors, along with](https://twitter.com/ConfiantIntel/status/1372903888186130434?s=20) [Malware, helping attackers establishing a foothold within](https://www.confiant.com/resources/news/macos-users-targeted-with-new-tarmac-malware)\nEnterprise networks.\n\n**Our Objective**\n\nThe objective of the Malvertising Attack Matrix isn’t just profiling threat actors using different techniques and tactics.\n\nIt is also a tool helping Enterprise security teams taking into account Malvertising hopefully incorporate it into their threat model. This matrix will\nhopefully provide enough knowledge to understand Malvertising and the risks encountered by Enterprises when targeted.\n\nFinally, this matrix is a way to communicate actionable threat intelligence to entities that are outside of the ad tech world and we will\nextensively use it going forward in our reporting.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-18 - Profiling hackers using the Malvertising Attack Matrix by Confiant.pdf"
    ],
    "report_names": [
        "2021-10-18 - Profiling hackers using the Malvertising Attack Matrix by Confiant.pdf"
    ],
    "threat_actors": [
        {
            "id": "38d454f7-6689-443b-939e-062054a229b1",
            "created_at": "2023-12-03T02:00:05.152067Z",
            "updated_at": "2025-03-27T02:00:03.260302Z",
            "deleted_at": null,
            "main_name": "ScamClub",
            "aliases": [],
            "source_name": "MISPGALAXY:ScamClub",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535603,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1653709336,
    "ts_modification_date": 1653709336,
    "files": {
        "pdf": "https://archive.orkl.eu/6387546a798d6fd08d54e43c09d888ed355be24d.pdf",
        "text": "https://archive.orkl.eu/6387546a798d6fd08d54e43c09d888ed355be24d.txt",
        "img": "https://archive.orkl.eu/6387546a798d6fd08d54e43c09d888ed355be24d.jpg"
    }
}