{
    "id": "3daa0b0d-6e17-4545-9ba7-dd78533f9289",
    "created_at": "2023-01-12T15:10:13.524358Z",
    "updated_at": "2025-03-27T02:05:42.396563Z",
    "deleted_at": null,
    "sha1_hash": "22ad99bee016feb970cf7287ea99282d5dd11b44",
    "title": "2022-03-15 - Deep Dive Analysis - Pandora Ransomware",
    "authors": "",
    "file_creation_date": "2022-10-02T12:10:33Z",
    "file_modification_date": "2022-10-02T12:10:33Z",
    "file_size": 1145223,
    "plain_text": "# Deep Dive Analysis – Pandora Ransomware\n\n**[blog.cyble.com/2022/03/15/deep-dive-analysis-pandora-ransomware/](https://blog.cyble.com/2022/03/15/deep-dive-analysis-pandora-ransomware/)**\n\n## A Possible Re-brand of Rook Ransomware\n\n\nMarch 15, 2022\n\n\nPandora ransomware came into the spotlight in March 2022 after targeting some high-profile victims on\nits leak site. The ransomware group announced its first victim on 21 Feb 2022 and has posted around\nfive victims to date.\n\n\n-----\n\nFigure 1: Pandora ransomware data leak site\nDuring a routine threat hunting exercise, Cyble Research Labs came across the sample for this\nransomware. Upon execution, the file encrypts the victim’s system and drops the ransom note in each\nfolder named “Restore_My_Files.txt.” After encryption, the file is renamed with the extension “.Pandora“.\n\nFigure 2: Encrypted Files\n\n## Technical Analysis\n\nThe malware (SHA 256: 5b56c5d86347e164c6e571c86dbf5b1535eae6b979fede6ed66b01e79ea33b7b)\nis packed using the UPX packer. After unpacking, the payload is compiled using Visual C++. The file has\nencrypted strings and several jumps and calls that can make debugging difficult, as shown below.\n\n\n-----\n\nFigure 3: Code flow of Pandora Ransomware\n\nThe malware runs a decryption loop that decrypts the strings present in the file, as shown in Figure 4.\n\nFigure 4: Decryption Loop\n\nInitially, the malware creates a mutex named “ThisIsMutexa” using CreateMutexA() API to ensure that\nonly one instance of the malware is running in the system.\n\nFigure 5: Creates Mutex\n\nThe malware then loads ntdll.dll and calls the NtSetInformationProcess () API, which changes the\nprivilege level and sets the malware file as a critical process. The malware then disables the Event\nTracing for Windows (ETW) by patching the EtwEventWrite() function and further bypasses Antimalware\nScan Interface (AMSI) to evade detection by Anti-Virus products.\n\nThe AMSI allows the integration of applications and processes with the anti-malware solution present on\na system. AMSI scans files that are executed through PowerShell, Jscript, VBA, VBScript, etc.\n\nThe malware also calls SetProcessShutdownParameters() to reduce the process’s priority, i.e., set it to\nzero. This means that malware will be terminated last before the system shutdown so that the malware\ngets the maximum amount of time possible to execute in the compromised machine.\n\nAfter altering the priority, the malware calls SHEmptyRecycleBinA() API to empty the recycle bin to\nensure no deleted files are restored after encryption.\n\n\n-----\n\nLike other ransomware, the malware deletes shadow copies using vssadmin using ShellExecuteW()\nAPI, as shown in Figure 6.\n\nFigure 6:\n\nDeletes shadow copies\nBefore encrypting the machine, the malware gets the Volume details by calling the APIs such as:\n\n_GetDriveTypeW()_\n_FindFirstVolumeW()_\n_FindNextVolumeW()_\n_GetVolumePathNamesForVolumeNameW()_\n_GetLogicalDrives()_\n\nBefore initiating encryption, the ransomware checks and excludes specific folders from encryption –\nsuch as AppData, Boot, Windows, Windows.old, Tor Browser, Internet Explorer, Google, Opera, Opera\nSoftware, Mozilla, Mozilla Firefox, ProgramData, Program Files, Program Files (x86).\n\nThe Ransomware also excludes certain files from encryption such as autorun.inf, boot.ini, bootfont.bin,\nbootsect.bak, bootmgr, bootmgr.efi, bootmgfw.efi, desktop.ini, iconcache.db, ntldr, ntuser.dat.\n\nAdditionally, specific extensions are also exempted from encryption – such as .pandora, .hta, .exe, .dll,\n.cpl, .ini, .cab, .cur, .drv, .hlp, .icl, .icns, .ico, .idx, .sys, .spl, .ocx.\n\nFinally, the ransomware searches for files using FindFirstFileW() and FindNextFileW () APIs and then\nproceeds to encrypt them.\n\nThe malware uses multithreading approach for faster encryption. It calls CreateThread(),\n_SetThreadAffinityMask(), ResumeThread(), CreteIOCompletionPort() and_\n_GetQueuedCompletionStatus() APIs for multithreading._\n\nFinally, the ransom note is displayed, as shown in Figure 7.\n\n\n-----\n\nFigure 7: Ransom note\n\n## Possible ROOK ransomware re-brand:\n\nDuring our analysis, we found that the Tactic Technique and Procedures (TTPs) of the Pandora and\nROOK ransomware shared a lot of similarities.\n\nIn Dec 2021, ROOK ransomware posted on their leak site claiming to have attacked one of the world’s\nlargest automotive suppliers of technology and components. Following this, their leak site went down\naround the end of Jan 2022.\n\nPandora ransomware in March 2022 posted the same victim on their leak site. Due to this incident and\nthe similarities in how they operate, it is suspected that Pandora might be a re-brand of ROOK\nransomware.\n\nFigure 8: Pandora ransomware leak site\n\n## Conclusion\n\n\n-----\n\nThere s a good chance that Pandora ransomware is a re-brand of ROOK ransomware. We had\nobserved similar behavior in the past when ransomware groups were coming up with new aliases when\nthey were under scrutiny.\n\nPandora ransomware gang is suspected of leveraging the double extortion method where the TAs\nexfiltrate the victim’s data followed by data encryption. Then, they threaten to leak the exfiltrated data on\ntheir leak site or on cybercrime forums.\n\nOrganizations can mitigate such attacks by monitoring the darkweb and acting upon early warning\nindicators such as compromised credentials, data breaches, and identifying vulnerabilities traded on\ncybercrime forums.\n\n## Our Recommendations:\n\nEnforce password change policies for the network and critical business applications or consider\nimplementing multi-factor authentication for all remote network access points.\nReduce the attack surface by ensuring that sensitive ports are not exposed on the Internet.\nConduct cybersecurity awareness programs for employees and contractors.\nImplement a risk-based vulnerability management process for IT infrastructure to ensure that\ncritical vulnerabilities and security misconfigurations are identified and prioritized for remediation.\nInstruct users to refrain from opening untrusted links and email attachments without verifying their\nauthenticity.\nDeploy reputed anti-virus and internet security software package on your company-managed\ndevices, including PCs, laptops, and mobile devices.\nTurn on the automatic software update features on computers, mobiles, and other connected\ndevices wherever possible and pragmatic.\nDefine and implement a backup process and secure those backup copies by keeping them offline\nor on a separate network\n\n## MITRE ATT&CK® Techniques \n\n**Tactic** **Technique ID** **Technique Name**\n\n**Execution** [T1059](https://attack.mitre.org/techniques/T1059/) Command and Scripting Interpreter\n\n\n**Privilege Escalation** [T1548](https://attack.mitre.org/techniques/T1548)\n\n[T1134](https://attack.mitre.org/techniques/T1134)\n\n**Defense Evasion** [T1112](https://attack.mitre.org/techniques/T1112)\n\n[T1027](https://attack.mitre.org/techniques/T1027)\n\n[T1562.001](https://attack.mitre.org/techniques/T1562/001/)\n\n**Discovery** [T1082](https://attack.mitre.org/techniques/T1082/)\n\n[T1083](https://attack.mitre.org/techniques/T1083)\n\n**Impact** [T1490](https://attack.mitre.org/techniques/T1490/)\n\n[T1489](https://attack.mitre.org/techniques/T1489/)\n\n[T1486](https://attack.mitre.org/techniques/T1486/)\n\n\nAbuse Elevation Control Mechanism\nAccess Token Manipulation\n\nModify Registry\n\nObfuscated Files or Information\n\nImpair Defenses: Disable or Modify Tools\n\nSystem Information Discovery\n\nFile and Directory Discovery\n\nInhibit System Recovery\n\nService Stop\n\nData Encrypted for Impact\n\n\n## Indicators of Compromise (IoCs): \n\n\n-----\n\n**Indicators** **Indicator**\n**type**\n\n\n**Description**\n\nExecutable\nbinary\n\n\n0c4a84b66832a08dccc42b478d9d5e1b\n160320b920a5ef22ac17b48146152ffbef60461f\n5b56c5d86347e164c6e571c86dbf5b1535eae6b979fede6ed66b01e79ea33b7b\n\n## About Us \n\n\n**Md5**\n**SHA-1**\n**SHA-**\n**256**\n\n\n[Cyble is a global threat intelligence SaaS provider that helps enterprises protect themselves from](https://cyble.com/)\ncybercrimes and exposure in the Darkweb. Its prime focus is to provide organizations with real-time\nvisibility to their digital risk footprint. Backed by Y Combinator as part of the 2021 winter\ncohort, Cyble has also been recognized by Forbes as one of the top 20 Best Cybersecurity Startups To Watch In 2020. Headquartered in Alpharetta, Georgia, and with offices in Australia, Singapore,\nand India, Cyble has a global presence. To learn more about Cyble, visit [www.cyble.com.](https://cyble.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-15 - Deep Dive Analysis - Pandora Ransomware.pdf"
    ],
    "report_names": [
        "2022-03-15 - Deep Dive Analysis - Pandora Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536213,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1664712633,
    "ts_modification_date": 1664712633,
    "files": {
        "pdf": "https://archive.orkl.eu/22ad99bee016feb970cf7287ea99282d5dd11b44.pdf",
        "text": "https://archive.orkl.eu/22ad99bee016feb970cf7287ea99282d5dd11b44.txt",
        "img": "https://archive.orkl.eu/22ad99bee016feb970cf7287ea99282d5dd11b44.jpg"
    }
}