{
    "id": "3dc8bde5-1aec-4939-b1f5-9f743266c447",
    "created_at": "2023-01-12T15:04:44.524278Z",
    "updated_at": "2025-03-27T02:16:09.670319Z",
    "deleted_at": null,
    "sha1_hash": "f5b29e13d5367fced1947e4a7211b5f39493e289",
    "title": "2022-07-26 - Mandiant Red Team Emulates FIN11 Tactics To Control Operational Technology Servers",
    "authors": "",
    "file_creation_date": "2022-08-18T03:56:21Z",
    "file_modification_date": "2022-08-18T03:56:21Z",
    "file_size": 5010995,
    "plain_text": "# Mandiant Red Team Emulates FIN11 Tactics To Control Operational Technology Servers\n\n**[mandiant.com/resources/mandiant-red-team-emulates-fin11-tactics](https://www.mandiant.com/resources/mandiant-red-team-emulates-fin11-tactics)**\n\nDuring the last couple of years, ransomware incidents have impacted thousands of industrial\nand critical infrastructure organizations. In some cases, Mandiant has observed how these\nintrusions disrupt industrial production chains and operational workflows as a method to\nincentivize the payment of ransoms. Although in most cases victims have suffered damages\nexclusively restricted to enterprise systems, this does not mean that operational technology\n(OT) systems are not at risk.\n\nThe nature of OT technology and the challenges of defending it means that many OT\n[networks have security gaps that even less sophisticated actors can leverage. Furthermore,](https://www.mandiant.com/resources/ics-tactical-security-trends-analysis-of-security-risks-observed-in-field)\n[Mandiant has consistently highlighted that some financially motivated groups continue to](https://www.mandiant.com/resources/Mandiant-approach-to-operational-technology-security)\ndeploy the same or similar tools and techniques as those used by advanced persistent\nthreats (APTs) during high-profile cyber physical incidents.\n\nIn this blog, we describe an engagement where a Mandiant Red Team targeted a European\nengineering organization to understand the potential reach ransomware operators could\nhave in their network. Our Red Team emulated the techniques used by FIN11, a financially\nmotivated threat group that has conducted long-running ransomware distribution campaigns\n\n\n-----\n\nacross multiple industries. Using FIN11 s techniques to move from a corporate endpoint with\nregular employee credentials, obtain domain administrator rights, steal critical data, and gain\naccess to OT servers.\n\n## Ransomware Actors Have Proven Capabilities to Access OT\n\nIn 2020, Mandiant released a post describing how financial crime actors were expanding\ntheir reach into OT. Our assessment was based upon two process kill-lists that were\ndeployed alongside known ransomware strains to amplify the impact of the attacks. These\nlists were intended to enumerate and terminate software processes, a couple of which were\ncoincidentally related to OT. While there is limited documented information to determine the\nimpact from these process lists, our assessment indicated that by stopping such processes\nthe actor could have abruptly terminated and encrypted critical OT functions resulting in\nadded damage to the victim.\n\nOne of the two process kill lists was deployed alongside a CLOP ransomware sample, which\nwe then attributed to a cybercrime actor known as FIN11. The group has monetized their\noperations using point-of-sale (POS) malware, CLOP ransomware, and traditional extortion.\n\nFIN11 has shown no indication of having specialized OT expertise and there is no evidence\nindicating that the process kill list they deployed resulted in significant impacts to any victim\nOT environments. However, the actor’s use of a process kill list containing some OT\nprocesses brings up further questions about the extent of their capabilities and how they\nmight impact OT in the future.\n\nIn the past, financially motivated actors—such as FIN11—have used tactics, techniques and\nprocedures (TTPs) that are comparable to those used by state-sponsored actors to support\n[the early stages of the OT targeted attack lifecycle. This includes using publicly available](https://www.mandiant.com/resources/proactive-security-operational-technology)\ntooling, living –off-the-land techniques, known exploitation frameworks, and tailored malware\nto compromise victims.\n\nFigure 1 illustrates some overlaps in techniques used during the TRITON and\nINDUSTROYER incidents with techniques used by FIN11 and another cybercrime actor,\nFIN6 for ransomware deployment and extortion and retail card theft.\n\n\n-----\n\nFigure 1: TTP overlaps among state-sponsored and financially motivated actors\nThe overlaps in TTPs across the four cases likely exist because reaching target assets—\nboth in IT and OT—often requires an actor to follow a process of lateral movement and\nescalation of privileges across corporate and/or production networks. As ransomware\noperators have significantly evolved over the past couple of years, the main difference that\nremains is that some state-sponsored actors have also invested significant resources to\ndevelop OT-tailored payloads to disrupt physical processes.\n\n### Mandiant Red Team Used FIN11 Techniques to Move Across a Target's Enterprise Network and Reach OT Servers\n\nThe MandiantRed Team supported a European engineering organization to visualize the\npossible impact of a financially motivated actor deploying ransomware in their environment.\nThe engagement pursued three goals, all of which were successfully accomplished:\n\nEmulate a ransomware attacker in the IT environment\nPropagate from IT to separate OT network segments\nEmulate multi-faceted extortion by accessing confidential information to steal and\nredistribute\n\nFigure 2 illustrates the two paths Mandiant pursued to reach OT targets:\n\n\n-----\n\nFigure 2: Red Team attack path using FIN11 techniques\nFor this engagement, Mandiant adopted an \"assumed breach\" approach, starting from a\nstandard employee account and device on the target's enterprise domain. Mandiant then\nutilized commonly seen FIN11 techniques to continue the intrusion moving across endpoints\nin different security zones (see the Appendix). Some of the techniques we used to achieve\nour objectives in IT and OT included:\n\n_Reconnaissance of web and internal applications_\n\nMandiant discovered several documents that contained cleartext credentials,\ninformation on IT architecture, network information, and other confidential data on\ninternal shares and knowledge sharing web applications and wikis.\n_Reconnaissance of Active Directory infrastructure_\n\n[Mandiant used a variation of the public tool BloodHound to gather user, group,](https://github.com/BloodHoundAD/BloodHound)\ngroup policy objects (GPO), and machine information to build up data structures\n[that describe the target's Active Directory (AD) infrastructure. Mandiant then](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/get-started/virtual-dc/active-directory-domain-services-overview)\nencrypted and exfiltrated this information to track compromised users and\nstrategize the next steps for the attack.\n_Privilege escalation through CVE-2021-36934, aka \"SeriousSAM\"_\n\n[Mandiant discovered a number of devices vulnerable to CVE-2021-36934.](https://advantage.mandiant.com/cve/vulnerability--0139e787-33d9-5d80-80c1-afcc9a980819)\nExploiting this vulnerability, Mandiant downloaded the Security Account Manager\n[(SAM) databases of these devices and utilized the Impacket library to extract](https://github.com/SecureAuthCorp/impacket)\nsecrets from it, including the password hashes for local accounts, computer\naccount passwords, and cached domain credentials.\n\n\n-----\n\n_Lateral movement through silver ticket_\n\n[Mandiant forged Silver tickets – Kerberos Ticket Granting Service (TGS) tickets](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13)\nnecessary for user authentication – using the ticketer.py script from the Impacket\nlibrary. This enabled the Red Team to impersonate any user on the victim service\n(including administrative accounts) to escalate privileges on specific endpoints in\nthe IT network.\n_Privilege escalation through Active Directory Certificate Services abuse_\n\nMandiant discovered that the target's AD Certificate Services (CS) configuration\ncontained at least one misconfiguration in a Certificate Template, which allowed\nthe requesting entity to request certificates for other principals in the target's AD\n[domains. Mandiant enumerated the AD CS configuration using the public Certify](https://github.com/GhostPack/Certify)\ntool.\n\n### Pivoting to OT on Multiple Fronts\n\nUsing the information and privileges gathered through the enterprise network compromises,\nMandiant identified the best paths to reach the target OT servers. Mandiant focused on\nreaching two different specific targets: an isolated legacy OT network and a global OT\nnetwork with connections across different regions.\n\n_OT Compromise #1 – Establish Foothold and Privilege Escalation in Legacy OT Network_\n\nFigure 3: Red Team attack path for OT Compromise #1\nMandiant used the same credentials and documentation acquired during initial phases in the\ncorporate network to gain access to remote management software installed on a host with\naccess to the OT network. Mandiant then enumerated the host's network defenses and\nobserved that it did not utilize SSL/TLS inspection, which allowed the Red Team to launch an\nimplant that utilized domain fronting as a means for command and control (C&C).\n\n\n-----\n\nFurther network enumeration uncovered that the account accessed via the remote\nmanagement software also had administrative privileges on other hosts in the OT network.\nMandiant used the remote desktop protocol (RDP) to access multiple hosts, enumerate their\ndefenses, and upload a custom crafted C&C implant payload via Server Message Block\n(SMB) protocol and RDP. Mandiant then executed these payloads via remote service\ncreation, Windows Management Instrumentation (WMI) command execution, and manual\nexecution. Given that these protocols and services were also being utilized by legitimate\nusers, it is unlikely that such activity would raise any alerts, making the lateral movement\nblend into background traffic and decreasing the likelihood of discovery by network sensors.\n\nIn total, Mandiant accessed eight servers within the OT network, one of which was a Human\nMachine Interface (HMI). Access to this system would allow an attacker to maliciously\ninteract with the physical control process using native commands. Once Mandiant\nestablished a foothold and had administrative access, the focus shifted to privilege\nescalation.\n\nMandiant dumped the SAM database on one of the hosts to retrieve local account\npassword hashes, which we cracked using a dictionary attack. This revealed the\ncleartext password for one of the local administrator accounts.\nUtilizing local administrator credentials Mandiant created a memory dump of the Local\nSecurity Authority Subsystem Service (LSASS) process on another OT host using the\nTask Manager application.\nMandiant exfiltrated a memory dump file and retrieved the contained credentials using\n[a specifically packed version of the public tool Mimikatz. The recovered credentials](https://github.com/ParrotSec/mimikatz)\ncontained the NTLM hash for a Domain Administrator account on the OT network\ndomain.\nMandiant then completed the objective by utilizing the Domain Administrator account\npassword hash and executing our custom payload on the OT domain controller via\nremote service creation.\n\n_OT Compromise #2: Move Laterally from IT to Global OT Network_\n\n\n-----\n\nFigure 4: Red Team attack path for OT Compromise #2\nFor the second attack path, Mandiant escalated privileges within the target's enterprise\ndomain with an \"AS-REP roast\" attack using the Impacket library to recover multiple user\naccount password hashes. Mandiant cracked password hashes using a dictionary attack,\nwhich revealed the cleartext password for one of the accounts. The user account and\ncredentials had RDP privileges onto an additional host, allowing Mandiant to move laterally\nwithin the enterprise environment.\n\nThe accessed host contained engineering software, which indicated it was likely a jumphost\nor an application server for engineers. Additionally, the engineering application installed on\nthe host used shortcuts on the desktop that pointed to batch (BAT) files in a directory\nwriteable by non-privileged users. This allowed Mandiant to alter the content of the BAT files\nto launch unauthorized applications when users clicked the shortcut on the desktop.\n\nMultiple users fell victim to this attack. One of these users was a member of several AD\n[groups and had RDP privileges to various OT jump hosts. Mandiant used the Rubeus tool to](https://github.com/GhostPack/Rubeus)\nextract the user's Kerberos Ticket Granting Ticket (TGT) from an active session on the\ncompromised host. This allowed Mandiant to import the TGT on a system that was already\ncontrolled by the Red Team and then request a TGS for the \"TERMSRV/<HOST>\" service,\nwhich can be used to connect via RDP to a target host using Remote Credential Guard or\nRestricted Admin Mode. Finally, Mandiant launched the Remote Desktop session via the\n\"mstsc /remoteGuard\" command to connect to several OT jumphosts via RDP.\n\n\n-----\n\nTo complete the objective, Mandiant again used credentials acquired during the\nreconnaissance phase to authenticate to an OT server from one of the OT jumphosts. The\nOT server ran a client/server-based SCADA software solution which was fully accessible and\nalready active on the machine; however due to operational impact concerns, the Red Team\nrefrained from interacting with the application. Access to this type of software could\npotentially allow an attacker to perform in-depth reconnaissance of the OT environment,\nexfiltrate sensitive information, deploy additional payloads (e.g., ransomware), or even\ndegrade the victim's ability to monitor or control the process.\n\n### Ransomware Attack Emulation Provides Critical Insight on Defensive Capabilities\n\nOT systems are critical for organizations to automate production processes. As a result, they\nare attractive targets for actors intending to disrupt production either for profit or to produce\nphysical damage. The overlaps in TTPs between ransomware operators and OT-focused\nAPTs suggest that protecting against ransomware operations also yields significant defenses\nagainst other impactful events, such as a cyber physical attack.\n\nAs of mid-2022 we have not observed financially motivated actors explicitly targeting OT\nnetworks to extort victims, however we highlight that actors have carried out ransomware\nattacks that impacted OT processes. Actors with access to OT assets may be empowered to\ndisrupt the victim's control or visibility over a process in several ways. OT asset owners and\noperators benefit from ransomware attack emulation by confronting the latest adversary\nTTPs, identifying vulnerabilities in their environment and improving breach detection and\nresponse capabilities.\n\nFor more information about attack emulation and red teaming services for OT, please see\n[our previous post on proactive security service offerings for OT. Visit our website to](https://www.mandiant.com/resources/proactive-security-operational-technology)\n[request more information about Mandiant services for OT,](https://www.mandiant.com/solutions/operational-technology) [red team assessments or](https://www.mandiant.com/services/technical-assurance/red-team-assessment) threat\nintelligence.\n\n## Appendix: FIN11 Techniques Utilized for the Red Team Engagement\n\nTable 1: List of FIN11 techniques used for the Red Team emulation\n\n**TTP** **Emulation**\n\n**Initial Access**\n\nT1192: Spear-Phishing Link Out of Scope\n\n\n-----\n\nT1193: Spearphishing Attachment Out of Scope\n\n**Execution**\n\nT1047: Windows Management Instrumentation Yes\n\nT1086: PowerShell Yes\n\nT1053: Scheduled Task No\n\nT1064: Scripting Yes\n\nT1059: Command-Line Interface Yes\n\nT1035: Service Execution Yes\n\nT1204: User Execution Yes\n\n**Persistence**\n\nT1133: External Remote Services Out of Scope\n\nT1053: Scheduled Task No\n\nT1060: Registry Run Keys / Start Folder No\n\nT1015: Accessibility Features No\n\nT1138: Application Shimming No\n\nT1004: Winlogon Helper DLL No\n\nT1050: New Service Yes\n\nT1078: Valid Accounts Yes\n\n\n-----\n\nT1108: Redundant Access Yes\n\n**Privilege Escalation**\n\nT1138: Application Shimming No\n\nT1055: Process Injection Yes\n\nT1015: Accessibility Features No\n\nT1050: New Service Yes\n\nT1053: Scheduled Task No\n\nT1078: Valid Accounts Yes\n\nT1086: Exploitation for Privilege Escalation Yes\n\n**Defensive Evasion**\n\nT1055: Process Injection Yes\n\nT1045: Software Packing Yes\n\nT1107: File Deletion Yes\n\nT1064: Scripting Yes\n\nT1116: Code Signing Yes\n\nT1112: Modify Registry No\n\nT1070: Indicator Removal on Host Yes\n\nT1027: Obfuscated Files or Information Yes\n\n\n-----\n\nT1202: Indirect Command Execution Yes\n\nT1090: Connection Proxy Yes\n\nT1078: Valid Accounts Yes\n\nT1140: Deobfuscate/Decode Files or Information Yes\n\nT1108: Redundant Access Yes\n\n**Credential Access**\n\nT1003: Credential Dumping Yes\n\nT1558: Kerberoasting Yes\n\nT1003.006: DCSync No\n\n**Discovery**\n\nT1082: System Information Discovery Yes\n\nT1057: Process Discovery Yes\n\nT1063: Security Software Discovery Yes\n\n**Lateral Movement**\n\nT1021: Remote Services Yes\n\nT1076: Remote Desktop Protocol Yes\n\nT1105: Remote File Copy Yes\n\n**Collection**\n\n\n-----\n\nT1125: Video Capture No\n\nT1113: Screen Capture No\n\nT1119: Automated Collection Yes\n\nT1005: Data from Local System Yes\n\n**Command and Control**\n\nT1090: Connection Proxy Yes\n\nT1071: Standard Application Layer Protocol Yes\n\nT1094: Custom C2 Protocol No\n\nT1105: Remote File Copy Yes\n\nT1032: Standard Cryptographic Protocol Yes\n\nT1043: Commonly Used Port Yes\n\nT1065: Uncommonly Used Port No\n\nT1219: Remote Access Tools Yes\n\n**Exfiltration**\n\nT1002: Data Compressed Out of Scope\n\nT1022: Data Encrypted Out of Scope\n\nT1041: Exfiltration Over C2 Channel Out of Scope\n\nT1048: Exfiltration Over Alternative Protocol Out of Scope\n\n\n-----\n\n**Impact**\n\nT1486: Data Encrypted for Impact Out of Scope\n\nT1529: System Shutdown/Reboot Out of Scope\n\nT1485: Data Destruction Out of Scope\n\nT1488: Disk Content Wipe Out of Scope\n\nT1489: Service Stop Out of Scope\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-26 - Mandiant Red Team Emulates FIN11 Tactics To Control Operational Technology Servers.pdf"
    ],
    "report_names": [
        "2022-07-26 - Mandiant Red Team Emulates FIN11 Tactics To Control Operational Technology Servers.pdf"
    ],
    "threat_actors": [
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535884,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1660794981,
    "ts_modification_date": 1660794981,
    "files": {
        "pdf": "https://archive.orkl.eu/f5b29e13d5367fced1947e4a7211b5f39493e289.pdf",
        "text": "https://archive.orkl.eu/f5b29e13d5367fced1947e4a7211b5f39493e289.txt",
        "img": "https://archive.orkl.eu/f5b29e13d5367fced1947e4a7211b5f39493e289.jpg"
    }
}