{
    "id": "3e433880-a968-469c-a171-41eb4ea50d2f",
    "created_at": "2023-01-12T15:02:22.292403Z",
    "updated_at": "2025-03-27T02:11:22.884754Z",
    "deleted_at": null,
    "sha1_hash": "d46d02c0ac5baf72c2ba41092742a7ec71e198a7",
    "title": "2015-09-23 - Chinese Actors Use ‘3102’ Malware in Attacks on US Government and EU Media",
    "authors": "",
    "file_creation_date": "2022-05-28T00:32:56Z",
    "file_modification_date": "2022-05-28T00:32:56Z",
    "file_size": 288490,
    "plain_text": "# Chinese Actors Use ‘3102’ Malware in Attacks on US Government and EU Media\n\n**researchcenter.paloaltonetworks.com/2015/09/chinese-actors-use-3102-malware-in-attacks-on-us-government-and-eu-**\nmedia/\n\nRobert Falcone, Jen Miller-Osborn September 23, 2015\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Jen Miller-Osborn](https://unit42.paloaltonetworks.com/author/jen-miller-osborn/)\n\nSeptember 23, 2015 at 3:00 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [3102,](https://unit42.paloaltonetworks.com/tag/3102/) [9002,](https://unit42.paloaltonetworks.com/tag/9002/) [AutoFocus,](https://unit42.paloaltonetworks.com/tag/autofocus/) [Evilgrab,](https://unit42.paloaltonetworks.com/tag/evilgrab/) [Traps,](https://unit42.paloaltonetworks.com/tag/traps/) [Trojan,](https://unit42.paloaltonetworks.com/tag/trojan/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nOn May 6 and May 11, 2015, Unit 42 observed two targeted attacks, the first against the U.S.\ngovernment and the second on a European media company. Threat actors delivered the same\ndocument via spear-phishing emails to both organizations. The actors weaponized the delivery\ndocument to install a variant of the ‘9002’ Trojan called ‘3102’ that heavily relies on plugins to\nprovide functionality needed by the actors to carry out on their objectives.\n\nThe 3102 payload used in this attack also appears to be related to the Evilgrab payload\n[delivered in the watering hole attack hosted on the President of Myanmar’s website in May](https://blog.paloaltonetworks.com/2015/06/evilgrab-delivered-by-watering-hole-attack-on-president-of-myanmars-website/)\n2015. Additionally, we uncovered ties between the C2 infrastructure and individuals in China\nactive in online hacking forums that claim to work in Trojan development.\n\n[Palo Alto Networks WildFire detected the payload delivered in these spear-phishing attacks as](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\n[malicious, and the payload was also tagged in Palo Alto Networks AutoFocus as](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html) [9002.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.9002)\n\n**_UPDATE 9/24/2015:_** The Palo Alto Networks platform detects the 3012 malware with its\n[spyware signature 9002.RAT.Gen Command And Control Traffic (ID# 14359).](https://threatvault.paloaltonetworks.com/Home/ThreatDetail/14359)\n\n## Delivery Document\n\nThe delivery document attached to the two spear-phishing attacks was an Excel document that\nexploits CVE-2012-0158, specifically exploiting a vulnerability in the MSComctlLib.TreeView\nActiveX control. The malicious Excel document had a filename of電郵名單.xls, which translates\nfrom Chinese to “email list.xls”. Upon successful exploitation, the malicious Excel document\ninstalls a payload and opens a decoy document. The decoy document displays a list of names\nand email addresses of individuals allegedly associated with the Hong Kong Professional\nTeachers' Union.\n\n## 9002 Trojan: 3102 Variant\n\n\n-----\n\nThe threat actors weaponized the malicious Excel spreadsheet to extract and execute an initial\npayload, which is a dropper with a filename DW20.dll that we track as DoWork. This DoWork\nvariant writes a second sample to the %TEMP% folder with a temporary filename and executes\nit.\n\nFigure 1. Malware Execution Flow\n\nThe second payload extracts shellcode from a resource named “RES” and decrypts it by\nsubjecting the resource to the RC4 algorithm twice, first using a key of “Oq9n01Ca9g” and then\nusing the key “12345678”. The shellcode then installs the actual payload of this attack by\nsaving the 3102 payload to “C:\\Program Files\\Common Files\\ODBC\\Mshype.dll” and adding\npersistence via a registry key “HKCU\\Software\\TransPan\\RunPath”. The second payload is\nalso responsible for writing the 3102 Trojan’s 504-byte configuration to the registry, specifically\nin the key “HKCU\\Software\\TransPan\\mshtm”.\n\nThe actors use a clever anti-analysis trick that stores the configuration in the registry, as the\n3102 sample does not contain the configuration itself and relies on the second payload\nmentioned above to be operational. The second payload deletes itself from the system after it\n\n\n-----\n\nexecutes, suggesting that the malware authors added the configuration saving functionality in\nthe second payload to thwart researchers seeking to extract C2 information from the 3102\nsample itself.\n\nThe functional payload uses the string “3102” as the first four-byes of its network\ncommunications with its C2 server, which is the basis for the name ‘3102’. In May 2014,\n[Cylance published an article on a targeted attack against a Chinese national that delivered the](http://blog.cylance.com/another-9002-trojan-variant)\n3102 variant of 9002. When comparing the attacks, we found the following commonalities:\n\n1. Same Mshype.dll filename and file system path for the payload.\n2. Mshype.dll is signed using the same digital certificate belonging to A’digm, Inc.\n3. Shares same registry key for persistence:\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\KB923561: \"rundll32.exe\n\"C:\\Program Files\\Common Files\\ODBC\\Mshype.dll\",Process32First”.\n4. The dropper creates the same registry key: HKCU\\Software\\TransPan\\RunPath:\n\n\"rundll32.exe \"C:\\Program Files\\Common Files\\ODBC\\Mshype.dll\",Process32First\".\n5. Saves its configuration to the same registry key: HKCU\\Software\\TransPan\\mshtm\n6. Uses the same key logging plugin.\n7. Shares common C2 communication protocols.\n\nWhile similarities exist to the payload discussed in Cylance’s article, it is worth exploring some\nspecific attributes and behaviors of the 3102 payload used in the May 2015 attacks on the U.S.\ngovernment and the European media organization to gain a better understanding of the treat\nactors involved.\n\nThis 3102 payload saves the configuration seen in Figure 2 to the registry. The C2 domain\n“ericgoodman.serveblog[.]net” exists within this configuration; however, the configuration also\ncontains the domain “fordnsdynamic.no-ip[.]org” that does not appear to be used anywhere\nwithin the Trojan’s code.\n\n\n-----\n\nFigure 2. 3102 Configuration Saved to the Registry\n\nThe Trojan also contains several debug messages that reference the domain\n“www.aestheticismwoods[.]com”, which is a C2 domain referenced in the Cylance article. This\n3102 sample never communicates with this domain, suggesting that the malware author did not\nremove debugging messages introduced in previous samples of 3102 when compiling the\nparticular sample used in these attacks. The unnecessary inclusion of these two domains\nsuggests that the author of this 3102 sample is rather sloppy with code changes and lacks a\nsense of operational security.\n\n## C2 Communication\n\nTo interact with compromised systems, the actors rely on the 3102 Trojan to communicate with\nits C2 server using one of two different communication methods. The Trojan’s primary method\ninvolves using a custom protocol that has a static string of “3102” as the first four bytes of each\ntransmission and uses LZO to compress its data. Each transmission contains the size of the\nLZO compressed data immediately after the “3102” string, followed by the length of the\ndecompressed data, and finally the compressed data itself. Figure 3 shows a sample of the\ncustom protocol beacon sent from the 3102 variant and the response received from its C2\nserver.\n\nFigure 3. Custom Protocol Used by 3102 to Communicate with C2 server\n\nThe second method 3102 used for C2 communications employs basic HTTP POST requests.\nFigure 4 shows an example HTTP request sent from the 3102 Trojan to its C2 server. The URL\nwithin the POST request is a hexadecimal value that increments with each request. The\ncontent in the HTTP POST, specifically the “AA” string, the content-length of 2 and the useragent of “lynx” are hardcoded into the 3102 Trojan.\n\n\n-----\n\nFigure 4. HTTP POST Request Created by 3102\n\nOnce communications are established between the 3102 Trojan and its C2 server, the threat\nactors can interact with the compromised system and act on their objectives.\n\n## Capabilities and Plugins\n\nThe 3102 Trojan by itself does not contain much in the form of functional capabilities; rather, it\nis a modular Trojan that requires external plugins to provide capabilities. Therefore, the threat\nactors must provide plugins in the form of dynamic link libraries (DLL) that the Trojan will load\nmanually. The author of 3102 chose to manually load the libraries in an attempt to evade\nantivirus engines that scan libraries loaded using the conventional LoadLibraryA and\nLoadLibraryW API functions.\n\nDuring these two attacks, the actors used two different methods to load plugins in the 3102\nTrojan. A third method existed in the code base, but was unused. We will discuss the three\nloading techniques and the plugins that the actors loaded onto compromised systems.\n\n**Embedded Plugins**\n\n3102 can load embedded plugins by manually loading a DLL that exists within the Trojan\nwithout saving the plugin to the file system. The sample used in the attacks described in this\narticle contained only one plugin with the filename of “KeyLogger.dll.” We obtained the filename\n“KeyLogger.dll” from the ‘OriginalFilename’ field in the VERSIONINFO resource of the DLL. As\nthis filename suggests, this plugin provides key logging functionality for the 3102 Trojan by\nmonitoring keystrokes and logging them to a file named “temp_k.ax”. The keylogger also\nencrypts the logged keystrokes saved to temp_k.ax by using an XOR algorithm with 0x56 as\nthe key.\n\n**Plugins over the Wire**\n\n3102 can also load plugins provided directly from the C2 server. This method manually loads a\nDLL from the network communications without saving the DLL to the disk, making it difficult for\nantivirus products to detect its malicious functionality. After manually loading the plugins, 3102\nwill run the plugin by calling the function “CreatePluginObj” within the plugin’s export address\ntable (EAT).\n\nDuring analysis of the attacks, we observed the threat actor sending three different plugins to\nthe 3102 Trojan from the C2 server. The 3102 Trojan loaded these plugins, which allowed the\nactor to use the added functionality to interact with the compromised system. The plugins are\nnot saved to disk, so we extracted and decompressed each plugin from a packet capture and\nobtained their filenames from the ‘OriginalFilename’ field in the VERSIONINFO resource of the\nDLL.\n\n\n-----\n\nThe first plugin has a filename of DownFileS.dll and enables 3102 to carry out file system\nactivities, such as reading, writing and searching for files, as well as enumerating storage\ndevices and volumes. The second plugin is called “FileManagerS.dll” and has a great deal of\nfunctionality overlap with the DownFileS.dll plugin, but it contains the added ability to remove\nfolders and execute files. The third and final plugin provided by the C2 server is called\n“ScreenSpyS.dll” and allows for screen capture and allows the operator to interact with the\nsystem by sending key strokes, mouse movements and mouse clicks.\n\n**Plugins from the File System**\n\nLastly, 3102 can manually load plugins directly from a file named “temp_plugin.ax”. This plugin\nloading method allows the Trojan to save plugins to disk so they persist system reboots. The\n“temp_plugin.ax” file can contain multiple plugins, as 3102 will read the entire temp_plugin.ax\nfile and parse its contents for plugins stored in the following structure:\n\n**Offset** **Description**\n\n0-1 Single byte XOR key\n\n4-8 Length of cipher text\n\n8 Filename of plugin in unicode\n\n528 Beginning of cipher text\n\nWe did not observe the threat actors using this method in this attack; however, it is possible\nthat the threat actors could use the “DownFileS.dll” or “FileManagerS.dll” plugins obtained from\nthe C2 to install plugins that use this loading method.\n\n## Connection to Watering Hole Attack and Chinese Threat Actors\n\nAs previously mentioned, the malware author signed the 3102 sample delivered in the attacks\ndiscussed in this article using a digital certificate issued to A'digm, Inc. The same digital\ncertificate was used to sign a separate 9002 malware sample, which also shared the C2\ndomain “dns.mailpseonfz[.]com” with a second 9002 sample that was not signed with the\nA’digm Inc. certificate. The unsigned 9002 sample was also configured to use the domain\n“dns.websecexp[.]com” as an additional C2 server. This domain was the C2 server used by the\n[Evilgrab payload delivered in the watering hole attack on the President of Myanmar’s website](https://blog.paloaltonetworks.com/2015/06/evilgrab-delivered-by-watering-hole-attack-on-president-of-myanmars-website/)\nthat we discussed in a blog post on June 11, 2015. Figure 5 shows the relationship between\nthe spear-phishing and watering hole attacks.\n\n\n-----\n\nFigure 5. Link Between Samples Signed by A'digm, Inc Certificate and the Watering Hole on\nPresident of Myanmar's Website\n\nWhile it should be noted that dissimilar groups can sign their Trojans using the same digital\ncertificate, we believe that the same threat group is likely involved with both the spear-phishing\nattacks discussed in this article and the watering hole attacks hosted on the President of\nMyanmar’s website. We believe this as it appears that a common malware author may be\ninvolved because the compile times for the 3102 sample (2014-02-28 07:40:37 UTC) and 9002\nsample signed by A'digm, Inc. (2014-02-28 08:07:48 UTC) were less than a half hour from\neach other.\n\nAdditionally, we have not found many other malware samples signed with this certificate,\nindicating it is not in widespread use.\n\nWhile researching the mailpseonfz[.]com and websecexp[.]com domains that created the\ncorrelation between the watering hole and spear-phishing attacks, we noticed that these two\ndomains had historic registrant email addresses that were also used in online forums, primarily\nin Chinese, discussing hacking, Trojan development, and website defacements. The domain\nwebsecexp[.]com was originally registered in 2013 with the email ‘bychinahacker@gmail.com’.\n\n\n-----\n\nIt has since been updated, but the domain has been actor controlled the entire time. Research\non this email shows it has been tied to multiple website defacements and is also used a contact\nemail within multiple Chinese hacking forums as well as for a company located in Guangzhou.\n\nFigure 6. Screenshot of one of the website defacements.\n\nFor a brief period in late 2011 and early 2012, the registrant email for mailpseonfz[.]com was\n‘bubai2012@163[.]com’. The domain was under actor control the entire time, but currently has\nthe registrant information hidden using a registrant protection service. When researching the\nregistrant email we found ties to a Chinese forum advertising for a Software Security Engineer\nposition in Shanghai in 2007. One responder requested to be contacted at that email address\nand said he or she worked in “Trojan testing.”\n\n## Conclusion\n\nUnit 42 detected a cyber espionage group attacking the U.S. government and a European\nmedia organization within days of each other using a spear-phishing attack to deliver a variant\nof the 9002 Trojan called 3102. During the attack, the threat actor provided the 3102 Trojan\nwith three plugins, which allowed the actors to interact with a compromised system’s file\nsystem, log keystrokes and perform screen-capturing activities.\n\nThe threat actors signed the 3102 payload with a digital certificate that was also used to sign a\n9002 sample that has ties to the Evilgrab payload delivered by the watering hole hosted on the\nPresident of Myanmar’s website. Because that certificate doesn’t seem to be in widespread\nuse and the samples were compiled within thirty minutes of each other, we believe the same\nthreat group conducted both of these attacks. The threat group uses both spear-phishing and\nwatering hole attack vectors, along with different families of malware to target individuals and\ngroups of interest. However, while they use different attack vectors and malware, this threat\ngroup also seems to reuse significant portions of their infrastructure between attacks, which\naides in detection and proactive mitigation.\n\n\n-----\n\nResearch on registrant information used to set up infrastructure for these attacks led to ties\nwithin the hacking community in China, indicating the threat group behind this activity is likely\nChinese-based. Interestingly, the tie to a private Chinese company further indicates they are\nlikely being hired as contractors, in contrast to threat groups like APT1 that are associated with\nthe Chinese military.\n\n[The files used in this attack are properly classified as malicious by WildFire. Users of Palo Alto](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\n[Networks Traps advanced endpoint protection are protected from exploitation of the CVE-2012-](https://www.paloaltonetworks.com/products/endpoint-security.html)\n[0158 vulnerability if they have not been able to patch their systems. AutoFocus users can find](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html)\n[more information on samples and indicators related to this attack by viewing the 9002 tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.9002)\n\n## Files\n\n**Filename** **SHA256**\n\n電郵名單.xls 6ec4ec93409227e225d1d9fcf23ac3b73bbcf534e38628ca51e161efa1239f29\n\nDW20.dll dd7bb7544d27114a3ac7c95302c215c1bbd4ddf7bcd8c5fdc3df1c9935c60359\n\n\n%TEMP%\\\n<temporary\nfilename>.tmp\n\n\n6f1b5f73bf33112737418b52b2f2de4e10747d979789531f8992691dda6a0dbb\n\n\nMshype.dll 4a4f4a1a0db0d8b169c214d495049dc7bc1a55d011c0db3ad2aea0e2587afab6\n\n## 3102 Plugins\n\n**Filename** **SHA256**\n\nKeyLogger.dll 2656335c9faf75a29d47002f3a54c503cbeee419fa841de0d8f9a3d4dee19c89\n\nDownFileS.dll bcba4361ba4d0344bb0ed1080fa2fcd3dbdf7e1e91b4d1c85ff8e7091de24ef7\n\nFileManagerS.dll 7db917f8fdd62f321e7547d9bea572670051c44080b1df91f69fad9894fd4fff\n\nScreenSpyS.dll 084f01caf66abfd1f0f3669edfba9e07ea0b436820180d2af066d91642a79794\n\n## Indicators\n\n**Type** **Value**\n\nMutex DATA_RUN_MYWAY\n\nCertificate A'digm, Inc.\n\nDomain ericgoodman.serveblog[.]net\n\n\n-----\n\nRegistry Key HKCU\\Software\\TransPan\\mshtm\n\nRegistry Key HKCU\\Software\\TransPan\\RunPath\n\nDomain dns.websecexp[.]com\n\nDomain dns.mailpseonfz[.]com\n\nRegistrant Email bychinahacker@gmail[.]com\n\nRegistrant Email bubai2012@163[.]com\n\nFilename temp_k.ax\n\nFilename temp_plugin.ax\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-09-23 - Chinese Actors Use ‘3102’ Malware in Attacks on US Government and EU Media.pdf"
    ],
    "report_names": [
        "2015-09-23 - Chinese Actors Use ‘3102’ Malware in Attacks on US Government and EU Media.pdf"
    ],
    "threat_actors": [
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535742,
    "ts_updated_at": 1743041482,
    "ts_creation_date": 1653697976,
    "ts_modification_date": 1653697976,
    "files": {
        "pdf": "https://archive.orkl.eu/d46d02c0ac5baf72c2ba41092742a7ec71e198a7.pdf",
        "text": "https://archive.orkl.eu/d46d02c0ac5baf72c2ba41092742a7ec71e198a7.txt",
        "img": "https://archive.orkl.eu/d46d02c0ac5baf72c2ba41092742a7ec71e198a7.jpg"
    }
}