{
    "id": "3e549b9a-7537-42a9-afd0-3ac473c6b68d",
    "created_at": "2023-01-12T15:02:13.96666Z",
    "updated_at": "2025-03-27T02:10:49.426327Z",
    "deleted_at": null,
    "sha1_hash": "31601e7048fec7ed90b22731fcdfbfb434b1b2f5",
    "title": "2019-02-26 - New Golang brute forcer discovered amid rise in e-commerce attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T19:21:22Z",
    "file_modification_date": "2022-05-28T19:21:22Z",
    "file_size": 1364665,
    "plain_text": "# New Golang brute forcer discovered amid rise in e- commerce attacks\n\n**[blog.malwarebytes.com/threat-analysis/2019/02/new-golang-brute-forcer-discovered-amid-rise-e-commerce-attacks/](https://blog.malwarebytes.com/threat-analysis/2019/02/new-golang-brute-forcer-discovered-amid-rise-e-commerce-attacks/)**\n\nJérôme Segura February 26, 2019\n\nE-commerce websites continue to be targeted by online criminals looking to steal personal\nand payment information directly from unaware shoppers. Recently, attacks have been\nconducted via skimmer, which is a piece of code that is either directly injected into a hacked\nsite or referenced externally. Its purpose is to watch for user input, in particular around online\nshopping carts, and send the perpetrators that data, such as credit card numbers and\npasswords, in clear text.\n\nCompromising e-commerce sites can be achieved in more than one way. Vulnerabilities in\npopular Content Management Systems (CMSes) like Magento, as well as in various plugins\nare commonly exploited these days. But because many website owners still use weak\npasswords, brute force attacks where multiple logins are attempted are still a viable option.\n\nOur investigation started following the discovery of many Magento websites that were newly\ninfected. We pivoted on the domain name used by the skimmer and found a connection to a\nnew piece of malware that turned out to be a brute forcer for Magento, phpMyAdmin, and\ncPanel. While we can’t ascertain for sure whether this is how the skimmer was injected, we\nbelieve this may be one of many campaigns currently going after e-commerce sites.\n\n## Compromised website\n\n\n-----\n\nThe malicious code was found injected directly into the site s homepage, referencing an\nexternal piece of JavaScript. This means that the shopping site had been compromised\neither via a vulnerability or by brute forcing the administrator password.\n\n[The online store is running the Magento CMS and using the OneStepCheckout library to](https://www.onestepcheckout.com/)\nprocess customers’ shopping carts. As the victim enters their address and payment details,\ntheir data is exfiltrated via a POST request with the information in Base64 format to\n_googletagmanager[.]eu. This domain has been flagged before as part of criminal activities_\n[related to the Magecart threat groups.](https://blog.malwarebytes.com/cybercrime/2018/09/how-to-protect-your-data-from-magecart-and-other-e-commerce-attacks/)\n\n\n-----\n\nUsing [VirusTotal Graph, we found a connection between this e-commerce site and a piece of](https://www.virustotal.com/#/graph-overview)\nmalware written in Golang, more specifically a network query from the piece of malware to\nthe compromised website. Expanding on it, we saw that the malware was dropped by yet\nanother binary written in Delphi. Perhaps more interestingly, this opened up another large set\nof domains with which the malware communicates.\n\n\n-----\n\n## Payload analysis\n\n**Delphi downloader**\n\n[The first part is a downloader we detect as Trojan.WallyShack that has two layers of](https://blog.malwarebytes.com/detections/trojan-wallyshack/)\npacking. The first layer is UPX. After unpacking it with the default UPX, we get the second\nlayer: an underground packer using process hollowing.\n\n\n-----\n\nThe downloader is pretty simple. First, it collects some basic information about the system,\nand then it beacons to the C2. We can see that the domain names for the panels are\nhardcoded in the binary:\n\nThe main goal of this element is to download and run a payload file:\n\n\n-----\n\n**Golang payload**\n\nHere the dropped payload installs itself in the Startup folder, by first dumping a bash script in\n%TEMP%, which is then deployed under the Startup folder. The sample is not packed, and\nlooking inside, we can find artifacts indicating that it was written in Golang version 1.9. We\ndetect this file as **_[Trojan.StealthWorker.GO.](https://blog.malwarebytes.com/detections/trojan-stealthworker-go/)_**\n\nThe procedure of reversing will be similar to what we have done before with another Golang\nsample. Looking at the functions with prefix “main_”, we can distinguish the functions that\nwere part of the analyzed binary, rather than part of statically-linked libraries.\n\n\n-----\n\nWe found several functions with the name “Brut,” suggesting this piece of malware is\ndedicated to brute forcing.\n\n\n-----\n\nThis is the malware sample that communicated with the aforementioned compromised ecommerce site. In the following section, we will review how communication and tasks are\nimplemented.\n\n## Bot communication and brute forcing\n\nUpon execution, the Golang binary will connect to 5.45.69[.]149. Checking that IP address,\nwe can indeed see a web panel:\n\n\n-----\n\nThe bot proceeds to report the infected computer is ready for a new task via a series of\nHTTP requests announcing itself and then receiving instructions. You can see below how the\n[bot will attempt to brute force Magento sites leveraging the /downloader/directory point of](https://magento.stackexchange.com/questions/16504/recommended-method-to-protect-downloader)\nentry:\n\n\n-----\n\nBrute force attacks can be quite slow given the number of possible password combinations.\nFor this reason, criminals usually leverage CMS or plugin vulnerabilities instead, as they\nprovide a much faster return on investment. Having said that, using a botnet to perform login\nattempts allows threat actors to distribute the load onto a large number of workers. Given\nthat many people are still using weak passwords for authentication, brute forcing can still be\nan effective method to compromise websites.\n\n## Attack timeframe and other connections\n\nWe found many different variants of that Golang sample, the majority of them first seen in\nVirusTotal in early February (hashes available in the IOCs section below).\n\n\n-----\n\nChecking on some of these other samples, we noticed that there’s more than just Magento\nbrute forcing. Indeed, some bots are instead going after WordPress sites, for example.\nWhenever the bot checks back with the server, it will receive a new set of domains and\n[passwords. Here’s an example of brute forcing phpMyAdmin:](https://docs.phpmyadmin.net/en/latest/faq.html#which-parameters-can-i-use-in-the-url-that-starts-phpmyadmin)\n\n\n-----\n\n```\nPOST:\nset_session=&pma_username=Root&pma_password=Administ..&server=1&target=\nindex.php&token=\nUser-Agent:\nMozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:62.0) Gecko/20100101 Firefox/62.0\n\n```\n[As we were investigating this campaign, we saw a tweet by Willem de Groot noting a recent](https://twitter.com/gwillem/status/1098606425872498690)\nincrease in skimmers related to googletagmanager[.]eu, [tied to Adminer, a database](https://twitter.com/gwillem/status/1098926474571235329)\nmanagement utility. The shopping site on which we started our research was compromised\nonly a few days ago. Without server logs and the ability to perform a forensic investigation,\nwe can only assume it was hacked in one of many possible scenarios, including the\nAdminer/MySQL flaw or brute forcing the password.\n\n## Multiple weaknesses\n\nThere are many different weaknesses in this ecosystem that can be exploited. From website\nowners not being diligent with security updates or their passwords, to end users running\ninfected computers turned into bots and unknowingly helping to hack web portals.\n\n\n-----\n\nAs always, it is important to keep web server software up-to-date and augment this\nprotection by using a web application firewall to fend off new attacks. There are different\nmethods to thwart brute force attacks, including the use of the .htaccess file to restrict which\nIP address is allowed to log in.\n\nSkimmers are a real problem for online shoppers who are becoming more and more wary of\nentering their personal information into e-commerce websites. While victims may not know\nwhere and when theft happened, it does not bode well for online merchants when their\nplatform has been compromised.\n\nMalwarebytes detects the malware used in these attacks and blocks the skimmer gate.\n\n_[With additional contributions from @hasherezade.](https://twitter.com/hasherezade)_\n\n## Indicators of Compromise (IOCs)\n\nSkimmer domain\n```\ngoogletagmanager[.]eu\n\n```\nDelphi downloader\n```\ncbe74b47bd7ea953268b5df3378d11926bf97ba72d326d3ce9e0d78f3e0dc786\n\n```\nDelphi C2\n```\nsnaphyteplieldup[.]xyz\ntolmets[.]info\nserversoftwarebase[.]com\n\n```\nGolang bruteforcer\n```\nfdc3e15d2bc80b092f69f89329ff34b7b828be976e5cbe41e3c5720f7896c140\n\n```\nSimilar Golang bruteforcers\n\n\n-----\n\n```\n46fd1e8d08d06cdb9d91e2fe19a1173821dffa051315626162e9d4b38223bd4a\n05073af551fd4064cced8a8b13a4491125b3cd1f08defe3d3970b8211c46e6b2\nfdc3e15d2bc80b092f69f89329ff34b7b828be976e5cbe41e3c5720f7896c140\n96a5b2a8fdc28b560f92937720ad0dcc5c30c705e4ce88e3f82c2a5d3ad085aa\n81bd819f0feead6f7c76da3554c7669fbc294f5654a8870969eadc9700497b82\n5e7581e3c8e913fe22d56a3b4b168fd5a9f3f8d9e0d2f8934f68e31a23feabd5\nd87b4979c26939f0750991d331896a3a043ecd340940feb5ac6ec5a29ec7b797\n36d62acd7aba4923ed71bfd4d2971f9d0f54e9445692b639175c23ff7588f0a7\n7db29216bcb30307641b607577ded4a6ede08626c4fa4c29379bc36965061f62\n4e18c0b316279a0a9c4d27ba785f29f4798b9bbebb43ea14ec0753574f40a54f\n91a696d1a0ef2819b2ebb7664e79fa9a8e3d877bedcb5e99f05b1dc898625ed5\n8b1b2dee404f274e90bd87ff6983d2162abee16c4d9868a10b802bd9bcbdbec6\n046c5b18ec037ec5fbdd9be3e6ee433df3e4d2987ee59702b52d40e7f278154d\n6b79345a2016b2822fd7f7bed51025b848b37e026d4638af59547e67078c913e\n181ebf89a32a37752e0fc96e6020aa7af6dbb00ddb7ba02133e3804ac4d33f43\n5efd1a27717d3e41281c08f8c048523e43b95300fb6023d34cb757e020f2ff7f\n5dccce9b5611781c0edee4fae015119b49ce9eb99ee779e161ec0e75c1c383da\n\n```\nC2 server\n```\n5.45.69[.]149:7000\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-26 - New Golang brute forcer discovered amid rise in e-commerce attacks.pdf"
    ],
    "report_names": [
        "2019-02-26 - New Golang brute forcer discovered amid rise in e-commerce attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535733,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653765682,
    "ts_modification_date": 1653765682,
    "files": {
        "pdf": "https://archive.orkl.eu/31601e7048fec7ed90b22731fcdfbfb434b1b2f5.pdf",
        "text": "https://archive.orkl.eu/31601e7048fec7ed90b22731fcdfbfb434b1b2f5.txt",
        "img": "https://archive.orkl.eu/31601e7048fec7ed90b22731fcdfbfb434b1b2f5.jpg"
    }
}