{
    "id": "3e5d31a4-e8ef-420f-932f-860cb1536185",
    "created_at": "2023-01-12T15:01:34.227116Z",
    "updated_at": "2025-03-27T02:16:22.760984Z",
    "deleted_at": null,
    "sha1_hash": "9cac91ff51adee6fd0a04f4722d4f76e0d436857",
    "title": "2015-09-09 - Satellite Turla- APT Command and Control in the Sky",
    "authors": "",
    "file_creation_date": "2022-05-28T21:44:51Z",
    "file_modification_date": "2022-05-28T21:44:51Z",
    "file_size": 1982890,
    "plain_text": "# Satellite Turla: APT Command and Control in the Sky\n\n**[securelist.com/satellite-turla-apt-command-and-control-in-the-sky/72081/](https://securelist.com/satellite-turla-apt-command-and-control-in-the-sky/72081/)**\n\nAuthors\n\n[Stefan Tanase](https://securelist.com/author/stefan/)\n\n## How the Turla operators hijack satellite Internet links\n\nHave you ever watched satellite television? Were you amazed by the diversity of TV\nchannels and radio stations available? Have you ever looked in wonder at satellite phones or\nsatellite-based Internet connections wondering what makes them tick? What if we told you\nthat there’s more to satellite-based Internet connections than entertainment, traffic and\nweather? Much, much more.\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/Du3rBVZqKkk\n\nWhen you are an APT group, you need to deal with many different problems. One of them,\nand perhaps the biggest, is the constant seizure and takedown of domains and servers used\nfor command-and-control (C&C). These servers are constantly appropriated by law\nenforcement or shut down by ISPs. Sometimes they can be used to trace the attackers back\nto their physical locations.\n\nSome of the most advanced threat actors or users of commercial hacking tools have found a\nsolution to the takedown problem — the use of satellite-based Internet links. In the past,\nwe’ve seen three different actors using such links to mask their operations. The most\ninteresting and unusual of them is the Turla group.\n\nAlso known as Snake or Uroburos, names which come from its top class rootkit, the Turla\ncyber-espionage group has been active for more than 8 years. Several papers have been\n[published about the group’s operations, but until the Epic Turla research was published by](https://securelist.com/the-epic-turla-operation/65545/)\nKaspersky Lab, little information was available about the more unusual aspects of their\noperations, such as the first stages of infection through watering-hole attacks.\n\nWhat makes the Turla group special is not just the complexity of its tools, which include the\nUroboros rootkit, aka “Snake”, as well as mechanisms designed to bypass air gaps through\nmulti-stage proxy networks inside LANs, but the exquisite satellite-based C&C mechanism\nused in the latter stages of the attack.\n\nIn this blog, we hope to shed more light on the satellite-based C&C mechanisms that APT\ngroups, including the Turla/Snake group, use to control their most important victims. As the\nuse of these mechanisms becomes more popular, it’s important for system administrators to\n\n\n-----\n\ndeploy the correct defense strategies to mitigate such attacks. For IOCs, see the appendix.\n\n## Technical details\n\nAlthough relatively rare, since 2007 several elite APT groups have been using — and\nabusing — satellite links to manage their operations — most often, their C&C infrastructure.\nTurla is one of them. Using this approach offers some advantages, such as making it hard to\nidentify the operators behind the attack, but it also poses some risks to the attackers.\n\nOn the one hand, it’s valuable because the true location and hardware of the C&C server\ncannot be easily determined or physically seized. Satellite-based Internet receivers can be\nlocated anywhere within the area covered by a satellite, and this is generally quite large. The\nmethod used by the Turla group to hijack the downstream links is highly anonymous and\ndoes not require a valid satellite Internet subscription.\n\nOn the other hand, the disadvantage comes from the fact that satellite-based Internet is slow\nand can be unstable.\n\nIn the beginning, it was unclear to us and other researchers whether some of the links\nobserved were commercial Internet connections via satellite, purchased by the attackers, or\nif the attackers had breached the ISPs and performed Man-in-the-Middle (MitM) attacks at\nthe router level to hijack the stream. We have analyzed these mechanisms and come to the\nastonishing conclusion that the method used by the Turla group is incredibly simple and\nstraightforward as well as highly anonymous and very cheap to operate and manage\n\n\n-----\n\n## Real satellite links, MitM attacks or BGP hijacking?\n\nPurchasing satellite-based Internet links is one of the options APT groups can choose to\nsecure their C&C traffic. However, full duplex satellite links can be very expensive: a simple\nduplex 1Mbit up/down satellite link may cost up to $7000 per week. For longer term contracts\nthis cost may decrease considerably, but the bandwidth still remains very expensive.\n\nAnother way of getting a C&C server into a satellite’s IP range is to hijack the network traffic\nbetween the victim and the satellite operator and to inject packets along the way. This\nrequires either exploitation of the satellite provider itself, or of another ISP on the way.\n\nThese kinds of hijacking attacks have been observed in the past and were documented by\nRenesys (now part of Dyn) in a blogpost dated November 2013.\n\nAccording to Renesys: “Various providers’ BGP routes were hijacked, and as a result a\n_portion of their Internet traffic was misdirected to flow through Belarusian and Icelandic ISPs._\n_We have BGP routing data that show the second-by-second evolution of 21 Belarusian_\n_events in February and May 2013, and 17 Icelandic events in July- August 2013.”_\n\nIn a [more recent blogpost from 2015, Dyn researchers point out that: “For security analysts](http://research.dyn.com/2015/01/vast-world-of-fraudulent-routing/)\n_reviewing alert logs, it is important to appreciate that the IP addresses identified as the_\n_source of incidents can and are regularly spoofed. For example, an attack that appeared to_\n_come from a Comcast IP located in New Jersey may really have been from a hijacker_\n_located in Eastern Europe, briefly commandeering Comcast IP space. It is interesting to note_\n_that all six cases discussed above were conducted from either Europe or Russia.”_\n\nObviously, such incredibly apparent and large-scale attacks have little chance of surviving for\nlong periods of time, which is one of the key requirements for running an APT operation. It is\ntherefore not very feasible to perform the attack through MitM traffic hijacking, unless the\nattackers have direct control over some high-traffic network points, such as backbone routers\nor fiber optics. There are signs that such attacks are becoming more common, but there is a\nmuch simpler way to hijack satellite-based Internet traffic.\n\n\n-----\n\n## Satellite link (DVB-S) hijacking\n\nThe hijacking of satellite DVB-S links has been described a few times in the past and a\n[presentation on hijacking satellite DVB links was delivered at BlackHat 2010 by the S21Sec](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2015/09/20081827/BlackHat-DC-2010-Nve-Playing-with-SAT-1.2-wp.pdf)\nresearcher Leonardo Nve Egea.\n\nTo hijack satellite DVB-S links, one needs the following:\n\nA satellite dish – the size depends on geographical position and satellite\nA low-noise block downconverter (LNB)\nA dedicated DVB-S tuner (PCIe card)\nA PC, preferably running Linux\n\nWhile the dish and the LNB are more-or-less standard, the card is perhaps the most\nimportant component. Currently, the best DVB-S cards are made by a company called TBS\nTechnologies. The [TBS-6922SE is perhaps the best entry-level card for the task.](http://www.tbsdtv.com/products/tbs6922se-dvb-s2-tv-tuner-pcie-card.html)\n\n\n-----\n\n_TBS-6922SE PCIe card for receiving DVB-S channels_\n\nThe TBS card is particularly well-suited to this task because it has dedicated Linux kernel\ndrivers and supports a function known as a brute-force scan which allows wide-frequency\nranges to be tested for interesting signals. Of course, other PCI or PCIe cards might work as\nwell, while, in general the USB-based cards are relatively poor and should be avoided.\n\nUnlike full duplex satellite-based Internet, the downstream-only Internet links are used to\naccelerate Internet downloads and are very cheap and easy to deploy. They are also\ninherently insecure and use no encryption to obfuscate the traffic. This creates the possibility\nfor abuse.\n\nCompanies that provide downstream-only Internet access use teleport points to beam the\ntraffic up to the satellite. The satellite broadcasts the traffic to larger areas on the ground, in\nthe Ku band (12-18Ghz) by routing certain IP classes through the teleport points.\n\n## How does satellite internet hijacking work?\n\n\n-----\n\nTo attack satellite-based Internet connections, both the legitimate users of these links as well\nas the attackers’ own satellite dishes point to the specific satellite that is broadcasting the\ntraffic. The attackers abuse the fact that the packets are unencrypted. Once an IP address\nthat is routed through the satellite’s downstream link is identified, the attackers start listening\nfor packets coming from the Internet to this specific IP. When such a packet is identified, for\ninstance a TCP/IP SYN packet, they identify the source and spoof a reply packet (e.g. SYN\nACK) back to the source using a conventional Internet line.\n\nAt the same time, the legitimate user of the link just ignores the packet as it goes to an\notherwise unopened port, for instance, port 80 or 10080. There is an important observation\nto make here: normally, if a packet hits a closed port, a RST or FIN packet will be sent back\nto the source to indicate that there is nothing expecting the packet. However, for slow links,\nfirewalls are recommended and used to simply DROP packets to closed ports. This creates\nan opportunity for abuse.\n\n## Abused Internet ranges\n\nDuring the analysis, we observed the Turla attackers abusing several satellite DVB-S\nInternet providers, most of them offering downstream-only connections in the Middle East\nand Africa. Interestingly, the coverage of these beams does not include Europe or Asia,\nmeaning that a dish is required in either the Middle East or Africa. Alternatively, a much\nlarger dish (3m+) can be used in other areas to boost the signal.\n\nTo calculate the dish size, one can use various tools, including online resources such as\nsatbeams.com:\n\n\n-----\n\n_Sample dish calculation – (c) www.satbeams.com_\n\nThe table below shows some of the command-and-control servers related to the Turla actor\nwith domains resolving to an IP belonging to satellite-based Internet providers:\n\n**IP** **First seen** **Hosts**\n\n84.11.79.6 Nov, 2007 n/a, see note below\n\n92.62.218.99 Feb 25th, 2014 pressforum.serveblog.net\n\nmusic-world.servemp3.com\n\n209.239.79.47 Feb 27th, 2014 pressforum.serveblog.net\n\nmusic-world.servemp3.com\n\n209.239.79.52 March 18th, 2014 hockey-news.servehttp.com\n\n209.239.79.152 March 18th, 2014 hockey-news.servehttp.com\n\n209.239.79.33 January 25th, 2014 eu-society.com\n\n\n-----\n\n92.62.220.170 March 19th, 2014 cars-online.zapto.org\n\nfifa-rules.25u.com\n\nforum.sytes.net\n\nhealth-everyday.faqserv.com\n\nmusic-world.servemp3.com\n\nnhl-blog.servegame.com\n\nolympik-blog.4dq.com\n\nsupernews.sytes.net\n\ntiger.got-game.org\n\ntop-facts.sytes.net\n\nx-files.zapto.org\n\n92.62.219.172 April 26th, 2013 eu-society.com\n\n82.146.174.58 May 28th, 2014 forum.sytes.net\n\nhockey-news.servehttp.com\n\nleagueoflegends.servequake.com\n\nmusic-world.servemp3.com\n\n82.146.166.56 March 11th, 2014 easport-news.publicvm.com\n\n82.146.166.62 June 24th, 2014 hockey-news.servehttp.com\n\n62.243.189.231 April 4th, 2014 africankingdom.deaftone.com\n\naromatravel.org\n\nmarketplace.servehttp.com\n\nnewutils.3utilities.com\n\npeople-health.net\n\npressforum.serveblog.net\n\nweather-online.hopto.org\n\n77.246.76.19 March 17th, 2015 onlineshop.sellclassics.com\n\n62.243.189.187 May 2nd, 2012 eu-society.com\n\n62.243.189.215 January 3rd, 2013 people-health.net\n\n217.20.243.37 July 3, 2014 forum.sytes.net\n\nmusic-world.servemp3.com\n\n217.20.242.22 September 1st, 2014 mediahistory.linkpc.net\n\n\n-----\n\n83.229.75.141 August 05, 2015 accessdest.strangled.net\n\nchinafood.chickenkiller.com\n\ncoldriver.strangled.net\n\ndeveloparea.mooo.com\n\ndowntown.crabdance.com\n\ngreateplan.ocry.com\n\nindustrywork.mooo.com\n\nradiobutton.mooo.com\n\nsecuresource.strangled.net\n\nsportnewspaper.strangled.net\n\nsupercar.ignorelist.com\n\nsupernews.instanthq.com\n\n_Note: 84.11.79.6 is hardcoded in the configuration block of the malicious sample._\n\nThe observed satellite IPs have the following ‘WHOIS’ information:\n\n**IP** **Country** **ISP**\n\n\n92.62.220.170\n\n92.62.219.172\n\n92.62.218.99\n\n209.239.79.47\n\n209.239.79.52\n\n209.239.79.152\n\n209.239.79.33\n\n82.146.174.58\n\n82.146.166.56\n\n82.146.166.62\n\n62.243.189.231\n\n62.243.189.187\n\n62.243.189.215\n\n77.246.71.10\n\n77.246.76.19\n\n\nNigeria Skylinks Satellite Communications Limited\n\nUAE Teleskies, Telesat Network Services Inc\n\nLebanon Lunasat Isp\n\nDenmark Emperion\n\nLebanon Intrasky Offshore S.a.l.\n\n\n84.11.79.6 Germany IABG mbH\n\n217.20.243.37 Somalia Sky Power International Ltd\n\n217.20.242.22 Nigeria Sky Power International Ltd\n\n83.229.75.141 United Kingdom SkyVision Global Networks Ltd\n\n217.194.150.31 Niger SkyVision Global Networks Ltd\n\n41.190.233.29 Congo Orioncom\n\n\n-----\n\nOne interesting case is probably 84.11.79.6, which falls into the satellite IP range of IABG\nmbH.\n\nThis IP is encrypted in the C&C of the following backdoor used by Turla group, known as\n[“Agent.DNE“:](https://www.virustotal.com/en/file/7d5d7a372d6b4b48640fae95238ee74b99be35d8e64b4de5bde8d8d140c91d7c/analysis/1430803399/)\n\nmd5 0328dedfce54e185ad395ac44aa4223c\n\nsize 91136 bytes\n\ntype Windows PE\n\n_Agent.DNE C&C configuration_\n\nThis Agent.DNE sample has a compilation timestamp of Thu Nov 22 14:34:15 2007,\nmeaning that the Turla group has been using satellite-based Internet links for almost eight\nyears.\n\n## Conclusions\n\nThe regular usage of satellite-based Internet links by the Turla group represents an\ninteresting aspect of their operation. The links are generally up for several months, but never\nfor too long. It is unknown if this is due to operational security limitations self-imposed by the\ngroup or because of shutdown by other parties due to malicious behavior.\n\nThe technical method used to implement these Internet circuits relies on hijacking\ndownstream bandwidth from various ISPs and packet-spoofing. This is a method that is\ntechnically easy to implement, and provides a much higher degree of anonymity than\n\n\n-----\n\npossibly any other conventional method such as renting a VPS or hacking a legitimate\nserver.\n\nTo implement this attack methodology, the initial investment is less than $1000. Regular\nmaintenance should be less than $1000 per year. Considering how easy and cheap this\nmethod is, it is surprising that we have not seen more APT groups using it. Even though this\nmethod provides an unmatched level of anonymfor logistical reasons it is more\nstraightforward to rely on bullet-proof hosting, multiple proxy levels or hacked websites. In\ntruth, the Turla group has been known to use all of these techniques, making it a very\nversatile, dynamic and flexible cyber-espionage operation.\n\nLastly, it should be noted that Turla is not the only APT group that has used satellite-based\nInternet links. HackingTeam C&Cs were seen on satellite IPs before, as well as C&Cs from\nthe Xumuxu group and, more recently the Rocket Kitten APT group.\n\nIf this method becomes widespread between APT groups or worse, cyber-criminal groups,\nthis will pose a serious problem for the IT security and counter-intelligence communities.\n\n_* A full paper on the Turla group’s use of satellite-based Internet links is available to the_\n_customers of Kaspersky Intelligence Services._\n\n## Indicators of compromise:\n\n### IPs:\n\n84.11.79.6\n\n41.190.233.29\n\n62.243.189.187\n\n62.243.189.215\n\n62.243.189.231\n\n77.246.71.10\n\n77.246.76.19\n\n77.73.187.223\n\n82.146.166.56\n\n82.146.166.62\n\n82.146.174.58\n\n83.229.75.141\n\n92.62.218.99\n\n92.62.219.172\n\n92.62.220.170\n\n92.62.221.30\n\n92.62.221.38\n\n209.239.79.121\n\n209 239 79 125\n\n\n-----\n\n209.239.79.15\n209.239.79.152\n209.239.79.33\n209.239.79.35\n209.239.79.47\n209.239.79.52\n209.239.79.55\n209.239.79.69\n209.239.82.7\n209.239.85.240\n209.239.89.100\n217.194.150.31\n217.20.242.22\n217.20.243.37\n\n### Hostnames:\n\naccessdest.strangled[.]net\n\nbookstore.strangled[.]net\n\nbug.ignorelist[.]com\n\ncars-online.zapto[.]org\n\nchinafood.chickenkiller[.]com\n\ncoldriver.strangled[.]net\n\ndeveloparea.mooo[.]com\n\ndowntown.crabdance[.]com\n\neasport-news.publicvm[.]com\n\neurovision.chickenkiller[.]com\n\nfifa-rules.25u[.]com\n\nforum.sytes[.]net\n\ngoldenroade.strangled[.]net\n\ngreateplan.ocry[.]com\n\nhealth-everyday.faqserv[.]com\n\nhighhills.ignorelist[.]com\n\nhockey-news.servehttp[.]com\n\nindustrywork.mooo[.]com\n\nleagueoflegends.servequake[.]com\n\nmarketplace.servehttp[.]com\n\nmediahistory.linkpc[.]net\n\nmusic-world.servemp3[.]com\n\nnew-book.linkpc[.]net\n\nnewgame.2waky[.]com\n\nnewutils.3utilities[.]com\n\nnhl-blog.servegame[.]com\n\n\n-----\n\nnightstreet.toh[.]info\nolympik-blog.4dq[.]com\nonlineshop.sellclassics[.]com\npressforum.serveblog[.]net\nradiobutton.mooo[.]com\nsealand.publicvm[.]com\nsecuresource.strangled[.]net\nsoftstream.strangled[.]net\nsportacademy.my03[.]com\nsportnewspaper.strangled[.]net\nsupercar.ignorelist[.]com\nsupernews.instanthq[.]com\nsupernews.sytes[.]net\ntelesport.mooo[.]com\ntiger.got-game[.]org\ntop-facts.sytes[.]net\ntrack.strangled[.]net\nwargame.ignorelist[.]com\nweather-online.hopto[.]org\nwintersport.mrbasic[.]com\nx-files.zapto[.]org\n\n### MD5s:\n\n0328dedfce54e185ad395ac44aa4223c\n\n18da7eea4e8a862a19c8c4f10d7341c0\n\n2a7670aa9d1cc64e61fd50f9f64296f9\n\n49d6cf436aa7bc5314aa4e78608872d8\n\na44ee30f9f14e156ac0c2137af595cf7\n\nb0a1301bc25cfbe66afe596272f56475\n\nbcfee2fb5dbc111bfa892ff9e19e45c1\n\nd6211fec96c60114d41ec83874a1b31d\n\ne29a3cc864d943f0e3ede404a32f4189\n\nf5916f8f004ffb85e93b4d205576a247\n\n594cb9523e32a5bbf4eb1c491f06d4f9\n\nd5bd7211332d31dcead4bfb07b288473\n\n### Kaspersky Lab products detect the above Turla samples with the following verdicts:\n\nBackdoor.Win32.Turla.cd\n\nBackdoor.Win32.Turla.ce\n\nBackdoor.Win32.Turla.cl\n\n\n-----\n\nBackdoor.Win32.Turla.ch\nBackdoor.Win32.Turla.cj\nBackdoor.Win32.Turla.ck\nTrojan.Win32.Agent.dne\n\n## References:\n\n[1. Agent.btz: a Source of Inspiration?](https://securelist.com/agent-btz-a-source-of-inspiration/58551/)\n[2. The Epic Turla operation](https://securelist.com/the-epic-turla-operation/65545/)\n[3. The ‘Penquin’ Turla](https://securelist.com/the-penquin-turla-2/67962/)\n\n[APT](https://securelist.com/tag/apt/)\n[Cyber espionage](https://securelist.com/tag/cyber-espionage/)\n[Turla](https://securelist.com/tag/turla/)\n\nAuthors\n\n[Stefan Tanase](https://securelist.com/author/stefan/)\n\nSatellite Turla: APT Command and Control in the Sky\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-09-09 - Satellite Turla- APT Command and Control in the Sky.pdf"
    ],
    "report_names": [
        "2015-09-09 - Satellite Turla- APT Command and Control in the Sky.pdf"
    ],
    "threat_actors": [
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "79bd28a6-dc10-419b-bee7-25511ae9d3d4",
            "created_at": "2023-01-06T13:46:38.581534Z",
            "updated_at": "2025-03-27T02:00:02.865836Z",
            "deleted_at": null,
            "main_name": "Callisto",
            "aliases": [
                "GOSSAMER BEAR",
                "BlueCharlie",
                "Star Blizzard",
                "TAG-53",
                "UNC4057",
                "COLDRIVER",
                "TA446",
                "IRON FRONTIER",
                "Blue Callisto",
                "SEABORGIUM"
            ],
            "source_name": "MISPGALAXY:Callisto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a057a97-db21-4261-804b-4b071a03c124",
            "created_at": "2024-06-04T02:03:07.953282Z",
            "updated_at": "2025-03-27T02:05:17.406598Z",
            "deleted_at": null,
            "main_name": "IRON FRONTIER",
            "aliases": [
                "BlueCharlie ",
                "CALISTO ",
                "COLDRIVER ",
                "Callisto Group ",
                "Gossamer Bear ",
                "Gossamer Bear ",
                "SEABORGIUM ",
                "Star Blizzard ",
                "TA446 ",
                "Blue Callisto "
            ],
            "source_name": "Secureworks:IRON FRONTIER",
            "tools": [
                " Galileo RCS",
                " SPICA",
                "Evilginx2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3aedca2f-6f6c-4470-af26-a46097d3eab5",
            "created_at": "2024-11-01T02:00:52.689773Z",
            "updated_at": "2025-03-27T02:00:55.508065Z",
            "deleted_at": null,
            "main_name": "Star Blizzard",
            "aliases": [
                "Star Blizzard",
                "SEABORGIUM",
                "Callisto Group",
                "TA446",
                "COLDRIVER"
            ],
            "source_name": "MITRE:Star Blizzard",
            "tools": [
                "Spica"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535694,
    "ts_updated_at": 1743041782,
    "ts_creation_date": 1653774291,
    "ts_modification_date": 1653774291,
    "files": {
        "pdf": "https://archive.orkl.eu/9cac91ff51adee6fd0a04f4722d4f76e0d436857.pdf",
        "text": "https://archive.orkl.eu/9cac91ff51adee6fd0a04f4722d4f76e0d436857.txt",
        "img": "https://archive.orkl.eu/9cac91ff51adee6fd0a04f4722d4f76e0d436857.jpg"
    }
}