{
    "id": "3e83a556-96dd-4a96-880a-02892b6b5e58",
    "created_at": "2022-10-25T16:48:14.03767Z",
    "updated_at": "2025-03-27T02:05:55.058027Z",
    "deleted_at": null,
    "sha1_hash": "095871915af386b3addb87036dfca584473b283c",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-10-02T01:36:05Z",
    "file_modification_date": "2019-10-02T01:36:05Z",
    "file_size": 1150664,
    "plain_text": "# New Fileless Botnet Novter Distributed by KovCoreG Malvertising Campaign\n\n[Posted on:October 1, 2019 at 5:00 am](https://blog.trendmicro.com/trendlabs-security-intelligence/2019/10/)\n[Posted in:Bad Sites, Botnets, Malware](https://blog.trendmicro.com/trendlabs-security-intelligence/category/bad-websites/)\nAuthor:\n[Trend Micro](https://blog.trendmicro.com/trendlabs-security-intelligence/author/trend-micro/)\n\n0\n\n**_By Jaromir Horejsi and Joseph C. Chen (Threat Researchers)_**\n\nWe found a new modular fileless botnet malware, which we named “Novter,” (also reported and known as\n[“Nodersok” and “Divergent”) that the KovCoreG campaign has been distributing since March. We’ve been](https://www.microsoft.com/security/blog/2019/09/26/bring-your-own-lolbin-multi-stage-fileless-nodersok-campaign-delivers-rare-node-js-based-malware/)\nactively monitoring this threat since its emergence and early development, and saw it being frequently\nupdated. [KovCoreG, active since 2011, is a long-running campaign known for using the](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-kovcoreg-kovter-saga) [Kovter botnet](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/kovter-an-evolving-malware-gone-fileless)\nmalware, which was distributed mainly through malvertisements and [exploit kits. Kovter has been involved](https://www.trendmicro.com/vinfo/us/security/definition/exploit-kit)\nin click fraud operations since 2015, using fraudulent ads that have reportedly cost businesses more than\n[US$29 million. The botnet was](https://www.justice.gov/usao-edny/pr/two-international-cybercriminal-rings-dismantled-and-eight-defendants-indicted-causing) [taken down at the end of 2018 through concerted efforts by law enforcement](https://www.whiteops.com/3ve)\nand cybersecurity experts, including Trend Micro.\n\nThe dismantlement hasn’t deterred the cybercriminals. Though the botnet is dead, we noticed that the\nKovCoreG campaign didn’t stop their activities and instead developed another botnet. Working with\nProofPoint’s threat researcher [Kafeine, we were able to uncover a new fileless botnet malware — Novter —](https://twitter.com/kafeine)\nbeing distributed by the operators of KovCoreG.\n\nWhile the malvertising attacks were originally focused on U.S.-based users, they have since expanded to\nseveral European countries starting this summer. Our telemetry also revealed that the malvertising attacks\nwere being distributed through a few of top 100 websites in the U.S., which were also [abused by Kovter in](https://www.proofpoint.com/us/threat-insight/post/kovter-group-malvertising-campaign-exposes-millions-potential-malware-and-fraud)\ntheir previous activities. Our analysis of Novter, particularly its most notable modules, are detailed in this\n**_[technical brief.](https://documents.trendmicro.com/assets/Tech-Brief-New-Fileless-Botnet-Novter-Distributed-by-KovCoreG-Malvertising-Campaign.pdf)_**\n\n\n-----\n\nFigure 1. Infection chain of KovCoreG, Novter, and Nodster\n\n## KovCoreG’s attack chain\n\nKovCoreG’s attacks are socially engineered malvertisments that lure unwitting users into downloading a\nsoftware package needed to update their supposedly out-of-date Adobe Flash application. However, it instead\ndrops a malicious HTML application (HTA) file named Player{timestamp}.hta. When the victim executes the\nHTA file, it will load additional scripts from a remote server (communication is RC4-encrypted) and run a\nPowerShell script that appears to take inspiration from the open-source [Invoke-PSInject project.](https://github.com/EmpireProject/Empire/blob/master/data/module_source/management/Invoke-PSInject.ps1)\n\nFigure 2. Screenshot showing an example of KovCoreG’s malvertisements (captured by ProofPoint)\n\nFigure 3. Snapshot of KovCoreG’s malvertisement traffic (captured by ProofPoint)\n\nThe PowerShell script, in turn, will disable Windows Defender and Windows Update processes. It runs a\nshellcode to bypass User Account Control (UAC) via the [CMSTPLUA COM interface (related to connection](http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/)\nmanagement). The PowerShell script is also embedded with Novter, which will be executed [filelessly via the](https://www.trendmicro.com/vinfo/us/security/news/security-technology/security-101-defending-against-fileless-malware#memoryexploits)\nPowerShell reflective [injection technique.](https://powersploit.readthedocs.io/en/latest/CodeExecution/Invoke-ReflectivePEInjection/)\n\n## Analysis of the Novter malware\n\nNovter is a backdoor in the form of an executable file. Immediately after its execution, it performs the\nfollowing anti-debugging and anti-analysis checks:\n\n\n-----\n\nwith a list of hardcoded CRC32s\nChecking if the number of cores is too small\nChecking if the process is being debugged\nChecking if the Sleep function is being manipulated\n\nIf it finds any of aforementioned information, it is then reported to the C&C server. Note that it uses different\nsets of C&C servers for different purposes. One set, for instance, is solely used for anti-analysis reporting.\nAfter the affected machine’s environment is double-checked and reported, the malware goes to sleep for a\nlong time.\n\nThe backdoor commands that Novter supports are:\n\nkillall — Terminate a process and delete a file (for all modules)\nkill — Terminate a process and delete a file (for a specific module)\nstop — Terminate the process without deleting its file (for a specific module)\nresume — Start a process (for a specific module)\nmodules — Download and execute an additional module\nupdate — Download a new version and install the update\nupdate_interval — Set an interval between two consecutive update attempts\n\nNovter communicates with its command-and-control (C&C) servers and downloads multiple JavaScript\nmodules for different purposes. We have identified three Novter modules, which include:\n\nA module that shows a technical support scam page on the victim’s machine\nA module that abuses [WinDivert (Windows packet divert, a tool that enables network packets sent to](https://reqrypt.org/windivert.html)\nand from Windows network stacks to be captured, modified, or dropped) to block the communication\nfrom processes like those from antivirus (AV) software\nA module (which we named “Nodster”) that is written with [NodeJS and](https://nodejs.org/en/) [io for proxying network](https://socket.io/)\ntraffic. We consider it a module responsible for building the proxy network needed to support the click\nfraud operations.\n\n## Analysis of Novter’s module “Nodster”\n\nDuring our analysis of Novter, we came across three notable modules downloaded by the malware. One of\nthem, which we named “Nodster,” is a network proxy module. The module installs NodeJS on the victim’s\nmachine and executes a NodeJS script “app.js” in the background. The script will connect to an embedded\nC&C server address and receive the second C&C server address.\n\nIt will then establish a backconnection to the second C&C server with the socket.io protocol. The second\nC&C server will return commands to instruct the module to make a TCP connection, send a TCP payload,\nand return the response from the server back to them. This turns the system infected with Novter become a\nproxy for the attacker to use.\n\n\n-----\n\nFigure 4. The communication flow between the Nodster proxy and C&C servers\n\n## Correlating Nodster’s traffic\n\nDuring the course of our research, we observed lots of encrypted traffic proxied through the Nodster module,\nbut we managed to decrypt some of it, which showed scripts used for web advertising. This indicates that the\nC&C server instructed the infected machine to open a website with an embedded JavaScript code related to\ndisplaying advertisements.\n\nWe also noticed that the ad traffic appeared to have been sent from Android devices, since the HTTP(S)\nrequests transferred through the proxy had HTTP User-Agent headers from Android devices. These requests\nare appended with a “X-Requested-With” header with many Android app names. We inspected those apps on\nthe Google Play store because we initially thought that the traffic could have been generated by these\napplications. However, we did not find any suspicious code in these applications that would have generated\nthis traffic. We didn’t find any similar code shared between these Android applications either.\n\nFigure 5. The HTTPS request header spoofed to be from an Android device\n\nWith this finding, we inferred that the ad traffic was not coming from the mobile devices, but was instead\nbeing generated by the attacker. The attacker disguised the traffic to appear as if it was being sent from\nAndroid devices and mobile applications and proxied them through the Novter/Nodster botnet. After all,\nKovCoreG’s operations involved click fraud.\n\n## Defending against Novter\n\nAdvertisements are an innocuous online staple, but KovCoreG’s campaign demonstrates how they can be\nintrusive, not to mention how Novter can expose the user’s system to other and actual threats. Given how\nKovCoreG engages in click fraud, it can significantly affect businesses. A single [mobile ad fraud incident in](https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/mobile-ad-fraud-schemes-how-they-work-and-how-to-defend-against-them)\n2018, for instance, cost Google and its partners around [US$10 million in losses.](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup/2018-mobile-threat-landscape)\n\nNovter also exemplifies fraudsters’ maturing techniques with its use of fileless infection methods and\nobfuscating its C&C connections and fraud-related traffic. Users, for their part, should adopt best practices,\n[especially against socially engineered threats like malvertisements](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malvertising-when-online-ads-attack)\n\n\n-----\n\nhave [behavior monitoring capabilities, can protect users and businesses from threats like Emotet by detecting](https://success.trendmicro.com/solution/1122593-configuring-behavior-monitoring-settings-in-apex-one)\n[malicious files, scripts, and messages as well as blocking all related malicious URLs.](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html) Trend Micro Apex\nOne™ protection employs a variety of threat detection capabilities such as behavioral analysis, which protect\nagainst malicious scripts, injection, ransomware, memory and browser attacks.\n\nThe full details of our research on Novter is in this **_[technical brief, while the indicators of compromise (IoCs)](https://documents.trendmicro.com/assets/Tech-Brief-New-Fileless-Botnet-Novter-Distributed-by-KovCoreG-Malvertising-Campaign.pdf)_**\nare in this **_[appendix.](https://documents.trendmicro.com/assets/Appendix-New-Fileless-Botnet-Novter-Distributed-by-KovCoreG-Malvertising-Campaign.pdf)_**\n\n_With additional analysis from Ecular Xu._\n\n_Hat tip to ProofPoint’s researcher Kafeine whom we worked with in this research._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.10.01.kovcoreg-malvertising-campaign/New%20Fileless%20Botnet%20Novter%20Distributed%20by%20KovCoreG%20Malvertising%20Campaign.pdf"
    ],
    "report_names": [
        "New Fileless Botnet Novter Distributed by KovCoreG Malvertising Campaign"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1569980165,
    "ts_modification_date": 1569980165,
    "files": {
        "pdf": "https://archive.orkl.eu/095871915af386b3addb87036dfca584473b283c.pdf",
        "text": "https://archive.orkl.eu/095871915af386b3addb87036dfca584473b283c.txt",
        "img": "https://archive.orkl.eu/095871915af386b3addb87036dfca584473b283c.jpg"
    }
}