{
    "id": "3e94e72e-75e5-4970-a23a-52bb13150453",
    "created_at": "2023-01-12T15:00:57.623446Z",
    "updated_at": "2025-03-27T02:16:26.572423Z",
    "deleted_at": null,
    "sha1_hash": "61433e61a6494f83d3dbe82a90eb3b9eeccade6a",
    "title": "2017-07-05 - Security 101- The Impact of Cryptocurrency-Mining Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T02:47:35Z",
    "file_modification_date": "2022-05-28T02:47:35Z",
    "file_size": 651761,
    "plain_text": "# Security 101: The Impact of Cryptocurrency-Mining Malware\n\n**trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/security-101-the-impact-of-cryptocurrency-**\nmining-malware\n\n**by Kevin Y. Huang (Threats Analyst)**\n\n[The Australian government has just recognized digital currency as a legal payment method.](http://www.budget.gov.au/2017-18/content/glossies/factsheets/html/FS_innovation.htm)\nSince July 1, purchases done using digital currencies such as bitcoin are exempt from the\ncountry's Goods and Services Tax to avoid double taxation. As such, traders and investors\nwill not be levied taxes for buying and selling them through legal exchange platforms.\n\n[Japan, which legitimized bitcoin as a form of payment last April, already expects more than](http://www.businessinsider.com/bitcoin-price-spikes-as-japan-recognizes-it-as-a-legal-payment-method-2017-4)\n20,000 merchants to accept bitcoin payments. Other countries are joining the bandwagon,\n[albeit partially: businesses and some of the](http://www.ey.com/ch/en/newsroom/news-releases/news-release-ey-switzerland-accepts-bitcoins-for-payment-of-its-services) [public organizations in Switzerland, Norway, and](http://www.reuters.com/article/us-swiss-fintech-cryptovalley-idUSKCN11E0L9)\nthe [Netherlands. In a recent](https://www.technologyreview.com/s/534011/a-weekend-in-bitcoin-city-arnhem-the-netherlands/) [study, unique, active users of cryptocurrency wallets are pegged](https://www.jbs.cam.ac.uk/fileadmin/user_upload/research/centres/alternative-finance/downloads/2017-global-cryptocurrency-benchmarking-study.pdf)\nbetween 2.9 and 5.8 million, most of which are in North America and Europe.\n\nBut what does the acceptance and adoption of digital currencies have to do with online\nthreats? A lot, actually. As cryptocurrencies like bitcoin gain real-world traction, so will\ncybercriminal threats that abuse it. But how, exactly? What does this mean to businesses\nand everyday users?\n\n## What is cryptocurrency?\n\nCryptocurrency is an encrypted data string that denotes a unit of currency. It is monitored\nand organized by a peer-to-peer network also known as a blockchain, which also serves as a\nsecure ledger of transactions, e.g., buying, selling, and transferring. Unlike physical money,\ncryptocurrencies are decentralized, which means they are not issued by governments or\nother financial institutions.\n\n\n-----\n\nCryptocurrencies are created (and secured) through cryptographic algorithms that are\nmaintained and confirmed in a process called mining, where a network of computers or\nspecialized hardware such as application-specific integrated circuits (ASICs) process and\nvalidate the transactions. The process incentivizes the miners who run the network with the\ncryptocurrency.\n\n**[Related:** **[Is Bitcoin the future of cryptocurrencies?]](http://blog.trendmicro.com/trendlabs-security-intelligence/will-bitcoin-succeed/)**\n\n## Bitcoin isn’t the be-all and end-all\n\n[There are actually over 700 cryptocurrencies, but only some are readily traded and even less](https://coinmarketcap.com/currencies/views/all/)\nhave market capitalization above $100 million. Bitcoin, for instance, was created by Satoshi\nNakamoto (pseudonym) and released in 2009 as open-source code. Blockchain technology\nmade it all work, providing a system where data structures (blocks) are broadcasted,\nvalidated, and registered in a public, distributed database through a network of\ncommunication endpoints (nodes).\n\nWhile bitcoin is the most famous cryptocurrency, there are other popular alternatives.\nEthereum took “smart contracts” up a notch by making the programming languages needed\nto code them more accessible to developers. Agreements, or conditional/if-then transactions,\nare written as code and executed (as long as requirements are met) in Ethereum’s\nblockchain.\n\n[Ethereum, however, earned notoriety after a hacker exploited a vulnerability in the Digital](https://www.wired.com/2016/06/50-million-hack-just-showed-dao-human/)\nAutonomous Organization (DAO) running on Ethereum’s software, siphoning US $50 million\nworth of ether (Ethereum’s currency). This resulted in the development of Ethereum Classic,\nbased the original blockchain, and Ethereum, its upgraded version (via a hard fork).\n\n**[[READ: Ethereum Classic’s Wallet falls victim to social engineering scam]](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ethereum-classic-wallet-a-victim-of-social-engineering)**\n\nThere are also other notable cryptocurrencies: Litecoin, Dogecoin, Monero. Litecoin is a\npurportedly technical improvement of Bitcoin that is capable of faster turnarounds via its\nScrypt mining algorithm (Bitcoin uses SHA-256). The Litecoin Network is able to produce 84\nmillion Litecoins—four times as many cryptocurrency units issued by Bitcoin. Monero is\nnotable for its use of ring signatures (a type of digital signature) and CryptoNote application\nlayer protocol to protect the privacy of its transactions—amount, origin, and destination.\nDogecoin, which was initially developed for educational or entertainment purposes, was\nintended for a broader demographic. Capable of generating uncapped dogecoins, it also\nuses Scrypt to drive the currency along.\n\n**[[READ: Who’s attacking your IoT devices and smart home, and why?]](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/securing-smart-homes#TheUsualSuspects)**\n\n## Cryptocurrency mining also drew cybercriminal attention\n\n\n-----\n\nCryptocurrencies have no borders—anyone can send them anytime anywhere, without\ndelays or additional/hidden charges from intermediaries. Given their nature, they are more\nsecure from fraud and identity theft as cryptocurrencies cannot be counterfeited, and\npersonal information is behind a cryptographic wall.\n\nUnfortunately, the same apparent profitability, convenience, and pseudonymity of\n[cryptocurrencies also made them ideal for cybercriminals, as ransomware operators showed.](https://www.trendmicro.com/vinfo/us/security/definition/ransomware)\nThe increasing popularity of cryptocurrencies coincide with the incidences of malware that\ninfect systems and devices, turning them into armies of cryptocurrency-mining machines.\n\nCryptocurrency mining is a computationally intensive task that requires significant resources\nfrom dedicated processors, graphics cards, and other hardware. While mining does generate\nmoney, there are many caveats. The profit is relative to a miner’s investment on the\nhardware, not to mention the electricity costs to power them.\n\nCryptocurrencies are mined in blocks; in bitcoin, for instance, each time a certain number of\nhashes are solved, the number of bitcoins that can be awarded to the miner per block is\nhalved. Since the bitcoin network is designed to generate the cryptocurrency every 10\n[minutes, the difficulty of solving another hash is adjusted. And as mining power increases,](https://bitcoin.org/en/developer-guide#proof-of-work)\nthe resource requirement for mining a new block piles up. Payouts are relatively small and\n[eventually decrease every four years—in 2016, the reward for mining a block was halved to](http://www.reuters.com/article/us-markets-bitcoin-mining-idUSKCN0ZO2CW)\n12.5 BTC (or $32,000 as of July 5, 2017). Consequently, many join forces into pools to make\nmining more efficient. Profit is divided between the group, depending on how much effort a\nminer exerted.\n\n**[From TrendLabs Security Intelligence Blog:** **How Windows OS-run machines, routers**\n**and IP cameras became bitcoin-mining zombies]**\n\n## Cryptocurrency-mining malware use similar attack vectors\n\nBad guys turn to using malware to skirt around these challenges. There is, however a caveat\nfor cybercriminal miners: internet-connected devices and machines, while fast enough to\nprocess network data, don’t have extensive number-crunching capabilities. To offset this,\n[cryptocurrency-mining malware are designed to zombify botnets of computers to perform](https://www.trendmicro.com/vinfo/us/security/definition/botnet)\nthese tasks. Others avoided subtlety altogether—in 2014, Harvard’s supercomputer cluster\nOdyssey was [used to illicitly mine dogecoins. During the same year, a similar](http://www.thecrimson.com/article/2014/2/20/harvard-odyssey-dogecoin/) [incident](http://www.bbc.com/news/technology-27779030)\nhappened to US agency National Science Foundation’s own supercomputers. In early\nFebruary 2017, one of the US Federal Reserve’s servers was [misused to mine for bitcoins.](http://www.ibtimes.com/bitcoin-mining-employee-federal-reserve-fined-suspended-using-government-server-mine-2484185)\n\nCryptocurrency-mining malware employ the same modus operandi as many other threats—\nfrom malware-toting spam emails and downloads from malicious URLs to junkware and\npotentially unwanted applications (PUAs). In January 2014, a vulnerability in Yahoo!’s Javabased advertisement network was compromised, exposing European end users to\n\n\n-----\n\n[malvertisements that delivered a bitcoin-mining malware. A month before it, German law](https://www.trendmicro.com/vinfo/us/security/definition/malvertisement)\nenforcement [arrested hackers for purportedly using malware to mine over $954,000 worth of](https://www.scmagazine.com/german-police-arrest-bitcoin-hackers/article/543183/)\nbitcoins.\n\n**[[READ: How South Korea’s largest cryptocurrency exchange was hacked]](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/-south-korean-cryptocurrency-exchange-bithumb-hacked/)**\n\nWe’ve seen the emergence of hacking tools and backdoors related to cybercriminal bitcoin\nmining as early as 2011, and we’ve since seen a variety of cryptocurrency-mining threats that\n[add more capabilities, such as distributed denial-of-service and](http://blog.trendmicro.com/trendlabs-security-intelligence/bitcoin-mining-botnet-found-with-ddos-capabilities/) [URL spoofing. Another even](http://blog.trendmicro.com/trendlabs-security-intelligence/malicious-links-on-twitter-lead-to-bitcoin-mining/)\ntried to [masquerade as a component for one of Trend Micro’s products. In 2014, the threat](http://blog.trendmicro.com/trendlabs-security-intelligence/trojan-disguised-as-trend-micro-component-drops-bitcoin-mining-malware/)\n[crossed over to Android devices as Kagecoin, capable of mining bitcoin, litecoin, and](http://blog.trendmicro.com/trendlabs-security-intelligence/mobile-malware-mines-dogecoins-and-litecoins-for-bitcoin-payout/)\ndogecoin. A remote access Trojan (RAT) njrat/Njw0rm readily shared in the Middle Eastern\nunderground was modified to add bitcoin-mining functionality. The same was done to an old\n[Java RAT that can mine litecoin.](http://blog.trendmicro.com/trendlabs-security-intelligence/old-java-rat-updates-includes-litecoin-plugin/)\n\n[This year’s notable cryptocurrency-mining malware so far are Adylkuzz,](https://www.proofpoint.com/us/threat-insight/post/adylkuzz-cryptocurrency-mining-malware-spreading-for-weeks-via-eternalblue-doublepulsar)\nCPUMiner/EternalMiner, and Linux.MulDrop.14. All exploit vulnerabilities. Adylkuzz\nleverages EternalBlue, the same security flaw that [WannaCry ransomware used to](http://blog.trendmicro.com/trendlabs-security-intelligence/massive-wannacrywcry-ransomware-attack-hits-various-countries/)\n[destructive effect, while CPUMiner/EternalMiner used SambaCry, a vulnerability in](http://www.securityweek.com/sambacry-flaw-exploited-deliver-cryptocurrency-miner)\n[interoperability software suite Samba. Linux.MulDrop.14, a Linux Trojan, targets Raspberry](http://www.zdnet.com/article/linux-malware-enslaves-raspberry-pi-to-mine-cryptocurrency/)\nPi devices. These threats infected devices and machines and turned them into moneromining botnets.\n\n**[[READ: What happens when your router gets compromised?]](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/protect-home-network-securing-router)**\n\n## Cryptocurrency-mining malware’s impact makes them a credible threat\n\nCryptocurrency-mining malware steal the resources of infected machines, significantly\naffecting their performance and increasing their wear and tear. An infection also involves\nother costs, like increased power consumption.\n\nBut we’ve also found that their impact goes beyond performance issues. From January 1 to\nJune 24, 2017, our sensors detected 4,894 bitcoin miners that triggered over 460,259\nbitcoin-mining activities, and found that more than 20% of these miners also triggered web\nand network-based attacks. We even found intrusion attempts linked to a ransomware’s\nattack vector. The most prevalent of these attacks we saw were:\n\n[Cross-site scripting](https://www.trendmicro.com/vinfo/us/security/definition/cross-site-scripting-(xss))\nExploiting a remote code execution vulnerability in Microsoft’s Internet Information\nServer (IIS)\nBrute force and default password logins/attacks\nCommand buffer overflow exploits\nHypertext Preprocessor (PHP) arbitrary code injection\n\n\n-----\n\n[SQL injection](https://www.trendmicro.com/vinfo/us/security/definition/sql-injection)\n[BlackNurse denial of service attack](https://www.trendmicro.com/vinfo/us/security/definition/denial-of-service-(dos))\n\nThese malware can threaten the availability, integrity, and security of a network or system,\nwhich can potentially result in disruptions to an enterprise’s mission-critical operations.\nInformation theft and system hijacking are also daunting repercussions. These attacks can\nalso be the conduit from which additional malware are delivered.\n\n[Internet of Things (IoT) devices are also in the crosshairs of cryptocurrency-mining malware](https://www.trendmicro.com/vinfo/us/security/threat-intelligence-center/internet-of-things/)\n—from [digital video recorders (DVRs)/surveillance cameras, set-top boxes,](https://arstechnica.com/security/2014/05/infecting-dvrs-with-bitcoin-mining-malware-even-easier-you-suspected/) network-attached\nstorage (NAS) devices, and especially routers, given their ubiquity among home and\n[corporate environments. In April 2017, a variant of Mirai surfaced with bitcoin-mining](http://www.newsweek.com/botnet-hacking-devices-mine-bitcoin-582404)\ncapabilities. Mirai’s notoriety sprung from the havoc it wrought in IoT devices, particularly\n[home routers, using them to knock high-profile sites offline last year. Over the first three](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016#WorstTroublemakerMirai)\nquarters of 2016, we detected a bitcoin-mining zombie army made up of Windows systems,\nhome routers, and IP cameras.\n\nFrom January 1 to June 24, 2017, we also observed different kinds of devices that were\nmining bitcoin, although our telemetry cannot verify if these activities were authorized. We\nalso saw bitcoin mining activities surge by 40% from 1,800 triggered events daily in February\nto 3,000 in March, 2017.\n\nWhile bitcoin mining isn’t inherently illegal (at least in many countries), it can entail a\ncompromise if it doesn’t have the owner’s knowledge and consent. We found that machines\nrunning Windows had the most bitcoin mining activities, but also of note are:\n\nSystems on Macintosh OSes, including iOS (iPhone 4 to iPhone 7)\nDevices run on Ubuntu OS, a derivative of Debian Linux OS\nHome routers\nEnvironment-monitoring devices, used in data centers\nAndroid-run smart TVs and mobile devices\nIP cameras\nPrint servers\nGaming consoles\n\n**[[READ: How to secure your router against Mirai and home network attacks]](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/securing-routers-against-mirai-home-network-attacks)**\n\n## Cryptocurrency-mining malware can make victims a part of the problem\n\nCryptocurrency-mining malware can impair system performance and risk end users and\nbusinesses to information theft, hijacking, and a plethora of other malware. And by turning\nthese machines into zombies, cryptocurrency malware can even inadvertently make its\nvictims part of the problem.\n\n\n-----\n\nIndeed, their adverse impact to the devices they infect—and ultimately a business asset or a\nuser’s data—makes them a credible threat. There is no silver bullet for these malware, but\nthey can be mitigated by following these best practices:\n\nRegularly updating your device with the latest patches helps prevent attackers from\nusing vulnerabilities as doorways into the systems\nChanging or strengthening the device’s default credentials makes the device less\nprone to unauthorized access\nEnabling the device’s firewall (for home routers), if available, or deploying intrusion\ndetection and prevention systems to mitigate incursion attempts\nTaking caution against known attack vectors: socially engineered links, attachments or\nfiles from suspicious websites, dubious third-party software/applications, and\nunsolicited emails\n\nIT/system administrators and information security professionals can also consider application\nwhitelisting or similar security mechanisms that prevent suspicious executables from running\nor installing. Proactively monitoring network traffic helps better identify red flags that may\nindicate malware infection. Applying the principle of least privilege, developing\n[countermeasures against web injections,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-web-injections) [securing the email gateway,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats) implementing best\npractices for corporate mobile devices, and cultivating a cybersecurity-aware workforce are\npart of a defense-in-depth approach to reducing an enterprise’s exposure to these threats.\nUltimately, however, the security of internet-connected devices against cryptocurrencymining malware isn’t just a burden for their users. Original design and equipment\n[manufacturers also play vital roles in securing the ecosystems they run in.](http://blog.trendmicro.com/trendlabs-security-intelligence/internet-things-ecosystem-broken-fix/)\n\nHIDE\n\n**Like it? Add this infographic to your site:**\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste\nthe code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats) [Cryptocurrency,](https://www.trendmicro.com/vinfo/us/security/news/cryptocurrency) [Internet of Things,](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things) [Bitcoin](https://www.trendmicro.com/vinfo/us/security/news/bitcoin)\n\n**2021 Midyear Cybersecurity Report**\n\n\n-----\n\nIn the first half of this year, cybersecurity strongholds were surrounded by cybercriminals\nwaiting to pounce at the sight of even the slightest crack in defenses to ravage valuable\nassets.\n[View the report](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup/attacks-from-all-angles-2021-midyear-security-roundup)\n\n**Trend Micro Security Predictions for 2022: Toward a New Momentum**\n\nIn 2022, decision-makers will have to contend with threats old and new bearing down on the\nincreasingly interconnected and perimeterless environments that define the postpandemic\nworkplace.\n\n[View the 2022 Trend Micro Security Predictions](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2022)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-07-05 - Security 101- The Impact of Cryptocurrency-Mining Malware.pdf"
    ],
    "report_names": [
        "2017-07-05 - Security 101- The Impact of Cryptocurrency-Mining Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535657,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653706055,
    "ts_modification_date": 1653706055,
    "files": {
        "pdf": "https://archive.orkl.eu/61433e61a6494f83d3dbe82a90eb3b9eeccade6a.pdf",
        "text": "https://archive.orkl.eu/61433e61a6494f83d3dbe82a90eb3b9eeccade6a.txt",
        "img": "https://archive.orkl.eu/61433e61a6494f83d3dbe82a90eb3b9eeccade6a.jpg"
    }
}