{
    "id": "3e9821f3-53e8-4695-95ca-82bb9233db24",
    "created_at": "2023-01-12T15:06:13.303795Z",
    "updated_at": "2025-03-27T02:17:14.500135Z",
    "deleted_at": null,
    "sha1_hash": "d347596f6131e4fc7d947171026a3bf903bc78d4",
    "title": "2017-02-16 - menuPass Returns with New Malware and New Attacks Against Japanese Academics and Organizations",
    "authors": "",
    "file_creation_date": "2022-05-28T16:07:34Z",
    "file_modification_date": "2022-05-28T16:07:34Z",
    "file_size": 1930698,
    "plain_text": "# menuPass Returns with New Malware and New Attacks Against Japanese Academics and Organizations\n\n**[researchcenter.paloaltonetworks.com/2017/02/unit42-menupass-returns-new-malware-new-attacks-japanese-academics-organizations/](http://researchcenter.paloaltonetworks.com/2017/02/unit42-menupass-returns-new-malware-new-attacks-japanese-academics-organizations/)**\n\nJen Miller-Osborn, Josh Grunzweig February 16, 2017\n\nBy [Jen Miller-Osborn and](https://unit42.paloaltonetworks.com/author/jen-miller-osborn/) [Josh Grunzweig](https://unit42.paloaltonetworks.com/author/joshgruznweig/)\n\nFebruary 16, 2017 at 11:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [MenuPass](https://unit42.paloaltonetworks.com/tag/menupass/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-menupass-returns-new-malware-new-attacks-japanese-academics-organizations/)\n\nIn 2016, from September through November, an APT campaign known as “menuPass” targeted Japanese academics working in several\nareas of science, along with Japanese pharmaceutical and a US-based subsidiary of a Japanese manufacturing organizations. In addition to\n[using PlugX and Poison Ivy (PIVY), both known to be used by the group, they also used a new Trojan called “ChChes” by the Japan Computer](http://www.jpcert.or.jp/magazine/acreport-ChChes.html)\nEmergency Response Team Coordination Center (JPCERT). In contrast to PlugX and PIVY, which are used by multiple campaigns, ChChes\nappears to be unique to this group. An analysis of the malware family can be found later in this blog.\n\nInterestingly, the ChChes samples we observed were digitally signed using a certificate originally used by HackingTeam and later part of the\n[data leaked when they were themselves hacked. Wapack labs also observed a similar sample targeting Japan in November. It’s not clear why](http://motherboard.vice.com/read/spy-tech-company-hacking-team-gets-hacked)\nthe attackers chose to use this certificate, as it was old, had been leaked online, and had already been revoked by the time they used it. Digital\ncertificates are typically used because they afford an air of legitimacy, which this one definitely does not.\n\nThe attackers spoofed several sender email addresses to send spear phishing emails, most notably public addresses associated with the\nSasakawa Peace Foundation and The White House. All the spear phishes were socially engineered with subjects appropriate for the target\nand the apparent sender. One of the more interesting subject lines was used in the White House attack; “[UNCLASSIFIED] The impact of\nTrump’s victory to Japan,” sent two days after the election. Most of the attacks against academics involved webmail addresses using names of\nacademics but are not tied to those academics openly online. However, all the spear phish recipients used email addresses tied to them\nonline.\n\n**_Figure 1 Recent menuPass activity and some ties to older infrastructure_**\n\n\n-----\n\ne C ast uctu e t ese attac s s a ge y acto eg ste ed, t o y a e y a c o a a e Syste ( S) do a s e u ass\ntypically makes use of a mix of DDNS and actor-registered domains in their attack campaigns. All of the related hashes and C2s are in\nappendix at the end of this blog.\n\n## Ties to menuPass\n\n[There is not much public information about the APT campaign called menuPass (also known as Stone Panda and APT10). A paper from](http://www.slideshare.net/CrowdStrike/crowd-casts-monthly-you-have-an-adversary-problem)\n[FireEye in 2013 on several campaigns using PIVY included menuPass as one of them. A later](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-poison-ivy.pdf) [blog added some additional details. The group](https://www.fireeye.com/blog/threat-research/2014/03/a-detailed-examination-of-the-siesta-campaign.html)\nname is derived from one of the passwords they use with PIVY in their attacks. Believed to have started activity in 2009 and to originate from\nChina, the group initially was known for targeting US and overseas defense contractors but broadened their targeting as time passed. They\nhave targeted Japanese organizations since at least 2014.\n\nThe newer ChChes malware family uses an import hash (bb269704ba8647da97377440d403ae4d) shared with other tools used by menuPass,\naffording an initial link. However, the ties are most strongly proved through infrastructure analysis, which shows a number of links between the\nnewer infrastructure used in these attacks and older infrastructure publicly associated with the group. The three circled domains represent C2s\npublicly reported as tied to menuPass, linked to domains not previously publicly reported as associated. These are only a few of multiple\noverlaps analysts can find while researching menuPass infrastructure. The circled known domains are the first three below:\n\napple[.]cmdnetview[.]com\nfbi[.]sexxxy[.]biz\ncvnx[.]zyns[.]com\ncia[.]toh[.]info\n2014[.]zzux[.]com\niphone[.]vizvaz[.]com\n\n**_Figure 2. menuPass infrastructure overlaps_**\n\nTwo of these domains can further be tied into the newer C2 infrastructure. Again, these are only a few of the overlaps that can be uncovered\nby analyzing the infrastructure used by menuPass. The domains in the below figure are:\n\ncia[.]toh[.]info\n2014[.]zzux[.]com\nwchildress[.]com\nlion[.]wchildress[.]com\nkawasaki[.]unhamj[.]com\nsakai[.]unhamj[.]com\nkawasaki[.]cloud-maste[.]com\nfukuoka[.]cloud-maste[.]com\nyahoo[.]incloud-go[.]com\nmsn[.]incloud-go[.]com\nwww[.]mseupdate[.]ourhobby[.]com\ncontractus[.]qpoe[.]com\n\n\n-----\n\n**_Figure 3. Ties between new and older infrastructure._**\n\nAdditionally, the passwords in the PIVY samples also fit known passwords used by the group – three samples use “menuPass” and the other\nuses “keaidestone.” With these data points, we assess with high confidence the recent attacks were conducted by the menuPass group.\n\nFollowing is our analysis of the ChChes malware family.\n\n## Malware Analysis\n\nFor this analysis, Unit 42 looked at the following file:\n\n**MD5** c0c8dcc9dad39da8278bf8956e30a3fc\n\n**SHA1** 009b639441ad5c1260f55afde2d5d21fc5b4f96c\n\n**SHA256** 6605b27e95f5c3c8012e4a75d1861786fb749b9a712a5f4871adbad81addb59e\n\n**Compile Time** 2016-11-24 01:31:37 UTC\n\nThis malware is provided with an icon that appears to be that of a Microsoft Word document, as we can see in the image below.\n\n**_Figure 4. Icon used for ChChes_**\n\nAdditionally, we discovered that the samples identified in attacks against Japanese organizations were digitally signed using the certificate\noriginally used by the Italian-based company, HackingTeam. Readers may recall that HackingTeam was compromised and subsequently had a\nlarge amount of internal data exposed in July 2015. This data included a wealth of code used by the organization, including certificates. The\ncertificate in question was fairly old, and expired on August 4, 2012. On July 10, 2015, the certificate was revoked.th th\n\n\n-----\n\n**_Figure 5. Digital signing of ChChes_**\n\n\n-----\n\n**_Figure 6. Certificate revocation_**\n\nMultiple instances of malware have been discovered using this certificate since it was originally leaked in 2015. It is unclear why the actors\ndecided to use this certificate that is tied to known malicious samples for their own samples. One possibility may be to make attribution more\ndifficult for analysts researching these threats.\n\nWhen the malware is initially run, it will first decrypt an embedded stub of code within the malware prior to executing it. This stub has many\ncharacteristics seen in shellcode, and begins by creating a new Import Address Table (IAT). This new IAT is then referenced throughout the\nremainder of the code when calling Windows APIs. The following snippet of assembly shows the newly created IAT being referenced to call\nvarious functions, such as GetProcessHeap, RtlAllocateHeap, RtlReAllocateHeap, and InternetReadFile.\n\n\n-----\n\n**_Figure 7. Newly created IAT being used to call Windows API functions_**\n\nAfter the IAT has been generated, the malware will determine the path of %TEMP% and set its current working directory to this value. ChChes\nproceeds to collect the following information about the victim:\n\nHostname\nProcess Identifier (PID)\nCurrent working directory (%TEMP%)\nWindow resolution\nMicrosoft Windows version\n\nThis information is aggregated into a string such as the following:\n\nWBQTLJRH9553618*2564?3618468394?C:\\\\Users\\\\ADMINI~1\\\\AppData\\\\Local\\\\Temp?1.4.1 (1024x768)*6.1.7601.17514\n\n\n-----\n\note t at t e st g abo e, t e 36 8 6839 a d st gs a e a dcoded t t e a a e tse ese ay d cate e s o s o t e\nmalware or campaign identifiers, however, this has not been confirmed.\n\nAfter this data has been aggregated, it is uploaded to a hardcoded command and control (C2) server via HTTP. The data is embedded within\nthe ‘Cookie’ HTTP header, as seen below\n\n**_Figure 8. Initial HTTP beacon for ChChes_**\n\nThe URI used above is randomly generated for each HTTP request made by ChChes. The data embedded within the Cookie header is\nencrypted using a unique technique. For each key/value pair, separated by a ‘;’, the malware will first perform a MD5 hash of the key, and\nextract the middle 16 bytes. The value is base64-decoded after the string is unquoted. Finally, the base64-decoded data is decrypted using\nRC4 with the previously obtained 16 bytes. All of the data is concatenated to form the final, decrypted data.\n\nThe following Python code shows an example of decoding the supplied Cookie field:\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n\n\nimport urllib\nimport base64\nfrom binascii import *\nimport hashlib\n\ndef md5_get_middle(data):\nm = hashlib.md5()\nm.update(data)\no = m.digest()\nhexed = hexlify(o)\nreturn hexed[8:24]\n\ndef rc4_crypt(data, key):\nS = range(256)\nj = 0\nout = []\nfor i in range(256):\nj = (j + S[i] + ord( key[i % len(key)] )) % 256\nS[i], S[j] = S[j], S[i]\ni = j = 0\nfor char in data:\ni = ( i + 1 ) % 256\nj = ( j + S[i] ) % 256\nS[i], S[j] = S[j], S[i]\nout.append(chr(ord(char) ^ S[(S[i] + S[j]) % 256]))\nreturn ''.join(out)\n\ncookie_string =\n'OtKoVg=jlIt2Eh55%2F%2F38%2FJbKlZpYFNNFhXgOgc0zzNqAxvls8edznJy4k%2BpxKUl1GG15OTRuC%2Blc5R6WGCmOHyPNObeV2O\n\nall_decrypted = \"\"\nsub_strings = cookie_string.split(\";\")\nfor s in sub_strings:\nkey, data = s.split(\"=\")\nnew_key = md5_get_middle(key)\nnew_data = base64.b64decode(urllib.unquote(data))\ndecrypted = rc4_crypt(new_data, new_key)\ndecrypted_data = decrypted.split(key)[1]\nall_decrypted += decrypted_data\n\nprint \"Decrypted String:\"\nprint repr(all_decrypted)\n\n\nThe script above produces the following output:\n\n\n1\n2\n\n\nDecrypted String:\n'AWBQTLJRH9553618*2564?3618468394?C:\\\\Users\\\\ADMINI~1\\\\AppData\\\\Local\\\\Temp?1.4.1 (1024x768)*6.1.7601.17514'\n\n\nThe initial ‘A’ character witnessed in the output above instructs the remote server that this is an initial beacon, or the first expected request sent\nby ChChes.\n\nThe C2 will respond with a ‘Set-Cookie’ header that contains the middle 16 bytes of the MD5 hash performed against the hostname and PID.\nUsing the above example, the C2 would perform the MD5 against ‘WBQTLJRH9553618*2564’.\n\n\n1\n2\n\n\njgrunzweig$ echo -n WBQTLJRH9553618*2564 | md5\n7fc27808b331106210b6364c326569fd\n\n\nThe resulting middle 16 characters is ‘b331106210b6364c’.\n\nThe subsequent request made by ChChes looks like the following:\n\n**_Figure 9. Second network request made by ChChes_**\n\nDecrypted, we see the following contents stored within the Cookie field:\n\n\n-----\n\nb33 06 0b636 c\n\nThe first character of ‘B’ signifies that this is the second request, and the remaining data is the 16 bytes previously seen in the C2 response\nwithin the Set-Cookie header.\n\nAt this stage, the C2 server is expected to return content in the following format:\n\n[Middle MD5][Base64-Encoded Data][Middle MD5]\n\nThe ‘Middle MD5’ field contains the middle 16 bytes of the MD5 hash of the ‘b331106210b6364c’ string. This would result in a string of\n‘500089dadf52ae0b’ in this particular example. The ‘Base64-Encoded Data’ field contains a fairly complex structure that will store a module\nthat is to be loaded and subsequently run by ChChes.\n\nA visualization of this network communication can be seen in the following figure:\n\n**_Figure 10. Network flow of ChChes_**\n\nChChes acts as an initial infiltration point on a victim machine. It has the ability to load additional code that in turn may accomplish any number\nof tasks. During analysis, no C2 servers were found to be active, and Unit 42 was unable to identify any modules being loaded by ChChes.\nHowever the JPCERT also recently analyzed this family and was able to collect modules that give ChChes the following functions:\n\n\n-----\n\nc ypt o o co u cat o by S\nExecute shell command\nUploading and downloading files\nLoading and executing the DLL\nTask list of bot command\n\nHowever, the lack of persistence built into ChChes suggests that it by itself is not intended to run on a victim’s machine for long periods of\ntime. In a successful intrusion, it may be only a first stage tool used by the attackers to orient where they landed in a network, and other\nmalware will be deployed as a second stage layering for persistence and additional access as the attackers move laterally through a network.\n\n## Conclusion\n\nThese attacks show Japan continues to be a target of interest to APT campaigns. menuPass has targeted individuals and organizations in\nJapan since at least 2014, and as the same organizations and academics were largely targeted each month in these attacks, it further shows\nmenuPass is persistent in attempts to compromise their targets. menuPass also heavily favors spear phishing, and so takes steps to socially\nengineer their spear phishes for maximum appearance of legitimacy. This, and their persistence, highlights the need for training and\nawareness of spear phishing on the part of both individuals and organizations likely to be targeted. menuPass is an ongoing APT campaign\nwith a broad range of targets and will likely continue to target Japan in the future.\n\nPalo Alto Networks customers are protected from these malware families and C2 infrastructure by:\n\nAll C2 domains are flagged as malicious in Threat Prevention and PAN-DB\nAll three families are properly tagged malware by WildFire. Autofocus subscribers can learn more about each family via their tags:\n\n[ChChes](https://autofocus.paloaltonetworks.com/#/tag/Unit42.ChChes)\n[Poison Ivy](https://autofocus.paloaltonetworks.com/#/tag/Unit42.PoisonIvy)\n[PlugX](https://autofocus.paloaltonetworks.com/#/tag/Unit42.PlugX)\n\n[Additionally, Autofocus subscribers can learn more about menuPass by exploring tied activity with the menuPass tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.menuPass)\n\n## Indicators of Compromise\n\n**SHA256 Hashes**\n\n**ChChes**\n\n5961861d2b9f50d05055814e6bfd1c6291b30719f8a4d02d4cf80c2e87753fa1\n\ne90064884190b14a6621c18d1f9719a37b9e5f98506e28ff0636438e3282098b\n\nae6b45a92384f6e43672e617c53a44225e2944d66c1ffb074694526386074145\n\nfd6a956a7708708cddff78c8505c7db73d7c4e961da8a3c00cc5a51171a92b7b\n\n2c71eb5c781daa43047fa6e3d85d51a061aa1dfa41feb338e0d4139a6dfd6910\n\n316e89d866d5c710530c2103f183d86c31e9a90d55e2ebc2dda94f112f3bdb6d\n\nefa0b414a831cbf724d1c67808b7483dec22a981ae670947793d114048f88057\n\n6605b27e95f5c3c8012e4a75d1861786fb749b9a712a5f4871adbad81addb59e\n\nfadf362a52dcf884f0d41ce3df9eaa9bb30227afda50c0e0657c096baff501f0\n\n2965c1b6ab9d1601752cb4aa26d64a444b0a535b1a190a70d5ce935be3f91699\n\ne88f5bf4be37e0dc90ba1a06a2d47faaeea9047fec07c17c2a76f9f7ab98acf0\n\nd26dae0d8e5c23ec35e8b9cf126cded45b8096fc07560ad1c06585357921eeed\n\ne6ecb146f469d243945ad8a5451ba1129c5b190f7d50c64580dbad4b8246f88e\n\n4521a74337a8b454f9b80c7d9e57b4c9580567f84e513d9a3ce763275c55e691\n\nbc2f07066c624663b0a6f71cb965009d4d9b480213de51809cdc454ca55f1a91\n\nc21eaadf9ffc62ca4673e27e06c16447f103c0cf7acd8db6ac5c8bd17805e39d\n\nf251485a62e104dfd8629dc4d2dfd572ebd0ab554602d682a28682876a47e773\n\nb20ce00a6864225f05de6407fac80ddb83cd0aec00ada438c1e354cdd0d7d5df\n\n\n-----\n\nc6b8ed 5 eed5 958da 3 6 8db 53ba5 a0e b6 9 08de060c aa653 a c\n\n9a6692690c03ec33c758cb5648be1ed886ff039e6b72f1c43b23fbd9c342ce8c\n\ncb0c8681a407a76f8c0fd2512197aafad8120aa62e5c871c29d1fd2a102bc628\n\n4cc0adf4baa1e3932d74282affb1a137b30820934ad4f80daceec712ba2bbe14\n\n312dc69dd6ea16842d6e58cd7fd98ba4d28eefeb4fd4c4d198fac4eee76f93c3\n\n45d804f35266b26bf63e3d616715fc593931e33aa07feba5ad6875609692efa2\n\n19aa5019f3c00211182b2a80dd9675721dac7cfb31d174436d3b8ec9f97d898b\n\n**PlugX**\n\nf1ca9998ca9078c27a6dab286dfe25fcdfb1ad734cc2af390bdcb97da1214563\n\n6392e0701a77ea25354b1f40f5b867a35c0142abde785a66b83c9c8d2c14c0c3\n\n6c7e85e426999579dd6a540fcd827b644a79cda0ad50211d585a0be513571586\n\n9f01dd2b19a1032e848619428dd46bfeb6772be2e78b33723d2fa076f1320c57\n\n6c7e85e426999579dd6a540fcd827b644a79cda0ad50211d585a0be513571586\n\n76721d08b83aae945aa00fe69319f896b92c456def4df5b203357cf443074c03\n\ndcff19fc193f1ba63c5dc6f91f00070e6912dcec3868e889fed37102698b554b\n\n7eeaa97d346bc3f8090e5b742f42e8900127703420295279ac7e04d06ebe0a04\n\na6b6c66735e5e26002202b9d263bf8c97e278f6969c141853857000c8d242d24\n\n5412cddde0a2f2d78ec9de0f9a02ac2b22882543c9f15724ebe14b3a0bf8cbda\n\n92dbbe0eff3fe0082c3485b99e6a949d9c3747afa493a0a1e336829a7c1faafb\n\n**PIVY**\n\nf0002b912135bcee83f901715002514fdc89b5b8ed7585e07e482331e4a56c06\n\n412120355d9ac8c37b5623eea86d82925ca837c4f8be4aa24475415838ecb356\n\n44a7bea8a08f4c2feb74c6a00ff1114ba251f3dc6922ea5ffab9e749c98cbdce\n\n9edf191c6ca1e4eddc40c33e2a2edf104ce8dfff37b2a8b57b8224312ff008fe\n\n**C2s**\n\ndick[.]ccfchrist[.]com\n\ntrout[.]belowto[.]com\n\nsakai[.]unhamj[.]com\n\nzebra[.]wthelpdesk[.]com\n\narea[.]wthelpdesk[.]com\n\nkawasaki[.]cloud-maste[.]com\n\nkawasaki[.]unhamj[.]com\n\nfukuoka[.]cloud-maste[.]com\n\nscorpion[.]poulsenv[.]com\n\nlion[.]wchildress[.]com\n\nfbi[.]sexxxy[.]biz\n\ncia[.]toh[.]info\n\n\n-----\n\n0 [ ] u [ ]co\n\nnttdata[.]otzo[.]com\n\niphone[.]vizvaz[.]com\n\napp[.]lehigtapp[.]com\n\njimin[.]jimindaddy[.]com\n\nJepsen[.]r3u8[.]com\n\ninspgon[.]re26[.]com\n\nnunluck[.]re26[.]com\n\nyahoo[.]incloud-go[.]com\n\nmsn[.]incloud-go[.]com\n\nwww[.]mseupdate[.]ourhobby[.]com\n\ncontractus[.]qpoe[.]com\n\napple[.]cmdnetview[.]com\n\ncvnx[.]zyns[.]com\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-16 - menuPass Returns with New Malware and New Attacks Against Japanese Academics and Organizations.pdf"
    ],
    "report_names": [
        "2017-02-16 - menuPass Returns with New Malware and New Attacks Against Japanese Academics and Organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9fa9633-dfd1-458d-84ce-cc36dcdc7ce4",
            "created_at": "2022-10-25T16:07:24.188897Z",
            "updated_at": "2025-03-27T02:02:10.136127Z",
            "deleted_at": null,
            "main_name": "Siesta",
            "aliases": [],
            "source_name": "ETDA:Siesta",
            "tools": [
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "Poison Ivy",
                "SPIVY",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f9bb42e1-65d6-444e-8c63-21c2605b49e0",
            "created_at": "2023-01-06T13:46:38.887429Z",
            "updated_at": "2025-03-27T02:00:02.943493Z",
            "deleted_at": null,
            "main_name": "Siesta",
            "aliases": [],
            "source_name": "MISPGALAXY:Siesta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535973,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1653754054,
    "ts_modification_date": 1653754054,
    "files": {
        "pdf": "https://archive.orkl.eu/d347596f6131e4fc7d947171026a3bf903bc78d4.pdf",
        "text": "https://archive.orkl.eu/d347596f6131e4fc7d947171026a3bf903bc78d4.txt",
        "img": "https://archive.orkl.eu/d347596f6131e4fc7d947171026a3bf903bc78d4.jpg"
    }
}