{
    "id": "3ea92b52-e123-45f8-8fc8-ea2dda0b03c7",
    "created_at": "2023-01-12T15:02:59.192908Z",
    "updated_at": "2025-03-27T02:08:47.855754Z",
    "deleted_at": null,
    "sha1_hash": "6e996993fea7133749ddfb6f3c18afeaf83258c9",
    "title": "2020-12-17 - [RE017-1] Phân tích kỹ thuật dòng mã độc mới được sử dụng để tấn công chuỗi cung ứng nhắm vào Ban Cơ yếu Chính phủ Việt Nam của nhóm tin tặc Panda Trung Quốc (Phần 1)",
    "authors": "",
    "file_creation_date": "2022-05-29T01:13:09Z",
    "file_modification_date": "2022-05-29T01:13:09Z",
    "file_size": 625493,
    "plain_text": "# [RE017-1] Phân tích kỹ thuật dòng mã độc mới được sử dụng để tấn công chuỗi cung ứng nhắm vào Ban Cơ yếu Chính phủ Việt Nam của nhóm tin tặc Panda Trung Quốc (Phần 1)\n\n**[blog.vincss.net/2020/12/phan-tich-ky-thuat-dong-ma-doc-moi-co-nhieu-dau-hieu-lien-quan-toi-nhom-tin-tac-Panda.html](https://blog.vincss.net/2020/12/phan-tich-ky-thuat-dong-ma-doc-moi-co-nhieu-dau-hieu-lien-quan-toi-nhom-tin-tac-Panda.html)**\n\n**I. Mở đầu**\n\nTrong quá trình thực hiện các hoạt động theo dõi và phân tích các mẫu mã độc, chúng tôi\n[phát hiện một bài blog thú vị của NTT tại đây. Lần theo các hash trong bài viết này, chúng tôi](https://insight-jp.nttsecurity.com/post/102glv5/pandas-new-arsenal-part-3-smanager)\nthấy một mã [hash cho thông tin chú ý trên VirusTotal:](https://www.virustotal.com/gui/file/97a5fe1d2174e9d34cee8c1d6751bf01f99d8f40b1ae0bce205b8f2f0483225c/details)\n\n_Hình 1. Thông tin từ mã hash trên blog của NTT_\n\nNhân sự kiện một nhóm tin tặc được cho là của Nga tấn công khai thác chuỗi cung ứng\nphần mềm để nhắm vào hàng loạt các cơ quan lớn của nước Mỹ, cùng với việc phát hiện\nthấy từ khoá eToken.exe là một trong số các phần mềm được sử dụng khá phổ biến ở các\ncơ quan, tổ chức và doanh nghiệp tại Việt Nam, chúng tôi đã sử dụng eToken.exe và\n**SafeNet làm keywords tìm kiếm trên các nền tảng VirusTotal và Google. Kết quả, chúng tôi**\n[đã phát hiện ra thông tin về hai files (1,](https://www.virustotal.com/gui/file/6be34df727fcb79123e4e8f472ad24b698d83395fb17d4db019e9976f485cd83/detection) [2) cài đặt rất đáng chú ý đã được tải lên VirusTotal từ](https://www.virustotal.com/gui/file/b0fd1ff7f5d45be89fffc04937f352754c6055e1f4ca26a9257169ce168569ef/detection)\ntháng 8/2020:\n\n\n-----\n\n_Hình 2. Thông tin tìm kiếm được trên VirusTotal_\n\nKhi thấy tên các file cài đặt là gca01-client-v2-x32-8.3.msi và gca01-client-v2-x64-8.3.msi\nkhá quen thuộc, chúng tôi đã thử tải về hai file này từ trang chủ cung cấp. Kết quả, các mã\nhash này trùng nhau. Tuy nhiên, ở thời điểm hiện tại thì các file trên trang chủ đã được gỡ\nbỏ và thay thế bằng phiên bản sạch, chính gốc. Bước đầu, chúng tôi nhận định đây có thể là\nmột chiến dịch tấn công có chủ đích APT nhằm vào chuỗi cung ứng phần mềm để từ đó làm\nbàn đạp tấn công vào các cơ quan, tổ chức và doanh nghiệp quan trọng tại Việt Nam.\n\nNgày 17/12, ESET đã công bố một phát hiện một chiến dịch tấn công APT được họ gọi là\n[\"Chiến dịch SignSight\" nhằm vào Ban Cơ yếu Chính phủ Việt Nam. Được biết, ESET đã](https://www.eset.com/us/about/newsroom/press-releases/eset-discovers-operation-signsight-supply-chain-attack-against-a-certification-authority-in-southea-1/)\nthông báo cho VNCERT và Ban Cơ yếu Chính phủ Việt Nam và đã nhận được thông tin Ban\nCơ yếu đã phát hiện bị tấn công trước đó và đã thông báo cho các cơ quan liên quan đã tải\nvề các phần mềm bị tin tặc can thiệp.\n\nỞ thời điểm phân tích, chúng tôi đã có được hai file cài đặt đã bị tin tặc can thiệp, thay đổi.\nToàn bộ chuỗi bài viết này sẽ tập trung vào phân tích các dấu hiệu và kỹ thuật đã được tin\ntặc áp dụng vào các mẫu mã độc trong hai file cài đặt này.\n\n\n-----\n\n**II. Phân tích file cài đặt**\n\nỨng dụng này tên là “SafeNet Authentication Clients” của công ty SafeNet .Inc. Các file\nPE (Portable Executable) đa số đều được sign bằng certificate của SafeNet.\n\n_Hình 3. Các PE files được sign bằng certificate của SafeNet_\n\nSử dụng công cụ UniExtract, chúng tôi trích xuất ra toàn bộ file từ một bộ cài đặt, bộ x64.\nTổng số file là 218 files, 68 thư mục con, tổng dung lượng là 75.1 MB (78,778,368\n_bytes). Để tìm ra được file bị tin tặc chèn vào trong số lượng files trên, chúng tôi chỉ tập_\ntrung vào phân tích và xác định các files PE không được sign.\n\nChạy công cụ sigcheck thuộc bộ SysInternals Suite của Micorsoft, với các thông số kiểm\ntra signed, hash, quét hết các PE file, kết quả scan hash trên VirusTotal, output là csv file.\nSau đó sắp xếp theo unsigned file, kết quả từ VirusTotal, chúng tôi phát hiện ra file đã bị tin\ntặc chèn vào, được đặt tên là eToken.exe.\n\n_Hình 4. Phát hiện ra file đã bị tin tặc chèn vào_\n\nMã hash của file eToken.exe trên trùng với một mã hash trong report của NTTSecurity. Các\ndấu hiệu lạ khác là PE 32bit nhưng lại nằm trong thư mục x64, các version info như\n_“Company, Description, Product…” không hợp lệ với một ứng dụng lớn của một công ty như_\nvậy. Link kết quả scan của file eToken trên [VirusTotal.](https://www.virustotal.com/gui/file/97a5fe1d2174e9d34cee8c1d6751bf01f99d8f40b1ae0bce205b8f2f0483225c/detection)\n\nVì bộ ứng dụng trên được build với Visual C++ của Visual Studio 2005, đã cũ, và dùng thư\nviện Qt4, nên một số file dll của bộ cài đặt này cũng không được signed. Chúng tôi đã kiểm\ntra từng file và xác định là các file sạch, chỉ còn ba file là nghi ngờ: RegistereToken.exe,\n**eTOKCSP.dll và eTOKCSP64.dll.**\n\n\n-----\n\nVậy eToken.exe file chính là một malware mà tin tặc đã thêm vào bộ cài đặt của bộ phần\nmềm nói trên. Để tim hiểu cách mà eToken.exe được thực thi, chúng tôi tiến hành phân tích\nfile cài đặt, msi file (Microsoft Windows Installer file): gca01-client-v2-x64-8.3.msi\n\nTiến hành trích xuất file msi ra dạng raw trước installing, chúng tôi thu được hai file .cab\n(Microsoft Cabinet file): Data1.cab và Cabs.w1.cab. Đây là điểm dị thường vì thông thường\nmột file msi chỉ có một file .cab chính. Kiểm tra file Data1.cab và MSI log text file,\n**eToken.exe và RegistereToken.exe đều nằm trong file Data1.cab. Và cả hai file .exe đều**\nkhông có GUID ID đi kèm:\n\n_Hình 5. Các file exe không có GUID ID đi kèm_\n\nKiểm tra feature: DriverFeature, và hai file eToken.exe và RegistereToken.exe của file msi\nvới công cụ Orca của Microsoft (công cụ chuyên dùng để phân tích, sửa đổi msi file). Thông\nqua tìm kiếm, ta thấy tin tặc đã chèn thêm một custom action: RegisterToken (không có “e”)\nvào file msi và thêm vào CustomAction đó vào cuối InstallExecuteSequence.\n**RegistereToken.exe sẽ được gọi với parameter là eToken.exe:**\n\n\n-----\n\n_Hình 6. Tin tặc chèn thêm một custom action_\n\nPhân tích file RegistereToken.exe, chúng tôi thấy file này được build vào thời gian\n“Wednesday, 22.07.2020 07:40:31 UTC”, tức 22/07/2020, 2h40m31s PM GMT +7, PE64,\ndùng VC++ 2013:\n\n_Hình 7. Thông tin của file RegistereToken.exe_\n\nMã giả C của RegistereToken.exe chỉ làm nhiệm vụ gọi API WinExec để thực thi tham số\ntruyền vào:\n\n\n-----\n\n_Hình 8. Nhiệm vu của RegistereToken.exe_\n\nKết luận, qua các timestamp trong file Data1.cab và RegistereToken.exe, chúng tôi xác\nđịnh như sau\n\nTin tặc tạo và sửa đổi file install .msi và tạo file Data1.cab tại timestamp: 20/07/2020 –\n**15:15 giờ UTC, add file eToken.exe vào lúc này.**\nBuild file RegistereToken.exe tại timestamp: 22/07/2020 – 07:40 giờ UTC.\nAdd file RegistereToken.exe vào Data1.cab tại timestamp: 22/07/2020 – 08:40 giờ\nUTC.\n\nGhi chú: Theo Cab file format, hai trường Date và Time của một file trong file cab là DOS\n**Datetime format, mỗi trường là một Word 2 bytes, ghi lại thời gian file được thêm vào theo**\nDOS time. Các chương trình xử lý file Cab sẽ convert và hiển thị theo UTC time. Tức các\nUTC time trên chính là time hiện tại trên máy tin tặc. Xem thêm tại [đây.](https://docs.microsoft.com/en-us/windows/win32/sysinfo/ms-dos-date-and-time)\n\n_Hình 9. Thông tin MS DOS Datetime_\n\n**III. Phân tích file eToken.exe**\n\n**1. Phân tích PE Structure file**\n\nFile eToken.exe:\n\nSize = 192 KB (196,608 bytes)\nMD5 = 830DD354A31EF40856978616F35BD6B7\nSHA256 =\n97A5FE1D2174E9D34CEE8C1D6751BF01F99D8F40B1AE0BCE205B8F2F0483225C\n\n\n-----\n\nCác thông tin về compiler, RichID và build timestamp:\n\nBuild bằng VC++ 6 của Microsoft Visual Studio, Service Pack 6.\nBuild lúc: 26/04/2020 – 15:12:58 UTC.\nChecksum đúng, file chưa bị sửa đổi PE Header.\nLink với thư viện MFC42.dll, thư viện Microsoft Foundation Class v4.2 của Microsoft,\nlà thư viện hỗ trợ lập trình GUI trên Windows, luôn đi kèm trong các bộ Visual Studio.\nLink với một thư viện khá đặc biệt: dbghelp.dll. Dùng hàm API\n**MakeSureDirectoryPathExist. Xem thêm tại** [đây.](https://docs.microsoft.com/en-us/windows/win32/api/dbghelp/nf-dbghelp-makesuredirectorypathexists)\n\nKiểm tra resource section của file, chúng tôi xác định được đây là một Dialog application,\nđược tạo bằng MFC Wizard của Visual Studio 6. Tên project là VVSup, tức file .exe khi build\nra sẽ là VVSup.exe. Dialog chính có resource IDD = 102, dialog About có IDD = 100. Và\nđiểm đặc biệt là còn có một dialog khác có IDD = 129, được tin tặc add vào bằng MFC\nWizard, và quên (hay cố ý) vẫn để resource language là Chinese. Dialog này cũng không có\ncontrol nào được thêm vào, ngoài hai button OK và Cancel mặc định. Chúng ta sẽ lưu ý\ndialog này.\n\nHình 10. Thông tin resource của file\n\n\n-----\n\n**2. Static analysis code của eToken với IDA**\n\n**eToken.exe (VVSup.exe) được build với mode link dynamic DLL với MFC42.dll, nên file**\n**.exe sẽ nhỏ và các hàm của MFC42 libirary sẽ được dễ dàng xác định qua name import của**\nDLL. Quy tắc name mangling của Microsoft VC++ compiler phản ánh tên class, tên hàm, tên\nthông số, kiểu gọi… của các hàm. IDA giúp chúng ta xác định các hàm import by ordinal của\n**MFC42.dll bằng file mfc42.ids và mfc42.idt đi kèm của IDA.**\n\nTuy nhiên VVSup được build với option RTTI (Runtime Type Information) bị tắt, nên sẽ\nkhông có thông tin về RTTI và Virtual Method Table của đầy đủ các class (lớp) trong file.\nChúng ta chỉ có RTTI của class type_info, lớp root của RTTI.\n\n(Còn tiếp...)\n\n**Trương Quốc Ngân (aka HTC)**\n\n**Chuyên gia Phân tích mã độc - VinCSS (a member of Vingroup)**\n\n\n-----",
    "language": "VI",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-17 - [RE017-1] Phân tích kỹ thuật dòng mã độc mới được sử dụng để tấn công chuỗi cung ứng nhắm vào Ban Cơ yếu Chính phủ Việt Nam của nhóm tin tặc Panda Trung Quốc (Phần 1).pdf"
    ],
    "report_names": [
        "2020-12-17 - [RE017-1] Phân tích kỹ thuật dòng mã độc mới được sử dụng để tấn công chuỗi cung ứng nhắm vào Ban Cơ yếu Chính phủ Việt Nam của nhóm tin tặc Panda Trung Quốc (Phần 1).pdf"
    ],
    "threat_actors": [
        {
            "id": "bbdb2d7d-4bf4-4100-a108-f4742cfd69ff",
            "created_at": "2022-10-25T16:07:24.01101Z",
            "updated_at": "2025-03-27T02:02:10.074776Z",
            "deleted_at": null,
            "main_name": "Operation SignSight",
            "aliases": [],
            "source_name": "ETDA:Operation SignSight",
            "tools": [
                "Mimikatz",
                "PhantomNet",
                "SManager"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535779,
    "ts_updated_at": 1743041327,
    "ts_creation_date": 1653786789,
    "ts_modification_date": 1653786789,
    "files": {
        "pdf": "https://archive.orkl.eu/6e996993fea7133749ddfb6f3c18afeaf83258c9.pdf",
        "text": "https://archive.orkl.eu/6e996993fea7133749ddfb6f3c18afeaf83258c9.txt",
        "img": "https://archive.orkl.eu/6e996993fea7133749ddfb6f3c18afeaf83258c9.jpg"
    }
}