{
    "id": "3ec4de57-3fef-4292-bc5b-d5c4a8029e44",
    "created_at": "2023-01-12T15:08:12.158871Z",
    "updated_at": "2025-03-27T02:06:12.457266Z",
    "deleted_at": null,
    "sha1_hash": "eefd91367b906e845e7cc2cb838e584bdbe4ad78",
    "title": "2022-03-08 - The Media Environment and Domestic Public Opinion in China Toward Russia’s War On Ukraine",
    "authors": "",
    "file_creation_date": "2022-05-28T02:09:53Z",
    "file_modification_date": "2022-05-28T02:09:53Z",
    "file_size": 258891,
    "plain_text": "# The Media Environment and Domestic Public Opinion in China Toward Russia’s War On Ukraine\n\n**[recordedfuture.com/media-environment-domestic-public-opinion-china-russias-war-ukraine/](https://www.recordedfuture.com/media-environment-domestic-public-opinion-china-russias-war-ukraine/)**\n\nInsikt Group\n_Editor’s Note: The research presented below was conducted during the week of February 28,_\n_with collection and conclusions finalized on March 3. While relevant information regarding_\n_China’s official position and media environment towards the conflict in Ukraine continues to_\n_come to light, we believe our findings are an accurate representation of the situation at the_\n_time this report was written and likely continue to be accurate as of the publication date._\n\nChina’s position on Russia’s war on Ukraine is complex, confused, and contradictory,\nattempting to balance friendship with Russia, opposition to the United States, aversion to the\ninstability caused by the war, and protection of China’s international image as a respectable\npower that advocates sovereignty for all countries. Ultimately, China’s position is more\nsupportive of Russia than not. The result is that official public messaging domestically has\ndownplayed Russia’s war on Ukraine, limited coverage of anti-war protests overseas, and\nsuppressed dissenting sentiment within China. Pro-Russian, anti-Ukraine, anti-European\nUnion, and anti-US voices and narratives are proliferating under this approach while\nexpressions of support for Ukraine and anti-war sentiments are censored. It is not possible to\nmake a conclusive statement on what the majority of Chinese people believe with regard to\nthe war, but based on our preliminary research it is likely that many genuinely support\nRussia, in part due to Russian narratives and propaganda, while many genuinely disapprove\nof the war. The latter group is likely a largely silent or silenced group. Suppression of antiRussia and pro-Ukrainian opinions may not be limited to China’s citizenry alone, as\nunverified sources suggest that police forces in China are also contacting outspoken\nUkrainians in China. Additionally, faced with negative domestic and international reactions to\nsome online content, government authorities are blaming separatist forces in Taiwan and\nXinjiang.\n\n## Limitations to This Research\n\n\n-----\n\nThis report defines public opinion as opinions outside of government sources, meaning any\npublic expression toward the situation in Ukraine that does not come from policymakers or\ngovernment spokespersons. Our definition also excludes expressions by organizations\ndemonstrably or almost certainly led by the Chinese Communist Party (CCP). However,\nassessing genuine public opinion in China is difficult for several reasons. First, the significant\nlevels of censorship in China, especially online, mean that the most visible and discoverable\nexpressions of public opinion generally fall within acceptable bounds established by the\nauthorities. Several instances of anti-war expression have already been censored, making it\nmore likely that pro-Russian narratives become mainstream. Second, because the CCP\n[places significant emphasis on “guiding” public opinion through overt and covert means,](https://www.chinafile.com/reporting-opinion/features/message-control-china)\nonline content and comments are not necessarily reflective of what an ordinary citizen\nbelieves. Even without demonstrable proof of a connection to the CCP, it is possible that any\nparticular expression is not organic but is made with an objective in mind that may not\nconform to the true feelings of the one who expressed it. However, it is also inaccurate to\ndiscount all public opinion toward Ukraine that is in line with China’s official position as\npropaganda. Third, whether social media activity is reflective of broader views toward an\nissue in any country is debatable; the medium is driven by emotion and the loudest voices\nare not necessarily representative of general society. All that can be said conclusively as of\nthis writing is that there is a diverse range of opinions in China toward Russia’s war on\nUkraine.\n\n## The Official Position and Party-State Media\n\nChina’s position on Russia’s war on Ukraine is muddled, attempting to balance competing\npriorities that are in some ways fundamentally opposed to each other, and party-state media\npromotes and censors content according to this shifting position. Officially, authorities and\nparty-state media outlets have not named Russia’s war on Ukraine an “invasion” or a “war”.\nInstead, they typically refer to this as the “Ukraine issue” (乌克兰问题), “Ukraine situation” (乌\n克兰局势), or “Ukraine crisis” (乌克兰危机), and occasionally as a “special military action” (特\n殊军事行动) by Russia or as “hostilities” (战事). China’s 5-point position on Ukraine, as\n[explained by Foreign Minister Wang Yi on February 25, 2022, emphasizes a peaceful](https://www.fmprc.gov.cn/wjbzhd/202202/t20220226_10645790.shtml)\nresolution and “sustainable security concept” (可持续的安全观) that respects the concerns of\nall parties equally and safeguards territorial integrity and sovereignty. Based on Ministry of\nForeign Affairs press conferences, stability is at the forefront of China’s concerns.\nAt the same time, however, China’s leadership broadly supports Russia’s position that the\nNorth Atlantic Treaty Organization (NATO) and the US are most at fault for the current\n[conflict. Further, as communicated in a joint China-Russia statement on February 4, 2022,](https://archive.ph/o4hU9)\nthe 2 countries see themselves as forming a new type of international system that more\nequitably redistributes power from “the West”. Therefore, China’s leadership likely reluctantly\nsupports Russia’s war on Ukraine while simultaneously wishing it had not taken place and\nhoping that it will be resolved quickly. Tacitly supporting the war is likely viewed as preferable\n\n\n-----\n\nto overtly siding with the US and EU against Russia, but it is also the case that some state[owned Chinese banks have begun limiting financing for some Russian entities, despite](https://archive.ph/4PieT)\nChina’s official [opposition to sanctions.](https://www.cnbc.com/2022/03/02/china-will-not-join-sanctions-against-russia-banking-regulator-says.html)\n\n[China’s official domestic public messaging is linked to, and sways with, the country’s overall](https://foreignpolicy.com/2022/03/01/china-propaganda-ukraine-russia/)\npolitical stance. In the current context, it has downplayed Russia’s war on Ukraine and\nlimited coverage of anti-war protests overseas. Although foreign-facing, English-language\noutlets like China Global Television Network (CGTN) display news about Ukraine relatively\nprominently on their homepages, domestic media is much more muted. For example, China\n[Central Television (CCTV) allotted only the last 2 and half minutes of its news broadcast to](https://tv.cctv.com/2022/02/28/VIDELzgztudZRFM76dZjvETh220228.shtml?spm=C31267.PXDaChrrDGdt.EbD5Beq0unIQ.33)\nUkraine on February 28. The front page of Xinhua’s website on March 1 had only 4 relatively\nburied links to stories about Ukraine and its special page for Ukraine coverage, titled the\n“Ukraine situation” (乌克兰局势). The People’s Daily’s print edition first page has not made\nany reference to Ukraine since the start of the war. On February 25, Wenhao Ma, a reporter\nwith Voice of America, shared via American social media his analysis of Ukraine war\ncoverage on Chinese domestic outlets The Paper, Beijing News, and Caijing, finding no\ncoverage of anti-war protests in Russia. Ma also found that while CGTN discussed anti-war\nprotests on foreign social media, it was not doing so on Weibo (a prominent Chinese social\nmedia platform). Ma and others further assert that smaller domestic outlets that had\npreviously covered the protests had begun deleting this content. Corroborating this finding, a\nbranch of Beijing News shared, almost certainly by accident, internal corporate censorship\n[instructions regarding its media activity on Weibo. The instructions stated: “Do not post](https://chinadigitaltimes.net/2022/02/minitrue-keep-weibo-posts-on-ukraine-favorable-to-russia-control-comments/)\nanything unfavorable to Russia or pro-Western. … Pay real attention to which comments are\nallowed. Keep an eye on [responses to] each post for at least two days. … If using hashtags,\nonly use those started by People’s Daily, Xinhua, or CCTV”.\n\n**_Figure 1:_** _Internal censorship orders for a Chinese media outlet (Source: China Digital_\n_Times)_\n\n## Pro-Russia, Anti-Ukraine, and Anti-West Public Opinion\n\nIt is almost certain that some portion of the general public in China genuinely supports\nRussia’s war on Ukraine, Putin’s leadership, the stated reasons for the war, or some\ncombination of these aspects, in line with China’s official position. For example, a nowdeleted Weibo post shared on American social media shows how a businessperson in China\nhad a text conversation with a business client in Russia in which the poster (the Chinese\nbusinessperson) expressed praise for Putin and “everything he has done for” Russians. The\nclient responded, per screenshots shared in the posts, that Putin is “not a hero, he is just a\ncrime person”, to which the poster stated they “had not thought” that Russians would be\nopposed to Putin. Some responses to this post continued to argue that they supported\nPutin’s action as a preemptive strike to protect Russia against NATO aggression. **_Figure_**\n**_2: Chinese social media user expresses surprise that a Russian client did not support their_**\n_positive views toward Putin (Source: Weibo Screenshot Shared on American Social Media)_\n\n\n-----\n\nSearching Weibo for real-time posts mentioning Ukraine, which tends to filter out the\nposts by large media and CCP-led organizations, reveals largely pro-Russian and antiUkraine comments. Examples of such commentary include:\n\nReacting to a video titled “War Crimes and Crimes Against Humanity Committed by the\nUkrainian Military-Political Leadership in Donbass”, a social media user asserted that\n“Ukraine is against humanity! ... Foreign media are completely silent”. This video was\nposted on February 28 and has more than 2.5 million views as of this writing; it is\nreportedly distributed by the Russian Foreign Ministry.\nA separate post asserts “I … sympathize with the Ukrainian people, and hope that\nRussia will win. Russia is much more humane than Ukraine when it treats prisoners\nwell and considers the safety of civilians. I admire Putin!!”\nReacting to the hashtag “Russia will host the first international anti-facist conference”, a\nsocial media user said “God, in the 21st century I still have the opportunity to see the\nwords anti-facism. Russia is so powerful”.\nResponding to a video posted by a Ukrainian woman about why Ukrainians elected\nPresident Volodymyr Zelenskyy, a post asserts: “Invite this pretty girl to quickly transmit\nto the … president of Ukraine, you must immediately stay away from evil America and\nNATO. Sincerely stop acting and give a peopleful life to all the Ukrainian people!”\nAnother post amplifies Russian justifications for the war on Ukraine, reading: “Ukrainian\nAzov Battalion, you can see from the picture that they are a force of evil. Therefore, I\ndon’t need to say more about what kind of opponent Russia is facing. #Russian foreign\nminister says Ukraine is preparing to launch a provocation# ”.\n\nA series of linked posts highlight how one-sided the narrative on Weibo has likely become: a\npost with 17,000 likes states that “reading Weibo really makes [a person] angry, [I] almost\nbelieved that the whole world is uniting to contain Russia”. Presumably, this is due to the\nhigh number of comments lamenting international backlash against Russia’s actions.\nHowever, this post continues, many countries are now or have been previously against the\nRussia sanctions, including India, Pakistan, many South American countries, all of Africa,\nand China. In reply to this post, a separate social media user joked that “I read Weibo, [and] I\nalmost thought it was not Russia fighting Ukraine, but Ukraine fighting Russia”. This reply\npost itself garnered 15,000 likes, a possible sign that many Chinese social media users get\nthe same impression and likely know this is not the case despite the preponderance of proRussian content.\n\n**_Figure 3: Chinese social media user expresses support for Russia’s fight against the neo-_**\n_Nazi Azov Battalion (Source: Weibo)_\n\n## Anti-Russia and Anti-War Public Opinion\n\nNot all social media users are overtly supportive of Russia. For example, in the same\nsearches performed above were multiple posts that lamented China’s friendship with Russia\n\n\n-----\n\nsince Putin s actions would create trouble for China. Other posts expressed concern for\nChinese people in Ukraine, asserting that evacuation work needs to be accelerated. Still\n[others online express concern that inflammatory topics and overtly pro-Russia statements](https://www.whatsonweibo.com/chinese-students-in-ukraine-say-anti-chinese-sentiments-on-the-rise-due-to-fake-news/)\ncould lead to Chinese people in Ukraine becoming targets of armed citizens.\nAnti-war sentiment on Weibo has been highlighted by other researchers since Russia’s war\non Ukraine began; for instance, journalist Wilfred Chan shared on American social media a\nnow-deleted February 24 Weibo post that asserts: “As Chinese people who has also been\ninvaded by foreign powers, we should be able to experience the anguish of being violated by\na country that’s several times stronger than you. … If we are still cheering on Russia, how\nare we different from those who cheered on Japan when they invaded our country”. This\nsame post nevertheless attributed the current situation to Ukraine wanting to join NATO.\nWhile discoverable, such posts are much harder to find and appear less frequent than pro[Russia content. This is probably due to a combination of censorship and peer pressure; as](https://www.protocol.com/newsletters/protocol-china/china-social-media-ukraine-misinformation?rebelltitem=1#rebelltitem1)\ndocumented by the Washington Post, “Antiwar views have been met with derision online,\nwith critics referring to such peace proponents as sanctimonious “Virgin Marys” or as\nhypocrites that oppose all wars except those launched by the United States”.\n\n**_Figure 4: Chinese social media user expresses sorrow over Russia’s war on Ukraine_**\n_(Source: Weibo Screenshot Shared on American Social Media)_\nBeyond Weibo, other forms of anti-war public opinion can be found in a variety of actions.\nExamples of these actions are listed below, but in general such actions are very likely subject\nto censorship:\n\nA poem published on WeChat is [titled “I pray a poem can stop a tank”.](https://mp.weixin.qq.com/s/sfLCXxPOJaWxt5yzMuP8HA)\nPublic [display of “STOP WAR” signs by individuals in China. A specific case in](https://www.reddit.com/r/China_irl/comments/syh7if/%E4%B8%96%E9%9D%A2%E5%BE%AE%E5%8D%9A%E7%96%91%E8%AF%AF%E5%8F%91%E6%9C%89%E5%85%B3%E4%B9%8C%E5%85%8B%E5%85%B0%E4%BA%8B%E6%80%81%E7%9A%84%E7%BC%96%E8%BE%91%E6%96%B9%E9%92%88%E4%B8%96%E9%9D%A2%E6%96%B0%E4%BA%AC%E6%8A%A5%E6%88%91%E4%BB%AC%E8%A7%86%E9%A2%91%E6%97%97%E4%B8%8B%E5%9B%BD%E9%99%85%E8%A7%86%E9%A2%91%E6%96%B0%E9%97%BB/)\nHangzhou ended when authorities forced the demonstrator to put down the sign and\nleave the area.\n[Publication of a joint statement by 5 professors on Wechat stated: “Autocracy will not](https://www.cna.com.tw/news/acn/202202260227.aspx)\nonly destroy the progress of civilization and the principle of international justice but also\nbring enormous shame and catastrophe to the Russian people … We stand against an\nunjust war”. The statement has been removed and is no longer available.\nTaobao stores are selling pro-Ukraine and anti-war T-shirts.\n\n**_Figure 5: Alleged letter from the Ukrainian consulate in Shanghai to provincial_**\n_governments_ _(Source:_ _[China Digital Times)](https://chinadigitaltimes.net/chinese/677672.html)_\nLike censorship of anti-war expressions by Chinese people, vocal Ukrainians are also\n[allegedly being interrogated by police. This allegation comes from a consulate note sent by](https://gaodawei.wordpress.com/2022/03/01/ukraine-shanghai-consulate-to-prc-police-stop-harassing-ukrainian-citizens/)\nUkraine’s consulate in Shanghai to provincial authorities in China. We cannot independently\nverify the letter as of this writing, but it appears genuine. It states that Ukrainians have\nreceived in-person visits and phone calls from Chinese police about their opposition to\nRussia’s leadership. The letter does not state where the Ukrainians are located or how they\nwere expressing their opinions. The letter only says that it has received “a high volume” of\n\n\n-----\n\ncomplaints from overseas (meaning outside of China). Presumably, the Ukrainians targeted\nby police are located in China, were using Chinese social media, and told their overseas\nrelatives about the police action, who subsequently contacted the Shanghai consulate.\n\n## Other Opinions, Mockery, and Official Response\n\n[The South China Morning Post reported on February 26 that several Chinese social media](https://www.scmp.com/tech/tech-trends/article/3168531/ukraine-invasion-chinas-wechat-douyin-crack-down-vulgar-jokes-and)\nplatforms, including WeChat and Douyin, were removing “objectionable” content related to\nthe situation in Ukraine. Examples cited include “false information alleging that [overseas]\nstudents can receive course credits for enlisting to fight in Ukraine, as well as ‘vulgar’\nmessages calling on ‘beautiful Ukrainian women’ to go to China”. The latter category of\nstatements, some of which advocate “capturing” Ukrainian women, has garnered negative\n[attention and criticism within China. In an article originally posted by a unit of the Cyberspace](https://www.163.com/dy/article/H187S5CH0512DU6N.html)\nAdministration of China on WeChat on February 26, this strain of commentary has been\nattributed to “Taiwan and Xinjiang independence forces”. The article highlights other\nexamples of “adopt a Ukrainian” rhetoric accompanied by images of women on foreign social\nmedia platforms. This article, and others such as this Global Times [screed attacking](https://www.globaltimes.cn/page/202203/1253885.shtml)\nSupChina (a media outlet that highlighted the proliferation of misogynistic comments), are\nlikely meant to defend China’s reputation internationally.\n\n## Outlook\n\nStrident pro-Russian, anti-Western voices in China are the most visible, driven in part by the\npositions of official party-state media early in Russia’s war on Ukraine and very likely\ninfluenced by real belief in Russian narratives that attempt to justify its actions in Ukraine.\nHowever, harder-to-hear but clearly present anti-war voices are also making themselves\nheard as best they can, despite significant censorship. Highly visible online public opinion will\nalmost certainly change as (or if) China’s confused but ultimately pro-Russian stance, and its\nattendant domestic public messaging, on Russia’s war on Ukraine shifts. Our findings and\nthe anti-war protests documented by others serve as a reminder that there is a diverse array\nof [opinions in China (as in any country) despite the CCP’s propaganda apparatus.](https://www.csis.org/features/public-opinion-china-liberal-silent-majority)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-08 - The Media Environment and Domestic Public Opinion in China Toward Russia’s War On Ukraine.pdf"
    ],
    "report_names": [
        "2022-03-08 - The Media Environment and Domestic Public Opinion in China Toward Russia’s War On Ukraine.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536092,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653703793,
    "ts_modification_date": 1653703793,
    "files": {
        "pdf": "https://archive.orkl.eu/eefd91367b906e845e7cc2cb838e584bdbe4ad78.pdf",
        "text": "https://archive.orkl.eu/eefd91367b906e845e7cc2cb838e584bdbe4ad78.txt",
        "img": "https://archive.orkl.eu/eefd91367b906e845e7cc2cb838e584bdbe4ad78.jpg"
    }
}