{
    "id": "3f073fa3-8823-41a2-95f8-e109ea0b6002",
    "created_at": "2023-01-12T15:03:44.663006Z",
    "updated_at": "2025-03-27T02:17:01.060587Z",
    "deleted_at": null,
    "sha1_hash": "6688de90f2f4a42dab64bd0cad8eadce99c3b62d",
    "title": "2020-10-05 - Black-T- New Cryptojacking Variant from TeamTnT",
    "authors": "",
    "file_creation_date": "2022-05-28T17:48:43Z",
    "file_modification_date": "2022-05-28T17:48:43Z",
    "file_size": 413980,
    "plain_text": "# Black-T: New Cryptojacking Variant from TeamTNT\n\n**unit42.paloaltonetworks.com/black-t-cryptojacking-variant/**\n\nNathaniel Quist October 5, 2020\n\nBy [Nathaniel Quist](https://unit42.paloaltonetworks.com/author/nathaniel-quist/)\n\nOctober 5, 2020 at 6:00 AM\n\n[Category: Cloud,](https://unit42.paloaltonetworks.com/category/cloud/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [AWS credential stealing,](https://unit42.paloaltonetworks.com/tag/aws-credential-stealing/) [Crytojacking,](https://unit42.paloaltonetworks.com/tag/crytojacking/) [exposed Docker Daemon API,](https://unit42.paloaltonetworks.com/tag/exposed-docker-daemon-api/) [memory password scraping,](https://unit42.paloaltonetworks.com/tag/memory-password-scraping/) [TeamTnT](https://unit42.paloaltonetworks.com/tag/teamtnt/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/black-t-cryptojacking-variant/)\n\n## Executive Summary\n\n[Unit 42 researchers discovered a new variant of cryptojacking malware named Black-T, authored by TeamTNT, a](https://www.cadosecurity.com/2020/08/17/teamtnt-the-first-crypto-mining-worm-to-steal-aws-credentials/)\n[group known to target AWS credential files on compromised cloud systems and mine for Monero (XMR). Black-T](https://www.cadosecurity.com/2020/08/17/teamtnt-the-first-crypto-mining-worm-to-steal-aws-credentials/)\n[follows the traditional TeamTNT tactics, techniques and procedures (TTPs) of targeting exposed Docker daemon APIs](https://unit42.paloaltonetworks.com/attackers-tactics-and-techniques-in-unsecured-docker-daemons-revealed/)\nand performing scanning and cryptojacking operations on vulnerable systems of affected organizations. However, code\nwithin the Black-T malware sample gives evidence of a shift in TTPs for TeamTNT operations.\n\nOf these new TTPs, most notable are the targeting and stopping of previously unknown cryptojacking worms (i.e. the\nCrux worm, ntpd miner, and a redis-backup miner). Also, TeamTNT has been implementing the use of memory\n[password scraping operations via mimipy and](https://github.com/n1nj4sec/mimipy) [mimipenguins, which are *NIX equivalents to the commonly used](https://github.com/huntergregal/mimipenguin)\n[Windows-specific memory password scraper functionality of Mimikatz. Mimikatz is a tool capable of scraping plaintext](https://github.com/gentilkiwi/mimikatz)\npasswords from Windows OS systems, and also has the capability to perform pass-the-hash and pass-the-token\noperations, allowing attackers to hijack user sessions. Any identified passwords which were obtained through\nmimipenguins are then exfiltrated to a TeamTNT command and control (C2) node. This is the first time TeamTNT\nactors have been witnessed including this type of post-exploitation operation in their TTPs.\n\nThe Black-T tool also has the capability to use three different network scanning tools to identify additional exposed\nDocker daemon APIs, within the local network of the compromised system and across any number of publicly\n[accessible networks, to extend their cryptojacking operations. Both masscan and](https://github.com/robertdavidgraham/masscan) [pnscan have been used before by](https://github.com/ptrrkssn/pnscan)\nTeamTNT actors. However, the addition of [zgrab, a GoLang network scanner, marks the first time that a GoLang tool](https://github.com/zmap/zgrab)\nhas been witnessed incorporated into TeamTNT’s TTPs. There was also an update to the masscan network scanner\noperation to include searching for TCP port 5555. While the exact purpose regarding adding port 5555 to the scanner\n\n\n-----\n\n[is unknown, there have been documented cases where XMR cryptojacking is occurring on Android based devices.](https://threatpost.com/new-monero-crypto-mining-botnet-leverages-android-debugging-tool/129777/)\nThis could indicate a new unknown target set for expanding TeamTNT cryptojacking operations. However, there is little\nevidence to support TeamTNT targeting Android devices.\n\nUnit 42 researchers have discovered several German-language phrases inserted into multiple TeamTNT scripts, BlackT included. The very first line within the script following an ASCII art banner reads: verbose mode ist nur für euch 😉\ndamit ihr was zum gucken habt in der sandbox :-* which translates to “verbose mode is only for you 😉 so that you\nhave something to watch in the sandbox.” There have been several other cases where German phrases have been\nused within TeamTNT scripts.\n\n[Palo Alto Networks Prisma Cloud can assist in securing cloud deployments against the threats posed by TeamTNT, by](https://www.paloaltonetworks.com/prisma/cloud)\nguiding organizations to better detect vulnerabilities or misconfigurations in cloud environment settings and\ninfrastructure as code (IaC) templates prior to deploying production systems. Additionally, by installing the latest apps\n[and threat definitions on Palo Alto Networks Next-Generation Firewall, network connections to known XMR public](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\nmining pools, or to malicious domains and IPs, can be prevented before the environment is compromised.\n\n## Black-T Dissection\n\nThe Black-T script is downloaded from the TeamTNT domain, hxxps://teamtnt[.]red/BLACK-T/SetUpTheBLACK-T, to\nthe compromised cloud system that maintained an exposed Docker daemon API. Once downloaded to the\ncompromised system, the script will perform the following actions.\n\nFigure 1. TeamTNT’s Black-T ASCII banner.\nFirst, there is a display of an ASCII art banner declaring that this variant is version 1 (see Figure 1). Then, the script\nperforms a clean and system prep operation, in which the script will remove known cryptojacking malware already in\nplace on the compromised system. Black-T specifically targets Kinsing malware, a competing cryptojacking process\n[family. It is also important to note that TeamTNT authors have copied several pieces of malware code, both within](https://www.cadosecurity.com/2020/08/17/teamtnt-the-first-crypto-mining-worm-to-steal-aws-credentials/)\nprevious TeamTNT tools as well as within this Black-T tool, to augment their own cryptojacking malware. Specifically,\nthis copied code allows for the removal and evasion of Aliyun and Tencent cloud security software, and adds AWS\ncredential-stealing features and masscan scanning functionality.\n\n## Disable Active XMR Miners\n\nUnit 42 researchers also found evidence that the TeamTNT authors are now targeting other potential competing\ncryptojacking malware families, outside of the previously mentioned kinsing cryptojacking process. These competing\n[cryptojacking processes include kswapd0, ntpd miner, redis-backup miner, auditd miner, migration miner, and finally,](https://yoroi.company/research/outlaw-is-back-a-new-crypto-botnet-targets-european-organizations/)\nthe Crux worm (see Figure 2) as well as the Crux worm miner (see Figure 3). With the inclusion of these potential\ncryptojacking processes found within the Black-T malware, it would appear that these cryptojacking processes are\nknown to the TeamTNT authors as competing for cloud processing resources. This would also indicate there are\nseveral cryptojacking processes currently unknown to defense teams and efforts should be taken to identify and build\nmitigation rules for these currently unknown cryptojacking processes. There is an XMR public mining pool called\ncruxpool[.]com. However, no additional information is currently available to support if the Crux worm uses the public\nmining pool cruxpool, or if this is simply a clever naming convention used by cryptojacking operators.\n\nFollowing the cleaning of any known cryptojacking processes, the Black-T malware will also perform a cleaning\n[operation for any known xmrig process currently running on the compromised system. XMRig is a popular open-source](https://github.com/xmrig/xmrig)\nprocess, which facilitates the computational operations needed to mine the XMR cryptocurrency.\n\n\n-----\n\nFigure 2. Crux worm process removal.\n\nFigure 3. Crux worm mining process removal.\n\nOf note, TeamTNT makes use of customized processes within their scripts. These custom processes represent\ntraditional *NIX processes, but have the prefix “tnt” added to the process name. For example, tntrecht is a customized\nprocess that is loaded into /usr/local/bin/tntrecht on the compromised system and is likely used to hijack and modify the\npermissions of legitimate *NIX processes to be used for TeamTNT operations. The modified legitimate processes are\nsubsequently renamed with the “tnt” prefix – for instance, tntwget and tntcurl.\n\n## System Setup\n\nFollowing the cleanup of the compromised system, the script will further set up the system environment by setting Path\nVariables: PATH=/bin:/sbin:/usr/bin:/usr/local/bin:/usr/sbin, naming 8.8.4.4 and 8.8.8.8 as new DNS servers, and finally,\nflushing all established IP table rules using the command iptables -F.\n\nThe script will then check to see which *NIX package manager is installed on the compromised system: Advanced\n[Package Tool (APT), Yellowdog Updater, Modified (YUM) or Alpine Linux package manager (APK). Regardless of the](https://packages.debian.org/buster/apt)\n[package manager type identified, the script will install masscan, along with](https://github.com/robertdavidgraham/masscan) [libpcap to perform network packet traffic](https://www.man7.org/linux/man-pages/man3/libcap.3.html)\n[listening, pnscan (a network scanning tool, although within the current sample, pnscan functionality has been](https://github.com/ptrrkssn/pnscan)\n[commented out), zgrab (a GoLang tool built for zmap), Docker and](http://github.com/zmap/zgrab) [jq (a flexible command-line JSON processor). See](http://manpages.ubuntu.com/manpages/trusty/man1/jq.1.html)\nthe setup image in Figure 4.\n\nFigure 4. APT package manager setup.\n\n\n-----\n\nUnit 42 researchers believe that TeamTNT actors are planning on building more sophisticated cryptojacking features\ninto their tool sets – specifically for identifying vulnerable systems within various cloud environments. Never before has\n[TeamTNT been known to use the network scanner software zmap. But TeamTNT is not only using zmap, they are](https://github.com/zmap/zmap)\nusing the little-known zgrab, which is a GoLang tool used to capture address banners. It is currently unclear how\nTeamTNT actors will use this data, but it is highly likely the actors are giving zgrab a trial run to test the scanner’s\nfunctionality for their operations, and may make adjustments accordingly. This idea is supported by the zgrab GitHub\npage, which states that, “zgrab tends to be very unstable, API's may break at any time, so be sure to vendor zgrab.” It\nis further supported by the fact that during the time of writing this blog, zmap had deprecated the original zgrab tool,\n[which was used in Black-T, and has replaced it with a new version of zgrab, called zgrab2.](https://github.com/zmap/zgrab2)\n\nUnit 42 researchers do know that TeamTNT actors are placing a great deal of importance on scanning capabilities\nwithin the Black-T tool, as there are currently three different scanners built into this tool (masscan, pscan and zgrab).\n\n## Download Toolsets\n\nThe Black-T variant downloads two files, which execute directly into bash: hxxps://teamtnt[.]red/BLACK-T/beta and\nhxxps://teamtnt[.]red/BLACK-T/setup/bd.\n\n**Beta**\n\nBeta is used to make a new directory /.../ where the following files are compressed into two tar files named root.tar.gz:\n\n/root/.bash_history\n/root/.ssh/\n/etc/hosts\n/root/.docker/\n/root/.aws/\n/root/*.sh\n/home/*/.bash_history\n/home/*/.ssh/\n/home/*/*.sh\n\nAnd, cron.tar.gz:\n\n/etc/cron*/\n/var/spool/cron/\n\nThese two files, upon compression, are then sent to the URL hxxps://teamtnt[.]red/only_for_stats/dup.php. It is\nimportant to note that TeamTNT actors are still targeting AWS credential and configuration files located on\ncompromised AWS cloud systems. If compromised systems do contain AWS credentials, the TeamTNT actors could\nattempt to use these AWS credentials to expand their cryptojacking operations within the compromised system’s AWS\nenvironment. By using the AWS credentials obtained from the exposed and compromised Docker daemon system,\nTeamTNT actors could use this system as a pivot point to gain access to additional cloud systems and resources that\nuse the same AWS credentials and which are hosted within the system’s larger AWS environment.\n\nThe beta script then downloads the file hxxps://teamtnt[.]red/x/pw, and also downloads the\nhxxps://teamtnt[.]red/BLACK-T/setup/bd, which is a duplicate from the Black-T download.\n\nFinally, the beta script will set the service token for monitoring XMR mining operations. This token is set as\nabyofigfefda6c3itn9f3zkrmjfays31, and it will redownload the Black-T script, hxxps://teamtnt[.]red/BLACKT/SetUpTheBLACK-T. This is likely done as a means of redundancy to provide actors with different types of operations\nto launch following the exploitation of a system.\n\n**pw**\n\n\n-----\n\n[The script pw is very intriguing, as it performs post exploitation operations of password scraping using mimipy and](https://github.com/n1nj4sec/mimipy)\n[mimipenquin, which are *NIX tools adapted for use from the Windows tool Mimikatz. Upon uncovering any passwords](https://github.com/huntergregal/mimipenguin)\nresiding in memory within the compromised system, the passwords are written to the file /var/tmp/.../output.txt, which is\nthen uploaded to hxxps://teamtnt[.]red/only_for_stats/dup.php. See Figure 5.\n\nFigure 5. Memory password\n\nscraping and exfil.\n\n**bd**\n\nThe script bd is used to download the XMR mining software relevant to the given compromised system. These\ndownloaded files and the SHA256 values for the mining software have been reported on before during an operation\n[targeting Weave Scope deployments.](https://techcommunity.microsoft.com/t5/azure-security-center/teamtnt-activity-targets-weave-scope-deployments/ba-p/1645968)\n\nFigure 6. Downloaded mining\n\nsoftware.\nUnit 42 researchers downloaded each of the software samples and believe these samples to be the same style of\n[samples that have been previously reported (see Table 1).](https://techcommunity.microsoft.com/t5/azure-security-center/teamtnt-activity-targets-weave-scope-deployments/ba-p/1645968)\n\n**Name** **SHA-256 Hash** **Note/VirusTotal**\n**Findings**\n\nbioset a5dd446b2a7b8cfd6b6fd4047cc2fddfcea3a4865d8069dcd661e422046de2a1 Possibly corrupted\n\nkube a506c6cf25de202e6b2bf60fe0236911a6ff8aa33f12a78edad9165ab0851caf [VT = 33/60](https://www.virustotal.com/gui/file/a506c6cf25de202e6b2bf60fe0236911a6ff8aa33f12a78edad9165ab0851caf/detection)\nkube.jpg\n\ntshd a5e6b084cdabe9a4557b5ff8b2313db6c3bb4ba424d107474024030115eeaa0f Possibly Corrupt\n\n[VT = 1/60](https://www.virustotal.com/gui/file/a5e6b084cdabe9a4557b5ff8b2313db6c3bb4ba424d107474024030115eeaa0f/detection)\n\n\ndockerupdate\n\n\n139f393594aabb20543543bd7d3192422b886f58e04a910637b41f14d0cad375 [VT = 35/60](https://www.virustotal.com/gui/file/139f393594aabb20543543bd7d3192422b886f58e04a910637b41f14d0cad375/detection)\n\ndefault.jpg\n\n\n_Table 1. TeamTNT XMR mining software._\n\n## XMR Miner Setup\n\nThe Black-T script then downloads the known XMR miner software sbin_u, (SHA256:\nfae2f1399282508a4f01579ad617d9db939d0117e3b2fcfcc48ae4bef59540d9). This type of mining software has been\nlinked before to TeamTNT. VirusTotal currently only lists the malware as an 8/62, but does label it as an Executable\nLinkable Format (ELF) CoinMiner (see Figure 7), mining software which operates on *NIX platform systems.\n\n\n-----\n\nFigure 7. VirusTotal metadata of the file sbin_u\nFinally, Black-T configures the XMR mining software to use the following XMR wallet address:\n84xqqFNopNcG7T5AcVyv7LVyrBfQyTVGxMFEL2gsxQ92eNfu6xddkWabA3yKCJmfdaA9jEiCyFqfffKp1nQkgeq2Uu2dhB8.\nFigure 8 shows that as of the time of this writing, only five workers were reported producing 8.2 KH/s, which is down\nfrom a maximum of 25.05 KH/s on September 26, 2020. This particular XMR wallet has only managed to gather\nroughly US$10 as of September 29, 2020, likely due to the fact that this is a very new variant of cryptojacking software\nand hasn’t had much time to spread.\n\nFigure 8. MoneroOcean results for the Black-T XMR wallet address.\n\n## Worm Functionality\n\nTeamTNT has long maintained its usage of worm-like techniques and has used masscan or pnscan to discover\n[vulnerable systems. Black-T is no exception. However, there is a subtle difference between previously](https://techcommunity.microsoft.com/t5/azure-security-center/teamtnt-activity-targets-weave-scope-deployments/ba-p/1645968) [reported](https://www.cadosecurity.com/2020/08/17/teamtnt-the-first-crypto-mining-worm-to-steal-aws-credentials/)\nTeamTNT masscan operations and those present within Black-T. Specifically, in Black-T, we see the addition of a new\nscanning port, TCP 5555 (see Figure 9). While the exact purpose of adding port 5555 to the scanner is unknown, there\n[have been documented cases where XMR cryptojacking is occurring on Android-based devices. This could indicate a](https://threatpost.com/new-monero-crypto-mining-botnet-leverages-android-debugging-tool/129777/)\nnew unknown target set for expanding TeamTNT cryptojacking operations. However, there is little evidence to support\nTeamTNT targeting Android devices.\n\n\n-----\n\nFigure 9. TeamTNT masscan scanning\n\noperations.\nAdditionally, Black-T also performs scanning operations on a random CIDR 8 network range as it searches for exposed\nDocker API instances. This is also a new finding related to TeamTNT TTPs (see Figure 10). By expanding the\nscanning range of Black-T, TeamTNT actors are greatly expanding the scope of their targeting operations. Instead of\nonly scanning the local network range of a compromised system, Black-T will begin scanning an entire CIDR 8 network\nrange at random. For example, if Black-T selects 134.0.0.0/8, any address between 134.0.0.0 and 134.255.255.255\nwhich contains an exposed Docker daemon API will be targeted and Black-T will attempt to exploit that system. Given\nenough time, every publicly available IP address will be scanned for an exposed Docker daemon API system. This has\nthe potential to greatly increase the number of compromised systems owned by TeamTNT actors.\n\nFigure 10. Random Docker API scanning\n\noperation.\n\n## Conclusion\n\nTeamTNT is a cloud-focused cryptojacking group which targets exposed Docker daemon APIs. Upon successful\nidentification and exploitation of the Docker daemon API, TeamTNT will drop the new cryptojacking variant Black-T.\nThis variant installs up to three different types of network scanners (masscan, pnscan and zgrab), which are used to\nscan for additional exposed Docker daemon APIs. Black-T will also perform memory scraping operations following the\nsuccessful exploitation of the cloud system. This is performed via mimipy and mimipenguins scripts, which are\ndownloaded to the compromised system. Any identified passwords are then exfiltrated to a TeamTNT C2 node. Similar\nto the stolen AWS credentials also captured by the TeamTNT actors, these credentials are likely to be used for\nadditional operations targeted against the organization managing the compromised Docker API.\n\n\n-----\n\nIn order to protect cloud systems from TeamTNT s Black T cryptojacking malware, organizations should perform the\nfollowing actions:\n\nEnsure that cloud environments are not exposing Docker daemon APIs or any other network service, which\ninadvertently exposes sensitive internal network services.\n[Leverage Palo Alto Networks Prisma Cloud to secure cloud deployments.](https://www.paloaltonetworks.com/prisma/cloud)\n[Install the latest apps and threat definitions on the Palo Alto Networks Next-Generation Firewall.](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n\n## Indicators of Compromise\n\n**URLs**\n\nhxxps://teamtnt[.]red\n\nhxxps://teamtnt[.]red/BLACK-T/beta\n\nhxxps://teamtnt[.]red/BLACK-T/CleanUpThisBox\n\nhxxps://teamtnt[.]red/BLACK-T/setup/bd\n\nhxxps://teamtnt[.]red/BLACK-T/setup/docker-update\n\nhxxps://teamtnt[.]red/BLACK-T/setup/hole\n\nhxxps://teamtnt[.]red/BLACK-T/setup/kube\n\nhxxps://teamtnt[.]red/BLACK-T/setup/tshd\n\nhxxps://teamtnt[.]red/BLACK-T/SetUpTheBLACK-T\n\nhxxps://teamtnt[.]red/BLACK-T/SystemMod\n\nhxxps://teamtnt[.]red/ip_log/getip[.]php\n\nhxxps://teamtnt[.]red/only_for_stats/dup[.]php\n\nhxxps://teamtnt[.]red/x/getpwds[.]tar[.]gz\n\nhxxps://teamtnt[.]red/x/pw\n\nhxxps://iplogger[.]org/blahblahblah\n\n**Monero Mining Pool**\n\nMoneroOcean[.]stream\n\n**SHA-256 Hashes**\n\nBlack-T related hashes\n\n**SHA-256 Hash** **Filename**\n\n90c74c9ff4c502e155d2dc72f3f6c3f512d354d71b5c480c89b6c1b1852bcb1f bd.bin\n\n1cf803a8dd2a41c4b976106b0ceb2376f46bafddeafbcef6ff0c312fc78e09da beta.bin\n\na5dd446b2a7b8cfd6b6fd4047cc2fddfcea3a4865d8069dcd661e422046de2a1 bioset.bin\n\n9f8cb3f25a8b321b86ee52c16b03b3118f3b157b33e29899d265da3433a02c79 SetUpTheBLACK-T.bin\n\n6c16473060ffd9e215ee8fc82ff430384a8b99ea85000486f363e9bff062898d cleanupthisbox.bin\n\n\n-----\n\n139f393594aabb20543543bd7d3192422b886f58e04a910637b41f14d0cad375 docker-update.bin\n\n5b417032a80ddf4d9132a3d7d97027eeb08d9b94b89f5128863930c1967c84c4 getpwds.tar.gz\n\ne92b19f535fa57574401b6cdbf511a234a0b19335bd2ad6751839c718dc68e4d gimmecredz.sh\n\na506c6cf25de202e6b2bf60fe0236911a6ff8aa33f12a78edad9165ab0851caf kube.bin\n\nc0069aab1125a8ac1b9207e56371e86693b26b0dcab1630f337be55929b36a2a pw.bin\n\nfae2f1399282508a4f01579ad617d9db939d0117e3b2fcfcc48ae4bef59540d9 sbin_u\n\n84fabfbbd134bbeeb5481a96b023f44a671382349e5b39928baf0e80e28fd599 setup_moneroocean_miner.bin\n\n06e9cb770c61279e91adb5723f297d472a42568936199aef9251a27568fd119f systemmod.bin\n\na5e6b084cdabe9a4557b5ff8b2313db6c3bb4ba424d107474024030115eeaa0f tshd.bin\n\nMimipy and Mimipenguin Related Hashes\n\n**SHA-256 Hash** **Filename**\n\n79b478d9453cb18d2baf4387b65dc01b6a4f66a620fa6348fa8dbb8549a04a20 mimipenguin.py\n\n3acfe74cd2567e9cc60cb09bc4d0497b81161075510dd75ef8363f72c49e1789 mimipenguin.sh\n\n73a956f40d51da737a74c8ad4ecbfab12350621ffc167b5c278cd33ce9e0e0f0 mimipy.py\n\nb9b3a97ed5c335b61f2cc9783cb8f24c9cff741d020b850502542dbd81c2c2df pack.py\n\n1f09ccae15d8d452bde39f7ada9660df3cf0598137c5ac7a47027d8b9107415d pupyimporter.py\n\n023283c035a98fcb0b4d32bc103a44df5844c5e41c82261e0d029180cde58835 dbg.h\n\na0d4cbbb61e3b900a990a2b06282989c70d5d7cb93052ad7ec04dcd64701d929 max.h\n\n6cbf056fe35f1a809b8e8a2a5fc1f808bb4366e6e1ca2767fb82832d60c9ecf8 scanner.h\n\n9469e2937be4cf37e443ba263ffc1ee9aa1cf6b6a839ad60e3ecfe3e9e1bc24e targets.h\n\n9703cd1d00bf6f55b5becb1dd87ffcbd98b2ac791c152f7adcb728c5512df5e2 users.h\n\n88226956193afb5e5250639bd62305afde125a658b7e924ce5a5845d08f7de08 mimipenguin.c\n\n54d7524c73edbd9fe3cfa962656db23d6a2d8e4ebc6a58b116b3b78d732acfdf scanner.c\n\nac54934dd9b3b55296baf3e4d1aec959f540bed71d02a6f624edab281a719bdf targets.c\n\n00f116b831f720b62acf3a2d0db2a870b6ae114c4f9b3b517362a49c42c5a6f3 users.c\n\n**Monero Wallet**\n\n84xqqFNopNcG7T5AcVyv7LVyrBfQyTVGxMFEL2gsxQ92eNfu6xddkWabA3yKCJmfdaA9jEiCyFqfffKp1nQkgeq2Uu2dhB8\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-05 - Black-T- New Cryptojacking Variant from TeamTnT.pdf"
    ],
    "report_names": [
        "2020-10-05 - Black-T- New Cryptojacking Variant from TeamTnT.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1f6ae238-765f-4495-9d54-6a7883d7a319",
            "created_at": "2022-10-25T16:07:24.573456Z",
            "updated_at": "2025-03-27T02:02:10.284644Z",
            "deleted_at": null,
            "main_name": "TA511",
            "aliases": [
                "MAN1",
                "Moskalvzapoe"
            ],
            "source_name": "ETDA:TA511",
            "tools": [
                "Agentemis",
                "Chanitor",
                "Cobalt Strike",
                "CobaltStrike",
                "Ficker Stealer",
                "Hancitor",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "542cf9d0-9c68-428c-aff8-81b6f59dc985",
            "created_at": "2023-02-15T02:01:49.554105Z",
            "updated_at": "2025-03-27T02:00:03.110991Z",
            "deleted_at": null,
            "main_name": "Moskalvzapoe",
            "aliases": [
                "MAN1",
                "TA511"
            ],
            "source_name": "MISPGALAXY:Moskalvzapoe",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a6c351ea-01f1-4c9b-af75-cfbb3b269ed3",
            "created_at": "2023-01-06T13:46:39.390649Z",
            "updated_at": "2025-03-27T02:00:03.072899Z",
            "deleted_at": null,
            "main_name": "Kinsing",
            "aliases": [
                "Money Libra"
            ],
            "source_name": "MISPGALAXY:Kinsing",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535824,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653760123,
    "ts_modification_date": 1653760123,
    "files": {
        "pdf": "https://archive.orkl.eu/6688de90f2f4a42dab64bd0cad8eadce99c3b62d.pdf",
        "text": "https://archive.orkl.eu/6688de90f2f4a42dab64bd0cad8eadce99c3b62d.txt",
        "img": "https://archive.orkl.eu/6688de90f2f4a42dab64bd0cad8eadce99c3b62d.jpg"
    }
}