{
    "id": "3f6e7a1f-2d22-4446-9af6-c331eb7bb629",
    "created_at": "2023-01-12T15:08:27.113368Z",
    "updated_at": "2025-03-27T02:12:33.163201Z",
    "deleted_at": null,
    "sha1_hash": "26c9ff194149cad87d8fc2fc52214fa09460f530",
    "title": "2021-07-07 - Bandidos at large- A spying campaign in Latin America",
    "authors": "",
    "file_creation_date": "2022-05-28T21:49:06Z",
    "file_modification_date": "2022-05-28T21:49:06Z",
    "file_size": 1191366,
    "plain_text": "# Bandidos at large: A spying campaign in Latin America\n\n**[welivesecurity.com/2021/07/07/bandidos-at-large-spying-campaign-latin-america/](https://www.welivesecurity.com/2021/07/07/bandidos-at-large-spying-campaign-latin-america/)**\n\nJuly 7, 2021\n\nESET Research uncovers an active malicious campaign that uses new versions of old malware, Bandook,\nto spy on its victims\n\nIn 2021 we detected an ongoing campaign targeting corporate networks in Spanish-speaking countries,\nwith 90% of the detections in Venezuela. When comparing the malware used in this campaign with what\nwas previously documented, we found new functionality and changes to this malware, known as Bandook.\nWe also found that this campaign targeting Venezuela, despite being active since at least 2015, has\nsomehow remained undocumented. Given the malware used and the targeted locale, we chose to name\nthis campaign Bandidos.\n\nBandook is an old remote access trojan: there are references to it being available online as early as 2005,\nthough its use by organized groups was not documented until 2016. The report published that year by EFF,\n[Operation Manul, describes the use of Bandook to target journalists and dissidents in Europe. Then in](https://www.eff.org/files/2018/01/29/operation-manul.pdf)\n2018, Lookout published its research uncovering other espionage campaigns that had different targets but\n[used the same infrastructumre. They gave the name Dark Caracal to the group responsible for the attacks.](https://info.lookout.com/rs/051-ESQ-475/images/Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf)\nFinally, [Check Point’s report in 2020 showed that the attackers started to use signed executables to target](https://research.checkpoint.com/2020/bandook-signed-delivered/)\nmany verticals in various countries.\n\nPrevious reports have mentioned that the developers of Bandook might be developers for hire (also known\nas “malware as a service”), which makes sense given the various campaigns with different targets seen\nthrough the years. We must note, however, that in 2021 we have seen only one active campaign: the one\ntargeting Spanish-speaking countries that we document here.\n\n\n-----\n\nAlthough we have seen more than 200 detections for the malware droppers in Venezuela in 2021, we have\nnot identified a specific vertical targeted by this malicious campaign. According to our telemetry data, the\nmain interests of the attackers are corporate networks in Venezuela; some in manufacturing companies,\nothers in construction, healthcare, software services, and even retail. Given the capabilities of the malware\nand the kind of information that is exfiltrated, it seems like the main purpose of these Bandidos is to spy on\ntheir victims. Their targets and their method of approaching them is more similar to cybercrime operations\nthan to APT activities such as Operation Manul.\n\n## Attack overview\n\nMalicious emails with a PDF attachment are sent to targets. The PDF file contains a link to download a\ncompressed archive and the password to extract it. Inside the archive there is an executable file: a dropper\nthat injects Bandook into an Internet Explorer process. Figure 1 provides an overview of this attack chain.\n\n_Figure 1. Overview of a typical attack_\n\nEmails that contain these attachments are usually short; one example is shown in Figure 2. The phone\nnumber at the bottom of the message is a mobile number in Venezuela, though it is unlikely to be related to\nthe attackers.\n\n\n-----\n\n_Figure 2. Example of a malicious email_\n\n[The attackers use URL shorteners such as Rebrandly or](https://www.rebrandly.com/) [Bitly in their PDF attachments. The shortened](https://bitly.com/)\n[URLs redirect to cloud storage services such as Google Cloud Storage,](https://cloud.google.com/storage) [SpiderOak, or](https://spideroak.com/one/) [pCloud, from where](https://www.pcloud.com/)\nthe malware is downloaded.\n\nFigure 3 and Figure 4 are examples of PDFs used in this campaign. The images used in the PDFs are\nstock images available online.\n\n\n-----\n\n_Figure 3. Example of a malicious PDF file_\n\n\n-----\n\n_Figure 4. Another PDF file used for social engineering_\n\nThe content of the PDF files is generic and has been used with various filenames that change between\ntargets. The password for the downloaded archive is 123456.\n\nFor a list of URLs used to download the malware please refer to the section Indicators of Compromise\n_(IoCs)._\n\n## Dropper\n\nBandook is hybrid Delphi/C++ malware. The dropper is coded in Delphi and is easily recognizable because\nit stores the payload encrypted and base64 encoded in the resource section of the file. The main purpose\nof the dropper is to decode, decrypt and run the payload and to make sure that the malware persists in a\n[compromised system. The encryption algorithm was CAST-256 in samples from previous years of this](https://datatracker.ietf.org/doc/html/rfc2612)\n[campaign, but changed to GOST in 2021.](https://datatracker.ietf.org/doc/html/rfc5830)\n\nWhen the dropper is executed, it creates four instances of iexplore.exe, where the payload will be injected\nvia process hollowing. Then four entries are created in the Windows registry in\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion. The names of the registry keys are based on the\nprocess ID (PID) of each of these newly created processes and the values are base64 encoded and\n\n\n-----\n\ncontain the path to the dropper, a number to identify different actions, which will be explained later, and\nanother value that isn’t used in the samples that we analyzed. The created keys are shown in Figure 5,\nalong with an example of a decoded value.\n\n_Figure 5. Registry keys created by the dropper with an example of a stored value (decoded)_\n\nSamples from other campaigns follow the same logic, but they use other encryption algorithms.\n\n## Payload\n\nWhen the payload is injected inside the iexplore.exe processes, it will start loading global variables used for\nvarious purposes:\n\nNames for mutexes\nNames for Windows registry keys\nURLs used for:\n\nC&C communication\nDownloading malicious DLLs\nParameters to some DLL functions\nFilenames, for example for persistence\nVariables used as parameters for some DLL functions\nPaths for downloaded files\nPayload execution date\n\nOnce the payload has finished loading the global variables, it will continue its execution obtaining its\ninjected process’s PID. This PID is used to obtain the base64-encoded data created by the dropper,\nmentioned above. Once the data is retrieved, the payload will decode it and get the action identifier (see\nFigure 5) value from it. This value indicates the action it must perform.\n\nDepending on the obtained value, the payload is capable of performing four different actions.\n\nIf the value is 0:\n\nCreates a Windows registry key with the name mep\nTries to download two DLLs from a URL in the global variables\nTries to load these DLLs into memory\nCreates different threads to invoke some of these DLLs’ functions\nStarts active communication with the C&C server\n\nIf the value is 1:\n\n\n-----\n\nEstablishes persistence on the victim s machine; this will be explained in the Registry and persistence\nsection.\n\nIf the value is 2:\n\nCreates a Windows registry key with the name api\nSearches for one of the downloaded DLLs, named dec.dll; if it exists, loads it into memory and calls\nthe export method Init, which creates five folders used for different purposes – for example, save\nencrypted logs on the Bandook persisted folder mentioned in the Registry and persistence section.\n\nIf the value is 3:\n\nCreates a registry key with the name pim\nChecks whether persistence succeeded; if not, will establish persistence in the folder mentioned in\nthe Registry and persistence section.\n\nFigure 6 depicts a decompilation of this payload-handling code.\n\n_Figure 6. Payload logic to execute different actions regarding the value obtained from the registry_\n\nTwo DLLs can be downloaded from the first action mentioned above or during communication with the\nC&C server, and they are named dec.dll and dep.dll (the internal name for the first one is capmodule.dll).\n\n\n-----\n\ndec.dll has a set of functions that enable spying on the victim s machine. Some of these functions are\ncapable of dropping a malicious Google Chrome extension, and of stealing information from a USB Drive.\nMeanwhile, dep.dll, which we weren’t able to obtain, has a set of functions that seem to be related to\nhandling files in various formats:\n\nMP1\nMP3\nMP4\nMP5\nMP6\n\nFigure 7 shows part of the decompiled code that loads dec.dll into memory. Figure 8 shows the code\nrelated to dep.dll.\n\n_Figure 7. Dynamic load of dec.dll into memory_\n\n\n-----\n\n_Figure 8. Dynamic load of dep.dll into memory_\n\n### Registry and persistence\n\nThe payload achieves persistence on the victim’s machine by copying the dropper into a new folder,\ncreated by the payload at a path of the form:\n\n%APPDATA%\\<RANDOM_STRING>\\<RANDOM_STRING>.exe\n\nBoth the persisted dropper and the folder use the same name, which is a random string generated by the\npayload. The screenshot in Figure 9 shows the registry value created by the payload to maintain\npersistence.\n\n_Figure 9. Malware persistence in the registry_\n\nWe have also detected other values created by the payload in the Windows registry keys related with its\nbehavior, like: the name used for persistence, a random number used as an ID to identify the victim’s\nmachine, possible filenames (these files can be downloaded by the payload or created by itself), and\ninfection date, among other things.\n\nTable 1 contains the registry entries created by the payload during our analysis, with a brief description of\nthem.\n\n_Table 1. Registry entries created by one of the analyzed Bandook samples_\n\n**Registry path** **Key** **Value** **Description**\n\n\n-----\n\n**Registry path** **Key** **Value** **Description**\n\nHKCU\\Software\\ der333f Ixaakiiumcicbcpspmof Random string\nused for\npersistence\n\nFDFfda 5/5/2021 Compromise date\n\nNVhfhfjs <RANDOM_NUMBER> Used to identify the victim’s\nmachine\n\nHKCU\\Software\\VBffhdfhf AMMY132 <RANDOM_NUMBER>.exe Related to the\nexport method\nExecuteAMMMY\nfrom dec.dll\n\ngn <RANDOM_NUMBER>.exe Related to a new file\ndownloaded during the\ndownload of the DLLs,\nbefore the connection to the\nC&C server\n\nidate 05.05.2021 Compromise date\n\nmep 2608 Process ID from the\npayload used for the\ncommunication with the\nC&C server\n\nrno1 <RANDOM_NUMBER>.exe Can be used to rename a\ndownloaded file through the\nC&C communication\n\ntvn <RANDOM_NUMBER>.dce Related with the export\nmethod ExecuteTVNew\nfrom dec.dll\n\napi 2716 ProcessID from one of the\npayloads used to install the\nexternal DLLs\n\npim 2732 ProcessID from one of the\npayloads that checks the\nmalware persistence\n\nDRT3 1 Related with the export\nname ChromeInject from\ndec.dll\n\nOther registry locations that can be used to achieve persistence on the victim’s machine are:\n\nHKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\nHKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\n\n### Network communication\n\nThe communication begins by obtaining the IP address from a domain (d2.ngobmc[.]com) located in the\nglobal variables and then establishing a TCP connection to that address with a four-digit port number that\nchanges according to the campaign Once the payload establishes this connection it sends basic\n\n\n-----\n\ninformation from the victim s machine, like computer name, username, OS version, infection date, and\nmalware version.\n\nAfter that, the payload will maintain active communication with the C&C server, waiting for commands to\nexecute.\n\nIn many cases the information sent to the C&C server is going to be encrypted using the algorithm AES in\nCFB mode with the key HuZ82K83ad392jVBhr2Au383Pud82AuF, but in other cases the information is sent\nas cleartext.\n\nThe following is an example of the basic information to be exfiltrated to the C&C server, before it is\nencrypted:\n\n!O12HYV~!2870~!0.0.0.0~!Computer~!Administrator~!Ten~!0d 14h\n2m~!0~!5.2~!FB2021~!0~!0~!0~!0~!~!0~!0–~!None~!0~!5/5/2021~!\n\nOf particular interest are the fields:\n\n!O12HYV: Hardcoded value\n2870: Victim’s ID generated by the malware\n0.0.0.0: Victim’s IP address (fake value for privacy reasons)\nComputer: Computer name\nAdministrator: Username\nTen: OS version\n5.2: Malware version\nFB2021: Campaign ID\n5/5/2021: Date of compromise\n\nFigure 10 and Figure 11 are Wireshark screenshots displaying two different examples of encrypted and\ncleartext transmission of information sent to the C&C server.\n\n_Figure 10. Traffic capture with encrypted information sent to the C&C server_\n\n\n-----\n\n_Figure 11. Traffic capture with cleartext information sent to the C&C server_\n\nRegarding the commands that the payload is capable of processing, we found that this sample has 132\ncommands, although some of these have very similar behaviors. These commands use the following\npattern: @<ID> – for example, @0001 – except for the *DJDSR^ command. Depending on the received\ncommand, the payload is capable of performing the following actions:\n\nObtain information from the victim’s drive units:\n\nHDD\nCD-ROM\nUSB\nLists the content of a specific directory:\n\nFolders\nFiles\nFile manipulation:\n\nRead\nMove\nDelete\nRename\nTake screenshots\nControl the cursor on the victim’s machine:\n\nMove it to a specific position\nPerform left or right clicks\nInstall or uninstall the malicious DLLs (dec.dll or dep.dll)\nClose some connections previously opened by the payload\nKill running processes or threads\nPop up a message using MessageBoxA\nSend files to the C&C server\nInvoke DLL functions (dec.dll or dep.dll)\n\n\n-----\n\nWindows registry manipulation:\n\nCheck the existence of a registry key or value\nCreate a registry key or value\nDelete a registry key or value\nUninstall the malware\nDownload a file from a URL\nExecute downloaded files using the function ShellExecuteW\nObtain the victim’s public IP address\nSkype program manipulation:\n\nStop the process\nCheck the existence of the main.db file\nStops the Teamviewer process and invokes a function from the dec.dll named ExecuteTVNew\nCheck for Java being installed on the victim’s machine\nExecute files with extension .pyc or .jar using Python or Java.\n\nHere is a list of what dec.dll is capable of doing on the victim’s machine:\n\nChrome browser manipulation\nFile manipulation:\n\nCompress a file\nSplit a file\nSearch for a file\nUpload a file\nSend files to the C&C server\nUSB manipulation\nGet Wi-Fi connections\nStart a shell\nDDoS\nSign out from Skype\nManipulate the victim’s screen\nManipulate the victim’s webcam\nRecord sound\nExecute malicious programs\n\n### DLL analysis – ChromeInject functionality\n\nWhen the communication with the C&C server is established, as we mentioned above, the payload\ndownloads dec.dll. We conducted an analysis of one of the most interesting exported methods, named\nChromeInject.\n\nThis method creates a malicious Chrome extension, by:\n\nTerminating the chrome.exe process if it is running\nCreating a folder under %APPDATA%\\OPR\\\nCreating two files:\n\n%APPDATA%\\OPR\\Main.js\n%APPDATA%\\OPR\\Manifest.json\nEnabling developer mode of Google Chrome by manipulating the preference file located at:\n\n%LOCALAPPDATA%\\Google\\Chrome\\User Data\\Default\nObtaining the Google Chrome executable path by accessing the registry, in this case it accesses:\n\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\chrome exe\n\n\n-----\n\nLaunching Google Chrome\nInvoking Windows APIs such as GetForegroundWindow, SetClipboardData, and keybd_event, to\nload a malicious Chrome extension by simulating a user installation, it:\n\nLoads chrome://extensions into the clipboard and pastes it by sending Ctrl+V keystrokes\nSends Tab keystrokes to select the Load unpacked option\nLoads the path to the OPR folder into the clipboard and pastes it by sending Ctrl+V keystrokes\n\nThis malicious extension tries to retrieve any credentials that the victim submits to a URL by reading the\nvalues inside the form tag before they are sent. These credentials are stored in Chrome’s local storage with\nthe key batata13 and their corresponding URL, where the credentials are sent, with the key batata14. This\ninformation is exfiltrated to a different URL located in the global variables of the payload. In our sample this\nURL was:\n\nhttps://pronews[.]icu/gtwwfggg/get.php?action=gc1\n\nFigure 12 shows the installed malicious Chrome extension.\n\n_Figure 12. Malicious extension created by the malware_\n\nFigure 13 and Figure 14 are screenshots respectively displaying the Manifest.json and the Main.js\n(deobfuscated) source code.\n\n\n-----\n\n_Figure 13. Manifest file of the malicious extension_\n\n_Figure 14. Main.js file with malicious code deobfuscated_\n\n### Overlaps and differences with other campaigns\n\n\n-----\n\nWe compared the behavior of our analyzed sample against other posts and documented campaigns like\nOperation Manul and Dark Caracal and there are some similarities, like:\n\nThe payloads use the same encryption algorithm for communication with the C&C server, AES in\nCFB mode.\nThe encrypted information sent to the C&C server uses the string suffix &&& at the end of it.\nThe payloads use the ~! suffix string as a delimiter for the information sent or received.\nTwo samples included in the Operation Manul report (SHA-1:\nADB7FC1CC9DD76725C1A81C5F17D03DE64F73296 and\n916DF5B73B75F03E86C78FC3D19EF5D2DC1B7B92) seem to be connected to the Bandidos\ncampaign, according to our telemetry data. The campaign ID for these samples (January 2015 v3\nand JUNE 2015 TEAM) show how far back in time the campaigns go.\nAll the samples included in Check Point’s report as “Full Version” in fact target Venezuela and are\npart of the Bandidos campaign.\nThe dropper uses the process hollowing technique to inject the payloads.\n\nWe also found some differences, showing changes to the malware over the years, like:\n\n[The dropper, for this campaign, changed its encryption algorithm from CAST-256 to](https://datatracker.ietf.org/doc/html/rfc2612) [GOST.](https://datatracker.ietf.org/doc/html/rfc5830)\nIt seems that the malware now has only two DLLs for all its extra functionality instead of the five DLLs\nmentioned in the Operation Manul report.\nTwo new export methods have been added to the dec.dll, named GenerateOfflineDB and\nRECSCREEN.\nThis latest sample contains 132 commands, instead of the 120 commands mentioned in Check\nPoint’s report.\nUnlike the smaller executables described in Check Point’s report, which are signed and seem to be\npart of a different campaign, these samples are unsigned executables.\nThere is a command with the string AVE_MARIA, which has been used in many RATs (for example,\nWarzone RAT).\n\n## Conclusion\n\nBandook is a RAT active since 2005. Its involvement in different espionage campaigns, already\ndocumented, shows us that it is still a relevant tool for cybercriminals. Also, if we consider the modifications\nmade to the malware over the years, it shows us the interest of cybercriminals to keep using this piece of\nmalware in malicious campaigns, making it more sophisticated and more difficult to detect.\n\n[Although there are few documented campaigns in Latin America, such as Machete or](https://www.welivesecurity.com/2019/08/05/sharpening-machete-cyberespionage/) [Operation Spalax,](https://www.welivesecurity.com/2021/01/12/operation-spalax-targeted-malware-attacks-colombia/)\nVenezuela is a country that, due to its geopolitical situation, is a likely target for cyberespionage.\n\nA full and comprehensive list of Indicators of Compromise (IoCs) and samples can be found in our GitHub\nrepository.\n\n_For any inquiries, or to make sample submissions related to the subject, contact us at_\n_threatintel@eset.com._\n\n## Indicators of Compromise (IoCs)\n\n### C&C servers\n\n\n-----\n\nd1.ngobmc[.]com:7891 – 194.5.250[.]103\nd2.ngobmc[.]com:7892 – 194.5.250[.]103\nr2.panjo[.]club:7892 – 45.142.214[.]31\npronews[.]icu – 194.36.190[.]73\nladvsa[.]club – 45.142.213[.]108\n\n### Samples\n\n**SHA-1** **ESET detection name** **Description**\n\n4B8364271848A9B677F2B4C3AF4FE042991D93DF PDF/TrojanDownloader.Agent.AMF Malicious\nemail\n\nF384BDD63D3541C45FAD9D82EF7F36F6C380D4DD PDF/TrojanDownloader.Agent.AMF Malicious\nPDF\n\nA06665748DF3D4DEF63A4DCBD50917C087F57A27 PDF/Phishing.F.Gen Malicious\nPDF\n\n89F1E932CC37E4515433696E3963BB3163CC4927 Win32/Bandok.NAT Dropper\n\n124ABF42098E644D172D9EA69B05AF8EC45D6E49 Win32/Bandok.NAT Dropper\n\nAF1F08A0D2E0D40E99FCABA6C1C090B093AC0756 Win32/Bandok.NAT Dropper\n\n0CB9641A9BF076DBD3BA38369C1C16FCDB104FC2 Win32/Bandok.NAT Payload\n\nD32E7178127CE9B217E1335D23FAC3963EA73626 Win32/Bandok.NAT Payload\n\n5F58FCED5B53D427B29C1796638808D5D0AE39BE Win32/Bandok.NAT Payload\n\n1F94A8C5F63C0CA3FCCC1235C5ECBD8504343437 - dec.dll\n(encrypted)\n\n8D2B48D37B2B56C5045BCEE20904BCE991F99272 JS/Kryptik.ALB Main.js\n\n### Download URLs\n\nhttps://rebrand[.]ly/lista-de-precios-2021\n\nhttps://rebrand[.]ly/lista-de-precios-01\n\nhttps://rebrand[.]ly/Lista-de-Precios\n\nhttps://rebrand[.]ly/lista-de-precios-actualizada\n\nhttps://rebrand[.]ly/Lista-de-precio-1-actualizada\n\nhttps://rebrand[.]ly/Lista-de-precios-2-actualizada\n\nhttps://rebrand[.]ly/Precios-Actualizados\n\nhttps://rebrand[.]ly/recibo-de-pago-mes-03\n\nhttps://rebrand[.]ly/Factura-001561493\n\nhttps://rebrand[.]ly/Comunicado_Enero\n\nhttps://rebrand[.]ly/Comunicado-23943983\n\nhttps://rebrand[.]ly/Cotizacion-de-productos\n\nhttps://rebrand[.]ly/informacion_bonos_productividad\n\nhttps://rebrand[.]ly/aviso-de-cobro\n\nhttps://bit[.]ly/lista-de-precios2\n\nhttp://bit[.]ly/2yftKk3\n\n\n-----\n\nhttps://bitly[.]com/v-coti_cion03\nhttps://spideroak[.]com/storage/OVPXG4DJMRSXE33BNNPWC5LUN5PTMMZXG4ZTM/shared/17593281-1050/Cotizacion nuevas.rar?ad16ce86ca4bb1ff6ff0a7172faf2e05\nhttps://spideroak[.]com/storage/OVPXG4DJMRSXE33BNNPWC5LUN5PTMMRSHA4DA/shared/17442301-1028/Lista%20de%20Precios.rar?cd05638af8e76da97e66f1bb77d353eb\nhttps://filedn[.]com/lpBkXnHaBUPzXwEpUriDSr4/Lista_de_precios.rar\nhttps://filedn[.]com/l9nI3nYhBEH5QqSeMUzzhMb/Facturas/Lista_de_Precios.rar\n\n### Older C&C servers\n\nd1.p2020[.]club:5670\n\nd2.p2020[.]club:5671\n\ns1.fikofiko[.]top:5672\n\ns2.fikofiko[.]top:5673\n\ns3.fikofiko[.]top:5674\n\ns1.megawoc[.]com:7891\n\ns2.megawoc[.]com:7892\n\ns3.megawoc[.]com:7893\n\nhellofromtheotherside[.]club:6792\n\nmedialog[.]top:3806\n\nnahlabahla.hopto[.]org:9005\n\ndianaojeil.hopto[.]org:8021\n\nnathashadarin.hopto[.]org:8022\n\nlaraasaker.hopto[.]org:5553\n\nmayataboush.hopto[.]org:5552\n\njhonny1.hopto[.]org:7401\n\nj2.premiumdns[.]top:7402\n\nj3.newoneok[.]top:9903\n\np2020[.]xyz\n\nvdsm[.]xyz\n\nwww.blueberry2017[.]com\n\nwww.watermelon2017[.]com\n\nwww.orange2017[.]com\n\ndbclave[.]info\n\npanel.newoneok[.]top\n\n## MITRE ATT&CK techniques\n\n_[Note: This table was built using version 9 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)_\n\n**Tactic** **ID** **Name** **Description**\n\n\nInitial\nAccess\n\n\n[T1566.001](https://attack.mitre.org/versions/v9/techniques/T1566/001/) Phishing: Spearphishing\nattachment\n\n\nExecution [T1204.001](https://attack.mitre.org/versions/v9/techniques/T1204/001/) User Execution: Malicious\nLink\n\n\nBandook operators have used\nemails with PDF files attached\nthat contain links to download\nmalware.\n\nBandook operators have used\nmalicious links to download\nmalware.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1204.002](https://attack.mitre.org/versions/v9/techniques/T1204/002/) User Execution: Malicious\nFile\n\n\nBandook operators have\nattempted to get victims to\nexecute malicious files.\n\n\nDefense\nEvasion\n\n\n[T1027](https://attack.mitre.org/versions/v9/techniques/T1027/) Obfuscated Files or\ninformation\n\n\nBandook operators encrypt the\npayload hidden in the dropper.\n\n\n[T1055.012](https://attack.mitre.org/versions/v9/techniques/T1055/012/) Process Injection: Process\nHollowing\n\n\nBandook operators use\nprocess hollowing to inject\nthe payload into legitimate\nprocesses.\n\n\n[T1112](https://attack.mitre.org/versions/v9/techniques/T1112/) Modify Registry Bandook operators have\nattempted to modify\nregistry entries to hide\ninformation.\n\n\n[T1547.001](https://attack.mitre.org/versions/v9/techniques/T1547/001/) Boot or Logon Autostart\nExecution: Registry Run\nkeys / Startup Folder\n\n\nBandook operators have\nattempted to create a Run\nregistry key.\n\n\nDiscovery [T1057](https://attack.mitre.org/versions/v9/techniques/T1057/) Process Discovery Bandook uses Windows API\nfunctions to discover running\nprocesses on victim’s\nmachines.\n\n[T1083](https://attack.mitre.org/versions/v9/techniques/T1083/) File and Directory Discovery Bandook operators try to\ndiscover files or folders\nfrom a specific path.\n\n\nCollection [T1025](https://attack.mitre.org/versions/v9/techniques/T1025/) Data from Removable\nMedia\n\n[T0156.001](https://attack.mitre.org/versions/v9/techniques/T1056/001/) Input Capture: Keylogging Bandook operators may\ntry to capture user\nkeystrokes to obtain\ncredentials.\n\n[T1113](https://attack.mitre.org/versions/v9/techniques/T1113/) Screen Capture Bandook can take\nscreenshots from the\nvictim’s machine.\n\n[T1123](https://attack.mitre.org/versions/v9/techniques/T1123/) Audio Capture Bandook can record audio\nfrom the victim’s machine.\n\n[T1125](https://attack.mitre.org/versions/v9/techniques/T1125/) Video Capture Bandook can record video\nfrom the webcam.\n\n\nBandook operators try to read\ndata from removable media.\n\nBandook uses AES for\nencrypting C&C\ncommunications.\n\nBandook exfiltrates information\nover the same channel used\nfor C&C.\n\n\nCommand\nAnd\nControl\n\n\n[T1573.001](https://attack.mitre.org/versions/v9/techniques/T1573/001/) Encrypted Channel:\nSymmetric Cryptography\n\n\nExfiltration [T1041](https://attack.mitre.org/versions/v9/techniques/T1041/) Exfiltration Over C2\nchannel\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1048.002](https://attack.mitre.org/versions/v9/techniques/T1048/002/) Exfiltration Over Alternative\nProtocol: Exfiltration Over\nAsymmetric Encrypted NonC2 Protocol\n\n7 Jul 2021 - 11:30AM\n\n\nBandook exfiltrates\ninformation using a\nmalicious URL via HTTPS.\n\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-07 - Bandidos at large- A spying campaign in Latin America.pdf"
    ],
    "report_names": [
        "2021-07-07 - Bandidos at large- A spying campaign in Latin America.pdf"
    ],
    "threat_actors": [
        {
            "id": "d303c77e-0110-471b-a3a6-37fce9ac848d",
            "created_at": "2022-10-25T15:50:23.342452Z",
            "updated_at": "2025-03-27T02:00:55.447692Z",
            "deleted_at": null,
            "main_name": "Machete",
            "aliases": [
                "APT-C-43",
                "El Machete"
            ],
            "source_name": "MITRE:Machete",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af704c54-a580-4c29-95f2-82db06fbb6f9",
            "created_at": "2022-10-25T16:07:23.525064Z",
            "updated_at": "2025-03-27T02:02:09.845137Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "ATK 27",
                "Operation Dark Caracal",
                "TAG-CT3"
            ],
            "source_name": "ETDA:Dark Caracal",
            "tools": [
                "Bandok",
                "Bandook",
                "CrossRAT",
                "FinFisher",
                "FinFisher RAT",
                "FinSpy",
                "Pallas",
                "Trupto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4347dfe-2489-4fe4-8097-f4be33aadac2",
            "created_at": "2022-10-25T16:07:23.973289Z",
            "updated_at": "2025-03-27T02:02:10.057398Z",
            "deleted_at": null,
            "main_name": "Operation Manul",
            "aliases": [],
            "source_name": "ETDA:Operation Manul",
            "tools": [
                "Bandok",
                "Bandook",
                "JRat",
                "Jacksbot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "64d750e4-67db-4461-bae2-6e75bfced852",
            "created_at": "2022-10-25T16:07:24.01415Z",
            "updated_at": "2025-03-27T02:02:10.077988Z",
            "deleted_at": null,
            "main_name": "Operation Spalax",
            "aliases": [],
            "source_name": "ETDA:Operation Spalax",
            "tools": [
                "AsyncRAT",
                "Bladabindi",
                "Jorik",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a62c0be-1583-4d82-8f91-46e3a1c114e6",
            "created_at": "2023-01-06T13:46:38.73639Z",
            "updated_at": "2025-03-27T02:00:02.905024Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "G0070"
            ],
            "source_name": "MISPGALAXY:Dark Caracal",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8de10e16-817c-4907-bd98-b64cf4a3e77b",
            "created_at": "2022-10-25T15:50:23.552766Z",
            "updated_at": "2025-03-27T02:00:55.497706Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "Dark Caracal"
            ],
            "source_name": "MITRE:Dark Caracal",
            "tools": [
                "FinFisher",
                "CrossRAT",
                "Bandook"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536107,
    "ts_updated_at": 1743041553,
    "ts_creation_date": 1653774546,
    "ts_modification_date": 1653774546,
    "files": {
        "pdf": "https://archive.orkl.eu/26c9ff194149cad87d8fc2fc52214fa09460f530.pdf",
        "text": "https://archive.orkl.eu/26c9ff194149cad87d8fc2fc52214fa09460f530.txt",
        "img": "https://archive.orkl.eu/26c9ff194149cad87d8fc2fc52214fa09460f530.jpg"
    }
}