{
    "id": "3f7842f8-cf67-4d73-ab55-80e2f0b2307a",
    "created_at": "2023-01-12T15:08:03.348186Z",
    "updated_at": "2025-03-27T02:05:43.932239Z",
    "deleted_at": null,
    "sha1_hash": "084e4f9f207da00e0aa281e2f85fd6f3d3d38427",
    "title": "2016-03-20 - Hidden Tear Project- Forbidden Fruit Is the Sweetest",
    "authors": "",
    "file_creation_date": "2022-05-27T21:06:41Z",
    "file_modification_date": "2022-05-27T21:06:41Z",
    "file_size": 153580,
    "plain_text": "# Hidden Tear Project: Forbidden Fruit Is the Sweetest\n\n**[tripwire.com/state-of-security/security-data-protection/cyber-security/hidden-tear-project-forbidden-fruit-is-the-sweetest/](https://www.tripwire.com/state-of-security/security-data-protection/cyber-security/hidden-tear-project-forbidden-fruit-is-the-sweetest/)**\n\nTripwire Guest Authors March 21, 2016\n\nThe scourge of ransomware is by far today’s biggest computer security concern. By stepping\ninto the crypto realm, cybercrooks have thrown down the gantlet to antivirus labs around the\nglobe that are still mostly helpless in the face of this challenge.\n\nWhile many experts have been busy reverse-engineering obtained ransomware samples and\nposting complex flowcharts to demonstrate their modus operandi, a Turkish programmer\nnamed [Utku Sen made a very bold but questionable move.](https://twitter.com/utku1337)\n\nNot only did he write code for a viable ransomware as a proof-of-concept, but he also made\n[it publicly available on his GitHub page in mid-August 2015. The project, dubbed Hidden](https://github.com/utkusen/hidden-tear)\n[Tear, happens to be entirely open-source. To the author’s credit, he added a disclaimer](http://myspybot.com/hidden-tear/)\nemphasizing the strictly educational goals of the initiative. This notice, predictably enough,\ndidn’t stop threat actors from taking advantage of the code in the worst way imaginable.\n\nSince anyone with basic programming skills can use it to launch an extortion campaign of\ntheir own, the initially benign project resulted in the emergence of numerous real-world\ncrypto Trojans with minor tweaks.\n\n**HIDDEN TEAR 101**\n\n\n-----\n\nUtku Sen s proof-of-concept uses AES encryption to encode files located inside \\test\ndirectory on the infected system’s Desktop. The above acronym stands for Advanced\nEncryption Standard. Originally known as Rijndael, this algorithm is symmetric, which means\nthat the encryption and decryption keys are identical. The key can be 128-, 192-, or 256-bits\nlong. Ideally, either degree of entropy suffices to make brute-forcing virtually inefficient and\nkeep a victim’s files hostage.\n\nThe ransomware transmits the key to a remote server so that it’s only available to the\noperator. To recover data, the infected person needs to have a specially crafted decryption\nprogram and the secret key at their disposal. These two prerequisites are the objects of\nnegotiation, or rather, a bargain between the perpetrator and the user. The Trojan creates a\ndocument with detailed recovery instructions and relevant hyperlinks on the Desktop.\n\nOwing to a lightweight payload of only 12 KB, the infection is easy to distribute through\n[phishing emails that contain a booby-trapped attachment. Furthermore, Hidden Tear boasts](https://www.tripwire.com/state-of-security/latest-security-news/report-phishing-scams-cost-companies-millions-per-year/)\nantivirus evasion techniques that allow it to fly under the radar of popular AV engines.\nExtensive flexibility of the code makes it trivial for anybody interested to devise a custom\nvariant of the program. The researcher also made a short video demonstrating his brainchild\nin action.\n\nIn a [post published on his blog in late November, Sen explained his genuine motivations and](http://www.utkusen.com/blog/destroying-the-encryption-of-hidden-tear-ransomware.html)\nresponded to criticism regarding his project. In particular, he admitted that the abuse of\nHidden Tear by script kiddies or other parties was a foreseeable but undesirable\nconsequence. This is why the author deliberately incorporated a security flaw into the code,\neffectively turning it into a honeypot for likely offenders.\n\nAccording to the researcher, the decryption key can be retrieved from the timestamp of an\narbitrary ciphered file and the amount of time elapsed since the operating system launched.\nOnce these values have been obtained via GetLastWriteTime method and\nEnvironment.TickCount property, all that’s left to do is put two and two together. For the\naverage computer expert, this shouldn’t pose a difficulty.\n\n**REAL-WORLD ABUSE INCIDENTS**\n\nThe evolution of crypto malware gave birth to a new phenomenon known as Ransomware as\na Service (RaaS). It denotes an affiliate framework where some criminals do the\nprogramming part and others distribute the readily available infection. Meanwhile, the latter\nhave to share 20-25 percent of their revenue with the developer. No wonder the wannabe\nextortionists became interested in Utku Sen’s project, which was completely free to use.\n\n[Scoundrels reportedly ended up coining more than 20 standalone strains based on Hidden](https://securelist.com/blog/research/73565/hidden-tear-and-its-spin-offs/)\nTear. In particular, the source code came in handy to the black hats responsible for the\nfollowing notorious ransomware families:\n\n\n-----\n\n[1. Encoder is the first-ever ransom Trojan that targets Linux-based web servers. It](https://www.tripwire.com/state-of-security/latest-security-news/new-ransomware-strain-targets-websites-powered-by-linux-os/)\n\nsurfaced at the beginning of November 2015. Luckily, this edition had a critical flaw that\nallowed researchers from Bitdefender to crack the crypto and obtain the AES key from\nthe timestamp of any encoded file. And yet, this sample was revolutionary because\nnever before had Linux undergone ransomware attacks.\n\n1. Discovered by Trend Micro mid-January 2016, B turned out to be another incarnation\n\nof Hidden Tear. The distributor of this ransomware appears to operate in Brazil. The\nransom instructions are written in Portuguese, and the racketeer demands the Brazilian\ncurrency equivalent of US$500 for decryption. Ultimately, Utku Sen was able to help\nthe infected users since the sample was backdoored. Interestingly enough, the\nscammer never configured the Trojan to send the AES keys to a C&C server or simply\nsave them anywhere. This means that victims had no chances to get their data back\neven if they paid the ransom.\n\n1. Magic Ransomware is the most recent spin-off first spotted in late January this year.\n\nUnlike the earlier copycats, this one is based on EDA2, another POC created by Utku\nSen. The malware appends .magic extension to filenames and extorts 1 Bitcoin for\ndata restoration. For a number of reasons, which will be highlighted in the next section\nof this article, the whole campaign turned out an epic fail.\n\n1. More than a dozen samples representing the Trojan-Ransom.MSIL.Tear family were\n\nfound to also utilize Hidden Tear code. As per the in-depth analysis, however, these are\nscript kiddies’ experiments rather than professional ransomware plagues. Some of\nthem, including Trojan-Ransom.MSIL.Tear.r and Trojan-Ransom.MSIL.Tear.t, sent AES\nkeys to example.com domain, which the attackers configured as their Command and\nControl server. Obviously, the victims’ data vanished for good.\n\n**HIDDEN TEAR AUTHOR BLACKMAILED**\n\nThe aforementioned Magic Ransomware case went terribly wrong. It was built with Sen’s\nopen-source EDA2 code. The researcher expected he could harness vulnerabilities in the\ncontrol script to access the database of decryption keys. However, it turned out that the\ncrooks behind the actual Trojan were using a C&C server located on a free hosting service.\nSomeone submitted a complaint, which resulted in the takedown of the malicious Command\nand Control. The programmer was, therefore, unable to retrieve the database even with his\npre-injected backdoor.\n\nWhat happened next was unexpected for everyone involved. Distributors of the Magic virus\n[joined the discussion of their ransomware on a popular security forum. They asked Utku Sen](http://www.bleepingcomputer.com/forums/t/603051/magic-ransomware-support-topic-magicexe-executable-and-adds-magic-extension/)\nto remove the source code for his projects from GitHub and send them 3 Bitcoins. If these\ndemands were met, the criminals promised they would assist everyone infected in data\n\n\n-----\n\nrecovery for free. At the end of the day, Sen abandoned Hidden Tear and EDA2, making both\nunavailable to the public. The hackers, in their turn, provided decryption details to the victims\nwho asked for help.\n\nIt’s unclear why exactly the perpetrators did this, but the infected users got their files back,\nwhich is a win.\n\n**RECAP**\n\nUtku Sen’s original motivations were to demonstrate researchers the ins and outs of how\nransomware works. He also adopted measures to mitigate possible damage by injecting\nbackdoors into his code. However, the emergence of Hidden Tear caused a spike in\nransomware incidents. Providing a fully functional free extortion tool and expecting it to never\ngo beyond the educational framework is wishful thinking.\n\nNow that Hidden Tear is no longer available on official resources, there’s no guarantee that\ninterested parties will discontinue using it in new rip-off campaigns. It’s naive to believe that\ncybercriminals failed to make and distribute copies of the code. Meanwhile, security\nprofessionals should think twice before publishing similar POCs. Even with backdoors under\nthe hood, they may get out of hand.\n\n**About the Author:** _David Balaban is a computer security_\n_researcher with over 10 years of experience in malware analysis_\n_and antivirus software evaluation. David runs the www.Privacy-_\n_PC.com project which presents expert opinions on the_\n_contemporary information security matters, including social_\n_engineering, penetration testing, threat intelligence, online_\n_privacy and white hat hacking. As part of his work at Privacy-PC,_\n_Mr. Balaban has interviewed such security celebrities as Dave_\n_Kennedy, Jay Jacobs and Robert David Steele to get firsthand_\n_perspectives on hot InfoSec issues. David has a strong malware_\n_troubleshooting background, with the recent focus on ransomware countermeasures._\n\n**Editor’s Note:** _The opinions expressed in this guest author article are solely those of the_\n_contributor, and do not necessarily reflect those of Tripwire, Inc._\n\n_[Title image courtesy of ShutterStock](http://www.shutterstock.com/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-03-20 - Hidden Tear Project- Forbidden Fruit Is the Sweetest.pdf"
    ],
    "report_names": [
        "2016-03-20 - Hidden Tear Project- Forbidden Fruit Is the Sweetest.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536083,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653685601,
    "ts_modification_date": 1653685601,
    "files": {
        "pdf": "https://archive.orkl.eu/084e4f9f207da00e0aa281e2f85fd6f3d3d38427.pdf",
        "text": "https://archive.orkl.eu/084e4f9f207da00e0aa281e2f85fd6f3d3d38427.txt",
        "img": "https://archive.orkl.eu/084e4f9f207da00e0aa281e2f85fd6f3d3d38427.jpg"
    }
}