{
    "id": "3faddfe7-4c18-4b88-9eda-fc2aa7b0662f",
    "created_at": "2023-01-12T15:09:24.431699Z",
    "updated_at": "2025-03-27T02:10:03.228189Z",
    "deleted_at": null,
    "sha1_hash": "3f17f59e85527a595cc22a1c32ad7607e993d58a",
    "title": "2018-09-14 - Kraken Cryptor Ransomware Masquerading as SuperAntiSpyware Security Program",
    "authors": "",
    "file_creation_date": "2022-05-26T01:21:40Z",
    "file_modification_date": "2022-05-26T01:21:40Z",
    "file_size": 1986534,
    "plain_text": "# Kraken Cryptor Ransomware Masquerading as SuperAntiSpyware Security Program\n\n**bleepingcomputer.com/news/security/kraken-cryptor-ransomware-masquerading-as-superantispyware-security-**\nprogram\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nSeptember 14, 2018\n01:35 PM\n0\n\nThe Kraken Cryptor Ransomware is a newer ransomware that was released in August 2018. A\nnew version, called Kraken Cryptor 1.5, was recently released that is masquerading as the\nlegitimate SuperAntiSpyware anti-malware program in order to trick users into installing it.\n\nWhat makes it worse, though, is that somehow the attackers were able to gain access to the\nsuperantispyware.com site and distribute the ransomware from there.\n\n## Kraken Cryptor Ransomware 1.5 masquerading as SuperAntiSpyware\n\nMalwareHunterTeam, who has been tracking Kraken Cryptor since it has been released,\n[discovered the new variant this morning. When looking at its entry on VirusTotal, he noticed](https://twitter.com/malwrhunterteam/status/1040537127392559110)\nthat VirusTotal was reporting that the Kraken Cryptor installer had been distributed directly\nfrom superantispyware.com.\n\n\n-----\n\n**Download urls reported by VirusTotal**\n\nThe file name for the legitimate SuperAntiSpyware Free installer is called\nSUPERAntiSpyware.exe. The Kraken Cryptor installer spotted by VirusTotal was\ncalled SUPERAntiSpywares.exe. The only difference between the two names is the addition\nof a s to the malicious executable. This malicious executable is no longer available from\nsuperantispyware.com.\n\nYou can further see how Kraken Cryptor is trying to masquerade as SuperAntiSpyware by\nutilizing the same icon as shown below.\n\n**Kraken Cryptor executable using the same icon as SuperAntiSpyware**\n\nIt is important to note that the SUPERAntiSpyware.exe executable was not compromised and\ncontinued to install the legitimate version of SuperAntiSpyware. So users who installed\nSuperAntiSpyware via the normal links were not affected.\n\nAt this point, we do not know how users were being directed to the malicious\nSUPERAntiSpywares.exe executable. Bleeping Computer has made numerous attempts to\ncontact SuperAntiSpyware via email, phone, and Twitter for comment, but have not received\na response at the time of publication.\n\n\n-----\n\n_Disclosure: BleepingComputer.com is an affiliate for SuperAntiSpyware.com and other_\n_anti-malware products._\n\n## How the Kraken Cryptor Ransomware encrypts a computer\n\nThe Kraken Cryptor Ransomware provides good insight into how it encrypts a computer due\nto an embedded configuration file that is easily exported. This configuration file contains a\nlist of modules and if they are enabled, processes to stop, the public encryption key, emails,\nransom prices, extensions to encrypt, files and folders to to be skipped, countries and\nlanguages that won't be encrypted, and more.\n\nYou can see a portion of this configuration file below.\n\n**Portion of Kraken Cryptor 1.5 configuration file**\n\nWhen executed, the ransomware will perform a series of steps that are listed below, but may\nnot be in the exact order in which they are executed.\n\nThe ransomware will create a file called C:\\ProgramData\\Safe.exe and execute it. This\nprogram will then enumerate a list of all the Event Viewer logs and redirect the output to the\nC:\\ProgramData\\EventLog.txt file.\n```\nC:\\Windows\\system32\\cmd.exe /c wevtutil.exe enum-logs > \"C:\\ProgramData\\EventLog.txt\"\n\n```\nThe program will then remove all the logs listed in the Eventlog.txt.\n\n\n-----\n\nKraken Cryptor will also check the language and location of the victim, and if in the following\ncountries, will not encrypt the computer.\n```\nArmenia, Azerbaijan, Belarus, Estonia, Georgia, Iran, Kyrgyzstan, Kazakhstan,\nLithuania, Latvia, Moldova, Russia, Tajikistan, Turkmenistan, Ukraine, Uzbekistan,\nand Brazil\n\n```\nIn order to prevent processes keeping databases open and unable to be encrypted, the\nransomware will terminate the processes listed below.\n```\nagntsvcagntsvc, agntsvcencsvc, agntsvcisqlplussvc, dbeng50, dbsnmp, firefoxconfig,\nmsftesql, mydesktopqos, mydesktopservice, mysqld, mysqld-nt, mysqld-opt, ocomm,\nocssd, oracle, sqbcoreservice, sqlagent, sqlbrowser, sqlservr, sqlwriter, sqlwb,\nsynctime, tbirdconfig, and xfssvccon\n\n```\nWhen encrypting a computer, it will scan the computer for files with the following\nextensions.\n```\n1cd. 3dm. 3ds. 3fr. 3g2. 3gp. 3pr. 7z. 7zip. aac. ab4. abd. accdb. accde. accdr.\naccdt. ach. acr. act. adb. adp. ads. agdl. ai. aiff. ait. al. aoi. apj. arw. ascx.\nasf. asm. asp. aspx. asx. atb. avi. awg. back. backup. backupdb. bak. bank. bay. bdb.\nbgt. bik. bin. bkp. blend. bmp. bpw. c. cdb. cdf. cdr. cdr3. cdr4. cdr5. cdr6. cdrw.\ncdx. ce1. ce2. cer. cfg. cfn. cgm. cib. class. cls. cmt. config. contact. cpi. cpp.\ncr2. craw. crt. crw. cs. csh. cs. csl. css. csv. dac. dat. db. db3. dbf. dbx.\ndb_journal. dc2. dcr. dcs. ddd. ddoc. ddrw. dds. def. der. des. design. dgc. dit.\ndjvu. dng. doc. docm. docx. dot. dotm. dotx. drf. drw. dtd. dwg. dxb. dxf. dxg. edb.\neml. eps. erbsql. erf. exf. fdb. ffd. fff. fh. fhd. fla. flac. flb. flf. flv. flvv.\nfpx. fxg. gif. gray. grey. groups. gry. h. hbk. hdd. hpp. html. ibank. ibd. ibz. idx.\niif. iiq. incpas. indd. info. info_. ini. jar. java. jnt. jpe. jpeg. jpg. js. json.\nkc2. kdbx. kdc. key. kpdx. kwm. laccdb. lck. ldf. lit. lock. log. lua. m. m2ts. m3u.\nm4p. m4v. mab. mapimail. max. mbx. md. mdb. mdc. mdf. mef. mfw. mid. mkv. mlb. mmw.\nmny. moneywell. mos. mov. mp3. mp4. mpeg. mpg. mrw. msf. msg. myd. nd. ndd. ndf. nef.\nnk2. nop. nrw. ns2. ns3. ns4. nsd. nsf. nsg. nsh. nvram. nwb. nx2. nxl. nyf. oab.\nobj. odb. odc. odf. odg. odm. odp. ods. odt. ogg. oil. omg. orf. ost. otg. oth. otp.\nots. ott. p7b. p7c. p12. pab. pages. pas. pat. pbf. pcd. pct. pdb. pdd. pdf. pef.\npem. pfx. php. pif. pl. plc. plus_muhd. pm!. pm. pmi. pmj. pml. pmm. pmo. pmr. pnc.\npnd. png. pnx. pot. potm. potx. ppam. pps. ppsm. ppsm. ppsx. ppt. pptm. pptm. pptx.\nprf. ps. psafe3. psd. pspimage. pst. ptx. pwm. py. qba. qbb. qbm. qbr. qbw. qbx. qby.\nqcow. qcow2. qed. qtb. r3d. raf. rar. rat. raw. rdb. rm. rtf. rvt. rw2. rwl. rwz.\ns3db. safe. sas7bdat. sav. save. say. sd0. sda. sdb. sdf. sh. sldm. sldx. sql.\nsqlite. sqlite-shm. sqlite-wal. sqlite3. sqlitedb. sr2. srb. srf. srs. srt. srw. st4.\nst5. st6. st7. st8. stc. std. sti. stm. stw. stx. svg. swf. sxc. sxd. sxg. sxi. sxm.\nsxw. tbb. tbn. tex. tga. thm. tlg. tlx. txt. usr. vbox. vdi. vhd. vhdx. vmdk. vmsd.\nvmx. vmxf. vob. wab. wad. wallet. war. wav. wb2. wma. wmf. wmv. wpd. wps. x3f. x11.\nxis. xla. xlam. xlk. xlm. xlr. xls. xlsb. xlsm. xlsx. xlt. xltm. xltx. xlw. xml.\nycbcra. yuv. and zip\n\n```\nIf it encounters a matching file, it will encrypt the file and rename it in the format\n00000000-Lock.onion, where the numbers will increment for each encrypted file. The\noriginal file name will be encrypted and stored in the encrypted file.\n\n\n-----\n\n**A folder of files encrypted by Kraken Cryptor and with the -Lock.onion extension appended**\n\nWhen encrypting the computer, Kraken Cryptor will create a ransom notes named # How to\n**Decrypt Files.html in every folder. This ransom note contains a unique victim key and**\ninstructions on how to make a 0.125 bitcoin ransom payment. The contact information\nprovided in the ransom note is shortmangnet@420blaze.it and BM**2cUEkUQXNffBg89VwtZi4twYiMomAFzy6o@bitmessage.ch.**\n\n\n-----\n\n**Portion of Ransom Note**\n\nThe ransomware will also download SDelete from the Sysinternals site and execute a batch\nfile called release.bat. This batch file will cause SDelete to clear and overwrite all free space\non the drive with zeros to make it harder to recover files. It will also cause the computer to\nshutdown, disable Windows startup recovery, delete Windows backups, and delete shadow\nvolume copies.\n\n\n-----\n\n**Release.bat batch file**\n\nThis is all done to make it harder for victims to recover their files.\n\n## It is not possible to decrypt the Kraken Cryptor Ransomware\n\nUnfortunately, at this time there is no way to decrypt files encrypted by the Kraken Cryptor\nRansomware variant for free.\n\nThe only way to recover encrypted files is via a backup, or if you are incredibly lucky, through\nShadow Volume Copies. Though Kraken Cryptor does attempt to remove Shadow Volume\nCopies, in rare cases ransomware infections fail to do so for whatever reason. Due to this, if\nyou do not have a viable backup, I always suggest people try as a last resort to restore\nencrypted files from Shadow Volume Copies as well.\n\nFor those who wish to discuss this ransomware or need support, you can use our dedicated\n[Kraken Cryptor Ransomware Help & Support Topic.](https://www.bleepingcomputer.com/forums/t/682448/kraken-cryptor-ransomware-help-topic-lockonion-how-to-decrypt-filestxt/)\n\n## How to protect yourself from the Kraken Cryptor Ransomware\n\nIn order to protect yourself from Kraken Cryptor, or from any ransomware, it is important\nthat you use good computing habits and security software. First and foremost, you should\nalways have a reliable and tested backup of your data that can be restored in the case of an\n\n\n-----\n\nemergency, such as a ransomware attack.\n\nAs ransomware is also known to be installed via hacked Remote Desktop services, it is very\nimportant to make sure its locked down correctly. This includes making sure that no\ncomputers running remote desktop services are connected directly to the Internet. Instead\nplace computers running remote desktop behind VPNs so that they are only accessible to\nthose who have VPN accounts on your network.\n\nIt is also important to setup proper account lockout policies so that it makes it difficult for\naccounts to be brute forced over Remote Desktop Services.\n\nYou should also have security software that incorporates behavioral detections to combat\nransomware and not just signature detections or heuristics. For example, Emsisoft Anti[Malware and Malwarebytes Anti-Malware both contain behavioral detection that can prevent](https://www.bleepingcomputer.com/download/malwarebytes-anti-malware/)\nmany, if not most, ransomware infections from encrypting a computer.\n\nLast, but not least, make sure you practice the following good online security habits, which in\nmany cases are the most important steps of all:\n\nBackup, Backup, Backup!\nDo not open attachments if you do not know who sent them.\nDo not open attachments until you confirm that the person actually sent you them,\nScan attachments with tools like VirusTotal.\nMake sure all Windows updates are installed as soon as they come out! Also make sure\nyou update all programs, especially Java, Flash, and Adobe Reader. Older programs\ncontain security vulnerabilities that are commonly exploited by malware distributors.\nTherefore it is important to keep them updated.\nMake sure you use have some sort of security software installed.\nUse hard passwords and never reuse the same password at multiple sites.\nIf you are using Remote Desktop Services, do not connect it directly to the Internet.\nInstead make it accessibly only via a VPN.\n\nFor a complete guide on ransomware protection, you visit our How to Protect and Harden a\nComputer against Ransomware article.\n\n**9/14/18: Updated story to call it Kraken Cryptor rather than just Kraken.**\n\n**9/14/18: We received the following statement from SuperAntiSpyware:**\n\n\"A malicious file was uploaded to the SUPERAntiSpyware download server as a result of an\nattempted attack on the server,\" SuperAntiSpyware told BleepingComputer. \"The malicious\nfile was discovered and removed from the server within several hours of the attempt. The\nserver has since been thoroughly scanned and the vulnerability has been corrected.\"\n\n\n-----\n\n### Related Articles:\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[SpiceJet airline passengers stranded after ransomware attack](https://www.bleepingcomputer.com/news/security/spicejet-airline-passengers-stranded-after-ransomware-attack/)\n\n[US Senate: Govt’s ransomware fight hindered by limited reporting](https://www.bleepingcomputer.com/news/security/us-senate-govt-s-ransomware-fight-hindered-by-limited-reporting/)\n\n[New RansomHouse group sets up extortion market, adds first victims](https://www.bleepingcomputer.com/news/security/new-ransomhouse-group-sets-up-extortion-market-adds-first-victims/)\n\n[Ransomware attack exposes data of 500,000 Chicago students](https://www.bleepingcomputer.com/news/security/ransomware-attack-exposes-data-of-500-000-chicago-students/)\n\n## IOCs\n\n### Hash:\n```\nSHA256: 9c88c66f44eba049dcf45204315aaf8ba1e660822f9e97aec51b1c305f5fdf14\n\n Associated Files:\nC:\\ProgramData\\Safe.exe\nC:\\ProgramData\\EventLog.txt\n# How to Decrypt Files.html\n\n Krain 1.5 Associated Emails:\nshortmangnet@420blaze.it\nBM-2cUEkUQXNffBg89VwtZi4twYiMomAFzy6o@bitmessage.ch\n\n```\n[Kraken Cryptor](https://www.bleepingcomputer.com/tag/kraken-cryptor/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n[SuperAntiSpyware](https://www.bleepingcomputer.com/tag/superantispyware/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/illegal-patch-allows-easier-access-to-indias-aadhaar-biometric-database/)\n[Next Article](https://www.bleepingcomputer.com/news/security/firefox-64-to-add-a-report-abuse-option-when-removing-extensions/)\n\n[Post a Comment Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-09-14 - Kraken Cryptor Ransomware Masquerading as SuperAntiSpyware Security Program.pdf"
    ],
    "report_names": [
        "2018-09-14 - Kraken Cryptor Ransomware Masquerading as SuperAntiSpyware Security Program.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "921cea27-4410-42e4-8c11-7d40ba313225",
            "created_at": "2023-01-06T13:46:39.375789Z",
            "updated_at": "2025-03-27T02:00:03.067286Z",
            "deleted_at": null,
            "main_name": "RansomHouse",
            "aliases": [],
            "source_name": "MISPGALAXY:RansomHouse",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536164,
    "ts_updated_at": 1743041403,
    "ts_creation_date": 1653528100,
    "ts_modification_date": 1653528100,
    "files": {
        "pdf": "https://archive.orkl.eu/3f17f59e85527a595cc22a1c32ad7607e993d58a.pdf",
        "text": "https://archive.orkl.eu/3f17f59e85527a595cc22a1c32ad7607e993d58a.txt",
        "img": "https://archive.orkl.eu/3f17f59e85527a595cc22a1c32ad7607e993d58a.jpg"
    }
}