{
    "id": "3fb7575b-652c-42bd-9ccb-74e5b0ef9f35",
    "created_at": "2023-01-12T15:08:17.978863Z",
    "updated_at": "2025-03-27T02:05:59.005586Z",
    "deleted_at": null,
    "sha1_hash": "b4fff3764fa4897774dac65b9320ba225946ecf5",
    "title": "2021-07-15 - American Rescue Plan Act Lures in the Wild",
    "authors": "",
    "file_creation_date": "2022-05-27T19:08:07Z",
    "file_modification_date": "2022-05-27T19:08:07Z",
    "file_size": 546079,
    "plain_text": "# American Rescue Plan Act Lures in the Wild\n\n**[domaintools.com/resources/blog/american-rescue-plan-act-lures-in-the-wild](https://www.domaintools.com/resources/blog/american-rescue-plan-act-lures-in-the-wild)**\n\n## Executive Summary\n\nDomainTools researchers discovered a cluster of credential harvesting sites masquerading\nas American Rescue Plan Act signup sites for those looking to receive their federal aid.\nThrough historical WHOIS information and OSINT techniques DomainTools attributed this\ncampaign to a Nigerian web development firm GoldenWaves Innovations. In this article,\nDomainTools researchers will walk through the techniques and methods used to enumerate\nthese websites and associated attribution with medium-high confidence.\n\n## Background\n\n[On March 11, 2021, President Joe Biden signed the American Rescue Plan Act into law.](https://www.whitehouse.gov/american-rescue-plan/)\nThe COVID-19 pandemic relief bill was designed to provide $1,400 in immediate relief to\nworking families, emergency paid leave for over 100 million Americans, and expand the\nchild tax credit among a number of other grants and pillars to assist with other budget\nshortfalls. Since this act was signed into law, DomainTools researchers have monitored for\nnew registrations of domains that targeted relief recipients. Unfortunately, many relief\nrecipients are unaware that this relief will be automatically assigned to them by the IRS, so\nscammers are using this as an opportunity to collect social security numbers and driver’s\nlicense photographs to use in identity theft.\n\n\n-----\n\n## Hunting for More\n\n\n-----\n\nThe initial domain found by DomainTools researchers was reliefcarefunds[.]com that\ncontained the above application form with a typical upload to a PHP destination on the\nsame domain. However, buried in the code was a comment that the page had been\nmirrored from americaforgivenrelieffund[.]com and a contact page that submitted to a PHP\nscript on that domain as well. With evidence of more domains, DomainTools researchers\ntook a look at the architecture behind the pages for similarities. As readers of this blog will\n[know, DomainTools is a strong proponent of the composite objects method for building out](https://www.domaintools.com/resources/blog/analyzing-network-infrastructure-as-composite-objects?utm_source=Blog&utm_campaign=american-rescue-plan-act-lures-in-the-wild)\nindicators and through examining these two pages we could see that what they had in\ncommon was:\n\nRegistration through NameCheap\nContaining the “relief” substring\nContaining the “eric” as in America substring or the “care” substringRegistration after\nthe signing of the bill into law on March 11, 2021\nHosting on NameCheap hosting infrastructure\n\n\n-----\n\n[Hunting for this composite in DomainTools Iris Investigate, DomainTools researchers](https://www.domaintools.com/products/iris)\nrevealed 39 potential domains and an email address associated with a number of them of\n[goldenwaves247@gmail[.]com. To confirm similarities, we used URLScan to search for the](https://urlscan.io/)\nlist of domains uncovered for any scans done by others that had encountered these\ndomains over the last month. Unsurprisingly, this revealed an additional set of domains with\nidentical structure to the initial phishing page dating back almost exactly a month.\n\n\n-----\n\nThis list of domains then provided another set of important information. For one,\nDomainTools researchers were able to see that some of these links were being pushed by\nBitly link shortening links. With Bitly, appending a “+” to any shortened link provides some\ndata about that link. In this instance, we could see that the shortener was created at 1630\nUTC time on June 5th, 2021 with a specific title of “Unemployment Insurance Relief During\nCOVID-19 Outbreak | American Rescue Plan Act” which matches the titles of the other\ncloned pages.\n\n\n-----\n\nWe can also tell that many of the cloned pages, at the time of their scanning, were not\nhosted solely on NameCheap’s site hosting services, but were also active on both\nGaranntor (AS328110) and OVH (AS16276). This allowed the set of items we search for to:\n\nRegistration through NameCheap\nContaining the “relief” substring\nContaining the “eric” as in America substring or the “care” substring\nRegistration after the signing of the bill into law on March 11, 2021\nHosting on NameCheap (AS22612), Garanntor (AS328110), or OVH (AS16276)\nhosting infrastructure\n\nThis then revealed a total of 47 domains matching our criteria including the oldest domain\non URLScan page similarities and the oldest domain in our search criteria\ntheamericaforgivenrelief[.]com with a registrant email address of onostboy1@gmail[.]com\nand an unredacted WHOIS record placing the registrant in Ibadan, Nigeria. Searching on\nthat username then reveals a profile on social media site Eskimi of a web developer with an\nassociated Twitter handle of @onostboy with the name Tosyno based in Ibadan, Nigeria.\nThe city of Ibadan is a small, rural town which makes the registration information stand out\nas almost always technical contacts for Nigerian domains are located in Lagos, the capital\ncity and technology center. Additional searches reveal the same username participating in\nsales on cybercrime forums, Steam gaming, and other social media sites.\n\n\n-----\n\nPivoting on the previous address of goldenwaves247@gmail[.]com that was surfaced\nreveals a number of domains including Dasani, Fiji, and Mountain Dew brand sites that\nlooks to be recruiting for various promotional programs in exchange for money, a fake UK\nbank site at natwestukbank[.]com, and finally a site with the domain goldenwavesng[.]com\nthat contained the email in historical WHOIS records before going private in late 2018. This\nis the site of GoldenWaves Innovations, a technology company based in Ibadan, Nigeria\nwhich DomainTools researchers assume with medium confidence to be the legitimate web\ndesign firm in front of the identity document harvesting sites.\n\n\n-----\n\nReading the information on GoldenWaves Innovations’ page we can see that they claim to\nbe registered with the Corporate Affairs Commission (CAC) of the government of Nigeria.\nSearching for that company name on ng-check[.]com, a site for querying CAC information,\nwe can see that GoldenWaves Innovation indeed has a valid registration along with the\nname of the company’s CEO which matches the WHOIS details and who claims to be the\ncompany’s CEO on LinkedIn. Though the company was registered in February of 2016,\ntheir registration is currently inactive.\n\n\n-----\n\n-----\n\nAdditionally, the historical WHOIS record unearths an address in New York, New York of\n120 E 87th Street. This is an apartment building with condos ranging from $900,000 to\n$13,000,000 in the heart of Manhattan. While at first that seems strange for a company\nbased in Nigeria, we can see from LinkedIn that one of the company’s developers claims to\nlive in New York City.\n\nLooking at the CEO’s current contact information on LinkedIn we can see that\nGoldenWaves Innovations has a new website in goldenwaves[.]com[.]ng which is also tied\nto the same email address and registration information. This gives DomainTools\nresearchers high confidence that all of these credential harvesting sites are linked to\nGoldenWaves Innovations in Nigeria. These sites along with any new ones that have\ncropped up were reported to Google Safe Browsing for blocking.\n\n## Takeaways\n\nCredential harvesting campaigns continue to be a fruitful way for attackers to gain legitimate\nlegal documents they can then resell or use for more sophisticated behavior. When looking\nfor federal aid, those in need the most may not always be fully aware of how that aid is\nbeing distributed. In the case of the American Rescue Plan Act that money was coming\ndirectly from the IRS, but nonetheless unsuspecting victims could be led into uploading their\nidentification documents to one of these sites\n\n\n-----\n\nDomainTools researchers would recommend that security teams utilize internal passive\nDNS monitoring to alert them of new domains aged less than 90 days that are responding\nwith IP addresses on cloud provider ASNs. That is the most efficient way to discover these\ndomains on your own network. As for end users, DomainTools recommends:\n\nReporting the site to Google Safe Browsing if you come across one so that it will be\nblocked as soon as possible on all major browsers.\nReporting the malicious site up to your security team along with the phishing email\nthat came with it as there may be a campaign targeting your employees.\nNever upload your documents to a website you are not logged into and particularly not\na site claiming to be a federal one without a .gov domain name.\n\n## Iris Hashes for Hunting\n\n### GoldenWaves Innovations Domains and Associated Emails\n```\nU2FsdGVkX1+f4H5GPcY4qa4f5nIuj2vjMY/8shjZ/tasRLRe/sgFkQzNfFJ7EGxjoQYYU9PCo3lgkhHJ/+kas\n\n Relief-themed Domains Matching Registration and Infrastructure Patterns\nU2FsdGVkX1+QgEcPUsLxQS18UIt6kBbpnrhOiGN0x4ILTpIO3GBI29j+7/Vx6a/Lw82tvNHQEhbWPQEjCk2pC\n\n## IoC Table\n\n```\n\n**Domain**\n\n\namericaforgivenrelieffund[.]com\n\n\namericafundforstimulus[.]com\n\n\namerican-reliefplan[.]site\n\n\namerican-reliefplans[.]site\n\n\namericancarerelief[.]com\n\n\namericanforgivenrelieffund[.]com\n\n\namericanpeoplerelief[.]xyz\n\n\namericanrelief-plan[.]com\n\n\namericanrelief-plan[.]site\n\n\namericanrelief-plans[.]site\n\n\n-----\n\n**Domain**\n\n\namericanreliefcare[.]com\n\n\namericanrelieffunds[.]com\n\n\namericanrelieffunds[.]fund\n\n\namericanreliefplan[.]com\n\n\namericanreliefplan[.]site\n\n\namericanreliefplans[.]com\n\n\namericanreliefplans[.]site\n\n\namericanreliefrescueplan[.]com\n\n\namericans-relief-plan[.]us\n\n\namericans-reliefplan[.]com\n\n\namericans-reliefplan[.]site\n\n\namericans-reliefplan[.]us\n\n\namericans-reliefplan[.]xyz\n\n\namericansrelief-plan[.]us\n\n\namericansreliefplan[.]com\n\n\namericansreliefplan[.]site\n\n\namericansreliefplan[.]us\n\n\namericansreliefplan[.]xyz\n\n\namericansreliefplans[.]site\n\n\namericansreliefplans[.]xyz\n\n\namericansreliefs-plan[.]us\n\n\namericansreliefsplan[.]us\n\n\namericansreliefund[.]com\n\n\namericapandemicrelief[.]com\n\n\namericapandemicrelieffund[.]com\n\n\n-----\n\n**Domain**\n\n\namericare-refund[.]com\n\n\namericareliefcarefunds[.]com\n\n\namericarelieffunds[.]com\n\n\namericareliefgrants[.]com\n\n\namericareliefsfund[.]com\n\n\namericareliefstimulus[.]com\n\n\namericareliefstimulusfund[.]com\n\n\namericarescuerelief-id[.]me\n\n\namericarescuerelief[.]com\n\n\namericastimulusfunds[.]com\n\n\namiericarelieffund[.]com\n\n\nportal-americanrelief[.]com\n\n\nreliefamerican[.]com\n\n\nreliefamericanplan[.]com\n\n\nreliefcarefunds[.]com\n\n\nreliefcaregrant[.]com\n\n\nrescuefundsforamericans[.]com\n\n\nthereliefforamerican[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-15 - American Rescue Plan Act Lures in the Wild.pdf"
    ],
    "report_names": [
        "2021-07-15 - American Rescue Plan Act Lures in the Wild.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536097,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653678487,
    "ts_modification_date": 1653678487,
    "files": {
        "pdf": "https://archive.orkl.eu/b4fff3764fa4897774dac65b9320ba225946ecf5.pdf",
        "text": "https://archive.orkl.eu/b4fff3764fa4897774dac65b9320ba225946ecf5.txt",
        "img": "https://archive.orkl.eu/b4fff3764fa4897774dac65b9320ba225946ecf5.jpg"
    }
}