{
    "id": "401e4762-2ad7-462c-a2ef-5c5910af52b7",
    "created_at": "2023-01-12T15:00:17.577105Z",
    "updated_at": "2025-03-27T02:15:35.508154Z",
    "deleted_at": null,
    "sha1_hash": "8a105c86e6372d13d8c0bf669bff9ca5147da971",
    "title": "2020-10-06 - IXWare - Kids will be skids",
    "authors": "",
    "file_creation_date": "2022-05-28T00:45:57Z",
    "file_modification_date": "2022-05-28T00:45:57Z",
    "file_size": 1287959,
    "plain_text": "# IXWare - Kids will be skids\n\n**fr3d.hk/blog/ixware-kids-will-be-skids**\n\n1. You are here: [fr3d.hk](https://fr3d.hk/blog/)\n[2. Malware](https://fr3d.hk/blog/category/malware)\n[3. IXWare - Kids will be skids](https://fr3d.hk/blog/ixware-kids-will-be-skids)\n\nOctober 6, 2020 - Reading time: 17 minutes\n\nIXWare is what happens when inexperienced malware developers create malware as a\nservice. We'll be analysing IXWare and how it's used to attack players of the online video\ngame Roblox.\n\n## Foreword\n\nAfter releasing my last blog post covering DiamondFox I have been very busy behind the\n[scenes working on my threat tracker (threatshare.io) and my personal site (fr3d.hk). A huge](http://threatshare.io/)\n[thank you as always to Steved3 for reviewing and editing this post. The threat landscape has](https://twitter.com/steved3)\nmostly stayed the same and not many things have caught my eye until this piece of malware.\n\n## Overview\n\nIXWare is a MaaS (Malware as a service) that offers the ability to steal Windows users'\npasswords. It became widespread after they moved to a central website handling all of their\nusers' needs. The malware seems to be appealing to actors attacking the video game\nRoblox as it offers many techniques to recover infected victims' accounts.\n\n\n-----\n\nIXWare is sold on a Roblox hacking forum that caters to reselling of stolen accounts. The\nmalware sells for 10 euros a month and 25 euros for 3 months. On purchase, you're given\naccess to the webpanel. In the below screenshot you will see pricing and features of the\nmalware.\n\nPurchase Page & Features\n\nBelow is a list of features (some don't exist/work):\n\n\n-----\n\nCore Features\nWebpanel Builder\nWebpanel Delivery\nStable & Reliable\nClean Log Interface\nMutex (Single Instance Application)\nUAC Bypass (Windows 7, 8.1 & 10)\nCritical System-Process (BSoD when killed)\nMelt File\nAnti Debug/Anti VM/Sandbox\nProcess Blocker\nWebsite Blocker\nScreenshot Logger\nProtected Stub\nAdvanced Keylogger\nClipboard Logging\nWindow Logging\nBrowser Password Recoveries\n\nHere's a video of the creator demoing another feature of a JavaScript cookie logger for the\nRoblox game.\n\nThe creators of the malware also provide reviews for their product on TrustPilot. Along with\nthe reviews they also offer a TOS that they believe will protect them from law enforcement by\nstating that the malware is only to be used on a computer you own etc. This TOS will not do\nanything for them as the main creator icorex or ghostelutsch is based in Germany\n\nIXWare is written in C# and is dependent on the .NET 4.0 framework. It is easy to find\nsamples in the wild that aren't obfuscated.\n\n## Anti-VM\n\nMalware will employ different tactics to avoid being run in virtual machines (VM). This is\nusually done to evade analysis. The malware begins by getting the running services and\nchecking their names to see if it's running within a VM.\n\nAnti-VM - Services\n\nIf anti-VM is enabled within the malware config, we'll see a new task being created named\n_CheckVM. This task calls another function named DetectVM._ _DetectVM uses the classic anti-_\nVM method of creating a management object, and then checking the specifics of the system\nto see whether they match. Here are the following checks.\n\n\n-----\n\nAnti-VM - Checks\n\nIf any of these checks succeed then the malware will exit.\n\n## UAC Bypass\n\nIf the malware has not exited because of anti-VM checks, it will proceed to check if it is\nrunning as an elevated process by calling IsElevated. If the process isn't elevated then the\nmalware will proceed to attempt a few different UAC bypasses. The malware is able to\nattempt a UAC bypass on the following windows versions.\n\nWindows 7 (CompMgmtLauncher)\nWindows Vista (CompMgmtLauncher)\nWindows 8 (CompMgmtLauncher)\nWindows 10 (fodhelper)\n\nThe bypass methods are all very similar, a simple Google search will give you more than\nenough information on how these exploits work.\n\n## Startup & Melt\n\nTo maintain persistence the malware will make sure that it is run at startup, and disappear\nwhen the malware is first run. If the melting functionality is enabled, the malware copies itself\nto the temp path with a random file name, and sets the file attributes to hidden. Once this has\nbeen completed the malware begins setting up its persistence.\n\n\n-----\n\nStartup\n\nWe see the malware setting a registry value in\n_SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run set to the location of the malware. If_\nthe malware has the melting functionality enabled within its configuration, it will create a\n_schtasks process with the following arguments_\n\n_/create /tn \"svchost\" /sc ONLOGON /tr filename /rl HIGHEST /f_\n\nThis task will maintain persistence upon the computer logging on.\n\n## Persistence\n\nIXWare offers persistence by making the malware a critical process that will blue screen the\ncomputer if ended. This is done by first checking if persistence is enabled within the malware\nconfig and then calling the criticalProcess function. The criticalProcess function will\nuse NtSetInformationProcess to mark the malware process as critical.\n\ncriticalProcess\n\n_NtSetInformationProcess will use a handle on the current process along with the_\n_processInformationClass parameter set to 29 which indicates BreakOnTermination. Along_\nwith BreakOnTermination another parameter is used named num which sets the process to\n\n\n-----\n\ncritical when it is 1. In addition to doing this there is also an event called SessionEnd which\ndoes the same process described above except that num is set to 0 so that the process is no\nlonger critical.\n\n## Disable Windows Defender\n\nTo avoid detection by the in built anti-virus IXWare will attempt to disable it. The function that\nhandles this will check if the current user is an administrator on the system and if not it will\nreturn. If the user is an admin then the malware begins by editing some registry keys to\ndisable Windows Defender.\n\nDisable Windows Defender\n\nAfter these registry values have been set the malware calls a function\nnamed CheckDefender. This function uses powershell to check the settings of Windows\nDefender. Then going through each preference it will update it with a new setting that will\n[disable any enabled functionality. The code for this is long so I have pasted it here.](https://pastebin.com/raw/Vq7wi4Ft)\n\nFurther Disabling\n\nAfter this function returns the malware finishes off by updating many different registry keys to\nmaintain the disabled Windows Defender.\n\n\n-----\n\nMore disabling\n\nOnce these registry values have been updated the malware will continue with its\nfunctionality.\n\n## Recoveries\n\nThe main functionality of the malware is to steal browser and application passwords. IXWare\nconcentrates on chromium browsers as they are easy to steal from, along with supporting\ntheft from Discord. The stealing functionality is quite lacking even though it is one of the main\nfeatures of the malware. To steal from chromium browsers the malware will begin by\nenumerating through all supported browsers.\n\nChromium Browsers\n\n\n-----\n\nThen going through each of the supported browsers the malware will attempt to get any\naccounts stored in the browser profile. Browsers store their login information within an\nSQLite file, the contents in this database are encrypted using AES with a key that is saved in\nthe local state folder. We can see IXWare retrieving this key using regex.\n\nGetting Key\n\nOnce it has the key it will use CryptoAPI to unprotect it so that it can be used to decrypt login\ncredentials. The malware will then enumerate the logins table and proceed to get url,\nusername and a decrypted password. These passwords are then written into a text file with a\nfilename of a random string of characters in the temp path. The malware also allows for the\nuser to steal Discord accounts by grabbing the discord token files within the app data path.\n\n## Cookie Stealer\n\nTo steal cookies for the game Roblox the malware employs a very simple tactic. It\nenumerates the running processes and looks for a process with the name\n\"RobloxPlayerBeta\", and gets the command line arguments used to run this process and\nfrom this will grab the auth token.\n\n\n-----\n\nGet Roblox Cookie\n\nAfter the auth token has been stolen from the running process, the malware sends this auth\ntoken to the C2 so it can be manipulated into a usable cookie. After the C2 has replied with\nthe desired cookie, the malware will writes into the temp path with a random filename.\n\n## C2 Communications\n\nDue to the fact that the malware is a MaaS and all customers will be using the same\nwebpanel, the communications within different samples are quite similar. The C2\ncommunications are done in one POST request to the C2 gate. Specifics of the infected\nsystem are sent in the request headers.\n\nC2 Headers\n\nThis begins with the malware requesting another file on the C2 named UT.php, this file\nreturns a unix timestamp. This timestamp is then combined with the number \"877692\". Once\nthis has been done the string is SHA265 hashed and encrypted Each header value is\n\n\n-----\n\nencrypted with the function encrypt, this function uses AES (CBC) to encrypt all strings with\nthe first 32 bytes of a constant key. Once done, the malware gets the contents of the\npassword logs, and puts this along with the headers into a multipart form that is sent to the\n_upload.php file on the C2._\n\n## Epilogue\n\nThis malware is what happens when code is copied and pasted with no innovation. Most of\nwhat I have described in this post can probably be found on GitHub and simple YARA rules\nwill be able to pick up this malware easily. I have also not chosen to describe the flaws in this\nmalware as it is still actively in development. I hope this post will be of use and as always\nthank you for reading!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-06 - IXWare - Kids will be skids.pdf"
    ],
    "report_names": [
        "2020-10-06 - IXWare - Kids will be skids.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535617,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653698757,
    "ts_modification_date": 1653698757,
    "files": {
        "pdf": "https://archive.orkl.eu/8a105c86e6372d13d8c0bf669bff9ca5147da971.pdf",
        "text": "https://archive.orkl.eu/8a105c86e6372d13d8c0bf669bff9ca5147da971.txt",
        "img": "https://archive.orkl.eu/8a105c86e6372d13d8c0bf669bff9ca5147da971.jpg"
    }
}