{
    "id": "4028d326-a5f5-4b11-bf95-b23413eabe36",
    "created_at": "2022-10-25T16:48:22.901048Z",
    "updated_at": "2025-03-27T02:16:25.573946Z",
    "deleted_at": null,
    "sha1_hash": "3939d4a4048e0ad0e4416e32763c8f69dc83af56",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-08-03T01:56:10Z",
    "file_modification_date": "2016-08-03T01:56:10Z",
    "file_size": 9799901,
    "plain_text": "[Projects](https://citizenlab.org/projects)\n\n[Publications](https://citizenlab.org/publications)\n\n[Archives](https://citizenlab.org/archives)\n\n\n[GLA2010](https://citizenlab.org/gla2010) [In the News](https://citizenlab.org/category/media)\n\n[Newsletter](https://citizenlab.org/newsletter)\n\n[Events](https://citizenlab.org/category/events)\n\n\n[About](https://citizenlab.org/about)\n\n[People](https://citizenlab.org/people)\n\n[Opportunities](https://citizenlab.org/opportunities)\n\n[Contact](https://citizenlab.org/contact/)\n\n\n# Group5: Syria and the Iranian Connection\n\nAugust 2, 2016\n\n[Tagged: Android, Cybersecurity, Iran, Malware, Mobile security, Surveillance, Syria, Targeted Threats](https://citizenlab.org/tag/android/)\n\n[Categories: Adam Hulcoop, Bahr Abdul Razzak, John Scott-Railton, Katie Kleemola, Matt Brooks, Reports and Briefings](https://citizenlab.org/category/author/adam-hulcoop/)\n\n## By John Scott-Railton,* Bahr Abdulrazzak,* Adam Hulcoop,* Matt Brooks,* & Katie Kleemola**\n\n*The Citizen Lab at the Munk School of Global Affairs, University of Toronto; **Lookout Inc.\n\n[Read the Associated Press exclusive.](http://bigstory.ap.org/article/6ab1ab75e89e480a9d12befd3fea4115/experts-iranian-link-attempted-hack-syrian-dissident)\n\n[Read the op-ed by Citizen Lab Director Ron Deibert.](https://www.washingtonpost.com/posteverything/wp/2016/08/02/how-foreign-governments-spy-using-email-and-powerpoint/)\n\n# Executive Summary\n\nThis report describes an elaborately staged malware operation with targets in the Syrian opposition. The operators have\n\nused use a range of techniques to target Windows computers and Android phones with the apparent goal of\n\npenetrating the computers of well-connected individuals in the Syrian opposition.\n\nWe first discovered the operation in late 2015 when a member of the Syrian opposition spotted a suspicious e-mail\n\ncontaining a PowerPoint slideshow. From this initial message, we uncovered a watering hole website with malicious\n\nprograms, malicious PowerPoint files, and Android malware, all apparently designed to appeal to members of the\n\nopposition.\n\nElements of the Syrian opposition have been targeted by malware campaigns since the early days of the conflict:\n\nregime-linked malware groups, the Syrian Electronic Army, ISIS, and a group linked to Lebanon reported by FireEye in 2015\n\nhave all attempted to penetrate opposition computers and communications. Some of these operations are still active as\n\nof the time of writing. This report adds one more threat actor to the list: Group5, which we name to reflect the four other\n\nknown malware groups.\n\nGroup5 stands out from the operations that have already been reported on: some of the tactics and tools used have not\n\nbeen observed in this conflict; the operators seem comfortable with Iranian Persian dialect tools and Iranian hosting\n\ncompanies; and they appear to have run elements of the operation from Iranian IP space.\n\n\nSearch\n\n\n-----\n\nLike a chameleon, Group5 borrows opposition text and slogans for e-mail messages and watering holes, showing\n\nevidence of good social engineering and targeting. However, Group5’s technical quality is low, and their operational\n\nsecurity uneven. This is a common feature of many operations in the Syrian context: since the baseline security of many of\n\nthe targets is very low, many successful threat actors seem to conserve (and in some cases not possess) more\n\nsophisticated techniques. We believe we identified Group5 early in its lifecycle, before all of the malware that had been\n\nstaged and prepared could be deployed in a full campaign.\n\nOur analysis indicates that Group5 is likely a new entrant in Syria, and we outline the circumstantial evidence pointing to\n\nan Iranian nexus. We do not conclusively attribute Group5 to a sponsor, although we suspect the interests of a state are\n\npresent, in some form. Group5 is just the latest addition to an expanding cast of actors targeting Syrian opposition groups,\n\nand its entry into the conflict shows the continuing information security risks that they face.\n\n# Background: The Perpetual Targeting of the Syrian Opposition\n\n[Syrians have experienced monitoring and blocking of their electronic communications for many years. As a result, many](https://citizenlab.org/2014/11/citizen-lab-research-on-blue-coat-in-article-on-censorship-syria/)\n\nmore technically literate Syrians have familiarized themselves with VPNs and other tools to circumvent simple blocking,\n\nand achieve a degree of privacy. After the 2011 Uprising began, the regime disconnected telecommunications services\n\nin many areas controlled by opposition groups. This led, in these areas, to the widespread adoption of satellite internet\n\nconnectivity, mostly via VSAT (Very Small Aperture Terminal) services like Tooway and iDirect, and to a lesser extent the\n\nuse of BGAN (Broadband Global Area Network) terminals.\n\nAt the same time, the Syrian opposition’s activities outside the country, both in neighboring countries like Turkey, as well\n\nas in the diaspora, dramatically increased. Much of this activity takes place over social networks, free e-mail accounts\n\nlike Gmail (and Google Apps for Work), and via tools like Skype’s VoIP services.\n\n\n-----\n\nHowever, the shift towards social networks and other online tools has created new opportunities for the regime to target\n\nthe opposition. Opposition members constantly share information, files, tools and programs, via social media. This highly\nconnected environment enables them to be highly aware of changing events, and quickly mobilize resources. In\n\naddition, a number of online services, such as the Google Play Store, are blocked or restricted for Syria. As a result, a\n\nculture of sharing Android APK files has also developed.\n\nThe heavy reliance on popular online platforms, and regular sharing of tools, presents many opportunities to seed\n\nmalicious files. For the regime, a successful operation means a chance to regain visibility into the activities of groups\n\nwithin the geographic borders of Syria, while extending their reach outside into the diaspora. For other groups, such as\n\nISIS, the digital vulnerability of the opposition presents an opportunity to develop a capability against opposition\n\ncommunications. The following section outlines several of these known threat actors.\n\n## Regime-Linked Groups\n\nThe most well-known threat actor to target the Syrian Revolution is the Syrian Electronic Army (SEA). However, many of the\n\ntargets of the SEA have been Western organizations, although the SEA continues to conduct lower-profile operations that\n\ninclude malware against the opposition. Less notorious, although still the subject of reporting, are malware groups linked\n\nto the regime. These malware groups have been active since 2011, and have used a wide range of Commercial-Off-The\nShelf (COTS) Remote Access Trojans (RATs) to target the opposition. Typically, these groups bundle RATs with a wide\n\nrange of documents and programs designed to appeal to the opposition. Over the years, these campaigns have\n\nincluded everything from “revolution plans,” lists of “wanted suspects,” to fake security and encryption tools. These\n\ncampaigns have been extensively characterized by reports from the Citizen Lab, The Electronic Frontier Foundation, and\n\nprivate companies like TrendMicro and Kaspersky. A range of reports have documented these regime-linked campaigns\n\nover the years.\n\n## Pro-Regime Groups Outside Syria\n\nThere is also evidence of pro-Assad groups outside Syria participating in malware campaigns against opposition. Notably,\n\n[a group reported on in 2015 by FireEye (in collaboration with one of the authors of this report) used female avatars to](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-behind-the-syria-conflict.pdf)\n\nsend trojaned documents to high profile figures in opposition politics, aid, and armed groups. The operation yielded over\n\n31,000 conversations, and a trove of sensitive information about a variety of groups’ plans and activities. This group also\n\nmade use of fake matchmaking websites and social media accounts to backstop their deception.\n\n## ISIS-Linked Groups\n\n[On a different side of conflict, the Citizen Lab documented a malware operation linked to ISIS against the group](https://citizenlab.org/2014/12/malware-attack-targeting-syrian-isis-critics/)\n\n‘Raqqa is Being Slaughtered Silently’ (RBSS) in 2015. The operators, masquerading as a group of RBSS sympathizers\n\nbased in Canada, targeted victims with a file that claimed to contain locations of ISIS forces and US Airstrikes within Syria.\n\nThe file actually contained custom malware that collected and transmitted information about the infected computer.\n\nThe report concluded that there was strong circumstantial evidence linking the malware to members of ISIS.\n\n## Many Groups, Similar Tactics\n\nEach of these groups has distinct Tactics, Techniques and Procedures (TTPs). However, one common thread among the\n\nmany publicly-reported groups is that they rarely use exploits in their campaigns, instead relying heavily on social\n\nengineering and trickery to convince targets to execute malicious files, disguised as innocuous documents.\n\nThis may reflect some of these groups’ lack of technical sophistication. For example, many regime-linked groups seem\n\nto have very limited skills and technical resources, and rely almost entirely on RATs coupled with well-informed social\n\nengineering. These techniques have evolved, but not improved radically since 2011. In other cases, such as the Lebanon\nlinked group reported on by FireEye, operators may have access to more sophisticated techniques, but see little reason\n\nto use them against their targets, given the limited technical capabilities of the opposition.\n\n# Part 1: Discovering Group5\n\nThis section describes the e-mails that first alerted us to an operation targeting the Syrian political opposition in October\n\n2015.\n\nOn October 3rd 2015, Noura Al-Ameer, a well-connected Syrian opposition political figure, negotiator, and former Vice\n\nPresident of the opposition Syrian National Council (SNC), received a suspicious e-mail.[1] The e-mail purported to come\n\nfrom a human rights documentation organization she had never heard of: “Assad Crimes.” The sender, using the e-mail\n\naddress office@assadcrimes[.]info claimed to be sharing information about Iranian “crimes,” a theme familiar to many\n\nin the opposition\n\n\n-----\n\nFig. 1: Noura Al-Ameer, former SNC Vice President and a target of the operation. An activist from Homs, Syria, Al-Ameer was\n\ndetained and tortured in the security branches, later moved to the infamous Adra prison in Damascus, prior to fleeing the country\n\nseveral years ago. Today, she is a delegate to the SNC’s political council and works to document war crimes committed during\n\nthe conflict. Her identity was falsely used to register the assadcrimes website.\n\nInterestingly, Al-Ameer’s own name was used in the assadcrimes[.]info domain registration, along with other false\n\ninformation (we speculate on the reason for using her name in Part 6: Analysis of Competing Hypotheses).\n\nAlong with a brief pretext in the Subject and Body, the e-mail also contains an attached Microsoft PowerPoint Slideshow\n\n(PPSX) document that, when clicked, directly opens and runs a PowerPoint slideshow.\n\n## E-mail 1: The Initial Message (Dropper Doc 1)\n\nOn October 3rd 2015, Al-Ameer received the initial e-mail message, containing the first malicious file:\n\nTranslation:\n\n\n**From: office@assadcrimes[.]info**\n\n**To:**\nSubject: Iran is killing the Pilgrims in Mina\n\nBody: Iran’s Crimes in the Kingdom of Saudi Arabia\n\n\n-----\n\nAssadcrimes.ppsx\nMD5 : 76F8142B4E52C671871B3DF87F10C30C\n\n\n**Communication with the Operator**\n\nAl-Ameer, who is no stranger to digital threats, recognized that the e-mail was suspicious, and on our instruction made\n\ncontact with the operator, hoping to elicit further malware.\n\nAl-Ameer’s E-mail:\n\nTranslation:\n\n\n**From: [Redacted]**\n**To: office@assadcrimes[.]info**\n\n**Body:**\n\nHello\nThe file didn’t work …. Please send a correct version\n\n\n## E-mail 2: The Operator Replies (Dropper Doc 2)\n\nShortly after the target’s message, the operator replied with an updated file, sent via a webmail client (RoundCube):\n\nTranslation:\n\n\n**From: office@assadcrimes[.]info**\n**To:[Redacted]**\n\n**Body:**\n\ninf* download\n\n\nWe are unsure why the second e-mail does not contain additional social engineering text. It is possible this was an\n\noversight, or that the Group5 operator at the time was not comfortable writing in Arabic.\n\n\nAssadcrimes1.ppsx\nMD5: F1F84EA3229DCA0CCACB7381A2F49F99\n\n\n## Bait Content: Syria and Iran-Themed PowerPoint Slideshows\n\nThe PPSX documents (assadcrimes.ppsx & assadcrimes1.ppsx) contain a series of images and Arabic text, including\n\ncartoons and photographs describing politically sensitive events, such as aggressions launched by Iran against Saudi\n\nArabia and the politics surrounding the current Syrian conflict The documents also provide a historical overview of\n\n\n-----\n\nFigure 2: Screenshot from a slide referred to an Iranian attack in 1984 against petrochemical facilities in Saudi Arabia.\n\nTranslation:\n\n\nOn 1404 A.H – 1984 A.D Iranian warship attacked Saudi Arabia\nOn 1404 A.H, two Iranian war planes headed to Jubail industrial city, to bomb and hit critical factories\n\n(Petrochemical factory) and by god’s well, the Saudi’s air forces was able to hit one plane, while the other\nmanaged to escape.\n\n\nWhen opened, both files download malware onto the victim’s machine. Malware from these files is analyzed in Part 3:\n\nWindows Malware.\n\n# Part 2: The Assadcrimes Website\n\nGroup5 operated a website, assadcrimes[.] info that served as a watering hole for Android and Windows malware. This\n\nsection outlines the various files hosted on the site.\n\nAfter the initial e-mails, we began to monitor a website linked to the e-mails: assadcrimes[.]info. At the time of these e\nmails (Oct. 3, 2015), the site was not fully functional. However, within a few days (Oct. 11, 2015) the main page displayed\n\n“Posts Tagged Bashar Assad Crimes” with content apparently critical of Bashar Assad. The content appears to have\n\n[been scraped from an opposition blog, as well as from other opposition sites. This blog was created in the name of Tal al-](https://syriatopics.wordpress.com/)\n\nMallohi, known as Syria’s youngest prisoner of conscience. The original blog creation predates the current unrest in Syria.\n\n\n-----\n\nFigure 3 : Screenshot of the website taken in April 2016 (assadcrimes[.]info).\n\nShortly before this publication of Group5, the website was listed as “expired” and parked, indicating that the owner\n\nchose not to renew the domain.\n\n\n-----\n\nGroup5 Staging and Targeting\n\n## Malware Seeding on the Website (Dropper Doc 3)\n\nWhile monitoring the website, we identified several directories that auto-download a further malicious file\n\n(assadcrimes.info.ppsx). These links seem designed for other forms of social engineering, perhaps using similar bait to the\n\nmessages targeting Al-Ameer. The Assadcrimes.info.ppsx file concerns the Syrian conflict, with characters and cartoons\n\nculled from social media and online sites.\n\n\n-----\n\nFigure 4 : A slide from the file Assadcrimes.info.ppsx\n\n\nTranslation:\n\n\nA new Play in Syria\n\nRussian-American plan to divide the Syrian cake.\n\n\nWhen viewed, the victim’s computer is silently infected with malware (See Part 3: Windows Malware).\n\n\nAssadcrimes.info.ppsx\nMD5: 30BB678DB3AD0140FC33ACD9803385C3\n\n\n## Martyred Children (Decoy Dropper 4)\n\nElsewhere on the site we found several HTML pages that, when visited, triggered the downloading of a malicious\n\nexecutable named “martyred children” (alshohadaa alatfal.exe). When executed, the program pulls images hosted\n\n[on assadcrimes[.]info of the Ghouta Chemical Attacks, while simultaneously infecting the target machine with malware.](https://en.wikipedia.org/wiki/Ghouta_chemical_attack)\n\n\n-----\n\nFigure 5 : showing screenshot of ‘alshohadaa alatfal.exe’ running. Images blurred by the authors.\n\nMalware from the website is described in Part 3: Windows Malware\n\n\nalshohadaa alatfal.exe\n\nMD5: 2FC276E1C06C3C78C6D7B66A141213BE\n\n\n## Android Malware\n\nWhile examining the assadcrimes[.]info website, we identified Android malware, seeded via a fake Adobe Flash Player\n\nupdate notification. We describe this Android malware in detail in: Part 4: Android Malware.\n\n\nadobe_flash_player.apk\nMD5: 8EBEB3F91CDA8E985A9C61BEB8CDDE9D\n\n\n# Part 3: Windows Malware\n\nGroup5 used (or was staging) a range of malware in this operation, ranging from malicious PowerPoint slideshows using\n\nexploits to executable files that directly drop malware. A comprehensive analysis of their malware is found in Appendix A:\n\n**Windows Malware Analysis.**\n\n## Malicious PowerPoint\n\nThe initial Group5 targeting that we observed in the e-mails to Al-Ameer included PPSX documents as a vehicle for\n\nmalware using two different techniques: (1) executing OLE objects using animation actions within a PowerPoint slideshow\n\nand; (2) using CVE-2014-4114 to drop and execute malicious code.\n\nIn assadcrimes.ppsx the operators embed an OLE Package object within a PowerPoint slideshow. When displayed as an\n\n[animation, the object is executed while the slideshow is viewed, a technique that has been previously described (for](http://phishme.com/powerpoint-and-custom-actions/)\n\nmore detail, see Appendix A: Dropper Doc 1 & Appendix A: Dropper Doc 3). In this case the user is presented with a\n\nprompt asking whether they wish to run the object.\n\n\n-----\n\nFigure 6: The malicious executable within the PowerPoint slideshow, when viewed in edit mode. A victim double clicking on the\n\nslideshow would not be shown the object.\n\nIn the assadcrimes1.ppsx, the operator has created a PowerPoint file that leverages CVE-2014-4114, a vulnerability in the\n\nOLE packager component of the Windows operating system (See Appendix A: Dropper Doc 2).\n\nDecoy Applications\n\nThe operators have also created a decoy application, hosted on assadcrimes[.]info, that displays images of child victims\n\nof the 2013 Ghouta Chemical Attacks. When executed, the application silently decrypts and drops the malware (See\n\n**Appendix A: Decoy Dropper 4).**\n\n\n-----\n\n## The RATs\n\nThe operators use these techniques to deliver two commonly available Remote Access Trojans (RATs): njRat and\n\nNanoCore RAT. In both cases, Group5 disguised the malicious binaries with several layers of obfuscation, including\n\ncrypting and packing to reduce the possibility of detection by antivirus software.\n\nBoth RATs provide a wide range of functionality on the target machine, ranging from collecting files, watching the\n\nscreen, to capturing passwords and keystrokes. The RATs also enable the operator to remotely delete files, and spy on the\n\ncomputer user via the microphone or webcam.\n\n\n-----\n\nFigure 7 : Screenshot of njRAT working, and accessing the victim’s files.\n\n## Antivirus Detection\n\nOn July 26, 2016 we conducted a VirusTotal search for the MD5 hashes of each of the files encountered during this\n\noperation. The results, provided in Appendix D: File Hashes, were consistent with a highly focused or targeted operation in\n\nthat only two of the 16 (12.5%) unique MD5s were found.\n\n# Part 4: The Android Malware\n\nWhile examining assadcrimes[.]info, we determined that the site was also hosting a decoy Flash Player update page. This\n\npage, located on a subdomain, included a download link to a malicious Android APK. For a full analysis of this malware\n\nsee Appendix B: Android Malware.\n\nWhile examining the website we found that the operators had prepared Android malware masquerading as an Adobe\n\nFlash Player update notification. Clicking on the “Update” link (See Figure 8) downloads a malicious file, masquerading\n\nas a software update.\n\n\n-----\n\nFigure 8: Screenshot from the subdomain that was used to host the fake Flash Player update page.\n\n[The APK is an instance of DroidJack. According to Symantec, this malware evolved from an older codebase known as](http://www.symantec.com/connect/blogs/droidjack-rat-tale-how-budding-entrepreneurism-can-turn-cybercrime)\n\nSandroRAT. The RAT provides a wide range of functionality, enabling the operator to capture messages, contacts, photos\n\nand other materials from the device. In addition, DroidJack can also remotely activate the phone camera and\n\nmicrophone, without notifying the victim. Figure 9 shows some of the functionality available.\n\n\n-----\n\nFigure 9: DroidJack server list of commands.\n\nA more extensive analysis of the DroidJack malware, can be found in Appendix B: Android Malware. Interestingly,\n\n[DroidJack has also emerged recently, bundled with versions of Pokémon Go.](https://www.proofpoint.com/us/threat-insight/post/droidjack-uses-side-load-backdoored-pokemon-go-android-app)\n\nThis approach to mobile malware seeding, while cumbersome, might be assumed to have greater success in the target\n\ngroup of Syrians than other populations. It is common for Syrians to share Android APK files outside the Google Play Store,\n\nas Google Play Services are not available within Syria. This practice carries over to the Syrian diaspora in other countries,\n\ndespite the availability of Google Play. As a result, we suspect that most devices are set to accept APK files from\n\nunknown developers.\n\n# Part 5: Attribution\n\nGroup5 left a number of clues as to their origin and identity, including the tools they used, where they hosted their website\n\nand C2, and how they accessed the website. Notably, Group5 may have also been using a customized version of an\n\nIranian obfuscation tool.\n\nThis section provides an overview of the clues left by Group5 on the website, and in the malware. First, we analyze logs\n\nthat the operator mistakenly left publicly visible on the assadcrimes[.]info website. These logs include not only the visitors\n\nto the site, but also the IP addresses and user agent strings that belong to the operator as she or he logged into the site\n\nduring the development phase. These artifacts provide interesting clues as to the operator’s identity and operational\n\nsecurity practices, such as using a VPN, and suggest a strong Iranian nexus.\n\nSecond, we note the use of Persian-language tools in Group5, from the mailer to the packer.\n\nFinally, we analyze a recurrent theme in the binaries: “Mr. Tekide” – a name that appears regularly in the implants. We\n\nlink this name to the Iranian developer of a series of malware tools, several of which were used in this operation.\n\nAdditionally, we examine the circumstantial evidence connecting this developer to Group5’s activities.\n\n## Unprotected Logs\n\nSeveral key directories on the assadcrimes[.]info site were left as public, including a folder containing the website logs, a\n\nfeature Group5 seems to have enabled early in the operation. These logs date to the early development and operation\n\nof the website, and reveal interesting clues about operator origin and operational security.\n\nAfter processing the logs to remove crawlers belonging to Google, Bing, Yandex and others, we scrutinized the logs of the\n\n\n-----\n\nWhile the logs provided few clues as to victims, they proved to be exceptionally useful for identifying the IP addresses\n\nused by Group5 as they developed the site. Looking at the earliest logs in the set, from October 11, 2015, we find the\n\noperator accessing the site hourly from an Iranian IP block as the development continues.\n\nFigure 10: Screenshot of 11th October 2015 log, showing list of IP’s and referrer from hostnegar[.]com\n\nThe first logged visits to the site come from the IP address 37.137.131[.]70, which belongs to a block registered to ‘Rightel\n\nCommunication’, an Iranian mobile phone network operator.\n\n\ninetnum: 37.137.128[.]0 – 37.137.255[.]255\n\nnetname: RighTel\n\ndescr: “Rightel Communication Service Company PJS”\ncountry: IR\n\nadmin-c: RP12366-RIPE\n\ntech-c: RP12366-RIPE\nstatus: ASSIGNED PA\n\nmnt-by: TA59784-MNT\n\ncreated: 2013-08-20T11:13:17Z\nlast-modified: 2014-05-17T05:28:10Z\n\nsource: RIPEperson: RighTel PJS\n\naddress: 9th floor, Chooka Building, No 8, west Armaghan Street, Vali-e-Asr Street\n(After Niayesh Highway), Tehran, Iran\n\nphone: + 982127654530\n\nnic-hdl: RP12366-RIPE\nmnt-by: TA59784-MNT\n\ncreated: 2014-05-17T05:23:47Z\n\nlast-modified: 2014-05-17T05:23:47Z\nsource: RIPE\n\n\nFurther confirming the link is that the operator’s traffic includes a referrer from the Iranian hosting company\n\n(hostnegar[.]com) for the site.\n\n\n-----\n\nFigure 11: Hostnegar’s login page\n\nTracing the operator through an initial UserAgent string (a version of Windows NT 6.3)[2] and IP address, we found them\n\naccessing the site from an iPhone, other Iranian IP addresses, as well as VPNs.\n\nFigure 12: User agents for the site owner, accessing the website from Iranian IPs and VPN.\n\nAdditionally, the operator accessed the site directly from the malware’s C2 server (88.198.222[.]163).\n\n\n-----\n\nFigure 13 : User agents for the site owner, accessing the website from the C2, and using VPNs.\n\nThese links provide evidence for an Iranian nexus, and suggest that the operator may have been taking steps to conceal\n\ntheir true origin IP. However, these steps were not well executed, which enabled us to track Group5 as they continued to\n\naccess the site.\n\nInterestingly, after the flurry of activity in October 2015, by November-December the operator accessed the site only 7\n\ntimes, and between January-February 2016 only twice (it is possible we have missed some access attempts that appear\n\nto be innocuous traffic). We concluded from this that Group5 may have stepped back from the site at some point after\n\nthe New Year.\n\n## A Persian-language Mailer\n\nBefore the assadcrimes[.]info page was fully populated with decoy content, we found that the site was hosting a Persian\nlanguage mailer (See Figure 14 below). We were not able to determine how the mailer was being used by Group5, as it\n\nwas not observed sending any of the e-mails we were able to analyze.\n\n\n-----\n\nFigure 14: A screenshot for the mailer as it was on October 4, 2015.\n\n## Links to Known Threat Actors\n\nGroup5 appears to have used only a single shared web hosting provider and a single command and control IP address\n\nfor this operation. We are unsure whether this strategy was the product of limited resources, an effort to\n\ncompartmentalise the operation from other activities, or simply a highly targeted operation with a specific focus.\n\nThe narrow infrastructure and small number of observed targets limited our search base for potential infrastructure\n\noverlap with known groups. In a holistic evaluation of the campaign, we failed to identify links with the TTPs of previously\n\ndocumented threat actors or groups active in Syria. We also failed to find a link in searches of malware databases and\n\nopen source searching.\n\nOn the level of TTPs, superficially there is similarity between this group and other active groups originating in Iran. The\n\n[group multiply](http://researchcenter.paloaltonetworks.com/2016/05/prince-of-persia-infy-malware-active-in-decade-of-targeted-attacks/) [documented by Palo Alto Networks, which they call “Infy,” is also known to use PowerPoint files in their](http://researchcenter.paloaltonetworks.com/2016/06/unit42-prince-of-persia-game-over/)\n\ntargeting, although we found no overlap in infrastructure. Furthermore, their targeting (according to what Palo Alto\n\nNetworks has said publicly) is slightly different, and involved PowerPoint 97-2003 documents (not PPSX files) during the\n\nsame period in which Group5 was using a different tactic.\n\nWe cannot not rule out the possibility that a known group is behind this operation, and that we missed or lacked access\n\nto a key piece of evidence that would link such a group to Group5’s infrastructure or tools. One interesting direction for\n\nfurther investigation came from analysis of the tool used to obfuscate the RATs, which yielded a number of interesting\n\nconnections to known threat actors and tools. Notably, the PAC Crypt tool, and Mr. Tekide, the alias of an Iranian\n\nmalware developer.\n\n**PAC Crypt**\n\nCommonly used in malware campaigns, crypters are programs which are designed to disguise the underlying malicious\n\nbinary by hiding it within a layer of obfuscation which is then deobfuscated at the time of execution. In this way, crypting\n\na malicious binary provides a level of protection against signature-based endpoint security tools such as antivirus. In\n\nAppendix A we describe the discovery of a series of strings which suggest that both the njRAT and NanoCore RAT\n\npayloads were built, and then subsequently obfuscated using a crypter tool named ‘PAC Crypt’.\n\nCareful inspection revealed that the crypter in this case had been compiled in debug mode, thus preserving PDB\n\nreference data. PDB file references are common in .Net applications when compiled in ‘debug’ mode, and they\n\nfrequently reveal the original file path of the application source code on the developer’s computer.\n\nBelow are the PDB strings discovered when examining the ‘crypted’ njRAT and NanoCore files:\n\n\n-----\n\nc:\\users\\mr.tekide\\documents\\visual studio 2013\\projects\\paccryptnano core dehgani \nvds\\windowsapplication2\\obj\\debug\\launch manager.pdb\n\nReference: Doc Dropper 3 Crypter MD5:6161083021b695814434450c1882f9f3 Compile Time: 10/6/2015 02:13:45\n\nC:\\Users\\mr.tekide\\Documents\\Visual Studio\n\n2013\\Projects\\paccrypt11njratmalii\\paccryptalipnahzade\\obj\\Debug\\LManager.pdb\n\nThese PDB strings reveal two facts relevant to the discussion of attribution. The first is that the username of the individual\n\nwho compiled the .Net application in both cases was ‘mr.tekide’. The second is that in both PDB strings we find not\n\nonly a reference to the malware crypter used (a tool called ‘PAC Crypt’), but also an explicit reference to the crypted\n\nmalware payloads – ‘nano core’ and ‘njrat’.\n\nThese two facts together suggest that an individual having the username ‘mr.tekide’ compiled a copy of PAC Crypt\n\nfor specific projects involving njRAT and NanoCore RAT.\n\nA common usage scenario for a malware crypter involves an operator purchasing a copy of the crypter in a compiled\n\nform (or using a cracked version), then using the crypter to obfuscate the malware executable which is to be distributed.\n\nIn this scenario the developer of the crypter has no knowledge of what specific malware the threat actor will eventually\n\nchoose to encrypt with the purchased copy of the crypter.\n\nThe fact that the ‘PAC Crypt’ PDB strings discovered in this case contained the ‘njrat’ and ‘nano core’ references\n\nis therefore noteworthy because it indicates the possibility of prior knowledge of the precise malware payload which was\n\nto be crypted.\n\nResearch into the PAC Crypt tool revealed that this program is developed and sold by an Iranian malware developer\n\nknown as ‘Mr. Tekide’.\n\n**Mr. Tekide**\n\nMr. Tekide is the online alias of an Iranian malware developer who is also the administrator of the website\n\nhttp://crypter[.]ir, an Iranian hacking forum and online shop. Notably, this storefront offers various hacking tools and\n\nservices, including the aforementioned ‘PAC Crypt’ (see figure 15 below).\n\nFigure 15: Crypter[.]ir main page (left), and contact page (right)\n\nIn addition to the crypter[.]ir forum and shop, Mr. Tekide appears to be in the midst of creating a new online storefront for\n\nselling his various malware tools and services. The content shown in Figure 16 below, obtained from http://crypting[.]org,\n\nshows a ‘rat service’ being offered to visitors. The store also touts a Windows Rootkit (“coming soon”) and various\n\n‘exploits.’\n\n|Reference: Doc Dropper 3 Crypter|MD5:6161083021b695814434450c1882f9f3|Compile Time: 10/6/2015 02:13:45|\n|---|---|---|\n|C:\\Users\\mr.tekide\\Documents\\Visual Studio 2013\\Projects\\paccrypt11njratmalii\\paccryptalipnahzade\\obj\\Debug\\LManager.pdb|||\n\n\n-----\n\nFigure 16: Crypting[.]org main page (left), list of hacking services offered (right)\n\nMr. Tekide also maintains an active presence as a moderator on the Ashiyane forums,[3] an Iranian security discussion\n\nboard run by the Ashiyane Digital Security Team (ADST). The ADST is a well-known Iranian security and hacking group\n\nwhich has earned notoriety for its prolific website defacement activities. These defacements invariably contain a list of\n\nADST ‘defacers’ alongside the phrase ‘We Love Iran’.\n\nWeb site defacements conducted by ADST have explicitly named Mr. Tekide as a member, as shown in Figure 17 below.\n\nFigure 17: an Ashiyane Digital Security Team defacement page, naming Mr. Tekide\n\nIn addition to its defacement activities, ADST has been recently linked to the indictment by the US Department of Justice\n\n[of seven Iranian nationals for cyber attacks against the US financial sector. In its indictment, the Department of Justice](https://www.justice.gov/opa/pr/seven-iranians-working-islamic-revolutionary-guard-corps-affiliated-entities-charged)\n\nalleges that members of two Iranian security companies, ITSecTeam and Mersad Company, were responsible for\n\nDistributed-denial-of- Service (DDoS) attacks against numerous US bank websites between September 2012 and May\n\n2013. The DoJ indictment also describes that Mersad was founded by members of the ADST, and furthermore that ADST\n\nhad made prior public claims regarding its activities on behalf of the Iranian Government.\n\nAdditional open source information about Mr. Tekide is included in Appendix C: Mr. Tekide.\n\n## A Consistent Iranian Nexus\n\nWe cannot conclude with certainty that Group5 is Iran-based, although the confluence of information outlined above\n\nprovides a circumstantial case. The IP addresses observed during early stages of development of the Assadcrimes\n\nwebsite, as well as the Iranian hosting provider and the Persian language mailer, all speak to a level of Iranian presence.\n\nThe additional apparent involvement of an Iranian malware developer with ties to a known Iranian cyber actor, whether\n\nhis involvement was unwitting or intentional, only strengthens the Iranian connection.\n\n# Part 6: Analysis of Competing Hypotheses\n\nThis section evaluates several competing hypotheses for explaining the identity of the operator. While we cannot\n\nconclusively support one of these hypotheses, we think the most plausible is that this operation is the work of an Iranian\n\ngroup newly active in Syria.\n\nWe believe we found Group5 fairly early in the process of preparing a larger malware campaign, thanks to Noura Al\nAmeer’s vigilance. This gave us unique visibility into some of their staging, but we had only a limited view of other\n\nibl t ti G 5’ li i f t t li it d bilit t t th ti t th\n\n\n-----\n\nWith these caveats and limitations in mind, we outline the known elements of the operation, and evaluate several\n\nhypotheses: (Hypothesis 1) an Iranian group newly active in Syria; (Hypothesis 2) that the operation is from known regime\nlinked groups, like the Syrian malware groups; and (Hypothesis 3) that it is from some other unknown group. After\n\naddressing the fit of each hypothesis with available evidence, we provide an overall evaluation of the three, and\n\nconclude that Hypothesis 1 provides the best explanation for what we have observed.\n\n# Hypothesis 1: Iranian Group Newly Active in Syria\n\nA group previously unreported in Syria with uneven skills but displaying thought and care in selecting the target, and\n\npreparing the operation, with an Iranian nexus and a possible government connection.\n\n**Previously Unseen in Syria: We have been unable to find a high-confidence overlap in infrastructure or malware to**\n\npreviously-reported groups active around Syria. We also had difficulty connecting the operation to other known groups in\n\nthe global threat actor space. Furthermore, the use of exploits, as well as DroidJack and other tools, is inconsistent with\n\nthe TTPs of known groups targeting the Syrian opposition, especially the regime-linked groups. Notably, these groups have\n\nshown little ability or appetite for: (a) standing up multifaceted seeding websites; (b) targeting Android users; (c) using\n\nexploits in PowerPoint files.\n\nPreviously reported groups, especially regime-linked groups, have had a tendency to re-use infrastructure, and repurpose\n\nsimilar tools and approaches. It would be surprising for them to suddenly abandon tactics that still “work,” and cease\n\nusing a C2 infrastructure that cannot be taken down (because it is inside Syria).\n\n[While Group5’s tactics have more in common with the group reported in this FireEye report, such as the use of a fake](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-behind-the-syria-conflict.pdf)\n\nwebsite, COTS .Net malware, and Android malware, there is no direct infrastructure or tool overlap, and only limited\n\nevidence of social engineering sophistication (e.g. the use of avatars).\n\nFurthermore, the lack of technical sophistication, combined with low operational security, suggest that, had this group\n\nbeen previously active for any length of time, it would have run the risk of discovery, perhaps especially given all of the\n\nexisting reporting about pro-Regime malware groups in Syria.\n\n**Uneven Technical Sophistication: The operators showed familiarity with a range of cybercrime tools, yet also committed a**\n\nrange of operational security oversights, such as leaving their logs open and public-facing, connecting via their C2\n\nserver, and leaving debugging strings in compiled files. These characteristics would be inconsistent with the work of an in\nhouse government capability.\n\n**Iranian Connection: Analysis of the malware and seeding yields a consistent Iranian presence. The binary contains Iranian**\n\nand Iranian-Persian traces, as do the tools used for obfuscation, which are popular in Iranian cybercrime forums. Similarly,\n\nthe mailer discovered on the assadcrimes[.]info website is in Persian. There is also the intriguing, but ultimately unproven\n\nspeculation that the crypter may have been sold to Group5 by a known Iranian malware developer. Furthermore, logs of\n\naccess to the assadcrimes[.]info site suggest that the operators are working from within Iranian IP space. In addition, the\n\nbait content also contains substantial Iranian themes. Finally, the hosting provider (Hostnegar) is Iranian. A final piece of\n\nhighly circumstantial evidence is that PowerPoint documents containing exploits, albeit often with quite different (and\n\n[sometimes custom) malware, is a commonly reported feature of many recently-reported](http://researchcenter.paloaltonetworks.com/2016/05/prince-of-persia-infy-malware-active-in-decade-of-targeted-attacks/) [Iranian campaigns.](https://www.iranhumanrights.org/2016/04/cyber-attacks-iranian-officials/)\n\n**Targeting Sophistication: Group5 not only targeted a well-connected individual within the Syrian opposition, but also**\n\nmasqueraded as her to register the assadcrimes[.]info site. Both the site and the bait content also indicate a degree of\n\nfamiliarity with the opposition’s concerns and activities, and their targeting indicates they were targeting a key person in\n\nopposition politics and multilateral negotiations, yet not highly visible outside of informed circles. Speculatively, the\n\nchoice of target is indicative of the interests and resources of a state-level actor, or a group receiving direction or\n\nproviding information to such an actor. A number of governments and non-state actors in the region have an interest in\n\nthe workings of the opposition, and several are providing direct or indirect support to the Assad Regime. We discuss this\n\npossibility in greater detail below in Evaluating Hypotheses.\n\n# Hypothesis 2: Known Regime-Linked Group\n\nA known Regime-linked group has modified its tactics to operate against familiar targets\n\n**Familiar Targets: The most widely documented threat against the Syrian opposition comes from regime-linked groups,**\n\nnotably malware groups and the Syrian Electronic Army (to a lesser degree). These groups benefit from known links to the\n\nregime of Bashar al-Assad, which has a direct and strong interest in monitoring members of the Syrian Opposition,\n\nincluding the groups apparently targeted in this operation. We are familiar with previous operations by regime-linked\n\ngroups targeting the same organizations.\n\n\n-----\n\nRegime-linked groups certainly have the motivation to conduct this operation. Do known groups have the skills to\n\nconduct such an operation? There are a range of features of this operation that suggest Group5 may not be a regime\nlinked group. First, known regime-linked Syrian groups have tended to use a limited set of C2 servers, almost always with\n\nat least one server (or a fallback) located within a narrow set of servers within Syria. Group5 does not have a fallback C2\n\nin Syria. Similarly, the servers that Group5 does use are not from companies previously associated with Syrian regime\n\ngroups, nor is there any prior evidence of regime-linked groups making use of Persian-language tools, or Iranian IP space.\n\nFurther, known Syrian groups have been active for almost 5 years without evidence of familiarity with PPSX exploits. It is\n\nunclear why they would deploy so many new tactics all at once, even they continue to gently iterate on techniques\n\nfamiliar to them.\n\n**Other Syria-Focused Groups? In the introduction we mentioned two other groups that have previously targeted the Syrian**\n\nopposition: a Lebanon-linked group uncovered in 2014, and an ISIS-linked operation in 2015. The first group, described in\n\n[a 2015 FireEye Report, coauthored by one of the authors of this report, conducted an extensive campaign against the](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-behind-the-syria-conflict.pdf)\n\nSyrian opposition. The campaign relied heavily on Arabic-speaking female avatars to flirt with opposition figures and trick\n\nthem into downloading malware for Windows or Android. That campaign, however, differed in malware tools,\n\ninfrastructure, and social engineering style from Group5. In addition, it lacked any Persian-language elements, or\n\nconnection to Iranian IP space.\n\n[In late 2014 a Citizen Lab report coauthored by one of the authors of this report, identified a malware operation linked to](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-behind-the-syria-conflict.pdf)\n\n[ISIS that targeted Raqqa is Being Slaughtered Silently, a documentation and media group working to uncover human](http://www.raqqa-sl.com/en/)\n\nrights abuses in Raqqa and other ISIS-controlled territories. That malware was apparently custom-made but very\n\nunsophisticated. Lacking the functionality of a RAT, and exfiltrating via e-mail, the operation was substantially less\n\nsophisticated than Group5’s activities. We think it unlikely that the operator behind that malware has (a) grown much\n\nmore sophisticated, or (b) begun to rely on Iranian tools and hosting providers.\n\n# Hypothesis 3: Other Unknown Group\n\nAn unknown group, not located in Iran and not linked to prior groups\n\nIt is possible that the operation is the work of some other unknown group. One possibility that we consider is that the\n\noperation is a false flag from another state sponsor, deliberately crafted to appear to be an Iranian group. In another, we\n\nalso consider the other common motivations for such operations, including financial crime.\n\n**A False Flag: Certainly, many other governments are actively interested in information about the Syrian opposition. Given**\n\nthe extensive circumstantial evidence strewn throughout the operation that points to a group based in Iran, one\n\npossibility we consider is that the operators are deliberately masquerading as an Iranian group, while acting on behalf of\n\nanother sponsor.\n\nIn such a scenario, each of the pieces of circumstantial evidence we have assembled is a string of deliberately planted\n\nartifacts, intended to deflect from the threat actor’s true identity. This hypothesis is an intriguing possibility that cannot\n\nbe conclusively ruled out. However, it is worth asking why, given the noisiness of existing groups targeting the Syrian\n\nopposition, a false flag operation would not simply be populated with the many publicly reported strings and other tools\n\nassociated with pro-regime groups. Similarly, we wonder why a threat actor sophisticated enough to mount such an\n\noperation would not also have used more sophisticated malware or seeding techniques.\n\n**Financial / Commercial Hacking: We find no evidence to suggest that financial crime or commercial espionage played a**\n\npart in this operation. For a narrowly focused operation, the targeting, for example, does not appear to be geared\n\ntowards wealthy individuals, or those with access to serious financial resources.\n\n# Evaluating Hypotheses\n\nWe have moderate confidence that the best hypothesis is Hypothesis 1: Iranian Group Newly Active in Syria. The Group5\n\noperation shows strong Iranian connections, with few indicators linked to previously reported groups, including Syrian\n\nregime-linked groups. The important caveat is that, perhaps partially by design, we have a limited view on the targets of\n\nthe campaign, and it is possible that this analysis would change.\n\nWe further believe that Group5 shows some signs of being state-directed, however we do not have sufficient evidence to\n\nlink Group5 to a particular government. Two possibilities seem likely: (1) Group5 is working under the control or direction of\n\na government entity within Iran, or sympathetic to such an entity and receiving and sharing information with them; (2)\n\nGroup5 is collaborating or working on behalf of a government entity within Syria for ideological or mercenary reasons.\n\nBoth governments are belligerents within the Syrian conflict, and both would have a strong interest in accessing the\n\ncommunications of the Syrian opposition.\n\n\n-----\n\n[and training, to electronic monitoring capabilities. At minimum, operators based in Iran certainly would be unlikely to](https://www.foreignaffairs.com/articles/iran/2011-08-25/how-iran-keeps-assad-power-syria)\n\nface punishment from their government for work against the Syrian opposition. Speculatively, sponsoring such an\n\noperation (held at arms length and consigned to a deniable, less experienced group) could provide useful information\n\nabout the activities and thinking of key individuals within the Syrian Opposition, such as advanced knowledge of\n\nnegotiating points in multilateral meetings, or internal disagreements.\n\nImportantly, there is no evidence to directly connect Group5 to any entities within the Iranian government, security\n\nestablishment, or military. Nor can we rule out the possibility that Group5 is Iran-based, but working on behalf of some\n\nother entity.\n\nThe most perplexing part of the activity we observe is that the operation appears to have been extensively prepared,\n\nand then apparently paused after initial seeding. This pause took place not long after Al-Ameer was initially targeted: the\n\nwebsite development continued for a period after she had received the initial e-mail, and then ceased. Group5 may\n\nhave initially targeted Al-Ameer hoping to leverage her well-connected position and digital identity to target others\n\nwithin the Syrian opposition. Theft of her digital identity would explain why her name was used in the WHOIS for\n\nassadcrimes[.]info, and why, after failing to infect Al-Ameer, the campaign did not appear to receive much further work,\n\nand the infrastructure was ultimately abandoned.\n\nOther explanations for the pause in activity are possible, and we cannot discount them based on our limited evidence:\n\nGroup5 may have undergone a shift in the focus of its targeting, concluded that their campaign was ‘blown’ and\n\nabandoned it, experienced human resources or political issues, or simply concluded that the operation was using an\n\nineffective technique.\n\n# Conclusion\n\nWhen Syrian opposition figure Noura Al-Ameer sensed something wrong and refrained from clicking, she frustrated a\n\nreasonably well put together deception. We suspect she may have been targeted in order to steal her digital identity for\n\nthe purposes of mounting a larger campaign. Beginning with this initial message, we were able to identify and\n\ncharacterize Group5, a seemingly new entrant into the game.\n\nWith the identification of Group5, the number of publicly identified operations known to have targeted the opposition\n\nwith malware has risen to five, at least: Regime-linked groups (Syrian malware groups and the Syrian Electronic Army), a\n\n[Lebanese Group, ISIS, and most recently Group5. We believe that the most compelling explanation of Group5’s](https://citizenlab.org/2014/12/malware-attack-targeting-syrian-isis-critics/)\n\nactivities is that a group in Iran may be attempting to compromise the communications of the opposition. The\n\ncircumstantial evidence pointing to an Iranian group is unsurprising, given Iran’s active military engagement in Syria,\n\nand the sympathies of many in that country for the Assad regime. However, mindful of the limits of our investigation, we\n\nstop short of conclusive statements of attribution about the identity of the operators, or their possible sponsors. We hope\n\nthat by publishing this report and sharing indicators, our work will be helpful to other researchers who may see pieces of\n\nthe puzzle that we do not.\n\nDespite the diversity of the groups targeting the Syrian opposition, they share general features: uneven or low technical\n\nsophistication plus good social engineering and well-informed targeting. These elements are characteristic of the\n\nmajority of malware and phishing operations targeting the Syrian opposition over the past several years.\n\nThe continued targeting, and entry of new groups, reflects the continued weakness in the Syrian opposition’s digital\n\nsecurity, and more generally the risks groups face when using popular online platforms for contested political activities.\n\nOperators targeting the Syrian opposition plainly do not need sophisticated tools, because easily available malware\n\ncontinues to “work,” when paired with good social engineering. The technical requirement for entering the game is\n\nlow, enabling unsophisticated groups to achieve successes, while permitting more advanced groups to conserve better\n\ntechniques for harder targets.\n\nThe lack of a centralized communications hierarchy can make opposition groups responsive, and quick to adapt.\n\nHowever, decentralization also provides many opportunities for digital exploitation. Operators can target groups for long\n\nperiods while remaining unnoticed, without fear of being spotted and blocked by a security team. Even when\n\nexploitation attempts are noticed, because the security of these groups relies on the behavior of individuals, it can be\n\nextremely difficult to ensure that more secure behaviors are adopted.\n\nOpposition groups and their partners face many challenges, and we appreciate the difficulty of securing behavior. The\n\ninfrastructure that we analyzed is, at time of writing, apparently abandoned. However, we suspect that Group5, or the\n\ninterests behind it, may be continuing to pursue efforts to target the opposition. We hope to reinforce the message that\n\ncontinued vigilance is necessary to defend against these operations.\n\n\n-----\n\n# Acknowledgements\n\nWe thank Noura Al-Ameer for collaborating with this investigation, and for graciously agreeing to be included in this\n\nreport. The targeted nature of many cases means that, without the help of brave targets and victims, we are often left\n\nwith a very limited view of what is taking place.\n\nWe are exceptionally grateful to colleagues at Citizen Lab for comments, critical feedback, and assistance with\n\ndocument preparation including Ron Deibert, Bill Marczak, Morgan Marquis-Boire, Sarah McKune, Masashi Nishihata,\n\nIrene Poetranto,Christine Schoellhorn, and Adam Senft.\n\nThanks also to Justin Kosslyn and Brandon Dixon for helpful feedback.\n\nWe would also like to thank the following teams: Lookout, PassiveTotal and RiskIQ, VirusTotal, and Cisco’s AMP Threat\n\nGrid Team for data correlation.\n\nVery special thanks to other investigators who wished to remain anonymous but provided exceptionally helpful\n\nassistance, especially TNG and Tuka.\n\nNote: the night sky image of Syria used as background for several illustrations is from CIMSS at the University of Wisconsin\n\nMadison.\n\n# Appendix A: Windows Malware Analysis\n\nThis section analyzes the malware used by Group5. It walks through the distinct droppers, which range from malicious\n\nOLEs in a PowerPoint Slideshow file (PPSX) combined with an exploit, to executable files directly containing malware.\n\n## Dropper Doc 1 (From E-mail 1)\n\n\nAssadcrimes.ppsx\n\nMD5: 76F8142B4E52C671871B3DF87F10C30C\n\n\nThis slideshow deploys its malicious payload by (ab)using the OLE object embedding capabilities of PowerPoint.[4]\n\nSpecifically, the malware executable is embedded into the slideshow as an OLE Object of type Package:\n\nFigure 18: Adding an OLE Package to a PowerPoint document\n\nOnce embedded, the slideshow “Animation” feature is used to trigger the execution of the object immediately upon\n\nviewing the first slide.\n\nIn one of the malicious PPSX files, we can see the embedded package object by viewing the slides in normal view mode:\n\n\n-----\n\nFigure 19: The malicious OLE Package, visible when editing the PPSX\n\nOnce activated, the embedded object is saved to disk as %TEMP%\\putty.exe, and then executed. This executable is a\n\n.Net downloader.\n\nFigure 20: showing putty.exe (.Net downloader)\n\nIn Figure 20 we can see that the second stage payload is obtained from the URL http://assadcrimes[.]info/1/dvm.exe [Ref\n\n1]. This second stage executable is saved to disk as %temp%\\dwm.exe [Ref 2], and then executed [Ref 3].\n\n\n-----\n\n7d898530d2e77f15f5badce8d7df215e c19bc1ff5f8472fb7ba64f33c2168b42ea881a6ae6e134a1cc142e984fb6647f\n\nThe malware downloaded and executed by the .Net downloader is NanoCore, a well-known RAT (Remote Access\n\nTrojan) that enables the remote monitoring of victims via their computers. The NanoCore binary is wrapped using several\n\nlayers of code obfuscation, which we describe in detail below.\n\n## Deobfuscating the Malware\n\nThe malware was obfuscated first with crypting, followed by packing before being distributed.\n\nWe will unwrap these steps in reverse order below.\n\n**Unpacking**\n\nThe packer used on this executable employs a simple technique of base64 encoding the PE file and breaking it up into\n\nnumerous lines which are then embedded into the resource section of the .Net packer stub file. At runtime, the packer\n\nreverses this process, then invokes the resulting .Net assembly from memory.\n\nFigure 21: Base64 strings found in the resource section of the packed executable.\n\nExtracting this packed code reveals a .Net assembly which is yet another layer of code protection applied using a\n\n‘crypter’. This binary has the following hashes:\n\n**MD5** **SHA256**\n\na4f1f4921bb11ff9d22fad89b19b155d d81ec563387e2ea47bc8ed50fd36e1de955cb2331d6eaae9f966b5d7ab094806\n\n**Decrypting**\n\nThis executable is stub code which performs in-memory AES decryption of a base64 encoded string variable. This string\n\nvariable holds an encrypted copy of the NanoCore RAT binary.\n\n|MD5|SHA256|\n|---|---|\n|a4f1f4921bb11ff9d22fad89b19b155d|d81ec563387e2ea47bc8ed50fd36e1de955cb2331d6eaae9f966b5d7ab094806|\n\n\n-----\n\nFigure 22: the AES decryption routines\n\nThis encryption of the underlying malware is typically employed to bypass detection by endpoint security controls such as\n\nantivirus programs. Many ‘crypter’ tools, as they are known, are available for purchase or trade on various hacking\n\nforums.\n\nOf particular note, this decrypting stub code retained its PDB (short for Program Database) information. PDB file\n\nreferences are common in .Net applications when compiled in ‘debug’ mode, and they frequently reveal the original\n\nfile path of the application source code on the developer’s computer.\n\nThis executable revealed the following PDB file path:\n\n\nc:\\users\\mr.tekide\\documents\\visual studio 2013\\projects\\paccryptnano core dehgani \nvds\\windowsapplication2\\obj\\debug\\launch manager.pdb\n\n\nThis PDB string indicates that ‘mr.tekide’ was the username of the developer who compiled this particular stub, and\n\nfurther that it was compiled as part of a Visual Studio project named ‘paccryptnano core dehgani -vds’. In addition, a\n\nsingle subroutine found inside the decrypting stub was named ‘tekide’. The relevance of this PDB string was discussed\n\nabove in Part 5: Attribution.\n\nIn order to obtain the intended malware payload from this decrypting stub executable, we created a small .Net\n\napplication to mimic the decryption steps and output the file to disk. Once complete, we obtained a malicious\n\nexecutable with hashes:\n\n**MD5** **SHA256**\n\ndd5bedd915967c5efe00733cf7478cb4 a9db5a548ea17d6606bfbdb20306a3a08b38dbfe720f9f709f4d3369288be104\n\n**Original NanoCore binary**\n\nNow that we have arrived at the original NanoCore binary, we can examine the configuration as specified by the\n\n[operator. In order to extract the configuration settings from this copy of NanoCore, we used Kevin Breen’s RATDecoders.](https://github.com/kevthehermit/RATDecoders)\n\nUsing Breen’s tool we arrived at the following configuration:\n\n|MD5|SHA256|\n|---|---|\n|dd5bedd915967c5efe00733cf7478cb4|a9db5a548ea17d6606bfbdb20306a3a08b38dbfe720f9f709f4d3369288be104|\n\n\n-----\n\nFigure 23: The NanoCore configuration, using Kevin Breen’s RATDecoders\n\nNotably, 88.198.222[.]163 port 8081 is the command and control channel for this malware. As noted in Part 1, the same IP\n\nwas also present in the seeding e-mail header.\n\n## Dropper Doc 2\n\n\nassadcrimes1.ppsx\n\nMD5:F1F84EA3229DCA0CCACB7381A2F49F99\n\n\nThis PowerPoint document leverages CVE-2014-4114, a vulnerability in the OLE packager component of the Windows\n\n[operating system. As described in previous reporting, this vulnerability causes a file embedded within the PowerPoint](https://citizenlab.org/2015/06/targeted-attacks-against-tibetan-and-hong-kong-groups-exploiting-cve-2014-4114/)\n\ndocument to be copied to disk and executed silently on vulnerable systems.\n\nThe document under examination drops a file named dvm.gif to disk, renames it to dvm.exe and then executes it. This\n\ndvm.exe is the same packed and crypted copy of NanoCore as retrieved and executed by the .Net downloader\n\ndescribed in the previous section.\n\n## Dropper Doc 3\n\n\nassadcrimes.info.ppsx\n\nMD5: 30BB678DB3AD0140FC33ACD9803385C3\n\n\nThis malicious PowerPoint document uses the same weaponization method described above with respect to Dropper\n\nDoc 1. The executable is embedded as an OLE package object, and subsequently executed using animation actions\n\nwithin the PowerPoint slideshow.\n\n\n-----\n\nFigure 24: The malicious OLE Package, visible when editing the PPSX\n\nAs with Dropper Doc 1, activation of the OLE Package object saves the embedded executable to disk as\n\n%TEMP%\\putty.exe, then executes it. This file is a .Net application employing the same layers and methods of packing\n\nand crypting as seen in the payloads delivered by Dropper Docs 1 and 2. However, the ultimate malware payload in this\n\ncase is njRat, another well-known RAT tool.\n\nAfter unpacking the OLE embedded executable putty.exe, we again arrive at a decrypting stub file which will AES\n\ndecrypt a base64 string variable and run it from memory. The hashes of this file are:\n\n**MD5** **SHA256**\n\n6161083021b695814434450c1882f9f3 d72676bbf8de82486c3cebfdad2961cc68a6b564a43f9f987c95320fcd6a330a\n\nSimilar to the case of Dropper Doc 1 above, we find a PDB entry present in the decrypting stub executable:\n\n|MD5|SHA256|\n|---|---|\n|6161083021b695814434450c1882f9f3|d72676bbf8de82486c3cebfdad2961cc68a6b564a43f9f987c95320fcd6a330a|\n\n\nC:\\Users\\mr.tekide\\Documents\\Visual Studio\n2013\\Projects\\paccrypt11njratmalii\\paccryptalipnahzade\\obj\\Debug\\LManager.pdb\n\n\nAgain we can observe the same username of ‘mr.tekide’ in the project source code path within the PDB string. Further,\n\nwe note the development path components paccrypt11njratmalii and paccryptalipnahzade.\n\nTo obtain the malicious njRat executable from this decrypting stub we used the same .Net program we built for use in the\n\nDropper Doc 1 example above. The resulting njRat binary had the following hashes:\n\n**MD5** **SHA256**\n\nb4121c3a1892332402000ef0d587c0ee 1a287331e2bfb4df9cfe2dab1b77c9b5522e923e52998a2b1934ed8a8e52f3a8\n\nInterestingly, the njRat executable appears to have been compiled from source by the same user who compiled the\n\ncrypter described above. Note the PDB strings found inside the njRat executable:\n\n|MD5|SHA256|\n|---|---|\n|b4121c3a1892332402000ef0d587c0ee|1a287331e2bfb4df9cfe2dab1b77c9b5522e923e52998a2b1934ed8a8e52f3a8|\n\n\nC:\\Users\\mr.tekide\\Documents\\Visual Studio 2013\\Projects\\njrat7stubsoures –\n\nCopy\\njrat7stubsoures\\obj\\Debug\\dvvm.pdb\n\n\nA quick look at the configuration data embedded within this njRat binary reveals the command and control IP address\n\n\n-----\n\nFigure 25: The njRAT configuration, showing the C2 and port.\n\n\n## Decoy Dropper 4\n\n\nalshohadaa alatfal.exe\n\nMD5: 2FC276E1C06C3C78C6D7B66A141213BE\n\n\nThis file is a .Net application designed to act as a decoy by displaying a window depicting images of dead children (see\n\nFigure: 5). While displaying these images, the decoy application also silently extracts an executable file from the .Net\n\nassembly’s resource section, copies it to %TEMP%\\dvm.exe, and then launches a new process from this newly created\n\nfile. See Figure 26 below:\n\n\n-----\n\nFigure 26: Malware dropping code inside the Decoy application\n\nThe dropper also includes a PDB reference:\n\n\nC:\\users\\enterok\\desktop\\slideshow\\slideshow\\obj\\x86\\debug\\alshohadaa alatfal.pdb\n\n\nThe dvm.exe file is itself a .Net executable which is packed using the same .Net packer used above in the cases of\n\nDropper Docs 1 – 3. Once unpacked, the resulting file is the same crypted .Net application analysed above from Dropper\n\nDoc 3, having MD5 hash 6161083021b695814434450c1882f9f3, and containing the njRat payload.\n\n## Malware Infrastructure\n\n**Command and Control Server**\n\nEach of the three distinct RAT tools used by Group5 (njRAT, NanoCore RAT, and DroidJack) were configured to\n\ncommunicate with a single command and control server operating on IP address 88.198.222[.]163.\n\n**IP** **Reverse DNS PTR** **Assignee**\n\n88.198.222[.]163 static.88-198-222-163.clients.your-server.de [HETZNER-RZ-NBG-BLK4]\n\nHetzner Online GmbH\n\nThis server was the sole point of data exfiltration for each of the malware components. As detailed above for njRAT and\n\nNanoCore, and below in Appendix B for DroidJack, the TCP ports used for command and control for each of the RAT\n\ntools were as follows:\n\nFigure 27: RAT ports on the C2 server\n\nAdditionally, we believe a controller for yet another remote access trojan, XpertRAT, was also hosted on this IP in\n\n|IP|Reverse DNS PTR|Assignee|\n|---|---|---|\n|88.198.222[.]163|static.88-198-222-163.clients.your-server.de|HETZNER-RZ-NBG-BLK4 Hetzner Online GmbH|\n\n\n-----\n\np g\n\nHetzner technical personnel subsequent to the discovery of the malicious activity outlined in this report. A synopsis of this\n\ncontact is provided in Appendix F: Notification.\n\nCurrent data available for this IP address suggests that it was likely reprovisioned to a different Hetzner customer in early\n\nFebruary 2016 at the latest, and then possibly again in May. A series of domain names associated with online multi-player\n\n[games were directed to this Hetzner IP, one of which was apparently hosting a malicious HTML document.](https://www.virustotal.com/en/file/dd55d13621a905d0f4c4dfe84c4d2b68769debe7a79cf1ce514940306da47c25/analysis/)\n\n**Assadcrimes Web Hosting**\n\nThe assadcrimes[.]info domain name was registered in June 2015, but it remained parked until early October, at which\n\ntime it was migrated to an Iran-based shared web hosting provider named Hostnegar. This action coincided with the\n\ndelivery of the initial e-mails outlined in Part 1.\n\nThe assadcrimes[.]info website was hosted on a shared hosting platform, and as such the IP address associated was also\n\nshared by a significant number of other, unrelated, websites.\n\n**IP** **Reverse DNS PTR**\n\n212.7.195[.]171 server22.rayanegarco[.]com\n\nHeaders from the initial e-mail are shown below in Figure 28. These headers indicate that the initial e-mail was most likely\n\nsent using the Horde webmail application running on the web hosting server. Furthermore, the headers indicate that the\n\nsender was accessing the webmail application from the IP address of the command and control server discussed above.\n\nFigure 28: Headers from the initial e-mail\n\nFinally, available domain name service data indicates that the assadcrimes[.]info domain name was moved back to its\n\noriginal parked location on May 4, 2016.\n\n# Appendix B: Android Malware Analysis\n\n## The Malicious APK – Overall Description\n\n|IP|Reverse DNS PTR|\n|---|---|\n|212.7.195[.]171|server22.rayanegarco[.]com|\n\n\n-----\n\nFigure 29: The malicious application is installed, and appears in the Apps tab (left), while hidden from the Apps list from\n\nthe Drawer (right)\n\nUpon execution, the malware is installed and then hidden from the list of installed applications in order to remain covert.\n\n\n-----\n\nFigure 30 : The malicious app gives an error ‘App isn’t installed’\n\nwhen the user tries to open the malware before it disappears from the\n\nlist.\n\nAfter the installation, the Application icon will be removed from the installed applications list, yet it will still be running in\n\nthe background.\n\nThe APK package in question had the following characteristics:\n\n\nAdobe_Flash_Player.apk\n\nMD5: 8EBEB3F91CDA8E985A9C61BEB8CDDE9D\n\n\n[This APK is an instance of DroidJack. According to Symantec, this application evolved from an older codebase known as](http://www.symantec.com/connect/blogs/droidjack-rat-tale-how-budding-entrepreneurism-can-turn-cybercrime)\n\nSandroRAT.\n\nThe discovered APK sample also contains references to both names, as shown in Figure 31 below:\n\n\n-----\n\nThe APK Manifest file reveals important information about the sample’s capabilities and the intentions of its operator.\n\nThe Android operating system requires information from the Manifest file before the application can execute. This\n\napplication will request the following permissions and use the following features from the device:\n\nFigure 32: screenshot from Manifest file with the requested permissions for the APK\n\nIn the Android system, Activities are components typically used to let the user of the device perform an action. The Main\n\nActivity is also defined in the Manifest, pictured in Figure 33.\n\nFigure 33: Main activity defined in the manifest\n\nIn this case, the Main Activity is designed to start the Controller as a Service and finish. The controller will be discussed in\n\nmore detail in the next section.\n\nAndroid applications can also have Services and Receivers defined. Services are used for background operations while\n\nReceivers define the types of broadcast messages the application can receive from other applications as well as the\n\ndevice. These messages are known as Intents.\n\nThis APK sample enables several services including “Controller,” “GPSLocation” and “Toaster” (See Figure 34).\n\nFigure 34: Services enabled by the APK\n\nThe Controller class, referred to by the Main Activity and started as a service on the device, handles the malware\n\noperator’s interaction with the application while the GPSLocation class is responsible for obtaining the GPS position from\n\nthe device’s LocationManager. The Toaster class is not implemented in this APK; however, it is implemented in older\n\nSandroRAT samples.\n\nThe APK file has several Receiver classes defined to handle specific messages from the device (See Figure 35).\n\n\n-----\n\nFigure 35: Defined receiver classes\n\nReceiver\n\nUsage\n\nIntent\n\nConnectivity Allows the application to monitor any connectivity changes, including moving between mobile data\n\nChange and Wi-Fi. The constant value is set every time a change occurs.\n\nBoot Allows the application to re-connect when the device restarts. The constant value is broadcast when the\n\nCompleted device finishes booting.\n\nAllows the application to monitor incoming calls. The constant value is set when the call state is\nPhone State\n\nchanged.\n\nThe Connector Receiver simply starts the Controller Service when the phone boots allowing the malware to run in the\n\nbackground upon start up.\n\nThe CallListener Receiver allows the operator to log when the target makes calls, and record calls (if the operator has\n\nenabled it) as an .amr file that can then be sent to the command and control server.\n\nLastly, in the Manifest file, the Application enables two additional Activities, “CAMSNAP” and “VIDEOCAP,” as shown\n\nin Figure 36.\n\nFigure 36: Activities enabling camera and video capture\n\nThese allow the operator to use the infected device’s camera to take pictures and record video. This activity is hidden\n\nfrom the victim using a translucent theme.\n\n**The Malicious APK – The Controller**\n\nAs previously mentioned, the Controller class is ultimately responsible for the rest of the functionality. The instance we\n\nanalyzed was configured to use the same host as the Windows malware for command and control communication:\n\n88.198.222[.]163.\n\n|Receiver Intent|Usage|\n|---|---|\n|Connectivity Change|Allows the application to monitor any connectivity changes, including moving between mobile data and Wi-Fi. The constant value is set every time a change occurs.|\n|Boot Completed|Allows the application to re-connect when the device restarts. The constant value is broadcast when the device finishes booting.|\n|Phone State|Allows the application to monitor incoming calls. The constant value is set when the call state is changed.|\n\n\n-----\n\np\n\nWe were able to install a test instance to learn how the malware’s operator could surveil victims. It is clear that the\n\noperator would have nearly full access to the victim’s information.\n\nFeatures offered include:\n\nFile browsing\n\nSMS and call logging\n\nContacts\n\nBrowser history\n\nApplication Manager\n\nLocation history\n\nWhatsApp Reader (only works on rooted devices)\n\nRemote camera and microphone\n\nFigure 38: DroidJack browsing WhatsApp logs for an infected device.\n\nSome features will only work on rooted devices. For example, the ability to read WhatsApp messages requires the\n\nvictim’s device to be rooted. Android apps are unable to access the data from other applications unless they are\n\nsigned with the same certificate or if the app has been given permission to execute commands as root. If DroidJack is\n\nable to acquire root access it can then upload the database on the device where WhatsApp stores its message history.\n\n# Appendix C: Mr. Tekide\n\nThis appendix provides more context on Mr. Tekide, first delving into how we have identified his crypter (PAC Crypt) in\n\nstrings in the binaries, and second highlighting the results of open source searching for his aliases and related strings.\n\n## Sample Correlation With PDB Strings\n\nIn the Group5 malware samples, we have several PDB file references that suggest that the crypter used with the two\n\ndistinct RAT tools (njRat and NanoCore) was Mr. Tekide’s ‘PAC Crypt’. For the njRat sample from Dropper Doc 3, we\n\ncan see the malware stub was compiled by ‘mr.tekide’ as well.\n\n|Reference: Doc Dropper 1 Crypter|MD5: a4f1f4921bb11ff9d22fad89b19b155d|Compile Time: 9/30/2015 00:02:51|\n|---|---|---|\n|c:\\users\\mr.tekide\\documents\\visual studio 2013\\projects\\paccryptnano core dehgani - vds\\windowsapplication2\\obj\\debug\\launch manager.pdb|||\n\n\n-----\n\nC:\\Users\\mr.tekide\\Documents\\Visual Studio\n\n2013\\Projects\\paccrypt11njratmalii\\paccryptalipnahzade\\obj\\Debug\\LManager.pdb\n\nReference: Doc Dropper 3 njRat\n\nMD5:b4121c3a1892332402000ef0d587c0ee [Compile Time: 10/6/2015]\n\nPayload 01:23:31\n\nC:\\Users\\mr.tekide\\Documents\\Visual Studio 2013\\Projects\\njrat7stubsoures –\n\nCopy\\njrat7stubsoures\\obj\\Debug\\dvvm.pdb\n\nThe Visual Studio project folders listed above suggest the particular version of PAC Crypt compiled by Mr. Tekide was\n\nbeing prepared in one case for an njRat payload, and another for a NanoCore payload. The strings ‘dehgani –vds’,\n\n‘malii’ and ‘alipnahzade’ may have additional significance or relevance.\n\nWe conducted searches across online malware repositories and analysis services (such as VirusTotal, Malwr, and\n\nTotalHash) in an effort to acquire additional data relating to the use of PAC Crypt. These searches revealed very little in\n\nrelation to PAC Crypt specifically, so we instead examined the data for instances of ‘tekide’ related strings found in\n\nPDB files.\n\nIt is our hope that the data or avenue of investigation presented below may be of value to other researchers.\n\nThe results we examined contained over 200 samples which we then clustered into sets based on compile time and PDB\n\nreference as shown in the table below:\n\nThe following compile time / PDB references were also observed in singular instances:\n\n|Reference: Doc Dropper 3 njRat Payload|MD5:b4121c3a1892332402000ef0d587c0ee|Compile Time: 10/6/2015 01:23:31|\n|---|---|---|\n|C:\\Users\\mr.tekide\\Documents\\Visual Studio 2013\\Projects\\njrat7stubsoures – Copy\\njrat7stubsoures\\obj\\Debug\\dvvm.pdb|||\n\n\n-----\n\nKeeping in mind the limitations of reliance on compile times, we nevertheless were able to compare the noted compile\n\ntimes against the first time samples appeared in common malware repositories such as VirusTotal, Malwr, and TotalHash.\n\nIn most instances, samples began to appear in malware repositories within hours of the files being compiled. Dynamic\n\nanalysis of the samples in these sets revealed multiple different payloads and C2 configurations. For example, analysis of\n\nthe samples in Set A yielded the following payloads and configurations:\n\nFinally, analysis of the compile times observed across the acquired samples suggest a period of activity falling in the latter\n\nhalf of 2014. There are many possible explanations as to why so few samples were observed with compile times beyond\n\n2014: conscious removal of PDB information, a change in personal circumstances, or possibly even a shift to less public\n\nmalware development activities.\n\n**Mr. Tekide on the Internet**\n\nMr. Tekide maintains a visible profile across various malware related web forums, as well as on social media. Searches\n\n\n-----\n\nFigure 39: Mr. Tekide showcasing his ‘ashiyane crypter v.7’ on the Ashiyane forums\n\n\n-----\n\nFigure 40: Mr.Tekide’s administrator\n\nprofile on the crypter[.]ir forums\n\n\n-----\n\nFigure 41: PAC Crypt page on the crypter[.]ir online shop\n\n[A link found on the ‘Contact’ page of the crypter[.]ir website led to a Facebook profile in the name of ‘Pezhman](https://www.facebook.com/tekide)\n\n[Blackhat.’ In addition to this Facebook profile, we also identified a LinkedIn profile in which he refers to himself as a](https://ir.linkedin.com/in/pezhman-tekide-a87054bb)\n\n[‘crypter,’ and states that he works for the ashiyane digital security team. He also maintains an Instagram profile.](https://www.instagram.com/tekide/)\n\n# Appendix D: File Hashes\n\n## Full Table of Binaries\n\n|File|MD5|VirusTotal (26-Jul-2016)|First Sub. on VT|\n|---|---|---|---|\n|Dropper Doc 1||||\n|assadcrimes.ppsx|76F8142B4E52C671871B3DF87F10C30C|N/A|N/A|\n|putty.exe [stage1 downloader]|366908F6C5C4F4329478D60586ECA5BC|N/A|N/A|\n|dvm.exe [stage 2 payload]|7D898530D2E77F15F5BADCE8D7DF215E|N/A|N/A|\n|Unpacked dvm.exe|A4F1F4921BB11FF9D22FAD89B19B155D|N/A|N/A|\n|NanoCore RAT payload|DD5BEDD915967C5EFE00733CF7478CB4|N/A|N/A|\n|Dropper Doc 2||||\n|assadcrimes1.ppsx|F1F84EA3229DCA0CCACB7381A2F49F99|N/A|N/A|\n|dvm.exe|7D898530D2E77F15F5BADCE8D7DF215E|N/A|N/A|\n|Dropper Doc 3||||\n|assadcrimes.info.ppsx|30BB678DB3AD0140FC33ACD9803385C3|N/A|N/A|\n|putty.exe|5C4EC3D93A664E4BFA1CE6286CCF0249|N/A|N/A|\n|Unpacked putty.exe|6161083021B695814434450C1882F9F3|N/A|N/A|\n|njRAT payload|B4121C3A1892332402000EF0D587C0EE|N/A|N/A|\n|Decoy Dropper 4||||\n|alshohadaa alatfal.exe [decoy app]|2FC276E1C06C3C78C6D7B66A141213BE|N/A|N/A|\n|dvm.exe [dropped by decoy app]|494BAB7FD0B42B0B14051ED9ABBD651F|14 / 55|2-Mar-2016|\n|Unpacked dvm.exe|6161083021B695814434450C1882F9F3|N/A|N/A|\n\n\n-----\n\nadobe_flash_player.apk 8EBEB3F91CDA8E985A9C61BEB8CDDE9D 23 / 53 5-Jul-2016\n\n[These hashes are also available via the Citizen Lab Github.](https://github.com/citizenlab/malware-signatures/blob/master/Group5/hashes)\n\n# Appendix E: Email Information\n\n**Date** **Sender** **subject** **IP** **Binary attached**\n\n03 Oct 2015 06:05:41 -0700\n\noffice@assadcrimes.info ��� �� ا����ج ���� ا��ان 88.198.222.163 assadcrimes.ppsx\n\n(PDT)\n\n04 Oct 2015 05:47:00 -0700 [ا����ج] [����] [ا��ان] RoundCube\n\noffice@assadcrimes.info [Re: ][��] assadcrimes1.ppsx\n\n(PDT) ��� (212.7.195.171)\n\n# Appendix F: Notification\n\nOn April 12, 2016 we contacted Hetzner via e-mail as well as their abuse form, and informed them that the server was\n\nbeing used to host malware. We also provided network logs as well as a malware sample. We subsequently followed up\n\nwith two phone calls. On a telephone call, a Hetzner representative refused to investigate, stating that they would take\n\nno investigative action before sharing the content of our complaint with the customer, who would then have 24 hours to\n\ntake action. When we suggested that this might result in the deletion of evidence, and highlighted the special nature of\n\nthe case, the representative refused any further action.\n\nFootnotes[1] Noura has given her permission for us to disclose her role in this case, and use her photograph.\n\n2 Mozilla/5.0 (Windows NT 6.3; rv:39.0) Gecko/20100101 Firefox/39.0\n\n3 http://ashiyane[.]org/forums\n\n[4 This technique has been documented previously.](http://phishme.com/powerpoint-and-custom-actions/)\n\n## Post a Comment\n\nYour email is never shared. Required fields are marked *\n\nName *\n\nEmail *\n\nWebsite\n\nComment\n\nPost Comment\n\n[© Citizenlab 2016 | Contact | RSS](https://citizenlab.org/contact)\n\n|Date|Sender|subject|IP|Binary attached|\n|---|---|---|---|---|\n|03 Oct 2015 06:05:41 -0700 (PDT)|office@assadcrimes.info|·Şř Έŉ جñĂĆŕا ŗúŎù ناđūا|88.198.222.163|assadcrimes.ppsx|\n|04 Oct 2015 05:47:00 -0700 (PDT)|office@assadcrimes.info|Re: Έŉ جñĂĆŕا ŗúŎù ناđūا ·Şř|RoundCube (212.7.195.171)|assadcrimes1.ppsx|\n\n\nPost Comment\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.08.02.group5-syria/Group5_%20Syria%20and%20the%20Iranian%20Connection%20-%20The%20Citizen%20Lab.pdf"
    ],
    "report_names": [
        "Group5_ Syria and the Iranian Connection - The Citizen Lab"
    ],
    "threat_actors": [
        {
            "id": "cf0704ab-99e4-44d7-96d9-3cba91339229",
            "created_at": "2022-10-25T15:50:23.485375Z",
            "updated_at": "2025-03-27T02:00:55.482473Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [
                "Group5"
            ],
            "source_name": "MITRE:Group5",
            "tools": [
                "njRAT",
                "NanoCore"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9aa9b489-a297-4dbd-8601-8fc0370201a6",
            "created_at": "2022-10-25T16:07:23.696796Z",
            "updated_at": "2025-03-27T02:02:09.928416Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [],
            "source_name": "ETDA:Group5",
            "tools": [
                "Atros2.CKPN",
                "Bladabindi",
                "DroidJack",
                "Jorik",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "59c9f31b-e032-44b9-bf3b-4f2cb3d17e39",
            "created_at": "2022-10-25T16:07:23.734244Z",
            "updated_at": "2025-03-27T02:02:09.952685Z",
            "deleted_at": null,
            "main_name": "Infy",
            "aliases": [
                "APT-C-07",
                "Infy",
                "Operation Mermaid",
                "Prince of Persia"
            ],
            "source_name": "ETDA:Infy",
            "tools": [
                "Foudre",
                "Infy",
                "Tonnerre"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9663cdbf-646e-4579-881a-a8ebc3aabf63",
            "created_at": "2023-01-06T13:46:38.360862Z",
            "updated_at": "2025-03-27T02:00:02.814167Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "ITsecTeam"
            ],
            "source_name": "MISPGALAXY:Cutting Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f498e6b-3f0e-4f26-8cc7-52121e675643",
            "created_at": "2023-01-06T13:46:38.447274Z",
            "updated_at": "2025-03-27T02:00:02.835821Z",
            "deleted_at": null,
            "main_name": "Deadeye Jackal",
            "aliases": [
                "SyrianElectronicArmy"
            ],
            "source_name": "MISPGALAXY:Deadeye Jackal",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "094d8210-4c64-4457-ad97-a94fc7af7630",
            "created_at": "2023-01-06T13:46:38.98103Z",
            "updated_at": "2025-03-27T02:00:02.968603Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [
                "G0043"
            ],
            "source_name": "MISPGALAXY:Group5",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "76fc6d92-0710-4640-bfa7-3000fe3940a5",
            "created_at": "2022-10-25T16:07:24.251595Z",
            "updated_at": "2025-03-27T02:02:10.151254Z",
            "deleted_at": null,
            "main_name": "Syrian Electronic Army (SEA)",
            "aliases": [
                "ATK 196",
                "Deadeye Jackal",
                "Syria Malware Team",
                "Syrian Electronic Army",
                "TAG-CT2"
            ],
            "source_name": "ETDA:Syrian Electronic Army (SEA)",
            "tools": [
                "AndoServer",
                "CypherRat",
                "SLRat",
                "SandroRAT",
                "SilverHawk",
                "SpyNote",
                "SpyNote RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f763fd1f-f697-40eb-a082-df6fd3d13cb1",
            "created_at": "2023-01-06T13:46:38.561288Z",
            "updated_at": "2025-03-27T02:00:02.861874Z",
            "deleted_at": null,
            "main_name": "Infy",
            "aliases": [
                "Operation Mermaid",
                "Prince of Persia",
                "Foudre"
            ],
            "source_name": "MISPGALAXY:Infy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1470189370,
    "ts_modification_date": 1470189370,
    "files": {
        "pdf": "https://archive.orkl.eu/3939d4a4048e0ad0e4416e32763c8f69dc83af56.pdf",
        "text": "https://archive.orkl.eu/3939d4a4048e0ad0e4416e32763c8f69dc83af56.txt",
        "img": "https://archive.orkl.eu/3939d4a4048e0ad0e4416e32763c8f69dc83af56.jpg"
    }
}