{
    "id": "4057b4c6-68c2-4a31-9656-e27b63fb2aca",
    "created_at": "2023-01-12T15:07:59.884346Z",
    "updated_at": "2025-03-27T02:16:34.672532Z",
    "deleted_at": null,
    "sha1_hash": "9c4b8e2665c0b8089b08b85c7a75e4615a68d597",
    "title": "2020-05-26 - Alert (AA21-116A)- Russian Foreign Intelligence Service (SVR) Cyber Operations- Trends and Best Practices for Network Defenders",
    "authors": "",
    "file_creation_date": "2022-05-29T01:04:54Z",
    "file_modification_date": "2022-05-29T01:04:54Z",
    "file_size": 91732,
    "plain_text": "# Russian Foreign Intelligence Service (SVR) Cyber Operations: Trends and Best Practices for Network Defenders\n\n**us-cert.cisa.gov/ncas/alerts/aa21-116a**\n\n## Summary\n\nThe Federal Bureau of Investigation (FBI), Department of Homeland Security (DHS), and\nCybersecurity and Infrastructure Security Agency (CISA) assess Russian Foreign\nIntelligence Service (SVR) cyber actors—also known as Advanced Persistent Threat 29\n(APT 29), the Dukes, CozyBear, and Yttrium—will continue to seek intelligence from U.S.\nand foreign entities through cyber exploitation, using a range of initial exploitation techniques\nthat vary in sophistication, coupled with stealthy intrusion tradecraft within compromised\nnetworks. The SVR primarily targets government networks, think tank and policy analysis\norganizations, and information technology companies. On April 15, 2021, the White House\nreleased a statement on the recent SolarWinds compromise, attributing the activity to the\nSVR. For additional detailed information on identified vulnerabilities and mitigations, see the\nNational Security Agency (NSA), Cybersecurity and Infrastructure Security Agency (CISA),\nand FBI Cybersecurity Advisory titled “Russian SVR Targets U.S. and Allied Networks,”\nreleased on April 15, 2021.\n\nThe FBI and DHS are providing information on the SVR’s cyber tools, targets, techniques,\nand capabilities to aid organizations in conducting their own investigations and securing their\nnetworks.\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/publications/AA21-116A_Russian_Foreign_Intelligence_Service_Cyber_Operations_508C.pdf)\n\n## Threat Overview\n\nSVR cyber operations have posed a longstanding threat to the United States. Prior to 2018,\nseveral private cyber security companies published reports about APT 29 operations to\nobtain access to victim networks and steal information, highlighting the use of customized\ntools to maximize stealth inside victim networks and APT 29 actors’ ability to move within\nvictim environments undetected.\n\nBeginning in 2018, the FBI observed the SVR shift from using malware on victim networks to\ntargeting cloud resources, particularly e-mail, to obtain information. The exploitation of\nMicrosoft Office 365 environments following network access gained through use of modified\nSolarWinds software reflects this continuing trend. Targeting cloud resources probably\nreduces the likelihood of detection by using compromised accounts or system\nmisconfigurations to blend in with normal or unmonitored traffic in an environment not well\ndefended monitored or understood by victim organizations\n\n\n-----\n\n## Technical Details\n\n SVR Cyber Operations Tactics, Techniques, and Procedures\n\n Password Spraying\n\nIn one 2018 compromise of a large network, SVR cyber actors used password spraying to\nidentify a weak password associated with an administrative account. The actors conducted\nthe password spraying activity in a “low and slow” manner, attempting a small number of\npasswords at infrequent intervals, possibly to avoid detection. The password spraying used a\nlarge number of IP addresses all located in the same country as the victim, including those\nassociated with residential, commercial, mobile, and The Onion Router (TOR) addresses.\n\nThe organization unintentionally exempted the compromised administrator’s account from\nmulti-factor authentication requirements. With access to the administrative account, the\nactors modified permissions of specific e-mail accounts on the network, allowing any\nauthenticated network user to read those accounts.\n\nThe actors also used the misconfiguration for compromised non-administrative accounts.\nThat misconfiguration enabled logins using legacy single-factor authentication on devices\nwhich did not support multi-factor authentication. The FBI suspects this was achieved by\nspoofing user agent strings to appear to be older versions of mail clients, including Apple’s\nmail client and old versions of Microsoft Outlook. After logging in as a non-administrative\nuser, the actors used the permission changes applied by the compromised administrative\nuser to access specific mailboxes of interest within the victim organization.\n\nWhile the password sprays were conducted from many different IP addresses, once the\nactors obtained access to an account, that compromised account was generally only\naccessed from a single IP address corresponding to a leased virtual private server (VPS).\nThe FBI observed minimal overlap between the VPSs used for different compromised\naccounts, and each leased server used to conduct follow-on actions was in the same country\nas the victim organization.\n\nDuring the period of their access, the actors consistently logged into the administrative\naccount to modify account permissions, including removing their access to accounts\npresumed to no longer be of interest, or adding permissions to additional accounts.\n\n**_Recommendations_**\n\nTo defend from this technique, the FBI and DHS recommend network operators to follow\nbest practices for configuring access to cloud computing environments, including:\n\nMandatory use of an approved multi-factor authentication solution for all users from\nboth on premises and remote locations.\n\n\n-----\n\nProhibit remote access to administrative functions and resources from IP addresses\nand systems not owned by the organization.\nRegular audits of mailbox settings, account permissions, and mail forwarding rules for\nevidence of unauthorized changes.\nWhere possible, enforce the use of strong passwords and prevent the use of easily\nguessed or commonly used passwords through technical means, especially for\nadministrative accounts.\nRegularly review the organization’s password management program.\nEnsure the organization’s information technology (IT) support team has welldocumented standard operating procedures for password resets of user account\nlockouts.\nMaintain a regular cadence of security awareness training for all company employees.\n\n## Leveraging Zero-Day Vulnerability\n\nIn a separate incident, SVR actors used CVE-2019-19781, a zero-day exploit at the time,\nagainst a virtual private network (VPN) appliance to obtain network access. Following\nexploitation of the device in a way that exposed user credentials, the actors identified and\nauthenticated to systems on the network using the exposed credentials.\n\nThe actors worked to establish a foothold on several different systems that were not\nconfigured to require multi-factor authentication and attempted to access web-based\nresources in specific areas of the network in line with information of interest to a foreign\nintelligence service.\n\nFollowing initial discovery, the victim attempted to evict the actors. However, the victim had\nnot identified the initial point of access, and the actors used the same VPN appliance\nvulnerability to regain access. Eventually, the initial access point was identified, removed\nfrom the network, and the actors were evicted. As in the previous case, the actors used\ndedicated VPSs located in the same country as the victim, probably to make it appear that\nthe network traffic was not anomalous with normal activity.\n\n**_Recommendations_**\n\nTo defend from this technique, the FBI and DHS recommend network defenders ensure\nendpoint monitoring solutions are configured to identify evidence of lateral movement within\nthe network and:\n\nMonitor the network for evidence of encoded PowerShell commands and execution of\nnetwork scanning tools, such as NMAP.\nEnsure host based anti-virus/endpoint monitoring solutions are enabled and set to alert\nif monitoring or reporting is disabled, or if communication is lost with a host agent for\nmore than a reasonable amount of time.\nRequire use of multi-factor authentication to access internal systems.\n\n\n-----\n\nImmediately configure newly-added systems to the network, including those used for\ntesting or development work, to follow the organization’s security baseline and\nincorporate into enterprise monitoring tools.\n\n## WELLMESS Malware\n\nIn 2020, the governments of the United Kingdom, Canada, and the United States attributed\nintrusions perpetrated using malware known as WELLMESS to APT 29. WELLMESS was\nwritten in the Go programming language, and the previously-identified activity appeared to\nfocus on targeting COVID-19 vaccine development. The FBI’s investigation revealed that\nfollowing initial compromise of a network—normally through an unpatched, publicly-known\nvulnerability—the actors deployed WELLMESS. Once on the network, the actors targeted\neach organization’s vaccine research repository and Active Directory servers. These\nintrusions, which mostly relied on targeting on-premises network resources, were a\ndeparture from historic tradecraft, and likely indicate new ways the actors are evolving in the\nvirtual environment. More information about the specifics of the malware used in this\nintrusion have been previously released and are referenced in the ‘Resources’ section of this\ndocument.\n\n## Tradecraft Similarities of SolarWinds-enabled Intrusions\n\nDuring the spring and summer of 2020, using modified SolarWinds network monitoring\nsoftware as an initial intrusion vector, SVR cyber operators began to expand their access to\nnumerous networks. The SVR’s modification and use of trusted SolarWinds products as an\nintrusion vector is also a notable departure from the SVR’s historic tradecraft.\n\nThe FBI’s initial findings indicate similar post-infection tradecraft with other SVR-sponsored\nintrusions, including how the actors purchased and managed infrastructure used in the\nintrusions. After obtaining access to victim networks, SVR cyber actors moved through the\nnetworks to obtain access to e-mail accounts. Targeted accounts at multiple victim\norganizations included accounts associated with IT staff. The FBI suspects the actors\nmonitored IT staff to collect useful information about the victim networks, determine if victims\nhad detected the intrusions, and evade eviction actions.\n\n**_Recommendations_**\n\nAlthough defending a network from a compromise of trusted software is difficult, some\norganizations successfully detected and prevented follow-on exploitation activity from the\ninitial malicious SolarWinds software. This was achieved using a variety of monitoring\ntechniques including:\n\nAuditing log files to identify attempts to access privileged certificates and creation of\nfake identify providers.\nDeploying software to identify suspicious behavior on systems, including the execution\nof encoded PowerShell\n\n\n-----\n\nDeploying endpoint protection systems with the ability to monitor for behavioral\nindicators of compromise.\nUsing available public resources to identify credential abuse within cloud environments.\nConfiguring authentication mechanisms to confirm certain user activities on systems,\nincluding registering new devices.\n\nWhile few victim organizations were able to identify the initial access vector as SolarWinds\nsoftware, some were able to correlate different alerts to identify unauthorized activity. The\nFBI and DHS believe those indicators, coupled with stronger network segmentation\n(particularly “zero trust” architectures or limited trust between identity providers) and log\ncorrelation, can enable network defenders to identify suspicious activity requiring additional\ninvestigation.\n\n## General Tradecraft Observations\n\nSVR cyber operators are capable adversaries. In addition to the techniques described\nabove, FBI investigations have revealed infrastructure used in the intrusions is frequently\nobtained using false identities and cryptocurrencies. VPS infrastructure is often procured\nfrom a network of VPS resellers. These false identities are usually supported by low\nreputation infrastructure including temporary e-mail accounts and temporary voice over\ninternet protocol (VoIP) telephone numbers. While not exclusively used by SVR cyber actors,\na number of SVR cyber personas use e-mail services hosted on cock[.]li or related domains.\n\nThe FBI also notes SVR cyber operators have used open source or commercially available\ntools continuously, including Mimikatz—an open source credential-dumping too—and Cobalt\nStrike—a commercially available exploitation tool.\n\n## Mitigations\n\nThe FBI and DHS recommend service providers strengthen their user validation and\nverification systems to prohibit misuse of their services.\n\n## Resources\n\nNSA, CISA, FBI Joint Cybersecurity Advisory: Russian SVR Targets U.S. and Allied\nNetworks\nCISA: Remediating Networks Affected by the SolarWinds and Active Directory/M365\nCompromise\nCISA Alert AA21-008A: Detecting Post-Compromise Threat Activity in Microsoft Cloud\nEnvironments\nFBI, CISA, ODNI, NSA Joint Statement: Joint Statement by the Federal Bureau of\n[Investigation, the Cybersecurity and Infrastructure Security Agency, the Office of the](https://www.odni.gov/index.php/newsroom/press-releases/press-releases-2021/item/2176-joint-statement-by-the-federal-bureau-of-investigation-fbi-the-cybersecurity-and-infrastructure-security-agency-cisa-the-office-of-the-director-of-national-intelligence-odni-and-the-national-security-agency-nsa)\nDirector of National Intelligence (ODNI), and the National Security Agency\n\n\n-----\n\nCISA Alert AA20-352A: Advanced Persistent Threat Compromise of Government\nAgencies, Critical Infrastructure, and Private Sector Organizations\nCISA Insights: What Every Leader Needs to Know about the Ongoing APT Cyber\nActivity\nFBI, CISA Joint Cybersecurity Advisory: Advanced Persistent Threat Actors Targeting\nU.S. Think Tanks\nCISA: [Malicious Activity Targeting COVID-19 Research, Vaccine Development](https://us-cert.cisa.gov/ncas/current-activity/2020/07/16/malicious-activity-targeting-covid-19-research-vaccine-development)\nNCSC, CSE, NSA, CISA Advisory: [APT 29 targets COVID-19 vaccine development](https://media.defense.gov/2020/Jul/16/2002457639/-1/-1/0/NCSC_APT29_ADVISORY-QUAD-OFFICIAL-20200709-1810.PDF)\n\n## Revisions\n\nApril 26, 2021: Initial Version\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-26 - Alert (AA21-116A)- Russian Foreign Intelligence Service (SVR) Cyber Operations- Trends and Best Practices for Network Defenders.pdf"
    ],
    "report_names": [
        "2020-05-26 - Alert (AA21-116A)- Russian Foreign Intelligence Service (SVR) Cyber Operations- Trends and Best Practices for Network Defenders.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536079,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653786294,
    "ts_modification_date": 1653786294,
    "files": {
        "pdf": "https://archive.orkl.eu/9c4b8e2665c0b8089b08b85c7a75e4615a68d597.pdf",
        "text": "https://archive.orkl.eu/9c4b8e2665c0b8089b08b85c7a75e4615a68d597.txt",
        "img": "https://archive.orkl.eu/9c4b8e2665c0b8089b08b85c7a75e4615a68d597.jpg"
    }
}