{
    "id": "406d2512-cfb6-462e-af31-8be5dc59026e",
    "created_at": "2023-01-12T15:10:22.0104Z",
    "updated_at": "2025-03-27T02:11:24.408955Z",
    "deleted_at": null,
    "sha1_hash": "59c5559ffc436aa28dcdcb2a3dd8ed7c4384a189",
    "title": "2021-07-22 - Malware increasingly targets Discord for abuse",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:42Z",
    "file_modification_date": "2022-05-28T01:22:42Z",
    "file_size": 3986911,
    "plain_text": "# Malware increasingly targets Discord for abuse\n\n**[news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse](https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse)**\n\nJuly 22, 2021\n\nThreat actors who spread and manage malware have long abused legitimate online services.\n[As we found during our investigation into the use of TLS by malware, more than half of](https://news.sophos.com/en-us/2021/04/21/nearly-half-of-malware-now-use-tls-to-conceal-communications/)\nnetwork traffic generated by malware uses TLS encryption, and 20 percent of that involved\nthe malware communicating with legitimate online services.\n\nDuring the timeframe of that research, we found that four percent of the overall TLSprotected malware downloads came from one service in particular: Discord. The growing\npopularity of the game-centric text and voice chat platform has not failed to draw the\nattention of malware operators.\n\nDiscord operates its own content delivery network, or CDN, where users can upload files to\nshare with others. The service also publishes an API, enabling developers to create new\nways to interact with Discord other than through its client application. We observed\nsignificant volumes of malware hosted in Discord’s own CDN, as well as malware interacting\nwith Discord APIs to send and receive data.\n\n\n-----\n\nA\n\nvisualization of just a small portion of the malware files hosted on Discord’s content delivery\nnetwork (CDN). Red-colored entries are files determined to be malicious.\nSeveral password-hijacking malware families specifically target Discord accounts.\nSophosLabs also found malware that leveraged Discord chat bot APIs for command and\ncontrol, or to exfiltrate stolen information into private Discord servers or channels.\n\nAs the origins of the service were tied to online gaming, Discord’s audience includes large\nnumbers of gamers—including players of youth-oriented titles such as Fortnite, Minecraft, or\nRoblox. Among the malicious files we discovered in Discord’s network, we found game\ncheating tools that target games that integrate with Discord, in-game. The tools allegedly\nmake it possible, exploiting weaknesses in Discord’s protocols, for one player to crash the\ngame of another player. We also found applications that serve as nothing more than\nharmless, though disruptive, pranks.\n\nBut the greatest percentage of the malware we found have a focus on credential and\npersonal information theft, a wide variety of stealer malware as well as more versatile RATs.\nThe threat actors behind these operations employed social engineering to spread credentialstealing malware, then use the victims’ harvested Discord credentials to target additional\nDiscord users.\n\nWe also encountered several ransomware families hosted in the Discord CDN—largely older\nones, usable only to cause harm, as there’s no longer a way to pay the ransom. Files hosted\non Discord also included multiple Android malware packages, ranging from spyware to fake\napps that steal financial information or transactions.\n\n\n-----\n\n## Growing abuse of all kinds\n\nAbuse of Discord, like abuse of any web-based service, is not a new phenomenon, but it is a\nrapidly growing one: Sophos products detected and blocked, just in the past two months,\nnearly 140 times the number of detections over the same period in 2020. In April, we\nreported over 9,500 unique URLs hosting malware on Discord’s CDN to Discord\nrepresentatives.\n\nIn the second quarter, we detected 17,000 unique URLs in Discord’s CDN pointing to\nmalware. And this excludes the malware not hosted within Discord that leverage Discord’s\napplication interfaces in various ways. At just prior to publication time, more than 4,700 of\nthose URLs, pointing to a malicious Windows .exe file, remained active.\n\nThe reasons for that growth seem pretty easy to understand. Discord provides a persistent,\nhighly-available, global distribution network that malware operators can take advantage of,\nas well as a messaging API that can be adapted easily to malware command and control—\nmuch in the way Internet Relay Chat, and more recently Slack and Telegram, have been\nused as C2 channels.\n\nIt also provides an ever-growing, target-rich environment for scammers and malware\noperators to spread malicious code to steal personal information and credentials through\nsocial engineering. And some Discord users clearly seek to use the platform to harm others’\ncomputers out of spite rather than for financial gain.\n\nDiscord is not the only service being abused by malware distributors and scammers by any\nmeans, and the company is responsive to take-down requests. But Discord users should\nremain vigilant to the threat of malicious content on the service, and defenders should never\nconsider any traffic from a cloud service as inherently “safe” based on the legitimacy of the\nservice itself.\n\nUsing the most recent telemetry data, we were able to retrieve thousands of unique malware\nsamples and more than 400 archive files from these URLs—a count that does not represent\nthe whole corpus of malware, as it does not include files that were removed by Discord (or by\nthe actors who originally uploaded them). These have been disclosed to Discord, and the\nmajority of them have since been removed; however, new malware continues to be posted\ninto Discord’s CDN, and we continue to find malware using Discord as a command and\ncontrol network.\n\n\n-----\n\n## The wrong kind of boost\n\nDiscord is a cloud-based service optimized for high volumes of text and voice messaging\nwithin communities of interest. Discord gets revenue from premium services delivered\nthrough the platform, including “server boosts” that allow groups to increase the performance\nof their server instances’ live streaming and voice chat and add custom features.\n\nBut the basic platform—which includes access to the Discord application programming\ninterface (API)—is free. Discord servers, including the free ones, can also be configured to\ninteract with third-party applications—bots that post content to server channels, apps that\nprovide additional functionality built on top of Discord, and games that directly connect to\nDiscord’s messaging platform.\n\nDiscord’s “servers” are Google Cloud instances of Elixir Erlang virtual machines, front-ended\nby Cloudflare. Servers can be public or private—a server “owner” can require invite keys for\nindividuals to join the server’s channels and access content.\n\nOne of the less harmful “prank” executables, presented as a crack tool for the game\nCounter-Strike: Global Offensive, fills the screen with messages taunting the user who\ndownloaded and ran it\n\n\n-----\n\nIn addition to message and stream routing, Discord also acts as a content delivery network\nfor digital content of all types. In its simplest form, that content is message attachments—\nfiles that are uploaded by Discord users into chat or private messages. Discord uses Google\nCloud Storage to store file attachments; once a file has been uploaded as part of a message,\nit is accessible from anywhere on the web via a URL representing a storage object address.\nLike Discord’s server instances, the storage objects are front ended by Cloudflare.\n\nThis architecture makes Discord scalable enough to handle its hundreds of millions of active\nusers, and resilient against denial-of-service attacks—a plus for dealing with the gaming\ncommunity. It also makes it an ideal platform for abuse by malicious actors. Once files are\nuploaded to Discord, they can persist indefinitely unless reported or deleted.\n\nWhile Discord has some malware screening capabilities, many types of malicious content\nslip by without notice. And when users get caught, they can burn their account and create a\nnew one. Discord relies heavily on user reports to police abuse. But when the Discord\narchitecture is used for activities that are limited to targets not necessarily within the Discord\nuser community, they can go unreported and persist for months.\n\n## Gaming the gamers\n\nOne of the primary ways we’ve observed malware being deployed from Discord’s CDN is\nthrough social engineering—using chat channels or private messages to post files or\nexternal links with deceiving descriptions as a lure to get others to download and execute\nthem. We found many files whose names suggested they served some function for gamers,\nand some in fact were: game cheats, game “enhancements” that claimed to be able to\nunlock paid content, license key generators and bypasses. But while some were actually\nwhat was advertised, the vast majority of them were in fact hacks of another kind—intended\nfor one form or another of credential theft.\n\nA significant percentage of these credential stealers target Discord itself. Discord token\nloggers steal the OAuth tokens used to authenticate Discord users, frequently along with\nother credential data and system information—including tokens for Steam and other gaming\nplatforms. They “log” stolen tokens back to a Discord channel through a webhook\nconnection, allowing their operators to collect the OAuth tokens and attempt to hijack access\nto the accounts.\n\nThe learning curve for building a token logger is not very steep. A Python-based proof-ofconcept token logger can be found on GitHub and easily turned into an executable\ncustomized to communicate with the server of the malware operator’s choice. One active\ntoken logger campaign has been spread through an ongoing social engineering scam\nleveraging stolen accounts, asking users to test a game in development. The “game” is a\ncompiled Python script similar to the proof of concept.\n\n\n-----\n\nThe icon for the “game” that is actually a Discord account stealer.\n\nOnce credentials are stolen, they are often used to continue to steal other credentials\nthrough social engineering. The token logger also collects machine fingerprint data, and\nattempts to scrape other cookies and credential tokens from the target’s machine as well, so\nthere may be more damage done than just the loss of an account.\n\nAnother stealer, named PirateMonsterInjector by its author, uses Discord’s own API to dump\nDiscord OAuth tokens and other stolen information back to a private Discord server chat. It\ndoes this by retrieving JavaScript from a malicious website (monster[.]casa) that contains\nDiscord API code and scrapes data from the system related to Discord and other\napplications.\n\nThe malware errors out looking for Discord data on a machine not running Discord. On a\nWindows system with Discord present, it logged the user out and restarted Discord after\nstealing the OAuth token for the account.\n\n\n-----\n\nThe homepage of the Cloudflare-protected site connected to by the malware. The “Join our\ndiscord” link contains an invalid Discord invite code.\n\nObfuscated JavaScript from the site run by the malware looks for credential data associated\n\n\n-----\n\nwith Discord and other sites, in addition to system information, and sends it back to a Discord\nchannel.\nOther credential-stealing schemes go further. Several of the malware files also pulled down\npayload executables and/or DLLs which they then used to engage in a more wide-ranging\ndata theft.\n\nURLs in traffic from one Discord-delivered\n\ndropper retrieving additional payloads.\nScattered among the files were many copies of a widely-used stealer malware known as\nAgent Tesla. In one example, the initial file that spread the infection was named\nPURCHASE_ORDER_1_1.exe. It’s not unusual for Agent Tesla malware to download\npayloads as part of its infection process, but it was unexpected to find that the payload was\nalso hosted in DIscord’s CDN.\n\nThe network traffic from the “Purchase Order” AgentTesla.\nThe malware pulled down a payload executable named midnight.exe directly from the CDN,\nand executed it. That payload, in turn, downloaded a DLL named TextEditor.dll from a\ndifferent website, and injected it into a running system process. (We’ve previously written\nabout Agent Tesla’s capabilities.)\n\nIn another instance, we found a malicious installer of a modified version of Minecraft. The\ninstaller actually does deliver a full version of the ubiquitous creative block-building game,\nbut with a twist. Disguised as a “mod” with special features called Saint, the Minecraft\ninstaller bundled a Java application that was capable of capturing keystrokes and\nscreenshots from the target’s system, as well as images from the camera on the infected\ncomputer. The Java classes inside the file are an unmistakable indication of the malware’s\ncapabilities.\n\n\n-----\n\nThe contents of the “Minecraft” malware.\nWe found many instances of information stealing malware and backdoors using file names\nthat indicated they were used as part of soclal engineering campaigns. A file called\n**fortniat.exe, advertised as a “multitool for FortNite,” was actually a malware packer that**\ndrops a Meterpreter backdoor.\n\nThe reassuring screen shown victims as they run a malware installer.\nAnother malware sample we found advertised itself as an installer for Browzar, a privacyoriented web browser. But while it installed the browser, it also dropped an Agent Tesla\ninfostealer.\n\n\n-----\n\nWhen the error message pops up, Agent Tesla has stolen your information.\nThere were also collections of files that purport to install cracked versions of popular (but\nexpensive) commercial software, such as Adobe Photoshop. And, of course, there were\ntools that claim to give the user access to the paid features of Discord Nitro, the service’s\npremium edition.\n\n## ‘Nitrogen’ Discord key generators\n\nAt least fifty of the files in the collection were named to imply they could either unlock the\nfeatures of Discord Nitro on an account belonging to a user who hasn’t subscribed to the\n$100/year service, or generate “gift codes” that award a one-month Nitro upgrade. Many of\nthe tools refer to themselves as a “nitrogen” utility, a concatenation of Nitro and “code\ngenerator.”\n\n\n-----\n\nWhile a few of the files generated codes that resemble those used to upgrade a standard\nDiscord account to the Discord Nitro version, most did not. One of the samples drops a batch\nscript that attempts to delete registry keys and terminate the processes or services of dozens\nof endpoint security tools. This “antiav.bat” script runs from the %TEMP% directory on the\nsystem immediately after the user launches the program.\n\n\n-----\n\nThe same “nitrogen” utility’s batch script disabled a number of key Windows security\nfeatures, evidenced by the fact that Windows prompts the user to reboot the computer “to\nturn off User Account Control,” the feature that prompts a Windows user to permit an\napplication to run with elevated privileges. Without UAC, executables can run with\nadministrative privileges without requiring the user to allow it.\n\n\n-----\n\nDiscordNitroGemerator.exe loads a batch script that disables a large number of Windows\nservices related to security and endpoint protection tools\nMany of the programs used a variety of methods to profile the infected system and generate\na data file they attempt to upload to a command-and-control server. Because so many of the\nfiles had been there for months, the destination servers did not respond, but we could\nobserve the profiling data being written to the hard drive.\n\nIn addition to profiling the system, many of the samples attempted to retrieve browser\n“tokens” that would permit their operators to log in to Discord using the victim’s account, or\ninstalled keystroke logger components that monitored for user input and attempted to pass it\nalong to a command and control server. Most of the token stealers failed to retrieve a token\n\n\n-----\n\nfrom the testbed because the only credentials used for Discord on the test system were used\nin the Discord Windows app; The faux victim had never logged in to the service using the\nbrowser.\n\nIn many cases, these token values were sent directly to other Discord channels or user\naccounts through the use of Discord’s own API, by means of an HTTPS POST request to a\nspecific URL on Discord. Occasionally, we’d also stumble across a malware that attempted\nto send the data to a channel on Slack.\n\nSome of these “token stealer” malware include the victim’s avatar graphic, and their publicfacing IP address, which they retrieved using services like ifconfig.me, ipify.org,\n**iplogger.com, or wtfismyip.com. These more sophisticated stealers were able to extract**\nthe token from the Discord client application, not just the browser.\n\nThe stealer would then produce a nicely formatted submission to a specific Discord channel\nURL.\n\nSome of the stealers attempted to download a malicious Visual Basic Script file directly from\nGithub or from Pastebin. Fortunately, in those cases, the sites had already locked or taken\ndown the payload script, so the stealer failed to complete its task.\n\n## Ransomware as a prank?\n\n\n-----\n\nThere were other malware distributed via Discord labeled with gaming-related names that\nwere clearly intended just to harm the computers of others. O And a file labeled\n“Roblox_hack.exe” actually carried a variant of WinLock ransomware, one of several\nransomware variants we found in Discord’s CDN. Rather than encrypting files, this\nransomware locks the victim out of the desktop environment.\n\nWinLock declares “Windows is blocked!”\nAnother family of screen locker malware was also widely represented in Discord’s CDN is\nSomhoveran / LockScreen, which adds a countdown to the ransom threat. Somhoveran uses\nWindows Management Instrumentation to collect a “fingerprint” of the affected system, and\ndisplays some of that data on the screen.\n\n\n-----\n\nThere is one even nastier old ransomware sample we found in Discord’s CDN: Petya, a\ncrypto-ransomware first seen in 2016.\n\n\n-----\n\n-----\n\nSince the Tor site for Petya is dead, it’s not clear if this file was shared with the intent of\nextortion, or if it was meant to simply disable the recipient’s computer. Most antimalware\nproducts (including Windows Defender) will block Petya, so this is a curiosity more than a\nthreat for the majority of Windows machines—but it’s still potentially hazardous to older\ncomputers and in the hands of someone who is convinced it needs to run to improve game\nperformance.\n\n## Android malware\n\nDiscord’s malware problem isn’t just Windows-based. Hunting through telemetry, we found\n58 unique malicious apps that can be run on Android devices. These included a number of\nbanking-focused malware and spyware, as indicated by the Sophos detections below:\n\nAndr/Banker-GTV 41\n\nAndr/Banker-GZA 1\n\n\n-----\n\nAndr/Banker-HAC 4\n\nAndr/FakeApp-BK 1\n\nAndr/Xgen2-LP 1\n\nAndr/Xgen2-XN 1\n\nAndr/Xgen2-XP 3\n\nAndr/Xgen2-YD 2\n\nIn our 90 day telemetry lookback, we found 205 URLs on the Discord domain pointing to\nAndroid .apk executables (with multiple, redundant links to duplicate files). After reporting the\nlist to Discord, the service took down the files, but a subsequent query a few weeks later\nshowed that more appeared in the meantime.\n\n\n-----\n\nMalicious Android APK apps retrieved from\n\nDiscord\nAmong those remaining available just prior to publication were an app that performs\nfraudulent ad-clicking (classified as Andr/Hiddad-P); apps that drop other malware\n(Andr/Dropr-IC and Andr/Dropr-IO) on the device; backdoors that permit a remote attacker to\naccess the victim’s mobile device, including one that was transparently a Metasploit\nframework Meterpreter (Andr/Bckdr-RXM and Andr/Spy-AZW); and a copy of the Anubis\nbanker Trojan (Andr/Banker-GTV) that intercepts and forwards the credentials for online\nfinancial transactions to criminals.\n\n\n-----\n\nOne malicious app wanted to be a device\n\nadmin, with serious consequences\nThe Android malware files were given names and icons that could lead someone to believe\nthey are legitimate banking or game updater apps. One of the apps appeared to use the icon\nand name of a COVID-19 contact tracing app. Several generated popups within the device\nthat demanded that the user activate them as a “device admin,” which gives the apps neartotal control over the device.\n\n\n-----\n\n## Attack tools targeting Discord users\n\nLike any developer-friendly platform, these features are ripe for abuse. Among the malicious\napplications we uncovered were applications advertised as game cheats—programs that\nalter or affect the gameplay environment. For example, “Conrado’s FiveM Crasher”, a game\ncheat for Grand Theft Auto multiplayer servers hosted on community-run servers, pulls data\nfrom FiveM’s integration with Discord to “crash” players nearby in gameplay:\n\n\n-----\n\nWatch Video At:\n\n\nhttps://youtu.be/mFFI3oj7f_w\n\nA\n\npacket capture of the “crasher” accessing Discord’s API.\nOne of the Linux-based malicious archives we retrieved was this file, named\n**virus_de_prost_ce_esti.rar, which translates from the original Romanian language to what**\n_a stupid virus you are. The contents of this archive included 11 ELF binaries, 7 text files_\n\n\n-----\n\n(containing long lists of IP addresses), and a Python script that executes them in various\nsequences. The intent of the package was to disrupt game servers, causing them to lag or\ncrash.\n\nThe contents of a .RAR file distributed through Discord’s CDN include GCC-compiled ELF\nfiles and a Python script.\n\n\n-----\n\nThe Python script’s internal comments indicate that it was designed to attack servers hosted\non two platforms: Amazon’s AWS, and [NFO Servers (a service that hosts private game](https://www.nfoservers.com/)\nservers for MineCraft, Counter Strike, Battlefield, Medal of Honor and other multiplayer\ngames).\n\n## A rough neighborhood\n\nDiscord responded to our reports by taking down most of the malicious files we reported to\nthem. According to some communications, the company is currently making efforts internally\nto elevate their security posture. But the platform remains a dumping ground for malware.\nAnd even for malware not hosted on Discord, the Discord API is fertile ground for malicious\ncommand and control network capability that conceals itself in Discord’s TLS-protected\nnetwork traffic (as well as behind the service’s reputation).\n\nWhile it’s clear that some of the malware on Discord is specifically intended to disable\ncomputers or disrupt the ability of gamers to reach their platforms of choice, the prevalence\nof information stealers, remote access tools, and other criminal malware poses risks well\nbeyond the gaming enthusiast sphere. With more organizations using Discord as a low-cost\ncollaboration platform, the potential for harm posed by the loss of Discord credentials opens\nup additional threat vectors to organizations.\n\n\n-----\n\nEven if you don t have a Discord user in your home or office, abuse of Discord by malware\noperators poses a threat. Endpoint protection (and at the enterprise level, TLS inspection)\ncan offer protection against these threats, but Discord provides little protection against\nmalware or social engineering itself–users of Discord can only report the threats they\nencounter and self-moderate, while new scams emerge daily.\n\n## Sophos protection\n\nWe analyzed more than 9000 malware samples in the course of this project. While it would\nbe impractical to list off the full set of static and behavioral detections that these files might\ntrigger if executed on a protected machine, we can safely say that the full set of files has\nbeen processed by the Labs team, who ensured that our existing defenses could block any\nof these from causing damage.\n\nIndicators-of-compromise are hashes for the files retrieved in the most recent run of\n[downloads, and have been published to the SophosLabs Github. SophosLabs would like to](https://github.com/sophoslabs/IoCs/blob/master/files_hosted_on_discord.csv)\nthank the Trust & Safety team at Discord for rapidly responding to our requests to take down\nmalware.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-22 - Malware increasingly targets Discord for abuse.pdf"
    ],
    "report_names": [
        "2021-07-22 - Malware increasingly targets Discord for abuse.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536222,
    "ts_updated_at": 1743041484,
    "ts_creation_date": 1653700962,
    "ts_modification_date": 1653700962,
    "files": {
        "pdf": "https://archive.orkl.eu/59c5559ffc436aa28dcdcb2a3dd8ed7c4384a189.pdf",
        "text": "https://archive.orkl.eu/59c5559ffc436aa28dcdcb2a3dd8ed7c4384a189.txt",
        "img": "https://archive.orkl.eu/59c5559ffc436aa28dcdcb2a3dd8ed7c4384a189.jpg"
    }
}