{
    "id": "40a2771e-9d88-4d1e-99fd-2a34b3144668",
    "created_at": "2023-01-12T15:07:32.833779Z",
    "updated_at": "2025-03-27T02:16:25.718227Z",
    "deleted_at": null,
    "sha1_hash": "844bcbcc8b74712b7e2109d095ef82b3652b852e",
    "title": "2021-06-29 - Combating E-Commerce Scams and Account Takeover Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T18:27:21Z",
    "file_modification_date": "2022-05-28T18:27:21Z",
    "file_size": 81167,
    "plain_text": "# Combating E-Commerce Scams and Account Takeover Attacks\n\n**[about.fb.com/news/2021/06/combating-e-commerce-scams-and-account-takeover-attacks/](https://about.fb.com/news/2021/06/combating-e-commerce-scams-and-account-takeover-attacks/)**\n\nFebruary 8, 2022\n\n**_Update on December 30, 2021 at 11:35AM PT:_**\n\nToday, we filed another legal action against a group in Vietnam responsible for account\ntakeover attacks. The defendants targeted the accounts of employees of marketing\ncompanies and tricked the victims into self-compromising their accounts by installing\nmalicious software that was deceptively promoted as Facebook-affiliated tools for managing\nads. Once installed, the malicious software was programmed to collect information through a\ntechnique known as “session or cookie hijacking.” The defendants then used the accounts to\nrun ads without the victims’ knowledge or consent. Facebook has reimbursed the victims for\nthe unauthorized ads, which resulted in over $16 million in losses, and helped them secure\ntheir accounts. The malicious software has also been removed from online sources.\n\n**_Originally published on June 29, 2021 at 11:00AM PT:_**\n\nAs part of our ongoing efforts to keep people safe and combat abuse of our ad platform, we\nfiled two separate legal actions today against the perpetrators of online scams who violated\nour Terms and Advertising Policies.\n\n\n-----\n\nIn the first case, the defendants are a California marketing company and its agents\nresponsible for a bait-and-switch advertising scheme on Facebook. In the second case, the\ndefendants are a group of individuals located in Vietnam who got users to self-compromise\ntheir Facebook accounts and ran millions of dollars of unauthorized ads.\n\n## Combating Ad Scams\n\nOur first lawsuit is against N&J USA Incorporated, Mohit Melwani, and Vishaal Melwani, who\nran deceptive ads on Facebook that promoted the sale of merchandise such as clothing,\nwatches and toys. When someone clicked on one of these ads, they were redirected to thirdparty e-commerce websites to complete their purchase. After paying for an item, users either\nnever received anything or received merchandise that was different or of a lesser quality\nthan what had been advertised.\n\nIn an effort to conceal their bait-and-switch scheme on Facebook, the defendants blocked\nand concealed user complaints and negative reviews on their Facebook Pages. Facebook\npreviously disabled several of the defendants’ accounts and Pages. This action is one of\nFacebook’s first lawsuits against this type of bait-and-switch scheme and builds on our prior\nactions against e-commerce abuse.\n\n## Disrupting Account Takeover Attacks\n\nThe second suit is against four individuals residing in Vietnam, who used a technique known\nas “session theft” or “cookie theft” to compromise accounts of employees of advertising and\nmarketing agencies and then ran unauthorized ads. The defendants misled the victims into\nself-compromising their accounts by installing a mobile app from the Google Play Store\ndeceptively called “Ad Manager for Facebook.” This app, which has since been removed\nfrom the Play store, was created by the defendants and prompted users to share their\nFacebook login credentials and other information, which was then used to access their\nFacebook accounts and run ads. In some cases, these ads also promoted online scams. The\ngroup ran over $36 million in unauthorized ads. In this case, Facebook refunded the victims\nand helped them secure their accounts.\n\nThe suit seeks to expose the full conduct of Thêm Hữu Nguyễn, Lê Khang, Nguyễn Quốc\nBảo and Pham Hữu Dung’s and hold them accountable for creating the app, tricking people\ninto installing it, compromising people’s Facebook accounts and then using those accounts\n[to run deceptive ads. This is our second lawsuit against an account takeover attack.](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/)\n\nToday’s legal actions demonstrate our ongoing commitment to protecting users, enforcing\nour policies and holding people accountable for abusing our services.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-29 - Combating E-Commerce Scams and Account Takeover Attacks.pdf"
    ],
    "report_names": [
        "2021-06-29 - Combating E-Commerce Scams and Account Takeover Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536052,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653762441,
    "ts_modification_date": 1653762441,
    "files": {
        "pdf": "https://archive.orkl.eu/844bcbcc8b74712b7e2109d095ef82b3652b852e.pdf",
        "text": "https://archive.orkl.eu/844bcbcc8b74712b7e2109d095ef82b3652b852e.txt",
        "img": "https://archive.orkl.eu/844bcbcc8b74712b7e2109d095ef82b3652b852e.jpg"
    }
}