{
    "id": "40db5753-6763-4655-a609-50b1e2405a17",
    "created_at": "2022-10-25T16:48:17.350253Z",
    "updated_at": "2025-03-27T02:15:35.686257Z",
    "deleted_at": null,
    "sha1_hash": "5114142c580f2af681f501a0191fef715435ec54",
    "title": "HP Wolf Security Threat Insights Report Q3 2021",
    "authors": "",
    "file_creation_date": "2021-10-12T13:33:04Z",
    "file_modification_date": "2021-10-12T13:33:07Z",
    "file_size": 1539974,
    "plain_text": "### HP WOLF SECURITY\n## THREAT INSIGHTS REPORT\n\n### Q3 2021\n\n\n-----\n\n#### THREAT LANDSCAPE\n\nWelcome to the Q3 2021 edition of the HP Wolf Security Threat Insights Report. Here our security experts highlight malware trends\nidentified by HP Wolf Security from the third quarter of 2021, equipping security teams with the knowledge to combat emerging\nthreats and improve their security postures.[1]\n\n#### NOTABLE THREATS\n\n##### CVE-2021-40444 MSHTML exploit offers new way for attackers to run malicious code\n\nOn 7 September 2021, Microsoft released a bulletin for CVE-2021-40444, a high severity zero-day remote code execution vulnerability\nin the MSHTML web browser engine in Windows.2 The vulnerability can be exploited by crafting malicious Microsoft Office files, one\nof the top ways threat actors spread malware. Its potential reach and impact are high because attackers do not need to significantly\nchange their tactics, techniques and procedures (TTPs) to use the exploit. In Q3 2021, Office documents and spreadsheets were the\nsecond and third most popular file types used for delivering malware, accounting for 40% of threats isolated by HP Wolf Security.\n\nUnlike documents containing malicious macros that require attackers\nto trick users into running unsafe code, exploiting CVE-2021-40444\nneeds minimal user interaction because it can be triggered by simply\nopening a document or previewing it in File Explorer. We expect threat\nactors – hacktivist, criminal and nation state – to increasingly use this\nexploit to gain initial access to systems because of its operational\nadvantages over other execution techniques and exploits widely used\ntoday, such as CVE-2017-11882.\n\nOnce exploited, an attacker can run arbitrary code on the system,\nfor example, downloading and installing a backdoor giving them\npersistent access. The foothold into the network may then be used to\nachieve their objectives, such as stealing valuable data or holding an\nenterprise to ransom in a human-operated ransomware attack.\n\n\nThe exploit works by loading an external resource, which causes the\ndocument to run JavaScript code that exploits the vulnerability. In\nsamples analyzed by the HP Threat Research team, JavaScript was\nused to download a cabinet (CAB) archive file from a remote server\ncontaining a dynamic-link library (DLL). A path traversal vulnerability\nwas then used to run the DLL, with control.exe and rundll32.exe being\nthe executing processes.\n\n\n_Figure 1 – CVE-2021-40444 vulnerability timeline_\n\n\nMicrosoft provided possible mitigations in the bulletin that disclosed the vulnerability, such as disabling ActiveX controls, before\nreleasing a patch on 14 September 2021. The first documented case of this vulnerability being exploited in the wild, however, was\nidentified on 21 August 2021, leaving a 24-day window of vulnerability.3 The timeline in Figure 1 illustrates how the conventional\nway software developers and users respond to vulnerabilities favors attackers because of the time lag between an attacker first\ndiscovering a vulnerability and a user installing a patch.\n\nTIME FROM ATTACKER DISCOVERY OF VULNERABILITY TO VENDOR DISCOVERY\n\n+\n\nTIME FOR VENDOR TO RELEASE PATCH\n\n+\n\nTIME FOR USERS TO TEST AND DEPLOY PATCH\n\n= VULNERABILITY WINDOW\n\n\n-----\n\nHP Sure Click’s threat containment technology eliminates the risk window of CVE-2021-40444 because the vulnerable MSHTML\ncomponent of Windows is isolated inside a micro-Virtual Machine, protecting the host system from infection.4 This removes the\nneed for network defenders to rely solely on detections and mitigations, which may be imperfect and become obsolete quickly as\nthe understanding of the scope of a vulnerability evolves. While patch management remains a critical activity for the security of\nany network, threat containment can protect enterprises against unknown vulnerabilities and scenarios where a patch is yet to be\nreleased – as was the case with CVE-2021-40444.\n\n_Figure 2 – JavaScript that exploits CVE-2021-40444_\n\n\n-----\n\n##### HP Wolf Security stops campaign masquerading as the Ugandan National Social Security Fund\n\nOn 31 August 2021, HP Wolf Security protected a user from a malware campaign that impersonated a legitimate quasi-governmental\norganization, the Ugandan National Social Security Fund (NSSF). The attackers typosquatted the organization’s domain name by\nregistering a fake domain that closely resembled the real one.5\n\n_Figures 3 & 4 – WHOIS information showing the legitimate NSSF domain (left) and the malicious domain used in the August 2021 campaign (right)_\n\nThe user received a link to the fake website, where they downloaded a malicious Word document pretending to be a member\nstatement (Figure 5). The document ran a malicious Visual Basic for Applications (VBA) macro which executed a PowerShell script.\nThe script first disables PowerShell script block logging to make an investigation of the host more difficult by preventing detailed log\nevidence from being recorded.6 Afterwards, the script attempts to evade detection by bypassing the Antimalware Scan Interface\n(AMSI) feature in Windows by setting the amsiInitFailed variable to False.7 The script then tries to download and run a second stage\npayload, which is RC4 encrypted, using the .Net.WebClient class. This payload, however, was unavailable at the time of execution. To\nmake the download traffic blend in, the script sets the HTTP User-Agent header to match Internet Explorer 11. The script was almost\nidentical to the default stager of PowerShell Empire – a command and control (C2) framework that is often used by red teams as well\nas cybercriminals. Indeed, the URI and User-Agent values matched PowerShell Empire’s default configuration.8\n\n_Figure 5 – Lure document used in malware campaign impersonating the NSSF_\n\n\n-----\n\n##### Attackers use legal threats to spread NetWire RAT to Bulgarian users\n\nIn July 2021, HP Sure Click isolated a malicious spam campaign delivering NetWire,\na remote access Trojan (RAT) that targeted users in Bulgaria.9 The attackers\nsent emails containing malicious Microsoft Word documents purporting to be\ncivil enforcement claims from a private enforcement agent. The lure documents\ncontained a message requesting the reader to disable Word’s read-only mode\n(Protected View) and to enable macros. Doing so causes a malicious VBA macro to\nrun, which downloads a NetWire executable to the victim’s %TEMP% directory and\nthen executes it.\n\nInvestigation by the HP Threat Research team found that the threat actor most\nlikely sought to target Bulgarian individuals. The web server hosting the payload\nwas geofenced so that only IP addresses in Bulgaria could download the malware.\n\n\n# 89%\n\nOF THREATS ISOLATED BY HP WOLF\n\nSECURITY WERE DELIVERED BY\n\nEMAIL IN Q3 2021. 11% WERE WEB\n\nDOWNLOADS AND LESS THAN 1%\n\nUSED OTHER VECTORS.\n\n\nThe publisher metadata in the NetWire executable had also been copied from a legitimate Bulgarian software company. Finally, the\nemail lure was composed in Bulgarian and referenced a Bulgarian private enforcement agent. NetWire is a commercial RAT capable\nof controlling a remote system without a user’s knowledge. Its capabilities include keylogging, stealing credentials stored in web\nbrowsers and capturing screenshots.\n\n_Figure 6 – Lure document delivering NetWire RAT_\n\n##### TrickBot now being delivered via HTA files as well as Office documents\n\nIn July 2021, HP Wolf Security telemetry recorded an increase in TrickBot malware being distributed via HTML Application (HTA)\nfiles sent as email attachments.10 Previously, TrickBot distributors preferred to use macros embedded in Office documents as the\ninitial infection vector. We last saw HTA files being used to distribute TrickBot at the end of 2020, followed by a switch back to Office\ndocuments. The change reduces the user interaction required to infect a system because the recipient only needs to double click the\nmalicious HTA file to trigger the chain of infection.\n\n\n-----\n\nIf opened, mshta.exe interprets the HTA file and executes an obfuscated VBScript. The script executes a PowerShell command using\ncmd.exe, which downloads and runs another PowerShell script from a remote server. The second script downloads TrickBot in the\nform of a DLL from another remote server, saves it in the user’s %TEMP% directory and then runs it using rundll32.exe. The Group\nTag (gtag) parameter of the TrickBot sample downloaded by the script in Figure 9 was rob112. After installation, the Trojan determines\nthe system’s public IP address using an external service, communicates with the botnet’s C2 infrastructure and performs initial\nreconnaissance of the environment, before waiting for further commands.\n\n_Figures 8 & 9 – Obfuscated (above) and deobfuscated (below) scripts used to download TrickBot_\n\n_Figure 10 – Process interaction graph showing TrickBot HTA file running inside an isolated HP Wolf Security micro-VM_\n\n\n-----\n\n##### Uptick in email-borne JavaScript malware\n\nIn Q3 2021, we detected a rise in JavaScript malware families spread through\nemail, including Vengeance Justice Worm (Vjw0rm).11 Vjw0rm is a RAT that has\nworm-like capabilities, including the ability to spread to removable storage\ndevices. We often see obfuscated JavaScript malware attached to email as .JS files,\nwhich are sometimes successful at bypassing email gateway scanners. Therefore\nwe recommend organizations enforce email policies that block attachment file\nformats that are commonly abused by malware distributors, such as scripts and\nexecutables.\n\nIn one case, VjW0rm was sent as a JS attachment to a Spanish construction\ncompany but was isolated HP Sure Click. The email purported to be a forwarded\nquote. When opened, the script decodes and attempts to runs the malware in the\n\n\n# 12%\n\nOF EMAIL MALWARE ISOLATED\n\nBY HP WOLF SECURITY IN Q3\n\n2021 BYPASSED AT LEAST ONE\n\nGATEWAY SCANNER.\n\n\nuser’s %APPDATA% directory. The malware beacons information about the infected system to a C2 server, storing the data in the\nUser-Agent and UA-CPU headers of an otherwise empty HTTP POST request. Vjw0rm listens for commands sent by the malware\noperator and then runs them on the victim PC. The malware maintains persistence on the system by setting a Run registry key called\nB02N3ZE1UL and creating a copy of the script in the Windows start-up folder so that the malware runs each time Windows starts.\n\n_Figure 11 – VjW0rm beacon showing an HTTP POST containing information about an infected system_\n\n##### Attackers use Microsoft tools and services to deliver GuLoader and Remcos RAT\n\nIn August 2021, HP Sure Click isolated a malware campaign that abused Microsoft tools and services to evade detection. The infection\nchain began with an HTA file sent to the target by email. The file was minimally obfuscated and used the living off the land binary\nbitsadmin.exe to download and run GuLoader malware on the system.12\n\nGuLoader subsequently downloaded and ran Remcos RAT – a commercial RAT – which was hosted on Microsoft’s OneDrive cloud\nstorage service.13 Hosting malware on legitimate services increases the likelihood that the payload will evade network security controls\nthat rely on website reputation. The Remcos binary is never written to disk, a defense-evasion technique. Instead, it is executed in\nmemory, then injected into a newly started legitimate Windows process. Once the malware is installed on the computer, a connection is\nestablished to the operator’s C2 server, through which the attacker gains full access to the infected system.\n\n_Figure 12 – Email delivering GuLoader and Remcos RAT_\n\n\n-----\n\n#### NOTABLE TRENDS\n\n##### Discord and legitimate file-sharing services used to host malware\n\nIn Q3 2021, we saw more threat actors piggybacking off legitimate services that allow users to upload and share files to host malware.\nThis benefits attackers because it removes the need to set up or manage their own hosting infrastructure – bought or compromised.\nLegitimate websites are also less likely to be blocked by network security controls, increasing the success rate of malicious\ndownloads. Since attackers only need their malware hosted long enough to be effective, service providers must respond quickly to\nabuse reports to stand any chance of disrupting ongoing malware campaigns. Historically, less-resourced attackers tended to host\nmalware on file-sharing services, but in Q3 we noticed highly capable threat actors, such as those associated with the crimeware\nTrojan Dridex, started following suit too. In total, the HP Threat Research team identified 10 malware families hosted on infrastructure\nbelonging to Discord, an instant messaging service: Dridex, Cobalt Strike, Agent Tesla, RedLine Stealer, njRAT, AsyncRAT, Android\nCerberus, Formbook, Guloader, and Lokibot.\n\n_Figure 13 – Malicious document from Q3 2021 that downloads a Dridex payload hosted on Discord_\n\n\nTOP EXPLOITED\nVULNERABILITIES Q3 2021\n\n100\n\n90\n\n80\n\n70\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\nCVE-2017- CVE-2018- CVE-2017- OTHER\n\n11882 0802 0199\n\n\n_Figures 14 & 15 – Top exploits (left) and file types (above) isolated by_\n_HP Wolf Security in Q3 2021_\n\n\n-----\n\n_Figure 16 – MITRE ATT&CK techniques used by threats isolated by HP Wolf Security in Q3 2021[14]_\n\n#### NOTABLE TECHNIQUES\n\n##### JavaScript Loader dispensing RATs in the wild\n\nIn Q3 2021, HP Wolf Security quarantined a JavaScript loader that was used to distribute eight RAT and information stealer malware\nfamilies. Analyzing the obfuscated JavaScript code revealed that the malware not only has the ability to download a payload from a\nremote server, but also act as a dropper by embedding the payload within the script – removing the need to download the payload\naltogether.\n\nThe HP Threat Research team performed a retrohunt over Q3 which identified eight malware families distributed using the loader,\nalmost half of which were STRRAT (Figure 17).15 One the drivers of information stealers and RATs is the value of access to systems and\ncompromised data. Q1 2021 saw a strong rise in the value of major cryptocurrencies such as Bitcoin, thereby incentivizing financiallymotivated threat actors to target cryptocurrency wallets and credentials to online currency exchanges.\n\n##### MALWARE FAMILIES\n\nTOP 5 EMAIL LURE KEYWORDS\n\n##### SPREAD BY JAVASCRIPT\n LOADER 1. “ORDER”\n\n2. “PAYMENT”\n\nSTRRAT 47% 3. “NEW”\n\nWSHRAT 34% 4. “QUOTATION”\n\nADWIND 8% 5. “REQUEST”\n\nFORMBOOK 4%\n\nREMCOS 3%\n\nPANDA STEALER 3% _Figures 17 & 18 – Malware families spread by JavaScript loader_\n\nGULOADER 1% _(left) and top email lures of threats isolated by HP Wolf Security_\n\nRATTY 1% _in Q3 2021 (above)_\n\n\n-----\n\n#### INDICATORS AND TOOLS\n\nThe HP Threat Research team regularly publishes Indicators of Compromise (IOCs), signatures, and tools to help security teams defend\nagainst threats. You can access these resources from the HP Threat Research GitHub repository.[16]\n\n#### STAY CURRENT\n\nThe HP Wolf Security Threat Insights Report is made possible by customers who opt to share their threats with HP. Alerts that are\nforwarded to us are analyzed by our security experts and annotated with additional contextual information about each threat.\n\nWe recommend that customers take the following actions to ensure that you get the most out of your HP Wolf Enterprise Security\ndeployments:[a]\n\n- Enable Threat Intelligence Services and Threat Forwarding in HP Wolf Security Controller.[b] These enable augmented threat\nintelligence for automated threat triage and labeling, plus automatic rules file updates to ensure accurate detection and protection\nagainst the latest attack techniques. To learn more, review the Knowledge Base articles about these features.[17, 18]\n\n- Plan to update HP Wolf Security Controller with every new release to receive new dashboards and report templates. See the latest\nrelease notes and software downloads available on the Customer Portal.[19]\n\n- Update HP Wolf Security endpoint software at least twice a year to stay current with detection rules added by our threat research\nteam. For the latest threat research, head over to the HP Wolf Security blog, where our security experts regularly dissect new threats\nand share their findings.[20]\n\n#### ABOUT THE HP WOLF SECURITY THREAT\n INSIGHTS REPORT \n\nEnterprises are most vulnerable from users opening email attachments, clicking on hyperlinks in emails, and downloading files from\nthe web. HP Wolf Security protects the enterprise by isolating risky activity in micro-VMs, ensuring that malware cannot infect the host\ncomputer or spread onto the corporate network. Since the malware is contained, HP Wolf Security collects rich forensic data to help our\ncustomers harden their infrastructure. The HP Wolf Security Threat Insights Report highlights notable malware campaigns analyzed by\nour threat research team so that our customers are aware of emerging threats and can take action to protect their environments.\n\n#### ABOUT HP WOLF SECURITY\n\nFrom the maker of the world’s most secure PCs[c] and Printers[d], HP Wolf Security is a new breed of endpoint security.[e] HP’s portfolio of\nhardware-enforced security and endpoint-focused security services are designed to help organizations safeguard PCs, printers, and\npeople from circling cyber predators. HP Wolf Security provides comprehensive endpoint protection and resiliency that starts at the\nhardware level and extends across software and services.\n\n\n-----\n\n#### REFERENCES \n\n[1] https://hp.com/wolf\n\n[2] https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-40444\n\n[3] https://www.microsoft.com/security/blog/2021/09/15/analyzing-attacks-that-exploit-the-mshtml-cve-2021-40444vulnerability/\n\n[4] https://www.hp.com/uk-en/security/enterprise-pc-security.html\n\n[5] https://capec.mitre.org/data/definitions/630.html\n\n[6] https://www.mandiant.com/resources/greater-visibilityt\n\n[7] https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/\n\n[8] https://www.sans.org/white-papers/38315/\n\n[9] https://malpedia.caad.fkie.fraunhofer.de/details/win.netwire\n\n[10] https://malpedia.caad.fkie.fraunhofer.de/details/win.trickbot\n\n[11] https://malpedia.caad.fkie.fraunhofer.de/details/win.vjw0rm\n\n[12] https://malpedia.caad.fkie.fraunhofer.de/details/win.cloudeye\n\n[13] https://malpedia.caad.fkie.fraunhofer.de/details/win.remcos\n\n[14] https://attack.mitre.org/\n\n[15] https://malpedia.caad.fkie.fraunhofer.de/details/jar.strrat\n\n[16] https://github.com/hpthreatresearch/\n\n[17] https://enterprisesecurity.hp.com/s/article/Threat-Forwarding\n\n[18] https://enterprisesecurity.hp.com/s/article/Bromium-Threat-Intelligence-Cloud-Service\n\n[19] https://enterprisesecurity.hp.com/s/\n\n[20] https://threatresearch.ext.hp.com/blog/\n\na. HP Wolf Enterprise Security is an optional service and may include offerings such as HP Sure Click Enterprise and HP Sure Access Enterprise. HP Sure Click\nEnterprise requires Windows 8 or 10 and Microsoft Internet Explorer, Google Chrome, Chromium or Firefox are supported. Supported attachments include\nMicrosoft Office (Word, Excel, PowerPoint) and PDF files, when Microsoft Office or Adobe Acrobat are installed. HP Sure Access Enterprise requires Windows 10\nPro or Enterprise. HP services are governed by the applicable HP terms and conditions of service provided or indicated to Customer at the time of purchase.\nCustomer may have additional statutory rights according to applicable local laws, and such rights are not in any way affected by the HP terms and conditions of\nservice or the HP Limited Warranty provided with your HP Product. For full system requirements, please visit www.hpdaas.com/requirements.\n\nb. HP Wolf Security Controller requires HP Sure Click Enterprise or HP Sure Access Enterprise. HP Wolf Security Controller is a management and analytics platform\nthat provides critical data around devices and applications and is not sold as a standalone service. HP Wolf Security Controller follows stringent GDPR privacy\nregulations and is ISO27001, ISO27017 and SOC2 Type 2 certified for Information Security. Internet access with connection to the HP Cloud is required. For full\nsystem requirements, please visit http://www.hpdaas.com/requirements.\n\nc. Based on HP’s unique and comprehensive security capabilities at no additional cost among vendors on HP Elite PCs with Windows and 8th Gen and higher Intel®\nprocessors or AMD Ryzen™ 4000 processors and higher; HP ProDesk 600 G6 with Intel® 10th Gen and higher processors; and HP ProBook 600 with AMD Ryzen™\n4000 or Intel® 11th Gen processors and higher.\n\nd. HP’s most advanced embedded security features are available on HP Enterprise and HP Managed devices with HP FutureSmart firmware 4.5 or above. Claim\nbased on HP review of 2021 published features of competitive in-class printers. Only HP offers a combination of security features to automatically detect, stop,\nand recover from attacks with a self-healing reboot, in alignment with NIST SP 800-193 guidelines for device cyber resiliency. For a list of compatible products,\nvisit: hp.com/go/PrintersThatProtect. For more information, visit: hp.com/go/PrinterSecurityClaims.\n\ne. HP Security is now HP Wolf Security. Security features vary by platform, please see product data sheet for details.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://threatresearch.ext.hp.com/wp-content/uploads/2021/10/HP-Wolf-Security-Threat-Insights-Report-Q3-2021.pdf"
    ],
    "report_names": [
        "HP-Wolf-Security-Threat-Insights-Report-Q3-2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1634045584,
    "ts_modification_date": 1634045587,
    "files": {
        "pdf": "https://archive.orkl.eu/5114142c580f2af681f501a0191fef715435ec54.pdf",
        "text": "https://archive.orkl.eu/5114142c580f2af681f501a0191fef715435ec54.txt",
        "img": "https://archive.orkl.eu/5114142c580f2af681f501a0191fef715435ec54.jpg"
    }
}