{
    "id": "40e0a17b-dfdc-4595-b90c-c7ce695cd8b3",
    "created_at": "2023-01-12T15:07:07.054955Z",
    "updated_at": "2025-03-27T02:05:48.988889Z",
    "deleted_at": null,
    "sha1_hash": "d27044f3601bfa3c065751147a4f179b9b4752c3",
    "title": "2008-06-10 - Who's behind the GPcode ransomware-",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:51Z",
    "file_modification_date": "2022-05-27T23:11:51Z",
    "file_size": 175157,
    "plain_text": "# Who's behind the GPcode ransomware?\n\n**zdnet.com/article/whos-behind-the-gpcode-ransomware/**\n\nIn one of these moments when those who are supposed to know, don't know, and those who\ndon't realize what they know\n\n\n-----\n\nGpcode Decryptor\n\n\naren't reaching the appropriate parties, it's time we get back to the basics - finding out who's\nbehind GPcode, and trying to tip them on the consequences of their blackmailing actions in\n[between collecting as much actionable intelligence as possible using OSINT (open source](http://ddanchev.blogspot.com/2006/09/benefits-of-open-source-intelligence.html)\n[intelligence) and CYBERINT (cyber intelligence practices).](http://ddanchev.blogspot.com/2006/09/cyber-intelligence-cyberint.html)\n[Great situational awareness on behalf of Kaspersky Labs who were the first to report that a](http://blogs.zdnet.com/security/?p=1251)\nnew version of GPcode (also known as PGPCoder) is in the wild, this time with a successful\nimplementation of RSA 1024-bit encryption. However, aiming to crack the encryption could\nset an important precedent, namely using distributed computing to fight the effect of cyber\ncriminal's actions. Theoretically, the next time they'll introduce even stronger encryption,\n[which would be impossible to crack unless we want to end up running a dedicated BOINC](http://www.viruslist.com/en/weblog?weblogid=208187528)\nproject cracking ransomware in the future. Are there any other more pragmatic solutions to\ndealing with cryptoviral extortion? It's all a matter of perspective. More info on the Stop\nGPcode initiative, seeking and receiving the collective intelligence of independent\nresearchers in this blog post :\n\n\n-----\n\nAlong with antivirus companies around the world, we re faced with the task of cracking\nthe RSA 1024-bit key. This is a huge cryptographic challenge. We estimate it would\ntake around 15 million modern computers, running for about a year, to crack such a\nkey. Of course, we don't have that type of computing power at our disposal. This is a\ncase where we need to work together and apply all our collective knowledge and\nresources to the problem. So we're calling on you: cryptographers, governmental and\nscientific institutions, antivirus companies, independent researchers…join with us to\nstop Gpcode. This is a unique project – uniting brain-power and resources out of\nethical, rather than theoretical or malicious considerations. Here are the public keys\nused by the authors of Gpcode.\"\n\nDespite that GPcode indeed got the encryption implementation right this time, it's only\nweakness remains the way it simply deletes the files it has just encrypted, next to securely\nwiping them out - at least according to a single sample obtained. Consequently, just like a\nsituation where your files are encrypted with strong encryption and virtually impossibe to\ncrack, but the original files Moreover, instead of trying to crack an algorithm that's created\nnot to be cracked at least efficiently enough to produce valuable results by have the\nencrypted data decrypted, why not buy a single copy of the decryptor and start analyzing it?\nIt also appears that the decryptor isn't universal, namely they seem to be building custom\ndecryptors once the public key used to encrypt the data has been provided to them.\n\nSo, the ultimate question - who's behind the GPcode ransomware? It's Russian teens with\npimples, using E-gold and Liberty Reserve accounts, running three different GPcode\ncampaigns, two of which request either $100 or $200 for the decryptor, and communicating\nfrom Chinese IPs. Here are all the details regarding the emails they use, the email responses\nthey sent back, the currency accounts, as well their most recent IPs used in the\ncommunication :\n\n**Emails used by the GPcode authors where the infected victims are supposed to**\n**contact them : content715@yahoo .com saveinfo89@yahoo .com cipher4000@yahoo .com**\ndecrypt482@yahoo .com\n\n**Virtual currency accounts used by the malware authors : Liberty Reserve - account**\nU6890784 E-Gold - account - 5431725 E-Gold - account - 5437838\n\n**Sample response email : \"Next, you should send $100 to Liberty Reserve account**\n_U6890784 or E-Gold account 5431725 (www.e-gold.com) To buy E-currency you may use_\n_exchange service, see or any other. In the transfer description specify your e-mail. After_\n_receive your payment, we send decryptor to your e-mail. For check our guarantee you may_\n_send us one any encrypted file (with cipher key, specified in any !_READ_ME_!.txt file, being_\n_in the directorys with the encrypted files). We decrypt it and send to you originally decrypted_\n_file. Best Regards, Daniel Robertson\"_\n\n\n-----\n\n**Second sample response email this time requesting $200 :** _The price of decryptor is 200_\n_USD. For payment you may use one of following variants: 1. Payment to E-Gold account_\n_5437838 (www.e-gold.com). 2. Payment to Liberty Reserve account U6890784_\n_(www.libertyreserve.com). 3. If you do not make one of this variants, contact us for decision_\n_it. For check our guarantee you may send us ONE any encrypted file. We decrypt it and send_\n_to you originally decrypted file. For any questions contact us via e-mail. Best regards. Paul_\n_Dyke\"_\n\nSo, you've got two people responding back with copy and paste emails, each of them\nseeking a different amount of money? Weird. The John Dow-ish Daniel Robertson is\nemailing from 58.38.8.211 (Liaoning Province Network China Network Communications\nGroup Corporation No.156,Fu-Xing-Men-Nei Street, Beijing 100031), and Paul Dyke from\n**221.201.2.227(Liaoning Province Network China Network Communications Group**\nCorporation No.156,Fu-Xing-Men-Nei Street, Beijing 100031), both Chinese IPs, despite that\nthese campaigners are Russians.\n\nThis incident is a great example of targeted cryptoviral extortion attacks, namely, it's not\nefficiency centered and the core distribution method remains unknown for the time being.\nAnalysis and investigation is continuing. If you're affected, look for backups of your data, or\ntry restoring the deleted files, don't stimulate blackmailing practices by paying them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2003 - 2009/2008-06-10 - Who's behind the GPcode ransomware-.pdf"
    ],
    "report_names": [
        "2008-06-10 - Who's behind the GPcode ransomware-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536027,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653693111,
    "ts_modification_date": 1653693111,
    "files": {
        "pdf": "https://archive.orkl.eu/d27044f3601bfa3c065751147a4f179b9b4752c3.pdf",
        "text": "https://archive.orkl.eu/d27044f3601bfa3c065751147a4f179b9b4752c3.txt",
        "img": "https://archive.orkl.eu/d27044f3601bfa3c065751147a4f179b9b4752c3.jpg"
    }
}