{
    "id": "41529bf5-04b0-4358-b969-44169f0dabfa",
    "created_at": "2023-01-12T15:06:43.539631Z",
    "updated_at": "2025-03-27T02:16:26.233121Z",
    "deleted_at": null,
    "sha1_hash": "a2ebc8454b801ad017b81f35013cbf431a8197db",
    "title": "2015-02-17 - Angry Android hacker hides Xbot malware in popular application icons ",
    "authors": "",
    "file_creation_date": "2022-05-26T01:59:46Z",
    "file_modification_date": "2022-05-26T01:59:46Z",
    "file_size": 348444,
    "plain_text": "# Angry Android hacker hides Xbot malware in popular application icons\n\n**[blog.avast.com/2015/02/17/angry-android-hacker-hides-xbot-malware-in-popular-application-icons](https://blog.avast.com/2015/02/17/angry-android-hacker-hides-xbot-malware-in-popular-application-icons/)**\n\n[Jan Širmer 17 Feb 2015](https://blog.avast.com/author/jan-%C5%A1irmer)\n\nAngry Android hacker hides Xbot malware in popular application icons\n\n## Android Malware Xbot Spies on Text Messages\n\nIn the past few weeks, the Avast Mobile Security analysts have been focusing on Android\nmalware which targets users in Russia and Eastern Europe. One of the families that caught\nour interest was the Xbot malware.\n\nThe name Xbot comes from the sample itself as the string Xbot was found in all variants of\nthis malware. Xbot uses a variety of names and package names but this string was, with\ndifferent levels of obfuscation, in every single file we analyzed so we decided to name the\nmalware after it.\n\nXbot is not an app itself, but is included in different apps. We didn’t identify it in apps\navailable on Google Play, but on local Russian markets like www.apk-server12.ru. Users in\nEastern Europe use markets other than Google Play more than West European and U.S.\nusers do, that might be one of the reasons why the cybercriminals chose this distribution\nchannel. Xbot tries to hide behind apps that look like legit apps, like Google Play or the\nOpera Browser. It collects tons of permissions which allows it to spy on user’s SMS and the\nmalware could potentially spy on people’s phone calls in the future, too. It also sends\npremium SMS behind the user’s back, so basically it is malicious through-and-through.\n\nFrom the beginning of February we have seen 353 Unique Files with more than 2570 Unique\nInstall GUIDs. These numbers are not the highest ones we’ve ever seen but still, it allows us,\nunfortunately, to see the potential of Android malware and social engineering.\n\n## The author hides a message\n\nOne interesting thing we discovered is that the malware author is not shy about expressing\nhis anger with the antivirus companies who detect his masterpiece. Sometimes we find\nembedded messages addressed to Malware analytics. This one is quite strong. See if you can\nspot it: //9new StringBuilder (\"FUCK_U_AV\" )).append(\"1\").toString();. Messages like this\nare nothing new in malware samples because security companies like Avast can really cut\ninto the bad guys' income from this type of malware.\n\n\n-----\n\n## The author tries to cover his tracks\n\nAs a part of anti-analysis protection, the author(s) try to obfuscate these samples to make\nthem harder to read. But this protection is fairly simple, as it usually consists of adding\nadditional junk characters which are excluded at runtime or the Proguard, which mangles\nthe method names and file structure.\n\nThe samples we analyzed contain two different packages. One package contains only a single\nclass, which works as a sort of Settings holder and contains the URL to connect to, additional\nAPK name (possibly with extended functionality) and local preference settings.\n\nThe connection URL is mostly gibberish and varies in samples we analyzed. It is used\nas a C&C server and also as data storage of information about the infected device.\nThe second string is a name of additional APK which is downloaded and stored in\n/mnt/sdcard/.\n\nThe second package contains the larger part of the functionality. This package shows us three\ndistinct and important functionalities of this malware.\n\nThe first one is a function responsible for checking if the additional APK exists on\n/mnt/sdcard/ which allows the malware to download it in case this APK doesn’t exists.\nThe second function monitors incoming SMS for keywords, and based on those can\ncapture and store the received messages to the server where it can be misused by the\nattacker.\nThe third function is the ability to send SMS messages from the compromised device to\nany number the author(s) of malware wants. These numbers are usually premium\nnumbers whose profit is paid back to the bad guys.\n\nOn the next picture you can see all permissions requested by the malware.\n\n\n-----\n\nPermissions\n\n\nAs you can see the malware requests permission to RECEIVE_BOOT_COMPLETED which\nallows the malware to be persistent on the compromised device, i.e. the malware\nautomatically restarts with the restart of the device.\n\n## The author attempts to hide the malware\n\nThe malicious app tries to be stealthy. It uses a few tricks to fool the user into running it.\nFirst, by analyzing the sample set of this family, we were able to identify the misuse of some\nwell-known application icons, such as Android Market, Opera browser, Minecraft or even\nGoogle Play.\n\nOnce the user runs the application he is presented with an Activity that contains a single\nstring - “Application successfully installed”, always only in Russian “Приложение успешно\nустановлено”.\n\n\n-----\n\nMeanwhile, the application hides its icon from the launcher so that the user cannot find it\n[anymore. Thankfully, it’s not as sophisticated as the Fobus family we were writing about a](https://blog.avast.com/2015/01/15/fobus-the-sneaky-little-thief-that-could/)\nfew weeks back, so the user can actually find it and remove it from the device by using the\nstandard Android uninstall dialog, but honestly, who remembers all the apps they’ve\ninstalled? And even if you did, who on earth would want to uninstall Google Play, Opera or\nanother similar app? ;-)\n\nAs we mentioned before, the selfprotection mechanism this malware\nuses is to hide it’s icon from the\nlauncher. This is done by employing the\nPackageManager to set the\ncomponentEnabledSetting to\nDISABLED. As you can see in the\npicture below.\n\n## The author controls the malware via C&C\n\nXbot malware is controlled by the author(s) through a C&C server. The server addresses are\nprobably randomly created domains and these C&C servers allow the attacker to command\nthe malware to start spying on the device, send SMS and download additional content on the\naffected device. In the next picture you can see that the communication with the C&C server\nuses URL parameters to send the data and a php script to process them.\n\nBased on the answer from the C&C server malware can take different actions.\n\nOne of them is that the malware can download URL content to the affected device. This URL\nis provided from the C&C server to the Xbot.\n\n\n-----\n\nURL content\n\n\nWhen content is downloaded it can be started by Xbot. On the next picture you can see the\ncode responsible for running upee.apk which is probably downloaded through the code in\nthe previous picture.\n\n\n-----\n\nUpeeLaunch\n\n\nAnother possible course of action is that the Xbot can start spying on the infected device. It\ncaptures all received SMSs and searches for keywords in them.\n\n\n-----\n\nPDU\n\n\nIf the keywords are detected, it can upload the chosen SMS to the server using a\nsave_message.php script.\n\n\n-----\n\nSaveSMS\n\n\n## The author plans for the future\n\nWe have noticed some evolution of this particular malware already. Up until now, however,\nthe evolution has been mainly in terms of obfuscation, restructuring the code and resources.\nNow, though, we expect some further evolution. During the analysis, we noticed a function\nwhich seemingly doesn’t have any purpose at the moment, but may be misused in the future.\nThis function can be, after proper implementation, used for spying on incoming calls. The\ncontaining class’s name – ICREC - is a suggestion of that as well – Incoming Call RECorder.\nBut this is not the only thing which shows there will be probably some evolution, we also\nfound that gettaks.php which is used for contacting the C&C server contains more fields than\nare being currently used.\n\n\n-----\n\nA sample of C&C URLs we’ve encountered:\n\n## Avast makes the author really mad\n\n\nXbotURLs\n\n\n-----\n\nOne reason we find messages embedded in the code of Android malware, is because we are\nso successful at detecting and blocking it. Avast protects those using Avast Mobile\n**Security against the variants of Xbot malware. If you have not protected your**\nAndroid device, please install Avast Mobile Security and Antivirus from the Google\n**Play store.**\n\n## Acknowledgement\n\n[Thanks to my colleague, Ondřej David, for cooperation on this analysis.](http://cz.linkedin.com/pub/ondrej-david/56/a55/85a)\n\n## Source\n\nHere are some samples connected with the analysis:\n\n040F94A3D129091C972DB197042AF5F8FCF4C469B898E9F3B535CFA27B484062\n\n2E58701986AFA87FD55B31AE3E92AF8A18CA4832753C84EA3545CEB48BB7B1A7\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-17 - Angry Android hacker hides Xbot malware in popular application icons .pdf"
    ],
    "report_names": [
        "2015-02-17 - Angry Android hacker hides Xbot malware in popular application icons .pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536003,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653530386,
    "ts_modification_date": 1653530386,
    "files": {
        "pdf": "https://archive.orkl.eu/a2ebc8454b801ad017b81f35013cbf431a8197db.pdf",
        "text": "https://archive.orkl.eu/a2ebc8454b801ad017b81f35013cbf431a8197db.txt",
        "img": "https://archive.orkl.eu/a2ebc8454b801ad017b81f35013cbf431a8197db.jpg"
    }
}