{
    "id": "41844b96-6ee2-4171-84fa-17b4c3ab17e5",
    "created_at": "2023-01-12T15:07:26.554296Z",
    "updated_at": "2025-03-27T02:16:59.221301Z",
    "deleted_at": null,
    "sha1_hash": "50e713a194b516e044be2b8bfbe07f08b94fdc0e",
    "title": "2022-02-18 - TeamTNT Cryptomining Explosion",
    "authors": "",
    "file_creation_date": "2022-05-28T03:22:03Z",
    "file_modification_date": "2022-05-28T03:22:03Z",
    "file_size": 10935033,
    "plain_text": "# TeamTNT Cryptomining Explosion 🧨\n\n**intezer.com/blog/malware-analysis/teamtnt-cryptomining-explosion/**\n\n### Get Free Account\n\nJoin Now\n\n_[This post was originally published as a white paper in September 2021. Get the full report as a PDF here.](https://www.intezer.com/wp-content/uploads/2021/09/TeamTNT-Cryptomining-Explosion.pdf)_\n\n## Zusammenfassung (Executive Summary)\n\n\nFebruary 18, 2022\n\n\nOver the past year the TeamTNT threat actor has been very active. TeamTNT is one of the predominant cryptojacking threat actors currently\ntargeting Linux servers. This blog investigates the threat actor’s activity and their Tactics, Techniques and Procedures (TTPs)—providing all of\nthis information in one place so security teams can better detect and prevent attacks from TeamTNT.\n\nBased on our findings, we can conclude that they have been active since the Fall of 2019, six months before the first public report on the threat\n[actor’s activity. As of this writing, TeamTNT is mainly focused on compromising Kubernetes clusters. Prior to this, they used to target servers](https://unit42.paloaltonetworks.com/hildegard-malware-teamtnt/)\n[running Docker and Redis. We at Intezer also uncovered Windows binaries hosted on a TeamTNT server that was potentially an experiment to](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\ntarget Windows machines.\n\nMuch of the threat actor’s tooling has stayed consistent throughout their different campaigns. The majority of their tools are based on shell\nscripts but they also use some “tried and tested” compiled binaries in the attack chains. For example, the use of the Tsunami malware, first\n[documented by Trend Micro, has been a staple of TeamTNT’s campaigns since October 2019. In addition to cryptojacking, a second objective](https://www.trendmicro.com/en_us/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html)\nfor the threat actor has been to exfiltrate information about compromised hosts.\n\nAs early as the Winter of 2020, Intezer saw the threat actor utilizing novel techniques to steal SSH credentials from the compromised\nmachine when it was being used by administrators.\n\nTeamTNT has employed techniques to hide their activities on compromised machines, making incident response investigations more difficult.\nAll of their scripts are designed to be executed without being written to disk or self deleted after execution. They have used techniques of\n[hiding their running processes by mounting an empty folder over the process entry within the procfs, or by using UserLand and](https://cybersecurity.att.com/blogs/labs-research/teamtnt-delivers-malware-with-new-detection-evasion-tool) kernel level\nrootkits.\n\n[The threat actor maintains a public persona on Twitter using the handle HildeTNT. The majority of their tweets are written in German and the](https://twitter.com/hildeTNT)\naccount’s location is set to Germany. In addition, many comments in the shell scripts used by the threat actor are written in German. Therefore,\nit can be assumed that TeamTNT’s country of origin is Germany. Much of their interaction with the security industry is via commenting on\nreports covering their campaigns, mostly to point out incorrect conclusions. During the Spring of 2021, TeamTNT refuted some campaigns\nattributed to them. The tools used in these campaigns were based on some of TeamTNT’s older scripts but not something they currently were\nusing. This suggests another threat actor has started to copy TeamTNT.\n\n\n-----\n\n### Table of Contents\n\nDer Anfang (The Beginning)\n\nDer Frühling 2020 (Spring 2020)\n\nDer Sommer 2020 (Summer 2020)\n\nDer Herbst 2020 (Fall 2020)\n\nDer Winter 2021 (Winter 2021)\n\nDer Frühling 2021 (Spring 2021)\n\nDer Sommer 2021 (Summer 2021)\n\nSoziale Aktivität (Social Media Activity)\n\nWerkzeuge (Tools)\n\nDas Fazit (Conclusion)\n\nIoCs\n\n## Die Einführung (Intro)\n\nSince the introduction of Amazon Web Services (AWS), there has been a steady migration from on-premise to cloud deployments. As part of\nthis migration, the security around services has also changed. On-prem deployments can sometimes be more forgiving as a misconfigured\nservice would also be behind a corporate firewall, resulting in it not being exposed to everyone over the internet. A misconfigured cloud service\n[can be low-hanging fruit for an attacker. Palo Alto Networks investigated the attacks against cloud servers during the Spring of 2021 via a](https://unit42.paloaltonetworks.com/docker-honeypot/)\nDocker honeypot, finding that it was attacked about every 90 minutes. Of these attacks, around 76% were by cryptojacking threat actors. One\nof the most active actors in this field is TeamTNT.\n\n[The first public report on TeamTNT was published in May 2020 by Trend Micro and covered attacks against servers running exposed Docker](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\ninstances. While this is early activity, it is not the earliest that can be attributed to the threat actor. As part of this report, we will share our\nknowledge about campaigns that took place during February the same year and also provide evidence that TeamTNT has been active since at\nleast October 2019.\n\nThe first set of campaigns by TeamTNT targeted only Redis instances. Throughout their over a year and a half tenure, they have migrated\naway from focusing on Redis to instead target Docker services and most recently Kubernetes clusters. This includes the use of cloud\n[monitoring software to deploy cryptominers on vulnerable servers.](https://www.intezer.com/blog/cloud-security/attackers-abusing-legitimate-cloud-monitoring-tools-to-conduct-cyber-attacks/)\n\nThe techniques and tools used by the threat actor have slightly evolved over time but the general desired outcome has been the same. The\nfirst campaign that we at Intezer uncovered, taking place around February 2020, used techniques for stealing credentials and tried to stay\nhidden on the compromised system. Many of the tools that are still used were leveraged in the first set of campaigns.\n\n\n-----\n\no e a p e, t e su a te et e ay C at ( C) bot a d t e bac doo o as at o e e e used e ajo ty o too s used by\nTeamTNT are either open-source or source-code-available but we have also identified some custom written tools and a possible pivot to\ntargeting Windows machines. This is an interesting deviation, since TeamTNT appears to be heavily invested in targeting *NIX servers. The\nmore recent campaigns have targeted Kubernetes and cloud workloads with the goal to steal cloud-related configurations and credentials, in\naddition to running cryptominers.\n\nTeamTNT is a bit of an anomaly when it comes to cryptojacking threat actors. They have a public presence on the clear web while most threat\nactors stay hidden in the shadows. The threat actor has a public profile on Twitter and sometimes interacts with the research community\ntweeting about the success of their current campaigns. Based on their social media account they are located in Germany and the majority of\ntheir tweets are written in German. The threat actor’s interaction with the research community mostly takes the form of commenting on\nincorrect conclusions made by analysts.\n\nDuring the Spring of 2021 some new campaigns were uncovered that looked to have all the makings of TeamTNT. In both cases, the threat\nactor was quick to point out that it was not their campaign but rather someone was reusing their old scripts to make it look like it was them.\nPrior to this, TeamTNT had not refuted any campaigns attributed to them. Instead, they were mostly using Twitter to show off their capabilities.\n\nThe activity from TeamTNT does not appear to be slowing down. They continue to reuse their tools in their attacks. This may be because their\noperations are unhampered by security tools. Because of this and the potential misinformation about the threat actor, we decided to take a\ndeeper dive into TeamTNT’s activities to gain a better understanding of their timeline and Tactics, Techniques, and Procedures (TTPs). With\nthis knowledge, we aim to organize all of this information properly into one resource to help security teams better detect and prevent\nattacks from this threat actor.\n\n## Der Anfang (The Beginning)\n\n[The first public report on TeamTNT’s activity was published by Trend Micro in May 2020. While this report covers some of the early activities, it](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\ndoes not include the initial activity that can be traced back to the threat actor. One of the network indicators of compromise in this report is the\ndomain name teamtnt[.]red. This domain was registered on February 10, 2020 and is one of the first references to ‘TeamTNT’ by the threat\nactor. This infrastructure was used by the threat actor against attacks on unprotected Redis servers. The initial “setup” script used in this\n[campaign was uploaded to VirusTotal on February 26, 2020. The setup script downloads the rest of the modules used in the attack. Many of](https://www.virustotal.com/gui/file/dad3016b75e89b415e3c7e360ec2ffa31e48b667082843013bbff719add826c7/details)\nthem are shell scripts that are directly piped to either bash or /bin/sh but some files were also written to disk. Figure 1 shows a diagram of all\nthe parts downloaded and executed by the different modules. The oldest files that we were able to capture were added to the server four days\nafter the domain name was registered, giving us a good indication of when the initial campaign might have started.\n\n\n-----\n\ngu e ag a s o g o d e e t pa ts a e do oaded a d e ecuted e t e t eat acto co p o ses a u p otected ed s se e\n\n## The Setup\n\nThe infection on the machine started with the execution of the setup.sh shell script that was located in a subfolder called load. This script is\nresponsible for downloading and executing the other parts of the toolchain used by TeamTNT. The file has a comment on the top as can be\nseen in Figure 2. According to the comment, the file was the module scan/pwn Redis Server Setup.\n\nFigure 2: The first few lines of the setup.sh file. The file sets up the machine to scan and infect other Redis servers.\n\nOne of the first things the script does is check if a specific binary is running. If it doesn’t run, it downloads a setup script called\n**whois2.irc.sh for this binary. The binary installed by this shell script is an instance of the Tsunami malware. For more information about this**\nmalware, see the Tools section.\n\nTwo additional shell scripts were downloaded from the server (hosted at teamtnt.red), tmp.min.sh and sysinfo.txt. The first shell script installs\nthe miner on the infected machine while the second collects host information.\n\nFollowing the download and execution of the shell scripts, the scripts try to hide their process. The shell commands executed are shown in\nFigure 3. To hide the process, a shell script is created at /bin/hid. The shell script hides the process by first making a copy of /etc/mtab. After\nthis, it mounts an empty folder over the process’s folder under /proc. Lastly, it overwrites the /etc/mtab file or symbolic link with the copy it\nmade before the mount. These steps hide the process from programs that walk the /proc filesystem, for example, ps and top. If an admin\nchecks the mtab file the mount entry is not present, but listing the mount points by executing the mount command shows bind mount. After\nthe setup executes the hid shell script it mounts another instance of the proc filesystem under /proc. This essentially results in undoing the\nprocess performed by the hid shell script.\n\n\n-----\n\nFigure 3: Section of the setup script that creates a shell script for the hiding process.\n\nTo prevent other threat actors from also compromising the Redis instance, the setup script added iptables rules to only accept connections on\nport 6379 from localhost. The shell script also performs a request to the C2 server that appears to be for logging the infected machine’s IP\naddress.\n\nDuring this campaign, the threat actor focused on compromising unprotected Redis servers. The setup script creates the payload that is\nexecuted on the Redis servers. The code is shown in Figure 4. It’s using Redis’s [FLUSHALL issue to create a cron job that downloads a setup](https://redis.io/commands/FLUSHALL)\nscript. This setup script is almost identical to the main setup script, except that it doesn’t set up Tsunami.\n\nFigure 4: Code for creating the Redis payload.\n\nThe setup script checks if Tsunami and bioset are running. If they are, the script restarts the processes to hide them with the hid shell script. If\nthey are not running, it downloads them followed by starting and hiding them.\n\nTo find other Redis servers to infect, the threat actor uses pnscan. The setup script downloads the source code for the scanner and compiles\nit. The scanner is “installed” at /usr/sbin/dbus-daemon. Another shell script is downloaded that handles scanning and sending the payload to\nany found Redis servers. When all stages have been downloaded and started, the setup script removes itself from the infected host.\n\n## DDoS Bot Setup\n\nThis shell script downloads and installs the Tsunami DDoS bot. The script installs the binary to two different places based on if the script was\nexecuted as root or not, Figure 5. If it is executed as root, the malware is installed to /bin/kthreadd, otherwise, it is installed to /tmp/.tmp.\nBefore installing the malware, the script flushes and deletes all the iptables chains to ensure it can connect to the C2 server without any\nresistance.\n\n\n-----\n\nFigure 5: The script installs the bot under /bin if it has root permissions. Otherwise, it is installed into the /tmp folder.\n\n## Gather Information About the System\n\nThe file sysinfo.txt, while disguised as a text file, is a shell script that is executed by the setup script. A “lock” file is created in case the script\nis executed multiple times on the same machine. Figure 6 shows the check for the lock file. If it exists, the script exits early. If this is the first\ntime it’s executed, it starts collecting information about the machine. In the same figure, the logic used to determine the available RAM is also\nshown.\n\nFigure 6: Part of the script that checks if system information has already been collected for the machine. If it hasn’t, it gets the available ram.\n\nThe script also collects: username of the user executing the script, CPU speed, how long the machine has been running, if it’s 32 or 64-bit, the\nnumber of CPU cores, and which Linux distribution. All this information is sent to the threat actor’s server via the wget command shown in\nFigure 7. When the script is done, it deletes itself.\n\n\n-----\n\nFigure 7: Exfiltration of host information to the actor-controlled server.\n\n## Capture SSH Credentials\n\nThe s_poor.ssh.sh shell script is downloaded by the setup script and according to the comment at the top of the file, shown in Figure 8, it is\nused to steal SSH credentials.\n\nFigure 8: Comment at the top of the SSH credential stealing module.\n\nThe module uses strace in combination with a shell alias to log the activity. A cron job is used to upload the log files to a threat actorcontrolled server. As can be seen in Figure 9, the script adds the alias code to the bashrc file for the root user and all the normal users on the\nmachine. After this, when a user uses SSH to connect to another machine, strace is used to log the activity to a log file. The cron job seen\nadded in the same figure executes the upload script every five minutes.\n\nFigure 9: SSH credential collection via strace. The log files are uploaded every five minutes via a cron job.\n\n\n-----\n\ne up oad sc pt s e at e y s p e, s o gu e 0 t c ec s t e og es e st t ey do, t uses cu to up oad t e es be o e t s\nremoved.\n\nFigure 10: Upload script for the strace logs.\n\n## Scan for Other Machines to Compromise\n\nThe dbus-config file downloaded by the setup script is a Redis exploit/scan module. As can be seen in Figure 11, it uses pnscan that was\ndownloaded and compiled earlier. It scans the whole IPv4 space for other Redis servers. If it finds another server, it uses the Redis client on\nthe machine to send the payload, which causes the exploited service to set up a cron job that will download the setup script.\n\nFigure 11: Redis scanning functionality.\n\nThe results are uploaded to a threat actor-controlled server as can be seen in Figure 12.\n\nFigure 12: Scan results uploaded to a threat actor-controlled server.\n\n## Cryptomining\n\nThe tmp.min.sh shell script’s main job is to set up the mining process. It downloads the miner, a watchdog process, and the configuration file.\nThe installation process depends on if the shell scripts have root permissions or not. If they do, a second stage is downloaded and executed to\nperform the root setup. Otherwise, the scripts download and install the files into the temp directory. The configuration is modified to be unique\nfor each infected host. A worker ID is created based on the username of the user executing the script and the machine name. The miner used\n[is a fork of XMRig called XMRigCC. It provides a dashboard that can be used to control the miner. The command center used in the campaign](https://github.com/Bendr0id/xmrigCC)\nwas located at 80.211.206.105.\n\n### Watchdogd Process\n\n\n-----\n\ne atc dogd b a y s a s p e app cat o tte C code euse a a ys s s s o gu e 3 ts so e pu pose s to e su e t at t e\nminer is running. It does this by using a loop to call libc’s system function. If the process exits, the call to the system is repeated.\n\nFigure 13: Code reuse analysis of the watchdogd binary.\n\n## NarrenKappe\n\nNarrenKappe, which translates to jester hat, is a mining setup script that is executed if the script has root-level permissions. Since it has higher\npermissions, it performs some additional actions than when executed as a normal user.\n\nFirst, it checks if the watchdog process is running and exits the setup. Otherwise, it checks if old files from a previous infection exist on the\nmachine and removes them. Following this, it removes all the cron jobs on the machine. It tries to clean out other infections using the\ncommands in Figure 14.\n\nFigure 14: Commands used to clean the system.\n\nThe script downloads a 64-bit or 32-bit miner depending on what is supported as can be seen in Figure 15.\n\n\n-----\n\nFigure 15: Download and installation steps used by the mining setup script.\n\nThe mining configuration is modified to include a unique identifier for the infected host. The logic is shown in Figure 16.\n\nFigure 16: Logic for modifying the mining software’s configuration file with host information.\n\nThe script ensures the processes are started again if the machine is rebooted. The script adds either a System V init script or a systemd\nservice depending on what is used by the system. The commands executed in either path are shown in Figure 17.\n\nFigure 17: Code for adding either a System V init script or a systemd service.\n\nIt ensures that the service is running by adding a cron job that is executed every hour, Figure 18.\n\nFigure 18: Cron job executed every hour.\n\nIn addition to setting up the mining process, the script also starts another script that: scans for Redis servers, downloads and executes a post[exploitation tool called punk.py, and exfiltrates SSH keys, bash history, known SSH hosts, and the host file.](https://github.com/r3vn/punk.py)\n\n\n-----\n\n## Removing All Traces\n\nThe cyo.sh script is run by the mining setup script if the watchdog process is already running. The script is used to clean out the logs on the\n[machine. First, it hides the process and downloads a log cleaner written in C. As can be seen in Figure 19, the logs for the users reboot,](https://packetstormsecurity.com/files/33821/log_clean.c.html)\n**hilde, and .r00t are cleared before it uploads the bash history of the root user to the threat actor’s server.**\n\nFigure 19: Log cleaning for three user accounts and exfiltration of the root user’s bash history.\n\n## Folgen Sie dem Semmelbrösel\n\nUsing information that was present in this campaign, we were able to find some earlier activity. The rathole binary used in this campaign was\nuploaded to VirusTotal as early as October 2019. Figure 20 shows a screenshot of the submission date.\n\nFigure 20: First submission of the rathole binary to VirusTotal.\n\nA script file that was included in the archive with the miner but not used in this campaign included the functionality to download punk.py from a\nserver located at 116.62.122.90. This IP was found referenced in a shell script file called ash.sh that was uploaded to VirusTotal in January\n2020. It has very similar functionality as observed in this campaign. An out-commented line in the file references the URL\n**http[:]//3[.]215[.]110[.]66/src/bioset. Additionally, the script adds an SSH key and creates a user called hilde with the password gard, Figure**\n21.\n\nFigure 21: Shell script from January 2020 that creates a hilde user and adds a SSH key.\n\n## Der Frühling 2020 (Spring 2020)\n\n[As reported by Trend Micro on May 6, 2020, TeamTNT targeted Docker daemon ports and abused them to install cryptomining malware and](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\nDDoS malware. This is a shift from their previous targeting of Redis servers and appears to be the first documented evidence of the group\ntargeting exposed Docker daemon ports and using them to spread malware.\n\nAs in the previous campaign, the group used several shell scripts to carry out the attack. The first script mxutzh.sh is used to bootstrap the\ninfection by creating a container from an Alpine image. When the container is started, it uses the volume functionality to mount the host\nsystem’s root filesystem to /mnt inside the container. This gives the root user inside the container the ability to modify the host machine as if it\nwas root on the host machine. The container is set to download and execute another script init.sh which in turn downloads and executes\nseveral shell scripts.\n\nThe use of scripts that download and execute the malicious functionality evades detection techniques because the image doesn’t contain\nsuspicious/malicious parts, therefore it will not be detected by static analysis tools such as image scanners.\n\nAs mentioned above the container is mounted to the filesystem of the host so that the scripts are executed on the host. The init.sh implements\nthe functionality for deleting other miners, installing admin tools and cryptomining malware, implementing evasion techniques and spreading to\nother victims. Many of the same techniques were used in the earlier campaigns.\n\n\n-----\n\nFigure 22: Overview of the scripts executed in this campaign (as described by Trend Micro).\n\n## mxutzh.sh\n\nFigure 23: Screenshot of mxutzh.sh\n\nAs can be seen in Figure 23, mxutzh.sh gets an argument in the form of an IP address from the victim machine. Using the open-source tool\n[called masscan the script scans a predefined list of ports. The function uses zgrab to identify if a Docker service is listening on the port. ZGrab](https://github.com/robertdavidgraham/masscan)\n[is an open-source application scanner created by the individuals behind Censys.io. For all Docker services found, the script uses the exposed](https://censys.io/)\nport to spawn a new container from the Alpine image. Using the bind method, the root directory of the victim machine is mounted to the\ncontainer filesystem. A shell command to download and execute the init.sh script is set to be executed using sh shell as soon as the container\nis created.\n\n## Init.sh\n\n\n-----\n\nFigure 24: Screenshot of init.sh\n\nThe init.sh script removes previous cronjobs named “COVID19” and “SARScov2” and then verifies that curl and bash are installed. If not, the\nscript installs them. Next, the script downloads and executes scripts that include other functionalities for the attack.\n\nThe container is created with /bin/sh shell (as set in mxutzh.sh) but it seems that the group decided to use bash for some scripts and sh shell\nfor other scripts.\n\nWhen we examined the Uniform Resource Locator (URL) http://45.9.148[.]123/COVID19/init.sh in VirusTotal we discovered another init.sh file,\nsubmitted on April 30, 2020, about one month before Trend Micro released their report. At the time of the report the file had four detections.\n\nFigure 25: VirusTotal screenshot for the second init.sh file.\n\nThe other init.sh script doesn’t implement new features, however, it uses a different hosting domain: http://kaiserfranz[.]cc, the domain\nregistered on March 10, 2020.\n\n\n-----\n\nFigure 26: Screenshot of the second init.sh file.\n\nIt is interesting to note that the group included “COVID19” as part of the URLs used to download scripts. Both init.sh scripts were uploaded to\nVirusTotal on April 30, 2020. Around this time the COVID-19 pandemic was spreading quickly around the world and countries entered\nlockdowns.\n\n[Figure 27: Number of daily new confirmed COVID-19 cases from March to May 2020. Source: Our World in Data](https://ourworldindata.org/covid-cases?country=IND~GBR~CAN~DEU~FRA~ESP~ISR#country-by-country-data-on-confirmed-cases)\n\nSome threat actors took advantage of the crisis and started abusing it as a theme for phishing activity knowing that people were desperate for\ninformation related to the global pandemic. It is unclear if the use of the term “COVID-19” is part of an evasion technique since the group\ndoesn’t make other attempts to hide its activity.\n\n## Clean.sh\n\n\n-----\n\nFigure 28: Screenshot of clean.sh script.\n\nThis script is responsible for: killing processes of other cryptominers, deleting cron jobs and files used by other threat actors,\nremoving containers that execute malware, and disabling monitoring services such as apparmor.\n\n## DNS\n\n\n-----\n\nFigure 29: Screenshot of dns script.\n\n[The init.sh script executes another script named dns. Based on the architecture of the victim system, a tool called dns3 (link to analysis) is](https://analyze.intezer.com/files/07377cac8687a4cde6e29bc00314c265c7ad71a6919de91f689b58efe07770b0)\ndownloaded and masqueraded as part of systemd. Based on the code relation this is Tsunami. It has 32-bit and 64-bit versions, both versions\nwhich were submitted to VirusTotal on April 19, 2020. For more information check the Tools section.\n\nFigure 30: Screenshot of dns3 in Intezer Analyze.\n\n## Connection to Other Scripts\n\n\n-----\n\nThe IP 45.9.148[.]123 from the init.sh scripts in this campaign was resolved to vps.teamtnt[.]red on May 2, 2020 and located in The\nNetherlands. Based on VirusTotal the IP address is related to many malicious scripts, two of these files are: lan.redis.pwn.sh which was\nsubmitted on the day of the domain resolution and the second file minion_worker.sh was submitted a couple of days later.\n\n### lan.redis.pwn.sh\n\nFigure 31: Screenshot of lan.redis.pwn.sh\n\nFigure 32: Graph showing the scripts executed by lan.redis.pwn.sh\n\n### minion_worker.sh\n\n\n-----\n\nFigure 33: Screenshot showing minion_worker.sh\n\nThe minion-setup.sh script targets Redis and uses the URL http://45.9.148[.]123/MoneroOcean/sh/init.sh to download the init.sh script that\nwill be executed on the exposed Redis instance.\n\nBoth scripts (minion_worker.sh and lan.redis.pwn.sh) target Redis and they use the tools mentioned in the first captain (bioset and pnscan).\nBased on similarities in the functionality and behavior of the scripts we can conclude that these scripts were part of the campaign that targeted\nRedis servers.\n\n## Der Sommer 2020 (Summer 2020)\n\nThroughout the Spring and Summer of 2020, TeamTNT targeted exposed Docker containers. The exploitation techniques used during the\nSummer were very similar to the techniques used during the Spring. One key addition was the stealing of AWS credentials, as first reported by\n[Cado Security. The threat actor scanned the home directories of the users on the infected machine for the file ~/.aws/credentials. If the file](https://www.cadosecurity.com/post/team-tnt-the-first-crypto-mining-worm-to-steal-aws-credentials)\nwas found, it would be uploaded together with the /.aws/config file to a server controlled by the threat actor.\n\nThe threat actor also started to publish information on their website that appears to have been collected during their campaign. The screenshot\nof TeamTNT’s website, seen in Figure 34, shows a list of “free/open” sandboxes available on the internet. Since the earliest campaign we\ndetected the threat actor has been logging the external IP of the machines they have infected. It is possible that they used this data to identify\nthese sandboxes.\n\n\n-----\n\nFigure 34: Screenshot from TeamTNT’s website. The website published unprotected sandboxes (Reproduced with permission from Cado\nSecurity: Team TNT – The Crypto-Mining Worm to Steal AWS Credentials 2020).\n\n## Docker Exploitation\n\nIn the Spring activity, the shell script called mxutzh.sh was used to exploit Docker hosts. It would call a function named pwn with three\narguments. The first of these arguments was the same first argument passed to the mxutzh.sh file when it is executed. During the Summer,\nthis logic was changed and it instead would get this value from a compromised server. Figure 35 shows the changes. A similar script file was\nalso used to target other machines on the same network. Figure 36 shows the function in the “lan” file that instead scans the local network.\n\nFigure 35: Pwn function called. The function uses a URL to determine the range of IPs to scan instead of it being passed onto the parent script\nfile as an argument.\n\n36: Pwn function used to scan other Docker servers on the same network.\n\nThe pwn function was also changed a bit. During the Spring, it would execute a command to download an alpine image. The image is started\nwith the instruction to download an initialization shell script. In addition to this functionality, during the Summer campaign setup the shell script\nwas also passed in as base-64 encoded data in case the first method failed. Figure 37 shows part of the pwn function used during Summer.\nThe threat actor also added instructions to perform the same attack using an Ubuntu image in addition to the alpine image.\n\n\n-----\n\nFigure 37: Part of the own function that is used to infect Docker servers with containers to mine Monero.\n\n[Palo Alto Networks released a report in August 2020 on a new malware that they attributed to TeamTNT. The malware, named Cetus, infected](https://unit42.paloaltonetworks.com/cetus-cryptojacking-worm/)\none of the researcher’s Docker honeypots. Cetus essentially has two jobs, start the miner and infect other servers running Docker. This\nappears to be the first custom written malware used by the threat actor.\n\nSince the beginning of their activity, TeamTNT has tried to hide their activity on infected machines. In the early campaigns, they would mount\nan empty directory over a running process’s folder in the procfs to hide it from outputs with top and ps. In the Summer campaign, they took\nthis further by using a Linux Kernel Module (LKM) rootkit. Figure 38 shows the installation of the rootkit. The rootkit called Diamorphine is an\n[open-source rootkit hosted on GitHub.](https://github.com/m0nad/Diamorphine)\n\n\n-----\n\nFigure 38: Setup script for Diamorphine. It installs kernel headers and build tools.\n\nThe script installs the kernel headers and tools needed to compile the LKM before it downloads the source code for the rootkit via git. After the\nmodule has been compiled, it loads the module. The rootkit is used to hide the miner. This is performed by sending a signal 31 to the process.\nFigure 39 shows an example of this.\n\nFigure 39: Arrow points to a command to hide the miner via a signal to the rootkit.\n\n## SSH Exploitation\n\nThe SSH exploitation technique was also updated during this time period. For example, more SSH related files are exfiltrated from the\ncompromised host, as seen in Figure 40.\n\nFigure 40: TeamTNT added more configuration and key files to its list to be exfiltrated from the compromised server.\n\nLike many other threat actors that target Linux servers, TeamTNT also uses the known_hosts file to find other machines that it may spread to.\nIn addition to this, TeamTNT scans the networks that the machine is connected to using pnscan, to see which other machines have port 22\nlistening. As can be seen in Figure 41, the result is added to the known_hosts file.\n\n\n-----\n\nFigure 41: TeamTNT scanning local networks for other machines that are listening on port 22.\n\nTo find keys that can be used to authenticate to these machines, the threat actor looks for id_rsa files in all home folders and checks for\ndefined IdentityFile configurations. Additionally, the bash history is checked for uses of both SSH and scp. The threat actor uses similar\ntechniques to find more servers to spread to. As examples, it checks: the host file for other machines, defined HostName in the SSH config\nfiles, bash history, items in the known_hosts files, and processes connected to external IPs on port 22. Similar methods are also used to\ndetermine different user accounts that can be used to connect to the machines. It’s worth noting that since the earliest TeamTNT campaigns\nwe uncovered, the threat actor has exfiltrated the bash history files on machines they have compromised. It is possible that they have used this\ndata to devise these methods for gathering keys and IP addresses from other machines that can be used for lateral movements. Figure 42\nshows the different commands used.\n\nFigure 42: List of commands used by TeamTNT to find SSH keys, machines and user accounts that can be used to infect other machines.\n\nThe collected data is added to “master” lists that the script enumerates through. Each username and key is used for all discovered servers. If a\nsuccessful login is achieved, a command is executed to download a setup shell script on the machine. This logic can be seen in Figure 43.\n\n\n-----\n\nFigure 43: For each enumerated host, the script tries to log in with the usernames and keys. If successful, the setup script is downloaded and\nexecuted on the machine.\n\nIn addition to spreading to other machines the following files are downloaded:\n\ndocker-update (XMRig)\n[tshd (Tiny SHell)](https://github.com/creaktive/tsh)\nkube (Tsunami)\nbioset (Rathole)\n\n## Docker Containers\n\n[In addition to downloading “base” images from Docker Hub to set up the attack, Aqua Security released research on TeamTNT’s use of custom](https://blog.aquasec.com/container-security-tnt-container-attack)\nimages. The images uploaded by the user account hildeteamtnt to the hub was categorized into two categories: “Simple and straightforward”\nimages used for cryptomining and “Sophisticated” used for container escaping. The sophisticated images used the Docker Escape Tool, an\n[open-source tool hosted on GitHub. Much of the techniques and tools used were very similar to the threat actor’s previous activity.](https://github.com/PercussiveElbow/docker-escape-tool)\n\n## Der Herbst 2020 (Fall 2020)\n\nOn September 8, 2020 Intezer discovered that TeamTNT abused a legitimate cloud monitoring tool called Weave Scope. The tool gives the\nuser full access to their cloud environment and is integrated with Docker, Kubernetes, the Distributed Cloud Operating System (DC/OS), and\nAWS Elastic Compute Cloud (ECS).\n\nWeave Scope is a powerful utility for working with microservices-based applications, as it has many features including: detailed information\nabout each container and processes running in them, memory usage of each container, links and connections between containers, and the\nability to start, stop, and open interactive shells in any of these containers.\n\nFigure 44: shows a screenshot of the Weave Scope dashboard.\n\n\n-----\n\ns as t e st t e ea as ou d us g a eg t ate too o t e pu pose o ga g co t o o e t e ct s ast uctu e y\ninstalling a legitimate tool such as Weave Scope the attackers gained all the benefits as if they had installed a backdoor on the server, with\nsignificantly less effort and without needing to use malware.\n\nWeave Scope is an open-source project and its installation is relatively easy. The attackers created a container based on an Ubuntu image and\nused the mount functionality. This method was described in the previous section. At this point the attacker had full access to the filesystem of\n[the victim machine, so they downloaded and installed Weave Scope as described in the project’s Git:](https://github.com/weaveworks/scope)\n\nFigure 45: Scope Weave install to Commands.\n\nThe dashboard of Weave Scope is accessible on port 4040. By exposing this port the attackers gained full access to all of the features of this\ntool.\n\nThroughout the Fall of 2020, TeamTNT also expanded their TTPs around credential stealing to not only target stored AWS credentials. In a\n[report published by Palo Alto Networks in October 2020, the researchers reported on uses of mimipenquin and mimipy by the threat actor.](https://unit42.paloaltonetworks.com/black-t-cryptojacking-variant/)\nBoth of these tools are designed to dump passwords from various processes’ memory. They are essentially the *NIX equivalent of Mimikatz for\nWindows. After the credentials had been dumped, they were exfiltrated to TeamTNT’s C2 server.\n\nLater the same month, ESET [tweeted about a new tool the threat actor had added to their arsenal. The researchers found a binary written in](https://twitter.com/ESETresearch/status/1321246274570620929)\nGo with an AES encrypted payload. When the crypter was executed, it would decrypt the payload and write it to a memory only file created\n[with the system call memfd_create. The tool was identified as Ezuri, an open-source project created by a security researcher.](https://twitter.com/guitmz)\n\n\n-----\n\nFigure 46: Tweet published by ESET reporting on the initial finding of TeamTNT’s use of Ezuri to crypt their malware.\n\n## Der Winter 2021 (Winter 2021)\n\n[In January 2021, Lacework Labs released a detailed analysis of Tsunami, the IRC bot used by TeamTNT. By extracting the configurations](https://www.lacework.com/teamtnt-builds-botnet-from-chinese-cloud-servers/)\nembedded in the malware, they could connect to the IRC server and get more information about the threat actor’s operation and victim\ninformation. At the time of their analysis, around 200 bots were connected but only 90 unique IP addresses were detected. We have seen that\nTeamTNT has employed techniques to spread to other servers within internal networks. This suggests that some of the bots were behind a\n**NAT and shared the same external IP address. The majority of the infected machines were located in Asia with servers hosted in cloud**\nproviders Tencent, Alibaba, and Amazon Network being the largest. Outside of Asia, the United States, France, and Germany had the most\nbots. The researchers also uncovered that some of these infected machines were used to launch new campaigns.\n\n[The threat actor also added more tools to hide their activity on the infected machines. In January 2021, AT&T Alien Labs released a report on](https://cybersecurity.att.com/blogs/labs-research/teamtnt-delivers-malware-with-new-detection-evasion-tool)\nTeamTNT’s use of libprocesshider. The tool is used to hide processes using LD_PRELOAD. The shared object was written to\n**/usr/local/lib/systemhealt.so by the setup script and directives were added to /etc/ld.so.preload to allow the shared object to be loaded with**\nevery file that is executed. TeamTNT used libprocesshider to hide their Tsunami bot on infected machines.\n\n## Attacking Kubernetes\n\nThe use of LD_PRELOAD to hide itself was spotted in another campaign of the group, this time targeting exposed Kuberentes instances. Each\nKubernetes node has a running agent called kubelet which takes RESTful requests and performs operations on the pods accordingly. The\ndefault configuration of standard Kubernetes deployments allow anonymous access to kubelet. TeamTNT used this misconfiguration to gain\naccess to exposed Kubernetes instances and run cryptomining malware in the containers.\n\n\n-----\n\ns ca pa g as epo ted by a o to et o s o desc bed a e a a e ca ed **dega d t at** as st see t s ca pa g\nthis campaign there was no use of container images. The malicious functionality was carried out using a reverse shell and abusing containers\nthat were already running.\n\nFinding containers and nodes that could be attacked was accomplished by two tools: masscan (a tool that was described in the previous\nsection) and kubelet. To evade detection this campaign uses LD_PRELOAD as described in the previous section and it deletes the scripts\nimmediately after their execution.\n\n[The campaign dropped two files: Peirates, a penetration tool for Kubernetes that steals cluster credentials, and BOtB, a tool for performing a](https://github.com/inguardians/peirates)\ncontainer breakout using known vulnerabilities.\n\nTo establish a connection with the Command and control (C2) server the malware used tmate or the [Tsunami bot. It is unclear how the group](https://analyze.intezer.com/files/74f122fb0059977167c5ed34a7e217d9dfe8e8199020e3fe19532be108a7d607)\ndecides which tool to use.\n\nIn this campaign the Tsunami bot was packed using Ezuri in an attempt to evade detection. The process name of the bot was set to ‘bioset’ to\nmasquerade as a legitimate process. This process name was used by the group in previous campaigns.\n\n## Windows Targeting Attempt?\n\nWhile investigating TeamTNT’s infrastructure, we noticed that two Windows PE files had been downloaded from one of the domain names\naccording to VirusTotal. A screenshot from VirusTotal is shown in Figure 47.\n\nFigure 47: Windows binaries downloaded from TeamTNT’s infrastructure in February 2021.\n\nThe first file, sniffer.exe, is a compiled AutoIt script. A part of the script is shown in Figure 48. The script downloads WinPcap and tries to\nsteal sensitive data from network traffic. It looks for keywords of usernames, passwords, credit card information, cookies, etc.\n\n\n-----\n\nFigure 48: Part of AutoIT script that uses WinPcap to steal sensitive data transferred over the network.\n\nThe second file, svchost2.exe, runs an XMRig Miner. A code reuse analysis of the file is shown in Figure 49. The file “installs” itself to the\nuser’s home folder as the file name notepad.exe. The mining software is compiled with CUDA support to take advantage of a NVIDIA\ngraphics card that might be available on the compromised machine.\n\n\n-----\n\nFigure 49: Code reuse analysis of svchost2.exe shows that the file executes a XMRig Miner.\n\nWhile we were not able to attribute these files to a campaign, the files are aligned with TeamTNT’s TTPs. Since the first campaign in this\nreport, the threat actor has been stealing credentials and installing cryptominers on servers. It is possible the threat actor was just testing\nagainst a new target type, never manifesting into a full-fledged campaign.\n\nWhen the cryptominer is executed, it drops a driver to the user’s AppData\\Roaming\\WinCFG\\Libs folder. From gene analysis, this driver was\nidentified as WinRing0x64 from OpenLibSys. The driver allows user space applications to access ring 0, essentially giving the process\nunfettered access. This driver is part of [XMRig for Windows. The miner uses the driver to access MSR registers to improve the mining](https://xmrig.com/docs/miner/randomx-optimization-guide/msr)\nperformance. While the driver is part of a legitimate application, it does provide a loophole that can be used to bypass a trust boundary.\n\nFigure 50: Analysis of WinRing0x64 driver installed by the XMRig Miner.\n\n## Der Frühling 2021 (Spring 2021)\n\n\n-----\n\nu g t e Sp g o 0, ea e pa ded t e c ede t a stea g a s e sc pt ou d by e d c o, t e t eat acto ad e pa ded\ntheir search to the following applications and services:\n\nSSH\nAWS\nDocker\nS3\nGitHub\nShodan\nGoogle Cloud\nNgrok\nPidgin\nFileZilla\nHexChat\nMoneroGuiWallet\nCloudFlared\nDavfs2\nPostgreSQL\nSMB\n\nThe script, shown in Figure 51, searches for the files but does not exfiltrate the data. It’s not known if and how TeamTNT exfiltrated the\nidentified files as part of the campaign.\n\nIn addition to the credential search, the threat actor also started to enumerate data from the cloud environment that it was running on. Figure\n52 shows a snippet of the script grab_aws_data.sh that uses AWS CLI to extract data.\n\nFigure 51: Script by TeamTNT searches for files that normally hold credentials.\n\nAccording to [Trend Micro, close to 50,000 IP addresses running Kubernetes were compromised between March and May of 2021. The](https://www.trendmicro.com/en_us/research/21/e/teamtnt-targets-kubernetes--nearly-50-000-ips-compromised.html)\nmajority of the machines were located in China. The machines are predominantly hosted by cloud providers. This distribution is similar to what\nLacework Labs reported in January the same year but with a much larger volume.\n\n\n-----\n\nFigure 52: Snippet of a script that uses AWS CLI to enumerate data from AWS.\n\n## Der Sommer 2021 (Summer 2021)\n\nDuring the Summer of 2021, TeamTNT continued to target unsecured Docker and Kubernetes servers. Due to other threat actors using some\nof TeamTNT’s scripts during the Spring of 2021, TeamTNT added some new ways to identify their scripts. The threat actor announced the\nchanges on their Twitter account as can be seen in Figure 53.\n\n\n-----\n\nFigure 53: TeamTNT announces via their Twitter account that all scripts from now on are “tagged” to ensure correct attribution.\n\nFigure 54 shows the first few lines of a script file that was used during the campaign. The file includes the information that the threat actor\nclaimed would be added. Further down in the file is a URL from where the script was downloaded from.\n\nFigure 54: First few lines in the script file used during Summer 2021.\n\nTeamTNT also stated on their Twitter that they were going to be more “transparent” about their ongoing campaigns. As part of the Tweet, they\nincluded a link to a “beta dashboard.” Figure 55 is a screenshot of the dashboard. From the dashboard, it can be seen that the “Chimaera”\ncampaign started on July 25, 2021 and vulnerable Docker, Kubernetes and WeaveScope services were being targeted.\n\n\n-----\n\nFigure 55: Screenshot of Chimaera dashboard.\n\nAs in previous campaigns targeting vulnerable Docker instances, the use of masscan/pnscan with zgrab was used in the Summer to find the\ninstances. Figure 56 shows the payload executed on the vulnerable machines. First, it tells Docker to download an alpine image that\ndownloads the scanning script and infects the machine with a miner. In addition, a WeaveScope probe is installed on the machine.\n\nFigure 56: Function in the scanner script that exploits insecure Docker services.\n\n\n-----\n\nea a so ade so e c a ges to t e a et stead o a g t e a et add ess a d coded t e sc pt, t e t eat acto added\nfunctionality that allows for rotating the address without changing the scripts. Figure 57 shows how the script fetches the latest wallet from the\nthreat actor’s server.\n\nFigure 57: Added functionality to download the most recent wallet. If the request fails, a hard-coded backup address is used.\n\n## Soziale Aktivität (Social Media Activity)\n\nFor being a threat actor, TeamTNT maintains a public persona on Twitter. The Twitter account @HildeTNT, shown in Figure 58, was created in\nAugust 2020. The first campaign of the threat actor was reported in May 2020, while we have identified some activity dating back to October\n2019. The account was created during the Summer of 2020 when many reports covering the actor’s activity were published. Based on the\ninformation provided in the profile their region is Germany.\n\nFigure 58: Screenshot of TeamTNT’s Twitter profile.\n\nIn the graph presented in Figure 59, the threat actor is active on Twitter during all hours of the day. The data presented in the figure has been\nadjusted to UTC time zone. If we assume TeamTNT is based in a European time zone, we can conclude that the “spike” in number of tweets\ncorresponds from late afternoon until evening time in Europe.\n\n\n-----\n\nFigure 59: A graph showing the correlation between hours of the day (in UTC) and number of tweets.\n\nPlotting the activity on a timeline we can see when the threat actor has been most active and any potential downtimes. In Figure 60 we can\nsee that the most socially active period was from the middle of January 2021 until the middle of May 2021. There is a less active period at the\nend of 2020 which correlates to the Christmas holidays and New Year. It appears as the activity might be slowing down.\n\nFigure 60: A graph showing the correlation between hours of the day (in UTC) and number of tweets.\n\nMost of TeamTNT’s tweets are in German and the content varies from commenting on political subjects and current affairs (like COVID-19\nvaccination), to discussing their activities and replying to researchers that post content related to the group. Figure 61 shows their response to\na Trend Micro report.\n\n\n-----\n\n-----\n\nFigure 61: Tweet by TeamTNT replying to a research article made about them. Translated from German.\n\n## Copycat\n\nIn March 2021, TeamTNT replied to a tweet (later deleted) pointing out that someone else was using their tools and an attack was falsely\nattributed to the group. According to TeamTNT, the scripts used by the copycat were at least six months old.\n\nFigure 62: A reply by TeamTNT to another user on Twitter. Translated from German.\n\nIn June, Palo Alto Networks’ Unit 42 released a report that attributed TeamTNT to a campaign in which appeared to contain a number of\nscripts and tools that implemented similar techniques to those used by another cryptojacking group, yet had a number of differences in\nimplementation and usage. TeamTNT replied to the author of the blog in a series of tweets claiming that it was not a campaign and tools used\nby them but rather by someone else. They shared part of the script they own and use in their current campaigns in order to prove their point.\nThe script (Figure 64) was hosted on their site teamtnt[.]red/blog/Kubernetes.txt.\n\nThe group responded to other tweets that mentioned this blog, saying: “Das ist KEINE TeamTNT Kampagne!” (from German: “This is NOT a\nTeamTNT campaign!”). The threat actor has a history of commenting on previous reports documenting their activity. Sometimes they retweet\nthe links to the report or comment on statements. They haven’t refuted previous campaigns which suggests that they want to take credit for\ntheir activity. Based on their previous behavior, we assess that the refuted campaign is not by TeamTNT and instead by an imitator.\n\n\n-----\n\nFigure 63: TeamTNT’s reply to Palo Alto’s research from June 2021.\n\n\n-----\n\nFigure 64: Script shared by TeamTNT.\n\n## Werkzeuge (Tools)\n\n Tsunami (Kaiten)\n\n[TeamTNT uses an IRC bot malware known as Tsunami. Figure 65 shows the code reuse analysis of the bot used in the first set of campaigns.](https://malpedia.caad.fkie.fraunhofer.de/details/elf.tsunami)\nTsunami allows the operator to perform DDoS attacks against targets or execute commands on the infected machine.\n\nFigure 65: Code reuse analysis of a Tsunami sample used by TeamTNT.\n\n\n-----\n\ne sou ce code o t e bot as pub s ed 0 o ed a d updated e s o ca ed **ggysta tu** s a a ab e o G t ub gu e 66 s o s\nthe GitHub repository for the project.\n\nFigure 66: GitHub repository of ZiggyStarTux.\n\nThe bot used by TeamTNT does not appear to have been compiled from this code. Instead it appears to have been compiled from an earlier\nversion. There [are multiple repositories in GitHub hosting the original published code. All of these have the bot version string found in the](https://github.com/search?l=C&p=1&q=%22NOTICE+%25s+%3AKaiten+wa+goraku%22&type=Code)\nbinary used by TeamTNT, as well as support for the same commands. The commands supported by the bot are shown in the code snippets\nbelow.\n\n## TeamTNT’s Configuration\n\nAs can be seen in Figure 67, the bot is setting a “fake” application name to kthreadd, masquerading as a kernel thread.\n\n\n-----\n\ngu e 6 C a g g t e a e o t e p ocess to t eadd\n\nThe bot has two servers in its configuration. The servers are:\n\n111.230.15.240\nTeamtnt.twilightparadox.com\n\n## Rathole\n\n[Rathole is an open-source Unix backdoor with its code hosted on GitHub (Figure 68). A code reuse analysis is shown in Figure 69. The](https://github.com/IncSTK/rathole)\nbackdoor can be compiled on standard Linux distributions, it supports blowfish encryption, process name hiding and preferable shell.\n\nFigure 68: GitHub repository hosting the Rathole backdoor.\n\nFigure 69: Code reuse analysis of Rathole binary used by TeamTNT.\n\n\n-----\n\ne d e e ce bet ee t e sou ce a d t e b a y s t at t e st g tea t t s added to t e e c ypt o a d dec ypt o out e\n\nFigure 70: Screenshot showing the encryption key used by the backdoor.\n\nThe file was first submitted to VirusTotal on October 6, 2019, before the first recorded evidence of TeamTNT’s activity.\n\n## Ezuri\n\nEzuri is an open-source ELF crypter. The project is hosted on GitHub. Figure 71 shows a screenshot of the GitHub repository.\n\nFigure 71: GitHub repository of Ezuri crypter hosted on GitHub.\n\nThe crypter uses AES in Cipher Feedback (CFB) mode to encrypt the payload. When the crypter is executed, the payload is decrypted and\nexecuted from memory. Figure 72 shows the main and decryption function.\n\nFigure 72: Ezuri’s main function and decryption logic.\n\n\n-----\n\ngu e 3 s o s t e u **o** **e** **o y u ct o** e e ecut o o e o y s ac e ed by st c eat g a e o y e a t e u sysca\n**memfd_create. The decrypted content is written to the memory file. Following this, the process is forked and the spawned child executes the**\nmemory file via the execve syscall.\n\nFigure 73: Source code of the function that executes the decrypted payload from within memory.\n\n## Punk.py\n\n[Punk.py is a post-exploitation tool for Unix systems written by Giuseppe Corti. It’s open-source and hosted on GitHub. Figure 74 shows a](https://github.com/r3vn/punk.py)\nscreenshot of the GitHub repository. It uses credentials found on the exploited host to try to access other machines that are part of the SSH\n**known_hosts database. It has the ability to execute a command on all machines that it manages to log into.**\n\n\n-----\n\nFigure 74: GitHub repository for punk.\n\n## libprocesshider\n\nThe libprocesshider is a source code-available project on GitHub. A screenshot of the repository is shown in Figure 75. The project is compiled\nas a shared object. If it is loaded using LD_PRELOAD it “hooks” some libc functions which allows the library to hide a process from\ncommands like ps, lsof, and top.\n\n\n-----\n\nFigure 75: GitHub repository for libproccesshider.\n\n## tmate\n\n[Tmate is an open-source tool that provides an easy and secure way to share the terminal. It establishes a secure connection over SSH to the](https://tmate.io/)\ntmate.io website and generates a random URL for each session. The user can share the URL with other trusted users. Tmate supports all\npopular operating systems, including GNU/Linux, macOS, and BSD systems.\n\n\n-----\n\nFigure 76: Screenshot from the official tmate site.\n\n## masscan\n\n[Masscan is a TCP port scanner written by security researcher Robert Graham, also known as ErrataRob on Twitter. The scanner has been](https://twitter.com/ErrataRob)\ndesigned to scan the IPv4 address space very quickly and can be used for internet-wide scanning. To achieve this speed it needs to use a\nuserland-based network stack.\n\n## pnscan\n\nPnscan, also known as Peter’s parallel Network Scanner, is a similar tool to masscan. It can be used to scan an IPv4 network for SSH, FTP,\n[SMTP, Web, IDENT, and other services. The source code is hosted on GitHub.](https://github.com/ptrrkssn/pnscan)\n\n## Tiny SHell\n\n[Tiny SHell (tsh) is an open-source Unix backdoor, divided into client and server, written in C. It is small in size and supports multiple file](https://github.com/creaktive/tsh)\ntransfers.\n\n## MimiPenguin\n\n[MimiPenguin is an open-source tool thal extracts login passwords similar to Mimikatz in Windows. It dumps processes that are loaded into](https://github.com/huntergregal/mimipenguin)\nmemory and extracts lines that may contain cleartext passwords.\n\n\n-----\n\nFigure 77: Screenshot of the GitHub project MimiPenguin.\n\n## Mimipy\n\n[Mimipy is a cross-platform and open-source tool that dumps passwords from processes in memory. It is based on the MimiPenguin mentioned](https://github.com/n1nj4sec/mimipy)\nabove. Mimipy has other features that include: extracting credentials from browsers and HTTP servers, support for lightDM, and overwriting\npasswords.\n\n## BotB\n\n[Break out of the Box (BotB) is an open-source tool designed to be used by pentesters. It has many capabilities: exploits known container](https://github.com/brompwnie/botb)\nvulnerabilities to break out of the container, find and use Kubernetes and GCP secrets, push data to an S3 bucket and more.\n\n## Diamorphine\n\n[Diamorphine is a Linux Kernel Module rootkit written by Victor Ramos Mello. It’s hosted on GitHub and has support for kernel versions](https://twitter.com/m0nadlabs)\n2.6.x/3.x/4.x/5.x. It can hide processes, files and elevate a given user to root. Interactions with the rootkit are via signals.\n\n\n-----\n\nFigure 78: Screenshot of the GitHub project Diamorphine.\n\n## Docker Escape Tool\n\n[Docker Escape Tool is an open-source tool hosted on GitHub that identifies Docker containers and tries to escape the container using known](https://github.com/PercussiveElbow/docker-escape-tool)\ntechniques. The purpose of the tool is to assess the security of containers. Implemented techniques include: mount Docker Unix socket, reach\nthe Docker daemon on the default ports, exploit a vulnerability in RunC that allows attackers to overwrite the host RunC binary (CVE-20195736).\n\n\n-----\n\nFigure 79: Screenshot of the Docker Escape Tool repository on GitHub.\n\n## Das Fazit (Conclusion)\n\nIllicit cryptomining has become the major threat to Linux servers and cloud environments. TeamTNT is one of the predominant threat actors in\nthis field. TeamTNT’s activity can be traced back to the Fall of 2019 in attacks against Redis server. From this humble beginning, the threat\nactor has changed its targets towards servers running Docker and now currently Kubernetes clusters. Most of the tooling and tactics used by\nthe group is similar to other threat actors in the field. They predominantly structure their attacks around a set of multiple shell scripts but also\nuse open-source and source available tools. The shell scripts are rarely written to disk, instead they are downloaded using curl or wget and\n“piped” directly into a shell interpreter. This can make it hard to investigate what has happened to a compromised machine as no artifacts on\nthe machine exist. They also clear logs to make the investigation even harder.\n\nSince they are competing with other cryptojacking-focused threat actors, TeamTNT employs different techniques to ensure that only their\ncryptominer is running. In early campaigns, we have seen them “plug the hole” used to compromise the machine, for example, by adding\nfirewall rules to block external network connections to access the vulnerable service. TeamTNT has also used different techniques for hiding\ntheir processes on the machine, including userland rootkits. Some of the scripts also include lists of other known cryptominers that the threat\nactor tries to kill on the machine. This is a common technique employed by many other threat actors in this field which essentially turns the\ncompromised machine into a game of “King of the Hill.”\n\nWhat separates TeamTNT from other major threat actors in the cryptojacking field is their public presence on the clear web. They maintain a\npublic appearance on Twitter and frequently tweet. Based on the public persona, it can be assumed that they are based in Germany. The\nthreat actor commonly interacts with German politicians, tweets about their ongoing campaigns, and comments on reports by the security\nindustry. The majority of these comments are to take credit for their work. During the Spring of 2021 some campaigns were attributed to\nTeamTNT but the threat actor refuted that it was their work. This suggested the emergence of an imitator reusing some of TeamTNT’s older\nshell scripts. It remains to be seen if this will affect their activity and if they will continue to target Kubernetes clusters or if they will move on\nand target new cloud infrastructure.\n\n## IoCs:\n\n Pre-February Campaign\n\n### Files\n\nName SHA256\n\nbsh.sh 125dc99b9f94d5548bb68b371cb2ff22134b60b1fef915d1ae85b025f4039be0\n\nash.sh 561b76684d80084bd4b924e439f7e37683f486ca94fa088f283402dc7443271c\n\n\n-----\n\ndcc96cdc7192a41fb242a680a83969e16247511816dc0f80e63b134059497ad1\n\nhole64 da43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\n### Network\n\nValue\n\n36.7.154.124\n\n116.62.122.90\n\n3.215.110.66\n\n125.254.128.200\n\n### SSH Key\n\nssh-rsa\nAAAAB3NzaC1yc2EAAAADAQABAAABAQDIzB9hz7bNT6qtQKCMcitaaxEB9RyJEZuumE+gUMrh6hg3ccSMg9qnAlS/Lmw5SwwLJQXMB5Wuhcl\n\n## February 2020 Campaign\n\n### Files\n\nName SHA256\n\n32bit.tar.gz 40c298446a7e53c3775f67deedf5d13b7c2c601de3c744f72fda42f99c156075\n\n64bit.tar.gz 4f2ee441b35e8e0fe99608a011b632db219bd6631bcda39899b747a0dd38b5c6\n\nbioset da43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\nconfig.json 1470c3100b976ae2d4f9a1def5d6c6715d4f050e7de5e261b5d4e4a2faf9603d\n\ncyo.sh 77334b8e3c8df468eda2ef93467d63e41dab7beb451a3bbb5637473fabc620d6\n\ndbus-config b7225aefd8fb399a7f18639c32c59442daa5401b6164130e316092e8618f667f\n\nFullCleanUp.sh 6a1221fc82b2bf13dc8112795d3edfb7bab8df7a9d4af69b89da4ac31e0e87e5\n\nhfile e5f48ccf07addd83986f5b6f9444d5f91cacbb5c471b815a2b68a9c02727821b\n\nhid.sh fe6e522ff266867060fa70d85be299ac5b12f2888935c5fe6e0a07d3ccaa1de2\n\nlogs.c 59aa2101b05225dd0eb7e7b456eb26357540723e3c1d8a10deca83e9715a10fb\n\nsetup.sh b5ba2c86ebf85cbf700c83d7edc034717d7ee08e84fbae440a38139c15ef7a27\n\nNarrenKappe.sh a25a73af06c43a20eb9f4f8b67357cec3c74143ccf97ce666446296a360d93fa\n\npnscan-1.11.tar.gz 702b123a3abd518ac696c9e340e1aaf4742d271922b8b537d8595ea6486d7aa8\n\npunk.py a66140870d0a71c7bd42b7631e4a85858e6b33e4a21be637b94d41833dee8383\n\n\n-----\n\nrd.sh d42ee8a001de9b13496f2980de6ca22b544a5a9012e9e97374343411593c2c29\n\nsetup.sh dad3016b75e89b415e3c7e360ec2ffa31e48b667082843013bbff719add826c7\n\ns_poor.ssh.sh 1eead4f456ed8741d1de821e2fcecb026c1cbbf3477786cc3e637eac05811f46\n\nsysinfo.txt 53ba0436084f054c9c2c8aaf110f2c89c3c8b1fd9f1e4ca48cedfa86b7dece81\n\ntmp.min.sh 669ace6d57c68e4a7f2fabcacfecf485a5c90bfc28a809a432e68b53f60836a4\n\nwatchdogd.tar.gz e0876231c4829e0c7be4ffe47466b57e17a15e9c1529f332f813ea532716c945\n\nwhois2.irc.sh 795a3d99c1e8e34a6228d95c4435c5ed7c866dc0e303f9788ea6fe055b1a7ac6\n\nwhois.irc 205db0ef59cad167c6132916f8f7a1d1963e740b36400419b2e5ba307e9f765c\n\n**32-bit Archive**\n\nName SHA256\n\nwatchdogd 69fea980538a12ac0791f0801fc93d8b4d16e8329793d635221a16f935e8ca07\n\nXMRig Miner 4256402fc04e49f3da8d1bf88efdcca6a3b03f4b881777d2c32a8df364cececd\n\n**64-bit Archive**\n\nName SHA256\n\nbioset da43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\nconfig.json 285e91d3d578fcaf6665c70de457f602d572203b04c281c03b4bf9103aa5f61f\n\ndo.sh 9c29d4ecf6a60e7bfc0afbaa7a669a18af163440730711367d1c715042b5f755\n\nlo 920014ace9add87139db41eb2538b292ad136fde7ac5f683eb3b31e0fed5f808\n\nrstart.sh 4beaf3edbd1065c0dfd02cf864effe3d1e18d0f39275f0d49cb21951a12976c3\n\nsystemd-clean 3a2aa7235f0617df430b3d556779bee2ae0af75d7c2f17f052971d3f38fad9e0\n\nwatchdogd fdf26ebad48da26be59b5784f43d1e5ee2efa93c59a717fe2ae1d82bf3f016d3\n\nwatchdogd.initd 16b26d9e4413c2f6d081ca093106935673747d5266aaa33f51c845e65b90e904\n\nwatchdogd.service 264c9b440f2fbd03000211a92a8bbb190f69c78dc087b8f757b3e8676554df57\n\nwatchdogd-stop 020ba2a9f603588dbc6498a6e230249c6952daa920a58de89d997b3fcdc4c115\n\nXMRig Miner b6f57f8a7fba70d6660335828d2a14029c88079a8176dca2c63281a759fd84ca\n\n### Network\n\nValue Comment\n\n\n-----\n\nicanhazip.com Used to determine IP\n\nteamtnt.red Main server\n\n123.56.193.119 Exfiltration server\n\n116.62.122.90 Old server still used by some scripts\n\n120.26.230.68 Miner CC\n\n80.211.206.105 Command center\n\n### Wallet\n\n[89X8a5RqKMGLubB19DwVVqPxgF27C8hqpbtWMqNorpsDSu6Qw5uu4iJF8WwoLt2VQGRgALfjEqpq61awRTaBwpciDatbCNB](https://bohemianpool.com/)\n\n## Spring 2020\n\n### Files\n\nName SHA256\n\nclean.sh 6b8d828511b479e3278264eff68059f03b3b8011f9a6daaeff2af06b13ba6090\n\ndns 6c73e45b06544fc43ce0e9164be52810884f317a710978c31462eb5b8ebc30cc\n\ndns3 07377cac8687a4cde6e29bc00314c265c7ad71a6919de91f689b58efe07770b0\n\ndns3_32bit 3876b58d12e27361bdfebd6efc5423d79b6676ca3b9d800f87098e95c3422e84\n\ninit.sh (Trend Micro) 459190ba0173640594d9b1fa41d5ba610ecea59fd275d3ff378d4cedb044e26d\n\ninit.sh (the second script) 5c488d9d6820f859cde5fb5d147cfe584a603152653d12e720b897df60c6f810\n\nmxutzh.sh 8926672fe6ab2f9229a72e344fcb64a880a40db20f9a71ba0d92def9c14497b6\n\nNarrenKappe.sh d791ac65b01008d2be9622095e6020d7a7930b6ce1713de5d713fc3cccfa862\n\nsetup.mytoys.sh b60be03a7305946a5b1e2d22aa4f8e3fc93a55e1d7637bebb58bf2de19a6cf4a\n\nsetup.xmrig.curl.sh bebaac2a2b1d72aa189c98d00f4988b24c72f72ae9348c49f62d16b433b05332\n\nsysinfo 3c907087ec77fc1678011f753ddf4531a484009f3c64563d96eff0edea0dcd29\n\nlan.redis.pwn.sh 25b4c5a3b3bfb1adab66fe17313a9828ef4ed13ea903e603f0ae36f3aa00cab0\n\nminion_worker.sh 2adb1a298dd4ffd1b4fe2d5f5468363e977c8962dc837dc57219362ee2fc3127\n\n## Summer 2020\n\n### Files\n\nName SHA256\n\n\n-----\n\nCarray.jpg 230e2a06df2cd7574ee15cb13714d77182f28d50f83a6ed58af39f1966177769\n\nclean.jpg c55e4c67ba3cf54360a88980183767522fc05e8bf076f31399ee45efbfbd78e5\n\ncron.jpg 9f5e14ca8c877b7dff84ffbe018c461233af975654bd5b87431920dfc24568a5\n\ncron_set.jpg 705a22f0266c382c846ee37b8cd544db1ff19980b8a627a4a4f01c1161a71cb0\n\nds.jpg a386aced768146fecfe81cac214c51c7e575b2c0c27a29c683e3357706f651ba\n\ninit.jpg 616c3d5b2e1c14f53f8a6cceafe723a91ad9f61b65dd22b247788329a41bc20e\n\nlocal.jpg b556d266b154c303bb90db005d7dd4267ed8d0e711e3fd32406c64b1fc977f9e\n\nmo.jpg 3a377e5baf2c7095db1d7577339e4eb847ded2bfec1c176251e8b8b0b76d393f\n\nmos.jpg 0742efecbd7af343213a50cc5fd5cd2f8475613cfe6fb51f4296a7ec4533940d\n\nssh.jpg 929c3017e6391b92b2fbce654cf7f8b0d3d222f96b5b20385059b584975a298b\n\ntnt.jpg b3c94173daf8f825dcba80ecc813dd0ca36636851f9fa83901ae3b36af166d78\n\nmo.jpg 1b7180c7e1f150ba6848e392e8482b83c638b27b37873f7f0948be991416431\n\nmo.jpg 3a377e5baf2c7095db1d7577339e4eb847ded2bfec1c176251e8b8b0b76d393f\n\ninit.jpg 616c3d5b2e1c14f53f8a6cceafe723a91ad9f61b65dd22b247788329a41bc20e\n\ncron_set.jpg 705a22f0266c382c846ee37b8cd544db1ff19980b8a627a4a4f01c1161a71cb0\n\nds.jpg a386aced768146fecfe81cac214c51c7e575b2c0c27a29c683e3357706f651ba\n\nmo.jpg b6e369f0eb241ffb1b63c8c5b2b8a9131a9b98125ca869165f899026ab2c64ba\n\nssh.jpg b9036b471ade3a0ed2c3e7d7c20f0844ee15d67ddcbe3380350944e427a7bf49\n\ncron.jpg c4cd9c12d47e5468f6f6e4b27e122f1a3d05dcae958245b59bde07d11c27328e\n\n### Archives\n\nName SHA256\n\n01.jpg 78037e2d2e596bd450b99551535fa9c38c4e8346ab75eb424bf9e95316424fbe\n\n21.jpg 4f115381c17ba1dedb25d35d922feda9a723e206d811ed437b75fd8116ef461b\n\n22.jpg 4a5d3435cd4a835056b4940e1cea9a25b1619562525bd9953a120b556b305983\n\nabout.jpg a79d4f5633dbbe98842d5073b41cc25468679c46e011373587ffdbc544d1ea12\n\ndet.jpg 79a060a0efcf4a1538c58e532b984dcd927fda17ca9fd10c2ff212f9d9d76be6\n\nmod.jpg feb0a0f5ffba9d7b7d6878a8890a6d67d3f8ef6106e4e88719a63c3351e46a06\n\n\n-----\n\nstock.jpg 2c40b76408d59f906f60db97ea36503bfc59aed22a154f5d564d8449c300594f\n\n### Binaries\n\nName SHA256\n\nimpressum.jpg f64a828d58ac5bbdde5e982ebb0766c8969cb63b4ab642467392042f2a594295\n\njq.jpg bcfa215dec8fe15d4265c508c39c1ebafb7370acc95721e4e7d610b0459eb8dd\n\nkube.jpg 15dce6f833812b119de9447db49e61f5c238c4e45b0dafbe0b6af0ab50bb329a\n\nms.jpg 72b1cbfbd87c6cd85b9dc1da48c852768003e7fb4f01d8f6904921474be199ad\n\nsocat.jpg 71c81cb46dd1903f12f3aef844b0fc559f31e2f613a8ae91ffb5630bc7011ef5\n\ntshd.jpg ba974b31c7e6715b83e9468f72fd5927d560fe80dbcba8c4466bb8ce5b93601d\n\nzgrab.jpg 1474298ed7a5c63ca8098794cd743a276807cca0e678e046160718626bb038f3\n\nportainer b49a3f3cb4c70014e2c35c880d47bc475584b87b7dfcfa6d7341d42a16ebe443\n\n[88ZrgnVZ687Wg8ipWyapjCVRWL8yFMRaBDrxtiPSwAQrNz5ZJBRozBSJrCYffurn1Qg7Jn7WpRQSAA3C8aidaeadAn4xi4k](https://moneroocean.stream/)\n\n## Fall 2020\n\n**Network**\n\nValue Comment\n\n85[.]214.149.236 Host malicious scripts and binaries\n\nhttps://iplogger[.]org/2Xvkv5 Used to obtain the IP address of the victim\n\nName SHA256\n\nxmrig 3b4ff9aff08a7ca9a36ed997f94adb6b18bb757157cec4f04b53ba67e9377003\n\nkdevtmpfsi dd603db3e2c0800d5eaa262b6b8553c68deaa486b545d4965df5dc43217cc839\n\nxmrigCCMiner_64Bit b6f57f8a7fba70d6660335828d2a14029c88079a8176dca2c63281a759fd84ca\n\nx86_64 139f393594aabb20543543bd7d3192422b886f58e04a910637b41f14d0cad375\n\nxmrig fdf26ebad48da26be59b5784f43d1e5ee2efa93c59a717fe2ae1d82bf3f016d3\n\n## Winter 2021\n\n### Attacking Kubernetes\n\n**Network**\n\nValue Comment\n\n\n-----\n\nThe.borg[.]wtf (45.9.150.36) Host malicious scripts and binaries\n\n147.75.47.199 Used to obtain the IP address of the victim\n\nteamtnt.red (45.9.148.108) Host malicious scripts and binaries\n\nBorg.wtf (45.9.148.108) Host malicious scripts and binaries\n\nIrc.borg.wtf (123.245.9[.]147) C2 server and runs IRC server\n\nSampwn.anondns.net (13.245.9[.]147) C2 server and runs IRC server\n\n164.68.106.96 C2 server and runs IRC server\n\n62.234.121.105 C2 server and runs IRC server\n\n**Files**\n\nName SHA256\n\nTDGG 2c1528253656ac09c7473911b24b243f083e60b98a19ba1bbb050979a1f38a0f\n\ntt.sh 2cde98579162ab165623241719b2ab33ac40f0b5d0a8ba7e7067c7aebc530172\n\napi.key b34df4b273b3bedaab531be46a0780d97b87588e93c1818158a47f7add8c7204\n\ntmate d2fff992e40ce18ff81b9a92fa1cb93a56fb5a82c1cc428204552d8dfa1bc04f\n\nsGAU.sh 74e3ccaea4df277e1a9c458a671db74aa47630928a7825f75994756512b09d64\n\nkshell 8e33496ea00218c07145396c6bcf3e25f4e38a1061f807d2d3653497a291348c\n\ninstall_monerod.bash 518a19aa2c3c9f895efa0d130e6355af5b5d7edf28e2a2d9b944aa358c23d887\n\nsetup_moneroocean_miner.sh 5923f20010cb7c1d59aab36ba41c84cd20c25c6e64aace65dc8243ea827b537b\n\nxmrig (oneroocean) a22c2a6c2fdc5f5b962d2534aaae10d4de0379c9872f07aa10c77210ca652fa9\n\npei.sh ee6dbbf85a3bb301a2e448c7fddaa4c1c6f234a8c75597ee766c66f52540d015\n\npei64 937842811b9e2eb87c4c19354a1a790315f2669eea58b63264f751de4da5438d\n\npei32 72cff62d801c5bcb185aa299eb26f417aad843e617cf9c39c69f9dde6eb82742\n\nxmr3.assi 12c5c5d556394aa107a433144c185a686aba3bb44389b7241d84bea766e2aea3\n\naws2.sh 053318adb15cf23075f737daa153b81ab8bd0f2958fa81cd85336ecdf3d7de4e\n\nt.sh e6422d97d381f255cd9e9f91f06e5e4921f070b23e4e35edd539a589b1d6aea7\n\nx86_64.so 77456c099facd775238086e8f9420308be432d461e55e49e1b24d96a8ea585e8\n\nxmrig 78f92857e18107872526feb1ae834edb9b7189df4a2129a4125a3dd8917f9983\n\n\n-----\n\nxmrig.so 3de32f315fd01b7b741cfbb7dfee22c30bf7b9a5a01d7ab6690fcb42759a3e9f\n\nxmr.sh fe0f5fef4d78db808b9dc4e63eeda9f8626f8ea21b9d03cbd884e37cde9018ee\n\nziggy 74f122fb0059977167c5ed34a7e217d9dfe8e8199020e3fe19532be108a7d607\n\n### Windows Targeting\n\nName SHA256\n\nsniffer.exe 42e60ce9f0b7c5260282a7006af0166cd3603a6043d833719586bd1adaece138\n\nsvchost2.exe dd0a5c62db8403263872716b8b2dfd190fcf9c742e9d13ad2c40ab41df7f2045\n\n[Wallet: 84dg9MjSkFvXkqHQuBr6ep6TfhR3pTP8DRyTMN5s8RgYMVRcnce7Day8edLkk3TqAaSHXu2N4W3A3XjKMaSx4X8Q3KQgZnh](https://supportxmr.com/)\n\n## Spring 2021\n\nName SHA256\n\naws.sh 8cedd6187439f73675b076d70647ee117ec3a4184a5045499a6172ae6e6c2c39\n\ngrab_aws-data.sh a1e9cd08073e4af3256b31e4b42f3aa69be40862b3988f964e96228f91236593\n\ninit.sh 4e059d74e599757226f93ea8ddcfb794d4bcda605f0e553fbbef47b8b7c82d2b\n\nsearch.sh ed40bce040778e2227c869dac59f54c320944e19f77543954f40019e2f2b0c35\n\n## Summer 2021\n\n### Files\n\nName SHA256\n\nSSH.id_rsa.LAN.spread.sh 000f9927d2aad73a10d7034cff8308535322e629a75600addfe38202305101ba\n\nmo.sh 1b72088fc6d780da95465f80ab26ba094d89232ff30a41b1b0113c355cfffa57\n\nSSH.id_rsa.LAN.spread.sh 3cc54142b5f88d03fb0552a655e32e94f366c9e3bb387404c6f381cfea506867\n\nbot_u 5e1af7f4e6cf89cff44ee209399a9fab3bfd8f1ca9703fb54cee05cce2b16d4c\n\nscan.sh 6c8a2ba339141b93c67f9d79d86a469da75bfbc69f128a6ed702a6e3925d5a29\n\nsetup.scanner.root.sh 8737eb891a80302929a7d2a6ffacd51338705783f250ecbcd62d2d623f9e98fd\n\nsx.sh a383e770c319b2411ed17775a114b697fb83ab53912266462ad1607c090ca608\n\nkbot_x86_64 a46c870d1667a3ee31d2ba8969c9024bdb521ae8aad2079b672ce8416d85e8df\n\n### Domains\n\nteamtnt[.]red\nchimaera[.]cc\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-18 - TeamTNT Cryptomining Explosion.pdf"
    ],
    "report_names": [
        "2022-02-18 - TeamTNT Cryptomining Explosion.pdf"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536046,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653708123,
    "ts_modification_date": 1653708123,
    "files": {
        "pdf": "https://archive.orkl.eu/50e713a194b516e044be2b8bfbe07f08b94fdc0e.pdf",
        "text": "https://archive.orkl.eu/50e713a194b516e044be2b8bfbe07f08b94fdc0e.txt",
        "img": "https://archive.orkl.eu/50e713a194b516e044be2b8bfbe07f08b94fdc0e.jpg"
    }
}