{
    "id": "41943864-4d99-42fe-be96-f818189b2861",
    "created_at": "2023-01-12T15:00:16.084927Z",
    "updated_at": "2025-03-27T02:06:11.448198Z",
    "deleted_at": null,
    "sha1_hash": "8cbb6eed9ff3afbe91f27c594704c3b3f86baa8c",
    "title": "2020-12-10 - Terrorism or Information Operation-",
    "authors": "",
    "file_creation_date": "2022-05-28T19:39:41Z",
    "file_modification_date": "2022-05-28T19:39:41Z",
    "file_size": 1570758,
    "plain_text": "# Terrorism or Information Operation?\n\n**pylos.co/2020/12/10/terrorism-or-information-operation/**\n\nJoe 12/10/2020\n\n[On 09 December 2020, details emerged concerning network infrastructure I’d previously](https://twitter.com/dnvolz/status/1336867523594219527)\nidentified as suspicious on 07 December:\n\n\n-----\n\nFurther research and investigation showed that the domains in question – which were\nrelocated from “.org” to “.us” infrastructure – were hosting “kill lists” comprising politicians,\n[civil servants, and employees of Dominion Voting Systems, including information such as](https://www.dominionvoting.com/)\nhome addresses. As seen in the following image, the intent of this page is not left to one’s\nimagination, thanks to the crosshairs superimposed over the faces of each “enemy of the\npeople.”\n\n\n-----\n\nInvestigation of network infrastructure identified the following indicators or observations\nrelated to this activity:\n\nenemiesofthepeople\\.org\ndonttouchthegreenbutton\\.org\nenemiesofthepeople\\.us\ndonttouchthegreenbutton\\.us\ndonttouchthegreenbutton\\.net\n193.56.255\\.179\n2.56.242\\.22\nvoychik-7923@yandex\\.com\nivan0v.pi@yandex\\.com\nonzayt@yandex\\.com\n\nFrom the above, several observations stand out:\n\nUse of the [Yandex mail service, a company domiciled in the Russia Federation.](https://mail.yandex.com/)\nApparent use of Slavic-looking names in email addresses and registration information\n(when not privacy protected).\nHosting of infrastructure in the Russian Federation and Romania.\n\n\n-----\n\nAdditional references in active webpages to services owned by Russian companies,\nand hosted in Russia, such as the following:\n\nWhile overall “themes” are focused on the US election – and with the “green button”\nreference in domains, they may appear to be specifically focused on or aware of particular\nconcerns in Arizona – nearly all network selectors and observations are linked to Russia or\nEastern European entities. However, WhoIs information for the domains – where available –\nreflects a location in Georgia that appears to be a small residence that also is the home of a\ntax preparation company:\n\n\n-----\n\nSo – what the hell is going on???\n\nFirst, the general impetus of the webpage(s) in question are not in doubt – this resource is\nspecifically designed to intimidate and threaten individuals involved in the US electoral\nprocess. That this extends to an open “call” for further information – including home\n\n\n-----\n\naddresses – is both shocking and shameful.\n\nThese obvious points aside though, we are now left with a question of “who benefits” from\nsuch activity. For this, multiple hypotheses can be put forward and evaluated:\n\n[Given the “green button” item and recent, hard-line/far-right postings the campaign may](https://www.cnn.com/business/live-news/election-2020-misinformation/h_d55d6488f6a65ba7b99edd31cc014238)\nreflect an initiative by the Arizona Republican Party to (crassly and unethically) rile up\nits base as part of continuing efforts to question the result of the 2020 US Presidential\nelection.\nThe broad targeting of the website – which includes officials in Michigan, Georgia, and\nNevada as well as employees of Dominion – combined with the interesting WhoIs data\nabove may indicate the activity is a rogue or disgruntled reactionary activist expressing\nthemself.\nThe Russian and Eastern European infrastructure, email addresses, and other\nreferenced services may represent some grand distraction designed to post sensitive\ninformation about political enemies while simultaneously discrediting criticism (at least\namong certain segments of the US population) that such opprobrium is linked to a\ncontinued “It’s Russia’s fault!” narrative.\nThe use of multiple domains and servers, combined with specific details of various\npoliticians and private employees of relevant firms, may reflect the operations of a\nprofessional intelligence or disinformation organization, but designed and implemented\nin an amateur-seeming fashion to match the same haphazard approach observed in\nTrump campaign efforts to overturn election results.\n\nOverall – this is very strange! While the content of the pages in question is absolutely\nabhorrent, who is responsible is incredibly murky as each of the above scenarios seems\nplausible to some extent. Furthermore, nothing seems to outright discredit or disqualify any\n\n\n-----\n\nof the above possibilities either. So at present, we in the US are left with a situation where\nany of the following may hold:\n\nA regional Republican Party element has basically “gone rogue” and decided to\nengage in actions that are closer to terrorism than politics.\nAn individual or small group of Republican activists have taken matters into their own\nhands and are either directly trying to threaten the lives of opposition figures, or trying\nto frame such an operation as a foreign disinformation engagement.\nA foreign intelligence service or other entity is engaging in continued disinformation to\ndeepen fissures within the US political system while hiding in the current turmoil to\nevade obvious detection.\n\nAs of this moment, insufficient information exists to disposition events toward any of the\nabove possibilities – but the very fact that this campaign exists is deeply worrying. While past\ndisinformation and influence operations, whether operated by foreign or domestic entities,\nhave emphasized the corruption or unfitness of various persons or parties for office, no\nwidespread campaign has taken such advocacy to the point of calling for the execution of\npersons who are merely doing their job. Irrespective of who is responsible for this campaign,\nnorms have been shattered and discourse has changed for the worse.\n\nGiven the vile nature of these items, I sincerely hope that all parties, public and private, will\nwork together to collect evidence, perform a thorough investigation, and forward results to\nlaw enforcement. Such actions as witnessed in the items above are beyond acceptable and\nmust be snuffed out quickly, so that such threatening and violent speech does not take root\nwithin our system.\n\n_10 Dec 2020, 1015:_\n\nAn additional domain appeared overnight – enemiesofthenation\\.com – which hosts the\nsame material, but is using CloudFlare services to mask hosting:\n\n\n-----\n\nAdditionally, it is worth noting that email addresses associated with network registration are\nusing the more global-oriented “yandex.com” instead of the Russian language “yandex.ru”.\nThis may be circumstantial, or it could support the theory that the activity in question\nattempts to look like Russian-based actions but lack of language skills prompted the use of\nthe com site instead of the Russian-language ru.\n\nNonetheless, contact information remains strange and seemingly ties back to locations in the\nRussian Federation:\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-10 - Terrorism or Information Operation-.pdf"
    ],
    "report_names": [
        "2020-12-10 - Terrorism or Information Operation-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535616,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653766781,
    "ts_modification_date": 1653766781,
    "files": {
        "pdf": "https://archive.orkl.eu/8cbb6eed9ff3afbe91f27c594704c3b3f86baa8c.pdf",
        "text": "https://archive.orkl.eu/8cbb6eed9ff3afbe91f27c594704c3b3f86baa8c.txt",
        "img": "https://archive.orkl.eu/8cbb6eed9ff3afbe91f27c594704c3b3f86baa8c.jpg"
    }
}