{
    "id": "4197d231-d8d8-4e9c-ab03-1b0dd8f4c0df",
    "created_at": "2023-01-12T15:04:02.746557Z",
    "updated_at": "2025-03-27T02:05:37.617322Z",
    "deleted_at": null,
    "sha1_hash": "81fc5252201b79b304ac2adf2a376bff5bc3da91",
    "title": "2019-05-08 - “RobbinHood” ransomware takes down Baltimore City government networks",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:06Z",
    "file_modification_date": "2022-05-28T01:22:06Z",
    "file_size": 126381,
    "plain_text": "# “RobbinHood” ransomware takes down Baltimore City government networks\n\n**[arstechnica.com/information-technology/2019/05/baltimore-city-government-hit-by-robbinhood-ransomware/](https://arstechnica.com/information-technology/2019/05/baltimore-city-government-hit-by-robbinhood-ransomware/)**\n\nSean Gallagher\n\n[Enlarge / Most of Baltimore City's networks were shut down as a ransomware attack took](https://cdn.arstechnica.net/wp-content/uploads/2019/05/GettyImages-1140812138.jpg)\n\ndown mail servers and other systems at a number of city departments on May 7.\nAlex Wroblewski / Getty images\nSystems at a number of Baltimore’s city government departments were taken offline on May\n7 by a ransomware attack. As of 9:00am today, email and other services remain offline.\nPolice, fire, and emergency response systems have not been affected by the attack, but\nnearly every other department of the city government has been affected in some way.\n\nCalls to the city’s Office of Information Technology are being answered by a recording\nstating, “We are aware that systems are currently down. We are working to resolve the issue\nas quickly as possible.”\n\n\n-----\n\n[#BCRPALERT: BCRP is experiencing network and email outages. We apologize for](https://twitter.com/hashtag/BCRPALERT?src=hash&ref_src=twsrc%5Etfw)\nthe delay in all communications and are working to solve the problem. Please know our\nonline payment, permit, program registration and service requests are currently\neffected. [pic.twitter.com/vzXYnEqi7M](https://t.co/vzXYnEqi7M)\n\n[— Baltimore Rec & Parks (@RecNParks) May 7, 2019](https://twitter.com/RecNParks/status/1125812906598260738?ref_src=twsrc%5Etfw)\n\nLester Davis, a spokesperson for Baltimore’s Mayor’s office, told the Baltimore Sun’s Ian\nDuncan that the attack was similar to one that hit Greenville, North Carolina, in April.\n\nBaltimore Chief Information Officer Frank Johnson confirmed in a press conference today\n[that the malware was \"the very aggressive RobbinHood ransomware\" and that the FBI had](https://www.bleepingcomputer.com/news/security/a-closer-look-at-the-robbinhood-ransomware/)\nidentified it as a \"fairly new variant\" of the malware. This new variant of RobbinHood\nemerged over the past month.\n\nSecurity researcher Vitali Kremez, who recently reverse-engineered a sample of\nRobbinHood, told Ars that the malware appears to target only files on a single system and\ndoes not spread through network shares. “It is believed to be spread directly to the individual\n[machines via psexec and/or domain controller compromise,” Kremez said. “The reasoning](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\nbehind it is that the ransomware itself does not have any network spreading capabilities and\nis meant to be deployed for each machine individually.”\n\nThat would mean that the attacker would need to already have gained administrative-level\naccess to a system on the network “due to the way the ransomware interacts with\nC:\\Windows\\Temp directory,” Kremez explained.\n\nIn addition to requiring execution on each individually targeted machine, RobbinHood also\nrequires that a public RSA key already be present on the targeted computer in order to begin\nencryption of the files. “That means that the attacker likely deploys it in multiple steps, from\nobtaining access to the network in question, moving laterally to obtain administrative\nprivileges for a domain controller or via psexec, deploy and save public RSA key and\nransomware on each machine and then execute it,” Kremez noted.\n\nBefore it begins encryption, RobbinHood malware shuts down all connections to shared\nnetwork directories with a net use * /DELETE /Y command and then runs through 181\nWindows service shutdown commands—including the disabling of multiple malwareprotection tools, backup agents, and email, database, and Internet Information Server (IIS)\nadministrative services. That string of commands—which starts with an attempt to shut down\nKaspersky’s AVP agent—would create a lot of noise on any management system monitoring\nWindows systems’ event logs.\n\n[Just over a year ago, Baltimore’s 911 system was attacked by ransomware when](https://arstechnica.com/information-technology/2018/03/baltimores-911-system-boeing-join-atlanta-in-week-of-crypto-malware-outbreaks/)\nmaintenance on the city’s networks briefly left gaps in a firewall. The firewall change was\napparently only four hours old before the attackers exploited it—likely through an automated\nscan\n\n\n-----\n\nJohnson insisted that the city s information security provisions had been audited and were up\nto date. \"We've been assessed several times since I've been here, and we've gotten multiple\nclean bills of health,\" he said. \"We have a very good capability. Unfortunately, it's a race\nbetween bad actors and the cyber security industry.\"\n\nIn his press conference, Baltimore’s new mayor, Bernard “Jack” Young, said it was uncertain\nhow long the city's systems would be offline. \"There is a backup system with the IT\ndepartment,\" he said, \"but we can't just go and restore because we don’t know how far back\nthe virus goes. So I don’t want people to think that Baltimore doesn’t have a backup.\"\n\nIn the meantime, Young said, city employees would have to switch to doing things manually.\nIf city workers are idle for a substantial amount of time, Young said that he might ask them to\n\"help clean up the city.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-08 - “RobbinHood” ransomware takes down Baltimore City government networks.pdf"
    ],
    "report_names": [
        "2019-05-08 - “RobbinHood” ransomware takes down Baltimore City government networks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535842,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653700926,
    "ts_modification_date": 1653700926,
    "files": {
        "pdf": "https://archive.orkl.eu/81fc5252201b79b304ac2adf2a376bff5bc3da91.pdf",
        "text": "https://archive.orkl.eu/81fc5252201b79b304ac2adf2a376bff5bc3da91.txt",
        "img": "https://archive.orkl.eu/81fc5252201b79b304ac2adf2a376bff5bc3da91.jpg"
    }
}