{
    "id": "41bd9573-f0a7-4788-bcb3-d945567087b8",
    "created_at": "2022-10-25T16:48:13.456247Z",
    "updated_at": "2025-03-27T02:05:32.723114Z",
    "deleted_at": null,
    "sha1_hash": "b0288ae342af69886daf394178fdaed92882d0cb",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-05-12T09:31:42Z",
    "file_modification_date": "2020-05-12T09:39:17Z",
    "file_size": 1694793,
    "plain_text": "# Modern Bank Heists 3.0\n\n### 25 CISOs from leading financial institutions reveal their thoughts on the 2020 attack landscape\n\n###### Tom Kellermann, Head of Cybersecurity Strategy Ryan Murphy, Security Strategy\n\n May 2020\n\n\n-----\n\n### Executive Summary\n\nThis marks the third edition of the Modern Bank Heists report,\nwhich takes an annual pulse of some of the financial industry’s\ntop CISOs and security leaders. Thank you, again, for reading\nalong and thank you to the 25 security leaders who participated\nin this year’s survey.\n\nThis survey offers more than just data. We use the information\ngleaned from this report to educate the market on how modern\ncybercriminals are evolving; what tactics, techniques and\nprocedures (TTPs) are emerging; and how defenders can\nkeep pace. Perhaps most importantly, we use the information\nto deliver a stronger cybersecurity platform to the market.\n\nIn this year’s survey, CISOs revealed what they’re seeing with\nattack prevalence and evolution. Our questions tackled topics\nincluding lateral movement, counter-incident response, island\nhopping and integrity attacks. The financial sector is\nnot a new target for criminals. Of course, the bank heist has\nevolved significantly—from stickups to cyberspace—but the\nfundamental motivation behind the attacks has remained:\nmoney. This evolution is best reflected in a conversation we\nrecently had with Jonah Force Hill, senior cyber policy advisor\nand executive director of the U.S. Secret Service Cyber\nInvestigations Advisory Board (CIAB), who told us:\n\n\n“This year, while virtually all sectors of the global economy\n_fell victim to cybercrime of one kind or another, no sector_\n_was more regularly targeted than the financial sector._\n_At an alarming rate, transnational organized crime groups_\n_are leveraging specialist providers of cybercrime tools and_\n_services to conduct a wide range of crimes against financial_\n_institutions, including ransomware campaigns, distributed_\n_denial of service (DDoS) attacks and business email_\n_compromise (BEC) scams. Criminals are increasingly sharing_\nresources and information and reinvesting their illicit profits\ninto the development of new, even more destructive\ncapabilities. The growing availability of ready-made malware is\n_creating opportunities for even inexperienced criminal actors to_\n_launch their own operations. When combined with a steady_\n_commercial growth of mobile devices, cloud-based data_\n_storage and services, and digital payment systems,_\n_cybercriminals today have an ever-expanding host of_\n_attack vectors to exploit. Every organization—providers of_\nfinancial services, in particular—must remain vigilant in the\nface of these evolving threats. It is critical that organizations\n_maintain a continuous dialogue with law enforcement to ensure_\n_a rapid response in the event of an incident.”_\n\nThe authors would like to thank VMware Carbon Black Team\nCerberus for their analytics research for this report.\n\n\n-----\n\n### Key Data\n\n\n#### 80%\n\n 27%\n\n 238\n\n 82%\n\n 64%\n\n\nof surveyed financial institutions reported an increase\nin cyberattacks over the past 12 months, a 13 percent\nincrease over 2019.\n\nof all cyberattacks in 2020 have targeted either the\nhealthcare sector or the financial sector, according to\nVMware Carbon Black data.\n\nFrom February to April 2020, amid the COVID-19\nsurge, cyberattacks against the financial sector\nincreased by 238 percent, according to VMware\nCarbon Black data.\n\nof surveyed financial institutions said cybercriminals\nhave become more sophisticated, leveraging highly\ntargeted social engineering attacks and advanced\nTTPs for hiding malicious activity. These criminals\nexploit weaknesses in people, processes and\ntechnology to gain a foothold and persist in the\nnetwork, enabling the ability to transfer funds and\nexfiltrate sensitive data.\n\nof surveyed financial institutions reported increased\nattempts of wire fraud transfer, a 17 percent increase\nover 2019. These attacks are often performed\nby exploiting gaps in the wire transfer verification\nprocess or through social engineering attacks\ntargeting customer service representatives and\nconsumers directly.\n\n\n#### 33%\n\n 25%\n\n 24%\n\n 20%\n\n\nof surveyed financial institutions said they’ve\nencountered island hopping, an attack where supply\nchains and partners are commandeered to target the\nprimary financial institution.\n\nof surveyed financial institutions said they were\ntargeted by destructive attacks over the past year.\nDestructive attacks are rarely conducted for financial\ngain. Rather, these attacks are launched to be punitive\nby destroying data.\n\nof surveyed financial institutions said they’ve\nencountered an attack leveraging counter-incident\nresponse.\n\nof surveyed financial institutions experienced a\nwatering-hole attack during the past year. In these\nattacks, financial institution and bank regulation\nwebsites are hijacked and used to pollute visitors’\nbrowsers. This tactic is increasing as cybercriminals\nrecognize the implicit trust consumers have in bank\nbrands.\n\nRansomware attacks against the financial sector have\nincreased by 9x from the beginning of February to\nthe end of April 2020.\n\n\n-----\n\n### Attack Prevalence and Sophistication\n\nEach year we’ve produced this survey, we’ve been interested to see the trend with respect to\nattack frequency and sophistication. For this year’s report, both numbers have increased over\n2019. 80 percent of surveyed banks said they’ve seen an increase in cyberattacks over the\npast 12 months, marking a 13 percent increase over 2019. And 2020 has offered a glimpse into a\nnew world. Cybercriminals are taking advantage of COVID-19, and they are doing so in tandem\nwith the news cycle.\n\n\n75%\n\n50%\n\n\n1. First United States\nconfirmed case.\n\n2. President Trump announced\nentry ban on foreign nationals.\n\n\n25%\n\n-0%\n\n\n3. Announcement that 2,400+\nhave died globally from COVID-19\nrelated illnesses.\n\n4. First death in the United States.\n\n\n-25%\n\n-50%\n\n\n5. Florida declares public health\nemergency, followed by several\nother states.\n\n6. Italy COVID-19 cases\nsurpass 2,000.\n\n\n-75%\n\nFIGURE 1: Relative percentage increase and decrease by day for notable alerts observed in VMware Carbon Black data. The baseline is represented on the y-axis by 0 percent in\nFigure 1.\n\n|2 8|3. Announceme have died globa related illnesses|\n|---|---|\n||related illnesse|\n||4. First death in 5. Florida decla|\n||emergency, foll other states.|\n||6. Italy COVID- surpass 2,000.|\n\n\n7. Italy starts lockdown.\n\n8. WHO declares a pandemic.\n\n\n-----\n\n###### As to what specifically financial organizations are seeing, we dug into VMware Carbon Black customer data. Kryptik and Emotet continue to be among the top attacks seen across multiple sectors, including finance. These malware types are often used in longer, more complex campaigns where the end goal is to leverage native operating system tools to remain invisible or gain a foothold on one system (sometimes a supply-chain partner) to island hop to a larger, more lucrative target.\n\n##### Kryptik\n###### The Kryptik trojan attempts to target victim machines via malicious installers. It then attempts to acquire admin rights to make registry modifications, allowing it to execute each time a Windows machine boots. The Kryptik trojan can be very persistent and, without the appropriate visibility, can be difficult to detect as it attempts to delete its executable file after running.\n\n As noted by a threat profile from the New Jersey Cybersecurity and Communications Integration Cell (NJCCIC): “[The Kryptik trojan] queries the Windows registry for the .ini or .dat file paths. It also queries registry subkeys for the actual host, username, and password related to the specific FTP client application. Kryptik searches the registry, querying for both ftpIniName and InstallDir that hold the wcx_ftp.ini file. The trojan can recover many common FTP clients, email clients, file browsers, and file manager programs. Kryptik also can update itself and remotely download new versions.”[ 1]\n\n##### Emotet\n###### Emotet is a family of banking malware, which has been around since at least 2014. Attackers continue to leverage variants of Emotet and are becoming increasingly shrewd in the techniques they employ to deliver the malware onto an infected system.\n\n[1. New Jersey Cybersecurity and Communications Integration Cell. “Kryptik.” December 15, 2016.](https://njccic.squarespace.com/threat-profiles/trojan-variants/kryptik)\n\n\n###### 82 percent said attacks have become more sophisticated, a slight increase over 2019.\n\n Kryptik was among the infections found in the notorious attack targeting the Ukrainian power grid in late 2015.\n\n\n-----\n\nKryptik (40.23%)\n\nObfuse (26.82%)\n\nEmotet (23.86%)\n\nCoinMiner (16.59%)\n\nTiggre (15.68%)\n\n0 10 20 30 40 50\n\nFIGURE 2: The most prevalent threats affecting the finance sector from March 2019 to February 2020.\n\n###### Researchers have observed the adaptation to existing methods leveraging PowerShell, where attackers were encrypting the URLs of the command and control (C2) systems used to host the second stage payload. VMware Carbon Black has observed a spike in this type of technique being detected across customers utilizing their managed hunting services.\n\n Several attacks have been observed as originating from phishing campaigns that are leveraging Microsoft Office Word documents with obfuscated VBScripts using PowerShell and the ConvertTo-SecureString cmdlet, which in the later stages is used to decrypt the C2(s) and associated logic. This represented an evolution of current macro attack techniques, where these types of cmdlets are not typically associated with phishing campaigns.\n\n\n-----\n\n### Attack Behaviors\n\nOver the past two years, we’ve made a concerted effort to move beyond just looking at individual\npieces of malware and focus more deeply on attacker behavior. To that end, the MITRE ATT&CK\nframework has set an excellent standard and closely aligns with the VMware Carbon Black belief that\ndetecting attacker behavior is exponentially more important than detecting malware alone.\nWith that in mind, we wanted to see what the top attacker behaviors targeting the financial sector\nhave been over the past 12 months.\n\nAccording to MITRE, “adversaries may attempt to get information about running processes on a\nsystem. Information obtained could be used to gain an understanding of common software running\non systems within the network. Adversaries may use the information from Process Discovery during\nautomated discovery to shape follow-on behaviors, including whether or not the adversary fully\ninfects the target and/or attempts specific actions.”[ 2]\n\nThis is of particular importance in the financial sector as cybercriminals have dramatically\nincreased their knowledge of the policies and procedures of financial institutions. They are keenly\naware of the incident response (IR) stratagems being employed by IR teams and the blind spots\nthat exist within every institution. Given the tactical shifts of the cognitive attack loop, they are\nmaintaining and manipulating their positions within networks because of the noise created by\nincident response and the lack of security controls integration.\n\n[2. The MITRE Corporation. “Process Discovery.” August 12, 2019.](https://attack.mitre.org/techniques/T1057/)\n\n\nThe most prevalent\nMITRE threat ID\naffecting the finance\nsector (64 percent of\nattacks) over the past\nyear has been T1507 Process Discovery.\n\n###### 25%\n\nAnother notable threat\nID (25 percent of\nattacks) has been T1055\n\n- Process Injection.\n\n\n-----\n\nAccording to MITRE, “process injection is a method of executing arbitrary code in the address\nspace of a separate live process. Running code in the context of another process may allow\naccess to the process’s memory, system/network resources, and possibly elevated privileges.\nExecution via process injection may also evade detection from security products since the\nexecution is masked under a legitimate process. Malware commonly utilizes process injection to\naccess system resources through which Persistence and other environment modifications can be\nmade. More sophisticated samples may perform multiple process injections to segment modules\nand further evade detection, utilizing named pipes or other inter-process communication (IPC)\nmechanisms as a communication channel.”[ 3]\n\nMITRE_T1065_UNCOMMONLY_USED PORT\n\n(2.4%)\n\nMITRE_T1005_DATA_FROM_LOCAL_SYS\n\n(2.97%)\n\nMITRE_T1106_EXEC_API\n\n(4.79%)\n\nMITRE_T1055_PROCESS_INJECT\n\n(25.04%)\n\nMITRE_T1507_PROCESS_DISCOVERY\n\n(64.81%)\n\n0 10 20 30 40 50 60 70\n\nFIGURE 3: The most prevalent MITRE threat IDs affecting the finance sector from March 2019 to February 2020.\n\n[3. The MITRE Corporation. “Process Injection.” Anastasios Pingios, Christiaan Beek and Ryan Becwar. July 18, 2019.](https://attack.mitre.org/techniques/T1055)\n\n\n-----\n\n### A Rise in Virtual Invasions\n\nThere have been some interesting evolutions since our 2019 report. Of note, 64 percent of\nsurveyed financial institutions reported increased attempts of wire fraud transfer, a 17 percent\nincrease over 2019.\n\nWire fraud transfer attacks are often performed by exploiting business process gaps in the wire\ntransfer verification process or through social engineering attacks targeting customer service\nrepresentatives and consumers directly.\n\nCybercriminals exhibit tremendous situational awareness regarding SWIFT messaging. This is\ncompounded with their newfound understanding of the criticality of portfolio managers’ positions.\n\nThere has been an awakening in the dark web as it relates to the value of non-public market\ninformation, which is stored on endpoints and often protected by legacy technology.\n\nTrust and confidence can be undermined as cybercriminals appreciate that it is more valuable\nto commandeer the digital transformation efforts of the financial institution than to target its\ncustomers directly.\n\n\nThere has been an awakening in the dark web as it relates to the value of non-public market\ninformation, which is stored on endpoints and often protected by legacy technology.\n\nTrust and confidence can be undermined as cybercriminals appreciate that it is more valuable\nto commandeer the digital transformation efforts of the financial institution than to target its\n\n\n-----\n\n### Island Hopping\n\n33 percent of surveyed financial institutions said they’ve encountered island hopping, an attack\nwhere supply chains and partners are commandeered to target the primary financial institution.\n\n##### There are four types of island hopping most commonly seen today\nNetwork-based island hopping is the most frequently used form of island hopping. With networkbased island hopping, attackers infiltrate one network and use it to hop onto an affiliate network.\n\nWhile much less common, watering-hole attacks (one out of every five attacks targeting financial\ninstitutions) still make up a solid portion of island-hopping attacks. In these attacks, hackers\ntarget a website frequently visited by partners or customers of the organization they are trying to\nbreach. It is important to note that watering holes are not limited to websites and can manifest on\nmobile applications.\n\nThere has been a newer trend in cybercrime that mainly targets the financial sector. Reverse\nbusiness email compromise attacks occur when a hacker successfully takes over a victim’s\nemail server and executes fileless malware attacks against members of the organization as well\nas the board.\n\nIsland hopping as a service, or access mining is a tactic where an attacker leverages the footprint\nand distribution of commodity malware—in this case, a cryptominer—using it to mask a hidden\nagenda of selling system access to targeted machines on the dark web.\n\n\n-----\n\nIn 2019, the VMware Carbon Black Threat Analysis Unit uncovered a secondary component in a wellknown cryptomining campaign. The malware had been enhanced to exfiltrate system access\ninformation for sale on the dark web. This discovery indicated a bigger trend of commodity malware\nevolving and will likely catalyze a change in the way cybersecurity professionals classify, investigate\nand protect themselves from commodity threats. Dark web forums now specialize in the sale of\naccess to specific financial institutions via provisioning access to buyers via a remote access trojan.\n\nDestructive attacks are rarely conducted for financial gain. Rather, these attacks are launched\npunitively to destroy data and dismantle subnets. It is worthy to note that cybercriminals in the\nfinancial sector will typically only leverage destructive attacks as an escalation to burn the evidence\nas part of a counter-incident response. According to MITRE, “Adversaries may destroy data and files\non specific systems or in large numbers on a network to interrupt availability to systems, services,\nand network resources. Data destruction is likely to render stored data irrecoverable by forensic\ntechniques through overwriting files or data on local and remote drives.” It may have “worm-like\nfeatures to propagate across a network by leveraging additional techniques like Valid Accounts,\nCredential Dumping, and Windows Admin Shares.” [4] This challenges us to become more clandestine\nin how we conduct IR and to increase our threat hunting exercises.\n\n[4. The MITRE Corporation. “Data Destruction.” July 19, 2019.](https://attack.mitre.org/techniques/T1485)\n\n\n25 percent of surveyed\nfinancial institutions said\nthey were targeted by\ndestructive attacks over\nthe past year.\n\n\ntechniques through overwriting files or data on local and remote drives.” It may have “worm-like\nfeatures to propagate across a network by leveraging additional techniques like Valid Accounts,\nCredential Dumping, and Windows Admin Shares.” [4] This challenges us to become more clandestine\nin how we conduct IR and to increase our threat hunting exercises.\n\n.” July 19, 2019.\n\n\n-----\n\nWipers continue to trend upward as adversaries (including Iran) began to realize the utility of purely\ndestructive attacks. Leveraging techniques across the full spectrum of MITRE ATT&CK, wipers rely\nheavily on defense evasion techniques (64 percent of analyzed samples).\n\n**T1485** Impact: Data Destruction\n\n**T1045** Defense Evasion:\nSoftware Packing\n\n**T1056** Collection, Credential Access:\nInput Capture\n\n**T1143** Defense Evasion:\nHidden Window\n\n**T1060** Persistence: Registry Run Keys/\nStartup Folder\n\n**T1071** Command & Control: Standard\nApplication Layer Protocol\n\n**T1112** Defense Evasion:\nModify Registry\n\n**T1027** Defense Evasion: Obfuscated\nFiles or Information\n\n**T1057** Discovery: Process Discovery\n\n**T1083** Discovery: File &\nDirectory Discovery\n\n\n24 percent of surveyed\nfinancial institutions said\nthey’ve encountered an\nattack leveraging a\ncounter-incident response.\n\nFigure 4 highlights the various\nMITRE ATT&CK TTPs associated\nwith malware generally classified\nas wipers.\n\n\n0 10 20 30 40\n\n\nTotal Counts\n\n\nFIGURE 4: Top 10 wiper behaviors in 2019.\n\nThe most common behaviors seen across all wiper attack data mapped to the MITRE ATT&CK\nframework were data destruction (33 percent); software packing for defense evasion (20 percent);\ninput capture for collection and credential access (19 percent); hidden windows for defense evasion\n(18 percent); and registry run keys in the startup folder for persistence (10 percent).\n\n\n-----\n\nBank heists are transitioning to hostage situations. Cybercriminals have no desire to leave the\nenvironment after the heist. They will fight to remain persistent on a financial institution’s network.\nWe expect this phenomenon to metastasize in 2020. Deletion of logs, manipulation of time stamps\nand disabling of security controls will become par for the course.\n\nGive these realities, it’s imperative we alter how we respond to incidents. Greg Foss, senior threat\nresearcher at VMware Carbon Black, suggests the following rule of five.\n\n###### 1. Stand up a secondary line of secure communications.\nThis is vital to discuss the ongoing incident. Assume that all internal communications can be\nintercepted, viewed, modified and otherwise compromised by the adversary. These secondary\ncommunications should allow for talk, text and file transfer.\n\n###### 2. Assume the adversary has multiple means of gaining access into the environment.\nShutting off one entry point may not actually remove them from your network. This will very likely\nhave just the opposite effect by notifying the attacker(s) that you’re onto them.\n\n###### 3. Watch and wait.\nDo not immediately start blocking malware activity and shutting off access. Do not immediately\nterminate the C2. To understand all avenues of re-entry, you must monitor the situation to fully\ngrasp the scope of the intrusion to effectively develop a means of actually removing the adversary\nfrom the environment.\n\n###### 4. Deploy agents (if you must) in monitor-only mode.\nIf you begin blocking or otherwise impeding their activities, they will catch on and change tactics,\npotentially leaving you blind to their additional means of re-entry.\n\n###### 5. Deploy honey tokens or deception grids.\nEspecially on attack paths that cannot be hardened.\n\n\n-----\n\n## Conclusion\n\nCybercriminals are evolving in both attack sophistication and organization. The financial sector is the\nmost secure industry in the world, but it is also being targeted by cybercriminals and nation-states.\nWe must pay close attention to how we respond to these threat actors and what their ultimate goal\nis—hijacking your digital transformation efforts via island hopping. Cybersecurity is now a brand\nprotection imperative. Trust and confidence in the safety and soundness of your institution will\ndepend on it. This report should serve as a starting point for a discussion between the cybersecurity\ncommunity and the defenders of the financial sector on how we might best collaborate and wage a\ncounterinsurgency in cyberspace.\n\n\n-----\n\nVMware, Inc. 3401 Hillview Avenue Palo Alto CA 94304 USA Tel 877-486-9273 Fax 650-427-5001 vmware.com Copyright © 2020 VMware, Inc. All rights reserved. This\nproduct is protected by U.S. and international copyright and intellectual property laws. VMware products are covered by one or more patents listed at vmware.com/go/patents. VMware is a\n\n\n## About VMware\n\nVMware software powers the world’s complex digital infrastructure.\nThe company’s cloud, app modernization, networking, security and digital\nworkspace offerings help customers deliver any application on any cloud across\nany device. Headquartered in Palo Alto, California, VMware is committed to\nbeing a force for good, from its breakthrough technology innovations to its\nglobal impact. For more information, please visit vmware.com/company.\n\n##### Join us online:\n\nVMware, Inc. 3401 Hillview Avenue Palo Alto CA 94304 USA Tel 877-486-9273 Fax 650-427-5001 vmware.com Copyright © 2020 VMware, Inc. All rights reserved. This\nproduct is protected by U.S. and international copyright and intellectual property laws. VMware products are covered by one or more patents listed at vmware.com/go/patents. VMware is a\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.vmware.com/content/dam/digitalmarketing/vmware/en/pdf/docs/vmwcb-report-modern-bank-heists-2020.pdf"
    ],
    "report_names": [
        "vmwcb-report-modern-bank-heists-2020.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1589275902,
    "ts_modification_date": 1589276357,
    "files": {
        "pdf": "https://archive.orkl.eu/b0288ae342af69886daf394178fdaed92882d0cb.pdf",
        "text": "https://archive.orkl.eu/b0288ae342af69886daf394178fdaed92882d0cb.txt",
        "img": "https://archive.orkl.eu/b0288ae342af69886daf394178fdaed92882d0cb.jpg"
    }
}