{
    "id": "41d4630d-050e-4256-9117-1d97330a4ca6",
    "created_at": "2023-01-12T15:06:50.994603Z",
    "updated_at": "2025-03-27T02:16:25.920405Z",
    "deleted_at": null,
    "sha1_hash": "db815ee1fc61b1247f98e2f1227b065b966139df",
    "title": "2020-03-20 - The Case for Limiting Your Browser Extensions",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:23Z",
    "file_modification_date": "2022-05-28T04:10:23Z",
    "file_size": 1272047,
    "plain_text": "# The Case for Limiting Your Browser Extensions\n\n**[krebsonsecurity.com/2020/03/the-case-for-limiting-your-browser-extensions/](https://krebsonsecurity.com/2020/03/the-case-for-limiting-your-browser-extensions/)**\n\n[Last week, KrebsOnSecurity reported to health insurance provider Blue Shield of California](https://www.blueshieldca.com/)\nthat its Web site was flagged by multiple security products as serving malicious content. Blue\nShield quickly removed the unauthorized code. An investigation determined it was injected\nby a browser extension installed on the computer of a Blue Shield employee who’d edited\nthe Web site in the past month.\n\nThe incident is a reminder that browser extensions — however useful or fun they may seem\nwhen you install them — typically have a great deal of power and can effectively read and/or\nwrite all data in your browsing sessions. And as we’ll see, it’s not uncommon for extension\nmakers to sell or lease their user base to shady advertising firms, or in some cases abandon\nthem to outright cybercriminals.\n\nThe health insurance site was compromised after an employee at the company edited\ncontent on the site while using a Web browser equipped with a once-benign but nowcompromised extension which quietly injected code into the page.\n\n[The extension in question was Page Ruler, a Chrome addition with some 400,000](https://chrome.google.com/webstore/detail/page-ruler/emliamioobfffbgcfdchabfibonehkme?hl=en)\ndownloads. Page Ruler lets users measure the inch/pixel width of images and other objects\n[on a Web page. But the extension was sold by the original developer a few years back, and](https://github.com/wrakky/page-ruler/issues/101)\nfor some reason it’s still available from the Google Chrome store despite multiple recent\nreports from people blaming it for spreading malicious code.\n\nHow did a browser extension lead to a malicious link being added to the health insurance\ncompany Web site? This compromised extension tries to determine if the person using it is\ntyping content into specific Web forms, such as a blog post editing system like WordPress or\n**Joomla.**\n\nIn that case, the extension silently adds a request for a javascript link to the end of whatever\nthe user types and saves on the page. When that altered HTML content is saved and\npublished to the Web, the hidden javascript code causes a visitor’s browser to display ads\nunder certain conditions.\n\n\n-----\n\nWho exactly gets paid when those ads are shown or clicked is not clear, but there are a few\nclues about who’s facilitating this. The malicious link that set off antivirus alarm bells when\npeople tried to visit Blue Shield California downloaded javascript content from a domain\ncalled linkojager[.]org.\n\nThe file it attempted to download — 212b3d4039ab5319ec.js — appears to be named after\nan affiliate identification number designating a specific account that should get credited for\nserving advertisements. A simple Internet search shows this same javascript code is present\non [hundreds of other Web sites, no doubt inadvertently published by site owners who](https://krebsonsecurity.com/wp-content/uploads/2020/03/212b3d4039ab5319ecjs.txt)\nhappened to be editing their sites with this Page Ruler extension installed.\n\nIf we download a copy of that javascript file and view it in a text editor, we can see the\nfollowing message toward the end of the file:\n\n[NAME OF EXTENSION HERE]’s development is supported by advertisements that\nare added to some of the websites you visit. During the development of this extension,\nI’ve put in thousands of hours adding features, fixing bugs and making things better,\nnot mentioning the support of all the users who ask for help.\n\nAds support most of the internet we all use and love; without them, the internet we\nhave today would simply not exist. Similarly, without revenue, this extension (and the\nupcoming new ones) would not be possible.\n\nYou can disable these ads now or later in the settings page. You can also minimize the\nads appearance by clicking on partial support button. Both of these options are\navailable by clicking \\’x\\’ button in the corner of each ad. In both cases, your choice will\nremain in effect unless you reinstall or reset the extension.\n\nThis appears to be boilerplate text used by one or more affiliate programs that pay\ndevelopers to add a few lines of code to their extensions. The opt-out feature referenced in\nthe text above doesn’t actually work because it points to a domain that no longer resolves —\n**thisadsfor[.]us. But that domain is still useful for getting a better idea of what we’re dealing**\nwith here.\n\n[Registration records maintained by DomainTools [an advertiser on this site] say it was](https://www.domaintools.com/)\noriginally registered to someone using the email address frankomedison1020@gmail.com.\nA reverse WHOIS search on that unusual name turns up several other interesting domains,\nincluding icontent[.]us.\n\nicontent[.]us is currently not resolving either, but [a cached version of it at Archive.org shows](https://web.archive.org/web/20170421092836/http://icontent.us/#features)\nit once belonged to an advertising network called Metrext, which marketed itself as an\nanalytics platform that let extension makers track users in real time.\n\n\n-----\n\nAn archived copy of the content once served at icontent[.]us promises “plag’n’play” capability.\n\n“Three lines into your product and it’s in live,” iContent enthused. “High revenue per user.”\n\nAnother domain tied to Frank Medison is cdnpps[.]us, which currently redirects to the\ndomain “monetizus[.]com.” Like its competitors, Monetizus’ site is full of grammar and\nspelling errors: “Use Monetizus Solutions to bring an extra value to your toolbars, addons\nand extensions, without loosing an audience,” the company says in a banner at the top of its\nsite.\n\nBe sure not to “loose” out on sketchy moneymaking activities!\n\n\n-----\n\nContacted by KrebsOnSecurity, Page Ruler s original developer Peter Newnham confirmed\nhe sold his extension to MonetizUs in 2017.\n\n“They didn’t say what they were going to do with it but I assumed they were going to try to\nmonetize it somehow, probably with the scripts their website mentions,” Newnham said.\n\n“I could have probably made a lot more running ad code myself but I didn’t want the hassle\nof managing all of that and Google seemed to be making noises at the time about cracking\ndown on that kind of behaviour so the one off payment suited me fine,” Newnham said.\n“Especially as I hadn’t updated the extension for about 3 years and work and family life\nmeant I was unlikely to do anything with it in the future as well.”\n\nMonetizus did not respond to requests for comment.\n\nNewnham declined to say how much he was paid for surrendering his extension. But it’s not\ndifficult to see why developers might sell or lease their creation to a marketing company:\nMany of these entities offer the promise of a hefty payday for extensions with decent\nfollowings. For example, one competing extension monetization platform called\n**AddonJet claims it can offer revenues of up to $2,500 per day for every 100,000 user in the**\nUnited States (see screenshot below).\n\nRead here how its work!\n\n\n-----\n\nI hope it s obvious by this point, but readers should be extremely cautious about installing\nextensions — sticking mainly to those that are actively supported and respond to user\nconcerns. Personally, I do not make much use of browser extensions. In almost every case\nI’ve considered installing one I’ve been sufficiently spooked by the permissions requested\nthat I ultimately decided it wasn’t worth the risk.\n\nIf you’re the type of person who uses multiple extensions, it may be wise to adopt a riskbased approach going forward. Given the high stakes that typically come with installing an\nextension, consider carefully whether having the extension is truly worth it. This applies\nequally to plug-ins designed for Web site content management systems\nlike WordPress and Joomla.\n\nDo not agree to update an extension if it suddenly requests more permissions than a\nprevious version. This should be a giant red flag that something is not right. If this happens\nwith an extension you trust, you’d be well advised to remove it entirely.\n\nAlso, never download and install an extension just because some Web site says you need it\nto view some type of content. Doing so is almost always a high-risk proposition. Here, Rule\n#1 from [KrebsOnSecurity’s Three Rules of Online Safety comes into play: “If you didn’t go](https://krebsonsecurity.com/2011/05/krebss-3-basic-rules-for-online-safety/)\nlooking for it, don’t install it.” Finally, in the event you do wish to install something, make sure\nyou’re getting it directly from the entity that produced the software.\n\nGoogle Chrome users can see any extensions they have installed by clicking the three dots\nto the right of the address bar, selecting “More tools” in the resulting drop-down menu, then\n“Extensions.” In Firefox, click the three horizontal bars next to the address bar and select\n“Add-ons,” then click the “Extensions” link on the resulting page to view any installed\nextensions.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-20 - The Case for Limiting Your Browser Extensions.pdf"
    ],
    "report_names": [
        "2020-03-20 - The Case for Limiting Your Browser Extensions.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536010,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653711023,
    "ts_modification_date": 1653711023,
    "files": {
        "pdf": "https://archive.orkl.eu/db815ee1fc61b1247f98e2f1227b065b966139df.pdf",
        "text": "https://archive.orkl.eu/db815ee1fc61b1247f98e2f1227b065b966139df.txt",
        "img": "https://archive.orkl.eu/db815ee1fc61b1247f98e2f1227b065b966139df.jpg"
    }
}