{
    "id": "422581a7-32d7-407c-b8b0-ee0774c7d973",
    "created_at": "2023-01-12T15:00:18.212724Z",
    "updated_at": "2025-03-27T02:06:11.415567Z",
    "deleted_at": null,
    "sha1_hash": "b89eb8269cf66c2f12fc7619e4ecac258fce1ab9",
    "title": "2022-03-21 - Serpent malware campaign abuses Chocolatey Windows package manager",
    "authors": "",
    "file_creation_date": "2022-05-28T23:46:37Z",
    "file_modification_date": "2022-05-28T23:46:37Z",
    "file_size": 1869057,
    "plain_text": "# Serpent malware campaign abuses Chocolatey Windows package manager\n\n**[bleepingcomputer.com/news/security/serpent-malware-campaign-abuses-chocolatey-windows-package-manager/](https://www.bleepingcomputer.com/news/security/serpent-malware-campaign-abuses-chocolatey-windows-package-manager/)**\n\nBill Toulas\n\nBy\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nMarch 21, 2022\n01:10 PM\n3\n\nThreat actors are abusing the popular Chocolatey Windows package manager in a new\nphishing campaign to install new 'Serpent' backdoor malware on systems of French\ngovernment agencies and large construction firms.\n\nChocolatey is an open-source package manager for Windows that allows users to install\nand manage over 9,000 applications and any dependencies through the command line.\n\nIn a new phishing campaign discovered by Proofpoint, threat actors use an intricate\ninfection chain consisting of macro-laced Microsoft Word documents, the Chocolatey\npackage manager, and steganographic images to infect devices while bypassing detection.\n\n## Steganography + Chocolatey to evade detection\n\n\n-----\n\nProofpoint researchers discovered a new phishing campaign targeting French organizations\nin the construction, real estate, and government industries.\n\nThe multi-step attack starts with a phishing email impersonating the European Union's\nGeneral Data Protection Regulations agency (GDPR). This email includes a Word\ndocument attachment document containing malicious macro code.\n\n**The GDPR-themed document containing macro code** _(Proofpoint)_\nIf opened and content is enabled, the malicious macro fetches an image of Swiper the Fox\nfrom the cartoon series Dora the Explorer.\n\n\n-----\n\n**Fox image containing encoded**\n\n**PowerShell** _(Proofpoint)_\nHowever, this image is not entirely harmless, as it uses Steganography to hide a\nPowerShell script that the macros will execute. Steganography is used to hide data, in this\ncase, malicious code, to evade detection by users and antivirus tools as it appears like a\nregular image.\n\nThe PowerShell script will first download and install the Chocolatey Windows package\nmanager, which is then used to install the Python programming language and the PIP\npackage installer, as shown below.\n\n**PowerShell script hidden within the image**\n\n_Source: BleepingComputer_\nChocolatey is also being used to evade detection by security software as it is commonly\nused in enterprise environments to manage software remotely and could be on an allowed\nlist in IT environments.\n\n\"Proofpoint has not previously observed a threat actor use Chocolatey in campaigns,\"\n[Proofpoint researchers explain in their report.](https://www.proofpoint.com/us/blog/threat-insight/serpent-no-swiping-new-backdoor-targets-french-entities-unique-attack-chain)\n\n\n-----\n\nEventually, a second steganographic image is downloaded to load the Serpent backdoor,\nwhich is Python-based malware, hence the need for the previously installed packages in the\nprevious steps.\n\n**Serpent's infection chain** _(Proofpoint)_\nOnce loaded, the Serpent backdoor malware will communicate with the attacker's command\nand control server to receive commands to execute on the infected device.\n\nProofpoint says that the backdoor can execute any command sent by the attacks, allowing\nthe threat actors to download further malware, open reverse shells, and gain complete\naccess to the device.\n\nChocolatey told BleepingComputer that they were not aware that their software was abused\nin the manner and are looking into it.\n\n## Likely a new threat actor\n\nApart from the custom backdoor (Serpent) and the abuse of Chocolatey, which hasn't been\npreviously observed in the cyberthreat space, Proofpoint also noticed a novel application of\nsigned binary proxy execution using schtrasks.exe, essentially a new detection bypass\ntechnique.\n\n\n-----\n\nThese elements indicate that the threat actor is a new group, characterized by high\nsophistication and capabilities, and not linked to other known operatives.\n\nProofpoint couldn't detect anything that may be used to attribute the activity to a particular\nthreat actor, which is indicative of the actor's overall operational security.\n\nWhile the goal of the unknown adversary hasn't been determined yet, it appears that the\ntactics point towards espionage, with data access, host control, and the installation of\nadditional payloads being the main pillars of the attacks.\n\n**[Update 24 March 2022 - Chocolatey has published a blog post on its site to address](https://blog.chocolatey.org/2022/03/chocolatey-used-french-phishing-campaign/)**\ncommon questions and ease the worries of its userbase about the software being\nvulnerable to exploitation.\n\n### Related Articles:\n\n[Russian state hackers hit Ukraine with new malware variants](https://www.bleepingcomputer.com/news/security/russian-state-hackers-hit-ukraine-with-new-malware-variants/)\n\n[Backdoor baked into premium school management plugin for WordPress](https://www.bleepingcomputer.com/news/security/backdoor-baked-into-premium-school-management-plugin-for-wordpress/)\n\n[BPFDoor malware uses Solaris vulnerability to get root privileges](https://www.bleepingcomputer.com/news/security/bpfdoor-malware-uses-solaris-vulnerability-to-get-root-privileges/)\n\n[BPFDoor: Stealthy Linux malware bypasses firewalls for remote access](https://www.bleepingcomputer.com/news/security/bpfdoor-stealthy-linux-malware-bypasses-firewalls-for-remote-access/)\n\n[Hackers target Russian govt with fake Windows updates pushing RATs](https://www.bleepingcomputer.com/news/security/hackers-target-russian-govt-with-fake-windows-updates-pushing-rats/)\n\n[Backdoor](https://www.bleepingcomputer.com/tag/backdoor/)\n[Chocolatey](https://www.bleepingcomputer.com/tag/chocolatey/)\n[France](https://www.bleepingcomputer.com/tag/france/)\n[Hackers](https://www.bleepingcomputer.com/tag/hackers/)\n[Steganography](https://www.bleepingcomputer.com/tag/steganography/)\n\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nBill Toulas is a technology writer and infosec news reporter with over a decade of\nexperience working on various online publications. An open source advocate and Linux\nenthusiast, is currently finding pleasure in following hacks, malware campaigns, and data\nbreach incidents, as well as by exploring the intricate ways through which tech is swiftly\ntransforming our lives.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/microsoft-investigating-claims-of-hacked-source-code-repositories/)\n[Next Article](https://www.bleepingcomputer.com/news/microsoft/windows-zero-day-flaw-giving-admin-rights-gets-unofficial-patch-again/)\n\n### Comments\n\n\n-----\n\n[knightcyber - 2 months ago](https://www.bleepingcomputer.com/forums/u/1233887/knightcyber/)\n\nGood article, but a spelling correction throughout is needed - \"steganography\" is the\nmethod used, not \"stenography.\" Stenography is shorthand, where as steganography\nis the practice of concealing a message or data within another file. Interesting\ncampaign and techniques used, thanks for providing the write-up!\n\n\n-----\n\n[ferventcoder - 2 months ago](https://www.bleepingcomputer.com/forums/u/1242371/ferventcoder/)\n\nHowdy,\nRob from Chocolatey Software here. I wanted to start off by saying there was no\nspecial attack or compromise of the Chocolatey infrastructure or any packages, in\ncase there was any confusion for folks on hearing the word \"abuse\". What happened\nhere is that folks targeted Microsoft Office Macros to get Administrative access,\ninstalled a set of tools, and THEN did something malicious afterwards.\n\nApologies as I mentioned this before, but I think we have different definitions of the\nword \"abuse\". The use of Chocolatey as a tool was legitimate in that it was used in\nexactly the same way anyone else would install Chocolatey and then use Chocolatey\nto install Python. The original article from Proofpoint points out that it was just a novel\nattack that used Chocolatey in its toolchain and they had not seen something like that\nbefore. We had a meeting with Proofpoint to see if there was anything special about\nthe attacks that we could use to limit or stop the use of Chocolatey and there was\nnothing weird or out of the norm about the way Chocolatey was being used.\n\nWe wrote an article that clarifies any confusion and goes a bit deeper along with some\nsecurity recommendations that are hopefully already well-known and used. That can\nbe read at https://blog.chocolatey.org/2022/03/chocolatey-used-french-phishingcampaign/\n\n\n-----\n\n[Bill_Toulas - 2 months ago](https://www.bleepingcomputer.com/forums/u/1220909/bill-toulas/)\n\nHey Rob, thank you for sharing your perspective with our readers.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-21 - Serpent malware campaign abuses Chocolatey Windows package manager.pdf"
    ],
    "report_names": [
        "2022-03-21 - Serpent malware campaign abuses Chocolatey Windows package manager.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535618,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653781597,
    "ts_modification_date": 1653781597,
    "files": {
        "pdf": "https://archive.orkl.eu/b89eb8269cf66c2f12fc7619e4ecac258fce1ab9.pdf",
        "text": "https://archive.orkl.eu/b89eb8269cf66c2f12fc7619e4ecac258fce1ab9.txt",
        "img": "https://archive.orkl.eu/b89eb8269cf66c2f12fc7619e4ecac258fce1ab9.jpg"
    }
}