{
    "id": "42498fe2-4aa6-4dcf-9958-ba3cc618e6bc",
    "created_at": "2023-01-12T15:01:37.306962Z",
    "updated_at": "2025-03-27T02:05:54.737384Z",
    "deleted_at": null,
    "sha1_hash": "b88182838d79d188067148f85f298d0ecacb541e",
    "title": "2022-04-05 - Azure Active Directory Exposes Internal Information",
    "authors": "",
    "file_creation_date": "2022-05-28T18:17:50Z",
    "file_modification_date": "2022-05-28T18:17:50Z",
    "file_size": 1180588,
    "plain_text": "# Azure Active Directory Exposes Internal Information\n\n**[secureworks.com/research/azure-active-directory-exposes-internal-information](https://www.secureworks.com/research/azure-active-directory-exposes-internal-information)**\n\nCounter Threat Unit Research Team\n\n**Updated: April 12, 2022**\n\n## Summary\n\n\n-----\n\nMicrosoft Azure Active Directory (Azure AD) is an identity and access management solution\n[used by over 88 percent of Fortune 500 companies as of this publication. This market](https://www.insticc.org/node/TechnicalProgram/iceis/2022/presentationDetails/110771)\npenetration makes Azure AD a lucrative target for threat actors. In the second half of 2021,\n[Secureworks® Counter Threat Unit™ (CTU) researchers analyzed Azure AD tenants and](https://docs.microsoft.com/en-us/microsoft-365/enterprise/subscriptions-licenses-accounts-and-tenants-for-microsoft-cloud-offerings?view=o365-worldwide)\nwere able to extract open-source intelligence (OSINT) about organizations. Threat actors\nfrequently use OSINT to perform reconnaissance. CTU™ researchers identified several\napplication programming interfaces (APIs) that access internal information of any\norganization that uses Azure AD. Collected details included licensing information, mailbox\ninformation, and directory synchronization status.\n\nCTU researchers shared their findings with Microsoft, and all but two of the issues have been\nmitigated as of this publication. Microsoft applied the updates automatically to all Azure AD\ntenants, so there are no actions required for Azure AD administrators. Microsoft classified\nthe unmitigated issues as “by-design.” The first issue allows anyone to query the directory\nsynchronization status. In some scenarios, Azure AD reveals the name of the high-privileged\naccount used for synchronization. The second issue could reveal internal information about\nthe target Azure AD tenant, including the technical contact’s full name and phone number.\n[The technical contact usually holds Azure AD Global Administrator privileges.](https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#global-administrator)\n\nUpdate: Microsoft addressed the remaining issues in April 2022.\n\n## OSINT details in Azure AD\n\nTools such as [AADInternals gather OSINT from Azure AD using unauthenticated APIs. This](https://o365blog.com/aadinternals/)\nOSINT includes the target tenant’s [registered domains and types, tenant name and ID, and](https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/add-custom-domain)\n[seamless single sign-on status (also known as DesktopSSO). Figure 1 lists Invoke-](https://docs.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-sso)\nAADIntReconAsOutsider command output that contains OSINT information about the\norganization.\n\n_Figure 1. Invoke-AADIntReconAsOutsider output listing OSINT from unauthenticated APIs._\n_(Source: Secureworks)_\n\nIn addition to the unauthenticated APIs, there are authenticated APIs that can only be used\nafter logging into an Azure AD tenant. Figure 2 lists the information that any user can access\nfrom their own tenant. Administrator privileges are not required. CTU researchers discovered\nauthenticated APIs that could access information about any tenant, not just the authenticated\nuser's tenant.\n\n\n-----\n\n_Figure 2. Invoke-AADIntReconAsInsider output listing data from authenticated APIs. (Source:_\n_Secureworks)_\n\n**Diagnostics API**\n\n[Microsoft uses the undocumented Diagnostics API with the Support and Recovery Assistant](https://support.microsoft.com/en-us/office/about-the-microsoft-support-and-recovery-assistant-e90bb691-c2a7-4697-a94f-88836856c72f)\n(SaRA) tool to help the logged-in user diagnose and solve problems when accessing\nMicrosoft cloud services. In 2019, CTU researchers observed SaRA using an analysis API\nendpoint. The traffic between the SaRA client and the analysis endpoint used the process in\nFigure 3.\n\n_Figure 3. Diagnostics API analysis endpoint process. (Source: Secureworks)_\n\n1. A user opens SaRA, enters symptoms, and starts the diagnostic.\n\n\n-----\n\n2. SaRA makes an initial HTTP POST request to the analysis endpoint (see Figure 4).\n\nThe request contains an AnalyzerId and DiagnosisInfo.\n\n_Figure 4. Diagnostics API analysis endpoint initial request. (Source: Secureworks)_\n\n3. The response returns the SessionId to SaRA.\n\n4. The Diagnostics API backend starts the analyzer to explore the defined user’s tenant\n\nand mailbox.\n\n5. SaRA uses an HTTP GET request and the SessionId to poll the analysis status (see\n\nFigure 5).\n\n_Figure 5. Diagnostics API analysis endpoint poll request. (Source: Secureworks)_\n\n6. The Diagnostics API returns analysis results to SaRA.\n\n7. SaRA displays the results to the user.\n\nThe AnalyzerId represents an analyzer containing the diagnostic instructions that SaRA\ntasks the Diagnostics API to perform on the user’s behalf. The SaRA client source code\ncontains a list of analyzers (see Figure 6).\n\n\n-----\n\n_Figure 6. Sample of SaRA analyzer IDs and names from the analyzer list in the source code._\n_(Source: Secureworks)_\n\nCTU researchers identified the cloud-related analyzers from this list (see Table 1).\n\nIdentifier Name\n\n\n64fc98c3-da51-41f0-90511fb5921deb95\n\n6a60a84b-634c-4fe8-a840ba1a44a2e6fd\n\n99916cd2-6bc9-44c6-b58e0fbca87b1975\n\n90c40b3f-251a-4b09-a4b65c8d53e986d0\n\n597b1b90-b4a8-4fa0-9ddbdcd997f0b8c2\n\nea7e84ae-041d-4e48-a308c76bd4f09ac2\n\n\nTenantInfo.TenantUserInfoAnalyzer\n\nTenantInfo.TenantSoftwareSettingsAnalyzer\n\nExchangeCmdlets.ExchangeHybridTenantAnalyzer\n\nExchangeCmdlets.GetMailboxAnalyzer\n\nExchangeCmdlets.GetUserAnalyzer\n\nExchangeCmdlets.CasMailboxAnalyzer\n\n\n_Table 1. Cloud-related Diagnosis API analysis endpoint analyzers._\n\nThe SaRA client uses the DiagnosisInfo structure to pass parameters to analyzers. Figure 7\nlists the parameters used by each of the cloud-related analyzers.\n\n\n-----\n\n_Figure 7. DiagnosisInfo content for each cloud-related analyzer. (Source: Secureworks)_\n\nThe results contain user information, including full licensing information, Office versions\nenabled in the tenant, the organization’s Exchange hybrid configuration and external\nrelationships, user mailbox information, and Messaging Application Programming Interface\n(MAPI) status (see Figure 8).\n\n\n-----\n\n_Figure 8. Information returned by Diagnostics API analysis endpoint. (Source: Secureworks)_\n\n[The SaRA client extracts the logged-in user’s email address from their OAuth token (see](https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/auth-oauth2)\nFigure 9) and uses that as the target SmtpAddress in the DiagnosisInfo parameter.\n\n\n-----\n\n_Figure 9. OAuth token for Diagnostics API. (Source: Secureworks)_\n\nThe Diagnostics API does not validate whether the SmtpAddress matches the logged-in\nuser. It is possible to retrieve information for any user from any tenant by replacing the\nSmtpAddress with the email address of the target user. If the target user does not exist but\nthe domain is correct, the API returns all tenant-related information. This information is\nvaluable to threat actors. For instance, the licensing information shows which protective\ncomponents the target tenant could be using. Moreover, the organizational relationships\nidentify additional individuals that could be targeted in phishing attacks to gain access to a\ntenant.\n\nCTU researchers reported this vulnerability to Microsoft on September 7, 2021. On\nSeptember 22, Microsoft responded that the issue was resolved. CTU researchers confirmed\nthat the resolution included two modifications:\n\nDenies access to other users’ information (see Figure 10).\n\n_Figure 10. ‘You don't have access to given user’ response. (Source: Secureworks_\n\n\n-----\n\nInvalidates all AnalyzerIDs, making the analysis endpoint obsolete (see Figure 11).\n\n_Figure 11. ‘Unknown analyzer id’ response. (Source: Secureworks)_\n\nIn 2021, CTU analysis of SaRA version 17.0.7.7119.4 revealed the client using the\ncloudcheck endpoint instead of the analysis endpoint. Figure 12 depicts the cloudcheck\nendpoint process.\n\n_Figure 12. Diagnostics API cloudcheck endpoint process. (Source: Secureworks)_\n\n1. A user opens SaRA, enters symptoms, and starts the diagnostic.\n\n\n-----\n\n2. SaRA makes an initial HTTP POST request to the cloudcheck endpoint (see Figure\n\n13).\n\n_Figure 13. Diagnostics API cloudcheck endpoint initial request. (Source: Secureworks)_\n\nThe request contains the Symptom and Parameters details (see Figure 14) the user\nentered in Step 1.\n\n_Figure 14. Information sent to cloudcheck endpoint. (Source: Secureworks)_\n\n\n-----\n\n3. The response returns the RequestId to SaRA (see Figure 15).\n\n_Figure 15. Diagnostics API initial response. (Source: Secureworks)_\n\n4. The diagnosis API backend starts the diagnostics to explore the defined user’s tenant\n\nand mailbox.\n\n5. SaRA uses an HTTP GET request and the RequestId to poll the analysis status (see\n\nFigure 16).\n\n_Figure 16. Diagnostics API v1 poll request. (Source: Secureworks)_\n\n6. The cloudcheck endpoint returns diagnostic results to SaRA.\n\n7. SaRA displays the results to the user.\n\nThe SaRA client revealed the following symptoms that could retrieve similar diagnostic\ninformation as the analysis endpoint:\n\nCasMailbox\nDirSyncCheck\nExchangeHybridTenant\nGetUserDiagnostic\nTenantUserInfo\n\nFigure 17 lists the parameters used by the DirSyncCheck symptom.\n\n\n-----\n\n_Figure 17. Parameter values for DirSyncCheck request. (Source: Secureworks)_\n\nLike the analysis endpoint, the UserUpn and UserSMTPEmail attributes in the initial request\nwere the same as the user principal name of the bearer token used to access the API. As\nwith the analysis endpoint, it was possible to retrieve information for other users and tenants\nby replacing the values with the email address of the target user. After Microsoft addressed\nthe analysis endpoint issue, the logged-in user could only retrieve CasMailBox information\nfor users of the same tenant. However, all other information could still be requested from any\ntenant.\n\nCTU researchers reported this vulnerability to Microsoft on September 23, 2021. On\nDecember 2, 2021, Microsoft applied an update. CTU researchers confirmed that everything\nexcept the directory synchronization status issue was addressed. On January 28, 2022,\nMicrosoft closed the issue as fixed, leaving the synchronization status intact.\n\nTable 2 lists the directory synchronization status values. While all status information is\nimportant for threat actors, the password expiration message is the most valuable as it\nreveals the account name used for synchronization. This account has high privileges in the\ntarget tenant. It can be used to create, edit, and delete users in all tenants, and to reset\nusers’ passwords in some tenants. By default, the synchronization account’s password is\ngenerated during the configuration and is not set to expire. For security purposes, some\norganizations configure the password to expire in their tenants, which could expose the\n[account name. The password expiration reminder can be configured to be sent 1 to 30 days](https://docs.microsoft.com/en-US/microsoft-365/admin/manage/set-password-expiration-policy?view=o365-worldwide)\nprior to the expiration date.\n\nSynchronization status message Description\n\n\nDirectory Synchronization (or) password\nSynchronization is enabled for your\ntenant: <redacted>\n\n\nDirectory synchronization is\nenabled and working normally\n\n\n-----\n\nSynchronization status message Description\n\n\nActive Directory Synchronization or Password\nSynchronization needs to be enabled for your\ntenant: <redacted>. This is something your Office\n365 administrator can fix.\n\nYour tenant <redacted> password Synchronization\nserver hasn't successfully synchronized with Office\n365 in the last three hours. The last time it synced\nwas 9/23/2020.\n\nYour tenant <redacted> directory Synchronization\nserver hasn't successfully synchronized with Office\n365 in the last three hours. The last time it synced\nwas 1/1/0001.\n\nYour tenant <redacted> directory synchronization\nservice account\n_<redacted>@<redated>.onmicrosoft.com password_\nis expiring in 11 days. This is something your Office\n365 administrator can fix.\n\n_Table 2. Directory synchronization status messages._\n\n**Organization information**\n\n\nDirectory synchronization is not\nenabled\n\nDirectory synchronization is\nenabled but has not been\nsuccessfully synchronized after the\nlisted date\n\nDirectory synchronization is\nenabled but has never been\nsuccessfully synchronized\n\nDirectory synchronization is\nenabled and working normally, but\nthe password of the account used\nfor synchronization is expiring soon\n\n\nAzure AD collects information when a representative from an organization signs up for a new\nMicrosoft 365 or Azure AD environment or tenant. The form collects the full name and phone\nnumber of this representative (see Figure 18), and that person becomes the technical\ncontact of the tenant.\n\n\n-----\n\n_Figure 18. Office 365 signup form. (Source: Secureworks)_\n\nAfter signing up, this technical contact can edit their contact details in the Microsoft 365\nadmin center (see Figure 19). The company name and phone number are pre-populated\nfrom the original signup form.\n\n\n-----\n\n_Figure 19. Organization information in the admin center. (Source: Secureworks)_\n\nMicrosoft business partners offer services to customer organizations that use Microsoft cloud\nservices such as Microsoft 365 and Azure AD. Azure AD administrators in customer\norganizations can authorize these partners to access their tenants, which creates a partner\nrelationship in the customer’s tenant. These partner relationships can only be accessed via\nthe Microsoft 365 admin center. Only administrators have access to the admin center.\n\nCTU researchers discovered an API (see Figure 20) used by the admin center to retrieve\ndetails regarding the partner’s organization. Although the API is exclusively used by the\nadmin center, it does not require administrative permissions to be accessed. The API\nrequires the partner’s tenant ID as an input.\n\n_Figure 20. Admin API request for partner details. (Source: Secureworks)_\n\nThe response (see Figure 21) contains contact data from the organization information and\nsignup form. After the initial signup, the first and last name can only be changed by\nMicrosoft. Those fields cannot be viewed or modified in the admin center.\n\n\n-----\n\n_Figure 21. Partner information returned by admin API. (Source: Secureworks)_\nCTU researchers verified that this API could retrieve this information for any tenant,\nregardless of their partner status. CTU researchers reported this vulnerability to Microsoft on\nDecember 14, 2021. On January 12, 2022, Microsoft stated that “this information is expected\nto be shown” and did not mitigate the issue.\n\n## Conclusion\n\nA threat actor can gather a significant amount of OSINT from an Azure AD tenant. Microsoft\naddressed all but two of the issues CTU researchers identified:\n\nThe tenant’s synchronization status can reveal if the synchronization is configured, if is\nit operational, the time of the last synchronization, and the synchronization account’s\nname. Attackers can use this information for social engineering (leveraging the\nsynchronization error data) and targeted brute-force attacks (using the account name).\n\nThe organization information could expose the name and phone number of the tenant’s\nGlobal Administrator. This information can be abused for social engineering,\nspearphishing, and targeted brute-force attacks.\n\nCTU researchers recommend the following actions to protect tenants from OSINT abuse:\n\nOrganizations should ensure that their directory synchronization can perform the\nsynchronization within the defined timeframes to avoid exposing details in error\n[messages. Administrators receive an email if synchronization has not been successful](https://docs.microsoft.com/en-us/troubleshoot/azure/active-directory/directory-sync-stop-register)\nin more than 24 hours, but the error message is displayed after three hours of inactivity.\n\n\n-----\n\nOrganizations that implement an expiration for a directory synchronization account\npassword should reset the password before Azure AD displays the expiration reminder\nto prevent exposure of the directory synchronization account name.\n\nOrganizations should change the details associated with their tenant to general labels\n(e.g., “IT Department”) rather than personally identifiable data. Using a generic term\nprevents exposing the name of the potential Global Administrator account. An\norganization can modify some fields (e.g., phone number), but must create a support\nrequest in the Azure portal to change the first and last name of the technical contact.\n\n## April 12 update\n\nAfter this analysis was published on April 5, 2022, Microsoft reassessed the two remaining\nissues. CTU researchers verified that these issues have been addressed as of April 12:\n\nThe synchronization status is only visible for user's tenant.\nOnly administrators can access the admin API that exposes organizational information.\nAdditionally, the API does not return the technical contact's name.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-05 - Azure Active Directory Exposes Internal Information.pdf"
    ],
    "report_names": [
        "2022-04-05 - Azure Active Directory Exposes Internal Information.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535697,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653761870,
    "ts_modification_date": 1653761870,
    "files": {
        "pdf": "https://archive.orkl.eu/b88182838d79d188067148f85f298d0ecacb541e.pdf",
        "text": "https://archive.orkl.eu/b88182838d79d188067148f85f298d0ecacb541e.txt",
        "img": "https://archive.orkl.eu/b88182838d79d188067148f85f298d0ecacb541e.jpg"
    }
}