{
    "id": "425c3a56-059d-4198-b13c-065943fb1529",
    "created_at": "2023-01-12T14:59:48.661253Z",
    "updated_at": "2025-03-27T02:05:48.320669Z",
    "deleted_at": null,
    "sha1_hash": "dda6a7bb5f5889172a83e4e6d4c59c93565cd633",
    "title": "2022-12-01 - Новый троянец CryWiper прикидывается шифровальщиком",
    "authors": "",
    "file_creation_date": "2022-12-29T00:25:34Z",
    "file_modification_date": "2022-12-29T00:25:34Z",
    "file_size": 1622552,
    "plain_text": "# Новый троянец CryWiper прикидывается шифровальщиком\n\n**securelist.ru/novyj-troyanec-crywiper/106114/**\n\nБольшинство кибератак имеют финансовую мотивацию, однако в последнее время\nвозросло число атак, цель которых — не обогащение, а нанесение ущерба жертве.\nОдним из инструментов таких атак являются вайперы (от англ. wiper) — программы,\nкоторые уничтожают данные без возможности восстановления. К наиболее известным\nвайперам, появившимся в 2022 году, [относятся DoubleZero, IsaacWiper, HermeticWiper,](https://securelist.com/evaluation-of-cyber-activities-and-the-threat-landscape-in-ukraine/106484/)\nCaddyWiper, WhisperGate, AcidRain, Industroyer2 и RuRansom.\n\nОсенью 2022 года наши решения зафиксировали попытки ранее неизвестного троянца,\nкоторого мы назвали CryWiper, атаковать сеть организации в Российской Федерации.\nИзучив образец вредоносного ПО, мы выяснили, что этот троянец, хотя и маскируется\nпод шифровальщика и вымогает у жертвы деньги за «расшифровку» данных, в\nдействительности не шифрует, а целенаправленно уничтожает данные в пострадавшей\nсистеме. Более того, анализ программного кода троянца показал, что это не ошибка\nразработчика, а его изначальный замысел.\n\n## Технические детали CryWiper\n\nПопавший к нам образец CryWiper — это 64-битный исполняемый файл под ОС\nWindows. Зловред разработан на языке C++ и собран с помощью набора инструментов\nMinGW-w64 и компилятора GCC. Это не самый распространенный подход среди\nразработчиков вредоносного ПО на C/C++ под Windows — для таких целей чаще\n\n\n-----\n\nиспользуют среду разработки Microsoft Visual Studio. Сборка с помощью MinGW\nцелесообразна либо при разработке кросс-платформенного приложения под разные\nОС (например, под Windows, Linux и/или FreeBSD), либо если сам разработчик в\nкачестве основной ОС использует что-либо отличное от Windows. Отметим, что в\nслучае CryWiper первый вариант маловероятен, так как троянец использует много\nвызовов WinAPI-функций.\n\nДата сборки образца, в соответствии с полем PE заголовка: 2022-09-06 11:08:54.\nОбразец троянца был обнаружен по следующему пути:\n\n1 c:\\windows\\system32\\browserupdate.exe\n\n### Алгоритм работы CryWiper\n\n**Создание задачи в планировщике**\n\nПосле запуска CryWiper с помощью планировщика заданий (Task Scheduler) и команды\nschtasks create создает задачу для запуска собственного файла каждые 5 минут.\n\n**_Создание задачи в планировщике_**\n\n**Коммуникация с C&C**\n\nЗатем троянец обращается к своему командному серверу с помощью запроса HTTP\nGET и в виде параметра передает имя зараженного компьютера.\n\n\n-----\n\n**_Запрос CryWiper и ответ от C&C_**\n\nВ ответ сервер C&C отправляет строку run либо do not run, которая управляет\nповедением троянца. Если вернулось run, то CryWiper сразу приступит к вредоносной\nактивности.\n\nВо всех остальных случаях исполняется особая логика, которая, судя по результатам\nнашего анализа, задумана как отсрочка выполнения на 4 суток (345 600 секунд).\nОднако реализована она неудачно: код написан так, что зловред ни при каких условиях\nне будет ждать указанное время и просто завершит исполнение, если не получил\nкоманду run. CryWiper сохраняет текущее время в реестре (параметр\nHKCU\\Software\\Sysinternals\\BrowserUpdate\\Timestamp) сразу перед проверкой ответа от\nсервера. Получив команду do not run или не получив указаний, он вычисляет, сколько\nсекунд прошло с сохраненного момента, и, если это значение меньше 345 600 секунд,\nзавершает работу При этом оно никогда не будет больше 345 600 секунд — в\n\n\n-----\n\nдействительности проверка занимает лишь доли секунды. А при следующем запуске\n(см. выше — для этой цели троянец создавал задачу в планировщике) CryWiper снова\nперезапишет значение Timestamp.\n\n**_Код, замеряющий время и проверяющий ответ от C&C_**\n\n**Остановка процессов, изменение настроек**\n\nПолучив ответ run, CryWiper с помощью команды taskkill останавливает процессы,\nотносящиеся к работе серверов баз данных MySQL и MS SQL, почтового сервера MS\nExchange и веб-служб MS Active Directory. Троянец делает это для того, чтобы иметь\nдоступ к файлам, которые были бы заняты этими процессами в случае их нормальной\nработы.\n\n**_Остановка процессов и удаление теневых копий_**\n\nКроме того, троянец удаляет теневые копии файлов при помощи команды vssadmin\ndelete shadows /for=c: /all, что, однако, затрагивает только диск C:. Вероятно, это еще\nодна оплошность злоумышленника.\n\n\n-----\n\nТакже интересная деталь связана с изменением параметра реестра\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections, который\nотвечает за запрет подключения к системе по протоколу удаленного рабочего стола\n(RDP). При атаках с использованием программ-вымогателей злоумышленники\nзачастую выставляют значение этого параметра на 0, чтобы разрешить к системе\nдоступ по RDP, — например, с целью горизонтального распространения в\nскомпрометированной сети.\n\nЗдесь же мы наблюдаем противоположное поведение: CryWiper устанавливает\nзначение 1, что запрещает доступ по RDP.\n\n**_Запрет доступа по RDP_**\n\nЦель этого действия не вполне ясна. Возможно, таким образом разработчик троянца\nпытается усложнить жизнь ИБ- и IT-специалистам, которые будут участвовать в\nреагировании на инцидент, — из-за этой настройки они не смогут без дополнительных\nдействий удаленно подключиться к зараженной системе.\n\n**Уничтожение данных**\n\nДля уничтожения пользовательских файлов CryWiper генерирует последовательность\nданных при помощи известного генератора псевдослучайных чисел «Вихрь Мерсенна»\nи записывает эти данные вместо оригинального содержимого файла.\n\nПри поиске пользовательских файлов CryWiper пропускает те, которые имеют\nрасширения или находятся в директориях, указанных в таблице.\n\n\n**Игнорируемые расширения**\n**файлов**\n\n\n**Подстроки в пути к игнорируемым**\n**директориям**\n\n\n.exe C:\\Windows\n\n.dll tmp\n\n\n-----\n\n.lnk winnt\n\n.sys temp\n\n.msi thumb\n\n.CRY System Volume Information\n\nBoot\n\nWindows\n\nTrend Micro\n\nФайлы с испорченным содержимым получают дополнительное расширение .CRY.\n\n**_Часть процедуры, реализующей ГПСЧ «Вихрь Мерсенна». Выделены_**\n**_характерные константы_**\n\nПримечательно, что точной такой же алгоритм генерации псевдослучайных чисел\nиспользовал другой вайпер — IsaacWiper. Впрочем, никакой иной взаимосвязи между\nними обнаружить не удалось. Кроме того, они использовались в атаках на разные\n\n\n-----\n\nцели. Так, IsaacWiper был замечен в атаках на государственный сектор Украины, а\nCryWiper, по имеющимся у нас данным, атаковал организацию в Российской\nФедерации.\n\n**_Часть процедуры, уничтожающей содержимое файлов_**\n\nCryWiper маскируется под шифровальщика и сохраняет в файле README.txt\nтребования о выкупе. В тексте требований используются типичные для\nвымогательского ПО формулировки, а также приводится адрес Bitcoin-кошелька для\nоплаты выкупа, адрес почты для связи со злоумышленниками и ID заражения.\n\nСтрока ID у CryWiper фиксированная, она содержится в теле троянца и не меняется от\nзапуска к запуску. В большинстве шифровальщиков ID уникален для каждой жертвы и\nнужен атакующим, чтобы определить, какая жертва заплатила выкуп, а какая нет. Хотя\nиз этого правила есть исключения: если для каждой атаки собирается новый образец\nтроянца, то иногда ID оставляется фиксированным или даже вообще не используется.\n\nТак или иначе, CryWiper умышленно уничтожает содержимое файлов, а значит, и\nотличать одну жертву от другой для атакующих нет смысла — все равно\nрасшифровывать после заражения уже нечего.\n\n\n-----\n\n**_Текст требований CryWiper_**\n\n## Связь с другими семействами\n\nС точки зрения кода и функциональности CryWiper — новый зловред, не связанный с\nуже существующими семействами. Однако среди вайперов редко используется\nгенерация случайных значений при помощи «Вихря Мерсенна» — чаще встречаются\nболее простые варианты. Выбор алгоритма в CryWiper совпадает с ранее упомянутым\nIsaaсWiper – единственным из популярных вайперов, который генерирует\nпсевдослучайные значения с помощью этого алгоритма.\n\nЕще одно довольно интересное пересечение с другим вредоносным ПО мы нашли при\nанализе адреса электронной почты в записке. Оказалось, что этот адрес уже\nиспользовался ранее, но не в вайперах: он содержался в нескольких образцах\nшифровальщиков (например, MD5: [4A42F739CE694DB7B3CDD3C233CE7FB1,](https://opentip.kaspersky.com/4A42F739CE694DB7B3CDD3C233CE7FB1/results?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[71D9E6EE26D46C4DBB3D8E6DF19DDA7D,](https://opentip.kaspersky.com/71D9E6EE26D46C4DBB3D8E6DF19DDA7D/results?utm_source=SL&utm_medium=SL&utm_campaign=SL) [0C6D33DA653230F56A7168E73F1448AC).](https://opentip.kaspersky.com/0C6D33DA653230F56A7168E73F1448AC/res?utm_source=SL&utm_medium=SL&utm_campaign=SLults)\nДва из них относятся к программам-вымогателям хорошо известного семейства TrojanRansom.Win32.Xorist, третий является не получившим большой известности образцом\nиз семейства Trojan-Ransom.MSIL.Agent. Самый ранний образец, использующий этот\nадрес, датирован серединой июня 2017 года.\n\n## Заключение\n\nCryWiper позиционирует себя как программа-вымогатель, то есть утверждает, что\nфайлы жертвы зашифрованы и в случае оплаты выкупа их можно восстановить.\nОднако это обман: на самом деле данные уничтожены и вернуть их нельзя.\nДеятельность CryWiper в очередной раз показывает, что оплата выкупа не гарантирует\nвосстановление файлов.\n\nВо многих случаях причиной инцидентов с вайперами и вымогательским ПО\nстановится недостаточная защищенность сети, и именно на усиление защиты следует\nобращать внимание. Мы предполагаем, что число кибератак, в том числе с\nиспользованием вайперов, будет расти — во многом из-за нестабильной ситуации в\nмире. Поэтому снизить вероятность компрометации и потери данных при атаках\nвайперов и шифровальщиков поможет следующее.\n\nЗащитные решения с возможностью поведенческого анализа файлов,\nвыявляющие и блокирующие вредоносное ПО, — например, [KES.](https://www.kaspersky.com/small-to-medium-business-security/endpoint-protection)\n[MDR— и SOC-сервисы, позволяющие своевременно обнаружить вторжение и](https://www.kaspersky.ru/enterprise-security/managed-detection-and-response)\nпринять меры по реагированию.\n\n\n-----\n\nДинамический анализ почтовых вложений и блокировка вредоносных файлов и\nURL-адресов. Это затруднит атаки по электронной почте — одному из наиболее\nраспространенных векторов. Такая функциональность есть, например, в\n[Kaspersky Anti Targeted Attack (KATA).](https://www.kaspersky.ru/enterprise-security/anti-targeted-attack-platform)\nПроведение регулярных тестирований на проникновение и RedTeam-проектов.\nЭто поможет выявить уязвимые места инфраструктуры организации, защитить их\nи тем самым значительно уменьшить поверхность атаки для злоумышленников.\nМониторинг данных об угрозах. Для своевременного обнаружения и блокировки\nвредоносной активности необходимо располагать актуальной информацией о\nтактиках, инструментах и инфраструктуре злоумышленников. Для этого нужны\nпотоки данных об угрозах, например [Kaspersky Threat Data Feeds.](https://support.kaspersky.com/datafeeds)\n\n### IoC\n\n[14808919a8c40ccada6fb056b7fd7373 — Trojan-Ransom.Win64.CryWiper.a](https://opentip.kaspersky.com/14808919a8c40ccada6fb056b7fd7373/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nc:\\windows\\system32\\browserupdate.exe — путь к образцу троянца в системе\n\n[hxxp://82.221.141.8/IYJHNkmy3XNZ — сервер C&C](https://opentip.kaspersky.com/http%3A%2F%2F82.221.141.8%2FIYJHNkmy3XNZ/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n\n-----",
    "language": "RU",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-01 - Новый троянец CryWiper прикидывается шифровальщиком.pdf"
    ],
    "report_names": [
        "2022-12-01 - Новый троянец CryWiper прикидывается шифровальщиком.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535588,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1672273534,
    "ts_modification_date": 1672273534,
    "files": {
        "pdf": "https://archive.orkl.eu/dda6a7bb5f5889172a83e4e6d4c59c93565cd633.pdf",
        "text": "https://archive.orkl.eu/dda6a7bb5f5889172a83e4e6d4c59c93565cd633.txt",
        "img": "https://archive.orkl.eu/dda6a7bb5f5889172a83e4e6d4c59c93565cd633.jpg"
    }
}