{
    "id": "426d3af6-01e8-4ce6-91d3-ad6b832fe275",
    "created_at": "2023-01-12T15:03:16.268767Z",
    "updated_at": "2025-03-27T02:16:25.637617Z",
    "deleted_at": null,
    "sha1_hash": "090de1990fde0cef3ab7bc2d794f90007787f89e",
    "title": "2020-05-29 - Secret Chats Show How Cybergang Became a Ransomware Powerhouse",
    "authors": "",
    "file_creation_date": "2022-05-28T04:06:46Z",
    "file_modification_date": "2022-05-28T04:06:46Z",
    "file_size": 201354,
    "plain_text": "# Secret Chats Show How Cybergang Became a Ransomware Powerhouse\n\n**[nytimes.com/2021/05/29/world/europe/ransomware-russia-darkside.html](https://www.nytimes.com/2021/05/29/world/europe/ransomware-russia-darkside.html)**\n\nAndrew E. Kramer, Michael Schwirtz, Anton Troianovski May 29, 2021\n\nContinue reading the main story\nMOSCOW — Just weeks before the ransomware gang known as DarkSide attacked the\nowner of a major American pipeline, disrupting gasoline and jet fuel deliveries up and down\nthe East Coast of the United States, the group was turning the screws on a small, familyowned publisher based in the American Midwest.\n\nWorking with a hacker who went by the name of Woris, DarkSide launched a series of\nattacks meant to shut down the websites of the publisher, which works mainly with clients in\nprimary school education, if it refused to meet a $1.75 million ransom demand. It even\nthreatened to contact the company’s clients to falsely warn them that it had obtained\ninformation the gang said could be used by pedophiles to make fake identification cards that\nwould allow them to enter schools.\n\nWoris thought this last ploy was a particularly nice touch.\n\n“I laughed to the depth of my soul about the leaked IDs possibly being used by pedophiles to\nenter the school,” he said in Russian in a secret chat with DarkSide obtained by The New\nYork Times. “I didn’t think it would scare them that much.”\n\n\n-----\n\nDarkSide s attack on the pipeline owner, Georgia-based Colonial Pipeline, did not just thrust\nthe gang onto the international stage. It also cast a spotlight on a rapidly expanding criminal\nindustry based primarily in Russia that has morphed from a specialty demanding highly\nsophisticated hacking skills into a conveyor-belt-like process. Now, even small-time criminal\nsyndicates and hackers with mediocre computer capabilities can pose a potential national\nsecurity threat.\n\nImage\nMotorists lining up for gas at a Costco filling station in North Carolina amid the panic that\nfollowed DarkSide’s ransom attack on Colonial Pipeline.Credit...Travis Long/The News &\nObserver, via Associated Press\nWhere once criminals had to play psychological games to trick people into handing over\nbank passwords and have the technical know-how to siphon money out of secure personal\n[accounts, now virtually anyone can obtain ransomware off the shelf and load it into a](https://www.nytimes.com/2021/06/01/business/meat-plant-cyberattack-jbs.html)\ncompromised computer system using tricks picked up from YouTube tutorials or with the help\nof groups like DarkSide.\n\n“Any doofus can be a cybercriminal now,” said Sergei A. Pavlovich, a former hacker who\nserved 10 years in prison in his native Belarus for cybercrimes. “The intellectual barrier to\nentry has gotten extremely low.”\n\nA glimpse into DarkSide’s secret communications in the months leading up to the Colonial\nPipeline attack reveals a criminal operation on the rise, pulling in millions of dollars in ransom\npayments each month.\n\nDarkSide offers what is known as “ransomware as a service,” in which a malware developer\ncharges a user fee to so-called affiliates like Woris, who may not have the technical skills to\nactually create ransomware but are still capable of breaking into a victim’s computer\nsystems.\n\nDarkSide’s services include providing technical support for hackers, negotiating with targets\nlike the publishing company, processing payments, and devising tailored pressure\ncampaigns through blackmail and other means, such as secondary hacks to crash websites.\nDarkSide’s user fees operated on a sliding scale: 25 percent for any ransoms less than\n$500,000 down to 10 percent for ransoms over $5 million, according to the computer security\nfirm, FireEye.\n\nAs a start-up operation, DarkSide had to contend with growing pains, it appears. In the chat\nwith someone from the group’s customer support, Woris complained that the gang’s\nransomware platform was difficult to use, costing him time and money as he worked with\nDarkSide to extort cash from the American publishing company.\n\n\n-----\n\nI don t even understand how to conduct business on your platform, he complained in an\nexchange sometime in March. “We’re spending so much time when there are things to do. I\nunderstand that you don’t give a crap. If not us, others will bring you payment. It’s quantity\nnot quality.”\n\nThe Times gained access to the internal “dashboard” that DarkSide customers used to\norganize and carry out ransom attacks. The login information was provided to The Times by\na cybercriminal through an intermediary. The Times is withholding the name of the company\ninvolved in the attack to avoid additional reprisals from the hackers.\n\n## Read More on the World of Cryptocurrencies\n\n**A Perfect Storm: A** [steep sell-off that gained momentum this week is illustrating the](https://www.nytimes.com/2022/05/11/technology/bitcoin-price-crashing-stocks.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_1&block=storyline_top_links_recirc)\ndangers of cryptocurrencies.\n**Understand a $40 Billion Crash: A trash-talking South Korean entrepreneur hyped**\n[the Luna and TerraUSD cryptocurrencies. Then, their failures have devastated traders.](https://www.nytimes.com/2022/05/18/technology/terra-luna-cryptocurrency-do-kwon.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_1&block=storyline_top_links_recirc)\n**Celebrity Endorsements: Matt Damon, Reese Witherspoon and others have been**\ncriticized for hyping virtual currency without highlighting the risks.\n**Crypto Emperor: Sam Bankman-Fried, a studiously disheveled billionaire, is hoping**\nto [put a new face on the still-chaotic world of digital assets.](https://www.nytimes.com/2022/05/14/business/sam-bankman-fried-ftx-crypto.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_1&block=storyline_top_links_recirc)\n**Crypto Critic: The actor Ben McKenzie, best known for “The O.C.,” has become an**\n[outspoken skeptic of digital currencies. Who’s listening?](https://www.nytimes.com/2022/03/31/style/ben-mckenzie-crypto.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_1&block=storyline_top_links_recirc)\n\nAccess to the DarkSide dashboard offered an extraordinary glimpse into the internal\nworkings of a Russian-speaking gang that has become the face of global cybercrime. Cast in\nstark black and white, the dashboard gave users access to DarkSide’s list of targets as well\nas a running ticker of profits and a connection to the group’s customer support staff, with\nwhom affiliates could craft strategies for squeezing their victims.\n\nImage\nA screenshot of the rules on the website of DarkSide.\nThe dashboard was still operational as of May 20, when a Times reporter logged in, even\n[though DarkSide had released a statement a week earlier saying it was shutting down. A](https://www.nytimes.com/2021/05/14/business/darkside-pipeline-hack.html)\ncustomer support employee responded almost immediately to a chat request sent from\nWoris’s account by the Times reporter. But when the reporter identified himself as a journalist\nthe account was immediately blocked.\n\nEven before the attack on Colonial Pipeline, DarkSide’s business was booming. According to\nthe cybersecurity firm Elliptic, which has studied DarkSide’s Bitcoin wallets, the gang has\nreceived about $15.5 million in Bitcoin since October 2020, with another $75 million going to\naffiliates.\n\n\n-----\n\nThe serious profits for such a young criminal gang — DarkSide was established only last\nAugust, according to computer security researchers — underscore how the Russianlanguage cybercriminal underground has mushroomed in recent years. That growth has\nbeen abetted by the rise of cryptocurrencies like Bitcoin that have made the need for oldschool money mules, who sometimes had to smuggle cash across borders physically,\npractically obsolete.\n\nIn just a couple of years, cybersecurity experts say, [ransomware has developed into a tightly](https://www.nytimes.com/2021/06/03/us/politics/ransomware-cybersecurity-infrastructure.html)\norganized, highly compartmentalized business. There are certain hackers who break into\ncomputer systems and others whose job is to take control of them. There are tech support\nspecialists and experts in money laundering. Many criminal gangs even have official\nspokespeople who do media relations and outreach.\n\nIn many ways, the organizational structure of the Russian ransomware industry mimics\nfranchises, like McDonald’s or Hertz, that lower barriers to entry and allow for easy\nduplication of proven business practices and techniques. Access to DarkSide’s dashboard\nwas all that was needed to set up shop as an affiliate of DarkSide and, if desired, download a\nworking version of the ransomware used in the attack on Colonial Pipeline.\n\nImage\nThe ransomware industry is growing explosively in Russia, in part because the authorities\nthere have made it clear that they will rarely prosecute people for cybercrimes outside\nRussia.Credit...Sergey Ponomarev for The New York Times\nWhile The Times did not acquire that software, the publishing company offered a window into\nwhat it was like to be the victim of an attack by DarkSide ransomware.\n\nThe first thing the victim sees on the screen is a ransom letter with instructions and gentle\nthreats.\n\n“Welcome to DarkSide,” the letter says in English, before explaining that the victim’s\ncomputers and servers had been encrypted and any backups deleted.\n\nTo decrypt the information, victims are directed to a website where they must enter a special\npass key. The letter makes clear that they can call on a tech support team if they should run\ninto any problems.\n\n“!!! DANGER !!! DO NOT MODIFY or try to RECOVER any files yourself,” the letter says.\n“We WILL NOT be able to RESTORE them.”\n\nThe DarkSide software not only locks victims’ computer systems, it also steals proprietary\ndata, allowing affiliates to demand payment not only for unlocking the systems but also for\nrefraining from releasing sensitive company information publicly.\n\n\n-----\n\nIn the chat log viewed by The Times, a DarkSide customer support employee boasted to\nWoris that he had been involved in more than 300 ransom attacks and tried to put him at\nease.\n\n“We’re just as interested in the proceeds as you are,” the employee said.\n\nTogether, they hatched the plan to put the squeeze on the publishing company, a nearly\ncentury-old, family-owned business with only a few hundred employees.\n\nIn addition to shutting down the company’s computer systems and issuing the pedophile\nthreat, Woris and DarkSide’s technical support drafted a blackmail letter to be sent to school\nofficials and parents who were the company’s clients.\n\n“Dear school staff and parent,” the letter went, “have nothing personal against you, it is only\nbusiness.” (A spokesman for the company said that no clients were ever contacted by\nDarkSide, but several employees were.)\n\nOn top of this, using a new service that DarkSide introduced in April, they planned to shut\ndown the company’s websites with so-called DDOS attacks, in which hackers overload a\ncompany’s network with fake requests.\n\nImage\nPresident Biden said it did not appear that the Russian state was involved in the attack on\nColonial Pipeline, but stressed that the Kremlin has a responsibility to prosecute cybercrimes\ncommitted by groups within its borders. Credit...Doug Mills/The New York Times\nNegotiations over the ransom with DarkSide lasted for 22 days and were carried out over\nemail or on the gang’s blog with a hacker or hackers who spoke only in mangled English,\nsaid the company’s spokesman. Negotiations broke down sometime in March over the\ncompany’s refusal to pay the $1.75 million ransom. DarkSide, it seems, was livid and\nthreatened to leak news of the ransomware attack to the news media.\n\n## Expand Your Cryptocurrency Vocabulary\n\nCard 1 of 9\n**A glossary.** [Cryptocurrencies have gone from a curiosity to a viable investment, making](https://www.google.com/url?q=https://www.nytimes.com/interactive/2022/03/18/technology/cryptocurrency-crypto-guide.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682737397&usg=AOvVaw2IO8JvucW11LHSyQMuO8IO)\nthem almost impossible to ignore. If you are struggling with the terminology, let us help:\n\n**Bitcoin. A** [Bitcoin is a digital token that can be sent electronically from one user to another,](https://www.google.com/url?q=https://www.nytimes.com/2017/10/01/technology/what-is-bitcoin-price.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682738251&usg=AOvVaw1oisjE5h-m22AO9WqJ5DbM)\nanywhere in the world. Bitcoin is also the name of the payment network on which this form of\ndigital currency is stored and moved.\n\n**Blockchain. A** [blockchain is a database maintained communally and that reliably stores](https://www.google.com/url?q=https://www.nytimes.com/2018/06/27/business/dealbook/blockchains-guide-information.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682738852&usg=AOvVaw0i1Uk9f2A5whPIMnjgkJzk)\ndigital information. The original blockchain was the database on which all Bitcoin\ntransactions were stored but non-currency-based companies and governments are also\n\n\n-----\n\ntrying to use blockchain technology to store their data.\n\n**[Cryptocurrencies. Since Bitcoin was first conceived in 2008, thousands of other virtual](https://www.google.com/url?q=https://archive.nytimes.com/www.nytimes.com/interactive/technology/bitcoin-timeline.html&sa=D&source=editors&ust=1652473682739966&usg=AOvVaw0YKBZKp_CLZrpPjxn8Gnlr)**\n[currencies, known as cryptocurrencies, have been developed. Among them are Ether,](https://www.google.com/url?q=https://www.nytimes.com/2017/07/25/business/dealbook/bitcoin-cash-split.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682740296&usg=AOvVaw1ilfzWjwmU15c8ZodxsAJ2)\n[Dogecoin and](https://www.google.com/url?q=https://www.nytimes.com/2021/05/15/style/dogecoin-cryptocurrency-investment.html?searchResultPosition&action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc%3D2&sa=D&source=editors&ust=1652473682741133&usg=AOvVaw3_eh1Ugy-oxO_EitwrCpUR) [Tether.](https://www.google.com/url?q=https://www.nytimes.com/2017/11/21/technology/bitcoin-bitfinex-tether.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682741537&usg=AOvVaw3qwqYuSqvwEELn5Gg6vSMN)\n\n**Coinbase. The first major cryptocurrency company to list its shares on a U.S. stock**\nexchange, Coinbase is a platform that allows people and companies to buy and sell various\ndigital currencies, including Bitcoin, for a transaction fee.\n\n**DeFi. The development of cryptocurrencies spawned a parallel universe of alternative**\n[financial services, known as Decentralized Finance, or DeFi, allowing crypto businesses to](https://www.google.com/url?q=https://www.nytimes.com/interactive/2022/03/18/technology/what-is-defi-cryptocurrency.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682742984&usg=AOvVaw1Ep3Rv1xRH36mOqSiQbx-A)\n[move into traditional banking territory, including lending and borrowing.](https://www.google.com/url?q=https://www.nytimes.com/2021/09/05/us/politics/cryptocurrency-explainer.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682743291&usg=AOvVaw0BLCxmIna35vkRbAkYEMXE)\n\n**NFTs. A** [“nonfungible token,” or NFT, is](https://www.google.com/url?q=https://www.nytimes.com/interactive/2022/03/18/technology/nft-guide.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682743854&usg=AOvVaw3lN-tYMDaLPxdKp5ol-Sak) [an asset verified using blockchain technology, in](https://www.google.com/url?q=https://www.nytimes.com/2021/03/11/arts/design/what-is-an-nft.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682744135&usg=AOvVaw3ypC72QntH7-BgQcRZWMAS)\nwhich a network of computers records transactions and gives buyers proof of authenticity\nand ownership. NFTs make [digital artworks unique, and therefore sellable.](https://www.google.com/url?q=https://www.nytimes.com/2021/12/01/arts/design/banksy-nft-loic-gouzer-particle.html?searchResultPosition&action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc%3D11&sa=D&source=editors&ust=1652473682744433&usg=AOvVaw30VZWrUhEizXUYM6uRZIKU)\n\n**[Web3. The name “web3” is what some technologists call the idea of a new kind of internet](https://www.google.com/url?q=https://www.nytimes.com/interactive/2022/03/18/technology/web3-definition-internet.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682745092&usg=AOvVaw350jJrn30ozhLw6R6qHR_o)**\nservice that is [built using blockchain-based tokens, replacing centralized, corporate platforms](https://www.google.com/url?q=https://www.nytimes.com/2021/12/05/business/dealbook/what-is-web3.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682745424&usg=AOvVaw0ReNkfFX1ZfmF4gVgbuowI)\nwith open protocols and decentralized, community-run networks.\n\n**DAOs. A** [decentralized autonomous organization, or DAO, is an organizational structure built](https://www.google.com/url?q=https://www.nytimes.com/interactive/2022/03/18/technology/what-are-daos.html?action=click&pgtype=Article&state=default&module=styln-crypto-business&variant=show&region=MAIN_CONTENT_3&block=storyline_levelup_swipe_recirc&sa=D&source=editors&ust=1652473682746085&usg=AOvVaw3c0jVa2CI6GzZ_3nIpDp2w)\nwith blockchain technology that is often described as a crypto co-op. DAOs form for a\ncommon purpose, like investing in start-ups, managing a stablecoin or buying NFTs.\n\n“Ignoring is very bad strategy for you. You don’t have much time,” DarkSide wrote in an\nemail. “After two days we will make you blog post public and send this news for all big mass\nmedia. And everyone will see you catastrophic data leak.”\n\nFor all the strong-arm tactics, DarkSide was not completely without a moral compass. In a\nlist of rules posted to the dashboard, the group said any attacks against educational, medical\nor government targets were forbidden.\n\nIn its communications, DarkSide tried to be polite, and the group expected the same of the\nhackers using its services. The group, after all, “very much treasures our reputation,”\nDarkSide said in one internal communication.\n\n“Offending or being rude to targets for no reason is prohibited,” DarkSide said. “We aim to\nmake money through normal and calm dialogue.”\n\nAnother important rule adopted by DarkSide, along with most other Russian-speaking\ncybercriminal groups, underscores a reality about modern-day cybercrime. Anyone living in\nthe Commonwealth of Independent States, a collection of former Soviet republics, is strictly\noff limits to attacks.\n\n\n-----\n\nCybersecurity experts say the don t work in .ru stricture, a reference to Russia s national\ndomain suffix, has become de rigueur in the Russian-speaking hacking community, to avoid\nentanglements with Russian law enforcement. The Russian authorities have made it clear\nthey will rarely prosecute cybercriminals for ransomware attacks and other cybercrimes\noutside Russia.\n\nAs a result, Russia has become a global hub for ransomware attacks, experts say. The\ncybersecurity firm Recorded Future, based outside Boston, tracks about 25 ransomware\ngroups, of which about 15 — including the five biggest — are believed to be based in Russia\nor elsewhere in the former Soviet Union, said a threat intelligence expert for the firm, Dmitry\nSmilyanets.\n\nMr. Smilyanets is himself a former hacker from Russia who spent four years in federal\ncustody for cybercrimes. Russia in particular has become a “greenhouse” for cybercriminals,\nhe said.\n\n“An atmosphere was created in Russia in which cybercriminals felt great and could thrive,”\nMr. Smilyanets said. “When someone is comfortable and confident that he won’t be arrested\nthe next day, he starts to act more freely and more brazenly.”\n\nRussia’s president, Vladimir V. Putin, has made the rules perfectly clear. When the American\n[journalist Megyn Kelly pressed him in a 2018 interview on why Russia was not arresting](http://kremlin.ru/events/president/news/57027)\nhackers believed to have interfered in the American election, he shot back that there was\nnothing to arrest them for.\n\n“If they did not break Russian law, there is nothing to prosecute them for in Russia,” Mr. Putin\nsaid. “You must finally realize that people in Russia live by Russian laws, not by American\nones.”\n\nImage\nWhen Megyn Kelly asked President Vladimir V. Putin of Russia why his country was not\narresting hackers believed to have interfered in the American election, he said that under\nRussian law there was nothing to prosecute them for.Credit...Alexei Druzhinin/Agence\nFrance-Presse — Getty Images\nAfter the Colonial attack, President Biden said that intelligence officials had evidence the\nhackers were from Russia, but that they had yet to find any links to the government.\n\n“So far there is no evidence based on, from our intelligence people, that Russia is involved,\nthough there is evidence that the actors, ransomware, is in Russia,” he said, adding that the\nRussian authorities “have some responsibility to deal with this.”\n\nThis month, DarkSide’s support staff scrambled to respond to parts of the system being shut\ndown, which the group attributed, without evidence, to pressure from the United States. In a\nposting on May 8, the day after the Colonial attack became public, the DarkSide staff\nappeared to be hoping for some sympathy from their affiliates\n\n\n-----\n\nThere is now the option to leave a tip for Support under payments, the posting said. It s\noptional, but Support would be happy :).”\n\nDays after the F.B.I. publicly identified DarkSide as the culprit, Woris, who had yet to extract\npayment from the publishing company, reached out to customer service, apparently\nconcerned.\n\n“Hi, how’s it going,” he wrote. “They hit you hard.”\n\nIt was the last communication Woris had with DarkSide.\n\nDays later, a message popped up on the dashboard saying the group was not exactly\nshutting down, as it had said it would, but selling its infrastructure so other hackers could\ncarry on the lucrative ransomware business.\n\n“The price is negotiable,” DarkSide wrote. “By fully launching an analogous partnership\nprogram it’s possible to make profits of $5 million a month.”\n\nOleg Matsnev contributed reporting.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-29 - Secret Chats Show How Cybergang Became a Ransomware Powerhouse.pdf"
    ],
    "report_names": [
        "2020-05-29 - Secret Chats Show How Cybergang Became a Ransomware Powerhouse.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535796,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653710806,
    "ts_modification_date": 1653710806,
    "files": {
        "pdf": "https://archive.orkl.eu/090de1990fde0cef3ab7bc2d794f90007787f89e.pdf",
        "text": "https://archive.orkl.eu/090de1990fde0cef3ab7bc2d794f90007787f89e.txt",
        "img": "https://archive.orkl.eu/090de1990fde0cef3ab7bc2d794f90007787f89e.jpg"
    }
}