{
    "id": "42749df4-82a9-4190-a8f0-c04656da9d33",
    "created_at": "2023-01-12T14:59:55.101357Z",
    "updated_at": "2025-03-27T02:16:26.20901Z",
    "deleted_at": null,
    "sha1_hash": "178c0a22577af1cc7a38d59135c646e814244c73",
    "title": "2020-12-08 - FireEye Shares Details of Recent Cyber Attack, Actions to Protect Community",
    "authors": "",
    "file_creation_date": "2022-05-28T15:37:53Z",
    "file_modification_date": "2022-05-28T15:37:53Z",
    "file_size": 64148,
    "plain_text": "# FireEye Shares Details of Recent Cyber Attack, Actions to Protect Community\n\n**fireeye.com/blog/products-and-services/2020/12/fireeye-shares-details-of-recent-cyber-attack-actions-to-protect-**\ncommunity.html\n\n## FireEye Stories Blog\n\nDecember 08, 2020 | by [Kevin Mandia](https://www.fireeye.com/blog/products-and-services.html/category/etc/tags/fireeye-blog-authors/cap-kevin-mandia)\n[FireEye](https://www.fireeye.com/blog/products-and-services.html/category/etc/tags/fireeye-blog-tags/fireeye)\n\n[tools](https://www.fireeye.com/blog/products-and-services.html/category/etc/tags/fireeye-blog-tags/tools)\n\n[Red Team](https://www.fireeye.com/blog/products-and-services.html/category/etc/tags/fireeye-blog-tags/red-team)\n\nFireEye is on the front lines defending companies and critical infrastructure globally from\ncyber threats. We witness the growing threat firsthand, and we know that cyber threats are\nalways evolving. Recently, we were attacked by a highly sophisticated threat actor, one\nwhose discipline, operational security, and techniques lead us to believe it was a statesponsored attack. Our number one priority is working to strengthen the security of our\ncustomers and the broader community. We hope that by sharing the details of our\ninvestigation, the entire community will be better equipped to fight and defeat cyber attacks.\n\nBased on my 25 years in cyber security and responding to incidents, I’ve concluded we are\nwitnessing an attack by a nation with top-tier offensive capabilities. This attack is different\nfrom the tens of thousands of incidents we have responded to throughout the years. The\n\n\n-----\n\nattackers tailored their world-class capabilities specifically to target and attack FireEye. They\nare highly trained in operational security and executed with discipline and focus. They\noperated clandestinely, using methods that counter security tools and forensic examination.\nThey used a novel combination of techniques not witnessed by us or our partners in the past.\n\nWe are actively investigating in coordination with the Federal Bureau of Investigation and\nother key partners, including Microsoft. Their initial analysis supports our conclusion that this\nwas the work of a highly sophisticated state-sponsored attacker utilizing novel techniques.\n\nDuring our investigation to date, we have found that the attacker targeted and accessed\ncertain Red Team assessment tools that we use to test our customers’ security. These tools\nmimic the behavior of many cyber threat actors and enable FireEye to provide essential\ndiagnostic security services to our customers. None of the tools contain zero-day exploits.\nConsistent with our goal to protect the community, we are proactively releasing methods and\nmeans to detect the use of our stolen Red Team tools.\n\nWe are not sure if the attacker intends to use our Red Team tools or to publicly disclose\nthem. Nevertheless, out of an abundance of caution, we have developed more than 300\ncountermeasures for our customers, and the community at large, to use in order to minimize\nthe potential impact of the theft of these tools.\n\nWe have seen no evidence to date that any attacker has used the stolen Red Team tools.\nWe, as well as others in the security community, will continue to monitor for any such activity.\nAt this time, we want to ensure that the entire security community is both aware and\nprotected against the attempted use of these Red Team tools. Specifically, here is what we\nare doing:\n\nWe have prepared countermeasures that can detect or block the use of our stolen Red\nTeam tools.\nWe have implemented countermeasures into our security products.\nWe are sharing these countermeasures with our colleagues in the security community\nso that they can update their security tools.\nWe are making the countermeasures publicly available in our blog post, \"Unauthorized\nAccess of FireEye Red Team Tools\".\nWe will continue to share and refine any additional mitigations for the Red Team tools\nas they become available, both publicly and directly with our security partners.\n\nConsistent with a nation-state cyber-espionage effort, the attacker primarily sought\ninformation related to certain government customers. While the attacker was able to access\nsome of our internal systems, at this point in our investigation, we have seen no evidence\nthat the attacker exfiltrated data from our primary systems that store customer information\nfrom our incident response or consulting engagements, or the metadata collected by our\nproducts in our dynamic threat intelligence systems. If we discover that customer information\nwas taken, we will contact them directly.\n\n\n-----\n\nOver many years, we have identified, cataloged, and publicly disclosed the activities of many\nAdvanced Persistent Threat (APT) groups, empowering the broader security community to\ndetect and block new and emerging threats.\n\nEvery day, we innovate and adapt to protect our customers from threat actors who play\noutside the legal and ethical bounds of society. This event is no different. We’re confident in\nthe efficacy of our products and the processes we use to refine them. We have learned and\ncontinue to learn more about our adversaries as a result of this attack, and the greater\nsecurity community will emerge from this incident better protected. We will never be deterred\nfrom doing what is right.\n\n**Forward Looking Statements**\n\nCertain statements contained in this blog post constitute “forward-looking statements” within\nthe meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of\nthe Securities Exchange Act of 1934, as amended. These forward-looking statements are\nbased on our current beliefs, understanding and expectations and may relate to, among\nother things, statements regarding our current beliefs and understanding regarding the\nimpact and scale of the disclosed event and our understanding of what occurred. Forwardlooking statements are based on currently available information and our current beliefs,\nexpectations and understanding, which may change as the investigation proceeds and more\nis learned, including what was targeted and accessed by the attacker. These statements are\nsubject to future events, risks and uncertainties – many of which are beyond our control or\nare currently unknown to FireEye. These risks and uncertainties include but are not limited to\nour ongoing investigation, including the potential discovery of new information related to the\nincident.\n\nForward-looking statements speak only as of the date they are made, and while we intend to\nprovide additional information regarding the attack, FireEye does not undertake to update\nthese statements other than as required by law and specifically disclaims any duty to do so.\n\nPrevious Post\nNext Post\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-08 - FireEye Shares Details of Recent Cyber Attack, Actions to Protect Community.pdf"
    ],
    "report_names": [
        "2020-12-08 - FireEye Shares Details of Recent Cyber Attack, Actions to Protect Community.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535595,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653752273,
    "ts_modification_date": 1653752273,
    "files": {
        "pdf": "https://archive.orkl.eu/178c0a22577af1cc7a38d59135c646e814244c73.pdf",
        "text": "https://archive.orkl.eu/178c0a22577af1cc7a38d59135c646e814244c73.txt",
        "img": "https://archive.orkl.eu/178c0a22577af1cc7a38d59135c646e814244c73.jpg"
    }
}