{
    "id": "4277276a-013e-4737-bba2-6fbf15bbce68",
    "created_at": "2023-01-12T14:59:53.355664Z",
    "updated_at": "2025-03-27T02:06:09.448664Z",
    "deleted_at": null,
    "sha1_hash": "b4b8432d33d9e6699cacf929ea1f17c1c753c00f",
    "title": "2020-06-18 - Behind the scenes of the Emotet Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T15:20:33Z",
    "file_modification_date": "2022-05-28T15:20:33Z",
    "file_size": 554367,
    "plain_text": "# Behind the scenes of the Emotet iInfrastructure\n\n**[hello.global.ntt/en-us/insights/blog/behind-the-scenes-of-the-emotet-infrastructure](https://hello.global.ntt/en-us/insights/blog/behind-the-scenes-of-the-emotet-infrastructure)**\n\nSecurity division of NTT Ltd.\n\n## Reliance Securities\n\nReliance Securities implemented smart contact center technologies to put their customers at\nthe heart of their operations, reducing their response times. They have also pinpointed which\nplatform their customers prefer to communicate through.\n\n## Reliance Securities\n\nReliance Securities implemented smart contact center technologies to put their customers at\nthe heart of their operations, reducing their response times. They have also pinpointed which\nplatform their customers prefer to communicate through.\n\n## ASHRAE\n\nASHRAE’s new headquarters creates a blueprint for the intelligent building\n\n\n-----\n\n## ASHRAE\n\nASHRAE’s new headquarters creates a blueprint for the intelligent building\n\nEmotet is a threat known to use large amounts of command and control servers (C2s) in\nparallel in order to ensure uptime and bypass blocking.\n\nThis first layer of C2s, also called Tier 1 C2s, will in part forward their received traffic to Tier 2\nservers. This relationship has previously been observed by Centurylink .1\n\nNTT Ltd. Threat Detection decided to explore the malware infrastructure of Emotet deeper,\nwith multiple goals in mind:\n\nensure our long-term detection capabilities for Emotet traffic in our customer\nenvironments\n\nexplore the underlying Emotet infrastructure and track the setup and longevity of the\nTier 2 servers\n\ncollaborate with CERTs and notify ISPs of malicious activity\n\nWe own and operates one of the world's largest tier-1 IP backbones, giving insight into a\nsignificant portion of the global internet traffic. We’re also consistently ranked among the top\nfive network providers in the world. In the fall of 2018, our security division added botnet\ninfrastructure detection capabilities to our Managed Security Services (MSS) Threat\nDetection services. This unique capability was use during this project in order to explore and\nmonitor the Emotet network infrastructure.\n\n## Starting the journey\n\nThe assumptions of behaviour of the Tier 1 C2s were reduced to the expectation that they\nforward their traffic towards a Tier 2 C2. We initially monitored Tier 1 C2 traffic en masse. We\nextracted Tier 1 C2 lists from Emotet samples and applied these IOCs in our netflow\nmonitoring in NTT Ltd.’s global internet infrastructure, where one potential Tier 2 C2 was\nfound:\n\n\n-----\n\nThe Emotet botnet is divided into separate Epochs, Epoch 1, 2 and 3, which all have their\nown separate Tier 1 C2 infrastructure . The Tier 1 C2s in the picture above belong to Epoch2\n2.\n\nA Shodan lookup of the services of the Tier 2 C2 shows the following setup of HTTP\nservices:\n\n\n-----\n\nAt this point in the investigation we assumed that the above was the standard setup for all\nTier 2 C2s and automated the analysis of outgoing traffic from Tier 1 C2s to find new Tier 2\nC2s. We found new ones by selecting traffic where:\n\nthe source IP is an Emotet Tier 1 C2\n\nthe destination port is TCP/80 and is running a NGINX service, with the error message\n“HTTP 404 Not found”\n\nthe destination IP is also running an Apache service which gives “HTTP 200 OK” status\nmessage over port TCP/8080\n\n## Observed backends\n\n\n-----\n\nWith our new workflow established we’ve observed 16 Tier 2 C2 servers with incoming Tier 1\nC2 traffic of their respective associated Epoch:\n\neight Tier 2 C2s belong to Epoch 1\n\nfive Tier 2 C2s belong to Epoch 2\n\nthree Tier 2 C2s belong to Epoch 3\n\nWith the following hosting providers used:\n\nseven using Serverius Holding\n\nfive using GloboTech\n\ntwo using Worldstream\n\none using PnS Hostings\n\none using RealHosters\n\nThe graphs below show the timelines for when each Tier 2 C2 is receiving connections from\nTier 1 C2s grouped by each Epoch. The Y-axis is the number of connecting Tier 1 C2s and\nthe X-axis is the timeline. The coloured lines each represent a Tier 2 C2.\n\n**Epoch 1:**\n\n\n-----\n\n**Comment:**\n\nBased on the synchronization in time when old Tier 2 C2s disappear and new Tier 2 C2s\nappears there are two separate Tier 2 C2 infrastructures for Epoch 1 in use at the same time:\n**37.252.15.50 -> 185.180.223.70 and 72.10.162.83 -> 72.10.162.84-> 72.10.162.85->**\n**72.10.162.86.**\n\n**Epoch 2:**\n\n\n-----\n\n**Comment:**\n\nThe new Tier 2 C2s appear at the same time or a little before the old one goes down. The\noverlap with two Tier 2 C2 active at the same time is noteworthy.\n\n**Epoch 3:**\n\n\n-----\n\n**Comment:**\n\nThe IP 134.119.194.179 has for a very long time been utilized as a Tier 2. The IP\n37.252.14.29 has a low utilization of connecting Tier 1 C2s.\n\nFrom the analysis above the following Tier 2 IPs were excluded due to their short time-span\nand low amount of connecting Tier 1 C2s indicating them to possibly be inactive:\n\n37.252.15.52\n\n37.252.14.109\n\n185.180.223.114\n\n\n-----\n\n## Theories on administration\n\nOur analysts have three main theories on how the actor behind Emotet administers the Tier 2\nC2 servers:\n\n**Theory 1 – Apache TCP/8080**\n\nAn administration panel and/or API access exposed over Apache TCP/8080 which the actor\nconnects to. No network traffic in the NTT Global internet infrastructure supporting this theory\nhas been seen.\n\n**Theory 2 – NGINX TCP/80**\n\n\n-----\n\nThe hosting of an administration panel and/or API access over the same port that they\nreceive C2 traffic. This would make it easier for the actor to hide their tracks by possibly\ntunnelling their traffic through Tier 1 C2s towards Tier 2 C2s.\n\n**Theory 3 - A Tier 3 C2**\n\nTier 2 C2s forwarding their traffic towards a central Tier3 C2 which has data for all three\nEpochs. No outgoing traffic from Tier 2 C2s inside of NTT Global internet infrastructure has\nbeen observed supporting this and it’s seen as very unlikely.\n\n\n-----\n\n## Closing thought on theories\n\nThe overlaps observed in the Tier 2 C2 infrastructure with multiple Tier 2 C2s being active at\nthe same time indicates an additional complexity. Based on netflow monitoring of our global\ninternet infrastructure, theory 2 is found to be most likely, but forensics of Tier 2 C2s would\nbe needed in order to confirm this theory.\n\n**Conclusion**\n\nNTT Ltd.’s Threat Detection has reliably been able to follow the changes in the use of Tier 2\nservers in the Emotet network infrastructure. It’s noteworthy how one of the largest threat\nactors today can largely operate undisturbed with Tier 2 servers having uptime of multiple\nmonths. This research is of use when planning takedown actions, but also in understanding\nthreat actors' operations and improving the detection capabilities that NTT Ltd. Threat\nDetection has in customer environments.\n\n\n-----\n\nIn the recently released 2020 Global Threat Intelligence Report, our researchers and thought\nleaders share statistics and trends from the previous year. A key theme in this year’s report\nis ‘Threat actors are innovating and evolving their tradecraft’. Read more about how\nautomation, multi-stage-payloads and custom targeted malware are changing the threat\n[landscape here.](https://services.global.ntt/en-us/insights/2020-global-threat-intelligence-report)\n\n**References**\n\n1 https://blog.centurylink.com/emotet-illuminated-mapping-a-tiered-botnet-using-global\nnetwork-forensics/\n\n2\n\nhttps://isc.sans.edu/forums/diary/Emotet+epoch+1+infection+with+Trickbot+gtag+mor84/257\n52/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-18 - Behind the scenes of the Emotet Infrastructure.pdf"
    ],
    "report_names": [
        "2020-06-18 - Behind the scenes of the Emotet Infrastructure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535593,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653751233,
    "ts_modification_date": 1653751233,
    "files": {
        "pdf": "https://archive.orkl.eu/b4b8432d33d9e6699cacf929ea1f17c1c753c00f.pdf",
        "text": "https://archive.orkl.eu/b4b8432d33d9e6699cacf929ea1f17c1c753c00f.txt",
        "img": "https://archive.orkl.eu/b4b8432d33d9e6699cacf929ea1f17c1c753c00f.jpg"
    }
}