{
    "id": "42e87d80-28fc-48ef-93df-d3940fae220b",
    "created_at": "2023-01-12T15:00:44.831051Z",
    "updated_at": "2025-03-27T02:09:29.858024Z",
    "deleted_at": null,
    "sha1_hash": "6e34e28a74849688bfa72ee49cda5d0cf65111db",
    "title": "2021-03-26 - Securing our approach to domain fronting within Azure",
    "authors": "",
    "file_creation_date": "2022-05-27T23:21:50Z",
    "file_modification_date": "2022-05-27T23:21:50Z",
    "file_size": 1057991,
    "plain_text": "# Securing our approach to domain fronting within Azure\n\n**[microsoft.com/security/blog/2021/03/26/securing-our-approach-to-domain-fronting-within-azure/](https://www.microsoft.com/security/blog/2021/03/26/securing-our-approach-to-domain-fronting-within-azure/)**\n\nMarch 26, 2021\n\nEvery single day our teams analyze the trillions of signals we see to understand attack\nvectors, and then take those learnings and apply them to our products and solutions. Having\nthat understanding of the threat landscape is key to ensuring our customers are kept safe\nevery day. However, being a security provider in a complex world sometimes requires deeper\nthinking and reflection on how to address emerging issues, especially when the answer is\nnot always immediately clear. Our approach to domain fronting within Azure is a great\nexample of how the ever-changing dynamics of our world have prompted us to re-examine\nan important and complicated issue—and ultimately make a change.\n\nLet’s start with some background. Domain fronting is a networking technique that enables a\nbackend domain to utilize the security credentials of a fronting domain. For example, if you\nhave two domains under the same content delivery network (CDN), domain #1 may have\ncertain restrictions placed on it (regional access limitations, etc.) that domain #2 does not. By\ntaking the valid domain #2 and placing it into the SNI header, and then using domain #1 in\nthe HTTP header, it’s possible to circumvent those restrictions. To the outside observer, all\n\n\n-----\n\nsubsequent traffic appears to be headed to the fronting domain, with no ability to discern the\nintended destination for particular user requests within that traffic. It is possible that the\nfronting domain and the backend domain do not belong to the same owner.\n\nAs a company that is committed to delivering technology for good, supporting certain use\ncases that support free and open communication are an important consideration when\nweighing the potential impacts of a technique like domain fronting. However, we know that\ndomain fronting is also abused by bad actors and threat actors engaging in illegal activities,\nand we’ve become aware that in some cases bad actors configure their Azure services to\nenable this.\n\nWhen it comes to situations like this, Microsoft—as a security company—leads from a place\nof providing greater simplicity for our customers when they face increased complexity. Our\nmission is to give our customers peace of mind and help them adapt quickly to a rapidly\nshifting threat landscape. Therefore, we’re making a change to our policy to ensure that\ndomain fronting will be stopped and prevented within Azure.\n\nChanges like this one are not made lightly, and we understand that there will be impacts\nacross a number of areas:\n\nOur engineering teams are already working to ensure the platform will block anyone\nfrom practicing the domain fronting technique on Azure, while also continuing to ensure\nour products and services provide the highest levels of protection against domain\nfronting based threats.\n[We’re continuing to provide clear guidance for penetration testing on our Azure](https://www.microsoft.com/en-us/msrc/pentest-rules-of-engagement?rtc=3)\nproperties, and working closely with security researchers around the world to make\nsure they have a clear understanding of these changes.\n\nThese changes are just another example of the broad impact that security has on our everchanging world and we’ll continue to put the security of our customers and their users at the\nforefront of everything we do. I’d like to thank my colleagues Nick Carr and Christopher Glyer\nfor their tireless research on Domain Fronting, which helped us to make these policy\nchanges to Azure.\n\n[To learn more about Microsoft Security solutions, visit our website. Bookmark the](https://www.microsoft.com/en-us/security/business/solutions) Security\nblog to keep up with our expert coverage on security matters. Also, follow us\nat [@MSFTSecurity for the latest news and updates on cybersecurity.](https://twitter.com/@MSFTSecurity)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-26 - Securing our approach to domain fronting within Azure.pdf"
    ],
    "report_names": [
        "2021-03-26 - Securing our approach to domain fronting within Azure.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535644,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653693710,
    "ts_modification_date": 1653693710,
    "files": {
        "pdf": "https://archive.orkl.eu/6e34e28a74849688bfa72ee49cda5d0cf65111db.pdf",
        "text": "https://archive.orkl.eu/6e34e28a74849688bfa72ee49cda5d0cf65111db.txt",
        "img": "https://archive.orkl.eu/6e34e28a74849688bfa72ee49cda5d0cf65111db.jpg"
    }
}