{
    "id": "434903b5-1d4e-4336-a899-b0a9ba9297f8",
    "created_at": "2023-06-05T02:07:17.570665Z",
    "updated_at": "2025-03-27T02:16:26.453245Z",
    "deleted_at": null,
    "sha1_hash": "9b899a97070c7d3e03c6c03d2e08c54292f40191",
    "title": "2023-05-23 - Android app breaking bad- From legitimate screen recording to file exfiltration within a year",
    "authors": "",
    "file_creation_date": "2023-06-04T12:54:48Z",
    "file_modification_date": "2023-06-04T12:54:48Z",
    "file_size": 995001,
    "plain_text": "# Android app breaking bad: From legitimate screen recording to file exfiltration within a year\n\n**[welivesecurity.com/2023/05/23/android-app-breaking-bad-legitimate-screen-recording-file-exfiltration/](https://www.welivesecurity.com/2023/05/23/android-app-breaking-bad-legitimate-screen-recording-file-exfiltration/)**\n\nMay 23, 2023\n\nESET researchers discover AhRat – a new Android RAT based on AhMyth – that exfiltrates files and records audio\n\n[Lukas Stefanko](https://www.welivesecurity.com/author/lstefanko/)\n23 May 2023 - 11:30AM\n\nESET researchers discover AhRat – a new Android RAT based on AhMyth – that exfiltrates files and records audio\n\nESET researchers have discovered a trojanized Android app that had been available on the Google Play store with over 50,000 installs. The\napp, named iRecorder – Screen Recorder, was initially uploaded to the store without malicious functionality on September 19, 2021.th\nHowever, it appears that malicious functionality was later implemented, most likely in version 1.3.8, which was made available in August\n2022.\n\n**Key points of the blogpost:**\n\nAs a Google App Defense Alliance partner, we detected a trojanized app available on the Google Play Store; we named the AhMythbased malware it contained AhRat.\nInitially, the iRecorder app did not have any harmful features. What is quite uncommon is that the application received an update\ncontaining malicious code quite a few months after its launch.\nThe application’s specific malicious behavior, which involves extracting microphone recordings and stealing files with specific\nextensions, potentially indicates its involvement in an espionage campaign.\nThe malicious app with over 50,000 downloads was removed from Google Play after our alert; we have not detected AhRat anywhere\nelse in the wild.\n\nIt is rare for a developer to upload a legitimate app, wait almost a year, and then update it with malicious code. The malicious code that was\nadded to the clean version of iRecorder is based on the open-source AhMyth Android RAT (remote access trojan) and has been customized\ninto what we named AhRat.\n\nBesides this one case, we have not detected AhRat anywhere else in the wild. However, this is not the first time that AhMyth-based Android\n[malware has been available on Google Play; we previously published our research on such a trojanized app in 2019. Back then, the spyware,](https://www.welivesecurity.com/2019/08/22/first-spyware-android-ahmyth-google-play/)\nbuilt on the foundations of AhMyth, circumvented Google’s app-vetting process twice, as a malicious app providing radio streaming.\n\n## Overview of the app\n\nAside from providing legitimate screen recording functionality, the malicious iRecorder can record surrounding audio from the device’s\nmicrophone and upload it to the attacker’s command and control (C&C) server. It can also exfiltrate files with extensions representing saved\nweb pages, images, audio, video, and document files, and file formats used for compressing multiple files, from the device. The app’s specific\nmalicious behavior – exfiltrating microphone recordings and stealing files with specific extensions – tends to suggest that it is part of an\nespionage campaign. However, we were not able to attribute the app to any particular malicious group.\n\nAs a Google App Defense Alliance partner, ESET identified the most recent version of the application as malicious and promptly shared its\nfindings with Google. Following our alert, the app was removed from the store.\n\n## Distribution\n\n\nThe iRecorder application was initially released on the Google Play Store on September 19, 2021, offering screen recording functionality; atth\nthat time, it contained no malicious features. However, around August 2022 we detected that the app’s developer included malicious\nfunctionality in version 1.3.8. As illustrated in Figure 1, by March 2023 the app had amassed over 50,000 installations.\n\n\n-----\n\n_Figure 1. The trojanized iRecorder app_\n\nHowever, Android users who had installed an earlier version of iRecorder (prior to version 1.3.8), which lacked any malicious features, would\nhave unknowingly exposed their devices to AhRat, if they subsequently updated the app either manually or automatically, even without\ngranting any further app permission approval.\n\n\n-----\n\no o g ou ot cat o ega d g eco de s a c ous be a o, t e Goog e ay secu ty tea e o ed t o t e sto e o e e, t s\nimportant to note that the app can also be found on alternative and unofficial Android markets. The iRecorder developer also provides other\napplications on Google Play, but they don’t contain malicious code.\n\n## Attribution\n\n[Previously, the open-source AhMyth was employed by Transparent Tribe, also known as APT36, a cyberespionage group known for its](https://attack.mitre.org/groups/G0134/)\n[extensive use of social engineering techniques and targeting government and military organizations in South Asia. Nevertheless, we cannot](https://www.welivesecurity.com/2023/03/07/love-scam-espionage-transparent-tribe-lures-indian-pakistani-officials/)\nascribe the current samples to any specific group, and there are no indications that they were produced by a known advanced persistent\nthreat (APT) group.\n\n## Analysis\n\nDuring our analysis, we identified two versions of malicious code based on AhMyth RAT. The first malicious version of iRecorder contained\nparts of AhMyth RAT’s malicious code, copied without any modifications. The second malicious version, which we named AhRat, was also\navailable on Google Play, and its AhMyth code was customized, including the code and communication between the C&C server and the\nbackdoor. By the time of this publication, we have not observed AhRat in any other Google Play app or elsewhere in the wild, iRecorder being\nthe only app that has contained this customized code.\n\nAhMyth RAT is a potent tool, capable of various malicious functions, including exfiltrating call logs, contacts, and text messages, obtaining a\nlist of files on the device, tracking the device location, sending SMS messages, recording audio, and taking pictures. However, we observed\nonly a limited set of malicious features derived from the original AhMyth RAT in both versions analyzed here. These functionalities appeared\nto fit within the already defined app permissions model, which grants access to files on the device and permits recording of audio. Notably, the\nmalicious app provided video recording functionality, so it was expected to ask for permission to record audio and store it on the device, as\nshown in Figure 2. Upon installation of the malicious app, it behaved as a standard app without any special extra permission requests that\nmight have revealed its malicious intentions.\n\n\n-----\n\n-----\n\n_Figure 2. Permissions requested by the iRecorder app_\n\nAfter installation, AhRat starts communicating with the C&C server by sending basic device information and receiving encryption keys and an\nencrypted configuration file, as seen in Figure 3. These keys are used to encrypt and decrypt the configuration file and some of the exfiltrated\ndata, such as the list of files on the device.\n\n\n-----\n\n_Figure 3. AhRat’s initial C&C communication_\n\nAfter the initial communication, AhRat pings the C&C server every 15 minutes, requesting a new configuration file. This file contains a range\nof commands and configuration information to be executed and set on the targeted device, including the file system location from which to\nextract user data, the file types with particular extensions to extract, a file size limit, the duration of microphone recordings (as set by the C&C\nserver; during analysis it was set to 60 seconds), and the interval of time to wait between recordings – 15 minutes – which is also when the\nnew configuration file is received from the C&C server.\n\nInterestingly, the decrypted configuration file contains more commands than AhRat is capable of executing, as certain malicious functionality\nhas not been implemented. This may indicate that AhRat is a lightweight version similar to the initial version that contained only unmodified\nmalicious code from the AhMyth RAT. Despite this, AhRat is still capable of exfiltrating files from the device and recording audio using the\ndevice’s microphone.\n\nBased on the commands received in the configuration from the C&C server, AhRat should be capable of executing 18 commands. However,\nthe RAT can execute only the six commands from the list below marked in bold and with an asterisk:\n\n**RECORD_MIC***\nCAPTURE_SCREEN\nLOCATION\nCALL_LOG\nKEYLOG\nNOTIFICATION\nSMS\nOTT\nWIFI\nAPP_LIST\nPERMISSION\nCONTACT\n**FILE_LIST***\n**UPLOAD_FILE_AFTER_DATE***\n**LIMIT_UPLOAD_FILE_SIZE***\n**UPLOAD_FILE_TYPE***\n**UPLOAD_FILE_FOLDER***\nSCHEDULE_INTERVAL\n\nThe implementation for most of these commands is not included in the app’s code, but most of their names are self-explanatory, as shown\nalso in Figure 4.\n\n\n-----\n\n_Figure 4. Decrypted configuration file with a list of commands_\n\nDuring our analysis, AhRat received commands to exfiltrate files with extensions representing web pages, images, audio, video, and\ndocument files, and file formats used for compressing multiple files. The file extensions are as follows: zip, rar, jpg, jpeg, jpe, jif, jfif, jfi, png,\nmp3, mp4, mkv, 3gp, m4v, mov, avi, gif, webp, tiff, tif, heif, heic, bmp, dib, svg, ai, eps, pdf, doc, docx, html, htm, odt, pdf, xls, xlsx, ods, ppt,\npptx, and txt.\n\nThese files were limited to a size of 20 MB and were located in the Download directory /storage/emulated/0/Download.\n\nLocated files were then uploaded to the C&C server, as seen in Figure 5.\n\n_Figure 5. File exfiltration to C&C server_\n\n## Conclusion\n\nThe AhRat research serves as a good example of how an initially legitimate application can transform into a malicious one, even after many\nmonths, spying on its users and compromising their privacy. While it is possible that the app developer had intended to build up a user base\nbefore compromising their Android devices through an update or that a malicious actor introduced this change in the app; so far, we have no\nevidence for either of these hypotheses.\n\nFortunately, preventative measures against such malicious actions have already been implemented in Android 11 and higher versions in the\nform of [App hibernation. This feature effectively places apps that have been dormant for several months into a hibernation state, thereby](https://developer.android.com/topic/performance/app-hibernation)\nresetting their runtime permissions and preventing malicious apps from functioning as intended. The malicious app was removed from Google\nPlay after our alert, which confirms that the need for protection to be provided through multiple layers, such as ESET Mobile Security, remains\nessential for safeguarding devices against potential security breaches.\n\n\n-----\n\ne e ote y co t o ed at s a custo at o o t e ope sou ce yt, c ea s t at t e aut o s o t e a c ous app\ninvested significant effort into understanding the code of both the app and the back end, ultimately adapting it to suit their own needs.\n\nAhRat’s malicious behavior, which includes recording audio using the device’s microphone and stealing files with specific extensions, might\nindicate that it was part of an espionage campaign. However, we have yet to find any concrete evidence that would enable us to attribute this\nactivity to a particular campaign or APT group.\n\n## IoCS\n\n### Files\n\n**SHA-1** **Package name** **ESET detection name** **Description**\n\nC73AFFAF6A9372C12D995843CC98E2ABC219F162 com.tsoft.app.iscreenrecorder Android/Spy.AhRat.A AhRat backdoor.\n\nE97C7AC722D30CCE5B6CC64885B1FFB43DE5F2DA com.tsoft.app.iscreenrecorder Android/Spy.AhRat.A AhRat backdoor.\n\nC0EBCC9A10459497F5E74AC5097C8BD364D93430 com.tsoft.app.iscreenrecorder Android/Spy.Android.CKN AhMyth‑based backdoor.\n\n0E7F5E043043A57AC07F2E6BA9C5AEE1399AAD30 com.tsoft.app.iscreenrecorder Android/Spy.Android.CKN AhMyth‑based backdoor.\n\n### Network\n\n**IP** **Provider** **First seen** **Details**\n\n34.87.78[.]222 Namecheap 2022-12-10 order.80876dd5[.]shop C&C server.\n\n13.228.247[.]118 Namecheap 2021-10-05 80876dd5[.]shop:22222 C&C server.\n\n## MITRE ATT&CK Techniques\n\n[This table was built using version 12 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)\n\n**Tactic** **ID** **Name** **Description**\n\nPersistence [T1398](https://attack.mitre.org/versions/v12/techniques/T1398/) Boot or Logon Initialization Scripts AhRat receives the\nBOOT_COMPLETED broadcast\nintent to activate at device startup.\n\n\n[T1624.001](https://attack.mitre.org/versions/v12/techniques/T1624/001/) Event Triggered\nExecution:\nBroadcast\nReceivers\n\n\nAhRat functionality is triggered if one of these events occurs:\nCONNECTIVITY_CHANGE, or WIFI_STATE_CHANGED.\n\n\nDiscovery [T1420](https://attack.mitre.org/versions/v12/techniques/T1420) File and Directory Discovery AhRat can list available files on\nexternal storage.\n\n\n[T1426](https://attack.mitre.org/versions/v12/techniques/T1426/) System Information\nDiscovery\n\n\nAhRat can extract information about the device, including\ndevice ID, country, device manufacturer and mode, and\ncommon system information.\n\n\nCollection [T1533](https://attack.mitre.org/versions/v12/techniques/T1533/) Data from Local System AhRat can exfiltrate files with\nparticular extensions from a device.\n\n[T1429](https://attack.mitre.org/versions/v12/techniques/T1429) Audio Capture AhRat can record surrounding audio.\n\n\nCommand\nand Control\n\n\n[T1437.001](https://attack.mitre.org/versions/v11/techniques/T1437/001/) Application Layer Protocol: Web Protocols AhRat uses HTTPS to communicate\nwith its C&C server.\n\n\nExfiltration [T1646](https://attack.mitre.org/versions/v11/techniques/T1646/) Exfiltration Over C2 Channel AhRat exfiltrates stolen data over its\nC&C channel.\n\n\n-----\n\n23 May 2023 - 11:30AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-23 - Android app breaking bad- From legitimate screen recording to file exfiltration within a year.pdf"
    ],
    "report_names": [
        "2023-05-23 - Android app breaking bad- From legitimate screen recording to file exfiltration within a year.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1685930837,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1685883288,
    "ts_modification_date": 1685883288,
    "files": {
        "pdf": "https://archive.orkl.eu/9b899a97070c7d3e03c6c03d2e08c54292f40191.pdf",
        "text": "https://archive.orkl.eu/9b899a97070c7d3e03c6c03d2e08c54292f40191.txt",
        "img": "https://archive.orkl.eu/9b899a97070c7d3e03c6c03d2e08c54292f40191.jpg"
    }
}