{
    "id": "437bb0fc-8bfb-4da8-a14d-32484ba11bb2",
    "created_at": "2023-01-12T15:08:40.462147Z",
    "updated_at": "2025-03-27T02:09:30.298604Z",
    "deleted_at": null,
    "sha1_hash": "be79f005fc3b80d6345144a26cb9558579cfeb2b",
    "title": "2021-06-04 - The Ransomware Conundrum – A Look into DarkSide",
    "authors": "",
    "file_creation_date": "2022-05-27T21:38:28Z",
    "file_modification_date": "2022-05-27T21:38:28Z",
    "file_size": 941451,
    "plain_text": "# The Ransomware Conundrum – A Look into DarkSide\n\n**deepinstinct.com/2021/06/04/the-ransomware-conundrum-a-look-into-darkside/**\n\nJune 4, 2021 | [Bar Block](https://www.deepinstinct.com/author/bar-block)\n\n\nJune 4, 2021\n\n\nBy now most of you should be familiar with the Colonial Pipeline ransomware incident that shut down a mission-critical U.S. fuel pipeline. The\n[breach and subsequent disruption of services took the company offline for days and a $4.4M ransom was paid.](https://www.wsj.com/articles/colonial-pipeline-ceo-tells-why-he-paid-hackers-a-4-4-million-ransom-11621435636)\n\nRansomware has been gaining attention both in the U.S. and around the world not only because of the severe business impact an attack can\nhave on target companies, but also because the frequency and significance of these attacks are growing in scope and scale.\n\nIn this post we will provide context into the DarkSide attack.\n\n**DarkSide Ransomware-as-a-Service (RaaS) Takes Center Stage**\n\nDarkSide has been observed in more than 15 countries since first being spotted in the wild in August 2020. DarkSide, sold using the nickname\n“Darksupp,” is part of a disturbing – and growing – trend called Ransomware-as-a-Service (RaaS) where ransomware is sold on darknet sites.\nDarkSide itself was listed on Russian darknet forums exploit.in and xss.is. RaaS has been gaining momentum for the past several years with\nsome of the most prolific ransomware attacks, including Satan, stemming from similar origins.\n\nIn this RaaS model, buyers or “affiliates,” are provided an interface from which they can costume their own DarkSide variant, manage victims,\nand write content for the DarkSide blog, where victim information and data is published and where affiliates can pressure for payment. In\nexchange, affiliates give the malware creators a stake of the ransom payment, which varies in percentage based on the ransom request\namount.\n\nIn reported attack scenarios, threat actors, which could be affiliates or the creators of DarkSide themselves, infiltrated an organization using\nvarious methods, including exploiting known organizational VPN vulnerabilities and using legitimate user credentials. Once the exploit has\ntaken place, the DarkSide payload is downloaded and copied into different locations on local and network drives. Once the victim, patient zero,\n\n\n-----\n\nas bee u y ected, t e t eat acto s set o o t e quest to d t e et o s o y g a t e o a [Co t o e ( C)](https://en.wikipedia.org/wiki/Domain_controller) t ey success u y\n[reach their destination, the attackers then collect more sensitive information and files. They could also dump the SAM registry hive, to extract](https://en.wikipedia.org/wiki/Security_Account_Manager)\npasswords.\n\nWhen the exfiltration is completed, the DC is infected with the malware, as well as the associated network. The malicious actors can then use\nit later in the attack to infect other targets in the network. Finally, an execution mechanism, such as Windows Scheduled Task, runs the\nransomware payload, which will be discussed in length later in this post.\n\nVictims are informed of the attack by a ransom note, which is typically placed on the desktop and in affected folders. If victim companies refuse\nto pay the ransom their data remains encrypted and the attackers may make stolen artifacts available for public access.\n\n**Bringing DarkSide into the Light – The Colonial Pipeline Attack and its Consequences**\n\nOn May 7, 2021, the Colonial Pipeline Company was attacked by DarkSide. The pipeline the company operates (of the same name) carries 45\npercent of the fuel used to supply the U.S. East Coast, so any disruption of this pipeline will invariably cause fuel and supply chain problems.\nThe brunt of the attack impacted the company’s data systems, but Colonial Pipeline chose to disable the operational technology systems as\nwell to mitigate any larger damage or disruption – a decision which created its own set of compounding challenges. This decision may not\nhave been taken if the company had a network isolation solution it could count on to prevent the ransomware from reaching the operational\nsystems. Not only did this threaten the supply of fuel and gasoline to the most populous region of the U.S., but it also led to immediate gas\nshortages, long gas station lines, panic, and price hikes.\n\nOn the same day of the attack, Colonial Pipeline Company, which is a private company, chose to pay the ransom, about $4.4 million USD in\nBitcoin, despite the FBI’s discouragement to do so (the logic being that large ransomware payments only incentivize more ransomware attacks\nand larger ransomware payouts).\n\nOn May 12, five days following the attack, the company successfully brought the pipeline back online, with normal activity resuming in the\nfollowing days.\n\nBut the fallout from this attack will likely last much longer.\n\nGiven the high-profile nature of this attack, and the chain reaction it had on gas supply, business operations, consumer confidence, and the\nlarger, interconnected supply chain, ransomware has gained the attention of business executives and the U.S. government alike. In the days\nfollowing the attack, DarkSide became an immediate target of U.S. President Biden and the DarkSide website was shut down in short order.\nFearing further repercussions and investigation, DarkSide and other ransomware groups, including Babuk, which had attacked the Washington\nD.C. police department in the same month, announced their dissolution later that week.\n\n**An Analysis of a DarkSide Sample**\n\nDarkSide RaaS models provide affiliates with an infrastructure from which they can create their own ransomware builds and lead attacks at\ntheir own discretion. Using this console, affiliates can decide how their variant will act by choosing the encryption mode, deciding whether a\nlanguage check will be performed to determine if the victim is from a CIS country, disabling or enabling network drives encryption, shadow\ncopies deletion, and more.\n\nThe analyzed sample, which is referred to in this section, unless specified otherwise, has a SHA256 value of\n6931b124d38d52bd7cdef48121fda457d407b63b59bb4e6ead4ce548f4bbb971.\n\nWhen this DarkSide variant runs, it creates a file in which it logs its actions in the directory it runs from called LOG.victim_extension.TXT. The\n“victim_extension” is an 8-character pseudo-random string that DarkSide variants generate and use as the extension for encrypted files on\ninfected machines. This string is also used in the names of the ransom and log files.\n\n_Figure 1: DarkSide's log file_\n\n\n-----\n\ns ca be see t e abo e age, be o e sta t g t e e c ypt o, a S de too so e easu es to e su e t e e c ypted es cou d ot be\nreplaced by local backups – it uninstalled backup services, terminated certain processes that had handles on files it wished to encrypt, emptied\nthe recycle bin, and for the final nail in the coffin, deleted the shadow copies using the following PowerShell command:\n\npowershell -ep bypass -c \"(0..61)|%{$s+=[char][byte]\n('0x'+'4765742D576D694F626A6563742057696E33325F536861646F77636F7079207C20466F72456163682D4F626A656374207B245F2E44656\n$s\"\n\nVariable “s” contained the following: Get-WmiObject Win32_Shadowcopy | ForEach-Object {$_.Delete();}\n\nNext, DarkSide began encrypting all the files on the file system, except those which resided in certain directories, such as “Windows,”\n“ProgramData,” and “AppData,” were of specified types, for example: “exe,” “bat,” and “bin,” or had one of a set of names to ignore, such as\n“thumbs.db” and “netuser.dat.”\n\nThe following ransom note was dropped in all the directories the ransomware had visited:\n\nFigure 2: DarkSide's ransom note\n\nAs previously mentioned, DarkSide’s website had been taken down, therefore the automatically generated URLs did not lead to any page and\nno data was actually exfiltrated. In any case, even if the servers were still up, 100GB of data could not have been stolen, since the used file\nsystem did not contain this amount of data and no attempts to connect to a remote server were observed during the analysis. It is safe to say\nthis number is fixed, at least per variant (other analyzed samples mentioned different amounts of stolen data, such as 400GB), and cannot be\ncounted on to estimate the amount of stolen data.\n\n**Deep Instinct vs DarkSide**\n\nDeep Instinct’s endpoint solution prevents DarkSide variants execution both statically, via our deep learning brain, and dynamically via our\nbehavioral analysis mechanisms. As such, Deep Instinct offers the world’s most advanced prevention against all known and unknown\nransomware attacks.\n\nFigure 3: static prevention event on DarkSide\n\n\n-----\n\nFigure 4: the PowerShell command used to delete shadow copies was identified as malicious and prevented.\n\nFigure 5: DarkSide was prevented due to\n\nidentified ransomware behavior, before any file was encrypted.\n\n**Conclusion**\n\nRaaS-based attacks are far from over. As the technology and the expertise of lone hackers or larger syndicates grow in sophistication, we are\nlikely to see more diverse and sinister ransomware attacks. And their profile companies could move upstream, impacting global brands with\nlarger purses from which to pay ransoms.\n\nBut there is a solution to ransomware – using Deep Instinct to predict and prevent ransomware, stopping it before it can impact your system\nand operations. DarkSide has left a permanent mark on Colonial Pipeline Company and cost it dearly in revenue and reputation. Invest in your\nsecurity posture and better prepare your network defense to prevent ransomware.\n\nIf you’d like to learn more about our industry-leading approach to stopping malware, backed by a $3M guarantee, please download our new\neBook, [Ransomware: Why Prevention is better than the Cure.](https://info.deepinstinct.com/tof/ransomware-prevention?_ga=2.99070299.453200457.1622600658-1453025447.1612830865)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-04 - The Ransomware Conundrum – A Look into DarkSide.pdf"
    ],
    "report_names": [
        "2021-06-04 - The Ransomware Conundrum – A Look into DarkSide.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536120,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653687508,
    "ts_modification_date": 1653687508,
    "files": {
        "pdf": "https://archive.orkl.eu/be79f005fc3b80d6345144a26cb9558579cfeb2b.pdf",
        "text": "https://archive.orkl.eu/be79f005fc3b80d6345144a26cb9558579cfeb2b.txt",
        "img": "https://archive.orkl.eu/be79f005fc3b80d6345144a26cb9558579cfeb2b.jpg"
    }
}