{
    "id": "438d4ac6-b9e7-454a-837a-ce94b05aa448",
    "created_at": "2023-01-12T15:00:25.353427Z",
    "updated_at": "2025-03-27T02:05:53.178994Z",
    "deleted_at": null,
    "sha1_hash": "d3b3dce5007412635f05f371aa30d879c4f61cc8",
    "title": "2022-01-31 - 1 in 7 Ransomware Extortion Attacks Leak Critical Operational Technology Information",
    "authors": "",
    "file_creation_date": "2022-05-29T10:36:23Z",
    "file_modification_date": "2022-05-29T10:36:23Z",
    "file_size": 3369993,
    "plain_text": "# 1 in 7 Ransomware Extortion Attacks Leak Critical Operational Technology Information\n\n**mandiant.com/resources/ransomware-extortion-ot-docs**\n\nBlog\n\nDaniel Kapellmann Zafra, Corey Hidelbrandt, Nathan Brubaker, Keith Lunden\n\nJan 31, 2022\n\n10 mins read\n\nRansomware\n\nOperational Technology\n\ncybercrime\n\nextortion\n\n\n-----\n\nData leaks have always been a concern for organizations. The exposure of sensitive\ninformation can result in damage to reputation, legal penalties, loss of intellectual property,\nand even impact the privacy of employees and customers. However, there is little research\nabout the challenges posed to industrial organizations when threat actors disclose sensitive\ndetails about their OT security, production, operations, or technology.\n\nIn 2021, Mandiant Threat Intelligence continued observing ransomware operators attempting\nto extort thousands of victims by disclosing terabytes of stolen information on shaming sites.\nThis trend, which we refer to as “Multifaceted Extortion,” impacted over 1,300 organizations\nfrom critical infrastructure and industrial production sectors in just one year.\n\nTo validate the extent to which multifaceted extortion leaks represent a risk to OT, Mandiant\nanalyzed a semi-random selection of samples from industries that typically leverage OT\nsystems for production. Using various technical and human resources, we downloaded and\nparsed through many terabytes of dump data and found a substantial amount of sensitive OT\ndocumentation. This included network and engineering diagrams, images of operator panels,\ninformation on third-party services, and more. We note that our analysis of each dump was\nlimited due to the scale of our dataset and that a more targeted examination of a handful of\ndumps would probably uncover more documentation per organization.\n\nBased on our analysis, one out of every seven leaks from industrial organizations posted in\nransomware extortion sites is likely to expose sensitive OT documentation. Access to this\ntype of data can enable threat actors to learn about an industrial environment, identify paths\nof least resistance, and engineer cyber physical attacks. On top of this, other data also\nincluded in the leaks about employees, processes, projects, etc. can provide an actor with a\nvery accurate picture of the target’s culture, plans, and operations.\n\n## Mandiant Found a Range of Sensitive OT Documents on Extortion Sites\n\nIn early 2020, Mandiant observed media claims indicating ransomware leaks exposed\n[aerospace manufacturing designs and third party technical documentation from an electric](https://www.theregister.com/2020/04/10/lockheed_martin_spacex_ransomware_leak/)\nutility. A year later, an actor reshared a 2.3 GB Doppelpaymer extortion leak from a major\nLatin American oil and gas organization in an underground forum, claiming it contained OT\ninformation.\n\nWe analyzed that leak and found a variety of sensitive data including usernames and\npasswords, IP addresses, remote services, asset tags, original equipment manufacturer\n(OEM) information, operator panels, network diagrams, etc. All information which a\nsophisticated threat actor would be hunting for during reconnaissance or what Mandiant’s\nred teamers would employ to identify attack paths in a target OT network.\n\n\n-----\n\nFigure 1: Extortion leak for a major Latin American oil and gas organization\nTo better understand the risk these data leaks pose to OT asset owners, we built a large\ndataset. Over a couple of months, a small team of analysts and data researchers filtered\nthrough hundreds of leaks, collected, and analyzed samples to find OT documentation. We\nidentified at least 10 dumps that contained sensitive OT technical data. Due to the volume of\ndata in many leaks, we performed only superficial analysis of the dumps, however had we\ninvested additional resources to process our samples further, we would have likely found a\nsignificant amount of additional information.\n\nWe note that most threat actors would likely focus their efforts on a smaller number of\norganizations due to resource limitations or a preexisting interest in a specific target or\ntargets. This would allow the actor to focus their resources on finding more information on\neach target, which would be essential for any sophisticated attack.\n\n### Initial Triage\n\nIn 2021, we identified over 3,000 extortion leaks released by ransomware operators. Around\n1,300 of these leaks were from organizations in industrial sectors that are likely to use OT\nsystems, such as energy and water utilities, or manufacturing. We selected and retrieved a\ncouple hundred of these samples by skimming through readily available file listings or other\nindicators of interest such as comments from the actor, or the targets’ subindustry. In many\ncases, we were not able to acquire or access data from a leak because of timing or errors in\nthe shared files; in these cases, we discarded the leak.\n\n\n-----\n\nFigure 2: Filtered volume of extortion leaks\nAfter initial triage, we collected and manually analyzed approximately 70 leaks using custom\nand publicly available tools. We found that one out of every seven leaks contained at least\nsome useful OT information, while the rest contained data related to employees, finances,\ncustomers, legal documentation, among other things. Mandiant did not further analyze those\nfiles, though we note they remain available to threat actors for other purposes.\n\n### Collecting Several Terabytes of Already Filtered Data\n\nRansomware extortion leaks are mostly shared on a variety of threat actor-operated sites on\nthe dark web. Although each actor operates differently, advertisements for incoming leaks\nare typically posted in hacker forums or on social media. Anyone with access to a Tor\nbrowser can visit the sites and download available dumps.\n\n\n-----\n\nFigure 3: Example images from ransomware extortion sites\nDownloading a single extortion leak is very simple but collecting multiple samples from\ndifferent leaks is quite complex given the enormous volume of available data. The ability to\ndownload each of these leaks depends on multiple factors such as the infrastructure from the\nattacker and the downloader, the time during which the data is exposed, the number of users\nacquiring the file, and the quality of the file itself.\n\nAcquiring each dump may require multiple hours and sometimes days. The dumps can often\nfill entire hard drives or virtual machines. To be able to collect, store, and further analyze\nmultiple dumps, Mandiant leveraged a custom-built internal collections pipeline. It is likely\nthat only well-resourced actors would have enough resources to reproduce this approach.\n\n### Analyzing the Samples to Find Sensitive Technical Documentation\n\nWe leveraged manual and automated file analysis to hunt through the data from interesting\nsamples. We looked for documents such as network and process diagrams, machine\ninterfaces, asset inventories, usernames and passwords, and project files. In a few cases we\n\n\n-----\n\nalso examined third-party vendor agreements.\n\n**Method #1: File Listing of Manual Analysis**\n\nWe browsed through file listings to identify keywords that hinted at the existence of OTrelated data. We obtained the file listings in a few ways:\n\nSometimes actors released a directory or text file listing to advertise the extortion leak.\nIf there was no file listing available, we attempted to create it ourselves.\n\nFor small and medium-sized dumps we used Autopsy, a free publicly available\n[forensics tool. The tool is also included in Mandiant’s FLARE VM image which is](https://github.com/mandiant/flare-vm)\ndistributed as open source.\nFor larger dumps, we used custom-built tools or downloaded the files locally to\nbuild a listing via default tools like rar or 7z.\nIf we were not able to acquire a listing, we browsed manually through file names.\n\nIn some cases, a quick look at the listing and keyword searching was enough to determine if\nthe dump was suitable for analysis, but in other cases the file naming conventions did not\nreveal much information. Another aspect that added a layer of complexity was that the\nextortion leaks contained data in various languages.\n\n**Method #2: Forensic Analysis with Public and Custom Tools**\n\nFor small and medium-sized dumps we used Autopsy, which enabled us to analyze relatively\nlarge-sized folders. The tool can parse a file and provide summaries of timestamps, file\ntypes, keywords, and other useful data. We were also able to search for keywords using\nregular expressions to find data such as IP addresses or usernames, and to quickly visualize\n.jpeg images of existent files.\n\n\n-----\n\nFigure 4: Analysis of extortion leak files using Autopsy\nHowever, Autopsy struggled to analyze larger dumps. It would require multiple hours to\nparse a dump of just a couple gigabytes, yet we had identified leaks that contained terabytes\nof data. As a result, we had to build custom tools to visualize and analyze larger amounts of\ndata. We note that even using custom tooling, we still required significant storage capabilities\nand human investment to handle the data.\n\n### We Found a Substantial Amount of OT Documentation\n\nFinding sensitive OT documentation across such a large volume of files is not simple, but it is\npossible. Our findings included data from organizations across different sectors and regions.\nAlthough each of the leaks contained full information about the victim, we redacted their\nnames and other proprietary information. We provide some examples of our findings below,\n[but interested readers can sign up for a Mandiant Threat Intelligence Free account to view a](https://www.mandiant.com/advantage/threat-intelligence/free-version)\nversion of this report that includes a more detailed appendix of our findings.\n\nTable 1: Selection of findings\n\n\n**Victim**\n\n**(Names**\n**Redacted)**\n\n\n**Leak Contents**\n\n\n-----\n\nManufacturer\nof industrial\nand\npassenger\ntrains\n\nTwo oil and\ngas\norganizations\n\nControl\nsystems\nintegrator\n\nHydroelectric\nenergy\nproducer\n\nSatellite\nvehicle\ntracking\nservice\nprovider\n\nRenewable\nenergy\nproducer\n\n\nPassword administration credentials for an OEM, requirements for control\narchitecture and communication channels for European tram vehicle,\nbackups of Siemens TIA Portal PLC project files, etc.\n\nIn-depth network and process documentation, including diagrams, HMIs,\nspreadsheets, etc.\n\nEngineering documentation from customer projects (Some files were\npassword protected, which we did not attempt to bypass).\n\nMost data was financial and accounting related, however we identified a\nlist of names, emails, user privileges, and some passwords from IT, plant\nmaintenance, and operations employees.\n\nProduct diagrams, visualizations, and source code from a proprietary\nplatform used to track automobile fleets via Global Positioning System\n(GPS).\n\nLegal agreements between the victim and customers stating the conditions\nfor maintenance and supply of renewable energy infrastructure. The\ncontracts stated that the service provider had full access to the third party’s\nSCADA system via public internet IP addresses.\n\n\n## Sophisticated Threat Actors Can Leverage Data Leaks to Support Reconnaissance Efforts\n\nSensitive OT and network documentation exposed in ransomware extortion leaks is readily\navailable for anyone to download, including security researchers, industry competitors, or\nthreat actors. As we have highlighted, the most concerning scenario involves well-resourced\nactors that have the capability to systematically hunt for data to learn about specific targets.\n\n\n-----\n\nHistorically, espionage campaigns have helped state-sponsored groups to acquire\ndetails about the operations of industrial organizations. This reconnaissance data has\nsupported different stages of real cyber physical attacks such as the Ukraine power\noutages in 2015 and 2016 and the TRITON incident.\n\nData from extortion leaks may provide sophisticated actors with information on\ntargets, while limiting their exposure to defenders and cost of operations.\nActors may also select targets based on readily available sensitive data about the\nvictim’s infrastructure, assets, security flaws, and processes.\nAttacks that leverage higher levels of cyber physical reconnaissance data are\nlikely to result in more significant and precise impacts.\n[Mandiant has released blogs describing how we use network details and](https://www.mandiant.com/resources/hacking-operational-technology-for-defense-lessons-learned) process\ndocumentation to model attack scenarios during OT red teaming engagements.\nActors that have limited resources and capabilities will likely have more limited visibility\ninto data from large extortion leaks. However, they can still explore dumps learn about\nan organization, satisfy their curiosity, or reshare the contents.\n\n## Protecting OT Data from Multifaceted Extortion Leaks\n\nBased on our analysis, one out of every seven leaks from industrial organizations posted in\nransomware extortion sites is likely to expose sensitive OT documentation. Access to this\ntype of data can enable threat actors to learn about an industrial environment, identify paths\nof least resistance, and engineer cyber physical attacks. On top of this, other data also\nincluded in the leaks about employees, processes, projects, etc. can provide an actor with a\nvery accurate picture of the target’s culture, plans, and operations.\n\nEven if the exposed OT data is relatively old, the typical life span of cyber physical systems\nranges from twenty to thirty years, resulting in leaks being relevant for reconnaissance efforts\nfor decades—much longer than exposed information on IT infrastructure. To prevent and\nmitigate the risks presented by exposed OT data, we suggest the following:\n\nCreate and enforce robust data handling policies for employees and subcontractors to\nensure that internal documentation is protected. Avoid storing highly sensitive\noperational data in less-secure networks.\nPlace special attention on selecting subcontractors that implement comprehensive\nsecurity programs to safeguard operational data.\nVictims of ransomware intrusions should assess the value of any leaked data to\ndetermine what compensatory controls can help decrease the risk of further intrusions.\nChange any leaked credentials and API keys. Consider changing exposed IP\naddresses for critical systems and OT jump servers.\nPeriodically conduct red team exercises to identify externally exposed and insecure\ninternal information.\n\nMandiant offers a suite of [service options, including OT red teaming, to help OT](https://www.mandiant.com/services/consulting)\nasset owners mitigate risk or respond to incidents after they occur.\n\n\n-----\n\n## Acknowledgements\n\nThis research was made possible thanks to the hard work of many people not listed on the\nby line. A huge thanks to the Mandiant Research Team and everyone else who supported\nthis effort.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-31 - 1 in 7 Ransomware Extortion Attacks Leak Critical Operational Technology Information.pdf"
    ],
    "report_names": [
        "2022-01-31 - 1 in 7 Ransomware Extortion Attacks Leak Critical Operational Technology Information.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535625,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1653820583,
    "ts_modification_date": 1653820583,
    "files": {
        "pdf": "https://archive.orkl.eu/d3b3dce5007412635f05f371aa30d879c4f61cc8.pdf",
        "text": "https://archive.orkl.eu/d3b3dce5007412635f05f371aa30d879c4f61cc8.txt",
        "img": "https://archive.orkl.eu/d3b3dce5007412635f05f371aa30d879c4f61cc8.jpg"
    }
}