{
    "id": "43c74fb5-1ef6-44dc-b929-4b067aecc9d0",
    "created_at": "2023-01-12T15:08:47.732844Z",
    "updated_at": "2025-03-27T02:17:27.69045Z",
    "deleted_at": null,
    "sha1_hash": "df3ed87ff31dfb5d6ca7e366bf6f53a6e82dab6a",
    "title": "2019-04-23 - DNSpionage brings out the Karkoff",
    "authors": "",
    "file_creation_date": "2022-05-28T15:55:51Z",
    "file_modification_date": "2022-05-28T15:55:51Z",
    "file_size": 1314703,
    "plain_text": "# DNSpionage brings out the Karkoff\n\n**[blog.talosintelligence.com/2019/04/dnspionage-brings-out-karkoff.html](https://blog.talosintelligence.com/2019/04/dnspionage-brings-out-karkoff.html)**\n\n_[Warren Mercer and](https://twitter.com/securitybeard)_ _[Paul Rascagneres authored this post.](https://twitter.com/r00tbsd)_\n\n_Update 4/24: The C2 section below now includes details around the XOR element of the C2_\n_communication system._\n\n## Executive summary\n\n[In November 2018, Cisco Talos discovered an attack campaign, called DNSpionage, in](https://blog.talosintelligence.com/2018/11/dnspionage-campaign-targets-middle-east.html)\nwhich threat actors created a new remote administrative tool that supports HTTP and DNS\ncommunication with the attackers' command and control(C2). Since then, there have been\nseveral other public reports of additional DNSpionage attacks, and in January, the U.S.\n[Department of Homeland Security issued an alert warning users about this threat activity.](https://www.us-cert.gov/ncas/alerts/AA19-024A)\n\nIn addition to increased reports of threat activity, we have also discovered new evidence that\nthe threat actors behind the DNSpionage campaign continue to change their tactics, likely in\nan attempt to improve the efficacy of their operations. In February, we discovered some\nchanges to the actors' tactics, techniques and procedures (TTPs), including the use of a new\nreconnaissance phase that selectively chooses which targets to infect with malware. In April\n2019, we also discovered the actors using a new malware, which we are calling \"Karkoff.\"\n\n\n-----\n\nThis post will cover the aforementioned DNSpionage updates, the discovery of the Karkoff\nmalware and an analysis of the recent Oilrig malware toolset leak — and how it could be\nconnected to these two attacks.\n\n## DNSpionage update\n\n### New infection document, same macro\n\nIn our previous post concerning DNSpionage, we showed that the malware author used\nmalicious macros embedded in a Microsoft Word document. In the new sample from\nLebanon identified at the end of February, the attacker used an Excel document with a\nsimilar macro:\n\nInstead of using the .oracleServices directory, which we had previously observed, the\nattacker uses a .msdonedrive directory and renames the malware \"taskwin32.exe.\" The\nscheduled task was also renamed to \"onedrive updater v10.12.5.\"\n\n### Payload\n\n**Overview**\n\n\n-----\n\nThis new sample is similar to the previous version disclosed in our previous post. The\nmalware supports HTTP and DNS communication to the C2 server. The HTTP\ncommunication is hidden in the comments in the HTML code. This time, however, the C2\nserver mimics the GitHub platform instead of Wikipedia. While the DNS communication\nfollows the same method we described in our previous article, the developer added some\nnew features in this latest version and, this time, the actor removed the debug mode.\n\nWe also discovered that the actor added a reconnaissance phase, likely in response to the\nsignificant amount of interest in the campaign. This new phase, which is discussed in greater\ndetail below, ensures that the payload is being dropped on specific targets rather than\nindiscriminately downloaded on every machine. This new tactic indicates an improved level\nof actor sophistication.\n\n**New reconnaissance phase**\n\nOn the initial execution, the malware drops a Windows batch file (a.bat) in order to execute a\nWMI command and obtain all the running processes on the victim's machine:\n\nwmic process list\n\nThe malware also identifies the username and computer name of the infected system.\nFinally, it uses the NetWkstaGetInfo() API with the level 100 to retrieve additional info on the\nsystem (this is the 64th number, hex 64 is 100 decimal).\n\nThis level returns information about the workstation environment, including platform-specific\ninformation, the name of the domain and the local computer, and information concerning the\noperating system. This information is key to helping the malware select the victims only and\n\n\n-----\n\nattempts to avoid researchers or sandboxes. Again, it shows the actor s improved abilities,\nas they now fingerprint the victim.\n\n**API and strings obfuscation**\n\nIn this latest version, the developer split some strings into two parts. The actor attempts to\nuse this technique to \"hide\" API call and internal strings. This would prevent static string\nanalysis processes.\n\nBelow is an example of an API call split. It is in reverse order starting with \"rNameA,\"\nfollowed by \"GetUse,\" and the offset is also named incorrectly \"aRnamea\" and \"aGetuse\"\n(GetUserNameA()):\n\nBelow is an example of an internal string split (.\\\\Configure.txt):\n\nThis approach is not particularly sophisticated compared to what we usually observe.\nHowever, it is enough to break a Yara rule based on these strings. For example, the following\nrule would no longer alert due to a failed pattern match:\n```\nrule DNSpionage {\nstrings:\n$conf=\"Configure.txt\"\ncondition:\nAll of them\n}\n\n```\n\n-----\n\n**Let s check your anti-virus**\n\nThe malware searches for two specific anti-virus platforms: Avira and Avast.\n\nIf one of these security products is installed on the system and identified during the\nreconnaissance phase, a specific flag will be set and some options from the configuration file\nwill be ignored.\n\n### DNSpionage Excel maldoc\n\nThis new sample of DNSpionage has some oddities which we believe might be the actor's\nattempt to taunt or poke fun at the research community. We occasionally see this in cases\nwhere actors are disclosed by researchers or vendors. In DNSpionage, upon opening the\n\n\n-----\n\nExcel document, users are greeted with the insult, haha you are donkey [sic]. The broken\nEnglish suggests the actor is unlikely a native English speaker.\n\nThe domain used for the C2 is also bizarre. The previous version of DNSpionage attempted\nto use legitimate-looking domains in an attempt to remain undetected. However, this newer\nversion uses the domain \"coldfart[.]com,\" which would be easier to spot than other APT\ncampaigns which generally try to blend in with traffic more suitable to enterprise\nenvironments. The domain was also hosted in the U.S., which is unusual for any espionagestyle attack. This type of behavior will likely continue to distinguish this actor from more\nconcerning campaigns like Sea Turtle, a [separate DNS hijacking campaign we wrote about](https://blog.talosintelligence.com/2019/04/seaturtle.html)\nlast week.\n\n## Along comes a Karkoff\n\n### Payload analysis\n\nIn April, Cisco Talos identified an undocumented malware developed in .NET. On the\nanalyzed samples, the malware author left two different internal names in plain text:\n\"DropperBackdoor\" and \"Karkoff.\" We decided to use the second name as the malware's\nmoniker, as it is less generic. The malware is lightweight compared to other malware due to\nits small size and allows remote code execution from the C2 server. There is no obfuscation\nand the code can be easily disassembled. The malware is a Windows service named\n\"MSExchangeClient:\"\n\n\n-----\n\nFrom an incident response point of view, it's interesting to note that the malware generates a\nlog file: C:\\\\Windows\\\\Temp\\\\MSEx_log.txt. The executed commands are stored in this file\n(xored with 'M') with a timestamp. This log file can be easily used to create a timeline of the\ncommand execution which can be extremely useful when responding to this type of threat.\nWith this in mind, an organisation compromised with this malware would have the\nopportunity to review the log file and identify the commands carried out against them.\n\n### C2 communication\n\nThe C2 servers are hardcoded in the analyzed samples:\n\n\n-----\n\nThe malware uses the domain or the IP address. Karkoff supports HTTP and HTTPS\ncommunications.\n\nKarkoff uses base64 encoding to initially obfuscate the C2 communications. This is then\nfurther obfuscated by carrying out a XOR function, with a XOR key 70 (decimal).\n\nThis is derived from the “DropperBackdoor.constants” value “Constants.k__BackingField =\n70;”.\n\n\n-----\n\nThe JSON .NET library is embedded in the malware. This library is used to handle messages\nfrom the C2 server. The answer is first decoded (base64) and the commands match the\nfollowing pattern:\n```\n[{\"ID\": \"123\", \"Data\": \"filename.exe|base64PEContent\", \"Type\": \"101\"}, {\"ID\": \"124\",\n\"Data\": \"filename.exe arg1 arg2\", \"Type\": \"102\"}].\n\n```\nThe command type 101 means that the data will be a base64 encoded file. The file will be\nstored with the filename placed before the pipe (filename.exe in our example). The command\ntype 102 is the command line to be executed is stored in the data field.\n\n### Links between DNSpionage and Karkoff\n\nWe identified infrastructure overlaps in the DNSpionage and the Karkoff cases. One of the\nKarkoff C2 servers is rimrun[.]com. Here is the history of the IPs behind this domain:\n\n108.62.141[.]247 -> from 12/19/18 to 4/13/19\n209.141.38[.]71 -> on 12/26/18\n107.161.23[.]204 -> on 12/26/18\n192.161.187[.]200 -> on 12/26/18\n\nThe following IPs have links to our original DNSpionage blog post:\n\n107.161.23[.]204 was used by 0ffice36o[.]com on 9/21/18\n209.141.38[.]71 was used by hr-wipro[.]com on 9/26/18\n192.161.187[.]200 was used by 0ffice36o[.]com on 9/21/18\n\n\n-----\n\nThese dates also match the timeline of observed attacks during the DNSpionage campaign.\nBased on these overlaps in IP usage during the same time period, we have high confidence\nthe same actor uses the Karkoff and DNSpionage samples.\n\n## Alleged Oilrig leak links\n\nAn alleged Oilrig leak appeared online on April 18. Information from the leak provides a weak\nlink between Oilrig and the DNSpionage actors based on similar URL fields. While not\ndefinitive, it is an interesting data point to share with the research community.\n\nThe leak contains a webmask_dnspionage repository. This repository contains scripts used\nto perform man-in-the-middle attacks, but nothing about the DNSpionage or Karkoff C2\npanels. However, the screenshots showed a URL that attracted our attention:\n\nWe identified the C2 panel as \"Scarecrow,\" but we did not identify references to this panel in\nthe leak. The victims in this screenshot are mainly from Lebanon, which is one of the areas\ntargeted by DNSpionage and Karkoff. The URL provides some other relevant information:\n\n\n-----\n\nThe URL contains the /Th!swasP@NEl directory. After our first publication, LastLine\n[published a blog post explaining that the actor made some mistakes in their Django](https://www.lastline.com/labsblog/threat-actor-cold-river-network-traffic-analysis-and-a-deep-dive-on-agent-drable/)\nconfiguration:\n\nYou can see the content of the PANEL_PATH variable of the DNSpionage C2 server:\n/Th!sIsP@NeL. The panel path of the leak and Django internal variables of the DNSpionage\nC2 server are very similar: /Th!swasP@NEl and /Th!sIsP@NeL. While this single panel path\nis not enough to draw firm conclusions, it is worth highlighting for the security research\ncommunity as we all continue to investigate these events.\n\n## Conclusion\n\nThe threat actor's ongoing development of DNSpionage malware shows that the attacker\ncontinues to find new ways to avoid detection. The oddities we mentioned are certainly not\nnormal, but the payload was clearly updated to attempt to remain more elusive. DNS\ntunneling is a popular method of exfiltration for some actors and recent examples of\nDNSpionage show that we must ensure DNS is monitored as closely as an organization's\nnormal proxy or weblogs. DNS is essentially the phonebook of the internet, and when it is\ntampered with, it becomes difficult for anyone to discern whether what they are seeing online\nis legitimate. The discovery of Karkoff also shows the actor is pivoting and is increasingly\nattempting to avoid detection while remaining very focused on the Middle Eastern region.\nCisco Talos will continue to monitor for activity from this actor and ensure our protection and\ndetection capabilities continue to prevent such advanced attacks on our customers.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors. Below is a screenshot showing how AMP can protect\ncustomers from this threat.\n\n[Cisco Cloud Web Security (CWS) orWeb Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such asNext-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.htm)\n[Intrusion Prevention System (NGIPS), and Meraki MX can detect malicious activity](https://meraki.cisco.com/products/appliances)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\n\n-----\n\nOpen Source SNORTⓇ Subscriber Rule Set customers can stay up to date by downloading\n[the latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## Indicators of Compromise (IOCs)\n\nThe following IOCs are associated to this campaign:\n\n### DNSpionage XLS document\n\n2fa19292f353b4078a9bf398f8837d991e383c99e147727eaa6a03ce0259b3c5 (SHA256)\n\n### DNSpionage sample\n\ne398dac59f604d42362ffe8a2947d4351a652516ebfb25ddf0838dd2c8523be8 (SHA256)\n\n### Karkoff samples\n\n5b102bf4d997688268bab45336cead7cdf188eb0d6355764e53b4f62e1cdf30c\n\n6a251ed6a2c6a0a2be11f2a945ec68c814d27e2b6ef445f4b2c7a779620baa11\n\nb017b9fc2484ce0a5629ff1fed15bca9f62f942eafbb74da6a40f40337187b04\n\ncd4b9d0f2d1c0468750855f0ed352c1ed6d4f512d66e0e44ce308688235295b5\n\n### C2 server\n\ncoldfart[.]com\n\nrimrun[.]com\n\nkuternull[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-23 - DNSpionage brings out the Karkoff.pdf"
    ],
    "report_names": [
        "2019-04-23 - DNSpionage brings out the Karkoff.pdf"
    ],
    "threat_actors": [
        {
            "id": "4632103e-8035-4a83-9ecb-c1e12e21288c",
            "created_at": "2022-10-25T16:07:23.542255Z",
            "updated_at": "2025-03-27T02:02:09.854487Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [],
            "source_name": "ETDA:DNSpionage",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "CACTUSPIPE",
                "DNSpionage",
                "DropperBackdoor",
                "Karkoff",
                "MailDropper",
                "OILYFACE"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "68d50d91-7569-4e09-b155-98b23b23918a",
            "created_at": "2023-01-06T13:46:38.877268Z",
            "updated_at": "2025-03-27T02:00:02.941236Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Nahr Elbard",
                "Nahr el bared"
            ],
            "source_name": "MISPGALAXY:Cold River",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8d76e350-dfb5-4733-800d-876de41f690d",
            "created_at": "2023-01-06T13:46:38.841887Z",
            "updated_at": "2025-03-27T02:00:02.932838Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [
                "COBALT EDGEWATER"
            ],
            "source_name": "MISPGALAXY:DNSpionage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536127,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1653753351,
    "ts_modification_date": 1653753351,
    "files": {
        "pdf": "https://archive.orkl.eu/df3ed87ff31dfb5d6ca7e366bf6f53a6e82dab6a.pdf",
        "text": "https://archive.orkl.eu/df3ed87ff31dfb5d6ca7e366bf6f53a6e82dab6a.txt",
        "img": "https://archive.orkl.eu/df3ed87ff31dfb5d6ca7e366bf6f53a6e82dab6a.jpg"
    }
}