{
    "id": "43d7ab5b-1309-47d5-a657-534d21841b60",
    "created_at": "2023-01-12T15:09:08.476083Z",
    "updated_at": "2025-03-27T02:06:15.060631Z",
    "deleted_at": null,
    "sha1_hash": "1c45e80b6efbf8304f3950c036017345934f33cc",
    "title": "2022-10-14 - New “Prestige” ransomware impacts organizations in Ukraine and Poland",
    "authors": "",
    "file_creation_date": "2022-10-23T13:16:46Z",
    "file_modification_date": "2022-10-23T13:16:46Z",
    "file_size": 1323071,
    "plain_text": "# New “Prestige” ransomware impacts organizations in Ukraine and Poland\n\n**[microsoft.com/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/](https://www.microsoft.com/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/)**\n\nOctober 14, 2022\n\nThe Microsoft Threat Intelligence Center (MSTIC) has identified evidence of a novel ransomware\ncampaign targeting organizations in the transportation and related logistics industries in Ukraine and\nPoland utilizing a previously unidentified ransomware payload. We observed this new ransomware,\nwhich labels itself in its ransom note as “Prestige ranusomeware”, being deployed on October 11 in\nattacks occurring within an hour of each other across all victims.\n\nThis campaign had several notable features that differentiate it from other Microsoft-tracked\nransomware campaigns:\n\nThe enterprise-wide deployment of ransomware is not common in Ukraine, and this activity was\nnot connected to any of the 94 currently active ransomware activity groups that Microsoft tracks\nThe Prestige ransomware had not been observed by Microsoft prior to this deployment\nThe activity shares victimology with recent Russian state-aligned activity, specifically on\naffected geographies and countries, and overlaps with previous victims of the FoxBlade\nmalware (also known as HermeticWiper)\n\n\n-----\n\nDespite using similar deployment techniques, the campaign is distinct from recent destructive attacks\nleveraging AprilAxe (ArguePatch)/CaddyWiper or Foxblade (HermeticWiper) that have impacted\nmultiple critical infrastructure organizations in Ukraine over the last two weeks. MSTIC has not yet\nlinked this ransomware campaign to a known threat group and is continuing investigations. MSTIC is\ntracking this activity as DEV-0960.\n\nMicrosoft uses DEV-#### designations as a temporary name given to an unknown, emerging, or a\ndeveloping cluster of threat activity, allowing MSTIC to track it as a unique set of information until we\nreach a high confidence about the origin or identity of the actor behind the activity. Once it meets the\ncriteria, a DEV is converted to a named actor or merged with existing actors.\n\nThis blog aims to provide awareness and indicators of compromise (IOCs) to Microsoft customers\nand the larger security community. Microsoft continues to monitor this and is in the process of early\nnotification to customers impacted by DEV-0960 but not yet ransomed. MSTIC is also actively\nworking with the broader security community and other strategic partners to share information that\ncan help address this evolving threat through multiple channels.\n\n## Observed actor activity\n\n### Pre-ransomware activities\n\nPrior to deploying ransomware, the DEV-0960 activity included the use of the following two remote\nexecution utilities:\n\nRemoteExec – a commercially available tool for agentless remote code execution\nImpacket WMIexec – an open-source script-based solution for remote code execution\n\nTo gain access to highly privileged credentials, in some of the environments, DEV-0960 used these\ntools for privilege escalation and credential extraction:\n\nwinPEAS – an open-source collection of scripts to perform privilege escalation on Windows\n[comsvcs.dll – used to dump the memory of the LSASS process and steal credentials](https://attack.mitre.org/techniques/T1003/001/)\nntdsutil.exe – used to back up the Active Directory database, likely for later use credentials\n\n### Ransomware deployment\n\nIn all observed deployments, the attacker had already gained access to highly privileged credentials,\nlike Domain Admin, to facilitate the ransomware deployment. Initial access vector has not been\nidentified at this time, but in some instances it’s possible that the attacker might have already had\nexisting access to the highly privileged credentials from a prior compromise. In these instances, the\nattack timeline starts with the attacker already having Domain Admin-level access and staging their\nransomware payload.\n\nMost ransomware operators develop a preferred set of tradecraft for their payload deployment and\nexecution, and this tradecraft tends to be consistent across victims, unless a security configuration\nprevents their preferred method. For this DEV-0960 activity, the methods used to deploy the\nransomware varied across the victim environments, but it does not appear to be due to security\n\n\n-----\n\nconfigurations preventing the attacker from using the same techniques. This is especially notable as\nthe ransomware deployments all occurred within one hour. The distinct methods for ransomware\ndeployment were:\n\n**Method 1: The ransomware payload is copied to the ADMIN$ share of a remote system, and**\nImpacket is used to remotely create a Windows Scheduled Task on target systems to execute\nthe payload\n\n**Method 2: The ransomware payload is copied to the ADMIN$ share of a remote system, and**\nImpacket is used to remotely invoke an encoded PowerShell command on target systems to\nexecute the payload\n\n**Method 3: The ransomware payload is copied to an Active Directory Domain Controller and**\ndeployed to systems using the Default Domain Group Policy Object\n\n\n-----\n\n### Malware analysis\n\nThe “Prestige” ransomware requires administrative privileges to run. Like many ransomware\npayloads, it attempts to stop the MSSQL Windows service to ensure successful encryption using the\nfollowing command (the strings “C:\\Windows\\System32\\net.exe stop” and “MSSQLSERVER” are\nboth hardcoded in the analyzed samples):\n\nPrestige creates C:\\Users\\Public\\README and stores the following ransom note in the file. The same\nfile is also created in the root directory of each drive:\n\nPrestige ransom note\nPrestige then traverses the files on the file system and encrypts the contents of files that have one of\nthe following hardcoded file extensions, avoiding encrypting files in the C:\\Windows\\ and\n_C:\\ProgramData\\Microsoft\\ directories:_\n\n\n-----\n\nAfter encrypting each file, the ransomware appends the extension .enc to the existing extension of\nthe file. For example, changes.txt is encrypted and then renamed to changes.txt.enc. Prestige uses\nthe following two commands to register a custom file extension handler for files with .enc file\nextension:\n\nCustom file extension handler for files with .enc extension\nAs a result of creating the custom file extension handler, when any file carrying the file extension .enc\n(i.e., encrypted by Prestige) is opened by a user, the file extension handler uses Notepad to open\n_C:\\Users\\Public\\README, which contains the ransom note._\n\nTo encrypt files, Prestige leverages the CryptoPP C++ library to AES-encrypt each eligible file. During\nthe encryption process, the following hardcoded RSA X509 public key is used by one version of the\nransomware (each version of Prestige may carry a unique public key):\n\n\n-----\n\nTo hinder system and file recovery, Prestige runs the following command to delete the backup catalog\nfrom the system:\n\nPrestige also runs the following command to delete all volume shadow copies on the system:\n\nBefore running the commands above, the 32-bit version of Prestige calls the function\n[Wow64DisableWow64FsRedirection() to disable file system redirection and gain access to the native](https://learn.microsoft.com/windows/win32/api/wow64apiset/nf-wow64apiset-wow64disablewow64fsredirection)\nSystem32 directory. After running the commands above, Prestige restores file system redirection by\n[calling the function Wow64RevertWow64FsRedirection().](https://learn.microsoft.com/windows/win32/api/wow64apiset/nf-wow64apiset-wow64revertwow64fsredirection)\n\nMicrosoft will continue to monitor DEV-0960 activity and implement protections for our customers.\nThe current detections, advanced detections, and IOCs in place across our security products are\ndetailed below.\n\n## Looking forward\n\nThe threat landscape in Ukraine continues to evolve, and wipers and destructive attacks have been a\nconsistent theme. Ransomware and wiper attacks rely on many of the same security weaknesses to\nsucceed. As the situation evolves, organizations can adopt the hardening guidance below to help\nbuild more robust defenses against these threats.\n\n## Recommended customer actions\n\nThe ransomware payload was deployed by the actor after an initial compromise that involved gaining\naccess to highly privileged credentials. The techniques used by the actor and described in the\n“Observed Actor Activity” section can be mitigated by adopting the security considerations provided\nbelow:\n\n[Block process creations originating from PSExec and WMI commands to stop lateral movement](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference#block-process-creations-originating-from-psexec-and-wmi-commands)\nutilizing the WMIexec component of Impacket.\n[Enable Tamper protection to prevent attacks from stopping or interfering with Microsoft](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection)\nDefender.\nTurn on [cloud-delivered protection in Microsoft Defender Antivirus or the equivalent for your](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus)\nantivirus product to cover rapidly evolving attacker tools and techniques. Cloud-based machine\nlearning protections block a huge majority of new and unknown variants.\nWhile this attack differs from traditional ransomware, following our defending against\nransomware guidance helps protect against the credential theft, lateral movement, and\nransomware deployment used by DEV-0960.\nUse the included indicators of compromise to investigate whether they exist in your environment\nand assess for potential intrusion.\n[Enable multifactor authentication (MFA) to mitigate potentially compromised credentials and](https://learn.microsoft.com/microsoft-365/admin/security-and-compliance/set-up-multi-factor-authentication)\nensure that MFA is enforced for all remote connectivity, including VPNs. Microsoft strongly\nencourages all customers download and use password-less solutions like Microsoft\nAuthenticator to secure your accounts\n\n\n-----\n\n## Indicators of compromise (IOCs)\n\nThe following table lists the IOCs observed during our investigation. We encourage our customers to\ninvestigate these indicators in their environments and implement detections and protections to\nidentify past related activity and prevent future attacks against their systems.\n\n**Indicator** **Type** **Description**\n\n\n5dd1ca0d471dee41eb3ea0b6ea117810f228354fc3b7b47400a812573d40d91d SHA256\n\n5fc44c7342b84f50f24758e39c8848b2f0991e8817ef5465844f5f2ff6085a57 SHA256\n\n6cff0bbd62efe99f381e5cc0c4182b0fb7a9a34e4be9ce68ee6b0d0ea3eee39c SHA256\n\na32bbc5df4195de63ea06feb46cd6b55 Import\nhash\n\nC:\\Users\\Public\\README File\npath\n\n**NOTE: These indicators should not be considered exhaustive for this observed activity.**\n\n## Detections\n\n### Microsoft 365 Defender\n\n**Microsoft Defender Antivirus**\n\n\nPrestige\nransomware\npayload\n\nPrestige\nransomware\npayload\n\nPrestige\nransomware\npayload\n\nUnique PE\nImport Hash\nshared by\nransomware\npayloads\n\nFile path of\nthe ransom\nnote\n\n\nMicrosoft Defender Antivirus detects known Prestige ransomware payloads with the following\ndetection:\n\n[Ransom:Win32/Prestige](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Win32/Prestige.B&threatId=-2147133973)\n\n**Microsoft Defender for Endpoint**\n\nMicrosoft Defender for Endpoint provides alerts for the indicators used by DEV-0960 discussed\nabove.\n\nRansomware-linked emerging threat activity group DEV-0960 detected\n\nMicrosoft Defender for Endpoint also provides alerts for the pre-ransom techniques discussed above.\n\n\n-----\n\nCustomers should act on these alerts as they indicate hands-on-keyboard attacks. NOTE: These\nalerts are not uniquely tied to the Prestige ransomware nor to the campaign discussed.\n\nOngoing hands-on-keyboard attack via Impacket toolkit\nWinPEAS tool detected\nSensitive credential memory read\nPassword hashes dumped from LSASS memory\nSuspicious scheduled task activity\nSystem recovery setting tampering\nFile backups were deleted\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\n**Prestige ransomware file hashes**\n\nThis query looks for file hashes and Microsoft Defender Antivirus detections associated with Prestige\nransomware payload.\n\nhttps://github.com/Azure/AzureSentinel/tree/master/Detections/MultipleDataSources/PrestigeRansomwareIOCsOct22.yaml\n\n### Microsoft 365 Defender\n\n**Impacket WMIexec usage**\n\nThis query surfaces Impacket WMIexec usage on a device:\n```\nDeviceProcessEvents\n| where Timestamp >= ago(7d)\n| where FileName =~ \"cmd.exe\"\n| where ProcessCommandLine has_all (@\" 1> \\127.0.0.1\\\", \"/Q \", \"/c \", @\" 2>&1\")\n| where InitiatingProcessFileName =~ \"WmiPrvSE.exe\"\n\n```\nThis query has the same purpose as above, but it also groups all the commands launched using\nImpacket WMIexec on the device:\n```\nDeviceProcessEvents\n\n| where Timestamp >= ago(7d)\n\n| where FileName =~ \"cmd.exe\"\n\n| where ProcessCommandLine has_all (@\" 1> \\127.0.0.1\\\", \"/Q \", \"/c \", @\" 2>&1\")\n\n| where InitiatingProcessFileName =~ \"WmiPrvSE.exe\"\n\n| project DeviceName, DeviceId, Timestamp, ProcessCommandLine\n\n| summarize make_set(ProcessCommandLine), min(Timestamp), max(Timestamp) by DeviceId,\nDeviceName\n\n```\n**LSASS process memory dumping**\n\nThis query surfaces attempts to dump the LSASS process memory comsvcs.dll:\n\n\n-----\n\n```\nlet startTime ago(7d);\nlet endTime = now();\nDeviceProcessEvents\n| where Timestamp between (startTime..endTime)\n| where FileName =~ 'rundll32.exe'\nand ProcessCommandLine has 'comsvcs.dll'\nand ProcessCommandLine has_any ('full','MiniDump')\n| where not (ProcessCommandLine matches regex @'{[\\w\\d]{8}-[\\w\\d]{4}-[\\w\\d]{4}-[\\w\\d]{4}[\\w\\d]{12}}'\nand ProcessCommandLine matches regex @'(\\d{2}_){3}' )\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-14 - New “Prestige” ransomware impacts organizations in Ukraine and Poland.pdf"
    ],
    "report_names": [
        "2022-10-14 - New “Prestige” ransomware impacts organizations in Ukraine and Poland.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536148,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1666531006,
    "ts_modification_date": 1666531006,
    "files": {
        "pdf": "https://archive.orkl.eu/1c45e80b6efbf8304f3950c036017345934f33cc.pdf",
        "text": "https://archive.orkl.eu/1c45e80b6efbf8304f3950c036017345934f33cc.txt",
        "img": "https://archive.orkl.eu/1c45e80b6efbf8304f3950c036017345934f33cc.jpg"
    }
}