{
    "id": "43e49de9-f274-4fe4-b5a7-3fe56efa412f",
    "created_at": "2023-01-12T15:03:54.200286Z",
    "updated_at": "2025-03-27T02:05:48.633069Z",
    "deleted_at": null,
    "sha1_hash": "6c1459f761a3e2dcc8a7718b3eb82c639b676cc6",
    "title": "2021-06-11 - Cybercrime Featured Avaddon ransomware operation shuts down and releases decryption keys",
    "authors": "",
    "file_creation_date": "2022-05-27T22:43:10Z",
    "file_modification_date": "2022-05-27T22:43:10Z",
    "file_size": 866719,
    "plain_text": "# Avaddon ransomware operation shuts down and releases decryption keys\n\n**[therecord.media/avaddon-ransomware-operation-shuts-down-and-releases-decryption-keys/](https://therecord.media/avaddon-ransomware-operation-shuts-down-and-releases-decryption-keys/)**\n\nJune 11, 2021\n\n**The criminal group behind the Avaddon ransomware has shut down its operation**\n**today and released decryption keys for past victims.**\n\nThe keys were made available earlier today via a private message sent to Bleeping\nComputer, a ransomware support forum and news site that has been covering the\nransomware scene since 2016.\n\nThe keys have now been shared with Emsisoft, a security firm that has previously released\ntens of free decryption utilities for all kinds of ransomware strains.\n\nThe company expects to release a free decryptor over the weekend, Emsisoft security\nresearcher Michael Gillespie has told The Record in an interview. [Update: Decryptor now\n_[live here.]](https://www.emsisoft.com/ransomware-decryption-tools/avaddon)_\n\nThe decryptor will take the 2,934 decryption keys and allow past Avaddon victims to decrypt\ntheir files for free if they still have the encrypted files around and have not deleted the data.\n\n\n-----\n\nPSA: Avaddon appears to have shut down and released 2934 private keys of victims.\nA public Emsisoft decryption tool is coming soon. Do not pay. If you are a victim and\n[want to know if your files can be decrypted, please reach out to [email protected]](https://therecord.media/cdn-cgi/l/email-protection)\nThanks.\n\n— Fabian Wosar (@fwosar) [June 11, 2021](https://twitter.com/fwosar/status/1403386634108813317?ref_src=twsrc%5Etfw)\n\n## Avaddon was slowly becoming a top-tier threat\n\nThe Avaddon shutdown today came out of the blue and has surprised the security research\ncommunity.\n\nAfter the [disappearance of the Darkside ransomware gang in the aftermath of the Colonial](https://therecord.media/darkside-ransomware-gang-says-it-lost-control-of-its-servers-money-a-day-after-biden-threat/)\nPipeline attack, the Avaddon gang had moved very aggressively to fill the gap left on the\nmarket, Allan Liska, a Recorded Future security analyst who tracks ransomware operations,\ntold The Record.\n\n“Avaddon was tied with Conti for most number of ransomware extortions published since the\nColonial Pipeline attack,” Liska told us. “Fifty-nine victims published since May 7th ), 182 in\ntotal since launching in August 2020.”\n\n\n-----\n\nImage: Recorded Future\nFurthermore, the group had also been extremely active even before the Colonial Pipeline\nattack.\n\nTens of victims reported intrusions and submitting Avaddon-encrypted files and ransom\nnotes to the ID-Ransomware service on an almost weekly basis this year.\n\nAvaddon’s recent sudden spike in attacks also led the US Federal Bureau of Investigation\n[and the Australian Cyber Security Centre to issue alerts at the start of May about their ever-](https://therecord.media/wave-of-avaddon-ransomware-attacks-triggers-acsc-fbi-warning/)\ngrowing number of intrusions.\n\n\n-----\n\n## Actual shutdown or just rebranding?\n\nHowever, earlier today, the gang shut down its servers, its dark web leak site, wiped profiles\non hacking forums, and then sent the decryption keys to Bleeping Computer.\n\nAvaddon ransomware leak site\nUnlike other ransomware gangs who shut down operations through pompous messages\nposted online, the Avaddon gang appears to have disappeared from the face of the earth.\n\nMessages to a now-wiped hacking forum account were not returned. All posts made from\nthat account have also been deleted.\n\nA theory gaining ground in the infosec community suggests that the group may be entering a\nrebranding phase, something that many other gangs have done before, such as Nemty-toNefilim and Gandcrab-to-REvil.\n\nShortly after the Colonial Pipeline attack, the Avaddon gang also announced plans to go\nprivate and work only with a selected number of affiliates for their intrusions.\n\nRebranding and going private would be a good way for the Avaddon gang to lose the law\nenforcement agencies and security firms currently tracking its every moves.\n\n[@ddd1ms &](https://twitter.com/ddd1ms?ref_src=twsrc%5Etfw) [@campuscodi Some change is happening…. @Raj_Samani](https://twitter.com/campuscodi?ref_src=twsrc%5Etfw)\n[@ChristiaanBeek](https://twitter.com/ChristiaanBeek?ref_src=twsrc%5Etfw) [@McAfee_Labs](https://twitter.com/McAfee_Labs?ref_src=twsrc%5Etfw) [pic.twitter.com/SIgNW3V2Df](https://t.co/SIgNW3V2Df)\n\n[— John Fokker (@John_Fokker) May 14, 2021](https://twitter.com/John_Fokker/status/1393225076846301186?ref_src=twsrc%5Etfw)\n\nPrior to shutting down, the Avaddon gang was also notorious for running one of the most\nprofessional and responsive Ransomware-as-a-Service (RaaS) operations.\n\n\n-----\n\nThe group advertised through hacking forums such as Exploit and XSS, was responsive to\ncustomer demands, and ran an automated leak portal as a double-extortion scheme for\nvictims who refused to pay.\n\nIn addition, the Avaddon gang also built one of the easier to use RaaS portals (see image\nbelow, courtesy of the Recorded Future Insikt Group), and when a bug was found in its code\nthat [allowed for free decryptions, they fixed it within a day.](https://www.zdnet.com/article/free-decrypter-released-for-avaddon-ransomware-victims-aaand-its-gone/)\n\nAvaddon RaaS backend panel\nTags\n\n[Avaddon](https://therecord.media/tag/avaddon/)\n[cybercrime](https://therecord.media/tag/cybercrime/)\n[RaaS](https://therecord.media/tag/raas/)\n[Ransomware](https://therecord.media/tag/ransomware/)\n[shutdown](https://therecord.media/tag/shutdown/)\n\nCatalin Cimpanu is a cybersecurity reporter for The Record. He previously worked at ZDNet\nand Bleeping Computer, where he became a well-known name in the industry for his\nconstant scoops on new vulnerabilities, cyberattacks, and law enforcement actions against\nhackers.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-11 - Cybercrime Featured Avaddon ransomware operation shuts down and releases decryption keys.pdf"
    ],
    "report_names": [
        "2021-06-11 - Cybercrime Featured Avaddon ransomware operation shuts down and releases decryption keys.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535834,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653691390,
    "ts_modification_date": 1653691390,
    "files": {
        "pdf": "https://archive.orkl.eu/6c1459f761a3e2dcc8a7718b3eb82c639b676cc6.pdf",
        "text": "https://archive.orkl.eu/6c1459f761a3e2dcc8a7718b3eb82c639b676cc6.txt",
        "img": "https://archive.orkl.eu/6c1459f761a3e2dcc8a7718b3eb82c639b676cc6.jpg"
    }
}