{
    "id": "44238d82-bd65-4842-add5-669d4ab423de",
    "created_at": "2023-01-12T15:06:28.744739Z",
    "updated_at": "2025-03-27T02:05:30.377267Z",
    "deleted_at": null,
    "sha1_hash": "5a63af609fe17dd293dde1520e4c3a13d818ea29",
    "title": "2021-11-17 - Creating your first Microsoft Sentinel Notebook",
    "authors": "",
    "file_creation_date": "2022-05-27T21:59:23Z",
    "file_modification_date": "2022-05-27T21:59:23Z",
    "file_size": 2867638,
    "plain_text": "# Creating your first Microsoft Sentinel Notebook\n\n**[techcommunity.microsoft.com/t5/microsoft-sentinel-blog/creating-your-first-microsoft-sentinel-notebook/ba-p/2977745](https://techcommunity.microsoft.com/t5/microsoft-sentinel-blog/creating-your-first-microsoft-sentinel-notebook/ba-p/2977745#.YZXCGrsENGQ.twitter)**\n\nNovember 18, 2021\n\n_This installment is part of a broader learning series to help you become a Jupyter Notebook_\n_ninja in Microsoft Sentinel. The installments will be bite-sized to enable you to easily digest_\n_the new content._\n\n**Part 1:** [What are notebooks and when do you need them?](https://cda.ms/2wn)\n**Part 2:** [How to get started with notebooks and tour the features](https://cda.ms/3dj)\n**Part 3:** [Overview of the pre-built notebooks and how to use them](https://cda.ms/2HG)\n**Part 3.5:** [Using Code Snippets to build your own Sentinel Notebooks](https://cda.ms/3b0)\n**Part 4: How to create your own notebooks from scratch and how to customize the**\nexisting ones - this post\n\n**KNOWLEDGE CHECK: And, once you've completed all of the parts of this series, you can**\ntake the [Knowledge Check. If you score 80% or more in the](https://cda.ms/3sQ) [Knowledge Check, you can](https://cda.ms/3sQ)\nexpect your very own Notebooks Ninja participation certificate from us.\n\nJupyter Notebooks are a fantastic resource for security analysts, providing a range of\npowerful and flexible capabilities. Microsoft Sentinel’s integration\nwith Notebooks can provide a quick and straightforward way for security analysts to\nuse Notebooks, however for those new to Notebooks and coding they can be a little\ndaunting.\n\nIn this blog we will cover some of the basics of creating your first Microsoft\nSentinel Notebook using Python, including how to troubleshoot some common issues you\nmay come across.\n\nInstalling and importing packages in Python\nInstalling and importing MSTICPy\nSetting up MSTICPy’s config file\nGetting data from Microsoft Sentinel\nWorking with data\n\n\n-----\n\nEnriching results with external data sources\nVisualizations with MSTICPy\n\nBefore we begin, make sure to familiarize yourself with Notebooks in Microsoft Sentinel via\nAzure Machine Learning.\n\n[Use Jupyter Notebooks to hunt for security threats](https://docs.microsoft.com/en-us/azure/sentinel/notebooks)\n\nIf you wish to learn more about this topic, we are running introductory training on December\n16th, 2021: Become a Jupyter Notebooks Ninja – MSTICPy Fundamentals to Build Your\nOwn Notebooks. [Sign Up Here](https://forms.office.com/pages/responsepage.aspx?id=v4j5cvGGr0GRqy180BHbR2HneBfpDd1Mj3-yGKE5Q-xUNkVRQkNPTlFXSzVFRzZFSURFWkRKM0hWUi4u)\n\n## Installing and Importing Packages in Python\n\nOne of the important things about using Python in Notebooks is that you can install and use\ncode libraries (referred to as packages) created by others, allowing you to access the\nfunctionality they provide without having to code them yourself.\n\nThere are several ways to install Python packages depending on how you want to find\nand access the packages, however the simplest and easiest is using pip.\n[Pip (https://pypi.org/project/pip/) is the package installer for Python and makes finding and](https://pypi.org/project/pip/)\ninstalling Python packages simple.\n\nYou can use pip to install packages via the command line, or if you are using a Notebook,\ndirectly in a Notebook cell. Installing directly in a Notebook is often preferred as it ensures\nthat you are installing the package in the same Python environment the Notebook is being\nexecuted in. To install via a Notebook code cell, we need to use `%pip` followed by install\nand the package name. e.g.:\n```\n%pip install requests\n\n```\nNotebook output of running %pip install requests\n\n**Note: `%pip` is what is called a magic function in Jupyter. This tells the Notebook to use pip**\nto install the package in the Notebooks compute environment.\n\nIf you already have a package installed but you want to update to the latest version, you can\nadd the `--upgrade` parameter to the command used:\n\n\n-----\n\n```\n%pip install upgrade requests\n\n```\nYou may also want to install a specific version of a package. This can be done by specifying\nthe version number.\n```\n%pip install requests==2.22.0\n\n```\nOutput of running %pip install requests==2.22.0\n\n**Note: Once you have installed a package it is recommended to restart the Notebook kernel,**\nthis will ensure that when you import the package you will be using the latest version. This is\nnot necessary with newly installed packages but is important when\n\n**Note: During installation of packages you may see some warnings related to package**\ndependencies. This is because some packages have requirements on other packages being\ninstalled and sometimes these requirements can have conflicts (i.e., package 1 requires\npackage A version 1.1 but package 2 also requires package A but version 1.2). We try to\navoid conflicts as much as possible with our Notebooks but sometimes these can occur. You\ncan usually run the Notebook without the conflicts affecting you. However, if you encounter a\n[problem with a pre-made Microsoft Sentinel Notebook, please report this at via GitHub.](https://github.com/Azure/Azure-Sentinel-Notebooks/issues)\n\nOnce a package is installed, you need to import the package before it can be used. This is\ndone with the `import` statement.\n\nThere are 2 ways to import things in Python:\n\n- `import <package>` - this will do a standard import of the package\n\n- `from <package> import <item>` - this imports a specific item from the package\n\nYou can also import packages and rename them for ease when calling them later:\n\n`import <package> as <alias>`\n```\nimport pandas as pd\n\n```\n**Troubleshooting Tip: Some packages do not use the same name for installation and**\nimport. You many need to check package documentation to ensure you are importing\ncorrectly.\n\n\n-----\n\nFor example, the popular Machine Learning tool package scikit-learn is installed with:\n```\n%pip install scikit-learn\n\n```\nHowever, it is imported with:\n```\nimport sklearn\n\n## Installing and Importing MSTICPy\n\n```\nNow that we know how to install and import packages, we can install packages that will be\nuseful to us in creating our Notebook. MSTICPy is a package created by the Microsoft Threat\nIntelligence Center (MSTIC) and provides a range of tools to make security analysis and\ninvestigations in Notebooks quicker and easier. You cand find out more\nabout MSTICPy here:\n\n[ReadTheDocs - MSTICPy](https://msticpy.readthedocs.io/en/latest/GettingStarted.html)\n\nWe can now install MSTICPy. To make sure we get the latest version if we already have\nit installed, we are going to use the –upgrade parameter.\n```\n%pip install --upgrade msticpy\n\n```\nNow we could import MSTICPy with `import msticpy` however it is a big package with a lot of\nfeatures, so to make it easier we have a function called `init_notebook` that\nconducts several checks to make sure the environment is good, handles key imports and set\nup for us.\n```\nimport msticpy\nmsticpy.init_notebook(globals())\n\n```\n\n-----\n\nNotebook output of running previous code cell.\n\n## Setting up MSTICPy’s Config File\n\nMSTICPy can handle connections to a variety of data sources and services, including\nMicrosoft Sentinel. As such it needs to handle several configuration details and credentials,\nthings such as the Microsoft Sentinel workspaces you want to get data from, or API\n(Application Programming Interfaces) keys for external services such as Virus Total.\n\nTo make it easier to manage and re-use the configuration and credentials for these\nthings MSTICPy has its own config file that holds these items - `msticpyconfig.yaml`.\n\nThe first time you use MSTICPy you need to populate your msticpyconfig.yaml file. This is\na one-time activity once you have created it, you can simply re-use in future. To help with\nthe set-up we have created several Notebook widgets to help you populate the file.\n\n\n-----\n\n**Note: If using Azure Machine Learning then you may notice this config widget can take some**\ntime to load. We are working to improve this but if you run the notebook in Jupyter,\nJupyterLab or VSCode you will not have these performance issues.\n\nWe have also created a Notebook to help you create to file. Once you have run the ‘Getting\nStarted’ Notebook it is recommended that you run the ‘Configuring your Notebook\nEnvironment’ Notebook before creating your first Notebook, you can find this in the Microsoft\nSentinel portal.\n\n\n-----\n\nMicrosoft Sentinel Notebook feature blade highlighting the Configuring you Notebook\nEnvironment Notebook\n\nYou can also find more documentation on the config file and creation of it, in\nthe [MSTICPy docs](https://msticpy.readthedocs.io/en/latest/getting_started/SettingsEditor.html)\n\n## Getting Data from Microsoft Sentinel \n\nQuerying data from Microsoft Sentinel is handled by MSTICPy's `QueryProvider`. The first\nstep is to initialize a QueryProvider and tell it we want to use the Microsoft Sentinel Query\nprovider.\n\n**Note: MSTICPy contains several QueryProviders for other data sources as well.**\n\nThe other thing we want to provide the QueryProvider with is some details of the workspace\nwe want to connect to. We *could* do this manually, but it is much easier to get details from\nthe configuration we set up earlier. We can do this with `WorkspaceConfig`\n```\nfrom msticpy.nbtools import nbinit\nnbinit.init_Notebook(namespace=globals())\nqry_prov=QueryProvider(\"MicrosoftSentinel\")\nws_config = WorkspaceConfig(workspace=\"MyWorkspace\")\n\n```\n\n-----\n\nWhat WorkspaceConfig is doing is creating the connection string used by the QueryProvider.\nWe can see what that connection string looks like with:\n```\nws_config.code_connect_str\n\n```\nNotebook output showing the connection string generated by code_connect_str\n\nOnce set up we can tell the `QueryProvider` to `connect` which will kick off the authentication\nprocess. There are several ways that we can handle that authentication but when starting off\nwe can use the default options that prompts the user to log in using a [Device Code.](https://docs.microsoft.com/en-us/azure/active-directory/develop/msal-authentication-flows#device-code)\n```\nqry_prov.connect(ws_config)\n\n```\nThis will then display a code in the Notebook cell output and prompt you to open a browser\nand end the code shown. You will then login as normal using your Azure AD (Azure Active\nDirectory) credentials.\n\nScreenshots of the Device Code authentication flow\n\nYou can then go back to the Notebook and see that the authentication has been completed:\n\nNotebook output showing the completed authentication flow\n\n\n-----\n\n### Built-in Queries\n\nNow that we are connected to Microsoft Sentinel, we can start to look at running some\nqueries to get some data. MSTICPy comes with several built-in Microsoft Sentinel queries to\nget some common datasets into the Notebook. These are different to the queries included in\nthe Microsoft Sentinel GitHub and are more focused on collecting common sets of data that\nusers might need to answer analytical questions.\n\nYou can see a list of the MSTICPy queries with `.list_queries.`\n\nNotebook output of the list_queries command\n\n**Note: MSTICPy also includes queries for its other Data Providers, and not just Microsoft**\nSentinel.\n\nYou can also use `.browse_queries()` to see the available queries in an interactive browser\nwidget.\n\n\n-----\n\nNotebook output of browse_queries\n\n### Running a query\n\nNow that we have found a query that we want to run we simply pass its name to the\n[`QueryProvider` and that in turn returns to results of the query in a Pandas Data](https://pandas.pydata.org/)\nFrame. Most queries support additional parameters, but we are showing one here that does\nnot need any parameters.\n\n**Note: the queries are attached to the QueryProvider as methods (functions) and grouped**\ninto categories based on the data source being queried. You can use tab completion or\nIntelliSense to help you navigate to the query you need.\n```\nqry_prov.Azure.list_all_signins_geo()\n\n```\n\n-----\n\nOutput of the list_all_signins_geo query\n\n**Troubleshooting tip: If a query does not execute at first make sure you have run**\n`qry_prov.connect()` to authenticate to Microsoft Sentinel first. Notebook cells do not have to\nbe run in order so you can go back and run any that you missed. However, many notebooks\ndo have cells that rely on previous cells being executed first so be careful about jumping\nahead if you have not created the notebook yourself.\n\n**Troubleshooting tip: If a query is not returning the results you expect, pass ‘print’ along as**\na parameter when calling the query to print out the KQL query being executed.\n\nMore typically the query function will expect parameters such as the host name\nor IP address that you are searching for.\n```\nqry_prov.LinuxSyslog.user_logon(host_name=\"mylxhost\")\n\n```\nIf you try to run a query without supplying the required parameter, it will return an error\nmessage including the help for the query with the parameter definitions.\n\nMost queries also require date/time parameters for the beginning/ending bounds of the\nquery. By default, these are supplied by a time range set in the query provider. Each instance\nof a query provider has its own time range. You can change the default query range by\nrunning the following.\n```\nqry_prov.query_time\n\n```\nThis brings up a widget letting you change the defaults for this query provider. You can also\nsupply \"start” and “end” parameters to the query function – either as Python datetimes or as\ntime strings:\n```\nfrom datetime import datetime\nqry_prov.LinuxSyslog.user_logon(\n  host_name=\"mylxhost\",\n  start=\"2021-11-19 20:30\",\n  end=datetime.utcnow()\n)\n\n```\n\n-----\n\n## Customizing Your Queries\n\nIn addition to the stock query, we can customize certain elements of the query.\n\nFor example, if we want to append a line with `| take 10` to the query we have selected to\nlimit the number of results returned we can pass that in with the\n`add_query_items` parameter:\n```\nqry_prov.SecurityAlert.list_alerts(add_query_items=\"| take 10\")\n\n```\nThe output of the list_alerts query\n\n**Tip: You can also use KQLMagic to query Sentinel data using KQL queries within notebooks.**\n[KQLMagic also returns data in a Pandas Data Frame.](https://github.com/Microsoft/jupyter-Kqlmagic)\n\n## Working With Data\n\nData returned by the `QueryProvider` comes back in a Pandas Data Frame. This provides us\nwith a powerful and flexible way to access our data.\n\nOne of the core things we want to do is look at specific rows in our table. Each table has an\nindex that can be used to call a row using `.loc`, alternatively we can return a row by its\nposition in the table with `.iloc`\n```\nalert_df.loc[1]\n\n```\n\n-----\n\nSelecting a row with iloc\n\nWe can also choose just to return specific columns by providing a list of them to the Data\nFrame (note the \"[:5]” means return the last 5 rows):\n```\nalert_df.iloc[:5][[\"AlertName\", \"AlertSeverity\", \"Description\"]]\n\n```\nFiltering columns of a DataFrame\n\nWe can also do things such as search for rows with specific data:\n```\nalert_df[alert_df[\"AlertName\"].str.contains(\"credential theft\")]\n\n```\n\n-----\n\nSearching for rows of a DataFrame matching a criteria\n\n**Tip: Pandas has loads and loads of features to help you find, analyze, transform, and**\nvisualize data. As Pandas data structures are key to Microsoft Sentinel Notebooks, we\nrecommended you spend some time getting familiar with some of their features they offer [https://pandas.pydata.org/](https://pandas.pydata.org/)\n\n## Enriching data using external data sources\n\nOne of the powerful elements of Notebooks is combining data from Microsoft Sentinel with\ndata from other sources. One of the most common sources of this data in security is Threat\nIntelligence (TI) data. MSTICPy has support for several Threat Intelligence data sources\nincluding:\n\nVirtusTotal\nGreyNoise\nAlienVault OTX\nIBM XForce\nMicrosoft Sentinel TI data\n\nOPR (for PageRank details)\nToR ExitNode information.\n\n[The first step in using these TI sources is to create a `TILookup` object. This can then be](https://msticpy.readthedocs.io/en/latest/data_acquisition/TIProviders.html)\nused to perform lookups against the various supported providers.\n\nLookups can be done against individual items via `.lookup_ioc` or against multiple items with\n`.lookup_iocs` and you can configure things such as which Threat Intelligence sources are\nused.\n```\nti = TILookup()\nti.lookup_iocs(signin_df, obs_col=\"IPAddress\", providers=[\"GreyNoise\"])\n\n```\n\n-----\n\nLookup_iocs results\n\nTo make viewing results easier there is a widget to allow you to interactively browse results:\n```\nti.browse_results(ti_df)\n\n```\n\n-----\n\nTI results browser widget\n\n### Azure API Access\n\nMSTICPy also has integration with a range of Azure APIs that can be used to retrieve\nadditional information or perform actions such as get Microsoft Sentinel incidents.\n```\nfrom msticpy.data.azure_sentinel import AzureSentinel\nazs = AzureSentinel()\nazs.connect()\nazs.get_incident(incident_id = \"7c768f11-31f1-46ca-8a5c25df2e6b7021\", sub_id = \"8df49d90-99eb-4c31-985d64b3f33caa93\", res_grp= \"sent\", ws_name=\"workspace\")\n\n```\n\n-----\n\nOutput of Azure APIs\n\nYou can find out more about MSTICPy’s support for Azure APIs in the\ndocumentation: [https://msticpy.readthedocs.io/en/latest/data_acquisition/AzureData.html &](https://msticpy.readthedocs.io/en/latest/data_acquisition/AzureData.html) ht\ntps://msticpy.readthedocs.io/en/latest/data_acquisition/AzureSentinel.html\n\n## Visualizations with MSTICPy \n\nThe ability to create complex, interactive visualizations is one of the key benefits\nof Notebooks, allowing analysts to see data in a unique way and use it to identify patterns\nof anomalies that may not otherwise be possible to identify.\n\nCreating these visualizations from scratch can be quite a complex task and involve a lot of\ncode if starting from nothing. To make the process\neasier MSTICPy contains several common visualizations work out the box with common data\nsources from Microsoft Sentinel, and that can quickly and easily be called with minimal\ncode.\n\n### Timelines\n\nUnderstanding when events occurred and in what order is a key component of many security\ninvestigations. MSTICPy can plot diverse types of timelines with several types of data.\n```\nuser_df = qry_prov.Azure.list_aad_signins_for_account(account_name=\"pdemo@seccxpninja.o\ntimeline.display_timeline(user_df, source_columns=[\"UserPrincipalName\", \"ResultType\"]\n\n```\n\n-----\n\nTimeline visualization\n\n**Troubleshooting Tip: If you are defining columns from a DataFrame as a parameter in**\nanother function (as we do above with source_columns) you can sometimes run into issues if\nyou specify a column that does not exist. If you want to see what columns a DataFrame has\nyou can call `DataFrame.columns` to get a list of all the columns.\n\nWe can also plot time lines showing events with a duration rather than a single time stamp\nwith ` display_timeline_duration`:\n```\ntimeline_duration.display_timeline_duration(alert_df, group_by=\"AlertName\", time_column\n\n```\n\n-----\n\nTimeline duration visualization\n\n**Tip: You can also call the timeline visualization directly from a DataFrame with ‘mp_plot’**\n```\nalert_df.mp_plot.timeline(group_by=\"Severity\", source_columns=\n[\"AlertName\", \"TimeGenerated\"])\n\n```\nGrouped timeline visualization\n\n### Matrix Plots\n\n\n-----\n\nThe Matrix Plot graph in MSTICPy allows you to plot the interactions between two elements\nin your data. This can be useful for seeing the relationships between points in a dataset, for\nexample if you wanted to see how often certain IP addresses are communicating with each\nother in a network you can create a matrix plot with a source IP address on one axis, and a\ndestination IP address on the other axis.\n\nAs with the timeline plots, the matrix plot can be created directly from a DataFrame using\n`mp_plot`:\n```\nnetwork_data.mp_plot.matrix(x=\"SourceIP\", y=\"DestinationIP\", title=\"IP Interaction\")\n\n```\nMatrix visualization\n\n### Widgets\n\nWe have seen a couple of widgets already in the query and threat intelligence result\nbrowsers. These widgets make Notebooks much more accessible by providing a visual way\nto interact and customize them without having to write any code. MSTICPy includes a\n\n\n-----\n\nnumber visual, interactive widgets to allow users to select various parameters to customize\nthe Notebook.\n```\nnetwork_vendor_data_q = \"CommonSecurityLog | summarize by DeviceVendor\"\nnetwork_vendor_data = qry_prov.exec_query(network_vendor_data_q)\nnetwork_selector = nbwidgets.SelectItem(\n  item_list=network_vendor_data[\"DeviceVendor\"].to_list(),\n  description='Select a vendor',\n  action=print,\n  auto_display=True\n);\n\n```\nUsing the SelectItem widget to select a network vendor from data\n```\nq_times = nbwidgets.QueryTime(units='day', max_before=20, before=5, max_after=1)\nq_times.display()\n\n```\nTime range selection widget\n\n\n-----\n\n```\nsecurity_alerts qry_prov.SecurityAlert.list_alerts(add_query_items | take 10 )\nalert_select = nbwidgets.SelectAlert(alerts=security_alerts, action=nbdisplay.display_al\ndisplay(Markdown('### Alert selector with action=DisplayAlert'))\ndisplay(HTML(\"<b> Alert selector with action=DisplayAlert </b>\"))\nalert_select.display()\n\n```\nAlert selector widget\n\n## What to do Next\n\nWhat you have seen here is just a tiny taster of what Microsoft Sentinel Notebooks can do.\nHowever, luckily, we have a lot of additional resources to help you learn what you need and\nget started with Notebooks.\n\nWe recommend that you do the following:\n\nSign up for the webinar below where we will cover the topics in this blog in an\ninteractive manner, where you can see the code being executed and learn some extra\nhints and tips about running Notebooks.\n\n\n-----\n\nDecember 16th 2021 - Become a Jupyter Notebooks Ninja – MSTICPy Fundamentals\n[to Build Your Own Notebooks - Sign Up Here](https://forms.office.com/pages/responsepage.aspx?id=v4j5cvGGr0GRqy180BHbR2HneBfpDd1Mj3-yGKE5Q-xUNkVRQkNPTlFXSzVFRzZFSURFWkRKM0hWUi4u)\nRun the Getting Started Notebook in Microsoft Sentinel\n\nThis will help you get your config set up\nThis [Documentation will help you in running this notebook](https://docs.microsoft.com/en-us/azure/sentinel/notebook-get-started)\n[There is also an online tutorials](https://www.youtube.com/watch?v=SaEQJfoe8Io)\nTry the interactive MSTICPy Lab – [https://aka.ms/msticpy-demo](https://aka.ms/msticpy-demo)\nGo and read the MSTICPy docs –\n[https://msticpy.readthedocs.io/en/latest/GettingStarted.html](https://msticpy.readthedocs.io/en/latest/GettingStarted.html)\n[Learn more about Pandas - https://pandas.pydata.org/docs/](https://pandas.pydata.org/docs/)\nCheck out our other Notebooks for ideas! - https://github.com/Azure/Azure-SentinelNotebooks\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-17 - Creating your first Microsoft Sentinel Notebook.pdf"
    ],
    "report_names": [
        "2021-11-17 - Creating your first Microsoft Sentinel Notebook.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535988,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653688763,
    "ts_modification_date": 1653688763,
    "files": {
        "pdf": "https://archive.orkl.eu/5a63af609fe17dd293dde1520e4c3a13d818ea29.pdf",
        "text": "https://archive.orkl.eu/5a63af609fe17dd293dde1520e4c3a13d818ea29.txt",
        "img": "https://archive.orkl.eu/5a63af609fe17dd293dde1520e4c3a13d818ea29.jpg"
    }
}