{
    "id": "442b0c72-7c29-4429-b31c-f29380a91f2f",
    "created_at": "2023-01-12T15:10:29.249086Z",
    "updated_at": "2025-03-27T02:11:00.514126Z",
    "deleted_at": null,
    "sha1_hash": "71abe0ca8b11a4854a25079667d0627779fc9cb0",
    "title": "2021-11-16 - Strategic web compromises in the Middle East with a pinch of Candiru",
    "authors": "",
    "file_creation_date": "2022-05-28T00:37:20Z",
    "file_modification_date": "2022-05-28T00:37:20Z",
    "file_size": 654443,
    "plain_text": "# Strategic web compromises in the Middle East with a pinch of Candiru\n\n**[welivesecurity.com/2021/11/16/strategic-web-compromises-middle-east-pinch-candiru/](https://www.welivesecurity.com/2021/11/16/strategic-web-compromises-middle-east-pinch-candiru/)**\n\nNovember 16, 2021\n\nESET researchers have discovered strategic web compromise (aka watering hole) attacks against high‑profile websites in\nthe Middle East\n\n[Matthieu Faou](https://www.welivesecurity.com/author/mfaou/)\n16 Nov 2021 - 04:34PM\n\nESET researchers have discovered strategic web compromise (aka watering hole) attacks against high‑profile websites in\nthe Middle East\n\nBack in 2018, ESET researchers developed a custom in-house system to uncover watering hole attacks (aka strategic\nweb compromises) on high-profile websites. On July 11, 2020 it notified us that the website of the Iranian embassy inth\nAbu Dhabi had been modified and had started injecting JavaScript code from https://piwiks[.]com/reconnect.js, as shown\nin Figure 1.\n\n\n-----\n\n_Figure 1. Script injection on the website of the Iranian Embassy in Abu Dhabi_\n\nOur curiosity was aroused by the nature of the targeted website and in the following weeks we noticed that other websites\nwith connections to the Middle East started to be targeted. We traced the start of the campaign back to March 2020, when\nthe piwiks[.]com domain was re-registered. We believe that the strategic web compromises only started in April 2020\nwhen the website of the Middle East Eye (middleeasteye.net), a London-based digital news site covering the region,\nstarted to inject code from the piwiks[.]com domain.\n\nAt the end of July or the beginning of August 2020, all remaining compromised websites were cleaned; it is probable that\nthe attackers themselves removed the malicious scripts from the compromised websites. The threat group went quiet until\nJanuary 2021, when we observed a new wave of compromises. This second wave lasted until August 2021, when all\n[websites were cleaned again. A few indicators from this second wave were shared on Twitter by a fellow researcher,](https://twitter.com/felixaime/status/1417928699513610241)\nwhich allows us to make a link with what Kaspersky tracks as Karkadann.\n\nWe detail the inner working of the compromises in the Technical analysis section, below, but it is worth noting that the final\ntargets are specific visitors of those websites, who are likely to receive a browser exploit. The compromised websites are\nonly used as a hop to reach the final targets.\n\nWe also uncovered interesting links with Candiru, detailed in the section Links between the watering holes, spearphishing\n_[documents and Candiru. Candiru is a private Israeli spyware firm that was recently added to the Entity List (entities](https://www.commerce.gov/news/press-releases/2021/11/commerce-adds-nso-group-and-other-foreign-companies-entity-list)_\nsubject to licensing restrictions) of the US Department of Commerce. This may prevent any US‑based organization from\ndoing business with Candiru without first obtaining a license from the Department of Commerce.\n\nAt the time of writing, it seems that the operators are taking a pause, probably in order to retool and make their campaign\nstealthier. We expect to see them back in the ensuing months.\n\n## Targeting\n\nOur tracking shows that the operators are mostly interested in the Middle East, with a particular emphasis on Yemen.\nTable 1 shows the known targets in 2020 and 2021.\n\n_Table 1. Domains compromised during the first wave_\n\n**Compromised website** **C&C** **From** **To** **Detail**\n\n\n-----\n\n**Compromised website** **C&C** **From** **To** **Detail**\n\nmiddleeasteye.net piwiks[.]com 2020‑04‑04 2020‑04‑06 A UK-based online newspaper covering the\nMiddle East.\n\npiaggioaerospace.it piwiks[.]com 2020-07-08 2020-11-05 An Italian aerospace company.\n\nmedica-tradefair[.]co rebrandly[.]site 2020-07-09 2020-10-13 Fake website impersonating a German\nmedical trade fair in Düsseldorf.\n\nmfa.gov.ir piwiks[.]com 2020-07-11 2020-07-13 Ministry of Foreign Affairs of Iran.\n\nalmanar.com.lb rebrandly[.]site 2020-07-24 2020-07-30 Television channel linked to Hezbollah.\n\n\nsmc.gov.ye visitortrack[.]net\n\nhotjar[.]net\n\nalmasirahnews.com visitortrack[.]net\n\nhotjar[.]net\n\n\n2021-01-18\n\n2021-04-21\n\n2021-01-25\n\n2021-04-21\n\n\n2021-04-14\n\n2021-07-30\n\n2021-03-25\n\n2021-07-17\n\n\nMinistry of Interior of Yemen.\n\nYemeni Television channel linked to the\nAnsar Allah movement (Houthis).\n\n\ncasi.gov.sy hotjar[.]net 2021-02-01 Unknown Central Authority for the Supervision and\nInspection of Syria.\n\nmoe.gov.sy hotjar[.]net 2021-02-01 Unknown Syrian Ministry of Electricity.\n\n\nalmanar.com.lb webfx[.]bz\n\nwebffx[.]bz\n\nwebffx[.]bz\n\n\n2021-02-03\n\n2021-03-12\n\n2021-03-24\n\n\n2021-02-23\n\n2021-03-24\n\n2021-03-25\n\n\nTelevision channel linked to Hezbollah.\n\n\nmanartv.com.lb webfx[.]bz 2021-02-03 2021-03-22 Television channel linked to Hezbollah.\n\nmof.gov.ye hotjar[.]net 2021-02-11 2021-07-14 Ministry of Finance of Yemen.\n\nscs-net.org hotjar[.]net 2021-03-07 Unknown Internet Service Provider in Syria.\n\ncustoms.gov.ye livesesion[.]bid 2021-03-24 2021-06-16 Customs agency of Yemen.\n\n\ndenel.co.za\n\npmp.co.za\n\ndeneldynamics.co.za\n\ndenellandsystems.co.za\n\ndenelaviation.co.za\n\n\nsite-improve[.]net 2021-03-31\n\n2021-03-31\n\n2021-04-03\n\n2021-04-04\n\n2021-04-07\n\n\n2021-07-22\n\nUnknown\n\n2021-07-27\n\n2021-07-23\n\n2021-07-19\n\n\nA South African state-owned aerospace\nand military technology conglomerate.\n\n\nyemen.net.ye hotjar[.]net 2021-04-15 2021-08-04 Internet service provider in Yemen.\n\nyemenparliament.gov.ye hotjar[.]net 2021-04-20 2021-07-05 Parliament of Yemen.\n\nyemenvision.gov.ye hotjar[.]net 2021-04-21 2021-06-13 Yemeni government website.\n\nmmy.ye hotjar[.]net 2021-05-04 2021-08-19 Yemeni media linked to the Houthis.\n\nthesaudireality.com bootstrapcdn[.]net 2021-06-16 2021-07-23 Likely dissident media outlet in Saudi Arabia.\n\nsaba.ye addthis[.]events 2021-06-18 Unknown Yemeni news agency linked to Houthis.\nHowever, it seems it was taken over by the\nSouthern Transitional Council in early June\n2021, just before this website was\ncompromised.\n\nmedica-tradefair[.]co is the outlier in this list, as it was not compromised but was operated by the attackers themselves. It\nwas hosted at ServerAstra, as were all the other C&C servers used in 2020.\n\nIt mimics the legitimate website medica-tradefair.com, which is the website of the World Forum for Medicine’s MEDICA\nTrade Fair held in Düsseldorf (Germany) each year. The operators simply cloned the original website and added a small\npiece of JavaScript code.\n\n\n-----\n\nAs seen in Figure 2, the content doesn t seem to have been modified. It is likely that attackers were not able to\ncompromise the legitimate website and had to set up a fake one in order to inject their malicious code.\n\n_Figure 2. Cloned version of the Medica Trade Fair website_\n\nIt is interesting to note that the malicious domains mimic genuine web analytics, URL shortener or content delivery\nnetwork domains and URLs. This is a characteristic of this threat actor.\n\n## Technical analysis – Strategic web compromises\n\n### First wave – 2020\n\n**_First stage – Injected script_**\n\nAll compromised websites were injecting JavaScript code from the attacker-controlled domains piwiks[.]com and\nrebrandly[.]site. In the first known case, the injection is as shown in Figure 3.\n\n\n-----\n\n_Figure 3. Script injection on the website of the Iranian Embassy in Abu Dhabi_\n\nThis injection loads a remote JavaScript named reconnects.js and a legitimate third-party library, GeoJS, for IP\ngeolocation lookup.\n\nIn the cases of rebrandly[.]site injections, the additional scripts are loaded using HTML script tags, as seen in Figure 4.\n\n_Figure 4. Script injected into the medica-tradefair[.]co website_\n\n**_Second stage – Fingerprinting script_**\n\nreconnects.js and recon-api.js are almost identical; only the order of some lines or functions are changed. As shown in\nFigure 5, the malware authors tried to avoid raising suspicions by prepending their script with a copy of the jQuery\nBrowser Plugin header. They were probably hoping that malware analysts would not scroll further.\n\n\n-----\n\n_Figure 5. Beginning of the fingerprinting script used in the first wave_\n\nThe script first implements a function named geoip. It is automatically called by the GeoJS library, previously loaded, as\n[mentioned on the official GeoJS website. The variable json contains the IP geolocation information. The script sends this](https://www.geojs.io/)\nJSON via an HTTP POST request to the C&C server at the URL https://rebrandly[.]site/reconnect-api.php. If the server\nreturns an HTTP 200 status code, then the script proceeds to a function named main.\n\nFirst, main gathers information such as the operating system version and the browser version using custom functions\nshown in Figure 6. They simply parse the browser User-Agent to extract information.\n\n\n-----\n\n_Figure 6. OS and browser fingerprinting functions_\n\nAs shown in Figure 7, the function then checks whether the operating system is either Windows or macOS and only\ncontinues if so. This is interesting because it suggests that this operation is intended to compromise computers and not\nmobile devices such as smartphones. It also checks for a list of common web browsers: Chrome, Firefox, Opera, IE,\nSafari and Edge.\n\n_Figure 7. The main function of the fingerprinting script used in the first wave_\n\nThe script also encrypts a hardcoded value, 1122, although we don’t know for what purpose. Despite the function being\nnamed decrypt, it actually encrypts using RSA and the library JSEncrypt. The 1024-bit RSA key is hardcoded and set to:\n\n\n-----\n\nBEGIN PUBLIC KEY\nMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDhIxVX6QGlxe1mrkPCgBtz8bWH\nnzmek4He5caAE2sH2TFnXN1VdqpxMaJSi+dj9sbqHu0tSYd+5tU20514jlEOX6/D\nyFFPCoOvx5TzAm+AkSmevUuMsfZTifK+wQRxRhiuMk2UbnVCVQS0CJDoPTl8Blsp\n1oCEF2Kz7uIb0pea3QIDAQAB\n—–END PUBLIC KEY—–\n\nThen, the script sends an HTTPS GET request to the C&C server rebrandly[.]site. The id parameter contains the\nfingerprint data and the last parameter value contains the country provided by the GeoJS library.\n\nIf the server returns a reply, it is decrypted using AES from the CryptoJS library, and a hardcoded key\nflcwsfjWCWEcoweijwf@#$@#$@#499299234@#$!@2. This key stayed the same, even after we tried a few requests.\n\nThe decrypted value is supposedly a URL and a new iframe pointing to this URL is created. We were unable to get any\nvalid answer but we believe it leads to a browser remote code execution exploit that allows an attacker to take control of a\nmachine.\n\n### Second wave – 2021\n\nIn January 2021, a new wave of attacks started. The attackers created an entirely new network infrastructure and changed\nall their JavaScript code.\n\n**_First stage – Injected script_**\n\nIn order to be a bit stealthier still, in this second wave, they started to modify scripts that were already on the compromised\nwebsite. So instead of adding code to the main HTML page, they modified libraries such as wp-embed.min.js, as seen in\nFigure 8. They simply added a few lines at the end of https://www.smc.gov.ye/wp-includes/js/wp-embed.min.js to load a\nscript from a server they control: https://visitortrack[.]net/sliders.js.\n\n_Figure 8. Injected script used in the second wave_\n\nAnother strategy used to limit their exposure is to create a cookie the first time the visitor executes the malicious script, as\nshown in Figure 9. As the script is conditionally injected depending on whether the cookie already exists, this will prevent\nfurther injections. This specific code was found on the website of the Syrian Central Authority for the [sic] Supervision and\nInspection (casi.gov.sy).\n\n_Figure 9. Cookie creation to avoid further requests_\n\n**_Second stage_**\n\n\n-----\n\n[From January to March 2021, for the second stage script, the operators used a script based on the minAjax library. This is](https://github.com/flouthoc/minAjax.js)\nnot a fingerprinting script per se as it doesn’t send any information about the browser or the operating system to the C&C\n[server – an example is shown in Figure 10. It should be noted that very similar scripts are used by the LNKR adware, so a](https://www.netskope.com/fr/blog/lnkr-makes-a-comeback-this-ads-for-us)\ndetection on this might lead to a high volume of false positives.\n\n_Figure 10. Second-stage script of the second wave_\n\nThis script contains the current timestamp, t0, an expiration timestamp, ex, and two hashes juh and cs, whose significance\nwe don’t know at present. These values are sent to the C&C server https://webfex[.]bz/f/gstats. If the reply is a JSON\nobject and contains the fw key, the script issues a redirection to the URL contained in fw using\nparent.top.window.location.href. As with the first wave, we were not able to get any valid redirect.\n\n[In April 2021, this script was changed to FingerprintJS Pro. This is a commercial product whose developers have an](https://fingerprintjs.com/)\nofficial website shown in Figure 11.\n\n\n-----\n\n_Figure 11. Home page of FingerprintJS_\n\nIn comparison to the fingerprinting script used in 2020, this is far more complex because it retrieves the default language,\nthe list of fonts supported by the browser, the time zone, the list of browser plugins, the local IP addresses using\nRTCPeerConnection, and so on. Network communications with the C&C server are encrypted with an AES session key.\nAs shown in Figure 12, the server can return JavaScript code that will be executed in the context of the current web page.\n\n_Figure 12. FingerprintJS Pro adds JavaScript code to the current page_\n\nAs with the previous cases, we never got a valid redirect. We still believe it leads to a browser exploit and it shows that\nthis campaign is highly targeted.\n\n### Spearphishing documents and links with Candiru\n\n**_Reminder of the Citizen Lab publication_**\n\nIn the _[Citizen Lab Candiru blogpost, there is a section called A Saudi-Linked Cluster?. It mentions](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/)_ _a spearphishing_\n_document that was uploaded to VirusTotal._\n\n\n-----\n\nThe C&C server used by this document is https://cuturl[.]space/lty7uw and VirusTotal captured a redirection from this URL\nto https://useproof[.]cc/1tUAE7A2Jn8WMmq/api. The domain useproof[.]cc was resolving to 109.70.236[.]107 and,\naccording to the Citizen Lab, this server matched their so-called CF3 fingerprint for Candiru C&C servers. This domain\nwas registered via Porkbun, as are most Candiru-owned domains.\n\nTwo domains resolving to the same IP address caught our attention:\n\nwebfx[.]cc\nengagebay[.]cc\n\nThe same second-level domains, with a different TLD, were used in the second wave of strategic web compromises.\nThese two domains in the .cc TLD are most likely operated by Candiru too.\n\nThe Citizen Lab report mentions a few domains similar to cuturl[.]space, which we detail in Table 2.\n\n_Table 2. Domains similar to cuturl[.]space_\n\n**Domain** **Registrar** **IP** **Hosting Provider**\n\nllink[.]link Njalla 83.171.237[.]48 Droptop\n\ninstagrarn[.]co TLD Registrar Solutions 83.97.20[.]89 M247\n\ncuturl[.]app TLD Registrar Solutions 83.97.20[.]89 M247\n\nurl-tiny[.]co TLD Registrar Solutions 83.97.20[.]89 M247\n\nbitly[.]tel Njalla 188.93.233[.]149 Dotsi\n\nThese domain names mimic URL shorteners and the Instagram social media website and were registered through Njalla\nand TLD Registrar Solutions Ltd. This reminds us of the domains used for the strategic web compromises that are all\nvariations of genuine web analytics websites and were also registered via Njalla.\n\nWe also independently confirmed that the servers to which these domains were resolving were configured in a similar\nfashion.\n\nThus, we believe that this set of websites is controlled by the same threat group that created the documents. Conversely,\nthe domain useproof[.]cc is most likely operated in-house by Candiru and is used to deliver exploits.\n\n### Links between the watering holes, spearphishing documents and Candiru\n\nTable 3 summarizes the characteristics of the watering holes, the documents found by Citizen Lab, and Candiru.\n\n_Table 3. Summary of links between the three clusters (watering holes, documents found by Citizen Lab and Candiru)_\n\n\n**Watering holes**\n\n\n**Cluster of**\n**documents** **Candiru**\n\n\n**Registrars** Mainly Njalla Njalla and TLD\nRegistrar Solutions\n\n\n**Hosting**\n**providers**\n\n**Domain**\n**themes**\n\n\nServerAstra, Droptop, Neterra, Net\nSolutions, The Infrastructure Group,\nSia Nano and FlokiNET\n\n\nAnalytics and URL shortener services URL shortener\nservices\n\n\nDroptop, M247 and\nDotsi\n\n\nPorkbun\n\nM247, QuadraNet, etc.\n\nAnalytics, URL shortener services,\nmedia outlets, tech companies,\ngovernment contractors, etc.\n\n\n**Victimology** Middle East Middle East Middle East, Armenia, Albania, Russia,\nUzbekistan, etc.\n\n\n**Targeted**\n**platforms**\n\n\nWindows and macOS Windows Windows and macOS\n\n\n-----\n\n**Watering holes**\n\n\n**Cluster of**\n**documents** **Candiru**\n\n\n**TTPs** Strategic web compromises Malicious\ndocuments with\nDocument_Open\nmacros\n\n\nMalicious documents and fake shortened\nURLs redirecting to exploits and the\n[DevilsTongue implant.](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\n\n\nWhat is interesting to note is that the watering holes are limited to a quite narrow victimology. We also noted that domains\nknown to be operated by Candiru (webfx[.]cc for example) are very similar to domains used for the watering holes\n(webfx[.]bz). However, they were not registered in the same fashion and their servers are configured very differently.\n\n[In July 2021, Google published a blogpost providing details on exploits used by Candiru. It includes CVE‑2021-21166 and](https://blog.google/threat-analysis-group/how-we-protect-users-0-day-attacks/)\nCVE-2021-30551 for Chrome and CVE-2021-33742 for Internet Explorer. They are full remote code execution exploits that\nallow an attacker to take control of a machine by making the victim visit a specific URL that then delivers the exploit. This\nshows Candiru has the capabilities to exploit browsers in a watering hole attack.\n\nHence, we believe that the watering holes behave similarly to the documents. The first C&C server, injected in the\ncompromised websites, would redirect to another C&C server, owned by a spyware firm such as Candiru and delivering a\nbrowser exploit.\n\nBased on this information, we assess:\n\nwith low confidence that the creators of the documents and the operators of the watering holes are the same.\nwith medium confidence that the operators of the watering holes are customers of Candiru.\n\n## Conclusion\n\nThis report describes two strategic web compromise campaigns targeting high-profile organizations in the Middle East,\nwith a strong focus on Yemen. We also revealed links to Candiru, a spyware firm, that sells state‑of‑the‑art offensive\nsoftware tools and related services to government agencies.\n\nWe were unable to get an exploit and the final payload. This shows that the operators choose to narrow the focus of their\noperations and that they don’t want to burn their zero-day exploits.\n\nWe stopped seeing activity from this operation at the end of July 2021, shortly after the release of blogposts by the Citizen\nLab, Google and Microsoft detailing the activities of Candiru.\n\n_[A comprehensive list of Indicators of Compromise (IoCs) and samples can be found in our GitHub repository.](https://github.com/eset/malware-ioc/tree/master/swc-candiru)_\n\n_For any inquiries, or to make sample submissions related to the subject, contact us at threatintel@eset.com._\n\n## Indicators of Compromise\n\n### Legitimate, historically compromised websites\n\n**Compromised website** **From** **To (treat as a lower bound)**\n\nmiddleeasteye.net 2020-04-04 2020-04-06\n\npiaggioaerospace.it 2020-07-08 2020-11-05\n\nmfa.gov.ir 2020-07-11 2020-07-13\n\nalmanar.com.lb 2020-07-24 2020-07-30\n\n\nsmc.gov.ye 2021-01-18\n\n2021-04-21\n\nalmasirahnews.com 2021-01-25\n\n2021-04-21\n\n\n2021-04-14\n\n2021-07-30\n\n2021-03-25\n\n2021-07-17\n\n\n-----\n\n**Compromised website** **From** **To (treat as a lower bound)**\n\ncasi.gov.sy 2021-02-01 Unknown\n\nmoe.gov.sy 2021-02-01 Unknown\n\n\nalmanar.com.lb 2021-02-03\n\n2021-03-12\n\n\n2021-02-23\n\n2021-03-25\n\n\nmanartv.com.lb 2021-02-03 2021-03-22\n\nmof.gov.ye 2021-02-11 2021-07-14\n\nscs-net.org 2021-03-07 Unknown\n\ncustoms.gov.ye 2021-03-24 2021-06-16\n\ndenel.co.za 2021-03-31 2021-07-22\n\npmp.co.za 2021-03-31 Unknown\n\ndeneldynamics.co.za 2021-04-03 2021-07-27\n\ndenellandsystems.co.za 2021-04-04 2021-07-23\n\ndenelaviation.co.za 2021-04-07 2021-07-19\n\nyemen.net.ye 2021-04-15 2021-08-04\n\nyemenparliament.gov.ye 2021-04-20 2021-07-05\n\nyemenvision.gov.ye 2021-04-21 2021-06-13\n\nmmy.ye 2021-05-04 2021-08-19\n\nthesaudireality.com 2021-06-16 2021-07-23\n\nsaba.ye 2021-06-18 Unknown\n\n### C&C servers\n\n\n**Last**\n**seen** **Details**\n\n\n**Domain** **IP**\n\n\n**First**\n**seen**\n\n\npiwiks[.]com 91.219.236[.]38 2020-0331\n\n\nWatering hole C&C server.\n\nWatering hole C&C server.\n\nFake website impersonating a German medical\nconference.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\n\nrebrandly[.]site 91.219.239[.]191\n\n91.219.236[.]38\n\n\n2020-0320\n\n2020-0713\n\n\n2020-0729\n\n2020-0710\n\n2020-0929\n\n2021-1020\n\n2020-0319\n\n2020-0416\n\n2020-0416\n\n2020-0416\n\n\nmedica-tradefair[.]co 91.219.236.50 2021-0628\n\nbitly[.]bz 91.219.239[.]191 2020-0319\n\ntinyurl[.]ist 91.219.239[.]191 2020-0319\n\ntinyurl[.]bz 91.219.239[.]191 2020-0320\n\nbit-ly[.]site 91.219.239[.]191 2020-0325\n\n\n-----\n\n**Last**\n**seen** **Details**\n\n\n**Domain** **IP**\n\n\n**First**\n**seen**\n\n\nbitly[.]tw 91.219.239[.]191 2020-0326\n\nbitly[.]zone 91.219.239[.]191 2020-0326\n\nshortlinkcut[.]link 91.219.239[.]191 2020-0326\n\ntinyurl[.]one 91.219.239[.]191 2020-0326\n\ntinyurl[.]photos 91.219.239[.]191 2020-0326\n\ntinyurl[.]plus 91.219.239[.]191 2020-0326\n\nsite-improve[.]net 185.165.171[.]105 2021-0106\n\nclickcease[.]app 83.171.236[.]147 2021-0106\n\nvisitortrack[.]net 87.121.52[.]252 2021-0106\n\nwebfx[.]bz 94.140.114[.]247 2021-0106\n\nlivesession[.]bid 5.206.224[.]197 2021-0106\n\nengagebay[.]app 185.82.126[.]104 2021-0107\n\nhotjar[.]net 5.206.224[.]226 2021-0107\n\nwebffx[.]bz 83.171.236[.]3 2021-0221\n\nengagebaay[.]app 5.206.227[.]93 2021-0307\n\nlivesesion[.]bid 87.120.37[.]237 2021-0317\n\nsitei-mprove[.]net 87.121.52[.]9 2021-0317\n\nwebfex[.]bz 45.77.192[.]33 2021-0226\n\nbootstrapcdn[.]net 188.93.233[.]162 2021-0428\n\naddthis[.]events 83.171.236[.]247 2021-0429\n\nsherathis[.]com 5.206.224[.]54 2021-0627\n\nyektenet[.]com 5.2.75[.]217 2021-0627\n\n\n2020-0416\n\n2020-0416\n\n2020-0416\n\n2020-0416\n\n2020-0416\n\n2020-0416\n\n2021-0721\n\n2021-0728\n\n2021-1006\n\n2021-0324\n\n2021-0725\n\n2021-0519\n\n2021-0802\n\n2021-0327\n\n2021-0727\n\n2021-0728\n\n2021-0727\n\n\n2021-0728\n\n2021-0728\n\n2021-0801\n\n2021-0727\n\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nWatering hole C&C server.\n\nUnknown.\n\nWatering hole C&C server.\n\nWatering hole C&C server.\n\nUnknown.\n\nUnknown.\n\nWatering hole C&C server.\n\nWatering hole C&C server.\n\nUnknown.\n\nWatering hole C&C server.\n\nUnknown.\n\n\nN/A Watering hole C&C server.\n\n\nWatering hole C&C server.\n\nWatering hole C&C server.\n\nUnknown.\n\nUnknown.\n\n\n-----\n\n**Last**\n**seen** **Details**\n\n\n**Domain** **IP**\n\n\n**First**\n**seen**\n\n\nstaticdoubleclick[.]net\n\ncodeafsanalytics[.]com\n\n\n87.121.52[.]128 2021-0627\n\n83.171.236[.]225 2021-0627\n\n\n2021-0727\n\n2021-0728\n\n2021-0724\n\n2021-0723\n\n2021-0718\n\n2021-0501\n\n2021-0123\n\n2021-0120\n\n2020-1125\n\n2021-0311\n\n2021-0423\n\n2021-0219\n\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nUnknown.\n\nMalicious document C&C server.\n\nUnknown.\n\nUnknown.\n\nMalicious document C&C server.\n\nCandiru exploit delivery server.\n\n\nfonts-gstatic[.]net 83.171.239[.]172 2021-0627\n\nmoatads[.]co 87.121.52[.]144 2021-0627\n\ndoubleclick[.]ac 5.2.67[.]82 2021-0627\n\nllink[.]link 83.171.237[.]48 2021-0125\n\ninstagrarn[.]co 83.97.20[.]89 2020-1102\n\ncuturl[.]app 83.97.20[.]89 2020-1102\n\nurl-tiny[.]co 83.97.20[.]89 2020-1102\n\nbitly[.]tel 188.93.233[.]149 2021-0125\n\ncuturl[.]space 83.171.236[.]166 2021-0125\n\nuseproof[.]cc 109.70.236[.]107 2020-1125\n\n### Files\n\n\n**SHA-1** **Filename** **C&C URL** **Comment**\n\n4F824294BBECA4F4ABEEDE8648695EE1D815AD53 N/A https://cuturl[.]app/sot2qq Document\nwith VBA\nmacro.\n\n96AC97AB3DFE0458B2B8E58136F1AAADA9CCE30B copy_02162021q.doc https://cuturl[.]space/lty7uw Document\nwith\nmalicious\nVBA\nmacro.\n\nDA0A10084E6FE57405CA6E326B42CFD7D0255C79 seeIP.doc https://cuturl[.]space/1hm39t Document\nwith VBA\nmacro.\n\n## MITRE ATT&CK techniques\n\n_[This table was built using version 10 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)_\n\n**Tactic** **ID** **Name** **Description**\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\nResource\nDevelopment\n\n\n[T1583.001](https://attack.mitre.org/versions/v10/techniques/T1583/001) Acquire Infrastructure: Domains The operators bought domain\nnames from multiple registrars,\nincluding Njalla.\n\n\n[T1583.004](https://attack.mitre.org/versions/v10/techniques/T1583/004) Acquire\nInfrastructure:\nServer\n\n[T1584.004](https://attack.mitre.org/versions/v10/techniques/T1584/004) Compromise\nInfrastructure:\nServer\n\n[T1588.001](https://attack.mitre.org/versions/v10/techniques/T1588/001) Obtain\nCapabilities:\nMalware\n\n[T1588.005](https://attack.mitre.org/versions/v10/techniques/T1588/005) Obtain\nCapabilities:\nExploits\n\n[T1608.004](https://attack.mitre.org/versions/v10/techniques/T1608/004) Stage\nCapabilities:\nDrive-by\nTarget\n\n\nThe operators rented servers from multiple\nhosting companies. In 2020, they rented servers\nmainly from ServerAstra.\n\nThe operators compromised several high-profile\nwebsites.\n\nThe operators probably bought access to Candiru\nimplants.\n\nThe operators probably bought access to Candiru\nexploits.\n\nThe operators modify more than twenty highprofile websites to add a piece of JavaScript code\nthat loads additional code from their C&C servers.\n\n\nInitial Access [T1189](https://attack.mitre.org/versions/v10/techniques/T1189) Drive-by Compromise Visitors to compromised websites\nmay have received an exploit after\ntheir browser was fingerprinted.\n\n\n[T1566.001](https://attack.mitre.org/versions/v10/techniques/T1566/001) Phishing:\nSpearphishing\nAttachment\n\n\nThe operators sent spearphishing emails with\nmalicious Word documents.\n\n\nExecution [T1059.005](https://attack.mitre.org/versions/v10/techniques/T1059/005) Command and Scripting Interpreter: Visual Basic The Word documents contain a\nVBA macro running code using\nthe Document_Open function.\n\n\nCommand\nand Control\n\n\n[T1071.001](https://attack.mitre.org/versions/v10/techniques/T1071/001) Application Layer Protocol: Web Protocols The watering hole scripts\ncommunicate via HTTPS with the\nC&C servers.\n\n\n16 Nov 2021 - 04:34PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n\n-----\n\n### Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-16 - Strategic web compromises in the Middle East with a pinch of Candiru.pdf"
    ],
    "report_names": [
        "2021-11-16 - Strategic web compromises in the Middle East with a pinch of Candiru.pdf"
    ],
    "threat_actors": [
        {
            "id": "5e034014-1f6e-424d-adfa-49557e655e08",
            "created_at": "2024-02-06T02:00:04.118601Z",
            "updated_at": "2025-03-27T02:00:03.319536Z",
            "deleted_at": null,
            "main_name": "Karkadann",
            "aliases": [
                "Piwiks"
            ],
            "source_name": "MISPGALAXY:Karkadann",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f6bd9b8-e46e-4c3b-9a08-41fee319f273",
            "created_at": "2022-10-25T16:07:23.747959Z",
            "updated_at": "2025-03-27T02:02:09.959932Z",
            "deleted_at": null,
            "main_name": "Karkadann",
            "aliases": [],
            "source_name": "ETDA:Karkadann",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536229,
    "ts_updated_at": 1743041460,
    "ts_creation_date": 1653698240,
    "ts_modification_date": 1653698240,
    "files": {
        "pdf": "https://archive.orkl.eu/71abe0ca8b11a4854a25079667d0627779fc9cb0.pdf",
        "text": "https://archive.orkl.eu/71abe0ca8b11a4854a25079667d0627779fc9cb0.txt",
        "img": "https://archive.orkl.eu/71abe0ca8b11a4854a25079667d0627779fc9cb0.jpg"
    }
}