{
    "id": "448f7e74-143c-46ab-80b6-97c1243081d4",
    "created_at": "2023-01-12T14:59:52.211975Z",
    "updated_at": "2025-03-27T02:16:25.709652Z",
    "deleted_at": null,
    "sha1_hash": "cf09de12b825e0c6e44dc6c6af63027e9979899e",
    "title": "2020-06-02 - Evolution of Excel 4.0 Macro Weaponization",
    "authors": "",
    "file_creation_date": "2022-05-28T02:33:30Z",
    "file_modification_date": "2022-05-28T02:33:30Z",
    "file_size": 3158723,
    "plain_text": "# Evolution of Excel 4.0 Macro Weaponization\n\n**[lastline.com/labsblog/evolution-of-excel-4-0-macro-weaponization/](https://www.lastline.com/labsblog/evolution-of-excel-4-0-macro-weaponization/)**\n\nPosted by [James Haughom and](https://www.lastline.com/author/jhaughom/) [Stefano Ortolani ON JUN 2, 2020](https://www.lastline.com/author/stefano/)\n\n## Abstract\n\n\nJune 2, 2020\n\n\nExcel 4.0 (XL4) macros are becoming increasingly popular for\nattackers, as security vendors struggle to play catchup and detect\nthem properly. This technique provides attackers a simple and\nreliable method to get a foothold on a target network, as it simply\nrepresents an abuse of a legitimate feature of Excel, and does not\nrely on any vulnerability or exploit. For many organizations,\nblacklisting isn’t a viable solution, and any signatures to flag these\nsamples must be precise enough not to trigger on files that leverage this feature legitimately.\nAs this is a 30-year-old feature that has only been discovered and exploited en mass by\nattackers in the last year, many security vendors do not currently have detection\nmechanisms in place to trigger on these samples, and building reliable signatures for this\ntype of attack is not a small task.\n\nThe Lastline Threat Research Group has observed thousands of samples leveraging this\ntechnique, and has been monitoring and tracking trends for the last 5+ months. Intercepting\nthese samples has provided valuable data to build statistics, identify trends, find outliers, and\ntrack campaigns. We were able to cluster samples into distinct waves, which clearly display\nhow this technique has evolved through time to become more sophisticated and more\nevasive. As XL4 macros represent somewhat “uncharted territory,” malware authors and\nsecurity researchers are making new discoveries daily, pushing the boundaries of this\ntechnique and identifying ways to evade detection and obfuscate their code. The techniques\nemployed by these attackers include ways to evade automated sandbox analysis and\nsignature-based detection, as well as hands-on analysis performed by malware analysts and\nreverse engineers. As previously mentioned, these techniques appear to surface in waves,\nwith each new wave introducing new techniques, building on the previous wave or cluster.\nTechniques used in the first wave of samples we observed in February are still being\nleveraged in samples being discovered today. In this blog post, we describe each wave and\ncluster in detail, by breaking down every new technique discovered, and explaining why each\nis significant, effective, or ineffective.\n\n## Executive Summary\n\n\n-----\n\nThrough clustering thousands of samples and performing in-depth code-level analysis of\neach cluster, we were able to visualize and witness the evolution of this threat. We found that\nroughly every 1-2 weeks, a new wave of samples emerged, each more evasive and\nsophisticated than the last. Each of these waves appeared to build on its predecessor,\nextending its functionality by introducing new techniques on top of what already was being\nused. The size of these clusters suggest that these samples are being generated with some\nsort of toolkit or document generator, as these samples resemble one another too closely to\nnot be related. Evasion routines and obfuscation were the primary areas of evolution, as the\nbase functionality of these samples remained the same – download and invoke a more\npersistent payload, such as an EXE or DLL file.\n\n## Introduction\n\nExcel 4.0, or XLM macros, is a 30-year-old feature of Microsoft Excel that has been gaining\npopularity among malware authors and attackers, especially over the last year (see Chart 1).\nThis type of macro code is actively being abused and weaponized by attackers to deliver\nadditional, more persistent malware. What makes this technique effective is that much like\nthe more popular and up-to-date VBA macros, Excel 4.0 macros are a component of\nlegitimate Excel functionality, thus will likely never be disabled, as they are used regularly for\nbenign business purposes. For example, the commonly used SUM function is used in many\nspreadsheets to obtain the sum of a range of cells. Macros of this type are commonly\nreferred to as “formulas.”\n\n**Chart 1: Six months of attacks detected using XL4 macros.**\nThis technique has been effective because although it is an old feature, security vendors\nmay not have yet devised detection techniques for this type of attack. On top of this,\norganizations will likely never be able to disable this feature in Excel, due to the fact that it is\nused regularly for legitimate purposes. For this reason, malware authors now have another\nreliable method for initial access, as these malicious documents are being successfully\ndelivered via email attachments.\n\n## The Problem\n\nSecurity vendors are having difficulty detecting this threat, likely due to not having solutions\nin place to properly assess and parse the format and structure of how these macros are\nstored in Excel documents [2]. These macros are very straightforward and easy to create,\nthus easy to modify to bypass signature-based detection. Macros are also robust, and\nprovide various functions that can be leveraged to evade analysis, such as obfuscating the\n\n\n-----\n\nfinal payload, modifying the control flow, or detecting automated sandbox analysis through\nspecific host environmental checks.\nThis technique will likely remain relevant, and join its successor (i.e., VBA macros) as a\nwidely used technique to weaponize document files. This technique does not rely on a bug, it\nis not an exploit, but it simply abuses legitimate Excel functionality. These macros can be set\nto auto-execute, and run as soon as a workbook is opened if macros are enabled. As this is\nsomewhat uncharted territory, malware authors and researchers are still exploring the depths\nof possibilities and capabilities of weaponizing this attack technique.\n\n## Contribution\n\nThe Threat Research Group at Lastline has clustered and analyzed thousands of XL4\nsamples, as we have been tracking and monitoring this threat for over five months. We were\nable to cluster and classify these samples into clear waves or trends. The bulk of these\nsamples appear to be created with the same toolkit or document generator, as each wave\nbuilds on the previous, adding new functionality with each iteration. This additional\nfunctionality typically consists of more sophisticated obfuscation or evasion routines. These\nstage-1 spreadsheet samples are in turn delivering a variety of commodity malware families,\nsuch as Danabot, ZLoader, Trickbot, Gozi, and Agent Tesla.\n\n## Evolution Timeline\n\nThe timeline below (Figure 1) displays how these macros have evolved over the past four\nmonths. Each block represents a significant wave or cluster that exhibited new behavior and\nfunctionality that we had not yet observed at scale. We will elaborate on each cluster in\ngreater detail in the following sections.\n\n\n-----\n\n**Figure 1: Evolution of Excel 4.0 macros weaponization.**\n\n## Evolution Breakdown\n\n**Cluster 1: ~2020.02.14**\n\nThis set of samples is the first significant wave of weaponized XL4 documents we observed.\nThese samples all contain a hidden macro sheet that holds the payload, and also an image\n(see Figure 2) that is used to social engineer the user into enabling the macro code. The\ntechniques introduced in this cluster will be leveraged and built upon by almost all the waves\nthat followed.\n\n\n-----\n\n**Figure 2: Embedded image to entice users to enable dynamic content.**\nUnhiding the hidden macrosheet shows the payload (Figure 3), which is not obfuscated in\nany way.\n\n**Figure 3: Payload of the hidden macrosheet.**\n**Evasion Routine:**\n\n1. A sandbox check is performed by requiring user interaction with a message box\n\n(Figures 4 and 5). If “OK” is clicked in the message box, the next check in the evasion\nroutine is performed, otherwise the macro will exit.\n\nCELL FORMULA:\n\n**Figure 4: First check in evasion routine.**\n\n\n-----\n\n**Figure 5: MessageBox that requires user interaction.**\n2. Additional sandbox evasions commence, this time using the GET.WORKSPACE function\n\n[1] (see Figure 6). This function will provide information about the environment that the Excel\nspreadsheet is being viewed in. The two checks are for mouse capability (constant of 19),\nand audio capability (constant of 42). The malware exits if either of these two conditions are\nnot met.\n\n**Figure 6: Evasion routine – Mouse and audio capabilities.**\n3. An additional check for the victim’s OS commences (Figure 7). This is performed through\nchecking for the string ‘Windows’ being present in the return value of the call to\nGET.WORKSPACE:\n\n**Figure 7: Evasion routine – Check for Windows environment.**\n**The Download:**\n\nAn additional payload – a cell formula – is downloaded via a web query (Figures 8 and 9).\nThese web queries are stored in the DCONN (data connection) record type [3].\n\n\n-----\n\n**Figure 8: Hexdump of DCONN record / Web Query.**\n\n\n-----\n\n**Figure 9: Web Query / data**\n\nconnection in Excel.\nThe data from this network connection will be written to cells mapped to the name fgsb4g\n(shown at bottom of the hex dump in Figure 8), which the Excel name manager shows are\nrange $Y$100:$Y$103 (Figure 10).\n\n\n-----\n\n**Figure 10: Name Manager showing destination cells.**\nA small loop is then created between two cells that check whether the payload was\ndownloaded successfully (Figure 11). These cells are checking for the string “LOS” anywhere\nwithin cell Y103. This is because at the end of the downloaded cell formula payload, the\nmalware calls =CLOSE().\n\n**Figure 11: Checking for successful download**\n\n**Cluster 2: ~2020.02.26**\n\nThe second cluster of February added minor obfuscation through hiding the payload by using\na white font on white background (shown in red in Figure 12), and by scattering the code\naround the worksheet. This makes following control flow and identifying important code\n\n\n-----\n\nblocks a bit more challenging for manual analysis, but should cause no significant issues for\ndynamic analysis, noting that the first cluster included significant attempts to evade dynamic\nanalysis.\n\n**Figure 12: Scattered payload (originally payload was written in white font).**\n\n**Cluster 3: ~2020.02.27**\n\nThis cluster protects itself more than the previous clusters, as it hides the payload in a\n_veryhidden macro sheet instead of a hidden macro sheet (note that both types of macro_\nsheets are Excel documented features). This means that the macro sheet cannot be\nunhidden via the traditional method in Excel, but instead a specific flag in the binary (see\nFigure 14) must be modified in order to unhide and view the contents of the worksheet.\n\nOnce unhidden, this macro appears to extend on the dynamic analysis evasion routines from\nCluster 1 by performing additional guest OS environmental checks (Figure 13). These two\nnew checks also use the previously mentioned GET.WORKSPACE function, but this time\nthey attempt to identify the height and width of the workspace. This check ensures that the\ndisplay size of the workspace points (similar to pixels) are greater than the minimum value,\n770×380, in this cluster.\n\n\n-----\n\n**Figure 13: Checking the size of the display of the workspace.**\n\n**Figure 14:** _Veryhidden flag (0x2)._\n\n**Cluster 4: ~2020.03.06**\n\nThe new techniques introduced by this cluster include building a path to three different files,\none being a VBS script, which is a technique we didn’t see in previous clusters. These paths\n(Figure 15) will be used by the downloaded formula, the payload, using the same DCONN\nweb query described previously.\n\n**Figure 15: Additional code – Paths to files.**\nAlso, instead of FORMULA.FILL being used to move the downloaded payload around the\nsheet, FORMULA is used (Figure 16). This minor change is likely an evasion to signaturebased detection of the previously used FORMULA function.\n\n\n-----\n\n**Figure 16: FORMULA instead of**\n\nFORMULA.FILL\n\n**Cluster 5: ~2020.03.10**\n\nThis cluster is the first batch of samples where we observed heavy usage of the CHAR\nfunction (Figure 17). This function translates an integer to its corresponding ASCII character.\nFor example: CHAR(0x41) resolves to ‘A’. These characters are resolved, then concatenated\none at a time to build the final payload. This is a common obfuscation technique across a\nvariety of file formats and languages, but this is the first time we have seen the technique\nused in Excel 4.0 macros.\n\n\n-----\n\n**Figure 17: CHAR functions.**\nWithin this same timeframe, we also observed the first large wave of samples that directly\ninvoked the WinAPI (URLDownloadToFile) via the CALL function (Figure 18) instead of the\npreviously mentioned DCONN download method, which is likely used to evade static\ndetection of the prior download technique.\n\n**Figure 18: WinAPI usage – URLDownloadToFile.**\n\n**Cluster 6: ~2020.03.30**\n\nThe added functionality of this cluster includes a check for a non-default Excel Security\nsetting in the registry as a possible dynamic analysis evasion, and the use of the WinAPI to\nregister a DLL to execute the second stage payload. The code in Figure 19 shows that the\nnative utility reg.exe will be spawned (see Figure 20) to extract a specific registry key, and\nwrite it to a registry file on disk (<random_integer>.reg).\n\n\n-----\n\n**Figure 19: Deobfuscated payload – reg.exe.**\n\n**Figure 20: Process tree.**\nThis registry file (<random_integer>.reg) is then read from bytes 215:470 (see Figure 21).\nThe purpose of this read is to find and store the Excel Security-related registry settings of\ninterest that the malware will check.\n\n**Figure 21: Macro reading registry file.**\nThis appears to be a check for the File Validation setting in this instance; Figure 22 shows\nthe hexdump of an example (carved out the 255 bytes).\n\n\n-----\n\n**Figure 22: Hexdump of file validation setting.**\nThe macro then checks to see if the security setting is set, as shown in Figure 23.\n\n**Figure 23: Checking if the flag is set.**\n\n**Cluster 7: ~2020.04.01**\n\nThis cluster expects to be executed on a particular day, as it uses the current day of the\nmonth in a part of the deobfuscation routine. Hardcoded integers (Figure 24) will be\nsubtracted from the current day of the month, and the difference will then be passed to the\nCHAR function. These samples were created on April 10th, and are expected to be run on\nthat same day. We don’t see much of this “day-of” technique used outside of this cluster. This\nmay be due to the attackers being less successful with this wave, perhaps because the\nvictims checked their email (opening the document) in the days following its intended\nexecution day.\n\n\n-----\n\n**Figure 24: Hard-**\n\ncoded integers to be decoded.\nEach hard-coded integer is subtracted from the day of the month plus 7 (Figure 25), then\npassed to char.\n\n**Figure 25: Obtaining the day of the month and adding 7.**\nFigure 26 shows the part of the deobfuscation routine where the values in column A are\ndecoded and concatenated into one string.\n\n**Figure 26: Deobfuscation routine.**\n\n\n-----\n\nIf run on the incorrect day of the month, the XL4 macro will not deobfuscate and execute\nproperly (Figure 27 shows an example of a failed deobfuscation).\n\n**Figure 27: Failed deobfuscation (executed on the wrong day).**\nEmulating this behavior in Python with the proper value showed the expected deobfuscation\n(See Figure 28).\n\n**Figure 28: Emulating deobfuscation routine implemented in Python.**\nHardcoding the correct value (date) in the sheet allows the code to deobfuscate properly, as\nshown in Figure 29:\n\n\n-----\n\n**Figure 29: Expected deobfuscated payload.**\n\n**Cluster 8: ~2020.04.14**\n\nLike the previous cluster, this cluster must also be executed on a particular day, but a new\ncheck is added to query the font size and row height (Figure 30). GET.CELL is used for both\nof these checks, font size of the text in cell A1 (19), as well as row height (17). This is likely\nto check whether the spreadsheet has been tampered with.\n\n**Figure 30: Obtaining cell font size and row height.**\nThe result of these operations is written to cell AA181, which is used repeatedly during the\ndeobfuscation routine. If these dimensions are not precisely as the malware authors\nexpected, the payload will not be deobfuscated properly, and the second stage download will\nnot occur.\n\n**Cluster 9: ~2020.04.25**\n\nThe new technique introduced in this cluster employs dozens of independent macrosheets\n(Figure 31), whereas all previous clusters used only one or two sheets. We believe this is\nintended to have the sample blend in with benign workbooks, which tend to have a higher\nnumber of macro sheets than the malicious samples do. It also may be used to slow down\nmalware analysts who will have to identify where the payload lies across the 20+ macro\nsheets (Figure 32).\n\n\n-----\n\n**Figure 31: Hidden macro**\n\n\nsheets\n\n\n-----\n\n**Figure 32: List of all sheets.**\nAnother interesting characteristic is that instead of the typical Auto_Open name for the\nautomatic execution of the payload, the malware author has named it Auto_Open22 (Figure\n33), which still executes as a normal Auto_Open routine.\n\n\n-----\n\n**Figure 33:** _Auto_Open22 in Name Manager_\n\n**Cluster 10: ~2020.05.04**\n\nFor the first time, we observed hidden names being leveraged to hide the starting point of\nExcel 4.0 macro code in a large cluster. This is likely an attempt to thwart static parsing and\nanalysis, both by analysts and automated solutions. Figure 34 shows how the Name\nManager shows no names.\n\n\n-----\n\n**Figure 34: No names due to being hidden.**\nThis is achieved through setting the fHidden bit in the [Lbl record for the defined name at](https://docs.microsoft.com/en-us/openspecs/office_file_formats/ms-xls/d148e898-4504-4841-a793-ee85f3ea9eef)\noffset 0x0. At offset 0x15 is the Name field with constant 0x1 for Auto_Open.\n\nThis value of 0x21 has the fHidden and fBuiltin flags set (Figure 35).\n\n**Figure 35: Binary view of set bit flags.**\nAfter flipping the hidden bit, and adding a character (“g”) to the first byte of the Name at the\nend of this record, the name is visible (Figure 36).\n\n\n-----\n\n**Figure 36: Unhidden name is now displayed in Name Manager.**\nThis cluster also leverages an interesting deobfuscation routine, which is a bit different from\nwhat we have seen in previous clusters. Although we have seen control-flow obfuscation\nthrough GOTO and RUN functions, this cluster adds a step through setting a value to a cell\nfor later use in the routine (Figure 37): set cell value, jump to next code block, repeat.\n\n**Figure 37: Formulas transferring control flow and setting payload.**\n\n## Cluster 11: ~2020.05.11\n\nThis cluster introduces a few interesting evasion techniques by detecting window activity.\nThese macros attempt to identify if the Excel window is hidden or maximized, through three\ndifferent usages of GET.WINDOW() (Figures 38 and 39). If the Excel window is not\n\n\n-----\n\nmaximized, the malware will exit prior to exhibiting any interesting behavior. This appears to\nbe an anti-analysis or sandbox evasion trick, as Excel windows may not be maximized in\nthese environments.\n\n**Figure**\n\n**38: Stepping through evasion routine – GET.WINDOW.**\nAn additional evasion technique introduced in this malware is identifying if the malware is\nbeing debugged/analyzed. This is achieved through checking if the macro is being run in\nSingle Step mode (Figure 40), which is a way to debug and step through Excel 4.0 macro\ncode. If Single Step mode is detected, the malware will exit.\n\n**Figure**\n\n**40: Macro detecting Single Step mode.**\n\n**Cluster 12: ~2020.05.19**\n\nAlmost all previously mentioned clusters leverage the CHAR function heavily during their\ndeobfuscation routines to build the final macro payload character by character. This cluster\nchanges the original technique by using the MID function instead of the CHAR function. The\n_MID function is used to extract a substring (text) from a string by providing an index number_\n\n\n-----\n\nfor where to start, as well as the length of the text to extract. Figure 41 shows the MID\nfunction being used to extract a substring for each string in column B, and write it to column\nC.\n\n**Figure 41: Example of MID function.**\nInstances of this function are being concatenated and passed to the FORMULA function\n(Figure 42) to deobfuscate the final payload at runtime.\n\n**Figure**\n\n**42: Return values of MID functions passed to FORMULA.**\nThis cluster also leverages the FILES function (Figure 43). This function is used to obtain a\nlist of files within a target directory. The malware author uses the FILES function along with\n_ISERROR to check if the download succeeded (Figure 44)._\n\n**Figure**\n\n**43: FILES function to return either an error or list of files.**\n\n**Figure 44: Checking if**\n\nthe download succeeded.\nBefore downloading the next stage, the malware first checks to see it can access the Internet\n(Figures 45 and 46), by connecting to microsoft.com, and then checking that the requested\ndownload succeeded.\n\n\n-----\n\n**Figure 45: Testing Internet connection – Cell CX29183 holds the URL**\n\n**Figure 46: URL in Cell CX29183**\nIf this download is successful, the macro will then repeat this process to obtain the next\nmalware stage, and then invoke it.\n\n## Conclusion\n\nExcel 4.0 macros continue to prove their value to attackers, providing a reliable method to\nget their code to run on a target. In many environments, Excel worksheets with macros are\nused too heavily for legitimate business purposes to disable or blacklist, thus analysts and\nsecurity vendors will have to get used to consistently updating tooling and signatures as\nattacks continue to evolve. Excel 4.0 macros provide a near endless list of possibilities for\nmalware authors and are evolving, becoming more sophisticated each day.\n\n## Appendix\n\n**References**\n\n[1]\nhttps://d13ot9o61jdzpp.cloudfront.net/files/Excel%204.0%20Macro%20Functions%20Refere\nnce.pdf\n\n[2] https://www.loc.gov/preservation/digital/formats/digformatspecs/Excel972007BinaryFileFormat(xls)Specification.pdf\n\n[3] https://docs.microsoft.com/en-us/openspecs/office_file_formats/ms-xls/cd03cb5f-ca024934-a391-bb674cb8aa06\n\n**IOCs**\n\nBelow a selection of samples for each of the aforementioned clusters.\n\n**Cluster 1**\n\n032b584b85e8335f83c751dd9c70121eb329bc08\n\n30f908b7e97527e8a409ba93ec6258bdc7943b24\n\n26b7691ba5bac30670790f2af8b67aec37609729\n\n21deaf5c2adeb0ad3dae2048138c403691c3e71e\n\n17d62231f60e97121f7258b0296feeadb7996d5f\n\n\n-----\n\n**Cluster 2**\n\n0b01f4a1ca08c0136d84e3ec91af856579784451\n3db463c73a62b8bf0b6ab388884c6f3ad3a91c2f\n2df8277a9ac5869fa7d5a5838fe6ab428207cf9c\nBb8d0af63f837e7f54d530d909feded623399a1b\nC1217a7a59dc307089901556985239039cb89cbb\n\n**Cluster 3**\n\n0b80a32171c3f1b21015e880c7d3eb216eeff103\n38d8c573b901bb0bf1cd1cc62945521923630e58\n4a57bf593c6dc515a869b0facc4e1f2e3f8e85e1\n2d8b6113d858f988977a82af82ca649963915ff7\n1f66200bd820646e74b56ed8493794861eebc479\n\n**Cluster 4**\n\n15c3d132b4bc52f32541f6c7cb307467b7b85ee5\n38d8c573b901bb0bf1cd1cc62945521923630e58\n4a57bf593c6dc515a869b0facc4e1f2e3f8e85e1\n2d8b6113d858f988977a82af82ca649963915ff7\n1f66200bd820646e74b56ed8493794861eebc479\n\n**Cluster 5**\n\n13d35c6a71ee02362905982cfdd4f19ea7971fb0\n52bc0b0ca4aa88000220627d150b4996e4a2bdc0\n768d376f9ee85803940810a0d538c0ff4bd3ec4d\nB547d9eb47e2977e4f85e92e62e9271875f3654b\nD724559f4e1be192b8e60d1076ba6f00a76a7910\n\n**Cluster 6**\n\nCed11986de75f108b631ffa8165108fb14b81be5\n909196df72ba3f9e418379c184a435a7cad870e7\n8ef757ad7ed52c7da069124bbbb0aba3f793a109\n1e42150111e8347da68e7363c1545384609c62db\nEb71e2f83bfc3f30b7fbe132b6c8d07c363ffa23\n\n**Cluster 7**\n\n2bfc5c38fe25a095161716c17d4828348130ccc0\n1fa19f7cf4f37966e131df657dc84b9372fa4e4e\n1f9e7110a0b58072466c0d5bece253ea7e6f74e1\n\n\n-----\n\n1c10fe44429a1cf0b875aef63f61469006f59682\n0b55491e45c50bde473e84c329127945cb20133f\n\n**Cluster 8**\n\nBd34811e40ac4ac351ace6c117161904b2e08a12\nBc152b1054983a5db6361ce34e246f2fd36e8f82\nB528c29632b8e517fbfcf317711636b1b9b874a8\nB6a2634e82a206c8759616d5be4c6913400bf9ae\nB4b9a6efe0277c7bf7599291912b9ab2c3e171a5\n\n**Cluster 9**\n\n1953ac3dabc8affd223277564b4c0d9ac1332a9b\n\n**Cluster 10**\n\nF377028e7946a812948a5c7ba44e954c8fbdfe4a\nF1459d32a711cd5e3a33b31334be28ed5ef9ed3d\nDe942054e5a5b9b011acf04e3de492d951705b28\nD53200f073da1091fb7263644d8eec9c4d063b96\n\n**Cluster 11**\n\n68bcdbfd523c1288487178f0154a272eb316b0fb\n59c4702ac6d89d244dc40d56ec6c6491507da8c8\n51d1d14772d3087b426e74d91c977f33325c20e0\n11f71766d280e26763742573fae133a51dbbca8b\n8d15ea7926f2fcfeca8c2df4fc720d9fb428ca9e\n\n**Cluster 12**\n\n0339b41fe3dc92a1e95779cc5e3ac2b0fff0f48e\n198d3a4bc0b8af702a59cfab02f86476a5fcd5b0\n91e0eb52ff166781b795dda55ff76363d4146856\n89ae64f1a7db8dd4bd24daf587206c50c942d095\n87a87eb02940daa8a09e821d439a60e1ea01c039\n\nAbout\nLatest Posts\n\n\n-----\n\n## James Haughom\n\nJames Haughom is a Malware Reverse Engineer at Lastline.Prior to Lastline, James\nsupported Incident Response and Intel teams in the federal space as a contractor.This\nsupport included Malware Analysis/Reverse Engineering, DFIR, and Tool Development.\n\nAbout\nLatest Posts\n\n## Stefano Ortolani\n\nStefano Ortolani is Director of Threat Intelligence at Lastline. Prior to that he was part of the\nresearch team in Kaspersky Lab in charge of fostering operations with CERTs, governments,\nuniversities, and law enforcement agencies. Before that he earned his Ph.D. in Computer\nScience from the VU University Amsterdam.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-02 - Evolution of Excel 4.0 Macro Weaponization.pdf"
    ],
    "report_names": [
        "2020-06-02 - Evolution of Excel 4.0 Macro Weaponization.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535592,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653705210,
    "ts_modification_date": 1653705210,
    "files": {
        "pdf": "https://archive.orkl.eu/cf09de12b825e0c6e44dc6c6af63027e9979899e.pdf",
        "text": "https://archive.orkl.eu/cf09de12b825e0c6e44dc6c6af63027e9979899e.txt",
        "img": "https://archive.orkl.eu/cf09de12b825e0c6e44dc6c6af63027e9979899e.jpg"
    }
}