{
    "id": "44987920-e67f-49cd-a2e1-2e971bf49105",
    "created_at": "2023-01-12T15:10:39.432371Z",
    "updated_at": "2025-03-27T02:06:09.820314Z",
    "deleted_at": null,
    "sha1_hash": "ff7802fc5bb0990b27a733897a104a538b2b48ef",
    "title": "2021-07-09 - Dark Web User Known As “The Bull” Charged In Insider Trading Scheme",
    "authors": "",
    "file_creation_date": "2022-05-28T03:39:06Z",
    "file_modification_date": "2022-05-28T03:39:06Z",
    "file_size": 77758,
    "plain_text": "# Dark Web User Known As “The Bull” Charged In Insider Trading Scheme\n\n**[justice.gov/usao-sdny/pr/dark-web-user-known-bull-charged-insider-trading-scheme](https://www.justice.gov/usao-sdny/pr/dark-web-user-known-bull-charged-insider-trading-scheme)**\n\nJuly 9, 2021\n\nDepartment of Justice\n\nU.S. Attorney’s Office\n\nSouthern District of New York\n\nFOR IMMEDIATE RELEASE\n\nFriday, July 9, 2021\n\n## Apostolos Trovias, a/k/a “The Bull,” Used the Dark Web and Encrypted Messaging Services to Solicit, Offer, and Sell Inside Information\n\nAudrey Strauss, the United States Attorney for the Southern District of New York, and\nWilliam F. Sweeney Jr., Assistant Director-in-Charge of the New York Field Office of the\nFederal Bureau of Investigation (“FBI”), announced today the unsealing of a criminal\nindictment and a criminal complaint charging APOSTOLOS TROVIAS, a/k/a “The Bull,” with\nsecurities fraud and money laundering in connection with his scheme to solicit and sell stock\ntrading tips and pre-release earnings and deal information regarding public companies.\n\nManhattan U.S. Attorney Audrey Strauss said: “Today’s charges demonstrate our Office’s\ncontinuing commitment to stopping those who pursue and use inside information to gain an\nillegal edge in the stock market. As alleged, Apostolos Trovias attempted to hide his insider\n\n\n-----\n\ntrading scheme behind anonymizing software, screennames, and bitcoin payments. The\nIndictment and Complaint unsealed today show that committing insider trading using new\ntechnologies still produces a decidedly traditional outcome: a criminal indictment.”\n\nFBI Assistant Director William F. Sweeney Jr. said: “Behind the veil of the Dark Web, using\nencrypted messaging applications and emails, Trovias created a business model in which he\nsold—for profit—proprietary information from other companies, stock trading tips, pre-release\nearnings, and other inside information, as we allege. The FBI operates within the Dark Web\ntoo, and as Trovias learned today, we don't stop enforcing the law just because you commit\nfederal crimes from behind a router with your keyboard.”\n\nAccording to the allegations in the Indictment and Complaint unsealed today in Manhattan\nfederal court:[1]\n\nSince at least in or about December 2016, APOSTOLOS TROVIAS, who identifies himself by\nthe pseudonym “The Bull,” has used websites on the Dark Web and encrypted messaging\nservices to solicit and sell confidential, non-public information about publicly traded\ncompanies (“Inside Information”) to enrich himself. TROVIAS’s scheme consisted of multiple\nrelated efforts to obtain and monetize confidential nonpublic business information, including\n(1) the sale of misappropriated stock tips based on confidential customer trading information;\n(2) the sale of pre-release earnings reports and deal information misappropriated from\npublicly-traded companies; and (3) the attempted creation of an online marketplace to\nconnect, for a commission, individuals misappropriating Inside Information to individuals\nwilling to pay for and trade on Inside Information.\n\nFor example, between in or about December 2016, when he registered for a Dark Web site\nknown as AlphaBay Market, and in or about July 2017, when AlphaBay ceased operations,\nTROVIAS offered for sale and sold stock tips that were based on non-public inside\ninformation about certain securities issuers and which could be purchased individually, or as\nweekly or monthly subscriptions.\n\nAt various times between in or about June 2017 and February 2020, TROVIAS sold Inside\nInformation directly to purchasers, using encrypted messaging and email services to\ncommunicate about the sale, rather than exclusively through the marketplace features of the\nDark Web forums. For instance, TROVIAS offered for sale and did sell, among other\nconfidential information belonging to various securities issuers, for approximately $5,000 in\nBitcoin, at least one pre-release earnings report misappropriated from a publicly-traded\ncompany.\n\nIn or about 2020, TROVIAS also took steps to design and build a website to facilitate the\npurchase and sale of material, non-public information for use in stock trading (the “Inside\nInformation Auction Site”). TROVIAS planned to use the Inside Information Auction Site to\nenrich himself by charging membership fees and commissions from individuals using the\nInside Information Auction Site to engage in the unlawful trade of Inside Information.\n\n\n-----\n\nTROVIAS, 30, of Athens, Greece, is charged with one count of securities fraud and one\ncount of money laundering. The securities fraud count carries a maximum penalty of 25\nyears in prison. The money laundering count carries a maximum penalty of 20 years in\nprison. The maximum potential sentences in this case are prescribed by Congress and are\nprovided here for informational purposes only, as any sentencing of the defendant will be\ndetermined by the judge.\n\nMs. Strauss praised the outstanding work of the FBI. Ms. Strauss further thanked the U.S.\nSecurities and Exchange Commission, which today filed a parallel civil action, and the\nInternal Revenue Service for their cooperation and assistance in this investigation.\n\nThe prosecution of this case is being overseen by the Office’s Securities and Commodities\nFraud Task Force. Assistant U.S. Attorneys Matthew Podolsky and Andrew Thomas are in\ncharge of the case.\n\nThe charges contained in the Indictment and Complaint are merely accusations, and the\ndefendant is presumed innocent unless and until proven guilty.\n\n[1] As the introductory phrase signifies, the entirety of the text of the Indictment and\nComplaint, and the description of the Indictment and Complaint set forth herein, constitute\nonly allegations, and every fact described should be treated as an allegation.\n\nTopic(s):\n\nFinancial Fraud\n\nComponent(s):\n\n[USAO - New York, Southern](http://www.justice.gov/usao-sdny)\nContact:\n\nNicholas Biase, James Margolin (212) 637-2600\n\nPress Release Number:\n\n21-171\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-09 - Dark Web User Known As “The Bull” Charged In Insider Trading Scheme.pdf"
    ],
    "report_names": [
        "2021-07-09 - Dark Web User Known As “The Bull” Charged In Insider Trading Scheme.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536239,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653709146,
    "ts_modification_date": 1653709146,
    "files": {
        "pdf": "https://archive.orkl.eu/ff7802fc5bb0990b27a733897a104a538b2b48ef.pdf",
        "text": "https://archive.orkl.eu/ff7802fc5bb0990b27a733897a104a538b2b48ef.txt",
        "img": "https://archive.orkl.eu/ff7802fc5bb0990b27a733897a104a538b2b48ef.jpg"
    }
}