{
    "id": "449e8cc8-c59f-4ecd-ae6d-bc0c96be2768",
    "created_at": "2023-01-12T15:10:24.294162Z",
    "updated_at": "2025-03-27T02:05:40.306832Z",
    "deleted_at": null,
    "sha1_hash": "d6328025d4b34c8968d3cb42582a2c60ee212474",
    "title": "2021-01-20 - XDR investigation uncovers PlugX, unique technique in APT attack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:37:40Z",
    "file_modification_date": "2022-05-28T19:37:40Z",
    "file_size": 620646,
    "plain_text": "# Investigation into PlugX Uncovers Unique APT Technique\n\n**[trendmicro.com/en_us/research/21/a/xdr-investigation-uncovers-plugx-unique-technique-in-apt-attack.html](https://www.trendmicro.com/en_us/research/21/a/xdr-investigation-uncovers-plugx-unique-technique-in-apt-attack.html)**\n\nJanuary 20, 2021\n\n[Advanced persistent threats (APT) are known — and are universally dreaded — for their](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/advanced-persistent-threat#:~:text=Advanced%20persistent%20threat%20%5BAPT%5D%20is,found%20in%20the%20cybercriminal%20underground.)\nstealth. Actors behind such attacks actively innovate their techniques to evade detection and\nensure that they maintain a foothold inside an environment as long as possible. Through the\n[Apex One with Endpoint Sensor (iES), we discovered one such incident wherein an attacker](https://www.trendmicro.com/en_us/business/products/detection-response/xdr.html)\nutilized sophisticated techniques in an attempt to exfiltrate sensitive information from a\ncompany. The unique tactics, techniques, and procedures (TTPs) used in this attack\n[highlight the importance of cross-layered detection and response solutions.](https://www.trendmicro.com/en_us/what-is/xdr.html)\n\n## Technical analysis\n\n**Detection**\n\nWe noticed the execution of schtasks.exe with the command line parameter “schtasks\n_/create /tn <name> c:\\programdata\\<software name>\\<file name>.bat /sc /once /st <time> /ru_\n_<user account>”. The scheduled task was not created for persistence. The batch file that_\nwas to be executed had a suspicious name that stood out. This prompted us to dig deeper.\n\n**Evasion**\n\nThe image file of the process residing in the Windows directory that triggered the schtasks\ncommand was marked as normal. However, a quick check on VirusTotal showed that the\nfile's name and usual location differed from what was found in the victim machine.\n\n### PlugX and malicious BLOBs\n\nThe normal file loads a seemingly normal dynamic-link library (DLL) named after a common\nMicrosoft DLL. However, we saw that the hash of the DLL does not match any of the known\nhashes of a normal DLL.\n\n[Reversing the file revealed that it was the PlugX loader, a remote access tool (RAT) that has](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/PLUGX)\nbeen historically used in attacks targeting government-related industries and organizations.\nWe then observed that it decrypts, loads, and executes another DLL file named after another\nMicrosoft DLL file, but is actually an encrypted Binary Large Object (BLOB). Figure 1 below\nshows the relationship between these three files.\n\n\n-----\n\nFigure 1. The relationship between the normal file used, the PlugX, and the malicious BLOB\nDespite being around for quite some time, PlugX is still effective at evading detection. The\nvariant used in this attack has three parts:\n\n1. A normal file\n2. A DLL loader that the normal file expects to be present\n3. An encrypted BLOB file containing the malicious code\n\nOf the three, the loader would be the easiest to detect. However, because the file is so\nsimple and straightforward, it is easy for attackers to create multiple versions of the said file\nto evade detection.\n\nDetection support for the BLOB is probably low. Because of its being “free form,” detection\nengines would have a hard time parsing through its contents to find the malicious code which\npotentially made detection for EPPs and EDR difficult. Aside from this, changing the\nencryption mechanism or packer would result in a totally different BLOB. It should be noted\nthat we have also observed an increase use of BLOB files since 2020.\n\nThe malicious code would run in the address space of the normal file. This could allow the\nmalicious code to evade behavior-monitoring features as endpoint protection platforms\n(EPP) would see the process as normal. This is detailed in the next section.\n\n## A closer look at PlugX\n\n**_svchost injection_**\n\nThis variant of PlugX (detected by Trend Micro as Backdoor.Win32.PLUGX.DYSGUT),\nincluding the code in the BLOB, launches an svchost.exe process and injects to it. Usually,\n_svchost is launched by services.exe, so the action done by PlugX could be used as a trigger_\nfor investigation.\n\n\n-----\n\n_Svchost injection is not new — in fact,_ [Trickbot and other malware variants use this](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/group-behind-trickbot-spreads-fileless-bazarbackdoor)\ntechnique. The difference between Trickbot and PlugX is that Trickbot is much easier to\ndetect. Trickbot’s binary, which is not whitelisted, does the injection; in PlugX’s case, a\nnormal process that is possibly whitelisted, does the injection. It is possible for EPP\nbehavior-monitoring features to allow the action of the whitelisted process to go through. This\ngives the attacker access to a RAT running inside a normal process.\n\n**A unique way of launching tools**\n\nOur investigation shows that the attacker used other tools during the attack. The tools used\nvaried from network scanners to account harvesters. The simplest way of using these tools is\nto have the injected code in svchost download, drop, and execute the tools.\n\nFigure 2. A straightforward approach to launching a malicious tool\nThe approach above, although simple, could potentially generate a lot of suspicious\ntelemetry events – svchost.exe suddenly launching an unknown application could trigger\nalerts. To avoid this, the attacker chose a different approach. For every tool that needs to be\nrun, it creates three things:\n\n1. The auxiliary tool file\n2. <filename>.bat file\n3. Cmd.exe with a schtasks.exe command to create a scheduled task to run the batch file\n\nabove\n\nInstead of directly launching the auxiliary tool, it makes use of a scheduled task that runs the\nbatch file that, in turn, executes the tool.\n\nThe attacker’s usage of a tool can be divided into two separate events: the dropping of the\ntool by the svchost.exe process that runs the malicious code and the execution of the tool via\nthe scheduled task.\n\n\n-----\n\nFigure 3. A diagram showing the dropping of the auxiliary tool\nIf the creation of the tool, batch file, and scheduled task is disregarded, it would seem that\nthere is no connection between PlugX and the execution of the auxiliary tool. However, a\ndeeper investigation proved otherwise.\n\n\n-----\n\nFigure 4. Launching the auxiliary tool via the scheduled task\nScheduled tasks are usually associated with persistence or privilege escalation, which is not\nthe case in this incident. Having the scheduled task run only once removes the notion of\npersistence. Meanwhile, having the same user account launch the PlugX process and the\nauxiliary tool shows that the scheduled task is not for privilege escalation. One possible\nreason why the attacker chose this technique is to make analysis and forensics, such as via\nEDR, more difficult.\n\nThe disjoint between the dropping and the execution of the auxiliary tool might cause\nproblems in EDR's rendering of RCA graphs, specifically in providing important information\nabout the attack. Security analysts will have to rely on telemetry data to provide a more\ncomplete picture of said attack.\n\nIn this incident, the attacker used a specific tool to gather information kept by the\norganization. However, the attacker was able to delete it before we were able to get our\nhands on the tools used for investigation purposes. An analysis of these tools could be used\nto better understand what is happening or what has happened in the environment. Whenever\na tool is used, the attacker deletes it from the disk as soon as it has done its purpose – which\nusually does not last for more than 15 minutes. This means that acquiring the tools used\nwould be more difficult. For the attacker, immediately deleting the tool once it performs its\nintended purpose means being able to extend its shelf life.\n\n## What enterprises and organizations should look out for\n\nIn incidents like this, wherein the attacker makes sure that the tools used are not detected,\nthreat hunting is a good weapon to have for defense. Sifting through suspicious events and\ntrying to piece them together to understand what has transpired could help identify such\nattacks.\n\nBased on our investigation of this specific attack, we provide helpful tips for enterprises and\norganizations to spot PlugX and lateral movement in their environments.\n\n**How to identify PlugX**\n\n\n-----\n\nPlugX s use of a normal file makes it hard for antivirus (AV) or EPP to detect it. Threat\nhunters can use this to possibly identify other machines that have PlugX installed: Using\nattributes that could identify the normal file, such as the hash and the digital signer, a\nsweeping task could be carried out to identify instances of the normal file. Chances are, the\nnormal file that loads the rest of PlugX uses a file name that is different from what it normally\nuses or is in a location where it is not usually found. For example, Microsoft’s outlook.exe is\nusually found in the Program Files directory. Finding a normal outlook.exe in the Windows\ndirectory makes it suspicious. Finding such entries that stand out could help identify how\nwide the infection is.\n\n**How to spot lateral movement**\n\nIn this particular attack, we observed that to perform lateral movement, the attacker mapped\nWindows admin shares and used remotely created scheduled tasks to launch malware. Both\nevents never or rarely happened in the victim’s environment.\n\n### The importance of looking into anomalous events\n\nWhen identifying PlugX and lateral movement techniques utilized in attacks, it’s important to\nbe able to determine anomalous events. It was relatively easy for us to flag the events\nrelated to the breach because they were anomalies; after looking into these anomalies, we\nwere able to map them out to known techniques that attackers previously used. Keeping an\neye on anomalous events could help detect incidents earlier. In order to have effective\nvisibility and correlation at all times, enterprises need to have an integrated view of all of their\ninterconnected security solutions. Automated protection and efficient threat hunting,\n[investigation, and response, such as that provided by Trend Micro XDR, will help ensure that](https://www.trendmicro.com/en_us/business/products/detection-response/managed-xdr-mdr.html)\nenterprises are secured from advanced threats.\n\n## Trend Micro Solutions\n\n[Trend Micro’s comprehensive XDR solution applies the most effective expert analytics to the](https://www.trendmicro.com/en_us/business/products/detection-response/managed-xdr-mdr.html)\ndeep data sets collected from Trend Micro solutions across the enterprise — including email,\nendpoints, servers, cloud workloads, and networks — making faster connections to identify\nand stop attacks. Powerful artificial intelligence (AI) and expert security analytics correlate\ndata from customer environments and Trend Micro’s global threat intelligence to deliver\nfewer, higher-fidelity alerts, leading to better, early detection. One console with one source of\nprioritized, optimized alerts supported with guided investigation simplifies the steps needed\nto fully understand the attack path and impact on the organization.\n\nAPT & Targeted Attacks\n\nThrough the Apex One with Endpoint Sensor (iES), we discovered an APT attack wherein an\nattacker utilized sophisticated techniques in an attempt to exfiltrate sensitive information from\na company.\n\n\n-----\n\nBy: Gilbert Sison, Abraham Camba, Ryan Maglaque January 20, 2021 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-20 - XDR investigation uncovers PlugX, unique technique in APT attack.pdf"
    ],
    "report_names": [
        "2021-01-20 - XDR investigation uncovers PlugX, unique technique in APT attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536224,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653766660,
    "ts_modification_date": 1653766660,
    "files": {
        "pdf": "https://archive.orkl.eu/d6328025d4b34c8968d3cb42582a2c60ee212474.pdf",
        "text": "https://archive.orkl.eu/d6328025d4b34c8968d3cb42582a2c60ee212474.txt",
        "img": "https://archive.orkl.eu/d6328025d4b34c8968d3cb42582a2c60ee212474.jpg"
    }
}