{
    "id": "44bc7efd-1869-4f1b-9449-80800ee5361f",
    "created_at": "2023-01-12T15:08:29.014045Z",
    "updated_at": "2025-03-27T02:05:39.355387Z",
    "deleted_at": null,
    "sha1_hash": "70078208f05ee6c46e42c3637548bdd29e780c97",
    "title": "2017-01-18 - Flashback Wednesday- Pakistani Brain",
    "authors": "",
    "file_creation_date": "2022-05-28T00:25:24Z",
    "file_modification_date": "2022-05-28T00:25:24Z",
    "file_size": 156401,
    "plain_text": "# Flashback Wednesday: Pakistani Brain\n\n**[welivesecurity.com/2017/01/18/flashback-wednesday-pakistani-brain/](https://www.welivesecurity.com/2017/01/18/flashback-wednesday-pakistani-brain/)**\n\nJanuary 18, 2017\n\nThis month’s Flashback Wednesday takes us back to the beginning. Pakistani Brain,\ndiscovered on January 19th, is considered to be the first-ever PC virus.\n\n[Editor](https://www.welivesecurity.com/author/editorla/)\n18 Jan 2017 - 02:00PM\n\nThis month’s Flashback Wednesday takes us back to the beginning. Pakistani Brain,\ndiscovered on January 19th, is considered to be the first-ever PC virus.\n\n\n-----\n\nIn the early 1980s, with computer technology in its relative infancy and worldwide internet\naccess a distant dream, the idea that computers sitting benign and beige on work desks\ncould become infected with a virus was still, by and large, the stuff of science fiction.\n\nWhilst there had been early versions of what we’d now term a virus, for example, Elk\nCloner, written for Apple in 1981, they weren’t the kind of malicious constructs with which\nwe are now all-too-familiar.\n\nIt was against this background that users who had purchased software developed by a\nPakistan-based company innocently inserted now archaic floppy disks containing medical\nsoftware into their PCs, but found they had installed more than they bargained for. And what\nhappened on January 19th, 1986, changed the world of computing forever.\n\n## A new attack\n\nThe software, which quietly installed itself onto diskettes, was developed by two brothers\nBasit and Amjad Farooq Alvi from Lahore (while this is accepted wisdom, other experts\n[have questioned this). This boot sector virus is generally now regarded as the first PC virus,](http://news.bbc.co.uk/1/hi/technology/4630910.stm)\nnamed Brain after the company the brothers ran (and indeed still run).\n\n## Motivation\n\nBut what made these software developers want to create something like this? Surprisingly,\nit was protection rather than attack that was foremost on their mind when developing the\nprogram (although, as some researchers argue, it doesn’t really act as a software protection\nscheme).\n\nWorried that their software was being unfairly/immorally copied, they wrote a program that\nthey hoped would secure their software. Ironically, in trying to protect themselves – as the\nbrothers claim – they unwittingly attacked the PCs of others. Again, it’s important to note\nthat this is the story put forward by the Alvi brothers – it could easily have been retaliatory,\nto punish software pirates.\n\n## Experimentation\n\n[Speaking in a documentary in 2011, Amjad Farooq Alvi explained that the idea also came](https://www.youtube.com/watch?v=WwKN6iDR_LM)\nabout due to intellectual curiosity. “We were experimenting with a few things. One thing was\nwhether in DOS we can have multitasking,” he said.\n\nThey were also interested in exploring the security of the then-new operating system. “The\nDOS was something new and when we explored the security issues of DOS [we] realized it\nwas possible [to infiltrate] it with a piece of code.”\n\n\n-----\n\nFinally, the brothers were interested in seeing how widely their software was being used.\n“[We wanted] to find out how the floppies and how the programs and software move\naround,” explained Alvi. “We [could] see and watch whether it’s going to spread around the\nworld or remain within a certain group of people.”\n\n## A runaway success\n\nUnfortunately, the software written by the brothers ended up being rather too successful.\nThe virus spread – to other floppies – and many users, worried by the message that popped\nup on their screens, contacted the brothers – they had, after all, included their contact\ndetails in the display message.\n\n## Influential\n\nLike many clever concepts, the ideas behind the software were eagerly gobbled up by\nthose looking to enhance – and show off – their computing skills. Copycat viruses were\ndeveloped, but initially, these were not intended to be malicious.\n\nIt would not be until the turn of the 21st century that the criminalization of malware really\nbegan to take shape (here’s an [interesting paper from 2012, by ESET’s Aryeh Goretsky,](http://www.welivesecurity.com/media_files/white-papers/EsetWP-20YearsBeforeTheMouse.pdf)\nthat looks back at the early days of computer viruses and contextualizes them with today’s\nthreats).\n\n## Inevitable\n\nWith the concept of a computer virus proposed as early as the 1940s, it is likely that without\nBrain and its predecessors, viruses would have sprung forth regardless, from a different\nsource. So whilst the infiltration of DOS was big news in many ways, the virus was simply a\nstep in an inevitable process.\n\n## A new world\n\nComputer viruses as we know them today flourish via the internet, which enabled viruses to\nspread more subtly without the insertion of a disk or other external devices. But back in the\n1980s, Brain gave us a glimpse into a world full of possibilities, both exciting and rather\nmore sinister.\n\n18 Jan 2017 - 02:00PM\n\n## Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n\n-----\n\n## Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-18 - Flashback Wednesday- Pakistani Brain.pdf"
    ],
    "report_names": [
        "2017-01-18 - Flashback Wednesday- Pakistani Brain.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536109,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653697524,
    "ts_modification_date": 1653697524,
    "files": {
        "pdf": "https://archive.orkl.eu/70078208f05ee6c46e42c3637548bdd29e780c97.pdf",
        "text": "https://archive.orkl.eu/70078208f05ee6c46e42c3637548bdd29e780c97.txt",
        "img": "https://archive.orkl.eu/70078208f05ee6c46e42c3637548bdd29e780c97.jpg"
    }
}