{
    "id": "44bf8166-2bdf-4299-8aec-321eaff677d5",
    "created_at": "2023-01-12T15:04:52.5903Z",
    "updated_at": "2025-03-27T02:09:18.079081Z",
    "deleted_at": null,
    "sha1_hash": "5d3c7aaa96f7f20f0899590d4a38473a7ed59f18",
    "title": "2021-03-18 - Cobalt Strike – Post-Exploitation Attackers Toolkit",
    "authors": "",
    "file_creation_date": "2022-05-28T02:08:33Z",
    "file_modification_date": "2022-05-28T02:08:33Z",
    "file_size": 156019,
    "plain_text": "# Cobalt Strike – Post-Exploitation Attackers Toolkit\n\n**[deepinstinct.com/2021/03/18/cobalt-strike-post-exploitation-attackers-toolkit/](https://www.deepinstinct.com/2021/03/18/cobalt-strike-post-exploitation-attackers-toolkit/)**\n\nMarch 18, 2021\n\n## 100% Prevention Score in the 2022 MITRE ATT&CK Evaluation for\n Enterprise\n\n[Learn more](https://www.deepinstinct.com/news/deep-instinct-shows-100-percent-score-in-mitre-evaluations)\n\nMarch 18, 2021 | [Ben Gross](https://www.deepinstinct.com/author/ben-gross)\n\n**Introduction to the Framework**\n\n[Cobalt Strike (CS) is a paid penetration testing toolkit that allows an attacker to deploy a](https://www.cobaltstrike.com/)\ncomponent named Beacon on a victim’s machine. The simplicity, reliability, and versatility of\nCS make it very popular among threat actors—and there are plenty of cracked versions of\nCS available on the dark web[1]. Given this reality, it’s been used frequently in recent cyberattacks[2].\n\n\n-----\n\nCS provides a wealth of functionality to the attacker, including command execution, key\nlogging[3], file transfer, privilege escalation, port scanning, lateral movement, and more. The\nframework is split into two components: client and server. The server module, aka team\nserver, is the controller of the Beacon payload. By using this module the attacker can track\nand execute commands on an infected host and utilize all of the framework capabilities.\n\n**Cobalt Strike Beacon**\n\nThe Beacon, which is the main component being used to target accounts, allows its\noperators to execute commands, log keystrokes, drop files, and communicate with targeted\nsystems. CS is primarily used as a post-exploitation tool; leveraged by attackers after they\nhave a foothold in a system and want to remain hidden.\n\nDeploying a Beacon and making sure its communication will stay hidden from cybersecurity\nproducts and teams is a critical task for adversaries. The Beacon has several communication\nmethods[4] to make this happen, including HTTP, HTTPS, DNS, and SMB. By default, the\nBeacon will reach out to its C2 periodically, sending meta-data back and gathering any\ncommands issued by the operator. The Beacon console allows the attacker to monitor which\ntasks were issued to a Beacon and track their status, check the output of commands, and\nfind additional information on targets.\n\n**How Attackers Use Cobalt Strike**\n\nEven though CS is a paid penetration testing product, it is incredibly popular due to its wealth\nof capabilities and its ability to add new features and modify existing ones. This flexibility\nallows attackers to implement their own tools, use built-in tools, or integrate other penetration\ntesting tools such as the [Metasploit framework and Mimikatz. By design the main use of CS](https://www.metasploit.com/)\nis to act as a post-exploitation tool that allows attackers to gather information, harvest\ncredentials, and deploy other payloads on an infected host. That also means that is not\ndesigned to gain initial access to a system, even though it does have components that can\nhelp to gain access such as its VBA macros and Windows-executable generators.\n\nCS provides the attacker a wide set of tools; we will cover some of the framework capabilities\nfrom an attack-chain point of view. The full list of capabilities is available in the MITRE\nmatrix[5].\n\n**Initial Access**\n\n**System Profiler: A honeypot used as a reconnaissance tool to collect information**\nabout a target. It is designed to collect information on systems or users that visit CScontrolled servers and provide a list of applications and plug-ins discovered (it is not\ndesigned to infect a host).\n**MS-Macros Generator: CS can generate VBA code to embed in Office documents.**\n\n\n-----\n\n**Website Clone Tool: This tool can create a local copy of a website with some code**\nadded to fix links and images so they work as they should. An attacker can lure a victim\nto enter the cloned website to collect information about the victim’s network.\n**Windows Loaders and Payload Generator: CS can generate a Windows executable,**\na script (e.g., PowerShell, HTA), or a raw blob of position-independent code that\ncontains a Beacon. CS provides an internal kit for building shellcode and executables.\nThe kit can be easily modified to suit attacker’s needs.\n**Phishing: The CS phishing module helps an attacker replace links and text to build a**\nconvincing phish in an email template, which it can send to multiple recipients and track\nwho entered them. This module can be used along with the website clone tool to lure a\nvictim into CS-owned websites.\n\n**Privilege Escalation and Lateral Movement**\n\n**Mimikatz: An open-source tool that allows users to view and save credentials, extract**\nplaintext passwords, hash, PIN codes, and Kerberos tickets from the systems memory.\nMimikatz is fully supported in CS. Attackers can run and execute Mimikatz commands\ndirectly from the CS command-line interface.\n**User-Account-Contraol (UAC) Bypass[6]: CS can bypass UAC by utilizing a method**\ncalled reflective DLL injection.\n**Antimalware Scan Interface (AMSI) Bypass: CS can bypass AMSI by patching OS**\nfunctions that limit AMSI’s capabilities.\n\n**Commands Execution**\n\n**Aggressor Script: CS has its own scripting language which allows its users to modify**\nand extend the Beacons functionality.\n**Running Commands: CS uses a command-line interface to interact with infected**\nsystems. The commands may run via cmd.exe[7], powershell.exe[8], psinject[9],\nPowerpick[10], and more.\n**Native API[11]: Beacon can run shell commands without cmd.exe or powershell.exe by**\n[directly calling the OS API functions or by using Powerpick, which is a program that](https://github.com/PowerShellEmpire/PowerTools/tree/master/PowerPick)\nallows the execution of Powershell without the use of Powershell.exe.\n\n**Command and Control Communication**\n\n**Web Protocols: CS uses its own command-and-control communication protocol that**\ncan be encapsulated by HTTP/HTTPS/DNS.\n**SMB (Server Message Block): CS can conduct P2P communication over Windows-**\nnamed pipes encapsulated in the SMB protocol.\n\n**Protection from Cobalt Strike**\n\n\n-----\n\nDeep Instinct prevents the CS framework and its components at all attack stages. The first\npossible attack vector is loaders. Whether they are Windows executables or Office\ndocuments, we prevent them and stop the attack chain at the earliest possible stage by\nusing Deep-Learning based static analysis.\n\nIn the event that an attacker has already gained access into a victim’s system and is trying to\ndeploy a Beacon, our behavioral capabilities can spot in-memory actions such as DLL\ninjection and shellcode execution and prevent these post-exploitation attempts from running.\nIn addition, our PowerShell Deep Learning-based static analysis and behavioral analysis will\nprevent all malicious PowerShell activities.\n\n**Summary**\n\nCobalt Strike is a paid penetration testing product that is in continual development and its\nteam builds the framework with the most advanced and up-to-date security features and\ncapabilities. Since CS is being used by both security teams and threat actors for the same\npurposes it poses a serious and ongoing threat for security products, organizations, and\nindividuals.\n\nUsing our advanced Deep Learning-based static analysis and behavioral capabilities,\ncustomers of Deep Instinct can be rest assured that they have protection against Cobalt\nStrike and its capabilities as the attack is detected and prevented in a matter of milliseconds.\n\n[To see our capabilities for yourself, request a demo via our contact us form.](https://www.deepinstinct.com/contact-us/)\n\n---------------------------------------\n[1] https://www.bleepingcomputer.com/news/security/alleged-source-code-of-cobalt-striketoolkit-shared-online/\n\n[2] https://www.bleepingcomputer.com/news/security/solarwinds-hackers-used-7-zip-code-tohide-raindrop-cobalt-strike-loader/\n\n[3] https://attack.mitre.org/techniques/T1056/001\n\n[4] https://attack.mitre.org/techniques/T1071/001/\n\n[5] [https://attack.mitre.org/software/S0154/](https://attack.mitre.org/software/S0154/)\n\n[6] https://attack.mitre.org/techniques/T1548/002/\n\n[7] https://attack.mitre.org/techniques/T1059/003/\n\n[8] https://attack.mitre.org/techniques/T1059/001\n\n[9] https://github.com/EmpireProject/PSInject\n\n\n-----\n\n[10] https://github.com/PowerShellEmpire/PowerTools/tree/master/PowerPick\n\n[11] https://attack.mitre.org/techniques/T1106\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-18 - Cobalt Strike – Post-Exploitation Attackers Toolkit.pdf"
    ],
    "report_names": [
        "2021-03-18 - Cobalt Strike – Post-Exploitation Attackers Toolkit.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535892,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653703713,
    "ts_modification_date": 1653703713,
    "files": {
        "pdf": "https://archive.orkl.eu/5d3c7aaa96f7f20f0899590d4a38473a7ed59f18.pdf",
        "text": "https://archive.orkl.eu/5d3c7aaa96f7f20f0899590d4a38473a7ed59f18.txt",
        "img": "https://archive.orkl.eu/5d3c7aaa96f7f20f0899590d4a38473a7ed59f18.jpg"
    }
}