{
    "id": "44d81c85-0b0c-433b-ad46-5b0d66b7ddf5",
    "created_at": "2023-01-12T15:01:00.312814Z",
    "updated_at": "2025-03-27T02:10:18.334125Z",
    "deleted_at": null,
    "sha1_hash": "a2d1a9d5f01bad8ce47c4a734e82a47372e6a7bb",
    "title": "2010-08-25 - Military Computer Attack Confirmed",
    "authors": "",
    "file_creation_date": "2022-05-28T04:01:46Z",
    "file_modification_date": "2022-05-28T04:01:46Z",
    "file_size": 76098,
    "plain_text": "# Military Computer Attack Confirmed\n\n**nytimes.com/2010/08/26/technology/26cyber.html**\n\nBrian Knowlton August 25, 2010\n\nContinue reading the main story\nWASHINGTON — A top Pentagon official has confirmed a previously classified incident that\nhe describes as “the most significant breach of U.S. military computers ever,” a 2008 episode\nin which a foreign intelligence agent used a flash drive to infect computers, including those\nused by the Central Command in overseeing combat zones in Iraq and Afghanistan.\n\nPlugging the cigarette-lighter-sized flash drive into an American military laptop at a base in\nthe Middle East amounted to “a digital beachhead, from which data could be transferred to\nservers under foreign control,” according to William J. Lynn 3d, deputy secretary of defense,\n[writing in the latest issue of the journal Foreign Affairs.](http://www.foreignaffairs.com/articles/66552/william-j-lynn-iii/defending-a-new-domain)\n\n“It was a network administrator’s worst fear: a rogue program operating silently, poised to\ndeliver operational plans into the hands of an unknown adversary,” Mr. Lynn wrote.\n\n[The incident was first reported in November 2008 by the Danger Room blog of Wired](http://www.wired.com/dangerroom/2008/11/army-bans-usb-d/)\n[magazine, and then in greater detail by The Los Angeles Times, which said that the matter](http://articles.latimes.com/2008/nov/28/nation/na-cyberattack28)\nwas sufficiently grave that President George W. Bush was briefed on it. The newspaper\nmentioned suspicions of Russian involvement.\n\n\n-----\n\nBut Mr. Lynn s article was the first official confirmation. He also put a name — Operation\nBuckshot Yankee — to the Pentagon operation to counter the attack, and said that the\nepisode “marked a turning point in U.S. cyber-defense strategy.” In an early step, the\nDefense Department banned the use of portable flash drives with its computers, though it\nlater modified the ban.\n\nMr. Lynn described the extraordinary difficulty of protecting military digital communications\nover a web of 15,000 networks and 7 million computing devices in dozens of countries\nagainst farflung adversaries who, with modest means and a reasonable degree of ingenuity,\ncan inflict outsized damage. Traditional notions of deterrence do not apply.\n\n“A dozen determined computer programmers can, if they find a vulnerability to exploit,\nthreaten the United States’s global logistics network, steal its operational plans, blind its\nintelligence capabilities or hinder its ability to deliver weapons on target,” he wrote.\n\nSecurity officials also face the problem of counterfeit hardware that may have remotely\noperated “kill switches” or “back doors” built in to allow manipulation from afar, as well as the\nproblem of software with rogue code meant to cause sudden malfunctions.\n\nAgainst the array of threats, Mr. Lynn said, the National Security Agency had pioneered\nsystems — “part sensor, part sentry, part sharpshooter” — that are meant to automatically\ncounter intrusions in real time.\n\nHis article appeared intended partly to raise awareness of the threat to United States\ncybersecurity — “the frequency and sophistication of intrusions into U.S. military networks\nhave increased exponentially,” he wrote — and partly to make the case for a larger Pentagon\nrole in cyberdefense.\n\nVarious efforts at cyberdefense by the military have been drawn under a single organization,\nthe U.S. Cyber Command, which began operations in late May at Fort Meade, Maryland,\nunder a four-star general, Keith B. Alexander.\n\nBut under proposed legislation, the Department of Homeland Security would take the leading\nrole in the defense of civilian systems.\n\nThough the Cyber Command has greater capabilities, the military operates within the United\nStates only if ordered to do so by the president.\n\nAnother concern is whether the Pentagon, or government in general, has the nimbleness for\nsuch work. Mr. Lynn acknowledged that “it takes the Pentagon 81 months to make a new\ncomputer system operational after it is first funded.” By contrast, he noted, “the iPhone was\ndeveloped in 24 months.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-08-25 - Military Computer Attack Confirmed.pdf"
    ],
    "report_names": [
        "2010-08-25 - Military Computer Attack Confirmed.pdf"
    ],
    "threat_actors": [
        {
            "id": "a13b5ca4-fb52-44a9-aa5a-595eca6789ed",
            "created_at": "2022-10-25T15:50:23.4331Z",
            "updated_at": "2025-03-27T02:00:55.46701Z",
            "deleted_at": null,
            "main_name": "Sharpshooter",
            "aliases": [
                "Sharpshooter"
            ],
            "source_name": "MITRE:Sharpshooter",
            "tools": [
                "Rising Sun"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535660,
    "ts_updated_at": 1743041418,
    "ts_creation_date": 1653710506,
    "ts_modification_date": 1653710506,
    "files": {
        "pdf": "https://archive.orkl.eu/a2d1a9d5f01bad8ce47c4a734e82a47372e6a7bb.pdf",
        "text": "https://archive.orkl.eu/a2d1a9d5f01bad8ce47c4a734e82a47372e6a7bb.txt",
        "img": "https://archive.orkl.eu/a2d1a9d5f01bad8ce47c4a734e82a47372e6a7bb.jpg"
    }
}