{
    "id": "451f2c38-d725-4883-ad32-4ad337664a3b",
    "created_at": "2023-01-12T15:03:46.552933Z",
    "updated_at": "2025-03-27T02:16:25.618019Z",
    "deleted_at": null,
    "sha1_hash": "c57555d394bfb3fb6bff17e05989fac52cd25d04",
    "title": "2021-09-17 - Scamdemic outbreak Scammers attack users in Middle Eastern countries",
    "authors": "",
    "file_creation_date": "2022-05-28T04:07:19Z",
    "file_modification_date": "2022-05-28T04:07:19Z",
    "file_size": 3090734,
    "plain_text": "# Scamdemic outbreak\n\n**blog.group-ib.com/middle-east-scam**\n\n17.09.2021\n\nScammers attack users in Middle Eastern countries\n\nYakov Kravtsov\n\nHead of Digital Risk Research team\n\n\n-----\n\nEvgeny Egorov\n\nLead Digital Risk Protection analyst\n\n**Introduction**\n\nIn spring 2021, Group-IB Digital Risk Protection (DRP) analysts identified a fraud scheme\ntargeting users in Arabic-speaking countries. As part of their attacks, the threat actors\nabused more than 130 well-known brands worldwide from sectors such as\ntelecommunications, retail, entertainment, and etc.\n\nIn total, Group-IB analysts discovered more than 4,300 fraudulent pages created on\n**Blogspot, a popular blogging service. The webpages were all registered by a group that**\nincluded more than 100 accounts.\n\nThe scammers used a tried-and-tested scheme involving giveaways supposedly by popular\nbrands, lottery games purporting to be recommended by celebrities, and fake job offers from\nthe government. The threat actors used such lures to steal personal data or attract traffic to\nother fraudulent websites. More than 500,000 people per month visit the end websites\ninvolved in the scheme.\n**How the scheme works**\n\nUsers fall victim to the schemes by agreeing to take part in a promotion supposedly\norganized by a famous brand, a government organization, or a celebrity. Victims are\npromised they could win a prize or money, play the \"wheel of fortune\", or get a job by\ncompleting a survey.\n\n\n-----\n\n_A WhatsApp message with links to fraudulent blogs_\n\nVictims may be asked to enter their full names, phone numbers, places of residence,\neducation details, and desired place of work.\n\nRegardless of the answers or where the wheel of fortune stops, victims become \"winners.\"\nAfter completing the survey or playing the wheel of fortune, victims are asked to share the\nlink to the website or a similar one with a lottery game with 5-20 WhatsApp contacts. The\nscammers do so to widen the pool of their potential victims.\n\nAfter the victim sends the required number of messages, they are redirected to another\nfraudulent resource: other lottery games, scam dating websites, and websites with fake\nbrowser extension installations. In the worst-case scenario, victims may end up on a\nmalicious or phishing website.\n\n\n-----\n\n_Fraudulent Blogspot page where the victim is asked to share the lottery game with their_\n_WhatsApp contacts_\n\nTelecommunications companies have been the main target for threat actors. Fraudsters have\nabused at least 47 telecom brands as part of their scheme. In addition to the\ntelecommunications sector, brands in the retail, entertainment and automotive sectors have\nbeen affected.\n\n\n-----\n\n_Affected industries_\n\nIn addition to company brands, scammers abused personal brands of public figures,\nespecially the Saudi royal family.\n\nThe fraudulent campaign targeted 16 Arabic-speaking countries: Saudi Arabia, Kuwait,\n**Jordan, Sudan, Morocco, Egypt, Bahrain, Iraq, Yemen, Palestine, the United Arab**\n**Emirates (UAE), Algeria, Lebanon, Qatar, Syria, and Oman. The attack also targeted**\nEnglish-speaking users from Turkey and Nigeria.\n\n\n-----\n\nThe fraudsters did not always use popular brands or celebrities on their websites. Group-IB\nDRP specialists also discovered fake dating websites and fake lottery games.\n\nTo lure users to scam websites, the fraudsters sent bulk WhatsApp messages and used popup windows and Google Ads. The first Blogspot account related to the fraudster group was\nregistered in August 2013. Account registrations peaked in 2018 and the threat actors\ncontinued creating new accounts in 2019 and 2020. To this day, on some of the accounts the\nfraudsters continue to create fraudulent pages that abuse many brands.\n\n**How the threat group operates**\n\nUsing Blogspot service as part of their schemes is typical for the threat group in question.\n\n\n-----\n\n-----\n\n_Fraudulent Blogspot page where victims are asked to share a link to the survey with their_\n_WhatsApp contacts_\n\nIn addition to registering fake pages that mimic the websites of well-known brands, the\nscammers use Blogspot as a data storage space or a content delivery network (CDN) to\nstore media content and webpage code. In some cases, such data is uploaded to individual\ndomains, which allows the fraudsters to save on hosting services.\n\nThe scammers can also use Blogspot as a link shortening service and redirect users to\nfraudulent domains. Search engines consider such links safe and do not show any warnings\nabout the website being potentially dangerous.\n\nIt is difficult to detect the page from which visitors are redirected, especially when it comes to\nregular users, because the redirection is instant and users simply do not notice that they\nhave been redirected.\n\n_How fraudulent Blogspot pages work_\n\n**Attack attribution**\n\nFinding links between elements of the fraudster group's infrastructure is relatively easy. In\naddition to identical names (51.9% of the profiles had \"od.company\" in their names), the\nregistered accounts interlink each other and use the same servers, groups of domains, and\nlinks for sharing on WhatsApp. All the above factors mean that it is highly likely that the\nprofiles belong to a single threat group.\n\nThe diagram below shows a high-level example of grouping these accounts by traffic source,\nGoogle statistics, and connections between domains.\n\n\n-----\n\nThe threat group uses more than 100 accounts, and that number keeps growing. For\ninstance, over the first six months of this year, we have observed a 54% surge in the number\nof pages on these accounts. The earliest accounts related to the threat group were\nregistered in 2013, which is surprising because fraudulent pages are usually active for no\nlonger than a few months. Yet this group has been operating for at least six years.\n\nIn addition to Blogspot, the threat group uses many other tools, including social media ads\nand mass messaging in messaging apps.\n\n\n-----\n\n**How to avoid falling victim to fraud**\n\n1. Be cautious while following links that allegedly lead to the website of a specific\n\ncompany, a celebrity or a state agency and trust links from the official resources only —\nverified accounts on social media or messengers.\n2. Enter confidential data and bank card details on trusted websites only.\n3. When visiting links relating to offers by companies shared in messaging apps or on\n\nsocial media, check the domain names. Fraudsters usually use domain names that\nsound similar to brand names.\n4. Verify the information about promotions and giveaways on the official accounts of\n\nbrands, state agencies or celebrities.\n\n**Recommendation for rightsholders**\n\n\n-----\n\n1. Monitor and analyze complaints of the company s customers who fell victim to\n\nscammers.\n2. Monitor online resources to promptly detect the illegal use of the company's name or\n\ntrademark.\n3. To prevent the illegal use of your intellectual property assets, use Digital Risk\n\nProtection (DRP) solutions that help promptly detect threats to a specific brand in the\nonline space and then send them for blockage.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-17 - Scamdemic outbreak Scammers attack users in Middle Eastern countries.pdf"
    ],
    "report_names": [
        "2021-09-17 - Scamdemic outbreak Scammers attack users in Middle Eastern countries.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535826,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653710839,
    "ts_modification_date": 1653710839,
    "files": {
        "pdf": "https://archive.orkl.eu/c57555d394bfb3fb6bff17e05989fac52cd25d04.pdf",
        "text": "https://archive.orkl.eu/c57555d394bfb3fb6bff17e05989fac52cd25d04.txt",
        "img": "https://archive.orkl.eu/c57555d394bfb3fb6bff17e05989fac52cd25d04.jpg"
    }
}