{
    "id": "45a0973e-7d17-4fb5-9cd6-34b6f0aaf5a3",
    "created_at": "2023-05-06T02:09:39.775998Z",
    "updated_at": "2025-03-27T02:06:00.242338Z",
    "deleted_at": null,
    "sha1_hash": "cb7494e81f0512b9d648bd0123561feb173c3020",
    "title": "2023-03-06 - Private Malware for Sale- A Closer Look at AresLoader",
    "authors": "",
    "file_creation_date": "2023-05-05T01:50:23Z",
    "file_modification_date": "2023-05-05T01:50:23Z",
    "file_size": 188181,
    "plain_text": "# Private Malware for Sale: A Closer Look at AresLoader\n\n**flashpoint.io/blog/private-malware-for-sale-aresloader/**\n\nMarch 6, 2023\n\n## A new private loader for sale\n\nIn December 2022, a private loader named “AresLoader” was advertised for sale on the toptier Russian-language hacking forum XSS by a threat actor going by the name “DarkBLUP”.\nThe seller claimed that they were selling access to the malware for $300 per month and were\nonly issuing ten licenses at a time.\n\nAccording to DarkBLUP, AresLoader is designed to camouflage itself as legitimate software\nwhile covertly downloading harmful payloads. The sales ad also revealed that AresLoader\noperates through a single command and control (C2) panel that receives logs, and\ncustomers can create user accounts for the panel.\n\nSales thread posted\n\nto XSS by DarkBLUP. (Source: Flashpoint)\nThe AresLoader sellers have also set up a Telegram channel to facilitate discussions related\nto the bot. The IP address of the C2 server indicates that it belongs to an autonomous\nsystem number (ASN) registered to the bulletproof hosting provider Partner LLC.\n\n## How AresLoader works\n\nFlashpoint analysts have evaluated a sample build of AresLoader and confirmed that it\nperforms the advertised functions.\n\n\n-----\n\nAresLoader\n\ndownloader function calls. (Source: Flashpoint)\nOnce dropped on the system, it scrapes the victim device’s IP address and time zone,\ngenerates a UUID for the infected system, and beacons out to the C2 server with a POST\nrequest. This beacon includes the scraped data mentioned above as well as campaign\nidentifiers such as an ‘owner_token.’\n\nAfter registering the loader on the C2 server, the loader downloads the expected legitimate\nfile specified during the build’s creation. It executes that file and downloads the additional\nharmful payloads. The downloaded files are saved in a folder and then executed.\nAresLoader then creates a Registry AutoRun key to obtain and retain unauthorized access to\nthe victim’s environment.\n\nIt is worth noting that the “owner_token” field identifies the AresLoader customer to whom the\nbuild belongs. Some customer tokens might be linked to threat actor accounts that were\nactive in various illicit communities collected by Flashpoint over the past two months.\n\n## AresLoader panel and server\n\nThe AresLoader panel is managed and hosted by the malware seller, and it appears that all\nAresLoader builds communicate with a single server.\n\n\n-----\n\nAresLoader login landing page. (Source: Flashpoint)\nThis server’s IP address has been detected as the recipient of communication consistent\nwith AresLoader’s command and control (C2) functions. Additionally, a file that resembles an\nAresLoader build has also been observed communicating with this IP address.\n\n## What security teams can learn from ASNs\n\nThe IP address used by AresLoader’s server belongs to the autonomous system number\n(ASN) AS204603 and is registered as Partner LLC. Note that the use of “LLC” in the ASN\nname does not necessarily indicate the company is a registered LLC; it may be part of the\nname. This ASN exhibits several traits characteristic of bulletproof hosting providers.\n\nBulletproof hosting providers are similar to standard hosting providers but cater to threat\nactors who seek to host malicious infrastructure without fear of the servers being taken down\ndue to abuse policies.\n\nIdentifying bulletproof hosting provider ASNs can be useful to security researchers and\norganizations with the ability to block IP ranges. These ASNs’ announced IP ranges are\nhighly unlikely to host legitimate services, making them valuable in identifying malicious\ninfrastructure or preventing malicious activity proactively.\n\nPartner LLC also hosts the “Shark” stealer panel, indicating that the ASN supports other\nmalicious infrastructure besides AresLoader. Additionally, another Partner LLC IP hosts\nsecurespend[.]org, a phishing site masquerading as securespend[.]com.\n\n\n-----\n\nShodan result for\n\nShark Stealer Panel. (Source: Shodan)\n\n## Protect your organization’s critical infrastructure with Flashpoint\n\nFlashpoint’s suite of actionable intelligence solutions enables organizations to proactively\nidentify and mitigate cyber and physical risk that could imperil people, places, and assets. To\n[unlock the power of great threat intelligence, get started with a](https://flashpoint.io/blog/guide-to-cyber-threat-intelligence/) [free Flashpoint trial.](https://flashpoint.io/free-trial/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-06 - Private Malware for Sale- A Closer Look at AresLoader.pdf"
    ],
    "report_names": [
        "2023-03-06 - Private Malware for Sale- A Closer Look at AresLoader.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338979,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1683251423,
    "ts_modification_date": 1683251423,
    "files": {
        "pdf": "https://archive.orkl.eu/cb7494e81f0512b9d648bd0123561feb173c3020.pdf",
        "text": "https://archive.orkl.eu/cb7494e81f0512b9d648bd0123561feb173c3020.txt",
        "img": "https://archive.orkl.eu/cb7494e81f0512b9d648bd0123561feb173c3020.jpg"
    }
}