{
    "id": "4600fcf6-9a36-48a1-a33a-7bf526f26d72",
    "created_at": "2023-01-12T14:59:16.829306Z",
    "updated_at": "2025-03-27T02:09:18.325798Z",
    "deleted_at": null,
    "sha1_hash": "eaee37952104994b78c49ef3afa08b28b5dd445e",
    "title": "2021-03-10 - NimzaLoader- TA800’s New Initial Access Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:11:37Z",
    "file_modification_date": "2022-05-28T19:11:37Z",
    "file_size": 3576641,
    "plain_text": "# NimzaLoader: TA800’s New Initial Access Malware\n\n**[proofpoint.com/us/blog/threat-insight/nimzaloader-ta800s-new-initial-access-malware](https://www.proofpoint.com/us/blog/threat-insight/nimzaloader-ta800s-new-initial-access-malware)**\n\n\nMarch 9, 2021\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nNimzaLoader: TA800’s New Initial Access Malware\n\n\n-----\n\nMarch 10, 2021 Dennis Schwarz, Matthew Mesa, and the Proofpoint Threat Research Team\n\nProofpoint researchers observed an interesting email campaign by a threat actor we track as TA800. This actor\n[has predominantly used BazaLoader since April of 2020, but on February 3rd, 2021 they distributed a new](https://malpedia.caad.fkie.fraunhofer.de/details/win.bazarbackdoor)\nmalware we are calling NimzaLoader. One of NimzaLoader’s distinguishing features is that it is written in the Nim\n[programming language. Malware written in Nim are rare in the threat landscape. Malware developers may choose to use a rare](https://twitter.com/nim_lang/status/1301224693979131904)\nprogramming language to avoid detection, as reverse engineers may not be familiar with Nim’s implementation, or focused on\ndeveloping detection for it, and therefore tools and sandboxes may struggle to analyze samples of it.\n\nThere has been some initial analysis of the malware on Twitter indicating that it may just be another variant\nof BazaLoader, of which there are many variants. On March 1st, Joshua Platt and Jason Reaves from Walmart put forth an\n[excellent writeup on this malware that they call Nimar Loader. Our independent analysis corroborates their analysis and](https://medium.com/walmartglobaltech/nimar-loader-4f61c090c49e)\nassertions that this malware is not a BazaLoader variant. Some of the major differences\nbetween NimzaLoader and the BazaLoader variants that we’ve analyzed include:\n\nWritten in a completely different programming language\nDoesn’t use the same code flattening obfuscator\nDoesn’t use the same style of string decryption\nDoesn’t use the same XOR/rotate based Windows API hashing algorithm\nDoesn’t use the same RC4 using dates as the key command and control (C&C) response decryption\nDoesn’t use a domain generation algorithm (DGA)\nMakes use of JSON in C&C communications\n\nIn this post we’ll take a closer look at the email campaign and the malware.\n\n## Campaign Analysis\n\nOn February 3rd, 2021, Proofpoint observed a TA800 campaign distributing NimzaLoader. Consistent with previous activity,\nthis campaign utilized personalized details in its lure, including, the recipient’s name and/or the company’s name. The\nmessages contained links, which in some cases were shortened links, purporting to be a link to a PDF preview, but instead\nlinked to GetResponse (an email marketing service) landing pages. The landing pages contained links to the “PDF” which\nwas the NimzaLoader executable hosted on Slack and used a fake Adobe icon in an attempt to fool the user.\n\n_Figure 1: TA800 message linking to the GetResponse Landing Page_\n\n\n-----\n\n_Figure 2: TA800 GetResponse Landing page linking to the download of NimzaLoader_\n\n## Malware Analysis\n\nThe sample with a SHA-256 hash\nof [540c91d46a1aa2bb306f9cc15b93bdab6c4784047d64b95561cf2759368d3d1d was reverse engineered for this analysis. At](https://bazaar.abuse.ch/sample/540c91d46a1aa2bb306f9cc15b93bdab6c4784047d64b95561cf2759368d3d1d/)\n[the time of research, the C&C servers were already down, so we also made use of a PCAP file uploaded to VirusTotal.](https://www.virustotal.com/gui/file/be498f46b5ebc2f64924853296b4d611b1bf16581d7dbab10b2e9a23edf04c8f/detection)\n\n**Nim Programming Language**\n\nNimzaLoader was developed using the Nim programming language. This can be seen by the various “nim” related strings in\nthe executable (Figure 3):\n\n\n-----\n\n_Figure 3: Example of Nim related strings_\n\n**String Encryption**\n\nMost of the strings used by the malware are encrypted when stored by using an XOR-based algorithm and a single key per\nstring. [An IDA Python function of the algorithm will be available on our GitHub. Here is a listing of decrypted strings from the](https://github.com/EmergingThreats/threatresearch/blob/master/NimzaLoader/decrypt_str.py)\nanalyzed sample:\n\n1612963255.0039535\n1OcYomEX0BsbkWCzLHRggQ==\n;\n;\\r\\n\n=\nAPISID\nCV54fakIvNL14Br0vFqSiw==\nCookie:\nGET\nJSESSIONID\nSID\nWMCIf52ORF4UAztWoqpcAtAdZeysf2lWi0FvUE/L7Uc=\n\\r\\n\nabout\ne8cbd40fda2500cd496b55df43402d8ed077b8cd965701a205c17f2b0389fce1\nhYLuwpX6qTSHW4zqip3prQ==\nhxxps://centralbancshares\\.com\nhxxps://gariloy\\.com\nhxxps://liqui-technik\\.com\njob_id_header\npath_adj\npath_noun\nseq_num\nseq_total\nserver_public_key\nuser_agent\n\nA few strings, mostly command names, are stored as stack strings instead of encrypted strings.\n\n**Expiration Date**\n\nOne of the encrypted strings is a Unix epoch timestamp and is used as an expiration date for the malware. In the analyzed\nsample, the expiration date was set to “1612963255.0039535” (e.g., Wednesday, February 10, 2021 1:20:55.003 PM GMT)\nand the malware will not run after this date and time.\n\n**Configuration**\n\nThe C&C URLs are stored as encrypted strings and in the analyzed sample were the following:\n\nhxxps://centralbancshares\\.com\nhxxps://gariloy\\.com\nhxxps://liqui-technik\\.com\n\nThere is also an encrypted string that contains a C&C URL path component used in command requests. In the analyzed\nsample this component was “about”.\n\n**Command and Control**\n\nC&C is HTTPS based. The initial beacon is called a “handshake” by the malware and an example looks like Figure 4:\n\n\n-----\n\n_Figure 4: Example handshake request and response_\n\n**Encryption**\n\n[The handshake is used to do a X2551 key exchange with the C&C server and retrieve some configuration items. The “SID”](https://en.wikipedia.org/wiki/Curve25519)\nvalue in the “Cookie” header request is base64 encoded. Once decoded, it contains the malware’s generated public key for the\nkey exchange and some additional data to decrypt the handshake response from the C&C server.\n\nThe C&C response can be decrypted by using this data along with some of the encrypted strings from the malware and some\n[primitives from the Monocypher crypto library.](https://monocypher.org/) A Python snippet using data from the above referenced PCAP and its sample\nshowing this decryption process will be available on our GitHub. Once decrypted the response contains a JSON object that\nlooks like Figure 5:\n\n_Figure 5: Example handshake response JSON object_\n\nIt contains the following pieces:\n\npath_adj – C&C URL component used in future C&C communications\npath_noun - C&C URL component used in future C&C communications\nseq_num – unknown (doesn’t seem to be used in the analyzed sample)\nseq_total – used as a JSON field name in command responses to the C&C server (blue highlight in Figure 7 below)\nuser_agent – user agent used in future C&C communications\njob_id_header – unknown (doesn’t seem to be used in the analyzed sample)\nserver_public_key – the C&C server’s public key used for the key exchange\n\n\n-----\n\nThe key shared between the malware and C&C server via the key exchange will be used for future C&C\ncommunications. Unfortunately, we were unable to derive the shared key used in the referenced PCAP to decrypt further\ncommunication examples.\n\nFuture C&C URLs are constructed using the configuration item mentioned above and the\nreceived “path_adj” and “path_noun” components. Here is an example C&C URL for the reference PCAP:\n\nhxxp://liqui-technik\\.com/about/disassociation/better-known\n\nUpdated “path_adj” and “path_noun” components are sent in successive C&C responses via a response header whose name\nis the previously set “path_noun”. This mechanism can be seen in the red highlights of Figures 6 and 7 below.\n\nOnce the handshake is completed, the remaining C&C communications are command requests and command responses.\nAn example command request looks like Figure 6:\n\n_Figure 6: Example command request_\n\nIn the command request, the Cookie header “SID” value changes to a bot identifier. The response is encrypted using the\nshared key and once decrypted contains a JSON object. It contains the following fields:\n\njob_id - identifier\njob – base64 encoded job details\n\nOnce decoded, “job” contains another JSON object containing:\n\ntype – command\nargs - command arguments\n\nCommands will be detailed in the “Commands” section below.\n\nAn example command response looks like:\n\n\n-----\n\n_Figure 7: Example command response_\n\nCommand responses are similar to requests and contain command outputs or error messages.\n\n**Commands**\n\nThe following commands have been identified in NimzaLoader:\n\ncmd - execute cmd.exe command\npowershell - execute powershell.exe command\nhandshake - redo handshake\nshellcode - inject shellcode into a process as a thread\ncommand arguments are a JSON object containing:\nsc – hex-encoded and compressed shellcode\nprog - program to inject shellcode into\nheartbeat - used to update expiration date of the malware in memory\ncommand arguments are a JSON object containing:\nheartbeat - new expiration time\nsig - used in a signature check with an encrypted string\n(\"e8cbd40fda2500cd496b55df43402d8ed077b8cd965701a205c17f2b0389fce1\" in the analyzed sample)\n\n[At the time of research, all known NimzaLoader C2s were already down, but a public malware sandbox run seems to show it](https://tria.ge/210203-l7gxbpmxls/behavioral1)\nreceiving a “powershell” command that ultimately delivered a Cobalt Strike beacon. We are unable to validate or confirm\nthis finding, but it does align with past TA800 tactics, techniques, and procedures (TTPs).\n\n## Conclusion\n\nNimzaLoader is a new initial access malware being distributed and used by the TA800 threat actor. In 2020, we observed the\nshift from TA800 distributing the Trick, with intermittent shifts to [Buer Loader, and a consistent distribution of Bazaloader since](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\nApril 2020. There has been some research community analysis suggesting that NimzaLoader is just another variant\nof BazaLoader, but based on our observations of significant differences, we are tracking this as a distinct malware family. There\nhas been some evidence suggesting NimzaLoader is being used to download and execute Cobalt Strike as its secondary\npayload, but it is unclear whether this is its primary purpose. It is also unclear if Nimzaloader is just a blip on the radar for\nTA800—and the wider threat landscape—or if Nimzaloader will be adopted by other threat actors in the same\nway BazaLaoder has gained wide adoption. TA800 continues to integrate different tactics into their campaigns, with the latest\ncampaigns delivering Cobalt strike directly.\n\n**Indicators of Compromise**\n\n**Indicator** **Type** **Notes**\n\n\n-----\n\n540c91d46a1aa2bb306f9cc15b93bdab6c4784047d64b95561cf2759368d3d1d SHA256\n\n\nNimzaLoader Reverse Engineered\n\n\ncentralbancshares\\.com Domain C&C\n\ngariloy\\.com Domain C&C\n\nliqui-technik\\.com Domain C&C\n\n\n52bbe09c7150ea66269c71bac8d0237fb0e6b0cae4ca63ab19807c310d6a1a0b SHA256\n\n**Emerging Threats Signatures**\n\nETPRO TROJAN NimzaLoader Initial CnC Host Checkin\n\nETPRO TROJAN NimzaLoader CnC Activity M1\n\nETPRO TROJAN NimzaLoader CnC Activity M2\n\nSubscribe to the Proofpoint Blog\n\n\nNimzaLoader (PCAP)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-10 - NimzaLoader- TA800’s New Initial Access Malware.pdf"
    ],
    "report_names": [
        "2021-03-10 - NimzaLoader- TA800’s New Initial Access Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "cf32661e-7543-4b57-8665-7f8101a000e9",
            "created_at": "2023-01-06T13:46:39.322379Z",
            "updated_at": "2025-03-27T02:00:03.050728Z",
            "deleted_at": null,
            "main_name": "TA800",
            "aliases": [],
            "source_name": "MISPGALAXY:TA800",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535556,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653765097,
    "ts_modification_date": 1653765097,
    "files": {
        "pdf": "https://archive.orkl.eu/eaee37952104994b78c49ef3afa08b28b5dd445e.pdf",
        "text": "https://archive.orkl.eu/eaee37952104994b78c49ef3afa08b28b5dd445e.txt",
        "img": "https://archive.orkl.eu/eaee37952104994b78c49ef3afa08b28b5dd445e.jpg"
    }
}