{
    "id": "46502d00-4862-49e2-89cc-734f3ee797e7",
    "created_at": "2023-01-12T15:09:02.558714Z",
    "updated_at": "2025-03-27T02:06:00.535825Z",
    "deleted_at": null,
    "sha1_hash": "27ff6abee8aab3ff99f5bd092cebcab3e84670b2",
    "title": "2019-02-07 - Ursnif- Long Live the Steganography!",
    "authors": "",
    "file_creation_date": "2022-05-28T00:37:57Z",
    "file_modification_date": "2022-05-28T00:37:57Z",
    "file_size": 349328,
    "plain_text": "# Ursnif: Long Live the Steganography!\n\n**[blog.yoroi.company/research/ursnif-long-live-the-steganography/](https://blog.yoroi.company/research/ursnif-long-live-the-steganography/)**\n\n## Introduction\n\nAnother wave of Ursnif attacks [hits Italy.](https://blog.yoroi.company/warning/campagna-di-attacco-fattura-corretta/)\n\n\nFebruary 7, 2019\n\n\nUrsnif is one of the most active banking trojan. It is also known as GOZI, in fact it is a fork of\nthe original Gozi-ISFB banking Trojan that got its source code leaked in 2014 updating and\nevolving Gozi features over the years. Also in this variant, Ursnif use weaponized office\ndocument with a VBA macro embedded that act as a dropper and multi-stage highly\nobfuscated powershell scripts in order to hide the real payload. In addition, this Ursnif use\nalso steganography to hide the malicious code and avoid AV detection.\n\nMoreover, this variant uses the QueueUserAPC process injection technique to inject into\nexplorer.exe in a more stealthier way, because no remote threads are created in the target\nprocess.\n\n## Technical Analysis\n\nThe initial infection vector appears as a corrupted Excel file, inviting the user to enable macro\nexecution to properly view the contents of the fake document, typically purchase order,\ninvoice and so on.\n\nFigure 1. Ursnif macro-weaponized document.\nExtracting the macro code, shows the malware, in the first instance, checks the victim\ncountry using the Application.International MS Office property. If the result corresponds to\nItaly (code 39), the macro executes the next command using Shell function.\n\nFigure 2. Part of Visual Basic macro code.\n\n\n-----\n\nThe remaining functions of the macro are used to prepare the shell command to launch,\nconcatenating several strings encoded in different ways (mainly in decimal and binary). The\nresulting command contains a huge binary string, which will be converted into a new\nPowershell command using the function:\n\n**[Convert]::ToInt16() -as[char]**\n\nFigure 3. Powershell script deployed by macro code.\nAs shown in the above figure, the malware tries to download an image from at least one of\ntwo embedded URLs:\n\nThe apparently legit image actually contains a new Powershell command. The weaponized\n[image is crafted using the Invoke-PSImage script, which allows to embeds the bytes of a](https://github.com/peewpw/Invoke-PSImage)\nscript into the pixels of a PNG file.\n\nFigure 4. Powershell script hidden into “Fancy Mario”’s image.\nEt voilà, another obfuscated Powershell stage. The payload is encoded in Base64, so it is\neasy to move on and reveal the next code.\n\nFigure 5. Another stage of deobfuscation process.\nBasically, it seems hexadecimal encoded which can be decoded through the previous\n\n_[Convert]::ToInt16 function._\n\nThe final code is:\n\nFigure 6. Powershell script downloading the Ursnif loader.\nIt executes another check against victim’s country, ensuring it is Italy. The information derives\nfrom the command:\n\n**Get-Culture | Format-List -Property ***\n\nIf the check is positive, the script will download an EXE payload from\n_http://fillialopago[.]info/~DF2F63, store it in %TEMP%\\Twain001.exe and then execute it._\n\nAt the analysis time, the file is not detected by most antiviruses:\n\nFigure 7. Ursnif loader detection rate\nDespite its low detection, this executable is a classic Ursnif loader which is responsible to\ncontact the server to download malicious binary which will be injected into explorer.exe\nprocess. It uses the function IWebBrowser.Navigate to download data from its malicious\nserver felipllet[.]info with an URI path that looks like a path to a file video (.avi).\n\nFigure 8. IWebBrowser.Navigate function invocation.\nThe server responds to this request sending encrypted data, as show in the following figure\n\nFigure 9. Part of network traffic containing some encrypted data.\n\n\n-----\n\nAfter a decryption routine, all useful data is stored into registry keys at\n_HKCU\\Software\\AppDataLow\\Software\\Microsoft\\{GUID}._\n\nFigure 10. Registry keys set by the malware.\nThe regvalue named “defrdisc” (which reminds to a legit Disk Defragmentation Utility)\ncontains the command will be executed as next step and at Windows startup, as displayed\nbelow.\n\nFigure 11. Command executed at machine’s startup.\nThe command’s only goal is to execute the data contained into “cmiftall” regvalue through\nPowershell engine.\n\nC:\\Windows\\system32\\wbem\\wmic.exe /output:clipboard process call create \"powershell w hidden iex([System.Text.Encoding]::ASCII.GetString((get-itemproperty\n'HKCU:\\Software\\AppDataLow\\Software\\Microsoft\\94502524-E302-E68A-0D08C77A91BCEB4E').cmiftall))\"\n\nThe “cmiftall”’s data is simply a Powershell script encoded in Hexadecimal way, so it is\npossible to reconstruct its behavior.\n\nFigure 12. Powershell script used to inject the final binary through the APC Injection\ntechnique.\nSo, using the Powershell script stored into regkey (shown above), Ursnif is able to allocate\nspace enough for its malicious byte array, containing the final payload, and to start it as legit\nprocess’ thread through QueueUserAPC and SleepEx calls.\n\nThe Ursnif’s complete workflow is shown in figure:\n\nFigure 13. Ursnif’s workflow.\nFinally, from data contained into last script’s byte array, it is possible to extract a DLL which\ncorresponds to what Ursnif inject into explorer.exe process.\n\nThis DLL seems to be corrupted, as stated by some static analysis tools:\n\nFigure 14. Info about the malformed DLL.\nHowever, when it is loaded in memory using APC injection technique, it works with no\nproblems. Submitting the file to VirusTotal, the result is devastating: 0/56 anti-malware\ndetects it.\n\nFigure 15. Final DLL’s detection rate.\n\n## Conclusions\n\n\n-----\n\n[As stated first by us in the previous Ursnif analysis in December 2018 and after by Cisco](https://blog.yoroi.company/research/dissecting-the-latest-ursnif-dhl-themed-campaign/)\nTalos Intelligence in January 2019, also this new Ursnif sample uses the same APC injection\ntechnique to instill its final binary into explorer.exe process, along with obfuscation and\nsteganography in order to hide its malicious behaviour. Ursnif is more active and widespread\nthan yesterday, the contacted C2 is not reachable but the malware implant is still alive due to\nthe fact that the crooks are constantly changing their C2 to diverting tracking and analysis.\n\nYoroi ZLab - Cybaze researchers are continuing the analysis of this undetected DLL in order\nto extract information and evidences to share with the research community.\n\n## Indicators of Compromise\n\nHashes\n\n630b6f15c770716268c539c5558152168004657beee740e73ee9966d6de1753f (old\nsample)\nf30454bcc7f1bc1f328b9b546f5906887fd0278c40d90ab75b8631ef18ed3b7f (new\nsample)\n93dd4d7baf1e89d024c59dbffce1c4cbc85774a1b7bcc8914452dc8aa8a79a78 (final\nbinary)\n\nDropurls\n\nhttps://images2.imgbox[.]com/55/c4/rBzwpAzi_o.png\nhttps://i.postimg[.]cc/PH6QvFvF/mario.png?dl=1\nhttps://fillialopago[.]info/~DF2F63\n\nhttp://felipllet[.]info\n\nC2s\n\npereloplatka[.]host\nroiboutique[.]ru\nuusisnfbfaa[.]xyz\nnolavalt[.]icu\nsendertips[.]ru\n\nIPs\n\n185.158.248.142\n185.158.248.143\n\nArtifacts\n\n\n-----\n\nHKCU:\\Software\\AppDataLow\\Software\\Microsoft\\94502524-E302-E68A-0D08C77A91BCEB4E\n\n### Yara rules\n```\nimport \"pe\"\nrule Ursnif_201902 {\nmeta:\n     description = \"Yara rule for Ursnif loader - January version\"\n     author = \"Yoroi - ZLab\"\n     last_updated = \"2019-02-06\"\n     tlp = \"white\"\n     category = \"informational\"\nstrings:\n     $a1 = \"PADDINGXX\" \n     $a2 = { 66 66 66 66 66 66 66 }\ncondition:\n     all of ($a*) and pe.number_of_sections == 4 and\n(pe.version_info[\"OriginalFilename\"] contains \"Lumen.exe\" or\npe.version_info[\"OriginalFilename\"] contains \"PropositionReputation.exe\")\n }\n\n```\nThis blog post was authored by Antonio Farina, Davide Testa and Antonio Pirozzi of CybazeYoroi Z-LAB\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-07 - Ursnif- Long Live the Steganography!.pdf"
    ],
    "report_names": [
        "2019-02-07 - Ursnif- Long Live the Steganography!.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536142,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653698277,
    "ts_modification_date": 1653698277,
    "files": {
        "pdf": "https://archive.orkl.eu/27ff6abee8aab3ff99f5bd092cebcab3e84670b2.pdf",
        "text": "https://archive.orkl.eu/27ff6abee8aab3ff99f5bd092cebcab3e84670b2.txt",
        "img": "https://archive.orkl.eu/27ff6abee8aab3ff99f5bd092cebcab3e84670b2.jpg"
    }
}