{
    "id": "466536f6-5be2-4096-a248-a4e176acf41a",
    "created_at": "2023-01-12T15:08:32.495766Z",
    "updated_at": "2025-03-27T02:06:09.604617Z",
    "deleted_at": null,
    "sha1_hash": "9a74d6aecbe15fd6f2998b9c5a9b65984558edac",
    "title": "2022-02-23 - What the Pack(er)-",
    "authors": "",
    "file_creation_date": "2022-05-28T00:25:02Z",
    "file_modification_date": "2022-05-28T00:25:02Z",
    "file_size": 2126853,
    "plain_text": "# What the Pack(er)?\n\n**cyber.wtf/2022/03/23/what-the-packer/**\n\nMarch 23, 2022\n\nLately, I broke one of the taboos of malware analysis: looking into the packer stub of a\ncouple of malware samples. Fortunately, I must say. Because I discovered something I was\nreally surprised by. But first, a little detour.\n\nHistorically, Emotet has been observed to assemble infected systems into three botnets\ndubbed Epoch 1, Epoch 2, and Epoch 3. After the takedown and the later resurrection, there\nseems to only be two botnets which have subsequently been dubbed Epoch 4 and Epoch 5.\nThe differences between the old and the new core of the botnets are significant on the\ntechnical side – however, the old Epochs 1 through 3 shared the same core and so do the\nrecent Epoch 4 and Epoch 5. The only noticeable difference between Epochs 1 through 3\nwas the config which was embedded into the Emotet core before a sample was rolled out to\nthe victims. The same also applies to the more recent Epochs 4 and 5.\n\nHowever, there is a significant difference in the operation carried out by the botnets between\nwhat happened before the disruption and what was observed since the rebirth. In the past,\nobservations showed that Emotet bots used to drop whatever their operator’s customers paid\n[them for. Brad Duncan alone already observed Emotet dropping QakBot/QBot,](https://www.malware-traffic-analysis.net/2020/07/21/index.html) [Trickbot, and](https://www.malware-traffic-analysis.net/2020/02/07/index.html)\n[Gootkit. Of these, the Trickbot group seemed to be their best and longest-running customer](https://www.malware-traffic-analysis.net/2019/01/21/index.html)\nbased on the numerous observations of Trickbot being dropped by Emotet. But after the\nresurrection, there were no longer observations of additional malware being dropped by\nEmotet. Instead, [starting in December 2021, researchers observed a CobaltStrike beacon](https://twitter.com/Cryptolaemus1/status/1468266929014157316)\nbeing dropped onto an infected machine without any evidence that there was another\n[malware involved. Emotet has since been reportedly and](https://www.malware-traffic-analysis.net/2022/02/10/index.html) [repeatedly seen to deploy](https://www.malware-traffic-analysis.net/2022/03/14/index.html)\nCobaltStrike beacons to infected machines, so this was definitely not a one-off drop and\ndrew the attention of our researchers.\n\nWith the context of this analysis being setup properly, we can finally come back to the actual\ntopic of this blog post: breaking taboos by analyzing packing stubs. Enjoy!\n\n## Poking (in) Packing Stubs\n\nFor the first period of time after the resurrection, the Emotet core seems to have used XOR\nencryption to hide their bot from static analysis. It can easily be seen that the algorithms\nappear to be (almost) identical between Epoch 4 (left) and Epoch 5 (right) – disregarding a\nfew compiler optimizations due to different key lengths:\n\n\n-----\n\nEmotet XOR Decrypt for Payload – Epoch 4 (left) vs Epoch 5 (right)\nAt some point, the authors changed the encryption scheme to use RC4 instead of plain XOR.\nAlthough the code applying the RC4 algorithm looks different thanks to a substantial amount\nof superfluous API calls, there are obvious similarities between Epoch 4 on the left and\nEpoch 5 on the right:\n\n\n-----\n\nRC4 decryption routine of\n\n\na recent Epoch 4 sample\n\n\n-----\n\nRC4\n\ndecryption routine of a recent Epoch 5 sample Emotet RC4 Decrypt for Payload – Epoch 4\n(left) vs Epoch 5 (right)\nThe surprising discovery we made during the week preceeding the publication of this post is\nrelated to the CobaltStrike drops. Assuming from what was observed for Epochs 1 through 3,\nthoughts were that some other party paid the Emotet operators to drop CobaltStrike as their\ndesired payload. Having a closer look at the samples reveals an interesting observation: all\nof the CobaltStrike drops used packing stubs which looked extremely familiar. The drops\n\n\n-----\n\nreferred to in the following were received on March 11th, however, these specific packing\nstubs were already observed earlier for Emotet drops. Unfortunately, we did not see the\nconnection until a couple of days ago. But have a look for yourself:\n\nXOR Decrypt of Payload – Emotet (left) vs CobaltStrike Drop A (right)\n\n\n-----\n\nRC4 Decrypt of Payload – Emotet (left) vs CobaltStrike Drop B (right) Decryption Routines\nfor Payloads\nAs it can be seen in both examples, Drop A used the packer which was observed in the early\ndays after the rebirth while Drop B used the same packer as the Emotet core itself at the\ntime of writing this post.\n\n## Conclusion or (Educated) Guessing\n\nPrior to the rebirth, drops were not bound to the operation of Emotet – the botnet was known\nto drop whatever their operator’s customers paid them for; but since the resurrection, this\nseems to have shifted towards drops which are very tightly-bound to the Emotet core and\nthus the operation as well. Considering that Trickbot was used to revive the Emotet botnet\nback in november 2021 and the observation that Emotet since then only dropped\nCobaltStrike beacons to infected machines, one thought may arise: have the Trickbot\noperators perhaps invited their old friends from Emotet over to work for the Conti group as\nwell? It has long been said that the Emotet operators are closely related to the Trickbot group\nbecause of their long-running partnership. The thought is also supported by information from\nthe [Conti playbook leak in 2021 where it can be seen that Conti makes heavy use of](https://blog.talosintelligence.com/2021/09/Conti-leak-translation.html)\n[CobaltStrike as a reconnaissance tools before deploying their ransomware. AdvIntel also](https://www.bleepingcomputer.com/news/security/emotet-botnet-comeback-orchestrated-by-conti-ransomware-gang/)\nsuspected that Emotet arose as part of the Conti group. The now-discovered use of identical\npackers for both the Emotet core and the CobaltStrike drops supports the claim in a\nfascinating way.\n\n\n-----\n\nAlternatively, or additionally, the resurrection of Emotet may have been the final step in\n[replacing Trickbot as the initial foothold of the Conti group in their victim’s networks by](https://www.bleepingcomputer.com/news/security/conti-ransomware-gang-takes-over-trickbot-malware-operation/)\nputting their remaining Trickbot bots to a last use. It cannot be denied that Emotet was a\nsurprisingly efficient malware so the Conti operators may have gone for using both Emotet\nand BazarLoader to access their victim’s networks: with the Trickbot developers focusing\nsolely on BazarLoader and the Emotet operators back into the business, this leaves the\nConti group with two independent and powerful tools to access infected machines.\n\n## Remarks\n\nOf course, at the same time the author made the aforementioned discovery, researchers\n[observed another drop being delivered by Emotet: SystemBC. It remains to be seen whether](https://malpedia.caad.fkie.fraunhofer.de/details/win.systembc)\nthis was a one-time delivery in the sense of a test or if researcher will see this drop more\noften in the future.\n\n## Reference Samples\n\nc7574aac7583a5bdc446f813b8e347a768a9f4af858404371eae82ad2d136a01 – old Emotet\nEpoch 4 sample (2021-11-15)\n\n1c9f611ce78ab0efd09337c06fd8c65b926ebe932bc91b272e97c6b268ab13a1 – old Emotet\nEpoch 5 sample (2021-11-18)\n\n8494831bbfab5beb6a58d1370ac82a4b3caa1f655b78678c57ef93713c476f9c – recent\nEmotet Epoch 4 sample (2022-03-14)\n\n31f7e5398c41d7eb8d033dbc7d3b90a2daf54995e20b5ab4a72956b41c8e1455 – recent\nEmotet Epoch 5 sample (2022-03-15)\n\ncf7a53b0e07f4a1fabc40a5e711cf423d18db685ed4b3c6c87550fcbc5d1a036 – CobaltStrike\nDrop A (2022-03-11)\n\n73aba991054b1dc419e35520c2ce41dc263ff402bcbbdcbe1d9f31e50937a88e – CobaltStrike\nDrop B (2022-03-11)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-23 - What the Pack(er)-.pdf"
    ],
    "report_names": [
        "2022-02-23 - What the Pack(er)-.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536112,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653697502,
    "ts_modification_date": 1653697502,
    "files": {
        "pdf": "https://archive.orkl.eu/9a74d6aecbe15fd6f2998b9c5a9b65984558edac.pdf",
        "text": "https://archive.orkl.eu/9a74d6aecbe15fd6f2998b9c5a9b65984558edac.txt",
        "img": "https://archive.orkl.eu/9a74d6aecbe15fd6f2998b9c5a9b65984558edac.jpg"
    }
}