{
    "id": "467afa56-4112-4ccb-b409-173f6a2a4dd7",
    "created_at": "2023-01-12T15:01:01.993465Z",
    "updated_at": "2025-03-27T02:17:27.543652Z",
    "deleted_at": null,
    "sha1_hash": "2bcab1aff1c36d15e7f031a1ed37f286e0d53232",
    "title": "2018-01-25 - OilRig uses RGDoor IIS Backdoor on Targets in the Middle East",
    "authors": "",
    "file_creation_date": "2022-05-28T00:34:40Z",
    "file_modification_date": "2022-05-28T00:34:40Z",
    "file_size": 1151656,
    "plain_text": "# OilRig uses RGDoor IIS Backdoor on Targets in the Middle East\n\n**[researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/](https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/)**\n\nRobert Falcone January 25, 2018\n\nBy [Robert Falcone](https://unit42.paloaltonetworks.com/author/robertfalcone/)\n\nJanuary 25, 2018 at 5:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Middle East,](https://unit42.paloaltonetworks.com/tag/middle-east/) [OilRig,](https://unit42.paloaltonetworks.com/tag/oilrig/) [RGDoor,](https://unit42.paloaltonetworks.com/tag/rgdoor/) [TwoFace](https://unit42.paloaltonetworks.com/tag/twoface/)\n\nSummary\n\n[While investigating files uploaded to a TwoFace webshell, Unit 42 discovered actors](https://blog.paloaltonetworks.com/tag/twoface/)\ninstalling an Internet Information Services (IIS) backdoor that we call RGDoor. Our data\nsuggests that actors have deployed the RGDoor backdoor on webservers belonging to eight\nMiddle Eastern government organizations, as well as one financial and one educational\ninstitution.\n\nWe believe the actors deploy RGDoor as a secondary backdoor to regain access to a\ncompromised webserver in the event a victim organization detects and removes the\nTwoFace shell. We do not have HTTP logs that show the actor interacting with RGDoor, so\nwe do not know the activities the actors carry out using the backdoor. However, we were able\nto create a client application to interact with RGDoor for testing purposes, which allowed us\nto interact with the backdoor to see how it operates on an IIS server.\n\n\n-----\n\nRGDoor\n\nUnlike TwoFace, the actors did not develop RGDoor in C# to be interacted with at specific\nURLs hosted by the targeted IIS web server. Instead, the developer created RGDoor using\nC++, which results in a compiled dynamic link library (DLL). The DLL has an exported\nfunction named \"RegisterModule\", which is important as it led us to believe that this DLL was\nused as a custom native-code HTTP module that the threat actor would load into IIS. Starting\nwith IIS 7, developers could create modules in C++ that the IIS webserver would load to\nextend IIS' capabilities, such as carry out custom actions on requests. The fact that RGDoor\nis an IIS HTTP module suggests that there is no visual representation of the shell for actors\nto interact with, which also differs from TwoFace’s interface that actors can interact with by\nvisiting the URL to the TwoFace ASPX file.\nAccording to [Microsoft’s documentation, native-code modules can be installed either in the](https://technet.microsoft.com/en-us/library/cc771133(v=ws.10).aspx)\nIIS Manager GUI or via the command-line using the “appcmd” application. While we do not\nhave logs to determine exactly how the actors install RGDoor, the actor can use the\nTwoFace webshell to install the RGDoor module via the command line. The following\ncommand could be used to install the HTTP module on an IIS server:\n%systemroot%\\system32\\inetsrv\\APPCMD.EXE install module /name:[module name]\n/image:[path to RGDoor DLL] /add:true\nWe confirmed the command above successfully installed the RGDoor backdoor in our test\nenvironment. Figure 1 shows the specific command we used to install RGDoor on our IIS\nserver.\n\n_Figure 1 Command-line used to install RGDoor module into IIS_\n\nWe confirmed RGDoor installed correctly into IIS by checking the HTTP Modules display in\nIIS Manager. Figure 2 shows the RGDoor DLL (HTTPParser.dll) was loaded into IIS using\nthe module name HTTPParser.\n\n\n-----\n\n_Figure 2 Installed RGDoor module displayed in the HTTP Modules list in IIS Manger_\n\nListening for Commands\nWe analyzed RGDoor samples and found that the \"RegisterModule\" function does very little\nother than calling the IHttpModuleRegistrationInfo::SetRequestNotifications method.\nAccording to [MSDN, the SetRequestNotifications function has the following prototype, which](https://msdn.microsoft.com/en-us/library/ms693045(v=vs.90).aspx)\nallows a developer to configure the module to handle GET requests\n(dwRequestNotifications) and/or POST requests (dwPostRequestNotifications):\nSetRequestNotifications(\nIN IHttpModuleFactory * pModuleFactory,\nIN DWORD        dwRequestNotifications,\nIN DWORD        dwPostRequestNotifications\n)\nIn RGDoor, the code calls this function with arguments that ignore inbound HTTP GET\nrequests, but act on all HTTP POST requests seen by the IIS server, even POST requests\nissued over HTTPS. RGDoor calls this function with the following arguments, the third of\nwhich (dwPostRequestNotifications) is set to “RQ_BEGIN_REQUEST”, which is an event\ntriggered immediately after IIS receives the POST request:\nSetRequestNotifications(pModuleFactory,0,RQ_BEGIN_REQUEST)\n\nRGDoor is notified immediately when the IIS server receives an inbound HTTP POST\nrequest. RGDoor parses these POST requests, specifically looking for the HTTP “Cookie”\nfield by accessing the HTTP header with the following function call:\npHttpContext->GetRequest()->GetHeader(\"Cookie\",NULL)\nAfter accessing the cookie field, RGDoor parses this field by looking for the string\n\"RGSESSIONID=\", which is the basis for the name RGDoor. If present, the code uses the\ntwo-bytes immediately following the \"RGSESSIONID=\" string as a decryption key,\nspecifically treating the two character bytes as a single hexadecimal byte. For instance, the\ntwo-byte key of “00” would represent the hexadecimal value of 0x00, where “FF” would\nrepresent 0xff, and so on. The key is followed by a Base64 encoded string that contains\nciphertext. The following represents the structure of the cookie filed in inbound RGDoor\nrequests:\nRGSESSIONID=[two-bytes for key][Base64 encoded ciphertext]\nRGDoor decodes the Base64 encoded string and then decrypts the decoded string using a\ncustom algorithm. The custom algorithm iterates through the ciphertext using the 'pxor'\ninstruction to XOR each byte of ciphertext with the single-byte hexadecimal value from the\ntwo-byte character key provided in the cookie field.\nThe code will parse the cleartext looking for one of three commands: “cmd$”, “upload$” and\n“download$”. The code treats the string immediately following the command as the\ncommand’s argument. Table 1 provides the arguments and further details on the three\ncommands.\n\n\n-----\n\n**Command** **Description**\n\n\ncmd$[command\nto execute]\n\nupload$[path to\nfile]\n\ndownload$[path\nto file]\n\n\nUses \"popen\" to run the specified command. It enters a loop that calls\n\"fgets\" to get the command results. The loop finishes when a call to\n\"feof\" designates the end of the command results, which are relayed\nback to the actor via the HTTP response.\n\nGets the length of uploaded data by checking the \"Content-Length\" field\nwithin the HTTP request. Uses the\nIHttpRequest::GetRemainingEntityBytes and\nIHttpRequest::ReadEntityBody methods to obtain base64 encoded data\nwithin the body of the HTTP POST request. The code decrypts the\ndecoded data using the XOR algorithm and writes the data to the\nspecified file. It will respond to this request with either \"write done \\r\\n\"\nor \"can't open file: \".\n\nReads a specified file and encrypts it with the XOR algorithm, Base64\nencodes the ciphertext and sends the data back to the actor via the\nHTTP response.\n\n\n_Table 1 Commands available within RGDoor_\n\nResponding to Commands\nWhen responding to inbound requests, the code will clear the response that IIS would have\nresponded to the HTTP POST request by calling the following functions:\npHttpContext->GetResponse()->Clear()\nRGDoor then constructs its own HTTP response by first setting the \"Content-Type\" field\nwithin the HTTP header to \"text/plain\". Figure 3 shows the code that uses the\nIHttpResponse::SetHeader method to set the “Content-Type” field within the HTTP response\nto “text/plain”, specifically by using a value of 0xC (0xA + 2) for the ulHeaderIndex within\nHTTP_HEADER_ID enumeration.\n\n_Figure 3 RGDoor code to set the HTTP Content-Type to \"text/plain\"_\n\nThe sample then transmits the data back to the actor by creating a loop that calls the\nIHttpResponse::WriteEntityChunk method until all of the data is sent to the actor within HTTP\nresponses. If the WriteEntityChunk method fails at any point during this loop, the code will\nrespond to the actor with a HTTP 500 “Server Error” response by using the\n\n\n-----\n\nIHttpResponse::SetStatus method.\n\nInteracting with RGDoor\nWe created a client application to interact with the RGDoor module, specifically to issue\ncommands to the backdoor and to see how it operates on the IIS server. As mentioned\npreviously in this blog, RGDoor has three available commands, specifically “cmd$”,\n“upload$” and “download$”. We used our client to issue one of each of these commands.\nFigure 4 shows the HTTP request and response to our first interaction with the RGDoor\nmodule. The command issued in this request was “cmd$whoami”, which instructs RGDoor to\nrun the ‘whoami’ command in command prompt. The key used to encrypt this command was\n“54” (0x54), which resulted in Base64 encoded string of “NzkwcCM8OzU5PQ==”. The HTTP\nresponse shows the RGDoor module returned the Base64 encoded string of\n“PT0ndDUkJCQ7OzgIMDEyNSE4IDUkJCQ7OzheVA==”, which when decrypted using the\nsame “54” key is the result of the ‘whoami’ command, specifically the string “iis\napppool\\\\defaultapppool\\n\\x00”.\n\n_Figure 4 Issuing 'whoami' command and RGDoor's response_\n\n\n-----\n\nFigure 5 shows our testing of RGDoor s upload command, specifically\n“upload$c:\\windows\\temp\\test.txt” that uploads a file from our local system to the webserver.\nThe inbound request uses a key of “54” (0x54) that results in an encoded command string of\n“ISQ4OzUwcDduCCM9OjA7IycIIDE5JAggMScgeiAsIA=”. The request also includes the\nstring “IDEnID06M2VmZ14=” within the POST data, which is the string “testing123\\n” from\nthe file on our local system encrypted using the “54” key that will be written to the “test.txt”\nfile on the server. As you can see from the HTTP response, RGDoor responded to this\ncommand with “write done”, which is interesting as the response was in cleartext and not\nencrypted using the custom algorithm.\n\n_Figure 5 Uploading a file to server via RGDoor Downloading a file from the server via_\n_RGDoor_\n\nFigure 6 shows our testing of the download command within RGDoor, specifically a\ncommand “download$c:\\windows\\temp\\test.txt” that downloads the file uploaded in our\nprevious test. We chose to use the key “89” (0x89) in this test to showcase RGDoor’s ability\nto use any hexadecimal byte as a key, which resulted in an encoded command string of\n“7eb+5+Xm6O2t6rPV/uDn7eb++tX97OT51f3s+v2n/fH9”. RGDoor responds to this command\nwith the encoded string “/ez6/eDn7ri7uoM=”, which when decrypted with the “89” key results\nin the string 'testing123\\n', which is the contents of the “test.txt” file.\n\n\n-----\n\n_Figure 6 Downloading a file from the server via RGDoor_\n\nTo determine how the RGDoor client requests appears within the IIS request logs, we\nchecked the logs of our default IIS installation in our test environment. By default, IIS does\nnot log the values within Cookie fields of inbound HTTP requests, which would contain\ncommands issued by actors to RGDoor. To see inbound RGDoor requests, an administrator\nmust configure logging of Cookie fields in IIS, which can be selected in the W3C Logging\nFields dialog in IIS Manager, as seen in Figure 7.\n\n\n-----\n\n_Figure 7 W3C Logging Fields dialog in IIS Manager with Cookie fields enabled_\n\nThe HTTP requests sent by the client to the RGDoor backdoor in the testing above will\ngenerate logs on the IIS server. Without the Cookie field logged, it is difficult to locate and\nanalyze inbound requests related to RGDoor. Remember that RGDoor is an IIS module that\nchecks all inbound POST requests for commands, so an actor does not need to use one\n\n\n-----\n\nparticular URL to interact with RGDoor. However, the following shows the IIS log generated\nfrom the first testing request we made using our RGDoor client, which shows the\n“RGSESSIONID=” string, the “54” key and the Base64 encoded command within the Cookie\nfield:\n\n\n1\n2\n3\n4\n5\n\n\n#Software: Microsoft Internet Information Services 7.5\n#Version: 1.0\n#Date: 2017-10-03 19:30:13\n#Fields: date time s-ip cs-method cs-uri-stem cs-uri-query s-port cs-username c-ip\ncs(User-Agent) cs(Cookie) sc-status sc-substatus sc-win32-status time-taken\n2017-10-03 19:30:13 192.168.45.5 POST / - 80 - 192.168.45.1 python-requests/2.13.0\nRGSESSIONID=54NzkwcCM8OzU5PQ== 200 0 0 28\n\n\nConclusion\nRGDoor is an IIS backdoor that actors used the TwoFace webshell to load onto an IIS web\nserver. The RGDoor provides backdoor access to the compromised server, which we\nspeculate the actors loaded in order to regain access to the server in the event the TwoFace\nwebshell was removed. This backdoor has a rather limited set of commands, however, the\nthree commands provide plenty of functionality for a competent backdoor, as they allow an\nactor to upload and download files to the sever, as well as run commands via command\nprompt. The use of RGDoor suggests that this group has contingency plans to regain access\nto a compromised network in the event their webshells are discovered and remediated.\nPalo Alto Networks customers are protected from RGDoor by the following:\n\nAll RGDoor samples have malicious verdicts in WildFire\n[AutoFocus customers can investigate this activity with the RGDoor tag](https://autofocus.paloaltonetworks.com/#/tag/Unit42.RGDoor)\nIPS Signature RGDoor.Gen Command and Control Traffic (ID 11885) detects RGDoor\nnetwork traffic\n\nIndicators of Compromise\n\n**RGDoor SHA256**\n497e6965120a7ca6644da9b8291c65901e78d302139d221fcf0a3ec6c5cf9de3\na9c92b29ee05c1522715c7a2f9c543740b60e36373cb47b5620b1f3d8ad96bfa\n**RGDoor Filenames**\nHTTPParser.dll\nTrafficHandler.dll\niishandler6.dll\n\n**Get updates from**\n**Palo Alto**\n\n\n-----\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-25 - OilRig uses RGDoor IIS Backdoor on Targets in the Middle East.pdf"
    ],
    "report_names": [
        "2018-01-25 - OilRig uses RGDoor IIS Backdoor on Targets in the Middle East.pdf"
    ],
    "threat_actors": [
        {
            "id": "3b8b4ed7-e8cc-4a3a-b14d-c8ebf87c0f9c",
            "created_at": "2023-01-06T13:46:39.062729Z",
            "updated_at": "2025-03-27T02:00:02.988182Z",
            "deleted_at": null,
            "main_name": "Operation Soft Cell",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Soft Cell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2025-03-27T02:00:55.414817Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535661,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1653698080,
    "ts_modification_date": 1653698080,
    "files": {
        "pdf": "https://archive.orkl.eu/2bcab1aff1c36d15e7f031a1ed37f286e0d53232.pdf",
        "text": "https://archive.orkl.eu/2bcab1aff1c36d15e7f031a1ed37f286e0d53232.txt",
        "img": "https://archive.orkl.eu/2bcab1aff1c36d15e7f031a1ed37f286e0d53232.jpg"
    }
}