{
    "id": "46842e19-249d-49b9-847f-3cb84eb6cd72",
    "created_at": "2023-01-12T15:04:42.666929Z",
    "updated_at": "2025-03-27T02:06:00.351377Z",
    "deleted_at": null,
    "sha1_hash": "a62c90664aed4bea1f3ace824afd91c77fddb0c1",
    "title": "2021-10-28 - Termination of Federal Unemployment Programs Represents Turning Point for Fraudsters",
    "authors": "",
    "file_creation_date": "2022-05-28T02:09:43Z",
    "file_modification_date": "2022-05-28T02:09:43Z",
    "file_size": 286820,
    "plain_text": "# Termination of Federal Unemployment Programs Represents Turning Point for Fraudsters\n\n**[recordedfuture.com/termination-federal-unemployment-programs-turning-point-fraudsters/](https://www.recordedfuture.com/termination-federal-unemployment-programs-turning-point-fraudsters/)**\n\nInsikt Group\nSince early 2020, Recorded Future has continued to witness prominent changes within\nunderground communities in response to COVID-19 including an interest in defrauding\ngovernment entities via fraudulent unemployment benefit applications. As detailed in our\n[general reporting on the threat landscape of unemployment fraud earlier this year, criminals](https://www.recordedfuture.com/unemployment-fraud-in-criminal-underground/)\ncontinued to use a variety of methods with relative ease, contributing to a growing\nmarketplace that saw topics such as Pandemic Unemployment Assistance (PUA) appear as\na sub-category within underground marketplaces that offered fraudulent tutorials or methods\nfor aspiring criminals. In addition to these tutorials, we occasionally observed the sale of\ncompromised account information that came bundled with tutorials on how to best profit off\nthe stolen information. This past month, however, has served as a critical turning point for\nthis general landscape with The CARES Act and other federal programs that provided\n[unemployment benefits for many claimants having expired the week of September 4, 2021.](https://esd.wa.gov/newsroom/alerts/federal-pandemic-benefits-ending)\nThe federal PUA program provided unemployment benefits to individuals not eligible for\nregular unemployment compensation or extended benefits, including those who have\nexhausted all rights to such benefits. Recorded Future analysts have monitored for changes\nsince September 4 and noted the following:\n\nDespite the termination of federal programs, references to PUA guides and methods\ncontinue to persist. It is certainly possible that this is either a combination of ignorance\non the part of some criminal entities who were initially unaware that the federal\nprograms had ended or were attempts to scam other criminals operating on these\nsources for a quick profit.\nAlthough the PUA program expired in September 2021, the methods used by the\nactors to brute force accounts on these government websites, combined with the\nrelative ease with which actors can steal funds intended for US citizens, indicate that\nsimilar government assistance programs may be targeted in the future.\n\n\n-----\n\nFraudsters are attempting to use their alleged experience in orchestrating PUA fraud\nschemes to demonstrate their ability to perform other forms of fraud that are likely to\npersist, such as those targeting other government assistance or loan programs. Some\nactors have implied they intend to shift their targeting to other programs that have\nproven reliable throughout the pandemic such as those targeting US Small Business\nAdministration (SBA) relief efforts.\nRecorded Future has continued to observe criminal marketplaces that specialize in the\nsale of stolen credentials routinely reference pandemic unemployment platform login\ninformation for sale at low cost. The exposure of this login information for individual\naccount balances is still relevant even after the termination of federal programs for\nindividuals who have remaining relief balances or fail to maintain proper security\nhygiene by reusing the same password across multiple platforms. Other effects of a\nvictim logging into an account whose login information was compromised may enable\nactors responsible for the compromise to steal additional personally identifiable\ninformation (PII), including bank account information.\n\n**_Figure 1: Breakdown of Fraud Methods Available for Purchase (October 15, 2021),_**\n_Source: Telegram_\nSome actors have been very frank in their description of what the future of PUA fraud holds\nwithin closed access sources, leaving comments such as: “Pua is dead already, just like the\n_sba, now only loans work”. However, other actors have continued to promote the sale of_\nmethods or tutorials both before and after the September federal deadline, clearly noting that\nsome methods are very unlikely to be as profitable once the programs were terminated. In\nsome advertisements actors appear to be unperturbed by the termination of the programs,\nadvertising “NEW” working methods for multiple states. The methods used by the actors, as\nwell as the underlying vulnerabilities in the platforms used by certain states’ PUA websites,\ncan likely be replicated for broader targeting. In some observed scenarios, threat actors\nspecifically stated they had acquired stolen login credentials for PUA accounts through\nroutine attack vectors such as brute-force attacks.\n\n**_Figure 2: Actor Urging Members to Use an Ohio Method of PUA Fraud Before the_**\n_September 2021 Federal Deadline Passed, Source: Telegram_\nCybercriminals used brute-forced login credentials and stolen personally identifiable\ninformation (PII) bundled as packages of ‘fullz’ (sets of data on individuals that typically\nincludes full names, Social Security Numbers, addresses, account numbers, and birthdays)\nto compromise victims’ PUA accounts. More broadly, actors have also continued to sell\nmethods in which criminals can access unemployment relief balances for certain states.\nHowever, prior analysis of several PUA tutorials by Recorded Future’s Gemini Advisory\nconfirmed that these actors have occasionally expressed doubts about some methods’\nviability due to factors such as a large number of potential victims possibly having already\nsubmitted a claim for payment through PUA or other actors may have already attempted to\nbrute force the account password.\n\n\n-----\n\nRegardless of the status of these now-defunct federal programs, the effect that the scale of\nstolen PII or login credentials from unemployment platforms has had on the criminal\nunderground is also likely to persist. Recorded Future has continued to observe more\nautomated criminal marketplaces that specialize in the sale of stolen credentials routinely\nreferencing pandemic unemployment platform login information for sale at low cost. The\nexposure of this login information for individual account balances is still relevant even after\nthe termination of federal programs for individuals who have remaining balances or fail to\nmaintain proper security hygiene by reusing the same password across multiple platforms.\nThe average cost of listings from shops such as the one below doesn’t exceed $10,\nrepresenting the ease to which actors who are either unable to have no desire to learn about\nPUA-specific methods, such as brute forcing, can instead opt to outright purchase login\ncredentials to perform unauthorized actions within a victim’s account.\n\n**_Figure 3: Underground Marketplace Advertisement for Stolen Ohio Unemployment Login_**\n_Data (September 26, 2021), Source: Amigos Market_\nThe visual in Figure 1 provides an example of other forms of fraud that are likely to continue\nto be of interest in the near future to criminals already beginning to adapt to the transition\nthat the closure of the PUA federal program has brought. We anticipate that criminals will\ncontinue to target PUA account balances that are still in the process of filing claims even\nafter the federal deadline due to exceptions that may have been granted to individuals who\nhad their claims frozen or put on indefinite hold. This was a relatively common event over the\n[past year given the massive volume of PUA claims placed into a backlog status by state](https://www.13newsnow.com/article/money/virginia-pua-payments-now-available-again-vec-still-behind-on-15000-claim-reviews/291-413fd380-c434-4863-8c2d-96c12c32f7bc)\ngovernments who had to contend with the task of sorting fictitious claims from legitimate\nones. More broadly, although the PUA program expired in September 2021, the methods\nused by the actors to brute force accounts on these government websites, combined with the\nrelative ease with which actors can steal funds intended for US citizens, indicate that similar\ngovernment assistance programs may be targeted in the future. Figure 4 below shows the\noverall fluctuation in mentions of either “PUA'' or “SBA” within underground sources\nmonitored by Recorded Future, with the volume of posts closely mirroring one another given\nhow intertwined promotions for these services are within the same posting. Another point of\nconsideration is the sudden uptick in discussion within several threads even after the\ntermination of the federal programs for both topic areas.\n\n**_Figure 4: Comparison Between References to “PUA” (Upper) & “SBA” (Lower) Within_**\n_Underground Sources (Past 60 Days), Source: Gemini Advisory Data_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-28 - Termination of Federal Unemployment Programs Represents Turning Point for Fraudsters.pdf"
    ],
    "report_names": [
        "2021-10-28 - Termination of Federal Unemployment Programs Represents Turning Point for Fraudsters.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535882,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653703783,
    "ts_modification_date": 1653703783,
    "files": {
        "pdf": "https://archive.orkl.eu/a62c90664aed4bea1f3ace824afd91c77fddb0c1.pdf",
        "text": "https://archive.orkl.eu/a62c90664aed4bea1f3ace824afd91c77fddb0c1.txt",
        "img": "https://archive.orkl.eu/a62c90664aed4bea1f3ace824afd91c77fddb0c1.jpg"
    }
}