{
    "id": "4709677c-39aa-4b46-8e30-af5775cc85a4",
    "created_at": "2023-01-12T15:02:14.403759Z",
    "updated_at": "2025-03-27T02:05:51.209892Z",
    "deleted_at": null,
    "sha1_hash": "21b4372c21b5fec6928b765a5b56b17782424785",
    "title": "2021-03-03 - Mitigate Microsoft Exchange On-Premises Product Vulnerabilities",
    "authors": "",
    "file_creation_date": "2022-05-29T01:06:25Z",
    "file_modification_date": "2022-05-29T01:06:25Z",
    "file_size": 370126,
    "plain_text": "# Mitigate Microsoft Exchange On-Premises Product Vulnerabilities\n\n**cisa.gov/ed2102**\n\nCISA partners have observed active exploitation of vulnerabilities in Microsoft Exchange onpremises products. Neither the vulnerabilities nor the identified exploit activity is currently\nknown to affect Microsoft 365 or Azure Cloud deployments. Successful exploitation of these\nvulnerabilities allows an attacker to access on-premises Exchange Servers, enabling them to\ngain persistent system access and control of an enterprise network.\n\nCISA has determined that this exploitation of Microsoft Exchange on-premises products\nposes an unacceptable risk to Federal Civilian Executive Branch agencies and requires\nemergency action. This determination is based on the current exploitation of these\nvulnerabilities in the wild, the likelihood of the vulnerabilities being exploited, the prevalence\nof the affected software in the federal enterprise, the high potential for a compromise of\nagency information systems, and the potential impact of a successful compromise.\n\n[CISA issued ED 21-02 requiring federal civilian departments and agencies running Microsoft](https://www.cisa.gov/emergency-directive-21-02)\nExchange on-premises products to update or disconnect the products from their networks\nuntil updated with the Microsoft patch.\n\nCurrently, the vulnerabilities related to this known exploitation activity include CVE-202126855, CVE-2021-26857, CVE-2021-26858, CVE-2021-27065. According to Microsoft and\nsecurity researchers, the following vulnerabilities are related yet not known to be exploited:\nCVE-2021-26412, CVE-2021-26854, CVE-2021-27078.\n\n[CISA published a Remediating Microsoft Exchange Vulnerabilities web page that strongly](https://us-cert.cisa.gov/remediating-microsoft-exchange-vulnerabilities)\nurges all organizations to immediately address the recent Microsoft Exchange Server\nproduct vulnerabilities. As exploitation of these vulnerabilities is widespread and\nindiscriminate, CISA strongly advises organizations follow the guidance laid out in the web\npage. The guidance provides specific steps for both leaders and IT security staff and is\napplicable for all sizes of organizations across all sectors.\n\n\n-----\n\n## Emergency Directive\n\n[CISA Updates the Supplemental Direction on Emergency Directive 21-02: On April 13, CISA](https://www.cisa.gov/emergency-directive-21-02)\nupdated the emergency directive for on-premises Microsoft Exchange servers and requires\nthat agencies immediately apply the Microsoft April 2021 update to all affected Exchange\nServers.\n\nCISA [Emergency Directive 21-02: CISA issued](https://www.cisa.gov/emergency-directive-21-02) [Emergency Directive (ED) 21-02 on March 3,](https://www.cisa.gov/emergency-directive-21-02)\nrequiring federal civilian departments and agencies running Microsoft Exchange on-premises\nproducts to update or disconnect the products from their networks until updated with the\nMicrosoft patch.\n\n## Press Releases\n\nCISA Issues Emergency Directive Requiring Federal Agencies to Patch Critical Vulnerability |\nCISA: On March 3, CISA issued a press release announcing the launch of Emergency\nDirective (ED) 21-02 requiring federal civilian departments and agencies running Microsoft\nExchange on-premises products to update or disconnect the products from their networks\nuntil updated with the Microsoft patch.\n\n## Alerts and Guidance\n\n[MAR-10330097-1.v1: DearCry Ransomware identifies ransomware that has been used to](https://us-cert.cisa.gov%20https/us-cert.gov/ncas/analysis-reports/ar21-102a)\nexploit compromised on-premises Exchange servers. The malware encrypts files on a device\nand demands ransom in exchange for decryption.\n\n[MAR-10331466-1.v1: China Chopper Webshell identifies a China Chopper webshell](https://us-cert.gov/ncas/analysis-reports/ar21-102b)\nobserved in post-compromised Microsoft Exchange Servers. After successfully exploiting a\nMicrosoft Exchange Server vulnerability for initial accesses, a malicious cyber actor can\nupload a webshell to enable remote administration of the affected system.\n\n[On March 31, CISA issued supplemental guidance to ED 21-02. The supplemental guidance](https://www.cisa.gov/emergency-directive-21-02)\nprovides additional forensic triage and server hardening requirements for federal agencies.\nSpecifically, the supplemental direction requires agencies to run newly developed tools—\nMicrosoft’s Test-ProxyLogon.ps1 script and Safety Scanner (MSERT)—to investigate\nwhether their Microsoft Exchange Servers have been compromised.\n\n[Updates on Microsoft Exchange Server Vulnerabilities: On March 13, CISA has added seven](https://us-cert.cisa.gov/ncas/current-activity/2021/03/13/updates-microsoft-exchange-server-vulnerabilities)\nMalware Analysis Reports (MARs) to Alert AA21-062A: Mitigate Microsoft Exchange Server\nVulnerabilities.\n\n[FBI-CISA Joint Advisory on Compromise of Microsoft Exchange Server: On March 10, CISA](https://us-cert.cisa.gov/ncas/current-activity/2021/03/10/fbi-cisa-joint-advisory-compromise-microsoft-exchange-server)\nand the Federal Bureau of Investigation (FBI) have released a Joint Cybersecurity Advisory\n(CSA) to address recently disclosed vulnerabilities in Microsoft Exchange Server.\n\n\n-----\n\n[Mitigate Microsoft Exchange On-Premise Product Vulnerabilities: This document, published](https://www.cisa.gov/publication/mitigate-microsoft-exchange-premise-product-vulnerabilities)\nMarch 6, details actions needed to mitigate vulnerabilities addressed in ED- 2102.\n\n[Microsoft IOC Detection Tool for Exchange Server Vulnerabilities: Released March 6, This](https://www.us-cert.gov/ncas/current-activity/2021/03/06/microsoft-ioc-detection-tool-exchange-server-vulnerabilities)\nCurrent Activity Alert addresses a Microsoft released of [updated script] that scans\nExchange log files for indicators of compromise (IOCs) associated with the [vulnerabilities]\ndisclosed on March 2, 2021.\n\n[Microsoft Releases Alternative Mitigations for Exchange Server Vulnerabilities: On March 5,](https://us-cert.cisa.gov/ncas/current-activity/2021/03/05/microsoft-releases-alternative-mitigations-exchange-server)\nCISA issued a Current Activity containing information on Microsoft's release of alternative\nmitigation techniques for Exchange Server customers who are not able to immediately apply\n[updates that address vulnerabilities disclosed on March 2, 2021.](https://msrc-blog.microsoft.com/2021/03/02/multiple-security-updates-released-for-exchange-server/)\n\n[CISA Issues Emergency Directive and Alert on Microsoft Exchange Vulnerabilities | CISA:](https://us-cert.cisa.gov/ncas/current-activity/2021/03/03/cisa-issues-emergency-directive-and-alert-microsoft-exchange)\nOn March 3, CISA has issued Emergency Directive (ED) 21-02 and Alert AA21-062A\naddressing critical vulnerabilities in Microsoft Exchange products.\n\n[Mitigate Microsoft Exchange Server Vulnerabilities | CISA: On March 3, CISA issued an](https://us-cert.cisa.gov/ncas/alerts/aa21-062a)\nActivity Alert. This Alert includes both tactics, techniques and procedures (TTPs) and the\nindicators of compromise (IOCs) associated with this malicious activity. This Alert was\nupdated on March 14 with seven Malware Analysis reports.\n\n[Microsoft Releases Out-of-Band Security Updates for Exchange Server | CISA: On March 2,](https://us-cert.cisa.gov/ncas/current-activity/2021/03/02/microsoft-releases-out-band-security-updates-exchange-server)\nCISA issued a Current Activity Alert with information related to Microsoft’s released out-ofband security updates to address vulnerabilities affecting Microsoft Exchange Server 2013,\n2016, and 2019.\n\n[Was this webpage helpful? Yes |](https://www.cisa.gov/forms/feedback) [Somewhat |](https://www.cisa.gov/forms/feedback) [No](https://www.cisa.gov/forms/feedback)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-03 - Mitigate Microsoft Exchange On-Premises Product Vulnerabilities.pdf"
    ],
    "report_names": [
        "2021-03-03 - Mitigate Microsoft Exchange On-Premises Product Vulnerabilities.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535734,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653786385,
    "ts_modification_date": 1653786385,
    "files": {
        "pdf": "https://archive.orkl.eu/21b4372c21b5fec6928b765a5b56b17782424785.pdf",
        "text": "https://archive.orkl.eu/21b4372c21b5fec6928b765a5b56b17782424785.txt",
        "img": "https://archive.orkl.eu/21b4372c21b5fec6928b765a5b56b17782424785.jpg"
    }
}