{
    "id": "471f6366-f620-4e50-a0b3-d8b967f4c76e",
    "created_at": "2023-01-12T15:00:46.000026Z",
    "updated_at": "2025-03-27T02:05:33.296389Z",
    "deleted_at": null,
    "sha1_hash": "6b91930ccb63c40f8a36a378e274b27bc2c7aa55",
    "title": "2020-10-12 - Trickbot- U.S. Court Order Hits Botnet’s Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T22:07:17Z",
    "file_modification_date": "2022-05-28T22:07:17Z",
    "file_size": 499473,
    "plain_text": "# Trickbot: U.S. Court Order Hits Botnet’s Infrastructure\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/trickbot-botnet-ransomware-disruption](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/trickbot-botnet-ransomware-disruption)**\n\nFigure. How the Trickbot botnet works\n\n## What is Trickbot?\n\n\n-----\n\nTrickbot is a major botnet consisting of computers that have been infected with the Trickbot\nTrojan (Trojan.Trickybot). The Trojan is modular in nature, meaning it can easily be\ncustomized with one or more of an array of custom components designed to carry out a\nrange of malicious activities on infected computers. To date, it has mainly been used for two\nmain purposes: stealing credentials from infected computers and acting as a distribution\nchannel for other malware. Symantec believes that Trickbot’s operators earn most of their\nrevenue from selling stolen credentials on the cyber underground and leasing out the botnet\nas a distribution channel for other malware authors.\n\nTrickbot is spread through spam and phishing email campaigns which usually bear a\nMicrosoft Word attachment containing malicious macros. If the document is opened by the\nunsuspecting user, Trickbot will be installed on the victim’s computer. In some cases, other\nmalware, particularly ransomware, is also installed on the victim’s computer.\n\nTrickbot will also attempt to leverage known software vulnerabilities to move across the\nvictim’s network and install itself on other computers.\n\n## How Trickbot works\n\nTrickbot is modular malware, capable of performing a range of different malicious activities.\nThe first module to be installed on the victim’s computer is the loader, which contains an\nencrypted list of IP addresses from which it can download its main module.\n\nOnce downloaded, the main module will check the architecture of the victim computer and\nsave this along with the bot’s own information. The main component then prepares a\nframework for additional modules and initiates a connection to one of a pre-configured list of\ncommand and control (C&C) servers.\n\nThe main module downloads one or more additional modules. Known modules include:\n\nBanking credential stealer (injectDll): For injecting malicious content into browser\nwindows displaying banking websites in order to steal credentials\nReconnaissance module (networkDll): For gathering system information and\nnetwork/domain topology to determine whether the device can be infected with\nransomware\nData stealer (importDll): For stealing data from a web browser\nPassword grabber (Pwgrab: For stealing passwords from various locations\nCookie stealer (cookiesDll): For stealing cookies from the infected computer\nInformation stealer (mailsearcher): For searching all files in all drives in the system\nlooking for specific information\nPoint-of-Sale recon (psfin): Reconnaissance module to determine if there are any\nPoint-of-Sale (POS) devices connected\nRemote control module (vncDll): Virtual Network Computing (VNC) module\n\n\n-----\n\nSMB spreader (tabDll): For spreading over Server Message Block (SMB) using the\nEternalRomance exploit and other vulnerabilities patched by Microsoft in March 2017\n[(MS17-010)](https://docs.microsoft.com/en-us/security-updates/securitybulletins/2017/ms17-010)\nOutlook stealer (outlookDll): For stealing data saved by Microsoft Outlook\nLateral movement module (shareDll): For lateral movement/enumeration via\nLightweight Directory Access Protocol (LDAP) and SMB exploitation\nLateral movement module (wormDll): For lateral movement/enumeration via LDAP and\nSMB exploitation. The shareDll and wormDll modules work in cooperation.\nRDP brute-force module (rdpScanDll): A new module that uses brute-forces the\nRemote Desktop Protocol (RDP) for a specific list of victims\n\n## Stealthy threat\n\nTrickbot includes a number of features designed to minimize the risk of detection by security\nsoftware. For example, the main module is designed to evade execution within “sandboxes,”\nwhich are controlled environments used by security companies to analyze malware.\n\nThis module will also check the current user’s privileges and, if they have low privileges, it\nwill elevate them using User Access Control (UAC) bypass, a technique that allows\nexecution of programs with elevated privileges without the user being prompted.\n\nWhen it obtains elevated privileges, Trickbot will attempt to identify any security software that\nis installed on the computer and attempt to stop it and end any related services.\n\n## Credential theft\n\nOne of the main threats for Trickbot victims is credential theft. This is carried out by a module\nthat monitors for browser visits to a pre-configured list of banking websites. If the user visits\nany of these websites, the module intercepts and alters network traffic between the computer\nand the website, allowing the attackers to steal the victim’s banking credentials after they are\ninput by the user.\n\nTrickbot will also attempt to steal other credentials from Chrome and Internet Explorer’s\npassword storage features, from various RDP and SSH related services, and from other\npassword managers.\n\n## Immediate threat\n\nWhile infected computers are added to the Trickbot botnet, they yield the most value to\nattackers immediately after infection. Other malware families are usually delivered at the\npoint of initial infection. Credential theft happens immediately after infection, while banking\ncredentials are stolen the first time the victim attempts to log into their bank. Even if the\n\n\n-----\n\nmalware is subsequently detected and the computer is removed from the botnet, much of the\ndamage will have been done at this point, with stolen credentials exfiltrated by the attackers\nand likely sold to other cyber criminals.\n\n## Ongoing battle\n\nBy pooling resources and intelligence and utilizing available legal avenues, the information\nsecurity and financial sectors hope to strike a major blow against Trickbot. Symantec is\ngrateful for the leadership of Microsoft and FS-ISAC and the support of ESET, NTT, and\nLumen Technologies. This latest action, however, is just one step in an ongoing campaign.\nComplete eradication of this botnet will likely require additional actions from government\npartners in multiple jurisdictions. However, this action proves that successful private industry\ncollaboration can be effective in countering cyber-crime and we hope that this set a new\nprecedent for further initiatives.\n\n## Protection\n\nThe following protections are in place to protect customers against Trickbot activity:\n\nTrojan.Trickybot\nSONAR.Trickybot\nTrojan.Trickybot!g7\nTrojan.Trickybot!g8\nTrojan.Trickybot!g11\nTrojan.Trickybot!g13\nTrojan.Trickybot!g16\nTrojan.Trickybot!gen2\nTrojan.Trickybot!gen5\nTrojan.Trickybot!gm\n\n## Mitigation\n\nSymantec recommends users observe the following best practices to protect against Trickbot\nattacks:\n\n**Enable 2FA to prevent compromise of credentials.**\n**Harden security architecture around email systems to minimize the amount of**\nspam that reaches end-user inboxes and ensure you are following best practices for\nyour email system, including the use of SPF and other defensive measures against\nphishing attacks.\n**Restrict access to RDP Services: Only allow RDP from specific known IP addresses**\nand ensure you are using multi-factor authentication.\n\n\n-----\n\n**Implement proper audit and control of administrative account usage: You could**\nalso implement one-time credentials for administrative work to help prevent theft and\nusage of admin credentials.\n**Create profiles of usage for admin tools: Many of these tools are used by**\nransomware attackers to move laterally undetected through a network. A user account\nthat has a history of running as admin using PsInfo/PsExec on a small number of\nsystems is probably fine, but a service account running PsInfo/PsExec on all systems\nis suspicious.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-12 - Trickbot- U.S. Court Order Hits Botnet’s Infrastructure.pdf"
    ],
    "report_names": [
        "2020-10-12 - Trickbot- U.S. Court Order Hits Botnet’s Infrastructure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535646,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653775637,
    "ts_modification_date": 1653775637,
    "files": {
        "pdf": "https://archive.orkl.eu/6b91930ccb63c40f8a36a378e274b27bc2c7aa55.pdf",
        "text": "https://archive.orkl.eu/6b91930ccb63c40f8a36a378e274b27bc2c7aa55.txt",
        "img": "https://archive.orkl.eu/6b91930ccb63c40f8a36a378e274b27bc2c7aa55.jpg"
    }
}