{
    "id": "472457ce-9863-40ee-865e-f09b09d90798",
    "created_at": "2023-01-12T15:07:59.940361Z",
    "updated_at": "2025-03-27T02:06:02.602388Z",
    "deleted_at": null,
    "sha1_hash": "40acd08202415ff01a8403642b4f70aaf0be3067",
    "title": "2020-11-16 - Malicious Actors Target Comm Apps such as Zoom, Slack, Discord",
    "authors": "",
    "file_creation_date": "2022-05-28T23:51:49Z",
    "file_modification_date": "2022-05-28T23:51:49Z",
    "file_size": 551492,
    "plain_text": "# Malicious Actors Target Comm Apps such as Zoom, Slack, Discord\n\n**trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malicious-actors-target-comm-apps-such-as-**\nzoom-slack-discord\n\nIn our [2020 midyear report, we discussed how the Covid-19 pandemic had forced many](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup/securing-the-pandemic-disrupted-workplace-trend-micro-2020-midyear-cybersecurity-report)\norganizations to shift from physical offices to virtual ones — a change that also led to the rise\nof messaging and video conferencing apps as indispensable tools for communication. While\nthese apps have provided businesses a way of maintaining communication between\nemployees, they have also caught the eye of malicious actors who are always looking to\nintegrate new techniques in their malicious activities.\n\n## Zoom-based attacks have remained consistent\n\nNo other software has defined 2020 as much as the video conferencing app Zoom, which\nhas exploded in popularity since the start of the pandemic. Given its high usage rate among\nschools, businesses, and individuals, it’s no surprise that cybercriminals have been focusing\ntheir efforts on Zoom-based attacks.\n\nThe most well-known malicious activity involving Zoom is probably “Zoombombing,” which\ninvolves pranksters crashing a meeting and then performing disruptive actions, such as\nspamming pornographic content or even just generally being a nuisance.\n\nWhile annoying, Zoombombing is typically harmless in terms of security. On the other hand,\nwe’ve encountered Zoom-related attacks that involve actual malware, which can potentially\nbe more damaging to organizations and individuals. The most common Zoom-related attack\ntechnique is the use of Zoom installers bundled with malware.\n\n\n-----\n\nIn some cases, the attackers use fake Zoom installers to trick users into installing them on\ntheir machines. We encountered an example of this in May, after we found samples of\n[malware files that were disguised as fake Zoom installers. While it could be difficult for the](https://blog.trendmicro.com/trendlabs-security-intelligence/backdoor-devil-shadow-botnet-hidden-in-fake-zoom-installers/)\naverage user to distinguish the legitimate Zoom app from the fake ones, closer inspection\nshows that the malicious versions have significantly larger file sizes.\n\nFigure 1. The file size of malicious Zoom copies compared with that of the legitimate installer\n\nOne of the malware samples (Trojan.Win32.ZAPIZ.A) is a backdoor with remote access\nfeatures, allowing the attacker to gain access to the infected machine to perform malicious\nactions, such as stealing information. The other sample\n(Backdoor.Win32.DEVILSHADOW.THEAABO) has an installer that consists of a file\ncontaining malicious commands. Interestingly, both compromised installers installed a\nlegitimate version of Zoom, likely to hide evidence of malicious activity from the user.\n\nAside from using compromised installers, we also found instances where malicious actors\nbundled legitimate installers with malware files. In April, we discovered an attack that used\n[real Zoom installers that came with the RevCode WebMonitor RAT](https://www.trendmicro.com/en_us/research/20/d/webmonitor-rat-bundled-with-zoom-installer.html)\n(Backdoor.Win32.REVCODE.THDBABO). This malware variant allows its operator to\nexecute commands remotely, such as adding or deleting files, recording keystrokes, and\ngathering information.\n\nAnother example of this is the ZAPIZ malware (Trojan.Win32. ZAPIZ.A), a trojan that also\ncomes bundled with a legitimate Zoom installer. Once downloaded, it will kill all running\nremote utilities, after which it will use PORT =5650/TCP for remote inbounding.\n\nBased on our analysis, ZAPIZ will perform information theft, gathering the target machine’s\nusernames and its machine name — perhaps as a prelude to further attacks.\n\nWe also found an email sample where a malicious actor tried to extort money from the victim\nby threatening them with the release of compromised video footage — allegedly acquired via\na hacked camera.\n\n\n-----\n\nFigure 2. Email threatening the victim with release of compromised video footage\n\n## Abuse of other communication apps such as Discord and Slack\n\nWhile Zoom remains perhaps the most popular communication app during the pandemic, it’s\nnot the only one that cybercriminals have abused. We found evidence of attacks that\nintegrate other communication services — specifically Slack and Discord — into their\nroutines.\n\nSlack has earned a loyal following over the years, with over 10 million daily active users as of\n2019. However, we also found evidence of malicious actors making use of some of its\nfeatures.\n\nWe recently found a ransomware variant (Ransom.Win32.CRYPREN.C) that, on the surface,\nseems fairly standard in terms of capabilities. It encrypts files with the following extensions\n(after which it will append the .encrypted suffix):\n\n.bmp\n.doc\n.docx\n.gif\n.jpeg\n\n\n-----\n\n.jpg\n.m2ts\n.m4a\n.mkv\n.mov\n.mp3\n.mp4\n.mpeg\n.mpg\n.pdf\n.png\n.ppt\n.pptx\n.txt\n.xls\n.xlsx\n\nFigure 3. The ransom note for the Crypren ransomware\n\nWhat makes Crypren interesting is its use of Slack webhooks to report its victims’ encryption\nstatus back to its command-and-control (C&C) server — a technique we haven’t\nencountered before.\n\n\n-----\n\nCurrently, it only sends back a minimal amount of data, namely computer and user names,\nthe number of infected files, and the infection timestamp — indicating that the use of Slack\nfor infection status reporting might still be in its testing phase.\n\nDiscord is another communication software that shares similar features with Slack (while\nalso being notable for its widespread use in gaming communities). We found samples that\nshow how malicious actors are using Discord as part of a campaign involving malicious\nspam emails that eventually end in an AveMaria or AgentTesla malware infection. We first\nobserved the use of malicious spam to deliver these malware families in 2019 — however,\nthe addition of Discord as part of its attack routine is relatively recent.\n\nThe malicious emails are typically either postal delivery notifications or invoices with an\nincluded DHL or TNT-themed attachment:\n\nFigure 4. Spam mail sample\n\n\n-----\n\nThese emails come with embedded links — either in the images or the text — that point to a\nDiscord URL with the following format:\nhxxps://cdn[.]discordapp[.]com/attachments/{ChannelID}/{AttachmentID}/example[.]exe.\nThese URLs are used to host AveMaria and AgentTesla, which will then infect the users’\nmachines once they click on the executable.\n\nThe use of legitimate apps such as Slack and Discord as part of an attack may come down\nto a few simple reasons: they’re well-known, widely used, free, and provide some form of\nanonymity. Furthermore, users are not even required to have the apps installed to download\nfiles from them, making the process streamlined and efficient. Another possible reason that\nexplains these programs' use is that they can pass off as normal legitimate network\ncommunication. Their popularity also amounts to a high chance that employees and endusers are already using these services.\n\n## Defending against attacks that abuse communication apps\n\nFortunately, defending against these types of attacks is relatively straightforward. In the case\nof the Zoom installers, the commonality between the attacks is that they are downloaded\n[from places other than the official Zoom download page. The simplest way to avoid infection](https://zoom.us/download)\nis to download communications apps (and all apps in general) only from official channels.\nThis will ensure that the software is free from tampering.\n\nUsers should also avoid clicking on any links or downloading attachments from suspicious or\nunverified emails. If unsure, it would be a good idea to double-check with the alleged sender\nto confirm if they were the ones who sent the email.\n\nHIDE\n\n**Like it? Add this infographic to your site:**\n\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste\nthe code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-16 - Malicious Actors Target Comm Apps such as Zoom, Slack, Discord.pdf"
    ],
    "report_names": [
        "2020-11-16 - Malicious Actors Target Comm Apps such as Zoom, Slack, Discord.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536079,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653781909,
    "ts_modification_date": 1653781909,
    "files": {
        "pdf": "https://archive.orkl.eu/40acd08202415ff01a8403642b4f70aaf0be3067.pdf",
        "text": "https://archive.orkl.eu/40acd08202415ff01a8403642b4f70aaf0be3067.txt",
        "img": "https://archive.orkl.eu/40acd08202415ff01a8403642b4f70aaf0be3067.jpg"
    }
}