{
    "id": "472ae869-0aa5-48f7-91e4-9d98d7374566",
    "created_at": "2023-05-06T02:08:29.336494Z",
    "updated_at": "2025-03-27T02:10:04.301491Z",
    "deleted_at": null,
    "sha1_hash": "730c4c954a9e861d517fd173172cdbfda87870c0",
    "title": "2016-09-27 - Threat Spotlight- GozNym",
    "authors": "",
    "file_creation_date": "2023-05-05T01:57:29Z",
    "file_modification_date": "2023-05-05T01:57:29Z",
    "file_size": 276863,
    "plain_text": "# Threat Spotlight: GozNym\n\n**blog.talosintelligence.com/goznym/**\n\nEdmund Brumaghin September 27, 2016\n\nBy [Edmund Brumaghin](https://blog.talosintelligence.com/author/edmund-brumaghin/)\n\nTuesday, September 27, 2016 10:09\n\n_This blog was authored by Ben Baker, Edmund Brumaghin and Jonah Samost._\n\n## Executive Summary\n\nGozNym is the combination of features from two previously identified families of malware,\nGozi and Nymaim. Gozi was a widely distributed banking trojan with a known Domain\nGeneration Algorithm (DGA) and also contained the ability to install a Master Boot Record\n(MBR) rootkit. Nymaim emerged in 2013 as malware which was used to deliver\nransomware and was previously distributed by the Black Hole exploit kit. The code had\nvarious anti-analysis techniques, such as the obfuscation of Win32 API calls.\n\n\n-----\n\nThere have been multiple instances in which the source code of the Gozi trojan has been\n[leaked. Due to these leaks it was possible for the GozNym authors to make use of the ‘best](https://github.com/gbrindisi/malware/tree/master/windows/gozi-isfb)\nof breed’ methodologies incorporated into Gozi and create a significantly more robust piece\nof malware which was now capable of utilizing strengthened persistence methods and\nultimately becoming a powerful banking trojan.\n\nGiven the recent success of the GozNym trojan and the number of targeted attacks seeking\nto infect victims with this malware, Talos decided to take a deep look at the inner workings\nof this particular malware family. Talos started by examining the binaries associated with\nGozNym as well as the distribution mechanisms. Additionally, we were able to successfully\nreverse engineer the DGA associated with a GozNym command and control (C2)\ninfrastructure and sinkhole that botnet. This gave Talos great visibility into the size and\nscope of this threat and the number of infected systems beaconing to C2 servers under\nadversarial control.\n\n## A Constantly Evolving Threat\n\nIn analyzing available telemetry data, Talos uncovered four different variants of GozNym\nthat exhibited slightly different characteristics with respect to the Domain Generation\nAlgorithms (DGAs) used to generate the list of C2 servers to connect to. However, it is\npossible that they were all created and deployed by the same threat actor or group as there\nare several overlaps in regards to the use of the same C2 infrastructure, where the binaries\nwere being distributed from, and the phishing campaigns associated with the distribution of\nthe samples. In several cases, samples using different variations of the DGA contacted the\nsame C2 servers. Likewise, servers used to distribute the malicious binaries were observed\nserving up multiple variants of GozNym.\n\n## Initial Infection Vector\n\nTalos identified several spear phishing campaigns which were used to distribute the\nGozNym malware. The downloader was delivered via Microsoft Word documents containing\nVBA macros which were responsible for executing HTTP GET requests to download and\nexecute a malicious binary. Analysis of the emails associated with these spear phishing\ncampaigns showed that the adversary was selective and actively attempting to stay under\nthe radar.\n\nThe theme of this spear phishing campaign was similar to others commonly seen in emailbased threats whereby messages will be directed to the recipient to open an attached \"tax\ninvoice\" or \"payment document\". The adversary took the time to profile each of the\norganizations targeted in these campaigns. In many cases that Talos analyzed, a single\nemail was sent to each organization with the sole recipient being an employee in the\n\n\n-----\n\naccounting or finance department of the targeted organization. Additionally, the contents of\neach message were tailored to the organization and featured attachment names also\nappropriately tailored.\n\n**Figure 1: Email with Subject: Invoice [Random Digits] for [Org Name] via Intuit**\n**QuickBooks**\nIn one such campaign we observed the attached MS Word documents containing the\nmalicious VBA macros were made to appear as legitimate payment invoices from Bank of\nAmerica. The actor also tried to further convince the user to enable macros within Microsoft\nword by providing a notification prompt.\n\n\n-----\n\n**Figure 2: Example Attachment #1**\nIn another campaign, the attachment was delivered as a \"Tax Invoice\", and images included\nreferences to Intuit QuickBooks. The same notification was used again to try and coerce the\nvictim to enable macros.\n\n\n-----\n\n**Figure 3: Example Attachment #2**\nIn the event that macros are enabled by the victim, the VBA downloader is then used to\nretrieve a malicious binary from an attacker controlled web server and executed locally on\nthe system. We extracted the VBA macros from a Microsoft Word document which resulted\nin the following obfuscated code:\n\n\n-----\n\n**Figure 4: Example Obfuscated Downloader**\nThe VBScript has been obfuscated using ROT substitution and different base values have\nbeen used throughout to determine how to rotate. Once the obfuscation has been removed,\nit is obvious exactly what this script intends to do, which is to download a binary and\nexecute it, thus infecting the system.\n\n\n-----\n\n**Figure 5: Example**\n\n**Deobfuscated Downloader**\n\n## Analyzing GozNym\n\nOnce the malicious binary has been executed, the malware unpacks itself and allocates a\nbuffer into the rundll32.exe process and copies its unpacked contents into it. More\nspecifically, it executes rundll32.exe using a fake command argument consisting of a\nrandom command line option and a random DLL name. It must be noted that this is not the\nstandard way to call to rundll32.exe, and that the dll does not actually exist. The malware\nwill attempt to inject the main unpacked data into this process. If successful, it will begin\ncommunications with the C2 servers.\n\n**Example: rundll32.exe -ya ngfk.dll**\n\nThe GozNym samples Talos analyzed used several anti-analysis and obfuscation\ntechniques in an attempt to make analysis more difficult and time consuming. One\nobfuscation technique employed by the authors of this malware is related to the way in\n\n\n-----\n\nwhich API calls were obfuscated. The sample implements its own method for importing\nfunctions, resolving their addresses in a custom way, at runtime. API calls are done by\npushing two hard coded values to the stack, then jumping to a complex function that is\nresponsible for resolving the API call.\n\nAll of the function calls are done from the same instruction: a JMP located at a fixed\naddress in memory. The return address is not the real call point, but a randomly chosen\ngadget in a library function that will always contain the instruction CALL EBX. EBX contains\na given address in the API resolution code. This code adjusts the stack then returns back to\nthe actual caller. By using this method, the malware obfuscates the address at which the\nAPI function is called - the analyst will not be able to obtain the actual caller address when\nthe API function is called or when it returns back, because it will not reside in the stack.\nAdditionally, control flow is obfuscated, computing the target address of JMP/CALL\ninstructions at runtime. Similarly, constants are XORed, and decoded by calling a function\nthat accepts a parameter in EAX, then returns the deobfuscated constant into EAX.\n\nAnother control flow redirection obfuscation consists of creating a thread to execute a\ngadget that returns into the address pointed by the parameter passed to the thread function,\nthat is itself a shellcode that jumps into a different function through a CALL EAX.\n\nGozNym contains at least one encrypted memory region which is only decrypted ondemand. The sample that was analyzed uses a function to copy individual data items to and\nfrom this memory region, in such a way that all of the data inside this region is always\nencrypted and the decrypted data resides in memory temporarily. The malware makes\nheavy use of custom structures to store and pass data during execution, and well as to\nimplement custom thread synchronization mechanisms.\n\n## C2 Characteristics & Encryption\n\nThe malware initially attempts to determine if the infected system has internet connectivity\nby performing a DNS to query for the A records of google.com and microsoft.com. Later, it\nattempts to query for its pseudo-randomly generated domains using Google's DNS servers\n(8.8.8.8 and 8.8.4.4). Once it has found a running C2 server, GozNym uploads system\nsurvey information to the server via RC4 encrypted HTTP POST requests. The system\nsurvey includes a Machine ID, Windows Version, as well as checksums of username,\ncomputer name, and encryption keys stored in the sample. The RC4 encryption key is\ngenerated using a partial key stored in the binary, followed by a randomly generated series\nof bytes. GozNym builds a buffer containing the randomly generated part of the key, the\nencrypted data, as well as the sizes of both of these byte arrays. It then Base64 encodes\nthis buffer, and sends it as HTTP POST data to a C2 server.\n\n\n-----\n\nGozNym puts a lot of effort into being difficult to detect in network traffic. Every field in the\nC2 communications is either randomly generated or encrypted using the partially-random\nkey. The URL arguments can be randomly generated with a random number of arguments\nor can be hardcoded in the malware configuration data. The domains are randomly\ngenerated and the User-Agent strings are generated by Windows API and therefore not\nstatic.\n\n## Reversing the DGA\n\nTalos discovered multiple DGA variants with differing configurations, and chose to report indepth on the most interesting one. We are actively working to sinkhole all of the botnets that\nwe find. GozNym supports two stages of operation in order to find a viable command and\ncontrol IP. Additionally, it supports two methods of querying domains: a simple\ngethostbyname API call and a more complex custom DNS protocol implementation using\neither 8.8.4.4 or 8.8.8.8 as its server. In the latter, it will send UDP packets and parse the\nresponse to retrieve a DNS resolution.\n\n### Stage 1\n\nIn the first stage of DGA, a variation of the XORShift Pseudo-Random Number Generator\n(PRNG) is used to create a list of fifteen domains. The PRNG is seeded with a bit-shifted\nvalue of the current day, as well as two hard coded DWORDs. Each domain is between 5\nand 12 lowercase letters long, followed by a randomly selected TLD of .net, .com, .in, or\n.pw. GozNym then uses Google’s DNS server to query each domain, and checks if the IP\nresponses are publicly routable. Once it resolves 2 different IPs, it uses those in the second\nstage of the DGA.\n\n### Stage 2\n\nGozNym uses the same DGA functions, but this time replacing the hard coded DWORD\nseeds with the IP addresses from the first stage DNS query. GozNym creates a new list of\n128 domains ordered into a ‘semi-colon-separated-value’ string, but instead of resolving\nthem, it forces the first domain in the list to use the TLD of .com. In this process, it finds the\nfirst “.” character and substitutes the next 4 characters by “com;”. Considering that the DGA\nalgorithm generates TLDs of both 2 or 3 characters as stated above, a single character\nfrom the second domain may be overwritten.\n\nNext it creates a CRC32 hash of the entire domain list, and a second hash based on XOR\nand bit rotation, to finally sum up the two hashes. It looks for the result in a table of 360\nhashes embedded in the binary, which means the developers have already calculated\nwhich seeds and second stage domains they intend to use for at least 360 days. If the hash\n\n\n-----\n\nis inside the table, gethostbyname is used to query the first domain in the list. By default,\ngethostbyname returns a single IP address that a domain resolves to but may return\nseveral. The second stage domains we’ve observed used four IP addresses for this stage.\n\nGozNym then uses XOR and SUB operations to transform the IPs from the DNS response\nto usable IPs. One of the IPs correspond to a checksum of the rest. In order to validate the\nchecksum, it iterates every IP to check if it corresponds to the checksum of the rest. When it\nfinds this checksum, it removes it from the IP list and returns back the list of IPs. If it cannot\nverify the IP list checksum, it will return no IP.\n\nThe last check is performed after the first initial contact. The server will return an encrypted\nlist of 4 hashes corresponding to the domain resolved in the second stage. If the checksum\ndoes not match, the sample will not continue processing the contents of the response.\n\n## Sinkholing the Unsinkable\n\nGozNym’s DGA authentication can seem daunting at first, with 32 bits from a transformed\nversion of the date, followed by 64 bits of entropy from IPs received from the first DNS\nresponse. Those 96 bits are used for seeding the random number generator, then\nconstructing a string with 128 randomly generated domains and verifying the checksum of\nthe result. The critical flaw in this authentication is the fact that the final checksum is only 32\nbits, which is relatively easy to brute force. Brute forcing scales exponentially with length, so\ntrying all possible seed IPs (64 bits of entropy) would take over 4 billion times as long as\nbrute forcing any seeds that matches the 32 bit hash.\n\nTalos developed scripts to replicate GozNym’s DGA and brute force valid IP ranges to find\nvalid Second Stage DGA seeds. The date is non-trivially incorporated in the seeding\nprocess, so we had to brute force a new set of seed IPs for each day we wanted to\nsinkhole. Each attempt required around 1000 calls to the PRNG to generate each character\nin the domain list, as well as CRC32 hashing the domain list. The probability of any random\nset of seed IPs causing a hash collision is about 1 in 11 million. We were able to generate\none hash collision per 5 hours using a pretty beefy desktop computer. Each hash collision\nmeant that for a single day, we had found a working set of seed IPs and the domain\nGozNym would attempt to contact after receiving those seed IPs.\n\nAnother big mistake in GozNym’s DGA was in the way it treated the list of first stage\ndomains. If the first domain in the list returned a valid set of seed IPs, GozNym would never\nattempt to contact any other domains in that list. By using a hash collision on the first\ndomain, we could prevent GozNym victims from attempting to contact any of the other\ndomains in the list. The machines infected with GozNym would beacon to our sinkhole\nserver once, then get stuck in a loop with lots of sleeping and occasionally querying\nGoogle’s DNS for our sinkholed domains.\n\n\n-----\n\n## Profiling the Botnet\n\nOur sinkhole server received 23,062 beacons within the first 24 hours of sinkholing\nGozNym. Each infected machine would only send one beacon before realizing we weren’t\nresponding, so that roughly corresponds to one beacon per victim. The most notable\nexception would be sandboxes, which may beacon out several times from a small set of\nIPs. We received beacons from 1854 unique IPs.\n\nHere is a breakdown of the top countries from which beacons were received:\n\n**Figure 6: GozNym Unique IPs by Country**\n\n## Conclusion\n\nAs can be seen from the characteristics associated with the spam campaigns used to\ndistribute GozNym to potential victims, a good deal of effort was spent determining who to\ntarget within organizations and spear phishing was used in an effort to evade detection and\navoid alerting administrators. Additionally, the anti-analysis and evasion techniques\nemployed by the malware indicate that the malware authors were concerned with making\nanalysis by security analysts more difficult and time consuming. Spear phishing attacks\ncontinue to be used by threat actors attempting to infect organizations. This is likely due to\nthe continued success of these types of attacks. GozNym highlights the dangers of phishing\ncampaigns and the importance of ensuring that organizations are protected from these\ntypes of threats. As shown by our analysis, GozNym is a constantly evolving threat that will\nlikely continue to morph moving forward as attackers seek to add additional features and\nimprove upon the ones currently present within the trojan.\n\n\n-----\n\nTalos is also releasing the following scripts that can be used to perform analysis of GozNym\nsamples:\n\n**DGA_release.py which simulates the DGA used by GozNym.**\n**Extract_parameters_from_http_post.py which extracts parameters from the HTTP**\nPOST requests that are sent to C2 servers.\n**Decrypt_response.py which allows for a decryption of the response payload. These**\n[tools are available in the Talos Github repository located here.](https://github.com/vrtadmin/goznym)\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](http://www.cisco.com/c/en/us/support/security/amp-firepower-software-license/tsd-products-support-series-home.html)\nmalware used by these threat actors.\n\n[CWS or](http://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [WSA web scanning prevents access to malicious websites and detects malware](http://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\nused in these attacks.\n\n[The Network Security protection of IPS and](http://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html) [NGFW have up-to-date signatures to detect](http://www.cisco.com/c/en/us/products/security/asa-next-generation-firewall-services/index.html)\n[malicious network activity by threat actors. ESA can block malicious emails sent by threat](http://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\nactors as part of their campaign.\n\n## Indicators of Compromise\n\n### Maldocs (SHA256):\n\nbf1601d89f816312278ac09b0c21acdc854c4d21e1443f5170b49c5f64ffcc11\n\n4b2cda69112b4d25c25da0df18cad55dd78fed78e9525c1f48ff5b86517af505\n\n48e7c4357cb3f19ca931951b502fcb4a50c18240d2b21c08e54f7086dde35637\n\nc31878e2250f105b1ac52f9584d9f3d67fd07f2795c20cd1fdbe738fa24f639b\n\n4b9f9894953843c5929885e7ca0bfc16fd6b718c7567f83f6cc6881b0c17fb48\n\ne00d90dea174fa51b07d2d991614630721c04d12810fe72a40dea8fd6edfa3f1\n\nfa4f949b0bd6c4f07aee82027c40521ccdc6f4f3d930335caa6dc9bc2fab5140\n\n\n-----\n\na68cec90af59daa1e71b4a0c5cf07c62ddc5440e9b1d4303bd111526d0972881\n7e42ec7809fd48590c1eb6c5f936187ce7c31177adff831837e9bcc7549ed440\n\n8ea0d38bd3857adc74eebafc548393ca982dbd7cb3a89a0499e453b05938cb6b\n\naabd5d71c4251f8a56a0434c37ed88aba73d44bd45a66d054123c86665428778\n361231d27c6fe4d3f9176c7c5ebfba96618d15ea29f52625ae522054f81115a0\n\n7b90dcf26d56cc4b6325675cb973f122c2d98904eff540afd917b0552aa9c68b\n\n169384f163eb14b23d2bab8a9269ebd8940b0ec51bcd1767d03c43052c0bb139\n\n443f5760fda53f19db6f483c2fcce5658bebaa3d40a9e535e7de4723f3b40e13\n\n212aded63a3af0996f183da175dbd69ad830299cf3b8d97c7e10535c50b29de9\n\n31c4ae8dbf12f4f9999929602cf24179011c30d1599d36db190af7d85ed2ac1b\n\na56c177c39bfaa4c50d28b549f7b509299135e0bcd82fb694b21bcbde90a7c66\n\n328fa5803334650ac130105c08251d47a3f447f114ead9d012308e11769379cc\n\n06580e38fe29b2e7ce3a53df4c5ccb389eaa21b8a2f0f4e2dbd880b3c5c5a4cd\n\nc16036c5fc0c25970ba55e5e9d1bb0be8a4044f39495679deb4900c12c1e57e3\n\n46001cf7063cffc00f2fcea7828084f6537e7cc500f3372b2014ca42b21a0dcc\n\ncc86b2b5939ba56a33395121a618c61cfb7cde19fa76231a3a5e872bf1262f34\n\n### Malicious Binaries (SHA256)\n\n17aa5711b59e389ffb65294b8281d3b5f39ca18ac1ac861327e7d8548f49a4d3\n\neb10ec30f2fec3830daee6ad502e527ad6ef67e4591d545b1a84dde300b3edb5\n55f9cd6cbed53ccc26d6d570807a18f91d9d8c10db352524df424f356d305a6e\n\nc58d987be377e4fa3d512a21fdb522bd894b8d91536330a9abebbb461fd093b7\n\n17aa5711b59e389ffb65294b8281d3b5f39ca18ac1ac861327e7d8548f49a4d3\n\nb98a835c6239c63a6ada26b92a4605264a9a36130bebe288b21c51edd750dea2\n\n87be9450f217180f09436d3307c7441d090ccfcedfcf6ce1275e8b0d2c9f4470\n\n9b52bd5194475d24b6f0e2d191a8e5bc943f80153a3768ce749dc5f93320e52f\n\nbac9c27a047a7fa4cb35f84fd7f63a87ce79e01c91944c48c35854cb891adf2c\n\n65a8909d4f61aff28a66ee4682c7722e68551fd2dc5fce2c8e160f89b2685971\n3577f0b44ded3f0207910c5e624a7a2667fea4fff0416f8c3cc37995c494e9e2\n\n### Distribution Servers\n\nmorelikestoday[.]com\n\ncarsi12[.]com\n\nsociallyvital[.]com\n\n### C2 Domains\n\nmbcqjsuqsd[.]com\n\nkcrznhnlpw[.]com\n\nhumzka[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-09-27 - Threat Spotlight- GozNym.pdf"
    ],
    "report_names": [
        "2016-09-27 - Threat Spotlight- GozNym.pdf"
    ],
    "threat_actors": [
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338909,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1683251849,
    "ts_modification_date": 1683251849,
    "files": {
        "pdf": "https://archive.orkl.eu/730c4c954a9e861d517fd173172cdbfda87870c0.pdf",
        "text": "https://archive.orkl.eu/730c4c954a9e861d517fd173172cdbfda87870c0.txt",
        "img": "https://archive.orkl.eu/730c4c954a9e861d517fd173172cdbfda87870c0.jpg"
    }
}