{
    "id": "476aae26-996d-4caa-8629-36732273cdc4",
    "created_at": "2022-10-25T16:48:10.801336Z",
    "updated_at": "2025-03-27T02:17:16.801805Z",
    "deleted_at": null,
    "sha1_hash": "6c3b0f70362d993f6d48d87bcb2013a237ab4dc0",
    "title": "APT40: Examining a China-Nexus Espionage Actor « APT40: Examining a China-Nexus Espionage Actor",
    "authors": "",
    "file_creation_date": "2019-03-05T03:51:11Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 562452,
    "plain_text": "# APT40: Examining a China-Nexus Espionage Actor « APT40: Examining a China-Nexus Espionage Actor\n\n**[fireeye.com/blog/threat-research/2019/03/apt40-examining-a-china-nexus-espionage-actor.html](https://www.fireeye.com/blog/threat-research/2019/03/apt40-examining-a-china-nexus-espionage-actor.html)**\n\nFireEye is highlighting a cyber espionage operation targeting crucial\ntechnologies and traditional intelligence targets from a China-nexus state\nsponsored actor we call APT40. The actor has conducted operations since\nat least 2013 in support of China’s naval modernization effort. The group\nhas specifically targeted engineering, transportation, and the defense\nindustry, especially where these sectors overlap with maritime\ntechnologies. More recently, we have also observed specific targeting of\ncountries strategically important to the Belt and Road Initiative including\nCambodia, Belgium, Germany, Hong Kong, Philippines, Malaysia, Norway,\nSaudi Arabia, Switzerland, the United States, and the United Kingdom. This\nChina-nexus cyber espionage group was previously reported as\nTEMP.Periscope and TEMP.Jumper.\n\n## Mission\n\nIn December 2016, China’s People Liberation Army Navy (PLAN) seized a\nU.S. Navy unmanned underwater vehicle (UUV) operating in the South\nChina Sea. The incident paralleled China’s actions in cyberspace; within a\nyear APT40 was observed masquerading as a UUV manufacturer, and\ntargeting universities engaged in naval research. That incident was one of\nmany carried out to acquire advanced technology to support the\ndevelopment of Chinese naval capabilities. We believe APT40’s emphasis on\nmaritime issues and naval technology ultimately support China’s ambition\nto establish a blue-water navy.\n\nIn addition to its maritime focus, APT40 engages in broader regional\ntargeting against traditional intelligence targets, especially organizations\nwith operations in Southeast Asia or involved in South China Sea disputes.\n[Most recently, this has included victims with connections to elections in](https://www.fireeye.com/blog/threat-research/2018/07/chinese-espionage-group-targets-cambodia-ahead-of-elections.html)\nSoutheast Asia, which is likely driven by events affecting China’s Belt and\nRoad Initiative. China’s “One Belt, One Road” (一带一路) or “Belt and Road\nInitiative” (BRI) is a $1 trillion USD endeavor to build land and maritime\ntrade routes across Asia, Europe, the Middle East, and Africa to develop a\ntrade network that will project China’s influence across the greater region.\n\n\n-----\n\nFigure 1: Countries and industries targeted. Countries include the United\nStates, United Kingdom, Norway, Germany, Saudi Arabia, Cambodia and\nIndonesia\n\n## Attribution\n\nWe assess with moderate confidence that APT40 is a state-sponsored\nChinese cyber espionage operation. The actor’s targeting is consistent with\nChinese state interests and there are multiple technical artifacts indicating\nthe actor is based in China. Analysis of the operational times of the group’s\nactivities indicates that it is probably centered around China Standard Time\n(UTC +8). In addition, multiple APT40 command and control (C2) domains\nwere initially registered by China based domain resellers and had Whois\nrecords with Chinese location information, suggesting a China based\ninfrastructure procurement process.\n\nAPT40 has also used multiple Internet Protocol (IP) addresses located in\nChina to conduct its operations. In one instance, a log file recovered from\n[an open indexed server revealed that an IP address (112.66.188.28) located](https://www.fireeye.com/blog/threat-research/2018/07/chinese-espionage-group-targets-cambodia-ahead-of-elections.html)\nin Hainan, China had been used to administer the command and control\nnode that was communicating with malware on victim machines. All of the\nlogins to this C2 were from computers configured with Chinese language\nsettings.\n\n## Attack Lifecycle\n\n_Initial Compromise_\n\n\n-----\n\ncompromise, including web server exploitation, phishing campaigns\ndelivering publicly available and custom backdoors, and strategic web\ncompromises.\n\nAPT40 relies heavily on web shells for an initial foothold into an\norganization. Depending on placement, a web shell can provide\ncontinued access to victims' environments, re-infect victim systems,\nand facilitate lateral movement.\nThe operation’s spear-phishing emails typically leverage malicious\nattachments, although Google Drive links have also been observed.\n\nFigure 2: APT40 attack lifecycle\n\n_Establish Foothold_\n\nAPT40 uses a variety of malware and tools to establish a foothold, many of\nwhich are either publicly available or used by other threat groups. In some\ncases, the group has used executables with code signing certificates to\navoid detection.\n\nFirst-stage backdoors such as AIRBREAK, FRESHAIR, and BEACON are\nused before downloading other payloads.\nPHOTO, BADFLICK, and CHINA CHOPPER are among the most\nfrequently observed backdoors used by APT40.\nAPT40 will often target VPN and remote desktop credentials to\nestablish a foothold in a targeted environment. This methodology\nproves to be ideal as once these credentials are obtained they may\n\n\n-----\n\n_Escalate Privileges_\n\nAPT40 uses a mix of custom and publicly available credential harvesting\ntools to escalate privileges and dump password hashes.\n\nAPT40 leverages custom credential theft utilities such as HOMEFRY, a\npassword dumper/cracker used alongside the AIRBREAK and\nBADFLICK backdoors.\nAdditionally, the Windows Sysinternals ProcDump utility and\nWindows Credential Editor (WCE) are believed to be used during\nintrusions as well.\n\n_Internal Reconnaissance_\n\nAPT40 uses compromised credentials to log on to other connected systems\nand conduct reconnaissance. The group also leverages RDP, SSH, legitimate\nsoftware within the victim environment, an array of native Windows\ncapabilities, publicly available tools, as well as custom scripts to facilitate\ninternal reconnaissance.\n\nAPT40 used MURKYSHELL at a compromised victim organization to\nport scan IP addresses and conduct network enumeration.\nAPT40 frequently uses native Windows commands, such as net.exe,\nto conduct internal reconnaissance of a victim’s environment.\nWeb shells are heavily relied on for nearly all stages of the attack\nlifecycle. Internal web servers are often not configured with the same\nsecurity controls as public-facing counterparts, making them more\nvulnerable to exploitation by APT40 and similarly sophisticated\ngroups.\n\n_Lateral Movement_\n\nAPT40 uses many methods for lateral movement throughout an\nenvironment, including custom scripts, web shells, a variety of tunnelers, as\nwell as Remote Desktop Protocol (RDP). For each new system\ncompromised, the group usually executes malware, performs additional\nreconnaissance, and steals data.\n\nAPT40 also uses native Windows utilities such as at.exe (a task\nscheduler) and net.exe (a network resources management tool) for\nlateral movement.\nPublicly available tunneling tools are leveraged alongside distinct\nmalware unique to the operation.\nAlthough MURKYTOP is primarily a command-line reconnaissance\ntool, it can also be used for lateral movement.\nAPT40 also uses publicly available brute-forcing tools and a custom\nutility called DISHCLOTH to attack different protocols and services\n\n\n-----\n\nAPT40 primarily uses backdoors, including web shells, to maintain presence\nwithin a victim environment. These tools enable continued control of key\nsystems in the targeted network.\n\nAPT40 strongly favors web shells for maintaining presence, especially\npublicly available tools.\nTools used during the Establish Foothold phase also continue to be\nused in the Maintain Presence phase; this includes AIRBREAK and\nPHOTO.\nSome APT40 malware tools can evade typical network detectiona by\nleveraging legitimate websites, such as GitHub, Google, and Pastebin\nfor initial C2 communications.\nCommon TCP ports 80 and 443 are used to blend in with routine\nnetwork traffic.\n\n_Complete Mission_\n\nCompleting missions typically involves gathering and transferring\ninformation out of the target network, which may involve moving files\nthrough multiple systems before reaching the destination. APT40 has been\nobserved consolidating files acquired from victim networks and using the\narchival tool rar.exe to compress and encrypt the data before exfiltration.\nWe have also observed APT40 develop tools such as PAPERPUSH to aid in\nthe effectiveness of their data targeting and theft.\n\n## Outlook and Implications\n\nDespite increased public attention, APT40 continues to conduct cyber\nespionage operations following a regular tempo, and we anticipate their\noperations will continue through at least the near and medium term.\nBased on APT40’s broadening into election-related targets in 2017, we\nassess with moderate confidence that the group’s future targeting will\naffect additional sectors beyond maritime, driven by events such as China’s\nBelt and Road Initiative. In particular, as individual Belt and Road projects\nunfold, we are likely to see continued activity by APT40 which extends\nagainst the project’s regional opponents.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.03.04.APT40/APT40%20Examining%20a%20China-Nexus%20Espionage%20Actor%20%20APT40%20Examining%20a%20China-Nexus%20Espionage%20Actor.pdf"
    ],
    "report_names": [
        "APT40 Examining a China-Nexus Espionage Actor  APT40 Examining a China-Nexus Espionage Actor"
    ],
    "threat_actors": [
        {
            "id": "16f2436b-5f84-44e3-a306-f1f9e92f7bea",
            "created_at": "2023-01-06T13:46:38.745572Z",
            "updated_at": "2025-03-27T02:00:02.907444Z",
            "deleted_at": null,
            "main_name": "APT40",
            "aliases": [
                "ISLANDDREAMS",
                "TEMP.Jumper",
                "BRONZE MOHAWK",
                "GADOLINIUM",
                "KRYPTONITE PANDA",
                "TA423",
                "MUDCARP",
                "Gingham Typhoon",
                "TEMP.Periscope",
                "G0065",
                "ATK29",
                "Red Ladon",
                "ITG09"
            ],
            "source_name": "MISPGALAXY:APT40",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "59be3740-c8c7-47aa-84c8-e80d0cb7ea3a",
            "created_at": "2022-10-25T15:50:23.481057Z",
            "updated_at": "2025-03-27T02:00:55.480695Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "MUDCARP",
                "Kryptonite Panda",
                "Gadolinium",
                "BRONZE MOHAWK",
                "TEMP.Jumper",
                "APT40",
                "TEMP.Periscope",
                "Gingham Typhoon"
            ],
            "source_name": "MITRE:Leviathan",
            "tools": [
                "Windows Credential Editor",
                "BITSAdmin",
                "HOMEFRY",
                "Derusbi",
                "at",
                "BLACKCOFFEE",
                "BADFLICK",
                "gh0st RAT",
                "PowerSploit",
                "MURKYTOP",
                "NanHaiShu",
                "Orz",
                "Cobalt Strike",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b9806584-4d82-4f32-ae97-18a2583e8d11",
            "created_at": "2022-10-25T16:07:23.787833Z",
            "updated_at": "2025-03-27T02:02:09.978883Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "APT 40",
                "ATK 29",
                "Bronze Mohawk",
                "Gadolinium",
                "Gingham Typhoon",
                "ISLANDDREAMS",
                "ITG09",
                "Kryptonite Panda",
                "Mudcarp",
                "Red Ladon",
                "TA423",
                "TEMP.Jumper",
                "TEMP.Periscope"
            ],
            "source_name": "ETDA:Leviathan",
            "tools": [
                "AIRBREAK",
                "Agent.dhwf",
                "Agentemis",
                "AngryRebel",
                "BADFLICK",
                "BlackCoffee",
                "CHINACHOPPER",
                "China Chopper",
                "Cobalt Strike",
                "CobaltStrike",
                "DADJOKE",
                "Dadstache",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "GRILLMARK",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEFRY",
                "Hellsing Backdoor",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "LUNCHMONEY",
                "Living off the Land",
                "MURKYTOP",
                "Moudour",
                "Mydoor",
                "NanHaiShu",
                "Orz",
                "PCRat",
                "PNGRAT",
                "PlugX",
                "RedDelta",
                "SeDLL",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "cobeacon",
                "gresim",
                "scanbox"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "83025f5e-302e-46b0-baf6-650a4d313dfc",
            "created_at": "2024-05-01T02:03:07.971863Z",
            "updated_at": "2025-03-27T02:05:17.278721Z",
            "deleted_at": null,
            "main_name": "BRONZE MOHAWK",
            "aliases": [
                "Flaccid Rose ",
                "GADOLINIUM ",
                "Kryptonite Panda ",
                "Leviathan ",
                "Nanhaishu ",
                "Pickleworm ",
                "Temp.Jumper ",
                "Temp.Periscope ",
                "APT40 "
            ],
            "source_name": "Secureworks:BRONZE MOHAWK",
            "tools": [
                " BlackCoffee",
                " China Chopper",
                " Cobalt Strike",
                " Derusbi",
                " Derusbi Trojan",
                " FUSIONBLAZE",
                " GreenCrash",
                " HOMEFRY",
                " MURKYTOP",
                " Metasploit",
                " Metasploit / Meterpreter",
                " Nanhaishu",
                " Orz",
                " ScanBox",
                " SeDll",
                "AIRBREAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041836,
    "ts_creation_date": 1551757871,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/6c3b0f70362d993f6d48d87bcb2013a237ab4dc0.pdf",
        "text": "https://archive.orkl.eu/6c3b0f70362d993f6d48d87bcb2013a237ab4dc0.txt",
        "img": "https://archive.orkl.eu/6c3b0f70362d993f6d48d87bcb2013a237ab4dc0.jpg"
    }
}