{
    "id": "47bfa612-b094-4e42-85ec-855d19543208",
    "created_at": "2023-05-06T02:09:13.625654Z",
    "updated_at": "2025-03-27T02:16:26.571358Z",
    "deleted_at": null,
    "sha1_hash": "c04917c8202b867f21db45e8b93f089f658eed89",
    "title": "2023-03-24 - Guidance for investigating attacks using CVE-2023-23397",
    "authors": "",
    "file_creation_date": "2023-05-05T01:58:45Z",
    "file_modification_date": "2023-05-05T01:58:45Z",
    "file_size": 891123,
    "plain_text": "# Guidance for investigating attacks using CVE-2023-23397\n\n**[microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/](https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/)**\n\nMarch 24, 2023\n\nThis guide provides steps organizations can take to assess whether users have been\n[targeted or compromised by threat actors exploiting CVE-2023-23397. A successful exploit](https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/)\nof this vulnerability can result in unauthorized access to an organization’s environment by\ntriggering a Net-NTLMv2 hash leak. Understanding the vulnerability and how it has been\nleveraged by threat actors can help guide the overall investigative process.\n\nThis document covers:\n\nAn overview of the vulnerability\nExploit scenarios\nPost-exploit activities observed in attacks\nTechniques for determining if an organization was targeted or compromised via this\nvulnerability\nMitigations available to protect your environment\n\nExploitation of CVE-2023-23397 leaves very few forensic artifacts to discover in traditional\nendpoint forensic analysis. This blog describes how Microsoft Incident Response (previously\nknown as Microsoft Detection and Response Team – DART) was able to detect the abuse of\nCVE-2023-23397 and how organizations can identify historical and present evidence of\ncompromise through this vulnerability.\n\nThis vulnerability triggers a Net-NTLMv2 hash leak. Abuse of the leaked Net-NTLMv2 hash\nis post-exploitation activity. In this blog, we emphasize specific observed post-exploitation\nactivity that targeted Microsoft Exchange Server. However, there are numerous ways that a\nleaked Net-NTLMv2 hash could be used by a threat actor.\n\n## Understanding the vulnerability (CVE-2023-23397)\n\nCVE-2023-23397 is a critical elevation of privilege vulnerability in Microsoft Outlook on\nWindows. It is exploited when a threat actor delivers a specially crafted message to a user.\nThis message includes the PidLidReminderFileParameter extended Messaging Application\nProgramming Interface (MAPI) property, which must be set to a Universal Naming\nConvention (UNC) path share on a threat actor-controlled server (via Server message block\n(SMB)/transmission control protocol (TCP) port 445).\n\nIn exploitation of CVE-2023-23397, threat actors can specify the value for the\n_PidLidReminderFileParameter in specially crafted messages to trigger a Net-NTLMv2 hash_\nleak to threat actor-controlled servers.\n\n\n-----\n\nThe user does not need to interact with the message: if Outlook on Windows is open when\nthe reminder is triggered, it allows exploitation. The connection to the remote SMB server\nsends the user’s Net-NTLMv2 hash in a negotiation message, which the threat actor can\neither a) relay for authentication against other systems that support NTLMv2 authentication\nor b) perform offline cracking to extract the password. As these are NTLMv2 hashes, they\ncannot be leveraged as part of a Pass-the-Hash technique. All versions of Microsoft Outlook\non Windows are impacted. Outlook for Android, iOS, Mac, and users who use Outlook on the\nweb (OWA) without using the Outlook client are not affected.\n\nMicrosoft has traced evidence of potential exploitation of this vulnerability as early as April\n2022.\n\nThis technique leverages the Transport Neutral Encapsulation Format (TNEF). TNEF is a\nMicrosoft-specific format for transmitting formatted email messages. A TNEF message\ncontains a plaintext version of the message and an attachment that packages the original\nformatted version of the message. Typically, this attachment is named Winmail.dat. The\n_Winmail.dat attachment includes formatting, attachments, and Outlook-specific features such_\nas meeting requests including extended MAPI Properties. Details about TNEF can be found\nhere:\n\nOutlook on Windows is designed to enable a user to specify a custom sound file associated\nwith a reminder.\n\nFigure 1. Setting a custom sound to play when a reminder is triggered in Outlook on\nWindows client\nModifying this value sets the PidLidReminderFileParameter extended MAPI property, which\nis stored as a property associated with the specific mail object. A tool such as MFCMAPI\n(see [https://github.com/stephenegriffin/mfcmapi) can be used to view extended MAPI](https://github.com/stephenegriffin/mfcmapi)\n\n\n-----\n\nproperties associated with an object. In the following screenshot, the value of the\n_PidLidReminderFileParameter is shown set to reminder.wav, the PidLidReminderSet is_\n“True”, and the reminder times are set to occur in the past.\n\nFigure 2. Resulting extended MAPI Properties and their values as a result of customizing the\nsound to play when reminders are triggered as seen using MFCMAPI.\nTo further deceive users, threat actors may also set the PidLidReminderTime property to\nremain dormant in the mailbox until a future date.\n\nThe affected Net-NTLMv2 hash belongs to the user signed in to the Windows device where\nthe Outlook client application is running, regardless of the identity that received the malicious\nmessage. If the user does not dismiss the reminder/task Outlook alert or the reminder is\nrecurring (i.e., fires multiple times), the user’s Net-NTLMv2 hash can be leaked multiple\ntimes.\n\nNote: Interaction based on the WebDAV protocol is not at risk of leaking credentials to\nexternal IP addresses via this exploit technique. While the threat actor infrastructure might\nrequest Net-NTLMv2 authentication, Windows will honor the defined internet security zones\nand will not send Net-NTLMv2 hashes. In other words, an external threat actor can only\nexploit this vulnerability via the SMB protocol. If a target device can communicate to external\nthreat actor infrastructure over port 445 (SMB), Net-NTLMv2 hashes might be sent; however,\nif this communication via SMB is not possible, Windows will fall back to leveraging WebDAV.\nWebDAV will set up a connection with the threat actor infrastructure, but Net-NTLMv2\nhashes will not be sent.\n\n### Observed post-exploitation actions\n\nIn a recent engagement, Microsoft Incident Response has observed additional postexploitation activities following exploitation of CVE-2023-23397. The presence of artifacts\nassociated with these post-exploitation activities can strongly suggest compromise of user\naccounts These post-exploitation activities include:\n\n\n-----\n\n**Initial access (authentication bypass):**\n\nUsing a Net-NTLMv2 Relay attack against Exchange Servers (NOTE: Azure Active Directory,\nthe default authentication service for Exchange Online, is not directly susceptible to a NetNTLMv2 relay attack. However, it is possible that a federated identity provider may be\nsusceptible).\n\n**Credential access/lateral movement:**\n\nUsing the Exchange Web Services (EWS) API to send additional messages with the\nmalicious value of the PidLidReminderFileParameter extended MAPI property to users inside\nand external to the organization.\n\n**Discovery/persistence:**\n\nUsing the EWS API to enumerate folders in a compromised user’s mailbox and changing the\nmailbox folder permissions using the UpdateFolder API so that any authenticated user can\naccess all mailbox folder content with “owner” privileges. This technique established\nadditional persistent access to contents of user’s mailboxes even if a password was reset or\notherwise remediated.\n\nThe following diagrams show initial access using a Net-NTLMv2 Relay attack, persistence\nvia modifying mailbox folder permissions, and lateral movement by sending additional\nmalicious messages.\n\nFigure 3. Observed threat actor exploitation of CVE-2023-23397 to gain unauthorized access\nto Exchange Server and modify mailbox folder permissions for persistent access to the\nmailbox.\n\n\n-----\n\nFigure 4. Observed threat actor activity to extend their access in a compromised\nenvironment by using a compromised e-mail account to target other members of the same\norganization.\n\n## Threat hunting guidance: Evidence of targeting\n\nOrganizations should use an in-depth and comprehensive threat hunting strategy to identify\npotential credential compromise through CVE-2023-23397. While running the Exchange\nscanning script provided by Microsoft is an effective first step, this script does not provide\nvisibility into malicious messages for all scenarios.\n\nOutlook allows users to open multiple mailboxes at the same time. If a user has\nconfigured their Outlook to open mailboxes from multiple e-mail services, a malicious\nmessage received through one of those other services will still trigger the vulnerability\nbut that message is not in the scanned mailboxes. (Note: Independent of what mailbox\nor the identity used to access the mailbox, if a malicious message is received, the\ncredential that will leak belongs to the identity currently signed in to the Windows\ndevice.)\nUsers may move messages to a local file (PST). Local e-mail stores are not scanned\nwhen scanning the Exchange environment. Archived messages may show evidence of\na prior compromise. If the local files are open in Outlook, messages can still trigger the\nvulnerability.\n\nIf messages have been deleted from Exchange (some organizations may have a policy\nlimiting data retention), then the messages will no longer be available in Exchange.\n\nIf no suspicious or malicious values are identified through the Exchange scanning script,\norganizations should also hunt for known threat actor indicators of compromise (IOCs)\nrelated to the exploitation of this vulnerability.\n\n\n-----\n\nFor example, if IP addresses and URIs are extracted from the PidLidReminderFileParameter\nvalues, incident responders should review all available security telemetry for presence of\nthese newly identified indicators. Data sources can include:\n\nFirewall logs\nProxy logs\nAzure Active Directory sign-in logs for users of Exchange Online\nIIS Logs for Exchange Server\nVPN logs\nRDP Gateway logs\nEndpoint telemetry from an endpoint detection and response (EDR) solution if available\nForensic endpoint data such as windows event logs from end user systems\n\nFor example, using advanced hunting in Microsoft Defender for Endpoint, multiple tables can\nbe queried simultaneously to uncover activities related to IP address indicators:\n```\n//Search for activity around IoAs\n\nlet IoCs = dynamic([\"<IP Address 1>\",\"<IP Address 2>\"]);\n\nlet range = ago(30d);\n\nunion (DeviceProcessEvents | where Timestamp > range | where ProcessCommandLine\nhas_any (IoCs)),\n\n   (DeviceNetworkEvents | where Timestamp > range | where RemoteIP in (IoCs) or\nLocalIP in (IoCs)),\n\n   (DeviceLogonEvents | where Timestamp > range | where RemoteIP in (IoCs))\n\n| extend SignatureName = tostring(parse_json(AdditionalFields).SignatureName)\n\n| project-reorder Timestamp, DeviceName, ActionType, LocalIP,RemoteIP,\nRemotePort,SignatureName,ProcessCommandLine\n\n| sort by Timestamp desc\n\n\n### Hunting strategically\n\n```\nThere are several approaches to identifying whether your organization was targeted,\nincluding the following (ordered from the most high-fidelity to more anomaly-based\napproach):\n\nReview suspicious messages, calendar items, or tasks with reminders that were\nreported by users\nExamine network logging and endpoint logging for evidence of known atomic indicators\nScan Exchange for delivered messages with the PidLidReminderFileParameter set\nHunt for anomalous behaviors based on:\n\nNTLM authentication involving untrusted or external resources. This can be\nobserved in Exchange Server logging, Microsoft Defender for Identity, and\nMicrosoft Defender for Endpoint telemetry.\n[WebDAV connection attempts through process execution events.](https://en.wikipedia.org/wiki/WebDAV)\nSMBClient event log entries.\nFirewall logs for suspicious outbound SMB connections.\n\n\n-----\n\n**Review suspicious messages, calendar items, or tasks reported by users**\n\nUsers in targeted organizations will have received messages with the malicious value of the\n_PidLidReminderFileParameter value set. In some cases, users may have reported these_\nsuspicious messages, tasks, or calendar invitations to their security team. A high-level\ninvestigation of messages potentially exploiting CVE-2023-23397 may not reveal any overt\nmalicious elements, as embedding malicious URLs or other content in the message body\nitself is not necessary. A deeper analysis of the message’s extended MAPI properties\n(specifically, the PidLidReminderFileParameter value) is required to confirm if it is malicious.\n\n**Scan for messages with malicious properties**\n\nOrganizations should search their Exchange environment for messages where the\n_PidLidReminderFileParameter value is set. Microsoft has provided a script to enable_\norganizations perform this search here, including instructions:\n[https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/.](https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/)\n\nThe script produces a CSV file enumerating each message that has the\n_PidLidReminderFileParameter property set, and will report on targets that are local on the_\ncomputer, internal to the network, or on the internet. Any messages identified where this\nproperty references a server in the “InternetZone” should be considered malicious.\nReferences to intranet servers should also be carefully analyzed. Figure 5 depicts a sample\noutput from this script.\n\nFigure 5. Sample output for PidLidReminderFileParameter detection script.\nCustomers with a large number of mailboxes in Exchange may consider customizing the\nscript logic strategically, by:\n\nInitially targeting high-value users by specifying a list of mailboxes of interest.\nTimeboxing: As the first known exploitation of this vulnerability was in April 2022\nperformance can be improved by prioritizing a search from 2022 onwards. It is still\nrecommended to search further historically as well, however with lower priority, as it is\npossible this exploit was used prior to April 2022.\n\nRunning multiple concurrent scans across different user mailbox sets by using batching\n(see script documentation).\n\nIf any suspicious or malicious messages are identified via this script, organizations should\nfurther triage their environment, including:\n\nexamination of the targeted users’ logon behaviors\n\n\n-----\n\nhunting for further presence of any malicious domains or IP addresses in available\nnetwork and endpoint logging.\n\n**Artifacts on endpoints**\n\nOrganizations should review SMBClient event logging, Process Creation events, and other\navailable network telemetry to identify potential exploitation via CVE-2023-23397. To\ndetermine whether any such exploitation led to a threat actor gaining unauthorized access to\nthe environment, analysis of authentication events, network perimeter logging, and\nExchange Server logging (if Exchange Server is used by the organization) will be\ninstrumental.\n\nMicrosoft-Windows-SMBClient/Connectivity event logs\n\nThis event logging channel records server errors and warnings for both SMB and WebDAV\nconnections, and provides a source to identify potential compromise through CVE-202323397, as it may reveal failed outbound connection attempts to threat actor-controlled\ninfrastructure.\n\nThe ServerName field in EventIds 30800, 30803, 30806, 30804, and 31001 should be\nmonitored for non-trusted servers, as illustrated in Figure 6.\n\n\n-----\n\nFigure 6: Sample event where SMB traffic was blocked in the firewall.\nIt is critical to note that the presence of these events cannot be used to confirm whether\ncredentials were leaked, and can only be used as evidence that an outbound connection\nattempt was made by the device but failed (due to a protocol or network error). Microsoft\nIncident Response observed during an engagement that a device affected by CVE-202323397 attempted to connect multiple times to threat actor infrastructure, failing occasionally\nand producing these event log entries, but otherwise successfully leaking credentials to the\nthreat actor.\n\nWebDAV Process Creation events\n\nIf SMB traffic to the internet is blocked by your organization or otherwise fails, Windows will\nfall back to using WebDAV to attempt to complete the connection. This behavior, paired with\nCVE-2023-23397 execution, results in a potentially unique Process Creation event and\ncommand line parameters that organizations can hunt in endpoint detection and response\n(EDR) telemetry or other endpoint logging (such as Sysmon logs, as depicted in Figure 7):\n\nParent process command line: C:\\Windows\\system32\\svchost.exe -k LocalService -p -s\n_WebClient_\n\n\n-----\n\nChild process command line: rundll32.exe\n_C:\\Windows\\system32\\davclnt.dll,DavSetCookie <IP Address> hxxp://<Threat actor_\n_IP>/folder/sound.wav_\n\nIt is possible that the filesystem URL may not have a traditional .wav file extension.\n\nFigure 7: Sample WebDAV process create event\nIt is critical to note that the presence of this process tree in your environment cannot be used\nto confirm whether credentials were leaked. It can only be used as evidence that a message\nexploiting CVE-2023-23397 was delivered, triggered an attempted outbound SMB\n**connection/credential leak to threat actor infrastructure, but failed in the given instance as**\ncredentials cannot be leaked through WebDAV with this vulnerability. If this failure was the\nresult of a transient network issue (rather than SMB being blocked deliberately and\nsystemically), it is still possible that credentials may have been leaked.\n\n**Exchange Server logs**\n\nFor organizations using Exchange Server, there are several log sources that can provide\nvalue in hunting for indicators of attack or compromise through CVE-2023-23397. These log\nsources may potentially reveal unauthorized access to Exchange Server via a Net-NTLMv2\n\n\n-----\n\nRelay attack, as well as possible post-exploitation activities. These logs do not provide value\nin determining whether a NTLMv2 hash was leaked, however.\n\nMicrosoft provides this tool to enable organizations to collect relevant Exchange Server logs:\n[https://microsoft.github.io/CSS-Exchange/Diagnostics/ExchangeLogCollector/.](https://microsoft.github.io/CSS-Exchange/Diagnostics/ExchangeLogCollector/)\n\nMicrosoft Incident Response recommends collecting all logs with the -AllPossibleLogs\ncommand line flag; however, a more minimal collection can be obtained using the following\nflags:\n\n_-EWSLogs_\n_-IISLogs_\n_-PowerShellLogs_\n_-ServerInformation_\n_-ExchangeServerInformation_\n_-MessageTrackingLogs_\n_-OWALogs_\n\n[Collected logs can be reviewed by ingesting them into Azure Data Explorer, Log Analytics in](https://learn.microsoft.com/azure/data-explorer/ingest-data-overview)\n[Azure Monitor, or another SIEM or log parsing utility (such as Log Parser Studio).](https://techcommunity.microsoft.com/t5/exchange-team-blog/introducing-log-parser-studio/ba-p/601131)\n\nExchange IIS logs\n\nAnalysis of IIS logs from Exchange Server (or, if the server is behind a reverse proxy, the IIS\nlogs from the proxy server) can provide insight into potential threat actor behavior.\n\n**NOTE: If Exchange Server is protected by a reverse proxy, client IP values (cIP) in logging**\nwill only show the IP address of the proxy server. In this case, access to logs from the proxy\nis critical to determine if connections originated from untrusted IP addresses.\n\nReverse Proxy Logs\n\nIf a reverse proxy is implemented and configured to register headers, such as those that\ninclude authentication methods and Net-NTLMv2 negotiations, it is possible to identify NetNTLMv2 Relay behavior. Microsoft Incident Response was able to leverage these logs in a\nrecent engagement: certain users appeared to authenticate from their appropriate and\nexpected workstations, but the authentications originated from IP addresses associated with\nthreat actor infrastructure.\n\nEWSLogs\n\nExchange Web Services (EWS) logs include the AuthenticationType. If a Net-NTLMv2 Relay\nattack was leveraged against an EWS Endpoint, it can often be seen in these logs.\nStrategies to hunt for anomalies in these logs include:\n\nFiltering EWSLogs by AuthenticationType for NTLM\n\n\n-----\n\nGrouping by ClientIpAddress (NOTE: The external client IP address may need to be\nparsed from the field, as it can contain the results of proxying the ClientIP to the\nExchange Server backend component. Fields will be in the form <ClientIP>:\n_<PortNumber> <ProxiedIPAddress>)._\nGroup by the AuthenticatedUser\n\nAny authentications using NTLMv2 originating from unknown or untrusted IP addresses\nshould be further examined. If a single external IP address is associated with multiple users’\nauthentications, and the IP address is not consistent with those users’ typical patterns of\nbehavior (based on factors such as geolocation, hosting provider, or User Agent string),\nevents associated with such an IP should be investigated further.\n\nIf a threat actor changes mailbox permissions or mailbox folder permissions as part of their\npost-exploitation behaviors, SoapActions including “GetFolder”, “UpdateFolder”, and\n“FindFolder” may be observed for the combination of the authenticated user and IP address.\n\nIf a threat actor attempts to access email for a compromised user, SoapActions including\n“ResolveNames”,”GetDelegate”,”GetFolder”,”FindFolder”,”FindItem”, and “GetItem” may be\nobserved for the combination of the authenticated user and IP address.\n\nThe following Kusto Query Language (KQL) query can assist with parsing and summarizing\nEWS logging for the purposes described above, if the relevant logs have been ingested into\nAzure Data Explorer.\n```\nEWSLogging\n\n| where AuthenticationType == 'NTLM'\n\n| extend IpAddress = tostring(split(ClientIpAddress,\":\")[0])\n\n| summarize count(), min(['DateTime']),max(['DateTime']),\n\n  make_set(SoapAction), make_set(UserAgent) by AuthenticatedUser, IpAddress\n\n```\nExchange HTTP Proxy EWS Logs\n\nHTTP Proxy EWS logs can be useful to identify the details of NTLMv2 authentications. The\nuser name, workstation name, and domain name can be extracted from those values using\nthe techniques described in\n\nhttps://community.pulsesecure.net/t5/Pulse-Secure-vADC/HowTo-Decode-and-log-theusername-in-an-NTLM-connection/ta-p/28869\n[https://davenport.sourceforge.net/ntlm.html](https://davenport.sourceforge.net/ntlm.html)\n\nExchange Server Message Tracking Logs\n\nExchange Server Message Tracking Logs are useful to identify messages with certain\nsubjects or from certain sender IP address values. Refer to the following Microsoft Learn\npages for more details:\n\n\n-----\n\nhttps://learn.microsoft.com/exchange/mail-flow/transport-logs/transport-logs?\nview=exchserver-2019\nhttps://learn.microsoft.com/exchange/monitoring/trace-an-email-message/run-amessage-trace-and-view-results\n\n### Additional indicators of compromise\n\n**Potential registry key modification**\n\nMicrosoft Incident Response identified a registry key that can indicate that a reminder was\ntriggered for a Note or Task item. This registry key holds certain properties (e.g., location and\nsize) of the UI window that is created when the reminder triggered. If a user has not used the\nreminder functionality within Tasks or Notes, these registry keys will not exist. Figure 8\ndepicts the Task key as viewed in RegEdit:\n\n_HKCU\\Software\\Microsoft\\Office\\<VERSION OF OUTLOOK>\\Outlook\\Tasks_\n_HKCU\\Software\\Microsoft\\Office\\<VERSION OF OUTLOOK>\\Outlook\\Notes_\n\nFigure 8: Example registry key for a Task item.\nThe presence of these keys provides evidence that a user has received a reminder for a\nTask or Note. If the presence of this registry key is identified, and appears to be anomalistic\nfor your organization, threat hunters should examine the user’s mailbox as well as\nnetwork/endpoint telemetry for further evidence of compromise using the techniques\ndescribed in this blog, especially by performing temporal analysis around the LastModified\ntimestamp of the registry keys.\n\n**Hunting for outbound SMB connections**\n\nNetwork perimeter telemetry and/or EDR data can be investigated for SMB connections\ninvolving external IP addresses as part of a larger threat hunting strategy.\n\nThe following query can be used in the advanced hunting portal of Microsoft Defender for\nEndpoint to further align SMB connections with Net-NTLMv2 behavior.\n\n\n-----\n\nThe query will identify connections involving port 445 (standard for SMB) involving remote\npublic IP addresses. By filtering on both Local and Remote parameters, the query will also\ninclude records of the NetworkSignatureInspected ActionType. If threat actor infrastructure is\nattempting to harvest Net-NTLMv2 credentials, the NetworkSignatureInspected ActionType\nshould include a SignatureName of NTLM-Challenge. This indicates a Net-NTLMv2\nnegotiation was attempted.\n\nFor more information about the NetworkSignatureInspected actions, check Hunting for\nnetwork signatures in Microsoft Defender for Endpoint.\n```\n//Hunt for SMB to the internet\n\nlet range = ago(30d);\n\nDeviceNetworkEvents\n\n| where Timestamp > range\n\n//Connections have RemotePort set to 445\n\n//NetworkSignatureInspected have LocalPort set to 445\n\n| where RemotePort == 445 or LocalPort == 445\n\n| where not(ipv4_is_private(RemoteIP)) or not(ipv4_is_private(LocalIP))\n\n| extend SignatureName = tostring(parse_json(AdditionalFields).SignatureName)\n\n| project-reorder Timestamp, DeviceName, ActionType, LocalIP,RemoteIP, LocalPort,\nRemotePort,SignatureName\n\n| sort by Timestamp desc\n\n\n```\nNOTE: Organizations may consider filtering out their own public IP address space from the\nquery above.\n\n## Microsoft product detections\n\nOrganizations using Microsoft Defender for Endpoint or Microsoft Defender for Office 365\ncan identify threats using the following detections.\n\n**Microsoft Defender for Endpoint provides detections with the following titles in the**\nsecurity center can indicate threat activity on your network:\n\n**Possible target of Net-NTLMv2 credential theft – This detects specific attacks**\nobserved by Microsoft prior to disclosure of the vulnerability and might not detect\nvariations on the attack after publishing.\n\n\n-----\n\n**Microsoft Defender for Office 365 detects messages exploiting this vulnerability and**\nshows administrators the following alerts to indicate that the file contains a critical\nelevation of privilege exploit related to CVE-2023-23397:\n\nExploit_Office_CVE_2023_23397_A\nExploit_Office_CVE_2023_23397_B\nExploit_Office_CVE_2023_23397_C\nExploit_Office_CVE_2023_23397_D\nExploit_Office_CVE_2023_23397_E\nExploit_Office_CVE_2023_23397_F\nExploit_Office_CVE_2023_23397_G\nExploit_Office_CVE_2023_23397_H\n\n## Recommendations\n\nMicrosoft Incident Response recommends the following steps to mitigate this type of attack\nand the observed post-exploitation behavior:\n\nEnsure Microsoft Outlook is updated as soon as possible to mitigate the issue. If\npatching is not immediately possible, ensuring you have implemented these security\nbest practices can help mitigate this threat:\n\nAdd users to the [Protected Users group, which prevents the use of NTLM as an](https://learn.microsoft.com/windows-server/security/credentials-protection-and-management/protected-users-security-group?ocid=magicti_ta_learndoc)\nauthentication mechanism. This might impact applications that require NTLM, but\nthe settings will revert once the user is removed from the Protected Users group.\nThis makes troubleshooting easier than other methods of disabling NTLM\nauthentication. The Protected Users group provides credential protections\nbeyond disabling NTLM and should be used for high-value accounts, such as\ndomain administrators, when possible.\n[Block TCP 445/SMB outbound from your network by using a perimeter firewall,](https://support.microsoft.com/topic/preventing-smb-traffic-from-lateral-connections-and-entering-or-leaving-the-network-c0541db7-2244-0dce-18fd-14a3ddeb282a?ocid=magicti_ta_support)\nlocal firewall, and through your VPN settings. This helps prevent the exploitation\nof CVE-2023-23397 to send NTLM authentication messages to remote file\nshares. For remote users, it is important to check split tunnel VPN settings to\nensure outbound traffic is blocked when they are not on your corporate network.\nFor organizations leveraging on-premises Microsoft Exchange Server, apply the latest\nsecurity updates to ensure that defense-in-depth mitigations are active.\nWhere suspicious or malicious reminder values are observed, make sure to use the\nscript to remove either the messages or just the properties, and consider initiating\nincident response activities.\nFor any targeted or compromised user, reset the passwords of any account logged in\nto computers of which the user received suspicious reminders and initiate incident\nresponse activities.\n\n\n-----\n\nUse multifactor authentication to mitigate the impact of potential Net-NTLMv2 Relay\nattacks. NOTE: This will not prevent a threat actor from leaking credentials and\ncracking them offline.\nDisable unnecessary services on Exchange.\nLimit SMB traffic by blocking connections on ports 135 and 445 from all inbound IP\naddresses except those on a controlled allowlist.\nDisable NTLM in your environment.\n\n### Understanding mitigations\n\nTo address this vulnerability, you must install the Outlook security update, regardless of\nwhere your mail is hosted (e.g., Exchange Online, Exchange Server, some other platform) or\nyour organization’s support for NTLM authentication.\n\nWhen using Exchange Online or Exchange server as your mail host, you can take the\nfollowing additional actions:\n\nDetermine if your organization was targeted by actors attempting to use this\nvulnerability\nProvide defense in depth for new messages received outside your organization\n\n**Protections in Outlook**\n\nOutlook for Windows first checks if the path specified by the PidLidReminderFileParameter\nmessage property is to a location that is not in the local or trusted network. If the path points\noutside of the local or trusted network locations, the parameter is not honored when updates\nare installed.\n\n**Protections in Exchange Online**\n\nExchange Online drops the PidLidReminderFileParameter message property at TNEF\nconversion when a new message is received.\n\n**Protections for Exchange Server**\n\nExchange Server (with March 2023 SU) drops the PidLidReminderFileParameter message\nproperty at TNEF conversion when a new message is received.\n\n## Conclusion\n\nWhile leveraging NTLMv2 hashes to gain unauthorized access to resources is not a new\ntechnique, the exploitation of CVE-2023-23397 is novel and stealthy. Even when users\nreported suspicious reminders on tasks, initial security review of the messages, tasks, or\ncalendar items involved did not result in detection of the malicious activity. Furthermore, the\nlack of any required user interaction contributes to the unique nature of this vulnerability. In\n\n\n-----\n\nthis document, Microsoft Incident Response has highlighted threat hunting techniques and\nstrategy for exploitation of this CVE, alongside some hunting techniques for observed postexploitation threat actor behaviors. Furthermore, a broad threat hunting for anomalous user\nactivity consistent with credential compromise is advised.\n\n## Observed indicators of attack\n\nSeveral malicious samples have been uploaded to VirusTotal.com and a signature has been\ncreated that identifies potentially malicious messages associated with exploitation of CVE2023-23397.\n\nVirusTotal subscribers can review those results here:\nhttps://www.virustotal.com/gui/search/crowdsourced_yara_rule%253A000bc4a247%257CEX\nPL_SUSP_Outlook_CVE_2023_23397_Exfil_IP_Mar23\n\nKnown IP addresses associated with exploitation of this vulnerability in the above VirusTotal\nresults are listed below. NOTE: These IP addresses were assessed by Microsoft Threat\nIntelligence to be compromised infrastructure.\n\n101.255.119[.]42\n213.32.252[.]221\n168.205.200[.]55\n185.132.17[.]160\n69.162.253[.]21\n113.160.234[.]229\n181.209.99[.]204\n82.196.113[.]102\n85.195.206[.]7\n61.14.68[.]33\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-24 - Guidance for investigating attacks using CVE-2023-23397.pdf"
    ],
    "report_names": [
        "2023-03-24 - Guidance for investigating attacks using CVE-2023-23397.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1683338953,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1683251925,
    "ts_modification_date": 1683251925,
    "files": {
        "pdf": "https://archive.orkl.eu/c04917c8202b867f21db45e8b93f089f658eed89.pdf",
        "text": "https://archive.orkl.eu/c04917c8202b867f21db45e8b93f089f658eed89.txt",
        "img": "https://archive.orkl.eu/c04917c8202b867f21db45e8b93f089f658eed89.jpg"
    }
}