{
    "id": "48096e12-c108-46d8-9ede-60c207501841",
    "created_at": "2023-01-12T15:06:51.387527Z",
    "updated_at": "2025-03-27T02:05:22.094511Z",
    "deleted_at": null,
    "sha1_hash": "aaf73907c06690110ec7e5c0374cb1f8db260add",
    "title": "2014-01-19 - Vietnamese Malware Gets Very Personal",
    "authors": "",
    "file_creation_date": "2022-05-28T01:23:26Z",
    "file_modification_date": "2022-05-28T01:23:26Z",
    "file_size": 297170,
    "plain_text": "# Vietnamese Malware Gets Very Personal\n\n**eff.org/deeplinks/2014/01/vietnamese-malware-gets-personal**\n\nTechnical Analysis by Eva Galperin and Morgan Marquis-Boire January 19, 2014\n\nAs encryption has become more prevalent in online communications as a countermeasure against surveillance, attackers have sought to\ncircumvent these measures by covertly installing malware on targeted computers that can log keystrokes, remotely spy on users with their own\n[webcams, record Skype calls, and listen in on the computer’s built-in microphone. Sometimes the attacker is a criminal, such as the hacker](http://arstechnica.com/tech-policy/2013/09/miss-teen-usas-webcam-spy-called-himself-cutefuzzypuppy/)\nwho used a remote access tool (RAT) to take blackmail photos of Miss Teen USA. Sometimes the attacker is acting in support of a state, like\n[the pro-Assad hackers whose malware campaigns against opposition supporters EFF has been tracking for the last two years. Sometimes the](https://www.eff.org/issues/state-sponsored-malware)\nattacker is the government or a law enforcement agency. For example, the NSA’s [Tailored Access Operations unit uses covertly-installed](http://www.spiegel.de/international/world/the-nsa-uses-powerful-toolbox-in-effort-to-spy-on-global-networks-a-940969.html)\nmalware to spy on targets.\n\nMalware is a tool that most states have their toolbox, and Vietnam is no exception. For the last several years, the communist government of\nVietnam has used malware and RATs to spy on journalists, activists, dissidents, and bloggers, while it cracks down on dissent. Vietnam’s\n[Internet spying campaign dates back to at least March 2010, when engineers at Google discovered malware broadly targeting Vietnamese](http://googleonlinesecurity.blogspot.com/2010/03/chilling-effects-of-malware.html)\ncomputer users. The infected machines were used to spy on their owners as well as participating in DDoS attacks against dissident websites.\n[The Vietnamese government has cracked down sharply on anti-government bloggers, who represent the country’s only independent press. It](http://www.theguardian.com/world/2012/sep/13/vietnam-orders-crackdown-bloggers)\nis currently holding 18 bloggers and journalists, 14 from a year earlier, according to a [report issued by the Committee to Protect Journalists in](http://www.voanews.com/content/cpj-vietnam-intensifies-crackdown-on-journalists/1813161.html)\n2013.\n\nEFF has [written extensively about the worsening situation for bloggers in Vietnam, supporting campaigns to free high-profile bloggers such as](http://www.voanews.com/content/cpj-vietnam-intensifies-crackdown-on-journalists/1813161.html)\n[Le Quoc Quan and](https://www.eff.org/deeplinks/2013/03/human-rights-organizations-call-un-aid-detained-vietnamese-blogger-le-quoc-quan) [Dieu Cay, and](https://www.causes.com/freedieucay) [criticizing Vietnam’s Internet censorship bill. This report will analyze malware targeting EFF's own staff, as](https://www.eff.org/deeplinks/2012/06/week-internet-censorship-arrests-oman-disturbing-internet-decree-vietnam-and)\nwell as a well-known Vietnamese mathematician, a Vietnamese pro-democracy activist, and a Vietnam-based journalist at the Associated\nPress.\n\n### A Campaign Targeting EFF and Associated Press\n\nWe will begin with the attack targeting EFF staffers. This marks the first time we have detected a targeted malware attack against our\norganization by what appear to be state-aligned actors.\n\nOn December 20th, 2013, two EFF staffers received an email from “Andrew Oxfam,” inviting them to an “Asia Conference,” and inviting them\nto click on a pair of links which were supposed to contain information about the conference and the invitation itself. These links were especially\nsuspicious because they were not hosted on Oxfam’s domain, but instead directed the invitee to a page hosted on Google Drive, seen below.\nIn addition, this email contained two attachments purporting to be invitations to the conference.\n\n\n-----\n\nThis targeting is especially interesting because it demonstrates some understanding of what motivates activists. Just as journalists are tempted\nto open documents promising tales of scandal, and Syrian opposition supporters are tempted to open documents pertaining to abuses by the\nAssad regime, human rights activists are interested in invitations to conferences. For greater verisimilitude, the attacker should have included\nan offer to pay for flights and hotels.\n\nBoth attachments are the same:\n\n351813270729b78fb2fe33be9c57fcd6f3828576171c7f404ed53af77cd91206 Invitation.hta\n\n351813270729b78fb2fe33be9c57fcd6f3828576171c7f404ed53af77cd91206 Location.hta\n\nThe detection rate for this malware is very low, using [VirusTotal, we see only one anti-virus vendor out of a possible 47 detecting this as of 19](https://www.virustotal.com/en/file/351813270729b78fb2fe33be9c57fcd6f3828576171c7f404ed53af77cd91206/analysis/)\nJanuary 2014.\n\nThe same malware was also sent to an Associated Press reporter, masquerading as a Human Rights Watch paper.\n\nIn this attack, clicking the link in the email takes the user to the malicious HTML application (.hta) file.\n\nThe file meta-data reveals the following information:\n\nInvitation.hta: Composite Document File V2 Document, Little Endian, Os: Windows, Version 6.1, Code page: 1252, Template: Normal,\nRevision Number: 2, Name of Creating Application: Microsoft Office Word, Total Editing Time: 01:00, Create Time/Date: Mon Nov 19\n05:02:00 2012, Last Saved Time/Date: Mon Nov 19 05:02:00 2012, Number of Pages: 3, Number of Words: 395, Number of Characters:\n2258, Security: 0\n\nThis HTML application contains an encoded executable and also contains a Microsoft Word document named “baviet.doc”:\n\nWhen the recipient runs the attachment it drops the following files:\n\nC:\\Users\\admin\\AppData\\Local\\Temp\\baiviet.doc\n\nC:\\Users\\admin\\AppData\\Local\\Temp\\xftygv.exe\n\nWhen \"baviet.doc’ is displayed and \"xftygv.exe\" is run, it causes the following files to be installed:\n\n\n-----\n\nC \\ og a es\\Co o es\\ c oso t s a ed\\ \\ Obj dat\nC:\\Users\\admin\\AppData\\Local\\Temp\\1959.tmp\nC:\\Users\\admin\\AppData\\Local\\Temp\\19A8.tmp\nC:\\Users\\admin\\AppData\\Local\\Temp\\1A65.tmp\nC:\\Users\\admin\\AppData\\Local\\Temp\\1D72.tmp\nC:\\Users\\admin\\AppData\\Roaming\\HTML Help\\help.dat\nC:\\Users\\admin\\AppData\\Roaming\\KuGou7\\status.dat\nC:\\Users\\admin\\AppData\\Roaming\\Microsoft\\Media Player\\PLearnL.DAT\nC:\\Users\\admin\\AppData\\Roaming\\Microsoft\\Werfault\\WerFault.exe\nC:\\Windows\\Performance\\WinSAT\\DataStore\\Formal.Assessment.WinSAT.xml\nC:\\Windows\\Performance\\WinSAT\\ShaderCache.vs_3.0\nC:\\Windows\\System32\\api-ms-win-core-xstate-l1-1-0.bin\nC:\\Windows\\System32\\odbccr64.dll\n\nSeveral registry changes are made to enable the malicious implant to persist after reboot and the file api-ms-win-core-xstate-l1-1-0.bin is\nwritten into the process space of explorer.exe which then instantiates an outbound connection on port 443 to yelp.webhop.org.\n\nAt the time of the report, this domain pointed to 62.75.204.91 which hosted the following domains:\n\ntripadvisor.dyndns.info, neuro.dyndns-at-home.com, foursquare.dyndns.tv, wowwiki.dynalias.net, yelp.webhop.org\n\nThis has been used as a command and control server for other Vietnamese-affiliated malware:\n\n82f0db740c1a08c9d63c3bb13ddaf72c5183e9a141d3fbd1ffb9446ce5467113 bai viet.hta\n9c07d491e4ddcba98c79556c4cf31d9205a5f55445c1c2da563e80940d949356 Unhotien.doc\n\nExamining this malware reveals a relationship to earlier campaigns targeting Vietnamese activists.\n\n### Targeting of Vietnamese Bloggers\n\nIn February of 2013, a Vietnamese blogger and mathematics professor, received the following email:\n\nLike the malware targeting the EFF and the Associated Press, the attachment was an HTML Application. In this case, the attachment was\ncompressed with 7zip.\n\n2fa7ad4736e2bb1d50cbaec625c776cdb6fce0b8eb66035df32764d5a2a18013 Thu moi.7z\n\nextracted:\n\ndd100552f256426ce116c0b1155bcf45902d260d12ae080782cdc7b8f824f6e1 Thu moi.hta\n\nThe file meta-data reveals the following information:\n\nThu moi.hta: Composite Document File V2 Document, Little Endian, Os: Windows, Version 6.1, Code page: 1252, Author: pluto,\nTemplate: Normal, Last Saved By: pluto, Revision Number: 2, Name of Creating Application: Microsoft Office Word, Total Editing Time:\n07:00, Create Time/Date: Thu Mar 1 05:02:00 2012, Last Saved Time/Date: Thu Jan 24 09:28:00 2013, Number of Pages: 3, Number of\nWords: 277, Number of Characters: 1584, Security: 0\n\nAs with the EFF and AP attacks, the HTML application contains an encoded executable ( “zzpauvooos.exe”) and a document (“Doc loi.doc”).\n\nRunning “Thu moi.hta” displays “Doc loi.doc” and also drops the following files:\n\n\n-----\n\nC \\Use s\\ad \\ pp ata\\ oca \\ e p\\ oc o doc\nC:\\Users\\admin\\AppData\\Local\\Temp\\zzpauvooos.exe\n\nWhen \"‘zzpauvooos.exe\" is run, it drops the following file:\n\nC:\\Users\\admin\\AppData\\Local\\Temp\\C947.tmp\n\nAnd then following command is run:\n\n\"C:\\Users\\admin\\AppData\\Local\\Temp\\C947.tmp\" --helpC:\\Users\\admin\\AppData\\Local\\Temp\\zzpauvooos.exe\nD1DF15E4D714BFDB764ECF92AE709D14BCA3E0E6C759CF7C675BE26D0296A63C3B147110AC79543CC31527651D66787152102A66\n\nThen the following files are dropped onto the system and the original executable is deleted:\n\nC:\\Users\\admin\\AppData\\Roaming\\Common Files\\defrag.exe\nC:\\Users\\admin\\AppData\\Roaming\\Identities\\{116380ff-9f6a-4a90-9319-89ee4f513542}\\disk1.img\nC:\\Windows\\Tasks\\ScheduledDefrag.job\nC:\\Windows\\Tasks\\ScheduledDefrag_admin.job\n\nValues are inserted into the Windows registry for persistence and the main implant, disk1.img, contacts the remote command and control\ndomain, static.jg7.org, on port 443/tcp.\n\nA prominent Vietnamese pro-democracy blogger living in California was successfully targeted by this attack, which led to the compromise of\nher blog and the invasion of her private life.\n\nThe group behind these attacks appears to have been operating since late 2009, and has been very active in the targeting of Vietnamese\ndissidents, people writing on Vietnam, and the Vietnamese diaspora. The appears to be the work of a group commonly known as “Sinh Tử\nLệnh” and while it has been anecdotally claimed to be the work of Chinese actors, it seems to be more likely the work of Vietnamese targeting\nVietnamese.\n\nEFF is greatly disturbed to see targeted malware campaigns hitting so close to home. While it is clear that this group has been targeting\nmembers of the Vietnamese diaspora for some time, these campaigns indicate that journalists and US activists are also under attack. And\nwhile longtime activists and journalists might expect to be targeted by a state they regularly criticize, it appears that a single blog post is\nenough to make you a target for Vietnamese spying.\n\n## Join EFF Lists\n\n### Join Our Newsletter!\n\nEmail updates on news, actions, events in your area, and more.\n\nThanks, you're awesome! Please check your email for a confirmation link.\n\nOops something is broken right now, please try again later.\n\n## Related Updates\n\n[Deeplinks Blog by Jeremy Malcolm | June 6, 2014](https://www.eff.org/updates?type=blog)\n\n### Defamation Suits Used to Bludgeon Southeast Asian Bloggers and Independent Press\n\nWith almost double the population of the United States—packed into a much smaller land area—the eleven countries of Southeast Asia are\nhome to more than eight out of every hundred people in the world.Two Southeast Asian countries, Indonesia and the Philippines, are in the top\nten global users of Facebook...\n\n\n-----\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Danny O'Brien | April 23, 2014](https://www.eff.org/about/staff/danny-obrien-0)\n\n### How Iran's Gadget Bloggers Became Victims of the Revolutionary Guard\n\nNarenji (\"Orange\") was Iran's top website for gadget news, edited daily by a team of tech bloggers who worked from a cramped office in the\ncountry's city of Kerman. The site was targeted at Iran's growing audience of technology enthusiasts. Like Gizmodo or Engadget in the United\nStates, it had...\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Jillian C. York | March 13, 2014](https://www.eff.org/about/staff/jillian-york)\n\n### A Short Guide to the Internet’s Biggest Enemies\n\n[Reporters Without Borders (RSF) released its annual “Enemies of the Internet” index this week—a ranking first launched in 2006 intended to](http://12mars.rsf.org/2014-en/#slide2)\ntrack countries that repress online speech, intimidate and arrest bloggers, and conduct surveillance of their citizens. Some countries have\nbeen mainstays on the annual index, while others...\n\n[Deeplinks Blog by Hanni Fakhoury,](https://www.eff.org/updates?type=blog) [Jennifer Lynch | March 12, 2014](https://www.eff.org/about/staff/jennifer-lynch)\n\n### Prosecution of Barrett Brown Still Threatens Journalistic Freedom in U.S.\n\nLast week, the federal government finally dismissed 11 controversial counts from its overzealous prosecution of journalist Barrett Brown.\nThese counts charged Brown with identity theft for sharing a link to records documenting improper and potentially illegal activities by the U.S.\nintelligence contractor, Stratfor Global Intelligence.\n\nThe fact that Brown...\n\n\n-----\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Jillian C. York | December 29, 2013](https://www.eff.org/about/staff/jillian-york)\n\n### 2013 in Review: As Governments in the Arab World Crack Down, Activists Fight Back\n\n_As the year draws to a close, EFF is looking back at the major trends influencing digital rights in 2013 and discussing where we are in the fight_\n_for free expression, innovation, fair use, and privacy. Click_ _[here to read other blog posts in this series.](https://www.eff.org/deeplinks/2013/12/2013-review)_\n\nThe uprisings...\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Jillian C. York | December 17, 2013](https://www.eff.org/about/staff/jillian-york)\n\n### Will Morocco Regulate the Internet? An Interview with Zineb Belmkaddem and @IbnKafka\n\nIn a region where censorship is the norm, Morocco has always stood out for its nominally free press, and mostly free Internet. But in the past\n[year, that freedom has been repeatedly challenged, most recently when editor Ali Anouzla was imprisoned under terrorism charges for linking](https://www.eff.org/deeplinks/2012/02/moroccan-activists-arrest-signals-crackdown-speech)\nto a...\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Danny O'Brien | November 23, 2013](https://www.eff.org/about/staff/danny-obrien-0)\n\n### Free Expression, Surveillance, and the Fight Against Impunity\n\nJournalists, bloggers and others who speak out against the powerful risk terrible repercussions for their work. Around the world, they face\nphysical intimidation, violent attacks, and even murder for speaking out.\n\nWhen such crimes are committed against those who exercise their right to free speech, the perpetrators all too...\n\n\n-----\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Jillian C. York | November 14, 2013](https://www.eff.org/about/staff/jillian-york)\n\n### November 15: The Day of the Imprisoned Writer\n\nCensorship affects writers, journalists, and bloggers around the world, in various ways. In some cases, censorship is state-sanctioned: on\n[books, websites, and other forms of media. Elsewhere (including in the United States), it’s self-imposed. And in many countries, writers face](http://www.nytimes.com/2013/11/12/books/pen-american-center-survey-finds-caution-among-members.html?smid=tw-share&_r=0)\nthreats more severe than censorship of their written word,...\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Jillian C. York | October 16, 2013](https://www.eff.org/about/staff/jillian-york)\n\n### What Do Iran and Facebook Agree On?\n\nBack in 2008, a young Moroccan engineer named Fouad Mourtada became the first person in his country to be arrested for a social\nnetworking-related offense. His crime? Something that happens all over the world every day...Mourtada created a Facebook profile\nrepresenting one of the Moroccan princes. While Mourtada claimed he...\n\n[Deeplinks Blog by](https://www.eff.org/updates?type=blog) [Eva Galperin, Maira Sutton | September 10, 2013](https://www.eff.org/about/staff/eva-galperin)\n\n### Vietnam's Internet Censorship Bill Goes Into Effect\n\n[Internet freedom has gone from bad to worse in Vietnam as an online censorship law known as Decree 72 went into effect this month. It bans](http://www.bbc.co.uk/news/world-asia-23920541)\nbloggers and users of social media from quoting, gathering, or summarizing information from press organizations or government websites.\nWhile the main justification for...\n\n### Join Our Newsletter!\n\nEmail updates on news, actions, events in your area, and more.\n\nThanks, you're awesome! Please check your email for a confirmation link.\n\nOops something is broken right now, please try again later.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-01-19 - Vietnamese Malware Gets Very Personal.pdf"
    ],
    "report_names": [
        "2014-01-19 - Vietnamese Malware Gets Very Personal.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536011,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653701006,
    "ts_modification_date": 1653701006,
    "files": {
        "pdf": "https://archive.orkl.eu/aaf73907c06690110ec7e5c0374cb1f8db260add.pdf",
        "text": "https://archive.orkl.eu/aaf73907c06690110ec7e5c0374cb1f8db260add.txt",
        "img": "https://archive.orkl.eu/aaf73907c06690110ec7e5c0374cb1f8db260add.jpg"
    }
}