{
    "id": "480cd6da-7f0d-4348-bddd-092f720aa286",
    "created_at": "2023-01-12T15:00:05.754571Z",
    "updated_at": "2025-03-27T02:06:04.64218Z",
    "deleted_at": null,
    "sha1_hash": "df699d77acec89b6644d11049931d8e5ccba1cc8",
    "title": "2022-02-14 - Staying ahead of REvil’s Ransomware-as-a-Service business model",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:10Z",
    "file_modification_date": "2022-05-27T23:00:10Z",
    "file_size": 178088,
    "plain_text": "# Staying ahead of REvil’s Ransomware-as-a-Service business model\n\n**[darktrace.com/en/blog/staying-ahead-of-r-evils-ransomware-as-a-service-business-model/](https://www.darktrace.com/en/blog/staying-ahead-of-r-evils-ransomware-as-a-service-business-model/)**\n\nOakley Cox, Director of Analysis | Monday February 14, 2022\n\nREvil, also known as Sodinokibi, is a Ransomware-as-a-Service (RaaS) gang responsible for\n[one of the largest ransomware attacks in history. On 14th January 2022,](http://10.10.0.46/blog/minimizing-the-r-evil-impact-delivered-via-kaseya-servers) [Russia announced](http://securityweek.com/russia-lays-smackdown-revil-ransomware-gang)\nit had arrested 14 members of the criminal gang. The move came at the request of the US\nauthorities, who have worked hard with international partners to crack down on the gang.\nLast year, multiple high-profile attacks were attributed to the REvil group, including the JBS\n[ransomware and Kaseya supply chain incidents.](http://10.10.0.46/blog/minimizing-the-r-evil-impact-delivered-via-kaseya-servers)\n\nThe arrests are certainly a victory for western law enforcement agencies, and follows\nNovember’s announcement from Europol that seven arrests of REvil affiliates had been\nmade in the preceding months. The question is: to what extent will these arrests disrupt the\ngang’s operations, and for how long?\n\n[Early indications from security researchers at ReversingLabs indicates REvil activity has](https://blog.reversinglabs.com/blog/after-russian-arrests-revil-rolls-on)\nbeen unaffected. Statistics on REvil implants two weeks after the Russian arrests are\nunchanged, and if anything indicate a modest increase.\n\nThis continued activity implies one of two scenarios:\n\n\n-----\n\nThe flurry of arrests have only impacted middle men within the criminal gang s\nhierarchy\nREvil’s ransomware-as-a-service model is resilient enough to survive disruption from\nlaw enforcement\n\nBoth scenarios are worrisome to those who may fall prey to ransomware gangs, and the\nreality is likely to be a far more complex mixture of these and other factors. The crackdown\non ransomware is long overdue, but the battle is likely to be a long one. Law enforcement\nagencies need to disrupt the business model to such an extent that it no longer becomes\nprofitable or favorable to be in the ransomware business, and this is likely to take months or\neven years.\n\nSo as the crackdown on ransomware plays out on the biggest stage, what comfort, if any,\ncan security teams take from recent events?\n\n## Staying ahead of the evolving RaaS model with AI\n\nA [joint report on ransomware issued recently by the FBI, CISA, the NCSC, the ACSC and](https://www.ncsc.gov.uk/files/2021%20Trends%20show%20increased%20globalised%20threat%20of%20ransomware.pdf)\nthe NSA highlighted key trends over the past year:\n\nRaaS has become increasingly professionalized, with business models and processes\nnow well established.\nThe business model complicates attribution because there are complex networks of\ndevelopers, affiliates, and freelancers.\nRansomware groups are sharing victim information with each other, diversifying the\nthreat to targeted organizations.\n\nIn summary, the report illuminates how ransomware gangs have become increasingly\nadaptable when it comes to evading law enforcement and maximizing profit from ransom\npayments. Multiple groups have faded away, or retired, only to reappear under a different\nname and with a slightly updated playbook. The tactics, techniques, and procedures (TTPs)\ndiffer from victim to victim, largely because attacks are conducted by different ransomware\noperators and affiliates.\n\nThis is troubling for law enforcement bodies trying to crack down on the individuals behind\nthese attacks. When a RaaS group like REvil consists of an amorphous and ever-changing\nweb of associates, making individual arrests is a constant game of catch up, and will be\nunlikely to bring down the group as a whole.\n\nThe same battle is being played out on the scale of individual attack campaigns. Security\ntools focused on the hallmarks of previously encountered threats are also in a continuous\nstate of catch up: by the time a single attack is detected, fingerprinted, and stored for next\ntime, attackers and their techniques have moved on.\n\n\n-----\n\nBut there is another option available to defenders, who are increasingly turning to SelfLearning AI to stay one step ahead of attackers. By learning its digital surroundings and\nidentifying subtle deviations indicative of an attack, this technology can detect and respond\nto novel attacks on the first encounter. Below is an example of how Self-Learning AI detected\nan attack launched by REvil without the use of rules or signatures.\n\n## REvil threat find\n\nIn the summer of 2021, a REvil affiliate launched an attack against a health and social care\norganization – a sector that has seen a big increase in cyber-attacks since the start of the\nglobal pandemic. While the attack was detected by Darktrace’s AI without using rules or\nsignatures, the security team was not monitoring Darktrace at the time. In the absence of\n[Autonomous Response – which would have taken targeted action to contain the threat – the](http://10.10.0.46/autonomous-response)\nattack was allowed to progress.\n\nAfter gaining access to the network via the laptop of a remote worker, the attacker was able\nto abuse a legitimate remote desktop (RDP) connection to a corporate jump server to\nbruteforce additional credentials.\n\nOnce equipped with more credentials, the attacker connected to multiple internal devices via\nRDP, including a second jump server. Data exfiltration began from the initially compromised\nserver over RDP port 3389.\n\nTwo weeks later, the attacker identified the organization’s crown jewels, stored on a third\nserver, and attempted to initiate command and control (C2) communications. The server\nmade a number of unusual external connections, including attempts to connect to a rare\ndomain that resembled the pattern of activity associated with REvil’s earlier Kaseya\nransomware campaign.\n\n[Darktrace for Endpoint, which was running on remote user devices, provided additional](http://10.10.0.46/endpoint)\nvisibility, enabling the security team to determine the initially compromised user device. Had\nAntigena been active on the endpoint, it would have intervened to stop this unusual activity\nby blocking the specific unusual connections – containing the attack without impacting\nnormal business operations.\n\n## Connecting the dots of a low-and-slow attack\n\nThe total dwell time of the attacker was 22 days. They were patient, and undertook actions in\nbursts of activity often with days in between. This pattern of behavior is not uncommon for\nransomware attacks, particularly those using the RaaS model in which each step may be\nperformed by different gang members or affiliates.\n\nDarktrace’s Cyber AI Analyst was able to track in real time the complete attack lifecycle over\nseveral weeks, stitching together the separate phases of the attack into a coherent security\nincident.\n\n\n-----\n\nFigure 1: Cyber AI Analyst reveals the complete attack kill chain\n\n## New name, same game\n\n[This attack is another case of threat actors living off the land: using legitimate programs and](http://10.10.0.46/blog/living-off-the-land-how-hackers-blend-into-your-environment)\nprocesses that were already in use in the environment to perform malicious activity. This can\nbe very difficult to detect with traditional tools that are based on static use cases and cannot\ndifferentiate a legitimate RDP session from a malicious one.\n\nAs cyber-criminal groups like REvil continue to defy law enforcement efforts, defenders need\nto stay ahead with AI technology that learns its environment, adapts as it changes and\ngrows, and responds to threats based on subtle deviations that indicate an emerging attack.\nAutonomous Response has been adopted by over thousands of organizations across all\nareas of the digital estate – from email and cloud services to endpoint devices, stopping\nransomware attacks early, before encryption is achieved.\n\nThanks to Darktrace analyst Petal Beharry for her insights on the above threat find.\n\n## Technical details\n\n**IoCs:**\n\nIoC Description\n\n91.184.0[.]34 Attempting to beacon to Command and Control\n\n93.158.97[.]64 Attempting to beacon to Command and Control\n\n67.227.249[.]156 Attempting to beacon to Command and Control\n\n149.11.42[.]53 Location of exfiltration server\n\n**Darktrace model detections:**\n\nDevice / RDP Scan\nDevice / Bruteforce Activity\nCompliance / Outbound Remote Desktop\nAnomalous Connection / Upload via Remote Desktop\nAnomalous Connection / Download and Upload\nAnomalous Connection / Uncommon 1 GiB Outbound\nAnomalous Connection / Active Remote Desktop Tunnel\nDevice / New or Uncommon SMB Named Pipe\nDevice / Large Number of Connections to New Endpoints\n\n**MITRE ATT&CK techniques observed:**\n\n\n-----\n\nReconnaissance TA0043 active scanning\n\nCredential Access TA0006 bruteforce\n\nLateral Movement TA0008 Exploitation of remote services\n\nExfiltration TA0010 Exfiltration over alternative protocol\n\nCommand and Control TA0011 Application layer protocol\n\n## Oakley Cox\n\nOakley Cox is Analyst Technical Director for the Asia-Pacific region, and oversees the\ndefense of critical infrastructure and industrial control systems, helping to ensure that\nDarktrace’s AI stays one step ahead of attackers. Oakley is GIAC certified in Response and\nIndustrial Defense (GRID), and helps customers integrate Darktrace with both existing and\nnew SOC and Incident Response teams. He also has a Doctorate (PhD) from the University\nof Oxford.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-14 - Staying ahead of REvil’s Ransomware-as-a-Service business model.pdf"
    ],
    "report_names": [
        "2022-02-14 - Staying ahead of REvil’s Ransomware-as-a-Service business model.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653692410,
    "ts_modification_date": 1653692410,
    "files": {
        "pdf": "https://archive.orkl.eu/df699d77acec89b6644d11049931d8e5ccba1cc8.pdf",
        "text": "https://archive.orkl.eu/df699d77acec89b6644d11049931d8e5ccba1cc8.txt",
        "img": "https://archive.orkl.eu/df699d77acec89b6644d11049931d8e5ccba1cc8.jpg"
    }
}