{
    "id": "4837d252-a821-485a-8db0-a393b8a9b3ae",
    "created_at": "2022-10-25T16:48:24.297809Z",
    "updated_at": "2025-03-27T02:05:37.205326Z",
    "deleted_at": null,
    "sha1_hash": "3cfb99df1240879d53b8f8f3fb56be1a279c6aa9",
    "title": "New Ransomware-as-a-Service Tool ‘Thanos’ Shows Connections to ‘Hakbit’",
    "authors": "",
    "file_creation_date": "2020-06-09T09:44:51Z",
    "file_modification_date": "2020-06-09T09:45:06Z",
    "file_size": 5992849,
    "plain_text": "MALWARE/TOOL PROFILE\n\n# New Ransomware-as-a- Service Tool ‘Thanos’ Shows Connections to ‘Hakbit’\n\n\n## By Insikt Group\n\n\n**®**\n\n\n-----\n\n_Recorded Future’s Insikt Group® has developed new detection methods for Thanos_\n_ransomware as part of an in-depth investigation. Data sources included the Recorded_\n_Future® Platform, online multiscanner repositories, and various OSINT tools._\n\n_The target audience for this research includes security practitioners, network defenders,_\n_and threat intelligence professionals who are interested in novel ransomware threats._\n\n### Executive Summary\n\nIn January 2020, while using the Recorded Future® Platform\nto monitor the weaponization of the RIPlace technique, Insikt\nGroup uncovered a new family of ransomware for sale on Exploit\nForum called Thanos, developed by a threat actor with the alias\n“Nosophoros.”\n\nNosophoros offered Thanos as a private ransomware builder with\nthe ability to generate new Thanos ransomware clients based on\n43 different configuration options. Recorded Future analyzed the\nThanos ransomware builder to detect, understand, and exercise the\nbreadth of functionality that the Thanos ransomware can support.\nThe Thanos client is simple in its overall structure and functionality.\nIt is written in C# and is straightforward to understand even with\nobfuscation, though it does incorporate some more advanced\nfeatures such as the RIPlace technique.\n\nDuring this research, we observed an overlap between our detections\nand a ransomware family called Hakbit. Based on code similarity,\nstring reuse, and core functionality, Insikt Group assesses with high\nconfidence that ransomware samples tracked as Hakbit are built\nusing the Thanos ransomware builder developed by Nosophoros.\n\nThanos’s ease of use has been an asset to its creator, as Recorded\nFuture has observed the rising popularity of the malware on\nmultiple underground forums. We believe this is indicative of\nthe continuing trend of threat actors looking for ready-to-use\nransomware. Nosophoros has continued to develop Thanos over\nat least the past six months, with regular updates and new features.\nThanos is advertised as a “Ransomware Affiliate Program,” similar\nto a ransomware-as-a-service (RaaS) model. Thanos will continue to\nbe weaponized by threat actors either individually and collectively\nas part of the affiliate program.\n\n\n-----\n\n### Key Judgments\n\n - Thanos was the first ransomware family to advertise use\n\nof the RIPlace technique, demonstrating a real instance\nof underground actors weaponizing proofs of concept\noriginating from security research.\n\n - The Thanos ransomware does not incorporate any novel\n\nfunctionality or techniques, with the exception of its use\nof RIPlace. With information security best practices such\nas prohibiting external FTP connections and blacklisting\ndownloads of known-offensive security tools, the risks\nassociated with the two key components of Thanos — Data\nStealer and Lateral Movement — can be averted.\n\n - Based on code similarity, string reuse, and core functionality,\n\nRecorded Future assesses with high confidence that the\nThanos ransomware is the commodity ransomware that has\nbeen identified as Hakbit by other security researchers.\n\n - By default, Thanos uses a random, 32-byte string generated at\n\nruntime as a password for the AES file encryption. The string\nis then encrypted with the ransomware operator’s public key\nand added to the ransom note. Without the corresponding\nprivate key, recovering encrypted files is impossible.\n\n - The Thanos builder includes the option to use a static\n\npassword for the AES file encryption. If this option is selected,\nthe clients generated by Thanos will contain the AES password\nused to encrypt files. Analyzing the client could allow data\nrecovery without paying the demanded ransom.\n\n - During Thanos client execution, the encryption and decryption\n\nkeys can be recovered from memory, which should prevent\nloss of data without paying the demanded ransom.\n\n\n-----\n\n### Background\n\n[In November 2019, security company Nyotron released a proof of](https://www.nyotron.com/collateral/RIPlace-report_compressed-3.pdf)\nconcept for a ransomware technique dubbed RIPlace. At the time of\nrelease, RIPlace bypassed most existing anti-ransomware methods,\nslipped past antivirus (AV) products tested, and evaded detection by\nendpoint detection and response (EDR) products. Nyotron disclosed\nthe flaw to the vendors listed, including Microsoft. However,\naccording to Microsoft’s [statement given to BleepingComputer,](https://www.bleepingcomputer.com/news/security/new-riplace-bypass-evades-windows-10-av-ransomware-protection/)\nsince RIPlace had not been actually observed in ransomware at\nthe time of writing, “this technique is not considered a vulnerability\nand as CFA is a defense-in-depth feature, it does not satisfy our\nsecurity servicing criteria.” According to BleepingComputer, only\nKaspersky and Carbon Black modified their software to prevent\nthis technique from executing, as last reported in November 2019.\nHowever, since as early as January 2020, Insikt Group has observed\nmembers of dark web and underground forums implementing the\nRIPlace technique.\n\n_Figure 1: Timeline showing emergence of RIPlace technique in ransomware for sale. (Source: Recorded Future)_\n\n\n-----\n\nInsikt Group first observed Thanos ransomware in February 2020\nbeing advertised by threat actor Nosophoros on XSS Forum due\nto a feature update including the RIPlace technique. Nosophoros\noffered either a monthly “light” or lifetime “company” subscription\nto the Thanos builder. The company version includes additional\nfeatures as compared with the light version, such as RootKit, RIPlace\ntechnology, client expiration settings for affiliate programs, and\nspread on LAN. This report is based on analysis of the lifetime\n“company” version, which covers the full capabilities of Thanos\nransomware.\n\n### Threat Analysis\n\n**Builder Analysis**\n\nThe Thanos ransomware builder gives operators of the ransomware\nthe ability to create the ransomware clients with many different\noptions. The full builder user interface can be seen in Figure 2. The\nbuilder provides some default options, but requires operators to\nconfigure others, such as the Bitcoin address that will be included\nin the ransom note. Other options can be enabled at the operator’s\ndiscretion.\n\n_Figure 2: Thanos ransomware builder options. (Source: Recorded Future)_\n\n\n-----\n\nOnce the operator has completed the configuration stage, the\nbuilder generates a .NET executable file in the directory of the\noperator’s choosing. The binaries generated appear to be the result\nof replacing strings in a template binary based on the configuration\noptions selected, and based on the configuration options using\nstring values “YES” and “NO” rather than actual boolean values. An\nexample of an unobfuscated sample with the configuration options\ncan be seen in Figure 3. In the builder, hovering over each of these\noptions would reveal a help message for the option. The full list of\noptions and their help messages can be found in Appendix A.\n\n_Figure 3: Configuration from sample 81e81f0bbbdb831eda215033b7a7dbf2eed3812f4e58118f181a8e99e613179e (Source: Recorded Future)_\n\n\n-----\n\nThe builder is also responsible for managing the obfuscation of the\nfinal binaries. With no obfuscation enabled, the generated .NET\nexecutables contain plaintext strings, but still have randomized\nnames for variables, methods, classes, and namespaces. The builder\nprovides two obfuscation methods. The primary method is through\nthe use of a cracked version of the commercial obfuscations tool\ncalled SmartAssembly developed by the company Redgate. The\nsecondary method is a configuration option that creates an Inno\nSetup installer file with the client as an embedded resource file.\n\n**Ransomware Client Overview**\n\nThe Thanos client is written in C#. The clients generated all had\nrandomized strings for the method names, variable names, and\nclass names.\n\nThe Thanos client will contain 12 to 17 classes depending on the\noptions and settings selected during the building phase. Some of\nthe classes, such as Program and Crypto, are included in every\nbuild. Others, such as NetworkSpreading and Wake on LAN, are\nonly included in the final binary, if the related option is selected.\nThe table below covers the core classes and our description of their\nintended purpose.\n\n**Class Name** **Description**\n\nAMSI Attempts to bypass the Windows Antimalware Scan Interface (AMSI)\n\nAntiKill Disables the use of the Task Manager and protects process from being terminated\n\nChecks for use of a debugger, running in Sandboxie, use of a virtual machine,\nAnti_Analysis\n\nrunning Windows XP or small hard drive\n\nCrypto Creates a randomly generated string and then Base64 encodes\n\nContains helper functions for encryption. Also contains the public key used to\n\nCryptography Helper\n\ndecode the AES encryption/decryption key\n\nDisable Disables Windows Defender\n\nEmpty Empties the Recycle Bin\n\nEncryptions Main function that performs the encryption/decryption of the files\n\nFTP Uploads data to FTP server\n\nKill Kills AVG or MalwareBytes antivirus engines if running\n\nLockedFiles Attempts to release locked files before encryption\n\n|Class Name|Description|\n|---|---|\n|AMSI|Attempts to bypass the Windows Antimalware Scan Interface (AMSI)|\n|AntiKill|Disables the use of the Task Manager and protects process from being terminated|\n|Anti_Analysis|Checks for use of a debugger, running in Sandboxie, use of a virtual machine, running Windows XP or small hard drive|\n|Crypto|Creates a randomly generated string and then Base64 encodes|\n|Cryptography Helper|Contains helper functions for encryption. Also contains the public key used to decode the AES encryption/decryption key|\n|Disable|Disables Windows Defender|\n|Empty|Empties the Recycle Bin|\n|Encryptions|Main function that performs the encryption/decryption of the files|\n|FTP|Uploads data to FTP server|\n|Kill|Kills AVG or MalwareBytes antivirus engines if running|\n\n\n-----\n\n|Mutex Helper|Creates mutex|\n|---|---|\n|NativeMethods|Sleep and execution state methods|\n|NetworkSpreading|Use of SharpExec_x64.exe or SharpExec_x86.exe to install clients on other machines|\n|ProcessCritical|Sets Thanos process as a “critical process,” ensuring that the system reboots if the process is terminated|\n|Program|The main function of the Thanos client|\n|Wallpaper|If this option is set, a custom Desktop wallpaper will be set as the primary desktop wallpaper|\n\n\nInsikt has provided additional analysis on some of the more\ninteresting classes in the Thanos Client Feature Analysis section.\n\n**Thanos Client Execution Flow**\n\nThe general execution path of Thanos contains three main activities\nshown below and depicted in Figure 4.\n\n**1. Advanced Options: Performs actions related to the**\n\nconfiguration settings\n\n**2. Prevent Termination and Recovery: Stops services and**\n\nprocesses that prevent its ability to run and delete backup files and\nshadow copies\n\n**3. Encrypt and Upload: Encrypt files and upload to FTP if configured**\n\nto do so at build time and show the ransom note\n\n\n-----\n\n_Figure 4: Processes created during the execution of a Thanos client. (Source: Recorded Future)_\n\n**Advanced Options**\n\nThe first phase consists mostly of executing the advanced options\nset during the build. These would include actions such as Kill\nDefender, Anti-VM, and AMSI Bypass.\n\nWithin the client itself, the configuration settings can be determined\nby a list of variables and string arrays at the end of the Program\nClass. Figure 5 depicts how the configuration settings are set to\n“yes” or “no” within the client.\n\n_Figure 5: Configuration options as class variables in the Thanos client. (Source: Recorded Future)_\n\n\n-----\n\n**Prevent Termination and Recovery**\n\nAfter the client performs the configuration actions, the client will\nnext perform a series of tasks to ensure it runs successfully as well\nas delete backups and shadow copies. These tasks cause multiple\nchild processes, each with different arguments to net.exe, taskkill.\nexe, del.exe, and vssadmin.exe. Appendix B addresses these actions\nin more detail.\n\n**Encrypt and Upload**\n\nFinally, the Thanos client will traverse the attached storage drives,\nand will attempt to discover and encrypt files with the file extensions\nconfigured in the builder (the default extensions can be found in\nAppendix C). If the option to upload files to an FTP server is enabled\n(called “datastealer” in the builder), then files with extensions\nthat match a list configured at build time will be uploaded before\nencryption. The default extensions to upload are “.docx,” “.pdf,”\n“.xlsx,” and “.csv.” Encrypted files have their extensions changed to\na value set at build type, with a default value of “.crypted.”\n\nAfter encryption of the files, the ransom note (seen in Figure 6)\nwill be saved to the desktop as well as any folder that has had files\nencrypted. The default ransom filename is “HELP_ME_RECOVER_\nMY_FILES.txt.“ The Thanos client also has the ability to change the\nwallpaper to an image that is downloaded from an HTTP server set\nby the threat actor.\n\n_Figure 6: Default ransom note. (Source: Recorded Future)_\n\n\n-----\n\nThe Thanos client can be configured to create a log of the encryption\nprocess that completed and upload that log to a threat actor’s\nFTP server.\n\nBesides the FTP functionality and the ability to download a wallpaper\nfrom a web server, the Thanos client does not have any built-in\nfunctionality for command and control (C2) communication.\n\nIf configured to do so, after the completion of all previous steps,\nthe Thanos client will delete itself.\n\n**Thanos Client Feature Analysis**\n\nTo understand the capabilities of Thanos ransomware, Recorded\nFuture generated over 80 clients with different configuration\noptions enabled. This section highlights six of the key features of\nthe ransomware.\n\n**Encryption Process**\n\nThe Thanos client uses AES-256 in CBC mode to encrypt user files.\nThe key used for the AES encryption is derived from a password\n[and salt using the Windows rfc2898DeriveBytes function call. Once](https://docs.microsoft.com/en-us/dotnet/api/system.security.cryptography.rfc2898derivebytes?view=netcore-3.1)\nthe client has used that key to encrypt all files that it discovers,\nthe client uses an embedded 2048 RSA public key to encrypt the\nAES password that was used. The base64 string of this encrypted\npassword is added to the ransom note, instructing the victim to\nsend the encrypted password string to the threat actors to decrypt\ntheir files. The private key paired with the public key used to encrypt\nthe password is needed to decrypt the AES password. Only the\noperator who built the Thanos client should have access to the\nprivate key.\n\n\n-----\n\nThat password is either statically included in the binary or\ndynamically created at runtime. The choice is decided by a builder\noption to use a static password. The help text for this option reads:\n“All computers in the same network will be encrypted using the\nsame encryption password.” If a dynamic key is chosen, then before\nstarting the encryption process the Thanos client uses the Windows\nRNGCryptoServiceProvider to generate a random, 32-byte base64\nstring that will be used as the AES password. If the Thanos client is\nconfigured to use a static password, then the password is stored\nin the binary itself. This means that if a Thanos client is recovered\nafter encryption has occurred, there is a chance that the victims\n**may be able to recover their files without paying the ransom.**\n\nThe Thanos client also supports a “Fast” mode of encryption where\nonly a portion of each file will be encrypted. The size of the encrypted\nportion is set at build time. When this mode is enabled, the client\nencrypts a configured amount of data from the file, overwrites the\nfile with the encrypted content starting at the beginning of the\nfinally, and prepends a string in the format “Thanos-<size of portion\nencrypted>-”. The code responsible for this can be seen in Figure 7.\n\n_Figure 7: Thanos string included in partial encryption “Fast” mode function. (Source: Recorded Future)_\n\n\n-----\n\n**RIPlace**\n\nOne of the “company” tier features is the ability to change the\nThanos client encryption process to use the RIPlace technique.\nAs mentioned earlier, RIPlace is a technique disclosed by security\ncompany Nyotron in November 2019 to evade certain antiransomware mitigations.\n\n[A detailed look at the technique can be found on Nyotron’s website.](https://www.nyotron.com/collateral/RIPlace-report_compressed-3.pdf)\nAt a high level, the technique describes a process to encrypt a target\nfile by leveraging symbolic links through an MS-DOS device name\nto copy an encrypted version of the file to the original file location.\n\nWhen enabled in the Thanos builder, generated clients will have an\nextra class and a modification of the encryption workflow to use\nthe RIPlace technique.\n\n_Figure 8: RIPlace class entry function. (Source: Recorded Future)_\n\nThe modified workflow is relatively straightforward. The function\nresponsible for the RIPlace workflow can be seen in Figure 8. First,\nthe Thanos client copies the contents of the target file to a temporary\ndirectory, encrypts the contents of the file, and saves the encrypted\nfile contents to the file in the temporary directory. Then the client\nexecutes the code seen in Figure 9 where an MS-DOS device name\nis created with the path to the target file, and the device name\n[“Resolve.” MoveFileExW is called to move the encrypted file in the](https://docs.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-movefileexw)\ntemporary directory to the new MS-DOS device, which acts as a\nsymbolic pointer to the target file path. The end result is that the\ntarget file is overwritten with the encrypted copy of the file.\n\n\n-----\n\n_Figure 9: Function executing the RIPlace technique. (Source: Recorded Future)_\n\n**Lateral Movement**\n\nThe lateral movement function of the Thanos client is mostly\n[driven by the use of the SharpExec tool, an offensive security tool](https://github.com/anthemtotheego/SharpExec)\nspecifically designed for lateral movement. The client downloads\nthe SharpExec tools from their GitHub repository (the download\nURLs are provided in the Detection and Mitigation section).\n\nFirst, the Thanos client will scan the local network to get a list of\nonline hosts. Then Thanos uses the PSEXEC-like functionality of the\nSharpExec, which allows it to execute the Thanos client on remote\ncomputers.\n\n\n-----\n\n_Figure 10: Network spreading function using SharpExec. (Source: Recorded Future)_\n\n**Wake on LAN (WoL)**\n\nTo spread laterally across a victim's local network, Thanos takes\nadvantage of a hardware feature in some computers known as\n\"Wake on LAN\" (WoL) that causes the host to turn on. It does\nso by sending a WoL \"magic packet\" of the format described in\nAppendix D.\n\nTo achieve this, the client will first use the Address Resolution\nProtocol (ARP) to collect a mapping of IP addresses and Media\nAccess Control (MAC) addresses. This information is contained in\nan ARP table.\n\nWith the IP addresses and MAC addresses, the client can create and\nsend the “magic packet” to the remote hosts. The Thanos client will\nthen try to connect to the remote hosts drive using the usernames\n“Administrator” or “Admin.” If the connection is successful, the\nremote drive will be added to the list of drives to be encrypted.\n\n\n-----\n\n_Figure 11: Wake on LAN functions. (Source: Recorded Future)_\n\nThe WoL functionality is similar to that of the WoL implementation\n[observed in Ryuk.](https://blogs.quickheal.com/deep-dive-wakeup-lan-wol-implementation-ryuk/)\n\n**Data Stealing**\n\nFollowing a common trend in ransomware operations of extorting\nvictims by threatening to publicly distribute sensitive files, the\nThanos client integrates the ability to exfiltrate all files with a\nspecified set of extensions. The default extensions to upload are\n“.docx,” “.pdf,” “.xlsx,” and “.csv,” but these can be changed at build\ntime. The exfiltration is done via an FTP webclient. The default\nparameters for the FTP URL, username, and password can all be\nseen in final clients, even after some obfuscation operations. The\ncode that manages this can be seen in Figure 12.\n\n_Figure 12: FTP stealing function. (Source: Recorded Future)_\n\n\n-----\n\n**Anti-Analysis**\n\nThe Thanos builder configuration option “Anti-VM” allows the client\nto perform several checks to determine whether it is executing within\na virtual machine (VM). The version of Thanos that we evaluated\nuses five checks to make the determination. A brief description for\neach of those checks can be found in the table below. If any of the\nchecks fail, the Thanos client will stop executing.\n\n**Check Name** **Description**\n\nCheck Virtualbox Make a WMI call to get the Win32_ComputerSystem, and look for “Virtual” or\n\nand VMware “vmware” in the model and manufacturer strings\n\nCheck if debugger\n\nMake a call to the Win32 API CheckRemoteDebuggerPresent\n\nis present\n\nCheck for Test whether the DLL used by Sandboxie (SbieDll.dll) is present\n\nSandboxie in the process memory\n\nCheck size of\n\nTest whether the hard drive is larger than 61 GB\n\nhard drive\n\nCheck OS version Test whether the Windows version is XP\n\n**Obfuscation**\n\nThe Thanos builder presents two options for generating obfuscated\noutput. The suggested obfuscation technique is using a cracked\nversion of the commercial .NET obfuscator SmartAssembly sold\nby a company called Redgate. The second option generates an\nInnoSetup installer file that contains the generated Thanos client.\n\nThe options the builder exposes for the obfuscation can be seen\nin Figure 13. However, there are publicly available deobfuscators\nfor SmartAssembly. Using a tool called [de4dot, Recorded Future](https://github.com/0xd4d/de4dot)\nanalysts were able to recover strings and determine the control\nflow of the obfuscated Thanos clients that they generated.\n\n|Check Name|Description|\n|---|---|\n|Check Virtualbox and VMware|Make a WMI call to get the Win32_ComputerSystem, and look for “Virtual” or “vmware” in the model and manufacturer strings|\n|Check if debugger is present|Make a call to the Win32 API CheckRemoteDebuggerPresent|\n|Check for Sandboxie|Test whether the DLL used by Sandboxie (SbieDll.dll) is present in the process memory|\n|Check size of hard drive|Test whether the hard drive is larger than 61 GB|\n|Check OS version|Test whether the Windows version is XP|\n\n\n-----\n\n_Figure 13: Thanos SmartAssembly default obfuscation options. (Source: Recorded Future)_\n\nThe secondary obfuscation option in the builder is called “Built\nin Crypter.” When enabled, the generated clients are embedded\nin an InnoSetup installer file. When executed, the installer file\nwill write the generated client to disk in directory C:\\Program\nFiles\\. The filename will depend on how many clients have been\ngenerated. One example of a sample using this obfuscation\ntechnique [observed on Any.Run created a client at the path](https://app.any.run/tasks/978fd116-cfe3-4eb7-b98c-ae3d37271a01/)\nC:\\Program Files\\Client-0.exe.\n\n### Detection and Mitigation\n\nThe Thanos client can run as different process names, as shown in\nFigure 14.\n\n_Figure 14: Potential process names. (Source: Recorded Future)_\n\n\n-----\n\nTo prevent termination of the Thanos client, it will perform the\ncommand line actions in Figure 15 to stop services and kill tasks.\n\n_Figure 15: Prevent termination. (Source: Recorded Future)_\n\nThe client will also perform the command line actions in Figure 16\nto delete any Windows Shadow copies and backups.\n\n\n-----\n\n_Figure 16: Delete shadow copies and user backups. (Source: Recorded Future)_\n\nIf the network spreading option is activated, the Thanos client will\ndownload “SharpExec” from the URLs in Figure 17.\n\n_Figure 17: Download strings for SharpExec. (Source: Recorded Future)_\n\nFigure 18 shows an example of what the FTP activity would look like\nif the data stealer option is enabled.\n\n_Figure 18: FTP activity indicators. (Source: Recorded Future)_\n\n\n-----\n\n**Mitigation**\n\nThe Thanos client has the ability to supply a static AES encryption\nkey. As seen in Figure 19, if the “StaticLooks” option is set to “Yes”\nthen the AES password is set statically instead dynamically. If this\nis the case, the decryption key can easily be extracted via analysis\nof the Thanos client.\n\n_Figure 19: Option to use a static password for the encryption. (Source: Recorded Future)_\n\nInsikt Group was able to observe the encryption keys present in\nmemory while the Thanos client was running by capturing the\nprocess memory and using [Bulk Extractor to search for the AES](https://github.com/simsong/bulk_extractor)\nkey. However, the keys are securely deleted from memory once\nthe client finishes encrypting and exits. If using an endpoint\ndetection response (EDR) tool to monitor for Thanos-related activity\nsuch as the termination of processes or the deletion of shadow\ncopies (as described above), it is feasible to detect Thanos while\nit is running and then capture the process memory to extract the\nencryption keys.\n\n### Thanos in the Wild and Overlap With Hakbit\n\nUsing a set of custom YARA rules, Insikt Group identified 24 Thanos\nsamples in malware multiscanner repositories. Appendix E contains\nthe hash values identified. While the majority of the samples were\ncreated using the SmartAssembly for obfuscation, we were still\nable to pull out the public key, Bitcoin address, and contact email\naddresses for the ransom for most samples.\n\n\n-----\n\nThe public and private keys are created when the Thanos builder is\nfirst executed, meaning that in its default configuration, every client\nfrom that builder will contain the same public key. This may be a\ngood way to identify clients from the same builder. Insikt Group\ndoes note that it would not be complicated to change public and\nprivate keys for each client build, but would be an extra step in\nthe deployment process and would cause the operator to have to\norganize which public keys were used for which client. As can be\nobserved in Figure 20, almost half of the samples are linked to two\nbuilders while the other ones are “one offs.”\n\n_Figure 20: Number of samples per public key identified. (Source: Recorded Future)_\n\nWhile Insikt Group only analyzed a small set of samples, this\ntrend has identified a benefit for researchers and analysts alike\nin attributing Thanos clients from multiple intrusions to a single\nthreat actor.\n\nDuring the course of research on the usage of Thanos, we observed\nan overlap between our detections and a ransomware family\ncalled Hakbit. Based on code similarity, the use of SmartAssembly,\nthe ransomware extension, the format of the ransom notes, and\nembedded strings, Recorded Future assesses with high confidence\nthat the ransomware family Hakbit is in fact Thanos. While minor\ndifferences appeared in samples collected over the last six months, it\nis very likely that this is due to ongoing development by Nosophoros.\nNosophoros’ original thread advertising the ransomware builder\nhas seen regular change log posts.\n\n\n-----\n\nRecorded Future notes the first reference to Hakbit is by a security\nresearcher with the Twitter username @GrujaRS on November 4,\n2019. @GrujaRS named the family Hakbit since the sample first\nidentified left a ransom note that included the contact email\naddress hakbit[@]protonmail[.]com. This discovery was made two\nweeks before Nosophoros made the first post advertising for their\nransomware builder.\n\nThe first Hakbit sample identified was obfuscated with\nSmartAssembly[1]. While the overall structure of the program had\nbeen rearranged, the core classes were largely similar to those that\nwere generated by the Thanos builder. In particular, the formatting\nof the ransom note was very similar and the control flow of the main\nfunction was almost identical, though there were more options in\nthe Thanos clients Recorded Future generated. The start of the\nencryption functions followed by the generation of the ransom\nnote in this sample[2] and in one of the Thanos clients generated by\nRecorded Future can be seen in Figure 21 below. Note that both\nsamples originally used a base64 encoding on all strings, but Figure\n21 and 22 show the strings after they were base64 decoded.\n\n_Figure 21: Recorded Future generated sample’s encryption and ransom note generation. (Source: Recorded Future)_\n\n_Figure 22: 916500065fb0037de6e95bdbeafaa69a8d3932af10e81acb02f88c6a65cb577e encryption and ransom note generation._\n\n_(Source: Recorded Future)_\n\n1  SHA-256: 916500065fb0037de6e95bdbeafaa69a8d3932af10e81acb02f88c6a65cb577e\n2  SHA-256: 916500065fb0037de6e95bdbeafaa69a8d3932af10e81acb02f88c6a65cb577e\n\n\n-----\n\nOne key difference between the samples was the way the generated\nAES password was encrypted. In this first Hakbit sample, the AES\npassword that was used to generate an AES file encryption key was\nencrypted with a key derived from a pre-shared AES password stored\nin the sample. The Thanos clients Recorded Future generated used\nan embedded public key to encrypt the generated AES password.\nThe result of the early samples using a pre-shared key was that\n[EMISOFT was able to release a decrypter shortly after the new](https://blog.emsisoft.com/en/34716/emsisoft-releases-a-new-decryptor-for-hakbit-ransomware/)\nransomware was discovered. This decrypter will not work on later\nversions of Thanos/Hakbit.\n\nRecorded Future has identified 22 files associated with Hakbit.\nThe majority of them had some similarity with the samples that\nwere generated by the Thanos builder. Eight of the samples were\nobfuscated with SmartAssembly. In those eight samples, the class\nstructure was almost exactly the same as the class structure in the\nclients generated by the Thanos builder. Furthermore, the eight\nsamples all had almost exactly the same ransom note generator\nfunction as the samples generated by the Thanos builder. Lastly,\none of the samples from the 22 files labeled as Hakbit was an\nInnoSetup installer file, the same output as the built-in crypter\noption of the Thanos builder.\n\nOne interesting sample identified as Hakbit is shown in Figure 23[3].\nThis sample had unobfuscated class, member, and variable names\nand the code was almost completely identical to unobfuscated\nfiles generated by the Thanos builder. This file also included the\nencryption method that includes the “Thanos” string as can be\nseen below.\n\n_Figure 23: Encryptions.WriteToFile function from 81e81f0bbbdb831eda215033b7a7dbf2eed3812f4e58118f181a8e99e613179e._\n\n_(Source: Recorded Future)_\n\n3  81e81f0bbbdb831eda215033b7a7dbf2eed3812f4e58118f181a8e99e613179e\n\n\n-----\n\nHowever, there were some samples labeled by security researchers\non multiscanner repositories as Hakbit that had a very weak\nconnection to both the other Hakbit samples and the Thanos builder\ngenerated clients. One set of three files identified as Hakbit used\nthe namespace crypt_engine and included a C# form class that was\nvery different from the other samples:\n\n    - 3ccf57e60cdf89d04f2c7e744d73e3b40a4308a2ba87d0423c96f601d737733f\n\n    - ff1a88c2ad5df435a978c63d21a6ab0642134785284b01137e18dd235197b66d\n\n    - 917905ba95c10847e0bf3bc66332ae05616a0ddd965a00ae8ec3431ed11c39d2\n\nThe only connection identified by Recorded Future between those\nthree samples and the other samples labeled “Hakbit” was the\nmethod name for the self-delete function: imha_zamani. “Imha\nzamani” is Turkish for “time of destruction.” This function name\nwas used in the Hakbit sample that did not have obfuscated class\nand method names[4].\n\n4  SHA256: 81e81f0bbbdb831eda215033b7a7dbf2eed3812f4e58118f181a8e99e613179e\n\n\n-----\n\n### Outlook\n\n[Recorded Future published a report in February 2020 predicting a](https://www.recordedfuture.com/ransomware-trends-2020/)\nnumber of ransomware trends for the year, including that:\n\n- The ransomware-as-a-service market will continue to flourish\n\n- There will be a continued separation between the ransomware\n“haves” and “have-nots”\n\nWe believe these predictions are representative of the path\nforward for Thanos. The RaaS model has been widely successful\nfor other operators as the quickest means of payout outsourcing\ntheir operations to threat actors. Insikt Group has observed that\nNosophoros titled the original post on Exploit Forum “Thanos\nRansomware Affiliate Program.” As previously mentioned, those\nwho choose to purchase or acquire a “light” build of Thanos can\nopt into the affiliate program, though qualifications of becoming\nan affiliate are unknown. Others, however, can choose to purchase\nthe full “company” version of Thanos and have the ability to start\ntheir own affiliate or RaaS operation.\n\nAt the time of publication, Insikt Group has observed that\nNosophoros has received positive endorsements from the\ncommunity, with claims that the tool “works flawlessly” and requests\nto “keep the updates coming.” Thanos is under active development\nby Nosophoros. Recorded Future assesses with high likelihood\nthat Thanos will continue to be weaponized by threat actors either\nindividually and collectively as part of the affiliate program.\n\nLastly, with the identification of Hakbit samples as belonging to the\nThanos ransomware family, it's clear that Thanos has been deployed\nconsistently over the past six months. As previously discussed,\neach new sample observed has incorporated additional features\nover time, suggesting that Nosophoros is actively developing the\nransomware, a trend that is not likely to stop soon.\n\n\n-----\n\n### Appendix A — Thanos Build Options\n\n|Appendix A|— Thanos Build Options|Col3|\n|---|---|---|\n|Option|Help||\n|Static Pass|All computers in the same network will be encrypted using the same encryption password|checkbox, text box|\n|Add Icon|Select Icon file|file picker / dropper|\n|FTP Logger|Log activity to FTP site. This could potentially link the ransomware with your FTP URL, and therefore, to you|checkbox, three text boxes|\n|Wallpaper|Change Victim Wallpaper right before showing Ransom Note|checkbox, text box|\n|Self-Delete Ransom|Self delete ransomware after encryption is done|checkbox|\n|Multi-Threading|Each hard drive is encrypted in a different thread for faster process in big environments|checkbox|\n|Random Assembly|Add Random Assembly info to ransom client. It can help fool some AV|checkbox|\n|Data Stealer|Ransomware will steal data from target and upload it to control FTP. To be used you need to activate the FTP logger feature. Uploading file may significantly slow down the encryption process.|checkbox, text box|\n|Max. Steal Size|This is the maximum file size to be uploaded|text box|\n|Rootkit|It will hide the malware process from the Task Manager, Process Explorer, and Process Hacker 32&64bit|checkbox|\n|Delayed Activation|Ransomware will remain dormant (no encryption or ransomware note shown) until this date. Delayed Activation forcefully requires Persistence so the malware can activate on the pre-configured date|checkbox, datepicker|\n|Enhanced Notification|User will be notified in both taskbar and log-on screen when encryption process is completed|checkbox|\n|Persistence - Melt|Ransomware will survive restarts and relocate itself and will not self-destroy until all files are encrypted|checkbox|\n|Wake-on-LAN|It will wake up turned-off, suspended or sleep stations on the network to be encrypted to|checkbox|\n\n\n-----\n\n|Deceiving Msg|Show deceiving error message while encrypting|checkbox|\n|---|---|---|\n|Fast Mode|It will encrypt only a segment of each file|checkbox, num picker|\n|Anti-VM|Ransomware will not run in virtual machines, sandbox, or debuggers|checkbox|\n|LAN|Ransomware will attempt to spread itself to other computers in the same LAN|checkbox|\n|UAC|Ransomware will request elevation and it will encrypt more files. It can not persist or melt though|checkbox|\n|Kill Defender|Ransomware will permanently disable Windows Defender (Requires Admin Privileges)|checkbox|\n|RIPlace|Use RIPlace technology to erase files protected by anti-ransomware defenses|checkbox|\n|Unlock Files|Ransomware will attempt to release locked files before encryption (it will take more time but encrypt more files (Requires Admin)|checkbox|\n|Change Extension|Choose extension to add to encrypted files. If unchecked files will retain their original extension|checkbox, text box|\n|Client Expiration|Ransomware client will stop working after a set and date; very useful to limit the use of the clients by affiliates|checkbox, date picker|\n|AMSI Bypass|Ransomware will bypass Windows AMSI antimalware technology|checkbox|\n|Disable FAC|Disable Microsoft’s Folder Access Control|checkbox|\n|Prevent Sleep|Prevent computer from sleeping|checkbox|\n|Protect Process|If Ransomware is killed from memory system will crash|checkbox|\n|Alternate Algo|Uses an alternate scan algorithm in case that your client catches only a few files|checkbox|\n|Anti-AVG/ MWB|Ransomware will disable AVG and MalwareBytes antivirus. Results may vary depending on version and operative system|checkbox|\n|Max. File Size|Maximum File Size that will be encrypted|checkbox, num picker|\n\n\n-----\n\n|Built-In Crypter|Process final file with a crypter engine to reduce antivirus detection|checkbox|\n|---|---|---|\n|Immortal Process|Process can not be killed by process explorer and other similar utilities|checkbox|\n|Delay|Add delay before running to fool some AV|checkbox, num picker|\n|Drag and Drop|It will allow a client to accept the drag and drop of individual directories for fast encrypting important data. In this mode only fully encryption and extension with static password is permitted, so make sure your client is erased once encryption is complete and also save the static password stored in the Ransomware Log|checkbox|\n|Compile For|Compile your ransomware client for your target architecture is best in terms of effectivity when dealing with antivirus software and also for compatibility reasons|radial choices (anycpu, x86, x64)|\n|Ransom Information|Ransom note|large text box|\n|Validate Bitcoin Address|None|checkbox|\n|Bitcoin Address|None|text box|\n|Ransom Note File Name|None|text box|\n|Directories to Encrypt|List of directories to encrypt|choice list|\n|Encrypt Special Folders|Special folders to encrypt|choice list (“[Desktop]”, “[Documents]”, “[Pictures]”, “[Downloads]”)|\n|Extensions to Process|||\n\n\n-----\n\n### Appendix B —\n Process and Service Stop and Deleted Files\n\n**May be Run as These Filenames**\n\ncrcss.exe\n\nchrome32.exe\n\nfirefox.exe\n\ncalc.exe\n\nmysqld.exe\n\ndllhst.exe\n\nopera32.exe\n\nmemop.exe\n\nspoolcv.exe\n\nctfmom.exe\n\nSkypeApp.exe\n\n**Net Commands to Stop AntiVirus**\n\n**and Backup Services**\n\nstop avpsus /y\n\nstop McAfeeDLPAgentService /y\n\nstop mfewc /\n\nstop BMR Boot Service /y\n\nstop NetBackup BMR MTFTP Service /y\n\n**Service Control Commands**\n\nconfig SQLTELEMETRY start= disabled\n\nconfig SQLTELEMETRY$ECWDB2 start= disabled\n\nconfig SQLWriter start= disabled\n\nconfig SstpSvc start= disabled\n\n**Task Kill Commands**\n\n/IM mspub.exe /F\n\n/IM mydesktopqos.exe /F\n\n/IM mydesktopservice.exe /F\n\n\n-----\n\n-----\n\n### Appendix C — Encrypted File Extensions\n\n|dat|sxw|pas|sqlitedb|xdw|\n|---|---|---|---|---|\n|txt|odt|asm|accdb|ods|\n|jpeg|hwp|key|java|wav|\n|gif|tar|pfx|class|mp3|\n|jpg|bz2|pem|mpeg|aiff|\n|png|mkv|p12|djvu|flac|\n|php|eml|csr|tiff|m4a|\n|cs|msg|gpg|backup|csv|\n|cpp|ost|aes|pdf|sql|\n|rar|pst|vsd|cert|ora|\n|zip|edb|odg|docm|mdf|\n|html|sql|raw|xlsm|ldf|\n|htm|accdb|nef|dwg|ndf|\n|xlsx|mdb|svg|bak|dtsx|\n|avi|dbf|psd|qbw|rdl|\n|mp4|odb|vmx|nd|dim|\n|ppt|myd|vmdk|tlg|mrimg|\n|doc|php|vdi|lgb|qbb|\n|docx|java|lay6|pptx|rtf|\n|sxi|cpp|sqlite3|mov||\n\n\n-----\n\n### Appendix D — Wake on LAN Magic Packet\n\n\n-----\n\n### Appendix E — Thanos-Related Hashes\n\n**Initial YARA Rule Matches (SHA256)**\n\n- 7a7a5110cb9a8ee361c9c65f06293667451e5200d21db72954002e5725971950\n\n- 5b5802805784b265c40c8af163b465f1430c732c60dd1fbec80da95378ae45b7\n\n- 7e6db426de4677efbf2610740b737da03c68a7c6295aca1a377d1df4d35959e5\n\n- d1b634201a6158a90f718a082c0fe0ee1769ff4b613dd9756a34318fa61eea47\n\n- e63aeb1aa61c38a5bed126b41ca587a892de0311730b892aee77541a761e1a02\n\n- 940df3b1cf603388cf9739cc208c1a88adfe39d2afe51e24a51878adca2be4e3\n\n- a1bab429b3b18fdb8e4fec493bd53e89c0f87147d902ff41a0f6dcd61c159553\n\n- e67fa8978e6c22f4d54604a54c3ac54e631128eed819d37355c2ad80e74507a5\n\n- b99e0b750b3815fec3b292ede3f94524c8bede7d158334295e096518e9cde0ad\n\n- 989a9d2e08fcba4059ebc55afc049f34d2a12bfdd1e14f468ee8b5c27c9e7bda\n\n- db3ef67666e18047aa24a90bfa32ca456641209147703853413d56eb74d44673\n\n- 10dc9cb12580bc99f039b1c084ca6f136047ac4d5555ad90a7b682a2ffac4dc5\n\n- 049425dac929baf288c44c981ef63417d097fb95f5199c9f33e5ef5e2ec20590\n\n- f1388fbe51253d8f07a98eabfe0422e39821d936166cc85c92a0418854ae15fb\n\n- cea80fe543aec9c6b4a4628ec147e8a41cac766c2cd52c0ca86a19f9ef348fc3\n\n- 8a2b54d273d01f8d5f42311d5402950bb9983648a39b943c729314a97ede15a2\n\n- aae00e2532ae5093e8c0a623bffcc4c447d04e89237438c52cb473854c715724\n\n- fd8c3259b8e80b8220c6053aa9b045676d1e3fe09356ed94b5e47fb5b895ff92\n\n- 23d7693284e90b752d40f8c0c9ab22da45f7fe3219401f1209c89ac98a4d7ed3\n\n- e256a9f20479f29e229f594ef6ab91be75bff9e3f0784030ac0feb8868f4abc1\n\n- 7a38f70d923669a989ea52fa1c356c5ac7ccce4067a37782973466102e3d27f6\n\n- 53806ba5c9b23a43ddbfa669798d46e715b55a5d88d3328c5af15ba7f26fbadd\n\n- 871eef727aaad88b734bb372f19e72ccf38034195666c35390f5c3064f5469a3\n\n- edcac243808957cc898d4a08a8b0d5eaf875f5f439a3ca0acfaf84522d140e7e\n\n\n-----\n\n**Hakbit Samples (SHA256)**\n\n- 86ed000fa2dd99f2b2341da607c904c0b510f98ead65be12b358e3f73e624cb6\n\n- c8f18fb0baf81b31daa929499b2dcaa7f297bd05ec1ecff319ae5e8b34dade00\n\n- ff1a88c2ad5df435a978c63d21a6ab0642134785284b01137e18dd235197b66d\n\n- 3ccf57e60cdf89d04f2c7e744d73e3b40a4308a2ba87d0423c96f601d737733f\n\n- f7d7111653c43476039efd370fb39fcdb2c22a3f1bb89013af643b45fb3af467\n\n- 8a2b54d273d01f8d5f42311d5402950bb9983648a39b943c729314a97ede15a2\n\n- 917905ba95c10847e0bf3bc66332ae05616a0ddd965a00ae8ec3431ed11c39d2\n\n- 5849966984f270b200fd80e086d2565a5a7d4ee0743677640f45b97b46e49082\n\n- 3f83fd42af95185e19e537708dccdf1539dcab1ce73783c2741b4c1929dcc020\n\n- 794369bc9a06041f906910309b2ce45569a03c378ff0468b6335d4f653f190ab\n\n- 9784148014987a39d87265c015962e9535ed86e861093a6c59691095a19be7c2\n\n- f0c0c989b018ee24cbd7548cec4e345fd34f491d350983fddb5ddc1ad1f4ba9f\n\n- 871eef727aaad88b734bb372f19e72ccf38034195666c35390f5c3064f5469a3\n\n- a95f9d82097bdfa2dd47e075b75d09907d5913e5c15d05c926de0d8bbce9698f\n\n- 81e81f0bbbdb831eda215033b7a7dbf2eed3812f4e58118f181a8e99e613179e\n\n- 916aeaa51050f25dbbcefc1be1820457e1d9d755a44d2d0cf62155f75c54127c\n\n- 17314793d751b66f4afc1fac1c0ab0c21f2c9f67e473e8ba235bc79d7e0ea1b0\n\n- 34b93f1989b272866f023c34a2243978565fcfd23869cacc58ce592c1c545d8e\n\n- 855dcd368dbb01539e7efa4b3fefa9b56d197db87b1ba3ede5e1f95927ea2ca3\n\n- 09fd6a13fbe723eec2fbe043115210c1538d77627b93feeb9e600639d20bb332\n\n- befc6ff8c63889b72d1f5aec5e5accc1b4098a83cd482a6bb85182ecd640b415\n\n\n-----\n\n**About Recorded Future**\n\nRecorded Future arms security teams with the only complete threat intelligence\n\nsolution powered by patented machine learning to lower risk. Our technology\n\nautomatically collects and analyzes information from an unrivaled breadth of\n\nsources and provides invaluable context in real time and packaged for human\n\nanalysis or integration with security technologies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2020-0610.pdf"
    ],
    "report_names": [
        "cta-2020-0610.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1591695891,
    "ts_modification_date": 1591695906,
    "files": {
        "pdf": "https://archive.orkl.eu/3cfb99df1240879d53b8f8f3fb56be1a279c6aa9.pdf",
        "text": "https://archive.orkl.eu/3cfb99df1240879d53b8f8f3fb56be1a279c6aa9.txt",
        "img": "https://archive.orkl.eu/3cfb99df1240879d53b8f8f3fb56be1a279c6aa9.jpg"
    }
}