{
    "id": "484e49c3-bbd5-4134-99e0-ccc08687a610",
    "created_at": "2023-01-12T15:05:22.832876Z",
    "updated_at": "2025-03-27T02:06:10.618273Z",
    "deleted_at": null,
    "sha1_hash": "50a9742bc75a58e82380d112b4cca352c0b70a7c",
    "title": "2016-04-06 - Bootkit's development overview and trend (X)",
    "authors": "",
    "file_creation_date": "2016-04-06T15:07:49Z",
    "file_modification_date": "2016-04-06T15:07:49Z",
    "file_size": 1310190,
    "plain_text": "# Bootkit's development overview and trend\n\nAVAR2012 / by nEINEI && Jason Zhou\n\n**Keywords: bootkit, MBR, DBR, VBR, NTFS, Windows Kernel**\n\n**Abstract**\n\nWindows bootkit’s development speed is rapid. It has developed from initial POC\n(Proof-of-Concept) stage to current having several stable virus families. Bootkit’s infection\nmeasures also extended to BIOS chips, disk MBR, VBR and etc. All these have brought\nchallenges for the security of system boot and kernel entrance. So how to find advantages in the\nconfrontation with bootkit is the problem we have to face in the future.\n\n**Introduction**\n\nIn 2005, the company, eEye Digital, first brought in the idea of bootkit, which stands for boot\nrootkit, in their project, ‘BootRoot’ [1]. Generally speaking, one rootkit which is loaded earlier\nthan Windows kernel could be considered as a bootkit. So in this paper, all the mentioned\nBootkit viruses use this definition.\n\nAfter Phanta, also known as _GhostShadow, first generation bootkit appeared in China in_\nMarch 2010, Chinese bootkits entered a period of development. So far we already found 5 kinds\nof relative Phanta variations. Their infection measures, code obfuscation tricks and\nself-protection approaches have big improvements. As with the development of global bootkit\nviruses, such as TDSS and Rovnix bootkit families, the trend of bootkit learning from each\nother becomes more obvious. So in this paper, we will first review the development status of\nbootkits all over the word from 2010. Then we will have a targeted introduction of Chinese\nbootkits.\n\n**1. Technical overview of bootkits for last three year**\n\n**1.1 Bootkits in 2010**\n\n**1.1.1 Phanta 1 As we mentioned above, Phanta 1 should be considered as the first bootkit virus**\nin China. After system is infected by Phanta 1, the malicious MBR copies virus data to the end\nof real-mode memory and hooks int 13h interruption. Then copies the original MBR code to the\naddress 0x7c00 then passes the control to it.\n\nWhen the boot code reads the file _ntldr by invoking int 13h interruption, Phanta 1 gets the_\ncontrol. It searches for the signature, 0x74f685f0 and 0x3d80, in the function\n_BILoadBootDrivers of_ _ntldr. If the signature is found, Phanta 1 hooks the next line of code_\nbelow the signature.\n\n\n-----\n\nFig.1 Phanta 1 hooks ntldr\n\nWhen function off_97400 is called, Phanta 1 gets the image base of ntoskrnl and parses its\nPE structure to find the section with the parameter 0x20000000. After the section is found,\nPhanta 1 copies its 4 sectors’ virus codes to that area. Then Phanta 1 parses the Export Table to\naddress the function PsCreateSystemProcess to hook the function PspCreateProcess.\n\nFig.2 hook PsCreateProcess\n\nAfter a new process is being created, Phanta 1 gets the control again. It checks the PID of\ncreated process. If the PID equals 4, meaning the process is system.exe, Phanta 1 then loads its\nvirus driver.\n\nOn the whole, Phanta 1 is an imitation of Mebroot, specifically in the malicious MBR code,\nthe way to patch ntldr and load virus driver. For example, Phanta 1 uses the same signature as\n_Mebroot to search for the address to patch ntldr. (0x74f68f50 and 0x3d80 are the signatures)_\n\n\n-----\n\nFig.3 Mebroot’s MBR code\n\nFig. 4 Phanta 1’s MBR code\n\nIn code layout aspect, Phanta 1 also imitates Mebroot’s structure.\n\n\n-----\n\nFig. 5 contrast between the code layouts of Mebroot and Phanta 1.\n\nLike Mebroot, Phanta 1 only infects 32-bit Windows XP.\n\n**1.1.2 TDL-4 Also known as Alureon and Olmarik, TDL-4 is the 4[th] generation of TDSS bootkit**\nfamily. Compared with earlier versions, TDL-4 has big improvements and indeed brings an\nevolution in bootkit development process.\n\nTDL-4 firstly came into our eyes in August, 2010. Then it has been consistently in the wild\nuntil the end of year 2011. But the main functions keep almost the same except the payload.\n\nAs with previous versions, TDL-4 makes use of a configuration file, _cfg.ini, to handle the_\ncommunications between user mode and kernel mode. Below is the cfg.ini we found at the very\nbeginning when TDL-4 was found.\n\nFig. 6 TDL-4 Found in August 2010\n\nTDL-4 takes advantage of a lot of first seen techniques. It’s the first rootkit virus compatible\nwith all versions of Windows, including 64-bit Windows 7. Below is the TDL-4’s boot\nprocess.\n\n\n-----\n\nFig. 7 TDL-4 boot process\n\nIn order to bypass _PatchGuard in 64-bit systems and avoid being debugged, TDL-4’s_\nreal-mode loader module, ldr16, hijacks kdcom.dll with ldr32 or ldr64, depending on Windows\nplatform. After ldr32/64 is loaded and the exported function, KdDebuggerInitialize1, is called,\nan image notification routine is set by calling _PsSetLoadImageNotifyRoutine. In this routine,_\nTDL-4 uses an undocumented function, IoCreateDriver, to create a driver object. In this driver\nobject’s _DriverEntry function, a PnP notification routine is registered by calling_\n_IoRegisterPlugPlayNotification. When this PnP notification routine is invoked, TDL-4 searches_\nits own file system for its main rootkit driver module, drv32/64 and then load them.\n\nFig. 8 set an image notification routine\n\nFig. 9 a driver object is created in the routine\n\nTDL-4’s self-protection approaches are complicated, including adding system callbacks,\n\n\n-----\n\nhijacking Dr0, hooking DriverStartIo routine of Atapi driver, using kernel work item thread to\nprotect hooked functions. This makes it difficult to clean TDL-4 completely.\n\n**1.2 Bootkits in 2011**\n\n2011 is the year of concentrated outbreak of bootkits. There are several important bootkit\nfamilies coming out, including ZeroAccess, Phanta and TDSS.\n\n**1.2.1 Phanta 2 Phanta 2 first appeared in March 2011. Compared with Phanta 1, Phanta 2 has**\nbelow major changes:\n\n1. Malicious MBR code is obfuscated so that it becomes more difficult to analyze\nstatically.\n\n2. Virus data written to disk’s first 6 sectors is encrypted.\n3. Directly overwrite %systemroot%system32/drivers/fips.sys instead of hooking\n_PspCreateProcess to load virus driver._\n\n**1.2.2 Phanta 3 Phanta 3 appeared in May, 2011. Compared with Phanta 2, Phanta 3 pays**\nattention to protect the malicious MBR. It learns from TDL-4’s framework. But it implements\nthese functions in a simplified way.\n\n1. Phanta 3 encrypts and stores original MBR and the code of patching ntldr at the end of\ndisk. It stores nothing in the first 64 sectors of the disk any more.\n\n2. It hooks _DriverStartIo dispatch function of the driver Atapi or SCSI to protect_\nmalicious MBR instead of hooking reading and writing dispatch function of _disk.sys which_\n_Mebroot used._\n\n3. It replaces beep.sys with malicious driver, hello_tt.sys.\n\nFig. 10 replace beep.sys\n\n**1.2.3 TDL-4 version 0.31. We captured TDL-4’s upgraded variations in August 2011. Its main**\nmodule’s version is 0.03. And the payload’s version is 0.31. Still, compared with earlier\nvariations, nothing big changed except payload.\n\n\n-----\n\nFig. 11 TDL-4 variation found in May 2011\n\nFig. 12 TDL-4 variation found in September 2011\n\nFig. 13 image notification routine is changed into thread notification routine.\n\n**1.2.4 ZeroAccess ZeroAccess, also known as Max++, firstly came into our eyes in August 2011.**\nTill now while this paper is being written, we could still hear ZeroAccess’s traces in the wild.\n\nZeroAccess is different from other bootkits mentioned in this paper because it doesn’t\n\n\n-----\n\nmodify system’s bootstrap code. ZeroAccess’s dropper chooses a random driver between\n_classpnp.sys and win32k.sys to infect in overwriting way. Then use_ _ZwLoadDriver to load the_\ndriver. This driver is obfuscated and packed. This is quite rare among the virus drivers we’ve\never seen as packing in kernel mode might cause unpredictable issues. The original virus driver\nis stored in the packed driver’s body. After decompressed into the memory, we could see the\noriginal driver’s file image.\n\nFig. 14 decompress original driver’s body\n\nAfter maping the file image into memory, the packed driver will search the PE structure to\nfind the entry point of the original driver.\n\n\n-----\n\nFig. 15 memory relocation\n\nFig.16 get the entry point\n\nAfter entering the original virus driver’s code space, ZeroAccess creates a device object to\nstore its virus components and communicate with user mode.\n\nFig.17 create the device object (22h stands for FILE_DEVICE_UNKNOWN)\n\nThen it creates an IRP hooking driver to hijack disk.sys.\n\nFig. 18 create IRP hooking driver\n\n\n-----\n\nFig.19 hook disk.sys\n\nBesides these, ZeroAccess also creates other system threads, APC calls and timers. All these\ntogether make it difficult to remove ZeroAccess completely.\n\n**1.2.5 TDL-MaxSS TDL-MaxSS came out in November 2011. It’s considered as the upgraded**\nversion of TDL-4. Compared with TDL-4, MaxSS improves the way to infect MBR. It no\nlonger overwrites original MBR directly. Instead, it modifies DPT (Disk Partition Table) and\npoints it to virus code. In other words, MaxSS forges a new boot partition.\n\nFig. 20 contrast between normal DPT and MaxSS infected DPT\n\nThis is a creation in bootkit development process. As a result, security tools could not only\nuse simple signature matching to check for MBR infection.\n\n**1.2.6 Phanta 4 Phanta 4 is also known as Bioskit or Win32/Wapomi.e. Before 2011, Bioskit yet**\nremained in the conceptual stage. Although some researchers provided ways to attack BIOS in\nBlackhat 07 [2] and CanSecWest 09 [3], there are difficulties in actual operation. In September\n2011, a bioskit virus which targeted Award BIOS appeared in China. That’s Phanta 4.\n\n\n-----\n\nFor Award BIOS computers, Phanta 4 infects BIOS by inserting a malicious ISA module. For\nnon-Award BIOS ones, Phanta 4 modifies MBR in common bootkit way.\n\nFirst, Phanta 4 makes use of cbrom.exe to insert the malicious ISA module, hook.rom, into\nAward BIOS.\n\nFig. 21 use cbrom.exe to insert hook.rom\n\nSecond, Phanta 4 replaces beep.sys with its virus driver to check BIOS type, backup original\nBIOS and flash BIOS.\n\nFig. 22 virus driver’s device control dispatch routine\n\nWhen the compromised system restarts, malicious hook.rom runs before MBR. It first checks\n\n\n-----\n\nwhether MBR is infected.\n\nFig. 23 check MBR infection\n\nIf the MBR is not infected, hook.rom infects it. The malicious MBR code loads DBR (DOS\nBoot Record) to the address 0x7c00 and checks the file system format of disk’s boot partition.\nThen parse the boot partition to search for _winlogon.exe or_ _wininit.exe. Afterwards, patch_\n_winlogon.exe/wininit.exe and print ‘Find it OK!’_\n\n\n-----\n\nFig. 24 print ‘Find it ok!’\n\n**1.3 Bootkits in 2012**\n\n**1.3.1 Rovnix.** Earlier Rovnix variations looked like a fully upgraded version of TDL-4. Its\ninside modules are designed separately to infect 32-bit and 64-bit Windows.\n\nRovnix infectes VBR(Volume Boot Record). In malicious VBR code, Rovnix hooks int 13h\ninterruption function to patch ntldr or bootmgr. After patching, it injects malicious codes into\n_ntoskrnl.exe’s memory to load virus driver._\n\n\n-----\n\nFig. 25 patch ntldr/bootmgr\n\nRovnix’s boot loader is highly obfuscated. Its code is divided into many small blocks. Each\nsnippet is connected with others with _jmp or a meaningless_ _call function. And Rovnix’s each_\nvariation’s boot loader is different from others. This makes it difficult to analyze and detect.\n\nFig. 26 Rovnix’s boot loader code snippet\n\n\n-----\n\nFig. 27 Rovnix’s boot loader real working flow\n\n**1.3.2 Plite** Plite is a special bootkit family. After infecting MBR, Plite parses FAT/NTFS file\nsystem to locate and overwrite _explorer.exe. This is nothing new as Phanta 4 behaves in the_\nsame way. Why Plite is special is because its modules are developed in several different\nlanguages. Its dropper is written in C#. The dropped file is developed in Delphi. And the boot\nloader module is compiled with Microsoft FORTRAN compiler.\n\nWe could see some debugging information in boot loader.\n\nFig. 28 boot loader code snippet\n\n\n-----\n\nFig. 29 boot loader compilation information\n\n**1.3.3 Phanta 5 (Phanta’s latest version, also known as** _Win32/Wapomi.f) In July 2012,_\nseveral new variations of Phanta family quickly came out in China. Phanta 5 encrypts and stores\nits malicious modules in its resource section. Below we could see the differences between two\nvariations we captured in July 2012.\n\nFig. 30 Phanta 5 module differences\n\nCompared with earlier versions, Phanta 5 has below major improvements:\n1. Dropper injects explorer.exe process to drop a random driver file, x_random.sys. Then\nhijacks below services to load virus driver.\n\nFig. 31 hijacked service list\n\n2. Driver x_random.sys hooks _DriverStartIO dispatch routine of Atapi/SCSI driver to_\nprotect MBR.\n\n\n-----\n\n3. MBR loads another driver to hook reading and writing dispatch routines of disk.sys in\norder to protect MBR doubly.\n\n4. X_random.sys hooks SSDT functions to stop AV services.\n\nFig. 31 kill AV services\n\n5. Phanta 5 stores original MBR, boot loader, fake sfc_os.dll and x_random.sys at the end\nof disk partition, without encryption.\n\nBelow is Phanta 5’s boot process.\n\nFig. 32 Phanta 5 boot process\n\n\n-----\n\n**2. Bootkit in China**\n\nChinese bootkit has developed for some time. Early in May 2007, the Chinese developer,\n_icelord, released a tool, named ICLord Bioskit [4], which could infect Award main board. In_\nNovember 2008, the developer, _inghu, published a bootkit idea to patch_ _ntldr. The Chinese_\nresearcher, mj0011, published bootkit tophet[5] in Xcon2008. But all these are only technology\nresearches. Bootkit viruses didn’t spread widely until March 2010. And afterwards, Chinese\nbootkit entered a period of development. So below sections will describe the characteristics of\nbootkit viruses in China.\n\n**2.1 Anti-static-detection for MBR** In order to prevent detecting malicious MBR, bootkit\nviruses are always looking for new methods. Phanta 1 has tiny improvements. It no longer\noperates BIOS’s data at address 0x413 directly. Instead, it substitutes the equivalent instructions\nto achieve the same goal.\n\nFig. 33 0x413 substitution\n\nPhanta 2 and Phanta 3 insert junk codes to interfere analysis. Also their malicious MBR and\nvirus data are encrypted.\n\nFig. 32 junk code in Phanta 2/3 MBR\n\nPhanta 5 doesn’t hook int 13h interruption as other bootkits do. Instead, it repeatedly calls a\nfunction cs:dword_2580.\n\n\n-----\n\nFig. 33 Phanta 5 calls cs:dword_2580 repeatedly\n\nBut the beginning of the function cs:dword_2580 is incorrect.\n\nFig. 34 begginging of cs:dword_2580\n\nThe truth is while running, Phanta 5 overwrites the first 8 bytes of _cs:dword_2580 with_\n0xe3fe and 0xf000 which stand for int 13h interruption function’s original address in BIOS.\n\nFig. 35 cs:dword_2580 while running\n\n**2.2 Virus data storage Both Phanta 1 and Phanta 2 store their virus data in the first 63 sectors**\nof disk. The only difference is that Phanta 2 encrypts the data before writing.\n\nPhanta 3 stores its virus data at the end of disk with encryption.\nPhanta 5 also puts its virus modules at end of disk but without encryption.\n\n\n-----\n\nWe could see that Chinese bootkit virus authors’ data protection consciousness is not that\nstrong. They prefer to protect their ‘babies’ by driver rather than designing custom file system as\nTDL-4 does.\n\n**2.3 Self-protection** Phanta 1 installs several filter callback functions by calling\n_PsLoadImageNotifyRoutine,_ _PsCreateProcessNotifyRoutine and_ _PsCreateThreadNotifyRoutine._\nThen enumerate processes to kill AV.\n\nPhanta 2 also kills AV. It hooks PsLoadImageNotifyRoutine. When a kernel module is being\nloaded, Phanta 2 checks the module’s digital signature whether the module is an AV module. If\nyes, Phanta 2 patches the module’s entry point and make it return failure.\n\nPhanta 3 protects MBR by hooking DriverStartIo dispatch routine of Atapi/SCSI driver.\n\nFig. 36 Phanta 3 hooks DriverStartIo\n\nPhanta 4 uses malicious BIOS rom to protect MBR.\nPhanta 5 prevents AV driver from loading. (Fig. 31) And it protects MBR doubly.\n\nFig. 37 double protection for MBR\n\n\n-----\n\n**2.4 Interesting findings From above aspects, we can see that Chinese bootkits virus authors are**\nmaking efforts to do better. They learnt from other bootkits and improved their own.\n\nDuring analysis for Phanta 4, we found that Phanta 4 drew ICLord’s way to infect BIOS.\n\nFig. 38 contrast between ICLord and Phanta 4.\n\nOne thing similar happened in Phanta 5. We found earlier Phanta 5’s code to parse\nFAT/NTFS file system is very similar to Stoned Bootkit’s open source.[6]\n\nFig. 39 contrast between Phanta 5 and Stoned Bootkit\n\nBut soon, we found newer Phanta 5 removed this code block. Instead, it uses another way to\nparse file system. We’re not sure whether it’s original. But it’s better indeed.\n\n\n-----\n\nFig. 40 new code snippet to parse file system in Phanta 5\n\n**3 Windows bootkit attack trend forecast**\n\nIn recent years, bootkit had continuous improvements on means of attack. The improvements\nspecifically embody in below aspects:\n**3.1 Hardware level infection** Starting from eEye’s BootRoot project, BIOS infection is not\ngenerated as a concept. Afterwards, more researches were stimulated in this direction. _Peter_\n_Kleissner demonstrated using bootkit to bypass Windows 8’s UAC in MalCon Assembly in_\nNovember 2011. Although the targeted Windows 8 system is booted based on BIOS, this\nindicates that traditional bootkit threat won’t die before we enter the UEFI era.\n\nOn the other hand, researchers and hackers have never stopped the discussion on UEFI\nsecurity. In 2012, we saw several technological breakthroughs, such as Loukas’s EFI Rootkit for\nMac in Black Hat USA 2012, Jonathan Brossard’s UEFI rootkit, Rakshasa. These provide the\nbasis of underlying technology for the development of bootkit. When the time comes, they will\nbe transformed into the reality of attacks.\n\n**3.2 Obfuscation in 16-bit boot loader** In order to escape static detection, bootkits began to\nobfuscate their boot loaders, such as encryption, inserting junk code, etc. Rovnix.b’s boot loader\nis polymorphic.\n\n\n-----\n\nFig. 41 Rovnix.b’s boot loader code\n\nTake a look at function _run_obs_code. You could see the inside_ _push and_ _pop instructions_\ndon’t match. The number of push is one more than pop. So when ret is executed, the flow will\nnot go to the next instruction after run_obs_code. We got troubles while debugging before we\nwere aware of this traps.\n\nPhanta 5 seems to draw this experience. Although Phanta 5’s boot loader code is not\npolymorphic, the confusing jmp instructions indeed make analysis more difficult.\n\n**3.3 Protection of virus data In order to strengthen protection of virus data, TDL-4 designed its**\nown file system. Except malicious MBR, all the other modules of TDL-4 are stored in its\ncustom file system.\n\nFig. 42 TDL-4’s file system\n\nAfter wards, we could see the similar way is widely used in newly coming bootkit viruses.\nBootkit could make this even more complicated, because this only depends on the strength of\nencryption algorithm and the complexity of the file structure. Theoretically, any kernel module\ncould be put into this file system. It’s up to bootkit to decide when and which to load. If so, this\n\n\n-----\n\nwill be the worst thing.\n\n**4 Problems of prevention and detection**\n\nThe biggest difference between bootkit virus and other types of virus is that bootkit virus\nobtains control earlier than Windows. Thus, it could make any change to the system at the same\ntime hiding itself. Once a bootkit is installed successfully, the subsequent cleanup work will be\nvery complicated.\n\nThe prevention of bootkit includes protecting disk’s reading and writing, monitoring driver\nloading. Most AVs already paid attention to these aspects. But bootkit authors are keeping\ndigging the weakness and missing corners of security tools. This also becomes one of the\ndefense problems.\n\n**4.1 Dangerous API Current HIPS systems are based on the trust mechanism of process chain,**\nmeaning that if a process is to be trusted, any operation of this process is trusted, including\ncreating a new child process. TDL-4 uses AddPrintProvidor to load its virus driver because the\nprinter process spoolsv.exe is trusted.\n\nAlso in Phanta 5, we saw the use of ‘vulnerability’ of functions LoadKeyboardLayoutA and\n_ZwQueryValueKey._ When we call _PostMessage_ to post a\nWM_INPUTLANGCHANGEREQUEST message to _explorer’s window,_ _explorer will load a_\nnew keyboard layout. Phanta 5 hooks ZwQueryValueKey to modify the IME file which explorer\nis to load. Thus, explorer loads a virus module. As _explorer.exe is a trusted process, Phanta 5_\ncould do anything in explorer’s memory, including loading virus driver.\n\nThese three functions have one thing in common. Although they’re only called in their own\nprocesses, they affect the whole system. We name them ‘dangerous API’. Finding the\nvulnerabilities of dangerous APIs is the easiest way to bypass HIPS.\n\n**4.2 Alternative penetration of disk Protection of disk’s boot section has already attracted the**\nattention of many security tools. HIPS tools also monitor disk’s reading and writing operations\nby checking the access to path \\\\.\\PhysicalDrive0 or \\DEVICE\\HARDDISK\\DR0.\n\nBut recently we found a new way to bypass such protection. First you send a\nSCSI_PASS_THROUGH instruction to the disk, which is a standard SCSI instruction. When\ncurrent physical disk’s corresponding bus device symbol link is found, you need to fill in the\nSCSI_PASS_THROUGH structure and send a _DeviceIoControl code, 0x4D014, which stands_\nfor METHOD_BUFFERED, to disk driver. Then you could bypass above disk protection\napproaches and modify the disk.\n\n\n-----\n\nFig. 43 bypass disk protection\n\nDuring our tests, most HIPS tools could not prevent such attack.\n\n**4.3 Once again-What’s bootkit? Above we described several complicated bootkit families. We**\nmentioned their development and their differences. We also predict their development trend.\nNow we want to raise the question again. How to define a bootkit’s technical characteristic?\n\nWe believe that a bootkit overall consists of three stages.\n\nFig. 44 Bootkit composition\n\n_Boot stage’s purpose is to obtain control before system startups. It might lie in UEFI, BIOS,_\nMBR, VBR, Bootstrap code, ntldr, bootmgr, and etc.\n\n_Patch kernel code stage is mainly to bypass system protection and load virus driver._\nSearching where to patch is just like looking for _Zero Day vulnerabilities in system kernel._\nAlthough we saw several different kinds of bootkit family, their boot process have many\nsimilarities. Bootkit authors do not want to spend their time on digging where to patch, as long\nas one stable patching way is enough.\n\n_Load driver stage is easy to understand. Once the kernel is patched, bootkit could load its_\nvirus driver in kernel. Thus virus driver is loaded earlier than other drivers.\n\n\n-----\n\n**Summary**\n\nWe believe bootkit threat will still continue to persist and evolve. Meanwhile, as the cost of\ndeveloping a stable bootkit virus family is much higher than other types of virus, we guess there\nwon’t be many new bootkit families coming out. And we believe Secure Boot or UEFI would\nrelieve bootkit attack. Currently, our terminal defense system has inherent weakness. Client’s\nAV products could not protect both software and hardware. Even the cleanup work for bootkit\ncould not be put into AV’s engine. So we advise to back up the core data in system boot phase\nplus defense in application layer.\n\n**References**\n\n[1] Derek Soeder, Ryan Permeh: eEye BootRoot on\n\n[http://www.blackhat.com/presentations/bh-usa-05/bh-us-05-soeder.pdf (Blackhat 2005)](http://www.blackhat.com/presentations/bh-usa-05/bh-us-05-soeder.pdf)\n\n[2] John Heasman: Hacking firmware on\n\n[https://www.blackhat.com/presentations/bh-usa-07/Heasman/Presentation/bh-usa-07-hea](https://www.blackhat.com/presentations/bh-usa-07/Heasman/Presentation/bh-usa-07-heasman.pdf)\n[sman.pdf](https://www.blackhat.com/presentations/bh-usa-07/Heasman/Presentation/bh-usa-07-heasman.pdf) (Blackhat 2007)\n\n[3] Anibal L. Sacco, Alfredo A. Ortega: Persistent BIOS Infection on\n\n[http://www.coresecurity.com/files/attachments/Persistent_BIOS_Infection_CanSecWest](http://www.coresecurity.com/files/attachments/Persistent_BIOS_Infection_CanSecWest09.pdf)\n09.pdf (CanSecWest09)\n\n[4] IceLord, BIOS RootKit: Welcome Home, My Lord! On\n\n[http://www.xfocus.net/articles/200705/918.html](http://www.xfocus.net/articles/200705/918.html) (Xfocus 2007)\n\n[5] [MJ0011: Advanced Bootkit-Tophet on http://xcon.xfocus.org/XCon2008/index.html](http://xcon.xfocus.org/XCon2008/index.html)\n\n(XCon 2008)\n\n[6] Peter Kleissner: Stoned Bootkit on\n\n[http://www.blackhat.com/presentations/bh-usa-09/KLEISSNER/BHUSA09-Kleissner-St](http://www.blackhat.com/presentations/bh-usa-09/KLEISSNER/BHUSA09-Kleissner-StonedBootkit-PAPER.pdf)\n[onedBootkit-PAPER.pdf (Blackhat 2009)](http://www.blackhat.com/presentations/bh-usa-09/KLEISSNER/BHUSA09-Kleissner-StonedBootkit-PAPER.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-04-06 - Bootkit's development overview and trend (X).pdf"
    ],
    "report_names": [
        "2016-04-06 - Bootkit's development overview and trend (X).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535922,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1459955269,
    "ts_modification_date": 1459955269,
    "files": {
        "pdf": "https://archive.orkl.eu/50a9742bc75a58e82380d112b4cca352c0b70a7c.pdf",
        "text": "https://archive.orkl.eu/50a9742bc75a58e82380d112b4cca352c0b70a7c.txt",
        "img": "https://archive.orkl.eu/50a9742bc75a58e82380d112b4cca352c0b70a7c.jpg"
    }
}