{
    "id": "488f0e46-994e-417f-a763-fd2843e2ff4b",
    "created_at": "2023-01-12T15:05:49.831434Z",
    "updated_at": "2025-03-27T02:06:00.443403Z",
    "deleted_at": null,
    "sha1_hash": "c08615c9e0775466b3ab3ace4a4fac69b36d92b0",
    "title": "2020-10-30 - Alert (AA20-304A)- Iranian Advanced Persistent Threat Actor Identified Obtaining Voter Registration Data",
    "authors": "",
    "file_creation_date": "2022-05-29T01:05:49Z",
    "file_modification_date": "2022-05-29T01:05:49Z",
    "file_size": 248739,
    "plain_text": "# Iranian Advanced Persistent Threat Actor Identified Obtaining Voter Registration Data\n\n**us-cert.cisa.gov/ncas/alerts/aa20-304a**\n\n### Summary\n\n_This advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) version 8 framework. See the_ _ATT&CK_\n_for Enterprise version 8 for all referenced threat actor techniques._\n\nThis joint cybersecurity advisory was coauthored by the Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of\nInvestigation (FBI). CISA and the FBI are aware of an Iranian advanced persistent threat (APT) actor targeting U.S. state websites—to include\nelection websites. CISA and the FBI assess this actor is responsible for the mass dissemination of voter intimidation emails to U.S. citizens\n[and the dissemination of U.S. election-related disinformation in mid-October 2020. 1 (Reference FBI FLASH message ME-000138-TT,](https://www.ic3.gov/Media/News/2020/201030.pdf)\ndisseminated October 29, 2020). Further evaluation by CISA and the FBI has identified the targeting of U.S. state election websites was an\nintentional effort to influence and interfere with the 2020 U.S. presidential election.\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/2020-10/AA20-304A-Iranian_Advanced_Persistent_Threat_Actor_Identified_Obtaining_Voter_Registration_Data.pdf)\n\n1This disinformation (hereinafter, “the propaganda video”) was in the form of a video purporting to misattribute the activity to a U.S.\ndomestic actor and implies that individuals could cast fraudulent ballots, even from overseas.\nhttps://www.odni.gov/index.php/newsroom/press-releases/item/2162-dni-john-ratcliffe-s-remarks-at-press-conference-on-electionsecurity.\n\n### Technical Details\n\nAnalysis by CISA and the FBI indicates this actor scanned state websites, to include state election websites, between September 20 and\nSeptember 28, 2020, with the Acunetix vulnerability scanner (Active Scanning: Vulnerability Scanning [[T1595.002]). Acunetix is a widely used](https://attack.mitre.org/versions/v8/techniques/T1595/002/)\nand legitimate web scanner, which has been used by threat actors for nefarious purposes. Organizations that do not regularly use Acunetix\nshould monitor their logs for any activity from the program that originates from IP addresses provided in this advisory and consider it malicious\nreconnaissance behavior.\n\nAdditionally, CISA and the FBI observed this actor attempting to exploit websites to obtain copies of voter registration data between September\n29 and October 17, 2020 (Exploit Public-Facing Application [[T1190]). This includes attempted exploitation of known vulnerabilities, directory](https://attack.mitre.org/versions/v8/techniques/T1190/)\ntraversal, Structured Query Language (SQL) injection, web shell uploads, and leveraging unique flaws in websites.\n\nCISA and the FBI can confirm that the actor successfully obtained voter registration data in at least one state. The access of voter registration\ndata appeared to involve the abuse of website misconfigurations and a scripted process using the cURL tool to iterate through voter records. A\nreview of the records that were copied and obtained reveals the information was used in the propaganda video.\n\nCISA and FBI analysis of identified activity against state websites, including state election websites, referenced in this product cannot all be\nfully attributed to this Iranian APT actor. FBI analysis of the Iranian APT actor’s activity has identified targeting of U.S. elections’ infrastructure\n(Compromise Infrastructure [[T1584]) within a similar timeframe, use of IP addresses and IP ranges—including numerous virtual private](https://attack.mitre.org/versions/v8/techniques/T1584/)\nnetwork (VPN) service exit nodes—which correlate to this Iran APT actor (Gather Victim Host Information [[T1592)]), and other investigative](https://attack.mitre.org/versions/v8/techniques/T1592/)\ninformation.\n\n## Reconnaissance\n\nThe FBI has information indicating this Iran-based actor attempted to access PDF documents from state voter sites using advanced opensource queries (Search Open Websites and Domains [[T1593]). The actor demonstrated interest in PDFs hosted on URLs with the words “vote”](https://attack.mitre.org/versions/v8/techniques/T1593)\nor “voter” and “registration.” The FBI identified queries of URLs for election-related sites.\n\nThe FBI also has information indicating the actor researched the following information in a suspected attempt to further their efforts to survey\nand exploit state election websites.\n\nYOURLS exploit\nBypassing ModSecurity Web Application Firewall\nDetecting Web Application Firewalls\nSQLmap tool\n\n### Acunetix Scanning\n\nCISA’s analysis identified the scanning of multiple entities by the Acunetix Web Vulnerability scanning platform between September 20 and\nSeptember 28, 2020 (Active Scanning: Vulnerability Scanning [[T1595.002]).](https://attack.mitre.org/versions/v8/techniques/T1595/002/)\n\nThe actor used the scanner to attempt SQL injection into various fields in `/registration/registration/details with status codes 404 or`\n500.\n\n\n-----\n\n```\n  g g y ( )\n&addressstreet1=xxxxx&btnbeginregistration=begin voter\nregistration&btnnextelectionworkerinfo=next&btnnextpersonalinfo=next&btnnextresdetails=next&btnnextvoterinformation=next\nxxx-xxxx&phoneno2=xxx-xxxxxxx&radio=consent&statecancelcity=xxxxxxx&statecancelcountry=usa&statecancelstate=XXaa&statecancelzip=xxxxx&statecancel\n\n### Requests\n\n```\nThe actor used the following requests associated with this scanning activity.\n```\n2020-09-26 13:12:56 x.x.x.x GET /x/x v[$acunetix]=1 443 - x.x.x.x Mozilla/5.0+\n(Windows+NT+6.1;+WOW64)+AppleWebKit/537.21+(KHTML,+like+Gecko)+Chrome/41.0.2228.0+Safari/537.21 - 200 0 0 0\n2020-09-26 13:13:19 X.X.x.x GET /x/x voterid[$acunetix]=1 443 - x.x.x.x Mozilla/5.0+\n(Windows+NT+6.1;+WOW64)+AppleWebKit/537.21+(KHTML,+like+Gecko)+Chrome/41.0.2228.0+Safari/537.21 - 200 0 0 1375\n2020-09-26 13:13:18 .X.x.x GET /x/x voterid=;print(md5(acunetix_wvs_security_test)); 443 - X.X.x.x\n\n```\n\n### User Agents Observed\n\nCISA and FBI have observed the following user agents associated with this scanning activity.\n```\nMozilla/5.0+(Windows+NT+6.1;+WOW64)+AppleWebKit/537.21+(KHTML,+like+Gecko)+Chrome/41.0.2228.0+Safari/537.21 - 500 0\n0 0\nMozilla/5.0+(X11;+U;+Linux+x86_64;+en-US;+rv:1.9b4)+Gecko/2008031318+Firefox/3.0b4\n\n```\n```\nMozilla/5.0+(X11;+U;+Linux+i686;+en-US;+rv:1.8.1.17)+Gecko/20080922+Ubuntu/7.10+(gutsy)+Firefox/2.0.0.17\n\n## Exfiltration\n\n### Obtaining Voter Registration Data\n\n```\nFollowing the review of web server access logs, CISA analysts, in coordination with the FBI, found instances of the cURL and FDM User\nAgents sending GET requests to a web resource associated with voter registration data. The activity occurred between September 29 and\nOctober 17, 2020. Suspected scripted activity submitted several hundred thousand queries iterating through voter identification values, and\nretrieving results with varying levels of success [Gather Victim Identity Information [(T1589)]. A sample of the records identified by the FBI](https://attack.mitre.org/versions/v8/techniques/T1593/)\nreveals they match information in the aforementioned propaganda video.\n\nRequests\n\nThe actor used the following requests.\n\n```\n2020-10-17 13:07:51 x.x.x.x GET /x/x voterid=XXXX1 443 - x.x.x.x curl/7.55.1 - 200 0 0 1406\n2020-10-17 13:07:55 x.x.x.x GET /x/x voterid=XXXX2 443 - x.x.x.x curl/7.55.1 - 200 0 0 1390\n2020-10-17 13:07:58 x.x.x.x GET /x/x voterid=XXXX3 443 - x.x.x.x curl/7.55.1 - 200 0 0 1625\n2020-10-17 13:08:00 x.x.x.x GET /x/x voterid=XXXX4 443 - x.x.x.x curl/7.55.1 - 200 0 0 1390\n\n```\nNote: incrementing `voterid` values in `cs_uri_query field`\n\n### User Agents\n\nCISA and FBI have observed the following user agents.\n\n```\nFDM+3.x\ncurl/7.55.1\n\n```\n```\nMozilla/5.0+(Windows+NT+6.1;+WOW64)+AppleWebKit/537.21+(KHTML,+like+Gecko)+Chrome/41.0.2228.0+Safari/537.21 - 500 0\n0 0\nMozilla/5.0+(X11;+U;+Linux+x86_64;+en-US;+rv:1.9b4)+Gecko/2008031318+Firefox/3.0b4\n\n```\nSee figure 1 below for a timeline of the actor’s malicious activity.\n\n\n-----\n\n_Figure 1: Overview of malicious activity_\n\n### Mitigations\n\n## Detection\n\n### Acunetix Scanning\n\nOrganizations can identify Acunetix scanning activity by using the following keywords while performing log analysis.\n```\n   $acunetix\n   acunetix_wvs_security_test\n\n### Indicators of Compromise\n\n```\n[For a downloadable copy of IOCs, see AA20-304A.stix.](https://us-cert.cisa.gov/sites/default/files/2020-10/AA20-304A.stix.xml)\n\n**Disclaimer:** _many of the IP addresses included below likely correspond to publicly available VPN services, which can be used by individuals_\n_all over the world. This creates the potential for a significant number of false positives; only activity listed in this advisory warrants further_\n_investigation. The actor likely uses various IP addresses and VPN services._\n\nThe following IPs have been associated with this activity.\n\n102.129.239[.]185 (Acunetix Scanning)\n143.244.38[.]60 (Acunetix Scanning and cURL requests)\n45.139.49[.]228 (Acunetix Scanning)\n156.146.54[.]90 (Acunetix Scanning)\n109.202.111[.]236 (cURL requests)\n185.77.248[.]17 (cURL requests)\n217.138.211[.]249 (cURL requests)\n217.146.82[.]207 (cURL requests)\n37.235.103[.]85 (cURL requests)\n37.235.98[.]64 (cURL requests)\n70.32.5[.]96 (cURL requests)\n70.32.6[.]20 (cURL requests)\n70.32.6[.]8 (cURL requests)\n70.32.6[.]97 (cURL requests)\n70.32.6[.]98 (cURL requests)\n77.243.191[.]21 (cURL requests and FDM+3.x [Free Download Manager v3] enumeration/iteration)\n92.223.89[.]73 (cURL requests)\n\nCISA and the FBI are aware the following IOCs have been used by this Iran-based actor. These IP addresses facilitated the mass\ndissemination of voter intimidation email messages on October 20, 2020.\n\n195.181.170[.]244 (Observed September 30 and October 20, 2020)\n102.129.239[.]185 (Observed September 30, 2020)\n104.206.13[.]27 (Observed September 30, 2020)\n154.16.93[.]125 (Observed September 30, 2020)\n185.191.207[.]169 (Observed September 30, 2020)\n185.191.207[.]52 (Observed September 30, 2020)\n194.127.172[.]98 (Observed September 30, 2020)\n194.35.233[.]83 (Observed September 30, 2020)\n198.147.23[.]147 (Observed September 30, 2020)\n198.16.66[.]139(Observed September 30, 2020)\n\n\n-----\n\n0 5[ ]3 (Obse ed Septe be 30, 0 0)\n212.102.45[.]58 (Observed September 30, 2020)\n31.168.98[.]73 (Observed September 30, 2020)\n37.120.204[.]156 (Observed September 30, 2020)\n5.160.253[.]50 (Observed September 30, 2020)\n5.253.204[.]74 (Observed September 30, 2020)\n64.44.81[.]68 (Observed September 30, 2020)\n84.17.45[.]218 (Observed September 30, 2020)\n89.187.182[.]106 (Observed September 30, 2020)\n89.187.182[.]111 (Observed September 30, 2020)\n89.34.98[.]114 (Observed September 30, 2020)\n89.44.201[.]211 (Observed September 30, 2020)\n\n## Recommendations\n\nThe following list provides recommended self-protection mitigation strategies against cyber techniques used by advanced persistent threat\nactors:\n\nValidate input as a method of sanitizing untrusted input submitted by web application users. Validating input can significantly reduce the\nprobability of successful exploitation by providing protection against security flaws in web applications. The types of attacks possibly\nprevented include SQL injection, Cross Site Scripting (XSS), and command injection.\nAudit your network for systems using Remote Desktop Protocol (RDP) and other internet-facing services. Disable unnecessary services\nand install available patches for the services in use. Users may need to work with their technology vendors to confirm that patches will\nnot affect system processes.\nVerify all cloud-based virtual machine instances with a public IP, and avoid using open RDP ports, unless there is a valid need. Place any\nsystem with an open RDP port behind a firewall and require users to use a VPN to access it through the firewall.\nEnable strong password requirements and account lockout policies to defend against brute-force attacks.\nApply multi-factor authentication, when possible.\nMaintain a good information back-up strategy by routinely backing up all critical data and system configuration information on a separate\ndevice. Store the backups offline, verify their integrity, and verify the restoration process.\nEnable logging and ensure logging mechanisms capture RDP logins. Keep logs for a minimum of 90 days and review them regularly to\ndetect intrusion attempts.\nWhen creating cloud-based virtual machines, adhere to the cloud provider's best practices for remote access.\nEnsure third parties that require RDP access follow internal remote access policies.\nMinimize network exposure for all control system devices. Where possible, critical devices should not have RDP enabled.\nRegulate and limit external to internal RDP connections. When external access to internal resources is required, use secure methods,\nsuch as a VPNs. However, recognize the security of VPNs matches the security of the connected devices.\n[Use security features provided by social media platforms; use strong passwords, change passwords frequently, and use a different](https://us-cert.cisa.gov/ncas/current-activity/2018/03/27/Creating-and-Managing-Strong-Passwords)\npassword for each social media account.\nSee CISA’s Tip on [Best Practices for Securing Election Systems for more information.](https://us-cert.cisa.gov/ncas/tips/ST19-002)\n\n### General Mitigations\n\n**_Keep applications and systems updated and patched_**\n\nApply all available software updates and patches and automate this process to the greatest extent possible (e.g., by using an update service\nprovided directly from the vendor). Automating updates and patches is critical because of the speed of threat actors to create new exploits\nfollowing the release of a patch. These “N-day” exploits can be as damaging as zero-day exploits. Ensure the authenticity and integrity of\nvendor updates by using signed updates delivered over protected links. Without the rapid and thorough application of patches, threat actors\ncan operate inside a defender’s patch cycle. 2 Additionally, use tools (e.g., the OWASP Dependency-Check Project tool 3 ) to identify the\npublicly known vulnerabilities in third-party libraries depended upon by the application.\n\n**_Scan web applications for SQL injection and other common web vulnerabilities_**\n\nImplement a plan to scan public-facing web servers for common web vulnerabilities (e.g., SQL injection, cross-site scripting) by using a\ncommercial web application vulnerability scanner in combination with a source code scanner. 4 Fixing or patching vulnerabilities after they are\nidentified is especially crucial for networks hosting older web applications. As sites get older, more vulnerabilities are discovered and exposed.\n\n**_Deploy a web application firewall_**\n\nDeploy a web application firewall (WAF) to prevent invalid input attacks and other attacks destined for the web application. WAFs are\nintrusion/detection/prevention devices that inspect each web request made to and from the web application to determine if the request is\nmalicious. Some WAFs install on the host system and others are dedicated devices that sit in front of the web application. WAFs also weaken\nthe effectiveness of automated web vulnerability scanning tools.\n\n**_Deploy techniques to protect against web shells_**\n\n\n-----\n\natc eb app cat o u e ab t es o co gu at o ea esses t at a o eb s e attac s, a d o o gu da ce o detect g a d\npreventing web shell malware. 5 Malicious cyber actors often deploy web shells—software that can enable remote administration—on a\nvictim’s web server. Malicious cyber actors can use web shells to execute arbitrary system commands commonly sent over HTTP or HTTPS.\nAttackers often create web shells by adding or modifying a file in an existing web application. Web shells provide attackers with persistent\naccess to a compromised network using communications channels disguised to blend in with legitimate traffic. Web shell malware is a longstanding, pervasive threat that continues to evade many security tools.\n\n**_Use multi-factor authentication for administrator accounts_**\n\nPrioritize protection for accounts with elevated privileges, remote access, or used on high-value assets. 6 Use physical token-based\nauthentication systems to supplement knowledge-based factors such as passwords and personal identification numbers (PINs). 7\nOrganizations should migrate away from single-factor authentication, such as password-based systems, which are subject to poor user\nchoices and more susceptible to credential theft, forgery, and password reuse across multiple systems.\n\n**_Remediate critical web application security risks_**\n\nFirst, identify and remediate critical web application security risks. Next, move on to other less critical vulnerabilities. Follow available guidance\non securing web applications. 8 9 10\n\n## How do I respond to unauthorized access to election-related systems?\n\n### Implement your security incident response and business continuity plan\n\nIt may take time for your organization’s IT professionals to isolate and remove threats to your systems and restore normal operations. In the\nmeantime, take steps to maintain your organization’s essential functions according to your business continuity plan. Organizations should\nmaintain and regularly test backup plans, disaster recovery plans, and business continuity procedures.\n\n### Contact CISA or law enforcement immediately\n\n[To report an intrusion and to request incident response resources or technical assistance, contact CISA (Central@cisa.gov or 888-282-0870)](http://10.10.0.46/mailto:Central@cisa.gov)\n[or the FBI through a local field office or the FBI’s Cyber Division (CyWatch@ic.fbi.gov or 855-292-3937).](http://10.10.0.46/mailto:CyWatch@ic.fbi.gov)\n\n## Resources\n\nCISA Tip: [Best Practices for Securing Election Systems](https://us-cert.cisa.gov/ncas/tips/ST19-002)\nCISA Tip: [Securing Voter Registration Data](https://us-cert.cisa.gov/ncas/tips/ST16-001)\nCISA Tip: [Website Security](https://us-cert.cisa.gov/ncas/tips/ST18-006)\nCISA Tip: [Avoiding Social Engineering and Phishing Attacks](https://us-cert.cisa.gov/ncas/tips/ST04-014)\nCISA Tip: [Securing Network Infrastructure Devices](https://us-cert.cisa.gov/ncas/tips/ST18-001)\n[Joint Advisory: Technical Approaches to Uncovering and Remediating Malicious Activity](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)\nCISA Insights: [Actions to Counter Email-Based Attacks on Election-related Entities](https://www.cisa.gov/sites/default/files/publications/CISA_Insights_Actions_to_Counter_Email-Based_Attacks_on_Election-Related_S508C.pdf)\nFBI and CISA Public Service Announcement (PSA): Spoofed Internet Domains and Email Accounts Pose Cyber and Disinformation\nRisks to Voters\nFBI and CISA PSA: [Foreign Actors Likely to Use Online Journals to Spread Disinformation Regarding 2020 Elections](https://ic3.gov/Media/Y2020/PSA201001)\nFBI and CISA PSA: [Distributed Denial of Service Attacks Could Hinder Access to Voting Information, Would Not Prevent Voting](https://ic3.gov/Media/Y2020/PSA200930)\nFBI and CISA PSA: [False Claims of Hacked Voter Information Likely Intended to Cast Doubt on Legitimacy of U.S. Elections](https://ic3.gov/Media/Y2020/PSA200928)\nFBI and CISA PSA: [Cyber Threats to Voting Processes Could Slow But Not Prevent Voting](https://ic3.gov/Media/Y2020/PSA200924)\nFBI and CISA PSA: [Foreign Actors and Cybercriminals Likely to Spread Disinformation Regarding 2020 Election Result](https://ic3.gov/Media/Y2020/PSA200922)\n\n2NSA \"NSA'S Top Ten Cybersecurity Mitigation Strategies\" https://www.nsa.gov/Portals/70/documents/what-wedo/cybersecurity/professional-resources/csi-nsas-top10-cybersecurity-mitigation-strategies.pdf\n3https://owasp.org/www-project-dependency-check/\n4https://apps.nsa.gov/iaarchive/library/ia-guidance/tech-briefs/defending-against-the-exploitation-of-sql-vulnerabilities-to.cfm\n5NSA & ASD \"CyberSecurity Information: Detect and Prevent Web Shell Malware\"\nhttps://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF\n6https://us-cert.cisa.gov/cdm/event/Identifying-and-Protecting-High-Value-Assets-Closer-Look-Governance-Needs-HVAs\n7NSA \"NSA'S Top Ten Cybersecurity Mitigation Strategies\" https://www.nsa.gov/Portals/70/documents/what-wedo/cybersecurity/professional-resources/csi-nsas-top10-cybersecurity-mitigation-strategies.pdf\n8NSA “Building Web Applications – Security for Developers” https://apps.nsa.gov/iaarchive/library/ia-guidance/security-tips/building-webapplications-security-recommendations-for.cfm\n9https://owasp.org/www-project-top-ten/\n10https://cwe.mitre.org/top25/archive/2020/2020_cwe_top25.html\n\n### Revisions\n\nOctober 30, 2020: Initial Version\n\n\n-----\n\no e be 3, 0 0 Updated OC d sc a e to e p as e t at o y act ty sted t s a e t a a ts u t e est gat o\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa20-304a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-30 - Alert (AA20-304A)- Iranian Advanced Persistent Threat Actor Identified Obtaining Voter Registration Data.pdf"
    ],
    "report_names": [
        "2020-10-30 - Alert (AA20-304A)- Iranian Advanced Persistent Threat Actor Identified Obtaining Voter Registration Data.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535949,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653786349,
    "ts_modification_date": 1653786349,
    "files": {
        "pdf": "https://archive.orkl.eu/c08615c9e0775466b3ab3ace4a4fac69b36d92b0.pdf",
        "text": "https://archive.orkl.eu/c08615c9e0775466b3ab3ace4a4fac69b36d92b0.txt",
        "img": "https://archive.orkl.eu/c08615c9e0775466b3ab3ace4a4fac69b36d92b0.jpg"
    }
}