{
    "id": "48bd8866-a9a9-49dc-9397-d8b80797fc46",
    "created_at": "2023-01-12T15:00:48.888205Z",
    "updated_at": "2025-03-27T02:16:34.538517Z",
    "deleted_at": null,
    "sha1_hash": "1e719b95140d815ef52dced0c55a470bf597fa2f",
    "title": "2022-06-02 - To HADES and Back- UNC2165 Shifts to LOCKBIT to Evade Sanctions",
    "authors": "",
    "file_creation_date": "2022-06-06T13:04:25Z",
    "file_modification_date": "2022-06-06T13:04:25Z",
    "file_size": 4598406,
    "plain_text": "# To HADES and Back: UNC2165 Shifts to LOCKBIT to Evade Sanctions\n\n**[mandiant.com/resources/unc2165-shifts-to-evade-sanctions](https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions)**\n\nThe U.S. Treasury Department's Office of Foreign Assets Control (OFAC) [sanctioned the](https://home.treasury.gov/news/press-releases/sm845)\nentity known as Evil Corp in December 2019, citing the group's extensive development and\nuse and control of the DRIDEX malware ecosystem. Since the sanctions were announced,\n[Evil Corp-affiliated actors appear to have continuously changed the ransomware they use](https://advantage.mandiant.com/reports/21-00014631)\n(Figure 1). Specifically following an October 2020 OFAC advisory, there was a cessation of\nWASTEDLOCKER activity and the emergence of multiple closely related ransomware\nvariants in relatively quick succession. These developments suggested that the actors faced\nchallenges in receiving ransom payments following their ransomware's public association\nwith Evil Corp.\n\n[Mandiant has investigated multiple LOCKBIT ransomware intrusions attributed to UNC2165,](https://advantage.mandiant.com/reports/21-00026166)\na financially motivated threat cluster that shares numerous overlaps with the threat group\npublicly reported as \"Evil Corp.\" UNC2165 has been active since at least 2019 and almost\n[exclusively obtains access into victim networks via the FAKEUPDATES infection chain,](https://advantage.mandiant.com/malware/malware--57d01f8d-2169-51cf-9693-0a1b8852ceab)\n[tracked by Mandiant as UNC1543. Previously, we have observed UNC2165 deploy HADES](https://advantage.mandiant.com/actors/threat-actor--4d3763e2-59dc-5f7f-be84-5acf076d3e4b)\nransomware. Based on the overlaps between UNC2165 and Evil Corp, we assess with high\nconfidence that these actors have shifted away from using exclusive ransomware variants to\nLOCKBIT—a well-known ransomware as a service (RaaS)—in their operations, likely to\nhinder attribution efforts in order to evade sanctions.\n\n\n-----\n\nFigure 1: Ransomware families believed to be associated with Evil Corp-affiliated actors (2100014631)\n\n## UNC2165 Overlaps with Evil Corp Activity\n\nOFAC sanctions against Evil Corp in December 2019 were announced in conjunction with\n[the Department of Justice's (DOJ) unsealing of indictments against individuals for their roles](https://www.justice.gov/opa/pr/russian-national-charged-decade-long-series-hacking-and-bank-fraud-offenses-resulting-tens)\nin the Bugat malware operation, updated versions of which were later called DRIDEX.\nDRIDEX was believed to operate under an affiliate model with multiple actors involved in the\ndistribution of the malware. While the malware was initially used as traditional banking\n[Trojan, beginning as early as 2018, we increasingly observed DRIDEX used as a conduit to](https://advantage.mandiant.com/reports/18-00005343)\n[deploy post-exploitation frameworks onto victim machines. Security researchers also began](https://www.crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-ransomware/)\nto report DRIDEX preceding BITPAYMER deployments, which was consistent with a broader\nemerging trend at the time of ransomware being deployed post-compromise in victim\nenvironments. Although Evil Corp was sanctioned for the development and distribution of\nDRIDEX, the group was already beginning to shift towards more lucrative ransomware\noperations.\n\nUNC2165 activity likely represents another evolution in Evil Corp affiliated actors' operations.\nNumerous reports have highlighted the progression of linked activity including development\nof new ransomware families and a reduced reliance on DRIDEX to enable intrusions.\nDespite these apparent efforts to obscure attribution, UNC2165 has notable similarities to\noperations publicly attributed to Evil Corp, including a heavy reliance on FAKEUPDATES to\nobtain initial access to victims and overlaps in their infrastructure and use of particular\nransomware families.\n\nUNC2165 has almost exclusively obtained initial access to victims' networks from\n[UNC1543. UNC1543 is a financially motivated threat cluster that has distributed](https://advantage.mandiant.com/actors/threat-actor--4d3763e2-59dc-5f7f-be84-5acf076d3e4b)\nFAKEUPDATES since at least April 2018. In the months prior to the indictments,\n[Mandiant reported on FAKEUPDATES being used as the initial infection vector for](https://www.mandiant.com/resources/head-fake-tackling-disruptive-ransomware-attacks)\nDRIDEX infections that later resulted in the deployment of BITPAYMER or\nDOPPELPAYMER.\nUNC2165 has deployed HADES ransomware, which has code and functional\nsimilarities to other ransomware believed to be associated with Evil Corp-affiliated\nthreat actors\n\n\n-----\n\nUNC2165-attributed BEACON payloads and command and control (C&C) servers have\nalso been publicly reported by other security vendors in association with suspected Evil\nCorp activity (Table 1).\n\nTable 1: Examples of UNC2165 BEACON C&C servers reported by others as Evil Corp\n\n**BEACON C&C** **Description**\n\n\nmwebsoft[.]com\nrostraffic[.]com\nconsultane[.]com\ntraffichi[.]com\namazingdonutco[.]com\ncofeedback[.]com\nadsmarketart[.]com\nwebsitelistbuilder[.]com\nadvancedanalysis[.]be\nadsmarketart[.]com\n\ncutyoutube[.]com\nonlinemoula[.]com\n\npotasip[.]com\nadvancedanalysis[.]be\nfirsino[.]com\ncurrentteach[.]com\nnewschools[.]info\nadsmarketart[.]com\n\n\n[In June 2020, NCC Group reported on the WASTEDLOCKER](https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/)\nransomware, which they attributed to Evil Corp with high\nconfidence. In these incidents, the threat actor leveraged\nFAKEUPDATES for initial access.\n\n[In June 2021, Secureworks reported on HADES ransomware](https://www.secureworks.com/blog/hades-ransomware-operators-use-distinctive-tactics-and-infrastructure)\nintrusions attributed to \"GOLD WINTER.\" In these incidents, the\nthreat actor leveraged FAKEUPDATES or VPN credentials for\n[initial access. This activity was later attributed to GOLD DRAKE](https://www.secureworks.com/research/threat-profiles/gold-winter)\n(aka Evil Corp) after further analysis of the ransomware and\noverlaps with other families believed to be operated by GOLD\nDRAKE.\n\n[In February 2022, SentinelOne published an in-depth report on](https://assets.sentinelone.com/sentinellabs/sentinellabs_EvilCorp)\nthe Evil Corp lineage in which they assessed with high\nconfidence that WASTEDLOCKER, HADES,\nPHOENIXLOCKER, PAYLOADBIN, and MACAW were\ndeveloped by the same threat actors. The researchers also\nnoted overlaps in infrastructure between FAKEUPDATES and\nBITPAYMER, DOPPELPAYMER, WASTEDLOCKER, and\nHADES ransomware.\n\n\n_Overlaps With “SilverFish” Reporting_\n\nUNC2165 also has overlaps with a cluster of activity dubbed \"SilverFish\" by ProDaft.\nMandiant reviewed the information in this report and determined that the analyzed malware\nadministration panel is used to manage FAKEUPDATES infections and to distribute\nsecondary payloads, including BEACON. We believe that at least some of the described\nactivity can be attributed to UNC2165 based on malware payloads and other technical\nartifacts included in the report.\n\n\n-----\n\nA command appearing in a screenshot within the ProDaft report is consistent with\nUNC2165 activity. This command reportedly executes a BEACON payload that\ncommunicates with the C&C domain `tanzaniafisheries[.]com from a` `.csproj`\nfile using `msbuild.exe . We attribute this BEACON C&C domain to UNC2165 and`\nhave routinely observed UNC2165 leveraging this same technique to load BEACON\nshellcode payloads via `.csproj files. The execution of this command via the`\nFAKEUPDATES C&C server suggests that UNC2165 has at least some level of access\nto the admin panel to execute commands and launch payloads post-compromise.\n\nSince June 2020 all BEACON payloads that we have observed delivered via\nFAKEUPDATES have been attributed to UNC2165 based on their ownership by a\ncommon bulletproof hosting client and observed post-exploitation TTPs.\nFAKEUDPATES has also delivered NETSUPPORT during this period, but we do\nnot currently attribute this activity to UNC2165. NETSUPPORT is most likely used\nto monetize infections on machines belonging to individuals rather than\norganizations by stealing credentials and other sensitive personal information.\nThe ProDaft report contains an image that shows secondary payloads are uploaded\ndirectly in the panel and referenced by a file ID number. The script that we have seen\nloading COLORFAKE is consistent with this activity as it includes the following\nreference `fileid = '<number>'` (e.g. var fileid = '190').\n\n## Attack Lifecycle\n\nWhile UNC2165 activity dates to at least June 2020, the following TTPs are focused on\nintrusions where we directly observed ransomware deployed.\n\n_Initial Compromise and Establish Foothold_\n\nUNC2165 has primarily gained access to victim organizations via FAKEUPDATES infections\nthat ultimately deliver loaders to deploy BEACON samples on impacted hosts. The loader\nportion of UNC2165 Cobalt Strike payloads have changed frequently but they have\ncontinually used BEACON in most intrusions since 2020. Beyond FAKEUPDATES, we have\nalso observed UNC2165 leverage suspected stolen credentials to obtain initial access.\n\n[During 2021, UNC2165 leveraged publicly available loaders, including DONUT, to](https://github.com/TheWover/donut)\ndeploy BEACON payloads; however, intrusions observed since late 2021 have used\nthe COLORFAKE (aka Blister) dropper.\nIn recent UNC2165 intrusions where COLORFAKE was used, we recovered JavaScript\nartifacts showing the initial delivery of COLORFAKE payloads via FAKEUPDATES. The\npayloads to be downloaded each have a \"fileid\" value that FAKEUPDATES will retrieve\nand write to disk (Figure 2).\n\nThe COLORFAKE DLL is placed within `%ProgramData% as a` `.tmp file,`\nrenamed to a DLL, and subsequently executed by RunDLL32 with its export\nfunction.\n\n\n-----\n\nFigure 2: Deployment of COLORFAKE loader\n_Escalate Privileges_\n\nUNC2165 has taken multiple common approaches to privilege escalation across its\nintrusions, including Mimikatz and Kerberoasting attacks, targeting authentication data stored\nin the Windows registry, and searching for documents or files associated with password\nmanagers or that may contain plaintext credentials.\n\nUNC2165 has used a service account to extract copies of the Windows SECURITY\nregistry hives.\n[UNC2165 has used Mimikatz and performed Kerberoasting attacks to obtain extensive](https://attack.mitre.org/techniques/T1558/003/)\ncredential access in target environments. Kerberos data output files generated by\nUNC2165 are typically placed in the `%ProgramData% root directory (Figure 3). The`\nthreat actors also test the acquired credentials across the target domain to identify\nwhere they will work.\nUNC2165 has searched for terms including keep, avamar, kdb, netapp, pass, and\n_passw to identify files or systems that may contain credentials or sensitive data for_\nexfiltration purposes. Additionally, the threat actors have directly accessed and\nexported passwords from enterprise password managers.\nUNC2165 has used tools, including KEETHIEF/KEETHEFT and\nSecretServerSecretStealer, to gather key material from KeePass and decrypt secrets\nfrom Thycotic Secret Server\n\nFigure 3: UNC2165 downloads Kerberoasting utility from GitHub\n_Internal Reconnaissance_\n\n\n-----\n\nFollowing UNC1543 FAKEUPDATES infections, we commonly see a series of built-in\nMicrosoft Windows utilities such as whoami, nltest, cmdkey, and net used against newly\naccessed systems to gather data and learn more about the victim environment. The majority\nof these commands are issued using one larger, semicolon-delineated list of enumeration\ncommands, followed up by additional PowerShell reconnaissance (Figure 4). We attribute\nthis initial reconnaissance activity to UNC1543 as it occurs prior to UNC2165 BEACON\ndeployment; however, collected information almost certainly enables decision-making for\nUNC2165. During intrusions, UNC2165 has used multiple common third-party tools to enable\nreconnaissance of victim networks and has accessed internal systems to obtain information\nused to guide its intrusion operations.\n\nIn one intrusion UNC2165 downloaded and executed the Advanced Port Scanner\nutility.\nUNC2165 has downloaded and installed the asset management tool Lansweeper.\nUNC2165 has accessed a victim's VMware VCenter, which provided information about\nhost configurations, clusters, and storage devices in the organization's virtualization\nenvironment.\nUNC2165 accessed a TrendMicro OfficeScan management console and viewed admin\nroles and other configuration information.\n\nFigure 4: UNC1543 reconnaissance commands; common precursor to UNC2165\n_Lateral Movement and Maintain Presence_\n\nUNC2165 relies heavily on Cobalt Strike BEACON to enable lateral movement and maintain\npresence in a victim environment. Beyond its use of BEACON, UNC2165 has also used\ncommon administrative protocols and software to enable lateral movement, including RDP\nand SSH.\n\nThe threat actors connected via SSH to enterprise storage systems using PuTTy.\nUNC2165 has moved laterally within victim environments via RDP.\nIn support of both persistence and lateral movement, UNC2165 has created local\nsystem accounts and added them to groups including local administrator and RDP\nusers.\nIn at least one case, UNC2165 maintained access to a victim environment via its\ncorporate VPN infrastructure.\n\n_Complete Mission_\n\n\n-----\n\nIn most cases, UNC2165 has stolen data from its victims to use as leverage for extortion\nafter it has deployed ransomware across an environment. In intrusions where the data\nexfiltration method could be identified, there is evidence to suggest the group used either\nRclone or MEGASync to transfer data from the victims' environments prior to encryption. The\nRclone utility is used by many financially motivated actors to synchronize sensitive files with\ncloud storage providers, and MEGASync synchronizes data to the MEGA cloud hosting\nservice.\n\nUNC2165 has leveraged multiple Windows batch scripts during the final phases of its\noperations to deploy ransomware and modify systems to aid the ransomware's propagation.\nWe have observed UN2165 use both HADES and LOCKBIT; we have not seen these threat\nactors use HADES since early 2021. Notably, LOCKBIT is a prominent Ransomware-as-aService (RaaS) affiliate program, which we track as UNC2758, that has been advertised in\n[underground forums since early 2020 (21-00026166).](https://advantage.mandiant.com/reports/21-00026166)\n\nUNC2165 uses a script that forces Group Policy updates and adds all files with EXE,\nBAT, or DLL extensions and the `C:\\Programdata\\ and` `C:\\Windows\\ directories to`\nthe Windows Defender exclusions list (Figure 5).\nUNC2165 scripts have also used WMI to stop and uninstall anti-virus products and\nother Windows Services prior to ransomware deployment (Figure 6).\nUNC2165 has used scripts to modify multiple Windows Registry keys with an aim to\nremove some barriers to ransomware execution and disable utilities commonly used by\nadministrators such as the Windows task manager, registry tools, and the command\nprompt (Figure 7).\nUNC2165 has employed a ransomware execution script that initiates the encryption\nprocess using PSEXEC. This script also disables Windows Defender and clears the\nWindows event logs (Figure 8).\n\n\n-----\n\nFigure 5: Sample script forcing Group Policy update\n\nFigure 6: Sample script to uninstall antivirus products\n\nFigure 7: Sample script to edit the Windows Registry\n\n\n-----\n\nFigure 8: Sample script to execute LOCKBIT binary\n\n## Possibly Affiliated Threat Actor\n\nBased on information from trusted sensitive sources and underground forum activity, we\nhave moderate confidence that a particular actor operating on underground forums is\n[affiliated with UNC2165. Additional details are available in Mandiant Advantage.](https://advantage.mandiant.com/)\n\n[Mandiant has previously highlighted a cluster of BEACON C&C services hosted on](https://advantage.mandiant.com/reports/21-00014630)\nyalishanda's bulletproof hosting service that we believe is operated by a common threat\nactor. Information gleaned from trusted, sensitive sources revealed that account\ninformation associated with this client has also been used by the actor in underground\nforums.\nThis actor’s underground forum activity is consistent with TTPs used in UNC2165\noperations.\n\nIn April 2022, the actor appeared to purchase VPN access to a wholesale\ndistribution company with an annual revenue of $3 billion USD and has\nexpressed interest in purchasing additional network accesses. Although less\ncommon, we have seen UNC2165 use suspected stolen credentials in\nintrusions.\nBetween December 2019 and August 2020, the actor posted at least twice on\n```\n      exploit[.]in seeking to purchase versions of Cobalt Strike.\n\n```\nBeginning in July 2019, they have made several posts on `exploit[.]in`\nseeking services and tools for obfuscating malware to avoid detection.\nWe also identified a GitHub profile matching the actor’s username, and while the\naccount’s activity is limited, it is consistent with UNC2165 operations. Most notably, the\nactor opened an issue for a project in which they included command line arguments\nshowing that they were attempting to build a `.csproj shellcode runner. UNC2165`\nused `.csproj files extensively during this time period to deploy BEACON payloads`\nand has leveraged `.csproj files to deploy BEACON that are consistent with the`\nproject for which the issue was opened.\n\n\n-----\n\n## Implications\n\nThe U.S. Government has increasingly leveraged sanctions as a part of a broader toolkit to\ntackle ransomware operations. This has included sanctions on both actors directly involved\nin ransomware operations as well as cryptocurrency exchanges that have received illicit\nfunds. These sanctions have had a direct impact on threat actor operations, particularly as at\nleast some companies involved in ransomware remediation activities, such as negotiation,\n[refuse to facilitate payments to known sanctioned entities. This can ultimately reduce threat](https://www.wsj.com/articles/russia-sanctions-complicate-paying-ransomware-hackers-11651138201)\nactors' ability to be paid by victims, which is the primary driver of ransomware operations.\n\nThe adoption of an existing ransomware is a natural evolution for UNC2165 to attempt to\nobscure their affiliation with Evil Corp. Both the prominence of LOCKBIT in recent years and\nits successful use by several different threat clusters likely made the ransomware an\nattractive choice. Using this RaaS would allow UNC2165 to blend in with other affiliates,\nrequiring visibility into earlier stages of the attack lifecycle to properly attribute the activity,\ncompared to prior operations that may have been attributable based on the use of an\nexclusive ransomware. Additionally, the frequent code updates and rebranding of HADES\nrequired development resources and it is plausible that UNC2165 saw the use of LOCKBIT\nas a more cost-effective choice. The use of a RaaS would eliminate the ransomware\ndevelopment time and effort allowing resources to be used elsewhere, such as broadening\nransomware deployment operations. Its adoption could also temporarily afford the actors\nmore time to develop a completely new ransomware from scratch, limiting the ability of\nsecurity researchers to easily tie it to previous Evil Corp operations.\n\nIt is plausible that the actors behind UNC2165 operations will continue to take additional\nsteps to distance themselves from the Evil Corp name. For example, the threat actors could\nchoose to abandon their use of FAKEUPDATES, an operation with well-documented links to\nEvil Corp actors in favor of a newly developed delivery vector or may look to acquire access\nfrom underground communities. Some evidence of this developing trend already exists given\nUNC2165 has leveraged stolen credentials in a subset of intrusions, which is consistent with\na suspected member’s underground forum activity. We expect these actors as well as others\nwho are sanctioned in the future to take steps such as these to obscure their identities in\norder to ensure that it is not a limiting factor to receiving payments from victims.\n\n## Technical Appendix\n\n_MITRE ATT&CK Mapping_\n\nMandiant has observed UNC2165 use the following techniques.\n\nImpact\n\n\n-----\n\nT1486: Data Encrypted for Impact\nT1489: Service Stop\nT1490: Inhibit System Recovery\nT1529: System Shutdown/Reboot\n\nDefense Evasion\n\nT1027: Obfuscated Files or Information\nT1027.005: Indicator Removal from Tools\nT1036: Masquerading\nT1055: Process Injection\nT1055.002: Portable Executable Injection\nT1070.001: Clear Windows Event Logs\nT1070.004: File Deletion\nT1070.005: Network Share Connection Removal\nT1070.006: Timestomp\nT1078: Valid Accounts\nT1112: Modify Registry\nT1127.001: MSBuild\nT1134: Access Token Manipulation\nT1134.001: Token Impersonation/Theft\nT1140: Deobfuscate/Decode Files or Information\nT1202: Indirect Command Execution\nT1218.005: Mshta\nT1218.011: Rundll32\nT1497: Virtualization/Sandbox Evasion\nT1497.001: System Checks\nT1553.002: Code Signing\nT1562.001: Disable or Modify Tools\nT1562.004: Disable or Modify System Firewall\nT1564.003: Hidden Window\nT1620: Reflective Code Loading\n\nCommand and Control\n\nT1071: Application Layer Protocol\nT1071.001: Web Protocols\nT1071.004: DNS\nT1090.004: Domain Fronting\nT1095: Non-Application Layer Protocol\nT1105: Ingress Tool Transfer\nT1573.002: Asymmetric Cryptography\n\nCollection\n\n\n-----\n\nT1056.001: Keylogging\nT1113: Screen Capture\nT1115: Clipboard Data\nT1560: Archive Collected Data\nT1602.002: Network Device Configuration Dump\n\nDiscovery\n\nT1007: System Service Discovery\nT1010: Application Window Discovery\nT1012: Query Registry\nT1016: System Network Configuration Discovery\nT1033: System Owner/User Discovery\nT1049: System Network Connections Discovery\nT1057: Process Discovery\nT1069: Permission Groups Discovery\nT1069.001: Local Groups\nT1069.002: Domain Groups\nT1082: System Information Discovery\nT1083: File and Directory Discovery\nT1087: Account Discovery\nT1087.001: Local Account\nT1087.002: Domain Account\nT1482: Domain Trust Discovery\nT1518: Software Discovery\nT1614.001: System Language Discovery\n\nLateral Movement\n\nT1021.001: Remote Desktop Protocol\nT1021.002: SMB/Windows Admin Shares\nT1021.004: SSH\n\nExfiltration\n\nT1020: Automated Exfiltration\n\nExecution\n\nT1047: Windows Management Instrumentation\nT1053: Scheduled Task/Job\nT1053.005: Scheduled Task\nT1059: Command and Scripting Interpreter\nT1059.001: PowerShell\nT1059 003: Windows Command Shell\n\n\n-----\n\nT1059.005: Visual Basic\nT1059.007: JavaScript\nT1569.002: Service Execution\n\nPersistence\n\nT1098: Account Manipulation\nT1136: Create Account\nT1136.001: Local Account\nT1543.003: Windows Service\nT1547.001: Registry Run Keys / Startup Folder\nT1547.009: Shortcut Modification\n\nCredential Access\n\nT1003.001: LSASS Memory\nT1003.002: Security Account Manager\nT1552.002: Credentials in Registry\nT1558: Steal or Forge Kerberos Tickets\nT1558.003: Kerberoasting\n\nInitial Access\n\nT1133: External Remote Services\nT1189: Drive-by Compromise\n\nResource Development\n\nT1588.003: Code Signing Certificates\nT1588.004: Digital Certificates\nT1608.003: Install Digital Certificate\n\n_LOCKBIT YARA Rules_\n\nThe following YARA rules are not intended to be used on production systems or to inform\nblocking rules without first being validated through an organization's own internal testing\nprocesses to ensure appropriate performance and limit the risk of false positives. These\nrules are intended to serve as a starting point for hunting efforts to identify LOCKBIT activity;\nhowever, they may need adjustment over time if the malware family changes.\n\n\n-----\n\nFigure 9: LOCKBIT YARA rule detects PE files with strings related to LOCKBIT v1 ransom\nnotes\n\nFigure 10: LOCKBIT YARA rule detects PE files with strings related to LOCKBIT 2.0 ransom\nnotes\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-02 - To HADES and Back- UNC2165 Shifts to LOCKBIT to Evade Sanctions.pdf"
    ],
    "report_names": [
        "2022-06-02 - To HADES and Back- UNC2165 Shifts to LOCKBIT to Evade Sanctions.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d0338f31-ace4-4fec-972b-d1ba9815d1de",
            "created_at": "2023-01-06T13:46:39.283728Z",
            "updated_at": "2025-03-27T02:00:03.040061Z",
            "deleted_at": null,
            "main_name": "GOLD WINTER",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD WINTER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "821d8858-a784-4ab2-9ecb-56c7afeed7d7",
            "created_at": "2023-11-21T02:00:07.403629Z",
            "updated_at": "2025-03-27T02:00:03.252703Z",
            "deleted_at": null,
            "main_name": "SilverFish",
            "aliases": [],
            "source_name": "MISPGALAXY:SilverFish",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "544cac23-af15-4100-8f20-46c07962cbfa",
            "created_at": "2023-01-06T13:46:39.484133Z",
            "updated_at": "2025-03-27T02:00:03.106334Z",
            "deleted_at": null,
            "main_name": "GOLD PRELUDE",
            "aliases": [
                "TA569",
                "UNC1543"
            ],
            "source_name": "MISPGALAXY:GOLD PRELUDE",
            "tools": [
                "FakeUpdates",
                "FakeUpdate",
                "SocGholish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ebc139d2-7450-46f5-a9e4-e7d561133fa5",
            "created_at": "2024-04-24T02:00:49.453475Z",
            "updated_at": "2025-03-27T02:00:55.41974Z",
            "deleted_at": null,
            "main_name": "Mustard Tempest",
            "aliases": [
                "Mustard Tempest",
                "DEV-0206",
                "TA569",
                "GOLD PRELUDE",
                "UNC1543"
            ],
            "source_name": "MITRE:Mustard Tempest",
            "tools": [
                "SocGholish",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3bf456e4-84ee-48fd-b3ab-c10d54a48a34",
            "created_at": "2024-06-19T02:03:08.096988Z",
            "updated_at": "2025-03-27T02:05:17.389635Z",
            "deleted_at": null,
            "main_name": "GOLD PRELUDE",
            "aliases": [
                "TA569 ",
                "UNC1543 ",
                "Mustard Tempest "
            ],
            "source_name": "Secureworks:GOLD PRELUDE",
            "tools": [
                "SocGholish"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "80300c2f-309a-43c2-9d01-0357a174ad20",
            "created_at": "2024-06-19T02:03:08.140588Z",
            "updated_at": "2025-03-27T02:05:17.405076Z",
            "deleted_at": null,
            "main_name": "GOLD WINTER",
            "aliases": [
                ""
            ],
            "source_name": "Secureworks:GOLD WINTER",
            "tools": [
                " Cobalt Strike",
                " Hades",
                " MEGAsync",
                " MSBuild",
                " Metasploit",
                " Mimikatz",
                " PSexec",
                " SocGholish",
                "Advanced Port Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535648,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1654520665,
    "ts_modification_date": 1654520665,
    "files": {
        "pdf": "https://archive.orkl.eu/1e719b95140d815ef52dced0c55a470bf597fa2f.pdf",
        "text": "https://archive.orkl.eu/1e719b95140d815ef52dced0c55a470bf597fa2f.txt",
        "img": "https://archive.orkl.eu/1e719b95140d815ef52dced0c55a470bf597fa2f.jpg"
    }
}