{
    "id": "48c33838-6824-49e7-a816-db02f4cf2200",
    "created_at": "2023-01-12T15:00:05.793174Z",
    "updated_at": "2025-03-27T02:06:09.824447Z",
    "deleted_at": null,
    "sha1_hash": "30e43511745fb2fd8c5bdc9c29d1bd3900392c60",
    "title": "2022-03-23 - Gone in 52 Seconds…and 42 Minutes- A Comparative Analysis of Ransomware Encryption Speed",
    "authors": "",
    "file_creation_date": "2022-05-27T23:14:19Z",
    "file_modification_date": "2022-05-27T23:14:19Z",
    "file_size": 667895,
    "plain_text": "# Gone in 52 Seconds…and 42 Minutes: A Comparative Analysis of Ransomware Encryption Speed\n\n**splunk.com/en_us/blog/security/gone-in-52-seconds-and-42-minutes-a-comparative-analysis-of-ransomware-**\nencryption-speed.html\n\nMarch 23, 2022\n\nSECURITY\n\nBy [Shannon Davis March 23, 2022](https://www.splunk.com/en_us/blog/author/shannond.html)\n\n\n-----\n\nDo you feel like every other cybersecurity news story mentioned ransomware in 2021? We\nfeel the same way, and as a cybersecurity vendor, we felt that we should also contribute to\n\nthe noise. :-)\n\nBut we did want to try and do something different.\n\nOn top of Splunk’s numerous [ransomware detections from our threat research team, we](https://research.splunk.com/stories/ransomware/)\nwanted to use Splunk to see if we could add some refinement and knowledge to the\nransomware clamor. We decided to measure how fast ransomware encrypts files; not just\none or two ransomware binaries, but dozens of them — all using Splunk.\n\nWhy? Well, partly because we have an unlimited Splunk license, but also because we\ncouldn’t find the answer to the question: “How long do you have until ransomware encrypts\nyour systems?” This seems like knowledge that organizations could use to organize their\ndefenses. If organizations have more than 20 hours before ransomware finishes encrypting,\nthey might choose to focus on detecting and mitigating ransomware after infection. If\nransomware encrypts an entire system in 52 seconds, organizations should probably\nrespond earlier in the ransomware lifecycle.\n\nIn our initial hypothesis, we asserted that if ransomware executes on a system, then it’s too\nlate for an organization to respond effectively. We conducted a literature review of\nransomware encryption speed and only uncovered work that was encyclopedic in scope\nfrom one of the ransomware groups themselves.\n\nThe LockBit group posted a table on their Tor site (Fig. 1) listing encryption speeds for more\nthan 30 ransomware families, showing — perhaps not surprisingly — that LockBit was the\nfastest. To be fair, I guess that makes sense; you typically don’t release PR pieces that\nhighlight how bad you are. We then looked at dwell time for ransomware intrusions and\n\n\n-----\n\n[found that the three-day dwell time cited by Mandiant in their 2021 M-Trends report was](https://www.mandiant.com/resources/m-trends-2021)\nfairly representative. This gave us a “how long till people realize they are infected with\nransomware” timeframe.\n\n_Figure 1. LockBit analysis of ransomware encryption speeds among competing ransomware groups._\n\n## Prep Work\n\nWe couldn’t leave it to LockBit’s marketing team to only release content like this, so we\nrolled up our sleeves and got busy building an environment that would allow us to conduct\nour own ransomware speed tests. We took the great [Splunk Attack Range project, created](https://github.com/splunk/attack_range)\nby [Splunk’s Threat Research Team, and modified it to fit our needs.](https://www.splunk.com/en_us/cyber-security/threat-research.html)\n\n\n-----\n\n_Figure 2. Diagram outlining the ransomware environment created using a modified version of Splunk Attack Range._\n\nWe created four different “victim” profiles consisting of Windows 10 and Windows Server\n2019 operating systems, each with two different performance specifications benchmarked\nfrom customer environments. We then chose 10 different ransomware families and 10\nsamples from each of those families to test. Figure 3 outlines the families that we tested,\nalong with the Microsoft Defender detection identifiers from VirusTotal.\n\n\n-----\n\n_Figure 3. Ransomware families and corresponding Microsoft Defender detection identifiers from VirusTotal._\n\nWe tested every sample across all four host profiles, which amounted to 400 different\nransomware runs (10 families x 10 samples per family x 4 profiles). In order to measure the\nencryption speed, we gathered 98,561 test files (pdf, doc, xls, etc.) from a public file corpus,\ntotaling 53GB. To collect the necessary data, we used a combination of native Windows\n[logging, Windows Perfmon statistics, Microsoft Sysmon, along with](https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon) [Zeek and](https://zeek.org/) [stoQ for](https://stoq.punchcyber.com/)\nfurther analysis (that’s content for future blogs, so be patient).\n\n[In order to capture the required encryption events, we enabled Object Level Auditing on the](https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4663)\n[100 directories where our test files lived. This provided us with EventCode 4663 logs that](https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4663)\nwe could use to calculate the Total Time to Encryption (TTE) for each sample. The samples\nwe tested had an Accesses value of DELETE at the end of encrypting each file, which is\nhow we measured encryption speed. Not all ransomware behaves this way, so a search for\nEventCode=4663 Accesses=DELETE in Splunk may not always return the same results.\n\n\n-----\n\n## The Heist\n\nJust like watching Gone in 60 Seconds (the Nicholas Cage version, of course), you’re on\nthe edge of your seat waiting for the results. Well, here you go.\n\n**Family** **Median Duration**\n\nLockBit 00:05:50\n\nBabuk 00:06:34\n\nAvaddon 00:13:15\n\nRyuk 00:14:30\n\nRevil 00:24:16\n\nBlackMatter 00:43:03\n\nDarkside 00:44:52\n\nConti 00:59:34\n\nMaze 01:54:33\n\nMespinoza (PYSA) 01:54:54\n\n**Average of the median** **00:42:52**\n\n_Figure 4. Median ransomware speed measured across 10 ransomware families._\n\nAs you can see, LockBit lived up to its own hype and was the quickest to encrypt of all the\nransomware families we tested. We listed the median duration, as some families had one or\ntwo samples that would skew the average duration. For example, LockBit had the fastest\nsample coming in at four minutes and nine seconds (fig. 5). Babuk was a close second but\nhad one sample that was the slowest of all samples tested, which took more than three and\na half hours (fig. 6).\n\n\n-----\n\n_Figure 5. LockBit had the fastest ransomware sample to encrypt files with a duration of four minutes and nine seconds._\n\n_Figure 6. Babuk had the second fastest median encryption speed but the slowest individual sample, which took more thanthree and a half hours to encrypt the files._\n\n## The Getaway\n\n[This research is available in a comprehensive whitepaper with more details than what is](https://www.splunk.com/en_us/form/an-empirically-comparative-analysis-of-ransomware-binaries.html)\noutlined here (I get in big trouble for going over 800-1,200 words). As I mentioned earlier,\nthere is more research to come out of our data set. We plan to publish the data to the\n[Splunk BOTS Portal in time for](https://bots.splunk.com/) [.conf22 (June 14-17, 2022). This way, you can investigate](https://conf.splunk.com/)\nthe data yourself and possibly uncover details that we may not have noticed during our\ntests.\n\nFinally, you might ask what this means if you’re a network defender. Well, if we go back to\nour original hypothesis of ransomware being too fast to defend against once it executes on\nthe victim system, that should give you a hint. Start looking “left of boom,” where boom is\nthe malware detonation, and assess your capabilities to prevent or detect the ransomware\ngroup’s behavior. Multi-factor authentication, network segmentation, patching, and\ncentralized logging (couldn’t help myself there) are all very good strategies to bolster your\ndefenses against ransomware or any other malicious actors for that matter (I’m looking at\nyou, Nicholas Cage). And of course, this sort of work is what you can expect from SURGe\nover the next couple of months and well into the summer. I mean, someone has to talk\nabout ransomware, right?\n\nHappy Hunting!\n\n**_Authors and Contributors: As always, security at Splunk is a family business. Credit to_**\n_[authors and collaborators: Shannon Davis,](https://www.splunk.com/en_us/blog/author/shannond.html)_ _[Ryan Kovar](https://www.splunk.com/en_us/blog/author/rkovar.html)_\n\n\n-----\n\nPosted by\n\n**[Shannon Davis](https://www.splunk.com/en_us/blog/author/shannond.html)**\n\nSecurity practitioner, Melbourne, Australia via Seattle, USA.\n\nTAGS\n[SURGe](https://www.splunk.com/en_us/blog/tag/surge.html) [Splunk Research](https://www.splunk.com/en_us/blog/tag/splunk-research.html)\nShow All Tags\n\n\n-----\n\nShow Less Tags\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-23 - Gone in 52 Seconds…and 42 Minutes- A Comparative Analysis of Ransomware Encryption Speed.pdf"
    ],
    "report_names": [
        "2022-03-23 - Gone in 52 Seconds…and 42 Minutes- A Comparative Analysis of Ransomware Encryption Speed.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653693259,
    "ts_modification_date": 1653693259,
    "files": {
        "pdf": "https://archive.orkl.eu/30e43511745fb2fd8c5bdc9c29d1bd3900392c60.pdf",
        "text": "https://archive.orkl.eu/30e43511745fb2fd8c5bdc9c29d1bd3900392c60.txt",
        "img": "https://archive.orkl.eu/30e43511745fb2fd8c5bdc9c29d1bd3900392c60.jpg"
    }
}