{
    "id": "4991daa0-917d-4d3b-8e0b-a817e252d719",
    "created_at": "2023-01-12T15:08:10.944451Z",
    "updated_at": "2025-03-27T02:17:05.690457Z",
    "deleted_at": null,
    "sha1_hash": "52ba539c2af44ce23b7d0d552e16f349c0065473",
    "title": "2022-09-23 - GRU- Rise of the (Telegram) MinIOns",
    "authors": "",
    "file_creation_date": "2022-10-02T12:22:11Z",
    "file_modification_date": "2022-10-02T12:22:11Z",
    "file_size": 6563727,
    "plain_text": "# GRU: Rise of the (Telegram) MinIOns\n\n**mandiant.com/resources/blog/gru-rise-telegram-minions**\n\n## Executive Summary\n\nMandiant is tracking multiple self-proclaimed hacktivist groups working in support of\nRussian interests. These groups have primarily conducted distributed denial-of-service\n(DDoS) attacks and leaked stolen data from victim organizations. Although some of\nthese actors are almost certainly operating independently of the Russian state, we\nhave identified multiple so-called hacktivist groups whose moderators we suspect are\neither a front for, or operating in coordination with, the Russian state.\nWe assess with moderate confidence that moderators of the purported hacktivist\nTelegram channels “XakNet Team,” “Infoccentr,” and “CyberArmyofRussia_Reborn” are\ncoordinating their operations with Russian Main Intelligence Directorate (GRU)sponsored cyber threat actors. Our assessment is based in part on the deployment of\nGRU-sponsored APT28 tools on the networks of Ukrainian victims, whose data was\nsubsequently leaked on Telegram within 24 hours of wiping activity by APT28, as well\nas other indicators of inauthentic activity by the moderators and similarities to previous\nGRU information operations.\n\n\n-----\n\nThe war in Ukraine has also presented novel opportunitiesto understand the totality,\ncoordination, and effectiveness of Russia cyber programs, including the use of social\nmedia platforms by threat actors. Additionally, platforms such as Telegram were being\nused pre-invasion to influence perception of the impending Russian military\nmovements and have been employed heavily by both Ukraine and Russia to influence\nboth international and domestic audiences.\n\n## Threat Detail\n\nMandiant is tracking multiple groups claiming to be hacktivists that have targeted Ukraine\nsince the start of the Russian invasion in early 2022. In particular, Mandiant has focused on\nanalyzing a set of self-proclaimed hacktivist groups: XakNet Team, Infoccentr, and\nCyberArmyofRussia_Reborn. Through our analysis, Mandiant has identified new evidence\nconnecting the moderators of these groups to the Russian state, including timeline analysis\nof intrusions and leaks from Ukrainian organizations. In addition to data from Mandiant’s\ncollection, we want to thank our partners Security Service of Ukraine (Cyber Department)\nand Trellix, for their contributions in support of this analysis.\n\nMandiant has also identified limited links between XakNet Team and the pro-Russia socalled “hacktivist” group KillNet, and we assess with moderate confidence that XakNet and\nKillNet have directly coordinated some of their activity. However, we note that the two appear\nto conduct aligned but separate missions, based on the observed activity claimed by each of\nthe \"hacktivist\" groups. While we continue to separately investigate KillNet, this report's\nscope is limited to the three groups we have currently identified as linked to the GRU.\n\n\n-----\n\nFigure 1: Suspected false hacktivist fronts leaked data likely stolen from APT28 wiper victims\n\n## APT28 Wiped Ukrainian Victims Shortly Before Data Leaked on Social Media\n\nWe assess with moderate confidence that threat actors operating the Telegram channels\nXakNet Team, Infoccentr, and CyberArmyofRussia_Reborn are coordinating their operations\nwith GRU-sponsored APT28. This assessment is based primarily on Mandiant’s direct\nobservations of the deployment of wipers used by APT28 on the networks of multiple\nUkrainian organizations and the subsequent leaks of data by threat actors claiming to be\nhacktivists likely originating from those entities on Telegram within 24 hours. We identified at\nleast 16 data leaks from these groups, four of which coincided with wiping attacks by APT28.\n\nMandiant has only observed the use of CADDYWIPER and ARGUEPATCH by APT28,\nalthough we note that others have publicly attributed some CADDYWIPER\ndeployments to Sandworm.\n\n\n-----\n\nIn two incidents, Mandiant observed APT28 conduct wiper attacks, which were\nfollowed, within 24 hours, by data from the victims being leaked on Telegram. In both\ninstances APT28 deployed ARGUEPATCH, which dropped CADDYWIPER.\nTwo additional waves of CADDYWIPER attacks against multiple Ukrainian\norganizations were followed, within 24 hours, by leaks of data from Ukrainian entities\nonto Telegram. In these cases, Mandiant cannot confirm that the organization whose\ndata was leaked were victims of the waves of coordinated wiper activity; however, the\ntiming supports an assessment that they were coordinated.\n\nIn one XakNet data leak, Mandiant discovered a unique technical artifact from an APT28\nintrusion. This indicates APT28 had access to the same parts of the network the leak was\nsourced from.\n\n## XakNet Activity Consistent with Historical APT28 Information Operations\n\nThe three channels we identify in this report have claimed activity leveraging traditional\nhacktivist tactics, such as using distributed denial-of-service (DDoS) attacks, website\ndefacements, and hack-and-leak activity to target their victims. Furthermore, XakNet’s active\nsolicitation of media coverage, in tandem with its self-promoted narrative of being a group\ncomprised of Russian patriotic volunteers, suggests two possible influence objectives: the\ngroups promote Russian interests abroad through their threat activity, and they promote the\nidea of average Russians supporting the government to domestic audiences through their\nclaims to be patriotic volunteers amplified by the Russian media and elsewhere online.\n\nThe Russian intelligence services have an extensive history of using false hacktivist\npersonas to support information operations and disruptive and destructive cyber activity. For\nexample, this is a particularly well-established tactic of APT28 in activity targeting Ukraine\nand elsewhere, prominently including its use in the 2014 compromise, defacement, data\nleak, and destruction of the Ukrainian Central Election Commission’s network and website,\nwhich was claimed by the pro-Russia “hacktivist” group CyberBerkut. However, its most\nfamous instance may be the Guccifer 2.0 false persona APT28 leveraged to interfere in the\n[2016 U.S. presidential election. U.S. Department of Justice indictments related to Russia’s](https://www.justice.gov/file/1080281/download)\ntargeting of the 2016 U.S. presidential election have indicated that multiple GRU units were\ninvolved in that activity, including the unit to which APT28 is attributed (Unit 26165). We note\nthis in recognition that it is possible multiple units within the GRU have likewise been\ninvolved in the activity outlined in this report.\n\nAlthough we assess with moderate confidence that moderators respectively behind XakNet\nTeam, Infoccentr, and CyberArmyofRussia_Reborn are at least coordinating with the GRU,\nwe currently reserve judgement as to the composition of these groups and their exact degree\n\n\n-----\n\nof affiliation with the GRU. However, at a minimum, this coordination is consistent with\nfrequent GRU tactics. While the exact nature of the relationship is unclear, it likely falls into\none of two general possibilities:\n\nGRU officers may directly control the infrastructure associated with these actors and\ntheir activities may be a front for GRU operations, similar to the relationship between\nthe GRU and the false persona Guccifer 2.0.\nThe moderators respectively running these Telegram channels may directly coordinate\nwith the GRU; however, the moderators may be Russian citizens who are not Russian\nintelligence officers. There are multiple possible configurations through which this\ndynamic could manifest, including but not limited to initial GRU support for third parties\nto establish the channels or subsequent links established after initial channel creation.\n\nA review of these channels’ activity shows on-platform engagement by hundreds of users. In\neither of the above outlined scenarios, it seems likely that some or all the users engaged with\nthese channels are Russian-speaking civilians who are not intelligence officers. It is possible\nthat the hundreds of users engaged with these channels are inauthentic, though we judge\nthat to be unlikely.\n\nFigure 2: XakNet Telegram post in which the group disputed pervious public statements from\nMandiant highlighting possible links between XakNet and the Russian Government. The third\nparagraph reads: “But in reality, everything is very simple. IB [information security] does not\n\n\n-----\n\nexist. Everything can be hacked. You can continue to conduct your super-cool investigations\nwithout any proof.”\n\n## XakNet Team Moderators Likely Operate at Behest of the Kremlin\n\n“XakNet Team” is a Russian-language Telegram channel of a self-proclaimed hacktivist\ngroup that has conducted threat activity against Ukraine, including DDoS attacks,\ncompromises and data leaks, and website defacements. The group claims to be comprised\nof Russian patriotic volunteers who formed the group in response to the Anonymous\ncollective’s declaration of war against Russia. The XakNet Team moderators advertise\nmultiple domains and social media channels that we have determined are all controlled by\nthe same group of threat actors. The XakNet Team moderators also claimed involvement in\none of the more notable information operations observed so far in the conflict, when, in early\nMarch, a Ukrainian news organization’s news ticker was defaced during a live TV broadcast\nwith a fake message of Ukraine’s capitulation to Russia attributed to President Zelenskyy.\n\nWe assess with moderate confidence that the moderators of the XakNet Team channel are\ndirectly supported by APT28, based on XakNet’s leak of a technical artifact APT28 employed\nduring the compromise of a Ukrainian network. Given the unique nature of this technical\nartifact, we assess with moderate confidence that the moderators of XakNet Team either are\nGRU intelligence officers or work directly with the GRU APT28 operators conducting on-net\noperations.\n\n## CyberArmyofRussia_Reborn\n\nCyberArmyofRussia_Reborn is a Telegram channel Mandiant has tracked since mid-April\n2022. Mandiant assesses with moderate confidence that the moderators of\nCyberArmyofRussia_Reborn are at least coordinating with APT28 due to the timing of the\nleaks and the group’s connection to Xaknet, although the exact nature of the relationship is\ncurrently unclear. The channel’s apparent goals include defamation, obtaining press, and\ninfluencing policy. CyberArmyofRussia_Reborn moderators have leaked data from victims in\nat least the following industries: data services, local governments, and national governments,\nand the actors have claimed to degrade or deny services within a victim organization through\nDDoS or denial-of-service (DoS) attacks.\n\nIn at least one-third of the data leaks Mandiant identified from\nCyberArmyofRussia_Reborn, we directly or indirectly observed APT28 intrusion\noperations on the same Ukrainian victim's networks within 24 hours preceding the\nleaks.\n\n\n-----\n\nIn several instances, we observed the moderators on this channel leak data in bulk\nincluding all files within a given extension or directory, and/or all files within a given date\nrange. We identified the moderators leaking the following types of information from\nvictims:\n\nFiles/Personally Identifiable Information (PII)\nGeneral military documents\nDomestic policies and documents\n\n\n-----\n\nFigure 3: Screenshot of example instructions for running DDOS scripts on Windows provided\nto their members\n\n\n-----\n\nFigure 4: New logo for the CyberArmyofRussia_Reborn, the text of which reads “People’s\nCyber Army” with a quote notably used by Russia’s President Putin “If a fight is inevitable,\nyou must strike first”\n\n## Infoccentr\n\nOn March 4, a Telegram channel for “Infoccentr” was created, which appears to be dedicated\nto pro-Russia information operations and to fight against anti-Russian or pro-Ukrainian social\nmedia and other information channels. Mandiant assesses with moderate confidence that the\nmoderators of the Infoccentr channel are at least coordinating with APT28 due to the timing\nof the leaks and the group’s connection to XakNet, although we have not yet determined the\n\n\n-----\n\nexact composition of the group. In at least one instance, data that was initially leaked on the\nInfoccentr Telegram page was reposted by XakNet within a few minutes. It is possible this\nwas a coincidence, but the close timing of the repost could indicate a closer relationship.\n\nFigure 5: Infoccentr Telegram page in which the group introduces itself as an “Information\n\n\n-----\n\nand Coordination Center and announces its operations against Ukraine and Western\nsupporters\n\n## Outlook\n\nMandiant is continuing to explore the relationship between the respective moderators of\nXakNet Team, Infoccentr, and CyberArmyofRussia_Reborn. Identifying the connections\nbetween so-called hacktivists and Russian espionage or attack groups can help victims\nassess risk when compromised, allow customers to prepare for the potential leak of their\ndata, and potentially mitigate some effects. While we assess with moderate confidence that\nAPT28 at least coordinates with the moderators of at least the three channels we identified in\nthis report, potentially sharing or driving operations, it is also possible that the GRU or other\nRussian Intelligence Services are also coordinating with other self-professed hacktivist\ngroups to target entities both within and surrounding Ukraine. As we continue to expand our\nknowledge of the actors behind recently emerged and longstanding channels such as\nKillNet, FromRussiaWithLove (FRWL), DeadNet, Beregini, JokerDNR (alternate spelling:\nJokerDPR), and RedHackersAlliance, Mandiant will continue to update our assessment on\nassociations and drivers behind the actions and activities of these groups.\n\nRussia’s February 2022 invasion of Ukraine created unprecedented circumstances for cyber\nthreat activity. This likely is the first instance in which a major cyber power potentially has\nconducted disruptive attacks, espionage, and information operations concurrently with\nwidespread, kinetic military operations in a conventional war. We have never previously\nobserved such a volume of cyberattacks, variety of threat actors, and coordination of effort\nwithin the same several months. We assess with high confidence that Russian cyber\nespionage and attack operations, while already a serious threat to Ukrainian organizations,\npose an elevated risk to Ukraine as long as Russia continues its invasion.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-23 - GRU- Rise of the (Telegram) MinIOns.pdf"
    ],
    "report_names": [
        "2022-09-23 - GRU- Rise of the (Telegram) MinIOns.pdf"
    ],
    "threat_actors": [
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0bce7575-ba34-4742-afb7-a4d3ade12dbe",
            "created_at": "2023-11-14T02:00:07.091122Z",
            "updated_at": "2025-03-27T02:00:03.221412Z",
            "deleted_at": null,
            "main_name": "XakNet",
            "aliases": [
                "UAC-0100",
                "UAC-0106"
            ],
            "source_name": "MISPGALAXY:XakNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "132e1e0f-8725-42cb-8c2d-d2f3ebb1f005",
            "created_at": "2023-12-08T02:00:05.758552Z",
            "updated_at": "2025-03-27T02:00:03.267631Z",
            "deleted_at": null,
            "main_name": "UAC-0118",
            "aliases": [
                "FRwL",
                "FromRussiaWithLove"
            ],
            "source_name": "MISPGALAXY:UAC-0118",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536090,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1664713331,
    "ts_modification_date": 1664713331,
    "files": {
        "pdf": "https://archive.orkl.eu/52ba539c2af44ce23b7d0d552e16f349c0065473.pdf",
        "text": "https://archive.orkl.eu/52ba539c2af44ce23b7d0d552e16f349c0065473.txt",
        "img": "https://archive.orkl.eu/52ba539c2af44ce23b7d0d552e16f349c0065473.jpg"
    }
}