{
    "id": "49adbab4-b3d1-442b-a2a2-5615c64437aa",
    "created_at": "2023-01-12T15:01:09.652002Z",
    "updated_at": "2025-03-27T02:05:47.254362Z",
    "deleted_at": null,
    "sha1_hash": "27394832be57d3b55574502c7a76656c9f53a804",
    "title": "2020-10-02 - Alert Number I-100220-PSA- Spoofed Internet Domains and Email Accounts Pose Cyber and Disinformation Risks to Voters",
    "authors": "",
    "file_creation_date": "2022-05-28T00:38:24Z",
    "file_modification_date": "2022-05-28T00:38:24Z",
    "file_size": 117442,
    "plain_text": "# Spoofed Internet Domains and Email Accounts Pose Cyber and Disinformation Risks to Voters\n\n**ic3.gov/media/2020/201002.aspx**\n\n## October 02, 2020 (2020-10-02T11:30:00-04:00)\n\nAlert Number\n\n## I-100220-PSA\n\nQuestions regarding this PSA should be directed to your local FBI Field Office.\n\nLocal Field Office Locations: [www.fbi.gov/contact-us/field-offices](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n\n_The FBI and CISA are issuing this PSA as a part of a series on threats to the 2020 election_\n_to enable the American public to be prepared, patient, and participating voters._\n\nThe Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security\nAgency (CISA) are issuing this announcement to help the public recognize and avoid\nspoofed election-related internet domains and email accounts during the 2020 election year.\n\nSpoofed domains and email accounts are leveraged by foreign actors and cybercriminals\nand can be easily mistaken for legitimate websites or emails. Adversaries can use spoofed\ndomains and email accounts to disseminate false information; gather valid usernames,\npasswords, and email addresses; collect personally identifiable information; and spread\nmalware, leading to further compromises and potential financial losses.\n\nCyber actors set up spoofed domains with slightly altered characteristics of legitimate\ndomains. A spoofed domain may feature an alternate spelling of a word (\"electon\" instead\nof \"election\"), or use an alternative top-level domain, such as a \"[.]com\" version of a\nlegitimate \"[.] gov\" website. Members of the public could unknowingly visit spoofed domains\n\n\n-----\n\nwhile seeking information regarding the 2020 election. Additionally, cyber actors may use a\nseemingly legitimate email account to entice the public into clicking on malicious files or\nlinks.\n\nThe FBI and CISA urge all members of the American public to critically evaluate the websites\nthey visit and the emails sent to their personal and business email accounts, to seek out\nreliable and verified information on election information.\n\nRecommendations\n\nVerify the spelling of web addresses, websites, and email addresses that look\ntrustworthy but may be close imitations of legitimate election websites.\nSeek out information from trustworthy sources, verifying who produced the content and\n[considering their intent. The Election Assistance Commission (https://www.eac.gov)](https://www.ic3.gov/Home/Egress?url=https://www.eac.gov/)\nprovides a vast amount of verified information and resources.\nEnsure operating systems and applications are updated to the most current versions.\nUpdate anti-malware and anti-virus software and conduct regular network scans.\nDo not enable macros on documents downloaded from an email unless absolutely\nnecessary, and only then, after ensuring the file is not malicious.\nDisable or remove unneeded software applications.\nUse strong two-factor authentication if possible, via biometrics, hardware tokens, or\nauthentication apps.\nDo not open e-mails or attachments from unknown individuals. Do not communicate\nwith unsolicited e-mail senders.\nNever provide personal information of any sort via e-mail. Be aware that many e-mails\nrequesting your personal information appear to be legitimate.\n\n**The FBI is responsible for investigating and prosecuting election crimes, malign**\n**foreign influence operations, and malicious cyber activity targeting election**\n**infrastructure and other U.S. democratic institutions. CISA helps critical infrastructure**\nowners and operators, including those in the election community, remain resilient against\nphysical and cyber threats. The FBI and CISA provide services and information to uphold the\nsecurity, integrity, and resiliency of U.S. electoral processes.\n\nVictim Reporting and Additional Information\n\nThe FBI encourages the public to report information concerning suspicious or criminal\n[activity to their local field office (www.fbi.gov/contact-us/field-offices) or to the FBI's Internet](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n[Crime Complaint Center (www.ic3.gov). For additional assistance, best practices, and](https://www.ic3.gov/)\ncommon terms, please visit the following websites:\n\nProtected Voices: www.fbi.gov/investigate/counterintelligence/foreigninfluence/protected-voices\nElection Crimes and Security: www.fbi.gov/scams-and-safety/common-scams-andcrimes/election-crimes-and-security\n[#Protect2020: www cisa gov/protect2020](https://www.ic3.gov/Home/Egress?url=https://www.cisa.gov/protect2020)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-02 - Alert Number I-100220-PSA- Spoofed Internet Domains and Email Accounts Pose Cyber and Disinformation Risks to Voters.pdf"
    ],
    "report_names": [
        "2020-10-02 - Alert Number I-100220-PSA- Spoofed Internet Domains and Email Accounts Pose Cyber and Disinformation Risks to Voters.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535669,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653698304,
    "ts_modification_date": 1653698304,
    "files": {
        "pdf": "https://archive.orkl.eu/27394832be57d3b55574502c7a76656c9f53a804.pdf",
        "text": "https://archive.orkl.eu/27394832be57d3b55574502c7a76656c9f53a804.txt",
        "img": "https://archive.orkl.eu/27394832be57d3b55574502c7a76656c9f53a804.jpg"
    }
}