{
    "id": "49be2b53-6505-4af6-a0aa-ea8d194a044e",
    "created_at": "2023-01-12T15:08:48.340002Z",
    "updated_at": "2025-03-27T02:05:56.908498Z",
    "deleted_at": null,
    "sha1_hash": "b20741713f00a9a36b94fc391619b16083222428",
    "title": "2021-05-17 - Bizarro banking Trojan expands its attacks to Europe",
    "authors": "",
    "file_creation_date": "2022-05-28T02:05:05Z",
    "file_modification_date": "2022-05-28T02:05:05Z",
    "file_size": 1549187,
    "plain_text": "# Bizarro banking Trojan expands its attacks to Europe\n\n**[securelist.com/bizarro-banking-trojan-expands-its-attacks-to-europe/102258/](https://securelist.com/bizarro-banking-trojan-expands-its-attacks-to-europe/102258/)**\n\nAuthors\n\nGReAT\n\nBizarro is yet another banking Trojan family originating from Brazil that is now found in other\nregions of the world. We have seen users being targeted in Spain, Portugal, France and\n**Italy. Attempts have now been made to steal credentials from customers of 70 banks**\n**from different European and South American countries. Following in the footsteps of**\n[Tetrade, Bizarro is using affiliates or recruiting money mules to operationalize their attacks,](https://securelist.com/the-tetrade-brazilian-banking-malware/97779/)\ncashing out or simply to helping with transfers. In this article we analyse the technical\nfeatures of the Trojan’s components, giving a detailed overview of obfuscation techniques,\nthe infection process and subsequent functions, as well as the social engineering tactics\nused by the cybercriminals to convince their victims to give away their personal online\nbanking details.\n\nBizarro has x64 modules and is able to trick users into entering two-factor authentication\ncodes in fake pop-ups. It may also use social engineering to convince victims to download a\nsmartphone app. The group behind Bizzaro uses servers hosted on Azure and Amazon\n(AWS) and compromised WordPress servers to store the malware and collect telemetry.\n\n\n-----\n\n## Bizarreland\n\nBizarro is distributed via MSI packages downloaded by victims from links in spam emails.\nOnce launched, Bizarro downloads a ZIP archive from a compromised website. While writing\nthis article, we saw hacked WordPress, Amazon and Azure servers used for storing archives.\nThe MSI installer has two embedded links – which one is chosen depends on the victim’s\nprocessor architecture.\n\n**_Typical malicious message sent by Bizarro operators_**\n\nThe downloaded ZIP archive contains the following files:\n\nA malicious DLL written in Delphi;\nA legitimate executable that is an AutoHotkey script runner (in some samples AutoIt is\nused instead of AutoHotkey);\nA small script that calls an exported function from the malicious DLL.\n\nThe DLL exports a function that contains the malicious code. The malware developers have\nused obfuscation to complicate code analysis. The code of the exported functions have been\nremoved by the protector. The bytes that belong to the exported functions are restored by the\nDLL entry point function at runtime. This entry point function is heavily obfuscated. The tricks\nused to complicate analysis consist of constant unfolding and junk code insertion. As for the\nmalware developers, they are constantly improving the protection of the binaries. In earlier\nversions of Bizarro, only the entry point function was protected, while in more recent samples\nthe protector is also used to obscure calls of the imported API functions.\n\n\n-----\n\nWhen Bizarro starts, it first kills all the browser processes to terminate any existing sessions\nwith online banking websites. When a user restarts the browsers, they will be forced to reenter the bank account credentials, which will be captured by the malware. Another step\nBizarro takes in order to get as many credentials as possible is to disable autocomplete in a\nbrowser.\n\nBizarro gathers the following information about the system on which it is running:\n\nComputer name;\nOperating system version;\nDefault browser name;\nInstalled antivirus software name.\n\nBizarro uses the ‘Mozilla/4.0 (compatible;MSIE 6.0; Windows NT 5.0′ user agent while\nsending the POST request. This user agent has typos: there should be a space symbol after\nthe compatible; substring and the closing bracket is missing. Our research shows that this\nmistake has not been fixed in the latest versions. After that, Bizarro creates an empty file in\nthe %userprofile% directory, thus marking the system as infected. The name of the file is the\nname of the script runner (AutoIt or AutoHotKey) with the .jkl extension appended to it.\n\nHaving sent the data to the telemetry server, Bizarro initializes the screen capturing module.\nIt loads the magnification.dll library and gets the address of the deprecated\n**MagSetImageScalingCallback API function. With its help, the Trojan can capture the**\nscreen of a user and also constantly monitor the system clipboard, looking for a Bitcoin\nwallet address. If it finds one, it is replaced with a wallet belonging to the malware\ndevelopers.\n\nThe backdoor is the core component of Bizarro: it contains more than 100 commands and\nallows the attackers to steal online banking account credentials. Most of the commands are\nused to display fake pop-up messages to users. The core component of the backdoor\ndoesn’t start until Bizarro detects a connection to one of the hardcoded online banking\nsystems. The malware does this by enumerating all the windows, collecting their names.\nWhitespace characters, letters with accents (such as ñ or á) and non-letter symbols such as\ndashes are removed from the window name strings. If a window name matches one of the\nhardcoded strings, the backdoor continues starting up.\n\nThe first thing the backdoor does is remove the DNS cache by executing the ipconfig\n_/flushdns command. This is done in order to prevent connecting to a blocked IP. After that,_\nthe malware resolves the domain name to an IP address, creates a socket and binds it to the\nresolved address. If the connection was successful, it creates the %userprofile%\\bizarro.txt\nfile.\n\n## The Backdoor and its C2\n\n\n-----\n\nThe commands that Bizarro receives from its C2 can be divided into the following categories:\n\n**Commands that allow the C2 operators to get data about the victim and manage**\n**the connection status**\n\nThe <|PT|> command sends the environment information to the C2: Bizarro’s version,\nOS name, computer name, Bizarro’s unique identifier, installed antivirus software and\nthe codename used for the bank that has been accessed. The codenames are bank\n[names written in leetspeak.](https://en.wikipedia.org/wiki/Leet)\n\n**Commands that allow attackers to control the files located on the victim’s hard**\n**drive**\n\nThe <|DownloadFile|> command downloads files to the victim’s computer, while the\n**<|UploadFile|> command allows attackers to fetch files from the client machine. The**\n**<|Folder|> and <|File|> commands allow the attackers to search for folders and files**\nwhich have a given mask.\n\n**Commands that allow attackers to control the user’s mouse and keyboard**\n\nThe <|SuaykRJ|> command performs a left mouse button click at the designated\nlocation. The <|SuaykJI|> command performs a double click at the given location,\nwhile the <|IXjzwtR|> command performs a right mouse button click. The <|ztUjzwtR|>\ncommand moves the mouse to a designated location. The syntax of these three\ncommands is <|command name|>x coordinate<|>y coordinate<<|.\n\nBizarro can also manipulate the user’s keyboard (what the user actually types) with the\nhelp of the carmena command.\n\n**Commands that allow the attackers to control the backdoor operation, shut**\n**down, restart or destroy the operating system and limit the functionality of**\n**Windows**\n\nThe LkingWajuGhkzwu command shuts the backdoor down, while the vkbAlcvtlY\ncommand drops a BAT file in the working directory. The batch script is responsible for\ndeleting the malware from disk.\n\n**Commands that log keystrokes**\n\nBizarro supports two commands that are responsible for keylogging. The COZUMEL\ncommand starts the logging process, while the COZUMARIA command stops it.\n\n\n-----\n\n**Commands that perform social engineering attacks**\n\nThese commands display various messages that trick users into giving attackers\naccess to the bank account. The type of messages displayed vary from simple\nmessage boxes to well-designed windows with bank logs on them.\n\nWe will first describe commands that show Windows message boxes. The dkxqdpdv\ncommand displays an error message with the text: “Los datos ingresados son\n_incorrectos, por favor intente nuevamente.” (English: “The data entered is incorrect,_\n_please try again.”)_\n\n**_Bizarro shows a message telling the user to enter the requested data again_**\n\nThe vanessa command displays an error message which tells the user to enter confirmation\ninformation. To further convince the user that all operations are legitimate, the malware\ndisplays the RUT (Rol Único Tributario, a Chilean ID number) and the value that was\nsupplied earlier. The message has the following text:\n\n\n-----\n\n**_Error message asking the user to enter a confirmation code_**\n\nThe LMAimwc command displays another error message. This time it tells the user that their\ncomputer needs to be restarted in order to finish a security-related operation. Bizarro\ndisplays the following text:\n\n**_Error message telling the user that the operating system will be restarted_**\n\nThe most interesting messages that Bizarro displays are those that try to mimic online\nbanking systems. To display such messages, Bizarro needs to download a JPEG image that\ncontains the bank logo and instructions the victim needs to follow. These images are stored\nin the user profile directory in an encrypted form. Before an image is used in a message, it is\ndecrypted with a multi-byte XOR algorithm. As the messages are downloaded from the C2\nserver, they can be found only on the victims’ machines.\n\nThe first type of custom messages that Bizarro may show are messages that freeze the\nvictim’s machine, thus allowing the attackers to gain some time. When a command to display\na message like this is received, the taskbar is hidden, the screen is greyed out and the\nmessage itself is displayed. While the message is shown, the user is unable to close it or\nopen Task Manager. The message itself tells the user either that the system is compromised\nand thus needs to be updated or that security and browser performance components are\nbeing installed. This type of message also contains a progress bar that changes over time.\n\nThe images below show what these messages look like on the screens of victims, with\nmessages written in Spanish:\n\n\n-----\n\n**_Bizarro blocking a bank login page and telling the user that security updates are being_**\n**_installed_**\n\nThe following two messages try to convince the victim that their system is compromised. In\nmost of them, Bizarro tells the user not to worry about any transactions that occur during the\n“security update” as they are only confirming the identity of the client. This makes clients feel\nmore confident about approving all the transactions requested by the attackers.\n\n\n-----\n\n**_Messages telling the user that their system is compromised_**\n\nBizarro also tries to lure victims into sending two-factor authentication codes to the attackers.\nAnother interesting feature we have seen entails an attempt to convince the victim to install a\nmalicious app on their smartphone. It uses the following windows to determine the type of\nmobile operating system:\n\n\n-----\n\n**_Bizarro asks the user to choose the operating system of their smartphone_**\n\nIf the victim chooses Android, the C2 server will send a link with a malicious application to\nthe client. The client will make a QR code out of it with the help of the Google Charts API. It\nsends a request with the following arguments:\n\n1 http://chart.apis.google.com/chart?chs=<QR code width>x<QR code\nheight>&cht=qr&chld=<error correction level>&chl=<link to the application>\n\nThe obtained QR code is then shown in a window with the following text:\n\n**_Bizarro asking the user to scan the QR code_**\n\n## Attack scenario\n\nWith the help of the commands that the Bizarro developers have included in the Trojan,\nadversaries may stage an attack with the following scenario:\n\n\n-----\n\n**_Infection scheme used by Bizarro_**\n\nAccording to the list of supported banks, the threat actor behind Bizarro is targeting clients of\nvarious banks from Europe and South America. Based on our telemetry, we’ve seen victims\nof Bizarro in different countries, including Brazil, Argentina, Chile, Germany, Spain, Portugal,\nFrance and Italy. These statistics again prove the fact that Bizarro’s operators have\nexpanded their interest from Brazil to other countries in South America and Europe.\n\n\n-----\n\n**_Distribution of Bizarro detections in the last 12 months_**\n\n## Conclusion\n\nWe’ve recently seen several banking Trojans from South America (such as Guildma, Javali,\nMelcoz, Grandoreiro and Amavaldo) expanding their operations to other regions, mainly\nEurope. Bizarro is yet another example of this. The threat actors behind this campaign are\nadopting various technical methods to complicate malware analysis and detection, as well as\nsocial engineering tricks that can help convince victims to provide personal data related to\ntheir online banking accounts.\n\nKaspersky products detect this family as Trojan-Banker.Win32.Bizarro or Trojan**Banker.Win64.Bizarro. All the details, IoCs, MITRE ATT&CK Framework data, Yara rules**\n[and hashes relating to this threat are available to users of our Financial Threat Intel services.](https://www.kaspersky.com/enterprise-security/threat-intelligence)\nTo learn more about threat hunting and malware analysis from Kaspersky’s GReAT experts,\ncheck out [http://xtraining.kaspersky.com](http://xtraining.kaspersky.com/)\n\n\n-----\n\n## Indicators of compromise\n\n**Reference MD5 hashes**\n\n[e6c337d504b2d7d80d706899d964ab45](https://opentip.kaspersky.com/e6c337d504b2d7d80d706899d964ab45/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[daf028ddae0edbd3d7946bb26cf05fbf](https://opentip.kaspersky.com/daf028ddae0edbd3d7946bb26cf05fbf/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[5184776f72962859b704f7cc370460ea](https://opentip.kaspersky.com/5184776f72962859b704f7cc370460ea/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[73472698fe41df730682977c8e751a3e](https://opentip.kaspersky.com/73472698fe41df730682977c8e751a3e/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[7a1ce2f8f714367f92a31da1519a3de3](https://opentip.kaspersky.com/7a1ce2f8f714367f92a31da1519a3de3/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[0403d605e6418cbdf8e946736d1497ad](https://opentip.kaspersky.com/0403d605e6418cbdf8e946736d1497ad/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[d6e4236aaade8c90366966d59e735568](https://opentip.kaspersky.com/d6e4236aaade8c90366966d59e735568/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n\n-----\n\n[a083d5ff976347f1cd5ba1d9e3a7a4b3](https://opentip.kaspersky.com/a083d5ff976347f1cd5ba1d9e3a7a4b3/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[b0d0990beefa11c9a78c701e2aa46f87](https://opentip.kaspersky.com/b0d0990beefa11c9a78c701e2aa46f87/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[38003677bfaa1c6729f7fa00da5c9109](https://opentip.kaspersky.com/38003677bfaa1c6729f7fa00da5c9109/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Brazil](https://securelist.com/tag/brazil/)\n[Financial malware](https://securelist.com/tag/financial-malware/)\n[Keyloggers](https://securelist.com/tag/keyloggers/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Social engineering](https://securelist.com/tag/social-engineering/)\n[Trojan Banker](https://securelist.com/tag/trojan-banker/)\n\nAuthors\n\nGReAT\n\nBizarro banking Trojan expands its attacks to Europe\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-17 - Bizarro banking Trojan expands its attacks to Europe.pdf"
    ],
    "report_names": [
        "2021-05-17 - Bizarro banking Trojan expands its attacks to Europe.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1653703505,
    "ts_modification_date": 1653703505,
    "files": {
        "pdf": "https://archive.orkl.eu/b20741713f00a9a36b94fc391619b16083222428.pdf",
        "text": "https://archive.orkl.eu/b20741713f00a9a36b94fc391619b16083222428.txt",
        "img": "https://archive.orkl.eu/b20741713f00a9a36b94fc391619b16083222428.jpg"
    }
}