{
    "id": "49dc108c-4be5-4b56-9803-059857195d65",
    "created_at": "2023-01-12T14:59:58.954592Z",
    "updated_at": "2025-03-27T02:08:40.741887Z",
    "deleted_at": null,
    "sha1_hash": "4fd41532d39977214d3f4140e5ce3b1b78381124",
    "title": "2018-12-05 - STOLEN PENCIL Campaign Targets Academia",
    "authors": "",
    "file_creation_date": "2022-05-28T21:58:20Z",
    "file_modification_date": "2022-05-28T21:58:20Z",
    "file_size": 107631,
    "plain_text": "# STOLEN PENCIL Campaign Targets Academia\n\n**asert.arbornetworks.com/stolen-pencil-campaign-targets-academia/**\n\nby [ASERT Team on December 5th, 2018](https://www.netscout.com/blog/asert/asert-team)\n\n## Executive Summary\n\nASERT has learned of an APT campaign, possibly originating from DPRK, we are calling STOLEN PENCIL that is targeting academic\ninstitutions since at least May 2018. The ultimate motivation behind the attacks is unclear, but the threat actors are adept at scavenging for\ncredentials. Targets are sent spear phishing e-mails that lead them to a web site displaying a lure document and are immediately prompted to\ninstall a malicious Google Chrome extension. Once gaining a foothold, the threat actors use off-the-shelf tools to ensure persistence,\nincluding Remote Desktop Protocol (RDP) to maintain access.\n\n**_NOTE: NetScout AED/APS enterprise security products detect, and block activity related to STOLEN PENCIL using our ATLAS Intelligence_**\n_Feed (AIF)._\n\n## Key Findings\n\nA wide variety of phishing domains imply other targets, but those focused on academia were intended to install a malicious Chrome\nextension.\nA large number of the victims, across multiple universities, had expertise in biomedical engineering, possibly suggesting a motivation for\nthe attackers targeting.\nPoor OPSEC led to users finding open web browsers in Korean, English-to-Korean translators open, and keyboards switched to Korean\n.\nThe threat actors use built-in Windows administration tools and commercial off-the-shelf software to “live off the land”. The threat actor\nat the keyboard uses RDP to access compromised systems rather than a backdoor or Remote Access Trojan (RAT).\nPost-exploitation persistence is maintained by harvesting passwords from a wide variety of sources such as process memory, web\nbrowsers, network sniffing, and keyloggers.\nThere is no evidence of data theft, leaving the motivation behind STOLEN PENCIL largely uncertain.\n\n## Spear Phishing\n\nThreat Chain In keeping with tried and true tactics, the operators behind the STOLEN PENCIL campaign used spearphishing as their initial intrusion vector (left Figure 1). First reported by Twitter user @MD0ugh, a target of\nSTOLEN PENCIL receives a spear-phishing message containing a link to one of several domains controlled\nby the threat actor. We’ve identified several domains used for phishing (below). client-message[.]com\n\nworld-paper[.]net\ndocsdriver[.]com\ngrsvps[.]com\ncoreytrevathan[.]com\ngworldtech[.]com\n\nIn addition to the Top-Level Domains (TLDs), we’ve uncovered a number of sub-domains used by the actors\n(below):\n\naswewd.docsdriver[.]com\nfacebook.docsdriver[.]com\nfalken.docsdriver[.]com\nfinder.docsdriver[.]com\ngovernment.docsdriver[.]com\nkeishancowan.docsdriver[.]com\nkorean-summit.docsdriver[.]com\nmofa.docsdriver[.]com\nnorthkorea.docsdriver[.]com\no365.docsdriver[.]com\nobservatoireplurilinguisnorthkorea.docsdriver[.]com\noodwd.docsdriver[.]com\ntwitter.docsdriver[.]com\nwhois.docsdriver[.]com\nwww.docsdriver[.]com\n\nMany of the subdomains contain basic phishing pages, consisting of saved HTML of common web login properties. Some of the pages\ncontain the “MarkOfTheWeb” artifact inserted by the web browser when the threat actor clicked “Save As” on the page they intend to\n[impersonate. RiskIQ discussed this technique, although we do not believe the campaigns are related. The more sophisticated phishing pages](https://www.riskiq.com/blog/labs/markoftheweb/)\n\n\n-----\n\ntargeting academia display a benign PDF in an IFRAME. It then redirects the user to install a Font Manager extension from the Chrome\nWeb Store, as seen in Figure 2.\n\n\nHTML Source of Phishing Page\n\n\n**Figure 2: HTML Source of Phishing Page The malicious extensions, now removed from the Chrome Web Store, contain reviews left by the**\nthreat actor using compromised Google+ accounts. The text of the reviews were copy/pasted from other extensions and were all rated “fivestars”, even if the copied text was negative. It’s likely the compromised accounts used to leave reviews were from individuals the threat actors\nassume the target would know and trust. It should be noted however, that some users reported deleting the extension immediately because it\nprevented the Chrome browser from functioning properly. This could suggest mistakes or poorly written code that utilized too many\nresources to remain functional and stealthy, at least for some users. The malicious Chrome extensions declare permissions to run on every\nURL in the browser, as seen in Figure 3.\n\n\n-----\n\nmanifest.json with <all_urls>\n\n\n**Figure 3: manifest.json with <all_urls> The extensions load JavaScript from a separate site, shown in Figure 4. The name of the loaded**\nJavaScript file is jQuery.js. When retrieving this file at the time of our analysis, the content was a legitimate jQuery file. We speculate that the\nattacker replaced the malicious JavaScript with a benign payload to deter analysis. Loading jQuery.js from an external site makes no sense,\nsince the latest version of extension has a legitimate jQuery.js included in the extension bundle.\n\n\n-----\n\n**manage.js snippet, beautified**\n\n\n**Figure 4: Given the threat actor’s propensity for password theft, and the fact that the malicious Chrome extensions were situated to read data**\nfrom every website, it's likely that the intent is to steal browser cookies and passwords. Email forwarding was also observed on some\ncompromised accounts. While GDPR requirements prevented us from pivoting on Registrant information, the actors reused IP space, reused\na certificate, and the aforementioned domain mimicking technique allowed for some pivoting. A variety of infrastructure was discovered.\nThose IOCs are included below.\n\n## Toolset\n\nOnce gaining a foothold on a user’s system, the threat actors behind STOLEN PENCIL use Microsoft’s Remote Desktop Protocol (RDP) for\nremote point-and-click access. This means a human is behind the keyboard interacting with a compromised system, and not using a RAT\n(Remote Access Trojan) with a command-and-control site acting as a proxy between the threat actor and the compromised system. RDP\naccess occurred daily from 06:00-09:00 UTC (01:00-04:00 EST). In one case, we noted that the threat actor changed the victim’s keyboard\nlayout to Korean. A compromised or stolen certificate was used to sign several PE files used in STOLEN PENCIL for two sets of tools:\n\n\n-----\n\nMECHANICAL\n\nLogs keystrokes to %userprofile%\\appdata\\roaming\\apach.{txt,log} and also functions as a “cryptojacker” that replaces Ethereum\nwallet addresses with 0x33883E87807d6e71fDc24968cefc9b0d10aC214E. This Ethereum wallet address currently has a zero\nbalance and no transactions.\nGREASE\n\na tool to add a Windows administrator account with a specific username/password and enable RDP, circumventing any firewall\nrules. We’ve observed the following list of username/password combinations, though the significance of “1215” is unknown:\n\nLocalAdmin/Security1215!\ndieadmin1/waldo1215!\ndnsadmin/waldo1215!\nDefaultAccounts/Security1215!\ndefaultes/1qaz2wsx#EDC\n\nThe certificate chain used in the majority of both MECHANICAL and GREASE samples is shown in Figure 5.\n\nCertificate used to sign MECHANICAL/GREASE **Figure 5:**\n\n**Certificate used to sign MECHANICAL/GREASE While the threat actors did use a few tools to automate intrusions, we also found a ZIP**\narchive of tools that demonstrate their propensity for password theft to propagate. Inside the archive we found the following tools:\n\nKPortScan – a GUI-based portscanner\nPsExec – a tool to remotely execute commands on Windows systems\nBatch files for enabling RDP and bypassing firewall rules\nProcdump – a tool to dump process memory, along with a batch file to dump the lsass process for password extraction\nMimikatz – a tool to dump passwords and hashes\nThe Eternal suite of exploits, along with batch files for rapid scanning and exploitation\nNirsoft Mail PassView – a tool to dump saved mail passwords\nNirsoft Network Password Recovery – a tool to dump saved Windows password\nNirsoft Remote Desktop PassView – a tool to dump saved RDP passwords\nNirsoft SniffPass – a tool to sniff the network for passwords sent over insecure protocols\nNirsoft WebBrowserPassView – a tool to dump passwords stored in a variety of browsers\n\nClearly this toolset can be used to scavenge passwords stored in a wide array of locations. Using a combination of stolen passwords,\nbackdoor accounts, and a forced-open RDP service, the threat actors are likely to retain a foothold on a compromised system.\n\n## Recommendations\n\nAdvise users not to click on any suspicious links in an e-mail, both at work and at home, even if they are from people they trust.\nAdvise users to be wary of any prompts to install browser extensions, even if they are hosted on an official extension site.\nWatch for e-mails containing links to the phishing domains.\nLimit RDP access with a firewall to only those systems that require it. Monitor for suspicious RDP connections where there should be\nnone.\nLook for suspicious newly created administrative accounts\n\n\n-----\n\n## Conclusion\n\nWhile we were able to gain insight into the threat actor’s TTPs (Tools, Techniques, & Procedures) behind STOLEN PENCIL, this is clearly just\na small window into their activity. Their techniques are relatively basic, and much of their toolset consists of off-the-shelf programs and living\noff the land. This, along with the presence of the cryptojacker, is typical of DPRK tradecraft. Additionally, the operators’ poor OPSEC\nexposes their Korean language, in both viewed websites and keyboard selections. They spent significant time and resources doing\nreconnaissance on their targets, as evidenced by the comments left on the Chrome extension page. Their main goal appears to be gaining\naccess to compromised accounts and systems via stolen credentials and holding on to it. We were not able to find any evidence of data theft\n– their motives for targeting academia remains murky.\n\n## IOCs\n\nMECHANICAL hashes 9d1e11bb4ec34e82e09b4401cd37cf71 8b8a2b271ded23c40918f0a2c410571d GREASE hashes\n2ec54216e79120ba9d6ed2640948ce43 6a127b94417e224a237c25d0155e95d6 fd14c377bf19ed5603b761754c388d72\n1d6ce0778cabecea9ac6b985435b268b ab4a0b24f706e736af6052da540351d8 f082f689394ac71764bca90558b52c4e\necda8838823680a0dfc9295bdc2e31fa 1cdb3f1da5c45ac94257dbf306b53157 2d8c16c1b00e565f3b99ff808287983e\n5b32288e93c344ad5509e76967ce2b18 4e0696d83fa1b0804f95b94fc7c5ec0b af84eb2462e0b47d9595c21cf0e623a5\n75dd30fd0c5cf23d4275576b43bbab2c 98de4176903c07b13dfa4849ec88686a 09fabdc9aca558bb4ecf2219bb440d98\n1bd173ee743b49cee0d5f89991fc7b91 e5e8f74011167da1bf3247dae16ee605 0569606a0a57457872b54895cf642143\n52dbd041692e57790a4f976377adeade DOMAINS: bizsonet.ayar[.]biz bizsonet[.]com client-message[.]com client-screenfonts[.]com\n*.coreytrevathan[.]com (possibly compromised legitimate site) docsdriver[.]com grsvps[.]com *.gworldtech[.]com (possibly compromised\nlegitimate site) itservicedesk[.]org pqexport[.]com scaurri[.]com secozco[.]com sharedriver[.]pw sharedriver[.]us tempdomain8899[.]com\nworld-paper[.]net zwfaxi[.]com IPs: 104.148.109[.]48 107.175.130[.]191 132.148.240[.]198 134.73.90[.]114 172.81.132[.]211\n173.248.170[.]149 5.196.169[.]223 74.208.247[.]127 92.222.212[.]0\n\nPosted In\n\nAdvanced Persistent Threats\nIndicators of Compromise\nthreat analysis\n\n## Subscribe\n\n_Sign up now to receive the latest notifications and updates from NETSCOUT's ASERT._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-05 - STOLEN PENCIL Campaign Targets Academia.pdf"
    ],
    "report_names": [
        "2018-12-05 - STOLEN PENCIL Campaign Targets Academia.pdf"
    ],
    "threat_actors": [
        {
            "id": "a02bb810-5dd2-46c1-a609-b44d984d96d0",
            "created_at": "2022-10-25T15:50:23.505735Z",
            "updated_at": "2025-03-27T02:00:55.487109Z",
            "deleted_at": null,
            "main_name": "Stolen Pencil",
            "aliases": [
                "Stolen Pencil"
            ],
            "source_name": "MITRE:Stolen Pencil",
            "tools": [
                "Mimikatz",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535598,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653775100,
    "ts_modification_date": 1653775100,
    "files": {
        "pdf": "https://archive.orkl.eu/4fd41532d39977214d3f4140e5ce3b1b78381124.pdf",
        "text": "https://archive.orkl.eu/4fd41532d39977214d3f4140e5ce3b1b78381124.txt",
        "img": "https://archive.orkl.eu/4fd41532d39977214d3f4140e5ce3b1b78381124.jpg"
    }
}