{
    "id": "49e2e330-f88a-4dd7-b1ad-2acfc1c5e9e3",
    "created_at": "2023-01-12T15:10:33.079807Z",
    "updated_at": "2025-03-27T02:06:09.341558Z",
    "deleted_at": null,
    "sha1_hash": "773dd490df1ae195b9592cc4941b0ff2659c8d2a",
    "title": "2021-05-20 - Ransomware-as-a-Service, Rogue Affiliates, and What’s Next",
    "authors": "",
    "file_creation_date": "2022-05-27T21:37:59Z",
    "file_modification_date": "2022-05-27T21:37:59Z",
    "file_size": 212422,
    "plain_text": "# Ransomware-as-a-Service, Rogue Affiliates, and What’s Next\n\n**[digitalshadows.com/blog-and-research/ransomware-as-a-service-rogue-affiliates-and-whats-next/](https://www.digitalshadows.com/blog-and-research/ransomware-as-a-service-rogue-affiliates-and-whats-next/)**\n\nMay 20, 2021\n\n[Generating a chain of unforeseen events, the Colonial Pipeline ransomware attack has](https://www.digitalshadows.com/blog-and-research/colonial-pipeline-ransomware-attack/)\ndrastically altered the broader cyber threat landscape as we speak. As you are probably all\nwell aware now, law enforcement agencies identified the culprit of that malicious operation in\n[DarkSide. This sophisticated cybercriminal group has traditionally operated professionally](https://www.digitalshadows.com/blog-and-research/darkside-the-new-ransomware-group-behind-highly-targeted-attacks/)\nand with their own distinct flavor.\n\nWhen we first wrote about DarkSide, we identified this operation as the latest example of a\ngrowing professionalization trend within the ransomware field. First observed around August\n[2020, DarkSide was a Ransomware-as-a-Service (RaaS) operation that used press releases](https://www.digitalshadows.com/blog-and-research/emerging-markets-services-ransomware-as-a-service/)\nto communicate with victims and press, and were also among the first cybercriminal\noperations to announce a ban on attacks on organizations in healthcare and education.\nDarkSide became the ultimate product of some key developments that we had observed\nemerging in previous months in the ransomware arena.\n\nAs a consequence of the attack on Colonial Pipeline, DarkSide claimed to have shut down its\noperations last week following increasing pressure from law enforcement agencies.\n[Additionally, cybercriminal forums have begun banning all things ransomware from their](https://www.digitalshadows.com/blog-and-research/colonial-pipeline-attack-update-cybercriminal-forum-xss-bans-all-things-ransomware/)\nplatforms to dissociate themselves from a threat that had become too “dangerous and toxic”,\nin the words of one forum administrator. Given the recent developments in the Ransomwareas-a-Service field, it will be interesting to see how this threat actor business model will adapt\nto this rapidly changing environment. This blog will analyze RaaS and try to answer some of\nthe questions that our team of [threat intelligence nerds raised in the past few days.](https://www.digitalshadows.com/threat-intelligence/)\n\n## What is the Ransomware-as-a-Service (RaaS) Model?\n\nIn the past couple of years, the Ransomware-as-a-Service business models imposed itself\nas the best method for organized ransomware operators to operate a scalable business\nmodel by reducing the pressure on the malware developers. Ransomware became\nincreasingly successful and profitable for cybercriminals and its developers started\nexperimenting with different tactics to increase their revenues. Consequently, this model was\nincreasingly adopted by several cybercriminal gangs attempting to outsource some of the\nactivities associated with the encryption and extortion tactics to other affiliates.\n\n**Nowadays, the RaaS model can be summarized by three principal figures: operators,**\n**affiliates, and Initial Access Brokers (IABs).**\n\n\n-----\n\nIn the RaaS model, the ransomware operators own the malware source code and distribute it\nto the affiliates after vetting their technical skills and their country of origin (usually native\nEnglish speakers are forbidden from participating). Other tasks typically involve negotiating\nwith the victims the amount and payment of the ransom and improving the ransomware\nproduct.\n\n_Ransomware operator actively recruiting new affiliates on cybercriminal forum_\nAffiliates are typically offered a large share of the paid ransom, with percentage splits being\nreported between 65 and 90 percent for the affiliates. Wannabe affiliates must prove their\ntechnical skills before joining ransomware programs and are also required to find appropriate\nvictims.\n\nThis is where [Initial Access Brokers (IABs) come into action. These figures provide affiliates](https://resources.digitalshadows.com/whitepapers-and-reports/initial-access-brokers-report?utm_source=blog&utm_medium=website&utm_campaign=initial_access_brokers_report)\nwith a seemingly infinite pool of potential victims belonging to different geographies and\nsectors. Affiliates typically buy corporate access from IABs for cheap and then infect those\nnetworks with a ransomware product previously obtained by the operators. The rise of these\nthreat actors in addition to the growing importance of RaaS models in the threat landscape\nindicates an expanding professionalization of cybercriminality. IABs allow this business\nmodel to continuously feed on new victims cheaply and efficiently, thus making ransomware\nwork increasingly as a corporation rather than a criminal organization.\n\n\n-----\n\n_Going from Initial Access Brokers to Ransomware Operators_\n\n## A RaaS Case Study: DarkSide\n\nFor the past couple of years, the model outlined above has worked just fine and has\nprovided cybercriminals with a constant stream of money into their crypto wallets. However,\nthe aftermath of the Colonial Pipeline incident highlighted some critical flaws in the RaaS\nmodel that now threaten to significantly affect the broader threat landscape.\n\nWhy would DarkSide target US Critical National Infrastructure (CNI)? Given the chaos\nensuing from the attack on Colonial Pipeline, it is likely that that operation was conducted by\na rogue affiliate that hadn’t realized the potential consequences of targeting CNI. The\nmassive international media coverage and law enforcement attention stemming from this\nattack later forced DarkSide to shut down its operations— something that I’m sure its\noperators weren’t keen on doing before this attack.\n\nSuppose we apply the RaaS model described above to this operation. In that case, it is\nrealistic that the DarkSide affiliate that conducted the attack had previously bought remote\naccess from an IAB without realizing they were describing a critical company or CNI for the\nUS. In fact, IABs typically avoid naming the targeted company they’re selling access to avoid\ngiving out too much information to security researchers and law enforcement agencies.\nDarkSide affiliates may have bought remote access to a general company in the oil and\nenergy industry with high revenue without realizing the critical importance of that\ninfrastructure for the US. On the other hand, it is also possible that DarkSide knew the\ndamage they would create but simply miscalculated the cost-risk-benefit analysis before the\nattack.\n\n\n-----\n\n_IAB advertising Remote Desktop Protocol (RDP) access to a US “oil/gas production”_\n_company with a revenue of 7 million (no currency unit given) that was sold on 07 Mar 2021_\n\n## How other Ransomware gangs are adapting their RaaS\n\nRansomware is an attack vector in continuous evolution and expansion, and what we’re\nobserving today may not stand the test of time as tactics change. However, analyzing how\nthese loose groups of operators function, where they get their revenues from, and what risks\nthese groups themselves face is key to understanding the threats they pose and mitigating\naccordingly.\n\nThe analysis of the Colonial Pipeline ransomware attack and its aftermath highlighted that\nthe existing Ransomware-as-a-Service model, albeit highly successful in past months, may\nnot be well suited for the current situation of hyperawareness from security researchers and\nlaw enforcement agencies. For this reason, different threat groups associated with\nransomware operations have started a review process to adapt RaaS to the changing\nenvironment and grant operators greater control over the potential affiliates’ targets to avoid\na second Colonial Pipeline-like incident.\n\n\n-----\n\n_Ransomware REvil operators publishing new, stricter guidelines for their affiliates’ operations_\nFor example, the REvil operators published new guidelines following DarkSide’s attack\n[against Colonial Pipeline. In one of the last posts published by ransomware operators in](https://www.digitalshadows.com/blog-and-research/colonial-pipeline-attack-update-cybercriminal-forum-xss-bans-all-things-ransomware/)\ncybercriminal forums, REvil announced that the group will begin approving or denying\nencryption of any companies the group’s affiliates want to target to avoid future social\nconsequences. Additionally, REvil operators restricted attacks against organizations in the\nsocial sector and government institutions belonging to any country. Violating these rules\nwould result in expulsion from the affiliate program and handling a decryption key to the\nvictim for free.\n\nFollowing the ransomware ban from most cybercriminal arenas, including both surface and\n[dark web forums, it is likely that these loosely affiliated criminal groups will go on and](https://www.digitalshadows.com/dark-web-monitoring/)\nconduct their business in private messaging channels and smaller ad hoc forums.\nAdditionally, that ban could cause a bump in the road for ransomware gangs as they’ve often\nused those platforms to recruit more affiliates in their program. Ultimately, although some of\nthese groups may wait to quiet things down a bit before going back to full operations, it is\nunlikely that DarkSide and Co. will simply stop engaging in criminal behavior without seizure\nof their infrastructure and arrest of their leaders by law enforcement.\n\nAt the end of the day, it is essential to follow one topical principle to understand how\nransomware groups will evolve: these cybercriminals want to get rich quick and under the\nradar. This observation is crucial to understanding their behavior and should always be kept\nin mind when analyzing their actions.\n\nIf ransomware is a threat not already on your radar, or if you are interested in learning more,\n[we recommend a 7-day free trial of Threat Intelligence with SearchLight. SearchLight clients](https://info.digitalshadows.com/TestDrivev1-Blog_Reg.html)\nreceive real-time, actionable intelligence updates regarding ransomware activity, including\nanalysis from our team of global analysts and intelligence on new posts to ransomware data\nleak sites across open and closed sources.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-20 - Ransomware-as-a-Service, Rogue Affiliates, and What’s Next.pdf"
    ],
    "report_names": [
        "2021-05-20 - Ransomware-as-a-Service, Rogue Affiliates, and What’s Next.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536233,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653687479,
    "ts_modification_date": 1653687479,
    "files": {
        "pdf": "https://archive.orkl.eu/773dd490df1ae195b9592cc4941b0ff2659c8d2a.pdf",
        "text": "https://archive.orkl.eu/773dd490df1ae195b9592cc4941b0ff2659c8d2a.txt",
        "img": "https://archive.orkl.eu/773dd490df1ae195b9592cc4941b0ff2659c8d2a.jpg"
    }
}