{
    "id": "49e47e67-72d8-4a49-9c25-c87523c37b14",
    "created_at": "2023-01-12T15:01:40.656193Z",
    "updated_at": "2025-03-27T02:13:09.66282Z",
    "deleted_at": null,
    "sha1_hash": "c89a9a5ab9cc4563be95f746ff9fb9383b0a8cb6",
    "title": "2014-12-09 - Blue Coat Exposes “The Inception Framework”; Very Sophisticated, Layered Malware Attack Targeted at Military, Diplomats, and Business Execs",
    "authors": "",
    "file_creation_date": "2022-05-28T00:31:45Z",
    "file_modification_date": "2022-05-28T00:31:45Z",
    "file_size": 691221,
    "plain_text": "# Blue Coat Exposes “The Inception Framework”; Very Sophisticated, Layered Malware Attack Targeted at Military, Diplomats, and Business Execs\n\n**web.archive.org/web/20160710180729/https://www.bluecoat.com/security-blog/2014-12-09/blue-coat-exposes-“-inception-framework”-very-sophisticated-**\nlayered-malware\n\nShare this:\n\nSnorre Fagerland and Waylon Grange\n\nDecember 9, 2014\n\n-    One of the most sophisticated malware attacks Blue Coat Labs has ever seen\n\n-    Initially targeted at Russia, but expanding globally\n\n-    Masterful identity cloaking and diversionary tactics\n\n-    Clean and elegant code suggesting strong backing and top-tier talent\n\n-    Includes malware targeting mobile devices: Android, Blackberry and iOS\n\n-    Using a free cloud hosting service based in Sweden for command and control\n\nResearchers from Blue Coat Labs have identified the emergence of a previously undocumented attack framework that is\nbeing used to launch highly targeted attacks in order to gain access to, and extract confidential information from, victims’\ncomputers. Because of the many layers used in the design of the malware, we’ve named it Inception—a reference to the\n2010 movie “Inception” about a thief who entered peoples’ dreams and stole secrets from their subconscious. Targets\ninclude individuals in strategic positions: Executives in important businesses such as oil, finance and engineering, military\nofficers, embassy personnel and government officials. The Inception attacks began by focusing on targets primarily\nlocated in Russia or related to Russian interests, but have since spread to targets in other locations around the world. The\npreferred malware delivery method is via phishing emails containing trojanized documents.\n\nCommand & Control traffic on the Windows platform is performed indirectly via a Swedish cloud service provider using the\nWebDAV protocol. This hides the identity of the attacker and may bypass many current detection mechanisms.\n\nThe attackers have added another layer of indirection to mask their identity by leveraging a proxy network composed of\nrouters, most of which are based in South Korea, for their command and control communication. It is believed that the\nattackers were able to compromise these devices based on poor configurations or default credentials.\n\nBased on the multiple layers of obfuscation and indirection in the malware, along with the control mechanisms between\nattacker and target, it is clear the attackers behind Inception are intent on staying in the shadows.\n\nThe framework continues to evolve. Blue Coat Lab researchers have recently found that the attackers have also created\nmalware for Android, BlackBerry and iOS devices to gather information from victims, as well as seemingly planned MMS\nphishing campaigns to mobile devices of targeted individuals. To date, Blue Coat has observed over 60 mobile providers\nsuch as China Mobile, O2, Orange, SingTel, T-Mobile and Vodafone, included in these preparations, but the real number is\nlikely far higher.\n\n\n-----\n\nExpanded details about Inception are also available via a new technical whitepaper, The Inception Framework: Cloud\nhosted APT.”\n\n**Highly Targeted Attacks on Political, Military, Financial and Oil Industries**\n\nInitially, attacks campaigns seemed to be largely focused on Russia and a few other Eastern European countries.\nHowever, Blue Coat has also seen attacks on targets in other countries across the globe.\n\nWhile information about targets is limited, Blue Coat researchers have uncovered a number of phishing emails highlighting\nindustry targets:\n\n**Inception Framework: Attack Targets**\n\nFinance [Russia]\nOil industry [Romania, Venezuela, Mozambique]\nEmbassies/Diplomacy [Paraguay, Romania, Turkey]\n\nResearchers have also obtained decoy documents that indicate an interest in:\n\nEmbassies\nPolitics\nFinance\nMilitary\nEngineering\n\n**Initial Discovery**\n\nIn March 2014, Microsoft published information about a new vulnerability in Rich Text Format (RTF). This vulnerability,\nnamed CVE-2014-1761 (Microsoft Word RTF Object Confusion), was already exploited by attackers. Two previous RTF\nvulnerabilities, CVE-2010-3333 and CVE-2012-0158, became mainstays of targeted attacks, so Blue Coat Lab\nresearchers followed the usage this new exploit with interest.\n\nIn late August, Blue Coat identified a malware espionage operation that used both the CVE-2014-1761 and CVE-20120158 vulnerabilities to trigger execution of the malicious payload, and which leveraged a Swedish cloud service, CloudMe,\nas the backbone of its entire visible infrastructure.\n\nWhen Blue Coat notified CloudMe.com about the abuse of their services, CloudMe was very helpful, providing further\nresearch, including a great deal of log information related to the attack. It must be noted that the CloudMe service is not\nactively spreading the malicious content; the attackers are only using it for storing their files.\n\n**How Does Inception Work?**\n\nInitial malware components have, in all cases that Blue Coat has observed, been embedded in Rich Text Format (RTF)\nfiles. Exploitation of vulnerabilities in this file format is leveraged to gain remote access to victim’s computers. These files\nare delivered to the victim via phishing emails with exploited Word documents attached.\n\n\n-----\n\n_EXAMPLE of Phishing Email_\n\n_Example of attached document, containing two exploit containers; one targeting CVE-2012-0158 (MSCOMCTL ActiveX_\n_Buffer Overflow), the other targeting CVE-2014-1761._\n\n_Example of attached document, containing two exploit containers; one targeting CVE-2012-0158 (MSCOMCTL ActiveX_\n_Buffer Overflow), the other targeting CVE-2014-1761._\n\nWhen the user clicks on the attachment, a Word document is displayed to avoid arousing suspicion from the user while\nmalicious content stored inside the document in encoded form writes to their disk. Unusual for many exploit campaigns,\nthe names of the dropped files vary and have been clearly randomized in order to avoid detection by name.\n\nThe malware gathers system information from the infected machine, including OS version, computer name, user name,\nuser group membership, the process it is running in, locale ID’s, as well as system drive and volume information. All of this\nsystem information is encrypted and sent to cloud storage via WebDAV. The framework is designed in such a way that all\ncommunication after malware infection (i.e. target surveying, configuration updates, malware updates, and data\nexfiltration) can be performed via the cloud service.\n\nThe malware components of this framework follow a plug-in model, where new malware rely on already existing malware\ncomponents to interact with the framework. Without the initial installer, none of the subsequent separate modules will\nwork, and most of these will only exist in memory – vanishing at reboot.\n\nThe operational security exhibited by the attackers is among the most advanced that Blue Coat has witnessed. Most\ninteraction between attackers and their infrastructure is performed via a convoluted network of router proxies and rented\nhosts, most likely compromised because of poor configurations or default credentials.\n\n\n-----\n\n**Attack Origins Masked by Obfuscation and Misdirection**\n\nThe attackers have left a slew of potential hints to their physical location. However, it is extremely difficult to distinguish\nwhich of these indicators are legitimate clues and which are bread crumbs intentionally dropped to obscure their trail.\nListed below are the indicators we have discovered and what conclusions could be drawn from each about the origins of\nthe attacks.\n\n**Red Herrings**\n\nIn specific instances where the APT seemed to be under investigation by researchers the actors dropped another\npiece of malware that is clearly attributable to a previously known Chinese APT: Suggests ties to China\nA large majority of the hacked home routers are in South Korea: Suggests ties to South Korea\nThe attackers are most active from 8:00AM to 5:00PM in the Eastern European Timezone: Suggests ties to areas in\nthe GMT+200 timezone\nSome of the comments in the Android malware are in Hindi: Suggests ties to India\nSome text strings in the BlackBerry malware are Arabic: Suggests ties to the Middle East\nThe string “God_Save_The_Queen” was found within the Black Berry malware: Suggests ties to the UK\nThe word documents show some resemblance to word documents used by the Red October APT: Suggests ties to\nUkraine and/or Russia\nThe iOS malware was developed by someone using the account name “JohnClerk”: Suggests ties to the US or UK\nThe encryption key for the iOS malware\n\"fjkweyreruu665E62C:GWR34285U^%^#%$%^$RXYEUFQ2H89HCHVERWJFKWEhjvvehhewfD63TDYDGTYEDT23Y\"\nappears to be keyboard mashing on a US/US International keyboard: Suggests ties to the US\n\n**Attacks Expanded to Target Mobile Devices**\n\nAttackers have expanded their efforts to include malware for Android, BlackBerry and iOS devices.\n\nThese are used to gather information from the victims, including phone call recordings. Specifically on the Android\nplatform, they are recording incoming and outgoing phone calls to MP4 sound files that are periodically uploaded to the\nattackers.\n\nIn parallel, there are indications of a large scale MMS phishing campaign probably aimed at selected individuals.\nAccording to data obtained by Blue Coat researchers, the intended victims may have been customers of many mobile\noperators – we know over 60 mobile providers affected, but the real number is likely far higher. The MMS phishing\nmessages have been prepared for multiple countries in Asia (including the Russian sphere and China), Africa, Middle East\nand Europe.\n\n**Conclusion**\n\nThere clearly is a well-resourced and very professional organization behind Inception, with precise targets and intentions\nthat could be widespread and harmful. The complex attack framework shows signs of automation and seasoned\nprogramming, and the number of layers used to protect the payload of the attack and to obfuscate the identity of the\nattackers is extremely advanced, if not paranoid.\n\nAttribution is always hard, and in this case it is exceedingly difficult. Based on the attributes of the attack and the targeting\nof individuals connected with national political, economic and military interests, the party behind Inception could be a\nmedium-sized nation state, or possibly a resourceful and professional private entity.\n\nThe comprehensive infrastructure suggests that this is a large campaign, of which we’ve only seen the beginning. While\nthe majority of the targets seem to be located in Russia or related to Russian interests, there are verified targets in\ncountries all over the world, and the attack could potentially expand globally. In addition, this infrastructure model does not\nneed to be applied solely against a few targets, nor hosted at CloudMe. The framework is generic, and will work as an\nattack platform for a multitude of purposes with very little modification.\n\n**Additional Guidance - What You Can Do**\n\nSigns of compromise\n\n\n-----\n\nUnauthorized WebDAV traffic\nregsvr32.exe continuously running in the process list\n\nWays to prevent infection\n\nKeep software updated\nDon’t jailbreak mobile phones\nDon’t Install apps from unofficial sources\n\nSigns of being targeted\n\nUnsolicited emails containing rtf documents\nUnsolicited emails or MMS messages suggesting smart phone applications need updating\n\n## Get the full report: \"The Inception Framework: Cloud-Hosted APT.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-12-09 - Blue Coat Exposes “The Inception Framework”; Very Sophisticated, Layered Malware Attack Targeted at Military, Diplomats, and Business Execs.pdf"
    ],
    "report_names": [
        "2014-12-09 - Blue Coat Exposes “The Inception Framework”; Very Sophisticated, Layered Malware Attack Targeted at Military, Diplomats, and Business Execs.pdf"
    ],
    "threat_actors": [
        {
            "id": "02c9f3f6-5d10-456b-9e63-750286048149",
            "created_at": "2022-10-25T16:07:23.722884Z",
            "updated_at": "2025-03-27T02:02:09.945869Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK 116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "Inception Framework",
                "Operation Cloud Atlas",
                "Operation RedOctober",
                "The Rocra"
            ],
            "source_name": "ETDA:Inception Framework",
            "tools": [
                "Lastacloud",
                "PowerShower",
                "VBShower"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04a7ebaa-ebb1-4971-b513-a0c86886d932",
            "created_at": "2023-01-06T13:46:38.784965Z",
            "updated_at": "2025-03-27T02:00:02.91817Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "G0100"
            ],
            "source_name": "MISPGALAXY:Inception Framework",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "37941e7c-1966-4afa-b116-753e19e72808",
            "created_at": "2022-10-25T16:07:23.321195Z",
            "updated_at": "2025-03-27T02:02:09.735994Z",
            "deleted_at": null,
            "main_name": "APT 5",
            "aliases": [
                "APT 5",
                "Bronze Fleetwood",
                "Keyhole Panda",
                "Mulberry Typhoon",
                "Poisoned Flight",
                "TEMP.Bottle",
                "TG-2754"
            ],
            "source_name": "ETDA:APT 5",
            "tools": [
                "LEOUNCIA",
                "shoco"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535700,
    "ts_updated_at": 1743041589,
    "ts_creation_date": 1653697905,
    "ts_modification_date": 1653697905,
    "files": {
        "pdf": "https://archive.orkl.eu/c89a9a5ab9cc4563be95f746ff9fb9383b0a8cb6.pdf",
        "text": "https://archive.orkl.eu/c89a9a5ab9cc4563be95f746ff9fb9383b0a8cb6.txt",
        "img": "https://archive.orkl.eu/c89a9a5ab9cc4563be95f746ff9fb9383b0a8cb6.jpg"
    }
}