{
    "id": "4a88fabf-2492-4382-bd58-c2c635d72843",
    "created_at": "2023-01-12T15:04:31.063386Z",
    "updated_at": "2025-03-27T02:05:46.540722Z",
    "deleted_at": null,
    "sha1_hash": "0ec7b16aefe094db3daa62971a76c79e6f56f5f7",
    "title": "2021-08-23 - Netskope Threat Coverage- BlackMatter",
    "authors": "",
    "file_creation_date": "2022-05-28T17:12:50Z",
    "file_modification_date": "2022-05-28T17:12:50Z",
    "file_size": 2142571,
    "plain_text": "# Netskope Threat Coverage: BlackMatter\n\n**[netskope.com/blog/netskope-threat-coverage-blackmatter](https://www.netskope.com/blog/netskope-threat-coverage-blackmatter)**\n\nGustavo Palazolo August 23, 2021\n\n## Summary\n\n[In July of 2021, a new ransomware named BlackMatter emerged and was being advertised](https://malpedia.caad.fkie.fraunhofer.de/details/win.blackmatter)\nin web forums where the group was searching for compromised networks from companies\nwith revenues of $100 million or more per year. Although they are not advertising as a\nRansomware-as-a-Service (RaaS), the fact they are looking for “partners” is an indication\nthat they are operating in this model. Furthermore, the group is claiming to have combined\nfeatures from larger groups, such as DarkSide and REvil (a.k.a. Sodinokibi).\n\n\n-----\n\n[BlackMatter advertisement in a web forum. (Source: The Record)](https://therecord.media/blackmatter-ransomware-targets-companies-with-revenues-of-100-million-and-more/)\n[According to an interview with an alleged representative from BlackMatter, they have](https://therecord.media/an-interview-with-blackmatter-a-new-ransomware-group-thats-learning-from-the-mistakes-of-darkside-and-revil/)\n[incorporated the ideas of LockBit,](https://www.netskope.com/blog/netskope-threat-coverage-lockbit) [REvil, and](https://www.netskope.com/blog/netskope-threat-coverage-revil) [DarkSide, after studying their ransomware in](https://www.netskope.com/blog/netskope-threat-coverage-darkside)\ndetail. Also, the BlackMatter representative believes that other ransomware groups have\ndisappeared from the scene due to attention from governments following high-profile\nattacks. BlackMatter plans to avoid such attention by being careful not to infect any critical\ninfrastructure. This is echoed on their website, which states they are not willing to attack\nhospitals, critical infrastructures, defense industry, and non-profit companies.\n\n\n-----\n\nMain page of BlackMatter’s website, hosted on the deep web.\nThe oil and gas industry is also excluded from the target list, a reference to the Colonial\nPipeline attack where DarkSide stopped the fuel delivery across the Southeastern of the\nUnited States, followed by the [shut down of the ransomware operation due to the pressure](https://www.nytimes.com/2021/05/14/business/darkside-pipeline-hack.html)\nfrom law enforcement. The BlackMatter spokesperson also said that the Colonial PIpeline\nattack was a key factor for the shutdown of REvil and DarkSide, and that’s why they are\nexcluding this kind of sector from the target list.\n\nBlackMatter already claims to have hit three victims, each listed on their deep web site,\nwhich follows the same standard from other groups, containing the name of the attacked\ncompany, a summary of what data they have stolen, and the deadline for the ransom before\nthe data is published.\n\n\n-----\n\nOne of the DarkSide targets, with\n\nleaked data on the website.\n[One of the companies infected by BlackMatter is SolarBR, which is the second-largest](https://www.cisoadvisor.com.br/anunciado-ataque-a-fabricante-de-coca-cola-no-brasil/)\nmanufacturer of Coca-Cola in Brazil, where the group claimed to have stolen 50 GB of\nconfidential finance, logistics, development, and other data.\n\nSolar Coca-Cola infected by BlackMatter\nAccording to the post, if the ransom isn’t paid, the group will publish the data and inform all of\nthe “biggest mass-media in Brazil and US,” making “Coca Cola and her lovers” to be “madly\nangry”.\n\nInformation from BlackMatter’s deep web site.\n\n\n-----\n\nThere is no official information about the ransom amount BlackMatter is requesting from\nSolar Coca-Cola, but the deadline is set to August 23, 2021.\n\nIn this threat coverage report, we will analyze a Windows BlackMatter sample, version 1.2,\ndescribing some of the key features of the malware.\n\n## Threat\n\nLike other malware, BlackMatter implements many techniques to avoid detection and make\nreverse engineering more challenging. The first item we would like to cover is how\nBlackMatter dynamically resolves API calls to hide them from the PE import table.\n\nThis is done by a multi-step process. First, the malware creates a unique hash that will\nidentify both the DLL and API name that needs to be executed. To make this a bit harder for\nstatic detections, the real hash value is encrypted with a simple XOR operation. In this case,\nthe key is 0x22065FED.\n\nFigure 1. Function that loads the import\n\nbased on a hash.\nIn the example above, after the XOR operation, the value 0x27D05EB2 is passed as a\nparameter to the function responsible for searching and loading the API. The code first\nenumerates all the DLLs that are loaded within the process through a common but\ninteresting technique.\n\nFirst, it loads the [Process Environment Block (PEB) address, which is located in the Thread](https://docs.microsoft.com/en-us/windows/win32/api/winternl/ns-winternl-peb)\nEnvironment Block (TEB). Then, it loads the doubly linked list that contains all the loaded\n[modules for the process, located in the PEB_LDR_DATA structure.](https://docs.microsoft.com/en-us/windows/win32/api/winternl/ns-winternl-peb_ldr_data)\n\nFigure 2.\n\nBlackMatter function searching loaded modules using the PEB.\n\n\n-----\n\nOnce the loaded DLL is located, the function retrieves the DLL s offset, finds the PE header\naddress, and then calculates the offset of the PE export directory, so it can enumerate the\nAPIs exported by the DLL.\n\nIf the export table is found, the ransomware then calculates the hash value for both DLL and\nAPI name, using the following function:\n\nFigure\n\n3. Function used by BlackMatter to calculate the hash of the string.\nTo get the unique hash, the ransomware first calculates the hash only for the DLL name.\n\nFigure 4. Hash\n\ngeneration for the DLL “kernel32.dll”\nIn the example above, the hash for the DLL “ kernel32.dll ” is 0xB1FC7F66, which is then\nused by this same function to calculate the hash of the API name.\n\n\n-----\n\nFigure 5. Generating the\n\nfinal hash for DLL + API name\nTherefore, using the same function again, the malware has generated the hash\n**0x27D05EB2 for the DLL “ kernel32.dll ” and the API “ LoadLibraryA ”, which is exactly**\nthe same value the malware is seeking, as demonstrated in Figure 1.\n\nIf the hash generated by the function matches the hash the malware passed as a parameter,\nthe offset for the API is stored in memory, so the function can be called.\n\nFigure 6. BlackMatter’s code before and after the APIs were dynamically resolved.\nSeveral DLLs are loaded by BlackMatter dynamically after the executable is running, as we\ncan see below.\n\nFigure 7. DLLs dynamically loaded by BlackMatter.\nTo make the analysis faster, we’ve created a script that implements the same logic used by\nBlackMatter for the hash generation. Therefore, the script can be used to locate calls to\nspecific APIs across BlackMatter’s code.\n\n\n-----\n\nFigure 8. Script to\n\ngenerate the hash based on the API call.\nAnother technique used by BlackMatter to stay under the radar is to encrypt all its important\nstrings. In the samples we’ve analyzed, the ransomware used the same key as the one used\nto generate the hashes for the API loading process.\n\n\n-----\n\nFigure 9. BlackMatter’s routine for\n\nstring decryption.\nAfter the bytes are organized in memory, the code decrypts the data in 4-byte blocks, using a\nsimple XOR operation with the key 0x22065FED.\n\nFigure 10. Example of a string decrypted by BlackMatter.\n\n\n-----\n\nWe can find useful information across the decrypted strings, such as registry keys, file\n[names, and others. The full list of decrypted strings can be found in our GitHub repository.](https://github.com/netskopeoss/NetskopeThreatLabsIOCs/tree/main/BlackMatter/IOCs)\n\nFigure 11. Some of\n\nBlackMatter’s decrypted strings.\nBlackMatter also has an encrypted configuration inside the binary, located in a fake PE\nresource section.\n\nFigure\n\n12. BlackMatter’s encrypted configuration.\nThe first 4 bytes in the section are the initial decryption key, the following 4 bytes represent\nthe size of the data, and the rest of the bytes are the encrypted configuration. The data is\nthen decrypted using a rolling XOR algorithm.\n\nA new decryption key is generated every 4 bytes, using a dynamic seed and a constant,\nwhich is 0x8088405 in all the samples we have analyzed so far.\n\n\n-----\n\nFigure 13. Stub that generates\n\nthe decryption key.\n[The decrypted configuration is compressed using aPLib, so we need to decompress the](https://ibsensoftware.com/products_aPLib.html)\nbytes to get the information. Once this process is done, we can read the contents of the\nconfiguration. At the beginning, we can find the attacker’s RSA public key, the AES key used\nto encrypt C2 communication, as well as a 16-byte value named “ bot_company ”.\n\nFigure 14. BlackMatter’s decrypted configuration.\nAside from that, the configuration also includes several base64 encoded strings that contain\nsensitive strings used by the malware, like the C2 server addresses.\n\n\n-----\n\nFigure 15. Decoding BlackMatter’s C2 server addresses.\nAmong the strings, there is also a list of processes and services that the ransomware\nattempts to stop \\ terminate.\n\nFigure 16. Ransomware trying to open the\n\nVSS service.\n[To speed up the analysis, we have created a script that is able to decrypt the strings and the](https://github.com/netskopeoss/NetskopeThreatLabsIOCs/blob/main/BlackMatter/Scripts/decrypt_data.py)\nconfiguration from BlackMatter samples.\n\nFigure 17. Decrypting BlackMatter’s strings.\nThe script also decodes all base64 values from the configuration automatically:\n\n\n-----\n\nFigure 18. BlackMatter’s C2 server\n\naddresses.\nBlackMatter communicates with the C2 server in order to send information to the attackers. It\nfirst loads a JSON structure in memory, containing all the information that will be sent.\n\nFigure 19.\n\nInformation that will be sent to the C2 address.\nPrior to the POST request, the information is encrypted using AES-128 ECB, with the key\nextracted from the configuration, and then encoded with base64.\n\nFigure 20. BlackMatter sending request to the C2 server.\nIt’s possible to decrypt this information by decoding the base64 and decrypting the data\nusing the key from the configuration file.\n\n\n-----\n\nFigure 21. Decrypting BlackMatter’s C2 request.\nBlackMatter sends two requests, the first one contains details about the infected\nenvironment, and the second one contains details about the encryption process, such as\nhow many files failed to encrypt, the start and end time, etc.\n\nFinally, once the encryption process is complete, the ransom note is created in the same\nplaces where there are encrypted files.\n\nFigure 22. BlackMatter’s ransom note.\nBlackMatter changes the background image, a common practice among ransomware\ncreators.\n\n\n-----\n\nFigure 23. BlackMatter’s custom background\n\n## Protection\n\nNetskope Threat Labs is actively monitoring this campaign and has ensured coverage for all\nknown threat indicators and payloads.\n\n**Netskope Threat Protection**\n```\n      Trojan.GenericKD.46740173\n      Gen:Heur.Mint.Zard.25\n\n```\n**Netskope Advanced Threat Protection provides proactive coverage against this**\nthreat.\n```\n      Gen.Malware.Detect.By.StHeur indicates a sample that was detected using\n\n```\nstatic analysis\n\n`Gen.Malware.Detect.By.Sandbox` indicates a sample that was detected by\nour cloud sandbox\n\n## IOCs\n\n**SHA256**\n\n22d7d67c3af10b1a37f277ebabe2d1eb4fd25afbd6437d4377400e148bcc08d6\n\n2c323453e959257c7aa86dc180bb3aaaa5c5ec06fa4e72b632d9e4b817052009\n\n7f6dd0ca03f04b64024e86a72a6d7cfab6abccc2173b85896fc4b431990a5984\n\nc6e2ef30a86baa670590bd21acf5b91822117e0cbe6060060bc5fe0182dace99\n\nA full list of IOCs, a Yara rule, and the scripts used in the analysis are all available in our Git\nrepo.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-23 - Netskope Threat Coverage- BlackMatter.pdf"
    ],
    "report_names": [
        "2021-08-23 - Netskope Threat Coverage- BlackMatter.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535871,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653757970,
    "ts_modification_date": 1653757970,
    "files": {
        "pdf": "https://archive.orkl.eu/0ec7b16aefe094db3daa62971a76c79e6f56f5f7.pdf",
        "text": "https://archive.orkl.eu/0ec7b16aefe094db3daa62971a76c79e6f56f5f7.txt",
        "img": "https://archive.orkl.eu/0ec7b16aefe094db3daa62971a76c79e6f56f5f7.jpg"
    }
}