{
    "id": "4afedb6e-10c7-4d14-ba2c-a2fcf4840a8b",
    "created_at": "2022-10-25T16:48:22.80036Z",
    "updated_at": "2025-03-27T02:15:38.024592Z",
    "deleted_at": null,
    "sha1_hash": "30d80fc2ff785b0dffdd99d24cec6b35e6555674",
    "title": "Zooming into Darknet Threats Targeting Japanese Organizations",
    "authors": "",
    "file_creation_date": "2020-11-21T09:44:20Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1527103,
    "plain_text": "# Zooming into Darknet Threats Targeting Japanese Organizations\n\n**[ke-la.com/zooming-into-darknet-threats-targeting-jp-orgs-kela](https://ke-la.com/zooming-into-darknet-threats-targeting-jp-orgs-kela/)**\n\nNovember 18, 2020\n\nIn light of rising cyberattacks and ahead of the 2021 Tokyo Games, Japan is investing in\ncybersecurity efforts, with one of them being the establishment of a government entity\ndubbed the Digital Agency. The decision follows recent fraud involving Japanese bank\naccounts linked to cashless payments services, which could be achieved by bruteforcing, using compromised credentials to banking accounts or via other attack vectors.\nAttacks on the banking infrastructure is just a part of threats targeting Japanese\norganizations, recently explored by KELA. They include:\n\n**Leaked data and compromised accounts. KELA detected that data**\nbelonging to Japanese corporations, as well as government and educational\nentities, is actively circulating in the darknet and being demanded by threat\nactors. This data can be used to gain initial network accesses, i.e. entry points to\ntargeted networks.\n**Initial network accesses. KELA observed several Japanese compromised**\ncompanies, ranging from corporations to universities, including one Japan\nministry target during June-October 2020. These accesses can be leveraged to\neventually deploy ransomware.\n**Ransomware incidents. KELA detected at least 11 Japanese victims of**\nransomware attacks in June-October 2020. The affected companies are from\nmanufacturing, construction and government-related industries, with top victims\nhaving around $143 billion, $33 billion and $2 billion yearly revenue.\n\n\n-----\n\n## Leaked Data and Compromised Accounts: Demand for Japanese Companies\n\nAmong the most prominent threats on the darknet, KELA observed leaks and sales of\nJapanese entities’ data. While many offers are related to regular users, some\n**actors are specifically looking for corporate data of Japanese**\n**organizations.**\n\n**_A threat actor requesting for corporate emails in Asian countries, including Japan_**\n\n**_A threat actor requesting for fresh Japan databases. During several days, he_**\n**_received three answers from potential sellers asking for contacts to probably make a_**\n**_deal_**\n\n\n-----\n\nExposed data may include personal information of companies customers and\nemployees, sensitive internal documents, and credentials to the company’s resources.\nFor example, the KelvinSecurityTeam hacking group has been trading a database of a\nmajor Japan corporation since July 2020. It has been recently promoted again as a part\nof their offers.\n\nThe threat actor claimed that the database contains records of 150,000 customers,\npossibly Japanese ones. As KELA observed from samples of the database, the records\ninclude names, addresses, birth dates, emails, and phone numbers, as well as some data\nrelated to their work history. KelvinSecurityTeam is a hacking collective with some\nmembers from Venezuela, Peru, and Colombia, which is known for selling hacking tools,\ncarding services, and private data dumps on forums.\n\n**While personal information and internal documents require malicious**\n**actors to perform multiple steps to attack the company further (for**\n**example, via specially-crafted phishing campaigns), exposed credentials**\n**provide an easier way to compromise the company via accessing its internal**\n**systems and software in use.**\n\nExposed credentials can be divided into two types:\n\n**Leaked credentials. Corporate email logins, with or without passwords, which**\nare usually being leaked or sold by threat actors on underground forums.\n**Overall, KELA discovered more than 100 million exposed Japanese**\n**emails in our sources.**\n\n\n-----\n\n**Compromised accounts. Logins and passwords to accounts that grant access**\nto tools and software used in a compromised environment, such as RDP, VPN\nsolutions, and more, which are usually being sold through underground\nautoshops.\n\n**_Top 10 email domains featured in leaked credentials gathered by KELA’s tools from_**\n**_cybercrime communities_**\n\n**_Part of compromised accounts offered in autoshops (shown within KELA’s_**\n**_DARKBEAST)_**\n\n\n-----\n\nThis data can enable attackers to access the company’s resources and provide further\nmalicious activity, ranging from social engineering to malware attacks. Ultimately,\n**every leaked data can theoretically become an entry point for large-scale**\n**attacks.**\n\nBased on information gathered from multiple darknet sources that KELA tracks, we\ndefined that many Japanese corporations, as well as government and educational\nentities, are suffering significantly from these types of threats:\n\n\n-----\n\n## Network Accesses: Entry Points to Japanese Networks for Ransomware Attackers\n\nInitial network accesses, offered on underground forums, can serve as entry points for\nransomware operators and other malicious actors looking for a foothold from where\nthey can move laterally and deploy ransomware or steal intellectual property. Over the\nlast three months, KELA observed several accesses to Japanese organizations being sold\nin the darknet. While overall numbers are lower than other countries like the US,\n[considering the scale of initial network accesses’ sales](https://ke-la.com/kelas-100-over-100-september2020-in-network-access-sales/), each of these accesses can\n**be turned into millions of ransom demanded by buyers who would manage**\n**to leverage them to infect the victims with ransomware.**\n\nThe most dangerous offer appears to be related to a remote code execution vulnerability\nin the Japanese Ministry of Justice network. According to a threat actor who posted the\noffer for 210,000 JPY, exploiting this vulnerability could grant NT Authority/System\nprivileges, meaning a high level of permissions.\n\nAnother access on sale during the last months allegedly belonged to a “Japan ship\ninspection network” and had domain admin level privileges, which enables attackers to\nperform malicious actions on behalf of the targeted network’s administrator. It was\noffered for 157,000 JPY. Interestingly, one week later, the Sodinokibi (REvil)\nransomware gang attacked a victim which appears to be the same company based on\nthe description on the victim’s website — “certification body of ship equipment.”\nHowever, it’s not known if the two incidents were related. Ransomware operators\n**usually wait for negotiations deadlines to expire before exposing a victim**\n**on their blogs, so it’s hardly possible they would manage both to attack the**\n**victim and lose patience for one week.**\n\n\n-----\n\n**_Access to the Japanese “ship inspection network” offered for sale_**\n\n_Sodinokibi’s victim_\n\nAmong other offers, KELA observed access to a Japanese medical university being\noffered for 105,000 JPY. The example highlights that despite the pandemic and\n**the disapproval of some members of the underground community, many**\n**[actors continue to target the healthcare industry, as well as the education](https://ke-la.com/to-attack-or-not-to-attack-targeting-the-healthcare-sector-in-the-underground-ecosystem/)**\n**sector.**\n\n\n-----\n\n## Ransomware Incidents: (At Least) Seven Gangs Targeting Japanese Organizations\n\n**During June-October 2020, at least 11 Japanese victims suffered**\n**ransomware attacks (based on the media reports and data on ransomware gangs’**\n“naming-and-shaming” portals used to threaten victims, monitored by KELA\n[technology), with the most well-known victims being Honda and Canon.](https://www.honda.co.jp/content/dam/site/www/investors/cq_img/library/report/FY202003_yuho_j.pdf)\n\n**The most active ransomware gang targeting Japanese entities appears to be**\n**the DoppelPaymer gang. The DoppelPaymer ransomware emerged in 2019 and is**\nbelieved to have links with former members of the TA505 hacking group. This group\nhas recently attacked four large Japanese companies from the construction, automotive\nand manufacturing industries, including a corporation with $1 Billion in revenue, as\nwell as a German subsidiary of a leading manufacturer of specialty paper in Japan.\n\n\n-----\n\nInterestingly, one of the victims of DoppelPaymer was later claimed to be attacked by\nConti, a new ransomware operation that started in August 2020 and believed to be\nassociated with the Ryuk ransomware.\n\n_DoppelPaymer’s leak blog featuring a Japanese manufacturing company with $153 million_\n_revenue_\n\nOther ransomware gangs spotted attacking Japanese entities are well-known Maze,\nSodinokibi and Ekans (Snake), and two ransomware operations that have recently\nadopted a tactic of public shaming – Egregor and LockBit.\n\n\n-----\n\n**_Maze’s leak site featuring a full dump of stolen documents belonging to a Japanese_**\n**_manufacturing company_**\n\nNot much is known about initial infection vectors used to compromise networks of\nJapanese victims. However, it’s clear that the attack surface is expanding due to COVID19-related issues and increasing trend for remote working, meaning that more and more\nemployees are using vulnerable software and exposed credentials to access corporate\nnetworks remotely.\n\n\n-----\n\n_Business enterprises in Japan that implemented home office for employees after the outbreak of_\n_[COVID-19 (source: Statista)](https://www.statista.com/statistics/1103444/japan-share-companies-implemented-remote-work-coronavirus-outbreak/)_\n\nFor example, one Japanese victim, a manufacturing company, was probably\n**attacked by LockBit using exploit code for a Pulse Secure vulnerability**\n**(CVE-2019-11510). The clue stems from the fact that the company’s IP address was**\n[included in a leak posted on a cybercrime community containing details and credentials](https://ke-la.com/the-secret-life-of-an-initial-access-broker/)\nof over 900 enterprise Pulse Secure servers exploited by threat actors.\n\nThe victim was first shared by LockBit in their thread on a Russian-speaking\nunderground forum with a domain that had a Chinese TLD, which could indicate it is a\nChinese branch that was attacked. When LockBit started their blog a few days later, the\nvictim appeared there without domains mentioned.\n\n\n-----\n\n**_A post in LockBit’s thread, where the ransomware gang is recruiting affiliates, on a_**\n**_Russian-speaking underground forum_**\n\n**The Pulse Secure leak, for which additional directories were shared several**\n**days later, possibly affects about 117 Japanese entities, based on KELA’s**\n**analysis of the IP addresses. Darknet chatter on the matter shows that this**\n**information has been circulated between malicious actors before the leak**\n**that happened in August 2020. Therefore, credentials to affected Japanese**\norganizations’ Pulse Secure servers could be used by different actors in their malicious\ncampaigns, including ransomware attacks.\n\n\n-----\n\n**_Part of Japanese entities contained in the Pulse Secure leak (KELA’s document based_**\n**_on the leaked directory)_**\n\n## Conclusions and Mitigation Efforts\n\nAs can be concluded from this research, more and more threat actors, Advanced APT\ngroup and nation state actors are considering Japanese organizations as valuable\ntargets and are actively attacking them via opportunistic and targeted attacks.\n\nGiven the latest “work from home” trend and the increased attack surface, KELA has\nobserved many commercial and governmental Japanese entities being recently attacked\nby known actors – from ransomware gangs to nation-state actors and other financially\nmotivated groups. They’re using multiple attack vectors aimed to compromise Japanese\nentities, gain a foothold into their network and steal sensitive information and funds.\n\nKELA strongly believes that real-time monitoring of darknet communities for both\nsupply and demand can hold significant intelligence value for Japanese defenders. It\nenables Japanese entities to be more proactive to threats, learn about new tactics used\nby malicious actors, and take measures to protect against them.\n\nIn our next blog post, we will cover the Japanese financial ecosystem and the\nopportunities threat actors see in targeting both the consumer and the organizations’\nsides.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/2020.11.18_Zooming_into_Darknet_Threats_Targeting_Japanese_Organizations/2020.11.18_Zooming_into_Darknet_Threats_Targeting_Japanese_Organizations.pdf"
    ],
    "report_names": [
        "2020.11.18_Zooming_into_Darknet_Threats_Targeting_Japanese_Organizations"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1605951860,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/30d80fc2ff785b0dffdd99d24cec6b35e6555674.pdf",
        "text": "https://archive.orkl.eu/30d80fc2ff785b0dffdd99d24cec6b35e6555674.txt",
        "img": "https://archive.orkl.eu/30d80fc2ff785b0dffdd99d24cec6b35e6555674.jpg"
    }
}