{
    "id": "4b3de784-7b76-4395-8746-6db457a095af",
    "created_at": "2023-01-12T15:06:43.617088Z",
    "updated_at": "2025-03-27T02:16:11.47806Z",
    "deleted_at": null,
    "sha1_hash": "4aa30104806a8a632a9a7f02f777aa2d56211a21",
    "title": "2020-07-16 - New Research Exposes Iranian Threat Group (APT35-ITG18) Operations",
    "authors": "",
    "file_creation_date": "2022-05-29T01:30:01Z",
    "file_modification_date": "2022-05-29T01:30:01Z",
    "file_size": 2826370,
    "plain_text": "# New Research Exposes Iranian Threat Group Operations\n\n**[securityintelligence.com/posts/new-research-exposes-iranian-threat-group-operations/](https://securityintelligence.com/posts/new-research-exposes-iranian-threat-group-operations/)**\n\n[Advanced Threats July 16, 2020](https://securityintelligence.com/category/x-force/threats/)\nBy [Allison Wikoff co-authored by Richard Emerson 7 min read](https://securityintelligence.com/author/allison-wikoff/)\nIBM X-Force Incident Response Intelligence Services (IRIS) has uncovered rare details on\nthe operations of the suspected Iranian threat group ITG18, which overlaps with Charming\nKitten and [Phosphorus. In the past few weeks, ITG18 has been associated with targeting of](https://blogs.microsoft.com/on-the-issues/2019/03/27/new-steps-to-protect-customers-from-hacking/)\n\n\n-----\n\n[pharmaceutical companies and the](https://www.reuters.com/article/us-healthcare-coronavirus-gilead-iran-ex/exclusive-iran-linked-hackers-recently-targeted-coronavirus-drugmaker-gilead-sources-idUSKBN22K2EV) [U.S. presidential campaigns. Now, due to operational](https://www.reuters.com/article/us-usa-election-alphabet-cyberattack/chinese-and-iranian-hackers-targeted-biden-and-trump-campaigns-google-idUSKBN23B2T9)\nerrors—a basic misconfiguration—by suspected ITG18 associates, a server with more than\n40 gigabytes of data on their operations has been analyzed by X-Force IRIS analysts.\n\nRarely are there opportunities to understand how the operator behaves behind the keyboard,\nand even rarer still are there recordings the operator self-produced showing their operations.\nBut that is exactly what X-Force IRIS uncovered on an ITG18 operator whose OPSEC\nfailures provide a unique behind-the-scenes look into their methods, and potentially, their\nlegwork for a broader operation that is likely underway.\n\n## What IBM X-Force IRIS Found\n\nDuring a three-day period in May 2020, IBM X-Force IRIS discovered the 40 GBs of video\nand data files being uploaded to a server that hosted numerous ITG18 domains used in\nearlier 2020 activity. Some of the videos showed the operator managing adversary-created\naccounts while others showed the operator testing access and exfiltrating data from\npreviously compromised accounts.\n\nAmong the information IBM X-Force IRIS uncovered were:\n\nIn nearly five hours of videos, an ITG18 operator searching through and exfiltrating\ndata from various compromised accounts of a member of U.S. Navy and a personnel\nofficer with nearly two decades of service in Hellenic Navy. Using these accounts could\nallow the operator to obtain other data on military operations of potential interest to\nIran.\nFailed phishing attempts targeting the personal accounts of an Iranian-American\nphilanthropist and officials of the U.S. State Department.\nPersonas and Iranian phone numbers associated to ITG18 operators.\n\nIBM X-Force IRIS’s longitudinal examination of this threat group’s targeting indicates ITG18\nhas used its infrastructure for multiple, diverse strategic objectives that serve both short and\nlong-term interests. ITG18 has been active since at least 2013. Hallmarks of this group’s\nactivity includes credential harvesting and email compromise operations through phishing\nattacks against numerous targets of strategic interest to the Iranian government.\n\n## Training Videos\n\nThe video files uncovered by IBM X-Force IRIS were desktop recordings using a tool called\n[Bandicam, ranging from 2 minutes to 2 hours. The timestamps of the files indicated the](https://www.bandicam.com/)\nvideos were recorded approximately one day prior to being uploaded to the ITG18-operated\nserver.\n\n\n-----\n\n_Figure 1: Image capture of ITG18 operator desktop from Bandicam recording (Source: IBM_\n_X-Force IRIS)_\n\nIn five of the video files, named “AOL.avi”, “Aol Contact.avi”, “Gmail.avi”, “Yahoo.avi”,\n“Hotmail.avi”, the operator uses a Notepad file containing one credential for each platform,\nand video-by-video copied and pasted them into the associated website. The operator\nmoved on to demonstrate how to exfiltrate various datasets associated with these platforms\nincluding contacts, photos, and associated cloud storage.\n\nAn additional action the operator took was to modify settings within the account security\n[section of each account in order to add the account to Zimbra, a legitimate email](https://www.zimbra.com/)\ncollaboration platform that can aggregate numerous email accounts into one interface.\nThrough the use of this platform, the operator was able to monitor and manage various\ncompromised email accounts simultaneously.\n\n\n-----\n\n_Figure 2: Image capture of ITG18 operator syncing their persona account to Zimbra (Source:_\n_IBM X-Force IRIS)_\n\nSome of the accounts were likely threat actor personas—designed to appear as real people\nto victims.\n\n## Operator-owned Account Personas\n\nSome of the operator-owned accounts observed in the training videos provided additional\ninsight into personas associated to ITG18, such as phone numbers with Iranian country\ncodes. IBM X-Force IRIS observed the “Yahoo.avi” video displayed profile details for a fake\npersona, which we will reference as “Persona A” including a phone number with a +98\ncountry code, the international country code for Iran. (See Figure 3)\n\n\n-----\n\n_Figure 3: Persona A has an Iranian phone number (+98) associated with the account_\n_(Source: IBM X-Force IRIS)_\n\nOther suggestions of an Iranian operator behind Persona A included unsuccessful attempts\nto send emails to an Iranian American philanthropist, and potentially two personal email\naccounts for U.S. State Department officials in April 2020, including one account that was\nassociated with the U.S. Virtual Embassy to Iran. The recording appeared to show bounceback emails in the operator’s inbox, notifying them that these possible spear phishing emails\ndid not go through, though we do not know the theme. The targeting of these individuals is in\nline with prior ITG18 operations.\n\n## The Legwork for Precision Targeting\n\nThree of the video files discovered reveal that ITG18 had successfully compromised several\naccounts associated with an enlisted member of the United States Navy as well as an officer\nin the Hellenic Navy. Specifically, ITG18 had credentials for a number of what appear to be\n\n\n-----\n\ntheir personal email and social media accounts – a common characteristic of ITG18, as\n[observed in previous operations.](https://www.clearskysec.com/wp-content/uploads/2017/12/Charming_Kitten_2017.pdf)\n\nThe videos show the operator following a similar playbook to the training videos involving the\npersona accounts. Once successful access to victims’ accounts was gained, the ITG18\noperator actively deleted notifications sent to the compromised accounts suggesting\nsuspicious logins, presumably as to not alert the victims.\n\nThe operator exported all account contacts, photos, documents from associated cloud\nstorage sites, such as Google Drive, before adding the webmail account credentials to\nZimbra, presumably for monitoring. The operator was also able to sign into victims’ Google\nTakeout (takeout.google.com), which allows a user to export content from their Google\nAccount, to include location history, information from Chrome, and associated Android\ndevices.\n\nThis included gaining access to associated other accounts owned by the victims, illustrating\nthe breadth of information that ITG18 was able to collect on the two military members.\nAmongst the personal files exfiltrated on the U.S. Navy enlisted member were details on the\nmilitary unit they were associated with including the Naval base they were affiliated with. The\noperator collected a significant amount of personal information about this victim including\npresumed residence, personal photos including numerous selfies and a video of a home\nbeing staged, tax records and the contents of a personal cloud storage site (See Figure 4).\nSimilar information was exfiltrated for the Hellenic Navy officer, including information from a\nGmail account, an account associated with a Greek university and a Hellenic Navy payroll\nsite.\n\n_Figure 4: Screenshot of some of the folders on the ITG18 server. These folders contained_\n_exfiltrated data from the accounts of a victim (Source: IBM X-Force IRIS)_\n\nFor non-email accounts, the operator validated credentials no matter how trivial seeming the\nwebsite may have been. Some of the categories of the websites the operator validated\ncredentials for included video and music streaming, pizza delivery, credit reporting, student\nfinancial aid, municipal utility, banks, baby products, video games, and mobile carriers, to\nname a few. The operators appear to have been meticulously gathering trivial social\ninformation about the individuals. In total, the operator attempted to validate credentials for at\nleast 75 different websites across the two individuals.\n\n\n-----\n\nIf the credentials were successful, the operator frequently visited the account details page\nfirst, presumably to review sensitive information available there. Also of note, the operator,\nwho only used the Chrome browser to validate credentials, frequently used the built-in\ntranslation feature to translate websites in the Greek language to English when checking the\ncredentials associated with the Hellenic Navy member.\n\nIBM X-Force IRIS did not find evidence of the two military members’ professional network\ncredentials being compromised, and no professional information appears to have been\nincluded. However, it’s possible that the threat actor was searching for specific information\nwithin the military members’ personal files that would allow ITG18 to extend their cyber\nespionage operation further into the U.S. and Greek Navy.\n\n## Multifactor Authentication Forces Operators to Pivot\n\nDuring the videos where the operator was validating victim credentials, if the operator\n[successfully authenticated against a site that was set up with multifactor authentication](https://securityintelligence.com/posts/multifactor-authentication-the-next-battleground/)\n(MFA) they paused and moved on to another set of credentials without gaining access.\n\n## Implication for Broader ITG18 Objectives\n\nThe compromise of personal files of members of the Greek and U.S. Navy could be in\nsupport of espionage operations related to numerous proceedings occurring in the Gulf of\n[Oman and Arabian Gulf. It is also worth noting that the U.S. and Greece are strategic allies,](https://www.navytimes.com/news/your-navy/2020/04/19/iran-acknowledges-revolutionary-guard-encounter-with-us-during-persian-gulf-drill/)\nwith a nearly eight-decade mutual defense cooperation agreement. Greece hosts a U.S.\nnaval base in Crete in the Eastern Mediterranean.\n\nSome target types of ITG18 have remained consistent over the past three years while others\nappear associated with specific geopolitical events. For instance, while ITG18 has\nconsistently targeted individuals with an Iranian connection over the past three years, in\n[2018 the group targeted individuals associated with the U.S. Office of Foreign Assets](https://apnews.com/0d4dcaab0e134cf6a1c6ce6be3b7b6a8)\n[Control, a group that implements economic sanctions. This timing aligned with new](https://thehill.com/policy/cybersecurity/421184-iranian-hackers-targeted-personal-email-accounts-of-us-treasury)\nsanctions the U.S. was developing as global concessions to extend sanctions on Iran\nexpired. More recently, ITG18’s April 2020 targeting of a pharmaceutical executive aligns\n[with Iran’s COVID-19 outbreak, which spiked at the end of March 2020.](https://www.bbc.com/news/world-middle-east-51642926)\n\n\n-----\n\n_Figure 5: Timeline of ITG18 targeting demonstrating its blended objectives (Source: IBM X-_\n_Force IRIS)_\n\nRegardless of motivation, mistakes by the ITG18 operator allowed IBM X-Force IRIS to gain\nvaluable insights into how this group might accomplish action on its objectives and otherwise\ntrain its operators. IBM X-Force IRIS considers ITG18 a determined threat group with a\nsignificant investment in its operations. The group has shown persistence in its operations\nand consistent creation of new infrastructure despite multiple public disclosures and broad\nreporting on its activity.\n\nITG18 has demonstrated it performs operations to serve multiple, distinct long-term\nobjectives that align to Iranian strategic interests. It is highly likely the group has been\nsuccessful in these efforts as its operational cadence for harvesting credentials has not\nsignificantly changed over several years.\n\nThe discovery also emphasizes the need to follow certain important security hygiene\npractices, including:\n\n**Use Multifactor Authentication (MFA) – Multifactor authentication works as a fail-safe if a**\nmalicious actor has gained access to your credentials. As a last line of defense, MFA offers a\nsecond form of verification requirement in order to access an account.\n\n**Reset Your Passwords Periodically – Don’t use the same password across various**\naccounts and regularly update passwords. If you use the same password for all your\naccounts, it can leave you open to multiple attacks if one account is compromised. Consider\nusing unique passphrases and more than 14 characters for stronger passwords.\n\n**Use a Password Manager – Password managers can generate stronger passwords for you,**\nand they do not require you to memorize them.\n\n\n-----\n\n**Review settings and limit access to third-party apps from your email – In a few**\ninstances, the operators had to change account preferences to permit third-party apps to\nconnect with compromised accounts. These settings allowed the threat actor to extend the\naccess they had to other victims.\n\nAdditional analysis of ITG18’s tactics, techniques and procedures (TTP) and is available on\nour [Enterprise Intelligence Management platform via TruSTAR, which was originally](https://www.ibm.com/security/services/threat-intelligence?_ga=2.28708540.1002628176.1592838868-4270579.1568064726&cm_mc_uid=90799141567315645831974&cm_mc_sid_50200000=41752291592838866983&cm_mc_sid_52640000=34585721592838867019)\npublished June 2, 2020.\n\n**Responsible Disclosure**\n_During the course of the investigation and where possible, IBM X-Force IRIS notified the_\n_appropriate parties about the activity and compromised accounts._\n\n[Allison Wikoff](https://securityintelligence.com/author/allison-wikoff/)\nStrategic Cyber Threat Analyst, IBM Security\n\nAllison Wikoff is a strategic cyber threat analyst with IBM X-Force Incident Response and\nIntelligence Services (IRIS). She has over 15 years of experience ...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-16 - New Research Exposes Iranian Threat Group (APT35-ITG18) Operations.pdf"
    ],
    "report_names": [
        "2020-07-16 - New Research Exposes Iranian Threat Group (APT35-ITG18) Operations.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "82f54603-89e0-4f5a-8df9-eae0c3a90d70",
            "created_at": "2022-10-25T16:07:23.745406Z",
            "updated_at": "2025-03-27T02:02:09.958406Z",
            "deleted_at": null,
            "main_name": "ITG18",
            "aliases": [],
            "source_name": "ETDA:ITG18",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536003,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1653787801,
    "ts_modification_date": 1653787801,
    "files": {
        "pdf": "https://archive.orkl.eu/4aa30104806a8a632a9a7f02f777aa2d56211a21.pdf",
        "text": "https://archive.orkl.eu/4aa30104806a8a632a9a7f02f777aa2d56211a21.txt",
        "img": "https://archive.orkl.eu/4aa30104806a8a632a9a7f02f777aa2d56211a21.jpg"
    }
}