{
    "id": "4b597fdf-a85f-4b56-8557-1c754ef63b3c",
    "created_at": "2023-01-12T15:02:29.636373Z",
    "updated_at": "2025-03-27T02:16:20.79907Z",
    "deleted_at": null,
    "sha1_hash": "b77ba3f9a77abca1ec91aef5df3bb62e03511ee9",
    "title": "2020-10-28 - Turla uses HyperStack, Carbon, and Kazuar to compromise government entity",
    "authors": "",
    "file_creation_date": "2022-05-27T23:16:27Z",
    "file_modification_date": "2022-05-27T23:16:27Z",
    "file_size": 493236,
    "plain_text": "# Turla uses HyperStack, Carbon, and Kazuar to compromise government entity\n\n**[accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity](https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity)**\n\nTurla, identified internally by Accenture Cyber Threat Intelligence as Belugasturgeon,\ncontinues to target government organizations using custom malware, including updated\nlegacy tools, designed to maintain persistence through overlapping backdoor access while\nevading their victim’s defenses. One such tool, the HyperStack backdoor (named after its\nfilename on one identified sample), has seen significant updates that appear to be inspired\n[by the group’s Carbon backdoor and the RPC backdoor described by ESET researchers.](https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/)\n\n[Turla has conducted espionage operations on behalf of its state sponsor for over a decade.](https://docs.broadcom.com/doc/waterbug-attack-group)\nThe group primarily targets foreign governments and embassies using advanced custom\ntools designed to stay hidden for long periods of time. The activity identified by Accenture\nthreat researchers is within the group’s typical targeting set using their custom tools, albeit\nwith some updates.\n\n**Tactics**\n\nAccenture Cyber Threat Intelligence researchers identified a Turla compromise of a\nEuropean government organization. During this compromise Turla utilized a combination of\nremote procedure call (RPC)-based backdoors, such as HyperStack and remote\nadministration trojans (RATs), such as Kazuar and Carbon, which ACTI researchers\nanalyzed between June and October 2020. The RATs transmit the command execution\n\n\n-----\n\nresults and exfiltrate data from the victim s network while the RPC-based backdoors use the\nRPC protocol to perform lateral movement and issue and receive commands on other\nmachines in the local network. These tools often include several layers of obfuscation and\ndefense evasion techniques.\n\nThis combination of tools has served Turla well, as some of their current backdoors use code\n[that dates back to 2005, according to Palo Alto researchers. The threat group will likely](https://unit42.paloaltonetworks.com/unit42-kazuar-multiplatform-espionage-backdoor-api-access/)\ncontinue to maintain and rely on this ecosystem, and iterations of it, as long as the group\ntargets Windows-based networks.\n\nTurla uses a variety of command and control (C&C) implementations within each\ncompromise which allows for multiple avenues of reentry if parts of the compromise are\nidentified by defenders. Notably, Accenture researchers recently identified novel command\nand control (C&C) configurations for Turla’s Carbon and Kazuar backdoors on the same\nvictim network. The Kazuar instances varied in configuration between using external C&C\nnodes off the victim network and internal nodes on the affected network, and the Carbon\ninstance had been updated to include a Pastebin project to receive encrypted tasks\nalongside its traditional HTTP C&C infrastructure.\n\n**HyperStack functionality**\n\nHyperStack, first observed in 2018, is one of several RPC backdoors Turla uses. A sample\nidentified in September 2020 has updated functionality which appears to be inspired the RPC\n[backdoors previously publicly disclosed by ESET and](https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/) [Symantec Researchers as well as with](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/waterbug-espionage-governments?om_ext_cid=biz_social_blogs-social_fb_s10354)\nthe Carbon backdoor. Based on these similarities, we assess with high confidence that\nHyperStack is a custom Turla backdoor.\n\n<<< Start >>>\n\n\n-----\n\nComparison of Hyperstack to Turla's carbon and RPC backdoors\n\n<<< End >>>\n\nHyperStack uses named pipes to execute remote procedure calls (RPC) from the controller\nto the device hosting the HyperStack client. To move laterally, the implant tries to connect to\nanother remote device’s IPC$ share, either using a null session or default credentials. IPC$\nis a share that facilitates inter-process communication (IPC) by exposing named pipes to\nwrite to or read from. If the implant’s connection to the IPC$ is successful, the implant can\nforward RPC commands from the controller to the remote device, and likely has the\ncapability to copy itself onto the remote device.\n\n<<< Start >>>\n\n\n-----\n\nHyperStack usage\n\n<<< End >>>\n\nAnother version of HyperStack observed in this campaign contained a simpler functionality,\nallowing Turla operators to run commands via a named pipe from the controller to the\nimplant, without any of the IPC$ enumeration activity.\n\n**Varied command and control**\n\nAnalysis of several backdoors identified in this recent operation revealed that Turla has relied\non traditional C&C implementations, using compromised web servers as C&C, as well as\nutilizing legitimate web services like Pastebin. Additionally, one analyzed sample of Kazuar is\nconfigured for commands sent through likely internal nodes in the government's network,\nwhile others use the more traditional method of external C&C nodes. Varying the C&C\nensures multiple avenues of recovery into the network if some of the group’s accesses are\nfound and remediated against by network defenders.\n\n_Kazuar - Command and Control_\n\n[In mid-September, we analyzed a sample of Kazuar that, unlike traditional Kazuar samples,](https://www.epicturla.com/blog/sysinturla)\nis configured to receive commands via Uniform Resource Identifiers (URI) pointing to internal\nC&C nodes in the victim government network.\n\nThis Kazuar configuration acts in conjunction with another sample, analyzed in early\nOctober, on the same victim network. Based on references to the internal C&C node, the\nOctober sample likely acts as a transfer agent used to proxy commands from the remote\nTurla operators to the Kazuar instances on internal nodes in the network via an internetfacing shared network location. This set-up allows Turla operators to communicate with\nKazuar-infected machines in the victim network that are not accessible remotely.\n\n\n-----\n\n<<< Start >>>\n\nKazuar C&C unique implementation\n\n<<< End >>>\n\nAnother recently analyzed sample of Kazuar from the same victim network had a traditional\nC&C implementation where the implant communicates directly with a C&C server located\noutside the victim network. The C&C URLs correspond to compromised legitimate websites\nfor Turla to proxy commands and exfiltrate data to Turla backend infrastructure.\n\n<<< Start >>>\n\nKazuar C&C traditional implementation\n\n<<< End >>>\n\n_Carbon - Command and control using Pastebin_\n\n[Turla has extensively used Carbon, a modular backdoor framework with advanced peer-to-](https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/)\npeer capability, for several years. A June 2020 analyzed instance of the Carbon backdoor\naugmented the traditional threat actor-owned C&C infrastructure with tasks served from\nPastebin, a legitimate web service. The Carbon installer discovered by ACTI analysts\ndropped a Carbon Orchestrator, two communication modules, and an encrypted\nconfiguration file\n\n\n-----\n\nThe configuration file contains C&C URLs traditionally observed in Carbon instances, which\nare likely compromised web servers hosting a web shell that transmits commands and\nexfiltrates data from the victim network. It also contains a parameter labeled\n\n[RENDEZVOUS_POINT] which contains a URL for a Pastebin project.\n\nWhen accessing the Pastebin URL, an encrypted blob is downloaded that requires a\ncorresponding RSA private key from the configuration file. The configuration file analyzed did\nnot contain the RSA private key and therefore we were unable to decrypt the contents of the\nPastebin link. We assess the decrypted blob was likely a task for the Carbon instance.\n\nExploiting legitimate web services for C&C\n\nWe are increasingly observing cyber-espionage groups use legitimate web services for their\noperational command and control, and Turla is no exception to this trend.\n\nGroups likely use these services for several reasons:\n\nWeb services allow cyber-espionage groups' malicious network traffic to blend easily\nwith legitimate network traffic\nThreat groups can easily change or create new infrastructure which makes it difficult for\ndefenders to shut down or sinkhole their infrastructure\nUsing web services complicates attribution since the C&C infrastructure is not owned\nby the threat group\n\nAdditionally, web services have the added benefit of being free or inexpensive and requiring\nlimited resources for creation and maintenance.\n\n**Conclusion**\n\nTurla will likely continue to use its legacy tools, albeit with upgrades, to compromise and\nmaintain long term access to its victims because these tools have proven successful against\nwindows-based networks. Government entities, in particular, should check network logs for\nindicators of compromise and build detections aimed at thwarting this threat actor.\n\nThe [Accenture Cyber Threat Intelligence (ACTI) team provides actionable and relevant](https://www.accenture.com/us-en/services/security/cyber-defense?src=curated+daily+content_twitter_100001148493693)\nthreat intelligence to support decision makers. The intelligence analysis and assessments in\nthis report are grounded in verified facts; more information on this activity is available to\nsubscription customers on ACTI IntelGraph. IntelGraph is a proprietary next generation\nsecurity intelligence platform that allows users to search, visualize, and contextualize the\nrelationships between malicious actors, their tools and the vulnerabilities they exploit.\n\n**MITRE ATT&CK techniques**\n\n**Tactic** **Technique ID** **Technique name**\n\n\n-----\n\nExecution [T1059](https://attack.mitre.org/techniques/T1059/)\n[T1569](https://attack.mitre.org/techniques/T1569/002/)\n\n\nCommand-line Interface\nService Execution\n\n\nPersistence [T1543](https://attack.mitre.org/techniques/T1543/) New Service\n\nPrivilege Escalation [T1543](https://attack.mitre.org/techniques/T1543/) New Service\n\n\nDiscovery [T1135](https://attack.mitre.org/techniques/T1135/)\n[T1012](https://attack.mitre.org/techniques/T1012/)\n\n\nNetwork Share Discovery\nQuery Registry\n\n\nLateral Movement [T1021](https://attack.mitre.org/techniques/T1021/002/) Windows Admin Shares\n\n\nCommand and Control [T1102](https://attack.mitre.org/techniques/T1102/)\n[T1001](https://attack.mitre.org/techniques/T1001/)\n[T1090](https://attack.mitre.org/techniques/T1090/001/)\n[T1071](https://attack.mitre.org/techniques/T1071/001/)\n\n**Accenture Security**\n\n\nWeb Service\nData Obfuscation\nProxy\nStandard Application Layer Protocol\n\n\nAccenture Security is a leading provider of end-to-end cybersecurity services, including\nadvanced cyber defense, applied cybersecurity solutions and managed security operations.\nWe bring security innovation, coupled with global scale and a worldwide delivery capability\nthrough our network of Advanced Technology and Intelligent Operations centers. Helped by\nour team of highly skilled professionals, we enable clients to innovate safely, build cyber\nresilience and grow with confidence. Follow us @AccentureSecure on Twitter or visit us at\n[www.accenture.com/security.](http://www.accenture.com/security)\n\nAccenture, the Accenture logo, and other trademarks, service marks, and designs are\nregistered or unregistered trademarks of Accenture and its subsidiaries in the United States\nand in foreign countries. All trademarks are properties of their respective owners. All\nmaterials are intended for the original recipient only. The reproduction and distribution of this\nmaterial is forbidden without express written permission from Accenture. The opinions,\nstatements, and assessments in this report are solely those of the individual author(s) and do\nnot constitute legal advice, nor do they necessarily reflect the views of Accenture, its\nsubsidiaries, or affiliates. Given the inherent nature of threat intelligence, the content\ncontained in this report is based on information gathered and understood at the time of its\ncreation. It is subject to change. Accenture provides the information on an “as-is” basis\nwithout representation or warranty and accepts no liability for any action or failure to act\ntaken in response to the information contained or referenced in this report.\n\nCopyright © 2020 Accenture. All rights reserved.\n\n**Technical details**\n\n_HyperStack Execution Routine_\n\n\n-----\n\nUpon execution, HyperStack undergoes a similar registry key check to Turla s [RPC backdoor](https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/)\nand updates the same registry key to determine which named pipes can be accessed\nanonymously. The HyperStack backdoor first copies itself to C:\\ADSchemeIntegrity.exe and\nthen installs itself with system-level privileges as the service Active Directory Scheme\nIntegrity Service. HyperStack checks for the following registry entry and, when found, adds\nthe name of its communication pipe (‘adschemerpc’) to the key value:\n\nHKLM\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\lanmanserver\\\\parameters\\NullSessionPipes\n\nTo make the pipe available to anyone, HyperStack sets the security descriptor for the pipe to\nS:(ML;;NW;;;S-1-16-0)—a method that Turla also uses in its RPC backdoor.\n\n_HyperStack Custom Handshake_\n\nNext, HyperStack uses a custom handshake that is similar to handshakes used for Carbon\nnamed-pipe communications. To detect incoming connections from the controller, the\nHyperStack implant uses the Windows API call ‘ConnectNamedPipe’. When HyperStack\nreceives an incoming connection, it starts a new thread and continues with the custom\nhandshake. The malware reads 8 bytes from the pipe and checks if it matches :\nB19B055CA11CACA0. If it matches, the HyperStack implant returns the value\nCACA05ACCE55F11E to the controller. Similar 8-byte hex values are exchanged as part of\nthe [Carbon backdoor’s custom handshake.](https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/)\n\n_Configuration file_\n\nHyperStack writes a configuration file named backport.inf, the same file format as the Carbon\nmalware's configuration file. The configuration file is written to\n%SystemRoot%\\INF\\backport.inf and contains a [Version] section with various keys:\n\n<<< Start >>>\n\nFigure 1. HyperStack configuration file\n\n<<< End >>>\n\nThe [Version] section of the file contains several keys that the malware writes including:\n\nType – Likely a form of version control. The malware sets the Type key to SilentMoon.\nCLSID – The class ID for the implant seeded with a call to rand().\nPRVK – Stores the RSA key pair needed for session key encryption.\nRevision and Signature – Read from the file prior to RSA key generation.\n\n\n-----\n\nHyperStack checks the configuration file to determine if the Type equals SilentMoon. If yes, it\ngenerates an RSA PKCS key using CryptGenKey that is used for encryption of\ncommunication session keys. It then writes the RSA key to the PRVK key in the [Version]\nsection of the config file. Turla’s [Carbon backdoor also implements RSA encryption on the](https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/)\nsession keys for some of its C&C channels.\n\n_Use of inter-process communication (IPC$) share_\n\nHyperStack sets the registry key HKLM\\SYSTEM\\CurrentControlSet\\Control\\LSA\\Restrict\nAnonymous value to 0 so anonymous logon users (i.e., null session connections) can list all\naccount names and enumerate all shared resources on a remote share. The implant can\nthen use the WNetAddConnection2 API call to connect to another remote device's IPC$\nshare. IPC$ is a share that facilitates inter-process communication (IPC) by exposing named\npipes to write to or read from. The implant attempts to connect to the IPC$ share using a null\nsession, or if this fails, with default credentials.\n\nHyperStack uses named pipes to execute remote procedure calls (RPC) from the controller\nto the device hosting the HyperStack implant. If the implant’s connection to the IPC$ is\nsuccessful, the implant can forward RPC commands from the controller to the remote device,\nand likely has the capability to copy itself onto the remote device.\n\nTurla also used the IPC$ share during the lateral movement stage of its compromise of\nSwiss defense firm RUAG, according to the Swiss Government Computer Emergency\n[Response Team's technical report describing the incident.](https://www.melani.admin.ch/melani/en/home/dokumentation/reports/technical-reports/technical-report_apt_case_ruag.html)\n\n_Message and log files_\n\nThe HyperStack implant writes command results and error messages to log files stored in\nthe %Temp% directory. The log files have randomly generated names with the prefixes ‘sm’\nand ‘~D’. Turla uses the same ‘~D’ prefix for the names of Carbon log files. The HyperStack\nimplant also searches for log files with the prefix ~X and deletes them, suggesting it may be\ncleaning up after previous versions or another malware family's logs.\n\nAnother version of HyperStack observed in this campaign contained a simpler functionality,\nallowing Turla operators to run commands via a named pipe from the controller to the\nimplant, without any of the IPC$ enumeration activity.\n\nThe similarities between the updated functionality in the HyperStack implementation found in\nSeptember 2020, the RPC backdoor, and the Carbon malware suggest these HyperStack\nupdates were inspired by Turla’s other malware operations, potentially in response to\nremediation activity taken by the victim.\n\n**IOCs**\n\nTo mitigate the threat of Carbon, Kazuar, and HyperStack, ACTI recommends checking\nnetwork logs for indicators related to these backdoors including the following IOCs:\n\n\n-----\n\n**SHA256** **Filename** **NAME**\n\n\ne888b93f4d5f28699b29271a95ccad55ca937977d4\n2228637ad9a7c037d3a6a4\n\n1f7b35e90b5ddf6bfd110181b1b70487011ab29ca5f9\n42170af7e8393a1da763\n\n1fca5f41211c800830c5f5c3e355d31a05e4c702401\na61f11e25387e25eeb7fa\n\n60000bc2598eff85a6a83d5302fc3ed2565005d8f\nd0d9f09d837123a1599ef8d\n\n493e5fae191950b901764868b065ddddffa4f4c9b4\n97022ee2f998b4a94f0fc2\n\nf3aaa091fdbc8772fb7bd3a81665f4d33c3b62bf98c\naad6fee4424654ba26429\n\n2b969111dd1968d47b02d6390c92fb622cd03570b\n02ecf9215031ff03611a2b7\n\n7d5794ad91351c7c5d7fbad8e83e3b71a09baac65fb\n09ca75d8d18339d24a46f\n\n8ef22c8b5d6bc2445d3227650804b2e1435a5f9861\n34a9aa7e07f3b948921b5b\n\n6ca0b4efe077fe05b2ae871bf50133c706c7090a54\nd2c3536a6c86ff454caa9a\n\n722fa0c893b39fef787b7bc277c979d29adc1525d77\ndd952f0cc61cd4d0597cc\n\n\nDebugView.exe Kazuar\nbackdoor\n\nAgent.exe Kazuar\nbackdoor\n\nRuntimeBroker.exe Kazuar\nbackdoor\n\nWSUSTransfer.exe Kazuar\nBackdoor\n\nDSCEBIN.EXE Carbon\nInstaller\n\nsacril.dll Carbon\nOrchestrat\n\nablhelper.dll Carbon\nCommunic\nFile\n\nfrontapp.dll Carbon\nCommunic\nFile\n\nestdlawf.fes Carbon\nConfigurat\nFile\n\n\nADSchemeIntegrity\n.exe\n\n101_iex_memory_code\n_exe.exe\n\n\nHyperStac\n\nRPC backd\n\n\n-----\n\n97187123b80b1618f0d8afc2a5f84e9a17ac8e53a6e4\nce8b0aa39fe06cec1f36\n\n20691ff3c9474cfd7bf6fa3f8720eb7326e6f87f64a1f\n190861589c1e7397fa5\n\ne33580ae3df9d27d7cfb7b8f518a2704e55c92dd74\ncbbab8ef58ddfd36524cc8\n\nC&C URLs for Carbon implant\n\nwww.berlinguas[.]com/wp-content/languages/index.php\nwww.balletmaniacs[.]com/wp-includes/fonts/icons/\npastebin[.]com:443/raw/5qXBPmAZ\nsuplexrpc – Named pipe\n\nC&C URLs for Kazuar implant\n\n\n1.ps1 Reflective\nPowerShe\nloader\n\nhyperstack.exe HyperStac\n\n\nADSchemeIntegrity\n.exe\n\n\nHyperStac\n\n\nhttps://www.bombheros[.]com/wp-content/languages/index[.]php\nhttps://www.simplifiedhomesales[.]com/wp-includes/images/index.php\nhttp://mtsoft.hol[.]es/wp-content/gallery/\nhttp://www.polishpod101[.]com/forum/language/en/sign/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-28 - Turla uses HyperStack, Carbon, and Kazuar to compromise government entity.pdf"
    ],
    "report_names": [
        "2020-10-28 - Turla uses HyperStack, Carbon, and Kazuar to compromise government entity.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535749,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653693387,
    "ts_modification_date": 1653693387,
    "files": {
        "pdf": "https://archive.orkl.eu/b77ba3f9a77abca1ec91aef5df3bb62e03511ee9.pdf",
        "text": "https://archive.orkl.eu/b77ba3f9a77abca1ec91aef5df3bb62e03511ee9.txt",
        "img": "https://archive.orkl.eu/b77ba3f9a77abca1ec91aef5df3bb62e03511ee9.jpg"
    }
}