{
    "id": "4b5c60cb-021b-444c-8ffd-db1b88344951",
    "created_at": "2023-01-12T15:00:14.280149Z",
    "updated_at": "2025-03-27T02:06:02.98461Z",
    "deleted_at": null,
    "sha1_hash": "81c9e9de34635afebc06e63c153a852dffeac7cc",
    "title": "2020-03-24 - A new technique to analyze FormBook malware infections",
    "authors": "",
    "file_creation_date": "2022-05-28T04:57:52Z",
    "file_modification_date": "2022-05-28T04:57:52Z",
    "file_size": 2212752,
    "plain_text": "# A new technique to analyze FormBook malware infections\n\n**[insights.oem.avira.com/a-new-technique-to-analyze-formbook-malware-infections/](https://insights.oem.avira.com/a-new-technique-to-analyze-formbook-malware-infections/)**\n\nMarch 19, 2020\n\n[FormBook is a well known malware family of data-stealers and form-grabbers. Sold on](https://malpedia.caad.fkie.fraunhofer.de/details/win.formbook)\n[hacking forums as ‘malware-as-a-service’ it has previously been used to target the](https://www.darkreading.com/endpoint/new-malware-as-a-service-offerings-target-mac-os-x-/d/d-id/1329112)\n[aerospace, defense, and financial sectors, and thoroughly researched. However, in this](https://www.fireeye.com/blog/threat-research/2017/10/formbook-malware-distribution-campaigns.html)\narticle we will use a new technique, developed by Avira researchers, to analyse the\ninfection process, breaking it down individual steps.\n\n## Overview\n\nBy: Malina Rosu, specialist virus analyst, Avira Protection Labs\n\nFormBook malware is typically spread through web browsers, mail, FTP clients and instant\nmessaging applications via malicious attachments such as Office documents and PDF files.\nThe malware can inject itself into processes and install function hooks through manual\nexecution of phishing emails and opening malicious attachments. Its capabilities include\ncapturing screenshots, stealing credentials, keystroke logging, and clearing browser\ncookies. Data thefts are most effective when the victims use a virtual keyboard, auto-fill, or if\nthey copy and paste information to fill a form.\n\nThe FormBook infection takes place in multiple stages. In our example the infection begins\nwhen a user receives an email with a malicious Office .docx file attachment presented as a\npurchase order. Other files included are a Rich Text Format file with seven other embedded\nExcel files, two script files (one VBS file, one image file which is actually a obfuscated script\nfile) and some Powershell commands.\n\n\n-----\n\nThere are six different steps in the process, not all of which are immediately obvious, but\ncan be understood when the entire process is completed. For example, the malware\ndeletes the notepad.exe from System32 because the malware will ultimately execute under\nthis name.\n\n\n-----\n\n## Infection Analysis\n\n\n-----\n\nThe infection vector in our example is an email. It apparently contains a valid purchase\norder (PO20200217.docx) that appears to have been sent to the wrong email address.\n\n## Stage 1: Analyzing the attachment – the docx documents\n\nWe execute the document in a virtual environment allowing us to check its malware\ncapabilities. The document connects to a URL, and attempts to download the payload via a\nconnected URL – a Rich Text Format file.\n\n\n-----\n\nIt is a docx file with Open Office XML format. In settings.xml.rels resides an xml file with an\nexternal relationship of type attachedTemplate embedded in the document that redirects to\nan external resource.\n\nAfter the payload is successfully downloaded, a PowerShell command is used to delete the\nnotepad.exe from the System32 folder\n\n## Stage 2: Analyzing the first payload – the rtf document\n\nAnalyzing the .rtf file document with RTFScan, reveals eight OLE embedded objects. Seven\nout of the eight objects were similar Excel files, all being executed as seen in the Process\nMonitor capture:\n\n\n-----\n\n## Stage 3: Analyzing the second payload – the xls documents\n\nWe show the analysis flow for one of the Excel documents below, because they are all\nsimilar. The file name ‘payload_1.exe’ together with a low number of detections from\nVirusTotal make them suspicious.\n\nExecution of the Excel documents results in warning pop-ups for Enable Content,\nrequesting the user to enable macros. Enabling macros have no effect on the document, it\nappears damaged.\n\n\n-----\n\nAt this point, many users would close the file and move on. However, before executing the\nfile, we analyzed the file behaviour on Process Monitor. The files were not damaged at all,\nas shown below:\n\nThe attackers have hidden the document file on purpose, making it appear blank when\nopened. Now the obvious question is; how does the file manage to execute the PowerShell\nscript? Well, remember the Enable Content warning? This points to the fact that there may\nbe macro code:\n\nThe macro code is executed before the document is closed, and it appears that it executes\nthe text it finds in the TextBox 1. But it’s hidden as it contains a Powershell command.\n\n\n-----\n\nThe command, hidden in the textbox, downloads and executes a Visual Basic script. As\nshown in the below image:\n\nThe script file also had only a few detections from AV scanners in VirusTotal.\n\n## Stage 4: Analyzing the first payload – the Visual Basic Script\n\nTo avoid detection the Visual Basic script is obfuscated using string manipulation functions\nsuch as reverse, split, replace, concatenation and hex encoding.\n\nWe hex-decoded the Fly subroutine. The malicious script that executed in the global\nnamespace overwrites the initial Fly subroutine. This is shown by the two Fly subroutine\ncalls at the very beginning of the malicious script.\n\n\n-----\n\nThe new Fly subroutine makes use of the Windows Management Instrumentation to\nexecute the PowerShell script received as parameter. This is done with hidden property\nenabled to hide its presence from the user.\n\nThe PowerShell makes a GET request to the website. It manipulates the response to\ndownload the fifth stage payload.\n\nThe script achieves persistence by copying itself to “\\Appdata\\Roaming\\” folder and adding\nitself to the current user registry Run key.\n\n## Stage 5: Analyzing the second payload – the att.jpg image\n\nTo establish if the jpg file was indeed an image, we use the Hex editor. The .jpg file had the\nfirst four bytes FF D8 FF EO, so it is unlikely to be what it claims. The character “-” linking\nthe bytes also indicates that the file is not legitimate:\n\n\n-----\n\nTo examine the malicious file, and figure out what the file hides, we need to understand how\nthe script manipulates the file after downloading it. It performs a split action by “-“, and then\na hex to ascii decoding. The below image shows two very long hex encoded strings – Cli1\nand Cli2, and a function – UNpack.\n\nThe UNpack function performs a Gzip decompression of the Cli string. Since the magic\nnumber for a GZIP archive file is 1F 8B 08 (as seen in the first part of the string) it seems\nlikely that it is a GZIP. We get the payload (a dynamic library file) after decompressing the\nGzip byte array, and replacing “$%” in the Cli string. The dynamic library file – Pineapple.dll\n– is loaded in the following line of script.\n\nFollowing similar steps, we conclude that the second string is an executable file –\nattack2_cli2.exe_, part of the FormBook malware family. Avira detects it as\nTR/Crypt.ZPACK.Gen. The file is executed under the name notepad.exe.\n\nThis is the main reason why the first document deleted the legitimate notepad executable\nfile from System32 folder.\n\n## Conclusion\n\nFormBook malware is very agile in its behavior and effective in hiding malicious intent. It\ncan easily trick users into executing it. Despite not being broadly used, FormBook\nrepresents a real threat: It is stealthier and more powerful than other malware.\n\n\n-----\n\nYou can learn more about new and novel malware in the research section of the Avira\nInsights blog, or find out how you can improve your own detection rates by using\nAvira’s [Anti-malware SDKs or](https://oem.avira.com/en/solutions/software-development-kits) [cloud sandbox API.](https://oem.avira.com/en/solutions/cloud-sandbox-api)\n\n## IOCs\n\nSHA256 File\ntype\n\na8c6456fb40ee49af00ac856c7ec58f314bb593f5aca991d0c8adc18ca5e3868 eml\n\n9227ad6740207c4150a96b38c42792e57aa6258ab56763c1e9c4df7d97239559 eml\n\n468313d0dea135d610d08cda83d34523f48f0e7a9e829eb88ec24dcc2e7b8bfb eml\n\n85218477e69ef0889cc78566c972c53332046f1c5d1201bae9bf288fafa27c53 docx\n\n1e031429d31c0d3e456669636d6ab370d1ca8fe02df702c7b875bc50ae43245b rtf\n\nf0b21a76949e1403e948acc020d6c3f03ffdb338a15bd3006e7eb5c40da69cf0 xls\n\n811dfd3270bd9203c65d3e1f737cbabf2404b83507f90f416a2dcae28cc223d2 xls\n\nf12de42e9bd05e89256f1aa70ba90cae8178826e3b751d4f98fd40d4119196d6 xls\n\n74902beea45467517e9f29131b2633110c090dc07f4b158089fc74baaf84ab98 xls\n\nce7bb44456aed206be1bc2cda0e6e33a209b1939745dce5060b3342d135205bc xls\n\n2dd3cec76010e43b0e594a2d3d693be9d6e14e946e1ddea1bec02ccbcae9b854 xls\n\nf38b76f7792bb6d5d372c79fb943a777d05f32c5e041e7505ce623aff9b8de0e xls\n\n96be0e8c566a0568f67efda85d0f522a9627973db4098d80c3a91ccd424540f7 xls\n\n187ac08a1c4f8b8111824083a200824113474eca9e7b9807ed1d81e2d653b558 xls\n\n3024bd7d2f89ec07350a13f7fa74a4e83e9f434266c37cbecaa56d68233ef416 xls\n\n1d67c5459b79801bca4192c1b4e80344cd7706272e6e6b7cd6e8cbd7c10caad4 vbs\n\nf9f7c1312d20d68fc09d4fea2b58a52b6374f5b2ec88be162f655146379e1231 exe\n\n18a86d81ef592cb588e609a66c03793f93dd3466a7e9403280c81bd0034bbdad dll\n\n47405c182c4f99dd120fb0b7fded1720a9e44bad379a6304cd067027fadfcd32 att.jpg\n– script\nfile\n\n\n-----\n\nAvira Protection Labs\n\nProtection Lab is the heart of Avira’s threat detection and protection unit. The researchers\nat work in the Labs are some of the most qualified and skilled anti-malware researchers in\nthe security industry. They conduct highly advance research to provide the best detection\nand protection to nearly a billion people world-wide.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-24 - A new technique to analyze FormBook malware infections.pdf"
    ],
    "report_names": [
        "2020-03-24 - A new technique to analyze FormBook malware infections.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535614,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653713872,
    "ts_modification_date": 1653713872,
    "files": {
        "pdf": "https://archive.orkl.eu/81c9e9de34635afebc06e63c153a852dffeac7cc.pdf",
        "text": "https://archive.orkl.eu/81c9e9de34635afebc06e63c153a852dffeac7cc.txt",
        "img": "https://archive.orkl.eu/81c9e9de34635afebc06e63c153a852dffeac7cc.jpg"
    }
}