{
    "id": "4b973b56-ff98-4a71-a630-927a6791c33c",
    "created_at": "2023-01-12T15:01:25.85986Z",
    "updated_at": "2025-03-27T02:15:06.291026Z",
    "deleted_at": null,
    "sha1_hash": "990d5fb50b6c0f5a778c061fe8d33a89e45b01fa",
    "title": "2020-03-12 - Targeted Surveillance Attacks in Uzbekistan- An Old Threat with New Techniques",
    "authors": "",
    "file_creation_date": "2022-10-23T13:00:03Z",
    "file_modification_date": "2022-10-23T13:00:03Z",
    "file_size": 2361726,
    "plain_text": "# Targeted Surveillance Attacks in Uzbekistan: An Old Threat with New Techniques\n\n**[amnesty.org/en/latest/research/2020/03/targeted-surveillance-attacks-in-uzbekistan-an-old-threat-with-new-techniques/](https://www.amnesty.org/en/latest/research/2020/03/targeted-surveillance-attacks-in-uzbekistan-an-old-threat-with-new-techniques/)**\n\nMarch 12, 2020\n\n[Research\nMarch 12, 2020](https://www.amnesty.org/en/latest/research/)\n\n## Introduction\n\nA new Amnesty International investigation has identified a campaign of phishing and\nspyware attacks targeting Human Rights Defenders (HRDs) from Uzbekistan.\n\n[In May 2019, the Canadian non-profit organisation eQualitie released a report describing an](https://equalit.ie/deflect-labs-report-6/)\nattack campaign using web and phishing attacks against journalists and activists working on\nUzbekistan. Based on this report, we began tracking the group that was behind these\nattacks. We identified a broader infrastructure along with new Windows and Android spyware\nused by the attackers.\n\nDuring the investigation, we identified a partial list of targets that confirmed that activists and\njournalists were targeted by this campaign. This report documents a worrying evolution in the\nsurveillance threat facing HRDs in Uzbekistan, which now appear more sophisticated than\npreviously documented, and able to bypass some security tools HRDs use to protect\nthemselves against surveillance.\n\n## Human Rights and Surveillance in Uzbekistan\n\n\n-----\n\nAmnesty International has documented serious human rights violations, including pervasive\ntorture by security forces and arbitrary detention, in Uzbekistan. Impunity for past abuses\ncontinues to prevail despite recent reforms of the criminal justice system and the closure of\n[detention centers notorious for torture. While more independent media outlets have now](https://tbinternet.ohchr.org/Treaties/CAT/Shared%20Documents/UZB/INT_CAT_CSS_UZB_37515_E.pdf)\nbeen able to operate inside Uzbekistan, the rights to freedom of expression, association and\npeaceful assembly continue to be tightly regulated, and civil society activists face reprisals\nfor their peaceful activities.\n\nThe threat of torture, its actual use and sexual violence, have forced many HRDs,\ngovernment critics and independent journalists to leave Uzbekistan. The few who remain in\nthe country, including activists and journalists released from prison since 2017, and their\n[families, have continued to be under surveillance and have faced intimidation, threats and](https://www.amnesty.org/en/documents/eur62/0347/2019/en/)\n[arbitrary detention by the](https://www.amnesty.org/en/documents/eur62/0347/2019/en/) [police and the State Security Service (SGB).](https://www.amnesty.org/en/documents/eur62/0347/2019/en/)\n\nThis physical surveillance and repression of Human Rights Defenders and journalists have\nbeen supported by a well developed surveillance system. A Privacy International report from\n2014 described the technical capabilities deployed within the country to monitor internet and\nphone communications. An Amnesty International report from 2017 titled, ‘We will find you,\nanywhere’ described the threat of surveillance for HRDs including several cases of email\nhacking using phishing attacks. In 2018, Amnesty International published concerns about the\ndetention and interrogation of a number users of the social media platform Facebook in\nUzbekistan, based on administrative charges after they posted comments on their Facebook\naccounts or ‘liked’ and shared posts of other social media users. More recently in October\n[2019, Kaspersky presented the cyber-attack framework of a group called Sandcat that they](https://www.vice.com/en_us/article/3kx5y3/uzbekistan-hacking-operations-uncovered-due-to-spectacularly-bad-opsec)\nattribute to the Uzbekistani State-Security Services during a conference.\n\n## Phishing using Evolving Techniques\n\n**What is phishing?**\n\nCredentials phishing (or “Password-Stealing Phishing”) consists in the creation of a website\nthat imitates the login prompt of a given online service, such as Gmail or Facebook, with the\nobjective of luring a victim into visiting the malicious page and entering their username and\npasswords, thereby transmitting these credentials to the attackers.\n\nBased on the threat report published by eQualitie, we have investigated and tracked the\nevolution of the fake websites and internet infrastructure used by these attackers. The group\nwas very active between May and September 2019, when several dozens of domains were\ncreated. Many of these domains mimicked Google domains, such as\nacccountsgoog1e[.]com or auth-google[.]site, or generic email domains like auth-mail[.]email\n(Please note: the domains have been purposefully modified by Amnesty International with\nthe marking [.] in order to prevent accidental clicks and visits).\n\n\n-----\n\nAmnesty International\nScreenshot of mail-auth[.]online (May 2019)\nOriginally the attackers used cloned pages of, for example, Google login prompts in order to\nlure targets and steal credentials. This is the most traditional and typical phishing technique,\nbut it is rather simplistic. From June 2019 we observed an evolution in the phishing tactics\nadopted. Our research reveals that the group started to use a new phishing framework that\nacts as a relay between the phishing site and the real affected website, in order to bypass\nmost forms of Two-Factor Authentication. In technical language, this technique is often\nreferred to as “session hijacking” and the framework used as a “reverse proxy”.\n\n### What is Two-Factor Authentication (2FA)?\n\nTwo-factor authentication (often called 2FA) is the utilization of a second mean of\nauthentication beside a password. Common second factors include a temporary code\ndelivered by SMS, a temporary code given by a Smartphone Application (such as FreeOTP\nor Google Authenticator) and a code generated by a Hardware Security Key (like Yubikey or\nSolo Key).\n\nAttacks bypassing some forms of second factors are not new. We published a report in\nDecember 2018 warning HRDs about them in the context of a phishing campaign with\ntargets in the Middle-East and North-Africa. Latest attacks by this group in Uzbekistan\nrepresent the first time Amnesty International observed session hijacking used in attacks\nagainst HRDs, but several open-source tools published in 2018 and 2019, such as\n[Modlishka or](https://www.zdnet.com/article/new-tool-automates-phishing-attacks-that-bypass-2fa/) [Muraena, have already made this capability publicly available to the information](https://github.com/muraenateam/muraena)\nsecurity community.\n\n\n-----\n\nIn practice, a reverse proxy used for phishing will intercept all credentials and any two-factor\nauthentication code (typically retrieved via SMS or an authenticator app) and deliver them to\nthe legitimate service, such as; in this case, Google. The service will verify the credentials\nand, if correct, successfully authorize the victims to their accounts. However, because the\n_reverse proxy is monitoring the connection between the victim and the legitimate service, the_\nattackers are then able to steal any token generated to establish an authenticated session\nand reuse it to access the compromised account.\n\nAmnesty International\nReverse-Proxy phishing attack done to bypass 2FA protection\nWith this technique attackers can bypass most forms of second factor authentication, except\nSecurity Keys, such as [Yubikeys or](https://www.yubico.com/fr/yubikeys/) [SoloKeys, because these hardware tokens](https://solokeys.com/)\nprogrammatically enter a temporary code for a preregistered website only for the verified\nlegitimate domain. If a target is equipped with a Security Key, the phishing attack will fail\nbecause the key will refuse to authenticate on the malicious domain the attackers lured the\ntarget to.\n\nAmnesty International\n\n[Two different hardware tokens : SoloKeys and](https://solokeys.com/) [Yubikeys](https://www.yubico.com/products/)\n\n## Windows Spyware\n\n\n-----\n\nIn additional to the phishing attacks, in May 2019 we also identified two malicious Windows\ninstallers hosted on the domain msoffice365[.]win, which appears linked to the previously\ndescribed phishing campaign. Amnesty International identified an infected Adobe Flash\nPlayer installer and an infected Telegram Desktop installer, both deploying variants of the\nsame spyware along with the legitimate software.\n\nAmnesty\n\nInternational\nScreenshot of the installer of the Telegram Desktop installer modified to install the spyware\nOnce infected, the spyware toolkit used by the attackers will be capable of:\n\nLogging all key strokes;\nTaking screenshots of the desktop every few seconds;\nStealing password and cookies;\n\nAll the harvested data would then be sent to an attackers-operated server located at\nhpphhpph[.]com\n\nThe toolkit is composed of a variety of scripts seemingly developed by the attackers, and a\nTrojan software derived from a well-known tool known as Quasar Rat.\n\n## Android Spyware\n\nDuring the investigation, we identified an Android spyware communicating with the domain\ngarant-help[.]com, a Command and Control server we found linked to this campaign. This\nsample is an extended version of Droid-Watcher, an open-source Android spyware that was\n\n\n-----\n\ndiscontinued by its main developer in 2016. This sample seems largely based on the original\nDroid-Watcher code with some additional features and updates.\n\nThis spyware has the following features:\n\nExtract device information (configuration, IMEI, phone number, history of Wi-Fi\nnetworks, etc.);\nMonitor chat applications, including VKontakte, WhatsApp, Viber, Facebook, IMO,\nTamTam, Telegram;\nMonitor phone calls and text messages;\nRecord phone calls;\nRecord audio and video from the embedded microphone and cameras;\nTake screenshots;\nMonitor the clipboard;\nMonitor the geographical location of the device;\nExtract the browser history;\nReceive commands by text messages.\n\n## Identification of Targets\n\nWhile investigating the attackers’ infrastructure, we identified an open directory on one of the\nservers used to host phishing websites. This directory publicly exposed a collection of email\ntemplates, most likely used by the attackers to design and deliver the phishing emails to the\nrespective targets. Most of these files came pre-compiled with the email addresses of\ntargeted individuals.\n\nMost of these emails were disguised as email alerts from services such as Google or Mail.ru.\n\n\n-----\n\nAmnesty International\n\nAmnesty International\n\n\n-----\n\nAmnesty International\nFrom these exposed templates we identified 170 targeted accounts. Although we suspect\nthem to represent only a subset of the complete list of individuals targeted in this campaign.\nMost targets we identified are part of universities or governmental organisations of countries\nneighbouring Uzbekistan, along with several HRDs from Uzbekistan, who Amnesty\nInternational took steps to contact, notify and support.\n\n## Conclusion\n\n\n-----\n\nThis report documents that targeted surveillance remains a threat to HRDs in Uzbekistan.\nThe UN Special Rapporteur on the right to Freedom of Expression, David Kaye, has called\non states to impose an immediate moratorium on the export, sale, transfer, use or servicing\nof privately developed surveillance tools until rigorous human rights safeguards are put in\nplace to regulate such practices. Amnesty International supports this call. As the Special\nRapporteur has noted, “It is insufficient to say that a comprehensive system for control and\n_use of targeted surveillance technologies is broken. It hardly exists.”_\n\nThis call is especially urgent in the context of Uzbekistan where the legal framework for\nsecret surveillance provides insufficient safeguards against abuse and where direct state\naccess to data is facilitated by the SORM system (a system allowing state authorities to\n[directly access communication and associated data). It is well-established that, “even the](https://digitallibrary.un.org/record/777869?ln=en)\n_mere possibility of communications information being captured creates an interference with_\n_privacy, with a potential chilling effect on rights, including those to free expression and_\n_association.” Where –_ [as in](https://www.amnesty.org/en/documents/eur62/5974/2017/en/) [Uzbekistan – states fail to put in place adequate safeguards,](https://www.amnesty.org/en/documents/eur62/5974/2017/en/)\n[these chilling effects will lead to an environment in which HRDs cannot realize their rights](https://www.amnesty.org/en/documents/eur49/4306/2016/en/)\nand struggle to do their job effectively and in safety.\n\nIf you believe you have been targeted with attacks similar to the ones described here, or if\nyou are a Human Rights Defender working on Uzbekistan and you think you may be targeted\nby a similar operation, please contact us at:\n\n## Recommendations\n\n**To the Government of Uzbekistan:**\n\nReform laws to bring the legal regime and related surveillance practices in line with\ninternational human rights law and standards\n\n**To Other Governments:**\n\nImpose an immediate moratorium on the export, sale, transfer, use or servicing of\nprivately developed surveillance tools until a human rights compliant safeguards\nregime is in place\n\n**To Companies:**\n\nPut in place robust safeguards to ensure that any use of their products or services is\ncompliant with human rights standards.\n\n**To Users:**\n\n\n-----\n\nAs we have been reporting since December 2018, techniques to bypass common\nforms of two-factor authentication are becoming increasingly popular among attackers.\nTargeted individuals at risk should consider equipping themselves with hardware\nSecurity Keys, also known as U2F keys, and enable them wherever possible. With\nonline services, which do not support Security Keys yet, we nevertheless recommend\nenabling any other less resilient form of two-factor authentication available. For\nexample, secondary verification using codes delivered via SMS or an authenticator app\nstill provide better security than none at all, and can help thwart casual phishing or\npassword re-use.\n\nIf you want to read more about phishing and its countermeasures, please refer to Security\nWithout Borders’ [Guide to Phishing.](https://guides.securitywithoutborders.org/guide-to-phishing/)\n\n## Appendix : Technical Details on the Investigation\n\n### Phishing Using Reverse Proxies\n\nThis group is largely relying on phishing attacks: we have identified 71 domains hosting\nphishing websites between May and September 2019.\n\nOriginally, this group used HTML copies of login pages for phishing. In June 2019, we\nobserved the utilisation of a new tool that acted as a reverse proxy between the domains and\nthe actual platforms in order to hijack sessions. We believe that the attackers relied on a\ncustom-made JavaScript phishing tool.\n\nOne proof that these phishing domains were using reverse proxy technique is that we could\nfully interact with the Google platform through the fake domain. For instance we could use\nthe query “what is my IP?” to get the IP address of the reverse proxy server from the Google\nsearch engine:\n\n\n-----\n\nAmnesty International\nAt the same time we saw this change in the phishing toolkit, we started to see more and\nmore domains mimicking and proxying traffic to bank and cryptocurrency websites. The\nphishing domains and websites observed by eQualit.ie since 2016 and by us from May 2019\nalmost only copied large email providers (mostly Gmail, but also Yandex or Yahoo). From\nMay 2019 to July 2019, we started to see the attackers register and use domains imitating\nbank and cryptocurrency websites. We could attribute these domains to the same attacker\nnetwork because they were hosted on the same servers that hosted other phishing domains.\nFor instance the OVH server 51.83.97[.]40 hosted at the same time fake gmail domains like\ngmail-warning[.]top and fake bank domains like mynavyfedral[.]org in July 2019. This\nsuggests that the attackers might also be involved in online economic crime.\n\nAmnesty International\nPhishing website for FrostBank on frosdank[.]com (July 2019)\nHere is the list of such domains registered between May and July 2019:\n\n\n-----\n\n**Registration Date** **Malicious Domain** **Proxying Traffic or Mimicking**\n\n2019-05-02 navyfedera1[.]org https://www.navyfederal.org/\n\n2019-05-20 frostdank[.]com https://www.frostbank.com/\n\n2019-05-27 comericac[.]com https://www.comerica.com/\n\n2019-07-03 lamatrest[.]xyz https://www.bmo.com\n\n2019-07-16 mynavyfedral[.]org https//www.navyfederal.org/\n\n2019-07-17 desktest5[.]xyz https://www.scotiabank.com/\n\n2019-07-19 testdhome4[.]xyz https://www.blockchain.com/\n\n2019-07-29 xn--blckchain-17c[.]com https://www.blockchain.com/\n\n2019-08-07 xn--navyfderal-36a[.]com https://www.navyfederal.org/\n\n2019-08-07 xn--navyfedera-j0b[.]org https://www.navyfederal.org/\n\n2019-08-07 xn--bckchain-v3a30f[.]com https://www.blockchain.com/\n\n2019-08-15 xn--avfedera-yubm[.]org https://www.navyfederal.org/\n\n2018-09-22 rc-room[.]com https://www.coinbase.com/\n\nUnknown nitroqensports[.]eu https://nitrogensports.eu/\n\n## Windows Malware\n\nIn May 2019, we identified two backdoored Windows installers hosted on the domain\nmsoffice365[.]win, one Adobe Flash Player installer and one Telegram Desktop installer, both\ninstalling variants of the same malicious toolkit along with the legitimate software.\n\nBoth of these malicious samples rely on a set of vbs scripts and DLL to gather information on\nthe system and send it to the domain hpphhpph[.]com\n\nThe Fake Adobe Flash Player installs the following files :\n\nIn C:\\Program Files (x86)\\Adobe Company\\Adobe Flash Player\n\nAdobe Flash Player Updater.vbs\nflashplayer31pp_ka_install.exe (Legitimate Flash Player installer)\nUninstall.exe (Legitimate Uninstaller)\nUninstall.ini (Legitimate Uninstaller info file)\n\n\n-----\n\nIn C:\\Users\\User\\AppData\\Roaming\\Microsoft\\Adobe Flash Player\n\nAdobe Flash Player.dll\nAdobe Flash Player Key.vbs\n\nDuring the installation, the malicious script Adobe Flash Player Updater.vbs is launched\nalong with the legitimate installer flashplayer31pp_ka_install.exe. Adobe Flash Player\nUpdater.vbs is a VBS script in charge of registering a new compromised device to the\nCommand & Control server, gather information on the host (information on the device, list of\napplications, logs of Telegram chats, Firefox, The Bat email client and Total Commander FTP\ncredentials, Chrome, Firefox and Opera history) and schedule tasks to have Adobe Flash\nPlayer Updater.vbs and Adobe Flash Player Key.vbs launched every minutes.\n\nAdobe Flash Player Key.vbs is VBS script that launches Adobe Flash Player.dll, a tool that\ntakes a screenshot of the screen every seconds and run a KeyLogger, and then send the\nimages and keystrokes taken to the C&C server.\n\nAmnesty International\nThe Telegram Installer relies on variant of the same scripts with a few additional tools :\n\nGoogleUpdateTaskMachineKernel.vbs : a script to download additional modules from\nthe C&C server and run them through scheduled tasks\n\n\n-----\n\nEsetNod32_v3.5.dll and EsetNod32_v4.dll which are more advanced password and\ncookie stealers reusing code taken from the Quasar-RAT, an open source Windows\nmalware.\n\nAmnesty International\n\nThis patchwork of different tools combined with easy to update VBS scripts allow to heavily\nmonitor the activity of a compromised computer by sending every minute, any key stroke\ndone, screenshot, new password and browsing history, thus providing a complete view of the\nuser activity.\n\n### Android Malware\n\n[During our enumeration of the infrastructure, we identified an Android spyware](https://www.virustotal.com/gui/file/902c5f46ac101b6f30032d4c5c86ecec115add3605fb0d66057130b6e11c57e6/detection)\ncommunicating with one of the domains of this operation ( garant-help[.]com) as Command\n[and Control server. This sample is an improved version of Droid-Watcher, an open-source](https://github.com/Odrin/Droid-Watcher)\nAndroid malware that was discontinued by its main developer in 2016.\n\nOne update from Droid-Watcher is that this malware retrieves the location of the Command\nand Control server to communicate with, from an encoded string included in the description\nof a Twitter account registered at @Worldwi81061401 (we have notified Twitter about this\n\n\n-----\n\naccount, which was later suspended):\n\nAmnesty International\nScreenshot of the Twitter profile @Worldwi81061401 (July 2019, suspended now)\nThe encoded string in the profile description (LPLO8Z42NVS.Q3F) once decoded gives the\ndomain garant-help[.]com.\n\n## Indicators of Compromise\n\n[We are releasing here indicators of compromise for this campaign. If you think you have](https://github.com/AmnestyTech/investigations/tree/master/2020-03-12_uzbekistan)\nbeen targeted by this campaign, or if you have some information on this operation, please\ncontact us at\n\nYou can find a full list of indicators of compromise on this github repository :\n[https://github.com/AmnestyTech/investigations/tree/master/2020-03-12_uzbekistan](https://github.com/AmnestyTech/investigations/tree/master/2020-03-12_uzbekistan)\n\n## Related Content\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-12 - Targeted Surveillance Attacks in Uzbekistan- An Old Threat with New Techniques.pdf"
    ],
    "report_names": [
        "2020-03-12 - Targeted Surveillance Attacks in Uzbekistan- An Old Threat with New Techniques.pdf"
    ],
    "threat_actors": [
        {
            "id": "67ac502c-8cf8-46cb-98e8-c249e0f0298d",
            "created_at": "2022-10-25T16:07:24.149987Z",
            "updated_at": "2025-03-27T02:02:10.124302Z",
            "deleted_at": null,
            "main_name": "SandCat",
            "aliases": [],
            "source_name": "ETDA:SandCat",
            "tools": [
                "CHAINSHOT",
                "FinFisher",
                "FinFisher RAT",
                "FinSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "80cf66b8-27d2-4e87-b0d1-5bacacd9bb3d",
            "created_at": "2023-01-06T13:46:38.931567Z",
            "updated_at": "2025-03-27T02:00:02.954922Z",
            "deleted_at": null,
            "main_name": "SandCat",
            "aliases": [],
            "source_name": "MISPGALAXY:SandCat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535685,
    "ts_updated_at": 1743041706,
    "ts_creation_date": 1666530003,
    "ts_modification_date": 1666530003,
    "files": {
        "pdf": "https://archive.orkl.eu/990d5fb50b6c0f5a778c061fe8d33a89e45b01fa.pdf",
        "text": "https://archive.orkl.eu/990d5fb50b6c0f5a778c061fe8d33a89e45b01fa.txt",
        "img": "https://archive.orkl.eu/990d5fb50b6c0f5a778c061fe8d33a89e45b01fa.jpg"
    }
}