{
    "id": "4ba46975-fbab-4d2a-a3dc-23420c9b929a",
    "created_at": "2023-01-12T15:01:46.621855Z",
    "updated_at": "2025-03-27T02:05:25.503155Z",
    "deleted_at": null,
    "sha1_hash": "0d4e050377d7b1f87a75ed7995cce8afb1f3967a",
    "title": "2016-04-22 - New Poison Ivy RAT Variant Targets Hong Kong Pro-Democracy Activists",
    "authors": "",
    "file_creation_date": "2022-05-29T01:37:45Z",
    "file_modification_date": "2022-05-29T01:37:45Z",
    "file_size": 611783,
    "plain_text": "# New Poison Ivy RAT Variant Targets Hong Kong Pro- Democracy Activists\n\n**researchcenter.paloaltonetworks.com/2016/04/unit42-new-poison-ivy-rat-variant-targets-hong-kong-pro-democracy-**\nactivists/\n\nMicah Yates, Mike Scott, Brandon Levene, Jen Miller-Osborn April 22, 2016\n\nBy [Micah Yates,](https://unit42.paloaltonetworks.com/author/micah-yates/) [Mike Scott,](https://unit42.paloaltonetworks.com/author/mike-scott/) [Brandon Levene and](https://unit42.paloaltonetworks.com/author/brandon-levene/) [Jen Miller-Osborn](https://unit42.paloaltonetworks.com/author/jen-miller-osborn/)\n\nApril 21, 2016 at 7:45 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [DLL,](https://unit42.paloaltonetworks.com/tag/dll/) [PIVY,](https://unit42.paloaltonetworks.com/tag/pivy/) [Poison Ivy,](https://unit42.paloaltonetworks.com/tag/poison-ivy/) [SPIVY](https://unit42.paloaltonetworks.com/tag/spivy/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-new-poison-ivy-rat-variant-targets-hong-kong-pro-democracy-activists/)\n\nMalware writers have always sought to develop feature-rich, easy to use tools that are also\nsomewhat hard to detect via both host- and network-based detection systems. For many\nyears, one of the go-to families of malware used by both less-skilled and advanced actors\nhas been the Poison Ivy (aka PIVY) RAT. Poison Ivy has a convenient graphical user\ninterface (GUI) for managing compromised hosts and provides easy access to a rich suite of\npost-compromise tools. It is no surprise it’s now being used against pro-democracy\norganizations and supporters in Hong Kong that have long been a target of advanced attack\ncampaigns.\n\nDespite its simplicity and prevalence, detection rates for both AV and IDS systems has\nalways been surprisingly low for Poison Ivy. Possibly for these reasons, since the mid-2000s\nthreat actors have frequently used Poison Ivy to establish beachheads within target\norganizations, although this occurs much less frequently today than in years past. Since the\nlast public release of version 2.3.2 in 2008, new variants of the tool have been relatively rare,\nespecially versions which modify the core communication protocols.\n\nUnit 42 observed a new version of Poison Ivy which uses the popular search order hijacking,\n[a/k/a “DLL Sideloading,” technique frequently seen in malware such as PlugX. The Poison](https://attack.mitre.org/wiki/DLL_side-loading)\nIvy builder has an output format option of either PE file or shellcode, and in this case the\nbackdoor was built as shellcode and then obfuscated to help prevent detection. While\nanalyzing the sample, we also observed a modified network communication protocol which\nwill be discussed in this blog.\n\n## SPIVY\n\n\n-----\n\nIn March, Unit 42 observed this new Poison Ivy variant we ve named SPIVY being deployed\nvia weaponized documents leveraging CVE-2015-2545. All of the decoy document themes\ninvolved recent Hong Kong pro-democracy events. In all of the samples we’ve found to date\nthe exploit drops a self-extracting RAR which contains three files:\n\nexe - a legitimate, signed executable which is used to side-load the malware DLL\ndll - the malware DLL loaded by RasTls.exe, which then loads the Poison Ivy shellcode\nfile\nhlp - the encoded shellcode Poison Ivy backdoor.\n\nBoth identified C2 domains are third-levels off of leeh0m[.]org, which was created in late\nFebruary 2016, less than a month before the attacks.\n\n_Figure 1. Malicious RARs and the three files within_\n\nIn addition to the new variant we discovered, Japan’s Computer Emergency Response Team\n[Coordination Center (JPCERTCC) published a blog last July on a different new variant. That](http://blog.jpcert.or.jp/2015/07/poisonivy-adapts-to-communicate-through-authentication-proxies.html)\nvariant is also side-loaded from a legitimate executable and stub DLL, but the shellcode isn’t\nencoded the same way as SPIVY. JPCERTCC didn’t comment on who was being targeted in\ntheir blog, but it is notable that two distinct Poison Ivy variants have recently appeared,\nseveral years after the tool largely fell out of common use by advanced actors.\n\n## SPIVY Analysis\n\nWe believe the samples dropped have a direct connection to older Poison Ivy RATs based off\nof the behaviors and code reuse present in the shellcode loaded by the samsung.hlp file\nwithin the RAR. Once decoded, the shellcode is launched by ssMUIDLL.dll.\n\n\n-----\n\n_Figure 2. The encoded shellcode is decoded with a single byte addition of 0x99, XOR with_\n_0xD4, then subtract 0x33._\n\nThe SPIVY RAT uses the same API call table generation historically used by Poison Ivy.\nShown below is a comparison of a PIVY sample from 2008 and our newer SPIVY sample on\nthe right. Both have the exact same API call table function.\n\n_Figure 3. PIVY sample from 2008 and SPIVY variant with the same API call table function._\n\nUnlike previous versions of Poison Ivy which utilize a fixed 256 byte challenge-response\nhandshake, this new version generates a payload that has been prepended with anywhere\nfrom 1 to 16 bytes of pseudo-random data (plus control bytes), the 1st byte of which gives\nthe length of the padding before the start of the 256 byte handshake. In the example below\nthe first byte (0x09) tells the Poison Ivy controller to ignore the following 9 bytes (which were\nnulled out below for illustration purposes), plus one more byte which holds the first byte\nmultiplied by 2 ( 0x09 X 2 = 0x12) Two control bytes plus the 9 random plus the 256 byte\n\n\n-----\n\nhandshake gives us 267 total bytes. The Poison Ivy protocol has been very well documented\n[in previous research by Conix Security and others, and in these samples the remainder of](http://blog.conixsecurity.fr/wp-content/uploads/2013/10/Poison-Ivy-RAT-conf-comms.pdf)\nthe protocol remains unchanged.\n\n_Figure 4. SPIVY’s new challenge-response._\n\nWe saw two Poison Ivy configurations with our samples, shown below.\n\nSHA256: 9c6dc1c2ea5b2370b58b0ac11fde8287cd49aee3e089dbdf589cc8d51c1f7a9e\nPassword: bqesid#@\nC2 domain: found.leeh0m[.]org\nC2 port: 443\nMutex: 40EM76iR9\nID: 03-18\nGroup: 03-18\n\nSHA256: 4d38d4ee5b625e09b61a253a52eb29fcf9c506ee9329b3a90a0b3911e59174f2\nPassword: bqesid#@\nC2 domain: sent.leeh0m[.]org\nC2 port: 443\nMutex: 40EM76iR9\nID: 03-07\nGroup: 03-07\n\n## Decoy Documents\n\n\n-----\n\nDecoy documents are a common technique used by many actors to trick victims into\nbelieving they have opened legitimate files from spear phishing e-mails. The attacker sends\na malicious file which infects the host with malware and then displays a clean document\nwhich contains content the victim is expecting to see.\n\nThe decoy documents associated with SPIVY are notable because they reference very\nspecific recent events and organizations not widely publicized or known outside of the Hong\nKong region and the pro-democracy movement. In addition, all appear to be legitimate\ninvitations to actual events in Hong Kong. One of the decoys purports to be from Joshua\nWong, announcing a press conference about ending the Scholarism group to start a\nprogressive democratic political party, Demosistō, in March 2016. Joshua Wong is a well\nknown Hong Kong activist who was one of the founders of the group and is the current\nSecretary-General for the political party. Scholarism centered around concerns for the Hong\nKong’s Department of Education adding a mandatory course for all secondary-school\nstudents for “moral and national education”. Scholarism was successful in stopping the\ncourse and its members desired to shift into a political party to effect further change.\n\n_Figure 5. Invitation to press conference about disbanding Scholarism and establishing a_\n_political party._\n\nAnother decoy concerns the Mong Kok riot that took place February 8, 2016, the first day of\nthe Lunar New Year. It purports to be from the Justice & Peace Commission of the Hong\nKong Catholic Diocese and calls for the government to establish an independent commission\nto investigate the cause of the riots and for parishes to establish booths throughout April\n\n\n-----\n\nstaffed with church members advertising this. The riots were officially written off as being\ncaused by a crackdown on unlicensed street vendors, but the decoy claims it’s instead a sign\nof continued civil unrest and dissatisfaction with the government in Hong Kong.\n\n_Figure 6. Decoy allegedly from the Justice & Peace Commission of the Hong Kong Catholic_\n_Diocese_\n\nThe final decoy is an invitation to an April 4, 2016 wreath laying event held by the Hong Kong\nAlliance in Support of Patriotic Democratic Movements of China. The event commemorated\nthe 28 anniversary of the Tiananmen Square massacre and related events, information toth\nwhich China heavily censors access for mainland Chinese citizens.\n\n\n-----\n\n_Figure 7. Decoy for an April 4, 2016 wreath laying event commemorating the Tiananmen_\n_Square massacre held by the Hong Kong Alliance in Support of Patriotic Democratic_\n_Movements of China._\n\n## Conclusion\n\nThe venerable Poison Ivy has been revamped and used to continue targeted attacks against\npro-democracy activists in Hong Kong. It’s fairly common to see actors retool malware to\nmake it harder to detect, though it was rarely seen before with Poison Ivy. The updated\nexecution and communications mechanisms of SPIVY offer insight into the ever changing\ntools, techniques, and practices of targeted attackers. Unit 42 will continue to follow these\nattacks and any new Poison Ivy variants and provide updates as we uncover new\ninformation. It is clearly demonstrated by this recent campaign that an old dog can learn new\ntricks.\n\nPro-democratic activists in Hong Kong have increasingly been targeted by APT campaigns.\nBelow are links to several related reports from different researchers. We don't necessarily\nlink the activity in this blog to any of the specific campaigns cited in the links; instead, they\nare provided for situational awareness.\n\nOctober 2014 [blog from Volexity titled \"Democracy in Hong Kong Under Attack\"](http://www.volexity.com/blog/?p=33)\n[June 2015 blog from Citizen Lab titled \"Targeted Attacks against Tibetan and Hong](https://citizenlab.org/2015/06/targeted-attacks-against-tibetan-and-hong-kong-groups-exploiting-cve-2014-4114/)\nKong Groups Exploiting CVE-2014-4114\"\n[December 2015 blog from FireEye titled \"China-based Cyber Threat Group Uses](https://www.fireeye.com/blog/threat-research/2015/11/china-based-threat.html)\nDropbox for Malware Communications and Targets Hong Kong Media Outlets\"\n[April 2016 blog from Citizen Lab titled \"Between Hong Kong and Burma: Tracking](https://citizenlab.org/2016/04/between-hong-kong-and-burma/)\nUP007 and SLServer Espionage Campaigns\"\n\nPalo Alto Networks customers can identify SPIVY command and control traffic using Threat\n[Prevention signature ID and AutoFocus users can track this family using the SPIVY tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.SPIVY)\n\n**IOCs**\n\n**Weaponized EPS Docs:**\n\n13bdc52c2066e4b02bae5cc42bc9ec7dfcc1f19fbf35007aea93e9d62e3e3fd0\n\n4d38d4ee5b625e09b61a253a52eb29fcf9c506ee9329b3a90a0b3911e59174f2\n\n9c6dc1c2ea5b2370b58b0ac11fde8287cd49aee3e089dbdf589cc8d51c1f7a9e\n\n**Loader Files**\n\n_RasTls.exe - legitimate, signed binary that is used in the sideloading process_\n\n0191cb2a2624b532b2dffef6690824f7f32ea00730e5aef5d86c4bad6edf9ead\n\n_ssMUIDLL.dll - 7a424ad3f3106b87e8e82c7125834d7d8af8730a2a97485a639928f66d5f6bf4_\n\n\n-----\n\n**Poison Ivy shellcode files**\n\nc707716afde80a41ce6eb7d6d93da2ea5ce00aa9e36944c20657d062330e13d8\n0414bd2186d9748d129f66ff16e2c15df41bf173dc8e3c9cbd450571c99b3403\n\n**C2 Domains**\n\nsent.leeh0m[.]org\nfound.leeh0m[.]org\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-04-22 - New Poison Ivy RAT Variant Targets Hong Kong Pro-Democracy Activists.pdf"
    ],
    "report_names": [
        "2016-04-22 - New Poison Ivy RAT Variant Targets Hong Kong Pro-Democracy Activists.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535706,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653788265,
    "ts_modification_date": 1653788265,
    "files": {
        "pdf": "https://archive.orkl.eu/0d4e050377d7b1f87a75ed7995cce8afb1f3967a.pdf",
        "text": "https://archive.orkl.eu/0d4e050377d7b1f87a75ed7995cce8afb1f3967a.txt",
        "img": "https://archive.orkl.eu/0d4e050377d7b1f87a75ed7995cce8afb1f3967a.jpg"
    }
}