{
    "id": "4bc35703-9cab-48c7-af96-0f17c03a45da",
    "created_at": "2023-01-12T14:58:51.479705Z",
    "updated_at": "2025-03-27T02:16:16.993385Z",
    "deleted_at": null,
    "sha1_hash": "a38f1756375eda8c1dbd04b6ba91ea25b6bcba45",
    "title": "2021-05-05 - China’s PLA Unit 61419 Purchasing Foreign Antivirus Products, Likely for Exploitation",
    "authors": "",
    "file_creation_date": "2022-05-28T02:09:18Z",
    "file_modification_date": "2022-05-28T02:09:18Z",
    "file_size": 328693,
    "plain_text": "# China’s PLA Unit 61419 Purchasing Foreign Antivirus Products, Likely for Exploitation\n\n**[recordedfuture.com/china-pla-unit-purchasing-antivirus-exploitation/](https://www.recordedfuture.com/china-pla-unit-purchasing-antivirus-exploitation/)**\n\nInsikt Group\nRecorded Future’s Insikt Group has discovered six procurement documents from official\nPeople’s Liberation Army (PLA) military websites and other sources that show the Strategic\nSupport Force (SSF) branch of the PLA, specifically Unit 61419, has sought to purchase\nantivirus software from several major American, European, and Russian security companies.\nThe PLA’s Unit 61419 sought to purchase English-language versions of the security software\nlisted below (Table 1). The focus on English versions of these products is notable because\nChinese-language versions would be the more logical choice if the software was intended for\nlegitimate use or to test the potential exposure of private and commercial end-users in China\nto vulnerabilities in foreign antivirus software.\n\n**Insikt Group assesses that the purchase of foreign antivirus software by the PLA**\n**poses a high risk to the global antivirus software supply chain. Based on patterns of**\npast campaigns and tactics, two scenarios are most likely for the PLA’s exploitation of foreign\nantivirus software:\n\n**Scenario 1: PLA cyber units and affiliated hacking groups will use foreign antivirus programs**\nas a testing environment for natively developed malware. They will run the malware through\nforeign antivirus products to test its ability to evade detection, thereby making it more likely to\nsuccessfully infect its targeted victims.\n\n**Scenario 2: PLA cyber units and affiliated hacking groups will reverse engineer the foreign**\nantivirus software code to find previously undisclosed vulnerabilities. They will then use the\nnewly discovered vulnerabilities in a zero-day attack for initial intrusion.\n\n\n**Date of**\n**Procurement**\n**Order**\n\n\n**Product Name** **Subscription**\n**Length**\n\n\n**Number**\n**of Users**\n\n\n**Country**\n**of**\n**Supplier**\n\n\n-----\n\nJanuary 2019 Kaspersky Security Cloud\nFamily\n\nJanuary 2019 Kaspersky Security Cloud\nPersonal\n\nJanuary 2019 Kaspersky Endpoint Security\nfor Business Select\n\nJanuary 2019 Kaspersky Endpoint Security\nCloud Plus\n\n\n1 year 20 user\nterminals\n\n1 year 10 user\nterminals\n\n1 year 10 user\nterminals\n\n1 year 10 user\nterminals\n\n\nJanuary 2019 Avira Prime 1 year 10 user\nterminals\n\n\nApril-May 2019 Kaspersky Endpoint Security\nfor Business ADVANCED\n\n\n2 years 30 user\nterminals\n\n\nApril-May 2019 McAfee Total Protection 2 years 30 user\nterminals\n\n\nApril-May 2019 Dr. Web Enterprise Security\nSuite\n\nApril-May 2019 Nod32 ESET Multi-Device\nSecurity\n\n\n2 years 30 user\nterminals\n\n2 years 10 user\nterminals\n\n\nApril-May 2019 Norton Security Premium 2 years 10 user\nterminals\n\n\nApril-May 2019 Symantec Endpoint Protection\nSubscription\n\nNovember 2019 Trend Micro Worry-Free\nServices Advanced\n\n\n2 years 10 user\nterminals\n\n2 years 10 user\nterminals\n\n\nRussia\n\nRussia\n\nRussia\n\nRussia\n\nGermany\n\nRussia\n\nUS\n\nRussia\n\nSlovakia\n\nUS\n\nUS\n\nUS-Japan\n\nUK\n\nRomania\n\n\nNovember 2019 Sophos Intercept X 2 years 10 user\nterminals\n\nNovember 2019 BitDefender Total Security 2 years 10 user\nterminals\n\n\n**_Table 1: Antivirus security software included in the procurement documents discovered by_**\n_Insikt Group_\nInsikt Group also found a contract award announcement published by the SSF related to the\nacquisition of Cisco routers, among other pieces of communications technology. This\ndocument uses the same contact address associated with Unit 61419 as many of the\nantivirus procurement documents.\n\n\n-----\n\nFigure 1 below is a sample screenshot of a product list obtained from a Chinese military\nprocurement website:\n\n**_Figures 1: Unit 61419 procurement document product list_**\n\n## Patterns of Past Campaigns\n\nSeveral factors inform our assessment that the purchase of English-language foreign\nantivirus software is motivated by SSF’s role in computer network exploitation by the Chinese\nmilitary:\n**China has demonstrated a pattern of software supply chain exploitation in multiple**\n**cyber intrusion campaigns, including against some of the foreign antivirus software**\n**purchased in 2019.**\n\n1. In 2017, over 2.27 million users of Avast CCleaner were compromised by a malicious\n\nupdate planted by a Chinese state-sponsored threat actor, resulting in over 1.6 million\n[computers being infected with the first-stage Floxif trojan. A small subset of those](https://blog.malwarebytes.com/detections/trojan-floxif/)\nvictims was infected with a second-stage trojan, likely for espionage.\n2. In the summer of 2019, a Chinese state-sponsored APT called Tick Group [exploited](https://www.zdnet.com/article/two-trend-micro-zero-days-exploited-in-the-wild-by-hackers/)\n\ntwo zero-days impacting Trend Micro’s Apex One and OfficeScan XG enterprise\nsecurity products.\n[3. In 2019 and 2020, the US Justice Department indicted five members of the Chinese](https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connection-computer)\n\nAPT known as APT41 with an intrusion campaign affecting more than 100 companies\nglobally. APT41 compromised software providers and then modified the providers’\ncode to facilitate further intrusions against the software providers’ customers. The\nobjectives of the campaign were espionage and cryptocurrency mining.\n4. In October 2019, Avast announced a second breach of the CCleaner software. This\n\ntime, the hackers successfully breached the infrastructure to which CCleaner hosting\nhad been moved following the 2017 compromise. The Czech Security Information\nService (BIS) [attributed this attack to Chinese threat actors.](https://www.bis.cz/aktuality/bis-spolupracovala-se-spolecnosti-avast-na-odvraceni-utoku-na-jeji-produkty-6acda7bf.html)\n[5. In October 2020, Google’s Threat Analysis Group reported that Chinese state-](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats/)\n\nsponsored hacking group APT31 impersonated the antivirus company McAfee to\nconduct targeted attacks on the Biden campaign’s email system. Targets were\nprompted to install a legitimate version of McAfee Total Protection antivirus software\nfrom GitHub, while the malware was simultaneously installed to the system. McAfee\n**Total Protection is one of the antivirus packages purchased by Unit 61419 a year**\n**prior.**\n6. In 2021, Microsoft [announced that a Chinese state-sponsored hacking group,](https://therecord.media/chinese-apt-targeted-exchange-servers-with-four-zero-days-microsoft-says/)\n\nHAFNIUM, used four zero-day exploits to gain access to and install web shells on\n**Microsoft Exchange servers, compromising Outlook Web Access (OWA) in as many**\nas [60,000 organizations worldwide.](https://www.bloomberg.com/news/articles/2021-03-07/hackers-breach-thousands-of-microsoft-customers-around-the-world)\n\nAdditionally, the Chinese government has not used foreign antivirus software for\n**legitimate purposes since 2014, when it was banned. In August 2014, the state-owned**\n\n\n-----\n\n[news agency People s Daily reported that the Central Government Procurement Department](http://politics.people.com.cn/n/2014/0805/c70731-25403707.html)\n(中央政府采购部门) excluded Kaspersky and Symantec from a list of approved information\nsecurity software providers. Chinese officials approved the use of five China-based firms:\nQihoo 360 Technology, Venustech, CAJinchen, Beijing Jiangmin, and Rising. China’s\n[Ministry of Public Security issued a notice in June 2014 stating that Symantec software had](https://www.bloomberg.com/news/articles/2014-08-04/china-said-to-exclude-symantec-kaspersky-lab-software)\nsecurity vulnerabilities including backdoors that could allow outside access.\n\n## Who Is PLA Unit 61419?\n\nUnit 61419 is the Military Unit Cover Designator (MUCD) for a bureau within the People’s\nLiberation Army (PLA) Strategic Support Force (SSF). Although publicly available\n[documentation is scarce, the unit’s area of responsibilities included interpretation of foreign](https://project2049.net/wp-content/uploads/2018/05/pla_third_department_sigint_cyber_stokes_lin_hsiao.pdf)\nsignals intelligence (SIGINT) and other cyber operations, with a focus on Japan and Korea,\n[when it was first identified in 2011. Researchers at the Project 2049 Institute assessed Unit](https://project2049.net/wp-content/uploads/2018/05/pla_third_department_sigint_cyber_stokes_lin_hsiao.pdf)\n61419 to be the 4th Operational Bureau of the PLA General Staff Department’s (GSD) Third\nDepartment (3PLA). 3PLA was broadly responsible for defensive SIGINT, including\nmonitoring Chinese communication networks, protecting the security of Chinese domestic\n[computer networks, and conducting cyber espionage-oriented computer network exploitation](https://cyberdefensereview.army.mil/Portals/6/Documents/CDR%20Journal%20Articles/The%20Strategic%20Support%20Force_Kania_Costello.pdf)\n(CNE). Beginning in 2015, the GSD and 3PLA were disbanded, with their capabilities and\nfocus [reorganized, at least in part, into the SSF’s Network Systems Department (NSD).](https://cyberdefensereview.army.mil/Portals/6/Documents/CDR%20Journal%20Articles/The%20Strategic%20Support%20Force_Kania_Costello.pdf)\nThe unit is headquartered in Qingdao (location described in detail below) and comprises\nmultiple subordinate offices, each with its own MUCD. These offices are located in Qingdao\nand surrounding areas, Hangzhou, Beijing, and Shanghai. Each of these offices likely has its\nown MUCD. One of these,1 [Unit 61680, is located in the Wenquan township (温泉镇) under](https://project2049.net/wp-content/uploads/2018/05/pla_third_department_sigint_cyber_stokes_lin_hsiao.pdf)\n[Jimo city (即墨市) and has a training center there. Unit 61650 uses the same address as Unit](http://www.qdxucheng.cn/abouts.aspx)\n61419 for its equipment procurement, suggesting it is a subordinate office as well. Unit\n[61789 is subordinate as well and is probably located in Shanghai. Research conducted by](https://aiqicha.baidu.com/wenshu?wenshuId=71d02f4cc341e2c705ab3416874cb1fb84d9a9cf)\n[Unit 61419 members includes a 2008 paper on the extension of the US’s “nuclear umbrella”](https://kns.cnki.net/kcms/detail/detail.aspx?dbcode=CJFD&dbname=CJFD2008&filename=GJLT200804006&v=ZlqvBVUdAE80qUDPECKdmA5szwKlOyYGi2AAy3atIYuVv9o9QIFE8yjVaOqhmFip)\n[to Korea as well as medical topics, the latter focus suggesting the unit has a medical](https://kns.cnki.net/kcms/detail/detail.aspx?dbcode=CJFD&dbname=CJFD2008&filename=GJLT200804006&v=ZlqvBVUdAE80qUDPECKdmA5szwKlOyYGi2AAy3atIYuVv9o9QIFE8yjVaOqhmFip)\n[department. A logistics department manages Unit 61419’s properties and a political](http://news.qingdaonews.com/wap/2018-11/24/content_20247529.htm)\ndepartment handles discipline and political education, as in most other PLA units. Unit 61419\nmay have a training base in Xinzhou, Shanxi province.2\n\n\n**_Figure 2:_** _[Emblem of the People’s Liberation Army Strategic Support Force](https://project2049.net/2018/09/25/the-peoples-liberation-army-strategic-support-force-leadership-and-structure/)_\n\n[Recent reporting from Japan implicates Unit 61419 in a series of cyberattacks on companies](https://the-japan-news.com/news/article/0007330497)\nlike Mitsubishi Electric, Hitachi, Keio University, Hitotsubashi University, and the Japan\nAerospace Exploration Agency (JAXA) in 2016 and 2017. The wife of a member of Unit\n[61619 reportedly instructed a Chinese student living in Japan to rent servers using an alias.](https://www.yomiuri.co.jp/national/20210421-OYT1T50180/#:~:text=%E5%AE%87%E5%AE%99%E8%88%AA%E7%A9%BA%E7%A0%94%E7%A9%B6%E9%96%8B%E7%99%BA%E6%A9%9F%E6%A7%8B,%E3%81%AE%E5%8F%96%E6%9D%90%E3%81%A7%E3%82%8F%E3%81%8B%E3%81%A3%E3%81%9F%E3%80%82)\nThose servers were then used in some of the cyberattacks referenced above. Japanese\nmedia further cited Japan’s Tokyo Metro Police Department’s Public Safety Bureau in\n[asserting that Unit 61419 is linked to the Tick Group APT, which was also identified as being](https://mainichi.jp/articles/20210420/k00/00m/040/086000c)\nbehind the 2016 and 2017 cyberattacks. Although definitive attribution of Tick Group to Unit\n\n\n-----\n\n61419 remains difficult to confirm at this time, the APT has historically [focused on Japanese](https://attack.mitre.org/groups/G0060/)\ntargets. This aligns with Unit 61419’s focus on Japan. Moreover, Tick Group’s [exploitation of](https://www.zdnet.com/article/two-trend-micro-zero-days-exploited-in-the-wild-by-hackers/)\nzero-days impacting Trend Micro’s Apex One and OfficeScan XG enterprise security\nproducts occurred months before a November 2019 procurement announcement for Trend\nMicro’s Worry-Free Services Advanced was issued by an SSF unit using Unit 61419’s\nheadquarters as the application delivery address.\nGiven the tentative links to cyberattacks in Japan and Tick Group, as well as the\nprocurement activities identified in this report, Unit 61419 most likely continues to operate as\nan SSF NSD bureau focused at least in part on CNE operations.\n\n## Locating Unit 61419\n\n**Insikt Group identified several important patterns from the six procurement**\n**documents. All six documents list a consistent point of contact — a “Mr. Yu” (于先生) —**\nalong with a phone number.\nSix of the documents also list the same contact address in Qingdao City, Shandong\nprovince: No. 5 Fushun Road, Shibei District, Qingdao City, Shandong Province, postal code\n266034 (山东省青岛市市北区抚顺路5号, 邮编266034), as seen in Figure 5, below. All of the\nprocurement documents for Unit 61419 use this address. This address is also used for other\nunits, such as 61650, that are likely subordinate to Unit 61419.\n\n**_Figure 3: Screenshot of address from procurement document application instructions_**\n\nIn addition to the procurement documents, Insikt Group found a 2018 electricity outage\n[notice listing Unit 61419’s logistics department as an affected party on Fushun Road. The](http://news.qingdaonews.com/wap/2018-11/24/content_20247529.htm)\nnotice, in Figure 4 reads, “35kV Fushun Road Substation｜Planned blackout … 61419\nlogistics department of the Army affects 2 stations and 231 district customers.” Figure 4:\n_2018 electric outage notice identifies the Fushun Road substation as the power source for a_\n_facility managed by PLA’s Unit 61419_ _Logistics Department_\nBaidu Maps shows that No. 5 Fushun Road is the location of a hotel in Qingdao called the\nBihaiyuan Hotel (碧海园宾馆). Some of the procurement documents No. 5 Fushun Road\nrefer directly to this hotel or its front desk (Figure 7).\n\n**_Figure 5: Street view of Bihaiyuan Hotel (碧海园宾馆)_** **_Figure 6:_** _Street view of Bihaiyuan_\n_Hotel (碧海园宾馆) and adjacent security checkpoint and gate_ **_Figure 7: Procurement_**\n_footnotes direct the delivery of application materials to an address of the Bihaiyuan Hotel (碧_\n海园宾馆)\nRecorded Future assesses that the No. 5 Fushun Road address is the headquarters of Unit\n61419 and that the Bihaiyuan Hotel is its public face. Behind the hotel is a walled compound\nsimilar to the headquarters of other PLA units (Figure 8). Our assessment corroborates\nProject 2049 Institute’s finding in 2011 that this address was the likely headquarters.\n\n**_Figure 8: Map of Bureau 61419’s compound based on Insikt Group’s analysis. The primary_**\n_compound (shown in red) is adjacent to or shares space with two other gated facilities_\n\n\n-----\n\n_(shown in dark red). The degree to which the Unit 61419 compound is separated, as well as_\n_the level of security at internal gates, is unclear based on available satellite imagery._\nFor example, in a January 2016 report compiled by the US Army's Asian Studies\n[Detachment, the Jingtang Hotel and Seasons Hotel were linked to the 4th Department of the](https://www.washingtontimes.com/news/2017/jan/4/inside-the-ring-plas-hacking-hotel/)\nGeneral Staff Headquarters of the PLA (4PLA), which was responsible for electronic and\ninformation warfare, including offensive cyber operations, prior to its dissolution and\n[reorganization into the SSF.](https://jamestown.org/program/the-strategic-support-force-chinas-information-warfare-service/)\n\nLimited evidence suggests the use of hotels is a model used by PLA units in a possible\nattempt to obfuscate their locations. Past reports have alleged that PLAY cyber and\nelectronics units have leased floors of hotel rooms for their operations or as possible\nheadquarters.\n\n[The Bihaiyuan Hotel is also not the only hotel associated with Unit 61419. A 2018 lawsuit](https://aiqicha.baidu.com/wenshu?wenshuId=71d02f4cc341e2c705ab3416874cb1fb84d9a9cf)\nfiled by PLA Unit 61789 against Shanghai Golden Hope Hotel Management Co. Ltd. (上海金\n色希望酒店管理有限公司) over a breach of its \"Military Real Estate Lease Contract\",\nindicates that in 2014 Unit 61419 leased a building on Yan'an Middle Road in Shanghai to\nthe hotel management company. The lawsuit indicates that Unit 61789 was subordinate to\nUnit 61419 in 2017. Unit 61850, former 3PLA’s [7th Operational Bureau, is also identified as a](https://project2049.net/wp-content/uploads/2018/05/pla_third_department_sigint_cyber_stokes_lin_hsiao.pdf)\nparty in the dispute. The location of the leased building may have been No. 802 Yan’an\nMiddle Road, Jing’an District, Shanghai City, where Shanghai Golden Hope Hotel previously\n[operated a hotel.](https://sh.city8.com/chuxingfuwu/poi2-4079.html)\n\n## Recommendations\n\nGiven the pattern of Chinese state-sponsored exploitation of the global software supply chain\ndescribed above, as well as China’s exclusion of foreign antivirus software as an option for\ngovernment organizations, the brands and products indicated in Table 1 should be monitored\nfor future exploitation. Focus should be placed on adversarial simulations, penetration\ntesting, patching known vulnerabilities, and monitoring for anomalous traffic related to these\nantivirus products.\nWhile Recorded Future is not in a position to evaluate the precise legality of any transactions\nthat may have resulted from the procurement documents we reviewed, we further\nrecommend any impacted organization seek legal counsel about the sales of security\nsoftware to China given the US Department of Commerce’s Export Administration\nRegulations (EAR) regulations that cover information security software.\n\n1 Mark Stokes, “The Chinese People’s Liberation Army Computer Network Operations\n\nInfrastructure,” in Jon R. Lindsay, Tai Ming Cheung, and Derek S. Reveron (eds.), China and\n_Cybersecurity: Espionage, Strategy, and Politics in the Digital Domain, Oxford University_\nPress: New York, NY, 2015, p. 171. Ibid.2\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-05 - China’s PLA Unit 61419 Purchasing Foreign Antivirus Products, Likely for Exploitation.pdf"
    ],
    "report_names": [
        "2021-05-05 - China’s PLA Unit 61419 Purchasing Foreign Antivirus Products, Likely for Exploitation.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b01b0683-5c7c-4070-ba0c-4fdede370995",
            "created_at": "2022-10-25T16:07:23.925692Z",
            "updated_at": "2025-03-27T02:02:10.03376Z",
            "deleted_at": null,
            "main_name": "Operation Armor Piercer",
            "aliases": [],
            "source_name": "ETDA:Operation Armor Piercer",
            "tools": [
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Recam",
                "Warzone",
                "Warzone RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535531,
    "ts_updated_at": 1743041776,
    "ts_creation_date": 1653703758,
    "ts_modification_date": 1653703758,
    "files": {
        "pdf": "https://archive.orkl.eu/a38f1756375eda8c1dbd04b6ba91ea25b6bcba45.pdf",
        "text": "https://archive.orkl.eu/a38f1756375eda8c1dbd04b6ba91ea25b6bcba45.txt",
        "img": "https://archive.orkl.eu/a38f1756375eda8c1dbd04b6ba91ea25b6bcba45.jpg"
    }
}