{
    "id": "4bd00081-5f98-4d5f-8874-d434bad78a21",
    "created_at": "2023-01-12T15:02:26.739813Z",
    "updated_at": "2025-03-27T02:16:59.297353Z",
    "deleted_at": null,
    "sha1_hash": "1dd3d0a46439666c04df79afb995e8a0f0bef115",
    "title": "2016-01-23 - Imminent Monitor 4 RAT Analysis – A Glance",
    "authors": "",
    "file_creation_date": "2022-05-28T15:15:04Z",
    "file_modification_date": "2022-05-28T15:15:04Z",
    "file_size": 269714,
    "plain_text": "# Imminent Monitor 4 RAT Analysis – A Glance\n\n**[itsjack.cc/blog/2016/01/imminent-monitor-4-rat-analysis-a-glance/](https://itsjack.cc/blog/2016/01/imminent-monitor-4-rat-analysis-a-glance/)**\n\nJanuary 23, 2016\n\nJanuary 23, 2016\nAs I stated in [this video I’m going to be focusing much more on RAT analysis. My reasons](https://www.youtube.com/watch?v=gXH2Ib4sXW8)\nare given in the second portion of the video for anyone who is interested. I decided to look at\na fairly popular RAT called ‘Imminent Monitor’. I downloaded the cracked version which many\nshould note as this may differ from the original in some ways, I’ve tried to only include things\nwhich I’m sure are wrong with the original as well. There is something positive about\nanalysing cracked malware, as the majority of criminals probably don’t want to pay for RAT’s.\n\nDarkcomet RAT is still actively used today even though it is no longer developed and has\nbeen proven to have exploits in this. With this in mind, this version of cracked software will\nmost likely distribute around the internet and be used more than the paid version due to it\nsimply being free. I thought I was going to have a fairly long wait to find how to extract the\nconfig out of the RAT but it was really as easy as 1-2-3. Literally looking at the first classes\nconstructor.\n\nI was able to see port, ip/hostname, startup key, startup name, startup location, mutex and\nversion (and other less important things).\n\n\n-----\n\nOne of the first threat indicators I can provide to malware guys is that Imminent RAT creates\na folder which is always the same, it is quite unique. It creates a directory called “Imminent”\nin the application data of the current user. This does not hold the executable but instead\nholds information to be sent over to the client. Like logs.\n\nThe binary uses cases to make it harder for researchers to make out whats going. Imminent\nuses a XOR like function but to what I see isn’t exactly XOR. I’m thinking of creating a\ndeobfuscator for this sort of code later on, but for now I solved it manually, which wasn’t\nparticularly challenging. The more I look at it the more it looks like XOR, but I’m terrible at\nchecking these things so I’m just going to call it XOR-like.\n\nThis XOR like functions is used to encrypt logs and other parts included in the “Imminent”\napplication data. I successfully tested my algorithm against the original and got the same\nresult, this was also verified by breakpointing the function to where it was encrypting to make\nsure the plain text was the same.\n\n\n-----\n\nWith the same algorithm we can decrypt logs that Imminent creates. It does it by a format of\nmonth/day/year, showing the author could be American origin. An interesting thing about the\nuse of what looks to be XOR is the key provided for the operation, the developer decided to\nuse “sampleKey”. Or did he? A person who doesn’t copy and paste an algo usually chooses\na different key than sampleKey, infact someone who does copy and paste an algorithm\nusually changes the key.\n\nbyte[] path = System.Text.Encoding.UTF8.GetBytes(“C:\\\\Documents and\nSettings\\\\L!NK\\\\Local Settings\\\\Application Data\\\\Startup Folder Name\\\\MyFile.exe”);\n\nbyte[] pass = System.Text.Encoding.UTF8.GetBytes(“sampleKey”);\n\nbyte[] ax = xorlike(path, pass);\n\nSystem.IO.File.WriteAllBytes(“out.txt”, ax);\n\n\n-----\n\npublic static byte[] xorlike(byte[] byte_1, byte[] byte_2)\n{\nbyte[] result;\n\nint num = 11;\nint num5 = 13;\nint num3 = 257;\nint num6 = byte_2.Length – 1;\nfor (int num7 = 0; num7 <= num6; num7++)\n{\nnum3 += num3 % (int)(byte_2[num7] + 1);\n\n}\nint num4 = byte_1.Length – 1;\nfor (int num2 = 0; num2 <= num4; num2++)\n{\nnum3 = (int)byte_2[num2 % byte_2.Length] + num3;\nnum = (num3 + 5) * (num & 255) + (num >> 8);\nnum5 = (num3 + 7) * (num5 & 255) + (num5 >> 8);\nnum3 = (num << 8) + num5 & 255;\nbyte_1[num2] ^= (byte)num3;\n}\nresult = byte_1;\nreturn result;\n}\n\nI’ve decided to show an example of it’s operation. You can use this for any defense against\nImminent if you choose to make one. The code is obviously deciding to encrypt the startup\npath and saved in the Imminent folder as “Path.dat”, a rough location of a user is also saved\n“Geo.dat”, which uses a site called iptrackeronline.com to longitude, lattitude, city and finally\ncountry.\n\nI discovered a file which deals with processes, I’m not sure at the moment, if its the file\nupdater, download and execute or persistence. I’m more leaning towards it being a process\nwatchdog but have many things to explore. I discovered it here:\n\n\n-----\n\nTurns out there is a base64 string which is then decompressed using the LOADLZ library it\nhas with it. There’s a reason why this thing can be 400kb.\n\nThe file was written in C++ which is interesting as most .NET malware doesn’t drop anything\nlike C++, turns out to be a dll which I assume is injected for persistence, although as I say I\ndon’t want to rule out anything yet.\n\nI couldn’t debug in Immunity properly because I use an XP machine with some of the C++\nredistributables not installed. This file required GetModuleHandleEx which was provided in\n2011 from my research, but I might be wrong.\n\nI’m not going to show a lot of IDA, but it checks for a debugger, creates a thread, opens\nprocesses and creates them too. It is also uniquely identifiable because of some of the\nstrings that are given. That is indeed a md5 hash which is “killswitch” in plain text.\n\n\n-----\n\n[You can see that correctly, the file is also FUD and still is as I write this article 3 days later.](https://www.virustotal.com/en/file/0fb50d1b49867d18a405eada48593a57f62a58b15bd1043827a222863ef0fe06/analysis/)\n\nI was starting to test out how I could break Imminent Monitor as well and found that the RAT\ndoes not like showing files when a file is out of its format, I named a file in the keylogger file\n“ao” and entered a small amount of data. It proceeded to not show any of the keylogging files\nthat were available to it. This is it in a broken state.\n\nThis is it in the normal state.\n\n\n-----\n\nThe task manager disabler functionality that Imminent provides is also quite bad. It simply\nexecutes the task manager and makes it invisible. Not exactly to rootkit standards, but I\nguess does the trick to the average joe?\n\nIn the cracked version the process protection is broken or non-existant, I am able to kill the\nprocess with ease. I am to do more research on Imminent Monitor, it’s been fun to look at so\nfar and I haven’t looked through all of it because of time constraints in my life. What I have\nprovided is some threat indicators for AV’s so that this RAT can be removed from peoples\ncomputers with ease, even if crypted. The static path declaration provides an opportunity to\nremove this RAT from most machines.\n\nI’ve been looking more at how Imminent can be broken remotely, I’ve had a few sucesses\nwith random things, but must look at them in more depth before I decide to release them\npublicly. A reminder for anyone reading this, if you have an original build that isn’t from a\n\n\n-----\n\ncracked client, I would like to have it so please contact me.\n\nThanks for looking.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-01-23 - Imminent Monitor 4 RAT Analysis – A Glance.pdf"
    ],
    "report_names": [
        "2016-01-23 - Imminent Monitor 4 RAT Analysis – A Glance.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535746,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653750904,
    "ts_modification_date": 1653750904,
    "files": {
        "pdf": "https://archive.orkl.eu/1dd3d0a46439666c04df79afb995e8a0f0bef115.pdf",
        "text": "https://archive.orkl.eu/1dd3d0a46439666c04df79afb995e8a0f0bef115.txt",
        "img": "https://archive.orkl.eu/1dd3d0a46439666c04df79afb995e8a0f0bef115.jpg"
    }
}