{
    "id": "4bd51e6d-7616-457d-984c-a117c6fd7bfa",
    "created_at": "2023-01-12T15:01:35.723257Z",
    "updated_at": "2025-03-27T02:13:07.858514Z",
    "deleted_at": null,
    "sha1_hash": "2c74c481c6e1c2334ada03b199fecf3527e06ba5",
    "title": "2022-06-02 - A SecPro Super Issue- Understanding LockBit",
    "authors": "",
    "file_creation_date": "2022-10-23T13:00:14Z",
    "file_modification_date": "2022-10-23T13:00:14Z",
    "file_size": 2140985,
    "plain_text": "# Understanding LockBitU\n\n**security.packt.com/understanding-lockbit/**\n\n## A SecPro Super Issue: Understanding LockBit\n\n\nJune 2, 2022\n\n\nFor those of you in the UK, you may be winding down for the week already and ready for the\nQueen’s Platinum Jubilee – a celebration of a monarch who has seen the world change from\nthe low tech world of the 1950s to the technological revolution that we are living through\ntoday. In a world completely unimaginably different to those who witnessed a coronation in\n1953, taking a minute to reflect on the leaps and bounds we have made as a species is\nsomething that people often forget to do.\n\nOf course, the rise of modern computers saw another significant rise – cybercriminals. No\none is more aware of the rising threat than cybersecurity professionals, so here’s some light\nreading for the long weekend. If you’re not in the UK, you can just enjoy a super issue\nwithout the special occasion.\n\nThanks for reading and we’ll see you again on Friday!\n\nCheers!\n\nAustin Miller\n\nEditor-in-Chief\n\n\n-----\n\n## Understanding the LockBit Ransomware\n\nBy Andy Pantelli\n\n### Breaking down the Bitwise Spider APT\n\nLooking at the origins of the Adversary, how the group evolved, and how they became one of\nmost prolific criminal gangs using Ransomware-as-a-Service. We will take a look at the\nTactics, Techniques & Procedures the adversary uses and break these down.\n\nThe origins of BitWise Spider began in September of 2019. Known then as ABCD\nRansomware the gang set about promoting and supporting their operation via Russian\nlanguage forums. Developing a strong professional operation until June 2021 when the\ngroup were banned from posting on Cyber Security forums. This prompted a rebrand with\nthe group changing name to BitWise Spider and at the same time releasing LockBit 2.0\nransomware & the StealBit information stealer.\n\nThis appears to be a milestone for the group which then saw increase in their reputation and\npopularity amongst the Dark Web Community having matured & added much more\nfunctionality into Lockbit 2.0 Ransomware-as-a-Service (RaaS).  We will take a deeper look\nin more detail later in the article at the TTPs (Tactics, Techniques & Procedures) used by the\nadversary.\n\nHaving become one of the most prolific Ransomware gangs the group looked to mature their\nsoftware, and the business model. LockBit operations were by now increasing and\ndeveloping the recruitment and marketing with affiliates. What exactly is an ‘affiliate’?\n\n\n-----\n\nRansomware-as-a-Service developers can maximize their product exposure by providing it\nto third parties, or ‘affiliates’ who in turn focus themselves on targeting victims and infecting\ntheir networks. There is a monetary trade between the developers and the affiliates for the\nnumber of infections and the numbers of users within an infected organization.\n\nThis model worked for BitWise Spider successfully allowing them to focus on development\nand profit, but also provides a layer between the gang and the victim making detection or\nprosecution of the developers more difficult with obscurity.  Affiliate schemes are used by\nalmost all Ransomware developers who provide the affiliate with a unique identifier in\nspecific code within the Ransomware which directs any payout to the affiliate that caused the\ninfection.\n\n### BitWise Spider comes of age\n\nIn March of 2022 the gang had matured their code, enriched features, added functionality\nand introduced new tactics. This included data extortion as they began to detail new victims\nthrough their Dark Web site. Using an array of techniques, tactics & procedures (TTP) the\ngroup were responsible for many high profile attacks such as the one in 2021 against\nAccenture, who were at the time were in the process of a marketing campaign to recruit new\naffiliates. The Fortune 500 Company was later to confirm the breach with a $50m ransom\ndemanded otherwise the company data would be leaked. Accenture were soon forced to file\na data breach in the October SEC filings after “extraction of proprietary information.” during\nthe August attack.\n\nLockBit has undergone some major development releasing a new version including several\nnew features; automatic encryption of devices across Microsoft Windows Active Directory\nDomains, the removal of shadow copies, self-propagation, the ability to bypass User Account\nControl Settings (UAC), ESXi support, and even the capability of printing Ransom notes via\nthe victim’s network connected printers. Some of the techniques seen are publicly available\nsuch as privilege escalation by using the Mimikatz tool but also the group also claim to have\nthe fastest encryption method which employs a multithread approach using some of the\nfollowing methods to boost performance:\n\n- Open files with the FILE_FLAG_NO_BUFFERING flag, write by sector size\n\n- Transfer work with files to Native API\n\n- Use asynchronous file I/O\n\n- Use I/O port completion\n\n- Pass control to the kernel yourself, Google KiFastSystemCall\n\nNot content with this improvement, the developers at BitWise Spider introduced StealBit to\nshift their tactics by employing data exfiltration as a double extortion tactic. Victims of\nRansomware may not be willing to pay the fee in some instances, this could be for a number\nof reasons, lack of financial resources, available backups, concerns that if a payment were to\n\n\n-----\n\nbe made to the blackmailers then would the data even be unencrypted? All this made\ncriminal gangs look towards threatening victims of Ransomware that unless a payment were\nmade to the gang then the malicious actors would release the data online or even sell it.\n\nStealBit is developed and maintained by the group and as seen by the graphic\ncompares favourably against other Ransomware tools:\n\nThe table represents hash values of selected StealBit samples that have been observed in\nthe security community:\n\n\n-----\n\n### MITRE ATT&CK\n\nTactics, techniques & procedures (TTPs) observed to be used by the adversary:\n\n\n-----\n\n### Industries & Countries Targeted\n\nLockBit targets diverse industry sectors & geographical regions. Most attacks are observed\nin the US, India & Brazil with the Commonwealth of Independent States being avoided.\nBusiness sectors indicate the Healthcare closely followed by the Education Sector although\nthe group have issued a statement to claim that they do not target “healthcare, charity or\neducational institutions”. This has prompted the US Department of Health Services HHS) to\nissue “contradictory code of ethics” note warning the public not to rely on such statements\nand these are shown not be true.\n\n**Initial Access**\n\nLockBit affiliates gain access via compromised servers, or by using RDP or VPN accounts\nusing brute force insecure credentials. A further delivery method is by exploiting Fortinet\nVPN [CVE-2018-13379 vulnerability. LockBit also makes use of Mimikatz to escalate](https://nvd.nist.gov/vuln/detail/CVE-2018-13379)\nprivileges.\n\n\n-----\n\n**Execution**\n\n[Executed by command line or by](https://attack.mitre.org/techniques/T1059/003/) [scheduled tasks and can be propagated in other machines.](https://attack.mitre.org/techniques/T1053/)\nIt is also known to use [PowerShell Empire post exploitation agent.](https://www.kali.org/tools/powershell-empire/)\n\n**Persistence**\n\nRegistry Run Keys / Start up Folders\n\n**Discovery**\n\nAdvanced Port Scanner, Network Scanner & AdFind are used to enumerate connected\nmachines.\n\n**Lateral movement**\n\nSelf-Propagation via SMB using compromised credentials or Group Policy. PsExec or Cobalt\nStrike is used for lateral movement.\n\n**Exfiltration**\n\nData extracted to Cloud Storage Web Applications MEGA, or FreeFileSync. Also used for\nexfiltration is the groups own StealBit.\n\n**Impact**\n\nRansomware payload will encrypt victim machines upon execution. This includes local and\nnetwork drives. Encrypting with AES-256. Can print ransom note using connected printers.\nThe desktop wallpaper is also replaced.\n\nRansom note, file name Restore-My-Files.txt\n\n**Tactics**\n\nThe use of affiliates, marketing & the gangs Direct Leak Site to upload stolen data are direct\ntactics to propagate the monetization. Offering Ransomware-as-a-Service provides a tactic\nto avoid direct involvement and obfuscate any law enforcement action.\n\n\n-----\n\nKnown target industries include and are not limited to Cryptocurrency, Academics, Aviation,\nAerospace, Healthcare Insurance, Food and Beverage, Chemicals Energy Oil and Gas,\nManufacturing, Hospitality, Real Estate Travel, Opportunistic, Logistics Transportation, Legal,\nRetail, and Government.\n\nThe known 74 target countries include Taiwan, China, Poland, Netherlands, Mexico, the\nUnited States, Belgium, Colombia, Denmark, Chile, Vietnam, and Peru.\n\nThe gang have developed a strong selling point with affiliates using the speed of the\nmalware with its capabilities being well known. The group maximizes this selling point\nthrough various means of publicity. External factors influence the targeting of victims with a\npreference for victims that have concerns over GPDR in Europe.\n\n**Techniques**\n\nAs with many Ransomware gangs LockBit will the check system language to avoid\nencrypting systems in Russia or other nearby CIS states The Malware issues the\ncommands GetSystemDefaultUILanguage and GetUserDefaultUILanguage to check if the\nsystem of user default UI is in the language list to avoid.\n\nAzerbaijani (Cyrillic, Azerbaijan), Azerbaijani (Latin, Azerbaijan), Armenian (Armenia),\nBelarusian (Belarus), Georgian (Georgia), Kazakh (Kazakhstan), Kyrgyz (Kyrgyzstan),\nRussian (Moldova), Russian (Russia), Tajik (Cyrillic, Tajikistan), Turkmen (Turkmenistan),\nUzbek (Cyrillic, Uzbekistan), Uzbek (Latin, Uzbekistan), and Ukrainian (Ukraine).\n\nThe malware uses and Ifstatement and calls ExitProcess to terminate itself if the user of\nsystem UI language is identified.\n\n\n-----\n\nStrings seen in LockBit executables are encoded and then stored as a stack string. Before\nuse they are decoded dynamically through computations such as addition, subtraction or\nXOR, this is the Stack String Anti-Analysis.\n\nAs with many major Ransomware variants LockBit resolves APIs dynamically to make the\nInline Anti-Analysis more difficult but the gang have enhanced the technique by making the\nentire resolving process inline which makes the decompiled code much larger, and therefore\nmore difficult & time consuming to analyse.\n\nThen using methods to load the API libraries into memory, the malware uses hashing &\nobfuscation methods to access the DLL base and export table which returns the target API\naddress. After loading all required libraries LockBit will restrict access to its own process by\ncalling NTOpenProcess to get a handle on the current process then\nresolve GetSecurityInfo to get the process security descriptor.\n\nBy initializing an SID for the EVERYONE group and using the RtlAddAccessDeniedAce to\nadd the ACCESS_DENIED access control entry for the EVERYONE group the malware\nprocess is effectively protected. Additional ACEs are iterated for each process that the\nmalware uses. Critical system messages are suppressed and calls\nto RtlAdjustPrivilege which enables the SE_TAKE_OWNERSHIP_PRIVILEGE.\n\n### Privilege escalation\n\nIn the next stages LockBit will look to elevate privilege of the user account using\nthe GetTokenInformation call to retrieve information about the user account associated with\nthe Token. Using a combination retrieving and comparing account SID the malware begins\n\n\n-----\n\nthe process to escalate itself.\n\n### Logging\n\nThe malware then makes a number of calls to create hidden debug windows which can be\nviewed during the process by a combination of hot keys Shift+F1.\n\n### Command Line\n\nCommand-line is to be used with or without arguments. Once encryption of the target\nfile/directory is complete the process is terminated\n\n### Mutex\n\n\n-----\n\nLockBit checks for, and avoids multiple Ransomware instances by checking the stack string \\\n{\\%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%%02X}”\n\n### Active Directory\n\nLockBit seeks out the OS Version, if Windows Vista or above it tries to create and set up new\ngroup policies for other hosts within Active Directory using NtQueryInformationToken_1 and\nthe NtOpenProcessToken commands the malware looks up the Admin account and Domain.\nTo then connect to the AD Domain LockBit will generate the LDAP display name for the\nGroup Policy Object.\n\nBy resolving the stack string and formats it with the public key. Manually extracting the DNS\nDomain Name, and name LockBit is able to create a new GPO, lastly the path is built by\nformatting the string LDAP://CN=<GPO GUID>,CN=Policies,CN=System,DC=<Domain\ncomponent 1>,DC=<Domain Component 2> which allows the AD path and GPO to\ncall CreateGPOLink to connect the GPO to the Active Directory Domain.\n\n**DNS Retrieval**\n\nLockBit formats ScheduledTasks.xml file to execute a taskkill.exe for each process in the\nprocess list before dropping in the Registy.pol file1 which contains the following list of registry\npaths and values:\n\n- Software\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware: True\n\n- Software\\Policies\\Microsoft\\Windows Defender\\Real-Time\nProtection\\DisableRealtimeMonitoring: True\n\n- Software\\Policies\\Microsoft\\Windows Defender\\Spynet\\SubmitSamplesConsent: Never\nsend\n\n- Software\\Policies\\Microsoft\\Windows\nDefender\\Threats\\Threats_ThreatSeverityDefaultAction: Enabled\n\n- Software\\Policies\\Microsoft\\Windows Defender\\Threats\\ThreatSeverityDefaultAction\\Low:\nIgnored\n\n- Software\\Policies\\Microsoft\\Windows\nDefender\\Threats\\ThreatSeverityDefaultAction\\Medium: Ignored\n\n- Software\\Policies\\Microsoft\\Windows Defender\\Threats\\ThreatSeverityDefaultAction\\High:\nIgnored\n\n- Software\\Policies\\Microsoft\\Windows\nDefender\\Threats\\ThreatSeverityDefaultAction\\Severe: Ignored\n\n- Software\\Policies\\Microsoft\\Windows Defender\\UX Configuration\\Notification_Suppress:\nEnabled\n\n\n-----\n\nThese following registry configurations disable Windows Defender features such as antispyware, real-time protection, submitting samples to Microsoft servers, default actions, and\ndisplaying notification on all network hosts.\n\n**Persistence**\n\nBefore executing encryption routines LockBit configures persistence using Registry Keys if\nthe Malware is interrupted by a system shutdown. Once encryption is complete, the malware\nwill remove the persistence key calling RegDeleValueW to prevent itself from running again if\nthe user restarts the machine following encryption.\n\n**Deleting backups**\n\nLockBit will delete shadow copies by resolving the string /c vssadmin delete shadows /all\n/quiet & wmic shadowcopy delete & bcdedit /set {default} bootstatuspolicy ignoreallfailures &\nbcdedit /set {default} recoveryenabled no then passes the fields to ShellExecuteA. The\ncommand uses vssadmin and wmic to delete all shadow copies and bcdedit to disable file\nrecovery.\n\n**Wallpaper**\n\nSetting the default file extension, desktop background and ransom note printing tasks are\ncompleted.\n\n**Printing**\n\n\n-----\n\nUsing the call EnumPrintersW to retrieve printers information. The internal function resolves\ntwo strings Microsoft Print to PDF and Microsoft XPS Document Writer to compare the\nprinter name. If the value is one of the two, the function will exit and the ransom note will not\nbe printed.\n\nThis is to ensure that the note is not printed to a file and only to print from a physical printer.\n\n**Extension**\n\nAll files encrypted by LockBit have the file extinction .lockbit after\ncalling NtCreateFile and NtWriteFile resolves \\Registry\\Machine\\Software\\Classes\\.lockbit stack\nstring and calls NTCreateKey to create the registry extension, this is done after formatting\nusing its public key.\n\n**File Encryption**\n\nPrior to encryption LockBit will enumerate all volumes on the target system\nusing FindFirstVolumeW and FindNextVolumeW and proceeds to retrieve a list of Drive\nletters and any mounted folder paths. Then each drive path is iterated from Z to A before\nbeing mounted to a specific drive letter by calling SetVolumeMountPointW. Libsodium\nCryptography is used for the public key crypto using functions bcrypt.dll and LoadLibraryA, it\nwill use BCryptGenRandom for the RNG function or CryptGenRandom. Next, as seen\nbefore the stack string is resolved and the public key is used to format it which is later used\nas a Registry key to store the victim crypto keys. The malware calls\nLibsodium crypto_box_keypair to generate a random 32-bit private key and the\ncorresponding public key. Next it will encrypt the 64-bit buffer containing both keys using\nLibsodium crypto_box_easy then deletes the victims private key from memory.\n\n\n-----\n\nAfter setting up the crypto keys, LockBit initialises its multithreading method we reference\nearlier it then traverses through all local drives using techniques to skip drives that are not\navailable, or that have already been encrypted. Files that are recognised as read-only\nchanges the attribute to FILE_ATTRIBUTE_NORMAL making it writable and available for\nencryption. The files are encrypted using 512 byte chunks and given the extension .lockbit\nAgain calling the RNG function the malware randomly generates a 16-byte AES key and 16byte AES IV and writes into the file structure before renaming the file before the encryption\nby populating a FILE_NAME_INFORMATION with the encrypted file name before\ncalling NTSetInformationFile with the information class FileNameInformation. In the final\nstages LockBit will create threads to traverse and encrypt other network hosts and network\ndrives by using the GetAdaptorInfo the inet_addr call is made to convert the system IP\naddress and mask. Once the broadcast domain is identified LockBit will scan the network\niterating from the network ID address and incrementing up to the broadcast address trying to\nconnect over ports 135 or 445, if successful it will try to encrypt the network hosts.\n\n### Procedures\n\n\n-----\n\n**Indicators of Compromise**\n\n\n-----\n\n-----\n\n### Further reading\n\nWant to find out more about LockBit? Check out these links.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-02 - A SecPro Super Issue- Understanding LockBit.pdf"
    ],
    "report_names": [
        "2022-06-02 - A SecPro Super Issue- Understanding LockBit.pdf"
    ],
    "threat_actors": [
        {
            "id": "33f527a5-a5da-496a-a48c-7807cc858c3e",
            "created_at": "2022-10-25T15:50:23.803657Z",
            "updated_at": "2025-03-27T02:00:55.550132Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "PLATINUM"
            ],
            "source_name": "MITRE:PLATINUM",
            "tools": [
                "JPIN",
                "Dipsind",
                "adbupd"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7d8ef10e-1d7b-49a0-ab6e-f1dae465a1a4",
            "created_at": "2023-01-06T13:46:38.595679Z",
            "updated_at": "2025-03-27T02:00:02.869216Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "TwoForOne",
                "G0068",
                "ATK33"
            ],
            "source_name": "MISPGALAXY:PLATINUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e61c46f7-88a1-421a-9fed-0cfe2eeb820a",
            "created_at": "2022-10-25T16:07:24.061767Z",
            "updated_at": "2025-03-27T02:02:10.094583Z",
            "deleted_at": null,
            "main_name": "Platinum",
            "aliases": [
                "ATK 33",
                "Operation EasternRoppels",
                "TwoForOne"
            ],
            "source_name": "ETDA:Platinum",
            "tools": [
                "AMTsol",
                "Adupib",
                "Adupihan",
                "Dipsind",
                "DvDupdate.dll",
                "JPIN",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "RedPepper",
                "RedSalt",
                "Titanium",
                "adbupd",
                "psinstrc.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3940f08b-39aa-492c-8699-86bfe515fa70",
            "created_at": "2023-01-06T13:46:39.470535Z",
            "updated_at": "2025-03-27T02:00:03.101867Z",
            "deleted_at": null,
            "main_name": "BITWISE SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:BITWISE SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535695,
    "ts_updated_at": 1743041587,
    "ts_creation_date": 1666530014,
    "ts_modification_date": 1666530014,
    "files": {
        "pdf": "https://archive.orkl.eu/2c74c481c6e1c2334ada03b199fecf3527e06ba5.pdf",
        "text": "https://archive.orkl.eu/2c74c481c6e1c2334ada03b199fecf3527e06ba5.txt",
        "img": "https://archive.orkl.eu/2c74c481c6e1c2334ada03b199fecf3527e06ba5.jpg"
    }
}