{
    "id": "4c06f64d-a2d3-4476-aae7-e42d1252c9fc",
    "created_at": "2022-10-25T16:48:17.641636Z",
    "updated_at": "2025-03-27T02:10:04.727964Z",
    "deleted_at": null,
    "sha1_hash": "60ffe642ed8d9d2171b4c44729c4687fe493e87d",
    "title": "Domestic Kitten: An Iranian Surveillance Operation",
    "authors": "Checkpoint",
    "file_creation_date": "2019-09-18T03:41:48Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 622477,
    "plain_text": "# Domestic Kitten: An Iranian Surveillance Operation\n\n**[research.checkpoint.com/domestic-kitten-an-iranian-surveillance-operation](https://research.checkpoint.com/domestic-kitten-an-iranian-surveillance-operation/)**\n\nSeptember 7,\n2018\n\nChinese strategist Sun Tzu, Italian political philosopher Machiavelli and English philosopher\nThomas Hobbes all justified deceit in war as a legitimate form of warfare. Preceding them\nall, however, were some in the Middle East who had already internalized and implemented\nthis strategy to great effect, and continue to do so today.\n\nRecent investigations by Check Point researchers reveal an extensive and targeted attack\nthat has been taking place since 2016 and, until now, has remained under the radar due to\nthe artful deception of its attackers towards their targets. Through the use of mobile\napplications, those behind the attack use fake decoy content to entice their victims to\ndownload such applications, which are in fact loaded with spyware, to then collect sensitive\ninformation about them. Interestingly, these targets include Kurdish and Turkish natives\nand ISIS supporters. Most interesting of all, though, is that all these targets are actually\nIranians citizens.\n\n**What Information is Collected?**\n\nConsidering the nature of the target, the data collected about these groups provides those\nbehind the campaign with highly valuable information that will no doubt be leveraged in\nfurther future action against them. Indeed, the malware collects data including contact lists\nstored on the victim’s mobile device, phone call records, SMS messages, browser history\nand bookmarks, geo-location of the victim, photos, surrounding voice recordings and more.\n\n**Who is Behind the Attack?**\n\nWhile the exact identity of the actor behind the attack remains unconfirmed, current\nobservations of those targeted, the nature of the apps and the attack infrastructure\ninvolved leads us to believe this operation is of Iranian origin. In fact, according to our\ndiscussions with intelligence experts familiar with the political discourse in this part of the\nworld, Iranian government entities, such as the Islamic Revolutionary Guard Corps (IRGC),\nMinistry of Intelligence, Ministry of Interior and others, frequently conduct extensive\nsurveillance of these groups.\n\nIndeed, these surveillance programs are used against individuals and groups that could\npose a threat to stability of the Iranian regime. These could include internal dissidents and\nopposition forces, as well as ISIS advocates and the Kurdish minority settled mainly in\nWestern Iran.\n\n\n-----\n\nWhile our investigation is still in progress, the research below reveals the full extent of these\ntargeted attacks, its infrastructure and victims and the possible political story behind it. In\nthe meantime, we have dubbed this operation ‘Domestic Kitten’ in line with the naming of\n[other Iranian APT attacks.](https://www.reuters.com/article/us-iran-cyber/once-kittens-in-cyber-spy-world-iran-gains-prowess-security-experts-idUSKCN1BV1VA)\n\n**Data Collection via Mobile Applications**\n\nVictims are first lured into downloading applications which is believed to be of interest to\nthem. The applications our researchers discovered included an ISIS branded wallpaper\nchanger, “updates” from the ANF Kurdistan news agency and a fake version of the\nmessaging app, Vidogram.\n\nRegarding the ISIS-themed application, its main functionality is setting wallpapers of ISIS\npictures, and therefore seems to be targeting the terror organization’s advocates. Curiously,\nits Arabic name is grammatically incorrect (“اﻻﺳﻼﻣﯿﺔ ﺧﻼﻓﺔ دوﻟﺔ”, which should instead be\n“اﻻﺳﻼﻣﯿﺔ **اﻟﺨﻼﻓﺔ** دوﻟﺔ”).\n\n**Figure 1: The application offering Isis-related wallpapers.**\n\n\n-----\n\n**Figure 2: ANF News Agency website, on which the decoy app is based.**\n\n\n-----\n\nWith regards to the ANF News Agency app, while ANF is a legitimate Kurdish news website\nits app has been fabricated by the attackers to pose as the legitimate app in order to\ndeceive their targets.\n\nDue to the names and content that is offered by the above mentioned applications then, we\nare lead to believe that specific political groups and users, mainly ISIS supporters and the\nKurdish ethnic group, are targeted by the operation.\n\nHowever, when most of the victims are actually Iranian citizens, it raises more pertinent\nquestions about who may be behind the attack. Due to the attack infrastructure, reviewed\nbelow, and its consistency with previous investigations of state-sponsored Iranian\noperations covered by Check Point researchers, we were led to believe that Iranian\ngovernment agencies may well be behind the campaign.\n\n**Technical Analysis**\n\nA closer look at each of the applications used in the campaign show them to have the same\ncertificate that was issued in 2016. This certificate is associated with the e-mail address\n‘telecom2016@yahoo[.]com’, as seen below.\n\n**Figure 3: Attack applications certificate uses the same email address**\n‘telecom2016@yahoo[.]com’\n\nUnfortunately not much is known about this e-mail address, as it was not used to register\nany domain names or to launch attacks in the past.\n\nAnother unique characteristic of the applications used, though, is that all of the samples\nanalyzed have several classes that are under a misspelled package name,\n“andriod.browser”.\n\n\n-----\n\n**Figure 4: The malicious applications’ classes.**\n\nThese classes are seen to be in charge of data exfiltration,\ncollecting sensitive information from the victim’s device.\nSuch information includes:\n\nSMS/MMS messages\nphone calls records\nContacts list\nBrowser history and bookmarks\nExternal storage\nApplication list\nClipboard content\nGeo-location and camera photos\n\nInterestingly, they also collect surrounding voice\nrecordings.\n\n\n-----\n\n**_Figure 5: Examples of the malicious code._**\n\nAll of the stolen data is then send back to C&C servers using HTTP POST requests.\nAdditionally, one of the applications contacts firmwaresystemupdate[.]com, a newly\nregistered website that was seen to resolve to an Iranian IP address at first, but then\nswitched to a Russian address.\n\n**Figure 6: One of the decoy applications contact firmwaresystemupdate[.]com**\n\nThe rest of the applications contact IP addresses directly, which unlike the previous domain,\nare base64 encoded and XORed:\n\n\n-----\n\n**_Figure 7: The C&C decoding._**\n\nAlthough these IP addresses were contacted directly, they are newly registered domains\nthat resolve to each of the IP addresses and they all follow the same pattern of a first namesurname naming convention:\n\nStevenwentz[.]com\n\nRonaldlubbers[.]site\n\nGeorgethompson[.]space\n\nEach victim then receives a unique device UUID (a UUID is the encoded value of device’s\nandroid_id), which appears at the beginning of each log that is sent back to the attacker,\nwith the title of each log having the same structure: UUID_LogDate_LogTime.log.\n\nWhen a log is created for a victim, some basic information is then collected and\ndocumented prior to the logging of phone call details. In addition, all the logs use a unique\ndelimiter “~~~” to separate between the fields of the stolen data:\n\n**_Figure 8: SMS log example._**\n\nThe different classes then collect relevant data,\nand add them to such a log that is then zipped.\nAfterwards, the archive is encrypted using AES,\nwith the device UUID as the encryption key, as\nseen in the below code:\n\n\n-----\n\n**_Figure 9: The application’s encryption method._**\n\nThis information is collected and sent back to C&C servers when the command is received\nfrom the attacker. These commands also follow the same structure as the log, as it uses the\nsame delimiter, and can include things such as “Get File”, “Set Server”, “Get Contacts” and\nmore:\n\n**_Figure 10: Example of commands sent from the server._**\n\nAs a result of all the above, this glance into inner working of this attack infrastructure\ntherefore allowed us to form a precise idea about how wide this attack is and the victims\ntargeted.\n\n**Victim Distribution**\n\nHaving analyzed the full extent of the operation, as well as some extensive information\nabout the attacked devices and the log files collected, we understood that around 240 users\nhave so far fallen victim to this surveillance campaign.\n\nIn addition, due to careful documentation of the campaign by its creators showed we were\nable to learn that over 97% of its victims are Iranian, consistently aligning with our\nestimation that this campaign is of Iranian origin.\n\n\n-----\n\nIn addition to the Iranian targets discovered, we also found victims from Afghanistan, Iraq\nand Great Britain. Interestingly, the log documentation includes the name of the malicious\napplication used to intercept the victims’ data, as well as an Application Code Name field.\n\nThis field includes a short description of the app, which leads us to believe that this is a field\nused by the attackers to instantly recognize the application used by the victim. Observed\ncode names includes ‘Daesh4’ (ISIS4), ‘Military News’, ‘Weapon2’, ‘Poetry Kurdish’.\n\nBelow is a visualization of the attacked devices and mobile vendors that were documented\nin the logs:\n\n**Figure 11: A breakdown of attacked devices and mobile vendors.**\n\nWhile the number of victims and their characteristics are detailed above, the number of\npeople affected by this operation is actually much higher. This is due to the fact that the full\ncontact list stored in each victim’s mobile device, including full names and at least one of\ntheir phone numbers, was also harvested by the attackers.\n\nIn addition, due to phone calls, SMS details, as well as the actual SMS messages, also\nrecorded by the attackers, the private information of thousands of totally unrelated users\nhas also been compromised.\n\n————————————————————————————————————————\n\n-----\n\nCheck Point’s Mobile solutions can protect against this type of attack. For enterprises, read\n[more about Check Point’s Sand Blast Mobile, and for consumers Check Point’s Zone Alarm](https://www.checkpoint.com/products/mobile-threat-defense/)\nMobile, to learn how you can protect your device from malicious and invasive mobile\nmalware.\n\nWe wish to thank Dr. Raz Zimmt, an expert on Iran at the Institute for National Security\nStudies (INSS), for his illuminating insights.\n\n**Indicators of Compromise**\n\nc168f3ea7d0e2cee91612bf86c5d95167d26e69c\n\n0fafeb1cbcd6b19c46a72a26a4b8e3ed588e385f\n\nf1355dfe633f9e1350887c31c67490d928f4feec\n\nd1f70c47c016f8a544ef240487187c2e8ea78339\n\n162[.]248[.]247[.]172\n\n190[.]2[.]144[.]140\n\n190[.]2[.]145[.]145\n\n89[.]38[.]98[.]49\n\nFirmwaresystemupdate[.]com\n\nStevenwentz[.]com\n\nRonaldlubbers[.]site\n\nGeorgethompson[.]space\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/48z6mq7k6xlzicxbj9360eskrta92fbm"
    ],
    "report_names": [
        "Checkpoint_Domestic-Kitten-Iranian-Surveillance-Operation(09-07-2018)"
    ],
    "threat_actors": [
        {
            "id": "30f6ddb3-f5aa-4b78-a1a5-e37c42b2c560",
            "created_at": "2022-10-25T16:07:23.544297Z",
            "updated_at": "2025-03-27T02:02:09.855532Z",
            "deleted_at": null,
            "main_name": "Domestic Kitten",
            "aliases": [
                "APT-C-50",
                "Bouncing Golf"
            ],
            "source_name": "ETDA:Domestic Kitten",
            "tools": [
                "FurBall",
                "GolfSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "44d5df14-6a25-41d6-a54c-7c7ebac358cf",
            "created_at": "2023-01-06T13:46:38.817312Z",
            "updated_at": "2025-03-27T02:00:02.926727Z",
            "deleted_at": null,
            "main_name": "Domestic Kitten",
            "aliases": [
                "Bouncing Golf",
                "APT-C-50"
            ],
            "source_name": "MISPGALAXY:Domestic Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1568778108,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/60ffe642ed8d9d2171b4c44729c4687fe493e87d.pdf",
        "text": "https://archive.orkl.eu/60ffe642ed8d9d2171b4c44729c4687fe493e87d.txt",
        "img": "https://archive.orkl.eu/60ffe642ed8d9d2171b4c44729c4687fe493e87d.jpg"
    }
}