{
    "id": "4c0c4e2a-abf8-4fcc-aeb5-d8016b2ac53b",
    "created_at": "2023-01-12T15:08:57.077644Z",
    "updated_at": "2025-03-27T02:06:05.458861Z",
    "deleted_at": null,
    "sha1_hash": "b86cdf5f000dfd785969417b4696b4480548d93a",
    "title": "2021-04-19 - Inside the CIA and NSA disagreement over Russian bounties story",
    "authors": "",
    "file_creation_date": "2022-05-28T18:26:12Z",
    "file_modification_date": "2022-05-28T18:26:12Z",
    "file_size": 175508,
    "plain_text": "# Inside the CIA and NSA disagreement over Russian bounties story\n\n**[washingtonexaminer.com/opinion/inside-the-cia-and-nsa-disagreement-over-russian-bounties-story](https://www.washingtonexaminer.com/opinion/inside-the-cia-and-nsa-disagreement-over-russian-bounties-story)**\n\nTom Rogan April 19, 2021\n\nDid Russia's GRU military intelligence service pay the Taliban bounties to kill American\nmilitary personnel in Afghanistan? It's unclear. The intelligence community has given neither\nformer President Donald Trump or President Joe Biden a high confidence assessment that\nsuch incidents occurred. But that's not the end of the story.\n\nFor the CIA in particular, this is very much an open matter.\n\nPrimarily responsible for the collection of human intelligence, the CIA has moderate\nconfidence that a compartmentalized unit of the GRU did indeed pay bounties for the explicit\npurpose of killing Americans. I'm led to believe that the CIA's basis for this assessment has\nfive key foundations.\n\nFirst, information gathered from detainee interviews and related U.S. military operations in\nAfghanistan.\n\n[Second, detected financial flows between the GRU, its intermediaries, and Taliban officers.](https://www.nytimes.com/2020/06/30/us/politics/russian-bounties-afghanistan-intelligence.html)\n\nThird, highly sensitive and reliable reporting from agents (human sources) inside and outside\nof the Taliban network (some of this reporting is so sensitive that the CIA delayed sharing it\nwith America's closest foreign partners).\n\n\n-----\n\nFourth, assessment of the GRU s established covert actions in Afghanistan. It has previously\nbeen established with high confidence, for example, that the GRU has supported active\ncombat Taliban elements with funding, explicitly anti-U.S. tactical guidance, and weaponry.\n\nFifth, Vladimir Putin's particular ideological animus for the United States and historic animus\nover 1980s U.S. actions against the Soviet Union in Afghanistan. At least under its current\n[chief, Igor Kostyukov, the GRU is a near-perfect physical manifestation of this anti-](https://www.washingtonexaminer.com/opinion/why-russias-gru-would-kill-americans-in-afghanistan)\nAmericanism (in the coming days, I will report on another case of the GRU's exceptionally\naggressive anti-U.S. activity).\n\nIn contrast, both the National Security Agency and the Defense Intelligence Agency, despite\nsharing the CIA's concerns over Russia's intelligence activity in Afghanistan, lack the\nindependent intelligence reporting to corroborate the CIA's bounty assessment. The NSA is\nparticularly relevant as pertaining to the intelligence community assessments previously\ngiven to Trump, and now, to Biden.\n\nThe NSA casts a wide net in terms of signal (phones, cyber, computers, etc.) intelligence\ncollection targeting the Russian government. Were the bounties story legitimate, the NSA\nbelieves it would have intercepted, or at least detected, communications relating to such\nbounties. An important point to note here is that the NSA believes this, in spite of known\nRussian efforts to disrupt and misinform NSA collection activities. On the most sensitive\nRussian intelligence operations (as any bounties payments for American bodies would\nobviously be), Russian operatives take great pains to avoid communication not simply with\nMoscow but also with their relevant embassy stations. They do so not simply to avoid being\ncaught but to avoid being caught up in the NSA's exceptionally capable metadata mining and\nprofiling software. From Putin on down, Russian officials also regularly share fictions on\nencrypted lines they believe the NSA may have penetrated.\n\nTop line: I understand that the NSA does not currently have evidence of GRU officers\ncredibly talking about paying the Taliban to kill Americans. Nor does the NSA have more\ntangential data-based evidence, such as detection of burner cellphones used by\ncompartmentalized GRU officers in proximity to burner cellphones used by Taliban officers\nresponsible for U.S.-targeting efforts (this contrasts, for example, with the NSA's dead-torights evidence against the Russian FSB in the aftermath of its bungled August 2020\nassassination attempt against Alexei Navalny).\n\nThis separation between the CIA and NSA is important. To guard against groupthink and\nconfirmation bias (see weapons of mass destruction, circa 2003), the NSA must base its\nintelligence assessments on its own collection activities, not on what it wants to find.\n\nThis leaves the bounties story as an open case that lacks the evidence to justify presidentiallevel policy responses.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-19 - Inside the CIA and NSA disagreement over Russian bounties story.pdf"
    ],
    "report_names": [
        "2021-04-19 - Inside the CIA and NSA disagreement over Russian bounties story.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536137,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1653762372,
    "ts_modification_date": 1653762372,
    "files": {
        "pdf": "https://archive.orkl.eu/b86cdf5f000dfd785969417b4696b4480548d93a.pdf",
        "text": "https://archive.orkl.eu/b86cdf5f000dfd785969417b4696b4480548d93a.txt",
        "img": "https://archive.orkl.eu/b86cdf5f000dfd785969417b4696b4480548d93a.jpg"
    }
}