{
    "id": "4c224f60-54ba-4c72-8670-e3f497eca666",
    "created_at": "2022-10-25T16:48:16.653609Z",
    "updated_at": "2025-03-27T02:13:33.769524Z",
    "deleted_at": null,
    "sha1_hash": "936b76720ffc221066235838b40ef9e7548c58ab",
    "title": "DNS Hijacking Abuses Trust In Core Internet Service",
    "authors": "Cisco",
    "file_creation_date": "2019-09-18T01:52:05Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 455546,
    "plain_text": "# DNS Hijacking Abuses Trust In Core Internet Service\n\n**blog.talosintelligence.com/2019/04/seaturtle.html**\n\n_[Authors: Danny Adamitis, David Maynor, Warren Mercer, Matthew Olney and Paul Rascagneres.](https://twitter.com/dadamitis)_\n\n_Update 4/18: A correction has been made to our research based on feedback from Packet_\nClearing House, we thank them for their assistance\n\n## Preface\n\nThis blog post discusses the technical details of a state-sponsored attack manipulating DNS\nsystems. While this incident is limited to targeting primarily national security organizations\nin the Middle East and North Africa, and we do not want to overstate the consequences of\nthis specific campaign, we are concerned that the success of this operation will lead to\nactors more broadly attacking the global DNS system. DNS is a foundational technology\nsupporting the Internet. Manipulating that system has the potential to undermine the trust\nusers have on the internet. That trust and the stability of the DNS system as a whole drives\nthe global economy. Responsible nations should avoid targeting this system, work together\nto establish an accepted global norm that this system and the organizations that control it\nare off-limits, and cooperate in pursuing those actors who act irresponsibly by targeting this\nsystem.\n\n## Executive Summary\n\n\n-----\n\nCisco Talos has discovered a new cyber threat campaign that we are calling \"Sea Turtle,\"\nwhich is targeting public and private entities, including national security organizations,\nlocated primarily in the Middle East and North Africa. The ongoing operation likely began as\nearly as January 2017 and has continued through the first quarter of 2019. Our investigation\nrevealed that at least 40 different organizations across 13 different countries were\ncompromised during this campaign. We assess with high confidence that this activity is\nbeing carried out by an advanced, state-sponsored actor that seeks to obtain persistent\naccess to sensitive networks and systems.\n\nThe actors behind this campaign have focused on using DNS hijacking as a mechanism for\nachieving their ultimate objectives. DNS hijacking occurs when the actor can illicitly modify\nDNS name records to point users to actor-controlled servers. The Department of Homeland\n[Security (DHS) issued an alert about this activity on Jan. 24 2019, warning that an attacker](https://www.us-cert.gov/ncas/alerts/AA19-024A)\ncould redirect user traffic and obtain valid encryption certificates for an organization's\ndomain names.\n\nIn the Sea Turtle campaign, Talos was able to identify two distinct groups of victims. The first\ngroup, we identify as primary victims, includes national security organizations, ministries of\nforeign affairs, and prominent energy organizations. The threat actor targeted third-party\nentities that provide services to these primary entities to obtain access. Targets that fall into\nthe secondary victim category include numerous DNS registrars, telecommunication\ncompanies, and internet service providers. One of the most notable aspects of this\ncampaign was how they were able to perform DNS hijacking of their primary victims by first\ntargeting these third-party entities.\n\nWe assess with high confidence that these operations are distinctly different and\n[independent from the operations performed by DNSpionage, which we reported on in](https://blog.talosintelligence.com/2018/11/dnspionage-campaign-targets-middle-east.html)\nNovember 2018. The Sea Turtle campaign almost certainly poses a more severe threat than\nDNSpionage given the actor's methodology in targeting various DNS registrars and\nregistries. The level of access we presume necessary to engage in DNS hijacking successfully\nindicates an ongoing, high degree of threat to organizations in the targeted regions. Due to\nthe effectiveness of this approach, we encourage all organizations, globally, to ensure they\nhave taken steps to minimize the possibility of malicious actors duplicating this attack\nmethodology.\n\nThe threat actors behind the Sea Turtle campaign show clear signs of being highly capable\n[and brazen in their endeavors. The actors are responsible for the first publicly confirmed](https://www.netnod.se/news/statement-on-man-in-the-middle-attack-against-netnod)\ncase against an organizations that manages a root server zone, highlighting the attacker's\nsophistication. Notably, the threat actors have continued their attacks despite public reports\ndocumenting various aspects of their activity, suggesting they are unusually brazen and\nmay be difficult to deter going forward. In most cases, threat actors typically stop or slow\ndown their activities once their campaigns are publicly revealed.\n\n\n-----\n\nThis post provides the technical findings you would typically see in a Talos blog. We will also\noffer some commentary on the threat actor's tradecraft, including possible explanations\nabout the actor's attack methodology and thought process. Finally, we will share the IOCs\nthat we have observed thus far, although we are confident there are more that we have not\nseen.\n\n### Background on Domain Name Services and records management\n\nThe threat actors behind the Sea Turtle campaign were successful in compromising entities\nby manipulating and falsifying DNS records at various levels in the domain name space. This\nsection provides a brief overview of where DNS records are managed and how they are\naccessed to help readers better understand how these events unfolded.\n\nThe first and most direct way to access an organization's DNS records is through the\nregistrar with the registrant's credentials. These credentials are used to login to the DNS\nprovider from the client-side, which is a registrar. If an attacker was able to compromise an\norganization's network administrator credentials, the attacker would be able to change that\nparticular organization's DNS records at will.\n\nThe second way to access DNS records is through a DNS registrar, sometimes called\nregistrar operators. A registrar sells domain names to the public and manages DNS records\non behalf of the registrant through the domain registry. Records in the domain registry are\naccessed through the registry application using the Extensible Provisioning Protocol (EPP).\n[EPP was detailed in the request for comment (RFC) 5730 as \"a means of interaction between](https://tools.ietf.org/html/rfc5730)\na registrar's applications and registry applications.\" If the attackers were able to obtain one\nof these EPP keys, they would be able to modify any DNS records that were managed by that\nparticular registrar.\n\nThe third approach to gain access to DNS records is through one of the registries. These\nregistries manage any known TLD, such as entire country code top-level domains (ccTLDs)\nand generic top-level domains (gTLDs). For example, Verisign manages all entities associated\nwith the top-level domain (TLD) \".com.\" All the different registry information then converges\n[into one of 12 different organization that manage different parts of the domain registry root.](https://www.iana.org/domains/root/servers)\nThe domain registry root is stored on 13 \"named authorities in the delegation data for the\n[root zone,\" according to ICANN.](https://www.icann.org/news/blog/there-are-not-13-root-servers)\n\nFinally, actors could target root zone servers to modify the records directly. It is important to\nnote that there is no evidence during this campaign (or any other we are aware of) that the\nroot zone servers were attacked or compromised. We highlight this as a potential avenue\n[that attackers would consider. The root DNS servers issued a joint statement that stated,](https://root-servers.org/news/20190314-Rootops_statement_Integrity_of_root_server_system.pdf)\n\"There are no signs of lost integrity or compromise of the content of the root [server] zone…\nThere are no signs of clients having received unexpected responses from root servers.\"\n\n\n-----\n\n### Assessed Sea Turtle DNS hijacking methodology\n\nIt is important to remember that the DNS hijacking is merely a means for the attackers to\nachieve their primary objective. Based on observed behaviors, we believe the actor\nultimately intended to steal credentials to gain access to networks and systems of interest.\nTo achieve their goals, the actors behind Sea Turtle:\n\n1. Established a means to control the DNS records of the target.\n2. Modified DNS records to point legitimate users of the target to actor-controlled\n\nservers.\n3. Captured legitimate user credentials when users interacted with these actor\ncontrolled servers.\n\nThe diagram below illustrates how we believe the actors behind the Sea Turtle campaign\nused DNS hijacking to achieve their end goals.\n\n### Redirection Attack Methodology Diagram\n\n\n-----\n\n### Operational tradecraft\n\n#### Initial access\n\nThe threat actors behind the Sea Turtle campaign gained initial access either by exploiting\nknown vulnerabilities or by sending spear-phishing emails. Talos believes that the threat\nactors have exploited multiple known CVEs to either gain initial access or to move laterally\nwithin an affected organization. Based on our research, we know the actor utilizes the\nfollowing known exploits:\n\n[CVE-2009-1151: PHP code injection vulnerability affecting phpMyAdmin](https://nvd.nist.gov/vuln/detail/CVE-2009-1151)\n[CVE-2014-6271: RCE affecting GNU bash system, specifically the SMTP (this was part of](https://nvd.nist.gov/vuln/detail/CVE-2014-6271)\n[the Shellshock CVEs)](https://www.us-cert.gov/ncas/alerts/TA14-268A)\n[CVE-2017-3881: RCE by unauthenticated user with elevated privileges Cisco switches](https://nvd.nist.gov/vuln/detail/CVE-2017-3881)\n[CVE-2017-6736: Remote Code Exploit (RCE) for Cisco integrated Service Router 2811](https://nvd.nist.gov/vuln/detail/CVE-2017-6736)\n[CVE-2017-12617: RCE affecting Apache web servers running Tomcat](https://nvd.nist.gov/vuln/detail/CVE-2017-12617)\n[CVE-2018-0296: Directory traversal allowing unauthorized access to Cisco Adaptive](https://nvd.nist.gov/vuln/detail/CVE-2018-0296)\nSecurity Appliances (ASAs) and firewalls\n\n\n-----\n\n[CVE-2018-7600: RCE for Website built with Drupal, aka \"Drupalgeddon\"](https://nvd.nist.gov/vuln/detail/CVE-2018-7600)\n\nAs of early 2019, the only evidence of the spear-phishing threat vector came from a\ncompromised organization's public disclosure. On January 4, Packet Clearing House, which\nis not an Internet exchange point but rather is an NGO which provides support to Internet\nexchange points and the core of the domain name system, provided confirmation of this\naspect of the actors’ tactics when it publicly revealed its internal DNS had been briefly\nhijacked as a consequence of the compromise at its domain registrar.\n\nAs with any initial access involving a sophisticated actor, we believe this list of CVEs to be\nincomplete. The actor in question can leverage known vulnerabilities as they encounter a\nnew threat surface. This list only represents the observed behavior of the actor, not their\ncomplete capabilities.\n\n### Globalized DNS hijacking activity as an infection vector\n\nDuring a typical incident, the actor would modify the NS records for the targeted\norganization, pointing users to a malicious DNS server that provided actor-controlled\nresponses to all DNS queries. The amount of time that the targeted DNS record was\nhijacked can range from a couple of minutes to a couple of days. This type of activity could\ngive an attacker the ability to redirect any victim who queried for that particular domain\n[around the world. Other cybersecurity firms previously reported some aspects of this](https://www.crowdstrike.com/blog/widespread-dns-hijacking-activity-targets-multiple-sectors/)\nactivity. Once the actor-controlled name server was queried for the targeted domain, it\nwould respond with a falsified \"A\" record that would provide the IP address of the actorcontrolled MitM node instead of the IP address of the legitimate service. In some instances,\nthe threat actors modified the time-to-live (TTL) value to one second. This was likely done to\nminimize the risk of any records remaining in the DNS cache of the victim machine.\n\nDuring 2019, we observe the following name servers being used in support of the Sea Turtle\ncampaign:\n\nDomain Active Timeframe\n\nns1[.]intersecdns[.]com March - April 2019\n\nns2[.]intersecdns[.]com March - April 2019\n\nns1[.]lcjcomputing[.]com January 2019\n\nns2[.]lcjcomputing[.]com January 2019\n\n\n-----\n\n### Credential harvesting: Man-in-the-middle servers\n\nOnce the threat actors accessed a domain's DNS records, the next step was to set up a manin-the-middle (MitM) framework on an actor-controlled server.\n\nThe next step for the actor was to build MitM servers that impersonated legitimate services\nto capture user credentials. Once these credentials were captured, the user would then be\npassed to the legitimate service. to evade detection, the actors performed \"certificate\nimpersonation,\" a technique in which the attacker obtained a certificate authority-signed\nX.509 certificate from another provider for the same domain imitating the one already used\nby the targeted organization. For example, if a DigiCert certificate protected a website, the\nthreat actors would obtain a certificate for the same domain but from another provider,\nsuch as Let's Encrypt or Comodo. This tactic would make detecting the MitM attack more\ndifficult, as a user's web browser would still display the expected \"SSL padlock\" in the URL\nbar.\n\nWhen the victim entered their password into the attacker's spoofed webpage, the actor\nwould capture these credentials for future use. The only indication a victim received was a\nbrief lag between when the user entered their information and when they obtained access\nto the service. This would also leave almost no evidence for network defenders to discover,\nas legitimate network credentials were used to access the accounts.\n\nIn addition to the MitM server IP addresses published in previous reports, Talos identified\n16 additional servers leveraged by the actor during the observed attacks. The complete list\nof known malicious IP addresses are in the Indicators of Compromise (IOC) section below.\n\n### Credential harvesting with compromised SSL certificates\n\nOnce the threat actors appeared to have access to the network, they stole the organization's\nSSL certificate. The attackers would then use the certificate on actor-controlled servers to\nperform additional MitM operations to harvest additional credentials. This allowed the\nactors to expand their access into the targeted organization's network. The stolen\ncertificates were typically only used for less than one day, likely as an operational security\nmeasure. Using stolen certificates for an extended period would increase the likelihood of\ndetection. In some cases, the victims were redirected to these actor-controlled servers\ndisplaying the stolen certificate.\n\nOne notable aspect of the campaign was the actors' ability to impersonate VPN applications,\nsuch as Cisco Adaptive Security Appliance (ASA) products, to perform MitM attacks. At this\ntime, we do not believe that the attackers found a new ASA exploit. Rather, they likely\n\n\n-----\n\nabused the trust relationship associated with the ASA s SSL certificate to harvest VPN\ncredentials to gain remote access to the victim's network. This MitM capability would allow\nthe threat actors to harvest additional VPN credentials.\n\nAs an example, DNS records indicate that a targeted domain resolved to an actor-controlled\nMitM server. The following day, Talos identified an SSL certificate with the subject common\nname of \"ASA Temporary Self Signed Certificate\" associated with the aforementioned IP\naddress. This certificate was observed on both the actor-controlled IP address and on an IP\naddress correlated with the victim organization.\n\nIn another case, the attackers were able to compromise NetNod, a non-profit, independent\ninternet infrastructure organization based in Sweden. NetNod acknowledged the\n[compromise in a public statement on February 5, 2019. Using this access, the threat actors](https://www.netnod.se/news/statement-on-man-in-the-middle-attack-against-netnod)\nwere able to manipulate the DNS records for sa1[.]dnsnode[.]net. This redirection allowed\nthe attackers to harvest credentials of administrators who manage domains with the TLD of\nSaudi Arabia (.sa). It is likely that there are additional Saudi Arabia-based victims from this\nattack.\n\nIn one of the more recent campaigns on March 27, 2019, the threat actors targeted the\n[Sweden-based consulting firm Cafax. On Cafax's public webpage, the company states that](http://www.cafax.se/Home.html)\none of their consultants actively manages the i[.]root-server[.]net zone. NetNod managed\nthis particular DNS server zone. We assess with high confidence that this organization was\ntargeted in an attempt to re-establish access to the NetNod network, which was previously\ncompromised by this threat actor.\n\n### Primary and secondary victims\n\n\n-----\n\nWe identified 40 different organizations that have been targeted during this campaign. The\nvictim organizations appear to be broadly grouped into two different categories. The first\ngroup of victims, which we refer to as primary victims, were almost entirely located in the\nMiddle East and North Africa. Some examples of organizations that were compromised\ninclude:\n\nMinistries of foreign affairs\nMilitary organizations\nIntelligence agencies\nProminent energy organizations\n\nThe second cluster of victim organizations were likely compromised to help enable access to\nthese primary targets. These organizations were located around the world; however, they\nwere mostly concentrated in the Middle East and North Africa. Some examples of\norganizations that were compromised include:\n\nTelecommunications organizations\nInternet service providers\nInformation technology firms\nRegistrars\nOne registry\n\nNotably, the threat actors were able to gain access to registrars that manage ccTLDs for\n[Amnic, which is listed as the technical contact on IANA for the ccTLD .am. Obtaining access](https://www.iana.org/domains/root/db/am.html)\nto this ccTLD registrars would have allowed attackers to hijack any domain that used those\nccTLDs.\n\n### How is this tradecraft different?\n\nThe threat actors behind the Sea Turtle campaign have proven to be highly capable, as they\nhave been able to perform operations for over two years and have been undeterred by\npublic reports documenting various aspects of their activity. This cyber threat campaign\nrepresents the first known case of a domain name registry organization that was\ncompromised for cyber espionage operations.\n\nIn order to distinguish this activity from the previous reporting on other attackers, such as\nthose affiliated with DNSpionage, below is a list of traits that are unique to the threat actors\nbehind the Sea Turtle campaign:\n\nThese actors perform DNS hijacking through the use of actor-controlled name servers.\nThese actors have been more aggressive in their pursuit targeting DNS registries and a\nnumber of registrars, including those that manage ccTLDs.\nThese actors use Let's Encrypts, Comodo, Sectigo, and self-signed certificates in their\n\n\n-----\n\nMitM servers to gain the initial round of credentials.\nOnce they have access to the network, they steal the organization's legitimate SSL\ncertificate and use it on actor-controlled servers.\n\n### Why was it so successful?\n\nWe believe that the Sea Turtle campaign continues to be highly successful for several\nreasons. First, the actors employ a unique approach to gain access to the targeted networks.\nMost traditional security products such as IDS and IPS systems are not designed to monitor\nand log DNS requests. The threat actors were able to achieve this level of success because\nthe DNS domain space system added security into the equation as an afterthought. Had\nmore ccTLDs implemented security features such as registrar locks, attackers would be\nunable to redirect the targeted domains.\n\nThe threat actors also used an interesting techniques called certificate impersonation. This\ntechnique was successful in part because the SSL certificates were created to provide\nconfidentiality, not integrity. The attackers stole organizations' SSL certificates associated\nwith security appliances such as ASA to obtain VPN credentials, allowing the actors to gain\naccess to the targeted network.\n\nThe threat actors were able to maintain long term persistent access to many of these\nnetworks by utilizing compromised credentials.\n\nWe will continue to monitor Sea Turtle and work with our partners to understand the threat\nas it continues to evolve to ensure that our customers remain protected and the public is\ninformed.\n\n### Mitigation strategy\n\nIn order to best protect against this type of attack, we compiled a list of potential actions.\nTalos suggests using a registry lock service, which will require an out-of-band message\nbefore any changes can occur to an organization's DNS record. If your registrar does not\noffer a registry lock service, we recommend implementing multi-factor authentication, such\n[as DUO, to access your organization's DNS records. If you suspect you were targeted by this](https://www.cisco.com/c/en/us/products/security/adaptive-multi-factor-authentication.html)\ntype of activity intrusion, we recommend instituting a network-wide password reset,\npreferably from a computer on a trusted network. Lastly, we recommend applying patches,\nespecially on internet-facing machines. Network administrators can monitor passive DNS\nrecord on their domains, to check for abnormalities.\n\n### Coverage\n\nCVE-2009-1151: PHP code injection vulnerability affecting phpMyAdmin\n[SID: 2281](https://snort.org/rule_docs/1-2281)\n\n\n-----\n\nCVE-2014-6271: RCE affecting GNU bash system, specific the SMTP (this was part of the\nShellshock CVEs)\n[SID: 31975 - 31978, 31985, 32038, 32039, 32041 - 32043, 32069, 32335, 32336](https://snort.org/rule_docs/1-31975)\n\nCVE-2017-3881: RCE for Cisco switches\n[SID: 41909 - 41910](https://snort.org/rule_docs/1-41909)\n\nCVE-2017-6736: Remote Code Exploit (RCE) for Cisco integrated Service Router 2811\n[SID: 43424 - 43432](https://snort.org/rule_docs/3-43424)\n\nCVE-2017-12617: RCE affecting Apache web servers running Tomcat\n[SID: 44531](https://snort.org/rule_docs/1-44531)\n\nCVE-2018-0296: Directory traversal to gain unauthorized access to Cisco Adaptive Security\nAppliances (ASAs) and Firewalls\nSID: 46897\n\nCVE-2018-7600: RCE for Website built with Drupal aka \"Drupalgeddon\"\n[SID: 46316](https://snort.org/rule_docs/1-46316)\n\n### Indicators of Compromise\n\nThe threat actors utilized leased IP addresses from organizations that offer virtual private\nserver (VPS) services. These VPS providers have since resold many of these IP addresses to\nvarious benign customers. To help network defenders, we have included the IP address, as\nwell as the month(s) that the IP address was associated with the threat actor.\n\n**IP address** **Month** **Year** **Country of targets**\n\n199.247.3.191 November 2018 Albania, Iraq\n\n37.139.11.155 November 2018 Albania, UAE\n\n185.15.247.140 January 2018 Albania\n\n206.221.184.133 November 2018 Egypt\n\n188.166.119.57 November 2018 Egypt\n\n185.42.137.89 November 2018 Albania\n\n82.196.8.43 October 2018 Iraq\n\n159.89.101.204 December - January 2018-2019 Turkey, Sweden, Syria, Armenia, US\n\n146.185.145.202 March 2018 Armenia\n\n\n-----\n\n178.62.218.244 December - January 2018-2019 UAE, Cyprus\n\n139.162.144.139 December 2018 Jordan\n\n142.54.179.69 January - February 2017 Jordan\n\n193.37.213.61 December 2018 Cyprus\n\n108.61.123.149 February 2019 Cyprus\n\n212.32.235.160 September 2018 Iraq\n\n198.211.120.186 September 2018 Iraq\n\n146.185.143.158 September 2018 Iraq\n\n146.185.133.141 October 2018 Libya\n\n185.203.116.116 May 2018 UAE\n\n95.179.150.92 November 2018 UAE\n\n174.138.0.113 September 2018 UAE\n\n128.199.50.175 September 2018 UAE\n\n139.59.134.216 July - December 2018 United States, Lebanon\n\n45.77.137.65 March - April 2019 Syria, Sweden\n\n142.54.164.189 March - April 2019 Syria\n\n199.247.17.221 March 2019 Sweden\n\nThe following list contains the threat actor name server domains and their IP address.\n\nDomain Active Timeframe IP address\n\nns1[.]intersecdns[.]com March - April 2019 95.179.150.101\n\nns2[.]intersecdns[.]com March - April 2019 95.179.150.101\n\nns1[.]lcjcomputing[.]com January 2019 95.179.150.101\n\nns2[.]lcjcomputing[.]com January 2019 95.179.150.101\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/dtb6vitjf1ytxlemaszvktq12k1pr8ck"
    ],
    "report_names": [
        "CiscoTalos_SeaTurtle-DNS-hijacking-April(04-17-2019)"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4632103e-8035-4a83-9ecb-c1e12e21288c",
            "created_at": "2022-10-25T16:07:23.542255Z",
            "updated_at": "2025-03-27T02:02:09.854487Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [],
            "source_name": "ETDA:DNSpionage",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "CACTUSPIPE",
                "DNSpionage",
                "DropperBackdoor",
                "Karkoff",
                "MailDropper",
                "OILYFACE"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8d76e350-dfb5-4733-800d-876de41f690d",
            "created_at": "2023-01-06T13:46:38.841887Z",
            "updated_at": "2025-03-27T02:00:02.932838Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [
                "COBALT EDGEWATER"
            ],
            "source_name": "MISPGALAXY:DNSpionage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041613,
    "ts_creation_date": 1568771525,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/936b76720ffc221066235838b40ef9e7548c58ab.pdf",
        "text": "https://archive.orkl.eu/936b76720ffc221066235838b40ef9e7548c58ab.txt",
        "img": "https://archive.orkl.eu/936b76720ffc221066235838b40ef9e7548c58ab.jpg"
    }
}