{
    "id": "4c30d5c0-5f8e-4271-94c1-9f9ade71656a",
    "created_at": "2023-01-12T15:05:47.819064Z",
    "updated_at": "2025-03-27T02:16:57.963281Z",
    "deleted_at": null,
    "sha1_hash": "29f027e36f5afdedaa8dc4c71afbb33652efb5ba",
    "title": "2021-02-26 - Hypervisor Jackpotting- CARBON SPIDER and SPRITE SPIDER Target ESXi Servers With Ransomware to Maximize Impact",
    "authors": "",
    "file_creation_date": "2022-05-28T15:19:58Z",
    "file_modification_date": "2022-05-28T15:19:58Z",
    "file_size": 454687,
    "plain_text": "# New Ransomware Tactic: Adversaries Target ESXi Servers\n\n**[crowdstrike.com/blog/carbon-spider-sprite-spider-target-esxi-servers-with-ransomware/](https://www.crowdstrike.com/blog/carbon-spider-sprite-spider-target-esxi-servers-with-ransomware/?utm_campaign=blog&utm_medium=soc&utm_source=twtr&utm_content=sprout)**\n\nEric Loui - Sergei Frankoff February 26, 2021\n\n**_This is Part 1 of a two-part blog series. Read Part 2_** **_[here.](https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/)_**\n\n[Targeted large-scale ransomware campaigns, referred to as big game hunting (BGH),](https://www.crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-ransomware/)\nremained the primary eCrime threat to organizations across all sectors in 2020. The relentless\nvolume and pace of these campaigns mean that some sophisticated BGH actors have not\nattracted much attention. Two such groups are SPRITE SPIDER, the operators of the\n_Defray777 ransomware (aka Defray, Defray 2018, Target777, RansomX, RansomEXX), and_\n[CARBON SPIDER, a group formerly focused on compromising point-of-sale (POS) devices,](https://adversary.crowdstrike.com/adversary/carbon-spider/)\nand that was responsible for introducing the Darkside ransomware.\n\n[While ransomware for Linux has existed for many years, BGH actors have not historically](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\ntargeted Linux, much less the ESXi hypervisor specifically. This likely reflects the\noverwhelming dominance of the Windows operating system in businesses and large\norganizations. However, in the second half of 2020, SPRITE SPIDER and CARBON SPIDER\nbegan deploying Linux versions of Defray777 and Darkside, respectively, designed\nspecifically to affect ESXi.\n\n\n-----\n\nAffected victims include organizations that have used virtualization to host many of their\ncorporate systems on a few ESXi servers, creating a virtual jackpot for the ransomware. By\ndeploying ransomware on these ESXi hosts, adversaries were able to quickly increase the\nscope of affected systems within the victim environments, resulting in additional pressure on\nvictims to pay a ransom demand. This is a new BGH tactic CrowdStrike refers to as\n_Hypervisor Jackpotting._\n\n## What Is ESXi?\n\nESXi is a Type-1 hypervisor (aka a “bare-metal” hypervisor) developed by VMware. A\nhypervisor is software that runs and manages virtual machines (VMs). In contrast to Type-2\nhypervisors that run on a conventional host operating system, a Type-1 hypervisor runs\ndirectly on a dedicated host’s hardware. ESXi systems are commonly managed by vCenter, a\ncentralized server administration tool that can control multiple ESXi devices. While ESXi is not\na Linux operating system, it is possible to run some Linux-compiled ELF binaries within the\nESXi command shell.\n\nAccording to multiple estimates, VMware holds an overwhelming majority of the worldwide\nvirtual machine market share, well ahead of its nearest competitor. This means that threat\n[actors seeking to encrypt virtual infrastructure may prioritize developing malware that can](https://www.crowdstrike.com/cybersecurity-101/malware/)\naffect VMware environments.\n\n## SPRITE SPIDER and Defray777 Ransomware\n\n[SPRITE SPIDER is an eCrime actor that conducts low-volume BGH ransomware campaigns](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-examples/)\nusing the Defray777 ransomware. Other tools used by SPRITE SPIDER include the Vatet\nloader and the PyXie remote access tool (RAT). The adversary has established initial access\nby exploiting vulnerable Citrix Application Delivery Controllers, as well as by using LUNAR\nSPIDER’s BokBot trojan. To avoid detection, SPRITE SPIDER often stages payloads on\ninternal servers within a victim network and uses in-memory-only deployments of its laterstage tooling. SPRITE SPIDER uses both PyXie and Cobalt Strike to move laterally within a\nvictim environment after obtaining initial access.\n\nLike other BGH actors, SPRITE SPIDER first attempts to compromise domain controllers\n(DCs). After acquiring DC access, SPRITE SPIDER collects and exfiltratrates sensitive victim\ndata, then deploys its Defray777 ransomware. In November 2020, SPRITE SPIDER launched\na dedicated leak site (DLS) on a Tor hidden service domain to publish files from noncompliant\nransomware victims.\n\nLeaking stolen data in an effort to pressure victims into paying is part of a broader trend\nacross the BGH ecosystem. Compared to other BGH actors, SPRITE SPIDER was relatively\nlate to adopt this tactic, possibly due to a desire to avoid attention.\n\n\n-----\n\nIn July 2020, SPRITE SPIDER began using a Linux version of its Defray777 ransomware.\nThe Linux version contains the same file scanning and encryption logic as its Windows\ncounterpart, and is designed to receive a command-line argument with a path to the directory\nwhere it will begin its recursive encryption process. Files are encrypted using AES in ECB\nmode with a 256-bit key that is uniquely generated for each file. The key is then encrypted\nusing an embedded 4096-bit RSA public key and appended to the encrypted file. Each victim\nis targeted with a unique build of Defray777 containing a unique RSA public key. If a victim\npays the ransom, they receive a decryption tool containing an RSA private key that\ncorresponds to the public encryption key.\n\n### ESXi Access\n\nIn order to compromise ESXi devices, SPRITE SPIDER attempts to harvest credentials that\ncan be used to authenticate to the vCenter web interface. SPRITE SPIDER uses PyXie’s\nLaZagne module to recover vCenter credentials stored in web browsers, and also runs\n_Mimikatz to steal credentials from host memory. After authenticating to vCenter, SPRITE_\nSPIDER enables SSH to permit persistent access to ESXi devices. In some cases, the\nadversary will also change the root account password or the host’s SSH keys.\n\n### ESXi Encryption\n\nWhile SPRITE SPIDER uses an in-memory deployment technique for the Windows variant of\n_Defray777, on ESXi, the adversary typically writes the Linux version of Defray777 to_ `/tmp/,`\nusing a filename attempting to masquerade as a legitimate tool (e.g., svc-new). SPRITE\nSPIDER enumerates system information and processes on the ESXi host using the `uname,`\n```\ndf, and esxcli vm process list commands.\n\n```\nBefore executing Defray777, SPRITE SPIDER terminates running VMs in order to allow the\nransomware to encrypt files associated with the VMs. SPRITE SPIDER may also uninstall\nVMware Fault Domain Manager (FDM) using a bash script named `VMware-fdm-`\n```\nuninstall.sh . FDM is a tool that monitors VMs and reboots them when a VM fails.\n\n## CARBON SPIDER and Darkside Ransomware\n\n```\nSince 2016, CARBON SPIDER has traditionally targeted companies operating POS devices,\n[with initial access being gained using low-volume phishing campaigns against this sector.](https://www.crowdstrike.com/cybersecurity-101/phishing/)\nCARBON SPIDER has used a variety of backdoors and RATs to enable persistent access.\nThe adversary’s signature persistent access tools include the Sekur (aka Anunak) implant,\nwhich has been used since 2016, and the Harpy (aka Griffon) backdoor, which has been used\nfrom 2018 through 2020. CARBON SPIDER extensively uses Cobalt Strike for lateral\nmovement, as well as open-source post-exploitation tools like PowerSploit.\n\n\n-----\n\nIn April 2020, the adversary abruptly shifted its operational model away from narrow\ncampaigns focused entirely on companies operating POS devices, to broad, opportunistic\noperations attempting to infect large numbers of victims across almost all sectors. The goal of\nthese campaigns was to deliver the REvil ransomware, which CARBON SPIDER obtained\nfrom [ransomware-as-a-service (RaaS) vendor PINCHY SPIDER. It is likely CARBON](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)\nSPIDER pivoted to BGH in response to the COVID-19 pandemic, which dramatically reduced\nin-person retail sales and hospitality business. Similar to SPRITE SPIDER, CARBON\nSPIDER typically seeks to compromise a DC first before exfiltrating data and deploying\nransomware.\n\nCARBON SPIDER deepened its commitment to BGH through 2020 by introducing its own\nransomware, Darkside. In August 2020, the adversary began deploying Darkside, likely in\norder to avoid sharing profits from BGH campaigns with PINCHY SPIDER, the REvil vendor.\nIn November 2020, the adversary took another step into the world of BGH by establishing a\nRaaS affiliate program for Darkside, allowing other actors to use the ransomware while\npaying CARBON SPIDER a cut. Similar to SPRITE SPIDER and others, CARBON SPIDER\noperates a DLS for Darkside, which has been active since August 2020.\n\nIn August 2020, CARBON SPIDER also began using a Linux variant of Darkside configured\nspecifically to affect ESXi hosts. The ESXi version of Darkside targets files relating to VMware\nvirtual machines, including files with the following file extensions: `vmdk,` `vswp,` `vmem,`\n```\nvmsn, nvram, vmsd, vmss, vmx, vmxf, log . Files are encrypted using the\n\n```\nChaCha20 algorithm with a 32-byte key and 8-byte nonce, uniquely generated per file. The\nChaCha20 key and nonce are then encrypted using a 4096-bit RSA public key that is\nembedded in the ransomware. To speed up the encryption process, Darkside also has a\nconfigurable encryption size that can be used to control how much of each file is encrypted. In\nsamples recovered by CrowdStrike Intelligence, the encryption size was set to 50MB, which is\nenough data to prevent the recovery of the virtual machine files. An example of the Darkside\nconfiguration, as written to its log file, is shown in Figure 1.\n\nFigure 1. Darkside configuration from log file\n\n### ESXi Access\n\n\n-----\n\nSimilar to SPRITE SPIDER, CARBON SPIDER has gained access to ESXi servers using\nvalid credentials. The adversary has typically accessed these systems via the vCenter web\ninterface, using legitimate credentials, but has also logged in over SSH using the Plink utility\nto drop Darkside.\n\n### ESXi Encryption\n\nCARBON SPIDER writes Darkside to `/tmp/ on ESXi hosts with a generic filename. The`\nadversary typically does not do the same amount of host reconnaissance that SPRITE\nSPIDER does. CARBON SPIDER has used built-in VMware Tools scripts to shut down guest\nVMs in order to make sure these VMs are encrypted by Darkside.\n\n## Conclusion\n\nBy deploying ransomware on ESXi, SPRITE SPIDER and CARBON SPIDER likely intend to\nimpose greater harm on victims than could be achieved by their respective Windows\nransomware families alone. Encrypting one ESXi server inflicts the same amount of damage\nas individually deploying ransomware on each VM hosted on a given server. Consequently,\ntargeting ESXi hosts can also improve the speed of BGH operations.\n\nIf these ransomware attacks on ESXi servers continue to be successful, it is likely that more\nadversaries will begin to target virtualization infrastructure in the medium term.\n\n## MITRE ATT&CK TTP Comparison®\n\nThe following table provides an overview of SPRITE SPIDER and CARBON SPIDER’s\ntactics, techniques and procedures (TTPs) specific to ESXi ransomware attacks.\n\n\n**Tactic** **Technique** **SPRITE**\n**SPIDER**\n\n\n**CARBON**\n**SPIDER**\n\n\n**Summary**\n\n\nInitial\nAccess\n\n\nT1078 – Valid Accounts Y Y Both SPRITE\nSPIDER and\nCARBON\nSPIDER\nauthenticate to\nvCenter using\nvalid credentials\n\n\nExecution T1059.004 – Command and\nScripting Interpreter: Unix Shell\n\n\nY Y The adversaries\nuse the ESXi\ncommand shell\nto transfer and\nexecute the\nransomware\n\n\n-----\n\nPersistence T1078 – Valid Accounts Y Y Previously\ncompromised\ncredentials\nenable persistent\naccess\n\n\nPersistence T-1098.004 – SSH Authorized\nKeys\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\nT1222.002 – File and Directory\nPermissions Modification: Linux\nand Mac File and Directory\nPermissions Modification\n\nT1036.005 – Masquerading:\nMatch Legitimate Name or\nLocation\n\nT1070.004 – Indicator Removal on\nHost: File Deletion\n\n\nY SPRITE SPIDER\nhas changed\nroot SSH keys\nfor ESXi hosts\n\nY Y Both adversaries\nmark their\nrespective\nransomware\nbinaries as\nexecutable using\n```\n            chmod\n\n```\nY Y _Defray777 and_\n_Darkside use_\nfilenames that\nappear to be\ninnocuous or\nlegitimate\n\nY SPRITE SPIDER\nmay delete the\n_Defray777 binary_\nafter execution\n\nY SPRITE SPIDER\nperforms basic\nreconnaissance\n(e.g., `uname,`\n```\n            df )\n\n```\n\nDiscovery T1082 – System Information\nDiscovery\n\n\nDiscovery T1057 – Process Discovery Y SPRITE SPIDER\nperforms basic\nreconnaissance\n(e.g., `esxcli`\n```\n                                    vm process\n                                    list )\n\n```\nImpact T1489 – Service Stop Y Y Both adversaries\nmay attempt to\nterminate\nrunning VMs\n\n\nImpact T1486 – Data Encrypted for\nImpact\n\n\nY Y _Defray777 and_\n_Darkside encrypt_\nvictim systems\n\n\n-----\n\n## Indicators of Compromise\n\nExample SHA256 hashes of Darkside and Defray777 Linux variants:\n\n**Description** **SHA256 hash**\n\n\n_Darkside_\nLinux Binary\n\n_Defray777_\nLinux Binary\n\n```\nda3bb9669fb983ad8d2ffc01aab9d56198bd9cedf2cc4387f19f4604a070a9b5\n\n```\n```\ncb408d45762a628872fa782109e8fcfc3a5bf456074b007de21e9331bb3c5849\n\n```\n\n**Additional Resources**\n\n_Read Part 2 of this two-part blog series, Hypervisor Jackpotting (Part 2): eCrime Actors_\n_Increase Targeting of ESXi Servers with Ransomware._\n_Read more about big game hunting adversaries tracked by CrowdStrike Intelligence in_\n_[2020 in the new CrowdStrike 2021 Global Threat Report.](https://www.crowdstrike.com/resources/reports/global-threat-report/)_\n_[Check out the Global Threat Report resource hub to learn more about today’s](https://www.crowdstrike.com/global-threat-report/)_\n_adversaries._\n_To learn more about how to incorporate intelligence on threat actors into your security_\n_strategy, visit the_ _[Falcon X™ Threat Intelligence page.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)_\n_Learn more about the powerful, cloud-native CrowdStrike Falcon® platform by visiting_\n_the product webpage._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-26 - Hypervisor Jackpotting- CARBON SPIDER and SPRITE SPIDER Target ESXi Servers With Ransomware to Maximize Impact.pdf"
    ],
    "report_names": [
        "2021-02-26 - Hypervisor Jackpotting- CARBON SPIDER and SPRITE SPIDER Target ESXi Servers With Ransomware to Maximize Impact.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "475ea823-9e47-4098-b235-0900bc1a5362",
            "created_at": "2022-10-25T16:07:24.506596Z",
            "updated_at": "2025-03-27T02:02:10.263346Z",
            "deleted_at": null,
            "main_name": "Lunar Spider",
            "aliases": [
                "Gold SwathMore"
            ],
            "source_name": "ETDA:Lunar Spider",
            "tools": [
                "BokBot",
                "IceID",
                "IcedID",
                "NeverQuest",
                "Vawtrak",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c2385aea-d30b-4dbc-844d-fef465cf3ea9",
            "created_at": "2023-01-06T13:46:38.916521Z",
            "updated_at": "2025-03-27T02:00:02.950071Z",
            "deleted_at": null,
            "main_name": "LUNAR SPIDER",
            "aliases": [
                "GOLD SWATHMORE"
            ],
            "source_name": "MISPGALAXY:LUNAR SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7268a08d-d4d0-4ebc-bffe-3d35b3ead368",
            "created_at": "2022-10-25T16:07:24.225216Z",
            "updated_at": "2025-03-27T02:02:10.144446Z",
            "deleted_at": null,
            "main_name": "Sprite Spider",
            "aliases": [
                "Gold Dupont",
                "Sprite Spider"
            ],
            "source_name": "ETDA:Sprite Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Coroxy",
                "Defray 2018",
                "Defray777",
                "DroxiDat",
                "Glushkov",
                "LaZagne",
                "Metasploit",
                "PyXie",
                "PyXie RAT",
                "Ransom X",
                "RansomExx",
                "SharpHound",
                "Shifu",
                "SystemBC",
                "Target777",
                "Vatet",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "27e51b73-410e-4a33-93a1-49cf8a743cf7",
            "created_at": "2023-01-06T13:46:39.210675Z",
            "updated_at": "2025-03-27T02:00:03.022315Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "SPRITE SPIDER"
            ],
            "source_name": "MISPGALAXY:GOLD DUPONT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "07775b09-acd9-498e-895f-f10063115629",
            "created_at": "2024-06-04T02:03:07.817613Z",
            "updated_at": "2025-03-27T02:05:17.351811Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "Sprite Spider "
            ],
            "source_name": "Secureworks:GOLD DUPONT",
            "tools": [
                " ArtifactExx",
                " Cobalt Strike",
                " Defray",
                " Metasploit",
                " PyXie",
                " Shifu",
                " SystemBC",
                " Vatet",
                "777"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7cfe3bc9-7a6c-4ee1-a635-5ea7b947147f",
            "created_at": "2024-06-19T02:03:08.122318Z",
            "updated_at": "2025-03-27T02:05:17.398805Z",
            "deleted_at": null,
            "main_name": "GOLD SWATHMORE",
            "aliases": [
                "Lunar Spider "
            ],
            "source_name": "Secureworks:GOLD SWATHMORE",
            "tools": [
                " GlobeImposter",
                " Gozi",
                " Gozi Trojan",
                " IcedID",
                " Latrodectus",
                " TrickBot",
                " TrickBot",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535947,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653751198,
    "ts_modification_date": 1653751198,
    "files": {
        "pdf": "https://archive.orkl.eu/29f027e36f5afdedaa8dc4c71afbb33652efb5ba.pdf",
        "text": "https://archive.orkl.eu/29f027e36f5afdedaa8dc4c71afbb33652efb5ba.txt",
        "img": "https://archive.orkl.eu/29f027e36f5afdedaa8dc4c71afbb33652efb5ba.jpg"
    }
}