{
    "id": "4c375f8c-a405-4927-930c-97fdfd69e972",
    "created_at": "2023-01-12T15:05:42.673845Z",
    "updated_at": "2025-03-27T02:16:41.33699Z",
    "deleted_at": null,
    "sha1_hash": "c91de761d96202ca3e3e14700ea666e20ee161e8",
    "title": "2021-11-18 - Two Iranian Nationals Charged for Cyber-Enabled Disinformation and Threat Campaign Designed to Influence the 2020 U.S. Presidential Election ( Seyyed Mohammad Hosein Musa Kazemi & Sajjad Kashian )",
    "authors": "",
    "file_creation_date": "2022-05-28T03:39:34Z",
    "file_modification_date": "2022-05-28T03:39:34Z",
    "file_size": 100661,
    "plain_text": "# Two Iranian Nationals Charged for Cyber-Enabled Disinformation and Threat Campaign Designed to Influence the 2020 U.S. Presidential Election\n\n**[justice.gov/opa/pr/two-iranian-nationals-charged-cyber-enabled-disinformation-and-threat-campaign-designed](https://www.justice.gov/opa/pr/two-iranian-nationals-charged-cyber-enabled-disinformation-and-threat-campaign-designed)**\n\nNovember 18, 2021\n\nDepartment of Justice\n\nOffice of Public Affairs\n\nFOR IMMEDIATE RELEASE\n\nThursday, November 18, 2021\n\nAn indictment was unsealed in New York today charging two Iranian nationals for their\ninvolvement in a cyber-enabled campaign to intimidate and influence American voters, and\notherwise undermine voter confidence and sow discord, in connection with the 2020 U.S.\npresidential election.\n\nAccording to court documents, Seyyed Mohammad Hosein Musa Kazemi (ﺳﯿﺪ ﻣﺤﻤﺪ ﺣﺴﯿﻦ ﻣﻮﺳﯽ\nﮐﺎﻇﻤﯽ), aka Mohammad Hosein Musa Kazem, aka Hosein Zamani, 24, and Sajjad Kashian\n(ﺳﺠﺎد ﮐﺎﺷﯿﺎن), aka Kiarash Nabavi, 27, both of Iran, obtained confidential U.S. voter information\nfrom at least one state election website; sent threatening email messages to intimidate and\ninterfere with voters; created and disseminated a video containing disinformation about\npurported election infrastructure vulnerabilities; attempted to access, without authorization,\nseveral states’ voting-related websites; and successfully gained unauthorized access to a\nU.S. media company’s computer network that, if not for successful FBI and victim company\nefforts to mitigate, would have provided the conspirators another vehicle to disseminate false\nclaims after the election.\n\n\n-----\n\nThis indictment details how two Iran-based actors waged a targeted, coordinated campaign\nto erode confidence in the integrity of the U.S. electoral system and to sow discord among\nAmericans,” said Assistant Attorney General Matthew G. Olsen of the Justice Department’s\nNational Security Division. “The allegations illustrate how foreign disinformation campaigns\noperate and seek to influence the American public. The Department is committed to\nexposing and disrupting malign foreign influence efforts using all available tools, including\ncriminal charges.”\n\n“As alleged, Kazemi and Kashian were part of a coordinated conspiracy in which Iranian\nhackers sought to undermine faith and confidence in the U.S. presidential election,” said U.S.\nAttorney Damian Williams for the Southern District of New York. “Working with others,\nKazemi and Kashian accessed voter information from at least one state’s voter database,\nthreatened U.S. voters via email, and even disseminated a fictitious video that purported to\ndepict actors fabricating overseas ballots. The United States will never tolerate any foreign\nactors’ attempts to undermine our free and democratic elections. As a result of the charges\nunsealed today, and the concurrent efforts of our U.S. government partners, Kazemi and\nKashian will forever look over their shoulders as we strive to bring them to justice.”\n\n“The FBI remains committed to countering malicious cyber activity targeting our democratic\nprocess,” said Assistant Director Bryan Vorndran of the FBI’s Cyber Division. “Working\nrapidly with our private sector and U.S. government partners and ahead of the election, we\nwere able to disrupt and mitigate this malicious activity – and then to enable today’s joint,\nsequenced operations against the adversary. Today’s announcement shows what we can\naccomplish as a community and a country when we work together, and the FBI will continue\nto do its part to keep our democracy safe.”\n\nAccording to the allegations contained in the indictment unsealed today:\n\n_The Voter Intimidation and Influence Campaign_\n\nStarting in approximately August 2020, and proceeding until November 2020, Kazemi,\nKashian, and other co-conspirators began a coordinated, campaign to undermine faith and\nconfidence in the 2020 presidential election (the “Voter Intimidation and Influence\nCampaign”) and otherwise sow discord within U.S. society. The Campaign had four\ncomponents:\n\nIn September and October 2020, members of the conspiracy conducted\nreconnaissance on, and attempted to compromise, approximately 11 state voter\nwebsites, including state voter registration websites and state voter information\nwebsites. Those efforts resulted in the successful exploitation of a misconfigured\ncomputer system of a particular U.S. state (“State-1”), and the resulting unauthorized\ndownloading of information concerning more than 100,000 of State-1’s voters.\n\n\n-----\n\nIn October 2020, members of the conspiracy, claiming to be a group of Proud Boys\nvolunteers,” sent Facebook messages and emails (the “False Election Messages”) to\nRepublican Senators, Republican members of Congress, individuals associated with\nthe presidential campaign of Donald J. Trump, White House advisors, and members of\nthe media. The False Election Messages claimed that the Democratic Party was\nplanning to exploit “serious security vulnerabilities” in state voter registration websites\nto “edit mail-in ballots or even register non-existent voters.” The False Election\nMessages were accompanied by a video (the “False Election Video”) carrying the\nProud Boys logo, which purported, via simulated intrusions and the use of State-1 voter\ndata, to depict an individual hacking into state voter websites and using stolen voter\ninformation to create fraudulent absentee ballots through the Federal Voting Assistance\n\n[1]\n\nProgram (FVAP) for military and overseas voters.\nAlso in October 2020, the conspirators engaged in an online voter intimidation\ncampaign involving the dissemination of a threatening message (the “Voter Threat\nEmails”), purporting to be from the Proud Boys, to tens of thousands of registered\nvoters, including some voters whose information the conspiracy had obtained from\nState-1’s website. The emails were sent to registered Democrats and threatened the\nrecipients with physical injury if they did not change their party affiliation and vote for\nPresident Trump.\nOn Nov. 4, 2020, the day after the 2020 U.S. presidential election, the conspirators\nsought to leverage earlier September and October 2020 intrusions into an American\nmedia company’s (Media Company-1) computer networks. Specifically, on that day, the\nconspirators attempted to use stolen credentials to again access Media Company-1’s\nnetwork, which would have provided them another vehicle for further disseminating\nfalse claims concerning the election through conspirator-modified or created content.\nHowever, because of an earlier FBI victim notification, Media Company-1 had by that\ntime mitigated the conspirators’ unauthorized access and these log-in attempts failed.\n\n_Background on Kazemi and Kashian_\n\nKazemi and Kashian are experienced Iran-based computer hackers who worked as\ncontractors for an Iran-based company formerly known as Eeleyanet Gostar, and now known\nas Emennet Pasargad. Eeleyanet Gostar purported to provide cybersecurity services within\nIran. Among other things, Eeleyanet Gostar is known to have provided services to the Iranian\ngovernment, including to the Guardian Council.\n\nAs part of his role in the Voter Intimidation and Influence Campaign, Kazemi compromised\ncomputer servers that were used to send the Voter Threat Emails, drafted those emails, and\ncompromised the systems of Media Company-1. Kashian managed the conspirators’\ncomputer infrastructure used to carry out the Voter Threat Emails campaign and he\npurchased social media accounts in furtherance of the Voter Intimidation and Influence\nCampaign.\n\n\n-----\n\nKazemi and Kashian are both charged with one count of conspiracy to commit computer\nfraud and abuse, intimidate voters, and transmit interstate threats, which carries a maximum\nsentence of five years in prison; one count of voter intimidation, which carries a maximum\nsentence of one year in prison; and one count of transmission of interstate threats, which\ncarries a maximum sentence of five years in prison. Kazemi is additionally charged with one\ncount of unauthorized computer intrusion, which carries a maximum sentence of five years in\nprison; and one count of computer fraud, namely, knowingly damaging a protected computer,\nwhich carries a maximum sentence of 10 years in prison. A federal district court judge will\ndetermine any sentence after considering the U.S. Sentencing Guidelines and other statutory\nfactors.\n\nConcurrent with the unsealing of the indictment, the Department of the Treasury Office of\nForeign Assets Control (OFAC) designated Emennet Pasargad, Kazemi, Kashian, and four\nother Iranian nationals comprising Emennet Pasargad leadership pursuant to Executive\nOrder 13848, “Imposing Certain Sanctions in the Event of Foreign Interference in a United\nStates Election.” Additionally, the Department of State’s Rewards for Justice Program, is\noffering a reward of up to $10 million for information on or about the Kazemi and Kashian’s\nactivities.\n\nThe FBI’s Cyber Division and Cleveland Field Office are investigating the case.\n\nAssistant U.S. Attorneys Dina McLeod and Louis A. Pellegrino and Trial Attorney Adam\nSmall of the National Security Division’s Counterintelligence and Export Control Section are\nprosecuting the case.\n\n_An indictment is merely an allegation, and all defendants are presumed innocent until proven_\n_guilty beyond a reasonable doubt in a court of law._\n\n[1] In actuality, the computer intrusions depicted in the False Election Video were simulated\nintrusions created by members of the conspiracy using their own server and data obtained\nduring the State-1 exploitation. Further, the FVAP could not actually be leveraged in the\nmanner implied by the False Election Video.\n\nAttachment(s):\n\n[Download Kazemi Indictment](https://www.justice.gov/opa/press-release/file/1449226/download)\nTopic(s):\n\nCybercrime\n\nNational Security\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - Two Iranian Nationals Charged for Cyber-Enabled Disinformation and Threat Campaign Designed to Influence the 2020 U.S. Presidential Election ( Seyyed Mohammad Hosein Musa Kazemi & Sajjad Kashian ).pdf"
    ],
    "report_names": [
        "2021-11-18 - Two Iranian Nationals Charged for Cyber-Enabled Disinformation and Threat Campaign Designed to Influence the 2020 U.S. Presidential Election ( Seyyed Mohammad Hosein Musa Kazemi & Sajjad Kashian ).pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "07131850-5161-48b8-98be-6b0271d44d0e",
            "created_at": "2024-01-23T13:22:35.085803Z",
            "updated_at": "2025-03-27T02:00:03.287403Z",
            "deleted_at": null,
            "main_name": "Cotton Sandstorm",
            "aliases": [
                "MARNANBRIDGE",
                "NEPTUNIUM",
                "Emennet Pasargad",
                "Holy Souls"
            ],
            "source_name": "MISPGALAXY:Cotton Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535942,
    "ts_updated_at": 1743041801,
    "ts_creation_date": 1653709174,
    "ts_modification_date": 1653709174,
    "files": {
        "pdf": "https://archive.orkl.eu/c91de761d96202ca3e3e14700ea666e20ee161e8.pdf",
        "text": "https://archive.orkl.eu/c91de761d96202ca3e3e14700ea666e20ee161e8.txt",
        "img": "https://archive.orkl.eu/c91de761d96202ca3e3e14700ea666e20ee161e8.jpg"
    }
}