{
    "id": "4c83d4ad-d4d5-4b30-82ad-cc9d57d42a09",
    "created_at": "2023-01-12T15:04:46.563121Z",
    "updated_at": "2025-03-27T02:17:11.216898Z",
    "deleted_at": null,
    "sha1_hash": "7e4a630be9062f6bb897378f7c2a8ac41d17f98d",
    "title": "2018-09-27 - LoJax- First UEFI rootkit found in the wild, courtesy of the Sednit group",
    "authors": "",
    "file_creation_date": "2022-05-28T18:06:33Z",
    "file_modification_date": "2022-05-28T18:06:33Z",
    "file_size": 583717,
    "plain_text": "# LoJax: First UEFI rootkit found in the wild, courtesy of the Sednit group\n\n**[welivesecurity.com/2018/09/27/lojax-first-uefi-rootkit-found-wild-courtesy-sednit-group/](https://www.welivesecurity.com/2018/09/27/lojax-first-uefi-rootkit-found-wild-courtesy-sednit-group/)**\n\nSeptember 27, 2018\n\nESET researchers have shown that the Sednit operators used different components of the\nLoJax malware to target a few government organizations in the Balkans as well as in\nCentral and Eastern Europe\n\n\n-----\n\n[ESET Research](https://www.welivesecurity.com/author/esetresearch/)\n27 Sep 2018 - 11:57AM\n\nESET researchers have shown that the Sednit operators used different components of the\nLoJax malware to target a few government organizations in the Balkans as well as in\nCentral and Eastern Europe\n\n_Update, 9 October 2018: The remediation section of the white paper contained inaccurate_\n_information. Secure Boot doesn’t protect against the UEFI rootkit described in this research._\n_We advise that you keep your UEFI firmware up-to-date and, if possible, have a processor_\n_with a hardware root of trust as is the case with Intel processors supporting Intel Boot_\n_Guard (from the Haswell family of Intel processors onwards)._\n\nUEFI rootkits are widely viewed as extremely dangerous tools for implementing\ncyberattacks, as they are hard to detect and able to survive security measures such as\noperating system reinstallation and even a hard disk replacement. Some UEFI rootkits have\nbeen presented as proofs of concept; some are known to be at the disposal of (at least\nsome) governmental agencies. However, no UEFI rootkit has ever been detected in the wild\n– until we discovered a campaign by the Sednit APT group that successfully deployed a\nmalicious UEFI module on a victim’s system.\n\n[LOJAX: First UEFI rootkit found in the wild, courtesy of the Sednit group](https://www.welivesecurity.com/wp-content/uploads/2018/09/ESET-LoJax.pdf)\n\n[Download Research Paper](https://www.welivesecurity.com/wp-content/uploads/2018/09/ESET-LoJax.pdf)\n\nThe discovery of the first in-the-wild UEFI rootkit is notable for two reasons.\n\nFirst, it shows that UEFI rootkits are a real threat, and not merely an attractive conference\ntopic.\n\n\n-----\n\nAnd second, it serves as a heads-up, especially to all those who might be in the crosshairs\nof Sednit. This APT group, also known as APT28, STRONTIUM, Sofacy and Fancy Bear,\nmay be even more dangerous than previously thought.\n\nOur analysis of the Sednit campaign that uses the UEFI rootkit was presented September\n27 at the 2018 Microsoft BlueHat conference and is described in detail in our “LoJax: First\nUEFI rootkit found in the wild, courtesy of the Sednit group” white paper. In this blog post,\nwe summarize our main findings.\n\nThe Sednit group has been operating since at least 2004, and has made headlines\nfrequently in past years: it is believed to be behind major, high profile attacks. For instance,\n[the US Department of Justice named the group as being responsible for the Democratic](https://assets.documentcloud.org/documents/4598895/DOJ-Russia-DNC-Hack-Indictment.pdf)\nNational Committee (DNC) hack just before the US 2016 elections. The group is also\n[presumed to be behind the hacking of global television network TV5Monde, the World Anti-](https://www.bbc.com/news/technology-37590375)\nDoping Agency (WADA) email leak, and many others. This group has a diversified set of\nmalware tools in its arsenal, several examples of which we have documented previously in\nour [Sednit white paper from 2016.](http://www.welivesecurity.com/wp-content/uploads/2016/10/eset-sednit-full.pdf)\n\nOur investigation has determined that this malicious actor was successful at least once in\nwriting a malicious UEFI module into a system’s [SPI flash memory. This module is able to](https://en.wikipedia.org/wiki/Flash_memory)\ndrop and execute malware on disk during the boot process. This persistence method is\nparticularly invasive as it will not only survive an OS reinstall, but also a hard disk\nreplacement. Moreover, cleaning a system’s UEFI firmware means re-flashing it, an\noperation not commonly done and certainly not by the typical computer owner.\n\nOur research has shown that the Sednit operators used different components of the LoJax\nmalware to target a few government organizations in the Balkans as well as in Central and\nEastern Europe.\n\n## LoJack becomes LoJax\n\nIn May 2018, [an Arbor Networks blog post described several trojanized samples of](https://asert.arbornetworks.com/lojack-becomes-a-double-agent/)\nAbsolute Software’s LoJack small agent, rpcnetp.exe. These malicious samples\ncommunicated with a malicious C&C server instead of the legitimate Absolute Software\nserver, because their hardcoded configuration settings had been altered. Some of the\ndomains found in LoJax samples have been seen before: they were used in late 2017 as\nC&C domains for the notorious Sednit first-stage backdoor, SedUploader. Because of this\ncampaign’s malicious usage of the LoJack small agent, we call this malware LoJax.\n\nLoJack is anti-theft software. Earlier versions of this agent were known as Computrace. As\nits former name implies, once the service was activated, the computer would call back to its\nC&C server and its owner would be notified of its location if it had gone missing or been\nstolen. Computrace attracted attention from the security community, mostly because of its\nunusual persistence method. Since this software’s intent is to protect a system from theft, it\n\n\n-----\n\nis important that it resists OS re-installation or hard drive replacement. Thus, it is\nimplemented as a UEFI/BIOS module, able to survive such events. This solution comes\npre-installed in the firmware of a large number of laptops manufactured by various OEMs,\nwaiting to be activated by their owners.\n\nWhile researching LoJax, we found several interesting artifacts that led us to believe that\nthese threat actors might have tried to mimic Computrace’s persistence method.\n\n## Patching SPI flash memory with malware\n\nOn systems that were targeted by the LoJax campaign, we found various tools that are able\nto access and patch UEFI/BIOS settings. All used a kernel driver, RwDrv.sys, to access the\nUEFI/BIOS settings. This kernel driver is bundled with RWEverything, a free utility available\non the web that can be used to read information on almost all of a computer’s low-level\nsettings, including PCI Express, Memory, PCI Option ROMs, etc. As this kernel driver\nbelongs to legitimate software, it is signed with a valid code-signing certificate.\n\nThree different types of tool were found alongside LoJax userland agents. The first one is a\ntool dumping information about low level system settings to a text file. Since bypassing a\nplatform’s protection against illegitimate firmware updates is highly platform-dependent,\ngathering information about a system’s platform is crucial. The purpose of the second tool is\n\n\n-----\n\nto save an image of the system firmware to a file by reading the contents of the SPI flash\nmemory where the UEFI/BIOS is located. The third tool’s purpose is to add a malicious\nUEFI module to the firmware image and write it back to the SPI flash memory, effectively\ninstalling the UEFI rootkit on the system. This patching tool uses different techniques either\nto abuse misconfigured platforms or to bypass platform SPI flash memory write protections.\nAs illustrated in the next figure, if the platform allows write operations to the SPI flash\nmemory, it will just go ahead and write to it. If not, it actually implements an exploit against a\nknown vulnerability.\n\nThe UEFI rootkit added to the firmware image has a single role: dropping the userland\nmalware onto the Windows operating system partition and make sure that it is executed at\nstartup.\n\n## How to protect yourself?\n\nWhile Secure Boot is the first mechanism that comes to mind when we think about\npreventing UEFI firmware attacks, it wouldn’t have protected against the attack we describe\nin this research. Despite this, we strongly suggest you enable Secure Boot on your\nsystems, through the UEFI setup utility.\n\nSecure Boot is designed to protect against malicious components coming from outside of\nthe SPI flash memory. To protect against tampering with the SPI flash memory, the system’s\n[root of trust must be moved to hardware. Such technologies exist and Intel Boot Guard is a](https://www.intel.com/content/dam/www/public/us/en/documents/white-papers/security-technologies-4th-gen-core-retail-paper.pdf)\ngood example of this. It has been available starting with the Haswell family of Intel\nprocessors introduced in 2013. Had this technology been available and properly configured\non the victim’s system the machine would have refused to boot after the compromise\n\n\n-----\n\nUpdating system firmware should not be something trivial for a malicious actor to achieve.\nThere are different protections provided by the platform to prevent unauthorized writes to\nsystem SPI flash memory. The tool described above is able to update the system’s firmware\nonly if the SPI flash memory protections are vulnerable or misconfigured. Thus, you should\nmake sure that you are using the latest UEFI/BIOS available for your motherboard. Also, as\nthe exploited vulnerability affects only older chipsets, make sure that critical systems have\nmodern chipsets with the Platform Controller Hub (introduced with Intel Series 5 chipsets in\n2008).\n\nUnfortunately for the ambitious end user, updating a system’s firmware is not a trivial task.\nThus, firmware security is mostly in the hands of UEFI/BIOS vendors. The security\nmechanisms provided by the platform need to be configured properly by the system\nfirmware in order to actually protect it. Firmware must be built from the ground up with\nsecurity in mind. Fortunately, more and more security researchers are looking at firmware\nsecurity, thus contributing to improving this area and raising awareness among UEFI/BIOS\nvendors.\n\nRemediation of a UEFI firmware-based compromise is a hard problem. There are no easy\nways to automatically remove such a threat from a system. In the case we described above:\nin order to remove the rootkit, the SPI flash memory needs to be reflashed with a clean\nfirmware image specific to the motherboard. This is a delicate operation that must be\nperformed manually. It is definitely not a procedure that most computer owners are familiar\nwith. The only alternative to reflashing the UEFI/BIOS is to replace the motherboard of the\ncompromised system outright.\n\n[For more information about how to protect yourself you can visit our website and find out](https://www.eset.com/int/uefi-rootkit-cyber-attack-discovered/)\nmore about the ESET UEFI Scanner.\n\n## The links with the Sednit APT group\n\nAs mentioned above, some of the LoJax small agent C&C servers were used in the past by\nSedUploader, a first-stage backdoor routinely used by Sednit’s operators. Also, in cases of\nLoJax compromise, traces of other Sednit tools were never far away. In fact, systems\ntargeted by LoJax usually also showed signs of these three examples of Sednit malware:\n\nSedUploader, a first-stage backdoor\nXAgent, Sednit’s flagship backdoor\nXtunnel, a network proxy tool that can relay any kind of network traffic between a C&C\nserver on the Internet and an endpoint computer inside a local network\n\nThese facts allow us to attribute LoJax with high confidence to the Sednit group.\n\n## In conclusion\n\n\n-----\n\nThrough the years we ve spent tracking of the Sednit group, we have released many\n[reports on its activities, ranging from zero-day usage to custom malware it has developed,](https://www.welivesecurity.com/2017/05/09/sednit-adds-two-zero-day-exploits-using-trumps-attack-syria-decoy/)\n[such as Zebrocy. However, the UEFI rootkit component described above is in a league of](https://www.welivesecurity.com/2018/04/24/sednit-update-analysis-zebrocy/)\nits own.\n\nThe LoJax campaign shows that high-value targets are prime candidates for the\ndeployment of rare, even unique threats and such targets should always be on the lookout\nfor signs of compromise. Also, one thing that this research taught us is that it is always\nimportant to dig as deep as you can go!\n\n[A full list of Indicators of Compromise (IOCs) and samples can be found on GitHub.](https://github.com/eset/malware-ioc/tree/master/sednit#lojax-first-uefi-rootkit-found-in-the-wild-courtesy-of-the-sednit-group)\n\nFor a detailed analysis of the backdoor, head over to our white paper LoJax: First UEFI\nrootkit found in the wild, courtesy of the Sednit group.\n\n27 Sep 2018 - 11:57AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-09-27 - LoJax- First UEFI rootkit found in the wild, courtesy of the Sednit group.pdf"
    ],
    "report_names": [
        "2018-09-27 - LoJax- First UEFI rootkit found in the wild, courtesy of the Sednit group.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "699b7efc-322d-489d-818d-823fac028124",
            "created_at": "2023-01-06T13:46:39.404825Z",
            "updated_at": "2025-03-27T02:00:03.07918Z",
            "deleted_at": null,
            "main_name": "APT9",
            "aliases": [
                "NIGHTSHADE PANDA",
                "Red Pegasus",
                "Group 27"
            ],
            "source_name": "MISPGALAXY:APT9",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e79324a2-bdae-4dc5-9421-578a59045288",
            "created_at": "2022-10-25T16:07:23.906087Z",
            "updated_at": "2025-03-27T02:02:10.022303Z",
            "deleted_at": null,
            "main_name": "Nightshade Panda",
            "aliases": [
                "APT 9",
                "FlowerLady",
                "FlowerShow",
                "Group 27",
                "Nightshade Panda",
                "Operation Seven Pointed Dagger"
            ],
            "source_name": "ETDA:Nightshade Panda",
            "tools": [
                "3102 RAT",
                "9002 RAT",
                "Agent.dhwf",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "EvilGrab",
                "EvilGrab RAT",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "MoonWind",
                "MoonWind RAT",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Vidgrab",
                "Wmonder",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535886,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653761193,
    "ts_modification_date": 1653761193,
    "files": {
        "pdf": "https://archive.orkl.eu/7e4a630be9062f6bb897378f7c2a8ac41d17f98d.pdf",
        "text": "https://archive.orkl.eu/7e4a630be9062f6bb897378f7c2a8ac41d17f98d.txt",
        "img": "https://archive.orkl.eu/7e4a630be9062f6bb897378f7c2a8ac41d17f98d.jpg"
    }
}