{
    "id": "4c94a1ec-c8f9-44cc-9c67-22259b3915f9",
    "created_at": "2023-11-14T02:06:20.479477Z",
    "updated_at": "2025-03-27T02:05:26.377266Z",
    "deleted_at": null,
    "sha1_hash": "c11b7ac2559ac9c4d2a67f0859a650fbac13c5aa",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-07-05T10:06:10Z",
    "file_modification_date": "2023-07-05T10:06:10Z",
    "file_size": 287506,
    "plain_text": "# Disk Knight Worm Analysis\n\n## Luca D’Amico \n\n https://www.lucadamico.dev\n\n 29-Jun-2023\n\n\n-----\n\nAbstract .................................................................................................................................................... 3\n\nEnvironment, methodologies and tools used ......................................................................................... 4\n\nBinary information ................................................................................................................................... 5\n\nMalware analysis ..................................................................................................................................... 6\n\nInstallation ........................................................................................................................................... 6\n\nExecution ............................................................................................................................................. 7\n\nSpread .................................................................................................................................................. 8\n\nIOCs ........................................................................................................................................................10\n\nYARA detection rule ...............................................................................................................................11\n\nMalware removal ...................................................................................................................................12\n\nRemoving Disk Knight from infected PC ............................................................................................12\n\nRemoving Disk Knight from infected USB drives ...............................................................................13\n\nExtra: fixing the tray icon bug ................................................................................................................14\n\nConclusion ..............................................................................................................................................17\n\n\n-----\n\n# Abstract\n\n### This is a technical analysis of Disk Knight malware.\n\n Disk Knight seems to have been conceived as an antivirus to block the rise of malware spread via USB sticks. This type of worm exploits the automatic execution when the USB device is accessed, thanks to the presence of an autorun.inf file.\n\n Due to some bad implementation choices and the presence of bugs in its code, this software has turned into an out-of-control worm, spreading itself automatically when USB storage devices are inserted into infected PCs and in turn infecting the computers where these were entered.\n\n It reached its peak in late 2007 and early 2008.\n\n This document will analyse the three main stages of the malware: installation, execution and spread. We will then catalogue the IOCs and write a detection rule using Yara. Finally, a patch to the worm's code will be applied to make its tray icon appear correctly and the commands to eliminate this malware from the system and from infected USB sticks will be listed.\n\n\n-----\n\n# Environment, methodologies and tools used\n\n### To carry out this analysis, a Windows XP SP3 virtual machine was used. Although it is possible to use a newer version of Windows, I have chosen to use the most popular version at the time of the release of the worm. Also, later OS versions require authorization via UAC.\n\n No antivirus of any kind has been installed in the virtual machine.\n\n The following tools were used during the analysis:\n\n • CFF Explorer, PE-Bear: to get information from the executable file\n • P32Dasm 2.80: to obtain valuable information about the VB6 procedures\n of the worm\n • Process Monitor 3.20: obtaining information about the worm process\n during the detonation phase\n • X32dbg: to debug the malware during dynamic analysis\n\n\n-----\n\n# Binary information\n\n### The following are some characteristics of the worm obtained from a first analysis on the executable file:\n\n Binary name Knight.exe File size 412 KB SHA-256 d25c1d1423ed31b5436678318ca815092102e88d06\na130481bc0728d14d74bb4\n### Language detected Visual Basic 6 TimeDateStamp 46cc3475 (22.08.2007 13:04:53 UTC) FileVersion 4.02 VirusTotal URL https://www.virustotal.com/gui/file/d25c1d1423ed\n[31b5436678318ca815092102e88d06a130481bc072](https://www.virustotal.com/gui/file/d25c1d1423ed31b5436678318ca815092102e88d06a130481bc0728d14d74bb4)\n[8d14d74bb4](https://www.virustotal.com/gui/file/d25c1d1423ed31b5436678318ca815092102e88d06a130481bc0728d14d74bb4)\n### Virus Total popular threat name worm.diskknight/knight\n\n In the .rsrc section i.e., the resources section, there is an entry called \"CUSTOM\", with two resources \"AUTORUN.INF\" and \"RECOVER.REG\" inside. The former will be used by the worm during the propagation phase, as described below. There is also a section with HTML code that the worm will display during the \"Help\" function (described below).\n\n|analysis on the executable file:|Col2|\n|---|---|\n|Binary name|Knight.exe|\n|File size|412 KB|\n|SHA-256|d25c1d1423ed31b5436678318ca815092102e88d06 a130481bc0728d14d74bb4|\n|Language detected|Visual Basic 6|\n|TimeDateStamp|46cc3475 (22.08.2007 13:04:53 UTC)|\n|FileVersion|4.02|\n|VirusTotal URL|https://www.virustotal.com/gui/file/d25c1d1423ed 31b5436678318ca815092102e88d06a130481bc072 8d14d74bb4|\n|Virus Total popular threat name|worm.diskknight/knight|\n\n\n-----\n\n# Malware analysis\n\n### In this section the three main stages of the worm will be described: installation, execution and spread.\n\n## Installation\n\n### The technique used by Disk Knight to install itself in the system is very simple: the function located at VA 0x408900 uses the CopyFileA function to copy the executable to the Windows directory (commonly C:\\Windows\\) with the name Knight.exe. \n\n The path of the directory where the operating system resides is retrieved thanks to the SHGetFolderPathA function, passing the CSIDL_WINDOWS (0x24) parameter, in this way there is the certainty of obtaining the correct folder even in cases where the operating system is installed in an unconventional path.\n\n The function responsible for starting Disk Knight is located at VA 0x00408958 and uses a call to ShellExecuteA with the following arguments:\n\n   ShellExecuteA(NULL, \"open\", \"C:\\WINDOWS\\Knight.exe\", \"protect\", \"C:\\WINDOWS\", SW_SHOWNORMAL);\n\n Before terminating the current process execution, a file named recover.reg is dropped into the installation directory.  \n\n\n-----\n\n## Execution\n\n### At this point Disk Knight is running from the binary installed in the Windows directory. \n\n When the process is active, if you try to start the worm from a different folder than the one where the operating system is installed, the malware will try to install Knight.exe by overwriting it, but this attempt will fail resulting in a crash as the binary is currently in use. Regardless, Knight.exe file will still restart.\n\n At this point, the worm checks if its process is already running with a very simple method, that is by calling a FindWindowA:\n\n   FindWindowA(\"Disk Knight\", \"ThunderRT6FormDC\");\n\n If it manages to get a handle, then the worm is already running and therefore the current process will terminate.\n\n Once executed from the directory where Windows is installed, a function located at VA 0x00423E90 takes care of creating a registry key to allow the worm to persist on reboots of the operating system. The key is:\n\n “HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run \\Disk Knight” and contains the path to Knight.exe in the Windows directory. \n\n ATTENTION: at this point, the Disk Knight control icon should appear in your system tray, but due to bugs in the code, the function in charge of creating it will never be reached by the call to 0x41BB90, making the application NOT controllable by the user! For more information and for fixing this bug, there is a dedicated section in this document. \n\n To detect newly inserted USB devices, the worm uses a hook to intercept window procedure messages:\n\n   SetWindowLong(ThunderRT6FormDC whandle, GWL_WNDPROC,  0x41B9F0);\n\n At address 0x41B9F0 there is a function that checks the type of message and if it is equal to WM_DEVICECHANGE, the function located at 0x421EB0 is called.\n\n This function checks the inserted device collecting the necessary data and finally the function at 0x41B8D0 will be called.\n\n\n-----\n\n## Spread\n\n### When a new USB stick is inserted, the function located at VA 0x0041ED70 takes care of the infection, which is in turn called by the function located at VA 0x41B8D0.\n\n This happens according to the following steps:\n\n 1a) A call is made to SetFileAttributesA on both Knight.exe and autorun.inf:\n\n   SetFileAttributesA(\"X:\\\\Knight.exe\", 0x80);\n\n   SetFileAttributesA(\"X:\\\\autorun.inf\", 0x80);\n\n  Where X is the letter of the drive being infected and 0x80 is the FILE_ATTRIBUTE_NORMAL attribute.\n\n 1b) If the operation is successful, and therefore the files are present on the usb stick, a call to DeleteFileA is made on both Knight.exe and autorun.inf, removing them:\n\n   DeleteFileA(\"X:\\\\Knight.exe\");\n\n   DeleteFileA(\"X:\\\\autorun.inf\");\n\n  Where X is the letter of the drive being infected.\n\n 2) The infection is carried out, which consists of installing the two files:\n\n - Knight.exe is copied from the Windows directory to the USB device using the CopyFileA API:\n\n   CopyFileA(\"C:\\\\WINDOWS\\\\Knight.exe\", \"X:\\\\Knight.exe\", 0);\n\n  Where X is the letter of the drive being infected.\n\n - autorun.inf is extracted from the resource segment of Knight.exe, from the section called \"CUSTOM\" and placed on the root of the USB stick.\n\n 3) Both files are hidden using the SetFileAttributesA API:\n\n   SetFileAttributesA(\"X:\\\\Knight.exe\", 0x7);\n\n   SetFileAttributesA(\"X:\\\\autorun.inf\", 0x7);\n\n\n-----\n\n###  Where X represents the letter of the drive being infected and 0x7 the following attributes: FILE_ATTRIBUTE_HIDDEN, FILE_ATTRIBUTE_READONLY, FILE_ATTRIBUTE_SYSTEM\n\n The autorun.inf file causes that by accessing the USB device, regardless of the type of access selected, Disk Knigh will be started and consequently the computer will be infected.\n\n\n-----\n\n# IOCs\n\n### The following table shows the IoCs obtained from the analysis of the executable file and the behaviour of the worm during execution.\n\n|File|%windir%\\Knight.exe|File Attr: Hidden, Read Only, System|\n|---|---|---|\n|File|%windir%\\recover.reg||\n|File|%windir%\\0.log||\n|File (on USB device)|X:\\Knight.exe|File Attr: Hidden, Read Only, System|\n|File (on USB device)|X:\\autorun.inf|File Attr: Hidden, Read Only, System|\n|Process|Disk Knight (Knight.exe/Administrator)||\n|Registry key|Path: HKLM\\SOFTWARE\\Microsoft\\Windo ws\\CurrentVersion\\Run Key: Disk Knight Value: %windir%\\Knight.exe||\n|Registry key|Path: HKLM\\SOFTWARE\\Knight\\Settings Keys: drive, protectmode||\n|SHA256|d25c1d1423ed31b5436678318ca81 5092102e88d06a130481bc0728d14 d74bb4|Knight.exe|\n\n\n-----\n\n# YARA detection rule\n\n### This is a specific detection rule for the analysed Disk Knight sample:\n\nimport \"pe\"\n\nrule diskknight {\nmeta:\ndescription = \"Disk Knight detection (worm.diskknight/knight) - VERY SPECIFIC\"\nauthor = \"Luca D'Amico\"\ndate = \"2023/06/24\"\nhash0 = \"d25c1d1423ed31b5436678318ca815092102e88d06a130481bc0728d14d74bb4\"\n\nstrings:\n$a1 = \"http://www.ariful.esmartweb.com\"\n$a2 = \"action=Disk Knight(Protection Against Mobile Disk Viruses)\"\n$a3 = \"[Disk Knight]\"\n\ncondition:\nuint16(0) == 0x5A4D and\npe.machine == pe.MACHINE_I386 and\nfor any i in (0..(pe.number_of_resources)-1):\n(\npe.resources[i].type_string == \"C\\x00U\\x00S\\x00T\\x00O\\x00M\\x00\" and\n(pe.resources[i].name_string ==\n\"A\\x00U\\x00T\\x00O\\x00R\\x00U\\x00N\\x00.\\x00I\\x00N\\x00F\\x00\" or\npe.resources[i].name_string ==\n\"R\\x00E\\x00C\\x00O\\x00V\\x00E\\x00R\\x00.\\x00R\\x00E\\x00G\\x00\")\n) and\npe.imports(\"MSVBVM60.DLL\") and\nall of them\n\n}\n\n\n-----\n\n# Malware removal\n\n### The removal of Disk Knight must take place in two stages and necessarily in this order:\n\n 1) Removing the malware from infected PC 2) Malware removal from all infected USB drives\n\n Before carrying out this procedure, it is mandatory to disable the automatic start via autorun.inf file, to avoid re-infection when removing the malware from the USB devices. It is therefore necessary to modify a key in the system registry, by executing the following command on an instance of cmd.exe:\n\n reg add \"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\IniFileMapping\\Autorun.inf\" /v \"\" /t REG_SZ /d \"@SYS:DoesNotExist\" /f\n\n## Removing Disk Knight from infected PC\n\n### Run the following commands on an instance of cmd.exe:\n\n 1) taskkill /F /IM \"Knight.exe\" 2) attrib -h -s -r \"%windir%\\Knight.exe\" 3) del /f \"%windir%\\Knight.exe\" 4) del /f \"%windir%\\recover.reg\" 5) del /f \"%windir%\\0.log\" 6) reg delete\n \"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersio n\\Run\" /v \"Disk Knight\" /f 7) reg delete \"HKEY_LOCAL_MACHINE\\SOFTWARE\\Knight\" /f\n\n At this point Disk Knight will no longer be present on the PC and it is possible to continue the procedure to remove the malware from the infected USB sticks.\n\n\n-----\n\n## Removing Disk Knight from infected USB drives\n\n### Make sure you have disabled the automatic start via autorun file and run the following commands on an instance of cmd.exe, taking care to change the letter \"X\" with the one of the drives you intend to disinfect:\n\n 1) attrib -h -s -r \"X:\\autorun.inf\" 2) del /f \"X:\\autorun.inf\" 3) attrib -h -s -r \"X:\\Knight.exe\" 4) del /f \"X:\\Knight.exe\"\n\n The USB device will now be clean.\n\n\n-----\n\n# Extra: fixing the tray icon bug\n\n### During the analysis of the worm, I noticed that by forcing a conditional jump with the debugger it is possible to make the Disk Knight tray icon appear correctly and access its options.\n\n The patch consists in changing the instruction at VA 0x41BB3C from JE to JMP:\n\n Right after resuming the execution, the tray icon will appear showing the following message:\n\n You can interact with the icon using the right-click of the mouse, to reveal the following menu:\n\n These options allow you to choose the \"level of protection\" offered by Disk Knight (for example, blocking executables from USB devices).\n\n The Executable Browser feature allows you to obtain a list of executables present in the USB drive and to check the attributes associated with them:\n\n\n-----\n\n### The “Terminate All Process” function will terminate all active processes of the operating system.\n\n By clicking on “Save Our Soul” the following message will be shown:\n\n If you decide to continue, all active processes will be closed, and various registry changes will be made such as disabling programs to run automatically at startup. Finally, the computer will restart.\n\n Interestingly, the “Disable Protection” option doesn't seem to work and although it can be clicked, Disk Knight will still propagate to all inserted USB devices.\n\n At the bottom of the menu there are two options, Help and About Disk Knight.\n\n Clicking on Help will open the system's default browser showing an html page extracted from the Disk Knight resource segment. This page explains the characteristics of the malware:\n\n\n-----\n\n### Clicking on About instead the following window will be presented:\n\n Clicking OK will cause your browser to open the alleged author's web page. This page is offline and no working snapshots can be found using the Wayback Machine.\n\n\n-----\n\n# Conclusion\n\n### This analysis has highlighted how important it is to consider carefully the implementation choices when writing software and how important it is to make sure that there are no such serious bugs in your code before making a public release.\n\n Fortunately, in this case there was no major damage or even loss of data, limiting the problem to the out-of-control diffusion of Disk Knight, especially on computers without and antivirus.\n\n I hope you enjoyed this analysis and I sincerely thank the Italian (and the global one too :) malware analysis and reverse engineering scene.\n\n For more technical papers, please visit my website:\n## https://www.lucadamico.dev\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.lucadamico.dev/papers/malware_analysis/DiskKnight.pdf"
    ],
    "report_names": [
        "DiskKnight.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1699927580,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1688551570,
    "ts_modification_date": 1688551570,
    "files": {
        "pdf": "https://archive.orkl.eu/c11b7ac2559ac9c4d2a67f0859a650fbac13c5aa.pdf",
        "text": "https://archive.orkl.eu/c11b7ac2559ac9c4d2a67f0859a650fbac13c5aa.txt",
        "img": "https://archive.orkl.eu/c11b7ac2559ac9c4d2a67f0859a650fbac13c5aa.jpg"
    }
}