{
    "id": "4cab18ab-71bd-4eca-91ed-11f021210b1c",
    "created_at": "2023-01-12T15:02:24.277328Z",
    "updated_at": "2025-03-27T02:16:25.604348Z",
    "deleted_at": null,
    "sha1_hash": "bf9e1bd27447e51e04ed5e90f23eda585ff6dffa",
    "title": "2020-10-12 - -Front Door- into BazarBackdoor- Stealthy Cybercrime Weapon",
    "authors": "",
    "file_creation_date": "2022-05-28T15:42:16Z",
    "file_modification_date": "2022-05-28T15:42:16Z",
    "file_size": 1611677,
    "plain_text": "# \"Front Door\" into BazarBackdoor: Stealthy Cybercrime Weapon\n\n**[advanced-intel.com/post/front-door-into-bazarbackdoor-stealthy-cybercrime-weapon](https://www.advanced-intel.com/post/front-door-into-bazarbackdoor-stealthy-cybercrime-weapon)**\n\nAdvIntel October 12, 2020\n\nOct 12, 2020\n\n7 min read\n\nBy Roman Marshanski & Vitali Kremez\n\n**Key Points**\n\nBazarBackdoor is the newer preferred stealthy covert malware leveraged for high-value\ntargets part of the TrickBot group toolkit arsenal. It consists of two components: a\nloader and a backdoor.\n\n\n-----\n\nThe Bazar malware group pursues stealthiness via malware signing and only initially\nloading minimal malware functionality. Such an approach improves the malware\nchance of long-term persistence inside the most secure networks.\n\nJust like professional penetration testers, the crime group behind the BazarBackdoor\nemploys legitimate penetration software kit Cobalt Strike for post-exploitation for\nenumerating and harvesting credentials for network hosts and active directory,\nuploading third-party software like \"Lasagne\" and \"BloodHound\" as well pivoting\ninside the network domain executing Ryuk ransomware.\n\n**Advanced Intelligence experts include the relevant defense and hunting mechanisms**\nsuch as the YARA signature for BazarBackdoor detection.\n\nBazarBackdoor is the newer preferred stealthy covert malware leveraged for high-value\ntargets part of the TrickBot group toolkit arsenal. It consists of two components: a loader and\na backdoor. [1]\n\nLoaders are an essential part of any cybercrime campaign. They start the infection chain by\ndistributing the payload. In essence, they deploy and execute the backdoor from the\ncommand-and-control (C2) layer and plant it on the victim’s machine. But the reality is far\nmore complicated than that. After all, loaders and backdoors must be able to evade detection\nby various security mechanisms. And that is where the malware developers’ focus on\nmalware stealthiness comes into play.\n\n\n-----\n\nJust like professional penetration testers, the crime group behind the BazarBackdoor\nemploys legitimate penetration software kit Cobalt Strike for post-exploitation for\nenumerating and harvesting credentials for network hosts and active directory, uploading\nthird-party software like Lasagne and BloodHound as well pivoting inside the network domain\nexecuting Ryuk ransomware.\n\n**Malware Stealthiness as Key Approach**\n\nAs we learned from our multiple incident response cases, the BazarLoader's strength lies in\nits stealthy core component and obfuscation capability. The malware's goal is to plant on the\nhigh-value targets and reach the server currently via the proxy and the domain generation\nalgorithm on the EmerDNS domain protocol, searching for .bazar domains and resolving the\nserver via the XOR function of the response IP address.\n\nThe malware aimed to be stealthy and only load more advanced functionality via third-party\ncomponents such as Cobalt Strike beacons. Such stealthiness allows the crime group to\nmaintain persistency on the host even if the third-party software gets detected by anti-virus\nsoftware.\n\n**BazarLoader: Malware Signing**\n\nThe group behind also takes advantage of certificate signing, evading particular anti-virus\nand other software products.\n\nThe use of certificate authorities is widespread in the cybercriminal world. Historically it was\nfrequently a domain of advanced persistent threat groups (APTs). BazarLoader\ndemonstrates that alarming trend. The usage of certificates exploits the trust of certificate\nauthorities by using both new and revoked certificates.\n\nWhile it may be slightly comforting to know that BazarLoader operators use revoked\ncertificates up to six months after their expiration, they can easily purchase new ones. They\ncan buy original code signing certificates for anywhere between $295 USD and $1,799 USD.\n\n\n-----\n\nThe screenshot of a product listing by a threat actor selling these certificates illustrates this\nbelow.\n\nIt is especially alarming that these certificates available to any cybercriminal are legitimate.\nThe threat actor uses real corporations' information to register these certificates with major,\nwidely trusted certificate authorities. Furthermore, as can be seen from the above\nscreenshot, even fully authenticated domains with EV SSL encryption are available for the\ncybercriminals. Such availability underscores the new reality in which even the most secure\ncertificates should never be blindly trusted. Caution must be exercised every step of the way.\n\nThe use of code signing certificates allows Bazar operators to decrease detection rates\nsignificantly. According to the threat actor selling these certificates, their use reduces\ndetection rates by 30 to 50 percent. Considering the profit margins of Bazar operators, it is\nhighly likely they will continue buying these certificates. For them, these certificates are an\ninvestment with a high return of investment.\n\n\n-----\n\n**BazarLoader: Use Of The Blockchain Technology**\n\nThe ingenious use of blockchain is another smart investment decision by Bazar operators.\nThis has cost them even less than the code signing certificates. The price of a blockchainbased, takedown resistant domain called the EmerDNS domain is less than 1 Emercoin per\none year. This is less than one US cent.\n\nIt should be mentioned, though, that prominent companies use Emercoin blockchain\ntechnology. Deloitte is one example as well as the US government regulation integrity\nproject. So once again, Bazar operators display an ability to use legitimate services for\nnefarious ends.\n\nIn particular, they use EmerDNS (.bazar) domains for connections with C2 servers. Because\nthese domains use blockchain technology, law enforcement, or security, researchers'\ndiscovery does not threaten the cybercriminals' operation. Neither legal takedown nor\nsinkhole can disrupt these domains. So the creative use of EmerDNS (.bazar) domains is the\nreason this loader is called \"BazarLoader.\"\n\nMore recently, the group introduced the domain generation algorithm (DGA) in the EmerDNS\nnetwork. While the novelty claim appeared to be impressive, it was discovered that the\nalgorithm was flawed. [2] The algorithm provided an alternative server communication\nchannel creating a massive number of name combinations.\n\n**The Bazar Malware Infection Chain**\n\nThe above-mentioned usage of legitimate services by Bazar malware operators is just the tip\nof the iceberg. They also used legitimate file-sharing services for malware spreading.\n\nWhile phishing emails are commonplace in the cybercriminal campaigns, as about 91\npercent of cyberattacks start with a phishing email, their particular use by Bazar malware\noperators is more sophisticated than usual Once again their tendency to turn legitimate\n\n\n-----\n\norganizations into unwitting accomplices is on full display, as they use a legitimate and\nwidely used SendGrid email marketing platform to send out their phishing emails.\n\nAfter the user has clicked on the phishing email link and landed on the decoy preview page,\nthe page tries to trick the user into downloading malicious dual-extension executable files\n(such as PreviewReport.DOC.exe) by saying that the document preview is unavailable.\nThese malicious dual-extension executable files are the BazarLoader files signed with\ncertificates.\n\nAfter a series of these deobfuscation processes, the encrypted BazarBackdoor is\ndownloaded and decrypted. After this, the portable executable file header is validated for\ndecryption. At that point, the infection chain moves to its final stage during which the host is\ncompromised.\n\n\n-----\n\nThe loader performs process hollowing via two known methods such as process hollowing\nand process doppelganging. It injects malicious code into one of the following processes:\ncmd, explorer, and svchost. Then it executes its own code in the address space of one of\nthem. Since the execution is masked under a legitimate process, the loader often evades\nsome anti-virus detection.\n\nEventually, a scheduled task with the name such as \"StartAd - Ad\" is created, the loader\nwrites itself into the Windows registry, and creates autorun entries. Because of this,\nwhenever someone logs on to the system, the loader is able to run. And the loader is\nprotected from discovery in another way: the author of the scheduled task is set as Adobe.\nSo once again, Bazar malware operators display some use of deception.\n\n\n-----\n\n**From BazarBackdoor to Cobalt Strike Penetration Software Kit**\n\nOne of the malware operation's notable components is to download and execute the Cobalt\nStrike beacons to further access once inside the targeted networks.\n\nJust like professional penetration testers, the crime group behind the BazarBackdoor\nemploys legitimate penetration software kit Cobalt Strike for post-exploitation for\nenumerating and harvesting credentials for network hosts and active directory, uploading\nthird-party software like Lasagne and BloodHound as well pivoting inside the network domain\nexecuting Ryuk ransomware.\n\n**Ryuk Ransomware: BazarBackdoor's Ransomware of Choice**\n\nThe group behind the malware is also largely responsible for the significant increase of the\nRyuk ransomware lately impacting high-profile organizations all over the world.\n\n\n-----\n\nIn The Art of War, Chinese military strategist Sun Tzu wrote that all warfare is based on\ndeception. If so, then Bazar malware operators have turned cybercrime into an art form\nhunting for high-value targets and combining the use of legitimate services and its simplicity\ninto one arcane web of deception.\n\n**Prevention**\n\nThat indicator of compromise is a scheduled task with the name \"StartAd – Ad\".\n\nAdditionally, watch out for dual-extension executable files (such as PreviewReport.DOC.exe).\n\nUsers should be careful not to trust revoked certificates. In particular, be on the lookout for\nthe following revoked certificates used by BazarLoader:\n\n1. VITA-DE d.o.o.\n\n2. VB CORPORATE PTY. LTD.\n\n3. VAS CO PTY LTD\n\n4. THE FLOWER FACTORY S.R.L.\n\n\n-----\n\n5. SLIM DOG GROUP SP Z O O\n\n6. BlueMarble GmbH\n\n7. PLAN CORP PTY LTD\n\n8. PEKARNA TINA d.o.o.\n\n9. PAMMA DE d.o.o.\n\n10. LIT-DAN UKIS UAB\n\n11. James LTH d.o.o.\n\n12. FLORAL\n\n13. D Bacte Ltd\n\n14. Company Megacom SP Z O O\n\n15. Cebola Limited.\n\n**Indicators of Compromise:**\n```\nSHA256: 8c99069bcb559bf7d9606af7ba1538cc8bacd79b4f3846f7487ec3b5179ef9d5\nSHA256: d8576fba423360297b0661833a0e06564230c2079db214dc6830c648e5193e51\nSHA256: 609fef55693698a2bc7695a4bdc574cfb45b590bde4f4291f8d99bc7f25e266a\nSHA256: ca833b3820cff853dc84eb98bf8910249a80a28ed2a7e1da2cc13937df1b39d4\nSHA256: bad9f0b937bc7a74cd5657127e7d1707ce024ccb5434044ef305dffd4307f29b\nSHA256: 2a7964c5d7268f4b320e91ad133654d75edca3c15f9e5c76dee7bf68634b933f\nSHA256: f54cec2b04daafb0a1d612ef84913a1d03ef61d7de8b4c144414378c4415ac09\n\n```\n**Yara Signature**\n\n\n-----\n\n```\nrule crime_win64_backdoor_bazarbackdoor1 {\nmeta:\n description = \"Detects BazarBackdoor injected 64-bit malware\"\n author = \"@VK_Intel\"\n reference = \"https://twitter.com/pancak3lullz/status/1252303608747565057\"\n tlp = \"white\"\n date = \"2020-04-24\"\nstrings:\n $str1 = \"%id%\"\n $str2 = \"%d\"\n $start = { 48 ?? ?? ?? ?? 57 48 83 ec 30 b9 01 00 00 00 e8 ?? ?? ?? ?? 84 c0 0f ??\n?? ?? ?? ?? 40 32 ff 40 ?? ?? ?? ?? e8 ?? ?? ?? ?? 8a d8 8b ?? ?? ?? ?? ?? 83 f9 01\n0f ?? ?? ?? ?? ?? 85 c9 75 ?? c7 ?? ?? ?? ?? ?? ?? ?? ?? ?? 48 ?? ?? ?? ?? ?? ?? 48\n?? ?? ?? ?? ?? ?? e8 ?? ?? ?? ?? 85 c0 74 ?? b8 ff 00 00 00 e9 ?? ?? ?? ?? 48 ?? ??\n?? ?? ?? ?? 48 ?? ?? ?? ?? ?? ?? e8 ?? ?? ?? ?? c7 ?? ?? ?? ?? ?? ?? ?? ?? ?? eb ??\n40 b7 01 40 ?? ?? ?? ?? 8a cb e8 ?? ?? ?? ?? e8 ?? ?? ?? ?? 48 8b d8 48 ?? ?? ?? 74\n??}\n $server = {40 53 48 83 ec 20 48 8b d9 e8 ?? ?? ?? ?? 85 c0 75 ?? 0f ?? ?? ?? ?? ??\n?? 66 83 f8 50 74 ?? b9 bb 01 00 00 66 3b c1 74 ?? a8 01 74 ?? 48 8b cb e8 ?? ?? ??\n?? 84 c0 75 ?? 48 8b cb e8 ?? ?? ?? ?? b8 f6 ff ff ff eb ?? 33 c0 48 83 c4 20 5b c3}\ncondition:\n ( uint16(0) == 0x5a4d and ( 3 of them ) ) or ( all of them )\n}\n\n```\n**Mitre ATT&CK Framework:**\n\nT1093 - Process Hollowing\n\nSignature - TransactedHollowing\n\nT1055 - Process Injection\n\nSignature - InjectionInterProcess\n\n**Source:**\n\n[[1] https://www.vkremez.com/2020/04/lets-learn-trickbot-bazarbackdoor.html](https://www.vkremez.com/2020/04/lets-learn-trickbot-bazarbackdoor.html)\n\n[2] [https://johannesbader.ch/blog/the-buggy-dga-of-bazarbackdoor/](https://johannesbader.ch/blog/the-buggy-dga-of-bazarbackdoor/)\n\n[3] https://www.bleepingcomputer.com/news/security/bazarbackdoor-trickbot-gang-s-newstealthy-network-hacking-malware/\n\n\n-----\n\n**_Roman Marshanski investigates and researches underground and malware threats at_**\n**_Advanced_** **_Intelligence_** **_LLC. He is also the founder of a popular humor website_**\n**_Humoropedia. Roman focuses on developing websites and implementing security_**\n_mechanisms. As a result of his website development career, he became interested in_\n_cybersecurity, earned a cybersecurity certification, and pursues a career in this field. He fell_\n**_in love with malware at Advanced Intelligence LLC. Fascinated by malware's innovative_**\n_and intricate ways, Roman intends to continue his love affair with the most sophisticated and_\n_elite malware developments._\n\n**_Vitali Kremez is the Chairman and CEO of Advanced Intelligence, LLC._**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-12 - -Front Door- into BazarBackdoor- Stealthy Cybercrime Weapon.pdf"
    ],
    "report_names": [
        "2020-10-12 - -Front Door- into BazarBackdoor- Stealthy Cybercrime Weapon.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535744,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653752536,
    "ts_modification_date": 1653752536,
    "files": {
        "pdf": "https://archive.orkl.eu/bf9e1bd27447e51e04ed5e90f23eda585ff6dffa.pdf",
        "text": "https://archive.orkl.eu/bf9e1bd27447e51e04ed5e90f23eda585ff6dffa.txt",
        "img": "https://archive.orkl.eu/bf9e1bd27447e51e04ed5e90f23eda585ff6dffa.jpg"
    }
}