{
    "id": "4cb643a5-aaea-4b06-aaba-13e6f089d4a9",
    "created_at": "2023-01-12T14:59:17.019815Z",
    "updated_at": "2025-03-27T02:05:26.590333Z",
    "deleted_at": null,
    "sha1_hash": "10c44055db9f8048922487f7d82b04d0f83b2513",
    "title": "2022-07-29 - Raccoon Stealer v2- The Latest Generation of the Raccoon Family",
    "authors": "",
    "file_creation_date": "2022-08-18T03:51:00Z",
    "file_modification_date": "2022-08-18T03:51:00Z",
    "file_size": 1157399,
    "plain_text": "# New Generation of Raccoon Stealer v2\n\n**[zscaler.com/blogs/security-research/raccoon-stealer-v2-latest-generation-raccoon-family](https://www.zscaler.com/blogs/security-research/raccoon-stealer-v2-latest-generation-raccoon-family)**\n\n## Introduction\n\nRaccoon is a malware family that has been sold as malware-as-a-service on underground\nforums since early 2019. In early July 2022, a new variant of this malware was released.\nThe new variant, popularly known as Raccoon Stealer v2, is written in C unlike previous\nversions which were mainly written in C++.\n\nThe Raccoon Malware is a robust stealer that allows stealing of data such as passwords,\ncookies, and autofill data from browsers. Raccoon stealers also support theft from all\ncryptocurrency wallets.\n\nIn this blog, ThreatLabz will analyze Raccoon Stealer v2 in the exe format, and highlight key\ndifferences from its predecessors. The authors of the Raccoon Stealer malware have\nannounced that other formats are available, including DLLs and embedded in other PE files.\n\n## Detailed Analysis\n\nRaccoon v2 is an information stealing malware that was first seen on 2022-07-03. The\nmalware is written in C and assembly.\n\nThough we noticed a few new features in the newer variant as mentioned below, the data\nstealing mechanism is still the same as is seen in its predecessor:\n\n1. Base64 + RC4 encryption scheme for all string literals\n2. Dynamic Loading Of WinAPI Functions\n\n\n-----\n\n3. Discarded the dependence on Telegram API\n\nWe have noticed a significant change in the way list of command and control servers is\nobtained. The Raccoon Malware v1 was seen abusing the Telegram network to fetch the list\nof command and control servers, whereas the newer variant has abandoned the use of\nTelegram. Instead, they use a hardcoded IP address of a threat-actor-controlled server to\nfetch the list of command and control servers from where the next stage payload (mostly\nDLLs) is downloaded.\n\n## File Information\n\n**Malware Name: Raccoon Stealer v2**\n**Language: C**\n**File Type: exe**\n**File Size: 56832**\n**MD5: 0cfa58846e43dd67b6d9f29e97f6c53e**\n**SHA1: 19d9fbfd9b23d4bd435746a524443f1a962d42fa**\n**SHA256: 022432f770bf0e7c5260100fcde2ec7c49f68716751fd7d8b9e113bf06167e03**\n\n## Debug Information\n\nThe analyzed file has debug data intact. According to the Debug headers compilation date\nwas Thursday, 26/05/2022 13:58:25 UTC as shown in Figure 1.\n\n_Figure 1: Raccoon v2 Debug Headers_\n\nWe have also seen a change in how Raccoon Stealer v2 hides its intentions by using a\nmechanism where API names are dynamically resolved rather than being loaded statically.\nThe stealer uses LoadLibraryW and GetProcAddress to resolve each of the necessary\nfunctions (shown in Figure 2). The names of the DLLs and WinAPI functions are stored in\nthe binary as clear text.\n\n\n-----\n\n_Figure 2: Raccoon v2 dynamic resolution_\n\n**List Of Loaded DLLs**\n\n1. kernel32.dll\n2. Shlwapi.dll\n3. Ole32.dll\n4. WinInet.dll\n5. Advapi32.dll\n6. User32.dll\n7. Crypt32.dll\n8. Shell32.dll\n\nRaccoon v1 did not employ dynamic resolution for used functions, therefore packed\nsamples were often observed in the wild to evade detection mechanisms. Conversely,\nRaccoon v2 is often delivered unpacked. Figure 3 shows the imported DLLs for raccoon v1.\n\n\n-----\n\n_Figure 3: Raccoon Stealer v1 imports (unpacked)_\n\nOnce resolution of functions is done, the stealer will run its string decryption routine. The\nroutine is simple. RC4 encrypted strings are stored in the sample with base64 encoding.\nThe sample first decodes the base64 encoding and then decrypts the encrypted string with\nthe key ‘edinayarossiya’. This routine is followed for all the strings in function\n**string_decryption(). The 'string_decryption' routine is shown in Figure 4.**\n\n_Figure 4: Raccoon v2 String Decryption Routine_\n\nPrevious versions of Raccoon Stealer did not encrypt string literals other than hard coded\nIP addresses. The Raccoon v2 variant overcomes this by encrypting all the plain text\nstrings. Several of the plaintext strings of Raccoon v1 are shown in Figure 5.\n\n\n-----\n\n_Figure 5: Plaintext Strings In Raccoon v1_\n\nAfter manual decryption of the Raccoon v1 sample strings, the following (Figure 6 and\nFigure 7) strings were obtained in plaintext format.\n\n\n-----\n\n_Figure 6: Raccoon v2 Decrypted Strings_\n\n_Figure 7: Raccoon v2 Decrypted Strings_\n\nThe command and control IP addresses are saved in the malware and follow the same\ndecryption routine but have a different key, 59c9737264c0b3209d9193b8ded6c127. The IP\naddress contacted by the malware is ‘hxxp://51( )195( )166( )184/’ The decryption routine\n\n\n-----\n\nis shown in Figure 8.\n\n_Figure 8: IP Address Decryption Raccoon v2_\n\n## Decrypting Command and Control IP Address\n\nThe encrypted command and control IP Address can be easily decrypted by using public\ntools such CyberChef as shown in Figure 9.\n\n_Figure 9: Raccoon v2 IP Address (via cyberchef utils)_\n\nThis technique is common between both versions of the malware. Figure 10 shows the\nsame routine employed in Raccoon v1.\n\n\n-----\n\n_Figure 10: Raccoon v1 setting up overhead before IP Address decryption_\n\nOnce all the overhead of setting up the functions and decryption of the strings is done, the\nmalware will perform some checks before contacting the command and control server to\ndownload malicious DLLs and exfiltrate information.\n\n## Overhead Before Exfiltration\n\nBefore executing the core of the malware, certain checks are made to understand the\nexecution environment. This includes making sure the malware isn't already running on the\nmachine. Further the malware also checks if it's running as NT Authority/System.\n\nThe malware gets a handle on mutex and checks if it matches a particular value or not. If it\nmatches, the malware continues execution.\n\n**Value: 8724643052.**\n\nThis technique is used to make sure only one instance of malware is running at one time.\nFigure 11 depicts the Mutex check and creation for Raccoon v2, while Figure 12 depicts the\nsimilar procedure used in Raccoon v1.\n\n_Figure 11: Raccoon v2 Mutex Check_\n\n\n-----\n\n_Figure 12: Raccoon v1 Mutex Check_\n\nBy retrieving the Process token and matching the text \"S-1-5-18,\" as shown in Figure 13,\nthe malware determines if it is or is not operating as the SYSTEM user.\n\n_Figure 13: Raccoon v2 Enumerating Process Token_\n\nIf running as a SYSTEM user, the enumeration of all the running processes is done with the\nhelp of fun_CreateToolhelp32Snapshot. Otherwise, the malware moves forward without\nthe enumeration. Figure 14 shows the 'enumerate_processes()' function being called while\nFigure 15 shows the malware iterating over the Processes.\n\n\n-----\n\n_Figure 14: Raccoon v2 Enumerate Process_\n\n_Figure 15: Raccoon v2 Iterating Process Struct_\n\n## Fingerprinting Host\n\nOnce the malware is aware of the environment in which it's running, it starts to fingerprint\nthe host. This malware uses functions such as:\n\n1. RegQueryValueExW for fetching machine ID\n2. GetUserNameW\n\nFigure 16 depicts the malware retrieving the Machine ID from the registry key\n\"SOFTWAREMicrosoftCryptography\" via the RegQueryKeyExW and\n**RegQueryValueExW functions. Figure 17 depicts malware using the GetUserNameW**\nfunction to retrieve a username.\n\n\n-----\n\n_Figure 16: Raccoon v2 Fetching MachineID_\n\n_Figure 17: Raccoon v2 Fetching Username_\n\n\n-----\n\n_Figure 18: Raccoon v2: Username Buffer_\n\nAfter all this is done, the malware will enumerate information such as MACHINE ID and\n**username and then send the data to the remote command and control server.**\n\nFor this purpose, the malware creates a char string and starts appending these values to it.\nIt starts by adding machine id and username. Figure 19 shows the built payload in buffer.\n\n_Figure 19: Raccoon v2: Fingerprinting Payload_\n\nNext, it generates and appends configId which is the rc4 encryption key.\n\n**machineId=<MachineGuid>|<UserName>&configId=<RC4 key>**\n\n\n-----\n\n## Communications with Command and Control\n\nCommunication with command and control takes place over plain text http protocol. The\npreviously decrypted IP address hxxp://51(.)195(.)166(.)184/ is used for command and\ncontrol communication.\n\nThe malware contacts the list of previously decrypted command and control IP addresses\n(stored in local_3c). Since this malware only contains one command and control IP\nAddress, the post request is only made to one as seen in Figure 20.\n\n_Figure 20: Raccoon v2: Command and Control communication_\n\n**Command and Control URL**\n\n_Figure 21: Raccoon v2 URL in buffer_\n\n**Request Headers**\n\n\n-----\n\n_Figure 22: Raccoon v2 Request Headers_\n\nOnce the request has been made, the malware checks if the content body length is zero or\nnot. If no content is received from command and control or the content body length is zero,\nthe malware exits. This check is made because the exfiltration mechanism of the malware\nrequires command and control to respond with a list IP Addresses to exfiltrate data to. In\nFigure 23, this condition can be seen along with the 'ExitProcess()' function call.\n\n\n-----\n\n_Figure 23: Raccoon v2 Verifying Response Content_\n\n## Discarded the dependence on Telegram bot\n\nThe Raccoon v1 relied on the Telegram Bot API description page to fetch command and\ncontrol IP addresses and establish connections. The recent malware variants (v2) from this\nfamily have started to hard-code IP addresses in the binary to achieve this task. Raccoon\nMalware v2 uses 5 hard coded IP addresses and iterates over them.\n\n## Data Exfiltration\n\nThe malware relies on response from command and control server to down the required\nDLLs and decides on the next course of action.\n\nAs of the writing of this blog the command and control IP has died, thus analysis of traffic\ntowards the host is not possible. ThreatLabz has previously observed that the command\nand control server provides information on where to download additional payloads from and\nwhich IP Address to use for further communications.\n\n_Figure 24: Raccoon v2 pinging extracted IP Address_\n\n**Grepped DLLs**\n\n_Figure 25: Raccoon v2 DLLs that are downloaded_\n\nThe malware uses a WINAPI call to SHGetFolderPathW to get a path to C:\\Users\\\n**<User>\\AppData and appends “Local” to it and uses it as the path to store stolen**\ninformation before sending it to the command and control.\n\n\n-----\n\n_Figure 26: Raccoon v2 Storage Path In Buffer_\n\n## Indicators Of Compromise\n\n**IP contacted by the analyzed sample of Raccoon v2.**\n\n55(.)195(.)166(.)184\n\n[List Of Other IPs that act as an C2 for other samples can be found here.](https://pastebin.com/RD0HRVw3)\n\n**Downloaded DLLs**\n\n1. nss3.dll\n2. sqlite3.dll\n3. GdiPlus.dll\n4. Gdi32.dll\n\n**Path Used By the Malware**\n\n1. C:\\Users\\<USERNAME>\\AppData\\Local\n\n**Other samples observed in the wild of Raccoon v2.**\n\n1. 0123b26df3c79bac0a3fda79072e36c159cfd1824ae3fd4b7f9dea9bda9c7909\n2. 022432f770bf0e7c5260100fcde2ec7c49f68716751fd7d8b9e113bf06167e03\n3. 048c0113233ddc1250c269c74c9c9b8e9ad3e4dae3533ff0412d02b06bdf4059\n4. 0c722728ca1a996bbb83455332fa27018158cef21ad35dc057191a0353960256\n5. 2106b6f94cebb55b1d55eb4b91fa83aef051c8866c54bb75ea4fd304711c4dfc\n6. 263c18c86071d085c69f2096460c6b418ae414d3ea92c0c2e75ef7cb47bbe693\n7. 27e02b973771d43531c97eb5d3fb662f9247e85c4135fe4c030587a8dea72577\n8. 2911be45ad496dd1945f95c47b7f7738ad03849329fcec9c464dfaeb5081f67e\n9. 47f3c8bf3329c2ef862cf12567849555b17b930c8d7c0d571f4e112dae1453b1\n10. 516c81438ac269de2b632fb1c59f4e36c3d714e0929a969ec971430d2d63ac4e\n\n11. 5d66919291b68ab8563deedf8d5575fd91460d1adfbd12dba292262a764a5c99\n12. 62049575053b432e93b176da7afcbe49387111b3a3d927b06c5b251ea82e5975\n13. 7299026b22e61b0f9765eb63e42253f7e5d6ec4657008ea60aad220bbc7e2269\n14. 7322fbc16e20a7ef2a3188638014a053c6948d9e34ecd42cb9771bdcd0f82db0\n\n\n-----\n\n15. 960ce3cc26c8313b0fe41197e2aff5533f5f3efb1ba2970190779bc9a07bea63\n16. 99f510990f240215e24ef4dd1d22d485bf8c79f8ef3e963c4787a8eb6bf0b9ac\n17. 9ee50e94a731872a74f47780317850ae2b9fae9d6c53a957ed7187173feb4f42\n18. bd8c1068561d366831e5712c2d58aecb21e2dbc2ae7c76102da6b00ea15e259e\n19. c6e669806594be6ab9b46434f196a61418484ba1eda3496789840bec0dff119a\n20. e309a7a942d390801e8fedc129c6e3c34e44aae3d1aced1d723bc531730b08f5\n21. f7b1aaae018d5287444990606fc43a0f2deb4ac0c7b2712cc28331781d43ae27\n\n## Conclusion\n\nRaccoon Stealer sold as Malware-as-a-Service has become popular over the past few\nyears, and several incidents of this malware have been observed. The Authors of this\nmalware are constantly adding new features to this family of malware. This is the second\nmajor release of the malware after the first release in 2019. This shows that the malware is\nlikely to evolve and remain a constant threat to organizations.\n\n## Zscaler coverage\n\nWe have ensured coverage for the payloads seen in these attacks via advanced threat\nsignatures as well as our advanced cloud sandbox.\n\n_Figure 27: Zscaler Sandbox Detection_\n\nZscaler's multilayered cloud security platform detects indicators at various levels, as shown\nbelow:\n\n**[Win32.PWS.Raccoon](https://threatlibrary.zscaler.com/threats/6138de3d-405e-46b3-a360-7689aef9e2ed)**\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-29 - Raccoon Stealer v2- The Latest Generation of the Raccoon Family.pdf"
    ],
    "report_names": [
        "2022-07-29 - Raccoon Stealer v2- The Latest Generation of the Raccoon Family.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535557,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1660794660,
    "ts_modification_date": 1660794660,
    "files": {
        "pdf": "https://archive.orkl.eu/10c44055db9f8048922487f7d82b04d0f83b2513.pdf",
        "text": "https://archive.orkl.eu/10c44055db9f8048922487f7d82b04d0f83b2513.txt",
        "img": "https://archive.orkl.eu/10c44055db9f8048922487f7d82b04d0f83b2513.jpg"
    }
}