{
    "id": "4cba48be-7562-435d-b5e6-c3a6f7dca34d",
    "created_at": "2022-10-25T16:48:14.801875Z",
    "updated_at": "2025-03-27T02:17:27.537141Z",
    "deleted_at": null,
    "sha1_hash": "1adf1cbaa570e63899d7a99468522b2b05e5ab7f",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-04-29T00:39:26Z",
    "file_modification_date": "2021-04-29T10:15:49Z",
    "file_size": 12777527,
    "plain_text": "###### ICS CYBERSECURITY\n YEAR IN REVIEW 2020\n\n\n-----\n\n###### Contents\n\n Introduction..............................................................................................................3\n\n Key Highlights......................................................................................................... 4\n\n In The Headlines.......................................................................................................5\n\n Section One: ICS Threat Landscape........................................................................ 8\n\n Key Updates on Existing Activity Groups.............................................................................. 10\n\n 2020’s New Activity Groups........................................................................................................11\n\n STIBNITE..................................................................................................................................... 12\n\n TALONITE................................................................................................................................... 13\n\n KAMACITE..................................................................................................................................14\n\n VANADINITE.............................................................................................................................. 15\n\n Most Common TTPs Across All Industries.............................................................................16\n\n Section Two: ICS Vulnerabilities............................................................................ 17\n\n 2020 Vulnerability Details...........................................................................................................19\n\n 2020 Vulnerability Severity......................................................................................................... 21\n\n Actionable Guidance Missing in Most 2020 Advisories..................................................... 23\n\n Severity Ratings of Vulnerabilities Remain Error-Prone.................................................... 25\n\n Flaws in TCP/IP Stacks.................................................................................................................27\n\n Vulnerabilities in VPN Appliances Facilitating Remote Work..........................................28\n\n Section Three: Lessons Learned From the Front Lines........................................ 29\n\n Visibility............................................................................................................................................ 31\n\n Segmentation and Connections............................................................................................... 33\n\n Cyber Readiness.............................................................................................................................37\n\n Dragos Red Team......................................................................................................................... 39\n\n Recommendations................................................................................................. 40\n\n Increase OT Network Visibility................................................................................................. 40\n\n Identify and Prioritize Crown Jewels........................................................................................41\n\n Boost Incident Response Capabilities..................................................................................... 42\n\n Validate Network Segmentation.............................................................................................. 43\n\n Secure Credential Management...............................................................................................44\n\n\n-----\n\n###### INTRODUCTION\n\n The Dragos Year in Review report is an annual analysis of Industrial Control System (ICS)/Operational Technology (OT) focused cyber threats, vulnerabilities, assessments, and incident response insights.[1] The ICS/OT community has long suffered from a lack of public insights into these types of problem areas to have a meaningful discussion on how to address the issues. It is the Dragos team’s goal to share the observations and lessons learned with the industrial community for data-driven analysis and recommendations.\n\n In 2020, the industrial community performed amazing feats to keep civilization running under extremely challenging circumstances with the global pandemic. Infrastructure providers kept key services and goods available including electric power, manufactured goods, water, oil and gas, mining, chemical, rail, and transport while many faced hardships globally. As a result of these efforts, organizations shifted in how they conducted business to include an increasingly connected industrial environment. This is a trend that has existed for many years, even while many organizations still believed they had highly segmented or even air-gapped ICS networks. The risk to ICS is not born from an IT and OT convergence, but instead from a convergence of an increasingly ICS-aware and capable threat landscape with the digital transformation and hyperconnectivity of the industrial community. This report captures how some of the community is performing and progressing, and areas of improvement that will be needed to continue to provide safe and reliable operations.\n\n\n###### INTRODUCTION\n\n\n**1** The terms “ICS” and “OT” will be used interchangeably for the purpose of this report.\n\nThese terms are used differently in different communities.\n\n\n-----\n\n###### KEY HIGHLIGHTS\n\nFour new threat groups The abuse of valid\nwith the assessed accounts was the\nmotivation of targeting **number one**\nICS/OT were discovered, **technique used**\naccounting for a 36% by named threats.\n**increase in known**\ngroups.\n\n###### SERVICE ENGAGEMENT\n VULNERABILITY ADVISORY\n FINDINGS FINDINGS\n\n**43% of ICS**\n\n**90% of service**\n\n**vulnerability**\n\n**engagements included**\n\n**advisories** contained\n\na finding around lack\n\nerrors that would make\n\nof visibility across OT\n\nit difficult to prioritize\n\nnetworks.\n\nmitigations.\n\n**64% of advisories**\n\n**54% of service**\n\n**that had no patch**\n\n**engagements included**\n\nalso had no practical\n\na finding about shared\n\nmitigation advice\n\ncredentials in OT\n\nprovided by the vendor.\n\nsystems.\n\n**61% of advisories**\n\n**88% of service**\n\n**that had a patch** did\n\n**engagements**\n\nnot have any alternate\n\nincluded a finding\n\nmitigation advice\n\nabout improper\n\nprovided by the vendor\n\nnetwork segmentation.\n\nexcept for applying the\npatch, which in many\nindustrial organizations\ncan be difficult or\nsignificantly delayed.\n\n\n-----\n\n###### IN THE HEADLINES\n\n\n###### IN THE HEADLINES\n\nMITRE introduced ATT&CK Ripple20, AMNESIA:33\nfor ICS in 2020 to codify and\ncommunicate the unique threat\nbehaviors, or Tactics, Techniques, Third-party code integration can pose risks to\nand Procedures (TTPs), that industrial operations. Many vendors do not track\nICS adversaries use against OT third-party code libraries, and therefore cannot\ntargets. This independent and accurately inform customers if their products\ncommunity-sourced framework are impacted. Vendors are beholden to software\nprovides a common lexicon manufacturers to release fixes for vulnerabilities\nfor categorizing ICS-specific that may impact thousands of products. For\nTTPs to support reporting and example, security researchers disclosed multiple\nfurther analysis. Dragos uses vulnerabilities in TCP/IP software libraries called\nthe framework internally and Ripple20[2] and AMNESIA:33[3] that potentially\ncontinues to contribute to this impacted many ICS vendors. Example ICS devices\nprogram and community resource. impacted include Programmable Logic Controllers\nThe Year in Review report (PLCs), Serial to Ethernet Converters, Protocol\nleverages information from MITRE Converters, Remote Terminal Units (RTUs), digital\nATT&CK about observed activity protective relays, and some managed network\nin ICS environments to help switches and routers. Most of the devices impacted\ndefenders mitigate threats to their by the vulnerabilities were not accurately identified\norganizations. and did not have advisories released due to the\n\ndifficulty in understanding third-party code\nadoption. Security design flaws in the impacted\ndevices may make this collection of flaws\nless relevant to adversaries, but the disclosure\nhighlights supply chain risks and complexity.\n\nEKANS represents a specific threat to ICS because of its incorporation of potential process\nand operational disruption features. This ransomware is capable of stopping ICS-related\nWindows processes before initiating encryption. EKANS activity could produce an unstable\nor physically disruptive situation by abruptly ending an operationally significant process.\nThe Dragos Intelligence team assesses EKANS is related to a previous strain of ransomware\ncalled MEGACORTEX. Throughout 2020, Dragos identified new EKANS activity targeting\nmultiple verticals including electric, oil and gas, medical, pharmaceutical manufacturing, and\nautomotive. Public targets included Fresenius Kabi, a pharmaceutical division of the European\ncompany Fresenius Group; global manufacturer Honda; and Italian energy company Enel.\n\n\n-----\n\n###### IN THE HEADLINES\n\nMultiple ICS entities were impacted by a SolarWinds directly, and organizations were\nmassive supply chain compromise first unaware they had it in their environments.\nrevealed in December 2020.[4] Adversaries More commonly though, many integrators,\ncompromised SolarWinds Orion business support contracts, and ICS suppliers\nsoftware to distribute malware. The use software, including SolarWinds, as\nadversary had unfettered access for more white-labeled solutions. This means the\nthan 14 months and is thought to now product is in place but under a different\nhave access to other supply chain access name. Suppliers may use the software\npoints throughout the community. themselves on behalf of the client where the\n\nIdentifying SolarWinds in ICS compromised SolarWinds software was not\nenvironments was challenging. To in the end-users ICS network. The software\nrespond appropriately, facilities required may have been present in the supplier or\naccurate asset lists, software version integrator’s network and used in the end-\ninformation, and network monitoring user’s networks across direct connections\nto identity post-exploitation activity. or maintenance links. SolarWinds often\nDragos investigated numerous confirmed has access directly to the control level\ncompromises. The investigations reverted in ICS networks which would allow an\nto limited host-based analysis and could adversary to not only have access to these\nonly capture days or weeks in analysis. In environments, but direct control of them.\nan ICS network where not all endpoints Many organizations that did not believe they\ncan have robust host logging and in were impacted were compromised directly\ncompromises where adversaries leverage or accessed from compromised networks\nthe network extensively, it is preferred to due to third-parties.\nhave network traffic analysis and logging. Dragos is aware of at least two global\nGiven the current lack of visibility in ICS Original Equipment Manufacturers\nindustrial networks the assessment of (OEMs) that were using the compromised\nSolarWinds’ compromise impact is likely SolarWinds software across maintenance\nto not be fully understood for years. links into ICS networks, including where\n\nIn some cases plant personnel purchased there was turbine control software.[5]\n\n**4** https://www.dragos.com/blog/industry-news/responding-to-solarwinds-compromise-in-industrial-environments/;\n\n**[5 ]Dragos attempted to inform both OEMs and eventually leveraged government organizations to ensure that the risk was understood.**\n\n\n-----\n\n###### IN THE HEADLINES\n\nPrior to 2020, OT-targeting adversaries exploited remote services to\ncompromise ICS environments. This technique gained popularity\nas the COVID-19 pandemic spread globally. Companies began\nrequiring some workers to remain at home in 2020, even those\nworking in industrial environments. Multiple ICS-targeting threat\ngroups historically targeted remote access technologies or logon\ninfrastructure including PARISITE, MAGNALLIUM, ALLANITE, and\nXENOTIME. This includes compromise of Remote Desktop Protocol\n(RDP) and Virtual Private Network (VPN) assets. VPN equipment\nis a common access point for OEMs and integrators to gain access\nto operations environments. Although many organizations focus\non prevention and segmentation, obtaining access through a\ncompromised VPN may allow an adversary into an ICS network\nwith limited detection capabilities. For example, in 2019 the Dragos\nteam reported on the threat group PARISITE noting it was the\naccess operations team for the MAGNALLIUM group and explicitly\ntargeted OT boundary equipment, such as VPNs, for the likely\npurpose of gaining access to ICS networks.\n\n\n-----\n\n###### SECTION ONE\n\n ICS Threat Landscape\n\n\n-----\n\n###### INTRODUCTION\n\n Cyber risk to industrial sectors has grown and accelerated dramatically, led by ransomware impacting industrial processes, intrusions enabling information gathering and process information theft, and new activity from adversaries targeting ICS. Dragos emphasizes the importance of understanding how adversaries steal information and gain access to better prepare for adversary behavior in the future. Adversaries often build programs and campaigns slowly over time, with later campaigns often being more successful and disruptive due to previous efforts.\n\n Some threats tracked by Dragos may proliferate into disruptive and destructive capabilities later, though no such activity is observed at this time. For example, the team would track a threat that was explicitly targeting electric companies with theming toward engineers, engineering projects, or electric operations, though there may be limited or no visibility to confirm if the adversary gained access to ICS networks. The team would not track a threat if it was simply trying to gain access to an electric company. The fundamental assessment of threats tracked by Dragos is that they are explicitly trying to gain access to ICS networks and operations or are successful in achieving access.\n\n These types of events, where adversaries gain access to ICS networks but do not have the intention of currently disrupting them, are much more common than is publicly reported. The threats are learning ICS. Although not every compromise will relate to an impact today, many may inform the attacks of the future. Dragos tracks 15 threat Activity Groups, or threat groups,[6] with four of the groups discovered in 2020. Threats are growing at a rate three times faster than they are going dormant.[7] This is likely due to the increased investment made by adversaries in targeting ICS over the last five to 10 years, and whose investment will continue to accelerate the ICS threat environment.\n\n\n###### INTRODUCTION\n\n\n**6** Organizations track threats in unique ways. At Dragos, analysts utilize the\nDiamond Model for Intrusion Analysis, which is a common and industry\naccepted methodology to cluster intrusions into groups representing teams of\nadversaries that operate in similar ways. The Diamond Model is an open and\nwell-documented framework that allows for transparency in how this analysis\nis conducted. https://www.activeresponse.org/wp-content/uploads/2013/07/\ndiamond.pdf\n\n**7 Every year feels like the headlines are, “Threats are Getting Worse,” or “Risk**\nis Increasing.” A useful way to track the evolution of the threat landscape is to\ndetermine how many new threat groups are identified compared to how many\nare going dormant. Groups that are not observed performing new intrusions\nwithin a 12-month period are moved to a dormant phase. Typically the growth\nrate would be less than two groups being created for every group that goes\ndormant.\n\n\n**MAJOR ICS THREAT TRENDS IN 2020**\n\n- ICS THREAT ACTIVITY GROUPS INCREASE\n\nSIGNIFICANTLY\n\n- PHISHING CONTINUES TO ENABLE ICS\n\nINTRUSIONS\n\n- REMOTE ACCESS DIRECTLY TO ICS\n\nLEVERAGED OFTEN BY THREATS\n\n- THE BEGINNING OF RANSOMWARE\n\nSPECIFICALLY TARGETING ICS\n\n- SUPPLY CHAIN CONCERNS AMPLIFIED\n\n\n-----\n\n###### Key Updates on Existing Activity Groups\n\n Throughout 2020, the 11 Activity Groups identified prior to 2020 remained active against industrial organizations. While already covered in previous Year in Review reports, the following key activities occurred in 2020 that are worth noting:\n\nIn March, PARISITE leveraged Citrix vulnerability CVE-2019-19781 in intrusions\ntargeting North American electric and oil and gas entities. This was concerning\ngiven that PARISITE conducts initial access operations potentially enabling future\ndisruptive operations associated with MAGNALLIUM. This exemplifies the critical\nneed to track any groups interested in ICS through IT networks. In one example,\nDragos responded to an incident where PARISITE was identified internal to the\norganization before MAGNALLIUM could act. Intelligence-informed decisions can and\nhave helped organizations prioritize efforts successfully.\n\nIn April, new DTrack malware emerged with the ability to communicate with Fujitsu\nSystemwalker management software utilized in distributed computing and data\ncenter management operations. Dragos associated this activity with the energy-\ntargeting group WASSONITE. Interaction with this type of software can significantly\nimpact data center and computational environments resulting in potential ICS or\nbroader operational impacts.\n\n**ALLANITE and DYMALLOY remain critical threats to infrastructure operations,**\nespecially in Europe and North America. In May, Dragos observed ALLANITE\nconducting credential harvesting via watering hole attacks. This was followed by use\nof captured credentials and built-in system tools to launch intrusions into the German\nelectric system, and potentially water and wastewater sectors. ALLANITE and\nDYMALLOY continued to target multiple United States (U.S.) industrial entities from\nSeptember through October 2020. Operations included use of ZeroLogon to further\nintrusions into victim networks. CHRYSENE showed continued activity with further\nmalware development and used new tools to infiltrate ICS networks in the Middle\nEast for intelligence gathering purposes.\n\n\n-----\n\n###### 2020’s New Activity Groups\n\n STIBNITE TALONITE\n\n KAMACITE VANADINITE\n\n\n-----\n\n###### STIBNITE\n\n\n**STIBNITE specifically targets wind turbine companies**\nthat generate electric power in Azerbaijan. Based\non current collection efforts, the activity appears\nconfined exclusively to Azerbaijan. There is\nongoing kinetic conflict in the region between\nAzerbaijan and Armenia due to rights to disputed\nterritory. Historically when there is regional conflict\nbetween states, there tends to be targeting of critical\ninfrastructure, including electric operations. There\nis only a loose correlation between the conflict and\nSTIBNITE operations, and the Dragos team is not\nmaking an assessment on who may be responsible\nfor the targeting.[8] Given the specific targeting and\nthe regional conflict, it is a situation and threat group\nworth watching closely.\n\nSTIBNITE’s victims share unique technology with\nwind farms in Ukraine. One possibility for the specific\nvictim targeting is that adversaries targeted the\nsupplier and maintainer for the wind farm itself. The\nsupplier, operator, and maintainer are all based in\nUkraine.\n\nSTIBNITE used shared Command and Control (C2)\ninfrastructure between multiple intrusions in late\n2020 and updated its malware capabilities to avoid\ndetection after public reports on its activity were\nreleased. STIBNITE uses PoetRAT remote access\nmalware in its intrusion operations to gather\ninformation, take screenshots, transfer files, and\nexecute commands on victim systems. STIBNITE\ngains initial access via credential theft websites\nspoofing Azerbaijan government organizations and\nphishing campaigns using variants of malicious\nMicrosoft Office documents. STIBNITE also used\ninformation related to the global COVID-19 pandemic\nfor malicious document themes.\n\n**8** https://www.wsj.com/articles/armenia-azerbaijan-conflict-11601325097\n\n\n###### Target Geography\n\n Azerbaijan\n\n Victimology Malware PoetRAT\n\n\n###### Azerbaijan\n\n\nsquare ICS square Enterprise\n\n\n###### STIBNITE TTPs\n from MITRE ATT&CK\n\n**INITIAL ACCESS**\n\n\n###### PoetRAT\n\n\n**T0865**\n\n**T0817**\n\n\nSpearphishing\n\nDrive-by Compromise\n\n\n**PERSISTENCE**\n\n\n**T0859**\n\n**T1050**\n\n\nValid Accounts\n\nNew Service\n\n\n**LATERAL MOVEMENT**\n\n\n**T0859**\n\n\nValid Accounts\n\n\n**COMMAND & CONTROL**\n\n\n**T0869**\n\n\nStandard Application Layer Protocol\n\n\n-----\n\n###### Target Geography\n\n\n###### TALONITE\n\n\n**TALONITE‘s operations focus on near exclusive**\ninterest in initial access compromises in the U.S.\nelectric sector. The group uses phishing techniques\nto deliver either malicious documents or executables.\nTALONITE uses two custom malware families known\nas LookBack and FlowCloud for information gathering\noperations.[9]\n\nTALONITE’s phishing campaigns utilize electric\nand power grid engineering-specific themes and\nconcepts, indicating an intent to gain a foothold\nwithin energy sector entities. Such access could\nfacilitate gathering host and identity information,\ncollecting sensitive operational data, or mapping the\nenterprise environment to identify points of contact\nwith ICS. The identified infrastructure and phishing\nemails spoofed the National Council of Examiners for\nEngineering and Surveying (NCEES), North American\nElectric Reliability Corporation (NERC), the American\nSociety of Civil Engineers (ASCE), and Global Energy\nCertification (GEC).\n\nTALONITE employs malware using legitimate binaries\nmaliciously, or modifies such binaries to include\nadditional functionality. For example, LookBack\nmalware contains persistence mechanisms that add\ntwo Windows registry keys to execute legitimate but\nmodified files when the infected user next logs in.\nFlowCloud launches a renamed copy of the legitimate\nHTML Help Workshop (hhw.exe) utility from\nMicrosoft. The group uses a combination of owned\nand compromised network infrastructure.\n\n**9** For more public information on these malware families reference Proofpoint’s reporting here:\nhttps://www.proofpoint.com/us/threat-insight/post/lookback-malware-targets-united-states-utilities-sectorphishing-attacks\n\n\n###### North America\n\n Victimology\n\n\n###### or reused through the\n\n\n###### Appears to be shared\n\n\nsquare ICS square Enterprise\n\n\n###### Victimology\n\n\n###### Infrastructure Appears to be shared or reused through the overlapping LookBack and\n\n\n###### overlapping LookBack and\n\n\n###### TALONITE TTPs\n from MITRE ATT&CK\n\n**INITIAL ACCESS**\n\n\n###### FlowCloud campaigns\n\n\n**T0865**\n\n\nSpearphishing Attachment\n\n\n**EXECUTION**\n\n\n**T1106**\n\n\nNative API\n\n\n**PERSISTENCE**\n\n\n**T1078**\n\n\nValid Accounts\n\n\n**DISCOVERY**\n\n\n**T1046**\n\n\nNetwork Scanning Service\n\n\n**LATERAL MOVEMENT**\n\n\n**T1078**\n\n\nValid Accounts\n\n\n**COLLECTION**\n\n\n**T1113**\n\n\nScreen Capture\n\n\n**T1005** Data from Local System\n\n**COMMAND & CONTROL**\n\n\n**T1090**\n\n\nProxy\n\n\n-----\n\n###### KAMACITE\n\n\nIn 2020, KAMACITE targeted U.S. energy companies by\nleveraging stolen credentials or brute force logons of\nremote services to access victim networks. Dragos tracks\nKAMACITE as a significant threat to industrial operations\nbecause of strong overlaps between KAMACITE and the\nSandworm group, which enabled a disruptive cyberattack\nto electric operations in Ukraine.\n\nSandworm is a group tracked by FireEye analysts covering\na wide variety of ICS and non-ICS specific targeting.\nKAMACITE represents the specific, ICS-targeting access\nenablement component observed by Dragos. KAMACITE\nalso represents a long-running set of related behaviors\ntargeting critical infrastructure and industrial verticals.\nKAMACITE is a unique group due to new intrusions and\nevolution in tradecraft distinct from original Sandworm\nactivity.[10]\n\nDragos assesses KAMACITE is an access-enablement\nteam that operates to support other teams conducting\ndisruptive and destructive effects.[11] Previously, Dragos\nidentified ELECTRUM as the group responsible for the\nUkraine 2016 electric transmission substation cyberattack.\nThe important distinction is that in Dragos’s analysis,\nKAMACITE conducted the access operations, enabling\nELECTRUM to create and use CRASHOVERRIDE malware\nto carry out the attack. Dragos determined this based on\nbehavioral differentiations from ELECTRUM activity and\nearlier access operations demonstrating two distinct\ngroups of activity.\n\nIn 2020, KAMACITE was observed performing\nreconnaissance against numerous energy companies in\nthe U.S. Following its reconnaissance, it attempted to take\nadvantage of webmail of those companies and cloudbased logon services including Microsoft Active Directory\n(AD) and Office 365 services. In addition to this activity,\nDragos verified Server Message Block (SMB) (TCP 445)\nconnections from KAMACITE infrastructure to victims\nthat could indicate some successful access attempts. The\nprecise nature of this connectivity is unknown.\n\n**10** It is common for the information security community to look at threat group names as names, when in reality they are\ndefinitions. Sandworm is tracked by FireEye. While links can be seen to others’ groups, the definition, collection efforts,\nand analysis of the FireEye analysts are distinct from those at Dragos and proprietary. Dragos decided to start tracking\nKAMACITE, associated with a link to Sandworm, upon new activity and unique collection emerging in 2020. [11] Dragos\nhas unique visibility and tracks intrusions that are still active as of this past year. Dragos tracks KAMACITE separately\nf S d ti it D i t tt ti t S d b t i l i i th ICS ti it\n\n\n###### North America\n\n\n###### ELECTRUM\n\n\nsquare ICS square E t i\n\n\n###### Target Geography\n\n North America Europe\n\n\n###### Europe\n\n\n###### Victimology\n\n\n###### Major Incidents\n BE2, BE3, CRASHOVERRIDE\n\n Links SANDWORM,\n ELECTRUM\n\n\n###### CRASHOVERRIDE\n\n\n###### BE2, BE3,\n\n\n###### KAMACITE TTPs\n from MITRE ATT&CK\n\n\n###### SANDWORM,\n\n\n**INITIAL ACCESS**\n\n\n**T1190**\n\n**T0866**\n\n\nExploit Public Facing Application\n\nExploitation of Remote Services\n\n\n**EXECUTION**\n\n\n**T0853**\n\n**T0807**\n\n\nScripting\n\n\nCommand-Line Interface\n\n\n**PERSISTENCE**\n\n\n**T1078**\n\n\nValid Accounts\n\n\n**DISCOVERY**\n\n\n**T0840**\n\n**T0846**\n\n\nNetwork Connection Enumeration\n\n\nRemote System Discovery\n\n\n**LATERAL MOVEMENT**\n\n\n**T1078**\n\n**T0866**\n\n\nValid Accounts\n\n\nExploitation of Remote Services\n\n\n**COMMAND & CONTROL**\n\n\n**T0885**\n\n**T0884**\n\n\nCommonly Used Ports\n\n\nConnection Proxies\n\n\n-----\n\n###### Target Geography\n\n\n###### VANADINITE\n\n\n**VANADINITE conducted various initial access**\noperations targeting industrial entities across the\nenergy, manufacturing, and transportation sectors\nin North America, Europe, Australia, and Asia.\nDragos assesses this group’s activity is focused\non information gathering operations, including\nspecifically ICS compromise and data theft. Obtaining\ndocuments and intellectual property relating to ICS\nprocesses, function, and design could enable this\ngroup’s sponsor entity to develop ICS capabilities.\nVANADINITE’s activity supports long-term strategic\nadvances rather than disruptive or destructive effects.\nDragos assesses with low confidence VANADINITE is\nresponsible for the ColdLock ransomware attack that\ntargeted Taiwanese state-owned ICS companies and\ncaused indirect disruption to operations. The objective\nof this attack — whether financial gain or disruptive\nmessaging — is unclear.\n\nDragos consistently observed a pattern in\nVANADINITE behavior, including the targeting of\nrecently disclosed “n+1” vulnerabilities in a range\nof networking and gateway devices impacting\nremote access services like VPNs. Asset owners and\noperators should treat vulnerabilities in externalfacing network appliances as a serious issue. Dragos\nobserved multiple entities, including PARISITE,\nincreasingly adopt this methodology. These remote\naccess technologies often directly enable access to\nICS networks bypassing enterprise networks and are\ncommonly used by integrators and ICS OEMs.\n\n\n###### Winnti, LEAD\n\n\n###### Australia\n\n\n**PERSISTENCE**\n\n\n###### Victimology\n\n\n###### North America,\n Europe, Asia,\n Australia\n\n Links Winnti, LEAD\n\n\n###### Europe, Asia,\n\n\n###### VANADINITE TTPs\n from MITRE ATT&CK\n\n**INITIAL ACCESS**\n\n\n###### North America,\n\n\n**T1190**\n\n**T1133**\n\n**T1110**\n\n**T1555**\n\n**T1003**\n\n**T1111**\n\n\nExploit Public Facing Infrastructure\n\nExternal Remote Services\n\nBrute Force\n\nCredentials from Password Stores\n\nOperating System Credential Dumping\n\nTwo-Factor Authentication Interception\n\n\n**EXECUTION**\n\n\n**T1059**\n\n**T1047**\n\n\nCommand and Scripting Interpreter\n\nWindows Management Instrumentation\n\n\n**T1133**\n\n**T1078**\n\n\nExternal Remote Services\n\nValid Accounts\n\n\n**LATERAL MOVEMENT**\n\n\n**T1078**\n\n\nValid Accounts\n\n\nsquare ICS square Enterprise\n\n\n-----\n\n###### Most Common TTPs Across All Industries\n\n The following chart demonstrates how many of the 15 Activity Groups Dragos tracks leverage a specific MITRE ATT&CK for ICS TTP. As shown below, Valid Accounts usage is the most common TTP among the groups.\n\n Top Activity Group 5 TTPs\n\n 13\n\n 12\n\n 11\n\n 10\n\n 9\n\n 8\n\n 7\n\n 6\n\n 5\n\n 4\n\n 3\n\n 2\n\n 1 T0859 T0865 T0853 T0869 T0862\n\n\n-----\n\n###### SECTION TWO\n\n ICS Vulnerabilities\n\n\n-----\n\n###### INTRODUCTION\n\n Dragos researchers analyzed 703 ICS/OT vulnerabilities in 2020. For each vulnerability, Dragos independently assesses and confirms – and often corrects – the advisories describing flaws in firmware or software.  The vulnerabilities Dragos analyzes are identified by independent security researchers, the Department of Homeland Security’s ICS-Computer Emergency Readiness Team (CERT), vendors, and Dragos analysts.\n\n Dragos analyzed 29 percent more vulnerabilities in 2020 than 2019, demonstrating a rise in publicly known flaws in systems supporting industrial operations. Of individually reviewed vulnerabilities, 33 percent contained errors in the Common Vulnerability Scoring System (CVSS) score, potentially impacting patching decisions made by asset owners and operators. Over one-third of vulnerabilities could cause a loss of view and control if exploited by an adversary. Public Proof of Concepts (POCs) were available for 30 vulnerabilities reviewed by Dragos, meaning available resources indicated specifically how an adversary could operationalize the flaw.\n\n\n###### INTRODUCTION\n\n\n-----\n\n###### 2020 Vulnerability Details\n\nTwenty-three percent of **Advisories Applied to Products**\nvulnerabilities Dragos analyzed **Bordering the Enterprise**\napplied to products bordering\nthe enterprise. This can include\nnetworking communication\nequipment, VPNs, data historians, or\n\n###### 23%\n\nfirewalls commonly deployed in ICS\n\n###### 21%\n\nnetworks. This number is up from\n21 percent in 2019. ICS-targeting\nadversaries, including VANADINITE\nand PARISITE, have historically\nleveraged such vulnerabilities for\ninitial access to target environments\nand pose a risk to industrial operators.\nThese vulnerabilities are of particular\ninterest, as they can provide\nimmediate access to the ICS networks\nbypassing enterprise security controls. **2019** **2020**\n\n###### Vulnerabilities Deep Within\n Most vulnerabilities resided deep within the\n ICS Networks ICS network, meaning they apply to equipment\n\non Levels 0 to 3 of the Purdue Model.[12] This\nincludes engineering workstations, PLCs,\n\n###### 2019\n\nsensors, and industrial controllers. These\n\n###### 2020 vulnerabilities require access to a control\n\nsystem network to exploit, offering some\nmitigation for organizations provided they\nimplement proper network segmentation.\nWith the increasing connectivity in\norganizations, this security control is\ndiminishing in value and should be enhanced\nwith efforts such as network monitoring, and\nwhere possible, Multi-Factor Authentication\n(MFA) for remote sessions.\n\n**12** https://en.wikipedia.org/wiki/Purdue_Enterprise_Reference_Architecture\n\n\n-----\n\n###### Impact of Disclosed Flaws\n\n 5% square 2019\n Loss of View Only\n square 2020\n 1%\n\n 2%\n Loss of Control Only\n 1%\n\n 50% Both Loss of View\n\n and Loss of Control\n 36%\n\n 43% Neither Loss of View\n\n nor Loss of Control\n 62%\n\n The percentage of disclosed flaws that could be used to cause a loss of view and loss of control in ICS systems decreased significantly from 50 percent in 2019 to 36 percent in 2020. This decrease is likely attributed to the increase in identified vulnerabilities bordering the enterprise that do not have direct operational impacts.\n\n\n-----\n\n###### 2020 Vulnerability Severity\n\n In addition to validating the CVSS, Dragos categorizes vulnerabilities based on severity. The following taxonomy is used:\n\n Immediate Action A far-reaching threat or vulnerability calling for action broadly across at least one industry.\n\n Limited Threat A limited threat, risk, or vulnerability requiring an applicability assessment before taking action.\n\n Possible Threat Threat scenarios, research, and vulnerabilities relating to operations but not requiring direct/immediate action.\n\n No Action Required Items of interest but likely requiring no action except in unique threat models.\n\n Hype A story or vulnerability receiving coverage but not yet worth the attention of operators.\n\n\n-----\n\nIn examining individual vulnerabilities, Dragos also categorizes them based on the\n**“Now, Next, Never” system, a malleable framework developed by CERT/Coordination**\nCenter (CC) to help asset owners and operators identify vulnerabilities and prioritize\npatching. The framework is not a one-size-fits-all solution for patch management.\nWhen combined with consequence-driven threat modeling, it can help OT security\npractitioners determine when and if to fix flaws in industrial control equipment.\n\n\nThe “Now” flaws require immediate action.\nThese flaws include critical vulnerabilities such\nas perimeter-facing and network exploitable\nvulnerabilities, and other vulnerabilities that should\nbe addressed as soon as practicable.\n\nLimited Threat vulnerabilities fall into the “Next”\ncategory. These might be network exploitable but are\npresent deeper in the network and require more work,\naccess, and knowledge for an adversary to exploit\nor impact OT processes. If an operations network\ndoes not have proper segmentation or is accessible\nfrom the internet, asset owners and operators should\nconsider the “Next” vulnerabilities a greater risk. In\nmost cases, these vulnerabilities can be mitigated\nsimply by updating firewall rules. It is important that\ncustomers conduct a firewall rule audit on a regular\nbasis and justify every allow rule. In 2020, close to\ntwo-thirds of vulnerabilities assessed by Dragos were\nconsidered “Next,” a Limited Threat.\n\nLow vulnerabilities pose a possible threat but rarely\nrequire action in vulnerability prioritization. They\ncan be considered “Never” vulnerabilities. It is\nmore beneficial for an organization to monitor its\nenvironment for signs of exploitation rather than\nto take devices and services offline to patch, or\ntake appropriate mitigation measures. Although\nconsidered “Never” vulnerabilities, Dragos analysts\ndo not recommend ignoring them entirely if time\nand resources permit. The reality is patching in\nICS is more difficult than in most enterprise IT\nnetworks, and the value presented from patching\nthese vulnerabilities is minimal. Asset owners\nand operators should conduct risk assessments to\ndetermine if it is safe to continue operations without\naddressing the identified vulnerabilities.\n\n\n###### 7%\n\n 58%\n\n 35%\n\n\n###### 7%\n\n 63%\n\n 30%\n\n 2019 2020\n\n\nsquare Now – Immediate Action\nsquare Next – Limited Threat\nsquare Never – Possible Threat/No Action\n\n\n-----\n\n###### Actionable Guidance Missing in Most 2020 Advisories\n\n An increase in the reported number of ICS vulnerabilities overall coincided with an increase in vendors providing patches alongside publicly disclosed flaws. Twenty- two percent of advisories did not have a patch when announced, down from 26 percent year-over-year. Of those, more than two-thirds did not contain practical mitigation advice.\n\n Frequently, vendors will not provide advice to asset owners and operators if they are unable to patch the identified vulnerability. Dragos identified 61 percent of advisories contained a patch to fix the vulnerability, but no alternative mitigation if patching was not an option.\n\n\n###### Advisories with\n no Patch when\n Announced\n\n\n###### Advisories with\n no Patch when\n Announced\n\n\n###### 26% 22%\n OF THOSE\n OF THOSE\n Advisories that\n Advisories that\n had no Practical\n had no Practical\n\n 2019 2020\n Mitigation Advice Mitigation Advice 76% 64%\n 74% 78%\n\n#### 26+74+ OF THOSE\n 22+78+ OF THOSE\n\n###### had a patch had a patch\n Advisories that\n Advisories that\n had no Alternate\n had no Alternate\n Mitigation Mitigation 55% 61%\n\n|26+74+B 6%|Col2|\n|---|---|\n|+74+6 %||\n|||\n|||\n\n|22+78+B 2%|Col2|\n|---|---|\n|+78+2 2%||\n|||\n|||\n\n\n###### 26%\n\n 2019\n\n\n-----\n\n###### Dragos provides customers with insight into managing risks about disclosed ICS vulnerabilities beyond\n what is included in advisories by the vendor. In 2020, Dragos provided\n additional mitigation advice for\n 78 percent of advisories that did\n\n not provide this information.\n\n Mitigation Advice: Advisories Without Mitigation Advice\n\n for which Dragos Provided a Mitigation\n\n 80%\n\n 70%\n 78%\n 77%\n 2020\n 2019\n 60%\n\n 50%\n\n 40%\n\n 30%\n\n 20%\n\n 10%\n\n\n-----\n\n###### Severity Ratings of Vulnerabilities Remain Error-Prone\n\n In addition to a lack of actionable information from most ICS-related vulnerability advisories in 2020, many advisories and individual vulnerabilities contained errors that could inadvertently mislead practitioners who use CVSS scores to triage for mitigation or patching.\n\n\n###### By Advisory Advisories with Incorrect Data\n\n\n###### 43%\n 2020\n\n\n###### By CVE (Error Rate) Individual CVEs Contained Errors\n\n\n###### 30%\n 2019\n\n\n###### 33%\n 2020\n\n\n###### 19%\n 2019\n\n\n###### The Dragos assessment of 2020 ICS-related vulnerabilities shows that among advisories and vulnerabilities containing errors, most of them understated severity levels. Seventy-three percent of corrected advisories were more severe in the context of an operational environment than the public advisory indicated.\n\n\n-----\n\n###### By Advisory (Error Rate) — Rate was consistent from 2019 to 2020\n\n Dragos Found to be Dragos Found to be LESS Severe than\n MORE Severe than Public Advisory Public Advisory 26% 73%\n\n 1% Identical Score\n but Different\n Exploitation Vector\n\n# [7]By CVE [+][1][+][26+][3]\n\n###### CVE where Corrected Severity Score was\n HIGHER than Reported\n\n 9% 24%\n\n CVE where Corrected\n\n Severity Score was LOWER than Reported\n\n\n-----\n\n###### Flaws in TCP/IP Stacks\n\nResearchers identified several third-party vulnerabilities in the software\nsupply chain that impacted ICS systems. Most notable were Ripple20\nand Amnesia:33, commercial names for vulnerabilities in third-party\nInternet Protocol (IP) stacks. These third-party stacks are used in many\nembedded products, including some used in industrial products and\nindustrial-supporting Information Technology (IT) systems. Example ICS\ndevices impacted include PLCs, Serial to Ethernet Converters, Protocol\nConverters, Remote Terminal Units (RTUs), digital protective relays, and\nsome managed network switches and routers.\n\nMass exploitation of these vulnerabilities, like the similar URGENT/11\nvulnerabilities reported in 2019, is rare. No organizations have provided\nevidence of public exploitation.\n\nDevices that use third-party protocol stacks are often deeply embedded\nsystems. Exploitation requires understanding the Central Processing\nUnit (CPU) architecture, memory layout, and hardware connections\nof the vulnerable device. Developing a working exploit requires a deep\nunderstanding of embedded systems. Once an exploit is developed, it\nmay not even function on the same product if, for example, the product\nundergoes a hardware revision.\n\nFundamentally, these vulnerabilities are not a high risk for the industrial\nsector. In the industrial space, embedded systems are still most often\n“insecure by design,” or lacking some security protections. An example of\nthis is the APC Uninterruptible Power Supply (UPS) susceptibility to the\nRipple20 vulnerabilities. The researchers of the vulnerabilities developed\na working exploit for CVE-2020-11901 against the UPS, which could result\nin shutting off the UPS. However, the UPS speaks an industrial protocol\ncalled BACnet that lacks basic security protections. According to the\ndevice instruction manual, and verified by Dragos, a BACnet control\npoint can be used to achieve the same effect using freely available tools.\n\n\n-----\n\n###### Vulnerabilities\n in VPN\n Appliances\n Facilitating\n Remote Work\n\n\nSeveral VPN appliance vulnerabilities were disclosed and fixed in 2020. These include\nissues in non-industrial appliances that Dragos tracks and models that are specifically\nmarketed toward industrial customers. In 2020, Dragos tracked 13 advisories that\ninclude VPN software and hardware commonly used in industrial environments and\ngateways with optional VPN features. Impacted devices include Palo Alto Networks\nGlobal Protect VPN client, Citrix Application Delivery Controller and Netscaler, and ICSspecific VPN services Ewon, Cosy, and Flexy.\n\nEnterprise VPN appliances are often used by industrial operators to provide remote\naccess to corporate and operations networks. Some OEMs provide VPN access\nspecifically for their ICS equipment, restricting connections or lateral movement to the\nrest of the OT network. Many of these products are identified as belonging to utilities\nvia the popular search engine Shodan. Vulnerabilities in these products should be\nremediated quickly.\n\nEnd users should determine the exposure of VPN appliances. Industrial-specific VPN\nappliances may provide direct access to process control systems. These devices are best\nsecured by using them in “client” mode where they may connect to a central server. The\ncentral server may be hardened to prevent site-to-site communications between field\nsites, and to monitor for suspicious behavior originating from field sites.\n\n\n-----\n\n###### SECTION THREE\n\n Lessons Learned\n From The\n Front\n Lines\n\n\n-----\n\n###### INTRODUCTION\n\n For the last two decades, the prevailing strategies for safeguarding ICS were focused on protecting the perimeter, preventative security countermeasures, and internal segmentation. In that time, standards, regulations, and best practices codified these methods. Other focuses, such as detection, response, and recovery were included but without equal emphasis or examples. The disparity has left industrial organizations underdeveloped in these core capabilities in an understandable, yet undesirable, situation. In general, the industry lacks visibility into their ICS assets and activities, hampering the overall cyber readiness and ability to understand and manage cyber risk. These themes are confirmed based upon analysis of Dragos service engagements in 2020.\n\n The data set includes engagements from many industrial infrastructure sectors including electric, oil and gas, food and agriculture, manufacturing, chemical, transportation, water and wastewater, technology (data center building automation equipment), and mining. \n\n\nTHE FOLLOWING DATA IS BASED ON A\nGROWING SET OF ANNUAL ENGAGEMENTS\nCONDUCTED BY THE DRAGOS TEAM OF\nICS CYBERSECURITY EXPERTS ON SEVERAL\nSERVICE TYPES, INCLUDING:\n\n    - ARCHITECTURAL REVIEWS\n\n    - VULNERABILITY ASSESSMENTS\n\n    - PENETRATION TESTS\n\n    - TABLE TOP EXERCISES\n\n    - INCIDENT RESPONSE (IR)\n\n\n-----\n\n###### Visibility\n\n Over the course of the year, Dragos found that 90 percent of its services customers had limited to no visibility into their ICS environments. While most clients demonstrated a focus on an enhanced asset inventory, this effort is only the foundation for asset visibility. Many customers only monitored the IT to OT boundary without monitoring activity inside the ICS network. Network analysts were blind to critical network traffic. Some collected logs, but few utilized centralized logging to correlate various segments with network traffic analysis. These steps are critical for developing a full picture of what occurred across industrial assets and sites.\n\n Extremely Limited / No Visibility into OT Environment\n\n 100%\n\n 90%\n 90% 80%\n 2020\n 81%\n 70%\n 2019\n 60%\n\n 50%\n\n 40%\n\n 30%\n\n 20%\n\n 10%\n\n\n-----\n\n###### Compared to the Dragos 2019 Year in Review report, 90 percent represents a small increase in this statistic. Note that this is not indicative of the same customers failing to improve year-over-year. Lack of visibility, a common finding in architecture reviews, is skewed heavily towards new customers. Architecture reviews conducted with repeat customers are typically not for the same facility either. While not a perfect comparison, the statistic indicates the state of cybersecurity for those customers early in their OT cyber maturity. \n\n Dragos’s incident response cases for 2020 provide further support for this lack of visibility because none of them were augmented with any centralized or automated host and network traffic logging. This significantly slows down the incident response process, and in multiple cases, means that the asset owner or operator is not able to get critical questions answered. In at least one case, the impact led to public reporting without an understanding of root cause analysis where cyber activity was heavily suspected, but no evidence was available.\n\n IR Cases Facilitated by Automated Logging or Visibility into ICS Network\n\n 2019 2020\n\n\n-----\n\n###### Segmentation and Connections\n\n Although asset owners and operators follow many of the best practices and their applicable regulation, Dragos continues to observe instances of poor segmentation with unexpected or unknown connections from the ICS network. About 88 percent of Dragos services engagements involved significant issues with network segmentation. Examples of observations contributing to this statistic include flat networks, where the only segmentation is the initial firewall between the IT-OT boundary, and unnecessary communication pathways to critical assets within the network. To further illustrate the incidence of poor segmentation, consider that adversaries accessed ICS networks directly from the internet in 100 percent of Dragos’s 2020 incident response cases. These findings are directly related to the previous statistic of 90 percent of organizations that lacked OT visibility. Identifying architecture bypasses and rogue connections and devices is nearly impossible without visibility through network monitoring.\n\n\n###### Engagements Exhibiting Poor Security Perimeters\n\n 71%\n\n 2019\n\n## 71+29+\n\n###### 88%\n\n 2020\n\n## 88+12+\n\n\n-----\n\n###### While the annual comparison shows a 17-point increase in engagements exhibiting poor security perimeters, Dragos does not believe the industry is regressing on this security principle. Dragos attributes the growth to a rise in the number of engagements conducted. However, this statistic does support the assertion that cyber strategies focused on segmentation and prevention are not sufficient.\n\n Adversary usage of shared credentials exacerbates the severity of poor security perimeters. Just over half of service engagements found shared credentials between IT and OT networks. For example, an organization may leverage the same credential management on the IT network as it does on the Demilitarized Zone (DMZ) and ICS network. This is another configuration that leads to a weakening of perimeters and may enable an adversary to easily traverse to ICS assets using credentials obtained from IT accounts. For example, 100 percent of incident response cases that confirmed adversary activity involved the adversary leveraging shared credentials for lateral movement. During one case, Dragos analysts responded to an Activity Group that harvested credentials from an IT asset, and then leveraged a vulnerability in a VPN appliance to gain initial access to the ICS environment. In this case, the adversary also used the compromised credentials to move laterally in the ICS network and access the critical assets.\n\n\n###### Organizations that Lacked Separate IT and OT User Management\n\n\n###### 54% 54%\n 2019 2020\n\n\n-----\n\n###### External Routable Network Connection to\n ICS Environments Believed to be Air-Gapped\n\n 100% 2019\n\n\n###### 100%\n\n 90%\n\n 80%\n\n 70%\n\n 60%\n\n 50%\n\n 40%\n\n 30%\n\n 20%\n\n 10%\n\n\n###### A recurring theme from the previous Year in Review reports is the disconnect between expectations and reality about air-gapped systems. There was significant improvement in 2020 in this area, with a two-thirds drop in the discovery of external routable network connections to air-gapped ICS environments. During one engagement, a client who believed their network to be air- gapped had two external connections bypassing their architecture and terminating deep within their gas transmission systems.  The purpose of the connections was to monitor gas quality and heating values, and ensure exported product met demand and quality specifications. Problematically, communications took place directly between critical controllers used for the industrial process and PLCs used only for data exchange with the remote connection. This connection could have been leveraged by an adversary to gain initial access to the network and move laterally across Level 1 systems within the Purdue model. Some systems in Level 1 had communication pathways through network allowlists to Safety Instrumented Systems (SIS) in the Safety Zone. Access to the Safety Zone may be the goal of an adversary who intends to cause a loss of safety impact, such as XENOTIME.\n\n\n-----\n\n###### Shared credentials and poor security perimeters allow adversaries to leverage Valid Accounts and gain persistent access to remote ICS. Valid Accounts is the most common TTP used across all Dragos ICS Activity Groups. Analysis of 2020 Dragos incident response cases indicates its effectiveness.\n\n\n###### IR Cases where Adversary Accessed ICS Network from Internet\n\n\n###### IR Cases Involving Shared Credentials for Lateral Movement\n\n\n###### 2019\n\n 2020\n\n\n###### 66%\n\n\n###### 100%\n\n\n###### 2019\n\n 2020\n\n\n###### 90%\n\n\n###### 100%\n\n\n-----\n\n###### Cyber Readiness\n\n In 2020, Dragos conducted several tabletop Organizations that did not have exercises and incident response readiness clear cyber incident thresholds workshops. The findings and outcomes of these engagements further illustrate the industry’s deep-seated, over-reliance on prevention and •••••••••• the necessity of strengthening the pillars of •••••••••• a successful ICS cyber strategy; detection, •••••••••• response, and recovery. ••••••••••\n\n ••••••••••\n ••••••••••\n Dragos observed that 75 percent of clients did\n\n ••••••••••\n not have clearly defined incident declaration\n\n ••••• •••••\n thresholds or categories of severity within\n\n ••••••••••\n response plans. Detecting threat behaviors and\n\n ••••••••••\n analyzing correlated datasets are generally the\n 75%\n first steps an organization takes to recognize an incident. The threshold for declaring an incident depends on many factors including threats, tactics, operational risk requirements, governing laws, and industry regulations. Once incidents were declared, incident managers were often observed by Dragos to have no documented guidance or playbook for how to employ resources or capabilities. Nearly 60 percent of organizations did not Organizations that had have a solidified Incident Response Plan (IRP). a Solidified Incident managers were often left to create\n IRP Ready 58%\n tactical response plans in real-time and in the\n to Test 2020\n middle of rapid escalations. In 2020, Dragos observed that 75 percent of 2020 clients did not have clearly defined or documented incident 33%\n 2019\n declaration thresholds or categories of severity available during activation of their incident response plans.\n\n\n-----\n\n###### In 2020, 62 percent of Dragos client organizations Organizations did not tie a dedicated communications plan to that did not have their cybersecurity incident response activations. Communications This is a continuance of an industry trend from Plans Linked to IRP 2019. Communication plans are critical in enabling\n Activations\n incident managers and stakeholders to quickly activate, assemble, and employ resources and\n\n ••••••••••\n capabilities. During an incident, the need to react\n\n ••••••••••\n appropriately is immediate, followed by the need\n\n ••••••••••\n to communicate. Lack of effective communication\n\n ••••••••••\n during a crisis can lead to inadequate resource\n\n ••••••••••\n allocation, compound risks to assets and\n\n ••••••••••\n personnel, and create lingering effects on bottom- •• •••••••• line operations. The periodic testing of IRPs can •••••••••• act as a roadmap for corporate leadership to •••••••••• convey strategic directives and objectives to an incident response team. 100 percent of Dragos ••••••••••62% exercise participants strongly agree that exercises are beneficial to long-term incident response preparation and are a valuable way to identify areas\n Organizations that had\n of improvement for industrial cybersecurity IRPs.\n Difficulty Understanding\n when to Declare an\n Incident\n 83%\n Dragos 2019 75%\n 2020\n customers\n who Agree Tabletop Exercises are Beneficial to IRPs\n\n\n-----\n\n###### Dragos Red Team\n\nIn penetration tests, Dragos focuses on\ndemonstrating adversary behavior that\ncould have physical impacts on industrial\nprocesses. The team utilizes Crown Jewel\nAnalysis to identify high consequence\nevents, the assets that can cause them,\nand pathways to those assets specific\nto the client and the process.[13] The team\noften deploys the same TTPs of specific\nICS Activity Groups to provide real-world\napplicability.\n\n\n-----\n\n|Col1|Col2|\n|---|---|\n|||\n|||\n|||\n\n\n###### Recommendations\n\nAs organizations strategize a path forward, Dragos recommends five key OT cybersecurity\ninitiatives to improve on in 2021 and beyond. These are based on the empirical evidence provided\nthroughout the report.\n\nDragos has included a graphic below each recommendation as a reference for asset owners\nlooking to implement the top five the recommendations of 2020. The recommendations listed\non the right are in descending order according to priority. Each recommendation has three or\nmore actions that may help asset owners achieve the desired goal of the recommendation. These\nactions are numbered with the positive impact on that recommendation.\n\nThe top five recommendations to enhance the security of an ICS environment are:\n\n###### Increase OT Network Visibility\n\n Visibility includes network monitoring, logging, and\n\n### 1\n\n###### maintaining a Collection Management Framework (CMF).\n\n Logging and monitoring of OT systems is essential for detection and incident response in addition to providing actionable data regarding device performance, operation, and reliability. Network traffic analysis should be prioritized based on the considerations of the networks and their risks.\n\n**NETWORK** **ASSET**\n**MONITORING** **INVENTORY**\n\n1 2\n###### HELP ACHIEVE\n\n**HOST/NETWORK** **COLLECTION** **INCREASE OT**\n\n**TRAFFIC LOG** **MANAGEMENT** **VISIBILITY**\n**AGGREGATION** **FRAMEWORK**\n\n3 4\n\n\n-----\n\n###### Identify and Prioritize Crown Jewels\n\n### 2\n\n###### Crown Jewels are those assets that exercise control over the components most critical to the safe operation of the industrial process. Examples include HMIs, engineering and operator workstations, gateways, and controllers.\n\n Prioritizing the assets that, if compromised, could cause major impacts to the organization is key principle of risk management.\n\n Example: At one facility, Instrumentation and Control (I&C) staff could connect into the production network using a VPN. Once connected, they utilized RDP to access their engineering laptop. Their laptops had read/write permissions to any PLC in the Production Network, including the crown jewel PLCs. Additionally, control staff left PLC Run/Remote/Program key switches in remote mode meaning anyone with network access could edit PLC configurations and logic. Lastly, they did not have a mechanism to proactively detect changes to these PLC configurations. In summary, a compromised I&C technician account could modify PLC configurations and operations would not detect it, until an operational issue or periodic maintenance occurred.\n\n**ASSET** **NETWORK** **TABLETOP**\n**INVENTORY** **MONITORING** **EXERCISES**\n\n1 2 3\n\n**COLLECTION** **IDENTIFY AND**\n\n**RED/PURPLE** **SEPARATE AD**\n\n**MANAGEMENT** **PRIORITIZE CROWN**\n\n**TEAM** **INFRASTRUCTURE**\n\n**FRAMEWORK** **JEWELS**\n\n4 5 6\n\n\n-----\n\n|Col1|Col2|\n|---|---|\n|||\n\n|Col1|Col2|\n|---|---|\n|||\n|||\n\n\n###### Boost Incident Response Capabilities\n\n### 3 Incident response refers to an organization’s\n\n###### approach for handling cybersecurity incidents.\n\n An incident response capability is necessary to minimize loss and restore safe operations. Many organizations have an enterprise IT incident response plan that does not account for, or significantly misunderstands, ICS incident response efforts.\n\n**COLLECTION**\n\n**ASSET**\n\n**MANAGEMENT**\n\n**INVENTORY**\n\n**FRAMEWORK**\n\n1 2\n###### HELP ACHIEVE\n\n**HOST/NETWORK**\n\n**TABLETOP**\n\n**TRAFFIC LOG** **BOOST IR**\n\n**EXERCISES**\n\n**AGGREGATION** **CAPABILITIES**\n\n3 4\n\n\n-----\n\n|4|Col2|\n|---|---|\n|||\n\n\n###### Validate Network Segmentation\n\n### 4 This includes issues like weak segmentation\n\n###### between IT and OT networks, permissive firewall rulesets, and externally routable network connections.\n\n Network segmentation should be continuously monitored to ensure it is not bypassed or negated.\n\n Example: A client believed their SIS devices were properly segmented. An external connection was found that could have allowed an adversary to bypass multiple network boundary devices with only a Virtual Local Area Network (VLAN) between the connection and the Safety Zone.\n\n**NETWORK** **RED/PURPLE** **ASSET**\n**MONITORING** **TEAM** **INVENTORY**\n\n1 2 3\n\n**HOST/NETWORK**\n\n**SEPARATE AD**\n\n**TRAFFIC LOG** **VALIDATE NETWORK**\n\n**INFRASTRUCTURE**\n\n**AGGREGATION** **SEGMENTATION**\n\n4 5\n\n\n-----\n\n###### Secure Credential Management\n\n### 5 This includes accounts shared between IT and\n\n###### OT, default accounts, and vendor accounts. AD shared between the enterprise and ICS networks is one of the most common findings that should be mitigated.\n\n Adversaries seek to compromise and leverage valid accounts as a means to access critical industrial systems.\n\n During one assessment, Dragos obtained root access to the affected entities by successfully identifying the root password for all the impacted systems related to the client’s HMI. This was accomplished through guessing and using common default passwords.\n\n**ASSET** **SEPARATE AD**\n**INVENTORY** **INFRASTRUCTURE**\n\n1 2\n###### HELP ACHIEVE\n\n**RED/PURPLE** **SECURE**\n\n**TEAM** **CREDENTIAL**\n\n**MANAGEMENT**\n\n3\n\n\n-----\n\n###### Dragos is an industrial (OT/ICS/IIoT) cybersecurity company on a mission to safeguard civilization.\n Dragos is privately held and headquartered in the Washington, D.C. area with regional presence around the world, including Canada, Australia, New Zealand, Europe, and the Middle East.\n\n Dragos.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://hub.dragos.com/hubfs/Year-in-Review/Dragos_2020_ICS_Cybersecurity_Year_In_Review.pdf?hsCtaTracking=159c0fc3-92d8-425d-aeb8-12824f2297e8%7Cf163726d-579b-4996-9a04-44e5a124d770"
    ],
    "report_names": [
        "Dragos_2020_ICS_Cybersecurity_Year_In_Review.pdf?hsCtaTracking=159c0fc3-92d8-425d-aeb8-12824f2297e8%7Cf163726d-579b-4996-9a04-44e5a124d770"
    ],
    "threat_actors": [
        {
            "id": "5fb9f77b-1273-4658-884e-49f5f511dcd7",
            "created_at": "2022-10-25T15:50:23.591795Z",
            "updated_at": "2025-03-27T02:00:55.503775Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "TEMP.Veles",
                "XENOTIME"
            ],
            "source_name": "MITRE:TEMP.Veles",
            "tools": [
                "Mimikatz",
                "PsExec",
                "TRITON"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "20012494-3f05-48ce-8c0f-92455e46a4f9",
            "created_at": "2022-10-25T16:07:24.319939Z",
            "updated_at": "2025-03-27T02:02:10.169843Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "ATK 91",
                "Xenotime"
            ],
            "source_name": "ETDA:TEMP.Veles",
            "tools": [
                "Cryptcat",
                "HatMan",
                "Mimikatz",
                "NetExec",
                "PsExec",
                "SecHack",
                "TRISIS",
                "TRITON",
                "Trisis",
                "Triton",
                "Wii"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a9bca241-5f6f-4a30-8184-c16da1a23c55",
            "created_at": "2022-10-25T16:07:24.38908Z",
            "updated_at": "2025-03-27T02:02:10.205625Z",
            "deleted_at": null,
            "main_name": "Wassonite",
            "aliases": [],
            "source_name": "ETDA:Wassonite",
            "tools": [
                "Dtrack",
                "Mimikatz",
                "Preft",
                "TroyRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90615eb1-13f5-49e8-b8f5-d0df9b8bd946",
            "created_at": "2024-12-25T02:00:03.652379Z",
            "updated_at": "2025-03-27T02:00:03.475994Z",
            "deleted_at": null,
            "main_name": "Wassonite",
            "aliases": [],
            "source_name": "MISPGALAXY:Wassonite",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d070e12b-e1ce-4d8d-b5e3-bc71960cc0cb",
            "created_at": "2022-10-25T15:50:23.676504Z",
            "updated_at": "2025-03-27T02:00:55.521901Z",
            "deleted_at": null,
            "main_name": "Fox Kitten",
            "aliases": [
                "Fox Kitten",
                "UNC757",
                "Parisite",
                "Pioneer Kitten",
                "RUBIDIUM",
                "Lemon Sandstorm"
            ],
            "source_name": "MITRE:Fox Kitten",
            "tools": [
                "China Chopper",
                "Pay2Key",
                "ngrok",
                "PsExec",
                "Ngrok"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c348851-5036-406b-b2d1-1ca47cfc7523",
            "created_at": "2022-10-25T16:07:24.039861Z",
            "updated_at": "2025-03-27T02:02:10.08844Z",
            "deleted_at": null,
            "main_name": "Parisite",
            "aliases": [
                "Cobalt Foxglove",
                "Fox Kitten",
                "Lemon Sandstorm",
                "Parisite",
                "Pioneer Kitten",
                "Rubidium",
                "UNC757"
            ],
            "source_name": "ETDA:Parisite",
            "tools": [
                "Cobalt",
                "FRP",
                "Fast Reverse Proxy",
                "Invoke the Hash",
                "JuicyPotato",
                "Ngrok",
                "POWSSHNET",
                "Pay2Key",
                "Plink",
                "Port.exe",
                "PuTTY Link",
                "SSHMinion",
                "STSRCheck",
                "Serveo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a792743d-78a4-40c9-9d9a-a12c52880297",
            "created_at": "2023-01-06T13:46:38.75457Z",
            "updated_at": "2025-03-27T02:00:02.909884Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "Palmetto Fusion",
                "Allanite"
            ],
            "source_name": "MISPGALAXY:ALLANITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "871acc40-6cbf-4c81-8b40-7f783616afbc",
            "created_at": "2023-01-06T13:46:39.156237Z",
            "updated_at": "2025-03-27T02:00:03.010146Z",
            "deleted_at": null,
            "main_name": "Fox Kitten",
            "aliases": [
                "PIONEER KITTEN",
                "PARISITE",
                "UNC757",
                "Lemon Sandstorm",
                "RUBIDIUM"
            ],
            "source_name": "MISPGALAXY:Fox Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b9f25498-8035-483c-871e-01cd45e7317f",
            "created_at": "2024-05-01T02:03:08.020262Z",
            "updated_at": "2025-03-27T02:05:17.309453Z",
            "deleted_at": null,
            "main_name": "COBALT FOXGLOVE",
            "aliases": [
                "Lemon Sandstorm ",
                "Parisite ",
                "Pioneer Kitten ",
                "RUBIDIUM ",
                "UNC757 ",
                "Fox Kitten "
            ],
            "source_name": "Secureworks:COBALT FOXGLOVE",
            "tools": [
                " FRP (Fast Reverse Proxy)",
                " Mimikatz",
                " Ngrok",
                " POWSSHNET",
                " STSRCheck",
                " Servo",
                " n3tw0rm ransomware",
                " pay2key ransomware",
                "Chisel"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "25896473-161f-411f-b76a-f11bb26c96bd",
            "created_at": "2023-01-06T13:46:38.75749Z",
            "updated_at": "2025-03-27T02:00:02.910627Z",
            "deleted_at": null,
            "main_name": "CHRYSENE",
            "aliases": [
                "Greenbug"
            ],
            "source_name": "MISPGALAXY:CHRYSENE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0f09b73e-caa9-40e6-bd0b-c13503e4e94c",
            "created_at": "2023-01-06T13:46:39.001286Z",
            "updated_at": "2025-03-27T02:00:02.974113Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "Xenotime",
                "G0088",
                "ATK91"
            ],
            "source_name": "MISPGALAXY:TEMP.Veles",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0a0132a3-526d-4698-be49-5e75530c1417",
            "created_at": "2022-10-25T15:50:23.856139Z",
            "updated_at": "2025-03-27T02:00:55.559398Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "ALLANITE",
                "Palmetto Fusion"
            ],
            "source_name": "MITRE:ALLANITE",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1c4281e9-0a4c-4f20-94a2-25ed3661cc98",
            "created_at": "2022-10-25T16:07:23.301826Z",
            "updated_at": "2025-03-27T02:02:09.72625Z",
            "deleted_at": null,
            "main_name": "Allanite",
            "aliases": [
                "Palmetto Fusion"
            ],
            "source_name": "ETDA:Allanite",
            "tools": [
                "PsExec",
                "SecreetsDump",
                "THC Hydra"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1619656766,
    "ts_modification_date": 1619691349,
    "files": {
        "pdf": "https://archive.orkl.eu/1adf1cbaa570e63899d7a99468522b2b05e5ab7f.pdf",
        "text": "https://archive.orkl.eu/1adf1cbaa570e63899d7a99468522b2b05e5ab7f.txt",
        "img": "https://archive.orkl.eu/1adf1cbaa570e63899d7a99468522b2b05e5ab7f.jpg"
    }
}