{
    "id": "4d113125-9738-4098-aedb-df29a27f15d6",
    "created_at": "2023-04-05T02:08:23.963185Z",
    "updated_at": "2025-03-27T02:05:31.039762Z",
    "deleted_at": null,
    "sha1_hash": "17d82334ba1f4e5c1eb06b7eadaf417cadddcf66",
    "title": "2023-03-08 - GlobeImposter Ransomware Being Distributed with MedusaLocker via RDP",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:19Z",
    "file_modification_date": "2023-04-03T08:31:19Z",
    "file_size": 1886673,
    "plain_text": "# GlobeImposter Ransomware Being Distributed with MedusaLocker via RDP\n\n**asec.ahnlab.com/en/48940/**\n\nBy Sanseo March 8, 2023\n\nASEC (AhnLab Security Emergency response Center) has recently discovered the active distribution of the\nGlobeImposter ransomware. This attack is being carried out by the threat actors behind MedusaLocker. While\nthe specific route could not be ascertained, it is assumed that the ransomware is being distributed through\nRDP due to the various pieces of evidence gathered from the infection logs.\n\nThe threat actor installed various tools alongside GlobeImposter, such as Port Scanner and Mimikatz. Once\ninstalled, if these tools are able to confirm that they are within a company’s internal network, it is assumed that\nthey will then target that network.\n\n## 1. Ransomware Installed Using RDP\n\nThreat actors who use RDP (Remote Desktop Protocol) as an attack vector generally scan for systems where\nRDP is active and allows external access. Systems found during this scanning process are subject to brute\nforce or dictionary attacks. If a user has inappropriate account credentials, then threat actors can easily take\nthose very credentials.\n\nThreat actors can use the obtained account credentials to log in to the system through RDP, allowing them to\ngain control over the system in question and perform a variety of malicious actions. The threat actors who\ninstall GlobeImposter are also assumed to be using RDP as their attack vector. More details about each case\nwill be covered further in this post, but the bases are as follows.\n\nA. Malware created through the explorer process (explorer.exe)\n\nB. RDP-related settings and logs deleted\n\nC Connection with the MedusaLocker ransomware threat actor who uses RDP as their attack vector\n\n\n-----\n\nThe threat actor usually creates a folder named skynet work in the Music folder before installing malware in\nthis directory. This ransomware attack has been steadily ongoing since last year, and the fact that the same\npath is still being used to this day is a characteristic. The following is the log from an attack case by the same\nthreat actor in the past. Through this, we can see that the explorer process, explorer.exe, is creating the\nmalware. As this behavior is often seen when malware is installed on systems through RDP, it serves as\nreasonable grounds to believe that RDP was used as an attack vector.\n\nFigure 1. Malware installation log\nThere are also other connections that tie this with the MedusaLocker threat actor. Recently, the United States\nDepartment of Health and Human Services released a report about how the MedusaLocker ransomware threat\n[actors have been using RPD to infect systems with ransomware. [1] The MedusaLocker threat group has been](https://www.hhs.gov/sites/default/files/medusalocker-ransomware-analyst-note.pdf)\nusing RDP as their attack vector, and relevant information was also released by the United States’\n[Cybersecurity and Infrastructure Security Agency (CISA). [2]](https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-181a)\n\nA noteworthy thing to point out is that the email and onion addresses found in the ransom note from the\nrecently active GlobeImposter ransomware are included in the list of addresses used by the MedusaLocker\ngroup which was released by CISA.\n\n\n-----\n\nFigure 2. Email addresses used in the ransom note\nAdditionally, the team also discovered during their investigation of multiple logs that some ransomware attack\ncases used both GlobeImposter and MedusaLocker. Therefore, it can be inferred that the MedusaLocker group\nis using RDP as their main attack vector and are targeting inappropriately managed systems. Adding to this,\nthey have also been using GlobeImposter instead of MedusaLocker in recent attacks.\n\n## 2. Malware Used in the Attack Process\n\nAs seen in Figure 1, the threat actor installs various pieces of malware in the infected system. Most of the\ninstalled m are scanners and account credential stealing tools. It can be assumed through this that the network\nof the infected system can also be targeted.\n\nadvanced_port_scanner.exe, advanced_port_scanner_2.5.3869.exe: Port scanners\nFiles inside the “kamikadze new” folder: Mimikatz\nnetpass (1).exe: Network password recovery tool made by NirSoft\nnetworkshare_pre2.exe: Shared folder scanner\n\nAfter the threat actor takes over the system via RDP, the above tools are used to scan the network to check if\nthe infected system is a part of a specific network. If the system is part of a specific network, then the\nransomware can perform internal reconnaissance and lateral movement in order to also encrypt the other\nsystems on the network.\n\nThe following is a log from AhnLab’s ASD (AhnLab Smart Defense) infrastructure of the Mimikatz command\nused by a threat actor during their attack. The sekurlsa::logonpasswords command outputs every verifiable\naccount credential currently stored on the system memory. The account credentials obtained in this domain\nenvironment can be used for lateral movement.\n\n\n-----\n\nFigure 3. Mimikatz command used in an attack\nThere are some cases where the threat actor would also install an XMRig CoinMiner alongside the\nransomware. This can be seen in Figure 1 as Miners.exe. Thus, not only do the MedusaLocker threat actors\nencrypt infected systems using their ransomware, but they also mine for coins by installing XMRig.\n\n**Mining Pool : pool.supportxmr[.]com:3333**\n**User :**\n49c2xjofxbxkydovzvfart2ekruhe6wiep55xcjaogaq1dugduyzgxphd1zx6j21nvv5emtupnfr39sulbp1ggczqwfzjmc\n**Password : x**\n\n## 3. GlobeImposter\n\nThe ols.exe file within the “skynet work” folder is the GlobeImposter ransomware. GlobeImposter is a type of\nransomware that uses the AES symmetric key algorithm for file encryption and a public/private RSA key\n[algorithm for key encryption. [3]](https://s.tencent.com/research/report/439.html)\n\n**Overview** **Description**\n\nEncryption method AES / RSA-1024\n\nExtension .onelock\n\nPaths excluded from encryption Refer to the information further below\n\nExtensions excluded from encryption Refer to the information further below\n\nRansom note how_to_back_files.html\n\nOthers Registers RunOnce key\n\nRemoves volume shadow service\n\nDeletes event logs\n\nDeletes RDP logs\n\nTable 1. GlobeImposter ransomware overview\nUpon execution, GlobeImposter creates a new public and private RSA-1024 key before using the public RSA\nkey to encrypt the AES key that was used to encrypt files. The generated private RSA key is encrypted with the\nthreat actor’s public RSA key. This key exists encrypted in binary. As shown in the figure below, the public RSA\nkey can be decrypted with the hard-coded AES key.\n\n\n-----\n\nFigure 4. Threat actor’s public RSA key decrypted with the AES algorithm\nTo maintain persistence, GlobeImposter first copies itself into the %LOCALAPPDATA% path before registering\nitself to the RunOnce key, allowing it to operate even after system reboots. A file that uses the SHA256 hash\nvalue of the threat actor’s private key as its name is created in the %PUBLIC% path. The key information is\nthen encrypted and saved here.\n\nAfterward, files within the system are encrypted. Configuration data such as the list of paths and file extensions\nexcluded from encryption are encrypted with the AES key. Additionally, the AES key used to decrypt the\nconfiguration data is the SHA256 hash value of the threat actor’s private key mentioned above. The following is\na list of the paths and file extensions excluded from encryption that was obtained during the decryption\nprocess.\n\n**Paths excluded from encryption**\n\nWindows, Microsoft, Microsoft Help, Windows App Certification Kit, Windows Defender, ESET, COMODO,\nWindows NT, Windows Kits, Windows Mail, Windows Media Player, Windows Multimedia Platform, Windows\nPhone Kits, Windows Phone Silverlight Kits, Windows Photo Viewer, Windows Portable Devices, Windows\nSidebar, WindowsPowerShell, NVIDIA Corporation, Microsoft.NET, Internet Explorer, Kaspersky Lab,\nMcAfee, Avira spytech software, sysconfig, Avast, Dr.Web, Symantec, Symantec_Client_Security, system\nvolume information, AVG, Microsoft Shared, Common Files, Outlook Express, Movie Maker, Chrome,\nMozilla, Firefox, Opera, YandexBrowser, ntldr, Wsus, ProgramData\n\n**Extensions excluded from encryption**\n\n.onelock, .dll, .sys, .exe, .rdp, .ini, .revenlock8, .revenlock9, .revenlock10, .locklock, .allock, .allock2, .allock3,\n.allock4, .allock5, .allock6, .allock7, .allock8, .allock9, .allock10, .netlock1, .allock1, .allock02, .allock03,\n.allock05, .allock06, .allock07, .allock08, .alloc\n\nWhen the file encryption is complete, the following batch file is created and executed. The batch file is\nresponsible for deleting volume shadow copies and logs. Event logs and RDP-related logs are the logs that get\ndeleted. Like this, the ransomware attack is performed through RDP. It can be assumed that the threat actor\nadded these kinds of features to the ransomware in order to erase their access history.\n\n\n-----\n\nFigure 5.\n\nBatch file that deletes volume shadow copies and logs\nThe ransom note is created in the folder where the infection occurs under the file name\n“how_to_back_files.html”. The ransom note also differs from previously known GlobeImposter ransom notes\nbut matches the MedusaLocker ransom note that was previously disclosed in the report published by Carbon\nBlack. **[[4]](https://blogs.vmware.com/security/2020/06/tau-threat-analysis-medusa-locker-ransomware.html)**\n\nFigure 6. Ransom note\n\n## 4. Conclusion\n\nThreat actors have consistently been using RDP during their initial infiltration and lateral movement processes.\nThese attacks usually occur through brute force and dictionary attacks against systems with inappropriate\naccount credentials. In particular, a large number of ransomware threat actors aside from the MedusaLocker\ngroup also use RDP as their main initial attack vector.\n\nUsers can deactivate RDP when not in use to decrease the number of attack attempts. If RDP is being used, it\nis advised to use a complex account password and to change it periodically to prevent brute force and\ndictionary attacks. Also, V3 should be updated to the latest version so that malware infection can be prevented.\n\n\n-----\n\n**File Detection**\n– Ransomware/Win.MedusaLocker.R335910 (2022.11.23.00)\n\n– Trojan/Win32.FileCoder.R228072 (2018.05.16.01)\n\n– Trojan/Win32.RL_CoinMiner.C4078402 (2020.04.25.01)\n\n– Trojan/Win32.RL_CoinMiner.C4078402 (2020.04.25.01)\n\n– Trojan/Win32.RL_Mimikatz.R366782 (2021.02.18.01)\n\n– Trojan/Win.Mimikatz.R433236 (2021.07.23.01)\n\n– Trojan/Win.Mimikatz.R434976 (2021.07.31.01)\n\n– HackTool/Win.Scanner.C5310311 (2022.11.21.03)\n\n– HackTool/Win.Scanner.C5310305 (2022.11.21.03)\n\n– Trojan/Win.Mimikatz.R433236 (2021.07.23.01)\n\n– Trojan/RL.Mimikatz.R248084 (2018.12.10.01)\n\n– Unwanted/Win32.Agent.R266440 (2019.04.23.00)\n\n– HackTool/Win.PSWTool.R345815 (2022.09.02.00)\n\n**Behavior Detection**\n\n– Persistence/MDP.AutoRun.M224\n\n– Ransom/MDP.Event.M4428\n\n**IOC**\n\n**MD5**\n\n– 715ddf490dbaf7d67780e44448e21ca1: GlobeImposter Ransomware (ols.exe)\n\n– 646698572afbbf24f50ec5681feb2db7: MedusaLocker Ransomware (olm.exe)\n\n– 70f87b7d3aedcd50c9e1c79054e026bd: XMRig CoinMiner (Miners.exe)\n\n– f627c30429d967082cdcf634aa735410: Network Password Recovery (netpass (1).exe) made by NirSoft\n\n– 597de376b1f80c06d501415dd973dcec: Shared folder scanner (networkshare_pre2.exe)\n\n– 4fdabe571b66ceec3448939bfb3ffcd1: Port scanner (advanced_port_scanner.exe)\n\n– 6a58b52b184715583cda792b56a0a1ed: Port scanner (Advanced_Port_Scanner_2.5.3869.exe)\n\n– 4edd26323a12e06568ed69e49a8595a5: Mimikatz (mimik.exe)\n\n– a03b57cc0103316e974bbb0f159f78f6: Mimikatz (mimispool.dll)\n\n– ddfad0d55be70acdfea36acf28d418b3: Mimikatz (mimilib.dll)\n\n– 21ea77788aa2649614c9ec739f1dd1b8: Mimikatz (mimikatz.dll)\n\n– 5e1a53a0178c9be598edff8c5170b91c: Mimikatz (86.exe)\n– bb8bdb3e8c92e97e2f63626bc3b254c4: Mimikatz (64.exe)\n\n**C&C**\n\n– hxxp://46.148.235[.]114/cmd.php : XMRig CoinMiner\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to check related IOC**\n**and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information-en/)\n\n[Tagged as:GlobeImpostger,MedusaLocker,RDP](https://asec.ahnlab.com/en/tag/globeimpostger-en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-08 - GlobeImposter Ransomware Being Distributed with MedusaLocker via RDP.pdf"
    ],
    "report_names": [
        "2023-03-08 - GlobeImposter Ransomware Being Distributed with MedusaLocker via RDP.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660503,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1680510679,
    "ts_modification_date": 1680510679,
    "files": {
        "pdf": "https://archive.orkl.eu/17d82334ba1f4e5c1eb06b7eadaf417cadddcf66.pdf",
        "text": "https://archive.orkl.eu/17d82334ba1f4e5c1eb06b7eadaf417cadddcf66.txt",
        "img": "https://archive.orkl.eu/17d82334ba1f4e5c1eb06b7eadaf417cadddcf66.jpg"
    }
}