{
    "id": "4d27bc13-bf17-40b9-8979-1c39d2df97b2",
    "created_at": "2022-10-25T16:48:18.250643Z",
    "updated_at": "2025-03-27T02:16:26.319387Z",
    "deleted_at": null,
    "sha1_hash": "cc6da05602f15edd351fdb87c5c21b1ee423f942",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-07-25T21:40:59Z",
    "file_modification_date": "2017-07-25T21:40:59Z",
    "file_size": 5112381,
    "plain_text": "[www.cyberkov.com](http://www.cyberkov.com/)\ninfo@cyberkov.com\n\n\n## Hunting Libyan Scorpions\n\n### Investigating a Libyan Cyber Espionage\n Campaign Targeting High-Profile\n Influentials\n\n#### TLP: White\n\n For public distribution\n\n###### 18/September/2016\n\n\n-----\n\n###### g y p\n\n##### Legal Notice:\n\nThis document is intended for public use and distribution. Unauthorized use or reproduction of this document\nwithout referencing Cyberkov is prohibited.\n\nThis document has been prepared by Cyberkov Co. Ltd.\n\n##### Document Control\n\n**Document Title** Hunting Libyan Scorpions\n**TLP Classification** White\n**Document Version** 1.0\n**Creation Date** 01/September/2016\n**Last Modification Date** 18/September/2016\n**Distribution** Public Distribution\n**Reference** PD-001\n\n##### Cyberkov Contact Details\n\n**Name** **Cyberkov Media Office**\n**Email** media@cyberkov.com\n**Phone Number** +965 22445500\n**Fax Number** +1 (888) 433-3113\n**Office Number** +965 22445500\n**General query** info@cyberkov.com\n\n**Trademark**\n\nCyberkov and the Cyberkov logo “ ” are trademarks of Cyberkov Co. Ltd. All other trademarks mentioned in this\ndocument are owned by the mentioned legacy body or organization. The general service conditions of Cyberkov Co. Ltd.\napply to this documentation, unless it is explicitly specified otherwise.\n\n|Document Title|Hunting Libyan Scorpions|\n|---|---|\n|TLP Classification|White|\n|Document Version|1.0|\n|Creation Date|01/September/2016|\n|Last Modification Date|18/September/2016|\n|Distribution|Public Distribution|\n|Reference|PD-001|\n\n|Name|Cyberkov Media Office|\n|---|---|\n|Email|media@cyberkov.com|\n|Phone Number|+965 22445500|\n|Fax Number|+1 (888) 433-3113|\n|Office Number|+965 22445500|\n|General query|info@cyberkov.com|\n\n\n-----\n\n###### g y p\n\n##### Table of Contents\n\nDocument Control ............................................................................................................................................... 1\n\nCyberkov Contact Details .................................................................................................................................... 1\n\nExecutive Summary ............................................................................................................................................. 3\n\nTactics, Techniques and Procedures (TTPs)......................................................................................................... 4\n\nMalware Analysis ................................................................................................................................................. 6\n\nCommand and Control Communication ............................................................................................................ 21\n\nSinkhole ......................................................................................................................................................... 21\n\nReal C2 ........................................................................................................................................................... 24\n\nThreat Actor and Attribution ............................................................................................................................. 25\n\nThreat Actors Infrastructure .............................................................................................................................. 29\n\nTo Be Continued… ............................................................................................................................................. 33\n\nMitigating Libyan Scorpions Attacks on Android .............................................................................................. 33\n\nIndicators of Compromise (IOCs) ...................................................................................................................... 33\n\n\n-----\n\n###### g y p\n\n##### Executive Summary\n\nLibya maybe known in non-stable political system, civil war and militant groups fighting for the land and oil\ncontrol but it is definitely not known in cyber malicious activities, cyber espionage and hacking groups. No\nparties in Libya before this analysis reported to use cyber attacks, malwares nor recruit hackers to spy on their\nrivals. Today we have a different story.\n\nIn the past weeks on 6 August 2016, Cyberkov Security Incident Response Team (CSIRT) received a numerous\nAndroid malwares operating in different areas in Libya especially in Tripoli and Benghazi.\n\nThe malware spreads very fast using Telegram messenger application in smartphones, targeting high-profile\nLibyan influential and political figures.\n\nThe malware first discovery was after a highly Libyan influential Telegram account compromised via web\nTelegram using IP address from Spain.\n\nThe following day, the attackers spread an Android malware binded with legitimate Android application from\nthe compromised Telegram account to all his contacts pretending it is an important voice message (misspelled\nit by “Voice Massege.apk”) which indicates a non-english (maybe an Arabic) attacker.\n\nAfter spreading the malware, more Android smartphones has been infected using the same technique (via\nTelegram) and then repost the malware again and again making a network of victims.\n\nAnalysis of this incident led us to believe that this operation and the group behind it which we call Libyan\n**Scorpions is a malware operation in use since September 2015 and operated by a politically motivated group**\nwhose main objective is intelligence gathering, spying on influentials and political figures and operate an\nespionage campaign within Libya.\n\nAlso, the analysis of the incident led to the discovery of multiple malwares targeting Android and Windows\nmachines.\n\nLibyan Scorpions threat actors used a set of methods to hide and operate their malwares. They appear not to\nhave highly technical skills but a good social engineering and phishing tricks. The threat actors are not\nparticularly sophisticated, but it is well-understood that such attacks don’t need to be sophisticated in order\nto be effective.\n\n##### Using malwares as weapon in an active warzone such as Libya, make „ the victims easy targets for assassination or kidnapping by tracking their physical locations and monitoring them day and night.\n\n# [„]\n\n\n-----\n\n###### g y p\n\n##### Tactics, Techniques and Procedures (TTPs)\n\nLibyan Scorpions is believed to be a political motivated group targeting a high-level influential and political\nfigures in multiple cities within Libya.\n\nLibyan Scorpions first compromised a personal Telegram account for a Libyan influential person with\nunknown vector. The victim received a push notification from his Telegram app that someone from Spain is\nlogged into his account:\n\nThe victim mistakenly deleted Telegram application from his phone thinking that this is going to stop the\nattacker(s).\n\nSecond day, the attacker used the victim phone number to spear phish his contacts in Telegram by pretending\nthat the real person is sending a voice message while the file is actually a malicious APK (Android Package) file.\n\nThis APK file targets only Android-based smartphones. Once the new victim click on the APK file, the\napplication installs itself in the device without any problem and is fully functional. The icon of the application\nappears in the Apps menu named (URL Shortener).\n\n\n-----\n\n###### g y p\n\nThe real malicious code is running in the background as Android service[1].\n\n1 [https://developer.android.com/guide/components/services.html](https://developer.android.com/guide/components/services.html)\n\n\n-----\n\n##### Malware Analysis\n\nCyberkov Security Incident Response Team (CSIRT) started analyzing the APK file (malware) and the first step\nwas to unpack it.\n\nAfter unpacking with apktool and reading (AndroidManifest.xml) file, it appears that the application is a\nmalware injected inside a legitimate application having java package name:\n**de.keineantwort.android.urlshortener.**\n\nT l 965 22445500 | F 1 (888) 4333113 | E il i f @ b k | W b it b k 6\n\n\nAfter unpacking with apktool and reading (AndroidManifest.xml) file, it appears that the application is a\nmalware injected inside a legitimate application having java package name:\n**de.keineantwort.android.urlshortener.**\n\n\n-----\n\n###### g y p\n\nSearching for the application in Google Play store with that specific package name\n[(https://play.google.com/store/apps/details?id=de.keineantwort.android.urlshortener) yields:](https://play.google.com/store/apps/details?id=de.keineantwort.android.urlshortener)\n\n\n-----\n\n###### g y p\n\nThe application exists in the store and the Libyan Scorpions hacking group took an instance of the APK and\ninjected their malware into that legitimate application to spread it.\n\nThe real application is created by keineantwort.de and we have verified it from their main website:\n\nGoing back to (AndroidManifest.xml) file, the malware register itself as receiver of almost all intents and\nrequest almost all permissions available in Android system!\n\n\n-----\n\n###### g y p\n\n\n-----\n\n###### g y p\n\nThe malware can access location, network state, battery status, Bluetooth, camera, capturing audio,\ninternet, …, etc.\n\nAfter launching the malicious application for the first time, it checks if the Android device is rooted or not\nand if rooted, it asks for root permission.\n\n\n-----\n\n###### g y p\n\nCarrying on the reverse engineering of the malware, we found a file called “config.json” which is a base64\nencoded json file containing the configuration of the malware and its Command and Control (C2). The\ncharacteristics of the malware (“a.txt” and “config.json” files) and the functionality of it is very similar to\nJSocket and AlienSpy famous Android Remote Access Tools (RATs).\n\nDecoding the “config.json” file using base64 decoder shows that the C2 hostname/domain is:\n\n**winmeif.myq-see.com using the port 64631**\n\nResolving the hostname gives: 41.208.110.46 which is a static Libyan IP address owned by Libya Telecom\n**and Technology Backbone.**\n\n\n-----\n\n###### g y p\n\nGoing back to the domain/hostname used by the Libyan Scorpions hacking group, it appears that myq**see.com is a dynamic DNS service open for the public.**\n\n\n-----\n\n###### g y p\n\nScrolling down the web page, it is created by Q-See which is a company that sells cameras and it seems that\nQ-See published this service to help their customers to connect to their IP cameras regardless of IP changes.\n\n\n-----\n\n###### g y p\n\nThe malware uses RootTools and RootShell components to make root privileged tasks easy in Android.\n\n\n-----\n\n###### g y p\n\nThe picture below showing that the malware is capable of taking pictures from the camera of the\ncompromised device and upload it to the C2.\n\nThe malware begins by implementing a Trust Manager that accepts all certificates so that Libyan Scorpions\nhackers are sure no victim left disconnected due to SSL certificates issues.\n\n\n-----\n\n###### g y p\n\nThe malware is able to turn the Android phone into a remote listening bug by opening the Microphone and\nrecording the audio then send it to the C2.\n\nThe malware is able to browse the files and folders stored inside the Android device.\n\n\n-----\n\n###### g y p\n\nThe malware is able to monitor the physical location of the compromised Android device.\n\nThe malware is able to get the call logs along with phone numbers, duration and date and time of each call.\n\n\n-----\n\n###### g y p\n\nThe malware is able to read the SMS messages and the list of contacts saved in the device.\n\nBesides, the malware is able to get the phone number, country and network operator name from cellular\ntowers of the telecom company of the target.\n\n\n-----\n\n###### g y p\n\nThe malware uses Allatori Java Obfuscator to protect the code and make it harder to reverse engineer and it\nobviously uses communication protocol based on Java JSON objects encapsulated in SSL connection wrapper.\nAgain, this behavior and characteristics of the malware is very similar to JSocket and AlienSpy Android RATs.\n\nAfter finalizing the analysis of the Android malware, Cyberkov uploaded it to VirusTotal to see if it has been\nuploaded before and what information we can get from it:\n\n\n-----\n\n###### g y p\n\nCyberkov discovered that the malware has not been uploaded to VirusTotal before and the first sample of\nthis malware has been uploaded by us. However, 8 out of 54 AntiVirus engines detect it which is a very low\ndetection rate (15%). Most and major American top Gartner Antivirus companies did not detect it!!\n\n\n-----\n\n###### g y p\n\n##### Command and Control Communication\n\nCyberkov tried to discover the attacker behind this malicious application by sinkholing the malware and\nanalyzing the real C2.\n\n###### Sinkhole\nCyberkov created a fake server simulating the real C2 of the Libyan Scorpions hacking group and sinkholed\nthe malware to study the behavior of the malware deeply.\n\nUpon connection to the C2, the malware sends a lot of information about the target including: Country,\nMalware Path, Local IP Address, RAM, Android Version, Device Name, …, etc.\n\n\n-----\n\n###### g y p\n\nThe fake C2 server is able to send fake commands to the malware and read the reply as well.\n\nThose commands (103, 104 and 105) correspond to the following list of commands defined in the malware:\n\n\n-----\n\n###### g y p\n\nEach number corresponds to one command to be done by the malware. For example, the command (111)\nuninstalls the real application “URLShortener”:\n\nWill result in:\n\n\n-----\n\n###### g y p\n\n Real C2\nBy connecting to the real C2 IP address, Cyberkov found that the malware is really of JSocket/AlienSpy family\nof RATs since that family of RATs open the port 1234 with a self-signed certificate of “assylias”[2].\n\nAccording to Shodan, the port (1234) has been spotted open since 12-07-2016 which is 25 days before the\nfirst discovery.\n\n2\n\n[https://www.fidelissecurity.com/sites/default/files/FTA_1019_Ratcheting_Down_on_JSocket_A_PC_and_Android_Thre](https://www.fidelissecurity.com/sites/default/files/FTA_1019_Ratcheting_Down_on_JSocket_A_PC_and_Android_Threat_FINAL.pdf)\n[at_FINAL.pdf](https://www.fidelissecurity.com/sites/default/files/FTA_1019_Ratcheting_Down_on_JSocket_A_PC_and_Android_Threat_FINAL.pdf)\n\n\n-----\n\n###### g y p\n\n##### Threat Actor and Attribution\n\nSeems like the Libyan Scorpions threat actors are running multiple Android RATs since numerous ports\nprotected by SSL layer are open in (winmeif.myq-see.com) machine.\n\nAlso, the Libyan Scorpions threat actors left phpinfo.php script on the webserver running on port 80 with\nuseful information that could expose them. Their machine is running Windows 7 Professional Service Pack 1.\n\n\n-----\n\n###### g y p\n\nUsername of the Windows machine is admin.\n\nThe computer name of Windows machine is ADMIN.\n\n\n-----\n\n###### g y p\n\nThe Libyan Scorpions threat actors use a Dell laptop and have Skype installed and are setting behind a NAT\nand their internal IP address is 192.168.1.16\n\nThe attackers also have a PhpMyAdmin script installed in their machine:\n\n\n-----\n\n###### g y p\n\nCyberkov Security Incident Response Team (CSIRT) tried to brute force the password of the database using\nthe top most common 100 passwords. Unfortunately, the attempt failed.\n\n\n-----\n\n###### g y p\n\n##### Threat Actors Infrastructure\n\nGoing back to the IP address of the attackers (41.208.110.46), it is very important to discover the attackers\ninfrastructure that maybe used to launch wider attacks using multiple RATs on multiple platforms.\n\nBy using Threat Intelligence Platforms and Feeds such as PassiveTotal, Cyberkov was able to discover more\nactivities and campaigns run by Libyan Scorpions.\n\nThe following Heatmap shows that the IP address (41.208.110.46) has been used to launch attacks since\n9/9/2015 until the time of writing this report using 5 different hostnames and multiple malicious malwares.\n\nThe following table summarizes the list of hostnames used by the attacker(s):\n\n**Hostname** **First Seen** **Last Seen**\n**Samsung.ddns.me** 26-04-2016 08-09-2016\n**Wininit.myq-see.com** 24-05-2016 22-08-2016\n**Winmeif.myq-see.com** 07-08-2016 22-08-2016\n**Collge.myq-see.com** 09-09-2015 22-08-2016\n**Sara2011.no-ip.biz** 08-10-2015 08-10-2015\n\n\n-----\n\n###### g y p\n\nAll of the hostnames point to the same C2 IP address used by the attackers (but sara2011.no-ip.biz):\n\nAlso, using PassiveTotal, the C2 is connected to 2 more malwares used by the attackers having the following\nhashes (MD5):\n\n  - 1738ecf69b8303934bb10170bcef8926\n\n  - 93ebc337c5fe4794d33df155986a284d\n\nThe first hash in the above picture is for the malware “Voice Massege.apk” which we have analyzed already.\n\n\n-----\n\n###### g y p\n\nThe second hash (1738ecf69b8303934bb10170bcef8926) is named (Benghazi.exe) and have detection rate\nof 21 out of 56 (37.5%) and has been uploaded first time to VirusTotal on 23-04-2016.\n\nNotice that this malware targets Windows machines and not Android smartphones. It is compiled on 15-042016 and is coded in Visual Basic.\n\n\n-----\n\n###### g y p\n\nThe third hash (93ebc337c5fe4794d33df155986a284d) is a DroidJack, a malicious attacking platform,\ntargeting android smartphones.\n\nAlso, the name of activities and services contains net.droidjack.server name which makes us sure it is\n**DroidJack malware.**\n\n\n-----\n\n###### g y p\n\n##### To Be Continued…\n\nCyberkov will continue investigating Libyan Scorpions hacking group operating in Libya and will update this\nreport with a follow-up reports regarding any future cyber activities.\n\n##### Mitigating Libyan Scorpions Attacks on Android\n\nCyberkov recommends the following points in order to protect the victims from such malwares:\n\n  - Update your Android operating system regularly\n\n  - Install DrWeb Security Space for Android (A leading Russian AntiVirus Company)\n\n  - Use of DrWeb Telegram Bot (DrWebBot) to scan links and files shared on Telegram chats or groups\n\n  - Install Zemana Mobile AntiVirus (A leading Turkish AntiMalware and AntiFraud Company)\n\n  - Never install applications from unknown sources\n\n  - Use Telegram with Secret Chat feature only\n\n  - Always verify with your partners when sending and receiving files\n\n##### Indicators of Compromise (IOCs)\nThe following table summarizes the list of indicators to detect the malware:\n\n**Type** **Indicator**\n**Sha256** 9d8e5ccd4cf543b4b41e4c6a1caae1409076a26ee74c61c148dffd3ce87d7787\n**Sha256** 4e656834a93ce9c3df40fe9a3ee1efcccc728e7ea997dc2526b216b8fd21cbf6\n**Sha256** **e66d795d0c832ad16381d433a13a2cb57ab097d90e9c73a1178a95132b1c0f70**\n**Md5** 1738ecf69b8303934bb10170bcef8926\n**Md5** 93ebc337c5fe4794d33df155986a284d\n**Md5** **1c8a1aa75d514d9b1c7118458e0b8a14**\n**Sha1** 41096b7f808a91ee773bbba304ea2cd0fa42519d\n**Sha1** 46d832a9c1d6c34edffee361aca3de65db1b7932\n**Sha1** **2e2d1315c47db73ba8facb99240ca6c085a9acbc**\n**Filename** Voice Massege.apk\n**Filename** Benghazi.exe\n**Filename** VPN.apk\n**IP** 41.208.110.46\n**Domain** winmeif.myq-see.com\n**Domain** Wininit.myq-see.com\n**Domain** Samsung.ddns.me\n**Domain** Collge.myq-see.com\n**Domain** Sara2011.no-ip.biz\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://cyberkov.com/wp-content/uploads/2016/09/Hunting-Libyan-Scorpions-EN.pdf"
    ],
    "report_names": [
        "Hunting-Libyan-Scorpions-EN.pdf"
    ],
    "threat_actors": [
        {
            "id": "a829ffdf-fc14-4535-9fd0-86420b37c5c9",
            "created_at": "2022-10-25T16:07:23.79119Z",
            "updated_at": "2025-03-27T02:02:09.980391Z",
            "deleted_at": null,
            "main_name": "Libyan Scorpions",
            "aliases": [],
            "source_name": "ETDA:Libyan Scorpions",
            "tools": [
                "Benghazi.exe",
                "Voice Massege.apk"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "491e2ee0-c63e-4728-96b4-d06391d52736",
            "created_at": "2023-01-06T13:46:38.489158Z",
            "updated_at": "2025-03-27T02:00:02.846618Z",
            "deleted_at": null,
            "main_name": "Libyan Scorpions",
            "aliases": [],
            "source_name": "MISPGALAXY:Libyan Scorpions",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1501018859,
    "ts_modification_date": 1501018859,
    "files": {
        "pdf": "https://archive.orkl.eu/cc6da05602f15edd351fdb87c5c21b1ee423f942.pdf",
        "text": "https://archive.orkl.eu/cc6da05602f15edd351fdb87c5c21b1ee423f942.txt",
        "img": "https://archive.orkl.eu/cc6da05602f15edd351fdb87c5c21b1ee423f942.jpg"
    }
}