{
    "id": "4d6d5d5c-8a28-438a-a1f2-8e4f9a948ad3",
    "created_at": "2023-01-12T15:06:50.067991Z",
    "updated_at": "2025-03-27T02:17:05.608102Z",
    "deleted_at": null,
    "sha1_hash": "0c730e8c2f5c587597aef6743d75fcf7c5dfd992",
    "title": "2016-01-09 - Confirmation of a Coordinated Attack on the Ukrainian Power Grid",
    "authors": "",
    "file_creation_date": "2022-05-28T05:13:20Z",
    "file_modification_date": "2022-05-28T05:13:20Z",
    "file_size": 381021,
    "plain_text": "# Confirmation of a Coordinated Attack on the Ukrainian Power Grid\n\n**[ics.sans.org/blog/2016/01/09/confirmation-of-a-coordinated-attack-on-the-ukrainian-power-grid](https://ics.sans.org/blog/2016/01/09/confirmation-of-a-coordinated-attack-on-the-ukrainian-power-grid)**\n\nSANS ICS\n\n[Michael Assante](http://10.10.0.46/profiles/michael-assante?msc=blog-author)\nJanuary 6, 2016\n\nAfter analyzing the information that has been made available by affected power companies,\nresearchers, and the media it is clear that cyber attacks were directly responsible for power\noutages in Ukraine. The SANS ICS team has been coordinating ongoing discussions and\nproviding analysis across multiple international community members and companies. We\nassess with high confidence based on company statements, media reports, and first-hand\nanalysis that the incident was due to a coordinated intentional attack.\n\nThe attackers demonstrated planning, coordination, and the ability to use malware and\npossible direct remote access to blind system dispatchers, cause undesirable state changes\nto the distribution electricity infrastructure, and attempt to delay the restoration by wiping\nSCADA servers after they caused the outage. This attack consisted of at least three\ncomponents: the malware, a denial of service to the phone systems, and the missing piece\nof evidence of the final cause of the impact. Current evidence and analysis indicates that the\nmissing component was direct interaction from the adversary and not the work of malware.\nOr in other words, the attack was enabled via malware but consisted of at least three distinct\nefforts.\n\n**The Multiple Elements**\n\nThe cyber attack was comprised of multiple elements which included denial of view to\nsystem dispatchers and attempts to deny customer calls that would have reported the power\nout. We assess with high confidence that there were coordinated attacks against multiple\nregional distribution power companies. Some of these companies have been reported by\nmedia to include specifically named utilities such as Prykarpattyaoblenergo and\nKyivoblenergo. The exact timeline for which utilities were affected and their ordering is still\nunclear and is currently being analyzed. What we do know is that Kyivoblenergo provided\npublic updates to customers, shown below, indicating there was an unauthorized intrusion\n(from 15:30 - 16:30L) that disconnected 7 substations (110 kV) and 23 (35 kV) substations\nleading to an outage for 80,000 customers.\n\n\n-----\n\nThe key significance here is that 80,000 customers comprise a significant portion of their\nresidential load. Power was restored to all customers by (18:56L). They also reported\ntechnical failures with their call line interfering with receiving customer's calls as shown\nbelow.\n\nQuick action by utility staff to switch to \"manual mode\" and restore the system was\nimpressive. Statements from utility staff to local media indicated the distribution system was\nbeing run without the benefit of their SCADA as it was still infected. Field staff at the\nimpacted power companies manned required substations, transferring from \"automatic to\nmanual mode\", and manually re-closed breakers to energize the system. Restoration varied\nbut all services were restored in 3-6 hours. It is important to note that there are risks\noperating your system without the benefit of an automated dispatch control center and\nutilities that are more reliant on automation may not be able to restore large portions of their\nsystem this way. In many ways, the Ukrainian operators should be commended for their\ndiligence and restoration efforts.\n\n\n-----\n\n**Cyber Attack Milestones as Reported To Date:**\n\nFrom what has been reported, here is the information to date that we are confident took\nplace. The exact timing of the events is still being pieced together.\n\nThe adversary initiated an intrusion into production SCADA systems\nInfected workstations and servers\nActed to \"blind\" the dispatchers\nActed to damage the SCADA system hosts (servers and workstations)\n\nAction would have delayed restoration and introduce risk, especially if the\nSCADA system was essential to coordinate actions\nAction can also make forensics more difficult\nFlooded the call centers to deny customers calling to report power out\n\n**Probable Cyber Attack Milestones as Reported to Date:**\n\nIn analyzing the evidence and reports there are still missing pieces to the attack.\nUnderstanding the initial foothold of the adversary, the eventual impact, and the types of\nsystems in place can help to make assessments on what the adversary likely had to have\ndone but the items stated below are currently probable and not known. We are working to\nverify and uncover more information.\n\nThe adversaries infected workstations and moved through the environment\nActed to open breakers and cause the outage (assessed through technical analysis of\nthe Ukrainian SCADA system in comparison to the impact)\nInitiated a possible DDoS on the company websites\n\n**Malware Enabled but Not Likely Malware Caused**\n\nIt is interesting and important to understand the role of the malware sample SANS ICS\n[previously reported that came from one of the infected networks. There have been two](http://ics.sans.org/blog/2016/01/01/potential-sample-of-malware-from-the-ukrainian-cyber-attack-uncovered)\nprominent theories in the community and speculation to the media that either the 'KillDisk'\ncomponent was just inside the network and unrelated to the power outage (a reliability issue\nwhere malware just happened to be there) or that the 'KillDisk' component was directly\nresponsible for the outage. It is our assessment that neither of these are correct. Malware\nlikely enabled the attack, there was an intentional attack, but the 'KillDisk' component itself\ndid not cause the outage.\n\nIt is also important to note that many of the samples being analyzed in the community to date\nas reported by others are not guaranteed to have been involved in this incident. The malware\ncampaign reported, tied to BlackEnergy and the Sandworm team by others, has solid links to\nthis incident but it cannot be assumed that files such as the excel spreadsheet and other\nmalware samples recovered from other portions of that campaign were at all involved in this\nincident. It is possible but far too early in the technical analysis to state that. The type of\nanalysis being done by the security researchers and companies assessing this is valuable\n\n\n-----\n\nanalysis and they should be commended. At the worst it will provide lessons learned and\ntraining opportunities for the community. But analysts should be careful not to overstate\ncurrent analysis of malware samples due to their link to the larger campaign as being specific\nto this incident. Simply put, there is still evidence that has yet to be uncovered that may\nrefute the minutia of the specific components of the malware portion of the attack.\n\nMore importantly, the link of the KillDisk wiper to the actual cause of the outage is not likely.\nThis is stated because power systems and SCADA schemes simply do not work in that\nmanner. In other words, the incident observed with consideration to timing, sites, and impact\ndoes not at all align with the narrative of the 'KillDisk' component itself causing the impact. I\nhave observed the loss of many SCADA systems for periods of time that resulted in no\noutage or impact to the power system. Running a power system without the benefit of your\nSCADA system at the distribution-level adds risk, but without something to change the 'state'\n(for example to force a circuit to de-energize) then the system will continue to serve power.\nWe assess currently that the malware allowed the attackers to gain a foothold at the targeted\nutilities, open up command and control, and facilitate the planning of an attack by providing\naccess to the network and necessary information. The malware also appears to have been\nused to wipe files in an attempt to deny the use of the SCADA system for the purposes of\nrestoration to amplify the effects of the attack and possibly to delay restoration.\n\n**Final Thoughts**\n\nWe are very interested in helping power utilities learn as much as they can from this real\nworld incident. We would also note the competent action by Ukrainian utility personnel in\nresponding to the attack and restoring their power system. As a community the power\nindustry is dedicated to keeping the lights on. What is now true is that a coordinated cyber\nattack consisting of multiple elements is one of the expected hazards they may face. We\nneed to learn and prepare ourselves to detect, respond, and restore from such events in the\nfuture. The SANS ICS team will be continuing our analysis and presenting findings and\nupdates to the community in multiple formats. On Jan 20 we will host a webcast focusingth\non understanding the industrial control systems and SCADA networks of the Ukrainian power\ngrid to identify what was even possible in terms of attack scenarios. Following that, we will\n[release more information at the SANS ICS Summit with a full breakdown of what we know](https://www.sans.org/event/ics-security-summit-2016)\nand its value to the community. Finally, we will be releasing a comprehensive whitepaper on\n[the incident in our Defense Use Case (DUC) series in our ICS Digital Library. The DUC will](https://ics.sans.org/ics-library)\nhighlight both the cyber and physical components to this incident and the lessons learned for\nthe community.\n\nWe sincerely thank all the effort going on in the community by numerous passionate\nresearchers and companies across both the information technology and the ICS community.\nIt takes all of us working together to understand and respond to these types of incidents.\n\n[To view all our upcoming courses and events, click here.](http://ics.sans.org/u/osp)\n\n\n-----\n\n**Free Stuff Reminder**\n\n[Download the \"What Will Your Attack Look Like\" poster here](https://ics.sans.org/media/what-will-your-attack-look-like.pdf?utm_medium=Display&utm_source=SANS&utm_content=ICS+Blog&utm_campaign=ICS+Library)\n[Get the latest ICS resources here](https://ics.sans.org/ics-library?utm_medium=Display&utm_source=SANS&utm_content=ICS+Blog&utm_campaign=ICS+Library)\n[Join the conversation in the ICS Community Forum where ICS professionals share](http://ics-community.sans.org/)\nlessons learned, ask questions and connect with others passionate about securing our\ncritical infrastructure.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-01-09 - Confirmation of a Coordinated Attack on the Ukrainian Power Grid.pdf"
    ],
    "report_names": [
        "2016-01-09 - Confirmation of a Coordinated Attack on the Ukrainian Power Grid.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536010,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653714800,
    "ts_modification_date": 1653714800,
    "files": {
        "pdf": "https://archive.orkl.eu/0c730e8c2f5c587597aef6743d75fcf7c5dfd992.pdf",
        "text": "https://archive.orkl.eu/0c730e8c2f5c587597aef6743d75fcf7c5dfd992.txt",
        "img": "https://archive.orkl.eu/0c730e8c2f5c587597aef6743d75fcf7c5dfd992.jpg"
    }
}