{
    "id": "4d8ce7e6-d684-4657-868a-e673ec4449f4",
    "created_at": "2023-01-12T15:08:01.90909Z",
    "updated_at": "2025-03-27T02:16:25.831778Z",
    "deleted_at": null,
    "sha1_hash": "d6ba7a02ae40fd4703c619b512a1e0a232dffe4b",
    "title": "2022-03-10 - AbereBot Returns as Escobar",
    "authors": "",
    "file_creation_date": "2022-05-27T23:06:30Z",
    "file_modification_date": "2022-05-27T23:06:30Z",
    "file_size": 1276604,
    "plain_text": "# AbereBot Returns as Escobar\n\n**blog.cyble.com/2022/03/10/aberebot-returns-as-escobar/**\n\nMarch 10, 2022\n\n[During Cyble’s routine Open-Source Intelligence (OSINT) research, we came across a Twitter post](https://twitter.com/malwrhunterteam/status/1499390775775293454)\nwherein researchers mentioned a malware that has a name and icon similar to the legitimate anti-virus\napp, McAfee. While analyzing the malware we observed that the package name of the malicious app was\n_com.escobar.pablo. Further research helped us identify this malware as a new variant of the popular_\n[banking Trojan, Aberebot. Besides stealing sensitive information such as login credentials using phishing](https://blog.cyble.com/2021/07/30/aberebot-on-the-rise-new-banking-trojan-targeting-users-through-phishing/)\noverlays, Aberebot has also targeted customers of 140+ banks and financial institutions across 18\ncountries.\n\nCyble Research Labs has identified new features in this Aberebot variant, such as stealing data from\nGoogle Authenticator and taking the control of compromised device screens using VNC, etc. Threat\nActors (TAs) have named the new variant as Escobar and published the feature details of the variant in a\ncybercrime forum, as shown in the figure below.\n\n\n-----\n\nFigure 1- Darkweb Post About Escobar\n\n## Technical Analysis\n\n### APK Metadata Information\n\nApp Name: McAfee\nPackage Name: com.escobar.pablo\nSHA256 Hash: a9d1561ed0d23a5473d68069337e2f8e7862f7b72b74251eb63ccc883ba9459f\n\nFigure 2 shows the metadata information of an application.\n\n\n-----\n\nFigure 2 – App Metadata Information\nThe figure below shows the application icon and name displayed on the Android device.\n\nFigure 3 – App Icon and Name\n\n## Manifest Description\n\nThe malware requests users for 25 different permissions, of which it abuses 15. These dangerous\npermissions are listed below.\n\n**Permissions** **Description**\n\nREAD_SMS Access SMSes from the victim’s device.\n\nRECEIVE_SMS Intercept SMSes received on the victim’s device\n\nREAD_CALL_LOG Access Call Logs\n\nREAD_CONTACTS Access phone contacts\n\n\n-----\n\nREAD_PHONE_STATE Allows access to phone state, including the current cellular network\ninformation, the phone number and the serial number of the phone,\nthe status of any ongoing calls, and a list of any Phone Accounts\nregistered on the device.\n\nRECORD_AUDIO Allows the app to record audio with the microphone, which has the\npotential to be misused by attackers\n\nACCESS_COARSE_LOCATION Allows the app to get the approximate location of the device network\nsources such as cell towers and Wi-Fi.\n\nACCESS_FINE_LOCATION Allows the device’s precise location to be detected by using the\nGlobal Positioning System (GPS).\n\nSEND_SMS Allows an application to send SMS messages.\n\nCALL_PHONE Allows an application to initiate a phone call without going through\nthe Dialer user interface for the user to confirm the call.\n\nWRITE_EXTERNAL_STORAGE Allows the app to write or delete files in the device’s external\nstorage\n\nREAD_EXTERNAL_STORAGE Allows the app to read the contents of the device’s external storage\n\nWRITE_SMS Allows the app to modify or delete SMSes\n\nGET_ACCOUNTS Allows the app to get the list of accounts used by the phone\n\nDISABLE_KEYGUARD Allows the app to disable the keylock and any associated password\nsecurity\n\nWe observed a defined launcher activity in the malicious app’s manifest file, which loads the first screen\nof the application, as shown in Figure 4.\n\nFigure 4 –\n\nLauncher Activity\n\n## Source Code Review\n\nOur static analysis indicated that the malware steals sensitive data such as Contacts, SMSes, Call logs,\nand device location. Besides recording calls and audio, the malware also deletes files, sends SMSes,\nmakes calls, and takes pictures using the camera, etc., based on the commands received from the C&C\nserver.\n\nThe code snippet shown below is used by the malware to access the contacts data such as phone\nnumbers and email addresses from the victim’s device, as shown in Figure 5.\n\n\n-----\n\nFigure 5 – Code to Collect Contacts Data\nThe code shown in Figure 6 is used by the malware to collect SMSes from the device‘s inbox and upload\nthem to the C&C server.\n\nFigure 6 – Code to Collect Inbox SMSs\nThe malware collects incoming SMSes from the device and uploads them to the C&C server, as shown in\nFigure 7.\n\n\n-----\n\nFigure 7 – Code for collecting Incoming SMSs\nThe code snippet shown below depicts the malware’s ability to collect call logs from the device and\nupload it to the C&C server.\n\nFigure 8 – Code to Collect Call Logs\nFigure 9 showcases the code that illustrates the malware‘s ability to steal application key logs.\n\nFigure 9 – Code to steal key logs\nIn the below image, we see the code that is used by the malware to record audio from an infected device\nbased on the TA’s command.\n\n\n-----\n\nFigure 10 – Code to records Audio\nOn the TA’s command, the malware tries to steal Google authenticator codes, as shown below.\n\nFigure 11 – Steals Google Authenticator Code\nThe Escobar malware variant also uses VNC Viewer to remotely control the screens of an infected\ndevice, as shown below.\n\nFigure 12 – Uses VNC Viewer to Control Device Screen\nThe malware can take pictures and also has the code to send text SMSes to a specific phone number or\nto all the contacts saved in the victim’s device without the user’s knowledge. Refer to figure 13 for the\ncode used by the malware for this purpose.\n\nFigure 13 – Code to take Pictures and send SMSs\n\n\n-----\n\nActing to the commands given by the TAs C&C, the Escobar malware is capable of injecting URLs in the\nvictim’s device, as shown below.\n\nFigure 14 – Injects URLs\nThe malware can also steal media files from the victim’s device, as shown in the below code snippet.\n\nFigure 15 – Steals Files on the Device\nThe image below depicts the malware’s ability to collect device location.\n\nFigure 16 – Code to Collects Device Location\nFigure 17 showcases the code snippet used by the Escobar malware to monitor the victim’s device\nnotifications.\n\nFigure 17 – Code for monitoring device notifications\nThe malware can also kill itself whenever it gets the commands from the C&C server.\n\nFigure 18 –\n\nCode to kill Itself\nBelow are the commands used by the TAs to control the infected device:\n\n**Command** **Description**\n\nTake Photo Capture images from the device’s camera\n\nSend SMS Send SMS to a particular number\n\nSend SMS to All Contacts Send SMS to all the contact numbers saved in the device\n\n\n-----\n\nInject a web page Inject a URL\n\nDownload File Download media files from the victim device\n\nKill Bot Delete itself\n\nUninstall an app Uninstall an application\n\nRecord Audio Record device audio\n\nGet Google Authenticator Codes Steal Google Authenticator codes\n\nStart VNC Control device screen\n\n## Conclusion\n\nBanking threats are increasing with every passing day and growing in sophistication. Escobar is one such\nexample. The newly added features in the Escobar malware allow the malicious app to steal information\nfrom the compromised device. According to our research, these types of malware are only distributed via\nsources other than Google Play Store. As a result, practicing cyber hygiene across mobile devices and\nonline banking applications is a good way to prevent this malware from compromising your system.\n\n### Our Recommendations\n\nWe have listed some essential cybersecurity best practices that create the first line of control against\nattackers. We recommend that our readers follow the best practices given below:\n\n### How to prevent malware infection?\n\nDownload and install software only from official app stores like Google Play Store or the iOS App\nStore.\nUse a reputed anti-virus and internet security software package on your connected devices, such as\nPCs, laptops, and mobile devices.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nEnable biometric security features such as fingerprint or facial recognition for unlocking the mobile\ndevice where possible.\nBe wary of opening any links received via SMS or emails delivered to your phone.\nEnsure that Google Play Protect is enabled on Android devices.\nBe careful while enabling any permissions.\nKeep your devices, operating systems, and applications updated.\n\n### How to identify whether you are infected?\n\nRegularly check the Mobile/Wi-Fi data usage of applications installed in mobile devices.\nKeep an eye on the alerts provided by Anti-viruses and Android OS and take necessary actions\naccordingly.\n\n### What to do when you are infected?\n\nDisable Wi-Fi/Mobile data and remove SIM card – as in some cases, the malware can re-enable the\nMobile Data.\nPerform a factory reset.\n\n\n-----\n\nRemove the application in case a factory reset is not possible.\nTake a backup of personal media Files (excluding mobile applications) and perform a device reset.\n\n### What to do in case of any fraudulent transaction?\n\nIn case of a fraudulent transaction, immediately report it to the concerned bank.\n\n### What should banks do to protect their customers?\n\nBanks and other financial entities should educate customers on safeguarding themselves from\nmalware attacks via telephone, SMSes, or emails.\n\n## MITRE ATT&CK® Techniques\n\n**Tactic** **Technique ID** **Technique Name**\n\n**Initial Access** [T1476](https://attack.mitre.org/versions/v7/techniques/T1476/) Deliver Malicious App via Other Mean.\n\n**Initial Access** [T1444](https://attack.mitre.org/versions/v7/techniques/T1444) Masquerade as Legitimate Application\n\n**Execution** [T1575](https://attack.mitre.org/versions/v7/techniques/T1575/) Native Code\n\n**Collection** [T1433](https://attack.mitre.org/techniques/T1433) Access Call Log\n\n**Collection** [T1412](https://attack.mitre.org/techniques/T1412) Capture SMS Messages\n\n**Collection** [T1432](https://attack.mitre.org/techniques/T1432) Access Contact List\n\n**Collection** [T1429](https://attack.mitre.org/techniques/T1429) Capture Audio\n\n**Collection** [T1512](https://attack.mitre.org/techniques/T1512) Capture Camera\n\n**Collection** [T1533](https://attack.mitre.org/techniques/T1533) Data from Local System\n\n**Collection** [T1430](https://attack.mitre.org/techniques/T1430) Location Tracking\n\n**Command and Control** [T1436](https://attack.mitre.org/techniques/T1436) Commonly Used Ports\n\n## Indicators of compromise\n\n\n**Indicators** **Indicator**\n**Type**\n\n\n**Description**\n\n\n**a9d1561ed0d23a5473d68069337e2f8e7862f7b72b74251eb63ccc883ba9459f** SHA256 Escobar\nAPK\n\n**22e943025f515a398b2f559c658a1a188d0d889f** SHA1 Escobar\nAPK\n\n**d57e1c11f915b874ef5c86cedb25abda** MD5 Escobar\nAPK\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-10 - AbereBot Returns as Escobar.pdf"
    ],
    "report_names": [
        "2022-03-10 - AbereBot Returns as Escobar.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536081,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653692790,
    "ts_modification_date": 1653692790,
    "files": {
        "pdf": "https://archive.orkl.eu/d6ba7a02ae40fd4703c619b512a1e0a232dffe4b.pdf",
        "text": "https://archive.orkl.eu/d6ba7a02ae40fd4703c619b512a1e0a232dffe4b.txt",
        "img": "https://archive.orkl.eu/d6ba7a02ae40fd4703c619b512a1e0a232dffe4b.jpg"
    }
}