{
    "id": "4db7eb58-e1bd-48a7-89c8-08a77041a8b7",
    "created_at": "2023-01-12T15:00:58.524769Z",
    "updated_at": "2025-03-27T02:06:11.887355Z",
    "deleted_at": null,
    "sha1_hash": "e0173ffe9d7614103b64211c5c393ac0e2bb258e",
    "title": "2017-09-12 - FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY,FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY",
    "authors": "",
    "file_creation_date": "2022-05-28T17:56:58Z",
    "file_modification_date": "2022-05-28T17:56:58Z",
    "file_size": 94728,
    "plain_text": "# FireEye Uncovers CVE-2017-8759: Zero-Day Used in the Wild to Distribute FINSPY\n\n**[fireeye.com/blog/threat-research/2017/09/zero-day-used-to-distribute-finspy.html](https://www.fireeye.com/blog/threat-research/2017/09/zero-day-used-to-distribute-finspy.html)**\n\n## Breadcrumb\n\nThreat Research\n\nGenwei Jiang, Ben Read, James T. Bennett\n\nSep 12, 2017\n\n4 mins read\n\nZero Day Threats\n\n\n-----\n\nFireEye recently detected a malicious Microsoft Office RTF document that leveraged CVE2017-8759, a SOAP [WSDL parser code injection vulnerability. This vulnerability allows a](https://docs.microsoft.com/en-us/previous-versions/dotnet/articles/ms996486(v=msdn.10)?redirectedfrom=MSDN)\nmalicious actor to inject arbitrary code during the parsing of SOAP WSDL definition contents.\n[Mandiant analyzed a Microsoft Word document where attackers used the arbitrary code](https://www.fireeye.com/advantage)\ninjection to download and execute a Visual Basic script that contained PowerShell\ncommands.\n\nFireEye shared the details of the vulnerability with Microsoft and has been coordinating\npublic disclosure timed with the release of a patch to address the vulnerability and security\n[guidance, which can be found here.](https://msrc.microsoft.com/update-guide/en-us/vulnerability/CVE-2017-8759)\n\nFireEye email, endpoint and network products detected the malicious documents.\n\n**Vulnerability Used to Target Russian Speakers**\n\nThe malicious document, “Проект.doc” (MD5: fe5c4d6bb78e170abf5cf3741868ea4c), might\nhave been used to target a Russian speaker. Upon successful exploitation of CVE-20178759, the document downloads multiple components (details follow), and eventually\nlaunches a FINSPY payload (MD5: a7b990d5f57b244dd17e9a937a41e7f5).\n\n[FINSPY malware, also reported as FinFisher or WingBird, is available for purchase as part of](http://download.microsoft.com/download/E/B/0/EB0F50CC-989C-4B66-B7F6-68CD3DC90DE3/Microsoft_Security_Intelligence_Report_Volume_21_English.pdf)\n[a “lawful intercept” capability. Based on this and previous use of FINSPY, we assess with](https://www.fireeye.com/blog/threat-research/2017/04/cve-2017-0199_useda.html)\nmoderate confidence that this malicious document was used by a nation-state to target a\nRussian-speaking entity for cyber espionage purposes. Additional detections by FireEye’s\nDynamic Threat Intelligence system indicates that related activity, though potentially for a\ndifferent client, might have occurred as early as July 2017.\n\n**CVE-2017-8759 WSDL Parser Code Injection**\n\nA code injection vulnerability exists in the WSDL parser module within the PrintClientProxy\nmethod (http://referencesource.microsoft.com/ System.Runtime.Remoting/metadata/wsdlparser.cs,6111). The IsValidUrl does not perform\ncorrect validation if provided data that contains a CRLF sequence. This allows an attacker to\ninject and execute arbitrary code. A portion of the vulnerable code is shown in Figure 1.\n\n\n-----\n\nVulnerable WSDL Parser\n\n\nFigure 1: Vulnerable WSDL Parser\nWhen multiple address definitions are provided in a SOAP response, the code inserts the\n“//base.ConfigureProxy(this.GetType(),” string after the first address, commenting out the\nremaining addresses. However, if a CRLF sequence is in the additional addresses, the code\nfollowing the CRLF will not be commented out. Figure 2 shows that due to lack validation of\nCRLF, a System.Diagnostics.Process.Start method call is injected. The generated code will\nbe compiled by csc.exe of .NET framework, and loaded by the Office executables as a DLL.\n\n\n-----\n\nSOAP definition VS Generated code\n\n\nFigure 2: SOAP definition VS Generated code\n\n**The In-the-Wild Attacks**\n\nThe attacks that FireEye observed in the wild leveraged a Rich Text Format (RTF) document,\n[similar to the CVE-2017-0199 documents we previously reported on. The malicious sampled](https://www.fireeye.com/resources/cve-2017-0199-wild-attacks-leveraging-hta-handler)\ncontained an embedded SOAP monikers to facilitate exploitation (Figure 3).\n\n\n-----\n\nSOAP Moniker\n\n\nFigure 3: SOAP Moniker\nThe payload retrieves the malicious SOAP WSDL definition from an attacker-controlled\nserver. The WSDL parser, implemented in System.Runtime.Remoting.ni.dll of .NET\nframework, parses the content and generates a .cs source code at the working directory. The\ncsc.exe of .NET framework then compiles the generated source code into a library, namely\nhttp[url path].dll. Microsoft Office then loads the library, completing the exploitation stage.\nFigure 4 shows an example library loaded as a result of exploitation.\n\n\n-----\n\nDLL loaded\n\n\nFigure 4: DLL loaded\nUpon successful exploitation, the injected code creates a new process and leverages\nmshta.exe to retrieve a HTA script named “word.db” from the same server. The HTA script\nremoves the source code, compiled DLL and the PDB files from disk and then downloads\nand executes the FINSPY malware named “left.jpg,” which in spite of the .jpg extension and\n“image/jpeg” content-type, is actually an executable. Figure 5 shows the details of the PCAP\nof this malware transfer.\n\n\n-----\n\nLive requests\n\n\nFigure 5: Live requests\nThe malware will be placed at %appdata%\\Microsoft\\Windows\\OfficeUpdte-KB[ 6 random\nnumbers ].exe. Figure 6 shows the process create chain under Process Monitor.\n\n\n-----\n\nProcess Created Chain\n\n\nFigure 6: Process Created Chain\n\n**The Malware**\n\nThe “left.jpg” (md5: a7b990d5f57b244dd17e9a937a41e7f5) is a variant of FINSPY. It\nleverages heavily obfuscated code that employs a built-in virtual machine – among other\nanti-analysis techniques – to make reversing more difficult. As likely another unique antianalysis technique, it parses its own full path and searches for the string representation of its\nown MD5 hash. Many resources, such as analysis tools and sandboxes, rename\nfiles/samples to their MD5 hash in order to ensure unique filenames. This variant runs with a\nmutex of \"WininetStartupMutex0\".\n\n**Conclusion**\n\n\n-----\n\nCVE-2017-8759 is the second zero-day vulnerability used to distribute FINSPY uncovered by\nFireEye in 2017. These exposures demonstrate the significant resources available to “lawful\nintercept” companies and their customers. Furthermore, FINSPY has been sold to multiple\nclients, suggesting the vulnerability was being used against other targets.\n\nIt is possible that CVE-2017-8759 was being used by additional actors. While we have not\nfound evidence of this, the zero day being used to distribute FINSPY in April 2017, CVE2017-0199 was simultaneously being used by a financially motivated actor. If the actors\nbehind FINSPY obtained this vulnerability from the same source used previously, it is\npossible that source sold it to additional actors.\n\n**Acknowledgement**\n\nThank you to Dhanesh Kizhakkinan, Joseph Reyes, FireEye Labs Team, FireEye FLARE\nTeam and [FireEye iSIGHT Intelligence for their contributions to this blog. We also thank](https://www.fireeye.com/mandiant/threat-intelligence/threat-intelligence-subscriptions.html%23dismiss-lightbox)\neveryone from the Microsoft Security Response Center (MSRC) who worked with us on this\nissue.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-09-12 - FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY,FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY.pdf"
    ],
    "report_names": [
        "2017-09-12 - FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY,FireEye Uncovers CVE-2017-8759- Zero-Day Used in the Wild to Distribute FINSPY.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535658,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653760618,
    "ts_modification_date": 1653760618,
    "files": {
        "pdf": "https://archive.orkl.eu/e0173ffe9d7614103b64211c5c393ac0e2bb258e.pdf",
        "text": "https://archive.orkl.eu/e0173ffe9d7614103b64211c5c393ac0e2bb258e.txt",
        "img": "https://archive.orkl.eu/e0173ffe9d7614103b64211c5c393ac0e2bb258e.jpg"
    }
}