{
    "id": "4e9348f3-34b2-45d5-8b06-13d50b8439ba",
    "created_at": "2023-01-12T15:10:44.920722Z",
    "updated_at": "2025-03-27T02:16:26.513929Z",
    "deleted_at": null,
    "sha1_hash": "2465f52396e916dd75e0404bd5336cac2f95ba1c",
    "title": "2022-06-23 - Spyware vendor targets users in Italy and Kazakhstan",
    "authors": "",
    "file_creation_date": "2022-07-02T23:20:40Z",
    "file_modification_date": "2022-07-02T23:20:40Z",
    "file_size": 615745,
    "plain_text": "# Spyware vendor targets users in Italy and Kazakhstan\n\n**[blog.google/threat-analysis-group/italian-spyware-vendor-targets-users-in-italy-and-kazakhstan/](https://blog.google/threat-analysis-group/italian-spyware-vendor-targets-users-in-italy-and-kazakhstan/)**\n\nBenoit Sevens June 23, 2022\n\n[Google has been tracking the activities of commercial spyware vendors for years, and taking](https://blog.google/threat-analysis-group/protecting-android-users-from-0-day-attacks/)\n[steps to protect people. Just last week, Google testified at the EU Parliamentary hearing on](https://twitter.com/charley_snyder_/status/1536644164825276416?s=20&t=YRRaJ_bKrw53v9Q07uokrw)\n“Big Tech and Spyware” about the work we have done to monitor and disrupt this thriving\nindustry.\n\nSeven of the nine zero-day vulnerabilities our Threat Analysis Group discovered in 2021 fall\ninto this category: developed by commercial providers and sold to and used by governmentbacked actors. TAG is actively tracking more than 30 vendors with varying levels of\nsophistication and public exposure selling exploits or surveillance capabilities to governmentbacked actors.\n\nOur findings underscore the extent to which commercial surveillance vendors have\nproliferated capabilities historically only used by governments with the technical expertise to\ndevelop and operationalize exploits. This makes the Internet less safe and threatens the trust\non which users depend.\n\n[Today, alongside Google’s Project Zero, we are detailing capabilities we attribute to RCS](https://googleprojectzero.blogspot.com/2022/06/curious-case-carrier-app.html)\nLabs, an Italian vendor that uses a combination of tactics, including atypical drive-by\ndownloads as initial infection vectors, to target mobile users on both iOS and Android. We\nhave identified victims located in Italy and Kazakhstan.\n\n## Campaign Overview\n\nAll campaigns TAG observed originated with a unique link sent to the target. Once clicked,\nthe page attempted to get the user to download and install a malicious application on either\nAndroid or iOS. In some cases, we believe the actors worked with the target’s ISP to disable\nthe target’s mobile data connectivity. Once disabled, the attacker would send a malicious link\nvia SMS asking the target to install an application to recover their data connectivity. We\nbelieve this is the reason why most of the applications masqueraded as mobile carrier\napplications. When ISP involvement is not possible, applications are masqueraded as\nmessaging applications.\n\n\n-----\n\nAn example screenshot from one of the attacker controlled sites, www.fb-techsupport[.]com.\n\n\n-----\n\nThe page, in Italian, asks the user to install one of these applications in order to recover their\naccount. Looking at the code of the page, we can see that only the WhatsApp download links\nare pointing to attacker controlled content for Android and iOS users.\n\n## iOS Drive-By\n\nTo distribute the iOS application, attackers simply followed Apple instructions on how to\n[distribute proprietary in-house apps to Apple devices and used the itms-services protocol](https://support.apple.com/en-bw/guide/deployment/depce7cefc4d/web)\nwith the following manifest file and using com.ios.Carrier as the identifier.\n\n\n-----\n\nThe resulting application is signed with a certificate from a company named 3-1 Mobile SRL\n(Developer ID: 58UP7GFWAA). The certificate satisfies all of the iOS code signing\nrequirements on any iOS devices because the company was enrolled in the Apple Developer\nEnterprise Program.\n\nThese apps still run inside the iOS app sandbox and are subject to the exact same technical\nprivacy and security enforcement mechanisms (e.g. code side loading) as any App Store\napps. They can, however, be sideloaded on any device and don't need to be installed via the\nApp Store. We do not believe the apps were ever available on the App Store.\n\nThe app is broken up into multiple parts. It contains a generic privilege escalation exploit\nwrapper which is used by six different exploits. It also contains a minimalist agent capable of\nexfiltrating interesting files from the device, such as the Whatsapp database.\n\nThe app we analyzed contained the following exploits:\n\n[CVE-2018-4344 internally referred to and publicly known as LightSpeed](https://cve.mitre.org/cgi-bin/cvename.cgi?name=2018-4344)\n\n\n-----\n\n[CVE-2019-8605 internally referred to as SockPort2 and publicly known as SockPuppet](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-8605)\n[CVE-2020-3837 internally referred to and publicly known as TimeWaste.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-3837)\n[CVE-2020-9907 internally referred to as AveCesare.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-9907)\n[CVE-2021-30883 internally referred to as Clicked2, marked as being exploited in-the-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30883)\nwild by Apple in October 2021.\n[CVE-2021-30983 internally referred to as Clicked3, fixed by Apple in December 2021.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30983)\n\nAll exploits used before 2021 are based on public exploits written by different jailbreaking\n[communities. At the time of discovery, we believe CVE-2021-30883 and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30883) [CVE-2021-30983](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30983)\nwere two 0-day exploits. In collaboration with TAG, Project Zero has [published the technical](https://googleprojectzero.blogspot.com/2022/06/curious-case-carrier-app.html)\nanalysis of CVE-2021-30983.\n\n## Android Drive-By\n\nInstalling the downloaded APK requires the victim to enable installation of applications from\nunknown sources. Although the applications were never available in Google Play, we have\nnotified the Android users of infected devices and implemented changes in Google Play\nProtect to protect all users.\n\n**Android Implant**\n\nThis analysis is based on\n[fe95855691cada4493641bc4f01eb00c670c002166d6591fe38073dd0ea1d001 that was](https://www.virustotal.com/gui/file/fe95855691cada4493641bc4f01eb00c670c002166d6591fe38073dd0ea1d001/)\nuploaded to VirusTotal on May 27. We have not identified many differences across versions.\n[This is the same malware family that was described in detail by Lookout on June 16.](https://www.lookout.com/blog/hermit-spyware-discovery)\n\nThe Android app disguises itself as a legitimate Samsung application via its icon:\n\n[When the user launches the application, a webview is opened that displays a legitimate](https://developer.android.com/reference/android/webkit/WebView)\nwebsite related to the icon.\n\nUpon installation, it requests many permissions via the Manifest file:\n\n\n-----\n\nThe configuration of the application is contained in the res/raw/out resource file. The\nconfiguration is encoded with a 105-byte XOR key. The decoding is performed by a native\nlibrary libvoida2dfae4581f5.so that contains a function to decode the configuration. A\nconfiguration looks like the following:\n\n\n-----\n\nOlder samples decode the configuration in the Java code with a shorter XOR key.\n\nThe C2 communication in this sample is via Firebase Cloud Messaging, while in other\nsamples, Huawei Messaging Service has been observed in use. A second C2 server is\nprovided for uploading data and retrieving modules.\n\nWhile the APK itself does not contain any exploits, the code hints at the presence of exploits\nthat could be downloaded and executed. Functionality is present to fetch and run remote\nmodules via the DexClassLoader API. These modules can communicate events to the main\napp. The names of these events show the capabilities of these modules:\n\n\n-----\n\nTAG did not obtain any of the remote modules.\n\n## Protecting Users\n\nThis campaign is a good reminder that attackers do not always use exploits to achieve the\npermissions they need. Basic infection vectors and drive by downloads still work and can be\nvery efficient with the help from local ISPs.\n\nTo protect our users, we have warned all Android victims, implemented changes in Google\nPlay Protect and disabled Firebase projects used as C2 in this campaign.\n\n## How Google is Addressing the Commercial Spyware Industry\n\nWe assess, based on the extensive body of research and analysis by TAG and Project Zero,\nthat the commercial spyware industry is thriving and growing at a significant rate. This trend\nshould be concerning to all Internet users.\n\nThese vendors are enabling the proliferation of dangerous hacking tools and arming\ngovernments that would not be able to develop these capabilities in-house. While use of\nsurveillance technologies may be legal under national or international laws, they are often\nfound to be used by governments for purposes antithetical to democratic values: targeting\ndissidents, journalists, human rights workers and opposition party politicians.\n\nAside from these concerns, there are other reasons why this industry presents a risk to the\nInternet. While vulnerability research is an important contributor to online safety when that\nresearch is used to improve the security of products, vendors stockpiling zero-day\nvulnerabilities in secret poses a severe risk to the Internet especially if the vendor gets\ncompromised. This has happened to multiple spyware vendors over the past ten years,\nraising the specter that their stockpiles can be released publicly without warning.\n\nThis is why when Google discovers these activities, we not only take steps to protect users,\nbut also disclose that information publicly to raise awareness and help the entire ecosystem,\nin line with our historical commitment to openness and democratic values.\n\n\n-----\n\nTackling the harmful practices of the commercial surveillance industry will require a robust,\ncomprehensive approach that includes cooperation among threat intelligence teams, network\ndefenders, academic researchers, governments and technology platforms. We look forward\nto continuing our work in this space and advancing the safety and security of our users\naround the world.\n\n## Indicators of Compromise\n\n**Sample hashes**\n\nAPK available on VirusTotal:\n\ne38d7ba21a48ad32963bfe6cb0203afe0839eca9a73268a67422109da282eae3\nfe95855691cada4493641bc4f01eb00c670c002166d6591fe38073dd0ea1d001\n243ea96b2f8f70abc127c8bc1759929e3ad9efc1dec5b51f5788e9896b6d516e\na98a224b644d3d88eed27aa05548a41e0178dba93ed9145250f61912e924b3e9\nc26220c9177c146d6ce21e2f964de47b3dbbab85824e93908d66fa080e13286f\n0759a60e09710321dfc42b09518516398785f60e150012d15be88bbb2ea788db\n8ef40f13c6192bd8defa7ac0b54ce2454e71b55867bdafc51ecb714d02abfd1a\n9146e0ede1c0e9014341ef0859ca62d230bea5d6535d800591a796e8dfe1dff9\n6eeb683ee4674fd5553fdc2ca32d77ee733de0e654c6f230f881abf5752696ba\n\n**Drive-by download domains**\n\nfb-techsupport[.]com\n119-tim[.]info\n133-tre[.]info\n146-fastweb[.]info\n155-wind[.]info\n159-windtre[.]info\niliad[.]info\nkena-mobile[.]info\nmobilepays[.]info\nmy190[.]info\nposte-it[.]info\nho-mobile[.]online\n\n**C2 domains**\n\nproject1-c094e[.]appspot[.]com\nfintur-a111a[.]appspot[.]com\nsafekeyservice-972cd[.]appspot[.]com\ncomxdjajxclient[.]appspot[.]com\ncomtencentmobileqq-6ffb5[.]appspot[.]com\n\n\n-----\n\n**C2 IPs**\n\n93[.]39[.]197[.]234\n45[.]148[.]30[.]122\n2[.]229[.]68[.]182\n2[.]228[.]150[.]86\n\nPOSTED IN:\n\n[Threat Analysis Group](https://blog.google/threat-analysis-group/%20)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-23 - Spyware vendor targets users in Italy and Kazakhstan.pdf"
    ],
    "report_names": [
        "2022-06-23 - Spyware vendor targets users in Italy and Kazakhstan.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536244,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1656804040,
    "ts_modification_date": 1656804040,
    "files": {
        "pdf": "https://archive.orkl.eu/2465f52396e916dd75e0404bd5336cac2f95ba1c.pdf",
        "text": "https://archive.orkl.eu/2465f52396e916dd75e0404bd5336cac2f95ba1c.txt",
        "img": "https://archive.orkl.eu/2465f52396e916dd75e0404bd5336cac2f95ba1c.jpg"
    }
}