{
    "id": "4e94f59f-c07b-4e2c-a08a-62638664fc5e",
    "created_at": "2023-01-12T15:00:16.229955Z",
    "updated_at": "2025-03-27T02:13:08.218748Z",
    "deleted_at": null,
    "sha1_hash": "4c55a66c24f4315367c268ab048ae7bb330fcd68",
    "title": "2021-11-04 - Caught Beneath the Landline- A 411 on Telephone Oriented Attack Delivery",
    "authors": "",
    "file_creation_date": "2022-05-28T05:10:57Z",
    "file_modification_date": "2022-05-28T05:10:57Z",
    "file_size": 4646650,
    "plain_text": "# Caught Beneath the Landline: A 411 on Call Center Scams\n\n**[proofpoint.com/us/blog/threat-insight/caught-beneath-landline-411-telephone-oriented-attack-delivery](https://www.proofpoint.com/us/blog/threat-insight/caught-beneath-landline-411-telephone-oriented-attack-delivery)**\n\nOctober 29, 2021\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nCaught Beneath the Landline: A 411 on Call Center Scams\n\n\n-----\n\nNovember 04, 2021 Selena Larson, Sam Scholten and Timothy Kromphardt\n\n## Key Takeaways\n\nProofpoint researchers observe tens of thousands of telephone oriented cyberattacks\ndaily.\nThere are two types of these threats regularly observed by Proofpoint. One features\ntraditional call center fraud, such as fake tech support, to steal money. The second\n[leverages call centers to distribute malware that could be used for secondary](https://www.proofpoint.com/us/threat-reference/malware)\ncompromises.\nProofpoint is aware of individual victims losing nearly $50,000 per attack. It is likely that\nnumber is greater.\n[Malware distributed in some of the observed campaigns could lead to ransomware and](https://www.proofpoint.com/us/threat-reference/ransomware)\npose a greater risk to business operations.\n\n## Overview\n\nProofpoint researchers have observed an increase in attacks perpetuated by threat actors\nleveraging a robust ecosystem of call center-based email threats. The attacks rely on victims\nto call the attackers directly and initiate the interaction. Email fraud supported by call center\ncustomer service agents is prolific and profitable. In many cases, victims lose tens of\nthousands of dollars stolen directly from their bank accounts.\n\nThere are two types of call center threat activity regularly observed by Proofpoint. One uses\nfree, legitimate remote assistance software to steal money. The second leverages the use of\nmalware disguised as a document to compromise a computer and can lead to follow-on\nmalware. The second attack type is frequently associated with BazaLoader malware and is\noften referred to as BazaCall. Both attack types are what Proofpoint considers telephone**oriented attack delivery (TOAD).**\n\n\n-----\n\n**TOAD**\n\nFraud BazaCall\n\nPhone-based X X\n\nInitial objective: financial gain X\n\nInitial objective: malware installation X\n\nUses commercially available remote access software X\n\nLeads to follow on activity X\n\nIn recent attacks, threat actors email a victim claiming to be representatives from entities like\nJustin Bieber ticket sellers, computer security services, COVID-19 relief funds, or online\nretailers, promising refunds for mistaken purchases, software updates, or financial support.\nThe emails contain a phone number for customer assistance. When the victims call the\nnumber for help, they are connected with a malicious call center attendant directly and the\nattack begins.\n\nProofpoint detects and blocks tens of thousands of email threats related to TOAD every day.\nOur researchers tracked down the perpetrators to multiple areas of operations, and through\nemail data, phone conversations, and message and infrastructure artifacts, can now provide\nan exclusive look at how the thriving call center threat business profits on lies.\n\n## Call Center Threats\n\nMost consumers are familiar with phone-based fraud and regularly receive unsolicited phone\ncalls from people pretending to be, for instance, tech support or the Department of Motor\n[Vehicles. According to a 2021 study conducted by Truecaller, nearly 60 million Americans](https://truecaller.blog/2021/06/28/us-spam-scam-report-21/)\nhave reportedly lost money due to phone fraud, losing $29.8 billion between 2020 and 2021.\nThe recent spike in TOAD threats observed by Proofpoint is a subset of these threats,\ncombining old-fashioned phone fraud with unsolicited emails as an initial communication\nvector.\n\nThese types of attacks include elaborate infection chains requiring significant victim\ninteraction to infiltrate a victim’s computer or smartphone. The threat actor sends an email\ntypically with a receipt for a large purchase masquerading as a company or organization and\ninstructs the recipient to call the number in the email to cancel or dispute their purchase. The\nemail address is usually a Gmail Yahoo or other freemail account If the user calls the\n\n\n-----\n\nphone number provided in the email, a customer service representative will verbally guide\nthe user to visit a website or mobile app store. They will guide them through different types of\nuser interaction such as downloading a malicious file, allowing them to remotely access their\nmachine, or downloading a malicious application for remote access.\n\nWhile the two distinct TOAD types begin the same – victim receives an email and is directed\nto call a customer service representative – the attack paths diverge depending on the\nobjective.\n\nFinancial extortion actors typically use invoice lures associated with companies like Amazon,\nPaypal, or security software. Once a person calls the number listed in the email, the actor will\ndirect the victim to install remote access software such as AnyDesk, Teamvier, Zoho, etc.\nand provide them access to interact with the machine under the guise of customer service.\nOften, the victim is directed to login to their bank account to get a refund, or purchase gift\ncards. Once the attacker is connected, they blackout the screen to hide their activities. They\nmight edit the HTML of the banking webpage to show a different amount or attempt to steal\nthe money directly.\n\n_Figure 1: Financially motivated attack path._\n\nIn malware focused attacks like BazaCall, the invoice lures are often more elaborate,\n[including themes such as Justin Bieber concerts, lingerie, and](https://www.proofpoint.com/us/blog/threat-insight/baza-valentines-day) [fake movie sites. The victim is](https://www.proofpoint.com/us/blog/threat-insight/bazaflix-bazaloader-fakes-movie-streaming-service)\ndirected to a malicious website where they are told to download a document to facilitate a\nrefund, but instead are infected with malware.\n\n_Figure 2: BazaCall attack path._\n\n\n-----\n\nOnce the attackers have obtained access to the device, they can access banking, email, and\nother private accounts or download follow-on malware including ransomware. By leveraging\nattack chains that require a lot of human interaction, threat actors can bypass some\nautomated threat detection services that only flag on malicious links or attachments in email.\n\n## Popular Call Center Lures\n\nThe lures and themes threat actors send to victims vary, from very low effort attempts to\nleveraging legitimate branding and document downloads. Our researchers frequently engage\nwith threat actors to better understand the attack paths and behaviors exhibited by these\nactors.\n\n**PayPal Lure**\n\nFor example, our researcher identified a financially motivated TOAD threat masquerading as\na PayPal invoice from a U.S. weapons manufacturer.\n\n_Figure 3: PayPal lure masquerading as the U.S. company Springfield Armory._\n\nOur researcher called the number in the invoice and connected with “David” pretending to be\na PayPal representative. “David” followed a script and told our researcher to download\nAnyDesk and login to his bank account. The attacker also claimed that someone had tried to\npurchase a weapon using his PayPal account and warned him that “hackers” regularly\naccess people’s accounts to make purchases. In total, the conversation took approximately\nan hour.\n\n**Justin Bieber Lure**\n\nOther campaigns use pop culture themed lures, including posing as ticket sellers to The\nWeeknd concerts or the upcoming 2022 Justin Bieber world tour. These lures are associated\nwith BazaCall threats When our researcher called the number in the Justin Bieber email he\n\n\n-----\n\nwas immediately placed on hold with the pop star s music.\n\n_Figure 4: Justin Bieber themed email purporting to be tickets for an upcoming concert._\n\nWhen our researcher called the BazaCall threat actors, a person named “John Edwards”\nclaimed someone had erroneously placed an order on his credit card and to visit\nziddat[.]com/code.exe to get a refund. Our researcher downloaded the executable in a virtual\nmachine, and told “John” nothing came up on the screen. BazaLoader was successfully\ndownloaded, and “John” said he could take care of the issue before abruptly hanging up. In\ntotal, the call took approximately 10 minutes.\n\n## Threat Actors\n\nAlthough it is difficult to narrow down activity into specific threat activity groups associated\nwith TOAD threats, Proofpoint researchers have identified multiple activity clusters located in\nIndia. Most of the activity occurs in three cities: Kolkata, Mumbai, and New Delhi.\n\n\n-----\n\nProofpoint was able to pin down multiple physical locations of activity clusters based on the\nthreat actors’ interactions with Proofpoint researchers as well as open-source information\nshared on fraud forums and YouTube. The following map represents a sample of identified\ncall centers.\n\n_Figure 5: Locations of TOAD threat operators._\n\nDuring our research, threat actors accessed researchers’ computers directly, and Proofpoint\nresearchers were able to siphon data such as IP information from the remote access\nconnections. Additionally, some independent “scam baiters” have remote access to threat\n[actors’ physical location and share their findings on YouTube and](https://www.youtube.com/watch?v=tpzUjYYUp-Q&ab_channel=Scambaiter) [TikTok.](https://www.tiktok.com/amp/tag/scambaiting?lang=en)\n\n\n-----\n\nBased on [publicly available information, Proofpoint was able to identify the office allegedly](https://www.youtube.com/watch?v=tpzUjYYUp-Q&ab_channel=Scambaiter)\nused by one cluster of tech support TOAD actors located in Kolkata.\n\n_Figure 6: Matrix Tower in Kolkata where TOAD threat actors allegedly operate listed on a_\n_property management company website._\n\nThese threat actors reportedly targeted people in Germany, the U.S., Australia, and India\nwith fraudulent tech support claims.\n\nMalicious call centers are architected like legitimate businesses. Owners sign leases on\nbuildings purporting to be telemarketers or other phone-based businesses, and recruit local\njobseekers to support the operation. Due to job scarcity in areas of operation and potential\n[for higher earnings than alternative employment, the lucrative phone fraud jobs are alluring.](https://www.nytimes.com/2021/01/27/magazine/scam-call-centers.html)\nWhile conducting calls with the threat actors, Proofpoint researchers overheard floor\nmanagers guiding employees through a script on how to speak to victims. Employees’ pay\n[varies. According to the BBC, earnings may start at 1 rupee for every $1 stolen and increase](https://www.bbc.com/news/stories-51753362)\nto $50,000 per month.\n\n\n-----\n\nWhile financially motivated and malware-focused TOAD actors have similar techniques,\nProofpoint researchers have observed that BazaLoader threat actors do not appear to use\nphysical call center facilities, and fake customer service agents are usually not located in\nIndia. Proofpoint assesses with moderate confidence the actors use inbound call center\nsoftware then route the calls to geographically dispersed customer service agents. The\nagents distributing BazaLoader do not remotely access victims’ machines; rather they direct\nthem to a website to download a malicious file that loads the malware. Thus, the fake\ncustomer service agents do not require as much technical aptitude as other cybercrime\nactors.\n\nThe increasingly widespread adoption of threats requiring victims to initiate engagement with\ntheir attackers indicates that participants in the cybercriminal ecosystem likely learn from\neach other and will shape tactics, techniques, and procedures (TTPs) based on efficacy\nobserved by their fellow threat actors.\n\n## Victimology\n\nCall center-based email threat actors do not appear to specifically target people via\ndemographics, jobs, location, etc., but likely procure their contact lists from legitimate data\nbrokerages or other telemarketer resources. And while the public typically hears about\nactivities impacting victims from vulnerable communities including the elderly and disabled,\n[according to the 2021 TrueCaller report, men are impacted more than women, and younger](https://truecaller.blog/2021/06/28/us-spam-scam-report-21/)\nmen are more likely than older men to be victims of a phone scam. (Analyst note: This data\n_includes all phone-based spam and scams and are not specific to call center-based email_\n_threats.)_\n\nLike many victims of crime, people who lose money to cyberattacks may feel ashamed and\nembarrassed, and do not share details of what occurred. This makes it difficult for\nresearchers, law enforcement, and the public to understand the true number of people\nimpacted by call center-based email fraud. But the losses can be life-altering. Proofpoint is\naware of victims losing nearly $50,000 in one attack, with the threat actor masquerading as a\nNortonLifeLock representative. And the fallout of cybercrime – like the financial toll, and\n[emotional well-being – reportedly disproportionally impact Black, Indigenous, and people of](https://www.cyberscoop.com/cybercrime-demographics-bipoc-malwarebytes/)\ncolor (BIPOC) communities.\n\n\n-----\n\n_Figure 7: Known victim of TOAD threat._\n\n## Impacts to Organizations\n\nTOAD threat actor targeting is indiscriminate and includes both personal email accounts –\nGmail, Yahoo, Hotmail, etc. – and corporate email addresses. Proofpoint has observed\nBazaCall operators targeting employees of large organizations, and a successful infection\ncould compromise the entire enterprise network leading to follow on attacks such\nas [ransomware.](https://www.proofpoint.com/us/blog/threat-insight/first-step-initial-access-leads-ransomware)\n\nTargeting individuals’ private email addresses could have follow-on impacts to corporations.\nFor example, as COVID-19 has caused a shift to remote work, more people are accessing\npersonal information online from work devices or accounts. Additionally, TeamViewer and\nAnyDesk are legitimate enterprise software services that may be already installed on\ncorporate machines; if the software allows external connections, the activity could bypass\nother enterprise security protections that may be in place to detect and block remote access\nattempts. A threat actor may successfully obtain remote access to a corporate managed\ndevice and install malware that could facilitate follow-on activity such as ransomware.\n\nProofpoint assesses small and medium-sized businesses are at greatest risk for TOAD\nthreats impacting the corporate environment.\n\n**APPENDIX**\n\nThe following is a list of company names Proofpoint regularly observes in call center-based\nemail threat campaigns.\n\nNorton\nMcafee\nEbay\nNort-Pro\nPayPal\nGeekSquad\nNortonLifeLock\n\n\n-----\n\nCovid-19 relief /AOL Fund\nAOL Committee\nVakıfBank\nSantander Bank\nIMF Giving\nAmazon\nJustin Bieber Justice World Tour\nThe Weeknd T O U R\nSpringfield Armory\nSymantec\nMeagher Auto Insurance\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-04 - Caught Beneath the Landline- A 411 on Telephone Oriented Attack Delivery.pdf"
    ],
    "report_names": [
        "2021-11-04 - Caught Beneath the Landline- A 411 on Telephone Oriented Attack Delivery.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535616,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653714657,
    "ts_modification_date": 1653714657,
    "files": {
        "pdf": "https://archive.orkl.eu/4c55a66c24f4315367c268ab048ae7bb330fcd68.pdf",
        "text": "https://archive.orkl.eu/4c55a66c24f4315367c268ab048ae7bb330fcd68.txt",
        "img": "https://archive.orkl.eu/4c55a66c24f4315367c268ab048ae7bb330fcd68.jpg"
    }
}