{
    "id": "4ecddf39-3f14-4d68-af86-a42ac9ba4265",
    "created_at": "2023-01-12T15:06:54.43648Z",
    "updated_at": "2025-03-27T02:06:08.634678Z",
    "deleted_at": null,
    "sha1_hash": "054420241f6550aca6afd341885f3f5deb7bd376",
    "title": "2021-04-21 - Codecov hackers breached hundreds of restricted customer sites - sources",
    "authors": "",
    "file_creation_date": "2022-05-28T15:54:49Z",
    "file_modification_date": "2022-05-28T15:54:49Z",
    "file_size": 71610,
    "plain_text": "# Codecov hackers breached hundreds of restricted customer sites - sources\n\n**[reuters.com/technology/codecov-hackers-breached-hundreds-restricted-customer-sites-sources-2021-04-19/](https://www.reuters.com/technology/codecov-hackers-breached-hundreds-restricted-customer-sites-sources-2021-04-19/)**\n\nJoseph Menn, Raphael Satter\n\nRegister now for FREE unlimited access to Reuters.com\n\nSAN FRANCISCO, April 19 (Reuters) - Hackers who tampered with a software development\ntool from a company called Codecov used that program to gain restricted access to\nhundreds of networks belonging to the San Francisco firm's customers, investigators told\nReuters.\n\nCodecov makes software auditing tools that allow developers to see how thoroughly their\nown code is being tested, a process that can give the tool access to stored credentials for\nvarious internal software accounts.\n\nThe attackers used automation to rapidly copy those credentials and raid additional\nresources, the investigators said, expanding the breach beyond the initial disclosure by\n[Codecov on Thursday. read more](https://www.reuters.com/technology/us-investigators-probing-breach-san-francisco-code-testing-company-firm-2021-04-16/)\n\nRegister now for FREE unlimited access to Reuters.com\n\nThe hackers put extra effort into using Codecov to get inside other makers of software\ndevelopment programs, as well as companies that themselves provide many customers with\ntechnology services, including IBM, one of the investigators said on condition of anonymity.\n\n\n-----\n\nThe person said both methods would allow the hackers to potentially gain credentials for\nthousands of other restricted systems.\n\nIBM and other companies said that their code had not been altered, but did not address\nwhether access credentials to their systems had been taken.\n\n\"We are investigating the reported Codecov incident and have thus far found no\nmodifications of code involving clients or IBM,\" an IBM spokeswoman said.\n\nThe FBI's San Francisco office is investigating the compromises, and dozens of likely victims\nwere notified on Monday. Private security companies were already beginning to respond to\nassist multiple clients, employees said.\n\nCodecov did not respond to Reuters' request for comment on Monday.\n\nSecurity experts involved in the case said the scale of the attack and the skills needed\ncompared to last year's SolarWinds attack. The compromise of that company's widely used\nnetwork management program led hackers inside nine U.S. government agencies and about\n100 private companies.\n\nIt is unclear who is behind the latest breach or if they are working for a national government,\n[as was the case with SolarWinds. read more](https://www.reuters.com/business/white-house-blames-russian-spy-agency-svr-solarwinds-hack-statement-2021-04-15/)\n\nOthers among Codecov's 19,000 customers, including big tech services provider Hewlett\n[Packard Enterprise (HPE.N), said they were still trying to determine if they or their customers](https://www.reuters.com/companies/HPE.N)\nhad been hurt.\n\n\"HPE has a dedicated team of professionals investigating this matter, and customers should\nrest assured we will keep them informed of any impacts and necessary remedies as soon as\nwe know more,\" said HPE spokesman Adam Bauer.\n\nEven Codecov users who had seen no evidence of hacking were taking the breach seriously,\na corporate cybersecurity official told Reuters. He said his company was busy resetting its\ncredentials and that his counterparts elsewhere were doing the same, as Codecov\nrecommended.\n\nCodecov earlier said hackers began tampering with its software on Jan. 31. It was only\ndetected earlier this month when a customer raised concerns.\n\nCodecov's website says its customers include consumer goods conglomerate Procter &\n[Gamble Co, (PG.N) web hosting firm GoDaddy Inc, (GDDY.N) The Washington Post, and](https://www.reuters.com/companies/PG.N)\n[Australian software firm Atlassian Corporation PLC (TEAM.O). Atlassian said it had not yet](https://www.reuters.com/companies/TEAM.O)\nseen any impact nor signs of a compromise.\n\nThe Department of Homeland Security's cybersecurity arm and the FBI declined to comment.\n\n\n-----\n\nRegister now for FREE unlimited access to Reuters.com\n\nReporting by Joseph Menn, Raphael Satter and Christopher Bing; Editing by Sam Holmes\n\nOur Standards: [The Thomson Reuters Trust Principles.](https://www.thomsonreuters.com/en/about-us/trust-principles.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-21 - Codecov hackers breached hundreds of restricted customer sites - sources.pdf"
    ],
    "report_names": [
        "2021-04-21 - Codecov hackers breached hundreds of restricted customer sites - sources.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536014,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653753289,
    "ts_modification_date": 1653753289,
    "files": {
        "pdf": "https://archive.orkl.eu/054420241f6550aca6afd341885f3f5deb7bd376.pdf",
        "text": "https://archive.orkl.eu/054420241f6550aca6afd341885f3f5deb7bd376.txt",
        "img": "https://archive.orkl.eu/054420241f6550aca6afd341885f3f5deb7bd376.jpg"
    }
}