{
    "id": "4ef3aa23-e758-40f7-867e-9937af0035fa",
    "created_at": "2022-10-25T16:48:11.164051Z",
    "updated_at": "2025-03-27T02:17:14.567411Z",
    "deleted_at": null,
    "sha1_hash": "b74baf46be77a5cf227622de8617e50b80573388",
    "title": "P01_P10_eng",
    "authors": "",
    "file_creation_date": "2020-06-18T12:22:50Z",
    "file_modification_date": "2020-06-18T12:25:39Z",
    "file_size": 11389330,
    "plain_text": "###### May 1, 2020\n\n Macnica Networks\n\n TeamT5\n\n\n-----\n\nAlthough the information contained in this document is based on sources that Macnica Networks has judged to be reliable, Macnica\nNetworks does not guarantee the accuracy of those sources. This document may also include the opinions of the authors, which are\nsubject to change. The copyright of this document is held by Macnica Networks and TeamT5. Reproduction or redistribution of this\ndocument, either in whole or in part, by any means, be it in hard-copy form or electronically, or by any other method, without the prior\nconsent of Macnica Networks or TeamT5, is prohibited.\n\n\n-----\n\n## Table of contents\n\n##### Introduction ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 2\n\n Targeted industries and trends of observed cyber attacks ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 3\n\n Timeline and summary of attacks ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 4\n\n###### September 2019 (Chemical) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 4\n\n December 2019 (Media) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 5\n\n January 2020 (Defense) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 5\n\n February 2020 (IT services) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 6\n\n##### New TTPs and RATs ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 7\n\n###### Tick ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 7\n\n BlackTech ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 18\n\n LODEINFO ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 23\n\n##### About attack groups ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 29\n\n###### Tick (Nian) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 29\n\n BlackTech (Huapi) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 30\n\n##### TTPs (Tactics, Techniques, and Procedures) of each attack group ・・・・・・・・・・・・・・・・・・・ 31\n\n Conclusion ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 33\n\n Indicators of Compromise (IOCs) ・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・ 34\n\n\n-----\n\n## Introduction\n\nThis report is a public release of research that Macnica Networks and TeamT5 have conducted into the cyber espionage\n\ngroups targeting organizations in Taiwan and Japan.\n\nIt has been created to bring awareness to attack campaigns observed in the 2019 fiscal year (April 2019 to March 2020)\n\nthat were perpetrated in attempts to steal confidential information (personal identifiable information, policy-related\n\ninformation, manufacturing data, etc.) from Japanese organizations.\n\nFocusing mainly on cases involving use of high-stealth remote access trojans (RATs) observed in the second half of fiscal\n\n2019, it describes new attack techniques and how such threats can be detected. Lists of the indicators used in the\n\nvarious attack campaigns described within this report are provided at the end.\n\n\n-----\n\n### Targeted industries and trends of observed cyber attacks\n\nAlthough the Tick and BlackTech have continued to be very active, as was observed in the preceding year,[1] analysis of\n\ntrends in cyber attacks in fiscal 2019 shows that the number of cyber espionage groups targeting Japan has decreased\n\nin this fiscal year. Because of the increased activities of the DarkHotel targeting media in the first half of the year, the\n\noverall number of attacks on media was high. In the second half of the year, activities of the BlackTech targeting IT\n\nservice company was observed. In the observations from the previous fiscal year, industry types targeted by the\n\nBlackTech attack were predominantly manufacturing industries; however, in this fiscal year its attacks have been\n\nwide-ranging, including research, critical infrastructure, IT services, and more, and analysis suggests that it may be\n\nattempting to steal not only technical information from manufacturing industries, but also PII (Personal Identifiable\n\nInformation) and business intelligence. Moreover, two major electronics companies have announced that they\n\nexperienced targeted attacks around 2017 and 2018.[2 3 4 ]According to public reports, a major electronics company was\n\ninfiltrated by the Chinese APTs Nian (A.K.A. Tick) and Huapi (A.K.A. BlackTech). Massive confidential information of the\n\ncompany as well as its customers’, including several government agencies and other companies from industries such as\n\nelectrical power, communications, railways, automotive, and more, were estimated to be affected. The initial intrusion\n\noccurred at the company’s Chinese branch office. By exploiting the update function of anti-virus software used by the\n\noffice, the attacker was able to distribute malware and gain access to the company headquarters. Identified\n\nvulnerabilities of the anti-virus product were CVE-2019-9489 and CVE-2019-18187, which allow modification of files and\n\nremote code execution.\n\nIt was not until this year that this intrusion was revealed by the company, therefore, it was not included in the statistics of\n\nour reports in 2018-2019. This incident has again highlighted the difficulty of detecting attacks and intrusion launched\n\nby APT actors, meaning that the statistics of our report often show only the tip of the iceberg. We hope that the attack\n\ntechniques described herein will be a useful reference for cyber security team to defend against cyber espionage\n\noperations.\n\n\nCommunication &\nManuacturing\n9%\n\n\nGoverment agencies\n8%\n\nDefense\n8%\n\nCritical Infrustracture\n8%\n\nSemiconductors\n8%\n\n\nIT Services\n8%\n\nResearch\n9%\n\n\nMedia\n25%\n\n\nChemicals\n17%\n\n\n_Figure 1. Pie chart of targeted organizations (FY2019)_\n\n\n1 https://www.macnica.net/mpressioncss/feature_03.html/\n\n2 https://www.asahi.com/articles/ASN1M6VDSN1MULFA009.html\n\n\n3 https://www.mitsubishielectric.co.jp/news/2020/0212-b.pdf\n\n4 https://jpn.nec.com/press/202001/20200131_01.html\n\n\n-----\n\n## Timeline and summary of attacks\n\nCyber espionage group activities we identified in each month from April to March are shown in the table below.\n\nAnalysis shows that activities of the Tick and BlackTech decreased after September. On the other hand, these groups\n\ncontinued to make attacks against organizations in which they had already gained a foothold before, and going into the\n\nsecond half of the year, discoveries were made of activities of the Tick group against chemical industry organizations in\n\nSeptember and activities of the BlackTech attack group against IT service companies in February. Also, although they\n\nhave not yet been tied to any particular group, attacks were observed in December and January that used a RAT\n\n(LODEINFO) that is similar in structure to the ANEL malware used in past attacks by the APT10 attack group.[5]\n\n\n19/04 19/05 19/06 19/07 19/08 19/09 19/10 19/11 19/12 20/1 20/02 20/03\n\n\nDarkHotel\n\nBlackTech\n\nTick\n\nN/A\n(LODEINFO)\n\n|Media|Col2|Col3|Media Defense|Col5|Col6|Col7|Col8|Col9|Col10|Col11|\n|---|---|---|---|---|---|---|---|---|---|---|\n||Research||Semicon- ductors|Critical Infras- tructure||||||IT Services|\n||Commu- nication||Chemicals||Chemicals||||||\n\n\nMedia\n\n\nDefense\n\n\n_Table 1. 2019 Timeline_\n\n#### September 2019 (Chemical)\n\nAttacks by the Tick group on the Chinese offices of Japanese chemical industry organization were observed.[6] The\n\nmalware used in these attacks left a pdb (C:\\Users\\jack\\Desktop\\test\\version\\Release\\version.pdb), and from this\n\ncharacter string and function the malware was named “version RAT” .version RAT was developed to run only in a\n\nWindows10 environment. It includes three remote-controlled functions: execution of a remote shell, file uploading, and\n\nfile downloading. Because it is designed to operate only in a specific OS environment, analysis suggests that it may\n\nhave been used after the Tick group first obtained some degree of knowledge about the targeted environment.\n\n5 https://www.secureworks.jp/resources/at-bronze-riverside-updates-anel-malware\n\n6 https://www.macnica.net/mpressioncss/feature_05.html/\n\n\n-----\n\n#### December 2019 (Media)\n\nAt the end of December 2019, spear phishing e-mail disguised as new year’s greetings was delivered to media\n\ncompanies and other industries. The attached file was a Word document with an embedded macro which, when\n\nactivated, caused malware to be written into the disc and executed. This malware was DLL file. When it runs, it carries\n\nout its operations by injecting malicious code into a svchost.exe process. It possesses an instruction set similar to Unix\n\ncommands and is known as LODEINFO malware. [7]\n\n_Figure 2. Macro-embedded Word File Used to Deliver LODEINFO Malware_\n\n#### January 2020 (Defense)\n\nGoing into January 2020, spear phishing e-mail attacks were observed targeting defense-related organizations with an\n\nOffice macro file attachment designed to drop LODEINFO malware.\n\n7 https://blogs.jpcert.or.jp/en/2020/02/malware-lodeinfo-targeting-japan.html\n\n\n-----\n\n#### February 2020 (IT services)\n\nWe observed BlackTech’ s 32bit ELF malware which runs on Linux OS platform uploaded to public malware repository\n\nand we assume the victim probably was IT service organization.\n\nIt has been noted that this malware is similar to TsCookie malware which is one of BlackTech’ s tools.[8] We discovered\n\nseveral other tools and are presented in this report.\n\n_Figure 3. BlackTech 32-bit Linux Malware_\n\n8 https://blogs.jpcert.or.jp/en/2020/03/elf-tscookie.html\n\n\n-----\n\n## New TTPs and RATs\n\nIn this section we will present information, in some detail, focusing on observations and analyses not yet touched on by\n\nthe published reports previously cited.\n\n#### Tick\n\n**Evolving Downloader**\n\nIn September 2019, attack on Japanese company’ s office in China was observed. Analysis of the techniques (the\n\nfunctions of the malware, the characteristics of the code level, the exploitation of the legitimate Websites as C2 servers)\n\nand the targeted industry suggests that these attack was made by the Tick group. The malware used incorporated the\n\nanti-virus product deactivation and encryption implementation seen in downloader malwares previously used by Tick,\n\nand it seems that Tick has been carrying out continual update of their downloaders. A particularly significant\n\ncharacteristic is the implementation of a remote shell feature. Previously, target verification with a downloader had been\n\ncarried out using the information automatically collected from an infected device. The collected information was\n\nuploaded to external server. If the uploaded information fulfills the condition implemented in the server, next payload\n\nwould be delivered. This was the first time for us to observe that Tick implemented remote shell feature in its\n\ndownloader. This is thought to be used for gathering a greater amount of information to increase the precision of target\n\nverification. Based on the remaining debug information file (pdb) name and functions, We named this malware “version\n\nRAT” .\n\nMay-2018 Aug-2018 May-2019 Aug-2019 Sep-2019\nABKDLL ABK Avenger Ravirra version\n\n\nCPU CPU CPU CPU\n\nAnti-Virus Anti-Virus Anti-Virus\n\nVolume\nOS version\nInformation\n\n\nRemote\nShell\n\n\nHostname\n\n\nNIC MAC\nAddress\n\n\n_Figure 4. Evolution of the Information Collecting Functions of Downloaders_\n\n\n-----\n\nIn this attack, we discovered that version RAT was installed on several devices. One characteristic was that C2 servers of\n\neach RAT were different. This meant that even if the RAT was detected on a single device, only C2 server indicator\n\nwould not be enough to identify other infected devices, which was probably intended to extend the period of stay in\n\nthe target network as long as possible. Because the pdb path left in each RAT was different, it is considered that source\n\ncode sets were shared among several developers belonging to Tick group and tuning was carried out for the settings of\n\nC&C, etc, in each operation. The pdb path of one sample contained Hangul characters. Because of this, and because\n\nTick also targets South Korean organizations, it is suspected that person well versed in the Korean language may be\n\nemployed as a developer of the group.\n\npdb path C:\\Users\\jack\\Desktop\\test\\version\\Release\\version.pdb\n\nversion RAT1 SHA256 ec052815b350fc5b5a3873add2b1e14e2c153cd78a4f3cc16d52075db3f47f49\n\nC&C http://www.<redacted>.com/banner/acom/list.php\n\npdb path C:\\Users\\jack\\Desktop\\test\\version\\Release\\version.pdb\n\nversion RAT2 SHA256 e3624fdb484ae20c47f2e54bda914a12776c8e65b0fe0c6f23640452d37c1545\n\nC&C http://www.<redacted>.co.jp/old/keisokuki/\n\npdb path C:\\Users\\허쟉\\Documents\\Visual Studio 2010\\Projects\\새로\\version\\Release\\version.pdb\n\nversion RAT3 SHA256 d2d5b3e48bb8ac413fffa230bf913283a7c1009981dec20e610f1020ee720fa6\n\nC&C http://www.<redacted>.com/data/\n\n_Table 2. Discovered Version RAT_\n\nThis malware was in a DLL file format and had the same file name as the legitimate version.dll preinstalled in Windows.\n\nWhen the malicious DLL file was installed in the folder containing the legitimate Fortigate EXE which loads version.dll,\n\nthe malicious DLL would be loaded instead of the version.dll in the System32 folder. (DLL Search Order Hijacking)\n\nUsing this technique, the malware would be automatically run and remain in the infected device even after the device\n\nwas rebooted.\n\n**FortiTray.exe** **version.dll(version RAT)**\n\n###### c:¥Windows¥System32\n\n**version.dll**\n\n_Figure 5. DLL Search Order Hijacking_\n\n\n-----\n\nDLL Search Order Hijacking is a technique that has been used for a long time, and the fact that it is still being used by\n\nnumerous groups to this day indicates that it remains an effective technique for avoiding a number of security solutions\n\nsuch as anti-virus products and whitelist protection.\n\nAlso, it uses a unique technique to identify the OS of the infected device.\n\nThe malware loads the legitimate version.dll in the System32 folder and verifies whether a particular API can be loaded.\n\nThe GetFileVersionInfoExA function is exported via the version.dll of Windows10, and cannot be loaded on any other\n\nOS. In this way, this malware is prevented from running on any OS other than Windows 10. This technique is especially\n\neffective to circumvent dynamic analysis and sandbox base security.\n\n_Figure 6. Checking Windows 10 Environment_\n\n\n-----\n\n**Characteristics of version RAT communications**\n\nC2 servers were exploited legitimate Websites and the protocol is HTTP. some User-Agent strings are embedded in the\n\nmalware, and picks up one of the strings based on the mshtml.dll version in the infected device (Table 3).\n\n**mshtml.dll Version** **User agent string**\n\n8 Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; WOW64; Trident/4.0)\n\n9 Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)\n\n10 Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1; Trident/6.0)\n\n11 Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko\n\n_Table 3. Fixed User Agent Strings (version RAT)_\n\nThe communication data is encrypted by combining AES CBC mode (key and initialization vector [IV] generated using\n\ntwo fixed character strings, '!@#$%^$$#$%^%$#@' and 'sdjfiejkflmvjfkd', and random values) and base64.\n\nAll of the C2 servers were compromised legitimate Websites in Japan. In terms of signature creation to detect C2 traffic,\n\nalthough there do exist fixed URL parameters embedded in malware that could be used as detection conditions,\n\nbecause they are frequently changed, it is considered difficult to achieve traffic detection using signatures soon after\n\nmalware has been used. Because of that, although it means taking delayed action, we recommend that when a\n\ndownloader C2 URL used by Tick is published by security vendors, etc, network logs should be examined using the\n\nfixed URL pattern part as a detection condition.\n\nURL pattern examples (blue, bold characters are fixed)\n\n**http://www.<redacted>.com/banner/acom/list.php? <randsom five characters>=usq**\n\nversion RAT SHA256: ec052815b350fc5b5a3873add2b1e14e2c153cd78a4f3cc16d52075db3f47f49\n\n**http://www.<redacted>.com/img/home/index.php? <randsom five characters>=google**\n\ndown_new SHA256: 80ffaea12a5ffb502d6ce110e251024e7ac517025bf95daa49e6ea6ddd0c7d5b\n\n**Observed internal activity**\n\nAfter confirming communication with the target device via a ping command using the version RAT remote shell, the\n\nattacker attempted lateral movement with a net use command.\n\n\n_net group “domain admins” /domain_\n\n_ping -n 1 <hostname1>_\n\n_net use \\\\<hostname1> [redacted] /u:<hostname1>\\administrator_\n\n\n-----\n\n**C2**\n\nA PHP file was installed on compromised Websites. The PHP file’ s code is only around 200 lines, without obfuscation,\n\nand was designed to perform branch processing according to the URL parameters set by version RAT or attacker at the\n\ntime of access. This PHP code does not implement user interface and decryption processing of encrypted data. Its main\n\nrole is relay point of encrypted data between the attacker and the infected devices. Because of this, it is thought that\n\nthe user interface enabling the attacker to carry out operations was implemented on the attacker’ s operation device or\n\non another server. The attacker gained access to the compromised Web site via a servers set up on the platforms of\n\noverseas VPS services. It is thought that the reason why the PHP code was made so simple was that the attacker\n\nconsidered that if the code were obfuscated as with a WebShell, it would produce a lot of distinctive codes and would\n\nincrease the likelihood of being detected by anti-virus products. Data communication between the attacker and the C2\n\nserver is carried out via the same mechanism as for communications between the RAT and the C2 server (AES +\n\nbase64). Because the key and initialization vector (IV) are included in the communication data (Figure 7 and Figure 8),\n\ndecryption can be performed if the URL parameters and POST data remain in the log. IV and Data are split in 2 parts.\n\nAn exclamation mark (!) is attached to the end of the data transmitted to the RAT as an identifier to verify the validity of\n\nthe data.\n\n\n16bytes\n\n\n16bytes\n\n\n###### Key IV Data\n\n AES\n\n base64 base64 base64\n\n Data1 IV1 Key IV2 Data2\n\n3bytes 5bytes 24bytes 19bytes Data Len - 3bytes\n\n_Figure 7. Communication Data Format_\n\n\n###### +‘!’\n\n\n-----\n\nAES and base64 are used for file transfer, too. However the encryption process and data format are slightly altered.\n\n\n16bytes\n\n\n16bytes\n\n\n10bytes\n\n\n###### Key IV Data\n\n base64\n\n AES\n\n base64 base64 base64\n\n IV1 Key IV2 Data2\n\n15bytes 24bytes 9bytes Data Len - 10 bytes\n\n\n###### Data Format:<file name>xxxxxxxx<Data> e.g. aaa.exexxxxxxxxMZ...\n\n_Figure 8. File Transfer Data Format_\n\n**URL Parameter** **Function**\n\nfr=AS4Q&name=<encrypted command> Command\n\n<variable>=dd&na=<file name> Clearing file content\n\n<variable>=de&ui=<file name> File deletion\n\n<target id>=usq Beacon GET /index.php?abcde=usq\n\n<target id>=kjg Command result upload\n\n<target id>=dvg File upload\n\n_Table 4. List of Version RAT C2 PHP URL Parameters_\n\nCommands issued by the attacker are made in the following format.\n\n**MMddHHmmss<Command ID><Target ID>[Sub Command ID][Parameter]**\n\n*Sub Command ID and Parameter can be omitted.\n\n- Target ID is AAAAA: Target device is unspecified.\n\n\n-----\n\n**Command example 1) 0330170142SAAAAA**\n\nShow list of installed applications\n\n**Command example 2) 0330170142DAAAAA0BLc:¥intel¥logs**\n\nDownload file, expand file size, save to c:¥intel¥logs\n\nThe version RAT decrypts the beacon’ s response data, extracts the Command ID, Sub Command ID, and Parameter,\n\nand performs reading processing.\n\n**Sub Command ID**\n**Command ID** **Command** **Command**\n**(Combination possible)**\n\n**C** Remote shell\n\nDownload file from C2 R Execute after download\n\n(The name of the downloaded file\n\n**D** B Expand file size (Approx. 50MB to 100MB)\n\nis embedded in the malware and\n\nis fixed [eg, logo.jpg].) L Specify file save location\n\n**S** Get list of installed applications\n\n**G** Change interval sleep seconds\n\n**U** File upload\n\n**M** Sleep\n\n_Table 5. List of Version RAT Commands_\n\n_Figure 9. Remote Control Flow (Showing Installed Applications)_\n\n\n-----\n\n_Figure 10. PHP Code Installed on a Regular Web Site_\n\n**down_new**\n\nIn November 2019, two files considered to be Tick’s downloaders were uploaded to the public malware repository.\n\nThe encryption method was the same as that of the version RAT, AES + base64, and the two character strings used to\n\ncreate the key were the same. Rather than a DLL file, these malwares are EXE file which, when executed, copies itself to\n\na specified location and adds a log-on script registry as a persistence. automatically run when a user logs in to an\n\ninfected device.\n\nThese samples also had the distinctive pdb file path left in samples used by Tick.\n\n\n-----\n\nSHA256: 80ffaea12a5ffb502d6ce110e251024e7ac517025bf95daa49e6ea6ddd0c7d5b\n\nPDB: C:\\Users\\jack\\Desktop\\test\\ec_new\\down_new\\Release\\down_new.pdb\n\nAdditional registry value: HKEY_CURRENT_USER\\Environment\\UserInitMprLogonScript = \"C:\\Users\\<User\n\nname>\\AppData\\Roaming\\Microsoft\\winlogon.exe\"\n\nSHA256: 2411d1810ac1a146a366b109e4c55afe9ef2a297afd04d38bc71589ce8d9aee3\n\nPDB: C:\\Users\\jack\\Desktop\\test\\ec_new\\down_new\\Release\\down_new.pdb\n\nAdditional registry value: HKEY_CURRENT_USER\\Environment\\UserInitMprLogonScript = \"C:\\Users\\<User\n\nname>\\AppData\\Local\\Microsoft\\Internet Explorer\\wuauct.exe\"\n\nA major difference between these two down_new samples and version RAT is that a remote shell function is not\n\nimplemented. Considering the fact that they have few functions compared with version RAT, the sample compilation\n\ndate and time, and passive DNS information, it is thought that these two down_new samples are version RAT\n\ndevelopment bases and were used some time before August 2019.\n\nUser-Agent string set in HTTP header is fixed, as with the version RAT, but is decided which one is used according to the\n\nOS CPU information (32bit/64bit).\n\n**OS** **User agent string**\n\n32bit Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Safari/537.36\n\n64bit Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Safari/537.36\n\n_Table 6. Fixed User Agent Strings (down_new)_\n\n**down_new** **version RAT**\n\nFile type EXE DLL\n\nAnti-virus product deactivation function YES YES\n\nPerpetuation method Log-on script DLL Search Order Hijacking (loaded via regular file)\n\nOperating environment Windows 32bit/64bit Windows 10\n\nCommunication encryption AES + base64 AES + base64\n\nPrimary function Download new file Remote Control (simplified)\n\n_Table 7. Comparison of Down_new and Version RAT Functions_\n\n\n-----\n\n**ShadowPAD**\n\nIn late 2019, while we were analyzing an attack from Tick, something interesting happened. After running the ABK\n\ndownloader[9] found in that case, a ShadowPAD RAT, also known as POISONPLUG, was downloaded as its 2nd-stage\n\nbackdoor. Though ShadowPAD is a shared tool among Chinese APT groups, this is the first time we observed Tick using\n\nit. As ABK downloader is widely regarded as Tick’ s exclusive tool, this phenomenon confirms that Tick also uses\n\nShadowPAD as their weapon.\n\nThe downloaded sample is a dropper, which drops a legitimate EXE file and a DLL named mscoree.dll containing the\n\nShadowPAD RAT. The DLL contains a “loader” module, five other functional modules, and a shellcode segment, all\n\nencrypted with binary operations. These modules are DLLs with the PE header replaced with random data. The\n\nshellcode is first used to reflectively inject the “loader” module into memory and then used by the “loader” module to\n\ninject other modules. The shellcode itself is heavily obfuscated using fake instructions, making it difficult to analyze. In\n\naddition to obfuscation, all the strings are encrypted and WinAPIs are dynamically linked either through hash or\n\nencrypted strings, leaving an empty import table and no readable strings to analyze.\n\n_Figure 11. Obfuscation in the shellcode. On the left, the ‘E8’ byte cause the debugger to misinterpret_\n_the code as CALL instructions. The image on the right shows the real code after removing the ‘E8’ bytes._\n\n9 https://nao-sec.org/2020/01/an-overhead-view-of-the-royal-road.html\n\n\n-----\n\nIn this case, the five functional modules are the “main” module, the “registry” module that monitors registry changes, 2\n\nC2 connection modules, and a module providing miscellaneous functions for other modules. Thanks to the modular\n\ndesign, the threat actor can change the function provided by the ShadowPAD RAT by adding / replacing the modules.\n\nThe main module establishes persistence through registry key and inject itself along with other modules into a\n\nsvchost.exe process. Once inside the svchost.exe process, the main module will start the other module and connect to\n\nthe C2 server.\n\n_Figure 12. Modular structure of the ShadowPAD RAT sample. Different samples may contain different modules,_\n_depending on the functionalities implemented by the actor._\n\nThe C2 server of this incident, 114.118.21[.]146, is an IP address located in Beijing, China. The traffic goes through port\n\n443 but the actual contents are plaintext HTTP POST requests. Judging by the C2 module, the type of traffic may vary\n\nbetween different ShadowPAD samples, as one of two the C2 modules contains functions for multiple connection\n\nmethods, while the other specifies the domain or IP address of the C2 server and which connection method it uses.\n\n\n-----\n\n#### BlackTech\n\nFrom the end of January 2020 through February, a Linux version of TsCookie malware and a series of attack tools\n\nthought to be used by the BlackTech were discovered. In addition to the Linux version of TsCookie malware, the attack\n\ntools included a WebShell, a port forwarding tool, a GoogleAPI token updater, a Linux version of Bifrose malware, and\n\nmore.\n\n**TsCookie Linux**\n\nAs for the Linux version of TsCookie, although the functions and characteristics of the tool matched the published\n\ninformation,[10] the C2 server was different (Figure 13).\n\nsha256:62840976ab695211447b47ea4555ae665c7039c74a3f2167d660a85283eae86b\n\nfilename:acud\n\n_Figure 13. TsCookie Setting Code_\n\n10 https://blogs.jpcert.or.jp/en/2020/03/elf-tscookie.html\n\n\n-----\n\n**Bifrose Linux**\n\nA Linux version of Bifrose malware in the same category of RAT as TsCookie (sha256: 3cad20318f36b020cf4d6b44320e\n\nb5a6dae0a78339a0fdc3a1fe5e280a8507f1, filename: sshd) was discovered. From the published information the Linux\n\nversion of Bifrose malware is thought to have been used by the BlackTech from around 2014, and the version used this\n\ntime was not much different from the version of that time, with configuration such as the C2 server being included in the\n\nsample without any encryption (Figure 14).\n\n_Figure 14. Communication Destination and Port No. of the Linux Version of Bifrose_\n\nC2 server: The format of the initial beacon packet at the time of communication with 107.191.61[.]247:443 was as\n\nshown below and was also the same as the referenced published information.\n\nFormat:<vitcim IP>|unix|<hostname>|<username>|5.0.0.0|0|1|1|0|<pid>|0|0|0|0|None|||||\n\nExample: 172.16.108.141|unix|web1.localdomain|NULL|5.0.0.0|0|1|1|0|4789|0|0|0|0|None|||||\n\nThe communication data has the characteristic of encryption with an RC4 algorithm using the key\n\n\"\\xA3\\x78\\x26\\x35\\x57\\x32\\x2D\\x60\\xB4\\x3C\\x2A\\x5E\\x33\\x34\\x72\\x00\".\n\n_Figure 15. Communication Data Format_\n\n11 https://blog.trendmicro.com/trendlabs-security-intelligence/threat-actors-behind-shrouded-crossbow-creates-bifrose-for-unix/\n\n\n-----\n\nThe Linux version of Bifrose discovered included the implementation of abundant functions for receiving commands\n\nfrom the C2 server, as shown below (Table 8).\n\n**Command No.** **Command**\n\n0x89 mkdir\n\n0xF6 Run Remote Shell\n\n0xF7 exit\n\n0xF8 Open Remote Shell\n\n0x8B Delete File\n\n0x8F Rename File\n\n0x84 Open File\n\n0x85 Write File\n\n0x86 Read File\n\n0x87 Close File\n\n0x82 Send\n\n0x83 List Directory\n\n_Table 8. List of Bifrose Commands_\n\n**Perl WebShell**\n\nIn addition to the Linux version RAT, a WebShell was also discovered. The discovered WebShell file (sha256:\n\n35f8dec25f11b8a1340d4a1e4c0bc55ed8d8560425d0d50ad6c002bc74f0fa6a) was a file that would operate on CGI-Perl\n\nand was somewhat modified from the WebShell file published on GitHub.[12] The login password to access WebShell\n\nwas “www.org”, and remote shell execution and file uploading and downloading were supported.\n\n_Figure 16. WebShell Access Screen_\n\n12 https://github.com/backlion/webshell/blob/master/pl/Silic%20Group_cgi.pl\n\n\n-----\n\n**Google API Token Updater**\n\nA Google API Token updater that runs on Linux platform was discovered, as heretofore. This file has a sem file name\n\nand was compiled with Golang. It is compressed by the UPX packer, and because Golang’ s API static link creates a\n\nlarge file size, it is possible that the UPX packer was used not for the purpose of avoiding detection of a normal packer,\n\nbut to reduce the file size. This file updates and saves the token required for Google API access.\n\n(Usage example) $sem <token file path> <path of updated token file>\n\nThe following are used for the Google API client ID and secret key.\n\nclient_id=637778819557-clle39i9dlnpkq3i2kobmtl8dcnc4iv0.apps.googleusercontent.com&\n\nclient_secret=D2wmg1foukw6LIT7o2Ieg3rq&\n\ngrant_type=refresh_token & refresh_token=1%2FFE88fgt3ZzLKx85a5cWeHa1wQE8AXcB4SuhRhuy8rE@\n\n_Figure 17. Google API Token Updater Tool_\n\n\n-----\n\nIt has been reported that the BlackTech used Google API to store stolen data on Google Drive Cloud.[13] If the Google\n\nAPI Token updater tool that was discovered this time is part of a series of tools used by the BlackTech, it is likely that\n\nthey are using a separate tool for saving data on Google Drive and are using this tool for updating Google API Token.\n\nThe C2 server of the TsCookie discovered, fortigatecloud[.]com, appears to be related to the network infrastructure that\n\nthe BlackTech had used in the past (Figure 18).\n\n_Figure 18. BlackTech Infrastructure Relations_\n\nIn this way, the BlackTech tends to reuse attack infrastructure in the past, and so using the indicators of the BlackTech for\n\nnetwork security devices can help to detect attacks in early stage. Moreover, because BlackTech has also breached\n\nLinux server networks and uses a unique Linux version of TsCookie, host security measures should be implemented not\n\nonly for Windows, but also for Linux servers, and care should also be taken to carry out monitoring network traffic on\n\nLinux servers.\n\n13 https://hitcon.org/2015/CMT/download/day2-f-r0.pdf\n\n\n-----\n\n#### LODEINFO\n\nIn late December 2019, spear phishing email was delivered to several companies in Japan. When a macro in the\n\nattached doc file is activated, the system becomes infected with malware called LODEINFO.\n\n_Figure 19. Attack Flow Using LODEINFO_\n\nThe macro embedded in the doc file is mainly obfuscated using base64. When the macro is decrypted,\n\nbase64-encoded data contained within a separate macro are acquired and the decoded data is saved as a file with\n\n“.txt” extension. Although the file has “.txt” extension, it is DLL file and run using rundll32.exe. Values are added to the\n\nRun registry so that it is automatically run after the device is rebooted.\n\nWhile we analzyed some LODEINFO malwares, the following two values have been confirmed to be added to registries\n\nfor persistence.\n\nHKCU\\SOFTWARE\\Microsoft\\Windows\\CurentVersion\\Run\\\"BIG_POOH\" = cmd /c cd %ProgramData%&start\n\nrundll32.exe Windows.SecurityMitigationsBroker.txt main\n\nHKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\\"MsiWrapper\" = cmd /c cd %ProgramData%&start\n\nrundll32.exe euwPvlGQN.Ikbn main\n\n\n-----\n\n**Characteristics of LODEINFO**\n\nA pdb file path is left in the dropped DLL (LODEINFO).\n\nE:\\Production\\Tool-Developing\\png_info\\Release\\png_info.pdb\n\nLODEINFO was developed based on the PNG file encoder/decoder “LodePNG” source code published on GitHub.[14]\n\nThis technique of trying to escape analysis by concealing a malicious code within the benign source code is often used\n\nby attack groups based in Chinese-speaking regions.\n\nThere are two types of LODEINFO, one that injects a portable executable (PE) format RAT code into svchost.exe (Figure\n\n20), and one that decrypts and executes a RAT code on the memory of a rundll32.exe (Figure21).\n\nWith the code-injection type, the attacker’ s code is added as a function to the end of the main function.\n\n_Figure 20. Injection Type: Payload Decryption and Code Injection_\n\n14 https://github.com/lvandeve/lodepng/blob/master/examples/example_png_info.cpp\n\n\n-----\n\nIn the added malicious function, embedded payload is decrypted and svchost.exe is run and a PE format code is\n\ninjected into svchost.exe.\n\nThe payload is embedded in the data section and is decrypted by XORing with 128-bit values.\n\nWith the type that decrypts and runs the RAT code on the rundll32.exe memory, decryption and allocating RAT code on\n\nthe memory are implemented within the main function.\n\n_Figure 21. Memory Expansion Type: Payload Decryption and Execution decrypted code_\n\n\n-----\n\n**LODEINFO RAT Component**\n\nFinally, it is a code that runs on svchost.exe or rundll32.exe memory that has the RAT functions.\n\nHTTP POST communication is regularly carried out to the C2 server and processing is performed according to the\n\ninstruction codes included in the response.\n\nThe instruction codes used such as “send”, “recv”, or “kill”, which suggests a UNIX OS environment (Figure 22).\n\nWhen the attacker wants to put the RAT into a dormant state, a “stay calm!” code, which is not part of the RAT\n\ncommand, was sent to the RAT (Figure 23). For the user agent, the fixed character string “Mozilla/5.0 (Windows NT\n\n10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36” is used.\n\n_Figure 22. C2 Command Processing Parts_\n\n_Figure 23. Dormant State Command Used by Attackers_\n\n\n-----\n\nCommunication data is encrypted by AES + base64. A characteristic point is that constants such as AES S-BOX are not\n\nembedded in the data area, but rather, pushing the constant values into stack memory. The purpose of this is probably\n\nto make it difficult to detect the encryption, and thereby hinder analysis.\n\n_Figure 24. AES Encryption_\n\n**Similarities between APT10 and ANEL in code level**\n\n“ANEL” is one of the backdoor type malwares which APT10 used. Several similarities were found between LODEINFO\n\nand ANEL in the code level. However, we don’t have enough information to corroborate attribution to a specific\n\nadversary at the time of writing.\n\n\n**Code Similarities to ANEL**\n\n1. At the beginning of main processing, configured C2 servers string are parsed, and used in a single string variable.\n\n2. Communication data (encryption + Base64)\n\nCryptBinaryToString() is used for Base64 encoding of encrypted byte data.\n\n3. A fixed User-Agent string is used for HTTP POST communication.\n\n4. Encryption algorithms involving heavy implementation are coded without using encryption libraries.\n\n5. C2 response is read by InternetReadFile() and instruction processing is run in another thread using CreateThread().\n\n6. Version information is embedded in the RAT.\n\n\n15 https://www.secureworks.jp/resources/at-bronze-riverside-updates-anel-malware\n\n\n-----\n\n_Figure 25. C2 strings (Top: LODEINFO RAT, Bottom: ANEL 5.1.1)_\n\n\n-----\n\n## About attack groups\n\nSummaries and characteristics of two cyber espionage groups observed to be active in the 2019 fiscal year are\n\ndescribed below.\n\n#### Tick (Nian)\n\nNian’ s actors are applying new variants of their previous tools this year. We were all familiar with its favorite practices\n\nincluding cpycat, 9002, etc. These are still in use, but in combination of the new members, Ravirra and ABK\n\nDownloader.\n\nNian is one of the pioneers in supply chain attacks. The most famous incident attributed to Nian is the SKYSEA invasion\n\ndisclosed in 2016. The Nian actors still focus on NEA countries (Japan & South Korea) but turns to have a broader\n\nindustry preference. They are not only collecting intelligence from military and government but to private enterprises,\n\nsuch as those in electronics and chemical industries.\n\n\n-----\n\n#### BlackTech (Huapi)\n\nThe Huapi actors had focused in targeting Taiwan, including entities affiliated with Taiwan in other countries, for the first\n\nten years of their life span. However, Huapi has started to expand their targeting scope to include Japan since 2017. We\n\nhave observed several operations against Japan specifically since then. According to our observation, they have\n\ninfiltrated almost all kinds of important industries in Taiwan and Japan, including government, military, high tech,\n\neducation, telecommunication, and media.\n\nThe most remarkable capability of the Huapi actors might be their unique ability to find and exploit vulnerabilities in\n\nantivirus or software asset management products. This kind of weapons made the Huapi actors quickly gain control over\n\nthe compromised host’s network environment in post exploitation phase (after successful compromise).\n\n\n-----\n\n##### TTPs (Tactics, Techniques, and Procedures) of each attack group\n\nThe TTPs and targeted organizations of each cyber espionage group are broadly laid out in the table below. MITRE’ s\n\nATT&CK ID is listed with corresponding observed technique. Please refer it to check whether the product you are using\n\ncan detect it.\n\n\n-----\n\n-----\n\n## Conclusion\n\nIn 2019, Tick group and BlackTech were major players targeting Japan. While spear phishing is still a major attack\n\nvector, exploiting vulnerabilities of internet-facing devices is becoming more popular among not only cybercrimes but\n\nalso state-sponsored espionage groups. Misusing legitimate services including Cloud platform and exploiting legitimate\n\nWebsites for C2 servers make more challenging to detect by traditional security solution.\n\nMore visualization by solution like EDR, NDR is important however analysis by internal and external experts is also\n\nimportant to detect in early phase and minimize the impact. Cyber threat intelligence also can provide more context\n\nand help our security life cycle.\n\nGlobal organizations that have branch offices in overseas should be aware of that any branch offices are possible initial\n\nintrusion point for targeted attacks. For example, Tick adversary looks initially gained access to China branch office and\n\nthen laterally moved to head quarter office in Japan. It is possible that targeted attacker thinks that it is easier to\n\ncompromise more vulnerable branch office first then move to head quarter via internal network than to directly\n\ncompromise head quarter. Especially global organizations that have attacked by targeted attacks, it is recommended to\n\ndo compromised assessment before connecting branch office’s network to head quarter and it is important to discuss\n\nsecurity implementation with global team.\n\n2020 became drastic changing year nobody had expected. We are urged to change and adjust our life and work style.\n\nCyber espionage groups don’ t stop during such this instable situation and are working hard to find more effective\n\nattack vectors. We need to adjust ourselves in new environment and prepare against cyber attacks in new era.\n\n\n-----\n\n## Indicators of Compromise (IOCs)\n\n###### Tick/Bronze Butler\n\n\n-----\n\n###### BlackTech\n\n\n-----\n\n###### LODEINFO\n\n\n-----\n\n#### Macnica Networks Corp.\n\nHeadquarters\n\nMacnica Building No.2 1-5-5\nShin-Yokohama, Kouhoku-ku, Yokohama, 222-8562 JAPAN\nTEL: +81-45-476-2010\n\nWest JapanSales Office\n\nOsaka Mitsui Bussan Bldg., 2-3-33\nNakanoshima, Kita-ku, Osaka, 530-0005 JAPAN\nTEL:+81-6-6227-6916\n\nMacnica Networks USA, Inc.\n303 Almaden Blvd. Suite 140, San Jose, California 95110\nTEL: +1-408 205 7141\n\n\nMay 2020 © Macnica Networks Corp.\n\nAll other company names and product names mentioned in this report are\ntrademarks or registered trademarks of the respective companies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/2019.H2_macnica_TeamT5/mpressioncss_ta_report_2019_4_en.pdf"
    ],
    "report_names": [
        "mpressioncss_ta_report_2019_4_en"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2646f776-792a-4498-967b-ec0d3498fdf1",
            "created_at": "2022-10-25T15:50:23.475784Z",
            "updated_at": "2025-03-27T02:00:55.479958Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Palmerworm"
            ],
            "source_name": "MITRE:BlackTech",
            "tools": [
                "Kivars",
                "PsExec",
                "TSCookie",
                "Flagpro",
                "Waterbear"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d3a7123c-f519-49a0-a234-de24a1ef052a",
            "created_at": "2022-10-25T16:47:55.545211Z",
            "updated_at": "2025-03-27T02:05:17.254744Z",
            "deleted_at": null,
            "main_name": "BRONZE CANAL",
            "aliases": [
                "CTG-6177 ",
                "Circuit Panda ",
                "Palmerworm ",
                "Shrouded Crossbow ",
                "BlackTech"
            ],
            "source_name": "Secureworks:BRONZE CANAL",
            "tools": [
                " DRIGO",
                " Flagpro",
                " Gh0stTimes",
                " PLEAD",
                " Spiderpig",
                " Waterbear",
                "Bifrose"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75024aad-424b-449a-b286-352fe9226bcb",
            "created_at": "2023-01-06T13:46:38.962724Z",
            "updated_at": "2025-03-27T02:00:02.964002Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "CIRCUIT PANDA",
                "Temp.Overboard",
                "G0098",
                "Red Djinn",
                "HUAPI",
                "Palmerworm",
                "T-APT-03",
                "Manga Taurus",
                "Earth Hundun"
            ],
            "source_name": "MISPGALAXY:BlackTech",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c93a7f58-3f75-487c-9bd6-e705b73fc07f",
            "created_at": "2023-01-06T13:46:38.330916Z",
            "updated_at": "2025-03-27T02:00:02.806744Z",
            "deleted_at": null,
            "main_name": "RADIO PANDA",
            "aliases": [
                "Shrouded Crossbow"
            ],
            "source_name": "MISPGALAXY:RADIO PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "efa7c047-b61c-4598-96d5-e00d01dec96b",
            "created_at": "2022-10-25T16:07:23.404442Z",
            "updated_at": "2025-03-27T02:02:09.781478Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Circuit Panda",
                "Earth Hundun",
                "Manga Taurus",
                "Operation PLEAD",
                "Operation Shrouded Crossbow",
                "Operation Waterbear",
                "Palmerworm",
                "Radio Panda",
                "Red Djinn",
                "T-APT-03",
                "TEMP.Overboard"
            ],
            "source_name": "ETDA:BlackTech",
            "tools": [
                "BIFROST",
                "BUSYICE",
                "BendyBear",
                "Bluether",
                "CAPGELD",
                "DRIGO",
                "Deuterbear",
                "Flagpro",
                "GOODTIMES",
                "Gh0stTimes",
                "IconDown",
                "KIVARS",
                "LOLBAS",
                "LOLBins",
                "Linopid",
                "Living off the Land",
                "TSCookie",
                "Waterbear",
                "XBOW",
                "elf.bifrose"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1592482970,
    "ts_modification_date": 1592483139,
    "files": {
        "pdf": "https://archive.orkl.eu/b74baf46be77a5cf227622de8617e50b80573388.pdf",
        "text": "https://archive.orkl.eu/b74baf46be77a5cf227622de8617e50b80573388.txt",
        "img": "https://archive.orkl.eu/b74baf46be77a5cf227622de8617e50b80573388.jpg"
    }
}