{
    "id": "4f05fda9-2bc5-4c0a-86cc-df86bb3ded60",
    "created_at": "2023-01-12T15:01:08.56609Z",
    "updated_at": "2025-03-27T02:05:35.062951Z",
    "deleted_at": null,
    "sha1_hash": "b42d5652be7c363eeefc0be23eb12dcd88dfbd3e",
    "title": "2019-01-21 - The Kutaki Malware Bypasses Gateways to Steal Users’ Credentials",
    "authors": "",
    "file_creation_date": "2022-05-27T22:54:23Z",
    "file_modification_date": "2022-05-27T22:54:23Z",
    "file_size": 1009687,
    "plain_text": "# The Kutaki Malware Bypasses Gateways to Steal Users’ Credentials\n\n**[cofense.com/kutaki-malware-bypasses-gateways-steal-users-credentials/](https://cofense.com/kutaki-malware-bypasses-gateways-steal-users-credentials/)**\n\nCofense January 21, 2019\n\n**CISO Summary**\n\n[It’s a case of hiding in plain sight. CofenseTM](https://cofense.com/) recently found a phishing campaign that hides\nthe Kutaki malware in a legitimate application to bypass email gateways and harvest users’\ncredentials.\n\nA data stealer, Kutaki uses old-school techniques to detect sandboxes and debugging, but\ndon’t underestimate it—Kutaki works quite well against unhardened virtual machines and\nother analysis devices. By backdooring a legitimate application, it can fool unsophisticated\ndetection methodologies.\n\n\n[Learn how Cofense IntelligenceTM](https://cofense.com/product-services/phishing-intelligence/) keeps IT teams ahead of the latest phishing and malware\nthreats like this new campaign.\n\n**Full Details**\n\nCofense Intelligence recently uncovered a small-scale phishing campaign delivering a\nsample of the Kutaki information stealer and keylogger that was hidden inside a legitimate\n[Visual Basic application and delivered as an OLE package within a weaponized Office](https://github.com/marifrahman/RMS/tree/master/CODE)\ndocument.\n\n\n-----\n\nKutaki uses a series of anti-virtualization and anti-analysis techniques that were ostensibly\ncopied verbatim from a series of blogs dating back to 2010-2011. Kutaki – a data stealer – is\ncapable of harvesting Input data directly from keyboards, mice, clipboards, microphones, and\nscreens (in the form of screenshots). The campaign observed by Cofense Intelligence also\n[saw Kutaki retrieve a copy of SecurityXploded’s BrowserPasswordDump utility by dropping](https://securityxploded.com/browser-password-dump.php)\n[and executing a copy of cURL for Windows.](https://curl.haxx.se/windows/)\n\nDespite the evasion techniques being antiquated, they are somewhat successful against\ncausal observation and analysis.\n\n## Hiding in Plain Sight: Obfuscation\n\nThis variant of Kutaki uses the source code as a Visual Basic training app to hide its\nmalicious content. By backdooring an ostensibly simple training app, it attempts to exploit\nany potential whitelisting or simply bypass static signatures.\n\nFigure 1 shows the backdoored application as a project breakdown. Figure 2 is a closer view\nof the procedures.\n\n\n-----\n\nFigure 1: the project breakdown\n\nFigure 2: The code sections (procedures) present in the project.\n\nEven for non-programmers, there are certain procedure names that seem to be wildly\nmisplaced. Indeed, we can see a close (but not quite complete) correlation between the\nForms – which are GUI elements – and the procedures that power them. Figure 3\ndemonstrates this mapping.\n\n\n-----\n\nFigure 3: Form elements relative to their procedure (code) counterparts.\n\nFinal proof that this application has been backdoored can be found by inspecting the\nprocedures. Figure 4 shows legitimate procedures compared with those that have been\ninjected.\n\n\n-----\n\nFigure 4: “ff” and “frmLogin” are original procedures. “chee”, “saamneao”, “dewani” and\n“ende” are injected.\n\nNot only do we see a discrepancy between the naming conventions – most legitimate\nprocedures here begin with ‘frm’ – but we can also intuit the random names assigned to the\ninjected procedures. Further, the functions – those found within the injected procedures –\nhave unresolvable names, so they’re simply assigned one by the decompiler.\n\nDiving into some of this injected code yields even more obfuscation. Strings within the binary\nare reversed and decoded using the rtcStrReverse function. Figure 5 shows an example of\nsuch obfuscation.\n\n\n-----\n\nFigure 5: 3 instances of rtcStrReverse being used to deobfuscate stored strings.\n\nSimilar string obfuscation techniques can be found masking suspicious API calls. Figure 6\n[shows the obfuscation of Sleep and](https://docs.microsoft.com/en-us/windows/desktop/api/synchapi/nf-synchapi-sleep) [ShellExecuteA strings.](https://docs.microsoft.com/en-us/windows/desktop/api/shellapi/nf-shellapi-shellexecutea)\n\n\n-----\n\nFigure 6: Sleep and ShellExecuteA strings.\n\nThese strings are part of a small struct used by DllFunctionCall – a method by which Visual\nBasic applications can retrieve the addresses of functions from specific DLLs. The struct\nlooks something like this:\n\n**typedef struct _DllFunctionCallDataStruct {**\n\n**void * lpLibName;**\n\n**void * lpExportName;**\n\n**} DllFunctionCallDataStruct;**\n\nWe can see how this structure maps to what we see in the disassembly in figure 6. All calls\nto DLLFunctionCall are wrapped in identical snippets, as demonstrated in Figure 7.\n\n\n-----\n\nFigure 7: a typical wrapper for calls to DllFunctionCall.\n\nAfter careful analysis, we find that 18 high-value API calls are obfuscated in this manner.\nFigure 8 details these.\n\nFigure 8: De-obfuscated API calls used by Kutaki to perform some of its malicious activity\n\n\n-----\n\n## Anti-Virtualization\n\nKutaki employs some basic checks and comparisons to identify whether it is executing within\na virtualized environment. The first of these involves reading the\nHKLM\\System\\CurrentControlSet\\Services\\Disk\\Enum registry key and comparing the\nreturned string against a list of “undesirable” strings. Figure 9 details the read of this key.\n\nFigure 9: Kutaki reads disk metadata from the registry.\n\nThis registry key contains information about the disks present on the machine. The first disk\nis stored in a value named “0”, the second in a value named “1” and so on. In the instance of\nthis analysis VM, the value 0 contains the data observed in figure 10.\n\nFigure 10: Example data from the Disks\\Enum registry key.\n\n\n-----\n\n[The highlighted text shows that the disk belongs to a VirtualBox VM. Figures 11 and 12 show](https://www.virtualbox.org/)\ntwo different string comparisons, attempting to identify different types of virtual machines\npresent. Figure 13 is all the strings Kutaki will compare against.\n\nFigure 11: Check if the registry value contains “VIRTUAL” anywhere within the string.\n\n\n-----\n\nFigure 12: Check if the registry value contains “VBOX” anywhere in the string.\n\n\n-----\n\nFigure 13: Anti-virtualization strings.\n\nThe string comparison seen in figure 12 would match the data found in the registry value\ndisplayed in Figure 10. Despite the match, Kutaki doesn’t immediately exit, rather it\ncontinues with other virtualization checks. Only after all checks are completed will it\ndetermine whether execution should continue. Figure 14 shows the execution flow of this\nconcept. The specifics of the results checker are detailed later.\n\nFigure 14: Anti-analysis/virtualization chain.\n\nTo supplement the disk checks, Kutaki attempts to determine whether specific modules,\nwhich belong to sandboxes and debugging utilities, have been injected into its address\n[space. It achieves this by using a combination of CreateToolhelp32Snapshot,](https://docs.microsoft.com/en-us/windows/desktop/api/tlhelp32/nf-tlhelp32-createtoolhelp32snapshot) [Module32First](https://docs.microsoft.com/en-us/windows/desktop/api/tlhelp32/nf-tlhelp32-module32first)\n[and Module32Next. These APIs take a snapshot of the running process (including heap,](https://docs.microsoft.com/en-us/windows/desktop/api/tlhelp32/nf-tlhelp32-module32next)\nmodules, etc.), find the first module, and iterate over subsequent modules mapped to the\nprocess, respectively. Figure 15 shows Kutaki setting up the snapshots and retrieving a\npointer to the first module.\n\n\n-----\n\nFigure 15: Kutaki setting up a module-identification loop.\n\nKutaki checks for the existence of sbiedll.dll and dbghelp.dll. These modules belong to\n[Sandboxie and](https://www.sandboxie.com/SBIE_DLL_API) [Microsoft, respectively. Figure 16 shows the de-obfuscation and comparison](https://docs.microsoft.com/en-us/windows/desktop/debug/debug-help-library)\nroutine for dbghelp.dll.\n\n\n-----\n\nFigure 16: Windows Debug DLL de-obfuscation and string comparison.\n\nAll the comparison results are stored in a data structure, which is later checked by the\n_check_anti_analysis routine.\n\nIn a final check to ensure it is not being observed, Kutaki once again reads a registry key —\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion — this time checking\nfor the existence of some very specific ProductID values within the CurrentVersion hive.\nFigure 17 shows this function.\n\n\n-----\n\nFigure 17: Opening the registry key to facilitate value comparisons.\n\nKutaki attempts to find a value with the name “ProductID”. If it finds one key with that value, it\nwill loop through three string comparisons, attempting to identify three sandbox platforms.\nSome pseudocode to roughly describe this process could be:\n\np_id = RegQueryValueExA(“ProductID”)\n\nif (p_id)){\n\nif (p_id == ‘76487-337-8429955-22614’) {\n\nreturn “Anubis”\n\n}\n\nelif (p_id == ‘76487-644-3177037-23510’) {\n\nreturn “CWSandbox”\n\n}\n\n\n-----\n\nelif (p_id == 55274-640-2673064-23950 ) {\n\nreturn “JoeSandbox”\n\n}\n\nelse {\n\nreturn None\n\n}\n\n}\n\nFigure 18 shows this nested loop as it exists with Kutaki.\n\nFigure 18: Looping through checks for various sandboxes.\n\nOnce all of the checks have been processed, Kutaki parses the results to determine if its\nmain loop should finish or continue executing. The check procedure parses every result for a\nnon-zero “return code” (i.e. something was detected) and, if it such a return code is found,\nthe main loop exits. Figure 19 shows an example of these checks.\n\n\n-----\n\nFigure 19: Parsing the results of one of the anti-analysis checks.\n\n## Behavior\n\nOnce Kutaki has determined it is not being monitored, it will proceed with its primary purpose\nof preparing the machine for data-theft. During this process, Kutaki extracts an image from\nits resources, drops it to the user’s temp directory and launches it with\nShellExecuteA(“cmd.exe /c C:\\Users\\admin\\AppData\\Local\\Temp\\images1.png”). This\ndisplays a decoy image to fool the user into believing the OLE package they clicked on was\nsimply an image. Figure 20 is the precise image dropped to disk and displayed to the user.\n\n\n-----\n\nFigure 20: Decoy image launched by Kutaki.\n\nThe document is an invoice template; clearly the actors deploying this put very little effort into\nthis decoy document, as a quick Google search shows it to be the second image hit using\nthe search term “tax details to invoice”. Indeed, this is the exact image used by the attackers:\nhxxp://batayneh[.]me/invoice-with-bank-details-template/invoice-with-bank-details-templateblank-tax-luxury/\n\nAfter displaying the document, Kutaki checks its current executable name against the\nhardcoded string “hyuder” and, if it does not match, proceeds to drop a copy of itself, with the\nnew name, to\n\nC:\\Users\\<username>\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup\\hyuder.exe\n\nFigure 21 shows this check in a debugger. If a new process is launched, the parent process\nwill sit idle without exiting.\n\n\n-----\n\nFigure 21: Kutaki comparing its current name to the desired.\n\nFigure 22 shows Kutaki building the file path to which it will drop a copy of itself. By dropping\nto the startup folder, Kutaki achieves persistence.\n\nFigure 22: Kutaki builds out the string it will use to drop a copy of itself and achieve\npersistence.\n\n\n-----\n\nKutaki executes the dropped code and proceeds to execute its primary malicious\nfunctionality. Note: some readers will no doubt question whether simply renaming the\nexecutable “hyuder.exe” will prevent it from dropping a copy of itself. This is correct; Kutaki\nwill execute directly without dropping anything further, if it is running with an approved name.\nThe rest of the code is somewhat uninteresting, mostly because almost all the malicious\nbehavior occurs outside of the binary itself.\n\nBefore proceeding further, Kutaki will check in with its C2 server, announcing the new\ninfection. Figure 22 is some example traffic observed during analysis.\n\nFigure 23: Kutaki’s C2 server is offline.\n\nKutaki also comes bundled with a copy of cURL – a Linux app ported to Windows which\nallows command line access to internet resources. It uses cURL to retrieve a payload from a\nremote host, although quite why it does this is unclear – it has the capability to contact\nremote servers as demonstrated by its initial attempt to contact its C2 server. Regardless,\nthe use of cURL is by design, as the host from which it attempts to download a further\npayload refuses connections unless the User Agent is set to one referencing cURL. Figure\n23 documents the connections made by cURL to the remote host, retrieving a secondary\npayload.\n\n\n-----\n\nFigure 24: Kutaki uses cURL to download and execute a secondary payload. Note the UserAgent string “curl/7.47.1”.\n\nThe payload retrieved, in this case, was a copy of SecurityXploded’s\nBrowserPasswordDump. This utility is designed to retrieve passwords from the vaults of the\nfollowing browsers:\n\nFirefox\nGoogle Chrome\nMicrosoft Edge\nInternet Explorer\nUC Browser\nTorch Browser\nChrome Canary/SXS Cool\nNovo Browser\nOpera Browser\n\n\n-----\n\nApple Safari\n\nBecause the C2 server was offline, we were unable to monitor the exfiltration of stolen data\nfacilitated by the BrowserPasswordDump utility.\n\n## Old Does Not Mean Ineffective\n\nKutaki uses some old-school, well-documented techniques to detect sandboxes and\ndebugging. These are still effective against unhardened virtual machines and other analysis\ndevices. Additionally, by backdooring a legitimate application, unsophisticated detection\nmethodologies could well be fooled.\n\n[To learn more about recent malware trends, read our 2018 year-end review.](https://cofense.com/)\n\n**Appendix**\n\n**Sources**\n\nhttps://www.alienvault.com/blogs/labs-research/your-malware-shall-not-fool-us-with-thoseanti-analysis-tricks\n\nhttps://www.fireeye.com/blog/threat-research/2011/01/the-dead-giveaways-of-vm-awaremalware.html\n\n**ProductID Checks**\n\n76487-337-8429955-22614 // Anubis Sandbox\n\n76487-644-3177037-23510 // CW Sandbox\n\n55274-640-2673064-23950  // Joe Sandbox\n\n## AntiVM Strings\n\n*VIRTUAL*\n\n*VBOX*\n\n*VMW\n\nsbiedll.dll\n\nDbghelp.dll\n\n**IoCs**\n\nhxxp://babaobadf[.]club/kera/kera3x[.]php\n\n\n-----\n\nhxxp://janawe[.]bid/FF/om2[.]exe\n\n**Artefacts**\n\n89D45698E66587279460F77BA19AE456\n\nA69A799E2773F6D9D24D0ECF58DBD9E3\n\n70bf5dd41548e37550882eba858c84fa\n\n8e4aa7c4adec20a48fe4127f3cf2656d\n\n_All third-party trademarks referenced by Cofense whether in logo form, name form or product_\n_form, or otherwise, remain the property of their respective holders, and use of these_\n_trademarks in no way indicates any relationship between Cofense and the holders of the_\n_trademarks._\n\nDon't miss out on any of our phishing updates! Subscribe to our blog.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-21 - The Kutaki Malware Bypasses Gateways to Steal Users’ Credentials.pdf"
    ],
    "report_names": [
        "2019-01-21 - The Kutaki Malware Bypasses Gateways to Steal Users’ Credentials.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535668,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653692063,
    "ts_modification_date": 1653692063,
    "files": {
        "pdf": "https://archive.orkl.eu/b42d5652be7c363eeefc0be23eb12dcd88dfbd3e.pdf",
        "text": "https://archive.orkl.eu/b42d5652be7c363eeefc0be23eb12dcd88dfbd3e.txt",
        "img": "https://archive.orkl.eu/b42d5652be7c363eeefc0be23eb12dcd88dfbd3e.jpg"
    }
}