{
    "id": "4f1a21f8-a662-41cb-bae1-5c362cbe7b88",
    "created_at": "2023-01-12T15:09:32.353347Z",
    "updated_at": "2025-03-27T02:11:51.825095Z",
    "deleted_at": null,
    "sha1_hash": "7a7947833b5cc460c53025fc60b66cbc508750d8",
    "title": "2022-01-27 - Focusing on “Left of Boom”",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:27Z",
    "file_modification_date": "2022-05-28T19:41:27Z",
    "file_size": 217877,
    "plain_text": "# Focusing on “Left of Boom”\n\n**blog.gigamon.com/2022/01/28/focusing-on-left-of-boom/**\n\n[Home »](https://blog.gigamon.com/) [Threat Research » Focusing on “Left of Boom”](https://blog.gigamon.com/category/threat-research/)\n\n[Threat Research / January 28, 2022](https://blog.gigamon.com/category/threat-research/)\n\n[Joe Slowik &nbsp](https://blog.gigamon.com/author/joeslowik/)\n\n\nJanuary 28, 2022\n\n\nThe security community was recently transfixed by rapidly evolving events in Ukraine in mid[January 2022: First, a large-scale web defacement campaign, then revelations of concurrent](https://www.cnn.com/2022/01/14/europe/ukraine-cyber-attack-government-intl/index.html)\n(if not [necessarily closely coordinated)](https://zetter.substack.com/p/dozens-of-computers-in-ukraine-wiped) [wiper activity, given the name “WhisperGate,” against](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\ntargets in the region. Once news of the latter emerged, security researchers rushed to\nanalyze the malware in question (of which only one sample of each “stage” is known as of\nthis writing) and publish their findings.\n\nWhile these events are concerning due to overall geopolitical context and potential event\nsignificance, the overwhelming focus of information security resources on the execution of\ndestructive malware in victim environments is misplaced. If we map what is known about the\n[events in Ukraine to the Cyber Kill Chain, the WhisperGate wiper malware (and related tools)](https://www.lockheedmartin.com/content/dam/lockheed-martin/rms/documents/cyber/LM-White-Paper-Intel-Driven-Defense.pdf)\nrepresent the final stages of adversary activity in victim environments.\n\nIf we were to compare WhisperGate’s execution to a bomb going off, detection of\nWhisperGate itself represents awareness and defense at the time of explosion: The\nadversary has succeeded in placing, setting, and arming the bomb, and it has exploded.\nFrom a defensive standpoint, our preference would be to detect and disrupt operations as far\n[“left of boom” as possible to avoid worst-case outcomes.](https://en.wikipedia.org/wiki/Left_of_Boom)\n\nFocusing resources and research on the final phase of adversary activity, whether a likely\nstate-sponsored destructive item like WhisperGate or more general ransomware execution,\nignores all preceding steps through which adversaries must be successful in order to\nexecute actions on desired objectives — essentially, ceding initiative and time to threat\nactors that defenders could otherwise use to detect and mitigate intrusions at earlier stages.\nAs shown in the following diagram, adversaries must migrate through various operational\nphases, each dependent on succeeding in prior steps, to achieve their objectives. Defenders\ncan leverage these inherent attacker dependencies to build and deploy in-depth defense for\nmonitored networks.\n\n\n-----\n\nFigure 1. Dependent operational phases of an attack.\nLooking specifically at the WhisperGate incidents and (potentially) related activity,\ninformation is unfortunately limited concerning early-phase intrusion activities. However, such\n[information is not completely absent, as reports from several](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/) [entities, including the Ukrainian](https://blog.talosintelligence.com/2022/01/ukraine-campaign-delivers-defacement.html)\nCERT, provide enough context to identify general behaviors and techniques used by the\nadversary:\n\n[1. Use of compromised credentials to access victim environments via single-factor](https://twitter.com/KimZetter/status/1484627782139187201)\n\nauthentication\n2. File staging in standard, default directories such as “C:\\ProgramData” and “C:\\temp”\n[3. Remote execution using tools associated with the Impacket collection of scripts](https://github.com/SecureAuthCorp/impacket)\n4. Use of [Discord as a content delivery network (CDN) to stage and then retrieve follow-](https://www.zscaler.com/blogs/security-research/discord-cdn-popular-choice-hosting-malicious-payloads)\n\non tools as part of the destructive process\n\nThe above items are hardly unique for intrusions, whether discussing state-directed threats\nor ransomware operators. Yet they also represent the most likely areas defenders can vector\nresources to gain visibility or improve immediate defensive outcomes. By understanding\nthese higher-level behaviors and the means through which they can be detected — in host or\n\n\n-----\n\nin network visibility — defenders can meaningfully learn from the campaign ending in\nWhisperGate in such a fashion as to identify similar intrusions at earlier, more actionable\nphases of the adversary’s lifecycle.\n\nOne challenge in a behavior-focused approach to security is the difficulty in translating an\nunderstanding of behaviors into technical observables or signatures. Such concerns can be\nreduced to a simple complaint that none of the noted behaviors are reducible to a single,\nsemi-actionable “indicator of compromise” (IOC), such as the malware hashes for\nWhisperGate. Yet given the [debasement of](https://threatpost.com/misunderstanding-indicators-of-compromise/117560/) [IOCs for defensive purposes, the utility of a](https://pylos.co/2018/05/16/indicators-and-network-defense/)\ncouple of malware hashes is highly debatable. The underlying source code for WhisperGate\ncan be compiled, packed, obfuscated, or otherwise presented in myriad ways (including\npurely in memory, as seen in [later stages of WhisperGate actions) that will produce a nearly](https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/)\nunlimited number of hashes for defenders to track.\n\nInstead of concentrating defense on sample-specific observations at the “Actions on\nObjectives” or final stages of an intrusion, defenders can instead apply layered security\ncontrols targeting known adversary behaviors for a more robust defensive posture:\n\n1. Identifying and limiting directly accessible access points to a minimum necessary\n\namount and monitoring access attempts and traffic sources for signs of anomalies.\n2. Implementing and enforcing multi-factor authentication (MFA) for external-to-internal\n\nand internal-to-internal remote authentication to reduce the impact of credential\nharvesting and reuse.\n3. Identify file download to and execution from common directory locations with less\n\nrestricted permissions such as %TEMP% and related items. Where possible, link such\nobservations with file characteristic details (file signature, file metadata, or other items)\nto produce composite, higher-confidence alerts of suspicious activity.\n[4. Log and monitor remote process execution mechanisms, including PSExec-like](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\n\n[capabilities but also SMB and WMI-based methods found in frameworks such as](https://kylemistele.medium.com/impacket-deep-dives-vol-1-command-execution-abb0144a351d)\nImpacket.\n5. Limit or track retrieval of potentially malicious payloads (such as executable files or\n\nshellcode payloads) from third-party sources and CDNs. Limit exposure where\npossible, or leverage analysis of payloads to identify potentially malicious items for\nfurther action.\n\nThrough a whole-of-kill-chain defensive approach, described above and illustrated in the\ndiagram below, defenders can ensure coverage of adversary initial and intermediate\nintrusion stages well in advance of final objectives. In addition to ensuring that defenders can\npotentially catch (or mitigate) malicious activity earlier in the adversary’s operational lifecycle,\nsuch layering also ensures that when adversaries inevitably modify or change behaviors at\none (or potentially more) operational stages, defenses and observations at other phases of\nadversary activity hold the possibility of identifying behaviors of interest.\n\n\n-----\n\nFigure 2. Defenses/observations throughout the chain of attacker operational phases.\nIn observing events, whether headline-grabbing incidents such as those in Ukraine or the\n[steady drumbeat of ransomware incidents, defenders should be focused as much as](https://blog.gigamon.com/2021/05/17/tracking-darkside-and-ransomware-the-network-view/)\npossible on how to detect and mitigate intrusions as early and consistently as possible.\nAnalysis of final-stage events, such as the WhisperGate wiper, can be of significant\nacademic interest and enable research into adversary intentions and methodologies, but for\noperationally relevant network defense, such an exclusive approach simply yields far too\nmuch ground to threats to be sustainable. Instead, by layering defense and detection\nthroughout the phases of the Cyber Kill Chain, opportunities emerge to identify adversary\nactions at multiple points prior to final actions — whether a destructive wiper or a disruptive\nransomware event — and place the defended and monitored organization on far sounder\nand more robust footing.\n\n**Featured Webinars**\n\n[Hear from our experts on the latest trends and best practices to optimize your network](https://www.gigamon.com/resources/resource-library/webinar-hub.html?intcid=blog)\nvisibility and analysis.\n\n\n-----\n\nCONTINUE THE DISCUSSION\n\nPeople are talking about this in the Gigamon Community’s [Security group.](https://community.gigamon.com/gigamoncp/s/group/0F91O0000009cNHSAY/security)\n\n**Share your thoughts today**\n\n[NDR Resource](https://blog.gigamon.com/tag/ndr-resource/) [Ransomware](https://blog.gigamon.com/tag/ransomware/)\n\n## RELATED CONTENT\n\nREPORT\n\n2022 Ransomware Defense Report\n\nGET YOUR COPY\n\nWEBINAR\n\nThreatINSIGHT: Eliminating Adversaries’ Dwell Time Advantage\n\nWATCH ON DEMAND\n\nWEBINAR\n\nDeep Dive INSIGHTS: Fighting Ransomware and Shifting Security Priorities\n\nWATCH ON DEMAND\n\nREPORT\n\nGigamon ThreatINSIGHT Guided-SaaS Network Detection and Response\n\nGET YOUR COPY\n\n\n-----\n\nOLDER ARTICLE\n[Gigamon Accelerates Innovation in Hybrid Cloud with GigaVUE 5.14 Launch](https://blog.gigamon.com/2022/01/21/gigamon-accelerates-innovation-in-hybrid-cloud-with-gigavue-5-14-launch/)\nNEWER ARTICLE\n[ランサムウェアの対策方法](https://blog.gigamon.com/2022/01/29/%e3%83%a9%e3%83%b3%e3%82%b5%e3%83%a0%e3%82%a6%e3%82%a7%e3%82%a2%e3%81%ae%e5%af%be%e7%ad%96%e6%96%b9%e6%b3%95/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-27 - Focusing on “Left of Boom”.pdf"
    ],
    "report_names": [
        "2022-01-27 - Focusing on “Left of Boom”.pdf"
    ],
    "threat_actors": [
        {
            "id": "025b7171-98f8-4391-adc2-66333629c715",
            "created_at": "2023-06-23T02:04:34.120175Z",
            "updated_at": "2025-03-27T02:02:09.797581Z",
            "deleted_at": null,
            "main_name": "Cadet Blizzard",
            "aliases": [
                "DEV-0586",
                "Operation Bleeding Bear",
                "Ruinous Ursa"
            ],
            "source_name": "ETDA:Cadet Blizzard",
            "tools": [
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "P0wnyshell",
                "PAYWIPE",
                "Ponyshell",
                "Pownyshell",
                "WhisperGate",
                "WhisperKill",
                "netcat",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536172,
    "ts_updated_at": 1743041511,
    "ts_creation_date": 1653766887,
    "ts_modification_date": 1653766887,
    "files": {
        "pdf": "https://archive.orkl.eu/7a7947833b5cc460c53025fc60b66cbc508750d8.pdf",
        "text": "https://archive.orkl.eu/7a7947833b5cc460c53025fc60b66cbc508750d8.txt",
        "img": "https://archive.orkl.eu/7a7947833b5cc460c53025fc60b66cbc508750d8.jpg"
    }
}