{
    "id": "4f34f963-d308-4f5e-b750-bc7987997236",
    "created_at": "2023-01-12T15:00:41.094845Z",
    "updated_at": "2025-03-27T02:09:30.40089Z",
    "deleted_at": null,
    "sha1_hash": "459732955ce77b9cf5d682a7a8d0803c795817e3",
    "title": "2021-05-14 - The moral underground Ransomware operators retreat after Colonial Pipeline hack",
    "authors": "",
    "file_creation_date": "2022-05-25T12:18:39Z",
    "file_modification_date": "2022-05-25T12:18:39Z",
    "file_size": 147368,
    "plain_text": "# The moral underground? Ransomware operators retreat after Colonial Pipeline hack\n\n**[intel471.com/blog/darkside-ransomware-shut-down-revil-avaddon-cybercrime](https://intel471.com/blog/darkside-ransomware-shut-down-revil-avaddon-cybercrime)**\n\nMay 14, 2021\n\nThe ransomware attack on Colonial Pipeline has caused a large amount of trouble in the\nUnited States. It looks as if that trouble has made its way back to the cybercrime\nunderground.\n\nIntel 471 has observed numerous ransomware operators and cybercrime forums either claim\ntheir infrastructure has been taken offline, amending their rules, or they are abandoning\nransomware altogether due to the large amount of negative attention directed their way over\nthe past week.\n\nOn May 13, 2021, the operators of the DarkSide Ransomware-as-a-Service (RaaS) announced\nthey would immediately cease operations of the DarkSide RaaS program. Operators said they\nwould issue decryptors to all their affiliates for the targets they attacked, and promised to\ncompensate all outstanding financial obligations by May 23, 2021. The group, which has been\nnamed as the one responsible for the Colonial Pipeline incident, also passed an\nannouncement to its affiliates claiming a public portion of the group's infrastructure was\ndisrupted by an unspecified law enforcement agency. The group’s name-and-shame blog,\nransom collection website, and breach data content delivery network (CDN) were all\nallegedly seized, while funds from their cryptocurrency wallets allegedly were exfiltrated.\n\nIntel 471 obtained the announcement, which is available below.\n\n\n-----\n\nThe note DarkSide passed to affiliates.\n\nTranslated in English, the note reads:\n\n_Starting from version one, we promised to speak about problems honestly and openly. A_\n_couple of hours ago, we lost access to the public part of our infrastructure, in particular to_\n_the_\n\n_blog_\n\n_payment server_\n\n_CDN servers_\n\n_At the moment, these servers cannot be accessed via SSH, and the hosting panels have been_\n_blocked._\n\n_The hosting support service doesn't provide any information except \"at the request of law_\n_enforcement authorities.\" In addition, a couple of hours after the seizure, funds from the_\n_payment server (belonging to us and our clients) were withdrawn to an unknown account._\n\n_The following actions will be taken to solve the current issue: You will be given decryption_\n_tools for all the companies that haven't paid yet._\n\n_After that, you will be free to communicate with them wherever you want in any way you_\n_want. Contact the support service. We will withdraw the deposit to resolve the issues with_\n_all the affected users._\n\n\n-----\n\n_The approximate date of compensation is May 23 (due to the fact that the deposit is to be_\n_put on hold for 10 days on XSS)._\n\n_In view of the above and due to the pressure from the US, the affiliate program is closed._\n_Stay safe and good luck._\n\n_The landing page, servers, and other resources will be taken down within 48 hours._\n\nDarkSide was not the only group to make this type of announcement on May 13. Another\nRaaS group, Babuk, claimed it handed over the ransomware’s source code to \"another team,\"\nwhich would continue to develop it under a new brand. The group pledged to stay in\nbusiness, continuing to run a victim name-and-shame blog, while also encouraging other\nransomware gangs to switch to a private mode of operation. This announcement came after\nthe group released the remaining portions of the data stolen from the District of Columbia’s\nMetropolitan Police Department. That archive, which contained 250 GB worth of data,\nallegedly included officers' and auxiliary personnel personal data, a database filled with\ninformation on criminals, as well as information on police informants.\n\nWhile Babuk pledged to keep its operations running, it may find it difficult to find affiliates.\nShortly after the above announcements, the administrator for one of the most popular\nRussian-language cybercrime forums announced an immediate ban of all ransomwarerelated activity on their forum. The forum now prohibits ransomware advertising, sales,\nransom negotiation services and similar offers. Any listings that are currently on the forums\nwill be deleted. The administrator explained the move by saying ransomware operations are\nbecoming “more and more toxic” and dangerous for the underground community.\n\nThat announcement caused a ripple effect on the forum, causing other well-known RaaS\naffiliates to make their own announcements regarding the status of their operations. One\noperator known to be behind the REvil ransomware program announced they would stop\npromoting their malware on the forum, deleting the forum thread where the service was\nadvertised. The operator said REvil would continue operating on another well-known\nRussian-language cybercrime forum, but expected that forum would soon also ban all\nransomware-related activity. If that is to occur, the operator said REvil would likely go fully\nprivate.\n\nShortly thereafter, REvil’s operator released coordinated statements with an operator behind\nthe Avaddon RaaS program, announcing an amendment to the “rules” of their organizations.\nThe updates barred affiliates from targeting government, healthcare, educational and charity\norganizations regardless of their country of operation. Additionally, all other targets need to\nbe pre-approved by the ransomware’s operators prior to actual deployment.\n\nIntel 471 believes that all of these actions can be tied directly to the reaction related to the\nhigh-profile ransomware attacks covered by the media this week. However, a strong caveat\nshould be applied to these developments: it’s likely that these ransomware operators are\n\n\n-----\n\ntrying to retreat from the spotlight more than suddenly discovering the error of their ways. A\nnumber of the operators will most likely operate in their own closed-knit groups, resurfacing\nunder new names and updated ransomware variants. Additionally, the operators will have to\nfind a new way to “wash” the cryptocurrency they earn from ransoms. Intel 471 has observed\nthat BitMix, a popular cryptocurrency mixing service used by Avaddon, DarkSide and REvil\nhas allegedly ceased operations. Several apparent customers of the service reported they were\nunable to access BitMix in the last week.\n\nFurthermore, there will be ransomware operators that continue with their own operations\ndespite all of this week’s attention. On the same day as the coordinated announcements from\n[REvil and Avaddon: Ireland's health service operator had to shut down all of its IT systems](https://www.reuters.com/technology/irish-health-service-hit-by-ransomware-attack-vaccine-rollout-unaffected-2021-05-14/)\ndue to a \"significant\" ransomware attack.\n\nIntel 471 will continue to watch and report on further developments as ransomware\noperators adjust their enterprises.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-14 - The moral underground Ransomware operators retreat after Colonial Pipeline hack.pdf"
    ],
    "report_names": [
        "2021-05-14 - The moral underground Ransomware operators retreat after Colonial Pipeline hack.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535641,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653481119,
    "ts_modification_date": 1653481119,
    "files": {
        "pdf": "https://archive.orkl.eu/459732955ce77b9cf5d682a7a8d0803c795817e3.pdf",
        "text": "https://archive.orkl.eu/459732955ce77b9cf5d682a7a8d0803c795817e3.txt",
        "img": "https://archive.orkl.eu/459732955ce77b9cf5d682a7a8d0803c795817e3.jpg"
    }
}