{
    "id": "4f3bd469-dfd3-4682-9065-415485813f2d",
    "created_at": "2023-01-12T15:05:58.58446Z",
    "updated_at": "2025-03-27T02:16:53.150968Z",
    "deleted_at": null,
    "sha1_hash": "6ac7f9a9a93080361379afe79edb0e054616e819",
    "title": "2019-10-20 - McAfee ATR Analyzes Sodinokibi aka REvil Ransomware-as-a-Service – Crescendo",
    "authors": "",
    "file_creation_date": "2022-05-28T19:00:18Z",
    "file_modification_date": "2022-05-28T19:00:18Z",
    "file_size": 715220,
    "plain_text": "# McAfee ATR Analyzes Sodinokibi aka REvil Ransomware- as-a-Service – Crescendo\n\n**securingtomorrow.mcafee.com/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-**\nservice-crescendo/\n\nOctober 21, 2019\n\n## Episode 4: Crescendo\n\n_This is the final installment of the McAfee Advanced Threat Research (ATR) analysis of_\n_Sodinokibi and its connections to GandGrab, the most prolific Ransomware-as-a-Service_\n_(RaaS) Campaign of 2018 and mid 2019._\n\nIn this final episode of our series we will zoom in on the operations, techniques and tools\nused by different affiliate groups spreading Sodinokibi ransomware.\n\nSince May we have observed several different modus operandi by different affiliates, for\nexample:\n\nDistributing the ransomware using spear-phishing and weaponized documents\nBat-files downloading payloads from Pastebin and inject them into a process on the\noperating system\nCompromising RDP and usage of script files and password cracking tools to distribute\nover the victim’s network\n\n\n-----\n\nCompromise of Managed Service Providers and usage of their distribution software to\nspread the ransomware\n\nTo understand more about how this enemy operates, we in McAfee Advanced Threat\nResearch (ATR) decided to operate a global network of honeypots. We were aware of the\n[lively underground trade market of RDP credentials and were curious about what someone](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/organizations-leave-backdoors-open-to-cheap-remote-desktop-protocol-attacks/)\nwould do with a compromised machine. Would they distribute the Sodinokibi ransomware?\nWould they execute the DejaBlue or BlueKeep exploits? Our specially designed and built\nRDP honeypots would give us those insights.\n\n## Like Moths to a Flame\n\nFrom June until September 2019, we observed several groups compromise our honey pots\nand conduct activities related to Sodinokibi; we were able to fully monitor attackers and their\nactions without their knowledge.\n\nIt is important to note the golden rule we operated under: the moment criminal actions were\nprepared or about to be executed, the actor would be disconnected and the machine would\nbe restored to its original settings with a new IP address.\n\nWe noticed some of our honeypot RDP servers were attacked by Persian-speaking actors\nthat were actively harvesting credentials. Our analysis of these attacks led us to various\nPersian underground channels offering the same tools we observed appearing in Sodinokibi\nintrusions. Some of these tools are closed source and custom made, originating from within\nthe channels in our analysis.\n\nIn this blog we will highlight a few of the intrusions we observed.\n\n## Group 1 – Unknown Affiliate ID\n\nMcAfee ATR observed initial activity against our South American honey pot begin in late May\n2019. We had full visibility as the actor loaded a number of tools, including Sodinokibi, during\nthe initial intrusion period.\n\nThe following ransom note (uax291-readme.txt) was dropped onto the system on June 10,th\n2019. The actor utilized Masscan and NLBrute to scan and target other assets over RDP\nwhich fits with the behavior we have seen in all other Sodinokibi intrusions tracked by\nMcAfee ATR. The actor then created a user account ‘backup’ and proceeded to consistently\nconnect from an IP address range in Belgrade, Serbia.\n\n## Group 2 – Affiliate ID 34\n\n**Campaign 295 (based on sub-ID in the malware configuration)**\n\n\n-----\n\nThe following Sodinokibi variant appeared in our South American honey pot with the original\nfile name of H.a.n.n.a.exe.\n\n8d7d333574708c2fe5c37fad1bdfbc5a9664b33d (June 8, 2019)th\n\nExtracting the configuration from the ransomware sample as we conducted during our\n[affiliate research, the affiliate-id is nr 34.](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-the-all-stars/)\n\n\nUpon initial intrusion, the actor created several user accounts on the target system between\nJune 10 and June 11 . The malware Sodinokibi and credential-harvesting tool Mimikatzth th\nwere executed under the user account “ibm” that the actor created as part of the entry into\nthe system\n\nFurther information revealed that the actor was connecting from two IP addresses in Poland\nand Finland via the ‘ibm’ account. These logins originated from these countries in a 24hr\nperiod between July 10 and 11 with the following two unique machine names WIN-th th\nS5N2M6EGS5J and TS11. Machine name WIN-S5N2M6EGS5J was observed to be used by\nanother actor that created the account “asp” and originated from the same Polish IP address.\n\nThe actor deployed a variant of the Mimikatz credential harvester during the intrusion, with\nthe following custom BAT file:\n\nWe have seen a consistent usage of various custom files used to interact with hacking tools\nthat are shared among the underground communities.\n\nAnother tool, known as Everything.exe, was also executed during the same period. This tool\nwas used to index the entire file system and what was on the target system. This tool is not\nconsidered malicious and was developed by a legitimate company but can be used for\nprofiling purposes. The usage of reconnaissance tools to profile the machine is interesting as\nit indicates potential manual lateral movement attempts by the actor on the target system.\n\n\n## July 20 to 30 Intrusionth th\n\nActivity observed during this period utilized tools similar to those used in other intrusions we\nhave observed in multiple regions, including those by Affiliate ID 34.\n\n\n-----\n\nIn this activity McAfee ATR identified NLBrute being executed again to target victims over\nRDP; a pattern we have seen over and over again in intrusions involving Sodinokibi. A\nseries of logins from Iran were observed between July 25 and July 30, 2019.th th\n\nWe have also seen crypto currency mining apps deployed in most of the intrusions involving\nSodinokibi, which may suggest some interesting side activity for these groups. In this\nincident we discovered a miner gate configuration file with a Gmail address.\n\nUsing Open-Source Intelligence (OSINT) investigation techniques, we identified an individual\nthat is most likely tied to the discovered Gmail address. Based on our analysis, this individual\nis likely part of some Persian-speaking credential cracking crew harvesting RDP credentials\nand other types of data. The individual is sharing information related to Masscan and Kport\nscan results for specific countries that can be used for brute force operations.\n\nACTOR PROFILE\n\nFurther, we observed this actor on a Telegram channel discussing operations which align to\nthe behavior we observed during intrusions on our honey pot. The data shared appears to be\nresults from tools such as Masscan or Kport-scan that would be used to compromise further\nassets.\n\n\n-----\n\nDISCUSSION OF SCANNING IN FARSI, ON PRIVATE CHANNEL\n\nOther tools were found to have been executed the same day as the activity documented\ninclude:\n\n**Mimikatz**\n\nWas executed manually from the command line with the following parameters:\n\n[mimikatz.exe “privilege::debug” “sekurlsa::logonPasswords full” “exit”](https://38.68.135.227:8000/en-US/app/search/search?q=search%20index%3Dskynetexpansion%20host%3D%22BrazilNet-02%22%20NOT%20process_name%3D%22*splunk*%22%20%20process_name%3D%22mimikatz.exe%22&display.page.search.mode=verbose&dispatch.sample_ratio=1&workload_pool=&earliest=1564358400&latest=1564444800&display.general.type=events&display.page.search.tab=events&sid=1567728574.6791)\n\n**Slayer Leecher**\n**MinerGate**\n\n## Group 3 – Affiliate ID 19\n\nWe observed the following Sodinokibi ransom variants attributed to this affiliate appearing in\nthe honey pot in the Middle East. The attacker downloaded a file, اﺑﺰار ﮐﺮک.zip, which can be\nmostly found in Farsi language private channels. The tool is basically a VPS Checker (really\nan RDP cracker) as discussed on the channels in the underground.\n\n**Campaign 36**\n\nActivity from June 3 to 26 indicates that the attacker present on the system wasrd th\nconducting operations involving the Sodinokibi ransomware. When linking back activity, we\nobserved one notable tool the actor had used during the operation.\n\n‘Hidden-User.bat’ was designed to create hidden users on the target system. This tool links\nback to some underground distribution on Farsi-speaking private channels.\n\n\nThe file being shared is identical to the one we found to be used actively in the Sodinokibi\ncase in different instances in June 2019, in different cities in the Middle East. We found the\nfollowing Farsi-speaking users sharing and discussing this tool specifically (Cryptor007 and\nMR Amir), and others active in these groups. McAfee ATR observed this tool being used on\nJune 13, 2019 and June 26, 2019 by the same actors in different regions.th th\n\n\n-----\n\nHIDDEN-USER.bat\n\nPOSTED IMAGE OF THE TOOL IN USE\n\nThese Sodinokibi variants are strictly appearing in Israel from our observations:\n\na3769a6748ba5d8023bcb161a5274e24d419bd36 (June 3, 2019)rd\nbbabc23525b3852d463ef17ba7b8a2cab831e2b9 (June 11, 2019)th\n\n\nWe observed the actor dropping one of the above-mentioned variants of Sodinokibi. In this\ncase, the login came from an IP address originating in Iran and with a machine with a female\nPersian name.\n\nThe attackers connecting are most likely Farsi-speaking, as is evident by the browsing\nhistory uncovered by McAfee ATR, which indicates where a number of the tools utilized\noriginate from, including Farsi language file sharing sites, such as Picofile.com and Soft98.ir,\nthat contain malicious tools such as NLBrute, etc.\n\n\n-----\n\nFARSI LANGUAGE SITE FOUND IN BROWSING HISTORY\n\nWe observed the actor attempting to run an RDP brute force attack using NLBrute\ndownloaded from the Iranian site Picofile.com. The target was several network blocks in\nOman and the United Arab Emirates in the Middle East.\n\nIn our analysis we discovered an offer to install ransomware on servers posted in Farsi\nspeaking on August 19th,. This posting date corresponds with the timing of attacks observed\nin the Middle East. The services mentioned are specifically targeting servers that have been\nobtained via RDP credential theft campaigns. It is possible that these actors are coming in\nafter the fact and installing ransomware on behalf of the main organizer, according to actor\nchatter. One specific Farsi language message indicates these services for a list of countries\nwhere they could install ransomware for the potential client.\n\nFARSI LANGUAGE MESSAGE FROM PERSIAN LANGUAGE CHANNEL\n\n\n-----\n\n**Tools and Methods of Group 1**\n\nThe operators responsible for intrusions involving Sodinokibi variants with an unknown\naffiliate ID utilize a variety of methods:\n\nInitial intrusions made over RDP protocol\nUsing Masscan to identify potential victims\nExecuting NLBrute with custom password lists\n\n**Tools and Methods of Group 2**\n\nThe operators responsible for intrusions involving Sodinokibi variants with PID 34 utilize a\nvariety of methods:\n\nIntrusion via RDP protocol\nManual execution of subsequent stages of the operation\nDeployment of Sodinokibi\nDeployment of Mimikatz\nUtilization of CryptoCurrency mining\nDeployment of other brute force and checker tools\nRunning mass port scans and other reconnaissance activities to identify potential\ntargets\nExecuting NLBrute with custom password lists\nSome of the operators appear write in Farsi and are originating from Iranian IP address\nspace when connecting to observed targets\n\n**Tools and Methods of Group 3**\n\nThe operators responsible for intrusions involving Sodinokibi variants with PID 19 utilize a\nvariety of methods:\n\nIntrusion via RDP protocol\nManual execution of subsequent stages of the operation\nLikely a cracking crew working on behalf of an affiliate\nDeployment of Sodinokibi\nCustom scripts to erase logs and create hidden users\nUsage of Neshta to scan internal network shares within an organization in an effort to\nspread Sodinokibi\nRunning mass port scans and other reconnaissance activities to identify potential\ntargets\nLimited use of local exploits to gain administrative access\nExecuting NLBrute with custom password lists\nSome of the operators appear to write in Farsi and are originating from Iranian IP\naddress space when connecting to observed targets\n\n\n-----\n\n## Conclusion\n\nIn our blog series about Sodinokibi we began by analyzing the code we asked ourselves the\nquestion, “Why Persian?” With the information retrieved from our honeypot investigations, it\nmight give us a hypothesis that the Persian language is present due to the involvement of\nPersian-speaking affiliates. Time and evidence will tell.\n\nWe observed many affiliates using different sets of tools and skills to gain profit and, across\nthe series, we highlighted different aspects of this massive ongoing operation.\n\nTo protect your organization against Sodinokibi, make sure your defense is layered. As\ndemonstrated, the actors we are facing either buy, brute-force or spear-phish themselves into\n[your company or use a trusted-third party that has access to your network. Some guidelines](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/taking-steps-to-fight-back-against-ransomware/)\nfor organizations to protect themselves include employing sandboxing, backing up data,\neducating their users, and restricting access.\n\nAs long as we support the ransomware model, ransomware will exist as it has for the last\nfour years. We cannot fight alone against ransomware and have to unite as public and\nprivate parties. McAfee is one of the founding partners of NoMoreRansom.org and are\nsupporting Law Enforcement agencies around the globe in fighting ransomware.\n\nWe hope you enjoyed reading this series of blogs about Sodinokibi.\n\n[Jessica Saavedra-Morales](https://www.mcafee.com/blogs/author/jessica-saavedra-morales/)\nWith a degree in networking and a degree in information technology, Jessica has a\nbackground in the tech field for almost two decades. Being fluent in Spanish has steered\nher...\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-20 - McAfee ATR Analyzes Sodinokibi aka REvil Ransomware-as-a-Service – Crescendo.pdf"
    ],
    "report_names": [
        "2019-10-20 - McAfee ATR Analyzes Sodinokibi aka REvil Ransomware-as-a-Service – Crescendo.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535958,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1653764418,
    "ts_modification_date": 1653764418,
    "files": {
        "pdf": "https://archive.orkl.eu/6ac7f9a9a93080361379afe79edb0e054616e819.pdf",
        "text": "https://archive.orkl.eu/6ac7f9a9a93080361379afe79edb0e054616e819.txt",
        "img": "https://archive.orkl.eu/6ac7f9a9a93080361379afe79edb0e054616e819.jpg"
    }
}