{
    "id": "4f4b20d0-4b8c-4a61-9e8e-62862bc8b064",
    "created_at": "2023-01-12T15:10:24.980976Z",
    "updated_at": "2025-03-27T02:06:10.057619Z",
    "deleted_at": null,
    "sha1_hash": "35cf803105cc45fc546973789a6c63038110406e",
    "title": "2018-02-12 - Olympic Destroyer Takes Aim At Winter Olympics",
    "authors": "",
    "file_creation_date": "2022-05-28T15:55:21Z",
    "file_modification_date": "2022-05-28T15:55:21Z",
    "file_size": 575442,
    "plain_text": "# Olympic Destroyer Takes Aim At Winter Olympics\n\n**[blog.talosintelligence.com/2018/02/olympic-destroyer.html](http://blog.talosintelligence.com/2018/02/olympic-destroyer.html)**\n\n[This blog post is authored by Warren Mercer and](https://twitter.com/securitybeard?lang%3Den) [Paul Rascagneres. Ben Baker and](https://twitter.com/r00tbsd)\n[Matthew Molyett contributed to this post.](https://blogs.cisco.com/author/matthewmolyett)\n\nUpdate 2/13 08:30 We have updated the information regarding the use of stolen credentials\n\nUpdate 2/12 12:00: We have updated the destructor section with action taken against\nmapped file shares\n\n## Summary\n\nThe Winter Olympics this year is being held in Pyeongchang, South Korea. The Guardian, a\n[UK Newspaper reported an article that suggested the Olympic computer systems suffered](https://www.theguardian.com/sport/2018/feb/10/winter-olympics-investigating-if-technical-problems-were-cyber-attack)\ntechnical issues during the opening ceremony. Officials at the games confirmed some\ntechnical issues to non-critical systems and they completed recovery within around 12 hours.\n[Sunday 11th February the Olympic games officials confirmed a cyber attack occurred but did](https://www.theguardian.com/sport/2018/feb/11/winter-olympics-was-hit-by-cyber-attack-officials-confirm)\nnot comment or speculate further.\n\nTalos have identified the samples, with moderate confidence, used in this attack. The\ninfection vector is currently unknown as we continue to investigate. The samples identified,\nhowever, are not from adversaries looking for information from the games but instead they\nare aimed to disrupt the games. The samples analysed appear to perform only destructive\nfunctionality. There does not appear to be any exfiltration of data. Analysis shows that actors\nare again favouring legitimate pieces of software as PsExec functionality is identified within\nthe sample. The destructive nature of this malware aims to render the machine unusable by\n\n\n-----\n\ndeleting shadow copies, event logs and trying to use PsExec & WMI to further move through\n[the environment. This is something we have witnessed previously with BadRabbit and](http://blog.talosintelligence.com/2017/10/bad-rabbit.html)\n[Nyetya.](http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html)\n\n## Olympic Destroyer Workflow\n\n### Initial stage\n\nThe initial edb1ff2521fb4bf748111f92786d260d40407a2e8463dcd24bb09f908ee13eb9\nsample is a binary that, when executed, drops multiple files on to the victim host. These files\nare embedded as resources (obfuscated). These files are named using randomly generated\nfile names, however, the hashes of the file when written to disk is the same during our\nanalysis on multiple instances. Currently we are not aware of the initial infection vector used.\nThis could have been delivered in a multitude of ways as it is simply a binary file.\n\nTwo of the dropped files (the stealing modules) are executed with 2 arguments: 123 and a\nnamed pipe. The named pipe is used as a communication channel between the initial stage\nand the dropped executable.The technique was used during BadRabbit & Nyetya.\n\nThe initial stage is responsible for propagation. The network discovery is performed using\ntwo techniques:\n\nBy checking the ARP table with the Windows API GetIPNetTable;\nBy WMI (using WQL) with the following request: \"SELECT ds_cn FROM ds_computer\".\nThis request attempts to list all the systems within the current environment/directory.\n\nThe network propagation is performed using PsExec and WMI (via the Win32_Process\nclass). Here is the code executed remotely:\n\nThe purpose is to copy the initial stage to the remote system in\n%ProgramData%\\%COMPUTERNAME%.exe and to execute it via a VBScript.\n\n\n-----\n\nTo perform the lateral movement, the malware needs credentials, it uses 2 stealers\ndescribed in the next section:\n\nThe credentials have not been hardcoded into the binary by the attackers themselves. The\nmalware dynamically updates this list after using the password stealers. A new version of the\nbinary is generated with the newly discovered credentials. This new binary will be used on\nthe new infected systems via the propagation. This feature explains why we discovered\nseveral samples with different sets of credentials that were collected from previously infected\nsystems.\n\nAs you can see, the domain attempted to be used is related to Pyeongchang 2018. We\nidentified 44 individual accounts in the binary.\n\n### Dropped Files\n\n**Browser Credential Stealer**\n\n\n-----\n\nOlympic Destroyer drops a browser credential stealer. The final payload is embedded in an\nobfuscated resource. To be executed, the sample must have 2 arguments as mentioned\npreviously. The stealer supports: Internet Explorer, Firefox and Chrome. The malware parses\nthe registry and it queries the sqlite file in order to retrieve stored credentials. SQLite is\nembedded in the sample:\n\n**System Credential Stealer**\n\nIn additional to the browsers credential stealer, Olympic Destroyer drops and executes a\nsystem stealer. The stealer attempts to obtain credentials from LSASS with a technique\nsimilar to that used by Mimikatz. Here is the output format parsed by the initial stage:\n\n**Destructor**\n\nThe destructive portion of this malware starts during initial execution on the victim machine.\nThe initial malware execution results in multiple files written to disk, as discussed. Following\n\n\n-----\n\nthis, the malware then continues on it s path by beginning the malicious destruction element.\nBy leveraging cmd.exe from the host the malware first deletes all possible shadow copies on\nthe system using vssadmin:\n```\nC:\\Windows\\system32\\cmd.exe /c c:\\Windows\\system32\\vssadmin.exe delete shadows /all\n/quiet\n\n```\nNext, again leveraging cmd.exe execution on the host we can see the author using\n[wbadmin.exe, for those not familiar with wbadmin, this is the replacement for ntbackup on](https://en.wikipedia.org/wiki/WBAdmin)\nmodern operating systems.\n```\nC:\\Windows\\system32\\cmd.exe /c wbadmin.exe delete catalog -quiet\n\n```\nThis step is executed to ensure that file recovery is not trivial - WBAdmin can be used to\nrecover individual files, folders and also whole drives so this would be a very convenient tool\nfor a sysadmin to use in order to aid recovery.\n\nThe next step the attacker takes in this destructive path is to, again leverage cmd.exe, but\nthis time use bcdedit, a tool used for boot config data information, to ensure that the\nWindows recovery console does not attempt to repair anything on the host.\n```\nC:\\Windows\\system32\\cmd.exe /c bcdedit.exe /set {default} bootstatuspolicy\nignoreallfailures & bcdedit /set {default} recoveryenabled no\n\n```\nThe attacker has now attempted to ensure that recovery is extremely difficult for any\nimpacted hosts and to further cover their tracks the deletion of the System & Security\nwindows event log is performed, this will be used to try and make any analysis more difficult.\n```\nC:\\Windows\\system32\\cmd.exe /c wevtutil.exe cl System\nC:\\Windows\\system32\\cmd.exe /c wevtutil.exe cl Security\n\n```\nWiping all available methods of recovery shows this attacker had no intention of leaving the\nmachine useable. The purpose of this malware is to perform destruction of the host, leave\nthe computer system offline, and wipe remote data.\n\n\n-----\n\nAdditionally, the destroyer disables all the services on the system:\n\n\n-----\n\nThe malware uses the ChangeServiceConfigW API to change the start type to 4 which\nmeans: \"Disabled: Specifies that the service should not be started.\"\n\nAdditionally, the malware lists mapped file shares and for each share, it will wipe the writable\nfiles (using either uninitialized data or 0x00 depending of the file size).\n\nFinally after modifying all the system configuration, the destroyer shutdowns the\ncompromised system.\n\n**Legitimate File**\n\nAdditionally, the Olympic Destroyer drops the legitimate, digitally signed, PsExec file in order\nto perform lateral movement by using this legitimate tool from Microsoft. This is another\nexample of an attacker leveraging legitimate tools within their arsenal. Using legitimate tools\n\n\n-----\n\nlike PsExec will save the adversary time from writing their own tooling. A free alternative they\ncan wrap up within their own malware is a much easier option in this instance.\n\n## Conclusion\n\nDuring destructive attacks like this there often has to be a thought given to the nature of the\nattack. Disruption is the clear objective in this type of attack and it leaves us confident in\nthinking that the actors behind this were after embarrassment of the Olympic committee\nduring the opening ceremony.\n\nDisruption of services included the Olympic website being offline, meaning individuals could\nnot print their tickets. The opening ceremony reporting was degraded due to WiFi failing for\nreporters on site.\n\nThe malware delivery mechanism is currently unknown which means the infection vector\ncould be a multitude of options, but, if the attacker already had access to the environment,\nthis attack could have been carried out remotely. This would allow the actors to specifically\npinpoint the moment of the opening ceremony and would allow them to control their time of\nimpact.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n\n-----\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such asNGFW,NGIPS, andMeraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\nOlympic Destroyer:\nedb1ff2521fb4bf748111f92786d260d40407a2e8463dcd24bb09f908ee13eb9\n\nBrowser Stealer:\n19ab44a1343db19741b0e0b06bacce55990b6c8f789815daaf3476e0cc30ebea (unpacked:\nab5bf79274b6583a00be203256a4eacfa30a37bc889b5493da9456e2d5885c7f )\n\nSystem Stealer:\nf188abc33d351c2254d794b525c5a8b79ea78acd3050cd8d27d3ecfc568c2936 (unpacked\na7d6dcdf5ca2c426cc6c447cff76834d97bc1fdff2cd14bad0b7c2817408c334 )\n\nDestroyer: ae9a4e244a9b3c77d489dee8aeaf35a7c3ba31b210e76d81ef2e91790f052c85\n\nPsexec (legit): 3337e3875b05e0bfba69ab926532e3f179e8cfbf162ebb60ce58a0281437a7ef\n\nAdditional Olympic Destroyer:\n\nD934CB8D0EADB93F8A57A9B8853C5DB218D5DB78C16A35F374E413884D915016\n\nEDB1FF2521FB4BF748111F92786D260D40407A2E8463DCD24BB09F908EE13EB9\n\n3E27B6B287F0B9F7E85BFE18901D961110AE969D58B44AF15B1D75BE749022C2\n\n28858CC6E05225F7D156D1C6A21ED11188777FA0A752CB7B56038D79A88627CC\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-12 - Olympic Destroyer Takes Aim At Winter Olympics.pdf"
    ],
    "report_names": [
        "2018-02-12 - Olympic Destroyer Takes Aim At Winter Olympics.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536224,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653753321,
    "ts_modification_date": 1653753321,
    "files": {
        "pdf": "https://archive.orkl.eu/35cf803105cc45fc546973789a6c63038110406e.pdf",
        "text": "https://archive.orkl.eu/35cf803105cc45fc546973789a6c63038110406e.txt",
        "img": "https://archive.orkl.eu/35cf803105cc45fc546973789a6c63038110406e.jpg"
    }
}