{
    "id": "4f85c4b5-8690-4d8d-b445-6663d63616fe",
    "created_at": "2023-01-12T15:09:42.980144Z",
    "updated_at": "2025-03-27T02:16:44.310209Z",
    "deleted_at": null,
    "sha1_hash": "9566904a54d301fe649c504d05f182f38c4431e6",
    "title": "2021-06-17 - For the first time, PST says that China (APT31) is behind a computer attack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:37:51Z",
    "file_modification_date": "2022-05-28T19:37:51Z",
    "file_size": 102080,
    "plain_text": "# For første gang sier PST at Kina står bak et dataangrep\n\n**[nrk.no/norge/pst_-har-etterretning-om-at-kinesisk-gruppe-stod-bak-dataangrep-mot-statsforvaltere-1.15540601](https://www.nrk.no/norge/pst_-har-etterretning-om-at-kinesisk-gruppe-stod-bak-dataangrep-mot-statsforvaltere-1.15540601)**\n\nØyvind Bye Skille, Tormod Strand, Espen Kjendlie\n\nPST mener Kina står bak et omfattende angrep på statsforvalterne i Norge.\n\nStatsforvalteren i Oslo og Viken var ett av statsforvalterembetene som ble direkte rammet\nav dataangrepet i 2018. PSTs Hanne Blomberg forteller at de nå har etterretning som\npeker mot Kina.\n\nFoto: Øyvind Bye Skille / NRK\n\n**Samtidig er det klart at dataangrepet mot statsforvalterne blir henlagt, selv om PST**\n**mener de har funnet etterretningsspor som peker mot Kina.**\n\nLitt over 2,5 år etter at Politiets sikkerhetstjeneste (PST) startet en etterforskning av\ndataangrep mot flere statsforvalterembeter går de nå ut med ny informasjon om hvem som\nkan stå bak.\n\n– Vi har i denne konkrete saken etterretningsinformasjon som peker i en tydelig retning\nmot at det er aktøren APT31 som står bak operasjonen mot statsforvaltningsembetene,\nsier sjef for kontraetterretning Hanne Blomberg i PST til NRK.\n\n_– Hva er APT31?_\n\n– Akkurat APT31 er en aktør som vi knytter til kinesiske etterretningstjenester, svarer\nBlomberg.\n\nAPT31 er en hackergruppe som er kjent for å ha gjennomført dataangrep både i Norge,\nFinland, USA og andre steder i verden.\n\nKontraetterretningssjefen Hanne Blomberg i PST sier at de har opplysninger som peker\nmot Kina etter angrepet mot statsforvalterne.\n\nFoto: Øyvind Bye Skille / NRK\n\nKontraetterretningssjefen forklarer at PST både samler inn informasjon for å lage\ntrusselvurderinger og forebygge, men også driver med etterforskning. Etterretningen som\npeker på Kina kunne ikke nødvendigvis vært brukt i en straffesak.\n\n_– Hvor sikre er dere på at det er APT31 og Kina?_\n\n\n-----\n\n– Dette er utfordringen med å være en hemmelig tjeneste. Vi har ofte gradert informasjon\nsom vi kan ha samlet inn selv og ikke kan avgradere. Vi kan ha kilder vi ønsker å beskytte\neller vi kan ha fått informasjon fra samarbeidende tjenester som vi ikke kan bruke i en\netterforskningssak. I denne konkrete saken har vi informasjon som konkret peker i retning\nav at det er APT31 som står bak, og det er vi ganske sikre på, svarer Blomberg.\n\n## – Ubegrunnede anklager\n\nI en e-post sendt til NRK tilbakeviser Kinas ambassade i Norge PSTs opplysninger.\n\n«Kina har aldri deltatt i eller støttet noen i nettangrep, og har alltid resolutt motarbeidet og\nslått ned på slik oppførsel. Vi er sterkt imot de ubegrunnede anklagene mot Kina».\n\nVidere hevder kineserne i e-posten at Kinas teknologiske utvikling ikke er «avhengig av å\nstjele eller plyndre, men resultatet av vårt eget harde arbeid».\n\nDe anklager PST for å opptre «uansvarlige» i tilsvaret som er sendt fra ambassadens\npresseavdeling.\n\n«PST innrømmet i intervjuet at det er vanskelig å spore kilden til nettangrep, og bevisene\ner utilstrekkelige. Det er veldig uansvarlig å spre anklager om «antagelse om skyld» uten å\nlegge frem klare bevis».\n\n## Angripere hentet ut data\n\nDet var sommeren 2018 at flere statsforvalterembeter ble utsatt for et omfattende og\navansert dataangrep.\n\nStatsforvalterne het den gang fylkesmenn, og angriperne kom seg først inn i\ndatasystemene hos Fylkesmannen i Aust- og Vest-Agder. Derfra klarte de så å ta seg\nvidere til systemer hos fylkesmannsembetene i Hedmark og Oslo og Akershus. Der kom\nde seg inn i datasystemer som rammet statsforvalter-embeter over hele landet.\n\nMed bakgrunn i omfanget ble saken tatt veldig alvorlig. PST startet etterforskning for å\n[finne ut om det var snakk om spionasje for å stjele statshemmeligheter.](https://lovdata.no/lov/2005-05-20-28/%C2%A7121)\n\n– Statsforvalterne håndterer en rekke ulike opplysninger – både av personsensitiv karakter\nog også opplysninger om rikets sikkerhet. Det er opplysninger knyttet til forsvar og\nberedskap for eksempel. Det er noe av grunnen til at man har vært bekymret, og grunnen\ntil at PST har etterforsket denne saken, sier politiadvokat Kathrine Tonstad i PST.\n\nStatsforvalterne behandler blant annet nordmenns helseopplysninger fordi fylkeslegens\nkontor er en del av embetet. Også sensitive opplysninger fra barnevernssaker behandles\nder, og statsforvalterne har et koordinerende beredskapsansvar.\n\n\n-----\n\nEtterforskningen har ifølge PST vist at det ble hentet ut data, men de kan ikke slå fast om\ndet var informasjon som berører rikets sikkerhet.\n\n– Vi ser at aktøren har tatt seg inn i ulike statsforvalterembeter, skaffet seg tilgang til data\nog stjålet ut noe data. Vi tror det de har stjålet ut er brukernavn og passord til ansatte hos\nstatsforvalterne, sier politiadvokat Tonstad.\n\nIfølge en gjennomgang av dataangrepet ble det hentet ut 1,2 gigabyte med data, viser en\n[rapport laget av Forsvarets forskningsinstitutt (FFI), på oppdrag fra Justisdepartementet.](https://publications.ffi.no/nb/item/handtering-av-ikt-sikkerhetshendelsene-i-helse-sor-ost-og-fylkesmannsembetene-en-vurdering)\n\n## Henlegges\n\nNå er etterforskningen avsluttet og saken henlegges på bevisets stilling.\n\nBegrunnelsen er at PST ikke har nok åpne opplysninger om hvilken aktør som står bak til\nat de kunne tatt saken til retten.\n\nPolitiadvokat Kathrine Tonstad i PST forteller at de ikke har bevis som gjør at de\nstrafferettslig kan ta saken videre.\n\nFoto: Øyvind Bye Skille / NRK\n\n– Beviskravene i strafferetten er strenge, og for at vi skal kunne peke på en aktør i en\nstraffesak må vi ha sikre holdepunkter. Det har vi ikke i denne saken, sier PSTs\npolitiadvokat Kathrine Tonstad.\n\n_– Hvorfor er det så vanskelig å bevise?_\n\n– Det vi ser er at det er tale om et avansert og profesjonelt dataangrep. Det er det ofte i\ndisse tilfellene, og det er ofte vanskelig å følge spor som går gjennom mange land og det\ner sofistikert utført. Derfor er det vanskelig å kunne bevise hvem som står bak, svarer\nTonstad.\n\n## Kom seg inn via hjemmekontor-løsning\n\nPST opplyser til NRK at man antar at angriperne kom seg inn i datasystemene til\nstatsforvalterne via et system for fjernpålogging. Dette nevnes også i FFI-rapporten om\nangrepet.\n\nSlike systemer kan for eksempel være VPN-løsninger, som det siste året har blitt brukt av\nstadig flere på grunn av mer hjemmekontor under pandemien.\n\n– Denne aktøren, APT31, er kjent for å bruke luremeldinger på e-post, omtalt som\n«phishing», for å få ansatte til å oppgi brukernavn og passord. Så kan de igjen bruke de\nopplysningene for å logge på VPN-løsninger, forklarer leder for sikkerhetstjenester Erik\nAlexander Løkken i det norske sikkerhetsselskapet Mnemonic til NRK.\n\n\n-----\n\nLøkken forklarer at slike avanserte statlige digitale trusselaktører, ofte omtalt som APT\n(advanced persistent threat), bruker tid på å kartlegge de som skal angripes. De\nundersøker hvem som jobber der, hvilke type datasystemer som brukes og om det er noen\nsystemer som har sikkerhetshull som ikke er fikset ennå.\n\nPå samme måte som angriperne kartlegger ofrene sine fører Mnemonic oversikt over\nkjennetegn ved kjente hackergrupper. Her sees noen spor fra APT31 fra andre\ndataangrep.\n\nFoto: Tore Linvollen / NRK\n\nMnemonic driver både med forebyggende sikkerhet for en rekke ulike bedrifter, men bistår\nogså selskaper etter at de har vært utsatt for et dataangrep. Derfor følger de nøye med på\nhva fienden har av metoder og kjennetegn for å finne måter å beskytte seg på.\n\n– Det er kjent at APT31 bruker en bakdør-programvare som har mulighet til å laste opp\ndata til kjente fildelingstjenester som Dropbox, Microsoft OneDrive og tilsvarende, sier\nLøkken til NRK.\n\nDette stemmer også med de få opplysningen som er kjent om angrepet mot\nstatsforvalterne.\n\nI FFI-rapporten om dataangrepet kommer det fram at angriperne stjal data og kopierte\ndem ut til Dropbox.\n\n## Dataangrep mot fylkesmennene\n\nI 2018 ble fylkesmennene rammet av et alvorlig dataangrep. Her kan du se tidslinjen over\nangrepet.\n\n### Midten av juli 2018\n\n Forsøk på inntrenging\n\nEn trusselaktør forsøkte å få tilgang til datasystemene i fylkesmannsembetene. Det\nble gjort forsøk på inntrenging gjennom fjernaksess hos både fylkesmannsembetene\ni Agder, Oslo og Akershus, Vestfold og Trøndelag. To-faktorautentisering (2FA)\nstoppet aktøren.\n\n### 18. juli 2018\n\n Angriperne kommer seg inn\n\nForsøkene på angrep fortsatte, og kom seg til slutt inn via en fjernaksess-løsning hos\nFylkesmannen i Aust- og Vest Agder.\n\n\n-----\n\n### Slutten av juli 2018\n\n Rekognosering av nettverk og filer\n\nEtter å ha kommet seg inn på systemene hos Fylkesmannen i Aust- og Vest Agder\nstarter angriperne rekognosering av nettverkene og filsystemene. De klarte også å\nskaffe seg høyere tilgang i systemene, og å komme seg inn hos andre\nfylkesmannsembeter via den første tilgangen.\n\n### 24. juli 2018\n\n Starter skadevare\n\nAngriperne installerer og starter skadevare på systemene til Fylkesmannen i Aust og\nVest Agder. Det samme skjer også hos Fylkesmannen i Hedmark og Fylkesmannen i\nOslo og Akershus i dagene etter. Skadevaren som ble benyttet kalles Trochilus.\n\n### 30. juli 2018\n\n Henter ut data\n\nAngriperne henter ut data i dagene fram til og med 30. juli 2018. Til sammen skal de\nha hentet ut rundt 1,2GB med data via tjenesten Dropbox.\n\n### 31. august 2018\n\n Skadevaren mister kontakt med angrepsservere midlertidig\n\nSkadevaren var i kontakt med kommando- og kontrollservere fram til 31. august\n2018. På dette tidspunktet skjer det en endring der domenet knyttet til\nangrepsserveren bytter ip-adresse og kommunikasjonen stopper midlertidig.\n\n### 22. oktober 2018\n\n Fylkesmannen i Oslo og Akershus varsles av NorCERT\n\nSikkerhetseksperter ved NorCERT hos Nasjonal sikkerhetsmyndighet (NSM) varsler\nFylkesmannen i Oslo og Akershus om et mulig angrep. Ekspertene blir henvist\nvidere til Fylkesmannen i Hedmark som driftet fellessystemer for fylkesmennene.\n\n### Slutten av oktober 2018\n\n NSM setter opp sensorer\n\nNSM og Fylkesmannen i Hedmark starter kartlegging av det de trodde kunne være\n[et mulig angrep. Det blir installert sensorer (VDI) fra NSM for å kunne følge med på](https://www.nrk.no/norge/fylkesmennene-manglet-sensorer-som-skulle-oppdage-dataangrep-1.14388610)\ntrafikken i nettverkene.\n\n\n-----\n\n### November 2018\n\n PST starter etterforskning\n\nPåtalemyndigheten beslutter at PST skal starte en etterforskning av dataangrepet\nselv om de ennå ikke har mottatt noen anmeldelse.\n\n### 7. november 2018\n\n Koordineringsgruppe opprettes\n\nEn koordineringsgruppe opprettes for å bedre samarbeidet rundt håndtering av\ndataangrepet. I gruppen sitter representanter for Kommunal- og\nmoderniseringsdepartementet, PST, NSM, Direktoratet for samfunnssikkerhet og\nberedskap (DSB) og fylkesmannsembetene.\n\n### 13. november 2018\n\n Alle fylkesmennene informeres\n\nEt informasjonsskriv om dataangrepet sendes ut til alle fylkesmannsembetene via\ngradert nett.\n\n### Midten av november 2018\n\n Beslutter å ikke kaste angriperne ut\n\nI midten av november 2018 kartlegges det hva angriperne har gjort på\ndatasystemene – så godt det lar seg gjøre. Etter en del diskusjon besluttes det å ikke\nkaste angriperne ut av systemene. Etter råd fra NSM ønsker man å følge med på\nangriperne for å finne ut mer, og at dette gjøres slik at de ikke skal oppdage at de er\navslørt.\n\n### 24. desember 2018\n\n Skadevaren tar kontakt med angrepsserver på nytt\n\nSkadevaren på datasystemene hadde ikke hatt kontakt med angrepsserverne siden\nslutten av august. Denne dagen tar de skadelige programmene igjen kontakt med\nadressen knyttet til kommando- og kontrollserverne til angriperne. Den nye\naktiviteten blir oppdaget etter 12 timer av NSM NorCERT.\n\n\n-----\n\n### 24. desember 2018\n\n Kobler systemer fra internett\n\nEtter varslingen om ny kontakt mellom datasystemene hos fylkesmennene og\nangripernes systemer blir det besluttet å koble ned internett-tilkoblingen. En\nmedarbeider reiser til Fylkesmannen i Hedmark sine lokaler på Hamar og kobler fra\nsystemene. Det viser seg senere at varselet var en falsk positiv fordi det ikke ble\netablert fullstendig oppkobling til angriperne.\n\n### 27. desember 2018\n\n Dataangrepet blir kjent i media\n\nNedkoblingen av datasystemer hos fylkesmennene fører til at dataangrepet blir kjent\ni media. PST bekrefter at de har hatt en etterforskning i gang siden november.\n\n## Gruppe med koblinger til Kinas statsapparat\n\nGruppen som PST nå peker på omtales som APT31, men har også fått andre navn som\n[Zirconium,](https://blogs.microsoft.com/on-the-issues/2020/09/10/cyberattacks-us-elections-trump-biden/) [Bronze Vinewood og](https://www.secureworks.com/research/threat-profiles/bronze-vinewood) [Judgement Panda.](https://www.crowdstrike.com/falcon/wp-content/uploads/2020/10/2020-Global-Threat-Report.pdf)\n\nDet siste navnet har gruppen fått av sikkerhetsselskapet Crowdstrike, som har ulike\npanda-navn på grupper de knytter til Kina. I sikkerhetsmiljøet internasjonalt har APT31 av\nnoen blitt omtalt som styrt av det kinesiske departementet for statssikkerhet (Ministry of\nState Security MSS).\n\n– Denne trusselaktøren kobles av en del til det nasjonale departementet for statssikkerhet\ni Kina. Da vil de gjerne gjøre angrep på oppdrag fra dem, og gå mot spesifikke mål, sier\nErik Alexander Løkken hos Mnemonic.\n\nErik Alexander Løkken er leder for sikkerhetstjenester i det norske sikkerhetsselskapet\nMnemonic.\n\nFoto: Øyvind Bye Skille / NRK\n\n_– Hvordan har man klart å gjøre en slik kobling?_\n\n– Flere sikkerhetsselskaper har koblet APT31 til kinesiske myndigheter i undersøkelsene\nav ulike dataangrep og hendelser der gruppen har vært involvert. Denne koblingen er ofte\ngjort ved at man ser at gruppen bruker de samme verktøyene som kinesiske myndigheter\ner kjent for å bruke, svarer eksperten fra Mnemonic.\n\n\n-----\n\nLøkken forklarer at det er godt kjent at slike kinesiske hackergrupper har vært aktive de\nsiste tiårene. De har systematisk stjålet informasjon som ledd i industrispionasje rundt\nvåpenteknologi, medisiner og også angrep rettet mot enkeltpersoner.\n\n[APT31 har de senere årene blitt koblet til flere dataangrep i ulike land:](https://malpedia.caad.fkie.fraunhofer.de/actor/apt31)\n\n[Finland pekte i mars i år på APT31 etter dataangrep mot den finske](https://supo.fi/en/-/supo-identified-the-cyber-espionage-operation-against-the-parliament-as-apt31)\nnasjonalforsamlingen.\n[Både Google og](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats/) [Microsoft har uttalt at gruppen målrettet seg mot ansatte i Joe](https://blogs.microsoft.com/on-the-issues/2020/09/10/cyberattacks-us-elections-trump-biden/)\nBidens valgkamp-apparat under valget i USA i 2020.\n[Det norske programvareselskapet Visma ble utsatt for et angrep i 2018/2019, som](https://www.nrk.no/urix/granskarar_-kina-hacka-norsk-selskap-1.14418026)\n[sikkerhetseksperter mener APT31 kan stå bak.](https://www.nrk.no/norge/tvil-om-hvem-som-star-bak-visma-hackingen-1.14420262)\n\nAPT31 er likevel ikke kjent for å bruke de mest kompliserte metodene.\n\n– APT31 er ikke kjent for å være av de mest avanserte trusselaktørene, men en som\nkanskje jobber i tidligere faser med å innhente masse informasjon. Det kan hende denne\ninformasjonen så brukes av andre grupper som er knyttet til det kinesiske statsapparatet i\nnye og mer avanserte angrep, sier Løkken.\n\n**NRK har bedt om en kommentar fra Kinas ambassade i Norge, men har enn så lenge**\n**ikke mottatt noe svar.**\n\nFinske myndigheter pekte også mot Kina og aktørene i APT31 etter at den finske\nriksdagen ble utsatt for et dataangrep.\n\nFoto: Emmi Korhonen / AP/NTB\n\n## Nupi-forsker: – Voksende bekymring med angrep fra statlige aktører\n\nSeniorforsker Karsten Friis ved Norsk utenrikspolitisk institutt (Nupi) forsker og følger med\npå dataangrep, cyberoperasjoner og forholdet mellom land i verden på feltet.\n\nNupi-forskeren forklarer at flere av verdens stormakter som Kina, Russland og andre land\nover tid har brukt dataangrep og hacking som digitale våpen mot hverandre og for å\nspionere.\n\n– Hvorfor gjør Kina dette angrepet mot statsforvalterne da?\n\n_– Jeg vil anta at de kan være interessert i sentrale personer som jobber der. For det kan_\nvære sentrale personer i norsk politikk og samfunnsliv.\n\nKarsten Friis forsker blant annet på cyberangrep i sitt arbeid ved Nupi.\n\n\n-----\n\nFoto: Øyvind Bye Skille / NRK\n\n_– Vil slike angrep være godkjent fra høyere hold i landet?_\n\n– Vi må anta det, men vi vet det ikke sikkert. Siden dette er sikkerhetsorganisasjoner og\nsensitive spørsmål må vi anta at de ikke opererer helt fritt.\n\nHan sier at bruken av hacking har blitt mer utbredt mellom stater.\n\n– Det har vært en voksende bekymring rundt dataangrep over flere år. Tidligere var det\nmer kriminelle aktører, men nå er statlige aktører blitt en større sikkerhetsutfordring. De\ngår på sikkerhetsinstitusjoner og demokratiske institusjoner. Det er en trend vi har sett de\nsiste årene, sier Friis til NRK.\n\nKina har tidligere vært kjent for å stjele informasjon som kan hjelpe egne selskaper og\negen teknologiutvikling. Friis forklarer at de gjerne har utnyttet mulighetene fordi spionasje\ngjennom datamaskiner er enklere enn på de mer gammeldagse metodene. Så i nyere tid\nhar de også angrepet statsapparatet og parlamenter.\n\nNupi-forskeren mener det er riktig av Norge å peke tydelig på Kina om man har god nok\ninfo om at det kan være de som står bak.\n\nOg han synes det er interessant at man for første gang peker så tydelig i en konkret sak.\n\n– I Norge er det første gang Kina nevnes av myndighetene. Vi har hørt om Russland\ntidligere etter dataangrepet mot Stortinget, men ikke Kina. Det har bare vært spekulert\ntidligere om Kina kunne stå bak angrep, blant annet etter angrepet mot Helse sør-øst.\nDette er derfor første gang Kina nevnes eksplisitt av norske myndigheter, sier Friis.\n\n\n-----",
    "language": "DA",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-17 - For the first time, PST says that China (APT31) is behind a computer attack.pdf"
    ],
    "report_names": [
        "2021-06-17 - For the first time, PST says that China (APT31) is behind a computer attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536182,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1653766671,
    "ts_modification_date": 1653766671,
    "files": {
        "pdf": "https://archive.orkl.eu/9566904a54d301fe649c504d05f182f38c4431e6.pdf",
        "text": "https://archive.orkl.eu/9566904a54d301fe649c504d05f182f38c4431e6.txt",
        "img": "https://archive.orkl.eu/9566904a54d301fe649c504d05f182f38c4431e6.jpg"
    }
}