{
    "id": "4fa3d81f-cc59-439b-98f1-c9ac74029db9",
    "created_at": "2023-01-12T15:07:06.492585Z",
    "updated_at": "2025-03-27T02:16:34.887792Z",
    "deleted_at": null,
    "sha1_hash": "e9f671eca99362ad79c3808345f686f307b69ac0",
    "title": "2022-04-27 - Assembling the Russian Nesting Doll- UNC2452 Merged into APT29",
    "authors": "",
    "file_creation_date": "2022-05-28T15:38:13Z",
    "file_modification_date": "2022-05-28T15:38:13Z",
    "file_size": 908064,
    "plain_text": "# Assembling the Russian Nesting Doll: UNC2452 Merged into APT29\n\n**mandiant.com/resources/unc2452-merged-into-apt29**\n\nMandiant has gathered sufficient evidence to assess that the activity tracked as UNC2452,\n[the group name used to track the SolarWinds compromise in December 2020, is attributable](https://www.mandiant.com/resources/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor)\nto APT29.\n\n[This conclusion matches attribution statements previously made by the U.S. Government](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-imposing-costs-for-harmful-foreign-activities-by-the-russian-government/)\nthat the SolarWinds supply chain compromise was conducted by APT29, a Russia-based\nespionage group assessed to be sponsored by the Russian Foreign Intelligence Service\n(SVR). Our evaluation is based on firsthand data gathered by Mandiant and is the result of\nan extensive comparison and review of UNC2452 and our detailed knowledge of APT29.\n\nThe [merge of UNC2452 into APT29 significantly expands our knowledge of APT29 and](https://www.mandiant.com/resources/how-mandiant-tracks-uncategorized-threat-actors)\nshowcases an evolving, disciplined, and highly skilled threat actor that operates with a\nheightened level of operational security (OPSEC) for the purposes of intelligence collection.\nThis blog post builds on our efforts to share information and provide awareness related to\nAPT29’s developments.\n\n## Evolving Tradecraft\n\nAPT29 is a highly sophisticated group that has continued to evolve and refine its operational\nand behavioral tactics, techniques, and procedures (TTPs) to better obfuscate activity and\nlimit its digital footprint to avoid detection. The merge expands APT29’s operational profile,\nemphasizing the group’s well-resourced nature, longevity of operations, time on targets,\nOPSEC, adaptability, and stealth. The group has been steadily advancing its TTPs and\nadopting new measures as new technologies emerge.\n\n**High Operational Tempo and Scale. Mandiant has tracked APT29 activity since at**\nleast 2014 and despite significant public exposure following the SolarWinds\ncompromise in 2020, the group has continued to conduct multiple, large-scale\ncompromises simultaneously in different time zones throughout 2020 and 2021 at a\nhigh operational tempo. In 2021 and 2022, we observed APT29 conduct large-scale\nphishing campaigns targeting diplomatic entities in Europe, North America, and Asia.\nThe scale and scope of this activity suggests the group is well-resourced.\n**Wide Operational Scope. APT29 has targeted Western and European governments**\nand a range of additional industries including education, telecommunications,\ngovernment-adjacent organizations, medical research entities, and organizations that\nprovide third party access, such as technology companies and IT and business service\nproviders.\n\n\n-----\n\n**Victimology and Data Theft. APT29 has maintained a consistent focus on**\naggressively gaining and maintaining access to email mailboxes. More recently, they\nalso targeted cloud-based resources and source code repositories to hunt for data\nrelevant to Russian strategic interests, conduct operational planning, and to use access\nto third parties as a point of entry to downstream customers.\n\nFigure 1: APT29 Victimology\nMandiant observed APT29 evolve its already advanced tradecraft to adapt to different victim\nenvironments and emerging technology in the following ways:\n\n**Varying Intrusion Vectors. Since 2020, APT29 increasingly sought to exploit trust**\n[relationships between customers and third parties and abuse the supply chain, as](https://www.mandiant.com/resources/russian-targeting-gov-business)\nevidenced by the prolific nature of the SolarWinds compromise. Mandiant observed\nAPT29 leverage varying operational techniques to gain initial access to victims\nincluding stolen credentials, web server compromises, password sprays, and spear\nphishing. Notably, from 2021 to the present, Mandiant observed APT29 alter its TTPs\nslightly to deploy Cobalt Strike BEACON via spear phishing campaigns likely due to the\navailability and success of the publicly available malware, as well as to complicate\nattribution efforts given the tool’s wide use.\n\n\n-----\n\nFigure 2: Initial Infection Vectors used by APT29\n\n**Heightened OPSEC. APT29 is known for its extensive operational discipline and**\ncontinues to maintain a strong OPSEC posture across all operations. APT29\ndemonstrates a heightened level of OPSEC to protect secondary backdoors, lateral\nmovement attempts, and data theft. For instance, APT29 went to considerable lengths\nto hide its [SUNBURST backdoor within the legitimate SolarWinds code during the initial](https://www.mandiant.com/resources/sunburst-additional-technical-details)\n[campaign. Additionally, Mandiant previously identified the group attempts to](https://www.mandiant.com/resources/russian-targeting-gov-business)\ncompromise multiple accounts within an environment while keeping the use of each\naccount separate by function, using one for reconnaissance and the others for lateral\nmovement. This reduces the likelihood that detecting one compromised account’s\nactivity could expose the entire scope of the intrusion.\n\n[Since 2018, APT29 has consistently enhanced the operation security of its command](https://www.mandiant.com/sites/default/files/2021-09/rpt-apt29-hammertoss-1-1.pdf)\nand control (C2) infrastructure using legitimate services and compromised\n[infrastructure, as well as using domain fronting techniques, and reliance on](https://www.mandiant.com/resources/apt29-domain-frontin)\nanonymized internet access, such as using proxy services and the TOR network. In\naddition, APT29 has continued to demonstrate a clear understanding of security\noperations, incident response, remediation efforts, and network detection mechanisms.\nTable 1 provides some examples of additional OPSEC measures taken by the group.\n\nTable 1: Examples of APT29 network- and host-based OPSEC measures\n\n**Network-based OPSEC** **Host-based OPSEC**\n\n\n-----\n\nC2 Consideration\n\nUsed legitimate services for C2\nAdjusted C2 callout intervals\n\nBlending In\n\nMatched hostnames to the victim\nenvironment’s naming convention\nLeveraged native Microsoft tools\n\nInfrastructure OPSEC, as detailed in this\npost\n\nLocalized “last mile” infrastructure near\nvictim organizations by using\nresidential IP address ranges to\nauthenticate to victim environments\nGeolocating Azure infrastructure in the\nsame geography as the victim\ninfrastructure\nUsed a mixture of TOR, VPS, and\nVPNs to access victim environments\nUsed IP address proxy providers that\nproxy traffic though mobile devices, to\nmake traffic appear as if it was\noriginating from domestic ISPs and\ndevices\n\nSeparate Infrastructure\n\nSeparated SUNBURST callback\ninfrastructure from other follow-on\nmalware families to preserve access\nand protect this toolset if follow-on\nactivity was discovered\nRestricted C2 reuse by establishing\nunique C2 servers per victim and\nsingle-use C2 servers for individual\nhosts\n\n\nLooking Legitimate\n\nModified a legitimate Microsoft DLL to\nenable the DLL Side Loading of a\nmalicious payload\nMasqueraded malicious scheduled\ntasks, processes, and shortcut files\nas legitimate tasks, binaries, and\ndocuments\nReplaced a legitimate binary with a\nmalicious file of the same name and\nthen reinstalled the original file after\nthe malicious binary completed\nexecution\nMinimized the size of exfiltrated data\nand used encrypted connections for\ndata exfiltration\n\nDisabling Security Controls\n\nDetected and disabled antivirus and\nsystem logging features then\nreenabled these features in some\ncases upon completion of malicious\nactivity\n\nDisabled SysInternals Sysmon and\nSplunk Forwarders on victim\nmachines that they accessed via\nMicrosoft Remote Desktop\n\nCovering Tracks\n\nCleared Windows Event Logs\nEstablished persistence to perform\nreconnaissance, removed it before\nmoving laterally to another system,\nand then verified that the persistence\nwas removed\nExtensive use of Microsoft’s secure\ndelete tool (SDELETE) following\ninteractive operations on a host\n\nMonitoring Remediation\n\nAccessed IT personnel mailboxes to\nmonitor remediation efforts and adjust\nTTPs as needed\n\nUsing Varying TTPs\n\n\n-----\n\nEmployed slight variations in TTPs\nand malware for spear phishing\ncampaigns\n\n\n-----\n\n**Sophistication. APT29 has a proven ability to adapt quickly during operations. The**\ngroup uses innovative and novel techniques to bypass detection and strong\nauthentication requirements in victim environments. In more recent operations, their\nfundamental understanding of native M365 features allowed them to move easily\nbetween on-premises and cloud resources without using a substantial amount of\nmalware. We believe these measures, combined with a high level of OPSEC, longevity\nof the group’s operations, and their time on targets demonstrate a well-resourced and\nhighly sophisticated actor.\n\n**On-prem to Cloud. APT29’s advanced knowledge of Microsoft tools and cloud**\nenvironments allows the group to abuse product features to achieve and maintain\naccess—despite strong authentication requirements– without using specific\nvulnerabilities or deploying custom malware. This enables them to easily pivot\nfrom on-premises networks to cloud resources to create persistent access to\ntargets and sensitive data. Mandiant observed APT29 target and move laterally to\nthe M365 environment starting in 2018 by using a combination of seven primary\n[techniques detailed in our guidance.](https://www.mandiant.com/sites/default/files/2021-11/wp-m-unc2452-000343.pdf)\n**Bypassing Multi-Factor Authentication (MFA): From 2018 to 2020, APT29**\nused an assortment of methods to satisfy strong authentication requirements in\nvictim environments for lateral movement. These included enrolling devices for\nMFA or bypassing it via legacy authentication, adding credentials to service\nprincipals and app registrations, and utilizing precomputed cookies to bypass\nMFA requirements and log in successfully without raising any alarms. The group\nalso leveraged legitimate credentials to abuse repeated MFA push notifications to\nan end user’s legitimate device until the user accepted the authentication. We\nalso observed the group evolve from using Golden Tickets to access sensitive\ndata from on-premises systems to [Golden SAML (Security Assertion Markup](https://www.mandiant.com/sites/default/files/2021-11/wp-m-unc2452-000343.pdf)\nLanguage) for victim environments that used cloud hosted resources. Both\ntechniques allow attackers to bypass authentication requirements and access the\nvictim environment with any privileges and as any user, even after a domain-wide\npassword reset of user accounts.\n\n\n-----\n\n**Maintaining a Light Malware Footprint: APT29 shifted away from using a toolkit**\nof customized tools to maintaining a relatively light malware footprint since 2018,\nlikely due to extensive open-source reporting on the group’s toolkit. This allows\nfor fewer detection opportunities by anti-virus engines and complicates attribution\nefforts. The group appears to favor the use of stolen credentials, abusing native\nMicrosoft features to maintain access to victim environments. In some cases, we\nhave observed the group shift from deploying custom tools after gaining a\nfoothold to deploying BEACON. This is likely due to the success, availability,\nmodification potential, and attribution complications provided by BEACON. From\n2018 to 2021, APT29 limited their use of custom tools to a little under half of all\nobserved compromises. For compromises during that timeframe that featured\ncustom tools, APT29 used custom malware families including SUNBURST,\nBEACON droppers RAINDROP and TEARDROP, a credential theft tool called\nMAMADOGS, and CRIMSONBOX; a .NET tool that extracts the token signing\ncertificate from an ADFS configuration, assisting the group in forging SAML\ntokens.\n**Speed and Agility. APT29 can quickly adjust their tools and TTPs to adapt to**\nvictim environments and to retain access through remediation efforts. In multiple\ncases, APT29 was able to gain Domain Administrator privileges less than 12\nhours after the initial execution of a phishing payload. In 2020, approximately five\ndays after the public disclosure of the SolarWinds supply chain compromise,\nAPT29 moved the persistent BEACON backdoor to an additional system in a new\nsubnet following an email sent from the internal information security team to IT\nadministrators to request an image of the SolarWinds system. This suggests the\ngroup was monitoring the organizations' emails and subsequently employed\ncountermeasures to maintain access.\n**Follow the Data. Since 2018, Mandiant observed APT29 adjust their tactics to**\naccess victim environments to avoid losing access to critical data located onpremises and in cloud environments. Mandiant observed the group use different\nmethods to gather emails from different victim environments. These include using\npublicly available tools that harvest local OST and PST files for on-premises\nsystems and switching to abusing service principals, adding permissions to\nvictims' mailboxes and mailbox folders, and using application impersonation for\ncloud environments.\n\n## Outlook and Implications\n\nSince Mandiant began tracking APT29 in 2014, the group has continued to advance its\nsignificant technical tradecraft and OPSEC. The consistent and steady advancement in TTPs\nspeaks to its disciplined nature and commitment to stealthy operations and persistence.\nMerging UNC2452 into APT29 has given us a better understanding of how APT29’s\noperations have evolved over the years, including how the group further honed its technical\nskills to bypass security controls scale TTPs for emerging technology blend in with victim\n\n\n-----\n\nenvironments, and hinder detection across all aspects of its operations. Mandiant is almost\ncertain that APT29 will continue to evolve its operational and behavioral TTPs based on its\nadvanced skillset and ability to creatively employ novel TTPs and tools to gain persistent\naccess to targets.\n\nPlease refer to our white paper on remediating and hardening strategies to defend against\n[APT29, and check out our webinar for even more information.](https://www.brighttalk.com/webinar/assembling-the-russian-stacking-doll-unc2452-merged-into-apt29/)\n\n## MITRE ATT&CK Techniques Added as a Result of the Merge\n\n**Resource Development**\n\nT1583.003: Virtual Private Server\n\n**Initial Access**\n\nT1195.002: Compromise Software Supply Chain\nT1199: Trusted Relationship\n\n**Execution**\n\nT1059.007: JavaScript\n\n**Persistence**\n\nT1098: Account Manipulation\nT1098.001: Additional Cloud Credentials\nT1547.009: Shortcut Modification\nT1574.008: Path Interception by Search Order Hijacking\n\n**Privilege Escalation**\n\nT1055.002: Portable Executable Injection\nT1134.001: Token Impersonation/Theft\nT1484.002: Domain Trust Modification\nT1547.009: Shortcut Modification\nT1574.008: Path Interception by Search Order Hijacking\n\n**Defense Evasion**\n\nT1027.003: Steganography\nT1027.005: Indicator Removal from Tools\nT1036.005: Match Legitimate Name or Location\nT1055.002: Portable Executable Injection\nT1070: Indicator Removal on Host\nT1070.001: Clear Windows Event Logs\n\n\n-----\n\nT1070.006: Timestomp\nT1134.001: Token Impersonation/Theft\nT1218.005: Mshta\nT1218.011: Rundll32\nT1480: Execution Guardrails\nT1497.003: Time Based Evasion\nT1550.001: Application Access Token\nT1562.001: Disable or Modify Tools\nT1574.008: Path Interception by Search Order Hijacking\n\n**Credential Access**\n\nT1003.003: NTDS\nT1003.006: DCSync\nT1003.008: /etc/passwd and /etc/shadow\nT1110.003: Password Spraying\nT1111: Two-Factor Authentication Interception\nT1552.001: Credentials In Files\nT1552.004: Private Keys\nT1552.006: Group Policy Preferences\nT1555.005: Password Managers\nT1558: Steal or Forge Kerberos Tickets\nT1558.003: Kerberoasting\nT1606.001: Web Cookies\nT1606.002: SAML Tokens\n\n**Discovery**\n\nT1016.001: Internet Connection Discovery\nT1046: Network Service Scanning\nT1497.003: Time Based Evasion\nT1526: Cloud Service Discovery\n\n**Lateral Movement**\n\nT1550.001: Application Access Token\n\n**Collection**\n\nT1005: Data from Local System\nT1039: Data from Network Shared Drive\nT1074: Data Staged\nT1114.002: Remote Email Collection\nT1213.002: Sharepoint\nT1213 003: Code Repositories\n\n\n-----\n\nT1560.001: Archive via Utility\n\n**Command and Control**\n\nT1071: Application Layer Protocol\nT1071.004: DNS\nT1090.003: Multi-hop Proxy\nT1568.002: Domain Generation Algorithms\nT1571: Non-Standard Port\nT1573.001: Symmetric Cryptography\n\n**Exfiltration**\n\nT1030: Data Transfer Size Limits\nT1567: Exfiltration Over Web Service\nT1567.001: Exfiltration to Code Repository\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-27 - Assembling the Russian Nesting Doll- UNC2452 Merged into APT29.pdf"
    ],
    "report_names": [
        "2022-04-27 - Assembling the Russian Nesting Doll- UNC2452 Merged into APT29.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536026,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653752293,
    "ts_modification_date": 1653752293,
    "files": {
        "pdf": "https://archive.orkl.eu/e9f671eca99362ad79c3808345f686f307b69ac0.pdf",
        "text": "https://archive.orkl.eu/e9f671eca99362ad79c3808345f686f307b69ac0.txt",
        "img": "https://archive.orkl.eu/e9f671eca99362ad79c3808345f686f307b69ac0.jpg"
    }
}