{
    "id": "4fbf63b4-2772-4dba-977d-658a54e5cbba",
    "created_at": "2022-10-25T16:48:24.708909Z",
    "updated_at": "2025-03-27T02:06:13.325786Z",
    "deleted_at": null,
    "sha1_hash": "9508bb76413746f8752eb1fa6d9b29d427f3238f",
    "title": "Trusted Platform Module (TPM)",
    "authors": "",
    "file_creation_date": "2008-05-05T11:56:11Z",
    "file_modification_date": "2008-05-05T11:57:38Z",
    "file_size": 211811,
    "plain_text": "# Trusted Platform Module (TPM) Summary\n\nTPM (Trusted Platform Module) is a computer chip (microcontroller) that can securely\nstore artifacts used to authenticate the platform (your PC or laptop). These artifacts can\ninclude passwords, certificates, or encryption keys. A TPM can also be used to store\nplatform measurements that help ensure that the platform remains trustworthy.\nAuthentication (ensuring that the platform can prove that it is what it claims to be) and\nattestation (a process helping to prove that a platform is trustworthy and has not been\nbreached) are necessary steps to ensure safer computing in all environments.\n\nTrusted modules can be used in computing devices other than PCs, such as mobile\nphones or network equipment.\n\nPicture 1: Components of a TPM\n\nThe nature of hardware-based cryptography ensures that the information stored in\nhardware is better protected from external software attacks. A variety of applications\nstoring secrets on a TPM can be developed. These applications make it much harder to\naccess information on computing devices without proper authorization (e.g., if the device\nwas stolen). If the configuration of the platform has changed as a result of unauthorized\n\n\n-----\n\nactivities, access to data and secrets can be denied and sealed off using these\napplications.\n\nHowever, it is important to understand that TPM cannot control the software that is\nrunning on a PC. TPM can store pre-run time configuration parameters, but it is other\napplications that determine and implement policies associated with this information.\n\nProcesses that need to secure secrets, such as digital signing, can be made more\nsecure with a TPM. And mission critical applications requiring greater security, such as\nsecure email or secure document management, can offer a greater level of protection\nwhen using a TPM. For example, if at boot time it is determined that a PC is not\ntrustworthy because of unexpected changes in configuration, access to highly secure\napplications can be blocked until the issue is remedied (if a policy has been set up that\nrequires such action). With a TPM, one can be more certain that artifacts necessary to\nsign secure email messages have not been affected by software attacks. And, with the\nuse of remote attestation, other platforms in the trusted network can make a\ndetermination, to which extent they can trust information from another PC. Attestation or\nany other TPM functions do not transmit personal information of the user of the platform.\n\nThese capabilities can improve security in many areas of computing, including ecommerce, citizen-to-government applications, online banking, confidential government\ncommunications and many other fields where greater security is required. Hardwarebased security can improve protection for VPN, wireless networks, file encryption (as in\nMicrosoft’s BitLocker) and password/PIN/credentials’ management. TPM specification is\nOS-agnostic, and software stacks exist for several Operating Systems.\n\nTPMs (current version is 1.2) use the following cryptographic algorithms: RSA, SHA1,\nand HMAC..\n\nThe Trusted Computing Group (TCG) is an international de facto standards body of\napproximately 140 companies engaged in creating specifications that define PC TPMs,\ntrusted modules for other devices, trusted infrastructure requirements, APIs and\nprotocols necessary to operate a trusted environment. After specifications are completed,\nthey are released to the technology community and can be downloaded from the TCG\nWeb Site.\n\nWithout standard security procedures and shared specifications, it is not possible for\ncomponents of the trusted environment to interoperate, and trusted computing\napplications cannot be implemented to work on all platforms. A proprietary solution\ncannot ensure global interoperability and is not capable of providing a comparable level\nof assurance due to more limited access to cryptographic and security expertise and\nreduced availability for a rigorous review process. From the point of view of cryptography,\nfor interoperability with the other elements of the platform, other platforms, and\ninfrastructure, it is necessary for trusted modules to be able to use the same\ncryptographic algorithms, Although standard published algorithms may have\nweaknesses, these algorithms are thoroughly tested and are gradually replaced or\nimproved when vulnerabilities are discovered. This is not true in the case of proprietary\nalgorithms.\n\nAccording to market research reports, over 100 million branded PCs and laptops with\nTPMs were sold in 2007. Server produces are beginning to ship, and a variety of\n\n\n-----\n\napplications based on TPM, such as secure email or file encryption, have been\nimplemented using TCG specifications. Trusted Network Connect (TNC) products that\nuse TCG principles to enhance the security of communications are shipping, too. Draft\nspecifications for storage (for hard drives) and mobile trusted modules (for mobile\ntelephones) have been released.\n\nFor more information on applications for the TPM, see\n[https://www.trustedcomputinggroup.org/news/Industry_Data/TPM_applications_paper_M](https://www.trustedcomputinggroup.org/news/Industry_Data/TPM_applications_paper_March_28_2008.pdf)\n[arch_28_2008.pdf. Other white papers and documents are accessible via the](https://www.trustedcomputinggroup.org/news/Industry_Data/TPM_applications_paper_March_28_2008.pdf)\norganization’s website, [https://www.trustedcomputinggroup.org/.](https://www.trustedcomputinggroup.org/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "http://www.trustedcomputinggroup.org/wp-content/uploads/Trusted-Platform-Module-Summary_04292008.pdf"
    ],
    "report_names": [
        "Trusted-Platform-Module-Summary_04292008.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1209988571,
    "ts_modification_date": 1209988658,
    "files": {
        "pdf": "https://archive.orkl.eu/9508bb76413746f8752eb1fa6d9b29d427f3238f.pdf",
        "text": "https://archive.orkl.eu/9508bb76413746f8752eb1fa6d9b29d427f3238f.txt",
        "img": "https://archive.orkl.eu/9508bb76413746f8752eb1fa6d9b29d427f3238f.jpg"
    }
}