{
    "id": "4fd941b2-b26d-4d3c-91aa-79c3502fd80b",
    "created_at": "2023-01-12T15:03:42.659611Z",
    "updated_at": "2025-03-27T02:05:30.660102Z",
    "deleted_at": null,
    "sha1_hash": "41a706fdbe44e7cb05a0e094e1567c4823942845",
    "title": "2016-04-19 - MULTIGRAIN – Point of Sale Attackers Make an Unhealthy Addition to the Pantry",
    "authors": "",
    "file_creation_date": "2022-05-28T15:22:08Z",
    "file_modification_date": "2022-05-28T15:22:08Z",
    "file_size": 272491,
    "plain_text": "# MULTIGRAIN – Point of Sale Attackers Make an Unhealthy Addition to the Pantry\n\n**[fireeye.com/blog/threat-research/2016/04/multigrain_pointo.html](https://www.fireeye.com/blog/threat-research/2016/04/multigrain_pointo.html)**\n\nFireEye recently discovered a new variant of a point of sale (POS) malware family known as\n[NewPosThings. This variant, which we call “MULTIGRAIN”, consists largely of a subset of](http://blog.trendmicro.com/trendlabs-security-intelligence/newposthings-has-new-pos-things/)\nslightly modified code from NewPosThings. The variant is highly targeted, digitally signed,\nand exfiltrates stolen payment card data over DNS. The addition of DNS-based exfiltration is\nnew for this malware family; however, other POS malware families such as BernhardPOS\nand FrameworkPOS have used this technique in the past.\n\nUsing DNS for data exfiltration provides several advantages to the attacker. Sensitive\nenvironments that process card data will often monitor, restrict, or entirely block the HTTP or\nFTP traffic often used for exfiltration in other environments. While these common internet\nprotocols may be disabled within a restrictive card processing environment, DNS is still\nnecessary to resolve hostnames within the corporate environment and is unlikely to be\nblocked.\n\n**Specific Targeting**\n\nSeveral POS malware families will parse through running processes and scrape a large\nnumber of them in the hopes of locating card data. In contrast to that approach,\nMULTIGRAIN has been custom-engineered to target a specific point of sale process:\n\n\n-----\n\n_multi.exe, associated with a popular back-end card authorization and POS (electronic draft_\ncapture) server software package. If multi.exe is not found on the infected host, the malware\nwill not install and will simply delete itself. This shows that while developing or building their\nmalware, the attackers had a very specific knowledge of the target environment and knew\nthis process would be running.\n\n**Persistence**\n\nIf the targeted POS process is running on the host and the malware is executed with a\ncommand line parameter designating “installation mode”, MULTIGRAIN copies itself to the\nhardcoded location “c:\\windows\\wme.exe” and installs a service with the properties shown in\nFigure 1.\n\nFigure 1: Service properties used by MULTIGRAIN POS malware\n\n**Initial Beaconing**\n\nThe malware collects the volume serial number and part of the MAC address and creates a\nhash of the concatenated value using the DJB2 hashing algorithm. The resulting hash is then\ncombined with the computer name and a version number and all three components are then\n[encoded with a custom Base32 encoding algorithm. The malware then makes a DNS query](https://en.wikipedia.org/wiki/Base32)\nwith this information to a hardcoded domain, notifying the attacker of a successful\ninstallation. The process is shown in Figure 2.\n\n\n-----\n\nFigure 2. Construction of Installation Beacon\n\n**Memory-Scraping and Card Data Exfiltration**\n\nOnce installed and executing, MULTIGRAIN begins scraping the memory of the targeted\nprocess for [Track 2 card data, validating that data using the Luhn algorithm. Track 2 data will](http://www.magtek.com/documentation/public/99800004-1.08.pdf)\nnormally contain the PAN (Primary Account Number), Expiration Date, Service Code and\noptionally a CVV/CVC number, data which will typically be sufficient in most scenarios to\n[attempt “card-present” and, and in some cases, “card-not-present” fraud.](https://en.wikipedia.org/wiki/Card_not_present_transaction)\n\nEach Track 2 record is first encrypted with a 1024-bit RSA public key, pushed through the\nsame custom Base32 encoding process as used in the installation beacon, and then stored\nin a buffer. Every five minutes, the malware checks this buffer to see if any card data is ready\nfor exfiltration. If card data is present, the individual encrypted and encoded Track 2 data\nrecord for each card is sent over the network by means of a DNS query made by the\nmalware. The process is shown in Figure 3.\n\n\n-----\n\nFigure 3. Track 2 Card Data Encoding and Exfiltration\n\n**Base32 Encoding**\n\nBoth the installation beacon and the stolen card data are encoded with an unusual encoding\n[algorithm – Base32 – before being transmitted via DNS queries. The choice of Base32 is](https://en.wikipedia.org/wiki/Base32)\n[interesting as Base64 is better known and more widely used (for instance in the MIME](https://en.wikipedia.org/wiki/Base64)\nstandard used by email attachments). Using Base32 will actually result in the data taking up\n20 percent more space than Base64, so the attackers were unconcerned with the efficiency\nof bandwidth.\n\nOne possible reason for selecting Base32 is the relative obscurity of the algorithm. Security\nand data loss prevention (DLP) products are more likely to detect Base64 encoding and in\nsome cases can automatically decode the data, which could result in DLP devices identifying\nthe exfiltration.\n\n**Code Reuse**\n\nElements of the code from MULTIGRAIN show strong similarities to the POS malware family\nknown as NewPosThings. Shared code elements include:\n\nThe code used to scrape a process for card data\nThe DJB2 hashing algorithm used as part of creating a system ID\n\n\n-----\n\nTwo other examples from binary disassembly are shown below: the _connect/3 network_\nbeacon (Figure 4 – seemingly unused in MULTIGRAIN) and similarities in the construction of\nthe installation beacon (Figure 5).\n\nFigure 4. “Connect/3” network beacon comparison between MULTIGRAIN and\nNewPosThings\n\n\n-----\n\nFigure 5. Installation beacon comparison between MULTIGRAIN and NewPostThings\n\n**Digital Signature**\n\nAs shown in Figure 6, this MULTIGRAIN sample is digitally signed with a certificate issued to\nthe “AMO-K Limited Liability Company” with a Comodo root and intermediate certificate\nchain (serial number d0 8d 83 ff 11 8d f3 77 7e 37 1c 5c 48 2c ce 7b). The certificate was\nrevoked on Oct. 14, 2015.\n\n\n-----\n\n-----\n\nFigure 6: Digital certificate used to sign MULTIGRAIN sample\n\n**Conclusion**\n\nOrganizations that process card data must remain vigilant against attackers intent on\nfinancial fraud. Many POS malware families are written to be fairly generic (for example,\ntargeting any process that may contain payment card data). However, threat actors may\noperate with greater stealth, customizing malware for specific environments and using less\ncommon protocols or methods for data exfiltration.\n\nAlthough MULTIGRAIN does not bring any new capabilities to the POS malware table, it\ndoes show that capable attackers can customize malware “on-the-fly” to target a specific\nenvironment. While exfiltration via DNS is not a new tactic, MULTIGRAIN demonstrates that\norganizations should monitor and review DNS traffic for suspicious or anomalous behavior.\n\n**MD5:**\n\nF924CEC68BE776E41726EE765F469D50\n\n\n-----\n\nThis post was first available on Visa Threat Intelligence, the first product available from the\npartnership between Visa Inc. and FireEye. Subscribers will gain access to a powerful web\nportal that distills the latest proprietary cyber intelligence relevant to payment systems into\nactionable information, including timely alerts on malicious actors, methods, trends in cyberattacks, and in-depth forensic analysis from recent data beaches. Contact your Visa\nAccount Executive or email VisaThreatIntelligence@Visa.com for more information.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-04-19 - MULTIGRAIN – Point of Sale Attackers Make an Unhealthy Addition to the Pantry.pdf"
    ],
    "report_names": [
        "2016-04-19 - MULTIGRAIN – Point of Sale Attackers Make an Unhealthy Addition to the Pantry.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535822,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653751328,
    "ts_modification_date": 1653751328,
    "files": {
        "pdf": "https://archive.orkl.eu/41a706fdbe44e7cb05a0e094e1567c4823942845.pdf",
        "text": "https://archive.orkl.eu/41a706fdbe44e7cb05a0e094e1567c4823942845.txt",
        "img": "https://archive.orkl.eu/41a706fdbe44e7cb05a0e094e1567c4823942845.jpg"
    }
}