{
    "id": "4ff24a82-647c-4885-ae3f-95bd9eb04e03",
    "created_at": "2023-01-12T15:07:50.433716Z",
    "updated_at": "2025-03-27T02:16:25.736972Z",
    "deleted_at": null,
    "sha1_hash": "8280f3e76faea5f99c31012311a27ff4f23ac1e2",
    "title": "2021-02-02 - Investigation Xoth - Smartphone Location Tracking",
    "authors": "",
    "file_creation_date": "2021-01-28T22:10:03Z",
    "file_modification_date": "2021-01-28T22:10:03Z",
    "file_size": 1523929,
    "plain_text": "# Investigation Xoth: Smartphone location tracking\n\n**expressvpn.com/digital-security-lab/investigation-xoth**\n\n\n-----\n\n## Introduction\n\nLocation data is commonly harvested from consumer smartphones. A person’s location\ninformation has broad applications in the advertising and analytics industry, with the\npotential for enriching user profiles and providing insights into user behavior via intimate\ndetails about a user’s movements. Additionally, correlations can be made between users and\ntheir distance from Internet-of-Things (IoT) beacon devices. Such methods utilize Bluetooth\nLow Energy (BLE) technology to provide proximity information that is valuable for a wide\n[range of industries including retail and entertainment. This union of brick-and-mortar](https://www.vox.com/recode/21587779/shopping-deals-coupons-privacy-data-collection-retail)\nsensors with network technology has been amplified by Covid-19, and major players such as\n[Google and Apple have boosted BLE-based products in response to the pandemic.](https://blog.beaconstac.com/2020/09/beacon-technology-updates/)\n\nIncreasingly, the data collected by location and proximity sensors ends up in the hands of law\n[enforcement, intelligence agencies, and military organizations. These government entities](https://www.wsj.com/articles/next-step-in-government-data-tracking-is-the-internet-of-things-11606478401)\nand their private contractors are amassing huge troves of data about the movements of entire\npopulations. This threatens not only the privacy of ordinary people around the globe but also\ntheir autonomy—knowledge of a person’s location can be abused to trample their human\nrights, including free expression and association, as well as cause chilling effects.\n\n\n-----\n\n[Today, the ExpressVPN Digital Security Lab is releasing exclusive research about a growing](https://www.expressvpn.com/digital-security-lab)\nthreat to location privacy: A diverse collection of hundreds of mobile apps all linked by major\nintrusions on consumer privacy. We call this effort “Investigation Xoth,” after a fictional\nintelligence group in Cory Doctorow’s novel Attack Surface. The trackers found in these 450\napps are notable not only for their global reach but also a continual presence at the heart of\nprivacy scandals.\n\n[We prepared this report with the aid of Esther Onfroy of the Defensive Lab Agency and with](https://defensive-lab.agency/)\n[the app scanner provided by Exodus Privacy. The results of our investigation are described](https://exodus-privacy.eu.org/)\nbelow, providing new and original insight into expansive and pervasive smartphone\nsurveillance.\n\n## Key findings\n\nWe identified location tracker SDKs in 450 apps that have been downloaded at least 1.7\n[billion times. Though U.S. government scrutiny continues to grow, 67% (305) of these](https://www.nytimes.com/2021/01/22/us/politics/dia-surveillance-data.html)\napps remain available at the end of January 2021.\n\n\n-----\n\nLocation trackers appear in 42 messaging apps with at least 187 million downloads,\nincluding apps masquerading as popular services such as Telegram, Facebook\nMessenger, and WeChat.\n\n[X-Mode, the subject of a ban by Apple and Google, is prevalent in many more apps than](https://www.wsj.com/articles/apple-and-google-to-stop-x-mode-from-collecting-location-data-from-users-phones-11607549061)\npreviously reported, appearing in 44% (199) of the apps we analyzed that have been\ndownloaded at least 1 billion times. Despite the ban, only 10% of these apps have been\nremoved from Google Play.\n\n[Surveillance of Muslim audiences via apps is much larger than previously reported,](https://www.vice.com/en/article/jgqm5x/us-military-location-data-xmode-locate-x)\nwith X-Mode and related location tracker SDKs identified in ten religious and cultural\napps with at least 67 million downloads.\n\nDating and social apps are a notable target of location tracker SDKs, making up 64 of\nthe 450 apps we analyzed with at least 52 million downloads.\n\nQuadrant, a location tracker with over 60 million daily active users, is present in two\napps that have been central in recent privacy scandals.\n\nReferences to OneAudience, which was sued by Facebook for privacy violations, are\npresent in 37% (167) of the apps we analyzed.\n\n## What are tracker SDKs?\n\nA Software Development Kit (SDK) is a package of code that provides functionality for app\ndevelopers. This functionality may include features such as maps, communication with\nBluetooth devices, or even graphics and emojis. Sometimes, however, these SDKs also\ninclude code utilized for advertising and surveillance.\n\n\n-----\n\nSDKs are bundled in a smartphone app s code before it is published in an app store, and\ntherefore are difficult to detect by Google, Apple, or others. Even if a developer announces\nthat it is including a specific SDK in its app, smartphone users are not made aware of its\npresence when they install an app on Android or iOS.\n\nFor privacy and security investigations, it can be crucial to determine what SDKs are present\nin an app. SDKs execute code and communicate over the internet in ways that may\ncompromise user information. In some cases, SDKs are designed specifically to collect and\naggregate data about the behavior, location, or identities of smartphone users. In other cases,\nsuch surveillance is a valuable byproduct of the SDK’s core functionality—an app that\nprovides navigation while you are driving, for example, may also be tracking your movements\nthroughout the day and sending that data back to the app’s developers and third parties.\n\nIn these cases, we call the SDKs “trackers” or “tracker SDKs.” We follow the lead of the\nElectronic Frontier Foundation, Fight for the Future, and other digital rights organizations\nand use the term broadly: “Trackers” encompasses traditional advertisement surveillance,\nbehavioral, and location monitoring. Legitimate uses may include user feedback\nmechanisms, telemetry, and crash reporters.\n\nApp developers have decided to include tracker SDKs in apps for a variety of reasons, and we\ndo not categorize all usage of trackers as malicious or condemn the app authors. Additionally,\ngiven the complexity and pace of software development, some developers may not be aware\nthat trackers are in their app or may not know the full implications of bundling such code\nbefore publishing.\n\n## Searching for SDKs\n\n\n-----\n\n[For more information about this process, see our detailed findings. Our research in this area](https://github.com/expressvpn/xoth_location_tracker_investigation)\nis constrained to Google Play and Android apps. We took this approach in the interest of\nconcision and because static analysis on Apple iOS apps is limited by logistical barriers and\nuncertain legal status. We note that Android is the world’s most popular mobile operating\nsystem, with nearly 73% market share.\n\n## The smartphone surveillance ecosystem\n\nSmartphones have spawned entire industries based upon discovery and analysis of\nconsumers. Within the massive world of smartphone tracking, there are companies that\nspecialize in a particular form of surveillance (e.g., Bluetooth tracking) as well as sprawling\ndata brokers who collect and analyze troves of information.\n\n\n-----\n\nDue to the sheer size and complexity of the smartphone ecosystem, and the data-sharing\nrelationships between the entities that inhabit it, limiting the scope of research can be\ndifficult. Despite the complexity of these connections, a comparative approach is vital to\nunderstanding tracker SDKs and the common threads between them.\n\nIn the past two years, news has piled up about tracker SDKs inside apps that are linked to\ngovernment, military, and law enforcement organizations. As the public learns more about\nthese actors, a bigger picture is beginning to emerge. At the ExpressVPN Digital Security Lab,\nwe want to help put the puzzle together and empower consumers to better understand how\ntheir use of certain apps may have privacy and security implications.\n\nWe started our investigation with apps that have well-known privacy issues and worked\noutward, discovering tracker SDKs in a collection of 450 apps.\n\n## The X-Mode connection\n\n\n-----\n\n[X-Mode makes no secret of its prowess in gathering and analyzing location data, “receiving](https://marketingland.com/pulling-back-the-curtain-on-location-intelligence-266465)\nthe majority of its data directly from mobile app publishers through XDK, its proprietary\nlocation-based SDK.”\n\n[X-Mode’s approach is multi-faceted, “ensuring that companies have access to a higher](https://www.mediapost.com/publications/article/339278/location-data-startup-officially-launches-grows-g.html)\nstandard of location data by tapping into a variety of technologies that most companies do\nnot use.” This approach has, however, been the subject of U.S. congressional scrutiny and has\n[resulted in a ban by Apple and Google.](https://www.wsj.com/articles/apple-and-google-to-stop-x-mode-from-collecting-location-data-from-users-phones-11607549061)\n\nDespite this ban, our investigation found that X-Mode maintains a strong presence on\nGoogle Play. We identified 199 apps with X-Mode tracker SDKs in them, collectively\ndownloaded at least 1 billion times. 90% of these apps continue to be listed in Google Play\nafter the ban.\n\nAlong with these findings, Digital Security Lab has identified novel insights that reveal the\nscope of X-Mode’s penetration.\n\nIn addition to the ”io.xmode” location SDK, we identified “io.mysdk” as an additional\nSDK that exists in the “X-Mode XDK Visualizer” app. Identification of this new\nsignature allowed us to find many more X-Mode apps than had previously been known.\n\nX-Mode “io.mysdk” code lists five providers for communication with location-snooping\nbeacons. These are Placed (a subsidiary of Foursquare), Sense360, Wireless Registry\n(aka SignalFrame), BeaconsInSpace (aka Fysical), and OneAudience.\n\nBy monitoring network endpoints that are persistent across X-Mode apps, such as\n“api.myendpoint.io” and “api.smartechmetrics.com,” we observed beacon configuration\ninformation crossing the internet.\n\nAt least seven apps targeting Muslim audiences contain X-Mode, in addition to the\npresence of X-Mode in previously discovered in Muslim Pro.\n\n\n-----\n\n## Beacon buddies\n\nEach of the names listed in X-Mode’s beacon-communicating code is notable. Wireless\nRegistry, for example, is the former name of SignalFrame and the handle used for its\n[patented “observer SDK.” The recipient of a U.S. Air Force grant, SignalFrame has reportedly](https://uspto.report/patent/grant/10,511,938)\n“developed the capability to tap software embedded on as many as five million cellphones to\ndetermine the real-world location and identity of more than half a billion peripheral devices.”\n\n[OneAudience is well known as the subject of a ban and lawsuit by Facebook for privacy](https://www.vox.com/recode/2020/2/27/21156287/facebook-suing-data-harvesting-company-oneaudience-third-party-developers)\nviolations. In February 2020, Facebook and Twitter [claimed that “OneAudience had been](https://www.vox.com/recode/2020/2/27/21156287/facebook-suing-data-harvesting-company-oneaudience-third-party-developers)\nharvesting private data, such as people’s names, genders, emails, usernames, and potentially\n[people’s last tweets” in a scandal reminiscent of Cambridge Analytica. This ultimately led to a](https://www.vox.com/policy-and-politics/2018/3/23/17151916/facebook-cambridge-analytica-trump-diagram)\n[shutdown of the SDK.](http://www.oneaudience.com/privacy-statement-11-25-2019/)\n\nSense360, BeaconsInSpace (aka Fysical), and Placed (a subsidiary of Foursquare) are all\nprominent players in location surveillance. As with SignalFrame and OneAudience, their\nrelationship with X-Mode is unclear. We provide the following observations.\n\nPlaced, Sense360, Wireless Registry, BeaconsInSpace, and OneAudience are listed as\n[“enabled” by default in X-Mode SDK configuration files.](https://github.com/expressvpn/xoth_location_tracker_investigation)\n\nSDKs from these companies and associated network endpoints are in notable apps. We\nidentified the BeaconsInSpace SDK in Muslim Pro, SignalFrame SDK and OneAudience\nSDK in Muslim Mingle, and Sense360 SDK and Placed SDK in a variety of apps\ncontaining X-Mode.\n\nGeoUniq (aka Cloud4Wi), a [trusted partner of X-Mode, is present in a variety of sports](https://archive.is/2YyU4)\nand entertainment apps, downloaded at least 6.2 million times.\n\nA 2016 BeaconsInSpace [presentation lists popular Android and iOS apps. The status of](https://archive.is/VDAeH)\n[SDK code in these apps is unknown. Sygic, provider of a navigation app “trusted by](https://www.sygic.com/)\nmore than 200 million drivers,” is listed alongside popular apps such as Navmii,\nTripWolf, and Pokémon Go Map Radar.\n\n\n-----\n\n## Local snooping, global impact\n\nOur findings underscore the international reach of location surveillance that originates with\nconsumer smartphones and retail beacon devices. Though Muslim audiences are a\nconspicuous target, the apps we analyzed aim at a wide range of populations worldwide. This\nis perhaps most apparent in dating and social apps that list specific demographics or\ncountries in their names.\n\nWe discovered crossover between these apps and yet more SDKs embroiled in privacy\n[scandals such as Predicio, present in Muslim prayer app Salaat First, and Sygic, provider of](https://www.vice.com/en/article/xgz4n3/muslim-app-location-data-salaat-first)\nSlovakia’s [contact-tracing app.](https://balkaninsight.com/2020/05/20/question-marks-over-slovak-quarantine-app-fuel-privacy-concerns/)\n\n[Predicio and Sygic were also the subjects of a December 2020 investigation by Norwegian](https://nrkbeta.no/2020/12/03/my-phone-was-spying-on-me-so-i-tracked-down-the-surveillants/)\noutlet NRK. That report followed data through a maze of location surveillance vendors,\ndisclosing that third parties “could use this information for purposes such as federal law\nenforcement and national security.”\n\n\n-----\n\nOne app, Fu Weather, is central to that story. While analyzing the app, we discovered a\nnew tracker signature: That of Quadrant “Data Acquisition” SDK, which boasts a presence in\n[apps with hundreds of millions of monthly active users worldwide. In December 2020,](https://platform.quadrant.io/Services/locationQualityDashboard.htm)\nQuadrant tracked approximately 41 million active users per day and 136 million active users\nin the U.S. alone.\n\nWe found Quadrant in a handful of apps, including one app that brings our investigation full\ncircle. Quadrant is present in the source code of Muslim Pro, perhaps the most prominent\ncarrier of X-Mode.\n\nIn addition, we provide the following insights.\n\nDating and social apps are a notable component of the global presence, making up 64 of\nthe 450 apps we analyzed with at least 52 million downloads. These dozens of apps\ntarget a range of sexual orientations as well as a large assortment of national, ethnic,\nand racial groups.\n\nPredicio is present in twelve messenger apps, including apps masquerading as\nTelegram and WeChat. X-Mode is present in apps such as Messenger Go and\nMessenger Pro that mimic the branding of Facebook Messenger, with at least 60\nmillion downloads.\n\nInfinario (aka Exponea) provides analytics for the Sygic SDK, present in five out of the\nseven apps containing Sygic code.\n\n\n-----\n\n## Conclusion\n\nAt the ExpressVPN Digital Security Lab, we have demonstrated the value of holistic and\ncomprehensive analysis of a group of apps. This approach leads to novel discoveries and\nallows us to better understand patterns in digital surveillance.\n\nThrough Investigation Xoth, we identified evidence of the ubiquity of location tracking SDKs\nin a wide range of consumer apps. The overlap and correlations between some of these SDKs\necho findings by journalists and academics, suggesting relationships between various\nlocation trackers.\n\nThough trackers may be nominally banned from app stores, further investigation reveals\nthese measures are not being consistently enforced and do not take into account the\nrelationships between SDKs. Serious auditing of apps before publishing is the only way to\nkeep trackers out of app stores and, even then, detection requires care and dedication.\n\n.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-02 - Investigation Xoth - Smartphone Location Tracking.pdf"
    ],
    "report_names": [
        "2021-02-02 - Investigation Xoth - Smartphone Location Tracking.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536070,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1611871803,
    "ts_modification_date": 1611871803,
    "files": {
        "pdf": "https://archive.orkl.eu/8280f3e76faea5f99c31012311a27ff4f23ac1e2.pdf",
        "text": "https://archive.orkl.eu/8280f3e76faea5f99c31012311a27ff4f23ac1e2.txt",
        "img": "https://archive.orkl.eu/8280f3e76faea5f99c31012311a27ff4f23ac1e2.jpg"
    }
}