{
    "id": "4ff6072a-664b-4ed2-8596-640d523ba7b9",
    "created_at": "2023-01-12T15:11:00.57857Z",
    "updated_at": "2025-03-27T02:17:00.452114Z",
    "deleted_at": null,
    "sha1_hash": "bbf8e76603fa358c4c0c42e821fbfddbc5763679",
    "title": "2022-04-28 - This isn't Optimus Prime's Bumblebee but it's Still Transforming",
    "authors": "",
    "file_creation_date": "2022-05-28T15:57:10Z",
    "file_modification_date": "2022-05-28T15:57:10Z",
    "file_size": 2143966,
    "plain_text": "# This isn't Optimus Prime's Bumblebee but it's Still Transforming\n\n**proofpoint.com/us/blog/threat-insight/bumblebee-is-still-transforming**\n\nApril 27, 2022\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nThis isn't Optimus Prime's Bumblebee but it's Still Transforming\n\n\n-----\n\nApril 28, 2022 Kelsey Merriman and Pim Trouerbach\n\n## Key Findings\n\nProofpoint has tracked a new malware loader called Bumblebee used by multiple crimeware threat actors\npreviously observed delivering BazaLoader and IcedID.\nSeveral threat actors that typically use BazaLoader in malware campaigns have transitioned to\nBumblebee. BazaLoader has not been seen in Proofpoint data since February 2022.\nBumblebee is in active development and wields elaborate evasion techniques to include complex antivirtualization.\nUnlike most other malware that uses process hollowing or DLL injection, this loader utilizes an\nasynchronous procedure call (APC) injection to start the shellcode from the commands received from the\ncommand and control (C2).\nProofpoint observed Bumblebee dropping Cobalt Strike, shellcode, Sliver, and Meterpreter.\nThreat actors using Bumblebee are associated with malware payloads that have been linked to follow-on\nransomware campaigns.\n\n## Overview\n\nStarting in March 2022, Proofpoint observed campaigns delivering a new downloader called Bumblebee. At\nleast three clusters of activity including known threat actors currently distribute Bumblebee. Campaigns\n[identified by Proofpoint overlap with activity detailed in the Google Threat Analysis Group blog as leading to](https://blog.google/threat-analysis-group/exposing-initial-access-broker-ties-conti)\nConti and Diavol ransomware.\n\nBumblebee is a sophisticated downloader containing anti-virtualization checks and a unique implementation of\ncommon downloader capabilities, despite it being so early in the malware's development. Bumblebee's\nobjective is to download and execute additional payloads. Proofpoint researchers observed Bumblebee\ndropping Cobalt Strike, shellcode, Sliver and Meterpreter. The malware name comes from the unique UserAgent \"bumblebee\" used in early campaigns.\n\nThe increase of Bumblebee in the threat landscape coincides with BazaLoader a popular payload that\nfacilitates follow-on compromises–disappearing recently from Proofpoint threat data.\n\n## Campaign Details\n\n\n-----\n\nProofpoint researchers have observed Bumblebee being distributed in email campaigns by at least three\ntracked threat actors. The threat actors have used multiple techniques to deliver Bumblebee. While lures,\ndelivery techniques, and file names are typically customized to the different threat actors distributing the\ncampaigns, Proofpoint observed several commonalities across campaigns, such as the use of ISO files\ncontaining shortcut files and DLLs and a common DLL entry point used by multiple actors within the same\nweek.\n\n### URLs and HTML Attachments Leading to Bumblebee\n\nIn March 2022, Proofpoint observed a DocuSign-branded email campaign with two alternate paths designed to\nlead the recipient to the download of a malicious ISO file. The first path began with the recipient clicking on the\n\"REVIEW THE DOCUMENT\" hyperlink in the body of the email. Once clicked, this would link the user to the\ndownload of a zipped ISO file, hosted on OneDrive.\n\n_Figure 1: Email delivered March 2022 containing a URL and an HTML attachment_\n\nAlternatively, the same email also contained an HTML attachment. The appearance of the opened HTML file\nmasqueraded to look like an email containing a link to an unpaid invoice. The embedded URL in the HTML\nattachment used a redirect service which Proofpoint refers to as Cookie Reloaded, a URL redirect service\nwhich uses Prometheus TDS to filter downloads based on the time zone and cookies of the potential victim.\nThe redirector in turn directed the user to a zipped ISO file, also hosted on OneDrive.\n\n\n-----\n\n_Figure 2: HTML Attachment Containing Link to Cookie Reloaded URL Redirect_\n\nThe ISO file contained files named \"ATTACHME.LNK\" and \"Attachments.dat\". If ran, the shortcut file\n\"ATTACHME.LNK\" executed \"Attachments.dat\" with the correct parameters to run the downloader, Bumblebee.\n\n_Figure 3: Contents of the archive viewed in WinRAR_\n\n_Figure 4: Contents of ISO viewed in WinRAR_\n\n\n-----\n\nProcess tree from the shortcut file:\n\n_cmd.exe /c start /wait \"\" \"C:\\Users\\[removed]\\AppData\\Local\\Temp\\ATTACHME.LNK\"_\n_rundll32.exe \"C:\\Windows\\System32\\rundll32.exe\"_\n_Attachments.dat,IternalJob_\n\n_Figure 5: TA579 attack chain leading to Bumblebee_\n\nProofpoint researchers attributed this campaign with high confidence to the cybercriminal group TA579.\nProofpoint has tracked TA579 since August 2021. This actor frequently delivered BazaLoader and IcedID in\npast campaigns.\n\n### Thread Hijacked, Zipped ISO Attachments Leading to Bumblebee\n\nIn April 2022, Proofpoint observed a thread-hijacking campaign delivering emails that appeared to be replies to\nexisting benign email conversations with malicious zipped ISO attachments. All the attachment names in this\ncampaign used the pattern \"doc_invoice_[number].zip\".\n\n\n-----\n\n_Figure 6: Email sample of a hijacked thread containing a malicious zipped ISO attachment_\n\nThe zipped ISO was password-protected and contained \"DOCUMENT.LNK\" and \"tar.dll\". The password was\nshared in the body of the email. The shortcut file \"DOCUMENT.LNK\", if ran, executed \"tar.dll\" with the correct\nparameters to start the Bumblebee downloader.\n\n_Figure 7: Process Tree from the shortcut file_\n\n_Figure 8: Thread hijacking attack chain leading to Bumblebee_\n\n### Contact Forms \"Stolen Images\" Leading to Bumblebee\n\nIn March 2022, Proofpoint observed a campaign delivering emails generated by submitting a message to a\ncontact form on the target's website. Additionally, depending on how the website's \"contact us\" section was\nconfigured, the submission also left public comments regarding this topic on the target's site. The emails\npurported to be claims that stolen images existed on the website.\n\n\n-----\n\n_Figure 9: Email sample containing a link to a landing page_\n\nThe \"complaint\" contained a link to a landing page which directed the user to the download of an ISO file\ncontaining \"DOCUMENT_STOLENIMAGES.LNK\" and \"neqw.dll\").\n\n_Figure 10: Example Landing page_\n\nThe shortcut file, if ran, executed \"neqw.dll\" with the correct parameters to start the Bumblebee downloader.\n\n\n-----\n\n_Figure 11: \"Contact Form\" attack chain leading to Bumblebee_\n\nProofpoint attributed this campaign to TA578, a threat actor that Proofpoint researchers have been tracking\nsince May of 2020. TA578 has previously been observed in email-based campaigns delivering Ursnif, IcedID,\nKPOT Stealer, Buer Loader, BazaLoader, and Cobalt Strike.\n\n## Relationship to Other Malware\n\nThe use of Bumblebee by multiple threat actors, the timing of its introduction in the landscape, and behaviors\ndescribed in this report can be considered a notable shift in the cybercriminal threat landscape. Additionally,\nProofpoint assesses with moderate confidence the actors using Bumblebee may be considered initial access\nfacilitators, that is, independent cybercriminal groups that infiltrate major targets and then sell access to followon ransomware actors.\n\nAt least three tracked threat actors that typically distribute BazaLoader malware have transitioned to\nBumblebee payloads, with BazaLoader last appearing in Proofpoint data in February 2022.\n\nBazaLoader is a first stage downloader first identified in 2020 that has been associated with follow-on\n[ransomware campaigns including Conti. Proofpoint researchers initially observed BazaLoader being distributed](https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/)\nin high volume by a threat actor that was primarily known to distribute the Trick banking trojan.\n\n_Figure 12: Timeline of select campaigns from BazaLoader and Bumblebee_\n\nBazaLoader's apparent disappearance from the cybercrime threat landscape coincides with the timing of Conti\nLeaks, when, at the end of February 2022, a Ukrainian researcher with access to Conti's internal operations\n[began leaking data from the cybercriminal organization. Infrastructure associated with BazaLoader was](https://therecord.media/conti-leaks-the-panama-papers-of-ransomware/)\nidentified in the leaked files.\n\n\n-----\n\nProofpoint assesses with high confidence based on malware artifacts all the tracked threat actors using\nBumblebee are receiving it from the same source.\n\n## Malware Analysis\n\nBumblebee is a downloader written in C++. The initial Bumblebee DLL sample analyzed contains two exports.\nOne directly starts the thread for the Bumblebee main function. The other eventually leads to the same main\nfunction, but adds checks to see if hooks have been placed within key dynamic link libraries (DLLs). The LNK\nloading this DLL skips the default DllMain function and instead calls the export that checks for function hooks.\n\n_Figure 13: Screenshot of Bumblebee hook check_\n\nThe majority of the Bumblebee loader is condensed into a single function unlike most malware where\ninitialization, request sending, and response handling are broken out into different functions. The loader starts\nwith copying over the group ID which is effectively used as botnet identifier. Unlike most other malware,\nBumblebee currently has its configuration stored in plaintext, but Proofpoint suspects that obfuscation may be\nadded in the future. With the group ID copied, the loader resolves addresses for various NTDLL functions that\nallow it to properly perform injection later in the loading process.\n\n\n-----\n\n_Figure 14: Group ID copied and set_\n\nOnce the functions are resolved a unique event is created that serves as a mutex to ensure only a single\ninstance of the loader is running.\n\n_Figure 15: Event creation_\n\nAt this point, a single instance of Bumblebee is confirmed to be running, and the malware begins gathering\nsystem information. The following WMI queries are executed via a COM object to gather details needed for\ncommunication:\n\n_SELECT * FROM Win32_ComputerSystem_\n_SELECT * FROM Win32_ComputerSystemProduct_\n\nThe hostname and UUID of the system are gathered and concatenated based on the query output. An MD5\nhash of this value is then generated and turned into a hex digest. The result becomes the unique client ID of\nthe bot.\n\n\n-----\n\n_Figure 16: Client ID creation_\n\nAfter the client ID has been generated, the loader creates the system version string which includes the caption\nof a WMI query, the host's username, and the domain of the host if applicable.\n\nWith all this information gathered, the loader can start communication with the C2. The loader checks into the\nC2 every 25 seconds to retrieve commands. Unlike most malware that has a set of modules or payloads that\nare immediately returned to the bot, it appears the actors behind this malware manually deploy payloads to\nBumblebee as it can take multiple hours before it receives any jobs to execute. Each server response contains\na variation of the data shown in the figure below. If valid tasks are returned, the \"tasks\" value will be a list of\ndictionaries that contain all the task information.\n\n\n-----\n\n_Figure 17: Bumblebee response_\n\nBumblebee loader supports the following commands:\n\nShi: shellcode injection\nDij: DLL injection\nDex: Download executable\nSdl: uninstall loader\nIns: enable persistence on the bot\n\n### Ins Command\n\nThe Ins command enables persistence by copying the Bumblebee DLL to a subdirectory of %APPDATA%\nfolder and creating a Visual Basic Script that will load the DLL. A scheduled task is created that invokes the\nVisual Basic Script via wscript.exe.\n\n_Figure 18: VBS script loading the DLL_\n\n_Figure 19: Scheduled task created with the VBS file_\n\n### Dex Command\n\nThe Dex command is the most rudimentary of the supported commands. It takes the base64 decoded content\nfrom the server response, writes it to disk at a hardcoded path and executes it via a COM object\n\n\n-----\n\n_Figure 20: Dex command output_\n\n### Dij Command\n\nThe Dij command adds the ability to inject DLLs into the memory of other processes. For injection targets, the\nmalware picks one of three hardcoded options to inject the DLL into (ImagingDevices.exe, wab.exe, or\nwabmig.exe).\n\n_Figure 21: Identifying executable files as injection targets_\n\nWith a random executable picked, the loader starts the process in a suspended state (also via a COM object).\nThis allows the malware to easily manipulate the process without causing issues. Next, it prepares the process\nfor injection by enabling debug privileges so it can inject the shellcode necessary for execution.\n\n\n-----\n\n_Figure 22: New process creation and enabling debug privileges_\n\nWith proper permissions set, data can be manipulated, and the loader writes shellcode to the suspended\nprocess, overriding the initial entry point with a new one. This implementation writes 32 bytes of shellcode and\nreplaces a placeholder of with the resolved address of SleepEx.\n\n_Figure 23: SleepEx replacing the placeholder value_\n\n\n-----\n\n_Figure 24: Disassembled shellcode_\n\nThe \"call RAX\" instruction in the shellcode assembly shown in above figure gets replaced with the address of\nthe SleepEx as seen in the previous figure and the shellcode calls SleepEx with a value of 1000 milliseconds.\nWith the shellcode now injected into the process, the process can be resumed and the loader can inject the\nmalicious payload into the executable via an APC routine.\n\n_Figure 25: Process injection via APC_\n\nTo properly inject, the loader creates two new sections within the injection target and copies the buffer from dij\ninto the new section then invokes the copied contents in the target executable via a dynamically resolved\n_NtQueueApcThread._\n\n_Figure 26: Creation of two new sections_\n\n\n-----\n\n_Figure 27: Calling the dynamically resolved NtQueueApcThread_\n\n### Malware Development\n\nProofpoint researchers noticed that within a month of campaigns, Bumblebee developers added new features\nto the malware. Specifically, the inclusion of anti-VM and anti-sandbox checks. Below is the earlier sample:\n\n_Figure 28: Old Bumblebee sample_\n\nAnd the more recent sample:\n\n_Figure 29: Updated Bumblebee sample with addition of check bad artifacts_\n\n\n-----\n\nResearching the new functionality revealed a neat surprise:\n\n_Figure 30: Decompilation of the malware's firmware check_\n\n_Figure 31: Open source code from Al Khaser showing the exact same check_\n\n\n-----\n\n[The above figures are part of the Al Khaser suite which is a common tool used to check for VM artifacts. It](https://github.com/LordNoteworthy/al-khaser/blob/06d4a89e9ecc3e49e4d2df67fe0b2d6faf04166e/al-khaser/Shared/Utils.cpp#L950)\nappears that the developers of the Bumblebee loader rely on open-source tooling, just like standard\ndevelopers.\n\n## Significant Update\n\nProofpoint noted significant changes to Bumblebee functionality in the latest version of Bumblebee observed\non April 19, 2022. Support for multiple C2s via a comma delimited list is now supported.\n\n_Figure 32: Multiple embedded C2s_\n\nThe sleep interval in the older versions was previously hardcoded at 25 seconds but now that has been\nreplaced with a randomized value.\n\n_Figure 33: Addition of random sleep values_\n\nThe most significant change to the malware has been the addition of an encryption layer to the network\ncommunications. The developers added RC4 via a hardcoded key to the sample which is used to encrypt the\nrequests and decrypt the responses.\n\n_Figure 34: encryption of the request_\n\n\n-----\n\n_Figure 35: decryption of the response_\n\nAs another marker of this group demonstrating their fast development velocity, on April 22 Proofpoint observed\nthis group adding a new thread to Bumblebee that checks current running processes against a hardcoded list\nof common tools used by malware analysts. This thread gets created at the beginning of the Bumblebee\nprocess.\n\n_Figure 36: The Bumblebee main function showing the start of the new thread._\n\n\n-----\n\n_Figure 37: The list of tools Bumblebee checks for._\n\nIf any of these processes are found, the function returns 1 which triggers the main Bumblebee thread to be\nterminated.\n\n## Conclusion\n\nBumblebee is a sophisticated malware loader that demonstrates evidence of ongoing development. It is used\nby multiple cybercrime threat actors. Proofpoint assesses with high confidence Bumblebee loader can be used\nas an initial access facilitator to deliver follow-on payloads such as ransomware. Based on the timing of its\nappearance in the threat landscape and use by multiple cybercriminal groups, it is likely Bumblebee is, if not a\ndirect replacement for BazaLoader, then a new, multifunctional tool used by actors that historically favored\nother malware.\n\n## Indicators of Compromise\n\n**Indicator** **Type** **Description**\n\n\n-----\n\nc6ef53740f2011825dd531fc65d6eba92f87d0ed1b30207a9694c0218c10d6e0 SHA256 31 March–1\nApril 2022\nISO Sample\n\na72538ba00dc95190d6919756ffce74f0b3cf60db387c6c9281a0dc892ded802 SHA256 31 March–1\nApril 2022\nBumblebee\nSample\n\n77f6cdf03ba70367c93ac194604175e2bd1239a29bc66da50b5754b7adbe8ae4 SHA256 5 April 2022\nISO Sample\n\n0faa970001791cb0013416177cefebb25fbff543859bd81536a3096ee8e79127 SHA256 5 April 2022\nBumblebee\nSample\n\nFe7a64dad14fe240aa026e57615fc3a22a7f5ba1dd55d675b1d2072f6262a1 SHA256 28 March–1\nApril 2022\nISO Sample\n\n08CD6983F183EF65EABD073C01F137A913282504E2502AC34A1BE3E599AC386B SHA256 10 March\nunpacked\nBumblebee\nsample\n\n**ET Signatures**\n\nET MALWARE Win32/BumbleBee Loader Activity\n\nET USER_AGENTS Observed Bumblebee Loader User-Agent (bumblebee)\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-28 - This isn't Optimus Prime's Bumblebee but it's Still Transforming.pdf"
    ],
    "report_names": [
        "2022-04-28 - This isn't Optimus Prime's Bumblebee but it's Still Transforming.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "62585174-b1f8-47b1-9165-19b594160b01",
            "created_at": "2023-01-06T13:46:39.369991Z",
            "updated_at": "2025-03-27T02:00:03.065156Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [],
            "source_name": "MISPGALAXY:TA578",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "52eb5fb6-706b-49c0-9ba5-43bea03940d0",
            "created_at": "2024-11-01T02:00:52.694476Z",
            "updated_at": "2025-03-27T02:00:55.51014Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [
                "TA578"
            ],
            "source_name": "MITRE:TA578",
            "tools": [
                "Latrodectus",
                "IcedID"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1f87ac52-682a-4bc7-b7ce-fac8d79815fa",
            "created_at": "2023-01-06T13:46:39.373008Z",
            "updated_at": "2025-03-27T02:00:03.066186Z",
            "deleted_at": null,
            "main_name": "TA579",
            "aliases": [],
            "source_name": "MISPGALAXY:TA579",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536260,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653753430,
    "ts_modification_date": 1653753430,
    "files": {
        "pdf": "https://archive.orkl.eu/bbf8e76603fa358c4c0c42e821fbfddbc5763679.pdf",
        "text": "https://archive.orkl.eu/bbf8e76603fa358c4c0c42e821fbfddbc5763679.txt",
        "img": "https://archive.orkl.eu/bbf8e76603fa358c4c0c42e821fbfddbc5763679.jpg"
    }
}