{
    "id": "4ffa67bd-3981-4695-95d5-7488aa9dc7e8",
    "created_at": "2023-07-22T02:06:46.800805Z",
    "updated_at": "2025-03-27T02:17:23.717463Z",
    "deleted_at": null,
    "sha1_hash": "7b83ffb4aa3d64ae5afc9c95ed8f3f9979dc27f4",
    "title": "VB2021 paper: Operation Bookcodes – targeting South Korea",
    "authors": "",
    "file_creation_date": "2021-08-19T12:13:48Z",
    "file_modification_date": "2021-08-19T12:16:41Z",
    "file_size": 8510663,
    "plain_text": "#### kimdw777@kisa.or.kr kimbyeongjae@kisa.or.kr\n\n\n**7 - 8 October, 2021 / vblocalhost.com**\n\n\n-----\n\n**ABSTRACT**\n\nThe Korea Internet & Security Agency (KISA) carried out a detailed analysis of various security incidents believed to be\nthe attacks of Lazarus Group. As we analysed security incidents that attacked a Korean company, we identified the\nsignature string ‘Bookcodes’ in the communication between the command server and the malicious codes. After monitoring\nthe communication process with C2 using this signature string, we found that dozens of companies and individuals were\nchain infected and communicated schematically. Based on this finding, the group of attacks that the Lazarus Group has\ncarried out against South Korea since 2019 was named ‘Bookcodes’.\n\nMost of the C2 farms used in the Operation Bookcodes attacks used domains that hacked South Korean companies. We\nmonitored the attacker’s C2 and confirmed that dozens of companies had been infected, so we informed those companies of\nthe infection and provided support to help them develop defence strategies. In this presentation, we will share when\nOperation Bookcodes began, how the incident investigation was carried out, and what artifacts were found. Also, based on\nthe analysis results, we will describe the attacker’s tactics, techniques and procedures (TTPs), and thus share the\npenetration method of the Operation Bookcodes attacks, information collection method, and internal propagation method.\n\nIn advance of an attack, the attacker takes control of a hosting server that operates a large number of websites to use it as a\nstronghold to carry out the attack. In general, it targets bulletin boards on vulnerable websites, uploads web shells, and\ntakes control by exploiting the host server’s local privilege escalation. It attempts an initial penetration attack on a target\ncompany from the hosting server under its control in two ways:\n\n1. Attaching documents in Korean or sending a spear-phishing email attached with a malicious link.\n\n2. Using a watering hole to induce access by inserting a code vulnerability into the stronghold it took control of in\nadvance.\n\nOnce it has successfully penetrated, it identifies the internal network structure while collecting system information to\ndetermine whether or not to carry out further malicious behaviours. It also connects the remote attackers’ drive to the\ninfection system, making it faster and easier to install additional malicious codes and collect the results of each command.\n\nAdditionally installed malicious codes perform activities such as service registration and start up program registration to\nsecure continuity, and they use legitimate programs to avoid detection by anti-virus software, if necessary. The attacker also\naccesses shared networks for internal spread, and if a network separation policy is in effect, it identifies and attacks\nvulnerabilities by verifying contact points, such as network-linked solutions and DRM solutions.\n\nDuring the analysis, we further examined the commands (packets) and command structures used by the real attacker, and\nwe learned how they operate organically in the C2 farm, an infrastructure built by the attacker; how the Bookcodes attacks\nare carried out; and how to respond and reprocess them.\n\n**1. INTRODUCTION**\n\nThe rise in hacking incidents have led to ever-more stringent security requirements and the continuous evolution of security\nsystems to the next level. Yet, cyber incidents that were reported in the past are still being repeated today, and organizations\nwith some of the most sophisticated cyber-defence systems are still falling victim to such attacks.\n\n_Figure 1: The Pyramid of Pain, David J Bianco._\n\n\n-----\n\nThe influential concept of ‘The Pyramid of Pain’ (see Figure 1) in the sphere of cybersecurity illustrates that the most\neffective security systems depend on understanding the ‘tactics, techniques and procedures’ (TTPs) of the attackers. The\nultimate goal of cybersecurity is to make attacks more costly and more painful for perpetrators – in other words, elevated to\nthe ‘tough’ level shown at the top of the pyramid.\n\nA cybersecurity system based on ‘indicators of compromise’ (IoCs) still remains very efficient. (IoCs would refer to\none-dimensioned indicators such as malicious IPs or domains.) However, it is also true that attackers can easily secure then\ndiscard attack infrastructures using such simple indicators. TTPs are different. The attacker cannot easily obtain or discard\nTTPs. An attacker who h as locked on a target needs to invest in learning and practising TTPs to neutralize the target’s\nsecurity system. When moving on to the next attack, the attacker will tend to select targets on which the same TTPs can be\napplied.\n\nBy nature, the attacker’s TTPs are heavily influenced by the characteristics of the targeted defence environment. As such,\nsecurity practitioners must have an accurate understanding of their own defence environment. They must also approach the\nprocess and flow of attack from the strategic and tactical levels rather than as patterns or methods. In short, the defender’s\nsecurity environment and the attacker’s TTPs must be scrutinized together.\n\nA defender who understands the attacker’s TTPs should be able to answer two things:\n\n1. Would the attacker’s TTPs be able to penetrate the defender’s environment?\n\n2. If so, what defensive strategy can defeat the TTPs?\n\nThe Korea Internet & Security Agency (KISA) identifies cyber attack TTPs through its incident response process and\ndisseminates the process and countermeasures using the ATT&CK framework. The various artifacts related to TTPs\nincluded in this report are merely tools to promote understanding.\n\n**2. OVERVIEW**\n\nThe Korea Internet & Security Agency (KrCert/CC) conducted a detailed analysis of security incidents believed to be\nconducted by a nation-based threat group.\n\nAs we analysed security incidents that attacked a Korean company, we identified the signature string ‘Bookcodes’ in the\ncommunication between the command server and the malicious codes. After monitoring the communication process with\nthe C2 using this signature string, we found dozens of companies and individuals were chain infected and communicated\nschematically. Based on this finding, the group of attacks that the nation-based threat group has carried out against South\nKorea since 2019 was named ‘Bookcodes’.\n\nMost of the C2 farms used in the Operation Bookcodes attacks used domains that hacked South Korean companies. We\nmonitored the attacker’s C2 and confirmed that dozens of companies had been infected, so we informed those companies of\nthe infection and provided support to help them develop defence strategies. In this presentation, we will share when\nOperation Bookcodes began, how the incident investigation was carried out, and what artifacts were found. Also, based on\nthe analysis results, we will describe the attacker’s tactics, techniques, and procedures (TTPs), and thus share the\npenetration method of the Operation Bookcodes attacks, information collection method, and internal propagation method.\n\n_Figure 2: Two types of attacks using spear phishing._\n\n\n-----\n\n_Figure 3: Overall attack process._\n\n**Attack preparation**\n\nFirst, attackers take control of a hosting server that operates multiple websites to use as a base. They upload web shells\nthrough vulnerable websites like those described in the TTPs#1 report [1] and attempt to escalate privileges by attacking\nvulnerabilities in the host system. An attacker who succeeds in obtaining administrator privileges for the system can\nexecute all actions such as web source code tampering, database access, and more.\n\n**Send spear-phishing emails to attack target**\n\nOnce they’ve gained a foothold, attackers will select their targets. They collect publicly disclosed email addresses and write\nemails with content related to the victim’s work responsibilities. Attackers then sends authentic-looking emails to induce\nthe recipients to open attachments containing malware or to access compromised websites. Thus, employees in charge of\npersonnel and sales who have more contact with people outside the company are more exposed to attacks than, for\nexample, IT professionals.\n\n**Initial access**\n\nAn attacker uses two methods when infecting an attack target. The first method is to attach malicious Hangul word\nprocessor files, and the second is to insert vulnerability codes into the bases secured during the preparation of the attack\nand induce access.\n\n**System information collection**\n\nUpon successful initial access, attackers collect basic system information such as network information, host name, etc.\nThey then identify the secured privileges and internal network structure and decide whether to perpetrate further malicious\naction. Attackers can also connect their drive remotely to an infected system to install additional malware and collect\ncommand results more easily.\n\n**Privilege escalation**\n\nAn attacker has limited privileges upon initial access and requires administrator privileges to perform more operations.\nTherefore, they use malware or tools that cause vulnerabilities to elevate privileges.\n\n**Securing persistence**\n\nEven if the initial access is successful, the malware may be terminated due to a reboot of the infected device or an\nunexpected process crash, resulting in the loss of the intrusion path. To prevent this, an attacker registers the service, sets up\nthe startup program, registers the task scheduler, and inserts the web shell so that the malware can be executed again.\n\n**Internal information collection**\n\nAn attacker will collect confidential internal documents, entire network structure, and account credentials of infected\ndevices through malware. Attackers also use legitimate programs to collect information efficiently and easily and avoid\ndetection by anti-virus software.\n\n**Lateral movement**\n\nAttackers attempt to connect to the shared network using the previously collected account information. Subsequently, the\nprocess from ‘system information collection’ to ‘internal information collection’ is repeated to reach the main system\ncontaining critical information. If there is a network separation policy in place, the attacker may find a system (network\nlinkage solution, DRM solution, etc.) that connects the external and internal environment, and attempt an attack by\nidentifying vulnerabilities in the system.\n\n\n-----\n\n**Trace removal**\n\nMalware and tools used in the attack are immediately deleted to remove traces. At this time, malware installed to secure\npersistence is excluded.\n\n**3. ATT&CK MATRIX**\n\n_Figure 4: MITRE ATT&CK Matrix._\n\n**A. Initial access**\n\n**_A.1 Spear-phishing attachment: attach malware to email_**\n\nThe attacker infiltrated the target companies using spear-phishing emails with malicious Hangul word processor documents\n(.hwp files) attached. The attacker attached files related to an actual seminar to make the emails appear legitimate. When\nthe attachment is opened, a remote-controlled malware is installed and communicates with the command-and-control server\n(C&C).\n\n_Figure 5: Spear-phishing email with malicious Hangul document attached._\n\n\n-----\n\n**_A.2 Spear-phishing link: insert a link to a malicious site_**\n\nIn this case the attacker uses spear-phishing emails that contain a link in the email to induce access to malicious sites.\nAccess to malicious sites can lead to malware infection due to browser vulnerabilities. An attacker prompts access to\n_Internet Explorer, a browser that is no longer supported._\n\n_Figure 6: Spear-phishing emails containing a link to induce access to a malicious site._\n\n**_A.3 Drive-by compromise: malware infection when accessing a website_**\n\nWhen accessing a malicious site by clicking on a link, a script inserted by the attacker redirects the victim to a site that\ndistributes malware, and the victim is infected. Because this works only when connected in a certain IP band, malware is\ndistributed only to certain targets.\n\n_Figure 7: Drive-by compromise._\n\n**_A.4 Exploiting a public-facing application_**\n\nIt was found that most servers that were abused as malware command-and-control sites were infiltrated through SQL\ninjection vulnerabilities or file upload vulnerabilities.\n\nAfter obtaining website administrator privileges through SQL injection, the attacker uploaded the web shell as a file upload\nvulnerability to secure access to the server. During file upload attacks, the .cer extension, which could run scripts on IIS,\nwas the most commonly used. Figure 8 shows an actual post by an attacker who uploaded a web shell by exploiting a file\nupload vulnerability.\n\n\n-----\n\n_Figure 8: Post by an attacker who uploaded a web shell by exploiting a file upload vulnerability._\n\n**B. Execution**\n\n**_B.1 User execution_**\n\nIt is not easy to infiltrate a company that has a high level of security. For this reason, attackers use spear-phishing emails to\nlead employees to watering hole sites or to directly execute malware. Attackers mainly send phishing emails to the sales\nteam or customer management team members whose email addresses are publicly disclosed on the company website.\n\n_Figure 9: Attackers mainly send phishing emails to employees whose email addresses are publicly disclosed._\n\n\n-----\n\n**_B.2 Execution through API_**\n\nRemote control malware executes additional processes by calling the CreateProcessAsUserW and CreateProcessW\nfunctions after receiving commands from the C&C.\n\n_Figure 10: Additional processes are executed by calling the CreateProcessAsUserW and CreateProcessW functions._\n\n**_B.3 Execution through module load: load and execute DLL_**\n\nAdditionally, installed malware is registered as a DLL file and executed.\n\n_Figure 11: The malware is registered as a DLL file and executed._\n\n**_B.4 Service execution_**\n\nAdditionally, installed malware is registered as a service and executed.\n\n_Figure 12: The malware is registered as a service and executed._\n\n**_B.5 Windows Management Instrumentation_**\n\nThe attacker uses Windows Management Instrumentation (WMI) to collect a list of anti-virus software currently installed\non the system.\n\n\n-----\n\n_Figure 13: Use of Windows Management Instrumentation to collect a list of anti-virus software installed on the system._\n\n**_B.6 Command-line interface_**\n\nThe attacker executes commands to the infected server mainly through remote-controlled malware. Below are the\ncommands that we saw being used, obtained through server analysis.\n\n**Function** **Command**\n\nSearch for system account information query user\nquery session\nnet user administrator\nwhoami\n\nSearch for system information hostname\nsysteminfo\ntime /t\nver\n\nNetwork sharing net use\nnet view\n\nCheck network information ipconfig /all\narp –a\nnetstat –ano | find “ESTA”\nnetstat –ano | find “LIST”\nping –a –n [IP]\n\nCheck service information sc queryex [Service Name]\nsc query [Service Name]\n\nCheck process information tasklist /svc\n\nTrace removal del [File Name]\nrmdir [Directory Name]\n\nCheck IIS domain list C:\\Windows\\System32\\inetsrv\\\nappcmd.exe list site\n\nCheck file and directory information dir [File or Directory Name]\ndir /a /s [File or Directory Name]\n\n_Table 1: Commands._\n\n**C. Persistence**\n\n**_C.1 Redundant access_**\n\n**_C.2 Web shell_**\n\nWeb shells are inserted to secure redundant access to web servers that are being abused as C&Cs. The web shells used\nprimarily by attackers are ‘Redhat web’ shells, ‘WSO’ web shells, ‘Venus’ web shells and ‘Code Hunters’ web shells. The\npassword used to log in to the ‘Redhat’ web shell was ‘1234qwer’ and ‘venus’ for the ‘Venus’ web shell.\n\n|Function|Command|\n|---|---|\n|Search for system account information|query user query session net user administrator whoami|\n|Search for system information|hostname systeminfo time /t ver|\n|Network sharing|net use net view|\n|Check network information|ipconfig /all arp –a netstat –ano | find “ESTA” netstat –ano | find “LIST” ping –a –n [IP]|\n|Check service information|sc queryex [Service Name] sc query [Service Name]|\n|Check process information|tasklist /svc|\n|Trace removal|del [File Name] rmdir [Directory Name]|\n|Check IIS domain list|C:\\Windows\\System32\\inetsrv\\ appcmd.exe list site|\n|Check file and directory information|dir [File or Directory Name] dir /a /s [File or Directory Name]|\n\n\n-----\n\n_Figure 14: Web shells inserted to secure redundant access to web servers that are being abused as C&C._\n\n**_C.3 New service_**\n\nIf a piece of malware is registered as a service, the malware automatically executes upon reboot.\n\n_Figure 15: Malware registered as a service._\n\n**_C.4 Registry run keys / start folder_**\n\nWhen a malware is created in the startup program path, the malware automatically executes at each reboot\n\n**Command to check malware registered as a startup program**\n\ncmd.exe /c dir \"C:\\Users\\[User Name]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\n\n\\Programs\\Startup\\javaw.exe\"\n\n\n-----\n\n**D. Privilege escalation**\n\n**_D.1 Exploitation for privilege escalation_**\n\nThe attacker attempts to escalate the privileges by executing a file created with a tool using CVE-2014-4113, which is a\n_Windows privilege elevation vulnerability. The attacker remotely connects and copies malware to the infected system local_\ndrive. Based on the folder names classified on the attacker’s\n\n**Attacker’s remote drive path Infected system’s local drive path**\n\nZ:\\Tools\\2003_elevator\\CVE-2014-4113.exe E:\\...\\board_9_files\\image.tmp\n\n**_D.2 Bypass User Account Control_**\n\nThe attacker attempts a User Access Control (UAC) bypass using an open tool called UACME.\n\n**Attacker’s remote drive path Infected system’s local drive path**\n\nZ:\\Tools\\UACME\\LoaderW_x86.exe C:\\Users\\...\\AppData\\Local\\dwm.exe\n\nZ:\\Tools\\UACME\\Akagi32_Enc-11-18.dll C:\\Users\\...\\AppData\\Local\\ntuser.dat\n\n**_D.3 New service_**\n\nThe malware has SYSTEM privileges when executed using the service.\n\n_Figure 16: The malware has SYSTEM privileges when executed using the service._\n\n**E. Defence evasion**\n\n**_E.1 Masquerading_**\n\nThe attacker disguises the malware as system default files, Java programs, Windows update files, Windows default\nprograms, Sticky Notes, etc. to avoid being detected.\n\n**Type** **Malware name**\n\nC:\\Windows\\SysNative\\perfcon.dat\nC:\\Windows\\System32\\perfcon.dat\nC:\\Windows\\SysNative\\perf91nc.inf\n\nMasquerading as system files\n\nC:\\Windows\\System32\\perf91nc.inf\nC:\\Windows\\SysNative\\nwsapagentmonsvc.dll\nC:\\Windows\\System32\\nwsapagentmonsvc.dll\n\nC:\\Users\\[User Name]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\nMasquerading as Java files\n\\Programs\\Startup\\javaw.exe\n\nMasquerading as Windows update files C:\\Windows\\SoftwareDistribution\\Download\\BIT[숫자4~5개].tmp\n\nMasquerading as Themida packing program Z:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-64.exe\n\nMasquerading as Sticky Notes program Z:\\Tools\\aDllMeloadTool1.0\\dllmenloadtool64.exe\n\n_Table 2: Malware masquerading as legitimate files._\n\n|Attacker’s remote drive path Infected system’s local drive path|Col2|\n|---|---|\n|Z:\\Tools\\2003_elevator\\CVE-2014-4113.exe|E:\\...\\board_9_files\\image.tmp|\n\n|Attacker’s remote drive path Infected system’s local drive path|Col2|\n|---|---|\n|Z:\\Tools\\UACME\\LoaderW_x86.exe|C:\\Users\\...\\AppData\\Local\\dwm.exe|\n|Z:\\Tools\\UACME\\Akagi32_Enc-11-18.dll|C:\\Users\\...\\AppData\\Local\\ntuser.dat|\n\n|Type|Malware name|\n|---|---|\n|Masquerading as system files|C:\\Windows\\SysNative\\perfcon.dat C:\\Windows\\System32\\perfcon.dat C:\\Windows\\SysNative\\perf91nc.inf C:\\Windows\\System32\\perf91nc.inf C:\\Windows\\SysNative\\nwsapagentmonsvc.dll C:\\Windows\\System32\\nwsapagentmonsvc.dll|\n|Masquerading as Java files|C:\\Users\\[User Name]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu \\Programs\\Startup\\javaw.exe|\n|Masquerading as Windows update files|C:\\Windows\\SoftwareDistribution\\Download\\BIT[숫자4~5개].tmp|\n|Masquerading as Themida packing program|Z:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-64.exe|\n|Masquerading as Sticky Notes program|Z:\\Tools\\aDllMeloadTool1.0\\dllmenloadtool64.exe|\n\n\n-----\n\n_Figure 17: Malware masquerading as Sticky Notes program._\n\n**_E.2 Indicator removal on host_**\n\n_Windows stacks data called Prefetch to run applications effectively and quickly. This data records the application’s_\nexecution history, which the attacker attempts to delete in order to interrupt analysis. The web server identified traces of\ndeleting some of the web logs to hide the attack.\n\n_Figure 18: Traces of deleting of web logs._\n\n**Command for Prefetch removal**\n\ncmd.exe /c \"del C:\\Windows\\Prefetch\\*.pf > \"%s\" 2>&1\" edg173F.tmp\n\n**_E.3 File deletion_**\n\nThe attacker included a self-delete function to prevent duplicate execution of malware, and deletes various log files to clear\ntheir traces.\n\n**Commands for file deletion**\n\ndel C:\\Windows\\Prefetch\\*.pf\n\ndel C:\\Windows\\SoftwareDistribution\\Download\\logs\\*.txt\n\ndel C:\\Windows\\SoftwareDistribution\\Download\\logs\\*.log\n\nrmdir C:\\Windows\\SoftwareDistribution\\Download\\logs\n\ndel C:\\Users\\THOR\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\n\n\\Programs\\Startup\\OfficeC2RUpdate.lnk\n\n**_E.4 Software packing_**\n\nThe attacker uses a commercial packing program called Themida to pack the malware in order to evade anti-virus software\ndetection. It was also used in the filenames of some unpacked malware.\n\n_Figure 19: Themida is used to pack the malware._\n\n\n-----\n\n|Attacker’s remote drive path  Infected system’s local drive path|Col2|\n|---|---|\n|Z:\\Tools\\Installer-10-11\\ New-2020-01-29-Installer\\install-themida-x86.exe|C:\\WINDOWS\\SoftwareDistribution\\Download\\BIT3001. tmp|\n\n\n**_E.5 Redundant access_**\n\nWeb shells were inserted to secure redundant access to web servers that are being abused as C&Cs. The web shells used\nprimarily by attackers are ‘Redhat web’ shells, ‘WSO’ web shells, ‘Venus’ web shells and ‘Code Hunters’ web shells. The\npassword used to log in to the ’Redhat’ web shell was ‘1234qwer’ and ‘venus’ for the ’Venus’ web shell.\n\n_Figure 20: Web shells inserted to secure redundant access to web servers that are being abused as C&Cs._\n\n**_E.6 Process injection: inject code in specific process_**\n\nThe attacker injects malware into the memory of the w3svc process in order to intercept all packets on the server-hosted\nhome page. If the target then accesses a specific home page path, it will be moved to a malware distribution site.\n\n_Figure 21: Malware is injected into the w3svc process._\n\n\n-----\n\n**Command to query w3svc service information**\n\ncmd.exe /c \"sc query w3svc > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"sc queryex w3svc > \"%s\" 2>&1\" edg173F.tmp\n\n**_E.7 Obfuscated files or information_**\n\nRemote control malware exists as encrypted files on the system.\n\n_Figure 22: Encrypted files._\n\n**F. Credential access**\n\n**_F.1 Credentials in files: steal credential information saved in files_**\n\nAfter taking over the infected system, the attacker steals the log-in information exposed in plain text on the DB setup file\nand the server setup file, and accesses the DB to collect account information on the website. After collecting the account\ninformation, the password pattern is identified and used to spread the malware internally.\n\n**Infected system’s local drive path  Attacker’s remote drive path**\n\nZ:\\Object\\Web_HTTP\\Download\\[ComputerName]\nD:\\htdocs\\dbadmin\\db_sql.php\n\n[SYSTEM][C7348219B03D9B0E]\\db_sql.php\n\nZ:\\Object\\Web_HTTP\\Download\\[ComputerName]\nD:\\...\\include\\dbconn.asp\n\n[NETWORK SERVICE][27559E258E485B0A]\\dbconn.asp\n\nZ:\\Object\\Web_HTTP\\Download\\[ComputerName]\n\nD:\\setup\\00new_server_construction\\\n\n[SYSTEM][C7348219B03D9B0E]\\0000 server_\n\n00server_configuration.txt\n\nconfiguration.txtt\n\nZ:\\Object\\Web_HTTP\\Download\\[ComputerName]\nD:\\server\\Tomcat 8.5_Agent00\\conf\\server.xml\n\n[SYSTEM][C7348219B03D9B0E]\\server.xml\n\n**_F.2 Private key: steal a private key and certificate_**\n\nIn the case of a web server, the attacker steals the server’s SSL certificate.\n\n**Infected system’s local drive path    Attacker’s remote drive path**\n\nZ:\\Object\\Web_HTTP\\Download\\[ComputerName]\nD:\\server\\Tomcat 8.5_Agent00\\cert\n\n[SYSTEM][C7348219B03D9B0E]\\cert.zip\n\n**_F.3 LLMNR/NBT-NS poisoning and relay_**\n\nLLMNR and NBT-NS are components that help identify hosts among systems in the same subnet. LLMNR/NBT-NS\npoisoning is a technology that can use this to intercept a user’s name and password (NTLM hash). The attacker uses a tool\ncalled ‘Response’ to manipulate the name services and collect the credentials and hash information on the local network\n\n|Infected system’s local drive path  Attacker’s remote drive path|Col2|\n|---|---|\n|D:\\htdocs\\dbadmin\\db_sql.php|Z:\\Object\\Web_HTTP\\Download\\[ComputerName] [SYSTEM][C7348219B03D9B0E]\\db_sql.php|\n|D:\\...\\include\\dbconn.asp|Z:\\Object\\Web_HTTP\\Download\\[ComputerName] [NETWORK SERVICE][27559E258E485B0A]\\dbconn.asp|\n|D:\\setup\\00new_server_construction\\ 00server_configuration.txt|Z:\\Object\\Web_HTTP\\Download\\[ComputerName] [SYSTEM][C7348219B03D9B0E]\\0000 server_ configuration.txtt|\n|D:\\server\\Tomcat 8.5_Agent00\\conf\\server.xml|Z:\\Object\\Web_HTTP\\Download\\[ComputerName] [SYSTEM][C7348219B03D9B0E]\\server.xml|\n\n|Infected system’s local drive path  Attacker’s remote drive path|Col2|\n|---|---|\n|D:\\server\\Tomcat 8.5_Agent00\\cert|Z:\\Object\\Web_HTTP\\Download\\[ComputerName] [SYSTEM][C7348219B03D9B0E]\\cert.zip|\n\n\n-----\n\n_Figure 23: LLMNR/NBT-NS poisoning._\n\n**Part of the responder session log**\n\n03/17/2020 08:49:10 AM - [Proxy-Auth] Sending NTLM authentication request to [Target IP]\n\n03/17/2020 08:49:10 AM - [Proxy-Auth] NTLMv2 Client : [Target IP]\n\n03/17/2020 08:49:10 AM - [Proxy-Auth] NTLMv2 Username : RTNB088\\[User Name]\n\n03/17/2020 08:49:10 AM - [Proxy-Auth] NTLMv2 Hash : [User Name]::RTNB088:11223344556\n\n**Attacker’s action to delete the response session log**\n\ncmd.exe /c \"del C:\\Windows\\SoftwareDistribution\\Download\\logs\\*.txt\n\ncmd.exe /c \"del C:\\Windows\\SoftwareDistribution\\Download\\logs\\*.log\n\ncmd.exe /c \"rmdir C:\\Windows\\SoftwareDistribution\\Download\\logs\n\n**G. Discovery**\n\n**_G.1 File and directory discovery_**\n\nThe attacker uses the search program ‘Everything’ to make navigating file and folder information easier and more efficient.\n\n**Execution command**\n\nEverything.exe –db [tmp file]\n\nEverything.exe –exit\n\n_Figure 24: Everything._\n\n**_G.2 Browser bookmark discovery: discover browser bookmarks and access history_**\n\nThe attacker used a legitimate program called Browsing History View provided by NirSoft to collect browser bookmarks\nand history information.\n\n\n-----\n\n**Execution command**\n\nBrowsingHistoryView.exe /scomma [LogFile] /sort ~2 /VisitTimeFilterType 1\n\n_Figure 25: The attacker used Browsing History View to collect browser bookmarks and history information._\n\n**_G.3 System time discovery_**\n\nDiscovery the time of the current system.\n\n**Command for gathering time**\n\ntime /t\n\n**_G.4 Security software discovery_**\n\nAttackers use Windows Management Instrumentation (WMI) to discover installed anti-virus software.\n\nName space : root\\SecurityCenter2\n\nQuery : Select * From AntivirusProduct\n\nProperties : displayName\n\n**_G.5 Query registry_**\n\nTo install malware under normal service names, existing services lists and services lists in the netsvcs group are collected.\n\n**Registry Search Path**\n\nHKLM\\SYSTEM\\CurrentControlSet\\Services, [Service Name]\n\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost, netsvcs\n\n**_G.6 Process discovery_**\n\nTo verify that the installed registry and malware are registered properly, the process list is searched.\n\n**Command for discovering service related process**\n\ncmd.exe /c \"tasklist /svc > \"%s\" 2>&1\" edg173F.tmp\n\n**_G.7 System owner/user discovery_**\n\nAccount information is collected for the system currently accessed by the attacker.\n\n**Current user same discovery command**\n\ncmd.exe /c \"whoami > \"%s\" 2>&1\" edg173F.tmp\n\n\n-----\n\n**_G.8 System information discovery_**\n\nInformation on the system currently being accessed by the attacker is collected.\n\n**System information discovery command**\n\ncmd.exe /c \"systeminfo > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"hostname > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"ver > \"%s\" 2>&1\" edg173F.tmp\n\n**_G.9 System network configuration discovery_**\n\nNetwork configuration information for the system currently being accessed by the attacker is collected.\n\n**Network configuration discovery command**\n\ncmd.exe /c \"ipconfig /all > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"arp -a > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"C:\\Windows\\System32\\inetsrv\\appcmd.exe list site > \"%s\" 2>&1\" edg173F.tmp\n\n(Discovery of list of domains being hosted)\n\n**_G.10 Account discovery_**\n\nA complete list of accounts in the system and account information details is collected.\n\n**Account information discovery command**\n\ncmd.exe /c \"net user > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"net user Administrator > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"query user Administrator > \"%s\" 2>&1\" edg173F.tmp\n\n**_G.11 Remote system discovery: discover different systems in the network_**\n\nA list of different systems on the same network is collected.\n\n**Network discovery command**\n\ncmd.exe /c \"net view > \"%s\" 2>&1\" edg173F.tmp\n\n**_G.12 System service discovery_**\n\nDetailed information of the services currently installed in the system is collected.\n\n**Service detailed information discovery command**\n\ncmd.exe /c \"sc query nwsapagent > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"sc query w3svc > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"sc queryex w3svc > \"%s\" 2>&1\" edg173F.tmp\n\ncmd.exe /c \"sc query [Service Name] > \"%s\" 2>&1\" edg173F.tmp\n\n**_G.13 System network connections discovery_**\n\nNetwork connection status and session information of the current system are collected.\n\n\n-----\n\n**H. Lateral movement**\n\n**_H.1 Windows admin shares: default sharing on Windows_**\n\nMoves to other systems on the same network through internal information collected by infected systems\n\n**Attempt to access other systems command**\n\ncmd.exe /c \"net use \\\\[Target IP or Domain] **[Password] /u:[Account] > \"%s\" 2>&1\" edg173F.tmp**\n\n**I. Collection**\n\n**_I.1 Data from local system_**\n\nBelow is a list of information taken from companies the attacker has infiltrated successfully.\n\n**Category** **Information stolen**\n\nDB settings (ID, password, port, DB name)\n\nSystem configuration\n\nSystem information\n\nWeb server settings file\n\nWebsite certificate\n\nOrganizational chart\n\nEmployee contact information\n\nDuties log\n\nReplacement training\n\nOrganization information Outcomes information\n\nPersonnel information\n\nBusiness plans\n\nRecords of arriving/leaving work\n\nClient list\n\nRecent documents list\n\nCovid-19 related documents\n\nRecent issues\n\nFavourites list\n\nOutlook SendTo file list\n\nMalware C2 server discovery list\nSecurity-related information Documents on actions in case of unauthorized insertion\n\nof Iframe\n\nWeb log\n\nBrowser log\n\nLog information\n\nFile search log\n\nResponder attack log\n\n_Table 3: information taken from companies the attacker has infiltrated successfully._\n\n**_I.2 Data from network shared drive_**\n\nThe attacker collects information from an infected system with the attacker’s drive connected as a network drive. The drive\nvolume name is ‘Z’, and folders for companies that were successfully infiltrated are managed separately.\n\n|Category|Information stolen|\n|---|---|\n|System information|DB settings (ID, password, port, DB name) System configuration Web server settings file Website certificate|\n|Organization information|Organizational chart Employee contact information Duties log Replacement training Outcomes information Personnel information Business plans Records of arriving/leaving work Client list|\n|Recent issues|Recent documents list Covid-19 related documents Favourites list Outlook SendTo file list|\n|Security-related information|Malware C2 server discovery list Documents on actions in case of unauthorized insertion of Iframe|\n|Log information|Web log Browser log File search log Responder attack log|\n\n\n-----\n\n**_I.3 Data staged: stage collected data in a file_**\n\nStage the result of executing the malware command to a file.\n\n**Command example**\n\ncmd.exe /c [Command to execute] > edg173F.tmp\n\n**J. Command and control**\n\n**_J.1 Standard cryptographic protocol: remote control malware uses RC4 algorithm to encrypt data_**\n\n**_J.2 Multi-stage channels: attackers use various C2 points to deliver commands to malware_**\n\n**_J.3 Connection proxy: the C2 server of malware acts as a proxy to perform remote control_**\n\n**_J.4 Remote file copy: remote control create and exfiltrates files from C2 through command_**\n\n**_J.5 Custom cryptographic protocol: downloaders encrypt data using custom encryption_**\n**_algorithms_**\n\n**_J.6 Multilayer encryption: downloaders use HTTPS and custom encryption algorithms_**\n\n**_J.7 Data encoding: Base64 and XOR for remote control, and custom encoding for downloaders_**\n\n**_J.8 Data obfuscation: malware obfuscates data in ways such as encoding, encryption, and custom_**\n\n**_J.9 Commonly used port: malware attempts to control commands using HTTP(80) and HTTPS(443)_**\n\n**_J.10 Standard Application Layer Protocol: malware attempts to control using HTTP, HTTPS_**\n\nMalware uses normal protocols and attempt malicious behaviour across various points and stages without\nexposing malicious traffic in ways such as encoding, encryption, and obfuscation\n\n**Refer to Section 4 (Malware Analysis)**\n\n**K. Exfiltration**\n\n**_K.1 Data encryption: remote control encrypts data with RC4 and downloaders encrypt with custom_**\n**_algorithm_**\n\n**_K.2 Data transfer size limits: remote control divides data into 90KB chunks_**\n\n**_K.3 Data compressed: remote control compresses certain files into the INFO-ZIP library and exfiltrates_**\n\n**_K.4 Extensions over command-and-control channel: malware exfiltrates files to C2 channels_**\n\n**_K.5 Extensions over alternative protocol: malware attempts to collect files through network shares_**\n\n\n-----\n\n**L. Impact**\n\n**_L.1 Data destruction: remote control overwrites and deletes certain files through command so that_**\n**_they cannot be recovered_**\n\nThe remote control command deletes the malware used and command execution results in the file being beyond\nrecovery, as a means to interfere with analysis and evade detection.\n\n**Refer to Section 4 (Malware Analysis)**\n\n**4. MALWARE ANALYSIS**\n\nThe types of malware and normal programs that the attacker uses to carry out an attack are as follows. The attacker used the\n‘net use’ to copy and execute files with the attacker drive connected remotely.\n\n**Type** **Role** **File path by file saved on attacker’s remote drive**\n\nHWP file malware Initial intrusion \nSpear phishing Watering hole \nWatering hole\nCheck IP and redirect Z:\\Target Information\\[Victim]\\EK_Modify\\main_head_modify.asp\nwebsite\n\nZ:\\Tools\\Installers\\install_x86_online_0723_01-hyoju.exe\n\nZ:\\Tools\\Installers\\[Victim]\\install.exe\n\nDropper malware Maintain persistence Z:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-x86.exe\n\nZ:\\Tools\\Installers\\x64\\Outcome\\install_HKDB-10-11.exe\n\nZ:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-64.exe\n\nZ:\\Tools\\LPEClient_x64.exe\n\nDownloader Download additional Z:\\Tools\\LPEClient_x86.exe\nmalware malware Z:\\Object\\Web_HTTP\\Download\\[Victim][[Victim]$]\n\n[FB3F7A0EE57CBC2C]\\LPEClient_x86.exe\n\nRemote control Execute command \nTool DLL injector Z:\\Tools\\aDllMeloadTool1.0\\dllmenloadtool64.exe\n\nTool Query check Z:\\Target Information\\[Victim]\\EK-2020-03-\\Edward\\Proxy64.dll\n\nTool Escalate privilege Z:\\Tools\\2003_elevator\\CVE-2014-4113.exe\n\nTool Escalate privilege Z:\\Tools\\UACME\\LoaderW_x86.exe\n\nTool Key logger \nZ:\\Object\\Web_HTTP\\Download\\[Victim][SYSTEM]\nWeb shell Web shell\n\n[840E3A53C168637C]\\726_71112.cer\n\nEverything File search Z:\\Tools-Kaspersky\\Hardindexing\\Everything.exe\n\nZ:\\Tools-Kaspersky\\NTLM_Responder\\Responder.exe\nResponder Collect credentials\n\nZ:\\Tools-Kaspersky\\NTLM_Responder\\Responder.conf\n\nBrowsing Z:\\Tools-Kaspersky\\_Browsinghistory\\browsinghistoryview-x64\\\nBrowser access history\nHistoryView BrowsingHistoryView.exe\n\n_Table 4: Types of malware and normal programs that the attacker uses to carry out an attack._\n\n**4.1. Initial infiltration**\n\n**_A. HWP (Hangul Word Processor) malware_**\n\nWhen a user of a Hangul word processor program which has not been updated since February 2017 opens a HWP file\ncontaining malware, the recipient is immediately infected with malware and can be remotely controlled. To this end,\nattackers evade suspicion by including a message in the email body and planting malware in HWP files disguised as\napplications, additional documents, etc.\n\n|Type|Role|File path by file saved on attacker’s remote drive|\n|---|---|---|\n|HWP file malware|Initial intrusion|-|\n|Spear phishing|Watering hole|-|\n|Watering hole website|Check IP and redirect|Z:\\Target Information\\[Victim]\\EK_Modify\\main_head_modify.asp|\n|Dropper malware|Maintain persistence|Z:\\Tools\\Installers\\install_x86_online_0723_01-hyoju.exe Z:\\Tools\\Installers\\[Victim]\\install.exe Z:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-x86.exe Z:\\Tools\\Installers\\x64\\Outcome\\install_HKDB-10-11.exe Z:\\Tools\\Installer-10-11\\New-2020-01-29-Installer\\install-themida-64.exe|\n|Downloader malware|Download additional malware|Z:\\Tools\\LPEClient_x64.exe Z:\\Tools\\LPEClient_x86.exe Z:\\Object\\Web_HTTP\\Download\\[Victim][[Victim]$] [FB3F7A0EE57CBC2C]\\LPEClient_x86.exe|\n|Remote control|Execute command|-|\n|Tool|DLL injector|Z:\\Tools\\aDllMeloadTool1.0\\dllmenloadtool64.exe|\n|Tool|Query check|Z:\\Target Information\\[Victim]\\EK-2020-03-\\Edward\\Proxy64.dll|\n|Tool|Escalate privilege|Z:\\Tools\\2003_elevator\\CVE-2014-4113.exe|\n|Tool|Escalate privilege|Z:\\Tools\\UACME\\LoaderW_x86.exe|\n|Tool|Key logger|-|\n|Web shell|Web shell|Z:\\Object\\Web_HTTP\\Download\\[Victim][SYSTEM] [840E3A53C168637C]\\726_71112.cer|\n|Everything|File search|Z:\\Tools-Kaspersky\\Hardindexing\\Everything.exe|\n|Responder|Collect credentials|Z:\\Tools-Kaspersky\\NTLM_Responder\\Responder.exe Z:\\Tools-Kaspersky\\NTLM_Responder\\Responder.conf|\n|Browsing HistoryView|Browser access history|Z:\\Tools-Kaspersky\\_Browsinghistory\\browsinghistoryview-x64\\ BrowsingHistoryView.exe|\n\n\n-----\n\nWhen malicious HWP documents are opened, malicious behaviour begins from the exploit codecode at BIN0001.ps in the\nBinData area of the HWP document. The remotely controlled malware is then injected into the ‘explorer.exe’ process and\noperates in memory.\n\n_Figure 26: HWP malware execution process._\n\nBIN0001.ps reads the memory of the hwp.exe process and searches for two specific pieces of data\n(0x8B68B727AEBDD87E and ‘F0und3q9’) within the BIN0002.bmp file. Based on this value, 32-bit and 64-bit remote\ncontrol malware data encrypted with AES128 are then read, decrypted and executed according to each operating system\nenvironment.\n\n_Figure 27: HWP malware detailed process._\n\n**_B. Watering hole_**\n\nThe attacker disguises the body of the email as a request for a quote on a product and sends a spear-phishing email to a\nsales representative. In order to carry out the attack, the attacker encourages the victim to access certain home pages using\n_Internet Explorer, presumably because Internet Explorer is no longer updated, and the attacker is taking advantage of_\nalready disclosed vulnerabilities.\n\n\n-----\n\nIt was confirmed that the final remote control malware was downloaded due to the watering hole attack over four stages.\nThe roles, purpose and URLs for each stage are shown in Table 5.\n\n**Stage** **Type** **Purpose** **Access attempt URL**\n\nDirect to watering\n1 Spear phishing http://www.[Normal site].com\nhole\n\n[Normal site]’s Verify IP and\n2 https://[Normal site2].com/product/sublist3.asp?id=9876\nmodified main page redirect\n\nVerify URL and\n\nMalware installed on https://www.[Attacker‘ server].com:443/uploads/index.\n3 download\n\n[Normal site2] asp?id=9876\n\nadditional malware\n\n4 [Attacker‘s server] Distribute malware \n_Table 5: Roles, purpose and URLs for each stage._\n\nIn the first stage, spear phishing leads to access to the modified main page in stage 2. Subsequent IPs are then redirected to\nthe page in stage 3 only if they are accessed from the target IP band. The malware that injected into the IIS-related service,\nw3svc, to control HTTP packets is running on the server hosting the home page in stage 3. The ‘sublist3.asp’ does not\nactually exist and the malware receives it instead, which is used for protocol, domain, port, page, and parameter\nverification. If verification is successful, additional malware will be downloaded from the server deployed by the attacker.\nIt was confirmed that at the time of the actual attack, the attacker maintained the modified main page in stage 2 for only\nthree hours after sending the email.\n\n_Figure 28: Watering hole process._\n\n|Stage|Type|Purpose|Access attempt URL|\n|---|---|---|---|\n|1|Spear phishing|Direct to watering hole|http://www.[Normal site].com|\n|2|[Normal site]’s modified main page|Verify IP and redirect|https://[Normal site2].com/product/sublist3.asp?id=9876|\n|3|Malware installed on [Normal site2]|Verify URL and download additional malware|https://www.[Attacker‘ server].com:443/uploads/index. asp?id=9876|\n|4|[Attacker‘s server]|Distribute malware|-|\n\n\n-----\n\nThe main page or JavaScript files shown below were modified and a malicious script inserted in the normal sites exploited\nin watering hole attacks. There are three types of malicious scripts obtained through analysis.\n\n**Type** **Modified source code**\n\nWatering hole page type 1 (run\nadditional script)\n\nWatering hole page type 2\n(verify IP and redirect)\n\nWatering hole page type 3\n(redirect)\n\n_Table 6: Page types and modified source code._\n\n**4.2. Maintaining persistence**\n\nThe malicious code used for the initial compromise installs additional malware through a command so that the malware is\nexecuted even when the computer reboots. The additional malware can be executed even after through the startup program,\nregistry, and service registration.\n\n**_A. Dropper_**\n\nDropper malware performs two functions depending on the execution options. Options [–s] and [–g] have two functions:\ncollecting/transmitting the service list and dropping and executing remote-controlled malware. The [–g] option receives two\nparameters and the [–s] option receives five parameters.\n\n_Figure 29: Dropper malware execution options._\n\n**_A.1 [–g] option: gather registry information_**\n\nThe [–g] option gathers a complete list of services from the netsvcs group within the infected system. Then, the malware\nreturns a list of services that are not currently used in the system, and the attacker selects one of these service names and\nuses it as a parameter in the –s option.\n\n|Type|Modified source code|\n|---|---|\n|Watering hole page type 1 (run additional script)||\n|Watering hole page type 2 (verify IP and redirect)||\n|Watering hole page type 3 (redirect)||\n\n\n-----\n\n_Figure 30: Dropper malware [–g] option._\n\nThe [–g] option is executed by the initially installed remote control, the actual command executed by the attacker is shown\nbelow.\n\n_Figure 31: Dropper malware –g option execution command._\n\nThe malware collects a complete list of services existing in the netsvcs group, compares them with the list of services\nregistered in the current system, selects a service name that is not in use and then uses it as the service name of the\nmalware. The list of netsvcs group service names varies by system, and each registry location is as follows.\n\n**Role** **Path**\n\nList of services registered in current system HKLM\\SYSTEM\\CurrentControlSet\\Services, [ServiceName]\n\nList of all services on netsvcs group HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost, netsvcs\n\n_Table 7: Registry locations._\n\n**_A.2 [-s] Option: drop and execute remotely controlled malware_**\n\nDropper malware has three types of resources encrypted with RC4. First, using the RC4 key received as the fifth parameter,\nthe C2 List resource is decrypted and created into a file. Subsequently, the injector resources are decrypted and registered\nas a service using the third and fourth parameters. The remote control resource is saved as a file in an encrypted state,\nwhich is decrypted and injected into the ‘svchost.exe’ process when the injector is run. Finally, remote-controlled malware\nattempts command control by reading the C2 List file.\n\n**Resource ID** **Filename** **Type** **Role**\n\n160 perf91nc.inf C2 List C&C address list and execution-related option\n\n161 [4[th] Parameter].dll Injector Decrypt and load perfcon.dat file\n\n162 perfcon.dat Remote control Reference perf91nc.inf file and connect to C2 server\n\n_Table 8: The three types of resources._\n\n_Figure 32: Dropper malware [–s] option execution command._\n\n|Role|Path|\n|---|---|\n|List of services registered in current system|HKLM\\SYSTEM\\CurrentControlSet\\Services, [ServiceName]|\n|List of all services on netsvcs group|HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost, netsvcs|\n\n|Resource ID|Filename|Type|Role|\n|---|---|---|---|\n|160|perf91nc.inf|C2 List|C&C address list and execution-related option|\n|161|[4th Parameter].dll|Injector|Decrypt and load perfcon.dat file|\n|162|perfcon.dat|Remote control|Reference perf91nc.inf file and connect to C2 server|\n\n\n-----\n\n**_A.3 Resource 160: perf91nc.inf (C2 List)_**\n\nResource 160 is a file that has a C2 server list and set values required for execution. Remote-controlled malware reads this\nfile and attempts to connect. The file size is fixed at 0x2EE0.\n\n**Offset** **Value** **Role**\n\n0x0~0x7 ID Infected device’s ID\n\n0x620~0x1A6F C2 page list Command & control page (max 10)\n\n0x1A70~0x2EBF Process, command or file Default execution process or library (max 10)\n\n0x2EC0 Flag Command or additional file execution Flag\n\n0x2ECC Time (Second) Malware start time or executed time\n\n0x2ED0 Time (Minute) Malware execution cycle\n\n0x2ED4 Time (Minute) Malware start time\n\n0x2ED8 Flag Flag to mark malware start time\n\n_Table 9: Resource 160._\n\n**_A.4 Resource 161 : [4[th] Parameter].dll (injector)_**\n\nThe malware takes the fourth parameter of the file name associated with the service name of the unused netsvcs group\nfound through the [–g] option and uses it as a file name. To disguise itself further, the malware finds ‘svchost.exe’ where\nthe netsvcs service is running and injects data decrypted from the perfcon.dat file.\n\n**Stage** **Description**\n\nLog file path C:\\Windows\\Temp\\services_dll.log\n\nMalicious activity start log Start ...\n\nRemote-controlled malware injection GetReflectiveLoaderOffset : 1:1\n\n_Table 10: Injector malware stages._\n\n_Figure 33: Detailed process of injector malware action._\n\n**_A.5 Resource 162: perfcon.dat (remote-controlled malware)_**\n\nThe remote-controlled malware is described in detail in Section 3.\n\n|Offset|Value|Role|\n|---|---|---|\n|0x0~0x7|ID|Infected device’s ID|\n|0x620~0x1A6F|C2 page list|Command & control page (max 10)|\n|0x1A70~0x2EBF|Process, command or file|Default execution process or library (max 10)|\n|0x2EC0|Flag|Command or additional file execution Flag|\n|0x2ECC|Time (Second)|Malware start time or executed time|\n|0x2ED0|Time (Minute)|Malware execution cycle|\n|0x2ED4|Time (Minute)|Malware start time|\n|0x2ED8|Flag|Flag to mark malware start time|\n\n|Stage|Description|\n|---|---|\n|Log file path|C:\\Windows\\Temp\\services_dll.log|\n|Malicious activity start log|Start ...|\n|Remote-controlled malware injection|GetReflectiveLoaderOffset : 1:1|\n\n\n-----\n\n**_B. Downloader_**\n\nWhen the attacker executes a downloader, the attacker executes it by giving the encrypted download address and the path to\nsave the downloaded file as a parameter. Although KISA did not obtain the malware that ultimately was downloaded, it is\nassumed that it is the same remote-controlled malware as dropped by the dropper malware. An attacker can select or mix\none of the droppers or downloads to maintain persistence.\n\n_Figure 34: Downloader malware execution option._\n\n**_B.1 Data encryption and decryption approach_**\n\nDecrypting an encrypted string given as a second parameter extracts the primary and secondary download sites to be\naccessed by the malware. The attacker then collects information from the infected device and proceeds with encryption in\nthe same way. Encryption keys are generated randomly each time, and S-box borrowed some tables from existing DES\nencryption algorithms. It is estimated that certain algorithms are used through customizing, and overall there is a general\nsymmetric-key algorithm structure.\n\n_Figure 35: Downloader malware encryption approach._\n\n**_B.2 Sending device information and downloading additional malware_**\n\nThe downloader malware first connects to the primary download site and sends information about the infected device\nalong with the address of the secondary download site. Both the first and second download sites consist of specific ASP\npages. The primary download site connects to the secondary download site received from the malware and transmits\ninformation about the infected device. In the secondary download site, the malware checks the target based on the\ninformation of the infected device and sends malware encrypted by the ID and computer name of the infected device. If\n\n\n-----\n\nit succeeds in downloading the final malware normally, the malware executes by giving a string called CloseEnv as a\nparameter.\n\n_Figure 36: Additional malware download process._\n\nEach time data is sent to the primary download site, it is delivered in JSON format, and the structure is as shown in Figure\n37. Encoded secondary download address, randomly generated key, and encrypted data are always sent.\n\n_Figure 37: Structure of sending downloader malware data._\n\nThe encoding methods used by the malware to transmit secondary download sites are as follows. Using a specific table, the\nmalware is exchanged with letters in a random location, and added together to produce a string.\n\n_Figure 38: Example of secondary download site encoding method._\n\nInformation on infected devices collected and leaked by malware is as follows. It collects more information than general\nmalware, such as available memory, product type, etc. The unique ID values given at each stage of malicious behaviour are\nadded first, and the hash values calculated as XOR are added last and then sent.\n\n\n-----\n\n|Type|Data|Col3|Col4|Col5|Col6|Col7|Col8|Col9|\n|---|---|---|---|---|---|---|---|---|\n|ID|ID by malicious activity stage||||Infected device 16-byte random ID||||\n|System information|Computer name||Processor name||||Number of processors||\n||System manufacturer||||System product name||||\n|OS information|Major version|Minor version||Build version||Product type||Is64bit|\n|Memory information|Size of currently installed memory||||Size of total memory including available memory||||\n|Other information|Name of installed anti-virus software||||Normal ntoskrnl.exe file version||||\n|Hash|Data XOR hash||||||||\n\n\n_Table 11: Information on infected devices collected and leaked by the malware._\n\nThe malware uses specific hexadecimal values to distinguish between the malicious activity stage and execution mode. One\nof the characteristics of the malware is that it supports two modes to connect: first it connects through WinHTTP, and in the\nevent of failure it connects through WinINet.\n\n**Value** **Use** **Meaning**\n\nSends infected device information, encryption key, secondary\n0xF07D6B34 Send infected device information\ndownload site\n\n0xEF8C0D51 Request malware\n\n0xCB790A25 Confirm malware reception Sends infected device ID, encryption key, secondary download site\n\n0xD7B20A96 Confirm malware execution\n\nFaster speed than WinINet, simultaneous access function without\n0x59863F09 WinHTTP API mode\nperformance limitation, doesn’t support compression\n\nIncludes more functions and supports compression as a higher-level\n0xA9348B57 WinINet API mode\nAPI than WinHTTP\n\n_Table 12: Hexadecimal values._\n\n**_B.3 Download site_**\n\nBoth the first and second download sites work as ASP pages. Although the first download page was successfully secured,\nthe second download page had already been deleted at the time of analysis so was not available. The first download page\nhas two modes: the mode used by malware is translate; redirect mode has a simple function of redirecting to the URL\nreceived as a query.\n\n**Mode** **Function** **Method** **Requester**\n\nTranslate Leak data and download malware POST Malware\n\nRedirect Page redirect GET N/A\n\n_Table 13: The two modes._\n\nTranslate mode decodes the value received from the malware, obtains the secondary download site address, and attempts to\naccess it. It sends information about the infected device to the secondary download site and returns malware to the\ndownloader malware. On this page, the same table as the one the downloader malware has is used for decoding.\n\n_Figure 39: Primary download site code (partial)._\n\n**4.3 Final remote control**\n\nWe named the final remote control malware used to control the infected system ‘Bookcodes’. This is a string that is mainly\nused to check the status as the malware communicates with the C2 server.\n\n|Value|Use|Meaning|\n|---|---|---|\n|0xF07D6B34|Send infected device information|Sends infected device information, encryption key, secondary download site|\n|0xEF8C0D51|Request malware|Sends infected device ID, encryption key, secondary download site|\n|0xCB790A25|Confirm malware reception||\n|0xD7B20A96|Confirm malware execution||\n|0x59863F09|WinHTTP API mode|Faster speed than WinINet, simultaneous access function without performance limitation, doesn’t support compression|\n|0xA9348B57|WinINet API mode|Includes more functions and supports compression as a higher-level API than WinHTTP|\n\n|Mode|Function|Method|Requester|\n|---|---|---|---|\n|Translate|Leak data and download malware|POST|Malware|\n|Redirect|Page redirect|GET|N/A|\n\n\n-----\n\n**_A. Remote-controlled malware ‘Bookcodes’_**\n\n**_A.1 Types to manage C2 list_**\n\nAlthough the way C2 information is held varies depending on how it is executed, the malware has the same update\nfunction.\n\n**Stage** **Parent** **Initial C2 reference** **Subsequent C2 update method**\n\nMalicious HWP\nInitial infection Save hard-coded C2 to memory\ndocument\nUpdate in memory\nMaintain\nDropper Read perf91nc.inf and save to memory\npersistence\n\n_Table 14: C2 update methods._\n\n**_A.2 Save log_**\n\nUnlike remote-controlled malware installed by droppers, when installed for the first time by HWP documents, logs for each\nstage of malicious behaviour are stored in a specific file to determine whether it has been executed properly.\n\n**Stage** **Description**\n\nLog file path C:\\Windows\\Temp\\server_dll.log\n\nMalware start log Start...\n\nSystem information collection log After GetOwnInfo...\n\n_Table 15: Storage of logs._\n\n**_A.3 String encoding_**\n\nSome strings used in the malware are all XOR encoded. The source and offset value and 0x33 are XORed to extract the\nsource string while repeating the entire length of the string.\n\n_Figure 40: Bookcodes malware string encoding method._\n\n**_A.4 Data encryption_**\n\nRC4 encryption and Base64 encoding is applied to data used in all communications, such as the system information list\ncollected by the malware or the results of commands, and commands received from C2 servers.\n\n_Figure 41: Examples of Bookcodes malware data encryption methods._\n\n**_A.5 Collect and send information on infected devices_**\n\nUpon initial execution, the malware collects information on the infected system and sends it to the C2 server as follows.\nThe attacker receives the information and identifies the infected system environment. The value 0x20001 is believed to be a\nvalue to distinguish between versions of malware.\n\n|Stage|Parent|Initial C2 reference|Subsequent C2 update method|\n|---|---|---|---|\n|Initial infection|Malicious HWP document|Save hard-coded C2 to memory|Update in memory|\n|Maintain persistence|Dropper|Read perf91nc.inf and save to memory||\n\n|Stage|Description|\n|---|---|\n|Log file path|C:\\Windows\\Temp\\server_dll.log|\n|Malware start log|Start...|\n|System information collection log|After GetOwnInfo...|\n\n\n-----\n\n|Type|Data|Col3|Col4|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n|Length|Total data length||||||\n|Identifier|Infected device 8-byte random ID||||||\n|Timer setting|Check timer setting and execution||||||\n|System information|Local IP|Computer name|User name|Country|Processor name|Text set|\n|OS information|OS type||OS version||Service pack version||\n|Memory information|Size of currently installed memory||||||\n|Malware version|0x20001||||||\n\n\n_Table 16: Information collected by the malware and sent to the C2 server._\n\nThe data structure for sending information on infected devices is as follows.\n\n_Figure 42: Data structure for sending information on infected devices._\n\n**_A.6 Receive commands and send results_**\n\nFigure 43 shows the command structure that an attacker sends to gather additional information through malware and to\ninflict additional malware infection.\n\n_Figure 43: Data structure when sending commands._\n\n\n-----\n\n**_A.7 Remote control full commands_**\n\nThe remote control behaviour by the commands used by the malware is as follows.\n\n**Command** **Description** **Command** **Description**\n\n0x97853646 Collect information on connected drive 0x97863654 Terminate behaviour\n\nCollect information on process\n0x97853647 Directory listing 0x97853655\nbeing run\n\n0x97853648 Copy file then upload 0x97853656 Send system information\n\nSend current status (C2 information,\n0x97853649 Delete file 0x97853657\nservice name, etc.)\n\n0x9785364A Secure delete 0x97853658 C2 address update\n\n0x9785364B Download file 0x97853659 Confirm current malware status\n\n0x9785364D Upload file 0x9785365B Create process with user privilege\n\n0x9785364E Temporary file compression and upload 0x9785365C Command fail\n\n0x9785364F Create process 0x9785365D Command success\n\n0x97853651 Change file timestamp 0x97853660 Confirm local system time\n\nAttempt communication with address\n0x97853652 0x97853661 Confirm working directory\nreceived from server\n\n0x97853653 Execute received command 0x97853662 Change working directory\n\n_Table 17: Commands and behaviours._\n\n**_B. C2 server_**\n\nThe C2 server of the Bookcodes remote-controlled malware also operates as an ASP page. The page attempts to\ncommunicate with POST, where transmission data does not remain in the web log, and is located between malware and\nattackers, acting as a proxy.\n\n**_B.1 C2 page function list_**\n\nC2 page functions are largely divided into data transfer and log save. The biggest role is to receive or transmit data to\nattackers, and other functions include saving the ID values of infected devices. In addition, there is the MID that manages\nthese C2 pages, and when a victim accesses the C2 page, the IP of the infected device and the C2 page address is sent to the\nMID.\n\n**Mode** **Function** **Requester by mode**\n\nInformation File update with MID address saved\n\nSavec Send commands to C2 server by each infected device\nAttacker\n\nRead Receive command results by each infected device from C2 server\n\nRestore Collect infected device ID log file\n\nCommunication Save infected device ID and transfer to MID\n\nLoad Receive command from C2 server Malware\n\nSaves Send infection information and command results to C2 server\n\n_Table 18: C2 page functions._\n\n|Command|Description|Command|Description|\n|---|---|---|---|\n|0x97853646|Collect information on connected drive|0x97863654|Terminate behaviour|\n|0x97853647|Directory listing|0x97853655|Collect information on process being run|\n|0x97853648|Copy file then upload|0x97853656|Send system information|\n|0x97853649|Delete file|0x97853657|Send current status (C2 information, service name, etc.)|\n|0x9785364A|Secure delete|0x97853658|C2 address update|\n|0x9785364B|Download file|0x97853659|Confirm current malware status|\n|0x9785364D|Upload file|0x9785365B|Create process with user privilege|\n|0x9785364E|Temporary file compression and upload|0x9785365C|Command fail|\n|0x9785364F|Create process|0x9785365D|Command success|\n|0x97853651|Change file timestamp|0x97853660|Confirm local system time|\n|0x97853652|Attempt communication with address received from server|0x97853661|Confirm working directory|\n|0x97853653|Execute received command|0x97853662|Change working directory|\n\n|Mode|Function|Requester by mode|\n|---|---|---|\n|Information|File update with MID address saved|Attacker|\n|Savec|Send commands to C2 server by each infected device||\n|Read|Receive command results by each infected device from C2 server||\n|Restore|Collect infected device ID log file||\n|Communication|Save infected device ID and transfer to MID|Malware|\n|Load|Receive command from C2 server||\n|Saves|Send infection information and command results to C2 server||\n\n\n-----\n\nThe function of the MID page below allows an attacker to collect all the information on C2 pages and identify which\ninfected devices are connected on which C2 pages. An attacker periodically gathers information on MID pages. An\nattacker can enable logging by sending 1 to the tableno parameter on initial use of the freeboard function, and only the\ndevice that is connected for 60 seconds following the attacker’s request is saved. In other words, the attacker collects and\nconfirms the IP of the infected device and C2 information only when the attacker wishes to, and issues commands\nthrough C2.\n\n**Mode** **Function** **Requester**\n\nqnaboard Send and save accessed C2 page and infected device information C2 page\n\nfreeboard Enable function or request data stored through qnaboard Attacker\n\n_Table 19: Page functions._\n\n_Figure 44: MID page partial code (infected device ID, infected device IP, C2 page address save)._\n\n**_B.2 Response value when connecting to C2 server_**\n\nThe Bookcodes malware communicates with the C2 page and checks the connection status through the following values.\n\n**Mode** **C2 page** **MID**\n\nbookcodes:200 200 Success 200 Success\n\nbookcodes:300 Failed to read and set file     \nbookcodes:400 MID page 404 Not Found Exceed request time\n\nbookcodes:500 Failed to access MID page     \nbookcodes:600     - Failed to read log file\n\n_Table 20: Values used to communicate with the C2 page and check the connection status._\n\n**_C. Remote control framework_**\n\nThe entire communication structure of remote control consists of the remote-controlled malware, C2 page, MID page, and\nthe attacker. The overall flow is shown in Figure 45.\n\n|Mode|Function|Requester|\n|---|---|---|\n|qnaboard|Send and save accessed C2 page and infected device information|C2 page|\n|freeboard|Enable function or request data stored through qnaboard|Attacker|\n\n|Mode|C2 page|MID|\n|---|---|---|\n|bookcodes:200|200 Success|200 Success|\n|bookcodes:300|Failed to read and set file|-|\n|bookcodes:400|MID page 404 Not Found|Exceed request time|\n|bookcodes:500|Failed to access MID page|-|\n|bookcodes:600|-|Failed to read log file|\n\n\n-----\n\n_Figure 45: Overview of remote-control communications._\n\n**_C.1 Process during malware infection_**\n\nWhen infected with malware, the actual remote control framework operates as shown in Figure 46.\n\n_Figure 46: Remote control communication order._\n\n\n-----\n\n**_C.2 Overall framework structure_**\n\nAnalysis of a number of infected victims, C2 pages, and MID servers confirmed that the remote control framework consists\nof the structure shown in Figure 47.\n\n_Figure 47: Overall remote control framework structure._\n\n**4.4 Tool**\n\n**_A. DLL injector_**\n\nUsing the injector tool, the ID value of the currently running process is checked and an attempt is made to inject malware\ninto that process. Used to inject the following Proxy tool.\n\n_Figure 48: DLL injector malware execution option._\n\nReferring to the pre-collected process ID received from the second parameter, the malware received is injected as the third\nparameter into the process with that PID. The process is as shown in Figure 49.\n\n_Figure 49: DLL injector method._\n\n\n-----\n\n**_B. Proxy tools_**\n\nWhen attempting a watering hole attack, the attacker used a DLL injector to the hosting server to inject the Proxy tool into\nthe w3svc service. The malware injected into the w3svc service uses the server API because it operates on the web server,\nand it creates a URL group to monitor all packets and downloads the malware from the attacker’s server when the request\nvalue for a specific condition enters request query.\n\n_Figure 50: Proxy tool operation method._\n\n**5. CONCLUSION**\n\nIn this report, the Korea Internet & Security Agency (KISA) looked at the types of attacks that collect internal information\nusing various malware and tools after initial access through spear-phishing emails.\n\nAttackers used spear phishing for initial access, exploiting human error rather than risking a direct attack on a highly\nsecured system. Once an attacker successfully infiltrates a company, an attacker secures persistence with remote-controlled\nmalware, collects information and spreads malware.\n\nNormal tools were also used when collecting information to avoid detection by anti-virus software. With these offensive\ntactics in mind, it is necessary to avoid accessing external sites through Internet Explorer (which is no longer supported),\nrefrain from opening attachments or clicking links in any suspicious emails, and to contact the in-house information\nsecurity team in any such cases.\n\nTo prevent infection through attachments, users should make sure that the extension is not used twice or is not hidden at the\nend of a very long file name. Avoid opening executable extensions (exe, msi, scr, vbs, bat, ps1, etc.).\n\nAdditionally, the Hangul word processor and Microsoft Office programs should always be kept up to date. Do not click any\nsuspicious links within the body of a document. For Microsoft Office files, do not open any documents that encourage\nenabling macro options.\n\nIt can be difficult to prevent initial access attacks such as spear phishing, which target human error, with only a limited\nnumber of security personnel dedicated to protect a firm’s employees and assets. Therefore, it is important to have\nmeasures to minimize damage and slow the pace of an attack in case of infiltration. Defenders should be able to monitor\nthe minimum of important systems based on their understanding of the network structure. Additionally, unnecessary\nnetwork sharing among systems should be terminated and access privileges to accounts should be separated by systems.\n\n**REFERENCE**\n\n[1] KrCERT/CC. [TECHNICAL REPORT] TTPs#1 Controlling local network through vulnerable websites.\nJune 2020. https://www.boho.or.kr/krcert/publicationView.do?bulletin_writing_sequence=35464&queryString=\n[cGFnZT0zJnNvcnRfY29kZT0mc29ydF9jb2RlX25hbWU9JnNlYXJjaF9zb3J0PXRpdGxlX25hbWUmc2Vhcm](https://www.boho.or.kr/krcert/publicationView.do?bulletin_writing_sequence=35464&queryString=cGFnZT0zJnNvcnRfY29kZT0mc29ydF9jb2RlX25hbWU9JnNlYXJjaF9zb3J0PXRpdGxlX25hbWUmc2VhcmNoX3dvcmQ9)\nNoX3dvcmQ9.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://vblocalhost.com/uploads/VB2021-Lee-etal.pdf"
    ],
    "report_names": [
        "VB2021-Lee-etal.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1689991606,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1629375228,
    "ts_modification_date": 1629375401,
    "files": {
        "pdf": "https://archive.orkl.eu/7b83ffb4aa3d64ae5afc9c95ed8f3f9979dc27f4.pdf",
        "text": "https://archive.orkl.eu/7b83ffb4aa3d64ae5afc9c95ed8f3f9979dc27f4.txt",
        "img": "https://archive.orkl.eu/7b83ffb4aa3d64ae5afc9c95ed8f3f9979dc27f4.jpg"
    }
}