{
    "id": "5065b1d7-5e3e-4fe7-aba9-cc2a95da9662",
    "created_at": "2023-01-12T15:09:16.297277Z",
    "updated_at": "2025-03-27T02:14:34.138171Z",
    "deleted_at": null,
    "sha1_hash": "6881ff234861e0df844b0ad7d8d3e251a2cc0977",
    "title": "2021-02-01 - Pivoting- finding malware domains without seeing malicious activity",
    "authors": "",
    "file_creation_date": "2022-05-28T02:08:22Z",
    "file_modification_date": "2022-05-28T02:08:22Z",
    "file_size": 65798,
    "plain_text": "# Pivoting: finding malware domains without seeing malicious activity\n\n**[silentpush.com/blog/pivoting-finding-malware-domains-without-seeing-malicious-activity](https://www.silentpush.com/blog/pivoting-finding-malware-domains-without-seeing-malicious-activity)**\n\nMay 28\nWritten By [Ken Bagnall](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\nFirst Published February 1st 2021 by Martijn\n\n\nMay 28, 2019\n\n\n**It is part of the job of a threat actor to ensure the domains used in their campaigns**\n**blend in with the crowd and stay undetected for the duration of the campaign. It is**\n**part of the job of an analyst to spot such domains by looking for ways in which they**\n**still stand out.**\n\nWhile looking through Silent Push’s trove of data, I spotted the domain cdn12-websecurity[.]com. At first glance, this domain looks like a normal domain, part of the content\ndelivery network of a web security service. However, it is slightly odd that more than three\nmonths after the domain was registered, cdnn-web-security[.]com doesn’t exist for any\nother n.\n\nWe have also learned to be a bit suspicious of these very normal looking domains: the main\n[domain used in the SolarWinds supply-chain attack, avsvmcloud[.]com, remained](https://silentpush.com/blog/high-value-malicious-domains/1)\nundetected for months at least in part because it looks so very normal, seeming to belong to\nan AWS-like cloud service and hardly standing out among the domains you’ll see in your\nDNS logs.\n\nOn top of this, in the past month alone, we have seen cdn12-web-security[.]com point to no\nfewer than six different IP addresses in succession, which is fairly unusual:\n\n80.249.147[.]241\n\n47.91.92[.]75\n\n80.249.147[.]144\n\n47.254.131[.]6\n\n8.208.87[.]225\n\n8.208.101[.]136\n\nStill, we have not seen any malicious activity linked to the domain. In fact, there does not\nappear to be any public activity linked to the domain at all, which suggests that whatever it\n\n\n-----\n\nis that the owners of the domain are doing, they keep it small enough to stay under the\nradar.\n\nBut let us look at the IP addresses. Two of them (80.249.147[.]241 and 80.249.147[.]144)\nbelong to Russian hosting provider Selectel in Russia, while the other four belong to\nAlibaba’s US operations. In Silent Push’s systems, these two ASNs have fairly high (i.e.\nbad) IP reputation scores (35 and 28 respectively), which suggests a fair number of\nmalicious URLs hosted there. It should be noted though this isn’t too uncommon for large\ncloud provider: Amazon AWS’s IP reputation score currently stands at 19.\n\nNow let us look at the IP address to which the domain pointed to during the last week of\nJanuary, 8.208.101[.]136, and see what else is hosted there.\n\nDuring the last week in January, the domain secure-dns-resolve[.]com also pointed to this\n[IP address. And for this domain we have public activity of both malware connecting to it and](https://any.run/report/03dcf034305c3f0613546e11755adad5b7a2902c00cbf66f0aa30e441efbf717/2f0ea629-5083-48a6-98fb-ace946b986a9)\na [phishing image hosted there. Interestingly, and almost certainly not coincidentally, was](http://phishtank.net/phish_detail.php?phish_id=6777978)\nsaw this domain point to the same six IP addresses throughout January, going through\nthem in the same order.\n\nAnother domain name pointing to the same IP address is dns16-microsoft-health[.]com.\n[Here too we find public evidence of malware that has connected to it. It will not surprise](https://bazaar.abuse.ch/sample/d6ab9f8682b3afdc2d594873776c56341e67734dbea4f4bea62b5c59a2f69cd7/)\nanyone that dnsn-microsoft-health.com doesn’t exist for any other n. The domain has also\ncycled through the same set of IP addresses we saw before.\n\nThis is also true for a fourth domain we saw pointing to 8.208.101[.]136 recently: cdn12show-content[.]com. Here though we find no public evidence for activity linked to this\ndomain, malicious or not.\n\n**Still, given the many similarities, we are confident to say cdn12-web-security[.]com**\n**and cdn12-show-content[.]com are operated by the same actors who also operate**\n**secure-dns-resolve[.]com and dns16-microsoft-health[.]com and should be blocked**\n**just as much. The same is true for a fifth domain, ms-health-monitor[.]com, which**\n**has been linked to** **[malware and which was taken down in January.](https://any.run/report/f7b307a254dcb84209d480ae37e1a609a74f565da2ca8b915e9a57b781bfb1ae/b4892d47-72ed-43db-95c0-c7f6b7947a40)**\n\nAnother thing that links these five domains is the use of DNSPod’s name servers, which\nhave a not too great reputation of 18 in Silent Push’s systems.\n\n**These five domains aren’t the only ones linked to the mentioned IP addresses. For**\n**example, righttime4mercy[.]com currently points to 80.249.147[.]144; this domain has**\n**been linked to a** **[Hancitor malspam campaign in the past.](https://twitter.com/ostinjohn/status/1318932864050860032)**\n\nIt may thus be that behind these IP addresses are managed by a bulletproof hosting\nprovider which rents out its infrastructure to malicious actors and shields them from\ntakedown requests. The Hancitor domain may thus be unrelated to the other five, though of\ncourse no less malicious.\n\n\n-----\n\n## Conclusion\n\nPivoting around an IP address or a domain name isn’t generally a very reliable way to link\nmalicious activity, given the wide use of shared and compromised infrastructure, as well as\nthe use of false flags by more advanced actors. However, it should not be totally ignored\neither.\n\nWe started from a single interesting looking domain for which no malicious activity could be\nfound. Through the Silent Push API and with the help of a few search engine searches, we\nwere able to link it to an active malware campaign, and possibly found part of a bulletproof\nhosting operation.\n\n[Ken Bagnall](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-01 - Pivoting- finding malware domains without seeing malicious activity.pdf"
    ],
    "report_names": [
        "2021-02-01 - Pivoting- finding malware domains without seeing malicious activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536156,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1653703702,
    "ts_modification_date": 1653703702,
    "files": {
        "pdf": "https://archive.orkl.eu/6881ff234861e0df844b0ad7d8d3e251a2cc0977.pdf",
        "text": "https://archive.orkl.eu/6881ff234861e0df844b0ad7d8d3e251a2cc0977.txt",
        "img": "https://archive.orkl.eu/6881ff234861e0df844b0ad7d8d3e251a2cc0977.jpg"
    }
}