{
    "id": "50ca271a-3798-4f94-930c-0ba426226d05",
    "created_at": "2023-01-12T15:08:15.899965Z",
    "updated_at": "2025-03-27T02:06:08.247001Z",
    "deleted_at": null,
    "sha1_hash": "de2e374d0f5079dbf98c29333ef4768fb2fad451",
    "title": "2021-01-22 - LDAP Channel Binding and Signing",
    "authors": "",
    "file_creation_date": "2022-05-27T21:37:35Z",
    "file_modification_date": "2022-05-27T21:37:35Z",
    "file_size": 365966,
    "plain_text": "# LDAP Channel Binding and Signing\n\n**[hub.trimarcsecurity.com/post/ldap-channel-binding-and-signing](https://www.hub.trimarcsecurity.com/post/ldap-channel-binding-and-signing)**\n\nScott Blake January 22, 2021\n\nJan 22, 2021\n\nUpdated: May 19\n\nThe initial fuss around Microsoft “forcing” customers into LDAP channel binding and LDAP\nsigning (January 2020, March 2020, second half of 2020, TBD) appears to have\novershadowed the crucial questions organizations should be addressing: The What, How,\nWhere, & Why associated with secure LDAP communication. After speaking with security\nprofessionals attempting to implement these very settings and based on the results of\nTrimarc’s [Active Directory Security Assessments it has become clear that the right answers](https://www.trimarcsecurity.com/ad-security-assessment)\nare proving difficult to come by (we have seen next to zero adoption of these highly\nrecommended configurations).\n\n### What Is LDAP Channel Binding and LDAP Signing?\n\nIt is important to recognize that while these two settings are often mentioned in the same\nbreath, they are two distinct configurations and should be treated as such. But before\nbreaking these down further, it would be beneficial to give a brief overview of LDAP\n(Lightweight Directory Access Protocol). LDAP at its core is a communication protocol\ncommonly used by directory services like Active Directory to talk back and forth with\napplications regarding identity and access. The easiest way to think about this is with\nauthentication. Active Directory stores user credentials needed by programs when validating\nidentity. In order for a program to retrieve said credentials it can reach out to Active Directory\nover LDAP and Active Directory will respond in kind over the same protocol.\n\n\n-----\n\n_Oversimplification of the LDAP authentication process to illustrate the communication flow as_\n_well as an attacker’s desire to intercept by positioning themselves between the application_\n_and Active Directory._\n\nKnowing that these types of communication occur over LDAP, its fairly easy to see why it\nneeds to be as secure as possible (what attacker wouldn’t want a valid authentication ticket).\n\n**LDAP Channel Binding**\n\n[LDAP channel binding was brought to our attention by Microsoft with the tagline “To make](https://support.microsoft.com/en-us/help/4034879/how-to-add-the-ldapenforcechannelbinding-registry-entry)\nLDAP authentication over SSL/TLS more secure”. Basically, LDAP channel binding is the act\nof tying the TLS tunnel and the application layer (leveraged by LDAP) together to create a\nunique identifier (channel binding token) for that specific LDAP session. This channel binding\ntoken (CBT) can only be used within that TLS tunnel and therefore prevents a “stolen” LDAP\nticket from being leveraged elsewhere.\n\nChannel binding requires a two-part implementation:\n\n[Part 1: Installing the necessary update on your Windows system (CVE-2017-8563), which](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2017-8563)\nshould already be in place as this was released in 2017.\n\nPart 2: Configuring the appropriate GPO setting on Domain Controllers (this no longer needs\nto be deployed via registry with the March 2020 Microsoft updates).\n\n1. Domain controller: LDAP server channel binding token requirements = “Never” (default)\n\n2. Domain controller: LDAP server channel binding token requirements = “When\n\nSupported”\n\n3. Domain controller: LDAP server channel binding token requirements = “Always”\n\nThe end goal for LDAP channel binding should be c. “Always” but for auditing/testing\npurposes option b. “When Supported” needs to be selected to start generating failure logs\nwith the Event ID 3039. Setting the GPO to “Always” will also permit Event ID 3039\ngeneration but will not allow the authentication validation to occur i.e., if there are systems\nthat do not comply, they will no longer successfully communicate with AD. See the ‘Where to\nGet Started’ section for more information.\n\n\n-----\n\n**LDAP Signing**\n\nLDAP signing has been around since Server 2003 with additional auditing capabilities added\nin Server 2008. LDAP signing, when enforced, requires clients to sign LDAP requests with its\n(the client’s) digital signature. By default, Active Directory does not require LDAP\ncommunication to be signed which makes its vulnerable to hacking. When LDAP signing is\nenforced Domain Controllers will not allow any authentication requests without a valid\nsignature. LDAP signing ensures that the request received by the server (Domain Controller)\nwas sent by the client the LDAP message is purported to be from. Additionally, signing\ncertifies that the LDAP messages are not modified or tampered with.\n\nLDAP signing is implemented in two-parts:\n\nPart 1: Configuring Windows clients through GPO.\n\n1. Network security: LDAP client signing requirements = “None”\n\n2. Network security: LDAP client signing requirements = “Negotiate signing” (Windows 10\n\n_default)_\n\n3. Network security: LDAP client signing requirements = “Require signing”\n\nPart 2: Configuring Domain Controllers through GPO.\n\n1. Domain controller: LDAP server signing requirements = “None” (default)\n\n2. Domain controller: LDAP server signing requirements = “Require signing”\n\nThe end goal with LDAP signing is to “Require signing” on both Windows clients and Domain\ncontrollers. As with LDAP channel binding, a robust audit plan needs to be implemented first\nto ensure all systems will comply (see next section). Note that signing is only supported on\nWindows 7 and higher, meaning if you are running XP, do not set your Domain controllers to\nrequire signing (better yet, move off XP already).\n\n### How Are These Vulnerabilities Being Exploited?\n\nThe major attack vectors these configurations seek to mitigate are person-in-the-middle and\nreplay style attacks. Look no further than Microsoft's own executive summary of CVE-20178563 which describes the exploit resolved with LDAP channel binding:\n\n\n-----\n\n_An elevation of privilege vulnerability exists in Microsoft Windows when a man-in-the-middle_\n_attacker is able to successfully forward an authentication request to a Windows LDAP server,_\n_such as a system running Active Directory Domain Services (AD DS) or Active Directory_\n_Lightweight Directory Services (AD LDS), which has been configured to require signing or_\n_sealing on incoming connections._\n\n_The update addresses this vulnerability by incorporating support for Extended Protection for_\n_Authentication security feature, which allows the LDAP server to detect and block such_\n_forwarded authentication requests once enabled.\"_\n\nThe big takeaway here is that Active Directory is vulnerable to targeted attacks against LDAP\ncommunication. As illustrated earlier an attacker would place themselves between the\napplication performing an authentication request and Active Directory in an attempt to\nintercept, modify, and forward the request to obtain a valid authentication ticket. This\nassailant could also potentially capture a ticket that has already been validated and reuse it\nin the environment. Keep in mind these security exploits all occur under the guise of a\nnormal, legitimate user which make them all the more disconcerting.\n\nDirk-Jan Mollema has some excellent articles that dive into these types of attacks:\n\n[https://dirkjanm.io/worst-of-both-worlds-ntlm-relaying-and-kerberos-delegation/](https://dirkjanm.io/worst-of-both-worlds-ntlm-relaying-and-kerberos-delegation/)\n\nhttps://dirkjanm.io/exploiting-CVE-2019-1040-relay-vulnerabilities-for-rce-and-domainadmin/\n\n### Where to Get Started?\n\nAnytime changes of this magnitude are recommended in an environment it can cause angst\n(rightly so) and misinformation. After all lots of different applications, storage devices,\nnetwork equipment, and operating systems rely on Active Directory for authentication. The\nnice part about these recommendations is that they do not need to be implemented blindly;\n**auditing is your friend!**\n\nWith Microsoft’s March 2020 updates they have provided some great capabilities for\ntesting/auditing LDAP channel binding (as previously mentioned, LDAP signing events have\nbeen around since Server 2008). This is great news for the admins and engineers who must\nanswer that all important question at the next change control board meeting - “what affect will\nthese configurations have”. Arriving at the correct resolution is straightforward:\n\n\n-----\n\n1. Enable LDAP events diagnostic logging to 2 or higher on all Domain Controllers using\n\nthe command - Reg Add\n_HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\NTDS\\Diagnostics /v_\n_\"16 LDAP Interface Events\" /t REG_DWORD /d 2_\n\n2. Configure the channel binding group policy setting to “When Supported” to log binding\n\nfailure events on Domain Controllers. Nothing needs to be done for LDAP signing\nfailures as these events are already captured.\n\n3. Configure your SIEM to alert on Directory Service Event IDs 3039 for channel binding\n\nand 2889 for signing requests that will not conform to the new requirements. These\nevents include a Source IP address that can be used to track down the “offending”\noperating system/application/equipment.\n\n4. With the “offenders” identified, research will need to be performed to see if they can be\n\nconfigured to comply.\n\n5. Once all systems correctly leverage channel binding and signing (no more 3039 &\n\n2889 events), enforcement should be set on the GPOs.\n\n6. Domain controller: LDAP server channel binding token requirements = “Always”\n\n7. Domain controller: LDAP server signing requirements = “Require signing”\n\n8. Network security: LDAP client signing requirements = “Require signing” (Windows\n\n_clients)_\n\n9. Show up at the change control board meeting with all the rights answers without having\n\nto break anything to get them. Stand for applause from your colleagues.\n\n\n-----\n\nIt is important to note that Windows systems and Microsoft applications will not have any\nissues with these settings as long as the necessary updates have been applied and the\nGroup Policy settings are configured correctly. LDAP channel binding is rare outside of the\nWindows family but audit to be sure. LDAP signing, on the other hand, is common and\ntherefore should be audited. Simply put, audit your environment. This will also allow you to\nsee if changes made to the “offending” systems are in fact working before implementing the\nGroup Policy settings that will require these configurations.\n\n### Why Should We Deploy These Settings?\n\nHopefully at this point in the article the Why Should We Deploy These Settings question has\nbeen thoroughly answered. LDAP is inherently susceptible to attacks and having these\nsettings configured to Microsoft’s [recommendation is one (or two in this case) ways to better](https://support.microsoft.com/en-us/help/4520412/2020-ldap-channel-binding-and-ldap-signing-requirements-for-windows)\nharden your Active Directory environment. Just because Microsoft has decided not to force\nthese changes on customers (for now) does not mean LDAP channel binding and LDAP\nsigning should be ignored. If done correctly, and with proper forethought, these settings are\nan easy win for the security of any AD forest.\n\nReferences & Additional Information\n\n[https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2017-8563](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2017-8563)\n\nhttps://techcommunity.microsoft.com/t5/core-infrastructure-and-security/ldap-channelbinding-and-ldap-signing-requirements-march-2020/ba-p/921536\n\nhttps://support.microsoft.com/en-us/help/4520412/2020-ldap-channel-binding-and-ldapsigning-requirements-for-windows\n\n[https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8563](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8563)\n\nhttps://support.microsoft.com/en-us/help/4034879/how-to-add-theldapenforcechannelbinding-registry-entry\n\nhttps://oxfordcomputergroup.com/resources/ldap-channel-binding-signingrequirements/\n\n[https://access.redhat.com/articles/4661861](https://access.redhat.com/articles/4661861)\n\n\n-----\n\n_By: Scott W Blake_\n\n_Trimarc Security Consultant with 10+ years building, configuring, and securing enterprise_\n_environments._\n\n_[Trimarcprovides leading expertise in security solutions including security reviews, strategy,](https://www.trimarcsecurity.com/)_\n_architecture, and implementation. Our methodology leverages our internal research and_\n_custom tooling which better discovers multiple security issues attackers could exploit to_\n_compromise the environment. Trimarc security services fit between traditional_\n_compliance/audit reviews and standard penetration testing/red teaming engagements,_\n_providing deep understanding of Microsoft and Virtualization technologies, typical security_\n_issues and misconfigurations, and provide recommendations based on our own best_\n_practices custom-tailored to balance operational and security challenges._\n\n## Recent Posts\n\n[See All](https://www.hub.trimarcsecurity.com/posts)\n[Implementing Controls in Active Directory: Protecting Against Privileged Credential Sprawl](https://www.hub.trimarcsecurity.com/post/implementing-controls-in-active-directory-protecting-against-privileged-credential-sprawl)\n\n6,489\n\nKerberos Bronze Bit Attack (CVE-2020-17049) Scenarios to Potentially Compromise Active\nDirectory\n\n\n-----\n\nIntroduction & Attack Overview Jake Karnes (@jakekarnes42) with NetSPI published 3\narticles (that’s right 3!) describing a new attack against Microsoft’s Kerberos implementation\nin Active Directory. H\n\n2,777\n\n[Securing Microsoft Azure AD Connect](https://www.hub.trimarcsecurity.com/post/securing-microsoft-azure-ad-connect)\nWith more and more organizations moving to the cloud, specifically Azure Active\nDirectory/Microsoft 365 (formerly Office 365), Trimarc has seen a large increase in the\nnumber of Azure AD Connect deplo\n\n4,146\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-22 - LDAP Channel Binding and Signing.pdf"
    ],
    "report_names": [
        "2021-01-22 - LDAP Channel Binding and Signing.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536095,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653687455,
    "ts_modification_date": 1653687455,
    "files": {
        "pdf": "https://archive.orkl.eu/de2e374d0f5079dbf98c29333ef4768fb2fad451.pdf",
        "text": "https://archive.orkl.eu/de2e374d0f5079dbf98c29333ef4768fb2fad451.txt",
        "img": "https://archive.orkl.eu/de2e374d0f5079dbf98c29333ef4768fb2fad451.jpg"
    }
}