{
    "id": "5114c432-b360-4f91-bd8a-26d352f22bd8",
    "created_at": "2023-01-12T15:10:28.715367Z",
    "updated_at": "2025-03-27T02:06:00.943807Z",
    "deleted_at": null,
    "sha1_hash": "11fe33269dad6f75cfd994b49320a37523d9d741",
    "title": "2020-12-13 - Important steps for customers to protect themselves from recent nation-state cyberattacks",
    "authors": "",
    "file_creation_date": "2022-05-28T05:06:24Z",
    "file_modification_date": "2022-05-28T05:06:24Z",
    "file_size": 127171,
    "plain_text": "# Important steps for customers to protect themselves from recent nation-state cyberattacks\n\n**[blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/](https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/)**\n\nDecember 14, 2020\n\nToday, Microsoft is sharing information and issuing guidance about increased activities from\na sophisticated threat actor that is focused on high value targets such as government\nagencies and cybersecurity companies. We believe this is nation-state activity at significant\nscale, aimed at both the government and private sector. While we aren’t sharing any details\nspecific to individual organizations, it is important for us to share greater detail about some of\nthe threat activity we’ve uncovered over the past weeks, along with guidance that security\nindustry practitioners can use to find and mitigate potential malicious activity.\n\nWe also want to reassure our customers that we have not identified any Microsoft product or\ncloud service vulnerabilities in these investigations.\n\nAs part of our ongoing threat research, we monitor for new indicators that could signal\n[attacker activity. As we recently shared in our 2020 Digital Defense Report, we’ve delivered](https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/)\nover 13,000 notifications to customers attacked by nation states over the past two years and\nhave observed a rapid increase in sophistication and operational security capabilities.\n\n\n-----\n\nFireEye s recent disclosure is consistent with the attacks that we ve observed, and we\ncommend FireEye’s disclosure and sharing, as we strongly believe this industry sharing is\ncritical to protecting the internet.\n\nBecause of the sophistication of the techniques and operational security capabilities of the\nactor, we want to encourage greater scrutiny by the broader community. While these\nelements aren’t present in every attack, these techniques are part of the toolkit of this actor.\n\nAn intrusion through malicious code in the SolarWinds Orion product. This results in\nthe attacker gaining a foothold in the network, which the attacker can use to gain\nelevated credentials. Microsoft Defender now has detections for these files. Also, see\n[SolarWinds Security Advisory.](https://www.solarwinds.com/securityadvisory)\nAn intruder using administrative permissions acquired through an on-premises\ncompromise to gain access to an organization’s trusted SAML token- signing\ncertificate. This enables them to forge SAML tokens that impersonate any of the\norganization’s existing users and accounts, including highly privileged accounts.\nAnomalous logins using the SAML tokens created by a compromised token-signing\ncertificate, which can be used against any on-premises resources (regardless of\nidentity system or vendor) as well as against any cloud environment (regardless of\nvendor) because they have been configured to trust the certificate. Because the SAML\ntokens are signed with their own trusted certificate, the anomalies might be missed by\nthe organization.\nUsing highly privileged accounts acquired through the technique above or other means,\nattackers may add their own credentials to existing application service principals,\nenabling them to call APIs with the permission assigned to that application.\n\n[Please see customer guidance on recent nation-state cyberattacks for specific details and](https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/)\nguidance.\n\nWe believe it’s important to share significant threat activity like what we’re announcing today.\nWe think it’s critical that governments and the private sector are increasingly transparent\nabout nation-state activity so we can all continue the global dialogue about protecting the\ninternet. We also hope publishing this information helps raise awareness among\norganizations and individuals about steps they can take to protect themselves.\n\nAs we recommend to our customers, we are also actively looking for indicators in the\nMicrosoft environment and, to date, have not found evidence of a successful attack.\n\nEven with all the resources we dedicate to cybersecurity, our contribution will be only a small\npiece of what’s needed to address the challenge. It requires policymakers, the business\ncommunity, government agencies and, ultimately, individuals to make a real difference, and\nwe can only have significant impact through shared information and partnerships. We hope\nthis contribution will help us all work together better to improve the security of the digital\necosystem.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-13 - Important steps for customers to protect themselves from recent nation-state cyberattacks.pdf"
    ],
    "report_names": [
        "2020-12-13 - Important steps for customers to protect themselves from recent nation-state cyberattacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536228,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653714384,
    "ts_modification_date": 1653714384,
    "files": {
        "pdf": "https://archive.orkl.eu/11fe33269dad6f75cfd994b49320a37523d9d741.pdf",
        "text": "https://archive.orkl.eu/11fe33269dad6f75cfd994b49320a37523d9d741.txt",
        "img": "https://archive.orkl.eu/11fe33269dad6f75cfd994b49320a37523d9d741.jpg"
    }
}