{
    "id": "513bd0ae-be80-4be8-82bc-5b901cbc9e37",
    "created_at": "2023-01-12T15:02:16.140037Z",
    "updated_at": "2025-03-27T02:14:34.829183Z",
    "deleted_at": null,
    "sha1_hash": "e820158698121f515887f51abe7aaac8324266b8",
    "title": "2016-01-24 - Scarlet Mimic- Years-Long Espionage Campaign Targets Minority Activists",
    "authors": "",
    "file_creation_date": "2022-05-28T00:33:06Z",
    "file_modification_date": "2022-05-28T00:33:06Z",
    "file_size": 1368297,
    "plain_text": "# Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists\n\n**[unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/](https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/)**\n\nRobert Falcone, Jen Miller-Osborn January 24, 2016\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Jen Miller-Osborn](https://unit42.paloaltonetworks.com/author/jen-miller-osborn/)\n\nJanuary 24, 2016 at 5:00 PM\n\n[Category: Reports,](https://unit42.paloaltonetworks.com/category/reports/) [Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Android,](https://unit42.paloaltonetworks.com/tag/android/) [Apple,](https://unit42.paloaltonetworks.com/tag/apple/) [AutoFocus,](https://unit42.paloaltonetworks.com/tag/autofocus/) [BrutishCommand,](https://unit42.paloaltonetworks.com/tag/brutishcommand/) [CallMe,](https://unit42.paloaltonetworks.com/tag/callme/) [cyber espionage,](https://unit42.paloaltonetworks.com/tag/cyber-espionage/) Cyber\nThreat Alliance, [cybersecurity,](https://unit42.paloaltonetworks.com/tag/cybersecurity/) [Espionage,](https://unit42.paloaltonetworks.com/tag/espionage/) [FakeM,](https://unit42.paloaltonetworks.com/tag/fakem/) [Mac OS X,](https://unit42.paloaltonetworks.com/tag/mac-os-x/) [microsoft,](https://unit42.paloaltonetworks.com/tag/microsoft/) [MobileOrder,](https://unit42.paloaltonetworks.com/tag/mobileorder/)\n[Psylo,](https://unit42.paloaltonetworks.com/tag/psylo/) [Scarlet Mimic,](https://unit42.paloaltonetworks.com/tag/scarlet-mimic/) [SkiBoot Loader,](https://unit42.paloaltonetworks.com/tag/skiboot-loader/) [SubtractThis,](https://unit42.paloaltonetworks.com/tag/subtractthis/) [Trojans,](https://unit42.paloaltonetworks.com/tag/trojans/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/scarlet-mimic-years-long-espionage-targets-minority-activists/)\n\n## Executive Summary\n\nOver the past seven months, Unit 42 has been investigating a series of attacks we attribute\nto a group we have code named “Scarlet Mimic.” The attacks began over four years ago and\ntheir targeting pattern suggests that this adversary’s primary mission is to gather information\nabout minority rights activists. We do not have evidence directly linking these attacks to a\ngovernment source, but the information derived from these activities supports an\nassessment that a group or groups with motivations similar to the stated position of the\nChinese government in relation to these targets is involved.\n\nThe goal of this report is to expose the tools, tactics and infrastructure deployed by Scarlet\nMimic in order to increase awareness of this threat and decrease its operational success\nthrough deployment of prevention and detection countermeasures. From our vantage point,\nwe are not able to identify which attacks have been successful against which\norganizations. But the fact that the tools Scarlet Mimic deploys have been under\ndevelopment for years suggests an active adversary that has been successful in some\npercentage of its operations. Based on our analysis, we are also seeing Scarlet Mimic start\nto expand its espionage efforts from PCs to mobile devices, marking an evolution\nin its tactics.\n\nIndividuals and groups of all different types may become the target of cyber espionage\ncampaigns. The most well known victims of cyber espionage are typically government\norganizations or high-tech companies, but it’s important to recognize that espionage-focused\nadversaries are tasked to collect information from many sources.\n\n\n-----\n\nThe attacks we attribute to Scarlet Mimic have primarily targeted Uyghur and Tibetan\nactivists as well as those who are interested in their causes. Both the Tibetan community and\nthe Uyghurs, a Turkic Muslim minority residing primarily in northwest China, have been\ntargets of multiple sophisticated attacks in the past decade. Both also have history of\nstrained relationships with the government of the People’s Republic of China (PRC), though\nwe do not have evidence that links Scarlet Mimic attacks to the PRC.\n\nScarlet Mimic attacks have also been identified against government organizations in Russia\nand India, who are responsible for tracking activist and terrorist activities. While we do not\nknow the precise target of each of the Scarlet Mimic attacks, many of them align to the\npatterns described above.\n\nThe Scarlet Mimic attacks primarily center around the use of a Windows backdoor named\n“FakeM.” It was first described by Trend Micro in 2013 and was named FakeM because its\nprimary command and control traffic mimicked Windows Messenger and Yahoo! Messenger\nnetwork traffic to evade detection. We have identified two subsequent variants of the FakeM\nfamily, which has undergone significant changes since it was exposed in 2013. We have also\nidentified nine distinct “loader” malware families, which Scarlet Mimic appears to use to avoid\ndetection when infecting a system.\n\nIn addition to the FakeM variants, Scarlet Mimic has deployed Trojans that target the Mac\nOS X and Android operating systems. We have linked these attacks to Scarlet Mimic through\nanalysis of their command and control (C2) infrastructure.\n\nTo infect individuals with access to the data the actors desire, Scarlet Mimic deploys both\nspear-phishing and watering hole (strategic web compromise) attacks. Using these tactics\nthey can directly target previously identified individuals (spear phishing) as well as\nunidentified individuals who are interested in a specific subject (watering hole). In their spear\nphishing attacks, Scarlet Mimic has exploited five separate vulnerabilities. However, in many\ncases they chose to forgo exploiting a software vulnerability and used self-extracting (SFX)\nRAR archives that use the Right-to-Left Override character to mask the true file extension,\ntricking victims into opening executable files.\n\nAs with many other attackers who use spear-phishing to infect victims, Scarlet Mimic makes\nheavy use of “decoy” files. These are legitimate documents that contain content relevant to\nthe subject of the spear phishing e-mail. After the system is infected, the malware displays\nthe decoy document to trick the user into believing nothing harmful has occurred. These\ndecoy documents allow us to identify the theme of the spear phishing e-mail and in some\ncases the target of the attack.\n\nThe most recent Scarlet Mimic attacks we have identified were conducted in 2015 and\nsuggest the group has a significant interest in both Muslim activists and those interested in\ncritiques of the Russian government and Russian President Vladimir Putin. Based on their\n\n\n-----\n\nprevious targets we suspect these individuals may be targeted based on the information they\nposses on activist groups.\n\n[The primary source of data used in this analysis is Palo Alto Networks WildFire, which](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\nanalyzes malware used in attacks across the world. The system also analyzes malware\nsamples collected through a sharing partnership with other security vendors, including our\npartners in the [Cyber Threat Alliance. To connect attacks to each other based on malware](http://cyberthreatalliance.org/)\n[behavior and command and control infrastructure, we relied on AutoFocus threat](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html)\nintelligence. AutoFocus users can view all of the files related to Scarlet Mimic and the\nmalware associated with the group using the following links:\n\n[ScarletMimic](https://autofocus.paloaltonetworks.com/#/tag/Unit42.PaloAlto-ScarletMimic)\n[FakeM](https://autofocus.paloaltonetworks.com/#/tag/Unit42.FakeM)\n[Psylo](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Psylo)\n[MobileOrder](https://autofocus.paloaltonetworks.com/#/tag/Unit42.MobileOrder)\n\n## Introduction\n\nThe better we can understand the threats to our networks and systems, the more effective\nwe will be at preventing those threats. The goal of this report is to help network defenders\nbetter understand attacks from a group we have named Scarlet Mimic. This group has been\nconducting attacks for at least four years using a backdoor Trojan that has been under active\ndevelopment. The group primarily deploys spear-phishing e-mails to infect its targets, but\nwas also responsible for a watering hole (strategic web compromise) attack in 2013.\n\nAttacks from this group have been reported publicly in the past, but mostly as disparate,\nunconnected incidents. Based on analysis of the data and malware samples we have\ncollected, Unit 42 believes the attacks described herein are the work of a group or set of\ncooperating groups who have a single mission, collecting information on minority groups who\nreside in and around northwestern China. In the past, Scarlet Mimic has primarily targeted\nindividuals who belong to these minority groups as well as their supporters, but we’ve\nrecently found evidence to indicate the group also targets individuals working inside\ngovernment anti-terrorist organizations. We suspect these targets are selected based on\ntheir access to information about the targeted minority groups.\n\nIn the following sections we will describe selected attacks we have identified and who their\nlikely targets are. We will also provide detailed analysis of the latest variants of the malware\nthey deploy (known as FakeM) as well as other associated tools that allow Scarlet Mimic to\ntarget Android and OS X devices.\n\nAttacks launched by this group were publicly exposed on 2013 in a Trend Micro report about\nthe FakeM Trojan. Since that reports release, Scarlet Mimic has deployed two additional\nversions of the malware. They have also deployed nine separate “loader” Trojans they use to\ninfect systems with their backdoor.\n\n\n-----\n\n## Attack Details\n\nThe majority of attacks we associate with Scarlet Mimic follow the pattern shown in Figure 1.\n\nFigure 1: “Spear Phishing with Decoy” Attack Pattern Deployed by Scarlet Mimic\n\nThe attacker sends a spear-phishing e-mail with a subject and body content that appeal to\nthe targeted user. This e-mail carries an attachment, which is typically a document that\nexploits a Microsoft Office vulnerability. The attachment uses a file name that is related to the\ne-mail content to trick the user into opening it. If the user opens the file and the exploitation is\nsuccessful, a backdoor Trojan is installed on the system that gives the attacker access and a\ndecoy document is displayed to the victim. Decoy documents are typically non-malicious\nversions of the content the user expected to see when opening the attachment.\n\nMany of the targets and spoofed or compromised sending e-mail addresses have contact\ninformation on the Internet. The apparent sender email usually appears to be someone\nassociated with the accompanying text, when appropriate, while the target emails are usually\nalso available online tied to target organizations. A small subset of the decoys could not be\nfound online and may be from previous compromises by Scarlet Mimic.\n\nMany attackers deploy this particular pattern, as it is often successful at infecting a user\nwithout alerting the user of the infection. This is the exact same pattern, for example,\n[deployed by the attackers in Operation Lotus Blossom.](https://blog.paloaltonetworks.com/2015/06/operation-lotus-blossom/)\n\nWe have identified spear phishing documents from Scarlet Mimic exploiting the following\nvulnerabilities.\n\nCVE-2012-0158\nCVE-2010-3333\n\n\n-----\n\nCVE-2010-2883\nCVE-2010-2572\nCVE-2009-3129\n\nWe also know Scarlet Mimic uses a number of toolkits to create documents that contain\nexploit code to install the FakeM payload on a compromised system. Unit 42 tracks the\n[toolkits delivering FakeM under the names MNKit, WingD and Tran Duy Linh. These kits](https://blog.paloaltonetworks.com/2015/05/cmstar-downloader-lurid-and-enfals-new-cousin/)\nappear to be used by many attack groups, and they alone are not a good indication of\nScarlet Mimic activity.\n\nAdditionally, in many cases these threat actors did not use an exploit document at all, rather\nthey sent self-extracting (SFX) RAR archives that use the Right-to-Left Override character to\nmask the true file extension. For example, the following two filenames of SFX archives used\nto deliver FakeM contain the RLO character (bolded):\n\n_Update about the status of Tenzin Delek Rinpoche'ashes%E2%80%AEcod.scr_\n_tepsiliy mezmun.\\xe2\\x80\\xaetxt.scr_\n\nEven when no software vulnerability is exploited, the attacks still typically include a decoy\ndocument. The content of most of the decoy documents appear to be available on the open\nInternet, and the attackers typically made small modifications to them.\n\nMany of the targets and spoofed or compromised sending accounts have contact information\non the Internet. The apparent sender email usually appears to be someone associated with\nthe accompanying text, when appropriate, while the target emails are usually also available\nonline tied to target organizations. A small subset of the decoys could not be found online\nand may be from previous compromises by Scarlet Mimic. The overarching decoy themes\nwere Uyghur-related, anti-Putin, or Al-Qaeda-related. The decoys are often copied from think\ntanks or reputable news sources the targets would likely frequent.\n\n[In one instance, the threat actors used content from a New York Times article (Figure 2) on](http://www.nytimes.com/2015/07/22/world/asia/chinese-police-are-said-to-seize-ashes-of-tibetan-monk-tenzin-delek-rinpoche.html?_r=0)\nthe same day it was published.\n\n\n-----\n\nFigure 2: Decoy Text Extracted from the New York Times article\n\nFigure 3 shows one of the more common themes used to target Uyghurs and those\ninterested in their cause. Multiple attacks used press releases or other content related to the\nWorld Uyghur Congress.\n\nFigure 3: Decoy using World Uyghur Congress Press Release\n\nIn July of 2015, we identified a full e-mail uploaded to an antivirus scanning service that\ncarried a Scarlet Mimic exploit document. In this case (Figure 4) the recipient of the e-mail\nwas an individual working for the Russian Federal Security Service (fsb.ru). The e-mail body\nrequests help dealing with threatening phone calls from an international gang.\n\nFigure 4: Phishing E-mail send to FSB E-mail Address\n\nAnother attack, sent to an unknown target carried a decoy image (Figure 5) that compared\nRussian President Vladimir Putin to Adolf Hitler.\n\n\n-----\n\nFigure 5: Anti-Putin image used as a decoy document\n\nIn yet another case, the threat actors used a conference notification from one organization\n(Figure 6a) and modified it to appear as thought it was for an “Islamic Country Muslim\nReligion Conference” (Figure 6b). This document was particularly poorly altered, as the\nregistration form still contained multiple hints to indicate the document was fraudulent (Figure\n6c).\n\nFigure 6a: Original document used as a Psylo decoy\n\n\n-----\n\nFigure 6b: Modified header and contact email in the decoy\n\nFigure 6c: Bottom of the decoy document with replaced email and non-altered date -- a quick\nsearch online shows this to be fraudulent\n\nIn total we have collected over 40 individual decoy documents used in these attacks, far\nmore than we can detail here.\n\nWe are aware of one case where Scarlet Mimic broke from the spear-phishing pattern\ndescribed above. In 2013, the group deployed a watering hole attack, also known as a\nstrategic web compromise to infect victims with their backdoor. The watering hole is an\nattack vector that involves compromising a website that targeted victims are likely to visit in\n[order to infect and gain access to their systems. According to a blog by Websense, threat](http://community.websense.com/blogs/securitylabs/archive/2013/08/16/tibetan-compromise.aspx)\nactors compromised the Tibetan Alliance of Chicago’s website to host malicious code that\nexploited a vulnerability in Internet Explorer (CVE-2012-4969.) Microsoft patched this\nvulnerability in September 2012, suggesting that this watering hole attack used an older\nvulnerability, which aligns with the threat groups continued use of older vulnerabilities in their\nspear-phishing efforts.\n\n## Malware Overview\n\n[First discussed in January 2013 in a Trend Micro whitepaper, FakeM is a Trojan that uses](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-fakem-rat.pdf)\nseparate modules to perform its functionality. FakeM’s functional code is shellcode-based\nand requires another Trojan to load it into memory and execute it. There are a variety of\ndifferent Trojans used to load FakeM, some of which are more interesting than others. In this\n\n\n-----\n\nsection, we will explore the loader Trojans followed by an analysis of the evolution of FakeM\nitself. We end this section with a discussion on tools related to FakeM and used by Scarlet\nMimic.\n\n**Loader Trojans**\n\nFakeM is shellcode-based and therefore requires another Trojan to load FakeM into memory\nand execute its functional code. Threat actors have developed many different loading\nTrojans to load FakeM, some of which are fairly straightforward while others use very clever\ntechniques to avoid detection. Unit 42 tracks the following list of loader Trojans that Scarlet\nMimic has used to execute FakeM:\n\nCrypticConvo\nSkiBoot\nRaidBase\nFakeHighFive\nPiggyBack\nFullThrottle\nFakeFish\nBrutishCommand\nSubtractThis\n\nIt appears that the threat actors include the loader Trojans in some sort of builder application\nthat allows actors to quickly create, configure and deploy payloads to execute FakeM. We\nbelieve this because many samples that execute FakeM have the same exact compilation\ntime but different C2 servers, as seen in the example in Table 1. This suggests the actors\ncompile a single sample and use a builder tool to configure individual samples on demand.\n\nWe used the loader Trojans to provide a general timeline for the development of FakeM\nsamples, as FakeM is shellcode-based and does not contain any usable timestamps. The\ntimestamps in the loader Trojans does not necessarily correspond to the usage of FakeM,\nbut plotting the compile times of the loaders on a timeline shows an interesting trend. The\nscatter plot timeline in Figure 7 shows the known compilation times of the loader Trojans and\nthe FakeM variant that it executed.\n\n\n**SHA256** **Compiled** **Loader**\n**Trojan**\n\n\n**C2 Domains**\n\n\n5182dc8667432d76a\n\n276dc4f864cdfcef3e4\n\n81783ebaf46d3b139\n\n7080b798f4a\n\n\n2013-09-13\n08:02:58\n\n\nCrypticConvo opero.spdns[.]org,\nfirefox.spdns[.]de\n\n\n-----\n\n5dade00db195087aa\n\n336ce190b5fd1c2299\n\n2c49556c623b42a9f7\n\n42d73241a7f\n\n\n2013-09-13\n08:02:58\n\n\nCrypticConvo intersecurity.firewallgateway[.]com\n\n\nTable 1: Two samples sharing a compile time yet contain different C2 domains in their\nconfigurations\n\nFigure 7: Timeline of compilation of loader Trojans associated with FakeM\n\nBased on the timeline, it appears that the actors were actively developing several of the\nloaders at the same time from 2009 until the early months of 2014. After the first quarter of\n2014, it appears that the actors abandoned development of the older loaders in favor of\nFakeFish, BrutishCommand and SubtractThis. This does not mean that actors will not\ncontinue to use the older loaders, but it does suggest that the actors will continue including\nthe newer or freshly developed loaders in updated builder applications.\n\nThe timeline also presents the possibility that the FakeM developers reacted to the release of\nTrend Micro’s FakeM [blog and](http://blog.trendmicro.com/trendlabs-security-intelligence/hiding-in-plain-sight-the-fakem-remote-access-trojan/) [whitepaper. Trend Micro published their analysis of the](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-fakem-rat.pdf)\nFakeM Trojan on January 17, 2013 (marked in Figure 7 by a red line) that discussed the\noriginal variant of FakeM. Shortly after, the original variant of FakeM drops off the timeline in\nfavor of the SSL and Custom SSL variants. It is possible that the FakeM developers saw\ntheir tool was exposed and adapted it to avoid detection for continued use as a payload in\nattacks. We cannot be certain if the developers reacted specifically to Trend Micro’s content,\nas it is possible that they were reacting to the increased antivirus detection rate of their tool\n\n\n-----\n\nthat resulted from the exposure of the tool. Regardless of the specific stimulus, the reaction\nshows that the FakeM threat actors evolved to avoid detection/attribution and to continue\ntheir attack campaigns.\n\nThe timeline does have one noticeable outlier, specifically the FakeHighFive sample\ncompiled in September 2009 that loaded a FakeM SSL sample. We believe this compile time\nis incorrect, as the C2 domain for this sample, specifically press.ufoneconference[.]com, was\nregistered by the threat actor in February 2013. The registration of the C2 domain in\nFebruary 2013 aligns with other compilation times of FakeM SSL, which leads us to the\nconclusion that the September 2009 compilation timestamp was modified and/or inaccurate.\n\nMost of the related loader Trojans, such as CrypticConvo, PiggyBack, FullThrottle,\nFakeHighFive, FakeFish and RaidBase do little more than load encrypted FakeM shellcode\n(either from a PE resource or embedded data), decrypt it, and execute the resulting\nshellcode. Other related loading Trojans, such as SubtractThis, BrutishCommand and\nSkiBoot employ clever techniques worth discussing.\n\n**SubtractThis**\n\nThe SubtractThis loader displays a technique that is quite clever. This loader received its\nname based on a technique it uses to delay before carrying out its main functionality,\nspecifically by requiring the user to hit the minus (“-“) key. SubtractThis carries out this\ntechnique through the following steps:\n\n1. Calls LoadAcceleratorsA function to load the virtual key for the minus character “-“.\n\nExample: LoadAcceleratorsA(hInstance, VK_SUBTRACT);\n2. Calls SetTimer function to set up a callback function that will be called in the event that\n\nthe LB_FINDSTRING Windows message. Example: SetTimer(0, LB_FINDSTRING_,\n10000u, TimerFunc);\n3. Creates a continuous loop that starts by calling GetMessageA to obtain Windows\n\nmessages\n4. Calls TranslateAcceleratorA to check Windows message received is VK_SUBTRACT \"\n\".\n5. Calls the callback function set up in the SetTimer function if the user enters the minus\n\n“-“ key.\n\nThis technique requires user interaction, which makes analysis in sandboxes more difficult.\n\n**BrutishCommand**\n\nThe BrutishCommand loader uses a very interesting method to decrypt the FakeM functional\ncode. The main function in this loader checks the command line arguments passed to it, and\nif there are none present it will obtain a random number between 0-9 and create a new\nprocess using the same executable with this random number as a command line argument.\n\n\n-----\n\nIf the executable has a command line argument, the Trojan subjects the value to a hashing\nalgorithm and compares the hash to 0x20E3EEBA. If the value matches the static hash, the\nexecutable will subject the command line argument to a second algorithm that will produce a\nvalue that the Trojan will use as the decryption key to decrypt the embedded FakeM\nshellcode. It essentially brute forces its own decryption key by rerunning itself over and over\nuntil it runs with the correct value is provided on the command line. Unit 42 had not seen this\ntechnique used by other malware families and it introduces a challenging hurdle when\nattempting to analyze or debug the loader Trojan.\n\n**SkiBoot Loader**\n\nSkiBoot reads the master boot record (MBR) of the system to determine the XOR key that it\nwill use to decrypt the FakeM shellcode. It carries out this functionality by calling the\nReadFile function to read 512-bytes from “\\\\.\\PHYSICALDRIVE0” and specifically uses the\nlast byte of the MBR as the encryption key. The last byte of the MBR is “\\xAA”, or the second\nbyte of “\\x55\\xAA”, which is the boot signature portion of the MBR.\n\nInstead of using ReadFile, one variant of this loader reads the MBR using DeviceIOControl\nusing the ID_CMD control code, and accesses a specific offset to obtain the value that it will\nrotate each byte in the ciphertext within the decryption algorithm. The significance of using\nDeviceIOControl is that the VMware hypervisor responds to this API call with a blank buffer\ninstead of the MBR, whereas the Virtualbox hypervisor returns the MBR correctly. It appears\nthat this loader is specifically using the DeviceIOControl API function as a VMware detection\ntechnique, suggesting that the developers are well versed in the nuances of the VMware\nhypervisor and virtual machine evasion.\n\n### Evolving FakeM: Variants\n\nSince being originally exposed in 2013, authors of FakeM have continuously made changes\nto the FakeM codebase, resulting in multiple variants. Before elaborating on the different\nvariants of FakeM, there are many similarities that remain throughout the various iterations.\nThe architecture has not changed during the evolution of FakeM, as a modular framework\nexists in each variant, as seen in Figure 8. The FakeM main module is responsible for\nlaunching embedded modules, such as a keylogger or for gathering sensitive files. The main\nmodule is also responsible for communicating with its C2 servers and handling commands\nissued by the C2 server.\n\n\n-----\n\nFigure 8: FakeM Architecture\n\nAll FakeM variants initiate communications with its C2 server and check the C2’s response\nfor a command. Also, all FakeM variants share a common command handler with the same\ncapabilities, as seen in Table 2. The limited command set suggests that FakeM’s functionality\nis obtained by additional assembly code provided by the C2 server with the 0x211 command.\nAccording to Trend Micro’s initial analysis on FakeM, threat actors delivered and ran\nadditional code that provided further capabilities to the Trojan, such as the ability to run shell\ncommands, steal passwords, capture the screen and upload files.\n\n**Command** **Description**\n\n0x211 Run assembly code directly from the C2.\n\n0x212 Idle. Attempts to receive another command immediately instead of sleeping\nfor 30 seconds.\n\n0x213 Sets a flag to end the session with the C2. This will force the Trojan to\nreestablish a session with the C2.\n\n0x214 Exit process.\n\nTable 2: Command handler within all variants of FakeM\n\nNow that we have covered the commonalities between FakeM variants, the following\nsections will dive into the specific variants of FakeM. Unit 42 categorizes the different\nvariations of FakeM based on the method used to communicate with the C2 server, which\nhas changed dramatically over the years.\n\n**Original FakeM**\n\nThe original variant of FakeM generates network beacons to its C2 server that begin with a\n32-byte header that in most cases is meant to blend into network traffic generated by\nlegitimate applications. Following this 32-byte header, the original variant of FakeM includes\n\n\n-----\n\ndata encrypted using a custom encryption cipher that uses an XOR key of YHCRA and bit\nrotation between each XOR operation.\n\nThe original variant includes the FakeM discovered and published by Trend Micro in 2013, in\nwhich the authors of FakeM first attempted to evade detection of its C2 communications by\npretending to be generated by legitimate messenger applications, such as MSN and Yahoo!\nmessengers. Figures 9 and 10 show FakeM attempting to resemble MSN or Yahoo!\nMessenger traffic, as the first 32-bytes contain data that resemble legitimate traffic generated\nby these chat programs.\n\nFigure 9: FakeM using fake MSN messenger traffic for C2 communication\n\nFigure 10: FakeM using fake Yahoo! Messenger for C2 communication\n\nIn addition to emulating chat programs, FakeM has also included HTML code within the 32byte header. As you can see in Figure 11, the overall structure of the beacon did not change,\nrather the only differences is the data in the header contains HTML tags. The HTML data in\n[the header led Unit 42 to a whitepaper published by Malware.lu that suggested the MSN,](https://malware.lu/assets/files/articles/RAP002_APT1_Technical_backstage.1.0.pdf)\nYahoo, and HTML versions of the original variant of FakeM all share a common server\napplication that the threat actors use to build samples and control infected systems.\n\n\n-----\n\nFigure 11: FakeM HTML tags in C2 header\n\n[In October 2013, FireEye published a blog about a sample of FakeM that did not use fake](http://www.fireeye.com/blog/threat-research/2013/10/evasive-tactics-terminator-rat.html)\nmessenger or HTML data in the first 32 bytes of the C2 traffic, but instead used four\nrepeating bytes to fill this portion of the packet, as seen in Figure 12. Unit 42 tracks this\nunder the original variant, as it uses the same algorithm to encrypt the data and otherwise\nshares a common structure to the MSN, Yahoo, and HTML versions with the exception of the\nmodification to the first 32 bytes.\n\nFigure 12: FakeM C2 beacon with four repeating bytes\n\n**FakeM SSL**\n\nWhile performing infrastructure analysis on FakeM original variants, we came across shared\ninfrastructure with domains that hosted C2 servers for malware samples that did not match\nthe known FakeM communication protocols. Palo Alto Networks WildFire had analyzed many\nsamples associated with these related C2 domains, all of which communicated with the C2\nserver using secure sockets layer (SSL). To determine the malware family that was\ngenerating this traffic, Unit 42 analyzed these samples and found that the functional code\nwas the same as the original FakeM variant.\n\nThis discovery indicates the authors of FakeM introduced new code to the Trojan in order to\nuse SSL to communicate with its C2 server. The drastic change in C2 channel warranted a\nnew variant name, and we dubbed it “FakeM SSL”. During the analysis of these samples we\ndid not find any operational C2 servers to complete a handshake to establish a SSL session.\nDuring the handshake, the FakeM SSL samples will tell the server it supports 36 different\ncipher suites even though the samples appear to only support one. Unit 42 believes the\ncipher suite within the FakeM SSL variants uses Diffie-Hellman for key exchange and the\nRC4 cipher to encrypt the C2 communications.\n\n**FakeM Custom SSL**\n\nIn July 2015, Scarlet Mimic delivered a spear-phishing email to a branch of the Russian\ngovernment with intentions of installing a payload that was undetected by any antivirus\nvendors on VirusTotal. The high profile target and the lack of antivirus detection prompted\n\n\n-----\n\nUnit 42 to perform an in-depth analysis and found that it is yet another new variant of the\nFakeM Trojan. We also named this variant after it’s communication protocol (FakeM Custom\nSSL.)\n\nThis new variant of FakeM shared the same functional code as its predecessors, but again\nthe communications with the C2 dramatically differed from the other variants.\nCommunications between this variant and the C2 server leverage what Unit 42 believes is\nmodified SSL code, as the code is very similar to the FakeM SSL variant. The code appears\nto use Diffie-Hellman for key exchange and the RC4 algorithm like FakeM SSL; however, the\ninitial packet sent to the C2 server did not contain a “client hello” message, which is required\nto initiate an SSL handshake. Instead, the initial packet sent data as seen in Figure 13.\n\nFigure 13: Hexdump of FakeM custom SSL variant\n\nThis variant of FakeM skips the traditional SSL handshake, which involves an agreement on\na cipher suite to use to encrypt communications. The FakeM code only supports one cipher\nsuite, which makes the cipher suite agreement portion of the SSL handshake irrelevant.\nInstead, FakeM creates a session with its C2 server by exchanging keys. The lack of a valid\nhandshake makes detection of this C2 stream difficult, as the packets sent between the\nTrojan and the C2 to establish this session contain random binary data. Network devices will\nalso be unable to perform any SSL decryption due to the lack of detection and the inability to\ndetermine the cipher suite used to encrypt the data. Figure 14 below provides a visual\ndepiction of the handshake procedure and the subsequent beacon and command messages.\n\n\n-----\n\nFigure 14: Communications between system and C2 server, including the key exchange\n\nThe handshake starts with a key exchange, which the Trojan initiates by creating a 2048byte buffer that it will store its key (128-bytes, followed by null values as seen in Figure 13)\nand sending its key to the C2 server. The C2 will respond with its own key (also 128-bytes,\nfollowed by null values) that the Trojan will store and use to encrypt future communications.\n\nOnce this key exchange is complete, the Trojan acknowledges the receipt of the server’s key\nby sending another 2048-byte packet to the server. To build the acknowledgement packet,\nthe Trojan creates a 2048-byte buffer filled with null values and copies the string “ws32.dll” to\noffset 8 and encrypts the buffer with the server’s key.\n\nAfter sending the acknowledgement packet, the Trojan will gather local system information\nand include it in a beacon to the C2 server. Like the packets sent in the key exchange, the\nbeacon sent by the Trojan to the C2 server is 2048-bytes in length; however, the system\ninformation gathered by the Trojan is only 296 bytes followed by 1752 are null values to fill\nthe 2048 byte buffer. The system information follows the 296-byte structure seen below:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n\nstruct beaconToC2 {\nDWORD static_value_130h;\nCHAR username[128];\nCHAR computername[128];\nDWORD static_value_70000h;\nDWORD os_codepage;\nDWORD campaign_code_1;\nDWORD campaign_code_2;\n};\n\n\n-----\n\nThe Trojan will encrypt this data using the key provided by the C2 and send it to the server.\nThe Trojan will then wait for the C2 to respond, which it will decrypt and parse for FakeM\ncommands. Unit 42 has been unable extract any plug-ins from C2 network traffic; however,\nseveral FakeM custom SSL samples contain embedded plug-ins that run without interaction\nwith the C2 server. Also, Unit 42 was able to extract several modules from the original\nFakeM server application, as seen in Table 3. All of these modules are shellcode-based plugins that would work with the custom SSL variant of FakeM with little to no modification.\n\n**MD5** **Size (bytes)** **Description**\n\n7a1410b2eceb99ec268b50e9371e74c1 3724 Process Plug-ins\n\n092085e76512f071cab12f76ed09b348 2412 Shell Plug-ins\n\n8f4cbb78356cb672bf2566e44315eb96 1768 File Plug-ins\n\n16ab40f84fc47bab2c7874bb3164c5b4 2268 Screen Plug-ins\n\n30337e99631a174d822dd3ea00a5f6cf 2204 Regedit Plug-ins\n\n1f3fbb789bcbe9186a50c4f4db269736 1996 Service Plug-ins\n\n4313d9d5fc6a090e2abc41633cb2c1fd 3196 HostInfo Plug-ins\n\nfe75dff8b86dd8989d2ca00df19d51be 2220 KeyBoard Plug-ins\n\n3e184a7af74905f3d3acbec913252f72 1884 Shell Plug-ins\n\nb59e8751b9f61bd4f4b9b62de8242751 3896 OE Pwd Plug-ins\n\n83ec457cba27e470404c942eb9242eeb 2156 U-Files Plug-ins\n\nTable 3: Modules extracted from the original FakeM variant's server application\n\n**Related to FakeM Original: CallMe**\n\nCallMe is a Trojan designed to run on the Apple OSX operating system. This Trojan was\ndelivered in targeted attacks on Uyghur activists in 2013 and used infrastructure associated\nwith FakeM.\n\nIn February 2013, [AlienVault performed analysis on the CallMe Trojan and found that it is](https://www.alienvault.com/open-threat-exchange/blog/cyber-espionage-campaign-against-the-uyghur-community-targeting-macosx-syst)\nbased on a tool called Tiny SHell, an OSX shell tool whose source code is available on the\nInternet. The Trojan uses AES to encrypt the communication channel its C2 server, which will\nprovide one of three commands to carry out activities on the compromised system, as seen\nin Table 4.\n\nCommand Description\n\n\n-----\n\n1 Get a file from the system and upload it to the C2 server.\n\n2 Put a file on the system from the C2 server. File is saved to a specified\nfilename in <HOME directory>/downloads/.\n\n3 Create a reverse shell to interact with the compromised system.\n\nTable 4: Commands Available in the CallMe OSX Malware\n\nThe infrastructure overlap between FakeM and CallMe involves the fully qualified domain\nname (FDQN) of \"googmail.org\", which was used by both FakeM and CallMe samples. This\nsuggests that not only do these threat actors have the ability to compromise victims running\nthe Microsoft Windows operating system, but they can also target individuals running Apple's\nOSX as well.\n\n**Related to FakeM Custom SSL: Psylo**\n\nDuring infrastructure analysis of FakeM Custom SSL variants, Unit 42 found infrastructure\noverlaps between FakeM and another new, previously unreported Trojan that we named\n“Psylo”. Psylo is a tool that allows threat actors to upload and download files to and from a\ncompromised system, as well as execute commands and applications on the system. The\nname Psylo is an anagram from the mutex created when initially running this payload, which\nis 'hnxlopsyxt'.\n\nPsylo is similar to FakeM in that they are both shellcode-based, and they have similar\nconfigurations and C2 communication channels. As you can see from the following two\nconfiguration structures, Psylo and FakeM have similar configurations with only the array\nlength of the C2 locations being different.\n\n\nstruct psylo_c2_config {char[60]\nc2_host_1;char[60] c2_host_2;char[60]\nc2_host_3;DWORD c2_port_1;DWORD\nc2_port_2;DWORD c2_port_3;};\n\n\nstruct fakem_customssl_c2_config {char[64]\nc2_host_1;char[64] c2_host_2;char[64]\nc2_host_3;DWORD c2_port_1;DWORD\nc2_port_2;DWORD c2_port_3;};\n\n\nFigure 15: Comparison between Psylo and FakeM custom SSL configurations\n\nBoth use SSL to communicate with their C2 servers, and it appears they share common\ncode to carry out the Diffie Hellman key exchange. We compared the Diffie Hellman code\nfrom Psylo with FakeM custom SSL variant and found that they were very similar, but the\nFakeM samples had some of the functionality within sub-functions, which rendered binary\ndiffing between the two Trojans impossible.\n\nAnother slight difference involves how Psylo and FakeM generate random numbers for SSL.\nFakeM uses QueryPerformanceCounter to create a random number, whereas Psylo uses\nCryptGenRandom, both of which generate random numbers 68 bytes long. Interesting\n\n\n-----\n\nenough is that CryptGenRandom calls RtlGenRandom, which uses\nQueryPerformanceCounter along with other system attributes to generate a random number.\n\nWhen communicating with its C2 server, Psylo will use HTTPS with a unique user-agent of\n(notice the lack of a space between \"5.0\" and \"(Windows\"):\n\n_Mozilla/5.0(Windows NT 6.1; WOW64; rv:24.0) Gecko/20100101 Firefox/24.0_\n\nUnit 42 does not consider Psylo another variant of FakeM because Psylo has a command\nhandler that differs dramatically from FakeM. Table 5 shows the Psylo command handler,\nwhich suggests it is less modular and supports more embedded functionality when compared\nto FakeM. It is possible that the threat actors created this Trojan as a standalone alternative\nto FakeM.\n\n**Command** **Description**\n\n0 Idles for 10 seconds.\n\n2 Enumerate all storage devices.\n\n3 Find all files that starts with a particular string (%s*.*).\n\n5 Creates a file to write to, deleting it if it already exists. Combined with 'E'\ncommand to download a file to the system.\n\nE Writes data from C2 to a file opened using the '5' command. Combined with\n'5' command to download a file to the system.\n\n6 Reads a file, which effectively uploads the file to the C2.\n\n7 Delete a specified file.\n\n8 Execute a command using WinExec. Responds to C2 with 's' if successful or\n'r' if unsuccessful.\n\n9 Timestomps. Sets a specified file's timestamps to match that of a system file\nin the System32 directory.\n\nTable 5: Command handler in Psylo that differs dramatically from FakeM\n\n### MobileOrder: Mobile Devices the Next Frontier\n\nAnother discovery we made while researching this blog is an overlap between Psylo\ninfrastructure and a Trojan focused on compromising Android mobile devices. Unit 42 tracks\nthis mobile Trojan as MobileOrder, as the authors specifically refer to commands within the\napp as orders. The connection between FakeM, Psylo, and MobileOrder suggest that Scarlet\nMimic is now expanding their espionage efforts from PCs to mobile devices, which marks a\nmajor shift in tactics.\n\n\n-----\n\nMobileOrder starts by registering itself as device administrator so that a normal user cannot\nuninstall it by simply clicking “uninstall” in settings. It will copy an embedded PDF file from\n“res/raw/rd.pdf” to SD card\n\"/android/9074ca3f18e201c204ec1d852264bb5432644ba46f54f361a146957.pdf\" and\nlaunches the mobile device’s default PDF viewer to display this PDF file, which acts as a\ndecoy document. After displaying the decoy document, the malicious code runs in\nbackground. The malicious code consists of the following parts:\n\n[1. An Android geographical location SDK provided by AMAP.](http://lbs.amap.com/)\n2. Actor developed code that carries out Trojan’s functionality.\n\nThe malware uses the AMAP SDK to get accurate location of infected devices by GPS,\nmobile network (such as base stations), WiFi and other information. MobileOrder acts on\ninstructions provided by its C2 server, which it communicates with over TCP port 3728. All\nC2 communications are encrypted with the AES algorithm using a key generated by\ncomputing five MD5 hashes starting with the key \"1qazxcvbnm\", and adding a salt value of\n“.)1/” in each iteration.\n\nThe C2 server will respond to requests from MobileOrder with commands that the Trojan\nrefers to as “orders”. MobileOrder contains a command handler with functionality that\nprovides a fairly robust set of commands, as seen in Table 6. The first byte of data provided\nby the C2 server is order number, which is followed by the encrypted data that needed to\ncarry out the specific order.\n\n\n**Order**\n**#**\n\n\n**Order Name** **Behaviors**\n\n\n18 Order_Folder_List Upload names and attributes of files under specified\npath\n\n20 Order_Process_List Upload all running processes information\n\n24 Order_HostInfo Upload device information including IMEI, IMSI,\nSIM card serial number, phone number, Android\nversion, device manufacturer, device model, SD\ncard size, network type, device locking status,\ncountry, carrier, time zone, language, install app list,\nbrowser bookmarks, etc.\n\n26 Order_FileDelete Delete specified file\n\n27 Order_DownLoad Download specified file to SD card’s\nAndroid/data/tmp/ directory.\n\n28 Order_UpFile Upload specified file to C2 server\n\n\n-----\n\n51 Order_Sms Upload all received and sent SMS addresses,\ncontent, date, time to C2 server\n\n52 Order_Contact Upload all contacts’ information to C2 server\n\n53 Order_Call Upload all phone calling history information\n\n54 Order_Camera_front_photo Take a picture by device’s front camera\n\n56 Order_SetSleepTime Set sleep time interval\n\n57 Order_SetOnline Stop sleep\n\n58 Order_SetMediaRecorder Start audio recorder in specified time\n\n59 Order_GetLoc Upload information about network operator, MCC,\nMNC, network type, GSM cell location, CID, LAS,\nBSSS, etc. This information can be used to locate\nthe device.\n\n60 Order_GetGps Upload GPS location by AMAP SDK.\n\n61 Order_SetTelRecorderOn Activate phone calling recording\n\n62 Order_SetTelRecorderOff Deactivate phone calling recording\n\n81 Order_Install Install specified APK file. May install silently or\ninstall to system app according to C2 command\ndata\n\n82 Order_Uninstall Uninstall specified app\n\n84 Order_StartApp Launch specified app\n\n85 Order_SendBroadcast Send specified Android broadcast to launch other\napps\n\n86 Order_Shell Execute specified shell commands\n\n87 Order_OpenTrack Start geolocation tracking in AMAP SDK\n\n88 Order_CloseTrack Stop geolocation tracking in AMAP SDK\n\n90 Order_CheckScreen Check whether phone screen is on (or said whether\nthe phone is used by its owner)\n\nTable 6: MobileOrder command handler\n\n### Infrastructure Overlap and Related Tools\n\n\n-----\n\nThere is some infrastructure overlap in the C2 servers used by almost all of the FakeM\nvariants, as well other Trojans such as MobileOrder, Psylo, and CallMe. There are also\ninfrastructure ties between some FakeM variants and older activity using Trojans such as\nElirks, Poison Ivy, and BiFrost, which were used in attacks as old as 2009. The domain\nnames used to host C2 servers are a mix of actor-registered and Dynamic DNS (DDNS,)\nthough most are DDNS. The DDNS domains in turn are linked to a small grouping of ASNs,\nwith one ASN often largely tied to one FakeM variant. Most of the FakeM MSN C2s resolve\nto IP addresses associated with ASN 22781 (RBLHST - Reliablehosting.com). However, we\nfound one MSN sample that shared infrastructure with some FakeM Custom SSL variants.\n\nThere is a similar overlap between FakeM MSN, FakeM HTML, and FakeM SSL. The\nregistrant email xsldmt@xj163[.]cn was used to register several domains used as C2s:\nyourturbe[.]org, websurprisemail[.]com and googmail[.]org. One of these domains was also\nused in the 2013 CallMe activity at the same time it was being used for FakeM MSN\nsamples. The targeting and decoy style also matches with the FakeM activity.\n\nThere is PE resource overlap between some FakeM MSN samples and some samples of the\nBiFrost and Poison Ivy Trojan. This may indicate that the same developer who created the\nparticular BiFrost and Poison Ivy samples was also involved in developing FakeM MSN. Unit\n42 found an overlap between the RT_VERSION resources, which contains the version\ninformation of a Portable Executable (PE) file, shared amongst the three different Trojans.\nThe shared RT_VERSION resource (MD5: 55b7a118203a831cc69b37b785015c54)\ncontained the following information:\n\nComments: Release\nCompanyName: Develop Team\nFileDescription: Utility Application\nFileVersion: 4.0\nInternalName: Utility\nLegalCopyright: Copyright (C) 2008\nLegalTrademarks: DT.Inc\nOriginalFilename: Utility.EXE\nPrivateBuild: 4.0b\nProductName: Utility Application\nProductVersion: 4.0\n\nThe overlap between Elirks, FakeM SSL, Psylo, and MobileOrder exists entirely in their\ncommand and control infrastructure, through domain names and/or IP resolution. Samples of\nthese three used some of the same C2 domains, notably lenovositegroup[.]com,\nufoneconference[.]com, and websurprisemail[.]com, while some resolution overlap includes\n118.193.212[.]12, 210.206.219[.]241, and 59.188.239[.]117. Similarly, some FakeM Yahoo\nC2 domains and FakeM Custom SSL C2 domains also have overlapping IP resolutions,\nnotably 95.154.204[.]198.\n\n\n-----\n\nScarlet Mimic also uses the infamous HTRAN tool on at least some of their C2 servers.\nHTRAN is a proxying tool that allows actors to conceal the true location of their C2 server.\nActors will run HTRAN on a server and configure their malware to interact with that server;\nhowever, the actor will configure HTRAN to forward traffic to another server where the actual\n\n[1]\n\nC2 server exists. For example, the FakeM C2 domain of “muslim.islamhood[.]net” resolved\nto the IP address 59.188.239.117 during analysis, but the server responded with the\nfollowing error message:\n\n_[SERVER]connection to 68.71.35.135:8081 error_\n\nThis error message suggests that the HTRAN application running on 59.188.239.117 was\nunable to connect to the real C2 server hosted at 68.71.35.135.\n\n## Prior Publications\n\nThroughout this report, we have referenced multiple previous blogs and white papers, from\nUnit 42 and others, that have documented elements of this threat in the past. In addition to\nthose documents readers may also find the following publications interesting.\n\n[In 2014, Citizen Lab released a paper on threats against civil society that referenced some of](https://targetedthreats.net/media/2.2%20Extended%20Analysis-Cluster.pdf)\nthese attacks as the “Domain Name Family” or DNF.\n\nKaspersky Lab has produced excellent research on attacks against Uyghur and Tibetan\n[activists. In 2013, they identified an Android Trojan that was also targeting these groups. Our](https://securelist.com/blog/incidents/35552/android-trojan-found-in-targeted-attack-58/)\nanalysis indicates this malware is different from the MobileOrder Trojan described above, but\nthey serve very similar purposes.\n\n[On January 12, 2016, Cylance published a blog linking an exploit document to the group](https://blog.cylance.com/puttering-into-the-future)\nMandiant refers to as APT2 and CrowdStrike as “Putter Panda.” While there does appear to\nbe a small overlap between IP addresses used in attacks from this group and those of\nScarlet Mimic, our team has not concluded that these groups are one in the same.\n\n## Conclusion\n\nThe information discovered by Unit 42 and shared here indicates Scarlet Mimic is likely a\nwell-funded and skillfully resourced cyber adversary. Scarlet Mimic has carried out attacks\nusing both spear-phishing and watering holes since at least 2009 with increasingly advanced\nmalware, and has deployed malware to attack multiple operating systems and platforms.\nDespite the apparent technical acumen, their decoy documents are typically not well crafted\nregardless of the use of the target’s language, though they do use timely subject lures.\n\n[The primary source of data used in this analysis is Palo Alto Networks WildFire, which](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\nanalyzes malware used in attacks from around the globe. The system is also fed with\nmalware samples collected through sharing partnership with other security vendors,\n\n\n-----\n\n[including our partners in the Cyber Threat Alliance. To connect attacks to each other based](http://cyberthreatalliance.org/)\non malware behavior and command and control infrastructure, we relied on Palo Alto\n[Networks AutoFocus threat intelligence. AutoFocus users can view all of the files related to](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html)\nScarlet Mimic and the malware associated with the group using the following links:\n\n[ScarletMimic](https://autofocus.paloaltonetworks.com/#/tag/Unit42.PaloAlto-ScarletMimic)\n[FakeM](https://autofocus.paloaltonetworks.com/#/tag/Unit42.FakeM)\n[Psylo](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Psylo)\n[MobileOrder](https://autofocus.paloaltonetworks.com/#/tag/Unit42.MobileOrder)\n\nPalo Alto Networks customers are protected from Scarlet Mimic attacks through many\ncomponents of our platform.\n\nThreat Prevention signatures for the software vulnerabilities listed in this report are\navailable to detect the exploit files during delivery.\nTraps, our advanced endpoint solution, can prevent the software vulnerabilities listed in\nthis report from being exploited on a Windows host.\nWildFire classified all of the Android and Windows malware described in this report as\nmalicious.\nWe have released anti-malware signatures for the files listed in this report.\nThe domain names used for command and control have been classified as malicious in\nPANDB.\n\n## Scarlet Mimic Indicator Data\n\n### FakeM Custom SSL Samples\n\n12dedcdda853da9846014186e6b4a5d6a82ba0cf61d7fa4cbe444a010f682b5d\n\n33e50c44804d4838dba6627b08210029ff9106fa7fd16cd7255271e153f58b05\n\n3d9bd26f5bd5401efa17690357f40054a3d7b438ce8c91367dbf469f0d9bd520\n\n5182dc8667432d76a276dc4f864cdfcef3e481783ebaf46d3b1397080b798f4a\n\n523ad50b498bfb5ab688d9b1958c8058f905b634befc65e96f9f947e40893e5b\n\n5dade00db195087aa336ce190b5fd1c22992c49556c623b42a9f742d73241a7f\n\n7156f6416e7116e52f9c67f4e716b1dbea17387e61009c7f2825debbbb4dcb73\n\n79aca57905cca1e56b0cedf48a4d81812639c333ee6532d90a074d64b3852d6f\n\n879edf0417c4a9759040b51bf83b2fc918a6644a7c29a52252003a63036aea5c\n\n9b77bbb620f50632fae17c40c7469fc93ffdbc4136a6d893a9a10a44bc435da5\n\na1b7fe2acdb7a5b0c52b7c1960cfad531a7ca85b602fc90044c57a2b2531699f\n\na268cc4931781d1d8094a4f8f596c2de3d662f2581c735b0810ff0ecefe3f859\n\na4abbcfdbf4a6c52349a843eac0396e6d8abb05f1324223980d824629a42ef7a\n\na569f3b02a4be99e0b4a9f1cff43115da803f0660dd4df114b624316f3f63dc6\n\nb4c1e9c99f861a4dd7654dcc3548ab5ddc15ee5feb9690b9f716c4849714b20d\n\nbbdedcfe789641e7f244700e8c028ef51094b66508f503876eb0d6aa16df6aa8\n\n\n-----\n\nc7b9e6b5ab07e6da404af9894c8422d9a0c9586334ddc0a3c1ea6bf23ef97fb2\ncaeace73a17e220634525d2a4117525fd60cb86a06873c86571e89d156f8d72d\ncaf76e19a2681dd000c96d8389afc749e774c083aef09f023d4f42fbc49d4d3d\ne96097826179a66cc3061be0f99f7b55cc9692a6378b5c4364699327823098ab\nf511b13341c9fb4ec9ecfcfe5a5813b964c362d7c709c402ead4e010d857bf6c\nfa08a498da0b31e77669d51a28dff166d84983fa6af693063c08f312fdce93e3\ndf9872d1dc1dbb101bf83c7e7d689d2d6df09966481a365f92cd451ef55f047d\n\n### FakeM SSL Samples\n\n0aab09bf0db30a4be28d19475082fd5e7f75879bf9029fdd8dfc3a1e1f072b0c\n\n2e1472a65a8df43c8bc9b0aff954fbc1a093c4214f6a718a08e1321db83ca683\n\n3209ab95ca7ee7d8c0140f95bdb61a37d69810a7a23d90d63ecc69cc8c51db90\n\n41948c73b776b673f954f497e09cc469d55f27e7b6e19acb41b77f7e64c50a33\n\n4a4dfffae6fc8be77ac9b2c67da547f0d57ffae59e0687a356f5105fdddc88a3\n\n5154511a439bb367b7dd56232eb15281cb6dc4d64ea3a06e7fbbe6b176e385d4\n\n5fae5750797ebe7e7a6a6919a7d66deffb141ec28737bd72a1f7da8edd330b60\n\naa8a302a53bd39b2d2a6e3d8497575e2a5f9757b248e34c8e0821ce9eee5cc32\n\nb3c9bb22fa1bc358dc23a1a4bdaf85ad1add4d812b107b7ab887affbf689933a\n\ncd506679fd32dab16dee6fbf1cfdfe0836e092a4f5669418a199d99c9cd33abd\n\nd1dd4469c7b5c462e5ff2dcef5d22775250e9ebf395f65da624f18ea7144e173\n\nd698008e417da867d02e2f5cdcc80ff92af753dd585fada42fc611c2d7332c3a\n\n### FakeM Original Samples\n\n53af257a42a8f182e97dcbb8d22227c27d654bea756d7f34a80cc7982b70aa60\n\n9adda3d95535c6cf83a1ba08fe83f718f5c722e06d0caff8eab4a564185971c5\n\n53cecc0d0f6924eacd23c49d0d95a6381834360fbbe2356778feb8dd396d723e\n\n631fc66e57acd52284aba2608e6f31ba19e2807367e33d8704f572f6af6bd9c3\n\n7bfbf49aa71b8235a16792ef721b7e4195df11cb75371f651595b37690d108c8\n\n7c9421a4605decfa1b3e22addbca98d86ea757dcd8ff8e075d13228c99618637\n\n202975d10ba417cf441e8f9986d2496807fe39e057d3226ec3b2713f0c218cd8\n\n22e7517d8996e92998eb996416f9d8ef06b3b1c220c1a5d29ccd5aaef7b10c72\n\n435df30d139ccbe5ce4e5ca6fe072e42e96d5ea1efd5317deebce462ecccc7ab\n\n47d9ba5f7bf70c5d2b7a832e070957cc7ebdcfd0a6ee75851df16dc45971ce8a\n\n4a3d0df9fa198a7ebe45db5239d22067e74924b1aace52029b3acc9b51af691e\n\n4d539f638ed476ca08da838cdfbf710dae82b582256d60a009e9d304f6822e65\n\nbe0e8da7e261ec7d08eaa78e79ceb1be47c324b8e142097bf6569f9471c98a4e\n\nc30d03750458bb5f2b03d6bd399ffca6d378a3adb5a74bee3b6ba4b982dbf273\n\ncc7db456825e266849090b6fa95a94ad8c4c717712b610b0d39077af5222f4be\n\nd6d2a77f8ed2fe9fed9ee6dcb4cc0b339ba47a575c717c35815243c752d8f60c\n\ndb8338e6b883fdceaa02c10ad683547a26ae32e0d4641cc24c7bd3b45154abb0\n\ne8e5ecf525c5259651bfbdf1923215729ec67658225eca1b02519f5f6279eacb\n\n\n-----\n\nec4deb761b09ddc706804ef669836cf4b199f1d74b14ad623a6f6cc2f38190b8\n669ce0975c133d54e414dbf1de546aed742e76fe3e60568e2bd4747b7e0f8b70\n0d77f5f1d4c0f02fb88ac33fa365b17d28d1521cea59329ca4b3dd0b7031a60e\n363d9557861fab2d83d04847b967996361e670e571b335c7a535bc6278cba149\n7fb2c37431fd7b05414b134732ba0b29cd7dad17fc176627ee0815aac60c1ab9\n77e4ef9e08f1095487b4fa27492b4c9b8e833f29598f99a0d10f7c85b4254761\na4ffca5f1c3d9c21629fa98a1e91121d954ab9347e86ac3c9613dae61bf30393\n428121c421bf81a0d689014cf21ec7951b0c32add86198e06f7d636981f68755\na195f564aa2fb66db119e2fbec93e319a973e5cf50fbf9fc08bd81f9b7ee8af8\nc1e8ff8ebe3754bc7d14509ef3678edf7551d876d3fa847d07d469c09bceae91\n53238f67ac7e4cc27264efbacc8712bd97a5775feaf633c63adaa0785d038e8a\n508a7cab0f2a69ba66e92e86817a49ecd1b9c8ae11a995147944995fc868dfad\nfb60d14de4dba022f11437845d465a661d0c78d3d097a38770816f06992bf0af\n8da2f9afd914a4318a97f4d74809c0c383f8ebf0d3d6e3d3715efbd71a66a52f\n6fe33c672fd30bba9bbc89dc7d88993d8783382c9f9c510677b1bb068a5f1e51\n6a1c7999b4ba92899d3364fc729d0f052680be5a71dd0f13cbabdb19b82bf858\n5db51f2f7c31de7d165ec4892ae7dcedaa036caedeef718b57953d7935582f04\n27167a9d63f5ddc68a12decb1a1e0a2a29c72fe0681dca2c4f3d169f048a9d38\n6f10c892133b5dac6c40cfe77ca32b42572bc56909481b236080dfc143ef9afd\nde12cd8d11478d17342c60239837c1afcc9fee72df6ffdf9943802640d43f77a\n0f2db64b8283b76d49c9bb272beafab8323f941b6dc3888b42ff02f08634d016\n\n### Psylo Samples\n\n19bbee954ac1a21595e63cb86d1a596236aed353804aec5cb8adfa62e70280d3\n\na9f0bddc3d3516af8355e8ac17309528cd018347e5f56a347c14da0a83b0028a\n\n00bb399c429e0f1f7de751103fe92b5f820d1686d01662a08583b7a94aaed94e\n\n### MobileOrder Sample\n\n03004ccc23033a09532bea7dfa08c8dfa85814a15f5e3aedb924a028bcd6f908\n\n### CallMe Samples\n\n071c34b9701dd84f9590ba899a8af3eeec228a928f2d98a80dbc780e396ee01a\n\nd1f0658bbb15ab2bccc210d7e1f21b96e14ae22de8494ca95b12e182f3d0f693\n\n9ff687a813a5cb5ff10374c86f852534c1aa3e5a221123214bf52b2ff455a5da\n\n8c423506c0c7ebe1e61071374ecf0806463a02a2100b5daa1bd942129ff8a235\n\n91e36e720477146f1a0c050d3bc74bc6683a03e7631317ded3c598a10465dcc8\n\nc981db20d588ba2d0f437b4e5459e7c6763f52a97841450c94591ca28a9a2d69\n\n95dba004f949e44cb447246f3d2420b01db4541d0e4fa7b00d798f38a3d251e4\n\n### FakeM Custom SSL C2 Servers\n\n\n-----\n\naaa123.spdns[.]de\nadmin.spdns[.]org\ndetail43.myfirewall[.]org\neconomy.spdns[.]de\nfirefox.spdns[.]de\nfirewallupdate.firewall-gateway[.]net\nintersecurity.firewall-gateway[.]com\nkaspersky.firewall-gateway[.]net\nkasperskysecurity.firewall-gateway[.]com\nkissecurity.firewall-gateway[.]net\nmail.firewall-gateway[.]com\nnews.firewall-gateway[.]com\nopero.spdns[.]org\nsys.firewall-gateway[.]net\n\n### FakeM SSL C2 Servers\n\naccount.websurprisemail[.]com\n\naddi.apple.cloudns[.]org\n\nbailee.alanna.cloudns[.]biz\n\nbee.aoto.cloudns[.]org\n\nbook.websurprisemail[.]com\n\ndesk.websurprisemail[.]com\n\ndolat.diyarpakzimin[.]com\n\ndolat.websurprisemail[.]com\n\ndolet.websurprisemail[.]com\n\ngithub.ignorelist[.]com\n\nislam.youtubesitegroup[.]com\n\nmareva.catherine.cloudns[.]us\n\nmuslim.islamhood[.]net\n\np.klark.cloudns[.]in\n\nppcc.vasilevich.cloudns[.]info\n\npress.ufoneconference[.]com\n\nvip.yahoo.cloudns[.]info\n\n### FakeM Original C2 Servers\n\n207.204.225[.]117\n\naccounts.yourturbe[.]org\n\naddnow.zapto[.]org\n\nbits.githubs[.]net\n\nclean.popqueen.cloudns[.]org\n\neconomy.spdns[.]eu\n\n\n-----\n\neemete.freetcp[.]com\nemail.googmail[.]org\nfish.seafood.cloudns[.]org\nfreeavg.sytes[.]net\nfreeonline.3d-game[.]com\nibmcorp.slyip[.]com\nlemondtree.freetcp[.]com\nliumingzhen.myftp[.]org\nliumingzhen.zapto[.]org\nn.popqueen.cloudns[.]org\nnews.googmail[.]org\noic-oci.3-a[.]net\npolat.googmail[.]org\nqq.ufoneconference[.]com\nqq.yourturbe[.]org\nsisiow.slyip[.]com\nupdate.googmail[.]org\nuprnd.flnet[.]org\nvideo.googmail[.]org\nwebmail.yourturbe[.]org\nworldwildlife.effers[.]com\nwww.angleegg.ddns[.]us\nwww.angleegg.xxxy[.]info\nwww.googmail[.]org\nyouturbe.co[.]cc\nyycc.mrbonus[.]com\nzjhao.dtdns[.]net\n\n### Psylo C2 Servers\n\napple.lenovositegroup[.]com\n\nmm.lenovositegroup[.]com\n\nftp112.lenta.cloudns[.]pw\n\nwww.gorlan.cloudns[.]pro\n\notcgk.border.cloudns[.]pw\n\n### MobileOrder C2 Servers\n\nziba.lenovositegroup[.]com\n\n### CallMe C2 Servers\n\n\n-----\n\napple12.crabdance[.]com\nupdate.googmail[.]org\napple12.crabdance[.]com\nalma.apple.cloudns[.]org\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-01-24 - Scarlet Mimic- Years-Long Espionage Campaign Targets Minority Activists.pdf"
    ],
    "report_names": [
        "2016-01-24 - Scarlet Mimic- Years-Long Espionage Campaign Targets Minority Activists.pdf"
    ],
    "threat_actors": [
        {
            "id": "8c5c318c-0e71-4184-92bb-d1c28f68a411",
            "created_at": "2022-10-25T15:50:23.692481Z",
            "updated_at": "2025-03-27T02:00:55.525121Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "Scarlet Mimic"
            ],
            "source_name": "MITRE:Scarlet Mimic",
            "tools": [
                "Psylo",
                "MobileOrder",
                "CallMe",
                "FakeM"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "abd17060-62f6-4743-95e8-3f23c82cc229",
            "created_at": "2022-10-25T15:50:23.428772Z",
            "updated_at": "2025-03-27T02:00:55.466186Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "Putter Panda",
                "APT2",
                "MSUpdater"
            ],
            "source_name": "MITRE:Putter Panda",
            "tools": [
                "pngdowner",
                "3PARA RAT",
                "4H RAT",
                "httpclient"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9fc2aed1-c838-41e9-b469-922e7bab6f94",
            "created_at": "2022-10-25T16:07:24.162936Z",
            "updated_at": "2025-03-27T02:02:10.128098Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "Golfing Taurus"
            ],
            "source_name": "ETDA:Scarlet Mimic",
            "tools": [
                "BrutishCommand",
                "CallMe",
                "CrypticConvo",
                "Elirks",
                "FakeFish",
                "FakeHighFive",
                "FakeM",
                "FakeM RAT",
                "FullThrottle",
                "HTran",
                "HUC Packet Transmit Tool",
                "MobileOrder",
                "Psylo",
                "RaidBase",
                "SkiBoot",
                "SubtractThis",
                "Terminator RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a1ce86c2-3efc-4115-a85e-92c5fa461838",
            "created_at": "2022-10-25T16:47:55.561071Z",
            "updated_at": "2025-03-27T02:05:17.261424Z",
            "deleted_at": null,
            "main_name": "BRONZE ELGIN",
            "aliases": [
                "Lotus Blossom ",
                "Lotus Panda ",
                "Lstudio",
                "Spring Dragon ",
                "CTG-8171 "
            ],
            "source_name": "Secureworks:BRONZE ELGIN",
            "tools": [
                " Lzari",
                "Elise"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "468b7acd-895c-4c93-b572-b42f4035b4d4",
            "created_at": "2023-01-06T13:46:38.265636Z",
            "updated_at": "2025-03-27T02:00:02.788514Z",
            "deleted_at": null,
            "main_name": "APT2",
            "aliases": [
                "G0024",
                "PLA Unit 61486",
                "PUTTER PANDA",
                "MSUpdater",
                "4HCrew",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "MISPGALAXY:APT2",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cac03bbf-0c42-470d-951e-0e92656be6cb",
            "created_at": "2023-01-06T13:46:38.463275Z",
            "updated_at": "2025-03-27T02:00:02.840123Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "G0029",
                "Golfing Taurus"
            ],
            "source_name": "MISPGALAXY:Scarlet Mimic",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2fa14cf4-969f-48bc-b68e-a8e7eedc6e98",
            "created_at": "2022-10-25T15:50:23.538608Z",
            "updated_at": "2025-03-27T02:00:55.495551Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "Lotus Blossom",
                "DRAGONFISH",
                "Spring Dragon",
                "RADIUM",
                "Raspberry Typhoon"
            ],
            "source_name": "MITRE:Lotus Blossom",
            "tools": [
                "Elise"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "eaa8168f-3fab-4831-aa60-5956f673e6b3",
            "created_at": "2022-10-25T16:07:23.805824Z",
            "updated_at": "2025-03-27T02:02:09.986613Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "ATK 1",
                "ATK 78",
                "Billbug",
                "Bronze Elgin",
                "CTG-8171",
                "Dragonfish",
                "Lotus Blossom",
                "Operation Lotus Blossom",
                "Red Salamander",
                "Spring Dragon",
                "Thrip"
            ],
            "source_name": "ETDA:Lotus Blossom",
            "tools": [
                "BKDR_ESILE",
                "Catchamas",
                "EVILNEST",
                "Elise",
                "Group Policy Results Tool",
                "Hannotog",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "PsExec",
                "Rikamanu",
                "Sagerunex",
                "Spedear",
                "Syndicasec",
                "WMI Ghost",
                "Wimmie",
                "gpresult"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "87a20b72-ab72-402f-9013-c746c8458b0b",
            "created_at": "2023-01-06T13:46:38.293223Z",
            "updated_at": "2025-03-27T02:00:02.796483Z",
            "deleted_at": null,
            "main_name": "LOTUS PANDA",
            "aliases": [
                "Lotus BLossom",
                "Spring Dragon",
                "ST Group",
                "DRAGONFISH",
                "BRONZE ELGIN",
                "ATK1",
                "G0030",
                "Red Salamander"
            ],
            "source_name": "MISPGALAXY:LOTUS PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4b066585-3591-4ddd-b3cc-f4e19e0e00ef",
            "created_at": "2022-10-25T16:07:24.086915Z",
            "updated_at": "2025-03-27T02:02:10.103556Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "APT 2",
                "Group 36",
                "Putter Panda",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "ETDA:Putter Panda",
            "tools": [
                "3PARA RAT",
                "4H RAT",
                "4h_rat",
                "MSUpdater",
                "httpclient",
                "pngdowner"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535736,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1653697986,
    "ts_modification_date": 1653697986,
    "files": {
        "pdf": "https://archive.orkl.eu/e820158698121f515887f51abe7aaac8324266b8.pdf",
        "text": "https://archive.orkl.eu/e820158698121f515887f51abe7aaac8324266b8.txt",
        "img": "https://archive.orkl.eu/e820158698121f515887f51abe7aaac8324266b8.jpg"
    }
}