{
    "id": "51526bd6-cb86-4cd3-912a-388c126d7987",
    "created_at": "2023-01-12T15:05:15.152263Z",
    "updated_at": "2025-03-27T02:06:10.506608Z",
    "deleted_at": null,
    "sha1_hash": "800369aa7608745e2b04413bd5901e5efe63c698",
    "title": "2022-01-18 - Dozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack",
    "authors": "",
    "file_creation_date": "2022-05-29T10:40:15Z",
    "file_modification_date": "2022-05-29T10:40:15Z",
    "file_size": 604050,
    "plain_text": "# Dozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack\n\n**[zetter.substack.com/p/dozens-of-computers-in-ukraine-wiped](https://zetter.substack.com/p/dozens-of-computers-in-ukraine-wiped)**\n\nKim Zetter\n\nShare this post\n\nDozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack\n\nzetter.substack.com\n\n## Dozens of computers at two government agencies in Ukraine are now confirmed to have been wiped by malware known as WhisperGate. The web sites of the two agencies were also defaced last week.\n\n[Kim Zetter](https://substack.com/profile/9134384-kim-zetter)\nJan 18\n\n8\n\nShare this post\n\nDozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack\n\nzetter.substack.com\n\n\n-----\n\nScreenshote of defacement message that was placed on government web sites last week.\nDozens of systems at two government agencies in Ukraine were wiped with a destructive\ntool that Ukraine now believes was part of a coordinated attack last week against systems in\nUkraine, an official says.\n\nThe tool, called WhisperGate, wiped seven workstations at one government agency in\nUkraine and wiped a combination of workstations and servers at the second agency.\n\nThe web sites of the same two agencies were also defaced last week in an operation that\ntargeted at least 70 government web sites, and the official says the government now\nbelieves the defacements and wiper attack were part of the same multi-pronged operation.\n\n“They were timed,” says Victor Zhora, deputy director of Ukraine's State Services for Special\nCommunication and Information Protection. “It happened the same day and apparently at the\nsame time [at both agencies]…. The probability of coincidence is much lower than if it\nhappened only in one institution.”\n\n\n-----\n\nHe said it s still unclear what level of coordination occurred between the attackers conducting\nthe two operations but said the evidence connecting the two is both technical and\nintelligence in nature, though he wouldn’t elaborate on either.\n\nZhora wouldn’t identify the two agencies struck by the wiper but said that while they are\n“rather important” agencies, they are not critical.\n\n“What we consider critical is systems that could significantly influence the whole political and\neconomic situation in Ukraine in case of loss,” he said. “But these two cases are not critical\nconsidering what could be the loss if any register or any state-scaled database [were lost].”\n\nLast Thursday dozens of government agencies in Ukraine were targeted in a web site\ndefacement campaign in which hackers replaced the main web page at some of the sites\nwith a politically charged message. On the same day the defacements occurred, Microsoft\ndetected destructive wiper malware on dozens of systems belonging to several entities in\nUkraine — including some whose web sites were defaced. Wipers delete or overwrite\nimportant system files, rendering systems unable to boot up or otherwise operate.\n\nMicrosoft never revealed how many entities were infected with the wiper, though someone\nfamiliar with the investigation told me just a “handful.” Microsoft also didn’t say if any systems\ninfected with the WhisperGate wiper were actually damaged by the wiper. The news today is\nthe first confirmation that the wiper was activated on the systems of government agencies.\n\nThe WhisperGate wiper works in three stages. In the first stage, the hackers load\nWhisperGate onto a system and the malware overwrites the portion of the hard drive\nresponsible for launching the operating system when the machine is booted up. It overwrites\nit with a ransom note demanding Bitcoin worth $10,000, though the message doesn’t\nimmediately appear on machines.\n\n“Your hard drive has been corrupted,” the note reads. “In case you want to recover all hard\ndrives of your organization, You should pay us $10k via bitcoin wallet. We will contact you to\ngive further instructions.\"\n\nIn the meantime, the second and third stages occur — the malware has reached out to a\nDiscord channel and pulled down another malicious component, which then corrupts\nnumerous other files on the infected system. The attackers execute the operation by forcing\nthe machine to power down. When it turns on again, the ransom message appears\nonscreen. The user sees the message and believes they just need to pay money to get the\nsystem decrypted — when in fact their system has already been rendered inoperable and\nunrecoverable.\n\nZhora said that the master boot record — the portion of the hard drive that is responsible for\nlaunching the operating system on a machine when it is booted up — was overwritten on the\ndozens of systems at the two government agencies now confirmed to have been affected by\nthe wiper and they also had data destroyed on the machines\n\n\n-----\n\nIt wasn t clear last week if the defacements and wiper operation were related, eventhough\nthe timing of the two operations suggested they were.\n\nIf the defacements and wiper were meant to be coordinated and simultaneous it suggests\nthat something might have gone wrong with the coordination. Generally hackers siphon data\nfrom machines before wiping them, then deface the machines or web site with a public\nmessage intended to taunt the victim and warn them that stolen data will soon be published.\n\nIn this case, the web sites of agencies were defaced with such a message warning that data\nhad been destroyed and would soon be made public, but then nothing else appeared to\nhappen, and web servers in themselves do not store the kind of information that is stored on\nemail servers or internal networks.\n\nTwo days later, news broke that a wiper had also been found on the systems of dozens of\nsystems belonging to several entities in Ukraine, including some of the same agencies\nwhose web sites had been defaced. But it was never clear if the wiper had been activated on\nthose systems or was simply sitting dormant on them waiting to be activated by the\nattackers. If the latter, this suggested that the coordination had perhaps failed and that the\nweb sites had been defaced prematurely. The news today that workstations were wiped the\nsame day the defacements occurred suggests the coordination may have been more\nsuccessful than previously believed.\n\nIn addition to these two government agencies, the Ukrainian company Kitsoft also confirmed\nthat it found the WhisperGate malware on some of its systems. Kitsoft develops and\nmaintains web sites and at least 50 of the 70 sites targeted for defacement last week were\n[Kitsoft customers. Investigators eventually determined that Kitsoft had been compromised,](https://www.cnn.com/2022/01/14/europe/ukraine-cyber-attack-government-intl/index.html)\nwhich allowed the hackers to gain access to Kitsoft’s administrator panel and use the\ncompany’s credentials to deface customer web sites.\n\nKitsoft spokeswoman Alevtina Lisniak confirmed to Zero Day today that the WhisperGate\nwiper was also found on some of their systems and that it had overwritten the master boot\nrecords on those machines. The company took the systems down to rebuild from scratch..\n\n“We discovered some overwritten [master boot records] and then stopped the infrastructure\nto prevent further attack development,” Lisniak writes. This suggests that only the wiper’s\nfirst stage may have been activated, but this is still unclear.\n\n_Update: 1.19.22 To clarify that Microsoft found the wiper on dozens of systems, but those_\n_systems were at just a handful of entities._\n\nFor a full description of what occurred last week, see:\n\n[What We Know and Don’t Know about the Cyberattacks Against Ukraine - (updated)](https://zetter.substack.com/p/what-we-know-and-dont-know-about)\n\n**Also related:**\n\n\n-----\n\n[Inside the Cunning, Unprecedented Hack of Ukraine s Power Grid](https://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/)\n\n[The Ukrainian Power Grid Was Hacked Again](https://www.vice.com/en/article/bmvkn4/ukrainian-power-station-hacking-december-2016-report)\n\n_If you like this story, feel free to share with others._\n\n[Share](https://zetter.substack.com/p/dozens-of-computers-in-ukraine-wiped?utm_source=substack&utm_medium=email&utm_content=share&action=share)\n\n_If you’d like to receive future articles directly to your email in-box, you can also subscribe:_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-18 - Dozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack.pdf"
    ],
    "report_names": [
        "2022-01-18 - Dozens of Computers in Ukraine Wiped with Destructive Malware in Coordinated Attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535915,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653820815,
    "ts_modification_date": 1653820815,
    "files": {
        "pdf": "https://archive.orkl.eu/800369aa7608745e2b04413bd5901e5efe63c698.pdf",
        "text": "https://archive.orkl.eu/800369aa7608745e2b04413bd5901e5efe63c698.txt",
        "img": "https://archive.orkl.eu/800369aa7608745e2b04413bd5901e5efe63c698.jpg"
    }
}