{
    "id": "51560613-19f2-469e-b426-aadd27d2988f",
    "created_at": "2023-01-12T15:00:04.614126Z",
    "updated_at": "2025-03-27T02:05:54.93517Z",
    "deleted_at": null,
    "sha1_hash": "e63088fde2b0ebd6734388b770c2aaff0c4d0102",
    "title": "2019-05-09 - Github Repository of AbSent-Loader",
    "authors": "",
    "file_creation_date": "2022-05-29T01:37:56Z",
    "file_modification_date": "2022-05-29T01:37:56Z",
    "file_size": 124200,
    "plain_text": "# AbSent-Loader\n\n**github.com/Tlgyt/AbSent-Loader**\n\nyatt-ze\n\nExample Loader to be used as a learning resource for people interested in how commercially\navailable malware is made.\n\n[Join the discussion on discord: https://discord.gg/AMs6DA9](https://discord.gg/AMs6DA9)\n\n## Definition of a loader\n\nA \"Loader\" or \"Dropper\" is a type of malware not dissimilar to a botnet, usually built on the\nsame C&C architecture they lack some of the more advanced features a fully featured botnet\nmight have and instead try to be as lightweight as possible to be used as the 1st stage in an\nattack.\n\nMany commercially available loaders extend their lifetime on the black market by going\nmodular, providing updates and plugins that extend the loaders capability and provide the\nseller a larger revenue stream by selling the plugins separately from the main \"Base\" bot,\nthese usually include but not limited too:\n\nDDOS Functions\nPassword Stealing\nHRDP\nWeb Injects\nKeyloggers\n\n\n-----\n\n## C&C Architecture\n\nMany loaders and botnets, id say 90% nowadays use a PHP web panel for controlling the\nnetwork, reasons being its easy to setup, provides a modest amount of security if done\nproperly, and it looks pretty, allowing for graphs and maps of bots, nice pretty tables of\nexecuting tasks and client info, all makes a PHP panel for the C&C architecture a nice\noption, especially good for marketing (People like pretty things).\n\nUnfortunately, or fortunity depending on the color of your hat, these panels are usually rather\ninsecure, vulnerable to SQL injection and XSS, allowing for easy takeovers and shutdowns.\nSo easy I've knowen people to exclusively build their botnet from others vulnerable panels,\nstealing all their bots and running a \"Botkiller\", basically an antivirus built into the client\ndesigned to detect and kill any competing malware on the infected system.\n\nThe architecture of these Php based control panels is very simple, they have a PHP file\nusually called something like \"gate.php\" or something not so obvious like \"store.php\", this\npage is the contact point for the client. The client will send a `POST request (Some use`\n```\nGET ) to the page containing the clients' information, and the page will respond with a\n\n```\ncommand to execute. The way the commands are sent and phrased are different for every\nvariant but is usually done with `JSON or plain text. If done properly the page will verify the`\nclient is legit and make sure the supplied data isn't an XSS or an SQLi attack, and add it to\nthe panel's database.\n\n## The Standard Client Loop\n\nThe client is what runs on an infected system, its job is simple, stay hidden and execute\ntasks.\n\nOn executing the client will try to \"Make itself at home\" that is, become persistent in the\nsystem, setting up defences to stop itself being killed and making sure its run when the\nsystem turns on again, it will also attempt to collect as much information about the computer\nit can, what version of the Operating System its running on, What privileges it has, the\nusername, etc. It then gathers all this Information and sends it off to the C&C, receiving any\ntasks back and acting upon them. Some clients will try to be clever about the way it goes\nabout this, commonly waiting for a while before actually executing anything to seem less\nsuspicious.\n\nAfterwards we enter the \"loop\" the client will go dormant for a set amount of time, usually\naround the 5 minute mark before reaching out for any new commands and letting the C&C\nknow its still alive. Reason being to lighten the network load of the server and the infected\nsystem, the bigger the network, usually the longer the wait.\n\n\n-----\n\n_Disclaimer: I do not accept responsibility for the misuse of provided code blah blah blah don t_\n_be a cunt_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-09 - Github Repository of AbSent-Loader.pdf"
    ],
    "report_names": [
        "2019-05-09 - Github Repository of AbSent-Loader.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535604,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653788276,
    "ts_modification_date": 1653788276,
    "files": {
        "pdf": "https://archive.orkl.eu/e63088fde2b0ebd6734388b770c2aaff0c4d0102.pdf",
        "text": "https://archive.orkl.eu/e63088fde2b0ebd6734388b770c2aaff0c4d0102.txt",
        "img": "https://archive.orkl.eu/e63088fde2b0ebd6734388b770c2aaff0c4d0102.jpg"
    }
}