{
    "id": "5184ccf9-7fff-4fdd-91fa-1cbaa2832713",
    "created_at": "2023-01-12T15:03:14.150102Z",
    "updated_at": "2025-03-27T02:09:55.08515Z",
    "deleted_at": null,
    "sha1_hash": "9d2672e4aa5554d7b3f222f5429dcdef2a93d0c4",
    "title": "2019-01-03 - LOLbins and trojans- How the Ramnit Trojan spreads via sLoad in a cyberattack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:01:52Z",
    "file_modification_date": "2022-05-28T19:01:52Z",
    "file_size": 2665487,
    "plain_text": "# LOLbins and trojans: How the Ramnit Trojan spreads via sLoad in a cyberattack\n\n**cybereason.com/blog/banking-trojan-delivered-by-lolbins-ramnit-trojan**\n\nWritten By\nCybereason Nocturnus\n\nJanuary 3, 2019 | 13 minute read\n\n**Research by Eli Salem, Lior Rochberger, & Niv Yona**\n\n\n-----\n\n## Introduction\n\n[Cybereason’s Nocturnus and Active Hunting Service are two teams dedicated to easily detect threats on demand and proactively seek out](https://www.cybereason.com/services/active-hunting)\nmalicious activity. The Ramnit Trojan research is a result of the Cybereason platform's capabilities presenting themselves during a threat\nhunting demonstration to one of our customers’ security teams. We uncovered a severe threat to the customer while onboarding the\ncustomer onto our Active Threat Hunting Service. The customer in question was infiltrated by a variant of the Ramnit banking Trojan.\nAlthough banking trojans typically target individuals to steal bank account credentials, the Ramnit banking Trojan can, and has, targeted\nusers within organizations.\n\n_[Want to hear about more trojans? Check out our webinar on the Ursnif trojan.](https://www.cybereason.com/new-ursnif-variant-webinar)_\n\n[In Proofpoint’s recently published report, sLoad and Ramnit pairing in sustained campaigns against the UK and Italy, they explain how](https://www.proofpoint.com/us/threat-insight/post/sload-and-ramnit-pairing-sustained-campaigns-against-uk-and-italy)\n[threat actor TA554 used the sLoad dropper to distribute the Ramnit banking Trojan to target financial institutions across Italy, Canada, and](https://securityintelligence.com/news/ramnit-infects-more-than-100000-machines-in-two-months/)\nthe UK. Cybereason detected a similar evasive infection technique used to spread a variant of the Ramnit banking Trojan as part of an\nItalian spam campaign.\n\nThe Ramnit Trojan is a type of malware able to exfiltrate sensitive data. This kind of data can include anything ranging from banking\ncredentials, FTP passwords, session cookies, and personal data. Leaking this information can easily destroy user trust in a business, and\nin the process lose customers and ruin reputations. Luckily, our onboarding was timely, and was able to detect the trojan just as it was\n[beginning to exfiltrate information. Our customer used our remediation tool immediately to stop the exfiltration in its tracks.](https://www.cybereason.com/blog/cybereason-guided-remediation-a-tailored-approach-for-enhanced-incident-response)\n\n[One of the main techniques used to minimize detection, as observed by our services team, was living off the land binaries (LOLbins). In](https://lolbas-project.github.io/)\nthis research, we investigate this attack, its use of sLoad, and its adoption of LOLbins. The attackers used a combination of built-in\n[Windows products including PowerShell,](https://docs.microsoft.com/en-us/powershell/) [BITSAdmin, and](https://docs.microsoft.com/en-us/windows/desktop/bits/bitsadmin-tool) [certutil to avoid detection.](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil)\n\nUsing a legitimate native windows process to download malware is not novel in the security world. In fact, using legitimate products to\n[perform malicious activities is steadily gaining in popularity. However, using LOLbins in this spam campaign is an intriguing, and, as you](https://www.cybereason.com/2019-predictions-report)\nshall see, effective way to minimize the detection of the Ramnit banking Trojan.\n\nWe divided the attack into different phases, which we then mapped to the MITRE ATT&CK knowledge base.\n\n## Phase one: Initial Infection and sLoad Payload Downloader\n\n**Spearphishing Link:** **[MITRE Technique T1192](https://attack.mitre.org/techniques/T1192/)**\n\n\n-----\n\nInitially, the target receives a spearphishing email as part of an Italian spam campaign. This spam campaign specifically focused on Italian\nusers. The email contains a link to a compromised website (https://levashekhtman[.]com/assistenza-amministrativa/documento_aggiornato-FMV-61650861)._\n\n**Download Additional Payload**\n\nOnce the target connects to the compromised website, the site initiates the download of an additional payload. This payload is a\ncompressed ZIP file (documento-aggiornato-FMV-61650861.zip(B564ED3DE7A49673AC19B6231E439032AE6EAA68)). The ZIP file\ncontains a non-malicious .jpg file and a .lnk shortcut file that has the nondescript icon of a typical Windows folder.\n\n_The contents of the zipped file._\n\n**Shortcut Modification:** **[MITRE Technique T1023](https://attack.mitre.org/techniques/T1023/)**\n\nWhen the target opens the .lnk shortcut file, a CMD spawns a PowerShell with obfuscated commands.\n\n**Powershell Obfuscation:** **[MITRE Technique T1027](https://attack.mitre.org/techniques/T1027/)**\n\nThe PowerShell spawned by opening the .lnk file subsequently downloads the sLoad dropper. sLoad is a PowerShell-based banking\nTrojan downloader that features reconnaissance, information gathering, screen capturing, and C2 abilities.\n\nIt starts the download by executing a PowerShell command that creates an empty .ps1 file (oyCZpsgNEFvQnW.ps1, SHA1:\n_B6E3C4A528E01B6DE055E089E3C0DD2DA79CFCBE) in the %AppData% folder._\n\n_The ZIP file uses the .lnk that links to a PowerShell with a malicious obfuscated encoded command._\n\n\n-----\n\n_The malicious PowerShell script uses several escape characters such as “, * in order to avoid detection. This technique is a JavaScript_\n_language exploitation that is able to bypass antivirus product defenses._\n\n**BITSAdmin Abuse:** **[MITRE Technique T1197](https://attack.mitre.org/techniques/T1197/)**\n\nThe malicious PowerShell script uses BITSAdmin to download sLoad from bureaucratica[.]org/bureaux/tica and write it to the empty .ps1\nfile it created previously. BITSAdmin is a built-in Windows command-line tool for downloading, uploading, and monitoring jobs. Once the\nmalicious PowerShell script is done writing sLoad into the .ps1 file, the file is executed.\n\n**[Persistence Using Scheduled Task: MITRE Technique T1053](https://attack.mitre.org/techniques/T1053/)**\n\nThe malicious PowerShell script creates a scheduled task (AppRunLog). This task executes a malicious VBScript (vmcpRAYW.vbs).\n\n### sLoad Analysis\n\n\n-----\n\n**Anti-debugging and Analysis Techniques**\n\nThe .ps1 file (oyCZpsgNEFvQnW.ps1) contains sLoad and is essentially a malicious PowerShell script. The script is able to check to see if\nit is being debugged or run in a test environment by looking at the names of running processes and comparing them to a list of analysis\ntools, including:\n\nSysInternals Tools\nPacket Sniffing Tools\nDebuggers and Disassemblers\n\nThe malicious sLoad script also contains a key (1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16) that will be used to encrypt and decrypt the main\npayload.\n\n_oyCZpsgNEFvQnW.ps1 checks security products and contains the payload key._\n\nThe malicious sLoad script contains two encrypted files:\n\nConfig.ini (82C3A3E1317CD5C671612430DDDED79DF9398BCC)\nWeb.ini (ABC14EB06235A957D3AD66E359DC0B1F1FDFAB8A)\n\n_oyCZpsgNEFvQnW.ps1 contains encrypted Config.ini & Web.ini files._\n\nIt is interesting to note that the malicious sLoad script uses the computer’s GUID as the directory for all of its files and as part of the\npayload name.\n\n_oyCZpsgNEFvQnW ps1 reads the computer’s GUID_\n\n\n-----\n\nsLoad ensures persistence by creating a scheduled task that allows sLoad to download the payload repeatedly.\n\n_oyCZpsgNEFvQnW.ps1 guarantees persistence using a scheduled task._\n\nWhen the scheduled task runs, it spawns a malicious VBScript with a random name (vmcpRAYW.vbs)\n(AEABE11F0496DA7E62501A35F4F03059F783C775). The script executes a .ps1 file with the same name (vmcpRAYW.ps1)\n(41FB1C6542975D47449EF6CB17B26CA8622CF9AE) that decrypts config.ini with the key from the malicious sLoad script\n(oyCZpsgNEFvQnW.ps1). The decryption subsequently executes the sLoad payload.\n\n_Execution of the wscript and the .ps1 in the Cybereason UI._\n\n## Phase Two: Decryption of config.ini and Execution of the sLoad Payload\n\n**Execution**\n\nOnce config.ini is decrypted and executed, the second phase of sLoad takes place. The decrypted config.ini manages the functionality of\nthe encrypted web.ini and contains the following instructions of the malware: screen capturing, collecting information about the\n**infected machine, and downloading and uploading data. As part of its LOLbins technique, the payload maliciously executes using**\n[legitimate processes, including BITSAdmin & certutil.](https://github.com/api0cradle/LOLBAS/blob/master/OSBinaries/Bitsadmin.md)\n\n\n-----\n\n_Analyzing the decoded Config.ini file, including getting data from web.ini and using the same key._\n\nThe decoded web.ini contains the list of malicious URLs, delimited by ‘,’ . The deobfuscated Config.ini splits the URLS by ‘,’ and runs\nBITSAdmin in the command line for each URL in the file.\n\n_Executing the commands from Config.ini in order to decode web.ini._\n\n_web.ini content, which includes malicious URLs as a combination of 2 different web.ini files._\n\nAs mentioned above, sLoad creates persistence through a scheduled task. Interestingly, sLoad domains stored in web.ini change every\ntime sLoad is downloaded by the scheduled task. This ability to self-update allows sLoad to be more stealthy and nullifies defense tactics\nlike detection by blacklisting domains.\n\n**Discovery & Internal Reconnaissance**\n\nAs part of the sLoad attack lifecycle, it collects information about the infected machine through multiple different attack vectors.\n\n[sLoad attempts to collect information regarding Win32_LogicalDisk, a data source that resolves to a local storage device on a computer](https://docs.microsoft.com/en-us/windows/desktop/cimwin32prov/win32-logicaldisk)\nsystem running Windows. It also attempts to extract information about network shares and physical devices by using the NET VIEW\ncommand.\n\n_sLoad collecting information about the hardware and the network._\n\nThe NET VIEW command shows a list of computers and network devices on the network. This is a legitimate command that can be used\nfor internal reconnaissance and system information discovery. Using this command, attackers may attempt to get detailed information\nabout the operating system and hardware, including version number, patches, hotfixes, service packs, and architecture, all through a\nlegitimate command.\n\nsLoad uses the NET VIEW command and saves the output to a file as part of its reconnaissance activities.\n\n\n-----\n\n_NET VIEW command as detected in the Cybereason platform._\n\nAfter obtaining information about the victim’s network, the payload collects additional information about the local operating system and\nprocessor.\n\n_sLoad checking the local operating system and processor._\n\n**Data Exfiltration**\n\nThe main method sLoad uses to collect information is via screen capturing. It continues to capture the screen throughout its entire\nexecution, and exfiltrates the data using BITSAdmin and certutil.\n\n_The sLoad main screen capturing function._\n\n[One of the most unique ways sLoad is able to steal information is in the way it searches and exfiltrates .ICA files. ICA is a settings file](https://fileinfo.com/extension/ica)\nformat developed by Citrix Systems, a multinational software company that provides server, application, and desktop virtualization.\nIndependent Computing Architecture (ICA) file types are used by Citrix Systems application servers to configure information between\nservers and clients. ICA files are a CITRIX connection profile used to store relevant connection details including username, passwords,\nand server IP addresses. If they contain all of this information, they can be used to authenticate and control a Citrix remote desktop.\n\nsLoad attempts to extract .ICA files from the infected machine, with a particular focus on files in Outlook's user directory. It stores the\ninformation in a file (f.ini), and eventually sends the information to a remote C2 server using BITSAdmin.\n\n\n-----\n\n_Searching and storing .ICA files._\n\n**How sLoad Manipulates BITSAdmin and certutil to Download the Ramnit Banking Trojan**\n\nsLoad spawns a PowerShell script that uses BITSAdmin to download an encoded .txt payload from several malicious domains, including:\n\nPackerd[.]me\nSmokymountainsfineart[.]com\nReasgt[.]me\nimperialsociety[.]org.\n\nAll of these domains were observed within the attack frame days.\n\n_The BITSAdmin command line._\n\n[certutil.exe is a command-line program that is installed as part of Certificate Services. An attacker can use this built-in Windows utility to](https://docs.microsoft.com/en-us/windows/desktop/seccrypto/certificate-services)\nbypass the application locker and download and decode malicious files.\n\nThe encoded payloads were decoded into a malicious executable using certutil.\n\n_certutil decodes the .txt file._\n\nAfter being decoded by certutil, the malicious executable ( _UWBwKlrFyeTXGjtV.exe) (ae5b322b7586706015d8b3e83334c78b77f8f905)\nis executed by PowerShell. This is the Ramnit banking Trojan.\n\n_PowerShell executes the Ramnit executable._\n\nsLoad creates five .jpg files named [ScreenCapture +<incremented number>] using the Get-ScreenCapture function and saves them to\nthe folder created by the malware. It then continues to exploit BITSAdmin by using it to upload all five .jpg files to the malicious C2 server.\n\n_sLoad takes six screen capture images._\n\n\n-----\n\n_sLoad screen capture function creating five images._\n\nAfter the executable is initiated, the malware hides its tracks using CMD with the del **command to delete three files, including the**\nencoded and decoded payloads, and the Ramnit banking Trojan executable (( _UWBwKlrFyeTXGjtV.txt), ( _UWBwKlrFyeTXGjtV_1.txt),\n_and_ _( _UWBwKlrFyeTXGjtV.exe)) ._\n\n_sLoad hides evidence of the Ramnit executable._\n\nThe full chain of instructions displayed in the Cybereason platform can be seen in the sLoad payload deobfuscated code (config.ini).\n\n_The sLoad deobfuscated chain of actions._\n\nIn addition to downloading an executable, sLoad includes a secondary, fileless attack vector that executes a PowerShell command from\nremote servers.\n\n_sLoad’s fileless command execution._\n\n## Phase Three: The Ramnit Banking Trojan\n\n\n-----\n\n**Ramnit Analysis**\n\nThe payload of the BITSAdmin download (<GUID>_UWBwKlrFyeTXGjtV.exe, SHA1:ae5b322b7586706015d8b3e83334c78b77f8f905)\n[was an unknown version of the Ramnit banking Trojan at the time of initial analysis. It was first submitted to VirusTotal after execution on](https://www.virustotal.com/en/file/f84cae61beca13e5746f0bac14b103a94a55cded4a5bbac07dd2675d35d5ac5f/analysis/)\nthe machine, not to Cybereason.\n\nOn execution, the Ramnit banking Trojan initiates its malicious activity through one of its persistence techniques. It creates scheduled\n[tasks through the COM API that uses the](https://docs.microsoft.com/en-us/windows/desktop/wmisdk/com-api-for-wmi) [WMI process](https://docs.microsoft.com/en-us/windows/desktop/wmisdk/wmi-tasks--processes) [wmiprvse.exe. This process ensures the author of the task will be Microsoft,](https://www.howtogeek.com/332838/what-is-the-wmi-provider-host-wmiprvse.exe-and-why-is-it-using-so-much-cpu/)\n**adding legitimacy to the operation. This is a LOL technique that ensures the Ramnit banking Trojan will stay hidden.**\n\nThe Ramnit banking Trojan loads the COM API task module and initiates a scheduled task (mikshpri).\n\n_Ramnit executable loads the COM API task module._\n\n_The scheduled task using the WMI process._\n\nAfter the tasks are scheduled, wmiprvse.exe spawns CMDs that create three files:\n\nAn empty .txt file.\nA VBS file.\nA PS file.\n\n_WMI spawn command lines that creates three files. (as seen in the Cybereason attack tree)_\n\n_WMI creates three files through the command line_\n\n\n-----\n\nThese three files are saved to the %AppData% folder and have names that depend on the computer they are executed on. After the files\nare created, the Ramnit banking Trojan executable writes a malicious script to the empty .txt file. This .txt file contains the additional\nRamnit payload that will be loaded reflectively to the targeted processes\n\n**Activation of the Scheduled Task**\n\nAfter the three files are created and the .txt file is populated, the scheduled task (mikshpri) executes a VBScript (mikshpri.vbs,\n**_[SHA1:21B729CEEE16CF3993D8DDBFEEEBB4F960B46F09) using wscript.](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wscript)_**\n\nThe VBScript executes the PowerShell script (phnjyubk.ps1) in the same folder. The .ps1 file decodes the encoded .txt file (ibgqbamp.txt)\nand executes it. In this process, the PowerShell script reads the encoded .txt file and puts it into a variable. The PowerShell script uses\nthe Unprotect command to decode the file, then saves it as another variable and executes its content.\n\n_phnjyubk.ps1: SHA1: 9344835036D0FA30B46EF1F4C3C16461E3F9B58F_\n\n_Ibgqbamp.txt: SHA1: 3544F637F5F53BF14B2A0CE7C24937A2C6BC8EFE_\n\n_Execution of the wscript._\n\n_The contents of the VBScript._\n\n_The contents of the Powershell script._\n\n**Analysis of the .txt File**\n\nAfter establishing its persistence using scheduled tasks, the Ramnit banking Trojan executes its reflective code injection.\n\n\n-----\n\n[The script decoded from the .txt file (ibgqbamp.txt) is a modified version of an open source script (Invoke ReflectivePEInjection.ps1). It is](https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1)\na PowerShell post-exploitation framework developed by PowerSploit. This script has two modes: it can reflectively load a DLL/EXE into\nthe PowerShell process, or it can reflectively load a DLL into a remote process.\n\nAfter investigating the malicious .txt file (ibgqbamp.txt), it appears to extract two DLLs:\n\n1. RuntimeCheck.dll is a module that was added by the attacker to the open source script in order to bypass the Anti Malware Scan\n\nInterface (AMSI) defense (SHA1:e680c19a48d43ab9fb3fcc76e2b05af62fe55f1a).\n2. rmnsoft.dll is the network mechanism that connects with the C2 server (SHA1:b4b93c740f4058b6607b3c509d50804b6119e010).\n\n_Runtime.check.dll bypassing the AMSI module._\n\n_Rmnsoft.dll, the ramnit module._\n\n**RuntimeCheck.dll and Bypassing AMSI**\n\n[As mentioned above, the attacker modified the (Invoke-ReflectivePEInjection.ps1) script and added a module to control and verify](https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1)\nbypassing the AMSI defense mechanism. This module consists of five different functions, but most of them execute from the main function\nof the Disable() module.\n\n_RuntimeCheck.dll_\n\n[As described in the Microsoft Developer Network (MSDN):](https://docs.microsoft.com/en-us/windows/desktop/amsi/antimalware-scan-interface-portal)\n\n_“AMSI is a generic interface standard that allows applications and services to integrate with any anti malware product present on a_\n_machine. It provides enhanced malware protection for users and their data, applications, and workloads._\n\n\n-----\n\n_AMSI is anti malware vendor agnostic, designed to allow for the most common malware scanning and protection techniques provided by_\n_today’s anti malware products that can be integrated into applications. It supports a calling structure allowing for file and memory or_\n_stream scanning, content source URL/IP reputation checks, and other techniques.”_\n\nThe [Anti Malware Scan Interface (AMSI) is designed for application developers that want to make requests to anti malware products from](https://docs.microsoft.com/en-us/windows/desktop/amsi/antimalware-scan-interface-portal)\nwithin their applications, as well as for third-party creators of anti malware products that want their products to offer the best features to\napplications.\n\n[By default, AMSI works with Windows Defender to scan relevant data. However, if another antivirus engine registers itself as an AMSI](https://www.microsoft.com/en-us/windows/windows-defender/)\n**Provider, Windows Defender will unregister itself and shut down.**\n\n[In the Disable() module, there are several functions that work together to bypass AMSI. A similar technique was described earlier this](https://www.cyberark.com/threat-research-blog/amsi-bypass-patching-technique/)\nyear by CyberArk.\n\nIn this instance, the attacker tries to bypass AMSI in order to evade its functionality. The attacker attempts to use hard-coded memory\n[manipulation with bytes of arrays to change the AmsiScanBuffer function arguments.](https://docs.microsoft.com/en-us/windows/desktop/api/amsi/nf-amsi-amsiscanbuffer)\n\n_The technique used to bypass AMSI._\n\nOnce the attacker is able to bypass the AMSI defense system, they can lay the groundwork for the Ramnit banking Trojan module. This\nmodule is stored in the script as shellcode that will be injected reflectively.\n\n**Rmnsoft.dll Analysis**\n\nAs mentioned above, the .txt file contains a second payload stored as shellcode, which is the Ramnit banking Trojan module.\n\nRamnit is one of the [oldest banking Trojans, and has been used by attackers since as early as 2010. Originally, it was used as a worm](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Win32/Ramnit)\n[spreader. It was adapted for banking shortly after its developers adopted the leaked Zeus source code.](https://www.cert.pl/en/news/single/ramnit-in-depth-analysis/)\n\nTraditionally, the Ramnit banking Trojan module (rmnsoft.dll) is responsible for multiple core malicious activities that are related to the\nnetwork and communication of the banking Trojan. The module is also responsible for downloading several malicious modules that, when\ncombined, expand the Ramnit features. These malicious activities include:\n\nMan-in-the-Browser Attacks\nScreen Capturing\nMonitoring Keystrokes\nStealing Stored Credentials from FTP Clients\nStealing Cookies\nDownloading Additional Malicious Files\nUploading Sensitive Data to a Remote C2 server\n\nAfter extracting the main module (rmnsoft.dll), it appears to have a list of targeted processes:\n\nImagingDevices.exe\nWab.exe\nwabimg.exe\nwmplayer.exe\nwordpad.exe\n\nThese processes eventually become the injected processes that contain the main module (rmnsoft dll)\n\n\n-----\n\n_Strings of targeted processes found in rmnsoft.dl._\n\n**rmnsoft.dll and Reflective Injection**\n\nAs mentioned above, the main purpose of the modified script (Invoke-ReflectivePEInjection.ps1) stored as a .txt file is to either reflectively\ninject a selected payload into the PowerShell or remotely into a chosen process.\n\nOnce the wscript executes the PowerShell script (phnjyubk.ps1), the rmnsoft.dll module is reflectively injected into the PowerShell\nprocess.\n\n_The shellcode reflectively injected into PowerShell process._\n\nAfter being reflected into the PowerShell process, the script (phnjyubk.ps1) executes a function to search for the chosen processes. Once\nit identifies the processes, it injects its malicious module (rmnsoft.dll) into one of them .\n\n\n-----\n\n_The script selects where to inject the Ramnit module according to the targeted strings._\n\nAs mentioned above, once the PowerShell script ends its execution, wmiprvse.exe spawns a new process from the targeted list and\n[performs its reflective DLL injection. Windows Management Instrumentation (WMI), as described in MSDN, is the infrastructure for data](https://docs.microsoft.com/en-us/windows/desktop/wmisdk/wmi-start-page)\n[management and operations on Windows-based operating systems. Attackers can use WMI (MITRE Technique T1047) to interact with](https://attack.mitre.org/techniques/T1047/)\nlocal and remote systems and use them to perform many offensive tactics, such as gathering information for discovery and remote\nexecution of files as part of [lateral movement.](https://attack.mitre.org/tactics/TA0008/)\n\n_The wmiprvse.exe injecting the module reflectively to the targeted processes, as seen in the Cybereason platform._\n\n\n-----\n\n_[Execution of the injected wordpad.exe by WmiPrvSE.exe in Process Hacker.](https://processhacker.sourceforge.io/)_\n\nWhen inspecting the memory section of any of the identified processes, we discovered a read-write-execute section that appears to be a\nPortable Executable file of size 116 kB. This section is where the module (rmnsoft.dll) is injected and is responsible for the malicious\nnetwork activity of the injected process.\n\n_rmnsoft.dll injected into ImagingDevices.exe. baidu.com is the address that the malware uses to check connectivity._\n\nBy checking any of the injected processes using the Cybereason platform, we can easily detect the presence of the module (rmnsoft.dll)\nassociated with Ramnit banking Trojan.\n\n_Ramnit banking Trojan malicious DLL loaded reflectively._\n\n**Command and Control**\n\nAs mentioned above, the module (ramnsoft.dll) is responsible for the network ability of the Ramnit banking Trojan.\n\nThe module contains several network functions that allow the malware to initiate a remote connection with a C2 server.\n\nAfter the PowerShell script ends its execution, the new process is injected with the Ramnit banking Trojan DLL to collect information about\n[the local system using the CreateToolhelp32Snapshot function. It sends this data to a C2 server using Domain Generation Algorithms](https://www.cybereason.com/blog/what-are-domain-generation-algorithms-dga)\n(DGA).\n\n\n-----\n\nDGA are algorithms that periodically generate a large number of domain names that can be used as rendezvous points with their C2\nservers. They are generally used by malware to evade domain-based firewall controls. Malware that uses DGAs will constantly probe for\nshort-lived, registered domains that match the domain generated by the DGA to complete the C2 communication.\n\n_After the injection, Ramnit checks connectivity using several hardcoded and legitimate domains such as baidu.com and google.com. After_\n_it verifies the connection externally, it sends data using DGA._\n\n[The injected process is able to scan the infected machine and map the running processes using the CreateToolhelp32Snapshot function.](https://docs.microsoft.com/en-us/windows/desktop/api/tlhelp32/nf-tlhelp32-createtoolhelp32snapshot)\n\n_The malware snapshot winlogon.exe during its process._\n\n_Resolved and unresolved DNS queries generated by the injected processes._\n\n\n-----\n\n## CONCLUSION\n\nOur Active Hunting Service was able to detect both the PowerShell script and the malicious use of certutil. Our customer was able to\nimmediately stop the attack using the remediation section of our platform. From there, our hunting team pulled the rest of the attack\ntogether and completed the analysis\n\nWe were able to detect and evaluate an evasive infection technique used to spread a variant of the Ramnit banking Trojan as part of an\nItalian spam campaign. In our discovery, we highlighted the use of legitimate, built-in products used to perform malicious activities through\nLOLbins, as well as how sLoad operates and installs various payloads. The analysis of the tools and techniques used in the spam\ncampaign show how truly effective these methods are at evading antivirus products. We anticipate using the sLoad PowerShell\ndownloader and its variants as an infection vector won’t stop with just delivering Ramnit. It will soon be used to deliver more advanced and\nsophisticated attacks. This is an example of an undercover, under-the-radar way to more effectively attack, which we see as having\ndangerous potential in future use.\n\nAs a result of this activity, the customer was able to contain an advanced attack before any damage was done. The Ramnit trojan was\ncontained, as well as the sLoad dropper, which has a high potential for damage as well. Persistence was disabled, and the entire attack\nwas halted in its tracks.\n\nPart of the difficulty identifying this attack is in how it evades detection. It is difficult to detect, even for security teams aware of the difficulty\nensuring a secure system, as with our customer above. LOLbins are deceptive because their execution seems benign at first. As the use\nof LOLbins become more commonplace, we suspect this complex method of attack will become more common as well. The potential for\ndamage will grow, as attackers will look to other, more destructive payloads.\n\nWant to start threat hunting?\n\n## Indicators of Compromise\n\n**IOC** **Type** **Description**\n\nbureaucratica[.]org Domain\nsLoad downloader\n\nSmokymountainsfineart[.]com Domain sLoad downloader\n\npackerd[.]me Domain sLoad payload\n\nreasgt[.]me Domain sLoad payload\n\nmomer[.]me Domain sLoad payload\n\nimperialsociety[.]org Domain sLoad payload\n\n185.197.75[.]10 IP sLoad payload\n\n\n**SHA1**\n\nB564ED3DE7A49673AC19B6231E439032AE6EAA68\n\n**SHA1**\n\n7FDBCB40E0BE3563B7093F32F4B2967A0550437F\n\n**SHA1**\n\n1281D1C4B74BCEB2F57853537B49622DA3626ACD\n\n\nHash documento-aggiornato-PJ-27760855KD.zip\n\nHash documento-aggiornato-DK-DDEVWCUZ.zip\n\nHash documento-aggiornato-5D-MD2OW1.zip\n\n\n-----\n\n**SHA1**\n\n0D2DAC7B17C38E4C4695784C8D06FF618EBCC944\n\n**SHA1**\n\n4C315904CBA72F7961C46D2D3A9661330B88B649\n\n**SHA1**\n\n11BEAD9002F2C0F9E292AA6FD066C8B1D8E4EDA7\n\n**SHA1**\n\nEC9072840FA94B8B4E9B852D8A8C736CAEE5031E\n\n**SHA1**\n\n53813EDDEE9C3F5C151340CEBE2F75039979DA3D\n\n**SHA1**\n\nCC6D4DACFA016F3DAF8810FC63C1534C1D93D22F\n\n**SHA1**\n\nB6E3C4A528E01B6DE055E089E3C0DD2DA79CFCBE\n\n**SHA1**\n\nAEABE11F0496DA7E62501A35F4F03059F783C775\n\n**SHA1**\n\nae5b322b7586706015d8b3e83334c78b77f8f905\n\n**SHA1**\n\n82C3A3E1317CD5C671612430DDDED79DF9398BCC\n\n**SHA1**\n\nABC14EB06235A957D3AD66E359DC0B1F1FDFAB8A\n\n**SHA1**\n\n9344835036D0FA30B46EF1F4C3C16461E3F9B58F\n\n**SHA1**\n\n21B729CEEE16CF3993D8DDBFEEEBB4F960B46F09\n\n**SHA1**\n\n3544F637F5F53BF14B2A0CE7C24937A2C6BC8EFE\n\n**SHA1**\n\ne680c19a48d43ab9fb3fcc76e2b05af62fe55f1a\n\n\nHash documento-aggiornato-novembre-VSS-6639623058.zip\n\nHash documento-aggiornato-VX-SR8Uvbgb.zip\n\nHash documento-aggiornato-novembre-IJM0006480.zip\n\nHash documento-aggiornato-TR000022023.zip\n\nHash documento-aggiornato-DQ00091395.zip\n\nHash documento-aggiornato-novembre-ZN000986350.zip\n\nHash oyCZpsgNEFvQnW.ps1\n\nHash vmcpRAYW.vbs\n\nHash _uwbwklrfyetxgjtv.exe\n\nHash config.ini\n\nHash web.ini\n\nHash phnjyubk.ps1\n\nHash mikshpri.vbs\n\nHash ibgqbamp.txt\n\nHash RuntimeCheck.dll\n\n\n-----\n\n**SHA1**\n\nb4b93c740f4058b6607b3c509d50804b6119e010\n\n\nHash rmnsoft.dll\n\n\nimage.orchas[.]com Domain Domain related to the .zip files\n\ncavintageclothing[.]com Domain Domain related to the .zip files\n\nimage.fagorham[.]com Domain Domain related to the .zip files\n\nimage.visitacnj[.]com Domain Domain related to the .zip files\n\nimage.steampunkvegan[.]com Domain Domain related to the .zip files\n\nfiretechnicaladvisor[.]com Domain Domain related to the .zip files\n\nimage.sewingagent[.]com Domain Domain related to the .zip files\n\nAbout the Author\n\n**Cybereason Nocturnus**\n\nThe Cybereason Nocturnus Team has brought the world’s brightest minds from the military, government intelligence, and enterprise\nsecurity to uncover emerging threats across the globe. They specialize in analyzing new attack methodologies, reverse-engineering\nmalware, and exposing unknown system vulnerabilities. The Cybereason Nocturnus Team was the first to release a vaccination for the\n2017 NotPetya and Bad Rabbit cyberattacks.\n\n[All Posts by Cybereason Nocturnus](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-03 - LOLbins and trojans- How the Ramnit Trojan spreads via sLoad in a cyberattack.pdf"
    ],
    "report_names": [
        "2019-01-03 - LOLbins and trojans- How the Ramnit Trojan spreads via sLoad in a cyberattack.pdf"
    ],
    "threat_actors": [
        {
            "id": "9be98f84-4a93-41c7-90bd-3ea66ba5bfd7",
            "created_at": "2022-10-25T16:07:24.581954Z",
            "updated_at": "2025-03-27T02:02:10.287921Z",
            "deleted_at": null,
            "main_name": "TA554",
            "aliases": [
                "TH-163"
            ],
            "source_name": "ETDA:TA554",
            "tools": [
                "DarkVNC",
                "Godzilla",
                "Godzilla Loader",
                "Gootkit",
                "Gootloader",
                "Gozi ISFB",
                "ISFB",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Nimnul",
                "Pandemyia",
                "PsiX",
                "PsiXBot",
                "Ramnit",
                "StarsLord",
                "Waldek",
                "Xswkit",
                "sLoad",
                "talalpek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3808e4f-c7fd-4d25-aa84-aacc27061826",
            "created_at": "2023-01-06T13:46:39.316216Z",
            "updated_at": "2025-03-27T02:00:03.049128Z",
            "deleted_at": null,
            "main_name": "TA554",
            "aliases": [
                "TH-163"
            ],
            "source_name": "MISPGALAXY:TA554",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535794,
    "ts_updated_at": 1743041395,
    "ts_creation_date": 1653764512,
    "ts_modification_date": 1653764512,
    "files": {
        "pdf": "https://archive.orkl.eu/9d2672e4aa5554d7b3f222f5429dcdef2a93d0c4.pdf",
        "text": "https://archive.orkl.eu/9d2672e4aa5554d7b3f222f5429dcdef2a93d0c4.txt",
        "img": "https://archive.orkl.eu/9d2672e4aa5554d7b3f222f5429dcdef2a93d0c4.jpg"
    }
}