{
    "id": "51a491fc-6f85-48ac-8e43-d1b0794159c1",
    "created_at": "2023-01-12T15:05:45.320093Z",
    "updated_at": "2025-03-27T02:05:42.931762Z",
    "deleted_at": null,
    "sha1_hash": "69401dd3273733cdf64c6f7aced0619a2976c0c1",
    "title": "2016-08-29 - Fantom ransomware impersonates Windows update",
    "authors": "",
    "file_creation_date": "2022-05-28T16:11:27Z",
    "file_modification_date": "2022-05-28T16:11:27Z",
    "file_size": 379839,
    "plain_text": "# Fantom ransomware impersonates Windows update\n\n**[webroot.com/blog/2016/08/29/fantom-ransomware-windows-update/](https://www.webroot.com/blog/2016/08/29/fantom-ransomware-windows-update/)**\n\nTyler Moffitt August 29, 2016\n\n[Windows 10 has been notorious about automatically installing updates on users’ machines](https://www.webroot.com/us/en/home/products/antivirus-for-windows)\nand now there is a ransomware that aims to capitalize on it. The new ransomware, Fantom,\n[is based on the EDA2 open-source ransomware project on GitHub called hidden tear that’s](https://github.com/utkusen/hidden-tear)\nrecently been abandoned.\n\n\n-----\n\n## Fantom behind the scenes\n\nIn an attempt to conceal malicious intention, the authors of this ransomware modified the file\nproperties to show copyright and legal trademarks mimicking a Windows update.\n\nOnce this dropper is executed, the payload “WindowsUpdate.exe” is dropped in\nAppData\\Local\\Temp displaying the fake Windows Update screen as shown below. This\nscreen locks you out of doing anything else on your computer, keeping in line with the scam\nthat Windows 10 doing its normal interrupt of updates.\n\nThe percentage counter does work and will go up at about a percent per minute. However,\nit’s fake and doesn’t represent anything other than to communicate to you that this “Windows\nupdate” will take a while and that you shouldn’t be alarmed of CPU usage and hard drive\nactivity. You can close this fake update overlay by ending the process “WindowsUpdate.exe”\nusing task manager, but the encryption of your files is unaffected.\n\n## DECRYPT_YOUR_FILES.HTML ransom note\n\nEncryption is done using AES-128 encryption and when a file is encrypted it will append\n“.fantom” to the extension of the file. Also in every directory that a file is encrypted, a\nstandard ransom note “DECRYPT_YOUR_FILES.HTML” is created.\n\nThe ransom note doesn’t have an onion link as your payment portal for your files – a\nstandard for most encrypting ransomware. Instead, you’re asked to email the cyber criminals\nand await response. This tactic is meant to target less savvy computer users who would be\nintimidated by creating a bitcoin wallet address and using a tor browser to connect to the\n\n\n-----\n\ndarknet for ransom payment. To increase odds of\ngaining trust, two “freebie” files for decryption are\nallowed.\n\nHowever, it’s clear that these cyber criminals have a\nvery loose grip on the English language so we don’t\nanticipate much traction with their scams through\nemail. We also reached out as a test and have yet to\nhear back in over 24 hours.\n\n## Employ a backup solution\n\nWebroot will catch this specific variant in real time before any encryption takes place. We’re\nalways on the lookout for new threats, but just in case of new zero-day variants, remember\nthat with encrypting ransomware, the best protection is going to be a good backup solution.\nThis can be either through the cloud or offline external storage. Keeping it up to date is key\nso as not to lose productivity. Webroot has backup features built into our consumer product\nthat allow you to have directories constantly synced to the cloud. If you were to get infected\nby a zero-day variant of encrypting ransomware, you can just restore your files back as we\nsave a snapshot history for each of your files up to ten previous copies. Please see our\n[community post on best practices for securing your environment against encrypting](https://community.webroot.com/t5/Webroot-Education/Best-practices-for-securing-your-environment-against/ta-p/191172)\nransomware.\n\n**MD5 Analyzed: 7D80230DF68CCBA871815D68F016C282**\n\n**Additional MD5 seen: 4AC83757EBF7ACD787F732AA398E6D53**\n\n**65E9E1566DEC1586358BEC5DE9905065**\n\n**60DBBC069931FB82C7F8818E08C85164**\n\n**86313D2C01DC48D617D52BC2C388957F**\n\n\n-----\n\n-----\n\n### About the Author\n\n**[Tyler Moffitt](https://www.webroot.com/blog/author/tylermoffitt/)**\n\nSr. Security Analyst\n\nTyler Moffitt is a Sr. Security Analyst who stays deeply immersed within the world of malware\nand antimalware. He is focused on improving the customer experience through his work\ndirectly with malware samples, creating antimalware intelligence, writing blogs, and testing\nin-house tools.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-08-29 - Fantom ransomware impersonates Windows update.pdf"
    ],
    "report_names": [
        "2016-08-29 - Fantom ransomware impersonates Windows update.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535945,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653754287,
    "ts_modification_date": 1653754287,
    "files": {
        "pdf": "https://archive.orkl.eu/69401dd3273733cdf64c6f7aced0619a2976c0c1.pdf",
        "text": "https://archive.orkl.eu/69401dd3273733cdf64c6f7aced0619a2976c0c1.txt",
        "img": "https://archive.orkl.eu/69401dd3273733cdf64c6f7aced0619a2976c0c1.jpg"
    }
}