{
    "id": "51b631c0-6654-4934-b09a-197f71e7d398",
    "created_at": "2023-01-12T14:58:56.494796Z",
    "updated_at": "2025-03-27T02:17:23.029835Z",
    "deleted_at": null,
    "sha1_hash": "565df12706f9f7901e175efb739c35fa1980d86b",
    "title": "2018-02-26 - Who Wasn’t Responsible for Olympic Destroyer-",
    "authors": "",
    "file_creation_date": "2022-05-28T17:55:33Z",
    "file_modification_date": "2022-05-28T17:55:33Z",
    "file_size": 413122,
    "plain_text": "# Who Wasn’t Responsible for Olympic Destroyer?\n\n**[blog.talosintelligence.com/2018/02/who-wasnt-responsible-for-olympic.html](http://blog.talosintelligence.com/2018/02/who-wasnt-responsible-for-olympic.html)**\n\n[This blog post is authored by Paul Rascagneres and](https://twitter.com/r00tbsd) [Martin Lee.](https://www.blogger.com/profile/17941683095374027310)\n\n## Summary\n\nAbsent contributions from traditional intelligence capacities, the available evidence linking\nthe Olympic Destroyer malware to a specific threat actor group is contradictory, and does not\nallow for unambiguous attribution. The threat actor responsible for the attack has\n\n\n-----\n\npurposefully included evidence to frustrate analysts and lead researchers to false attribution\nflags. This false attribution could embolden an adversary to deny an accusation, publicly\nciting evidence based upon false claims by unwitting third parties. Attribution, while headline\ngrabbing, is difficult and not an exact science. This must force one to question purely\nsoftware-based attribution going forward.\n\n## Introduction\n\nThe Olympic Games in Pyeongchang, South Korea were disrupted by a cyber attack earlier\nthis month. Reportedly, the attack resulted in the Olympic website being knocked offline,\nmeaning individuals could not print their tickets. Reporting on the opening ceremony was\nalso degraded due to WiFi failing for reporters on site. On Feb. 12, Talos published a blog\n[detailing the functionality of the malware Olympic Destroyer that we have identified with](http://blog.talosintelligence.com/2018/02/olympic-destroyer.html)\nmoderate confidence as having been used in the attack.\n\nExample press quotes suggesting attribution for Olympic Destroyer.\n\nThe malware did not write itself, the incident did not happen by accident, but who was\nresponsible? Attributing attacks to specific malware writers or threat actor groups is not a\nsimple or exact science. Many parameters must be considered, analysed and compared with\nprevious attacks in order to identify similarities. As with any crime, criminals have preferred\ntechniques, and tend to leave behind traces, akin to digital fingerprints, which can be found\nand linked to other crimes.\n\nIn terms of cyber security incidents, analysts would look for similarities for attributes such as:\n\nTactics, Techniques and Procedures (TTPs) (how the attacker conducted the attack)\nVictimology (the profile of the victim)\nInfrastructure (the platforms used as part of the attack)\nIndicators of Compromise (IOCs) (identifiable artifacts left during an attack)\n\n\n-----\n\nMalware samples (the malware used as part of the attack)\n\nOne of the strengths of software engineering is the ability to share code, to build applications\non top of libraries written by others, and to learn from the success and failures of other\nsoftware engineers. The same is true for threat actors. Two different threat actors may use\ncode from the same source in their attacks, which means that their attacks would display\nsimilarities, despite being conducted by different groups. Sometimes threat actors may\nchoose to include features from another group in order to frustrate analysts and try to lead to\nmaking a false attribution.\n\nIn the case of Olympic Destroyer, what is the evidence, and what conclusions regarding\nattribution can we make?\n\n## Olympic Destroyer Lineup of Suspects\n\n### The Lazarus Group\n\nThe Lazarus Group, also referred to as Group 77, is a sophisticated threat actor that has\nbeen associated with a number of attacks. Notably, a spinoff of Lazarus, referred to as the\nBluenoroff group, conducted attacks against the SWIFT infrastructure in a bank located in\nBangladesh.\n\n[The filename convention used in the SWIFT malware, as described by BAE Systems, was:](https://baesystemsai.blogspot.com/2016/04/two-bytes-to-951m.html)\nevtdiag.exe, evtsys.exe and evtchk.bat.\n\nThe Olympic Destroyer malware checks for the existence of the following file:\n%programdata%\\evtchk.txt.\n\nThere is a clear similarity in the two cases. This is nowhere near proof, but it is a clue, albeit\nweak.\n\nFurther evidence is found in similarities between Olympic Destroyer and the wiper malware\n[associated with Bluenoroff, again described by BAE Systems. In this example, the Bluenoroff](https://baesystemsai.blogspot.com/2016/05/cyber-heist-attribution.html)\nwiper is on the left, and the Olympic Destroyer wiper function on the right:\n\n\n-----\n\nClearly, the code is not identical, but the very specific logic, of wiping only the first 0x1000\nbytes of large files is identical and unique to both cases. This is another clue, and stronger\nevidence than the file name check.\n\nHowever, both the file names used by Bluenoroff and the wiper function are documented and\navailable to anyone. Our actual culprits could have added the file name check, and mimicked\nthe wiper function simply in order to implicate the Lazarus group and potentially distract from\ntheir true identity.\n\nOlympic Destroyer sample:\n23e5bb2369080a47df8284e666cac7cafc207f3472474a9149f88c1a4fd7a9b0\n\nBluenoroff sample #1:\n\n\n-----\n\nae086350239380f56470c19d6a200f7d251c7422c7bc5ce74730ee8bab8e6283\nBluenoroff sample #2:\n5b7c970fee7ebe08d50665f278d47d0e34c04acc19a91838de6a3fc63a8e5630\n\n### APT3 & APT10\n\n[Intezer Labs spotted code sharing between Olympic Destroyer and malware used in attacks](http://www.intezer.com/2018-winter-cyber-olympics-code-similarities-cyber-attacks-pyeongchang/)\nattributed to APT3 and APT10.\n\nIntezer Labs identified that Olympic Destroyer shares 18.5 percent of its code with a tool\nused by APT3 to steal credentials from memory. Potentially, this is a very strong clue.\nHowever, the APT3 tool is, in turn, based on the open-source tool, Mimikatz. Since Mimikatz\nis available for download by anyone, it is entirely possible that the author of Olympic\nDestroyer used code derived from Mimikatz in their malware, knowing that it had been used\nby other malware writers.\n\nIntezer Labs also spotted similarities in the function used to generate AES keys between\nOlympic Destroyer and APT10. According to Intezer Labs, this particular function has only\never been used by APT10. Maybe the malware writer has let slip a possible vital clue to their\nidentity.\n\n### Nyetya\n\n[The use of code derived from Mimikatz to steal credentials was also seen in the Nyetya](http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html)\n(NotPetya) malware of June 2017. Additionally, like Nyetya, Olympic Destroyer spread\nlaterally via abusing legitimate functions of PsExec and WMI. Like Nyetya, Olympic\nDestroyer uses a named pipe to send stolen credentials to the main module.\n\nUnlike Nyetya, Olympic Destroyer didn't use the exploits EternalBlue and EternalRomance\nfor propagation. But, the perpetrator has left artifacts within the Olympic Destroyer source\ncode to insinuate the presence of SMB exploits.\n\nOlympic Destroyer includes the definition of these four structures:\n\n\n-----\n\n[These four structures can also be found in the public EternalBlue proof of concept:](https://github.com/worawit/MS17-010/blob/master/zzz_exploit.py)\n\n\n-----\n\nThese structures are loaded during runtime, when the Olympic Destroyer is executed, but\nremain unused. Clearly, the author knew of the EternalBlue PoC, but the reason why these\nstructures are present is obscure. It's likely the author wanted to lay a trap for security\nanalysts to provoke a false positive attribution. Alternatively, we could be seeing the traces of\nfunctionality, which never made it into the final malware.\n\n## Conclusion\n\nAttribution is hard. Rarely do analysts reach the level of evidence that would lead to a\nconviction in a courtroom. Many were quick to jump to conclusions, and to attribute Olympic\nDestroyer to specific groups. However, the basis for such accusations are frequently weak.\n\n\n-----\n\nNow that we are potentially seeing malware authors placing multiple false flags, attribution\nbased off malware samples alone has become even more difficult.\n\nFor the threat actors considered, there is no clear smoking gun indicating a guilty party with\nthe evidence which we have available. Other security analysts and investigative bodies may\nhave further evidence to which we do not have access. Organisations with additional\nevidence, such as signal intelligence or human intelligence sources which may provide\nsignificant clues to attribution, may be the least likely to share their insights so as not to\nbetray the nature of their intelligence-gathering operation.\n\nThe attack which we believe Olympic Destroyer to have been associated with was clearly an\naudacious attack, almost certainly conducted by a threat actor with a certain level of\nsophistication who did not believe that they would be easily identified and held accountable.\n\nCode sharing between threat actors is to be expected. Open-source tools are a useful\nsource of functionality, and adopting techniques from successful attacks conducted by other\ngroups are likely to be sources of misleading evidence leading to false attribution.\n\nEqually, we can expect sophisticated threat actors to take advantage of this, and to integrate\nevidence designed to fool analysts, to lead to attribution of their attacks to other groups.\nPotentially, threat actors take pleasure in reading incorrect information being published by\nsecurity analysts. This could even be taken to the extreme of a country denying an attack\nbased upon evidence presented by an unwitting third party due to false attribution. Every\ntime there is misattribution it gives adversaries something to hide behind. In this heightened\nera of fake news attribution is a highly sensitive issue.\n\nAs threat actors evolve their skills and techniques, it is likely that we see threat actors further\nadopting ruses to complicate and confuse attribution. Attribution is already difficult. It is\nunlikely to become easier.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-26 - Who Wasn’t Responsible for Olympic Destroyer-.pdf"
    ],
    "report_names": [
        "2018-02-26 - Who Wasn’t Responsible for Olympic Destroyer-.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535536,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653760533,
    "ts_modification_date": 1653760533,
    "files": {
        "pdf": "https://archive.orkl.eu/565df12706f9f7901e175efb739c35fa1980d86b.pdf",
        "text": "https://archive.orkl.eu/565df12706f9f7901e175efb739c35fa1980d86b.txt",
        "img": "https://archive.orkl.eu/565df12706f9f7901e175efb739c35fa1980d86b.jpg"
    }
}