{
    "id": "51b7a5bf-b118-406a-b7e8-3daac6633f7d",
    "created_at": "2023-01-12T15:06:33.867789Z",
    "updated_at": "2025-03-27T02:15:38.000783Z",
    "deleted_at": null,
    "sha1_hash": "799d466132ef11353bd8fa04aec377c6e345e0fc",
    "title": "2019-09-03 - Deobfuscating Ostap- TrickBot’s 34,000 Line JavaScript Downloader",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:56Z",
    "file_modification_date": "2022-05-28T02:43:56Z",
    "file_size": 4192987,
    "plain_text": "# Recent Posts\n\n**[bromium.com/deobfuscating-ostap-trickbots-javascript-downloader/](https://www.bromium.com/deobfuscating-ostap-trickbots-javascript-downloader/)**\n\nSeptember 3, 2019\n\n[HP Threat Research Blog • Deobfuscating Ostap: TrickBot’s 34,000 Line JavaScript](https://www.bromium.com/blog/)\nDownloader\n\n## Deobfuscating Ostap: TrickBot’s 34,000 Line JavaScript Downloader\n\n**Introduction**\n\nFor a malicious actor to compromise a system, they need to avoid being detected at the\npoint of entry into the target’s network. Commonly, phishing emails delivering malicious\nattachments (T1193) serve as the initial access vector.[1]\n\nAdversaries also need a way to execute code on target computers without tipping off\nautomated tools and the monitoring efforts of security teams. One of the most common code\nexecution techniques is to use interpreted scripting languages (T1064) that can run on an\noperating system without additional dependencies.[2] On Windows, popular interpreted\nlanguages that are abused by attackers include PowerShell, VBScript, JScript, VBA (Visual\nBasic for Applications), and commands interpreted by Command shell (cmd.exe).\n\nNetwork attackers and defenders are in a constant state of competition to out-do the other to\ngain an advantage that could determine the outcome of an intrusion attempt. Against this\nbackground, we regularly see malicious actors change their tooling to increase the chances\nof a successful intrusion, particularly the downloaders used to initially compromise systems.\n\n\n-----\n\nIn early August 2019, we noticed that high-volume malicious spam campaigns delivering\nTrickBot started using Ostap, a commodity JavaScript (or more specifically, JScript)\ndownloader. Previously, TrickBot campaigns relied on downloaders that used obfuscated\nCommand shell and later PowerShell commands that were triggered by VBA AutoOpen\nmacros to download their payloads.\n\nIn this post, I explain how to deobfuscate Ostap and describe a Python script I wrote\n(deobfuscate_ostap.py) that automates the deobfuscation of this JScript malware. The tool is\navailable to download on GitHub.[3]\n\nTrickBot, also known as The Trick, is a modular banking Trojan and dropper thought to be\noperated by at least three threat actors, tracked in the security community as TA505, Grim\nSpider and Wizard Spider.[4][5][6][7] While JavaScript-based downloaders aren’t new,\nTrickBot’s latest downloader is notable for its size, virtual machine detection and antianalysis measures. For example, the Ostap samples analysed in this post generated\nincomplete traces in two different public sandboxes and neither downloaded their respective\nTrickBot payloads.[8][9] Moreover, a sample that was uploaded to VirusTotal had a low\ndetection rate of 6/55 (11%) when it was first uploaded, suggesting that Ostap is effective at\nevading most anti-virus engines.\n\nFigure 1 – VirusTotal detection summary for one of the Ostap samples.\n\n**Ostap, TrickBot’s JScript Downloader**\n\nDownloaders are a type of malware designed to retrieve and run secondary payloads from\none or more remote servers. Their simple function means that downloaders are rarely more\nthan several hundred lines of code, even when obfuscated. Ostap counters this trend in that\nit is very large, containing nearly 35,000 lines of obfuscated code once beautified. Historical\nTrickBot campaigns suggest that their operators prefer code obfuscation that is lengthier\nthan most other e-crime actors to bypass detection, as seen, for example in campaigns in\nAugust 2018.[10]\n\n\n-----\n\nFigure 2 – Line, word and byte count of a sample of Ostap used to deliver TrickBot after\nbeing beautified. The downloader is 34,757 lines long.\n\n**Macro Analysis**\n\nThe downloader is delivered as a Microsoft Word 2007 macro-enabled document (.DOCM)\nthat contains the two components of the downloader: a VBA macro and the JScript (figure 3).\nThe emails and samples analysed were themed as purchase orders, suggesting that the\ncampaigns were likely intended to target businesses rather than individuals.\n\n\n-----\n\nFigure 3 – Lure document of the downloader.\n\nThe JScript component of the downloader is stored in the body of the document as white\ntext, resulting in a high word and page count.\n\nFigure 4 – JScript in lure document.\n\nThe VBA macro is saved in a project called “Sorry”. When the document is opened, it first\ncopies the JScript to files named 2angola.dot and 2angola.dotu in the user’s default Word\ntemplate directory (%AppData%\\Microsoft\\Templates). The procedure is triggered by a\nDocument.Open event.[11]\n\n\n-----\n\nFigure 5 – Annotated VBA code that runs when the document is opened.\n\nThe rest of the macro only runs if the document is closed, which is achieved by monitoring\nfor a Document.Close event (figure 6).[12] This is an anti-sandbox measure used to defeat\nbehavioural analysis by sandboxes that don’t imitate user activity such as closing\ndocuments.\n\nFigure 6 – Annotated VBA code that runs when the document is closed.\n\nIf the document is closed, the macro renames 2angola.dot to 2angola.Jse and then runs it:\n\n1. The macro calls the Create method from the Win32_Process WMI class to run a new\n\nExplorer.exe process with 2angola.Jse as its command line argument (figure 7).[13]\n2. When a new Explorer.exe process is created where one is already running, the new\n\nprocess is created with the /factory,{75DFF2B7-6936-4C06-A8BB-676A7B00B24B} _Embedding command-line arguments (figure 8). The CLSID corresponds to the ProgID_\ncalled “CLSID_SeparateMultipleProcessExplorerHost”.[14]\n\n\n-----\n\n3. Explorer runs 2angola.Jse using Windows Script Host (WScript.exe), the default file\n\nhandler for JScript Encoded Files (.JSE), as shown in figure 9. The file extension of\n2angola.dot is renamed to .Jse ensure that the JScript is opened using WScript.exe.\nRelying on default file associations means that the macro can evade detection by\nindirectly referencing WScript, a program commonly used for malicious purposes in the\ncontext of macros.\n\nFigure 7 – Sysmon event showing an Explorer.exe process running the JScript file after\nbeing launched by WMI Provider Host (WmiPrvSE.exe).\n\n\n-----\n\nFigure 8 – Sysmon event showing the new Explorer.exe process being created with the\narguments /factory,CLSID {75DFF2B7-6936-4C06-A8BB-676A7B00B24B} -Embedding.\n\nFigure 9 – Sysmon event showing WScript.exe running the JScript file.\n\n**Anti-Analysis Measures**\n\nInterestingly, the Ostap includes a fake Windows Script Host runtime error that occurs shortly\nafter the script is run. It’s likely that the fake error was included to discourage manual\nexamination of the downloader.\n\nFigure 10 – Fake error message displayed early during the runtime of the downloader.\n\n\n-----\n\nFigure 11 – Variable storing the fake error message in TrickBot s downloader.\n\nSome samples of the downloader contain the characters **/ at the beginning on the JSE file.\nThis is another anti-analysis measure that is used to trip up automated JavaScript analysis\ntools which may interpret the rest of the script as being part of a comment block, rather than\nexecutable code.\n\nOnce deobfuscated, several other anti-analysis measures are revealed. For example, Ostap\nqueries WMI to check if it is running in a virtual machine by looking for a blacklist of running\nprocesses:\n\nAgentSimulator.exe\nanti-virus.EXE\nBehaviorDumper\nBennyDB.exe\nctfmon.exe\nfakepos_bin\nFrzState2k\ngemu-ga.exe (Possible misspelling of Qemu hypervisor’s guest agent, qemu-ga.exe)\nImmunityDebugger.exe\nKMS Server Service.exe\nProcessHacker\nprocexp\nProxifier.exe\npython\ntcpdump\nVBoxService\nVBoxTray.exe\nVmRemoteGuest\nvmtoolsd\nVMware2B.exe\nVzService.exe\nwinace\nWireshark\n\nMany sandboxes run these processes in their guest images, such as Cuckoo Sandbox and\nits derivatives which use a Python agent. The script also checks for a blacklist of host and\nuser names.\n\nEmily\nHANSPETER-PC\nHAPUBWS\nHong Lee\nIT-ADMIN\n\n\n-----\n\nJOHN-PC\nJohnson\nMiller\nMUELLER-PC\nPeter Wilson\nSystemIT | admin\nTimmy\nWIN7-TRAPS\n\n**Beautifying the JScript**\n\nThe JScript that is written to disk is one line, making it difficult to analyse manually. To make\nit more readable, you can reformat and add indentations to the code using Einar Lielmanis’s\nJS Beautifier tool, which also works for JScript because they share a similar syntax.[15]\n\n_js-beautify 2angola.Jse > 2angola.Jse.beautified_\n\n**Identifying Code Structure, Key Variables and Functions**\n\nNow that the code is readable, we can begin analysing the script’s structure, variables and\nfunctions. Our aim here is to identify the functions responsible for deobfuscating the\ndownloader.\n\nThe script includes many junk variables that aren’t used anywhere else in the script. We can\nsimply remove these variables. It is often possible to distinguish the variables that have been\nautomatically generated by an obfuscator from meaningful ones because their naming\nconvention will differ.\n\nFor example, in figure 12 you can see some of the variable assignments in the script. All of\nthem are junk code, except the variable called gunsder, which looks interesting because it\ncontains the string “from”. It’s also referenced 2,515 times, which is promising.\n\n\n-----\n\nFigure 12 – Some of the variables in the script.\n\nIn figure 13, you can see at line 15 a function called xxqneol. The variable that we identified\nas interesting, gunsder, is concatenated with other strings. After concatenation, you can see\nthat the returned string is a reference to the fromCharCode() method which converts a\nUnicode character code into a character.[16] This function is supplied a parameter called\n_etsfhis. Before calling fromCharCode, the function checks that the second parameter, vqjpvi,_\nis the character h. This function is also referenced 7,540 times, so it’s likely that this function\nis used in the deobfuscation of the script.\n\nNow that we understand what the function does, we can give it, its variables and parameters\nmeaningful names (figure 14).\n\nFigure 13 – Function xxqneol before deobfuscation.\n\n\n-----\n\nFigure 14 – Renamed xxqneol function.\n\n**Analysis of Character Code Calculation Functions**\n\nNext, we can look at the functions where fromCharCode is referenced to understand how it is\nused. After cleaning up the code in figure 15, you can see that the function uses arithmetic\noperators to calculate a Unicode character code from the values stored in an array called\n_pkkwrit4. The Unicode character code and the character h are then supplied to the_\nfromCharCode function, which returns a Unicode character. In this case, the character\nreturned is f. Each character in the downloader has its own function to calculate its character\ncode. This particular sample has 7,540 functions that are used to calculate all the characters\ncodes.\n\nFigure 15 – One of the many functions used to calculate Unicode character codes.\n\nFigure 16 – Cleaned up function.\n\n**Writing a Python Script (deobfuscate_ostap.py) to Automate Deobfuscation**\n\n\n-----\n\nSince we don t want to have to manually calculate and decode 7,540 Unicode character\ncodes, let’s write a Python script to do this for us.\n\nBy looking for code similarities we can work out what actions we need the script to perform.\nIn the functions that calculate the Unicode character codes, the final character code value is\nalways calculated using the elements at index 0 and 1 of an array. Some arithmetic is\nperformed on these elements before they are supplied to the fromCharCode function. So far\nwe’ve seen addition and subtraction used in Ostap samples in the wild.\n\nWe can use Python’s re module to write regular expressions that match the elements in each\narray at index 0 and 1 and store them in lists.[17] Next, we’ll clean up the matches using the\nre.sub() function and then convert them into integers. We can then use Python’s zip()\nfunction to perform the arithmetic on the values in the index 0 and 1 lists.[18] The script tries\nsubtraction and addition operations to deobfuscate the downloader. Finally, the script\nconverts the character codes into Unicode characters, removes line breaks and prints the\nresult.\n\nThe script is available on GitHub to download and can be modified to support automated\nanalysis pipelines.[3] To test the script, a YARA rule was written to detect Ostap and then run\nagainst 100 samples from August 2019. The extracted and deduplicated URLs are at the end\nof the report.\n\n**Analysis of the Deobfuscated Downloader**\n\nAfter running the script, we can examine the deobfuscated strings from the downloader,\nincluding the URL where the TrickBot payload is hosted:\n\nhxxps://185.180.199[.]102/angola/mabutu.php?min=14b\n\n\n-----\n\nFigure 17 – Deobfuscated strings of Ostap sample using deobfuscate_ostap.py.\n\nThe strings are very similar to older Ostap samples from 2018 onwards, enabling us to make\na high confidence assessment that the downloaders used to deliver TrickBot in August 2019\nbelong to this family of malware. Public reporting shows that this malware has been used in\ncampaigns unrelated to TrickBot since 2016, delivering various financial malware families.\n\n[19][20] The variety of malware delivered by Ostap suggests that it is commodity malware\nthat is popular among different threat actors, including now TrickBot’s operators.\n\nOstap’s aggressive anti-analysis features and low detection rate compared to downloaders\nthat use other interpreted scripting languages make it an attractive choice for malware\noperators seeking a downloader.\n\n**YARA Rule**\n\n\n-----\n\n```\nrule win_ostap_jse {\n     meta:\n          author = \"Alex Holland @cryptogramfan (Bromium Labs)\"\n          date = \"2019-08-29\"\n          sample_1 =\n\"F3E03E40F00EA10592F20D83E3C5E922A1CE6EA36FC326511C38F45B9C9B6586\"\n          sample_2 =\n\"38E2B6F06C2375A955BEA0337F087625B4E6E49F6E4246B50ECB567158B3717B\"\n     strings:\n          $comment = { 2A 2A 2F 3B } // Matches on **/;\n          $array_0 = /\\w{5,8}\\[\\d+\\]=\\d{1,3};/\n          $array_1 = /\\w{5,8}\\[\\d+\\]=\\d{1,3};/\n     condition:\n          ((($comment at 0) and (#array_0 > 100) and (#array_1 > 100)) or\n          ((#array_0 > 100) and (#array_1 > 100))) and\n          (filesize > 500KB and filesize < 1500KB)\n}\n\n```\n**Hashes (SHA-256)**\n\nF3E03E40F00EA10592F20D83E3C5E922A1CE6EA36FC326511C38F45B9C9B6586\n– Last_order_specification_1217492.docm\n38E2B6F06C2375A955BEA0337F087625B4E6E49F6E4246B50ECB567158B3717B –\nHeiress_Documents_id18598.docm\n\n**Extracted URLs**\n\nhxxps://185.130.104[.]149/odr/updateme.php?oxx=p\nhxxps://185.130.104[.]149/odr/updateme.php?oxx=up\nhxxps://185.130.104[.]149/odr/updateme.php?oxx=z\nhxxps://185.130.104[.]236/deerhunter/inputok.php?min=29h\nhxxps://185.130.104[.]236/deerhunter/inputok.php?min=up3\nhxxps://185.130.104[.]236/deerhunter2/inputok.php?min=6h\nhxxps://185.130.104[.]236/deerhunter2/inputok.php?min=8h\nhxxps://185.130.104[.]236/deerhunter2/inputok.php?min=9a\nhxxps://185.130.104[.]236/deerhunter2/inputok.php?min=9h\nhxxps://185.130.104[.]236/targ/inputok.php?min=13s\nhxxps://185.130.107[.]236/deerhunter3/inputok.php?min=12a\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=up\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=17ha\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=18h\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=19a\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=19h\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=a\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=m\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=m2\n\n\n-----\n\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=t2\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=tu\nhxxps://185.159.82[.]15/hollyhole/c644.php?min=w\nhxxps://185.159.82[.]15/hollyhole2/c644.php?min=19h\nhxxps://185.159.82[.]15/hollyhole2/c644.php?min=79\nhxxps://185.159.82[.]20/t-30/x644.php?min=m\nhxxps://185.159.82[.]20/t-34/x644.php?min=24\nhxxps://185.159.82[.]20/t-34/x644.php?min=f\nhxxps://185.159.82[.]20/t-34/x66744.php?min=u2\nhxxps://185.180.199[.]102/angola/mabutu.php?min=14b\nhxxps://189.130.104[.]236/deerhunter3/inputok.php?min=13h\n\n**References**\n\n[1] MITRE ATT&CK technique T1193 “Spearphishing Attachment”,\n[https://attack.mitre.org/techniques/T1193/](https://attack.mitre.org/techniques/T1193/)\n\n[[2] MITRE ATT&CK technique T1064 “Scripting”, https://attack.mitre.org/techniques/T1064/](https://attack.mitre.org/techniques/T1064/)\n\n[3] https://github.com/cryptogramfan/Malware-AnalysisScripts/blob/master/deobfuscate_ostap.py\n\n[4] “Security Primer: TrickBot”, Multi-State Information Sharing and Analysis Center, March\n2019, https://www.cisecurity.org/wp-content/uploads/2019/03/MS-ISAC-Security-PrimerTrickbot-11March2019-mtw.pdf\n\n[5] “Threat Group Cards: A Threat Actor Encyclopedia”, ThaiCERT, p. 226,\n[https://www.thaicert.or.th/downloads/files/A_Threat_Actor_Encyclopedia.pdf](https://www.thaicert.or.th/downloads/files/A_Threat_Actor_Encyclopedia.pdf)\n\n[6] “Threat Group Cards: A Threat Actor Encyclopedia”, ThaiCERT, p. 259\n\n[7] “Threat Group Cards: A Threat Actor Encyclopedia”, ThaiCERT, p. 272\n\n[8] [https://app.any.run/tasks/dc86fb23-b8ac-49db-8c22-a53b88236676/](https://app.any.run/tasks/dc86fb23-b8ac-49db-8c22-a53b88236676/)\n\n[9] https://www.hybrid[analysis.com/sample/38e2b6f06c2375a955bea0337f087625b4e6e49f6e4246b50ecb567158](https://www.hybrid-analysis.com/sample/38e2b6f06c2375a955bea0337f087625b4e6e49f6e4246b50ecb567158b3717b?environmentId=120)\nb3717b?environmentId=120\n\n[10]\nhttps://www.virustotal.com/gui/file/1512b7e34006ff7b69c76601fcf554668a3378d31c77b4450\n7960d46e3a7c02c/details\n\n[11] [https://docs.microsoft.com/en-us/office/vba/api/word.document.open](https://docs.microsoft.com/en-us/office/vba/api/word.document.open)\n\n[12] [https://docs.microsoft.com/en-us/office/vba/api/word.document.close(even)](https://docs.microsoft.com/en-us/office/vba/api/word.document.close(even))\n\n\n-----\n\n[13] https://docs.microsoft.com/en-us/windows/win32/cimwin32prov/create-method-in-classwin32-process\n\n[14] [https://en.wikipedia.org/wiki/ProgID](https://en.wikipedia.org/wiki/ProgID)\n\n[15] [https://github.com/beautify-web/js-beautify](https://github.com/beautify-web/js-beautify)\n\n[16] [https://www.w3schools.com/jsref/jsref_fromcharcode.asp](https://www.w3schools.com/jsref/jsref_fromcharcode.asp)\n\n[17] [https://docs.python.org/3/library/re.html](https://docs.python.org/3/library/re.html)\n\n[18] [https://docs.python.org/3.3/library/functions.html#zip](https://docs.python.org/3.3/library/functions.html#zip)\n\n[19] [https://www.cert.pl/en/news/single/ostap-malware-analysis-backswap-dropper/](https://www.cert.pl/en/news/single/ostap-malware-analysis-backswap-dropper/)\n\n[20] https://www.carbonblack.com/2017/06/12/carbon-black-threat-research-dissectsemerging-mouseover-malware/\n\nTags\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-03 - Deobfuscating Ostap- TrickBot’s 34,000 Line JavaScript Downloader.pdf"
    ],
    "report_names": [
        "2019-09-03 - Deobfuscating Ostap- TrickBot’s 34,000 Line JavaScript Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "8492b1a0-126f-4113-b8f7-101d28559629",
            "created_at": "2023-01-06T13:46:38.864213Z",
            "updated_at": "2025-03-27T02:00:02.938147Z",
            "deleted_at": null,
            "main_name": "GRIM SPIDER",
            "aliases": [
                "GOLD ULRICK"
            ],
            "source_name": "MISPGALAXY:GRIM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535993,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653705836,
    "ts_modification_date": 1653705836,
    "files": {
        "pdf": "https://archive.orkl.eu/799d466132ef11353bd8fa04aec377c6e345e0fc.pdf",
        "text": "https://archive.orkl.eu/799d466132ef11353bd8fa04aec377c6e345e0fc.txt",
        "img": "https://archive.orkl.eu/799d466132ef11353bd8fa04aec377c6e345e0fc.jpg"
    }
}