{
    "id": "51dd40bf-a47d-485a-9a45-5d9fbb5901f7",
    "created_at": "2023-01-12T15:02:25.677232Z",
    "updated_at": "2025-03-27T02:12:03.95Z",
    "deleted_at": null,
    "sha1_hash": "e541252fd764f5b220ba1397a32fc5b3068bcb26",
    "title": "2021-03-24 - Quarterly Report- Incident Response trends from Winter 2020-21",
    "authors": "",
    "file_creation_date": "2022-05-28T15:13:21Z",
    "file_modification_date": "2022-05-28T15:13:21Z",
    "file_size": 356050,
    "plain_text": "# Quarterly Report: Incident Response trends from Winter 2020-21\n\n**[blog.talosintelligence.com/2021/03/ctir-trends-winter-2020-21.html](https://blog.talosintelligence.com/2021/03/ctir-trends-winter-2020-21.html)**\n\n_By_ _[David Liebenberg and](https://twitter.com/chinahanddave?lang=en)_ _[Caitlin Huey.](https://twitter.com/hueylittle_er)_\n\nFor the seventh quarter in a row, [Cisco Talos Incident Response (CTIR) observed](https://talosintelligence.com/incident_response)\nransomware dominating the threat landscape. The top variants were Ryuk and Vatet, which\n[is notable given the absence of Ryuk last quarter. We also observed variants of Egregor and](https://blog.talosintelligence.com/2020/12/quarterly-ir-report-fall-2020-q4.html)\n[WastedLocker continuing to target organizations across the globe.](https://blog.talosintelligence.com/2020/07/wastedlocker-emerges.html)\n\nUnlike last quarter, however, these ransomware attacks overwhelmingly relied on phishes\n[delivering commodity trojan maldocs, such as Zloader, BazarLoader and IcedID. Nearly 70](https://blog.talosintelligence.com/2018/04/icedid-banking-trojan.html)\npercent of ransomware attacks relied on commodity trojans this quarter. Adversaries also\nemploy commercially available tools such as Cobalt Strike, open-source post-exploitation\ntools like Bloodhound, and native tools on the victim’s system, such as PowerShell. For a\n[broader breakdown of these trends, check out our summary here.](https://talosintelligence.com/resources/155)\n\nCTIR engaged in several incident response engagements in which organizations\nunknowingly downloaded trojanized updates to the widely deployed SolarWinds' Orion\nsoftware. Only one of these engagements involved post-compromise activity.\n\nLooking forward, Microsoft recently announced four vulnerabilities in Exchange Server and\n[revealed that a threat actor named Hafnium had been exploiting these vulnerabilities to drop](https://blog.talosintelligence.com/2021/03/hafnium-update.html)\nweb shells, targeting an array of organizations. Soon other threat actors began leveraging\n\n\n-----\n\nthese exploits as well, ranging from APTs to cryptominer groups, with affected organizations\nestimated in the tens of thousands. CTIR has been responding to a growing number of\nincidents involving the Microsoft Exchange vulnerabilities.\n\n## Targeting\n\nActors targeted a broad range of verticals, including business management, construction,\neducation, energy and utilities, entertainment, financial, government, health care, industrial\ndistribution, legal, manufacturing and technology. Adversaries most often targeted health\ncare, as we anticipated last quarter given the spate of ransomware attacks targeting health\ncare organizations. It is worth noting there has been an increase in incidents involving Vatet\nmalware, which has been known to target health care organizations. CTIR identified a\npotential pattern in which regional hospitals associated with a hospital in a given state is\ninitially attacked and may serve as follow-on targets, particularly if they have active VPN\nconnections to the affected organization. There are many reasons why actors are continuing\nto target the health care industry, including the COVID-19 pandemic incentivizing victims to\npay to restore services as quickly as possible.\n\n## Threats\n\nRansomware continued to comprise the majority of threats CTIR observed. As opposed to\nlast quarter, which marked an absence of commodity trojans, the majority of these attacks\nrelied on commodity trojan maldoc phishes as an infection vector. Adversaries are continuing\nto use commercially available tools as well: Cobalt Strike was observed in half of all\nransomware attacks this quarter. There were also numerous ransomware engagements that\nleveraged open-source reconnaissance tools such as ADFind, ADRecon and Bloodhound.\nWindows utilities were common, as well. For example, PowerShell was observed in nearly\n65 percent of all ransomware attacks, while PsExec usage was observed in more than 30\npercent. Other observed tools included dual-use tools such as TightVNC and CCleaner and\ncompression tools such as 7-Zip and WinRAR.\n\nFor example, in an incident response engagement involving an education organization in the\nU.S., the target was initially infected via a phish containing a commodity trojan. In this case,\nthe phish contained a malicious Microsoft Excel attachment that executed the commodity\ntrojan Zloader when if the user enabled macros (CTIR assessed that this Zloader variant was\ncustomized for the target based on the fact that its file hash had not been previously\nobserved). An employee at this organization opened the attachment and forwarded it to a\ncolleague. The adversary then pivoted in the environment, leveraging the Group Policy\nreplication mechanism in Windows Active Directory to distribute Ryuk and using PsExec to\nmove laterally and execute remote commands in line with previous Ryuk behavior The\n\n\n-----\n\nadversaries obtained domain administrator (DA) credentials and, besides encrypting systems\non the network, also wiped backup indexes. More than 1,000 endpoints were encrypted,\ncausing significant damage to the organization, affecting Active Directory, DHCP, DNS and\nanti-virus software.\n\nIn December 2020, Cisco Talos became aware of a sophisticated supply-chain attack in\nwhich adversaries gained access to victims' networks via trojanized updates to SolarWinds'\nOrion software. This attack targeted numerous large enterprises and U.S. government\nagencies. CTIR engaged in several incident responses in which organizations had\nunknowingly installed the compromised update. Only one of these engagements involved\npost-compromise activity, such as malicious PowerUP PowerShell execution. PowerUP\nappears to be part of PowerSploit, and is a collection of PowerShell modules that are used to\nassist red teaming activities. While the PowerUP-like PowerShell script did not execute\nanything at this time, it appeared to be set up as a wrapper or utility, possibly for additional\ncode to be funneled into. CTIR continues to monitor for activity related to the SolarWinds\ncompromise.\n\nBeginning in March, CTIR has been responding to a growing number of incidents involving\nthe Microsoft Exchange vulnerabilities. In one engagement, a customer in the payment\nprocessor/technology sector saw no indication that CVE-2021-26855 was exploited. They\ndid, however, observe scanning behavior from a known IP address linked to these attacks,\nwhich sent packets to a particular Exchange server beginning February 28. In another\nengagement, a customer in the healthcare sector saw a CVE-2021-26855 exploit, though we\nhave yet to determine if the activity was just limited to scanning at this time. In one incident\nresponse engagement affecting an organization in Germany, we saw a slight deviation from\nthe post-exploitation activity in the aforementioned engagements. The activity started in\nmuch the same way, with the adversary installing web shells on the victim environment.\nHowever, prior to the deployment of web shells, the customer saw the Domain Admin\naccount password was reset via the presence of the \"Password last set\" attribute in Active\nDirectory (AD).\n\n## Initial vectors\n\nIt was difficult to identify an initial infection vector in many engagements last quarter due to\nshortfalls in logging. However, in engagements in which the initial vector could be identified,\nor reasonably assumed, phishing remained the top infection vector for the seventh quarter in\na row. The vast majority of these were comprised of maldoc phishes as mentioned above.\nHowever, there were also engagements involving business email compromise, such as when\nan employee at an entertainment company received a phish with a spoofed Microsoft Online\n\n\n-----\n\nlogin page, after which the adversary attempted to authenticate to their Office 365 account\nfrom multiple locations. The adversary successfully authenticated and bypassed MFA\nthrough use of a legacy application, highlighting the need to disable legacy protocols.\n\n[CTIR encourages all organizations to save their logs to make any potential incident response](https://blog.talosintelligence.com/2021/02/talos-takes-ep-42-seriously-folks-save.html)\nengagements more efficient and effective.\n\nOther notable initial vectors included exploitation of public-facing applications, such as an\n[education organization that had their F5 Load Balancer exploited via CVE-2020-5902 — a](https://support.f5.com/csp/article/K52145254)\nremote code execution vulnerability in f5 — in the course of a DDoS attack. There were also\n[several instances of exploitation of a vulnerability in Telerik UI, tracked as CVE-2019-18935.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-18935)\nTalos first saw an increase in actors exploiting Telerik UI in summer 2020 — a trend that\ncontinues today.\n\n## Top-observed MITRE ATT&CK techniques\n\nBelow is a list of the most common MITRE ATT&CK techniques observed in this quarter’s IR\nengagements. Given that some techniques can fall under multiple categories, we grouped\nthem under the most relevant category in which they were leveraged. This represents what\nCTIR observed most frequently and is not intended to be exhaustive.\n\n**Key Findings:**\n\nPhishing with malicious attachments and links accounted for a larger number of the\ninitial access techniques this quarter compared to the previous quarter.\nWe observed a variety of execution methods using native Windows utilities, such as\n“rundll32.exe” and “msiexec.exe”. The use of these utilities may avoid triggering\nsecurity tools due to them being commonly used in daily operations.\nEngagements involving cryptocurrency mining malware continue to be very low.\nHowever, the number of ransomware engagements nearly doubled this quarter.\nLeveraging valid accounts is the most observed lateral movement technique this\nquarter. RDP usage and remote access services, such as TightVNC, for lateral\nmovement, increased this quarter.\n\n\n-----\n\n**Initial Access (TA0027) — T1078 Valid Accounts: Credentials for a**\ncompromised account were leveraged by the adversary\n**Persistence (TA0028) — T1053 Scheduled Task/Job: Adversaries create a**\nscheduled task to run malicious executable every hour\n**Execution (TA0041) — T1204.002 User Execution: Malicious File: Adversary**\nsent phishing emails that contained a malware attachment when clicked, would\ndeploy additional tools to harvest credentials\n**Discovery (TA0007) — T1482 Domain Trust Discovery: Use AdFind**\n(“adfind.bat”) to query for all users, computers, groups, and trusts\n**Credential Access (TA0006) — T1003 OS Credential Dumping: Use tools**\nsuch as Mimikatz to compromise credentials in the environment.\n**Privilege Escalation (TA0029) — T1484 Group Policy Modification: Force**\ngroup policy update that creates service to execute ransomware.\n**Lateral Movement (TA0008) — T1021.001 Remote Desktop Protocol:**\nAdversary connects to the system using RDP with valid credentials\n**Collection (TA0035) — T1560.001 Archive Collected Data: Archive via**\n**Utility: 7-Zip used to compress a file containing dumped LSASS credentials**\n**Defense Evasion (TA0030) — T1070 Indicator Removal on Host: Remove**\nfiles and artifacts from the infected machine\n**Command and Control (TA0011) — T1132.001 Data Encoding: Standard**\n**Encoding: Use Base64 to encode C2 communication**\n**Exfiltration (TA0010) — T1567 Exfiltration Over Web Service: Exfiltrated data**\nwas located on a file sharing site\n**Impact (TA0034) — T1486 Data Encrypted for Impact: Deploy Ryuk**\nransomware\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-24 - Quarterly Report- Incident Response trends from Winter 2020-21.pdf"
    ],
    "report_names": [
        "2021-03-24 - Quarterly Report- Incident Response trends from Winter 2020-21.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535745,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653750801,
    "ts_modification_date": 1653750801,
    "files": {
        "pdf": "https://archive.orkl.eu/e541252fd764f5b220ba1397a32fc5b3068bcb26.pdf",
        "text": "https://archive.orkl.eu/e541252fd764f5b220ba1397a32fc5b3068bcb26.txt",
        "img": "https://archive.orkl.eu/e541252fd764f5b220ba1397a32fc5b3068bcb26.jpg"
    }
}