{
    "id": "5237c919-3b9c-4c44-a189-d77ebf92cb6b",
    "created_at": "2023-01-12T15:01:20.629995Z",
    "updated_at": "2025-03-27T02:08:33.29041Z",
    "deleted_at": null,
    "sha1_hash": "c65913bf65abcd5b0e0a99dc7bc1dca126c088e2",
    "title": "2020-08-10 - DiamondFox - Bank Robbers will be replaced",
    "authors": "",
    "file_creation_date": "2022-05-28T02:39:50Z",
    "file_modification_date": "2022-05-28T02:39:50Z",
    "file_size": 4597556,
    "plain_text": "# DiamondFox - Bank Robbers will be replaced\n\n**fr3d.hk/blog/diamondfox-bank-robbers-will-be-replaced**\n\n1. You are here: [fr3d.hk](https://fr3d.hk/blog/)\n[2. Malware](https://fr3d.hk/blog/category/malware)\n[3. DiamondFox - Bank Robbers will be replaced](https://fr3d.hk/blog/diamondfox-bank-robbers-will-be-replaced)\n\nAugust 10, 2020 - Reading time: 43 minutes\n\nDiamondFox Kettu is the newest addition to the DiamondFox family. In this post, I will be\nanalysing and discussing how it functions, its encryption, and how it achieves its modularity.\n\n## Foreword\n\n[First, I would like to give a huge thank you to Casperinous for his amazing help with the](https://twitter.com/Casperinous)\n[config decryption, and to Steve Ragan for editing and reviewing this analysis. This post has](https://twitter.com/steved3)\ntaken some time to write due to my desire to create an in-depth look at this piece of malware.\n[For updates and information about my work follow me on twitter @fr3dhk.](https://twitter.com/fr3dhk)\n\n## Overview\n\nDiamondFox is a well known family within the commodity malware market. The creator has\nbeen working on it for a while, and has iterated through quite a few different names and\nversions. The previous version had the codename \"Renard\" which is French for fox, this\nversion's codename is \"Kettu\".\n\n\n-----\n\nDiamondFox is sold in many blackhat communities by a user named edbitss, along with his\nother piece of malware, GlitchPOS. A large selling point of DiamondFox is that it's a modular\npiece of malware. It has been developed so it supports the ability for the user to add plugins\ninto the panel, which will then be executed by the malware. Because of this modularity, the\nseller has decided to sell different parts of his malware for different prices.\n\nPrices:\n\nBotkiller - 100$\nJabber notifier - 50$\nCookies grabber - 100$\nUAC bypasser - 100$\nHidden ammyy admin - 150$\nFile stealer - 150$\nStealers (browsers, IM, FTP, RDP and web history) - 100$\nPersistence - 100$\nKeylogger - 100$\nRemote console - 100$\nCrypto hijacker - 100$\nBolt - 200$\nUSB spread - 100$\nBot - 600$\nVideo recorder - 200$\nWallet stealer - 100$\n\nAs you can see, this is a somewhat pricey piece of code. It is also a very capable piece of\nmalware with lots of different plugins. The malware is controlled through an HTTP command\nand control server (C2) which is written in PHP, I'll be discussing the C2 at the end of this\n\n\n-----\n\npost. DiamondFox is written in VB6 and the main part of the malware provides some\ncommonly found features, here are some of them.\n\nEncrypted C2 communications & namecoin support\nUnicode\nScreenshots\nSmall binary size around 90kb\nAnti-analysis\nNative binary\nPersistence & self-destruction\n\nDiamondFox bases its initial functionality on a config that is set during the building of the\nbinary. This is encrypted so we will need to decrypt it before we proceed with the rest of this\nanalysis.\n\n## Configuration & Decryption\n\nDue to the malware being written in VB6, we can use certain tools to decompile the malware\ninto p-code, and then within the same tool, export a pseudo representation of the control flow\nof the malware. Because the tool does not support analysis functions such as being able to\nrename functions, and variables, I have had to export the entire pseudo code representation\ninto a text file and then open it in my favourite text editor. In the following screenshots you\nwill see the code that I have analysed and renamed, please take some function names with a\ngrain of salt as I may have given them a generic name.\n\nEncrypted Config\n\nIn the above image you will see the function named EncryptedConfig. This function contains\n8 encrypted strings that it proceeds to combine into one long string which is then returned.\nWe can determine that this is the encrypted config as it's one of the first functions called\nwithin main.\n\n\n-----\n\nDecrypt Config\n\nIn main we see the first first use of the EncryptedConfig function. Before the malware\ndecrypts the configuration it will first use a different decryption method to decrypt a string.\nThis string encryption is used throughout the malware to evade analysis. Looking at the\n_DecryptString function we see the following._\n\nDecrypt String VB\n\n[I have rewritten this function in python (link) so that I can decrypt the rest of the strings within](https://pastebin.com/raw/0vEEaSae)\nthe malware. Now I can go back and decrypt the string before the config decryption. We can\npresume that the newly decrypted string is our cipher key for the config decryption as it is\npassed as a paramater to the decryption function.\n\nDecrypt Function\n\nAfter going through the malware I realised that the malware base64 decodes the config and\nthen uses AES to decrypt the config. Knowing this I then started looking for an IV which\n[made me come across the source code (link) for the class the malware author has used.](http://read.pudn.com/downloads148/sourcecode/crypt/639967/aes_vb/AES%20128/Rijndael.cls__.htm)\n\n\n-----\n\nThis source code made it clear that the AES method is ECB and that the malware author\nalso uses encoding to inflate and deflate the configuration. I used the previously decrypted\n[cipher key and plugged it into a recipe (link) I have cooked up in CyberChef (link) to recreate](https://gchq.github.io/CyberChef/#recipe=From_Base64('A-Za-z0-9%2B/%3D',true)AES_Decrypt(%7B'option':'UTF8','string':'REPLACEME'%7D,%7B'option':'Hex','string':''%7D,'ECB','Raw','Raw',%7B'option':'Hex','string':''%7D)Raw_Inflate(0,0,'Adaptive',false,false)&input=%5Bobject%20Object%5D,%5Bobject%20Object%5D,%5Bobject%20Object%5D)\nthe config decryption process.\n\nCyberChef\n\nThe config will determine the following.\n\nC2 URLs\nUser Agents\nC2 Encryption keys\nTimers\nAntis\nInstallation\nStartup\n\nThe key for the decryption of the config will be different per build along with other parts of the\nconfiguration. Once the configuration is decrypted different globals will be set so that the\nmalware can determine its functionality.\n\n## Installation & Evasion\n\nBefore the malware begins with its persistence and evasion mechanisms it will first begin by\nchecking if the anti-analysis options are enabled within the malwares config. If it is enabled\nthen there are a bunch of different if statements that will call some anti-analysis methods.\nThe important methods we see employed by the malware is the checking of DLLs.\n\n\n-----\n\nAnti-Analysis method\n\nThe malware will attempt to load a few different libraries that are commonly found within VM\ninstallations. Along with this check the malware attempts to turn off windows defender if the\nuser is an admin.\n\nAnti Windows Defender\n\nIf these checks pass and the malware determines that it isn't running within a virtual machine\nit will then proceed with the installation and persistence of the malware. Persistence begins\nwith DiamondFox determining its installation path from its configuration. Once this directory\nhas been determined the malware will check the location of where it is currently running and\ncompare it with this install location. If they do not match DiamondFox will create the\ninstallation directory and then use the following commands in powershell to copy itself to the\ninstallation directory.\n\nDrop & Start\n\nOnce the malware has copied itself using powershell and the newly copied malware has\nbeen started then it will proceed to 'melt' which is a term for deleting itself. This is again done\nwith powershell\n\n\n-----\n\nMelt\n\nThe malware exits once this command has been executed and we move our analysis to the\nnewly started malware in the installation location. To achieve startup persistence the\nmalware will first check if this functionality is enabled within its configuration. If it is then\nDiamondFox will again make use of powershell to create a shortcut file and place it within the\nstartup folder for the user.\n\nCreate Startup\n\n## Command & Control Communications\n\nDiamondFox's command and control communications are done over HTTP where they are\nencrypted and sent from the malware to a web server running PHP. Before the malware can\nbegin communications it must first resolve the C2s domain. A feature that sets DiamondFox\napart from competing malware is the ability to use namecoin domains. To achieve this the\n[malware makes use of the following (link) to be able to easily query namecoin domains.](https://github.com/B-DNS/Resolver/)\nOnce the C2 domain has been resolved the malware can then make its first connection to\nthe C2. The malware then checks each of the gates within the config to be able to find the\ncorrect one.\n\n\n-----\n\nCheck Gates\n\nThe malware iterates through each gate and then requests it with a unique user-agent that\nhas been specified in the configuration. Along with this the malware has a decryption key\nthat will be verified with the C2. Once a C2 has been verified it will then be set into a global\nand be used as the main gate. Now that the malware has the correct gate to use, it will then\nbegin by collecting some system information through WMI.\n\nPC Info\n\nAlong with this information we also see the malware collecting running processes and\ninstalled programs. On top of DiamondFox collecting basic information about the infected\ncomputer it also includes some windows environment information.\n\n\n-----\n\nMore Info\n\nDiamondFox communications are encrypted with 128-bit AES, this time the first 16 bytes of\nthe connection key is used as the AES cipher key. The malware determines a field to use\nwithin the POST request which is determined by the following logic to create a unique field.\n\nGate Check-In\n\nNow that DiamondFox has the correct gate to use and has collected all of the relevant\ninformation about the infected computer it will send a POST to the gate with the information\nencrypted within the uniquely generated field. Our encryption key for this piece of malware is\n'aadd2492be4f9f28' and the generated field is 'a98' which you can see below.\n\nGate Post\n\nThe C2 will receive this post and handle it. Then if the user of the malware has created a\ntask to download and execute malware the POST request will be replied to by the C2 with\nthe file that needs to be downloaded and executed. Retrieving the payload is done in two\nways, if the malware is being hosted on the C2 then the malware will request the gate with\nthe gf URL parameter containing the files name This stands for get file and will return the file\n\n\n-----\n\nrequested. If the file is a remote file then the malware will request the gate with the grf (get\nremote file) URL parameter and the C2 will then proceed to use CURL to proxy the file to the\nmalware. Once the malware has dealt with the download and execute task it'll then proceed\nto report this to the C2.\n\nDiamondFox is also able to exfiltrate different files, the first file that is uploaded is a\nscreenshot of the infected host. Once the screenshot has been taken the malware will send\na POST request to the C2 with the screenshot in the POST body. The gate also uses\nanother uniquely generated URL parameter named slots. This parameter is generated from\nthe first 3 characters in the communications' encryption key. Because our encryption key is\n'aadd2492be4f9f28' then the slots URL parameter will be 'aad' as seen below.\n\nScreenshot Upload\n\nThe C2 determines what the uploaded file is by its extension. Here is the list of the\nextensions and their meaning.\n\njpg - Screenshot\nlog - Keylogger logs\nhst - Web history\npw - Stealer logs\nftp - FTP logs\nins - Software instances\nml - Email logs\nrdp - RDP logs\ncc - RAM scraper logs\nwallet - Wallet stealer logs\n\nDiamondFox will also ban IPs that seem to be attempting malicious things. These include\ntrying to enumerate information through the C2 and connecting to the gate with the incorrect\nuser-agent.\n\n## Plugin System\n\n\n-----\n\nDiamondFox has an extensive plugin system which is one of its main selling points. These\nplugins are distributed by the seller in the form of an encrypted DLL with the extension .pack\nand a codename. The pack files can then be uploaded to the C2 and their functionality can\nbe changed accordingly within the control panel. DiamondFox handles plugins by first\nrequesting the C2 gate with the URL parameter 'pl=1' which stands for plugin list. The C2\nresponds with a comma separated list of all the plugin ids that are enabled.\n\nDecrypted Plugin List\n\nThe malware will receive this text and split it into an array of plugin ids. For the first 6\npossible plugins the malware will iterate through the array and check if any of the first 6\nplugins are enabled. If a plugin is enabled within these first 6 then it will be retrieved using\nthe URL parameter of 'p' which is equal to the plugin id.\n\nRetrieve First 6 Plugins\n\nEach plugin is uniquely encrypted with its own AES 128-bit cipher key. Once DiamondFox\nhas retrieved the plugin with the 'p' URL parameter it will then proceed to get the plugin\npassword using the 'gpp' URL parameter which will return an encrypted cipher key. This\ncipher key is then used to decrypt the retrieved plugin. Here is a list of all the plugins along\nwith their codenames, decryption keys and other important information.\n\n\n-----\n\nPlugin List\n\nWithin this MySQL table we see a column named 'install', this refers to whether the plugin\nshould be constantly run or just run once. The first 6 plugins are not installed and are all\ncredential stealers, hence why they are done seperately. Each of these first 6 plugins will\nwrite their stolen credentials to a log file in the malware install path with the name scheme of\ntheir id + '.log'. The malware will execute the DLL and wait until this log file is available to be\nsent to the C2. This upload is again done with the slots parameter which in our case is 'aad'.\n\nUpload Stolen Credentials\n\nOnce the malware has handled the first 6 plugins it then continues onto a different system\nwhere it requests the C2 with a URL parameter of 'lp' which will return a list of a comma\nseparated array of all the plugin ids that are enabled and have install enabled. These can be\nseen in the table above.\n\nGet Install Plugins\n\nThe malware will then iterate through each of the plugins returned by the C2 and call\nthe HandleInstallPlugin function so that each of these plugins can be ran.\n\n\n-----\n\nAll installed plugins are kept in a directory named modules within the installation directory. If\nthis directory does not exist then it will be created. Plugins are written to this directory with\nthe name scheme of their id + '.dll'. When the HandleInstallPlugin is called on a plugin then it\nis first checked to see whether it already exists within the 'modules' directory. If it doesn't\nthen the malware will retrieve it from the C2 and decrypt it. The plugin is retrieved with the\nURL parameter 'gpb' which is assigned to the plugin ID.\n\nMost of the installed plugins have a configuration that also needs to be retrieved. The\nconfiguration file name is retrieved with the 'pcn' URL parameter which is set to the id of the\nplugin (pcn standing for plugin config name). The C2 will then respond with the filename of\nthe plugin config to be written to within the install folder.\n\nFile Stealer Config Name\n\nIf the C2 returns a config filename for the plugin then the malware will proceed to request the\nconfig from the C2 with URL parameter 'lpc' (load plugin config) which is equal to the plugin's\nid. This is then written into the plugin's configuration file. Here's an example of the\nconfiguration returned for the file stealer plugin.\n\nFile Stealer Configuration\n\nThe configuration for each malware will vary but parameters are always split by pipes. The\nplugin's password is then retrieved from the C2 with the already seen URL parameter of\n'gpp'. The malware then loads the decrypted DLL and runs it. The output of the dll is then\nwritten to a log file and the log file is uploaded to the C2. I'll now concentrate on some\ninteresting plugins but there are too many to cover in one post so I'll just be giving an\noverview of some of the interesting ones. Here's a table summarising.\n\n\n**URL**\n**Parameter**\n\n\n**URL Example** **Description** **Example Decrypted**\n**Response**\n\n\n-----\n\npl http://c2.com/gate.php?\npl=1\n\np http://c2.com/gate.php?\np=2\n\ngpp http://c2.com/gate.php?\ngpp=2\n\nlp http://c2.com/gate.php?\nlp=1\n\ngpb http://c2.com/gate.php?\ngpb=9\n\npcn http://c2.com/gate.php?\npcn=9\n\nlpc http://c2.com/gate.php?\nlpc=9\n\n\nEnabled plugin list 1,2,3,4,5,6\n\n\nRetrieve encrypted\nplugin DLL\n\n\nPlugin DLL\n\n\nGet plugin password a4d54e4e6a1e87c4\n\nInstall plugin list 9,10,11,12,13\n\n\nRetrieve encrypted\nplugin DLL\n\nRetrieve plugin config\nfilename\n\n\nPlugin DLL\n\nsearch.conf\n\n\nGet plugin config *.wallet|ALL|100|200\n\n\nAnd here is what the install folder looks like after these plugins have been ran.\n\nInstall Folder After Plugins\n\nIn the above image you can see the configuration files for different plugins and the folder that\nwill contain videos for the screen recorder plugin. Here's the contents of the modules folder.\n\n\n-----\n\nModules\n\nAbove is the encrypted DLL modules.\n\n## Hidden RDP\n\nDiamondFox offers a hidden remote control of an infected computer as one of its many\nplugins. Although this is named as hidden RDP it does not make use of the windows RDP\n[service and instead will utilise the remote access tool called Ammyy Admin (link). Ammyy](http://www.ammyy.com/en/)\nAdmin is commonly used in tech support scams and is also the base for the FlawedAmmyy\n[malware (link). Unlike other plugins DiamondFox will only trigger this plugin if the user has](https://malpedia.caad.fkie.fraunhofer.de/details/win.flawedammyy)\ncreated a task for an infected computer to start the hidden RDP process. When opening\nAmmyy Admin you will be greeted with the following.\n\n\n-----\n\nAmmyy Admin works by creating a unique ID and password for your computer that you can\nshare with someone else who will then proceed to be able to connect to your computer using\nthese credentials. But this would create issues for DiamondFox as it must run Ammyy Admin\nwithout notifying the user whilst also being able to pass the client ID and password back to\nthe C2 for malicious users to exploit. So to combat these issues DiamondFox uses the\n[following exploit (link) to hide the GUI, set a specified password and also know the location](https://www.exploit-db.com/exploits/31182)\nof the infected user's ID in memory. Here's main where we can see the plugin making use of\nthis exploit (I have renamed functions for clarity).\n\nHRDP Main\n\nWe initially see a mutex being created so that the plugin isn't running twice. Then the\nmalware will make sure that the 'ID.txt' file does not exist in APPDATA as this is where it'll\nwrite the infected user's Ammyy Admin client ID. The malware will then create a directory in\nthe 'ProgramData' directory named 'AMMYY'. Once this directory has been created then the\nmalware will write the authentication bypass files to this folder. The malware will then\nproceed with process injection into Windows Media Player.\n\n\n-----\n\nInject Ammyy Admin\n\nThe process injection is done by first locating where the Windows Media Player binary is\nlocated and then loading the Ammyy Admin binary from resources. The Ammyy Admin\nbinary is then injected into a newly started Windows Media Player process. The process\ninjection will also make use of the -nogui exploit within the injected process so that Ammyy\nAdmin does not display anything to the user. The malware will then proceed with another\nprocess injection.\n\nStart Loader\n\nThe malware loads another binary from resources which is responsible for reading the client\nID from memory and then writing it to the 'ID.txt' file in APPDATA. The ID.txt file contents is\nthen uploaded to the C2 for the user to then be able to connect to the infected computer.\n\n## Remote Console\n\nIf the user wants to start a remote shell for their infected computer then they can do it\nthrough the remote console plugin. This plugin allows the user to be able to command a\nremote command-line instance on the infected computer. Like the hidden RDP plugin this\nplugin is only triggered upon user trigger. Here's what this looks like for the user.\n\n\n-----\n\nDiamondFox Remote Console\n\nWhen the plugin is triggered we see the same process of DLL loading. Once the DLL is\nloaded the plugin begins by creating a mutex and then proceeding with checking in with the\nC2. This is done by setting a URL parameter of 'cmd' which is equal to a base64 encoded\nstring of the infected computers HWID + '|Connected'. Let's take a look at the plugins main.\n\nShell Main\n\nWe see the main loop which will request the C2 looking for commands. If it gets a run\ncommand then a file will be dropped to the disk and then run using powershell. Other\ncommands will be ran through a hidden command-line with width and height set to 0.\nStandard input output will be used to enter and retrieve commands from this hidden CMD\nprocess and the output will then be sent back to the C2 to be displayed by the user.\n\n## Persistence\n\n\n-----\n\nTo keep the infected user from being able to kill the DiamondFox process the developer has\ncreated a plugin to watch the DiamondFox process and restart it if it has been stopped. The\nplugin begins by determining if the infected computer is using a 32bit or 64bit architecture. If\nthe victim is using 32bit then the malware will get the x86 program files directory or if the host\nis 64bit then it'll get the program files directory. Once it has a directory to use it will iterate\nthrough the sub directories and find the first directory that contains an executable. When an\nexecutable has been found the malware will load another binary from resources and inject it\ninto the chosen executable.\n\nThe injected executable will proceed to copy the main DiamondFox binary and watch the\nprocess of the malware. If the process stops then the malware will use powershell to restart\nthe process. If the file is deleted then the plugin will drop the copied binary and start the\nprocess.\n\n## UAC Bypass\n\nTo give the malware a stronger hold on the infected computer DiamondFox makes use of\nUser Access Control (UAC) bypasses to be able to gain higher privileges. When the plugin is\nloaded it begins by querying two registry keys.\n\nUAC Checks\n\nThese checks will query the registry keys that determine if any attempts at elevation of\nprivileges will create a visual prompt for the administrator of the infected computer. If the\nattempts will create visual prompts then the plugin will exit. If not then the UAC bypass plugin\nwill then query the windows product name and if the version of windows is not supported\nthen the plugin will exit.\n\nUAC Product Name Checks\n\n\n-----\n\nI m not going to reiterate all the different bypasses DiamondFox uses as they have been\ndescribed in more depth elsewhere. Here are the bypasses it uses as of writing this analysis.\n\n[wsreset.exe (link)](https://lolbas-project.github.io/lolbas/Binaries/Wsreset/)\n[sdclt.exe (link)](https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/)\n[fodhelper.exe (link)](https://pentestlab.blog/2017/06/07/uac-bypass-fodhelper/)\n[eventvwr.exe (link)](https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/)\n\n## C2 & Panel\n\nHere are some screenshots of the inside of the panel.\n\nLogin\n\n\n-----\n\nDashboard\n\nClients\n\n\n-----\n\nClient\n\nStatistics\n\n\n-----\n\nReports\n\nSettings\n\n\n-----\n\nPlugins\n\nTask Manager\n\n## Epilogue\n\n\n-----\n\nDiamondFox is a very capable piece of malware with many features and plugins. Although\nsome plugins seem to be very basic the malware comes together as a very dangerous piece\nof kit. This analysis took longer than I had planned so I have left out a few of the plugins. I\nmay come back to write about these if I see it as necessary. I hope that this was a beneficial\nanalysis and until the next time, goodbye & thanks for reading!\n\nIOC\n\n4440d9bb248b6ecb966eef7af0ec276c\n[https://tria.ge/200812-vc8ftkz17s/](https://tria.ge/200812-vc8ftkz17s/static1)\ntimesync.live\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-10 - DiamondFox - Bank Robbers will be replaced.pdf"
    ],
    "report_names": [
        "2020-08-10 - DiamondFox - Bank Robbers will be replaced.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535680,
    "ts_updated_at": 1743041313,
    "ts_creation_date": 1653705590,
    "ts_modification_date": 1653705590,
    "files": {
        "pdf": "https://archive.orkl.eu/c65913bf65abcd5b0e0a99dc7bc1dca126c088e2.pdf",
        "text": "https://archive.orkl.eu/c65913bf65abcd5b0e0a99dc7bc1dca126c088e2.txt",
        "img": "https://archive.orkl.eu/c65913bf65abcd5b0e0a99dc7bc1dca126c088e2.jpg"
    }
}