{
    "id": "523cf0ab-2954-4f4b-9c5c-9696395946f8",
    "created_at": "2023-01-12T14:59:06.497539Z",
    "updated_at": "2025-03-27T02:05:42.136198Z",
    "deleted_at": null,
    "sha1_hash": "09d143f02d5e9fd38eddb13da3cff68fd09ca64b",
    "title": "2014-11-10 - Thoughts on Absolute Computrace",
    "authors": "",
    "file_creation_date": "2022-05-27T21:15:10Z",
    "file_modification_date": "2022-05-27T21:15:10Z",
    "file_size": 753045,
    "plain_text": "# Thoughts on Absolute Computrace\n\n**[bartblaze.blogspot.de/2014/11/thoughts-on-absolute-computrace.html](https://bartblaze.blogspot.de/2014/11/thoughts-on-absolute-computrace.html)**\n\n[Introduction](http://bartblaze.blogspot.com/2014/11/thoughts-on-absolute-computrace.html#Introduction)\n\n[Binaries & BIOS information & characteristics](http://bartblaze.blogspot.com/2014/11/thoughts-on-absolute-computrace.html#BIOS)\n\n[How to determine if you have Absolute Computrace installed](http://bartblaze.blogspot.com/2014/11/thoughts-on-absolute-computrace.html#determine)\n\n[How to remove or uninstall Absolute Computrace](http://bartblaze.blogspot.com/2014/11/thoughts-on-absolute-computrace.html#uninstall)\n\n[Absolute Computrace FAQ](http://bartblaze.blogspot.com/2014/11/thoughts-on-absolute-computrace.html#FAQ)\n\n**Introduction**\n\nNot too long ago my friend and colleague from Sweden, Jimmy, contacted me in regards to a\nstrange issue. In the firewall, he saw tons of outgoing connections to a certain server:\n\n\n-----\n\n_Each second outgoing connection to search.namequery.com_\n\nA quick Google search revealed this was actually part of Absolute's Computrace tool - aka\nAbsolute Persistence. Doesn't ring a bell? Try Lojack. From their website:\n\n_List of BIOS & firmware compatibility:_ _http://www.absolute.com/en/partners/bios-_\n\n_compatibility_\n\nWhy would this be an issue? First of all, there has been some excellent research by Anibal\n[Sacco and Alfredo Ortega here: Deactivate the Rootkit, in which they describe attacks on](http://corelabs.coresecurity.com/index.php?module=Wiki&action=view&type=publication&name=Deactivate_the_Rootkit)\nBIOS anti-theft technologies, which Absolute also offers. An excerpt from their paper:\n\n_In order to be an effective system, the anti-theft agent must be stealthy, must have_\n_complete control of the system, and most importantly, must be highly persistent_\n_because wiping of the whole system most often occurs in the case of theft._\n\n_This activity is also consistent with rootkit behavior, the only difference being that_\n_rootkits are generally malicious, while anti-theft technologies act as a form of protection_\n_against thieves._\n\nSecondly, there has been research from Kaspersky as well on the subject, read their blog\npost here: [Absolute Computrace Revisited](http://securelist.com/analysis/publications/58278/absolute-computrace-revisited/)\n\nI advise you to read their post, as it provides excellent information as well. I'm not going to\nrepeat their research here, as it's pretty extended. What you should remember however:\n\n_While Absolute Software is a legitimate company and information about Computrace_\n_[product is available on the company's official website, the owner of the system claimed](http://www.absolute.com/ru-ru)_\n_he had never installed Absolute Computrace and didn't even know the software was_\n_present on his computer. It could be assumed that the software was pre-installed by an_\n_OEM manufacturer or reseller company, but according to an Absolute_\n_Software_ _[whitepaper this should be done by users or their IT service. Unless you have](http://www.absolute.com/en/resources/whitepapers/absolute-persistence-technology)_\n_a private IT service or your PC vendor took care of you, someone else has full access_\n_and control over your computer._\n\nBack to our post. After booting the machine and pressing F1 to access the BIOS settings, we\nare presented with the following screen:\n\n\n-----\n\n_Lenovo ThinkPad (BIOS version: J9ET58WW)_\n\nThis was the initial state of Computrace in the BIOS. The setting was Enabled and the state\nindicated Not Activated. This suggests Computrace is not active on the machine... Wrong!\n\nThe Item Specific Help reads:\n\n_Enables or disables the UEFI interface to activate Computrace module. Computrace is an_\n_optional monitoring service from Absolute Software._\n\n_[Enabled] Enables the Computrace activation._\n\n_[Disabled] Disables the Computrace activation._\n\n_[Permanently Disabled] Permanently disables the Computrace activation._\n\nThe machine was freshly bought and the user never ordered, installed or even heard of\nComputrace software. In this case, the reseller didn't install it either. This leaves the option\nthe manufacterer or a possible previous owner [or someone else] installed Computrace.\n\n... When we want to permanently disable Computrace:\n\n\n-----\n\n_Computrace module activation warning_\n\nHere comes the fun part: even after permanently disabling the Computrace module, the\nsoftware was still active and running; contacting the server (search.namequery.com) like\ncrazy.\n\nI decided to contact Absolute Software in order to get an answer as to why this behaviour\n[was occurring. Since neither of us are customers, I used the form here to contact them.](https://www.absolute.com/en/support/contact/security)\n\nAfter two days I got a reply from their customer service. In reply as to why permanently\ndisabling didn't seem to work:\n\nIt is also worth noting that many used or refurbished devices may have motherboards\nwith a Computrace BIOS module that was activated by the previous owner. In these\ncases, my recommendation would be the following:\n\n1.    Obtain and install any missing or outdated HECI\\Intel Management\\IMEI drivers\nfrom the manufacturer. Once these drivers are in place, any potential Absolute\nsoftware installed on the computer will correctly communicate with the BIOS and it\nshould automatically deactivate itself over the course of a few days.\n\n2.    Contact the manufacturer and request a motherboard replacement. Activated\nmotherboards should not be re-sold by manufacturers or retailers if the necessary deactivation steps are not taken first.\n\nReason for seeing numerous outgoing connections to their server is probably due to their\nmodule wanting to receive instructions from the server that the original license should no\nlonger be active, or to download new binaries.\n\n\n-----\n\n**Binaries & BIOS information & characteristics**\n\nThere's already a good list available by Kaspersky which I'm not going to repeat here. You\n[can find that list on this link.](http://securelist.com/analysis/publications/58278/absolute-computrace-revisited/#03)\n\nHowever, the following points are worth noting:\n\nTwo new binaries (different hashes) have been identified:\n**ad73c636bb2ead416dfa541a74aea016 (wceprv.dll)**\n**4011590af6f13a42a869ae57d6174f4f (rpcnetp.exe)**\n\n[Several files are packed with UPX](http://upx.sourceforge.net/)\n\nThe wceprv.dll module has a Digital Signature which is issued to\n_Absolute Software Corp. Serial_\nNumber: 35:ba:ec:87:59:d7:84:62:c3:d2:b7:ff:d4:c4:6e:51\n[Machines will have an altered Master Boot Record (MBR); this is because Computrace](http://en.wikipedia.org/wiki/Master_boot_record)\nparses the MBR and partition table - it writes some data into the sectors before the\n[primary partition. According to the patent (US 20060272020 A1):](http://www.google.co.in/patents/US20060272020)\n_In another embodiment, the CLM is stored in a substitute Master Boot Record (MBR),_\n_or a combination of the foregoing._\n\nCLM or Computrace Loader Module is one of Computrace's main modules. (besides the\nAdaptive Installer Module (AIM) and the Communications Driver Agent (CDA) - see the\npatent for reference)\n\n**How to determine if you have Absolute Computrace installed**\n\nFirst things first: check in the BIOS if there's a mention of Absolute Computrace somewhere:\n(re)boot your machine and access the BIOS with one of the Function keys on your\nkeyboard.\n\nTypically, this is F2, but may differ. See here for a complete list:\n[BIOS Setup Utility Access Keys for Popular Computer Systems](http://pcsupport.about.com/od/fixtheproblem/a/biosaccess_pc.htm)\n\nSecondly, see if any of the files mentioned in Kasperky's blog post are running or exist on the\nfile system. For the full list see [here, but keep in mind the two new additional hashes added](http://securelist.com/analysis/publications/58278/absolute-computrace-revisited/#17)\nabove.\nNote that new hashes may pop-up as well.\n\nThirdly, network activity as mentioned in above blog post.\n(but mainly to search.namequery.com or 209.53.113.223)\n\n**How to remove or uninstall Absolute Computrace**\n\n\n-----\n\nI won t provide any specific information on how to remove or uninstall Computrace, as its\nmain purpose is still - and I quote:\n\n_[...] to perform preemptive and reactive security measures to safeguard a missing, lost,_\n_or stolen device and the data it contains. With Computrace Mobile you can determine_\n_the location of the device and whether or not it’s on the move. You can also freeze it to_\n_prevent unauthorized access and send a message to the user to validate the status of_\n_the device. If the device contains important information, you can remotely retrieve files_\n_or delete them immediately. And you can generate an audit log of the data that’s been_\n_removed so you can prove compliance with corporate and government regulations._\n\nHowever, should you have bought (what you believe is) a new machine and it is apparent\nComputrace is active, download the latest drivers fit for your system:\n[Download BIOS drivers Also find information on How to Update Your Computer's BIOS.](http://drivers.softpedia.com/get/BIOS/)\n\nWhen correctly executed and the option for Computrace in the BIOS is set to Permanently\nDisabled, it should correctly disable itself - taken into account the original license has\n**expired or the original owner deactivated it, if existent.**\n\nAnother option would be to request a motherboard replacement for your machine, as\nsuggested above. Additionally you may reinstall the Operating System afterwards.\n\n**Absolute Computrace FAQ**\n\n**Is Computrace malicious?**\nNo.\n\n**Which devices does Computrace support and may be installed on?**\n\n[(Source)](http://www.absolute.com/en/resources/datasheets/absolute-computrace-mobile)\n\n\n-----\n\nSo yes, it s possible Computrace is installed on any other of your (mobile) devices. If you re\nlooking for pointers, once again look for outbound connections to *.namequery.com or\n*.absolute.com.\n\n**Which firmware or BIOS brands does Computrace support and may be installed on?**\n\nAcer\nApple\nASUS\nDaten\nDELL\nFujitsu\nGammaTech\nGeneral Dynamics Itronix\nGetac\nHP\nLenovo\nMicrosoft\nMotion\nNEC\nPanasonic\nSamsung\nSony\nToshiba\nWinmate\nXplore Technologies\n\n**How recent was the Computrace agent variant you found?**\nI added this question as to compare it with Kaspersky's binary- which was compiled in June\n2012\n\n\n-----\n\n_This variant of the Computrace agent was compiled in May 2012 (assuming it's not_\n\n_altered)_\n\nAnother version of Computrace was found. Note that this is possibly due to small updates of\nthe loader or agent module.\n\n**Will flashing the BIOS remove Computrace?**\nNo, as it resides in a non-flashable portion of the BIOS.\n\n**Will downloading the latest BIOS drivers for my machine remove Computrace?**\nSee \"How to remove or uninstall Absolute Computrace\".\n\n**I'd like to see more information about my BIOS/EFI/coreboot/firmware/optionROM.**\n[You can use the excellent tool flashrom. If you are using anything but Windows, Anibal and](http://flashrom.org/Flashrom)\nAlfredo have also written a Python program to to dump the BIOS firmware and search for a\nCompuTrace Option ROM: [dumpComputrace.py (Note: you'll need to apt-get](http://corelabs.coresecurity.com/index.php?module=Wiki&action=attachment&type=publication&page=Deactivate_the_Rootkit&file=dumpComputrace.py)\nflashRom/dmiDecode/UPX)\n\n**What if I'm a customer of Computrace and have doubts or want more information?**\nBest thing to do is call them directly: +00 1 877 337 0337 (US number), choose option #1.\nThe general number in Europe is: +44 118 902 2005 and for Asia: +65 6595 4594\n\nMore information on how to contact them as existing customer can be found here:\n[Absolute Software Support](https://www.absolute.com/en/support/absolute-computrace)\n\n**What if I'm not a customer of Computrace and have doubts or want more information?**\nYou can still use the numbers above if you like, or you can use the Absolute Software\nContact Form.\n\n**What if I suspect I bought a stolen machine which has Computrace installed?**\nContact Absolute Software (see above)! They will set up a case together with you and law\nenforcement.\n\n**Is there similar software out there like Computrace?**\n[Yes, but it is not exactly the same as Computrace. An example is Prey. Another example](https://preyproject.com/)\nis Intel's Anti-Theft Technology - which apparently will cease to exist in January 2015.\n_Source:_\n[Intel Anti-Theft Service FAQ](http://www.intel.com/content/www/us/en/architecture-and-technology/anti-theft/intel-anti-theft-service-faq.html)\n\nNowadays, most Antivirus vendors also offer some form of anti-theft. For more information,\nrefer to the corresponding websites of the vendors.\n\n**Why did you decide to write this blog post?**\nTo provide even more additional & useful information, as well as out of sheer interest.\n\n\n-----\n\n**Do you have any additional information to share?**\nYes, see right below in the Resources section.\n\n**Resources**\n\nAbsolute Software - [Perspective on Kaspersky Report & FAQ](http://www.absolute.com/en/about/pressroom/research/kaspersky)\nAbsolute Software - [Persistent servicing agent (Patent US20060272020 A1)](http://www.google.co.in/patents/US20060272020)\n[Corelabs - Deactivate the rootkit (PDF)](http://corelabs.coresecurity.com/index.php?module=Wiki&action=view&type=publication&name=Deactivate_the_Rootkit)\nKaspersky - [Absolute Computrace Revisited](http://securelist.com/analysis/publications/58278/absolute-computrace-revisited/)\nKaspersky - [Absolute Computrace: Frequently Asked Questions](http://securelist.com/blog/research/58258/absolute-computrace-frequently-asked-questions/)\n\n**Acknowledgements**\n\nI'd like to thank, in no particular order:\n\n[Anibal Sacco and](https://twitter.com/hannibals) [Alfredo Ortega for their initial research.](https://twitter.com/ortegaalfredo)\nAlfredo Ortega for a refreshing chat and answering some additional doubts I had.\n[Vitaliy Kamlyuk and Sergey Belov for their additional/follow-up research.](https://twitter.com/vkamluk)\nAbsolute Software's service desk/support specialists for their service & answering any\nquestions I had.\n\nThank you for reading.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-11-10 - Thoughts on Absolute Computrace.pdf"
    ],
    "report_names": [
        "2014-11-10 - Thoughts on Absolute Computrace.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535546,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653686110,
    "ts_modification_date": 1653686110,
    "files": {
        "pdf": "https://archive.orkl.eu/09d143f02d5e9fd38eddb13da3cff68fd09ca64b.pdf",
        "text": "https://archive.orkl.eu/09d143f02d5e9fd38eddb13da3cff68fd09ca64b.txt",
        "img": "https://archive.orkl.eu/09d143f02d5e9fd38eddb13da3cff68fd09ca64b.jpg"
    }
}