{
    "id": "52723d74-8c29-47c0-9248-3e26f1d9cdce",
    "created_at": "2023-01-12T15:04:14.201423Z",
    "updated_at": "2025-03-27T02:10:17.889167Z",
    "deleted_at": null,
    "sha1_hash": "5605a8f572adcced4dc30c50ecbaad116239c65f",
    "title": "2021-04-29 - Chimera APT updates on its OwlProxy malware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:50:53Z",
    "file_modification_date": "2022-05-28T04:50:53Z",
    "file_size": 307674,
    "plain_text": "# Updates on OwlProxy malware\n\n**lab52.io/blog/chimera-apt-updates-on-its-owlproxy-malware/**\n\nDuring the analysis of some malicious artifacts collected from an incident, we have recently detected a\nsample that has caught our attention, the sample was deployed on a server exposed to the Internet\nand was packed with “VMProtect”. After analyzing this malware sample we could see that it was a\nrecent version of a tool known as OwlProxy, which has been detected on targets hit by the APT group\nknown as Chimera.\n\nThe use of “VMProtect” by the actors makes the analysis of their code more time-consuming (although\nit simplifies its detection since this is already an anomaly by itself). On the other hand, this packer has\nsome weaknesses such as the fact that it does not always protect part of the binary metadata and that\nonce in memory, it does not obfuscate most of the strings, which makes these elements of the\nexecutable relatively easy to analyze once in memory.\n\nEspecially for this sample it helps for its identification given the amount of quite unique strings it\ncontains. An example of this is the fact that in static you can see how it still contains the string with the\noriginal name of the binary (iisdll.dll).\n\nFrom some of these strings, it can be seen how new samples are being uploaded regularly, which\nafter a more detailed analysis have been identified as different 32-bit and 64-bit versions of the same\nthreat, some of them packaged and others not.\n\n[Some of them, dating from 2019, largely coincide with the samples analyzed in the following CyCraft](https://cybernews.com/security/taiwan-government-targeted-by-multiple-cyberattacks-owlproxy-malware/)\n\nA summary of its capabilities can be found in this report, which explains that it acts as a proxy between\nthe DMZ of the victim’s infrastructure and its internal network and also allows the execution of\ncommands remotely.\n\n\n-----\n\nThe report shows the metadata of the binary where you can see how the PDB matches with most of\nthe more recent samples that can be found in Virustotal.\n\nIt is also explained in the report that the sample puts its persistence as a Service and highlights the\ntwo endpoints it exposes while it is running.\n\nIn the case of the samples analyzed, instead of using port 80, they are exposing the port 443 using\nSSL and they have stopped using the string “servlet” and now they have different strings depending on\nthe sample in question, they have kept the string “pp” for the endpoint that acts as proxy.\n\nTwo samples from 02/2019\n\nDEE3A502AEDCBE109373AA200A690D4E2D1A10FA3CF69A7B6DB68A78C6ABFC2C\n\nhttps://+:443/HelpTheme/ Remote CMD addr\n\nhttps://+:443/HelpTheme/pp/ Proxy addr\n\nFastUserSwitchingCompatibility Service Name\n\n75E616BF87AD0CBE738C4C48BC0ECD114871DEF145E21545FA11705D3A11D60E\n\nhttps://+:443/topics/ Remote CMD addr\n\nhttps://+:443/topics/pp/ Proxy addr\n\nwmipd Service Name\n\n\n-----\n\nAlong with these two samples, there are 3 more recent ones (July 2020). Two of them are newer\nversions of this same 32-bit and 64-bit tool and the third one is an installer or dropper\n(9A9FFDB8FC20B6E6E6E5A1DE434F6B834E69755FD62157F91884E9A681F0073256) that when\nexecuted, depending on the operating system architecture, extracts from its resources a suitable\nOwlProxy sample for the architecture in question, installs it in system32 with the name “wmipd.dll”,\ngives it the same creation and modification date as “calc.exe” and creates a service named wmipd that\nruns it at every system startup.\n\nThe pdb of this dropper keeps the string “owl” in its path, so we have named it OwlInstaller.\n“f:\\project\\owl\\isapi\\win32\\release\\iisinstaller.pdb”.\n\nThe OwlProxy sample of its resources is split into reverse ordered blocks, so the MZ header, for\nexample, is in the last 2634 bytes of the file.\n\nOnce extracted and installed, these more recent samples have many strings and use\nOutputDebugString in several occasions, which causes that in debugging or using DebugView a few of\nthis strings can be seen as debug information:\n\nAlong with the fact that these also use “https” as protocol, and that they have again changed part of\nthe path of their endpoints to use “exchangetopicservices” (probable evolution of the 2019 samples\nthat use the string “topics”), they have added a new endpoint to the tool, as follows:\n\nhttps://+:443/exchangetopicservices/ Remote CMD addr\n\nhttps://+:443/exchangetopicservices/pp/ Proxy\n\nhttps://+:443/exchangetopicservices/px/ Webshell\n\nThe path ending in “exchangetopicservices” still works the same way as in previous samples,\nexecuting commands in a cmd process through unnamed pipes. The proxy endpoint has also\nremained the same in terms of capabilities. Finally, thanks to all the strings in the binary, it is easy to\nspot that they call this endpoint “Webshell_run”, whose URI ends in “/px/”, and consists of a function\nthat adds the following list of commands:\n\nget_driver\nget directory\n\n\n-----\n\nupload_file\ndonwload_file\n\nThis area has many more strings than the rest, and it is curious that several of them are misspelled. In\nfact the first error probably comes in the command “get_driver” since in its internal logic the only thing\nit does is to list the hard disks installed in the computer:\n\nWhich suggests that probably, this functionality should be called “get_drives” :_)\n\nThe next wrong command is “donwload_file”, although in this case it’s easy to guess what it means\nand it does exactly that, it allows the attacker to download a file from the compromised server.\n\nThe rest do match their names since “get_directory” can be used to list the contents of a directory and\n“upload_file” is used to drop a file on the remote server.\n\nThe last notable error we have detected is a translation error when a file does not exist in the\n“get_directory” command.\n\n\n-----\n\nThe older versions have much fewer strings, so it is likely that in future versions of the threat will\nremove many of those described in this post, but some of them are used to identify the command\nexecuted, so it is possible that they will remain, along with the pdb that they have been leaving since\n2019. What is clear is that they are in constant development.\n\nDEE3A502AEDCBE109373AA200A690D4E2D1A10FA3CF69A7B6DB68A78C6ABFC2C Old\nOwlProxy\nx64 version\n\n75E616BF87AD0CBE738C4C48BC0ECD114871DEF145E21545FA11705D3A11D60E Old\nOwlProxy\nx64 version\n\n16CF6924ECA8208AD9D9B8470CF0A849995ED4D981D5BC706E62AE878EF261BB Recent\nOwlProxy\nx86 version\n\nC9B8CFACC859E494984AE9DDF864314AF651FD32E60F33C7F42BFC640620E8CA Recent\nOwlProxy\nx64 version\n\n95E7E09468F7DC62DA42E036B6E36CE27DC04C2CA0BB86A2FED39B3CC2BF4A97 VMProtect\nOwlProxy\nx64 version\n\n9A9FFDB8FC20B6E6E5A1DE434F6B834E69755FD62157F91884E9A681F0073256 OwlInstaller\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - Chimera APT updates on its OwlProxy malware.pdf"
    ],
    "report_names": [
        "2021-04-29 - Chimera APT updates on its OwlProxy malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "873a6c6f-a4d1-49b3-8142-4a147d4288ef",
            "created_at": "2022-10-25T16:07:23.455744Z",
            "updated_at": "2025-03-27T02:02:09.811933Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Operation Skeleton Key"
            ],
            "source_name": "ETDA:Chimera",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "SkeletonKeyInjector",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f88b16bc-df4b-48e7-ae35-f4117240ff24",
            "created_at": "2022-10-25T15:50:23.556699Z",
            "updated_at": "2025-03-27T02:00:55.499173Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Chimera"
            ],
            "source_name": "MITRE:Chimera",
            "tools": [
                "PsExec",
                "esentutl",
                "Mimikatz",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535854,
    "ts_updated_at": 1743041417,
    "ts_creation_date": 1653713453,
    "ts_modification_date": 1653713453,
    "files": {
        "pdf": "https://archive.orkl.eu/5605a8f572adcced4dc30c50ecbaad116239c65f.pdf",
        "text": "https://archive.orkl.eu/5605a8f572adcced4dc30c50ecbaad116239c65f.txt",
        "img": "https://archive.orkl.eu/5605a8f572adcced4dc30c50ecbaad116239c65f.jpg"
    }
}