{
    "id": "52ad5909-786c-4ec9-81ce-864bdeb1560e",
    "created_at": "2023-01-12T15:09:33.022384Z",
    "updated_at": "2025-03-27T02:16:34.754321Z",
    "deleted_at": null,
    "sha1_hash": "bc1409541c9eceeb7692957aca47e60fb8ff508d",
    "title": "2020-12-07 - Advanced Persistent Infrastructure Tracking",
    "authors": "",
    "file_creation_date": "2022-05-28T04:47:33Z",
    "file_modification_date": "2022-05-28T04:47:33Z",
    "file_size": 955315,
    "plain_text": "# Advanced Persistent Infrastructure Tracking\n\n**[censys.io/blog/advanced-persistent-infrastructure-tracking/](https://censys.io/blog/advanced-persistent-infrastructure-tracking/)**\n\n[Attack Surface Management](https://censys.io/attack-surface-management/)\n\n## Attack Surface Management\n\n\nDecember 7, 2020\n\n\nCensys is a pioneer in Attack Surface Management. Helping organizations see threats\nbefore others do. Helping contain problems before they arise.\n\n## Inside Censys\n\nAt Censys, you can be yourself–we like it that way. Diversity fuels our mission of providing a\nsecure internet for everyone, and we are committed to inclusion across the spectrum to\nbolster us as leaders in our industry.\n\n[Request a Demo](https://censys.io/request-a-demo/)\n\nBlog\n\n**Using OSINT services for tracking malicious infrastructure**\n\n**Introduction**\n\n\n-----\n\nMost cyber activity by malicious actors requires infrastructure like servers on the internet.\nThe larger the campaign, the more servers are needed. Some APT groups used several\nthousand Command and Control (C2) servers over the years. For Threat Intelligence this\noffers unique opportunities for tracking such activities, because often the C2 servers need to\nbe configured in a specific way and many actors have developed their idiosyncratic habits of\nsetting up servers. An essential advantage over purely forensic investigations of incidents is\nthat analyzing the infrastructure can sometimes identify C2 servers even before they were\nused in an attack. Internet search engines like Censys are crucial in this type of analysis.\nThey collect information about hosts on the internet and their configurations, thereby saving\nresearchers the effort of scanning large address spaces themselves.\n\nThis article explains why infrastructure tracking is possible, what attributes can be important\nto take a look on, shows two recent examples as well as an example process and gives\nsome hints for starting out with infrastructure analysis. Keep in mind that this article only\ndiscusses passive methods for finding and clustering malicious infrastructure. Active\nmethods, such as scanning for hosts yourself, introduces further possibilities such as\nmimicking a malware‘s handshake in order to identify C2 servers or victims with high\nconfidence. Also, this article covers only HTTP(S) based infrastructure.\n\n**Background**\n\nThere are multiple reasons why malicious infrastructure can be found via Censys and similar\nservices, and most of them are due to mistakes in operations security (OPSEC). While the\nfollowing paragraph is surely not exhaustive, it mentions a few key points why such mistakes\nhappen. Some actors might not be aware of their mistakes, but others might even be aware\nof the impact on OPSEC. Yet, since they need to trade-off OPSEC for efficiency, they\nsometimes seem to decide to take the risk.\n\n1. The pace of cyber attacks greatly increased While cyber attacks were the exception\nsome years ago, today they are business as usual. Due to the growing number of targets,\nthe demand of infrastructure also increased. In order to save valuable time, some kind of\ninfrastructure automation is used to set up and configure servers. Some actors chose the\neasiest way by deploying prepared images, while others seem to set up C2 servers via some\nscripts.\n\n2. Different teams are responsible for operating campaigns and setting up\n**infrastructure While some experienced operators (who conduct the actual attacks) might**\nknow about OPSEC pitfalls, in some groups the infrastructure is set up by another team\nwhich is not aware of the technical possibilities to identify their servers.\n\n3. Specific terms need to be used in order to appear legitimate to potential victims\nOften it is necessary to trick the victims into thinking the used infrastructure is legitimate. This\ncan either be in order to hide in the general network traffic or because the victim would\nrecognize suspicious addresses in the URL bar, e.g. for phishing campaigns.\n\n\n-----\n\n4. No OPSEC-by-design In general, many actors do not seem to follow OPSEC-by-design.\nInstead of thinking beforehand how Threat Intelligence analysts could identify their servers,\nthey seem to live by trial-and-error or at least only improve their OPSEC after being outed in\na Threat Intelligence report . Because we don’t want to provide OPSEC tips for recent1\nthreats, this blog post only covers already known infrastructure that has been blogged about.\n\n**Criteria for clustering hosts**\n\nThere are multiple criteria that can be used for finding and clustering infrastructure. Some of\nthem are listed here including the respective attributes which can be used for searching this\nhost – as before, this list is not exhaustive. In general, there are three groups of criteria:\nresponse header, response content, and certificates. Because some threat actors use\ncustom server-side software or specific library versions, responses to HTTP requests often\ninclude a characteristic combination of headers. So, hosts can be clustered either by the\nabsence of a header or by specific header strings. We will cover an example for clustering\nhosts by response headers below. With Censys queries, headers can be filtered via\n```\n<port>.http(s).get.headers.\n\n```\nAlso, the response content can contain characteristic artifacts. Some Command and Control\nservers try to mimic a specific web server and therefore deliver some kind of default page as\nindex or error page. A well-known example is the use of the Microsoft Internet Information\nService (IIS) default web page as an index page for Powershell Empire . Scanning services2\ntypically access just the index page or receive an error page as a response if the C2 server\nexpects a certain path to be accessed. In these cases, often the hash value of the response\nbody can be used for clustering hosts.\n\nOther actors sometimes use a default setup, where another website will be completely\ncloned first and changed afterwards. In these cases it can be helpful to search for specific\nresources in the website, such as used favicons, embedded javascript snippets (and ad\nnetwork or tracking IDs that might be in there) or included css files. The last group of criteria\nare certificates. Filtering by serial number, fingerprint or distinguished name (see example 2\nbelow) can be a useful way to cluster hosts by their certificates. Actors might tend to use a\nspecific certificate authority along quite unique terms in the common name or even reuse\nself-signed certificates along all their infrastructure.\nBoth, response content and certificates, sometimes are created in a way that appear\nlegitimate to potential victims and therefore include specific elements.\n\n**Example 1 – Tracking based on HTTP headers**\n\nAs a broadly known commercial penetration testing toolkit, Cobalt Strike (CS) is not only\nused by Red Teams. Over time, lots of different threat actors used (and probably continue to\nuse) it as a first stage. The typical server response for Cobalt Strike can be characterized as\nfollows:\n\n\n-----\n\nHTTP 404 Not Found\nContent-Type: text/plain\nContent-Length: 0\nDate Header\n**No Server-Header**\n\nWith these criteria, we are able to easily find servers using the following Censys query:\n```\n80.http.get.status_line: \"404 Not Found\" \nAND 80.http.get.headers.content_type: \"text/plain\" \nAND 80.http.get.headers.content_length: 0 \nNOT _exists_:80.http.get.headers.server\n\n```\nCensys query for Cobalt Strike instances on port 80\n\nBe aware that not all results you see necessarily are Cobalt Strike instances, but it is a good\nindicator. Also, as you might have already guessed, Cobalt Strike is not limited to port 80.\nApart from the default TLS certificate used by the tool, you can find other instances using\nTLS by additionally searching for popular certificate authorities or self-signed certificates.\n```\n87f2085c32b6a2cc709b365f55873e207a9caa10bffecf2fd16d3cf9d94d390c\n\n```\nCensys query using the SHA256 hash of the default Cobalt Strike certificate fingerprint\n\nThere is a tremendous amount of Cobalt Strike infrastructure available online, so you most\nlikely need another type of data source, such as passive DNS data, in order to properly\ncluster the instances found.\nResults for typical Cobalt Strike headers on port 80:\n\n\n-----\n\nCertificate distinguished names\n**Example 2 – Tracking based on certificate data**\n\nIn July 2020, NCSC UK, the national cyber security authority in the UK, published an\nadvisory about APT29 targeting COVID-19 vaccine research The group also known as “The3.\nDukes” or “Cozy Bear” used Citrix and VPN vulnerabilities to attack various companies\nconnected to vaccine development. In these campaigns, the group used two custom\nmalware families, WellMess and WellMail. The infrastructure used by the perpetrators\nincluded very specific self-signed certificates which made them easy to track, as reported by\nseveral sources. PwC recently published a report about the server side software used by the\nperpetrators4.\n\n```\nIssuer: C=Tunis, O=IT, CN=* Subject: C=Tunis, O=IT\n\n```\nBy using the certificate distinguished names given in table 1, we can create a query in order\nto find recent infrastructure:\n```\n443.https.tls.certificate.parsed.subject_dn: \"C=Tunis, O=IT\" AND\n443.https.tls.certificate.parsed.issuer_dn: \"C=Tunis, O=IT, CN=*\"\n\n```\nWith the query in table 2, 20 hosts can be found using the certificate details.\n\n\n-----\n\nCensys query\n\nusing certificate distinguished names from WellMess reports\n**Example Process**\n\nWhen I started with infrastructure tracking, I wrote a simple python tool that queried different\ndata sources based on a given rule.\n\nWellMess C2 rule file\nThe rule (see figure 3) included the necessary query and the script sent the results to other\nsystems. As those were purely used as notifications at the start, I called the section “alerts”.\nAfter setting up cronjobs to run your scripts, you’re good to go – without needing a huge\n\n\n-----\n\nsoftware stack. In case I need the raw response from the queried sources, I store all API\nresponses in a JSON file. This way I can create a completely new data structure if needed,\nwithout losing data.\n\n**Tips for starters**\n\nWhile you’re going to develop your own procedures for infrastructure tracking, I want to give\nsome advice for people starting out, hoping you find the following tips useful.\n\n1. Combine different resources.\n\nIn order to get the most precise picture of the infrastructure used by adversaries, it is very\nhelpful to combine various services that deliver different types of information. In addition to\nhost data (e.g. from Censys or Shodan), pivoting through infrastructure can be enhanced\nthrough passive DNS data (e.g. RiskIQ or Domaintools) and certificate data (e.g. Censys or\ncrt.sh). If you’re consuming data from different providers, you might want to use a common\ndata model .5\n\n2. Store results in a searchable and flexible way.\n\nAfter you started with infrastructure tracking, you’re eventually going to have a lot of data in\nyour hands and you definitely want to be able to search through that data very fast. Having\nyour data in an elasticsearch cluster or a similar searchable data storage will save you a ton\nof time. When setting up your toolset, keep in mind that you might want to search through\nyour data with regular expressions.\n\n3. Keep older results.\n\nDo not delete results of older search queries. Keeping and updating host information allows\nthe discovery of interesting patterns. Also, it is quite useful to have first and last seen dates\nfor C2 servers.\n\n4. Document your queries.\n\nYour ever-growing number of queries need to be documented somehow, otherwise, you’re\ngoing to lose the overview. A good starting point is to create a schema2 that includes\nmetadata such as a description.\n\n**Conclusion**\n\nThreat actors are bound by similar constraints as network defenders – time, money, skills,\nand laziness. This leads to mistakes or certain habits when setting up their infrastructure.\nWith some creativity and tooling network defenders can exploit those mistakes and habits to\ntrack malicious infrastructure. The reward will be IoCs and insights into the activities of the\n\n\n-----\n\nattackers. Censys and other tools give analysts a great head-start. The magic then is in the\nqueries that you write. I hope you found the above techniques and tips helpful. I’ll be happy\nto hear about your experiences, you can reach me via Twitter or Keybase .6 7\n\n\n1.\n\n2.\n3.\n\n4.\n\n5.\n\n6.\n7.\n\n\nCompare p. 75 Steffens, Timo (2020). Attribution of Advanced Persistent Threats.\n\n[https://doi.org/10.1007/978-3-662-61313-9 ↩](https://doi.org/10.1007/978-3-662-61313-9)\n\n[Compare https://github.com/BCSECURITY/Empire/blob/master/lib/listeners/http.py#L262 ↩](https://github.com/BC-SECURITY/Empire/blob/master/lib/listeners/http.py#L262%20%E2%86%A9)\n\nNCSC-UK (2020). APT29 targets COVID-19 vaccine development.\n\n[https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccinedevelopment.pdf (accessed 2020-09-21) ↩](https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccinedevelopment.pdf)\n\nPwC UK (2020). WellMess malware: analysis of its Command and Control (C2)\n\n_server._ [https://www.pwc.co.uk/issues/cyber-security-services/insights/wellmessanalysis-command-control.html](https://www.pwc.co.uk/issues/cyber-security-services/insights/wellmess-analysis-command-control.html)\n\n(accessed 2020-09-21) ↩\n\nCommon OSINT data model for infrastructure analysis:\n\n[https://github.com/3c7/common-osint-model (accessed 2020-09-21) ↩](https://github.com/3c7/common-osint-model)\n\n[https://twitter.com/0x3c7 ↩](https://twitter.com/0x3c7)\n\n[https://keybase.io/nkuhnert↩](https://keybase.io/nkuhnert)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-07 - Advanced Persistent Infrastructure Tracking.pdf"
    ],
    "report_names": [
        "2020-12-07 - Advanced Persistent Infrastructure Tracking.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536173,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653713253,
    "ts_modification_date": 1653713253,
    "files": {
        "pdf": "https://archive.orkl.eu/bc1409541c9eceeb7692957aca47e60fb8ff508d.pdf",
        "text": "https://archive.orkl.eu/bc1409541c9eceeb7692957aca47e60fb8ff508d.txt",
        "img": "https://archive.orkl.eu/bc1409541c9eceeb7692957aca47e60fb8ff508d.jpg"
    }
}