{
    "id": "52d14d63-b15c-4109-8516-cd4e97242e3f",
    "created_at": "2023-01-12T15:09:36.606467Z",
    "updated_at": "2025-03-27T02:06:15.524767Z",
    "deleted_at": null,
    "sha1_hash": "4fb800a17f4366531495bf9847d7c56086f80edb",
    "title": "2020-06-17 - Targeted attacks on industrial companies using Snake ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T22:26:19Z",
    "file_modification_date": "2022-05-27T22:26:19Z",
    "file_size": 181001,
    "plain_text": "# Targeted attacks on industrial companies using Snake ransomware (updated)\n\n**[ics-cert.kaspersky.com/alerts/2020/06/17/targeted-attacks-on-industrial-companies-using-snake-ransomware/](https://ics-cert.kaspersky.com/alerts/2020/06/17/targeted-attacks-on-industrial-companies-using-snake-ransomware/)**\n\nJune 17, 2020\n\n[Main](https://ics-cert.kaspersky.com/)\n[Publications](https://ics-cert.kaspersky.com/publications)\nAlerts\nTargeted attacks on industrial companies using Snake ransomware (updated)\nTargeted attacks on industrial companies using Snake ransomware (updated)\n\n17 June 2020\n\nAccording to Kaspersky ICS CERT data, a number of industrial companies are currently\nexperiencing targeted attacks involving the Snake encryption ransomware.\n\n[On June 8, 2020 issues were reported which affected the computer networks of Honda, a](https://ics-cert.kaspersky.com/away?url=https%3A%2F%2Fwww.telegraph.co.uk%2Fbusiness%2F2020%2F06%2F08%2Fhonda-could-victim-ransomware-cyber-attack%2F)\nJapanese motorcycle and auto manufacturer, in Europe and Japan. Specifically, it was\n[announced that Honda Customer Service and Honda Financial Services were experiencing](https://ics-cert.kaspersky.com/away?url=https%3A%2F%2Ftwitter.com%2FHondaCustSvc%2Fstatus%2F1270048801307234304%3Fs%3D20)\n\n\n-----\n\ntechnical difficulties. Information security experts believe that, in all likelihood, one of the\ncompany’s servers was infected with Snake (EKANS) ransomware.\n\n[A sample of the Snake malware discovered by some researchers on VirusTotal checked for](https://ics-cert.kaspersky.com/away?url=https%3A%2F%2Ftwitter.com%2Fmilkr3am%2Fstatus%2F1269932348860030979%3Fs%3D20)\nHonda’s domain name, “mds.honda.com” (which is probably used on the company’s internal\nnetwork). If the domain name cannot be resolved (i.e., if the corresponding IP address\ncannot be determined), the ransomware terminates without encrypting any files. According to\nthe researchers, this could indicate that the attackers’ activity is targeted.\n\nKaspersky ICS CERT experts used their own telemetry data to identify other samples that\nwere similar to the sample uploaded to VirusTotal. Based on the findings of our research:\n\n1. The malware was launched using a “nmon.bat” file detected by Kaspersky products in\n\ndomain policy script folders.\n2. The only difference between all of the Snake samples identified is the domain name\n\nand IP address embedded in the code.\n3. The IP address embedded in the malware code is compared with the IP address\n\nresolved from the domain name, if the malware was able to resolve it.\n4. The malware encrypts data only if the IP address embedded in the malware code\n\nmatches the IP address resolved from the domain name that is also embedded in the\nmalware code.\n5. The IP address and domain name combination embedded in the malware code is\n\nunique for each attack we have identified and is apparently valid for the internal\nnetwork of the organization targeted by that specific attack.\n6. In some cases, the domain names may have been obtained from public sources\n\n(DNS), while information on IP addresses associated with these domain names is\napparently stored on internal DNS servers and is only available when sending DNS\nrequests from the victim organizations’ internal networks.\n7. In addition to the domain name and IP address of the organization under attack, which\n\nare embedded into the malware code, new Snake samples are different from those\nidentified in December 2019 in that they include an extended list of file extensions\n(types) that the malware should encrypt. The new samples include extensions for\nvirtual drive files, Microsoft Access, source code in С/C#/ASP/JSP/PHP/JS, as well as\nthe corresponding files of projects/solutions and other extensions that were\nunsupported by earlier samples.\n\nThe results of our research clearly indicate that the attackers carry out multistage hacker\nattacks, each attack targeting a specific organization. Encrypting files using Snake is the final\nstage of these attacks.\n\nEach Snake sample was apparently compiled after the attackers had gained the knowledge\nof the relevant domain name and its associated IP address on the company’s internal\nnetwork. In the malware samples analyzed, the IP address and domain name are stored as\n\n\n-----\n\nstrings. This means that the executable file cannot be easily changed (patched) after\ncompilation because the length of these strings varies.\n\nClearly, checking that the domain name matches the IP address is a technique designed to\nprevent the malware from running outside the local network for which the sample was\ncreated.\n\nIt is most likely that the attackers used domain policies to spread the ransomware across the\nlocal network. In that case, they had access to the domain administrator’s account,\ncompromised in the attack’s earlier stages.\n\n[It is known that, in addition to Honda, victims include power company Enel Group. According](https://ics-cert.kaspersky.com/away?url=https%3A%2F%2Fsecurityboulevard.com%2F2020%2F06%2Fsnake-ransomware-affected-enel-groups-internal-network%2F)\nto Kaspersky ICS CERT data, attack targets also include a German company that supplies\nits products to auto makers and other industrial manufacturers and a German manufacturer\nof medical equipment and supplies. Apparently, other auto makers and manufacturing\ncompanies have also been attacked: similar Snake samples have been detected on\ncomputers in China, Japan and Europe. We believe the attack may have gone beyond the\nvictims’ IT systems. Specifically, in one case, the malware was detected and blocked on the\nvideo surveillance server of an organization attacked in China.\n\nAll malware samples were proactively blocked by Kaspersky products using the heuristic\nsignature Trojan-Ransom.Win32.Snake.a, which was created using the original Snake\nsample that appeared in December 2019.\n\nIt is worth reminding that an important distinguishing feature of Snake is that it targets,\namong other things, industrial automation systems – specifically that it is designed to encrypt\nfiles used by General Electric ICS. This is evidenced by the fact that the malware attempts to\nterminate the processes of General Electric software before starting the file encryption\nprocess.\n\nAttacks similar to those described above continue. If you have encountered an attack of this\n[kind, you can report it via a special form on our website.](https://ics-cert.kaspersky.com/contacts/)\n\n## July 7, 2020 update\n\nOur hypothesis that the attackers used the attacked company’s domain controller to spread\nthe ransomware across the local network is supported by one more curious fact.\n\nThe malware checks the domain role of the computer on which it is running. If the computer\nhas the domain controller role (DomainController), the function returns the value “1”.\n\n\n-----\n\nIf the function that checks the attacked computer’s domain role returns “1” (i.e., the computer\nhas the role of a primary or backup domain controller), the function that calls it returns “0”.\nThis results in the malware terminating without performing any encryption. The calling\nfunction also checks whether the domain’s IP address matches the hard-coded IP address.\n\n\n-----\n\nThis means that if, as we believe, the attackers used the domain controller to spread the\nmalware across the victim’s local network, the domain controller exclusion logic described\nabove would certainly work for them, since they needed the domain controller to be\noperational and unencrypted.\n\n## Recommendations\n\nTo identify traces of an attack and prevent possible damage, Kaspersky ICS CERT\nrecommends:\n\nUsing the indicators of compromise provided to identify infections on Windows\nworkstations and servers;\nChecking active domain policies and scripts for malicious code;\nChecking active tasks in the Windows Task Scheduler on workstations and servers for\nmalicious code;\nChanging the passwords of all accounts in the domain administrator group.\n\n## Indicators of compromise\n\n### MD5\n\nED3C05BDE9F0EA0F1321355B03AC42D0\n7DDB09DB3FB9B01FA931C2A1A41E13E1\nC547141B8A690EEE313C0F6CE6B5CCA6\n47EBE9F8F5F73F07D456EC12BB49C75D\n\n\n-----\n\nD659325EA3491708820A2BEFFE9362B8\nC7C39967E16500C37638AB24F1BB3FF9\nF58A00D132205045F8AA4C765239301F\nD1277A10494B5D2D5B21B2488C650D3A\n1E296139AF94AFC2F6002969E8EA750E\nE52927F8E4A22B4D9FD463637A8696EE\n6DDD81BE14DFC8354AEB63220CFE112E\nDC68AE3CC7BDB1EC80C72FC9F0E93255\n\n### File names\n\nnmon.exe\nnmon.bat\nKB3020369.exe\nKB[7 random numbers].exe\n\n### Folders in which malicious objects can be located\n\n%WinTemp%\nsysvol[domain name]scripts\n\n[Download PDF](https://ics-cert.kaspersky.com/media//media/Kaspersky_ics_cert_alert_Snake_EN.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-17 - Targeted attacks on industrial companies using Snake ransomware.pdf"
    ],
    "report_names": [
        "2020-06-17 - Targeted attacks on industrial companies using Snake ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536176,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653690379,
    "ts_modification_date": 1653690379,
    "files": {
        "pdf": "https://archive.orkl.eu/4fb800a17f4366531495bf9847d7c56086f80edb.pdf",
        "text": "https://archive.orkl.eu/4fb800a17f4366531495bf9847d7c56086f80edb.txt",
        "img": "https://archive.orkl.eu/4fb800a17f4366531495bf9847d7c56086f80edb.jpg"
    }
}