{
    "id": "5344a1e0-db01-4f21-9d29-2ffbd7e0cff5",
    "created_at": "2023-01-12T15:03:58.060939Z",
    "updated_at": "2025-03-27T02:06:10.990799Z",
    "deleted_at": null,
    "sha1_hash": "b7a04ee36ad7bfea9dd2645cc29391d10fcc3d2b",
    "title": "2021-07-06 - Operation Lyrebird- Group-IB assists INTERPOL in identifying suspect behind numerous cybercrimes worldwide",
    "authors": "",
    "file_creation_date": "2022-05-28T03:47:36Z",
    "file_modification_date": "2022-05-28T03:47:36Z",
    "file_size": 662989,
    "plain_text": "# Operation Lyrebird: Group-IB assists INTERPOL in identifying suspect behind numerous cybercrimes worldwide\n\n**group-ib.com/media/gib-interpol-lyrebird/**\n\nGroup-IB, one of the leading providers of solutions dedicated to detecting and preventing\ncyberattacks, identifying online fraud, investigation of high-tech crimes and intellectual\n[property protection, has supported INTERPOL in its Lyrebird operation that resulted in the](https://www.interpol.int/News-and-Events/News/2021/Moroccan-police-arrest-suspected-cybercriminal-after-INTERPOL-probe)\nidentification and apprehension of a threat actor presumably responsible for multiple attacks,\nincluding on French telecommunications companies, the county’s major banks and\nmultinational corporations, following a two-year investigation. The alleged perpetrator, who\nturned out to be a citizen of Morocco, was arrested in May by the Moroccan police based\non the data about his cybercrimes that was provided by Group-IB.\n\nAccording to Group-IB’s Threat Intelligence team, the suspect, dubbed Dr HeX by Group-IB\nbased on one of the nicknames that he used, has been active since at least 2009 and\nis responsible for a number of cybercrimes, including phishing, defacing, malware\ndevelopment, fraud, and carding that resulted in thousands of unsuspecting victims. The\nstarting point of Group-IB’s research to identify and deanonymize the cybercriminal was the\nextraction of a phishing kit (a tool used to create phishing web pages) exploiting the brand\nof a large French bank by Group-IB’s [Threat Intelligence & Attribution system.](http://10.10.0.46/intelligence-atrribution.html)\n\n\n-----\n\nThe set-up of the detected phishing kit followed a common technique, with the creation\nof a spoofed website of a targeted company, the mass distribution of emails impersonating\nit and asking users to enter login information on the spoofed site. The credentials left\nby unsuspecting victims on the fake page were then redirected to the perpetrator’s email.\nAlmost each of the scripts contained in the phishing kit had its creator’s nickname, Dr HeX,\nand contact email address.\n\nThe email mentioned in the phishing kit enabled Group-IB threat intelligence analysts find the\nalleged attacker’s YouTube channel signed up under the same name — Dr HeX. In the\ndescription to one of the videos, the attacker left a link leading to an Arabic crowd funding\nplatform, which enabled Group-IB researchers to record another name associated with the\ncybercriminal. According to the DNS data analysis, this name was used to register at least\ntwo domains, which were created using the email from the phishing kit.\n\nUsing its patented graph network analysis technology, Group-IB researchers built a network\ngraph, based on the email address from the phishing kit, that showed other elements of the\nthreat actor’s malicious infrastructure employed by him in various campaigns along with his\npersonal pages. A total of five email addresses associated with the accused were identified,\nalong with six nicknames, and his accounts on Skype, Facebook, Instagram, and Youtube.\n\nThe further analysis of Dr Hex’ digital footprint revealed his association with other malicious\nactivities. Over the period from 2009 to 2018, the threat actor defaced over 130 web pages.\nGroup-IB analysts have also found the cybercriminal’s posts on several popular underground\nplatforms intended for malware trading that indicate the latter’s involvement in malware\ndevelopment. In addition, Group-IB has also discovered evidence suggesting Dr Hex’\ninvolvement in attacks on several huge French corporations with the aim of stealing\ncustomer’s bank card data.\n\nUnder Operation Lyrebird, Group-IB worked closely with INTERPOL’s Cybercrime\nDirectorate, which, in turn, cooperated with Moroccan Police via the INTERPOL National\nCentral Bureau in Rabat to eventually locate and apprehend the individual who remains\nunder investigation.\n\nThis is a significant success against a suspect who is accused of targeting unsuspecting\nindividuals and companies across multiple regions for years, and the case highlights the\nthreat posed by cybercrime worldwide. The arrest of this suspect is down to outstanding\ninternational investigative work and new ways of collaboration both with Moroccan police and\nour vital private sector partners such as Group-IB.\n\n\n-----\n\n**Stephen Kavanagh**\n\nINTERPOL Executive Director of Police Services\n\nHaving zero-tolerance to cybercrime, Group-IB has always stressed its focus not only\non protecting our customers against cyberattacks, but also on identifying perpetrators behind\nthem to ensure that they’re duly punished. Lyrebird operation is yet another example\nof strong coordinated cooperation between international law enforcement agencies, regional\npolice and cybersecurity players. These are international cooperation, data exchange, and\nthe long-standing experience in cyber investigations that help Group-IB lead its work\nto a logical conclusion — bring cybercriminals to justice. Over years of successful\ncooperation between INTERPOL and Group-IB, we have been setting an example\nof synergy between the private sector and police forces that ensures that cybercrime isn’t\nexempt from punishment.\n\n**Dmitry Volkov**\n\nGroup-IB CTO and Head of Threat Hunting Intelligence\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-06 - Operation Lyrebird- Group-IB assists INTERPOL in identifying suspect behind numerous cybercrimes worldwide.pdf"
    ],
    "report_names": [
        "2021-07-06 - Operation Lyrebird- Group-IB assists INTERPOL in identifying suspect behind numerous cybercrimes worldwide.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535838,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653709656,
    "ts_modification_date": 1653709656,
    "files": {
        "pdf": "https://archive.orkl.eu/b7a04ee36ad7bfea9dd2645cc29391d10fcc3d2b.pdf",
        "text": "https://archive.orkl.eu/b7a04ee36ad7bfea9dd2645cc29391d10fcc3d2b.txt",
        "img": "https://archive.orkl.eu/b7a04ee36ad7bfea9dd2645cc29391d10fcc3d2b.jpg"
    }
}