{
    "id": "53c27d1b-acc3-4995-ab54-a34fe2546bb5",
    "created_at": "2024-01-17T02:04:05.251799Z",
    "updated_at": "2025-03-27T02:16:39.908512Z",
    "deleted_at": null,
    "sha1_hash": "359be6f14e3151f7efa230ed79d29fc01bdda962",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T04:21:21Z",
    "file_modification_date": "2024-01-16T04:21:21Z",
    "file_size": 1035269,
    "plain_text": "# WildCard: The APT Behind SysJoker Targets Critical Sectors in Israel\n\n**intezer.com/blog/research/wildcard-evolution-of-sysjoker-cyber-threat**\n\nWritten by Nicole Fishbein - 27 November 2023\n\n\nNovember 27, 2023\n\n\n_Our research team has identified a new APT group, dubbed “WildCard,” initially detected through its use of the SysJoker malware,_\n_which targeted Israel’s educational sector in 2021. WildCard has since expanded its reach, creating sophisticated malware variants_\n_disguised as legitimate software, and a recently developed malware called ‘RustDown,’ written in Rust for potential operational_\n_advantages. Connections to Operation ElectricPowder indicate WildCard’s advanced capabilities with a focus on critical sectors_\n_within Israel. While we’ve begun to understand WildCard’s tactics and methods, their precise identity is still enigmatic, demanding_\n_deeper analysis and collaboration within the infosec community._\n\nThe current war between Israel and Hamas has brought increased interest in a variety of threats targeting Israel. Of course, this\nincludes the usual suspects like Iranian, Hezbollah, and Hamas-affiliated groups that consistently target Israeli organizations and are\nlikely to increase their operational tempo to match the current conflict. We believe the shadow of a previously unidentified threat\n**[actor has slipped below the threshold and deserves greater attention. Its first sighting began with our discovery of the SysJoker](https://intezer.com/blog/research/new-backdoor-sysjoker/)**\n[malware targeting the educational sector in Israel in 2021. Since then, the group behind SysJoker has evolved its tooling and](https://intezer.com/blog/research/new-backdoor-sysjoker/)\ntargeting in important ways.\n\nAs we continued to track this threat cluster, we found previously undiscovered 2022 variants masquerading as ‘DMAdevice’ and\n‘AppMessagingRegistrar’ software, both also written in C++. They share code and behavior patterns with our original discovery of\nSysJoker for Windows. Then in October 2023, we noticed a new malware written in Rust that shares behavioral traits with SysJoker.\nThe developers refer to the malware as ‘RustDown’. The original version of SysJoker was used to target Windows, macOS, and\nLinux machines, the migration to Rust might be an attempt to simplify multi-platform targeting in addition to making it harder to\nanalyze.\n\n[We’ve also uncovered possible connections with ClearSky’s Operation ElectricPowder. If proven, we see an actor displaying](https://www.clearskysec.com/iec/)\nworrying capabilities and intent primarily targeting different critical sectors in Israel. To better describe the threat actor that ties these\n3-4 different sets of activity together, we are clustering these sets of activity under the name WildCard. At this time, we can better\ndescribe WildCard’s TTPs across multiple operations and variants, but attribution remains elusive.\n\n\n-----\n\n_Timeline of WildCard operations._\n\n## Technical Analysis\n\n### The Original SysJoker Malware\n\nIn January 2022, we published our discovery of SysJoker, an unattributed multi-platform backdoor leveraged against an educational\ninstitute in Israel. SysJoker masqueraded as a system update and generated its command-and-control by decoding a string\nretrieved from a text file hosted on GDrive. This dead drop resolver method is a consistent theme in the WildCard threat actor’s\nfuture operations, along with naming their malware after legitimate components. Note that the development of C++ multi-platform\nbackdoors is rare in the Middle East and aroused further suspicion about the nature of the unidentified malware developers.\n\n### Previously Undiscovered Variants Appear\n\nAfter our publication, the WildCard threat actor continued to evolve their malware, re-implementing some of the malware’s behaviors\nto avoid detection and adding new capabilities. We found three samples of a malware variant written in C++. Two named\nDMAdevice.exe and one named AppMessagingRegistrar.exe. These variants were compiled five months after our original\npublication.\n\n\n**Hash** **Compilation**\n**Timestamp**\n\ne076e9893adb0c6d0c70cd7019a266d5fd02b429c01cfe51329b2318e9239836 19 May 2022\n18:07:42\n\n6c8471e8c37e0a3d608184147f89d81d62f9442541a04d15d9ead0b3e0862d95 19 May 2022\n18:05:18\n\n67ddd2af9a8ca3f92bda17bd990e0f3c4ab1d9bea47333fe31205eede8ecc706 19 Jun 2022\n20:20:06\n\n**DMAdevice**\n\n\n**Filename**\n\nDMAdevice.exe\n\nDMAdevice.exe\n\nAppMessagingRegistrar.exe\n\n\n[Using Intezer Analyze we were able to identify code reuse between these samples and the original Windows SysJoker samples.](https://analyze.intezer.com/files/e076e9893adb0c6d0c70cd7019a266d5fd02b429c01cfe51329b2318e9239836)\n\n\n-----\n\nThe structure of the main methods is largely similar, with some differences.\n\n_Comparison between SysJoker and the DMAdevice variant._\n\nBesides the shared code, the two DMAdevice variants share a unique string with SysJoker, a custom alphabet:\n\n0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghilmnopqrstuvmxyz\n\nNote the missing ‘jk’ from the lowercase portion of the custom alphabet. This is likely a minor slip on the part of the developers but\none that has consistently carried over into these newer variants.\n\n[Previous versions of SysJoker used GDrive as a dead drop resolver. The retrieved file content is base64 decoded before it is](https://attack.mitre.org/techniques/T1102/001/)\ndecrypted using a hardcoded RSA key as an XOR key. The decrypted data is the address of the intended C2 server.\n\nThe DMAdevice variant implements similar behavior but instead abuses OneDrive as its dead drop resolver. Meaning that the threat\nactors retained the usage of popular benign publicly-available services, unlikely to be blocked across the network while keeping the\nability to rotate the C2 as needed. The use of OneDrive as a dead drop resolver continues into the RustDown variant.\n\nInterestingly, they have decided to remove the use of the RSA key but keep the same scheme, replacing the key with a different\nstring. In this case, after the stack string is built up, the used XOR key is:\n\n\n-----\n\nQQL8VJUJMABL8H5YNRC9QNEOHA4I3QDAVWP5RY9L0HCGWZ4T7GTYQTCQTHTTN8RV6BMKT3AICZHOFQS8MTT\n\n_The XOR string being built on the stack._\n\nThe hardcoded User Agent string also changes, as follows:\n```\nMozilla/5.0 (X11; CrOS x86_64 8172.45.0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/51.0.2704.64\nSafari/537.36\n\n```\n**AppMessagingRegistrar**\n\n[This variant was compiled after the DMAdevice version. While it also shares code with SysJoker, this variant implements different](https://analyze.intezer.com/files/67ddd2af9a8ca3f92bda17bd990e0f3c4ab1d9bea47333fe31205eede8ecc706)\ncapabilities. For example, it uses multiple XOR keys to decode strings. This variant also uses different url paths:\n\napi/update\n/api/register\n/api/library\n/api/requests\n\nHowever, similar to the other WildCard malware, it also uses OneDrive as a dead drop resolver. Also similar,\n[AppMessagingRegistrar is downloaded from a server inside a ZIP file and is executed by a DLL file. The DLL file masquerades as](https://analyze.intezer.com/files/96dc31cf0f9e7e59b4e00627f9c7f7a8cac3b8f4338b27d713b0aaf6abacfe6f)\nBrave Browser.\n\nCompany: Brave Browser\nProduct: Brave Browser (4.0.1.5)\n\n_Metadate of AppMessagingRegistrar executable._\n\n### RustDown: WildCard learns Rust\n\nIn October 2023, we discovered a new malware written in Rust. The sample is a 32-bit Windows executable masquerading as a\nPHP framework component. While the codebase is new, the malware consistently shares TTPs used by the WildCard threat actor in\nboth SysJoker and its variants. The name of the malware is derived from the developers, as evidenced by a leftover PDB path:\n```\n– C:\\Code\\Rust\\RustDown-Belal\\target\\release\\deps\\RustDown.pdb\n\n```\n_RustDown PDB file path._\n\nAccording to the PDB file the malware developers refer to this component as RustDown. Additionally, the term “Belal” in the folder\npath may be a transliteration of the common Arabic first name ‘Bilal’. We treat this as a low-confidence indicator towards the identity\nof one of the WildCard developers.\n\n\n-----\n\n**Hash** **Compilation Timestamp** **Filename**\n\nd4095f8b2fd0e6deb605baa1530c32336298afd026afc0f41030fa43371e3e72 7 Aug 2023 10:43:32 php-cgi.exe\n\n[RustDown is intended to look like a legitimate PHP executable named php-cgi. PHP-CGI stands for PHP Common Gateway](https://analyze.intezer.com/files/d4095f8b2fd0e6deb605baa1530c32336298afd026afc0f41030fa43371e3e72)\nInterface. Providing an important tool that allows PHP to interact with a web server.\n\nCompany: The PHP Group\n\nProduct: PHP (7.4.19)\n\n_Metadata of RustDown executable._\n\nAs the name suggests, RustDown is a backdoor written in Rust and compiled for Windows operating systems. It uses OneDrive as a\ndead drop resolver.\n\nRustDown implements multiple calls to the Sleep API using randomly chosen time durations, as seen in SysJoker.\n\n_Function in RustDown that implements the Sleep_\n\n_functionality._\n\nNext, the backdoor copies the executable to another location and sets up persistence by using a PowerShell command. Both the\npath and the PowerShell command are obfuscated in an attempt to evade detection. After decrypting the strings, we see that the\nmalware copies itself to the following location, keeping with the theme of the legitimate PHP CGI tool:\n\nC:\\ProgramData\\php-7.4.19-Win32-vc15-x64\\php-cgi.exe\n\nNext, the malware decodes the PowerShell command that sets the registry value for persistence:\n\n“powershell” -Command “$reg=\n\n[WMIClass]’ROOT\\DEFAULT:StdRegProv’;$results=$reg.SetStringValue(‘&H80000001′,’Software\\Microsoft\\Windows\\CurrentVersion\\Run’,\n‘php-cgi’, ‘C:\\ProgramData\\php-7.4.19-Win32-vc15-x64\\php-cgi.exe’);”\n\n[The general mechanism for interacting with the Current User Hive involves using the identifier ‘&H80000001’ as described here.](https://tfl09.blogspot.com/2011/09/using-powershell-and-wmi-to-manage.html)\n[However, the specific command string it uses appears to be unique and relates to a separate campaign, referred to as Operation](https://www.clearskysec.com/iec/)\n[Electric Powder described further below.](https://www.clearskysec.com/iec/)\n\n**Obfuscation**\n\nAs mentioned, the malware encrypts its own strings in two different ways. The bulk of the remaining unobfuscated strings are\nartifacts of the static compilation of Rust dependencies linked within the binary:\n\nbase64-0.13\ncurl-0.4.35\nrand-0.8.3\nrand_chacha-0.3.0\n\n\n-----\n\nrand_core-0.6.2\nrustc-demangle-0.1.21\nserde_json-1.0.64\nWhoami-1.1.1\n\nThe first type of obfuscation has the following scheme: first, decode the string with a standard Base64 scheme, unlike the first\nvariant of SysJoker, and then decrypt the result with the following XOR key:\n\nQQL8VJUJMABL8H5YNRC9QNEOHA4I3QDAVWP5RY9L0HCGWZ4T7GTYQTCQTHTTN8RV6BMKT3AICZHOFQS8MTT\n\nThe same XOR key was used by the DMAdevice variant of SysJoker.\n\nThe malware decrypts additional strings using a XOR cipher, where each string is processed against a distinct key stream. The\nspecific key for each string is determined by using fixed offsets from a table embedded within the malware’s code, combined with a\ncalculation involving hardcoded numerical values and bitwise operations.\n\n_Decryption of strings using unique key stream._\n\n**Communication With the C2**\n\n[The communication with the C2 starts with the decoding of a dead drop resolver. This is performed using the first decoding method](https://attack.mitre.org/techniques/T1102/001/)\nand the hardcoded XOR key and Base64. The backdoor sends an HTTP Get request to the following resolved URL:\n\nhttps://onedrive[.]live.com/download?resid=16E2AEE4B7A8BBB1%21112&authkey=!AED7TeCJaC7JNVQ\n\nThe backdoor uses a custom user agent. This is similar to the earlier version of SysJoker, which also communicated using a\nspecific, hardcoded user agent:\n\nMozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.159 Safari/537\n\nWe were able to get a response from the resolver:\n\nKnM5Sjpob2glNTY8AmcaYXt8cAh/fHZ+ZnUNcwdld2Mr\n\nThe response is encoded using Base64 and XOR-ed with the same key that was used in the previous step. The decrypted result is\nthe IP address of the C2: {“url”:”http://85.31.231[.]49:443″}. During our investigation, we did not find other C2 domains that were\nserved by this OneDrive link.\n\nNext, the malware communicates with the C2 using the HTTP protocol. The URL is formatted in the following way: <C2\ndomain>/api/<command>. In RustDown, we identified two commands attach and req.\n\n\n-----\n\n_VirusTotal behavior analysis of RustDown showing the_\n\n_connection method to the C2._\n\nLike the original version of Sysjoker, the RustDown will decode the C2 and send the collected user’s information to the C2’s\n/api/attach path as an initial handshake. The information sent over has the following structure:\n\n“ip”:”[Local IP Address]”\n“serial”:”[Host Name]_[Serial Number]_[Username]”\n“name”:”[Username]”\n“os”:”[Operating System Version]”\n“user_token”:”[User Token]”\n\nThis differs from the fields used in SysJoker which included an unused ‘av’ field.\n\n“sn”: “[Serial Number]”\n“us”: “[Username]”\n“os”: “[Operating System Version]”\n“av”: *Unused\n“ip”: “[Local IP Address]”\n\nRustDown will send requests to the C2’s /api/req path after registration, similar to older versions. The response from the C2 is a\nJSON detailing an array of tasks to perform. These instructions include actions along with specific URLs to download a zip archive\ncontaining executables and save it at C:\\\\ProgramData\\\\php-Win32-lib with the filename specified in the JSON. To unzip the payload,\nRustDown decryptes another PowerShell command.\n\n## Connections to Operation ElectricPowder\n\nIn the process of our investigation, we found an interesting set of connections between the newer SysJoker variants (particularly the\n[‘DMA Device’) and components of Operation ElectricPowder. The latter was an attack that targeted the Israeli Electric Corporation](https://www.clearskysec.com/iec/)\n(IEC) in 2016-2017. In both cases, the following specific string is deobfuscated during execution and used to establish persistence.\n\npowershell\\” -Command \\”$reg=\n\n[WMIClass]’ROOT\\\\DEFAULT:StdRegProv’;$results=$reg.SetStringValue(‘&H80000001′,’Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run’,\n<process>, <path>\n\n[The general mechanism to resolve the Current User hive is described here. However, the way the command string is implemented](https://tfl09.blogspot.com/2011/09/using-powershell-and-wmi-to-manage.html)\nappears to be limited to these malware sets, suggesting a developmental connection across nearly four years.\n\nAdditionally, once we discovered RustDown, we found that it also dynamically resolves this PowerShell command string and uses it\nto achieve persistence. This further strengthens the hypothesis that Operation ElectricPowder may have been the earliest\nappearance of the WildCard threat actor.\n\n## Infection vectors\n\nIn our publication of SysJoker, we suspected that the threat actors used an infected npm package to deliver SysJoker. With the\ndiscovery of new versions, we see that this pattern of masquerading as legitimate software continues among all of the components\nof WildCard.\n\nNow with the DMAdevice, AppMessagingRegistrar variant, and Rustdown, we see a pattern of using legitimate services to\nmasquerade the malware. We can assume WildCard uses phishing campaigns to convince victims to download their malware.\n\n\n-----\n\nAs mentioned, part of WildCard’s operations share behavioral patterns with Operation ElectricPowder. This malware also\nmasqueraded as legitimate software and used an elaborate and diverse phishing campaign, including decoy news sites and\nFacebook profiles.\n\nIf the connection between the two operations is solid, it supports WildCard’s investment in extensive social engineering campaigns\nto reach their targets. The early malware of Operation Electric Powder was poorly disguised as legitimate Microsoft components.\nSysJoker variants were more elaborately disguised as benign applications or web development components with names reminiscent\nof TypeScript projects. The newest iteration follows in that web development tool theme by disguising RustDown as a PHP CGI\ncomponent. At this time, we have not discovered the latest infection vector but feel that these TTPs suggest possible targeting of\ndeveloper communities in Israel with trojanized applications.\n\nThe detection of SysJoker traces back to a 2021 incident at an Israeli educational institution. After analyzing the malware, we\nidentified behavioral patterns akin to those of another malware variant that previously targeted Israeli infrastructure. This similarity\npoints to a deliberate pattern of victim targeting shared between the two types of malware.\n\n## Network infrastructure\n\nAnother interesting TTP connecting different WildCard operations is the abuse of benign web services as dead drop resolvers or C2\nhosting. First-stage components consistently reach out to services like GDrive or OneDrive to receive text that is decoded into the\naddress of the intended C2. The threat actor has used a number of hosting providers to host their C2 infrastructure, most recently\nHostinger. During analysis, we found that the C2 is possibly geofenced to respond only to IP addresses from Israel, further\nsupporting our sense of WildCard’s targeting.\n\n## Conclusion\n\nAs we continue to monitor the threat landscape surrounding the ongoing Israeli-Hamas war, it’s important to emphasize the\nexistence of non-traditional threat actors like WildCard that have slipped below the radar. At the time of our initial discovery of\nSysJoker, we were missing the necessary components to bring this threat actor into view fully. As additional variants were\ndiscovered, we found connections to a notable earlier campaign targeting electric power generation in Israel. More recently, the\nWildCard developers have undertaken the popular move from C++ to Rust. Despite having to start their project over in Rust,\nRustDown also shows the same specific traits as newer SysJoker variants and older ElectricPowder components. Clustering these\ndifferent sets of activities showcases an APT group consistently targeting Israeli critical sectors like education, IT infrastructure, and\npossibly electric power generation active to this day.\n\n**I would like to extend my sincere gratitude to Juan Andres Guerrero-Saade and Ryan Robinson for their contributions to**\n**the development and refinement of this blog.**\n\n## IOCs\n\n**Rustdown**\n\nd4095f8b2fd0e6deb605baa1530c32336298afd026afc0f41030fa43371e3e72\n\n**DMAdevice (SysJoker May 2022 Variant)**\n\ne076e9893adb0c6d0c70cd7019a266d5fd02b429c01cfe51329b2318e9239836\n\n6c8471e8c37e0a3d608184147f89d81d62f9442541a04d15d9ead0b3e0862d95\n\n**AppMessagingRegistrar (SysJoker June 2022 Variant)**\n\n67ddd2af9a8ca3f92bda17bd990e0f3c4ab1d9bea47333fe31205eede8ecc706\n\n**SysJoker Downloader**\n\n96dc31cf0f9e7e59b4e00627f9c7f7a8cac3b8f4338b27d713b0aaf6abacfe6f\n\n**Dead Drop Resolver URL**\n\nhttps://onedrive.live[.]com/download?resid=16E2AEE4B7A8BBB1%21112&authkey=!AED7TeCJaC7JNVQ (RustDown)\n\nhttps://onedrive.live[.]com/download?cid=F6A7DCE38A4B8570&resid=F6A7DCE38A4B8570%21115&authkey=AKcf8zLcDneJZHw\n(DMAdevice.exe)\n\nhttps://onedrive[.]live.com/download?cid=3014636895E3FE3B&resid=3014636895E3FE3B%21106&authkey=AD4OGrVz9h17Jzo\n(AppMessagingRegistrar.exe)\n\n\n-----\n\n**C2**\n\n85.31.231[.]49:443 (Rustdown)\n\nsharing-u-file[.]com (DMAdevice.exe)\naudiosound-visual[.]com (AppMessagingRegistrar.exe)filestorage-short[.]org (SysJoker Downloader)\n\n**Nicole Fishbein**\nNicole is a malware analyst and reverse engineer. Prior to Intezer she was an embedded researcher in the Israel Defense Forces\n(IDF) Intelligence Corps.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.11.27.WildCard_SysJoker_Israel/WildCard_%20The%20APT%20Behind%20SysJoker%20Targets%20Critical%20Sectors%20in%20Israel.pdf"
    ],
    "report_names": [
        "WildCard_ The APT Behind SysJoker Targets Critical Sectors in Israel"
    ],
    "threat_actors": [
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cd402658-d63c-40bc-b6ce-bb3d742904c5",
            "created_at": "2023-12-01T02:02:33.960041Z",
            "updated_at": "2025-03-27T02:02:10.045693Z",
            "deleted_at": null,
            "main_name": "Operation Electric Powder",
            "aliases": [],
            "source_name": "ETDA:Operation Electric Powder",
            "tools": [
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1705457045,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1705378881,
    "ts_modification_date": 1705378881,
    "files": {
        "pdf": "https://archive.orkl.eu/359be6f14e3151f7efa230ed79d29fc01bdda962.pdf",
        "text": "https://archive.orkl.eu/359be6f14e3151f7efa230ed79d29fc01bdda962.txt",
        "img": "https://archive.orkl.eu/359be6f14e3151f7efa230ed79d29fc01bdda962.jpg"
    }
}