{
    "id": "53d7c254-88fb-4c2e-974b-bca220de64c5",
    "created_at": "2023-01-12T15:05:05.816839Z",
    "updated_at": "2025-03-27T02:05:42.978587Z",
    "deleted_at": null,
    "sha1_hash": "962ff489d4a0c31716db6349fc5f9b40b2c0e96c",
    "title": "2017-01-18 - Newly discovered Mac malware found in the wild also works well on Linux",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:10Z",
    "file_modification_date": "2022-05-28T01:56:10Z",
    "file_size": 327243,
    "plain_text": "# Newly discovered Mac malware found in the wild also works well on Linux\n\n**[arstechnica.com/security/2017/01/newly-discovered-mac-malware-may-have-circulated-in-the-wild-for-2-years/](https://arstechnica.com/security/2017/01/newly-discovered-mac-malware-may-have-circulated-in-the-wild-for-2-years/)**\n\nDan Goodin\n\nA newly discovered family of Mac malware has been conducting detailed surveillance on\ntargeted networks, possibly for more than two years, a researcher reported Wednesday.\n\nThe malware, which a recent Mac OS update released by Apple is detecting as Fruitfly,\ncontains code that captures screenshots and webcam images, collects information about\neach device connected to the same network as the infected Mac, and can then connect to\n[those devices, according to a blog post published by anti-malware provider Malwarebytes. It](https://blog.malwarebytes.com/threat-analysis/2017/01/new-mac-backdoor-using-antiquated-code/)\nwas discovered only this month, despite being painfully easy to detect and despite\nindications that it may have been circulating since the release of the Yosemite release of OS\nX in October 2014. It's still unclear how machines get infected.\n\n\"The first Mac malware of 2017 was brought to my attention by an IT admin, who spotted\nsome strange outgoing network traffic from a particular Mac,\" Thomas Reed, director of Mac\nofferings at Malwarebytes, wrote in the post. \"This led to the discovery of a piece of malware\nunlike anything I've seen before, which appears to have actually been in existence,\nundetected for some time, and which seems to be targeting biomedical research centers.\"\n\n## Ancient artifacts\n\n\n-----\n\nThe malware contains coding functions that were in vogue prior to the first release of OS X in\n[2001. Open source code known as libjpeg, which the malware uses to open or create JPG-](http://ijg.org/)\nformatted image files, was last updated in 1998. It's possible Fruitfly wasn't developed until\nmuch later and simply incorporated those antiquated components. Still other evidence—\nincluding a comment in the code referring to a change made in Yosemite and a launch agent\nfile with a creation date of January 2015—suggests the malware has been in the wild for at\nleast two years.\n\n[Enlarge](https://cdn.arstechnica.net/wp-content/uploads/2017/01/fruitfly-code.png)\n\"The only reason I can think of that this malware hasn’t been spotted before now is that it is\nbeing used in very tightly targeted attacks, limiting its exposure,\" Reed wrote. \"There have\nbeen a number of stories over the past few years about Chinese and Russian hackers\ntargeting and stealing US and European scientific research. Although there is no evidence at\nthis point linking this malware to a specific group, the fact that it’s been seen specifically at\nbiomedical research institutions certainly seems like it could be the result of exactly that kind\nof espionage.\"\n\n[Another intriguing finding: with the exception of Mac-formatted Mach object file binary, the](https://en.wikipedia.org/wiki/Mach-O)\nentire Fruitfly malware library runs just fine on Linux computers. Reed said Malwarebytes\nhas yet to spot a Linux variant, but he said he wouldn't be surprised if one existed. He said\nhe has also come across Windows-based malware that connected to the same control\nserver used by the Mac malware.\n\nDespite its functionality, Fruitfly remains unsophisticated compared to some malware. Its\n[control servers are simply the IP address 99.153.29.240 and the dynamic DNS address](https://en.wikipedia.org/wiki/Dynamic_DNS)\neidk.hopto.org. Its method for keeping Macs infected even after they're rebooted—a hidden\nfile and a launch agent—is also outdated because it's so easy to detect and remove. People\nwho work with Macs inside research labs should consider checking their machines for\ninfections. Besides the update automatically pushed by Apple, Malwarebytes also detects\nthe infection, although it's known as OSX.Backdoor.Quimitchip.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-18 - Newly discovered Mac malware found in the wild also works well on Linux.pdf"
    ],
    "report_names": [
        "2017-01-18 - Newly discovered Mac malware found in the wild also works well on Linux.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535905,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653702970,
    "ts_modification_date": 1653702970,
    "files": {
        "pdf": "https://archive.orkl.eu/962ff489d4a0c31716db6349fc5f9b40b2c0e96c.pdf",
        "text": "https://archive.orkl.eu/962ff489d4a0c31716db6349fc5f9b40b2c0e96c.txt",
        "img": "https://archive.orkl.eu/962ff489d4a0c31716db6349fc5f9b40b2c0e96c.jpg"
    }
}