{
    "id": "540fb57f-526f-43e5-9e11-3c79fbcd0b41",
    "created_at": "2023-01-12T15:02:35.770987Z",
    "updated_at": "2025-03-27T02:05:54.198119Z",
    "deleted_at": null,
    "sha1_hash": "bb172cbbec266b0832e951948ea533ad7fee3de8",
    "title": "2020-10-08 - Taiwan Government Targeted by Multiple Cyberattacks in April 2020 Part 1- Waterbear Malware",
    "authors": "",
    "file_creation_date": "2022-05-27T22:58:53Z",
    "file_modification_date": "2022-05-27T22:58:53Z",
    "file_size": 2293901,
    "plain_text": "# Taiwan Government Targeted by Multiple Cyberattacks in April 2020\n\n**[medium.com/cycraft/taiwan-government-targeted-by-multiple-cyberattacks-in-april-2020-1980acde92b0](https://medium.com/cycraft/taiwan-government-targeted-by-multiple-cyberattacks-in-april-2020-1980acde92b0)**\n\nCyCraft Technology Corp January 31, 2022\n\n[CyCraft Technology Corp](https://medium.com/@cycrafttechnology?source=post_page-----1980acde92b0--------------------------------)\n\nOct 8, 2020\n\n\n7 min read\n\n## Part 1: Waterbear Malware\n\nIn April 2020, highly malicious cyber activity was detected in several Taiwan government agencies. In one\nenvironment alone, out of the thousands of endpoints scanned, 30 endpoints were confirmed to be infected, and\n10 high-risk endpoints were connected by these compromised endpoints. 10 key malware were discovered\nduring these sophisticated targeted attacks — most of them were Waterbear Loader malware.\n\n[This article is Part 1 of a series of articles. Click here to read Part 2: Owlproxy Malware.](https://medium.com/@cycraft_corp/taiwan-government-targeted-by-multiple-cyberattacks-in-april-2020-3b20cea1dc20)\n\n\n-----\n\nCyCraft AIR assigns Threat Level 10 to the most severe and most damaging malware.\n\n## Highlighted Tactics\n\nThe attackers discovered and leveraged a weak point in trusted and commonly used data loss prevention (DLP)\nsoftware in order to trigger malware and maintain persistence. The government agencies targeted for attack in\nApril 2020 had already been compromised prior to the April attacks; however, CyCraft AIR (our automated\ndetection and response platform) discovered that not all the malware from the previous attack was removed\nduring another vendor’s IR investigation, allowing the attackers to use the previously compromised endpoints\nyet again.\n\nThe discovered Waterbear Loader malware used several methods to evade defense. (Each method will be\nexpanded upon later in the article.)\n\nDLL hijacking to stealthily trigger next stage malware\nEnlarging binary size to bypass scanning protocols\nHeaven’s Gate to avoid antivirus detection\nForcing DLLs to unload to obfuscate malware\nPadding memory with Kernel32 content to confuse analyses\n\n## Network Level Activity\n\nThe attackers first compromised a user’s endpoint to harvest administrative credentials. The credentials were\nthen utilized to RDP a web server. With the connectivity of the web server, the attackers “net use” through\n(proxying) the webserver, allowing them to distribute malware directly to other endpoints.\n\nAs mentioned before, several malware was not removed from a previous IR investigation. One endpoint in the\nvictim’s private network was still compromised. The attackers used this previously compromised endpoint in the\nvictim’s private network as the C2 server for this attack.\n\n## System Level Activity\n\n DLL Hijacking\n\nOne key feature of this attack was DLL Hijacking.\n\n## What is DLL Hijacking?\n\n\n-----\n\nA DLL hijacking attack exploits the Windows search and load mechanism, allowing attackers to inject code into\napplications through disk manipulation. By simply injecting a DLL file in the right location, attackers can cause\nvulnerable applications to load malicious DLLs.\n\nThe attackers leveraged a DLL hijacking vulnerability in the DLP software to enlarge its defensive evasion\ncapability and to persistently trigger next-stage malware. However, the DLP software failed to verify the integrity\nof their loaded DLLs. Thus the DLP software loaded the malicious DLL with high privilege.\n\nThe attacker modified LOG4C.DLL to implant a new entry in the import table. The new entry will enforce the\nDLP software to load the malicious SecureFile.dll (or LIBDIG.dll). The loaded DLL then injects shellcode to\nsystem services, including Winmgmt, sens, Wuauserv and LanmanServer. Then, the next-stage malware\npayload is invoked to communicate to the C2 server.\n```\nNext-Stage MalwareC[:]\\PROGRAM\nFILES\\XYZ\\AGENT\\ExportAgentConfig[.]datC[:]\\Windows\\PolicyDefinitions\\TrayBar.admx\n\n```\n\n-----\n\n## Increased Size\n\nFile-based scanners sometimes skip the scanning of larger files to maintain performance. The attackers\nenlarged the file size to bypass scanning altogether. The original size of file oci[.]dll is 66.5 KB however, as the\nabove screenshot of CyberTotal demonstrates, oci[.]dll had been enlarged to 130 MB. Thus allowing it to be\nignored by numerous security scanning tools.\n\n## Windows IKEEXT Service Abuse\n\n\n-----\n\nThe threat actor made use of Windows IKEEXT Service to load even more malware into memory\nWLBSCTRL.DLL. Windows IKEEXT Service is a service for APN authentication that is disabled in the default\nWindows setting. This service is widely abused by attackers we observe.\n\n## Waterbear Loader Malware Analysis\n\n File Metadata\n\nfilename: libgid.dll\n\nmd5: e3be074e0da9ba0c3201ceea4dd972d6\n\nsha1: cd8f49e467cf2f630c7f3b38a2e4c30e7bac6466\n\nsha256: e69690e4f94a60678aefc3adb80eef484bb5ca4285a2d3aabc1bb8d975fb7610\n\nfiletype: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\nfamily: Waterbear Loader\n\n## Indicator\n\nfile_path: C[:]\\Windows\\PolicyDefinitions\\TrayBar.admx\n\n## RICH Header\n\nThe Waterbear Loader malware resurrected a 10-year-old antivirus evasion technique known as Heaven’s Gate.\nIn this particular case, the attackers applied Heaven’s Gate to inject shellcode into the 64-bit system service\nfrom 32-bit WoW64.\n\nJust as 64-bit and 32-bit programs are quite different, so are analysis mechanisms. Malware equipped with\nHeaven’s Gate contains both 64-bit and 32-bit parts. Therefore, some monitor/analysis systems will only apply\n[32-bit analysis and will fail the 64-bit part; thus, this approach will break some monitor/analysis mechanisms.](https://github.com/rwfpl/rewolf-wow64ext)\n\n\n-----\n\nWaterbear Loader forced itself to be unloaded, allowing it to evade detection from some memory forensic tools.\n\n## What is Heaven’s Gate?\n\nThis antivirus evasion technique permits 32-bit malware to hide API calls by switching to a 64-bit\nenvironment. Malware typically remains hidden inside the loader making it difficult for the AV to detect.\n\nWhile Heaven’s Gate was first considered to be an advanced technique, over the last decade the\nHeaven’s Gate exploit has been observed in more and more rootkits as well as other malware, such as\nthe infamous Emotet trojan.\n\nEven though usage of the Heaven’s Gate spread, Microsoft’s release of Control Flow Guard (CFG) in\nWindows 10 immediately hindered the exploit’s effectiveness as CFG prevented code jumps from WoW64\n32-bit execution to native 64-bit code execution space. However, like most exploits, attackers still equip\nthem when targeting legacy systems and the like — further demonstrating the need for organizations to\nupdate defenses early and update them often.\n\n## Behavior\n\n\n-----\n\n1. Waterbear Loader first checks whether the current execution context is WoW64, and looks for Winmgmt,\n\nsens, Wuauserv, LanmanServer to inject the shellcode.\n2. Then, Waterbear Loader uses xor to decrypt strings in file with key 0x2a361c78\n3. Waterbear Loader reads the encrypted payload. In this case: C:\\Windows\\PolicyDefinitions\\TrayBar.admx\n4. Then uses RC4 to decrypt it with key:\n\n690c402f435878175d454028455a751b5372791e4358750c4359720b76626e1953747d0a0457781552361c78\n5. In an attempt to further confuse analysis, Waterbear Loader padded contents from Kernel32.dll in front of\n\nand behind their shellcode.\n6. Used x64_InjectShellcode to inject shellcode to the previously found service by Heaven’s Gate.\n7. In the end, the LdrData data is modified and forced to free the library by FreeLibraryAndExitThread.\n\n\n-----\n\n-----\n\n## MITRE ATT&CK®\n\nThe following MITRE ATT&CK techniques were observed in this attack.\n\n## Persistence\n\n\n-----\n\n[T1547.001 Registry Run Keys/ Startup FolderT1574.001 DLL Search Order Hijacking](https://attack.mitre.org/techniques/T1547/001/)\n\n## Privilege Escalation\n\n[T1574.001 DLL Search Order Hijacking](https://attack.mitre.org/techniques/T1574/001/)\n\n## Defense Evasion\n\n[T1574.001 DLL Search Order HijackingT1027.002 Software PackingT1070.006 Timestop](https://attack.mitre.org/techniques/T1574/001/)\n\n## Lateral Movement\n\n[T1021.001 Remote Desktop Protocol](https://attack.mitre.org/techniques/T1021/001/)\n\n## IOCs\n```\n30DDEFC3093AFD7075A74BE30A381A3D   SQLWVSS.DLLC6EE3CEED5ADA7EE23FEB0E0CEA95193  \nIGTERM.DLL8B4631B618D2B516A3D3EBC38B25D267   OCI.DLL2FAAFC5D2C4BC6DE4D0B73B34FB7B379   SECUFILE.DLL\nE3BE074E0DA9BA0C3201CEEA4DD972D6   LIBGID.DLL F44805399017DAECF9E37F7190BCF699   WLBSCTRL.DLL\nF10034D1D8F90F36FEA602A4128BAEBC   SQLWVSS_NT.DLL 49D6C7FD1D47F345F64EEA6DA8591084   LOG4C.DLL\nAE63EBAE30678DA8A7314A9427747BBE   LIBGID.DLL 48AA2A38E5125C4E0E4A069C473F67FC   LOG4C.DLL\n\n Mitigation\n\n```\n1. Add listed IOCs to preventative solution blacklists.\n\n2. Adjust detection and response solutions to detect listed IOCs.\n\n3. Meticulously tracking down the root cause of the attack (not just the endpoint) and thoroughly removing\nmalware is not only paramount in an IR investigation but could also prevent future attacks.\n\n4. As DLP software is widely deployed in sensitive organizations, is daily-used software, and often has high\nprivilege, DLP vendors and customers both need to constantly be striving on hardening security to maintain\nresilience even in the worst of situations.\n\n5. Do not rely on a one-solution security policy. Preventative solutions (e.g., firewalls, antivirus) and DLP\nsolutions are no longer enough to maintain resilience during an attack of this sophistication. AI-driven detection\nand response solutions, such as our award-winning CyCraft AIR, not only reduce mean dwell time but also\nincrease SOC efficiency, automate investigations, and reduce alert fatigue.\n\n[This article is Part 1 of a series of articles. Click here to read Part 2: Owlproxy Malware.](https://medium.com/@cycraft_corp/taiwan-government-targeted-by-multiple-cyberattacks-in-april-2020-3b20cea1dc20)\n\n## Follow Us\n\n\n-----\n\nWhen you join CyCraft, you will be in good company. CyCraft secures government agencies, Fortune Global\n500 firms, top banks and financial institutions, critical infrastructure, airlines, telecommunications, hi-tech firms,\nand SMEs.\n\nWe power SOCs with our proprietary and award-winning AI-driven MDR (managed detection and response),\nSOC (security operations center) operations software, TI (threat intelligence), Health Check, automated\nforensics, and IR (incident response), and Secure From Home services.\n\n## Additional Related Resources\n\nLearn how we targeting Taiwan’s high-tech ecosystem. Read our full analysis and malware reversal.\n\n, and CyCraft Global Project Manager, Chad Duffy, speak on the latest MITRE ATT&CK Evaluations. Read\ntheir thoughts on our results and the philosophy powering CyCraft.\nHas your organization shifted to a Work From Home environment? Learn how to receive .\ndrops your mean dwell time down from 197 days to under 1 day without false positives or false negatives.\nKnow with confidence if hackers have penetrated your enterprise.\n\n## READY FOR A DEMO?\n\n_Contact us directly for more details: contact@cycraft.com_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-08 - Taiwan Government Targeted by Multiple Cyberattacks in April 2020 Part 1- Waterbear Malware.pdf"
    ],
    "report_names": [
        "2020-10-08 - Taiwan Government Targeted by Multiple Cyberattacks in April 2020 Part 1- Waterbear Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535755,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653692333,
    "ts_modification_date": 1653692333,
    "files": {
        "pdf": "https://archive.orkl.eu/bb172cbbec266b0832e951948ea533ad7fee3de8.pdf",
        "text": "https://archive.orkl.eu/bb172cbbec266b0832e951948ea533ad7fee3de8.txt",
        "img": "https://archive.orkl.eu/bb172cbbec266b0832e951948ea533ad7fee3de8.jpg"
    }
}