{
    "id": "54754226-13eb-4293-b791-3997756276d6",
    "created_at": "2023-01-12T14:59:14.52271Z",
    "updated_at": "2025-03-27T02:17:23.722922Z",
    "deleted_at": null,
    "sha1_hash": "1c0fd40f51a2373c929bb7e2c8709193ffad5489",
    "title": "2019-03-18 - Enterprise Malware-as-a-Service- Lazarus Group and the Evolution of Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T23:14:53Z",
    "file_modification_date": "2022-05-27T23:14:53Z",
    "file_size": 66168,
    "plain_text": "# Enterprise Malware-as-a-Service: Lazarus Group and the Evolution of Ransomware\n\n**[web.archive.org/web/20200922165625/https://dcso.de/2019/03/18/enterprise-malware-as-a-service/](https://web.archive.org/web/20200922165625/https://dcso.de/2019/03/18/enterprise-malware-as-a-service/)**\n\nIn an interesting twist to the use of ransomware, an attacker leveraged a vulnerability in a\n[plug-in for a remote-monitoring tool, Kaseya VSA, to gain access to a small Managed](https://web.archive.org/web/20200922165625/https://www.infosecurity-magazine.com/news/gandcrab-ransomware-slingers-1-1/)\nServices Provider, and infect approximately 80 companies with the GandCrab ransomware.\nThis is a notable shift in tactics for purveyors of ransomware, and follows the trend of\ncommercial crimeware being used to attack businesses, and now service providers, rather\nthan individual.\n\n## The History of Ransomware: From Userspace to the Enterprise\n\nThe history of ransomware (extortion via malicious software) goes all the way back to 1989,\n[with PC Cyborg, also known as the AIDS Trojan, written by Joseph Popp. The malware had](https://web.archive.org/web/20200922165625/https://www.theatlantic.com/technology/archive/2016/05/the-computer-virus-that-haunted-early-aids-researchers/481965/)\nserious flaws, allowing key extraction from the code itself, and ultimately did little damage in\ncomparison to the most destructive attacks to date, WannaCry and Petya/NotPetya. The first\nrobust ransomware emerged with the introduction of public-key-cryptography to the\nransomware concept by Adam L. Young and Moti Yung. Young & Young’s experimental\n[malware, and coined the term cryptovirology, encompassing overt and covert attacks utilizing](https://web.archive.org/web/20200922165625/https://ieeexplore.ieee.org/document/502676)\ncryptographic functions. By 2006, various ransomwares had begun to utilize more\nsophisticated RSA encryption schemes and larger key sizes. In 2008, the malware known as\nGpcode.AK utilized a 1024-bit RSA key, which was determined to be computationally\ninfeasible to break without a distributed effort.\n\nIn 2013, the now infamous Cryptolocker ransomware netted its operators an estimated $27\nmillion from infected users, shooting ransomware to the top of the profitable e-crimes list next\nto banking trojans. Cryptolocker itself evolved, and soon began targeting network-attached\n[storage devices, and in 2015, began to target Linux-based webservers. Further evolution of](https://web.archive.org/web/20200922165625/https://www.justice.gov/opa/pr/us-leads-multi-national-action-against-gameover-zeus-botnet-and-cryptolocker-ransomware)\nransomware came with CryptoWall, which utlized a digital signature in an effort to appear\ntrustworthy. CryptoWall took further destructive measures as well, deleting volume shadow\ncopies, on top of its capabilities of password-stealing and BitCoin wallet hijacking. The\nSamSam ransomware, which was first detected in 2016, targeted JBoss servers. Rather\nthan utilizing email phishing and malicious documents, SamSam directly infected webservers\nover the internet. Victims of SamSam included hospitals, and local governmental bodies in\nthe United States: the city of Atlanta, GA, USA, was completely crippled by [SamSam in](https://web.archive.org/web/20200922165625/https://blog.barkly.com/atlanta-ransomware-attack-2018-samsam)\nMarch 2018.\n\nIn May 2017, the highly destructive WannaCry ransomware spread across the internet using\nan exploit named EternalBlue which was leaked from the U.S. National Security Agency. An\nestimated 230,000 systems were infected in more than 150 countries. The malicious\n\n\n-----\n\nsoftware demanded money from users in 20 different languages. WannaCry was the first\nransomware to affect enterprise organizations, which included Telefónica, the British National\nHealth Service, FedEx, Deutsche Bahn, Honda, Renault, and even the Russian Interior\nMinistry. For the first time, the global enterprise was forced to deal with threats which were\nunconcerned with stealing trade secrets, but instead acted to cause as much destructive\ndamage as possible if their demands were not met.\n\n[In March 2018, the Petya ransomware made its first introduction, followed by a heavily](https://web.archive.org/web/20200922165625/https://www.forbes.com/sites/leemathews/2017/08/16/notpetya-ransomware-attack-cost-shipping-giant-maersk-over-200-million/)\nmodified version which wreaked havoc on business, most notably the logistics firm Maersk,\nwhose Business IT infrastructure was almost completely destroyed, and terminals in four\ncountries were impacted, causing delays and disruptions for weeks. Speculation from\nindustry experts, including noted exploit developer known by his handle, the grugq noted that\nNotPetya’s purpose appeared to be wholly destructive, and without concern for collecting\nextortion fees, as is the general operation of file-locking malware. Instead, NotPetya simply\nperformed permanently destructive acts on the systems it infected.\n\n## Nation-State Cyber-Attacks as a Service\n\nA ransomware known as HERMES began appearing in October 2017, when it was used\nagainst an attack against the Far Eastern International Bank in Taiwan. $60 million was\nstolen in a sophisticated attack on the SWIFT system. Notably, the HERMES ransomware\nappeared to be used solely as a diversion from the true heist: the attack on the SWIFT\nsystem. Almost one year later, in August of 2018, [a new type of ransomware infection burst](https://web.archive.org/web/20200922165625/https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/)\nonto the stage: Named Ryuk, after the name with which the ransom notes were signed,\nvictims included large newspaper publications such as the New York Times, Los Angeles\nTimes, and Wall Street Journal.\n\nHERMES was attributed to the infamous Lazarous Group, believed to be funded by the\ngovernment of North Korea. As samples of Ryuk were analyzed, it was found to re-use code\nfrom HERMES: a solid link to Lazarus Group. Ryuk is a fully-developed ransomware\npackage, and unlike HERMES, is not a decoy: the malware is wholly intended for the task of\n[digital extortion. Ryuk marks the third time that Lazarus Group has used destructive malware](https://web.archive.org/web/20200922165625/https://www.kaspersky.com/blog/operation-blockbuster/11407/)\nagainst its targets, the most notable being Sony Pictures in 2015, where ransomware was\nused to destroy studio infrastructure.\n\n[Dominating ransomware news recently has been the ransomware-as-a-service GandCrab:](https://web.archive.org/web/20200922165625/https://www.vmray.com/cyber-security-blog/gandcrab-ransomware-evolution-analysis/)\nthe software is maintained by a dedicated development team, whom deliver frequent updates\nwith additional capabilities and evasion techniques. Continuing with the trend of organized\ncrimeware targeting businesses instead of end-users, GandCrab was used to infect the\ncustomers of a small Managed Services Provider, by way of breaching the MSP itself. Rather\nthan the MSP, the customers bore the infection and potential costs of ransom. By targeting\nthe MSP, the attackers managed to infect 80 victims at the same time. Practical and efficient.\n\n\n-----\n\n## Opinion: Lazarus Group and the Evolving Landscape of Enterprise- capable Malware\n\nThe trend of crimeware shifting from targeting end-users to targeting the enterprise has\ncontinued in other malware areas, specifically with the evolution of the Emotet malware, a\ntrojan which targets bank information. First identified by researchers in 2014, it has evolved\nfrom a simple money-stealing trojan which spreads via malspam campaigns, to a\n[sophisticated malware toolkit capable of stealing emails and spreading via the infamous](https://web.archive.org/web/20200922165625/https://www.malwarebytes.com/emotet/)\nEternalBlue exploit. Emotet is now capable of infecting an entire organization via its lateral\nmovement capabilities.\n\n[The line between organized crimeware and nation-state espionage-ware is a fine one](https://web.archive.org/web/20200922165625/https://threatpost.com/nation-states-distancing-themselves-from-apts/123711/)\nindeed: in a report by Cybereason’s Intelligence Unit released in February 2017 at the RSA\nConference, Russia, China, and the United Arab Emirates have been found to be\noutsourcing targeted operations to dedicated hacking groups, presumably in further attempts\nto mitigate risk and foil attribution. The use of outsourced labor, and potentially also malwareas-a-service is consistent with changing tactics, techniques, and procedures to confuse and\ncounter one’s adversaries. From a purely objective standpoint, these behaviours should be\nexpected.\n\nLazarus Group has demonstrated a concentrated and continuous effort to develop and\ndeliver both HERMES and Ryuk in targeted attacks, and like other skilled actors, makes\nefforts to incorporate new evasion, privilege escalation, and lateral movement techniques\ninto new releases. Attribution in malware analysis is frequently difficult (and sometimes\nimpossible), due to a combination of obfuscation techniques, and intentionally misleading\nclues left by the authors for analysts who stumble upon them, in addition to the copycat\nnature of crimeware: where one software leads, others will follow, and this path leads straight\nto improvement and innovation. The authors of crimeware learn from each other’s\nimplementations, and from the analysis performed by incident responders.\n\nIt is possible, and even likely, that Lazarus Group may manage to breach a large hosting\nprovider, and deliver ransomware to every customer. Such an attack is not only likely, but\nalso fits within Lazarus Group’s modus operandi: an attack which infects dozens or hundreds\nof customers may also effectively obfuscate their true purpose, in the same way HERMES\nwas used to mask SWIFT fraud. [McAfee Labs makes similar observations, finding that Ryuk](https://web.archive.org/web/20200922165625/https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/ryuk-exploring-the-human-connection/)\n(and by extension Lazarus Group) pose an existential risk to IT Hosting and Freight /\nLogistics firms.\n\nIn the sport of malware-as-a-moneymaking-mechanism, Lazarus Group is a world-class\nplayer, and will certainly continue its trend of constantly evolving tactics and targets.\n\nWho we are\n\n\n-----\n\nThe Threat Intelligence -Team helps clients to reduce the threat posed by adversaries to their\nnetworks by leveraging the power of collaborative defense in combination with\ncomprehensive analytics and contextualized threat intelligence. DCSO delivers actionable\nintelligence on all levels – from atomic Indicators of Compromise (IoC) to insights into the\npolitical, economic and cultural context of adversaries.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-18 - Enterprise Malware-as-a-Service- Lazarus Group and the Evolution of Ransomware.pdf"
    ],
    "report_names": [
        "2019-03-18 - Enterprise Malware-as-a-Service- Lazarus Group and the Evolution of Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535554,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653693293,
    "ts_modification_date": 1653693293,
    "files": {
        "pdf": "https://archive.orkl.eu/1c0fd40f51a2373c929bb7e2c8709193ffad5489.pdf",
        "text": "https://archive.orkl.eu/1c0fd40f51a2373c929bb7e2c8709193ffad5489.txt",
        "img": "https://archive.orkl.eu/1c0fd40f51a2373c929bb7e2c8709193ffad5489.jpg"
    }
}