{
    "id": "548b520e-2840-44ab-aa75-32243575cb42",
    "created_at": "2022-10-25T16:48:13.253137Z",
    "updated_at": "2025-03-27T02:08:51.325901Z",
    "deleted_at": null,
    "sha1_hash": "e802d6f06085f22242a66b06c785315e1c63c070",
    "title": "\"Wicked Rose\" And The Ncph Hacking Group",
    "authors": "iDefense",
    "file_creation_date": "2012-11-13T21:24:56Z",
    "file_modification_date": "2012-11-13T21:24:56Z",
    "file_size": 811768,
    "plain_text": "# \"Wicked Rose\" and the NCPH Hacking Group\n_by Ken Dunham & Jim Melnick_\n\nZero-day attacks, where an attack occurs before public knowledge of a vulnerability is known, is\na growing cause of concern for security professionals in the 21[st] century. An unprecedented\nnumber of zero-day attacks took place in 2006, largely involving Microsoft Office Files. Ken\nDunham, Director of the Rapid Response Team, and Jim Melnick, Director of Threat Operations,\nled the VeriSign iDefense intelligence team to track down Chinese hackers for hire out of China,\nresponsible for many of the attacks in 2006. Wicked Rose is the ring-leader of the NCPH\nhacking group and this is the story of their maturation into significant global threat by 2006.\n\n## 1 Introduction to N.C.P.H.\n\nN.C.P.H. (Network Crack Program Hacker) has about ten members or associates. Four core\nmembers exist as of 2006:\n\n        - (Wicked) Rose\n\n        - KuNgBiM\n\n        - Rodag\n\n        - Charles\n\nThere are also some six other associates within NCPH and two other positions (possibly unfilled\npositions) whose purpose is unclear. However, “Rose” or “Wicked Rose” seems to be the\nprimary leader. Membership rules, recruiting goals and standards are unknown. However, some\nmembers appear to be current or former students of Sichuan University of Science and\nEngineering.[1]\n\nThe group is responsible for development and deployment of exploit codes related vulnerabilities\nin Microsoft Word Malformed OLE Structure Code Execution and Microsoft Excel Malformed\nBIFF Structure Code Execution.\n\n## 2 Public Knowledge of a Zero-Day Word Exploit\n\nThe story of NCPH zero-day attacks begins publicly on May 18, 2006. On this day the Internet\nStorm Center reports a new possible zero-day attack. iDefense worked closely with SANS and\nother organizations to analyze the threat landscape as it related to exploitation of this\nvulnerability. Within the next 36 hours, iDefense gained access to multiple codes and extracted a\nnew rootkit called GinWui. Independent research proved the following:\n\n  - Exploitation targeted a new vulnerability that allowed attackers to successfully exploit\n\ncomputers running fully patched versions of Microsoft Word 2002 and others.\n\n  - Exploitation dated to May 12, 2006 and involved at least six unique hostile exploit files.\n\niDefense confirmed that attacks targeted two organizations, one in the United States and\none in Japan.\n\n  - Chinese-authored rootkits GinWui.A and GinWui.B exist in several attacks. iDefense\n\nidentified the rootkits' source and authors as Chinese actor \"Wicked Rose\" and others\nprofiled later in this report.\n\n\n-----\n\n  - Successful installation of the rootkit requires Administrator or Debugger rights. Initial\n\nexploitation, however, does not require Administrator rights.\n\n  - iDefense identified unique malicious code attacks pointing to nease.net and authored\n\nseveral Snort signatures for this traffic. iDefense continues to monitor other domains\nrelated to the attack.\n\nThe original attack upon a large DoD entity within the USA began on May 12, 2006. Targets of\nthe attacker were apparently \"Googled\" by the attacker. Three variations of a Microsoft Word\nzero-day attack are involved in the attack. A few dozen attack files are first distributed to less\nthan a dozen targets to identify which version works within the organization.\n\nOnce attackers identify the vulnerable version of Microsoft Word used within the organization\nclose to 200 messages sent out to multiple targets within the organization within 24 hours. This\nsecond wave of attack is distributed as \"Planning document 5-16-2006.doc\". This code is\nimproved beyond the first variant sent out earlier to identify the vulnerable version of Word\nwithin the targeted network.\n\nA third attack commences on May 17, 2006. During this period, the Internet Storm Center and\nothers get involved and the case becomes public. In the end, iDefense identified six unique\nsamples, of which three are more prevalent than other variants.\n\n## 3 The GinWui Backdoor Rootkit Payload\n\nZero day attacks commenced in May 2006 attempted to install a GinWui backdoor Trojan horse\nand Windows rootkit. A DLL file called winguis.dll and several SYS files install themselves\nwhen a computer is successfully attacked through an exploit. Two versions of the GinWui\nrootkit are installed during several attacks in May and June 2006.\n\n**_NCHP 5.0 Screenshot (GinWui Rootkit)_**\n\n\n-----\n\nremote control\" rootkit code on May 2, 2006. This distribution of GinWui was largely unknown\nand undetected by anti-virus companies at the time of release.\n\nVersions of GinWui used in targeted attacks of May and June 2006 are private versions, not\nreleased to the public. This proves that Wicked Rose either constructed the zero day attacks or\nsold private code to users that performed the attack.\n\nWicked Rose later documents additional updates to his rootkit code, version .50, at\nhttp://rodag.blogbus.com/index.html. By this time Wicked Rose was performing full-time\ndevelopment of this malicious code as a hacker for hire.\n\n## 4 June 21, 2007 – Continued US Targeted Attacks\n\nJust over a month later, following initial GinWui based targeted attacks, another Microsoft Word\nexploit occurs on June 21, 2006. A spoofed e-mail is sent to a target containing a hostile\nMicrosoft Word document. Analysis of the attack reveals that it's likely a test file used to\nidentify what version of Word may be running within the targeted organization, rather than a\nrefined targeted attack upon a known version of Microsoft Word. Chinese text within the Word\ndocument reveal Chinese characters discussing a systematic evaluation of offsets for Microsoft\nWord exploitation:\n\n**_RipGof attacks reveal a Chinese string related to systematic testing of offsets for exploitation._**\n\n## 5 Backtracking Targeted Attacks: RipGof\n\nIn June 2006 another targeted attack emerges, but it's not GinWui this time but a new code,\nRipGof.B. The attack attempts to exploit MS06-027 to install RipGof.B, a Trojan horse. This is\nthe same exploit code used in the former Zero-Day attacks linked to Wicked Rose and the NCPH\n\n\n-----\n\nRipGof.B is an improvement of the former exploit used in GinWui attacks. RipGof.B attacks\nincluded improvements to shellcode that attempts to fork to different locations based upon the\naddress value of the stack to exploit multiple versions of Microsoft Word. Once installed,\nRipGof.B attempts to connect to enjoy.irdet.com and enjoy.bmwsee.com over TCP port 80. It\nruns as a rootkit and backdoor Trojan horse and phones home to a Chinese server with stolen\ndata.\n\nRipGof malicious code does not exist as a distribution in the underground, leading investigators\nto look into the original RipGof.A malicious code. Over a year prior to the 2006 targeted attacks\nRipGof.A emerges in the wild. RipGof.A attempted to exploit the Jet Engine Database exploit in\nMarch 2005. This proves attempted exploitation and installation of code through RipGof for a\nyear prior to more sophisticated codes and attacks.\n\nIn summary, RipGof and GinWui attacks both use the same private exploit code against\nMicrosoft Word and both install rootkit based codes to steal and send information back to\nChinese sources. This circumstantial evidence reveals that Wicked Rose and the NCPH group\nlikely began their exploitation efforts at least a year and a half to two years prior to sophisticated\nattacks that commenced in 2006. Once the group found a vulnerability within Microsoft Word\nthey were able to improve upon it and their targeted attack techniques to distribute multiple\ntargeted attacks and malicious codes for criminal gain as hackers for hire.\n\n## 6 Timeline of Events\n\nWicked Rose and the NCPH hacking group are implicated in multiple Office based attacks over\na two year period. An attack in 2006 used RipGof.B in the attack. RipGof.A first emerged a\nyear earlier using an exploit that is relatively unsophisticated. Over the next year the Evil\nSecurity Team, also out of China, creates the Dasher worm and uses the PcShares Trojan in an\nattack. Wicked Rose gives a recommendation on the Trojan the day it is updated in the spring of\n2006, showing a close affiliation between Wicked Rose and the Evil Security Team actors.\nMultiple attacks that take place in May and June and later 2006 are related to privately held\nexploit code for both Microsoft Word and Excel, proven to be developed by Wicked Rose. A\ntimeline of proven associated events related to Wicked Rose attacks is below:\n\nApril 22, 2005 - RipGof.A JetEngine DB Attack\nDec. 19, 2005 – Dasher worm and PcShare Trojan attack by Evil Security Team\nApril 27, 2006 Update to windowsupdates.net attack site\nApril 30, 2006 - Wicked Rose Drops out of School\nMay 2, 2006 – 3.0beta3 NCPH remote control (GinWui) public release\nMay 12, 2006 - Initial probing and GinWui.A exploitation attempts against US target\nMay 15, 2006 - PcShare Trojan update recommended by Wicked Rose on day of new release\nMay 16, 2006 - Update to windowsupdates.net attack site\nMay 16, 2006 - Multiple GinWui.A attacks against US target\nMay 18, 2006 - SANS reports zero-day attack\nMay 19, 2006 Update to windowsupdates.net attack site\nMay 20, 2006 - GinWui.B Attack\nMay 20, 2006 - WZT Kicked out of NCPH\nMay 29, 2006 - GinWui.C Attack\nJune 1 2006 Update to windowsupdates net attack site\n\n\n-----\n\nJune 15, 2006 – Booli.A Trojan Attack\nJune 16, 2006 - Flux.E Attack\nJune 18, 2006 - RipGof.B Attack\nJune 23, 2006 – PPDropper.A\nJune 23, 2006 – Booli.B Trojan attack\nJune 25, 2006 - GinWui.D Attack\nJune 26, 2006 - GinWui.E Attack\nSept. 27, 2006 – PPDropper.F Attack\nSept. 30, 2006 – GinWui.G Attack\nOct. 9, 2006 – Wicked Rose reports pay increase; likely in September\n\n## 7 A Pictorial Introduction to Wicked Rose and NCPH\n\nJust who are Wicked Rose and the NCPH hacker group? As it turns out, a collection of college\nstudents in China who likely room with one another and regularly support their hacking interests.\nIn-depth research implicates Wicked Rose as the ring-leader of the group, responsible for\nmanaging hacker for hire relationships and paying group members for their work as hackers.\nDuring the time of targeted attacks in 2006 their income increased significantly, to full-time\nwages for part time hacking. Wicked Rose, leader of the group, is pictured below:\n\n`玫瑰` `黑客` (MeiGui HeiKe) “Rose Hacker”\n**_QQ number is 5372453_** **_[www.mghacker.com](http://www.mghacker.com/)_**\n\n[Wicked Rose maintains a personal site at www.mghacker.com.](http://www.mghacker.com/)\n\n\n-----\n\n**_[Wicked Rose's Website: www.mghacker.com](http://www.mghacker.com/)_**\n\nRose is an approximate 20-year-old (2006) student at the Sichuan University of Science &\nEngineering. In the spring of 2006 Wicked Rose claims to have dropped out of school for full\ntime hacking opportunities. Specifically, on April 30, 2006 his blog entry claims he did not\nregister for his university exam. He performed significant updates to his rootkit code from\nMarch through June 2006. He later returned to school by September 2006.\n\nWicked Rose claims responsibility on his blog for targeted e-mail based attacks containing\nMicrosoft Word and CHM exploits from the spring of 2006.\n\n[Other NCPH-member websites include: http://rodag.blogbus.com,](http://rodag.blogbus.com/)\n[http://www.cppblog.com/charles and http://kungbim.blogbus.com. The main NCPH website is](http://www.cppblog.com/charles)\n[www.ncph.net:](http://www.ncph.net/)\n\n**_NCPH St di_** **_b it_** **_h_** **_t_**\n\n\n-----\n\n**_Registrant Contact: ncph studio (ncph2005@126.com) si chuan li gong xue yuan_**\n**_zigong, Sichuan, cn 643000 P: +86.13154663992 F: +86.13154663992_**\n\nThe main location of the NCPH group is in Zigong, Sichuan Province, in south-central China.\n\n**_Zigong, Sichuan Province, in south-central China_**\n\nThe NCPH group (NCPH Studio) in Zigong, China, is shown here:\n\n\n-----\n\nAdditional photos featuring Wicked Rose and NCPH hackers are below, captured from their\nvarious websites and blog entries in 2006. Chinese translation for each photo are below:\n\n\n**\"Wicked Rose\"**\nFrom an ancient Chinese poem,\nexpressing the devotion of his heart for\nhacking.\n\n**Charles: \"Silence belongs to our**\nworld...\"\n\n**Ronag**\n\"Behind every successful design, he\nalways has a slight smile…\"\n\n\n\"After you choose the technology you\nlove, you have to research every system\nand code everyday!\"\n\n**Charles**\n\"Charles always laughs so brightly when\nsearching for program problems!\"\n\n**KuNgBiM**\n\"Only we can feel this kind of happy...\"\n\n\n**_Wi k d R_** **_d NCPH h_** **_ki_** **_h t_**\n\n\n-----\n\nWHG is not a core member of NCPH but a close affiliate of Wicked Rose. WHG appears to be\ncentral to development of the NCPH rootkit, aka GinWui. WHG is credited by Wicked Rose as\none of the authors of this malicious code. WHG is an experienced malicious code author with\nthe following contact information:\n\n  - E-mail address: [whg@163.com](mailto:whg@163.com)\n\n  - QQ Number: 312016\n\n  - Website: [http://cnasm.com](http://cnasm.com/)\n\n  - Real Name: May be \"Zhao Jibing\",赵纪斌.\n\n  - Location: Believed to be employed in the Sichuan province of China.\n\n**_WZT_**\n\nWZT is a former member of the NCPH group who was kicked out during the time of zero-day\nattacks in May 2006. WZT was removed on May 20, 2006. During this time period the zeroday attacks became publicly disclosed, increasing pressure upon the hacking group. It is feasible\nthat WZT may have offended the group in some way related to zero-day attack techniques, strife\nover hacker for hire deals, or competition for hacker for hire deals.\n\nWZT is a former coding expert within the NCPH group and many years experience in hacking.\nHe is responsible for creating multiple tools and regularly giving credit to the infamous Li0n\nChinese hacker (founder of Honker Union (HUC) Chinese group. WZT maintains a website at\ntthacker.cublog.cn.\n\n**_The Jiangsu Connection?_**\n\nWHOIS registrant data for related domains used within attacks and hacker sites reveals a\nconnection with the Jiangsu province of China. One domain, windowsupdates.net, is used in\nattacks and revolves to an IP address in the Sichuan province. Meanwhile, the registrant\n\"zhaofeng network\" is reportedly based out of Jiangsu, not Sichuan. Some of the WHOIS\ninformation clearly contains fraudulent information to presumably direct researchers away from\nthe true identity and location of the attacker responsible for registering the hostile domain. The\nconnection to the Jiangsu and Sichuan provinces remains unclear.\n\n## 8 Concluding Comments\n\nPrior to Wicked Rose and NCPH hacker for hire attacks in 2006, Chinese hackers are only\nknown for their patriotic hacking. This disturbing development reveals two critical threats: 1)\nmotives of Chinese hackers are changing 2) Chinese hackers are regularly associated with\nsophisticated attacks as of 2006.\n\nWicked Rose implicates himself in his early blog entries and website posts in 2006 and prior.\nAn unknown company or entity reportedly paid Wicked Rose for hacking at the rate of 2,000\nRMB a month, about $250 USD. At this time Wicked Rose gave 200 RMB to NCPH hackers\nand kept the rest for himself. Once targeted attacks took place the payment increased five-fold to\n5,000 RMB monthly with $1,000 a month going to NCPH hackers. This is a significant amount\n\n\n-----\n\nThroughout the summer of 2006, while Wicked Rose was not in school, over 35 zero-day\nattacks, proof-of-concept codes, and attacks against un-patched Microsoft Office vulnerabilities\nare discovered in the wild. With Wicked Rose claiming responsibility for early attacks and the\nlead author of both GinWui and the NCPH hacking group, there is little doubt left as to his\ninvolvement in attacks to date.\n\nBy the end of 2006 attacks become increasingly sophisticated. In one instance a popular\nPowerPoint file distributed during the Christmas holiday season for the last two years prior is\nused within a socially engineered attack upon one individual within an energy sector US based\ncompany. The PowerPoint file is modified to include an exploit that silently installs malicious\ncode. This same individual receives another e-mail containing a Microsoft Word exploit. In this\ncase only one individual within the company is targeted, and with just two messages socially\nengineered for maximum success. This is a much more targeted and stealthy approach for\nattacks compared to the earlier attacks performed by the group in the late spring of 2006.\n\nNCPH continues to be a significant threat going forth for several reasons.\n\n1. Attacks continue to take place in the wild and are very difficult to identify on a targeted\n\nbasis. Only the most sophisticated networks and system administrators are able to\nproperly protect and capture hostile targeted attack files before an attack takes place.\n2. NCPH is a serious dedicated hacking group that is methodical and disciplined in their\n\ndevelopment of new exploits and attacks.\n3. NCPH is motivated by both the thrill and challenge of hacking and money as a motive.\n4. Attacks by the group are highly targeted and stealthy, very difficult to detect and remove.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/0cp8nyd339dnbak96x2klgz1kxm36xd2",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2006/2006.Wicked_Rose/WickedRose_andNCPH.pdf"
    ],
    "report_names": [
        "WickedRose_andNCPH"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041331,
    "ts_creation_date": 1352841896,
    "ts_modification_date": 1352841896,
    "files": {
        "pdf": "https://archive.orkl.eu/e802d6f06085f22242a66b06c785315e1c63c070.pdf",
        "text": "https://archive.orkl.eu/e802d6f06085f22242a66b06c785315e1c63c070.txt",
        "img": "https://archive.orkl.eu/e802d6f06085f22242a66b06c785315e1c63c070.jpg"
    }
}