{
    "id": "54ce3d9e-dc66-4dc3-af39-36e6560c925d",
    "created_at": "2023-01-12T14:59:28.743119Z",
    "updated_at": "2025-03-27T02:05:36.559911Z",
    "deleted_at": null,
    "sha1_hash": "e9a3c11839fd4277714a30ef86b4af919b386e37",
    "title": "2021-02-23 - DNS Hijacking Attacks on Home Routers in Brazil",
    "authors": "",
    "file_creation_date": "2022-05-29T10:50:18Z",
    "file_modification_date": "2022-05-29T10:50:18Z",
    "file_size": 4243841,
    "plain_text": "# DNS Hijacking Attacks on Home Routers in Brazil\n\n**[cujo.com/dns-hijacking-attacks-on-home-routers-in-brazil/](https://cujo.com/dns-hijacking-attacks-on-home-routers-in-brazil/)**\n\n\nOctober 16, 2020\n\n\n-----\n\nAll posts\nOctober 16, 2020\n\nRecently, we have observed ongoing attacks on residential gateways. These attacks had a\ncommon trait: they all originated fromofuxico[.]com.br with the help of malvertising. Once a\nvictim visits this site, they are led through a loop of referrers and redirectors to a malicious\nJavaScript file. Its end goal is to change the DNS settings on the residential router by\ninitiating a CSRF attack. The victim usually does not detect any malicious activity without\n[proper device protection and the fact that the attack is executed in the background via](https://cujo.com/sentry/)\nhidden iframes and malicious redirectors. In this article, I will present a case study of home\nrouter DNS hijacking in Brazil.\n\n## Cyber Crime in Brazil\n\n\n-----\n\nMalvertising attacks are very common amongst compromised Brazilian sites that have been\nunder pressure and constant attacks for years. Many previous articles have elaborated\n[(Novidade Exploit Kit hitting Brazil or the surge in DNS hijacking) on the fact that threat](https://www.trendmicro.com/en_us/research/18/l/new-exploit-kit-novidade-found-targeting-home-and-soho-routers.html)\nactors in Brazil are very profit-oriented, and extremely successful: many Brazilian websites\nseem to lack basic security features and exploiting them is very profitable for actors.\n\n## CSRF Attacks\n\nCross-site request forgery (CSRF) is a type of attack that forces the victim to unknowingly\ncarry out actions in a web application where they are authenticated (or where the attacker is\naware of the default password to a specific system). These attacks are becoming popular\nbecause they allow attackers to execute an action in an internal system or network by\ntricking the victim from the outside. Popular CSRF attacks include money transfers, e-mail\naddress changes, changing a victim’s password or DNS settings, etc.\n\n## DNS Hijacking\n\nHijacking DNS settings is a risky attack, it forces websites’ addresses to be resolved\nincorrectly by a 3rd party DNS resolver. It is a similar approach to cache poisoning, but the\nvictim is diverted to an attacker-controlled environment instead of the original website. It has\ndangerous implications for the victim: for instance, opening your banking institution’s website\nwould redirect you to a fake banking website, and banking login credentials would be at risk\nof theft.\n\nWe have visualized the recent campaign below. In normal circumstances, end users reach\nInternet Banking services via a legitimate DNS resolver.\n\n\n-----\n\nAn everyday scenario, where a legitimate DNS resolver is used to reach Internet Banking services\n\nWhen a malicious CSRF request executed by the unknowing end-user, their home router’s\nDNS settings are changed. After this happens, all further domains that the victim’s laptop\nrequests will be resolved by the malicious DNS resolver, translating the requested domains\nto an IP that is controlled by the threat actor.\n\n\n-----\n\nVictim unknowingly executes the CSRF request that changes the home router’s DNS settings\n\nAt this stage, the victim home router’s DNS settings are changed and the user is redirected\nto a fake banking site whenever the domain is requested. Threat actors will usually get the\nbanking credentials and transfer money from the affected accounts, sending it to off-shore\naccounts or converting the money to cryptocurrency.\n\n\n-----\n\nVictim visits fake banking site via the hijacked DNS resolver, exposing Internet Banking credentials\n\n## Case Study: DNS hijacking Attacks Targeting Routers in Brazil\n\n1. Referrer: hxxps://www.ofuxico[.]com[.]br/noticias-sobre-famosos/\n\nfas-veem-bolsonaro-no-cotovelo-de-luisa-sonza-e-elaresponde/2020/07/22-382339.html\n\n\n2. Suspicious\nresource:\n\n\nhxxps://www.ofuxico[.]com[.]br/lib/._/?861\n\n\n3. Maliciousreferrer: hxxp://kqblocx[.]googleads[.]store/mbl/2/ads.php\n\n4. MaliciousJavaScript: hxxp://kqblocx[.]googleads[.]store/mbl/2/change.js\n\n\n-----\n\nVisiting the site ofuxico[.]com[.]br initiates several requests to 3rd party ad-networks.\nOftentimes, ad networks are the sources of malvertising attacks, as malicious ads are\ninjected into the benign ad rotation. It is up to the 3rd party ad provider to screen and remove\nmalicious ad content, and there are ways to defend against these attacks, such as using adblocking plugins.\n\nSSL Client Hello requests to Advertising networks\n\nOnce the malicious ad is loaded, the victim is looped through a series of requests. These\nrequests usually happen in the background and are invisible to the victim. There are two\ncommon ways of doing this:\n\n– Opening a new, hidden window\n– Clever use of zero-pixel iframes\n\nThe first request is sent to a resource called ads.php, which is a malicious redirector. After\nthe content of the PHP file is successfully processed on the web server, and the output is\ndisplayed in the browser, a second-stage script is called, which is a JavaScript file. These\ntwo resources are the core of the attack, executing a set of malicious actions against the\nresidential gateways.\n\nThere are two requests to googleapis.com to get the jquery.min.jsJavaScript file: these do\nnot serve a purpose in the chain of the attack and are being called from change.js.\n\nFinally, there are 2 requests to 192.168.0.1, that are responsible for changing the victim\n**router’s DNS settings. As I’ve noted in the introduction, hijacking DNS settings has major**\nimplications.\n\nFinally, we also see a call to ip-api.com, which is a sort of a pre-check for this type of attack:\nonly routers and modems that are in Brazil were targeted by this attack.\n\nA timeline of requests initiated when visiting the infected site\n\n\n-----\n\nLet s break down each request in a bit more detail.\n\n## Ads.php Malicious Script Analysis\n\nThe very first malicious GET request is to run ads.php. We captured the traffic flow to\nunderstand the server’s responses. In this case, the server responded with several base64\nencoded blobs, which are also executed immediately due to the embedding tag and the\nspecified Content-Type.\n\nNetwork capture of ads.php being requested\n\nAfter decoding the base64 blobs, we find ourselves with several smaller HTML code blocks\nthat have a single purpose: all of them try to change the DNS settings for the victim’s\nnetwork.\n\n\n-----\n\nHardcoded base64 encoded string YWRtaW4= translates to admin\n\nIn the next step, a request is sent to ip-api.com/json. The response JSON is parsed and a\nlogic function decides what action to take based on the regionName field. Two fields, vpi and\n_vci are set to a certain value, which is based on municipality names. The developer of the_\nscripts tried to achieve location-based differentiation: for example, if the victim is located in\nSao Paulo, the two fields (vpi and vci) would be set to 8 and 35 respectively.\n\n\n-----\n\nMunicipality based differentiation (Brazil)\n\nAt the time of the writing, these fields are hidden and do not serve a purpose. We suspect\nthat these specific values might gain some meaning later, as the developer enhances their\nscript.\n\n_<input type=”hidden” name=”vpi“>_\n\n_<input type=”hidden” name=”vci“>_\n\nAnother decoded blob targets ASUS RT-N13U routers. The crafted POST request uses the\n_start_apply.htm resource to change the router’s DNS settings via the wan_dns1_x_\nparameter. The default credentials are also included in the script, so the request gets\nthrough.\n\n\n-----\n\nCrafted POST request for the Asus RT-N13U router\n\nAnother script targets TP-Link routers on 192.168.0.1:80. Again, the crafted POST request\nchanges DNS settings via the WanDynamicIpCfgRpm.htm resource by using the dns server\nparameter.\n\n\n-----\n\nCrafted POST request for TP-Link routers\n\nAfter each snippet is decoded and executed, another script gets invoked, called change.js.\n\nThere is also a small image included towards the end. The developer is using the service\namung.us, which provides real-time web statistics and information on their victims.\n\nThe second-stage JavaScript embedded inside ads.php\n\nSince we’re done analyzing ads.php, let’s continue by analysing a script it invoces – the\nchange.js JavaScript file.\n\n## Change.js Malicious Script Analysis\n\n\n-----\n\nFirst, the malicious JavaScript defines a loadScript function, which then calls the resource\n[https://ajax.googleapis.com/ajax/libs/jquery/1.6.1/jquery.min.js. This may be an attempt to](https://ajax.googleapis.com/ajax/libs/jquery/1.6.1/jquery.min.js)\nstay under the radar by making the malicious requests blend in with normal network traffic.\n\nCaptured network traffic of change.js\n\nThe next section of the script defines randomly named variables with decimal and\nhexadecimal values. When converted, these turn out to be private (RFC1918) IP addresses.\nHowever, two IPv4 and two IPv6 addresses are defined as-is: these are the malicious DNS\nservers:\n\n45[.]62[.]198[.]73\n45[.]62[.]198[.]74\n\nWe have also observed a similar script using 45.62.198[.]242.\n\n\n-----\n\nHex-encoded IP address list\n\nThe converted hexadecimal values reveal the following private IPs, these are the targeted\nhome gateways (residential routers):\n\n10.0.0.1\n\n10.0.0.100\n\n10.0.0.2\n\n10.0.0.254\n\n10.1.0.1\n\n10.1.1.1\n\n10.1.1.100\n\n192.168.0.1\n\n\n-----\n\n192.168.0.2\n\n192.168.0.100\n\n192.168.0.254\n\n192.168.1.1\n\n192.168.1.2\n\n192.168.1.200\n\n192.168.1.254\n\n192.168.2.1\n\n192.168.2.2\n\n192.168.2.100\n\n192.168.2.254\n\n192.168.25.1\n\n192.168.3.1\n\n192.168.10.1\n\n192.168.100.1\n\n83.142.155.209\n\n184.170.140.162\n\nTo our surprise, the list contains 2 public IPs as well.\n\n83.142.155.209:\n\nPoland Krakow Betanet Sp. ZO.o. (AS33838)\n\n184.170.140.162:\n\nCanada Montreal Estruxture DataCenters Inc.NETELLIGENT(AS10929)\n\nIt seems that these two were added deliberately for testing and might not serve any other\npurpose.\n\nNext up, we have a variable that defines http:// as a base64 encoded string. The two other\nfunctions defined here will be used to invoke HTTP requests. It seems that the developer\nwanted separate functions for calling stylesheets(loadjscssfile) and zero pixel iframes\n(loadjscssfile1). This is a common practice: maldvertisers hide the actual iframes to conceal\nmalicious behaviour.\n\n\n-----\n\nTwo loadjscssfile functions for initiating requests\n\nThe script continues by running an IP check from ipinfo.io, where a json is called and\nprocessed:\n\nIf the response.country section contains the BR string (Brazil), it will continue with a set\nof malicious actions.\n\nThe function checks the country section in the response\n\n\n-----\n\nThe JSON response from ip-api.com\n\nIf the ip-api.com query returns an IP that is not from Brazil (which means the victim is in a\ndifferent country), it will continue running the following branch:\n\n\n-----\n\nSet a timeout for 6,000,000,000 milliseconds (69 days) to delay further action, then\nnavigate to [www.google.com.br](https://www.google.com.br/)\nSet a notification message in Brazilian for the current page (English translation):\n\n_We believe that you will find one of the links listed below useful:_\n_You may not be able to view the requested page for one of the following reasons:_\n_An outdated bookmark link_\n_A search engine that has an outdated reference to our site_\n_A misspelled URL_\n\nBrazilian notification message in case the victim is not located in Brazil\n\nIf the victim’s IP is from Brazil, the script invokes the previously defined function loadjscssfile\nand tries to change the remote router’s DNS settings by sending hundreds of requests. The\nvariable pht equals to http://. These requests contain the login credentials before the\nvariables, which store the hex-encoded version of the target IP addresses (192.168.0.1). The\nIP address is then followed by the actual resource, in this case /dnscfg.cgi, which is\nresponsible for changing the residential router’s DNS settings. This resource would change\nfrom router to router, depending on the vendor and the actual model, but the actors have\nmanaged to collect plenty of examples from actual routers.\n\nAll in all, change.js can invoke 1,414 distinct requests with different combinations of login\ncredentials, IP addresses and URI resources. This shows that the developer tried to cast a\nwide net and reach as many routers/modems as possible.\n\n\n-----\n\nA snippet of the executed CSRF attacks\n\nList of observed user/password credentials:\n\n_admin_\n\n_admin:_\n\n_:admin_\n\n_admin:admin_\n\n_admim:admin_\n\n_admin:password_\n\n_admin:123senha_\n\n_admin:senha123_\n\n_admin:DLKT20090202_\n\n_admin:gvt123_\n\n_admin:gvt12345_\n\n_admin:Gvt12345_\n\n_admin:123456_\n\n_admin:vivo12345_\n\n_support:support_\n\n_vivo:vivo12345_\n\n_root:root_\n\n_adsl:expert03_\n\n_dxdsl:dxdsl_\n\n\n-----\n\n_xdsl:dxdsl_\n\n_super:super_\n\n_user:user_\n\n_TMAR#DLKT20060420:DLKT20060420_\n\n_TMARDLKT93319:DLKT93319_\n\nIt is interesting to note that the passwords“gvt12345” and “vivo12345” might be specifically\ntargeting the Brazilian Internet Service Providers (ISP) GVT and Vivo, as these credentials\nare issued to residential modems by default.\n\nA little bit of research also reveals what type of modems and gateways these IPSs provide\nfor their residential devices:\n\nASUS RT-N56U\n\nBaytec RTA04N\n\nD-Link DSL 500B II\n\nD-Link DSL 502G\n\nD-Link DSL 2640B\n\nD-Link DSL 2730B\n\nD-Link DSL 2740R\n\nLinksys WRT160N\n\nLinksys WRT54GL\n\nZTE ZXDSL 831\n\n## Analyzing the Malicious Infrastructure\n\nLet’s look behind the curtain to try and understand the attacker’s infrastructure. We know that\nthe malicious redirector and JavaScript file is served from 1xb5bkr[.]googleads[.]store.\nEnumerating DNS records for this domain reveals a couple of things:\n\nThis subdomain has an A record of 191.232.252[.]215, which is in Brazil and served\nthrough Microsoft’s Cloud hosting. The A record is connected to googleads[.]store too.\n\n\n-----\n\nIP information for 191[.]232[.]252[.]215\n\nInitiating a reverse lookup and correlating the result with VirusTotal queries shows that\nthis IP address has many other domains attached to it. It looks like the attackers are\ngenerating a new subdomain every day in order to change the address of their\ninfrastructure, but all subdomains still use the same IPv4 server address.\n\n\n-----\n\nCorrelated domains via A DNS records\n\nCrawling one of these domains reveals that web directory listing is enabled on the\nserver: we can spot four directories inside the /mbl/ directory. All four directories have\ntheads.php redirector and the change.js malicious JavaScript inside. It seems that the\npurpose of these directories was to test different redirectors for different scenarios, but\nall four contain the same set of files at the moment.\n\nBrowsing web directories left enabled\n\n## DNS Trickery: Fake Brazilian Banking Websites Stealing Client Credentials\n\nCommonly these DNS changer attacks manifest in phishing or credential harvesting. One\nrevelation is that the malicious DNS servers send a malicious IP address back when certain\nBrazilian Bank websites are queried:\n\n\n-----\n\nBB Bank\n\nItau Bank\n\n\n-----\n\nBanco Bradesco\n\n\n-----\n\nSantander Bank\n\nThese attackers might be trying to redirect the victim to a fake Banking website, and\neventually steal their banking credentials.\n\nAs of writing this article, the IP addresses serve a fake Banco do Brasil front-end under\n_www.bb.com.br/dktp/logon.php, which looks like a registration for new visitors to sign up for_\nthe fake service.\n\nFake Banco Do Brasil banking website (Note the warning on the TLS certificate)\n\nAnalysing the TLS certificate reveals that it is a self-signed certificate and registered with the\n[e-mail address [email protected], which is a fake name. The domain is listed for sale and is](https://cujo.com/cdn-cgi/l/email-protection)\nnot currently owned by anyone.\n\n\n-----\n\nA self-signed certificate of the fake banking website\n\nAnother login panel was found in pfelogin.php, asking for a username and a password as\nwell. This is the main login page for the Internet Banking service.\n\n\n-----\n\nLogin panel on the fake Banco do Brasil website\n\nBelow you can see how the original Banco do Brasil website looks like when the DNS\nsettings are not altered, and the request to the original domain goes to the proper IP address\n170.66.11.10. Also, the original website does not have a /dktp/ folder, unlike the fake\nwebsite. The login page for the Internet Bank is also at a different path:\n_https://www2.bancobrasil.com.br/aapf/login.jsp_\n\n\n-----\n\nThe original Banco do Brasil website\n\nOn the fake website, once the victim has passed his/her credentials, the login page redirects\nthe visitor to update.php, which is then followed by a form action to update2.php.\n\nThe fake dktp login form redirects victims to update2.php\n\nAn automatic refresh action is executed by a meta tag, which then calls aguarde2.php.\n\n\n-----\n\nThe next link in the redirect chain is aguarde2.php\n\nThen the user is finally redirected to atualizando.php with a Timeout function, and is\npresented with the login page again.\n\nAfter aguarde2.php, the destination is atualizando.php\n\n\n-----\n\nAt this point the damage is done, and the threat actors have received the victim s credential\nfor the Online Banking service. The attackers will usually empty the accounts in a manner of\nhours, and victims will have a hard time chasing down their money, after it is funnelled over\nseveral accounts or turned into some type of cryptocurrency.\n\n## Basic Recommendations for Protection Against Attacks\n\n[There are many common-sense rules for security online, but since these attacks on Brazilian](https://cujo.com/sentry/)\nrouters spread through advertisements and trackers on compromised websites, our tips\nfocus on ad and tracker blocking options.\n\n### For users:\n\nChange the default login passwords on residential routers to protect you against DNS\nsetting hijacking\nUse browser addons and strict browser settings against malvertising:\n\nuBlock Origin\nPrivacy Badger\nHTTPS Everywhere\nUse the Strict mode for Trackers in Firefox\nUse the Google Safe Browsing feature\nUse an anti-virus on your computer and router\n### For banks:\n\n[Implement a HSTS policy, so users are protected againstMitM and cookie](https://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security)\nhijacking (upon a certificate error, users are not let through)\n## Indicators of a Compromise:\n\n### Malicious DNS servers:\n\n45.62.198[.]73\n45.62.198[.]74\n45.62.198[.]242\n0:0:0:0:0:ffff:2d3e[:]c649\n0:0:0:0:0:ffff:2d3e[:]c64a\n### Fake banking websites:\n\n45.62.198[.]156\n45.62.198[.]157\n### Malicious redirectors:\n\n191.232.252[.]215\ngoogleads[.]store\n*.googleads[.]store\nThe source of the initial sample comes from NCSC-FI (National Cyber Security Centre\nFinland).\n\n\n-----\n\n### Albert Zsigovits\n\nMalware Researcher\n\n### CUJO AI Lens\n\nAn AI-powered analytics solution that, for the first time, gives operators an aggregated,\ndynamic and near real-time view into the way end users utilize their home or business\nnetworks\n\n[Learn more](https://cujo.com/lens/)\n\n### Explorer\n\nProvides complete, programmatic access to granular data via APIs to all the information\ncollected and processed by the CUJO AI Platform\n\n[Learn more](https://cujo.com/explorer/)\n\n### Compass\n\n\n-----\n\nAn advanced service that empowers families and businesses to define and manage how\ntheir members’ online activity affects their everyday lives\n\n[Learn more](https://cujo.com/compass/)\n\n### Other posts by Albert Zsigovits\n\n[All posts by Albert Zsigovits](https://cujo.com/author/albert-z/)\n\n**Privacy Overview**\n\nThis website uses cookies to improve your experience while you navigate through the\nwebsite. Out of these, the cookies that are categorized as necessary are stored on your\nbrowser as they are essential for the working of basic functionalities of the website. We also\nuse third-party cookies that help us analyze and understand how you use this website.\nThese cookies will be stored in your browser only with your consent. You also have the\noption to opt-out of these cookies. But opting out of some of these cookies may affect your\nbrowsing experience.\n\nNecessary cookies are absolutely essential for the website to function properly. These\ncookies ensure basic functionalities and security features of the website, anonymously.\n\n**Cookie** **Duration** **Description**\n\n\n_GRECAPTCHA 5 months\n27 days\n\n\nThis cookie is set by the Google recaptcha service to\nidentify bots to protect the website against malicious\nspam attacks.\n\n\ncookielawinfocheckboxadvertisement\n\ncookielawinfocheckbox-analytics\n\ncookielawinfocheckbox-analytics\n\ncookielawinfocheckbox-functional\n\ncookielawinfocheckbox-necessary\n\n\n1 year Set by the GDPR Cookie Consent plugin, this cookie is\nused to record the user consent for the cookies in the\n\"Advertisement\" category .\n\n\n11\nmonths\n\n11\nmonths\n\n11\nmonths\n\n11\nmonths\n\n\nThis cookie is set by GDPR Cookie Consent plugin.\nThe cookie is used to store the user consent for the\ncookies in the category \"Analytics\".\n\nThis cookie is set by GDPR Cookie Consent plugin.\nThe cookie is used to store the user consent for the\ncookies in the category \"Analytics\".\n\nThe cookie is set by GDPR cookie consent to record\nthe user consent for the cookies in the category\n\"Functional\".\n\nThis cookie is set by GDPR Cookie Consent plugin.\nThe cookies is used to store the user consent for the\ncookies in the category \"Necessary\".\n\n\n-----\n\n**Cookie** **Duration** **Description**\n\n\ncookielawinfocheckbox-others\n\ncookielawinfocheckboxperformance\n\n\n11\nmonths\n\n11\nmonths\n\n\nThis cookie is set by GDPR Cookie Consent plugin.\nThe cookie is used to store the user consent for the\ncookies in the category \"Other.\n\nThis cookie is set by GDPR Cookie Consent plugin.\nThe cookie is used to store the user consent for the\ncookies in the category \"Performance\".\n\n\ncujo_cerber_* 1 day Secures the website by detecting and mitigating\nmalicious activity.\n\n\nviewed_cookie_policy 11\nmonths\n\n\nThe cookie is set by the GDPR Cookie Consent plugin\nand is used to store whether or not user has\nconsented to the use of cookies. It does not store any\npersonal data.\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the\nwebsite on social media platforms, collect feedbacks, and other third-party features.\n\nPerformance cookies are used to understand and analyze the key performance indexes of\nthe website which helps in delivering a better user experience for the visitors.\n\nAnalytical cookies are used to understand how visitors interact with the website. These\ncookies help provide information on metrics the number of visitors, bounce rate, traffic\nsource, etc.\n\n**Cookie** **Duration** **Description**\n\n_ga session The _ga cookie, installed by Google Analytics,\ncalculates visitor, session and campaign data\nand also keeps track of site usage for the site's\nanalytics report. The cookie stores information\nanonymously and assigns a randomly\ngenerated number to recognize unique visitors.\n\n_gat_gtag_UA_128580456_1 session Set by Google to distinguish users.\n\n_gid session Installed by Google Analytics, _gid cookie\nstores information on how visitors use a\nwebsite, while also creating an analytics report\nof the website's performance. Some of the\ndata that are collected include the number of\nvisitors, their source, and the pages they visit\nanonymously.\n\n\n-----\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing\ncampaigns. These cookies track visitors across websites and collect information to provide\ncustomized ads.\n\nOther uncategorized cookies are those that are being analyzed and have not been classified\ninto a category as yet.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-23 - DNS Hijacking Attacks on Home Routers in Brazil.pdf"
    ],
    "report_names": [
        "2021-02-23 - DNS Hijacking Attacks on Home Routers in Brazil.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535568,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653821418,
    "ts_modification_date": 1653821418,
    "files": {
        "pdf": "https://archive.orkl.eu/e9a3c11839fd4277714a30ef86b4af919b386e37.pdf",
        "text": "https://archive.orkl.eu/e9a3c11839fd4277714a30ef86b4af919b386e37.txt",
        "img": "https://archive.orkl.eu/e9a3c11839fd4277714a30ef86b4af919b386e37.jpg"
    }
}