{
    "id": "550cb2e1-9631-47ff-b432-9d3263dce85a",
    "created_at": "2023-01-12T15:10:17.763937Z",
    "updated_at": "2025-03-27T02:05:48.040595Z",
    "deleted_at": null,
    "sha1_hash": "98742194b4dd3bfe36f253a1f154af80a9894a1b",
    "title": "2021-06-17 - Hold the Door- Examining Exfiltration Activity and Applying Countermeasures",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:03Z",
    "file_modification_date": "2022-05-28T19:41:03Z",
    "file_size": 915891,
    "plain_text": "# Hold the Door: Examining Exfiltration Activity and Applying Countermeasures\n\n**[blog.gigamon.com/2021/06/17/hold-the-door-examining-exfiltration-activity-and-applying-countermeasures](https://blog.gigamon.com/2021/06/17/hold-the-door-examining-exfiltration-activity-and-applying-countermeasures)**\n\nJune 17, 2021\n\n[Home »](https://blog.gigamon.com/) [Security » Hold the Door: Examining Exfiltration Activity and Applying](https://blog.gigamon.com/category/security/)\nCountermeasures\n\n[Security / June 17, 2021](https://blog.gigamon.com/category/security/)\n\n[Joe Slowik &nbsp](https://blog.gigamon.com/author/joeslowik/)\n\n_Updated October 14, 2021._\n\n## Background\n\nData exfiltration exists as a cornerstone of malicious cyber operations. Yet the nature of\nexfiltration and its impact changed significantly over the past few years.\n\nHistorically, adversaries linked to state sponsors or similar activities would engage in data\ntheft to further goals of industrial espionage or intellectual property theft. More recently,\nadversaries have engaged in exfiltration, not based on the value of the data to themselves or\n\n\n-----\n\ntheir sponsors, but rather on the desire of victims to not have such data exposed. The result\nis an ecosystem of exfiltration and disclosure for either monetary or “hacktivist” purposes,\nwhere the malicious party seeks to damage (or threaten damage) to the victim. Relevant,\nrecent examples include ransomware-related data loss at meat processor JBS, which\nprompted to company to pay $11 million to avoid disclosure of data, and an intrusion at\ngaming company Electronic Arts resulting in the loss and potential sale of nearly 800\ngigabytes of sensitive information. Given these trends, network owners, operators, and\ndefenders must work to ensure controls are in place to detect, mitigate, or outright block\nsuch activity given potential costs.\n\n## Exfiltration Impacts\n\nOn its face, exfiltration appears less concerning than other cyber-nexus impacts such as\nnetwork disruption. While data exfiltration typically has some immediate impact on an\norganization, long-term hazards may make loss of sensitive data even more destructive than\nan especially virulent ransomware incident.\n\n_Figure 1: The three primary impacts of data exfiltration._\nAs illustrated above, three primary risks adhere to data loss or exfiltration events:\n\nLoss of sensitive data or intellectual property, which can place an organization at a\ncompetitive disadvantage or even induce regulatory risk in the case of sensitive\ncustomer or client data\nDamage to an organization’s reputation following a publicized incident, including but\nnot limited to public relations work to reduce impacts and long-term association with a\nmajor, high-profile data loss event\nOpening up the organization to extortion by actors who extract data, then threaten to\npublish it absent payment or some other action\n\nThe first case constitutes the typical focus of data loss concern, as this relates to incidents\nranging from state-sponsored industrial espionage to criminal entities attempting to steal\nbanking or personal information. The second adheres to all (publicly revealed or\nacknowledged) exfiltration incidents, and forms a difficult-to-quantify cost that may take years\n\n\n-----\n\nto overcome. The third is a relatively recent development that aligns with emerging trends in\n[“double-extortion” ransomware and similar criminal activity, although such tactics possess a](https://www.cybereason.com/blog/rise-of-double-extortion-shines-spotlight-on-ransomware-prevention)\n[longer history among politically motivated hacktivist entities.](https://www.reuters.com/article/us-cyber-hacktivism-focus/new-wave-of-hacktivism-adds-twist-to-cybersecurity-woes-idUSKBN2BH3HJ)\n\nOverall, while risks are significant, their quantification and time to manifestation are typically\nunclear, making these items hard to assess. Theft of intellectual property may have impacts\nfelt only years (or decades) after the action takes place, while potential reputational losses\nmay be impossible to adequately quantify under any circumstance. Yet given an increase in\nboth hacktivist and especially ransomware operations incorporating data leak or data\nextortion activities, data exfiltration activity is rapidly becoming a more acute and immediate\nissue than in years past. Thus, network defenders and operators must align defenses in such\na fashion to identify and potentially even prevent such activity where appropriate.\n\n## Identifying Exfiltration Behaviors\n\nExfiltration activity would be expected to be noisy and relatively easy to spot, given the\nmovement of large amounts of data to new or unfamiliar sources. Yet even making this\ndetermination requires a combination of network visibility and active network monitoring such\nthat most organizations either lack insight into such behaviors, or such activities blend in\nsufficiently with legitimate activity so as to produce significant “noise” in detections.\n\nFurthermore, adversaries of various types employ multiple techniques to minimize visibility\nand evade detection, either through obfuscation or blending in with other actions. Examples\ninclude:\n\nUsing legitimate third-party services, such as cloud backup systems or web-based\nstorage, as destinations for leaked data. Examples range from common items such as\nGoogle Drive and Dropbox to more specialized products such as an ecosystem of\nitems related to the Mega.io service.\nTunneling traffic over non-HTTP services or [using alternative protocols for large data](https://attack.mitre.org/techniques/T1048/)\ntransfer that might not be monitored with the same level of scrutiny.\n[Dividing data into smaller pieces for exfiltration to avoid abnormally large traffic flows](https://attack.mitre.org/techniques/T1030/)\nleaving the network.\n\nAlthough all of these are concerning, none is impossible to detect. Rather, defenders can\nemploy a combination of monitoring for more general traffic pattern anomalies along with\nspecific identification of certain techniques or behaviors to detect this type of activity. Even in\ncases where data is encoded or encrypted, or where visibility into network activity is\nsomewhat limited, access to datasets such as network flow provides a number of\npossibilities to flag suspicious operations.\n\nAt the most general level, identification of suspicious network flows represents a potentially\npowerful technique for identifying exfiltration activity. Aside from just looking for large data\nflows, with “large” likely dependent upon the normal operations and expectations within the\n\n\n-----\n\nmonitored network, identification of directionality and upload/download ratios are necessary\nenrichments to accurately leverage flow monitoring. For example, a “large” flow may just be\nindicative of a long-running, data-rich connection such as streaming, remote access, or\nrelated activity. However, when also looking at directionality and data ratios, identifying large\nflows where the majority of data (80–90 percent) leaves the network can flag a large upload\nsession. While there may certainly be legitimate use cases for such activity, such as sharing\nlarge project files or datasets, these flows may also be indicative of data loss or other\nunauthorized activity.\n\nThe above becomes even more powerful when combined with an analytic approach to\nnetwork connections. Identifying not just anomalous, outbound flows but connecting these to\n[new, previously unobserved or suspicious network infrastructure enables powerful detection](https://blog.gigamon.com/2019/03/06/what-is-network-infrastructure/)\npossibilities. For example, linking a suspicious outbound flow to new network infrastructure\nor a virtual private server (VPS) instance (such as Linode, DigitalOcean, or a similar\nprovider) can identify activity of concern. Extending further, the same logic can also be\napplied to nonstandard connections (like external FTP or other protocols) to unknown or\nuntrusted destinations to identify potential exfiltration activity.\n\nWhile these strategies are effective in identifying when an exfiltration event occurs, they are\nlacking in that such approaches are fundamentally “backward looking.” In other words, these\nitems will identify exfiltration as or shortly after it actually takes place. This can be of value to\nalert organizations that something is wrong, thus enabling response and mitigation\noperations and reducing time to detection and time to response metrics. Yet ideally\ndefenders and their respective employers would be able to prevent exfiltration from taking\nplace at all.\n\n## Applying “Whole of Kill Chain” Defense\n\n[Preventing exfiltration requires a “whole of Cyber Kill Chain” perspective with respect to](https://www.lockheedmartin.com/content/dam/lockheed-martin/rms/documents/cyber/Gaining_the_Advantage_Cyber_Kill_Chain.pdf)\nnetwork monitoring and defense. In this scenario, defenders look for overall adversary\nintrusion pathways and dependencies to identify necessary precursors (initial access, lateral\nmovement, data collection, and data staging) prior to data leaving the network.\n\n\n-----\n\n_Figure 2: Threat intrusion pathways and points of defender intervention to detect or defeat_\n_attacks._\nThrough a critical examination of what an adversary requires to succeed, we can begin\nimplementing more general controls across both host and network capabilities to defeat not\njust exfiltration operations but a variety of intrusions. At minimum, identifying likely adversary\ningress mechanisms and either monitoring them closely or implementing controls to reduce\nattack surface can significantly reduce the likelihood of a threat actor gaining access to the\nenvironment. Relevant controls include patching external-facing systems, reducing available\nservices from external access, limiting traffic types inbound to the network, and monitoring\nsensitive activity such as remote administration or access sessions.\n\nMany organizations focus on these steps as a means to reduce risk, but true, layered\ndefense requires going beyond the network boundary to ensure coverage across subsequent\nadversary actions as well. Given a near-infinite number of possible initial access\nmechanisms available to adversaries, as well as the possibility of subverting systems or\nusers even when items are patched or otherwise monitored, defense must extend into\ninternal network traffic flows and host items. Defenders must identify lateral movement\ntechniques and their artifacts across both network and host behaviors. While increasing\nadoption of endpoint defense and response (EDR) products covers host-centric\nobservations, investment in East-West traffic visibility and monitoring is essential to capture\nadversary traversal of defended networks. Implemented together, these items can ensure\ncoverage of adversary operations ranging from opportunistic criminal actors to focused\nhacktivists to state-sponsored threats.\n\n\n-----\n\nOverall, defenders need to combine an understanding of adversary behaviors and\ntendencies (such as through production or ingestion of cyber threat intelligence) to first\ndetermine how adversaries operate and what techniques are relevant in intrusion operations.\nOnce determined, a combination of EDR and network defense and response (NDR) must be\nemployed to ensure layered detection and monitoring and cover any potential gaps in\nvisibility that adversaries may attempt to use to their advantage.\n\n## Conclusion\n\nData exfiltration is increasingly incorporated into the actions of a variety of threats, from\ncriminals to hacktivists to state-directed intrusions. Through the application and monitoring of\nrobust network controls, defenders and asset owners can ensure awareness of such\nbehaviors when they occur, allowing for quicker response and potentially event mitigation.\n\nDefenders cannot focus solely on detecting anomalous outbound data flows. Instead, robust\ndefense requires identifying adversary actions across all phases of intrusion operations.\nOnce understood, defenders can implement network and host controls or visibility to cover\neach step of an intrusion. Only through this robust, defense-in-depth approach can\ndefenders ensure not just awareness of potential malicious activity (including but not limited\nto data exfiltration operations), but also enable possible intrusion interdiction or disruption\nwhen actions are caught early in the adversary’s lifecycle. While neither easy nor\n[inexpensive, defense against modern cyber threats, from ransomware operations to data](https://blog.gigamon.com/2021/05/17/tracking-darkside-and-ransomware-the-network-view/)\nexfiltration for a variety of purposes, demands such investment to ensure defenders keep\npace with a rapidly evolving threat landscape.\n\n**Featured Webinars**\n\n[Hear from our experts on the latest trends and best practices to optimize your network](https://www.gigamon.com/resources/resource-library/webinar-hub.html?intcid=blog)\nvisibility and analysis.\n\nCONTINUE THE DISCUSSION\n\nPeople are talking about this in the Gigamon Community’s [Security group.](https://community.gigamon.com/gigamoncp/s/group/0F91O0000009cNHSAY/security)\n\n**Share your thoughts today**\n\n## RELATED CONTENT\n\nREPORT\n\n2022 Ransomware Defense Report\n\n\n-----\n\nGET YOUR COPY\n\nWEBINAR\n\nRansomware Best Practices: Agentless Threat Hunting\n\nWATCH ON-DEMAND\n\nREPORT\n\n2022 TLS Trends Data\n\nDOWNLOAD REPORT\n\nWEBPAGE\n\nSuddenly, Ransomware Has Nowhere to Hide\n\nTAKE A LOOK\n\nOLDER ARTICLE\n[Applied Threat Research and Guided-SaaS NDR](https://blog.gigamon.com/2021/06/16/applied-threat-research-and-guided-saas-ndr/)\nNEWER ARTICLE\n[Gigamon ThreatINSIGHT Guided-SaaS NDR Releases 2021.4 and 2021.5](https://blog.gigamon.com/2021/06/21/gigamon-threatinsight-guided-saas-ndr-releases-2021-4-and-2021-5/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-17 - Hold the Door- Examining Exfiltration Activity and Applying Countermeasures.pdf"
    ],
    "report_names": [
        "2021-06-17 - Hold the Door- Examining Exfiltration Activity and Applying Countermeasures.pdf"
    ],
    "threat_actors": [
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536217,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653766863,
    "ts_modification_date": 1653766863,
    "files": {
        "pdf": "https://archive.orkl.eu/98742194b4dd3bfe36f253a1f154af80a9894a1b.pdf",
        "text": "https://archive.orkl.eu/98742194b4dd3bfe36f253a1f154af80a9894a1b.txt",
        "img": "https://archive.orkl.eu/98742194b4dd3bfe36f253a1f154af80a9894a1b.jpg"
    }
}