{
    "id": "554455f6-df39-4131-a332-fe7184099da6",
    "created_at": "2023-01-12T15:04:09.43867Z",
    "updated_at": "2025-03-27T02:14:56.503099Z",
    "deleted_at": null,
    "sha1_hash": "7ee462617d7dab566addc617cec93102e7da3b4a",
    "title": "2019-01-11 - A Nasty Trick- From Credential Theft Malware to Business Disruption",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:23Z",
    "file_modification_date": "2022-05-28T01:56:23Z",
    "file_size": 97617,
    "plain_text": "# A Nasty Trick: From Credential Theft Malware to Business Disruption\n\n**[fireeye.com/blog/threat-research/2019/01/a-nasty-trick-from-credential-theft-malware-to-business-disruption.html](https://www.fireeye.com/blog/threat-research/2019/01/a-nasty-trick-from-credential-theft-malware-to-business-disruption.html)**\n\nThreat Research\n\nKimberly Goody, Jeremy Kennelly, Jaideep Natu, Christopher Glyer\n\nJan 10, 2019\n\n11 mins read\n\nRansomware\n\nThreat Research\n\nMalware\n\n\n-----\n\nFireEye is tracking a set of financially-motivated activity referred to as TEMP.MixMaster that\ninvolves the interactive deployment of Ryuk ransomware following TrickBot malware\ninfections. These operations have been active since at least December 2017, with a notable\nuptick in the latter half of 2018, and have proven to be highly successful at soliciting large\nransom payments from victim organizations. In multiple incidents, rather than relying solely\non built-in TrickBot capabilities, TEMP.MixMaster used EMPIRE and RDP connections to\nenable lateral movement within victim environments. Interactive deployment of ransomware,\nsuch as this, allows an attacker to perform valuable reconnaissance within the victim network\n[and identify critical systems to maximize their disruption to business operations, ultimately](https://www.zdnet.com/article/ransomware-suspected-in-cyberattack-that-crippled-major-us-newspapers/)\nincreasing the likelihood an organization will pay the demanded ransom. These operations\n[have reportedly netted about $3.7 million in current BTC value.](https://www.crowdstrike.com/blog/big-game-hunting-with-ryuk-another-lucrative-targeted-ransomware/)\n\nNotably, while there have been numerous reports attributing Ryuk malware to North Korea,\nFireEye has not found evidence of this during our investigations. This narrative appears to be\ndriven by [code similarities between Ryuk and Hermes, a ransomware that has been used by](https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/)\nAPT38. However, these code similarities are insufficient to conclude North Korea is behind\nRyuk attacks, as the Hermes ransomware kit was also advertised for sale in the underground\ncommunity at one time.\n\nIt is important to note that TEMP.MixMaster is solely a reference to incidents where we have\nseen Ryuk deployed following TrickBot infections and that not all TrickBot infections will lead\nto the deployment of Ryuk ransomware. The TrickBot administrator group, which is\nsuspected to be based in Eastern Europe, most likely provide the malware to a limited\nnumber of cyber criminal actors to use in operations. This is partially evident through its use\nof “gtags” that appear to be unique campaign identifiers used to identify specific TrickBot\nusers. In recent incidents investigated by our Mandiant incident response teams, there has\nbeen consistency across the gtags appearing in the configuration files of TrickBot samples\ncollected from different victim networks where Ryuk was also deployed. The uniformity of the\ngtags observed across these incidents appears to be due to instances of TrickBot being\npropagated via the malware’s worming module configured to use these gtag values.\n\nCurrently, we do not have definitive evidence that the entirety of TEMP.MixMaster activity,\nfrom TrickBot distribution and operation to Ryuk deployment, is being conducted by a\ncommon operator or group. It is also plausible that Ryuk malware is available to multiple\neCrime actors who are also using TrickBot malware, or that at least one TrickBot user is\nselling access to environments they have compromised to a third party. The intrusion\n[operations deploying Ryuk have also been called GRIM SPIDER.](https://www.crowdstrike.com/blog/big-game-hunting-with-ryuk-another-lucrative-targeted-ransomware/)\n\n## TrickBot Infection Leading to Ryuk Deployment\n\nThe following are a summary of tactics observed across incident response investigations\nwhere the use of TrickBot preceded distribution of Ryuk ransomware. Of note, due to the\ninteractive nature of Ryuk deployment, the TTPs leading to its execution can vary across\n\n\n-----\n\nincidents. Furthermore, in at least one case, artifacts related to the execution of TrickBot\nwere collected but there was insufficient evidence to clearly tie observed Ryuk activity to the\nuse of TrickBot.\n\nInitial Infection\n\nThe initial infection vector was not confirmed in all incidents; in one case, Mandiant identified\nthat the attackers leveraged a payroll-themed phishing email with an XLS attachment to\ndeliver TrickBot malware (Figure 1). Data from FireEye technologies shows that this\ncampaign was widely distributed primarily to organizations in the United States, and across\ndiverse industries including government, financial services, manufacturing, service providers,\nand high-tech.\n\nOnce a victim opened the attachment and enabled macros, it downloaded and executed an\ninstance of the TrickBot malware from a remote server. Data obtained from FireEye\ntechnologies suggests that although different documents may have been distributed by this\nparticular malicious spam run, the URLs from which the documents attempted to retrieve a\nsecondary payload did not vary across attachments or recipients, despite the campaign’s\nbroad distribution both geographically and across industry verticals.\n\nSubject: FW: Payroll schedule\nAttachment: Payrollschedule.xls\n\nPay run summary report and individual payslips.\nKind Regards,\nAdam Bush\nCONFIDENTIALITY NOTICE:\nThe contents of this email message and any attachments are intended solely for the\naddressee(s) and may contain confidential and/or privileged information and may be\nlegally protected from disclosure. If you are not the intended recipient of this message or\ntheir agent, or if this message has been addressed to you in error, please immediately\nalert the sender by reply email and then delete this message and any attachments. If you\nare not the intended recipient, you are hereby notified that any use, dissemination,\ncopying, or storage of this message or its attachments is strictly prohibited.\n\nFigure 1: Email from a phishing campaign that downloaded TrickBot, which eventually led to\nRyuk\n\nPersistence and Lateral Movement\n\nWhen executed, TrickBot created scheduled tasks on compromised systems to execute itself\nand ensure persistence following system reboot. These instances of TrickBot were\nconfigured to use their network propagation modules (sharedll and tabdll) that rely on SMB\nand harvested credentials to propagate to additional systems in the network. The number of\nsystems to which TrickBot was propagated varied across intrusions from fewer than ten to\nmany hundreds.\n\n\n-----\n\nDwell Time and Post Exploitation Activity\n\nAfter a foothold was established by the actors controlling TrickBot, a period of inactivity\nsometimes followed. Dwell time between TrickBot installation and Ryuk distribution varied\nacross intrusions, but in at least one case may have been as long as a full year. Despite this\nlong dwell time, the earliest reports of Ryuk malware only date back to August 2018. It is\nlikely that actors controlling Trickbot instances used to maintain access to victim\nenvironments prior to the known availability of Ryuk were monetizing this access in different\nways. Further, due to the suspected human-driven component to these intrusion operations,\nwe would expect to commonly see a delay between initial infection and Ryuk deployment or\nother post-exploitation activity, particularly in cases where the same initial infection vector\nwas used to compromise multiple organizations simultaneously.\n\nOnce activity restarted, the actors moved to interactive intrusion by deploying Empire and/or\nleveraging RDP connections tunneled through reverse-shells instead of relying on the built-in\ncapabilities of TrickBot to interact with the victim network. In multiple intrusions TrickBot's\nreverse-shell module (NewBCtestDll) was used to execute obfuscated PowerShell scripts\n[which ultimately downloaded and launched an Empire backdoor.](https://github.com/EmpireProject/Empire)\n\nVariations in Ryuk Deployment Across Engagements\n\nPost exploitation activity associated with each Ryuk incident has varied in historical and\nongoing Mandiant incident response engagements. Given that collected evidence suggests\nRyuk deployment is managed via human-interactive post-exploitation, variation and evolution\nin methodology, tools, and approach over time and across intrusions is expected.\n\nThe following high-level steps appear common across most incidents into which we have\ninsight:\n\nActors produce a list of targets systems and save it to one or multiple .txt files.\nActors move a copy of PsExec, an instance of Ryuk, and one or more batch scripts to\none or more domain controllers or other high privilege systems within the victim\nenvironment.\nActors run batch scripts to copy a Ryuk sample to each host contained in .txt files and\nultimately execute them.\n\nSome of the notable ways Ryuk deployment has varied include:\n\nIn one case, there was evidence suggesting that actors enumerated hosts on the victim\nnetwork to identify targets for encryption with Ryuk, but in multiple other cases these\nlists were manually copied to the server that was then used for Ryuk distribution\nwithout clear evidence available for how they were produced.\nThere have been multiple cases where TrickBot was deployed broadly across victim\nenvironments rather than being used to maintain a foothold on a small number of\nhosts.\n\n\n-----\n\nWe have not identified evidence that Empire was used by the attackers in all cases and\nsometimes Empire was used to access the victim environment only after Ryuk\nencryption had started.\nIn one case, the attackers used a variant of Ryuk with slightly different capabilities\naccompanied by a standalone .bat script containing most of the same taskkill, net, and\nsc commands normally used by Ryuk to terminate processes and stop services related\nto anti-virus, backup, and database software.\n\n**Example of Ryuk Deployment – Q3 2018**\n\nUsing previously stolen credentials the attacker logged into a domain controller and\ncopied tools into the %TEMP% directory. Copied tools included AdFind.exe (Active\nDirectory enumeration utility), a batch script (Figure 2), and a copy of the 7-Zip archive\nutility.\nDownloaded utilities were copied to C:\\Windows\\SysWOW64\\.\nThe attacker performed host and network reconnaissance using built-in Windows\ncommands.\nAdFind.exe was executed using the previously noted batch script, which was crafted to\npass the utility a series of commands that were used to collect information about Active\nDirectory users, systems, OUs, subnets, groups, and trust objects. The output from\neach command was saved to an individual text file alongside the AdFind.exe utility\n(Figure 2).\nThis process was performed twice on the same domain controller, 10 hours apart.\nBetween executions of Adfind the attacker tested access to multiple domain controllers\nin the victim environment, including the one later used to deploy Ryuk.\nThe attacker logged into a domain controller and copied instances of PSExec.exe, a\nbatch script used to kill processes and stop services, and an instance of Ryuk onto the\nsystem.\nUsing PsExec the attacker copied the process/service killing batch script to the\n%TEMP% folder on hundreds of computers across the victim environment, from which\nit was then executed.\nThe attacker then used PsExec to copy the Ryuk binary to the %SystemRoot%\ndirectories of these same computers. A new service configured to launch the Ryuk\nbinary was then created and started.\nRyuk execution proceeded as normal, encrypting files on impacted systems.\n\n\n-----\n\nadfind.exe -f (objectcategory=person) > <user_list>.txt\n\nadfind.exe -f objectcategory=computer > <computer_list>.txt\n\nadfind.exe -f (objectcategory=organizationalUnit) > <ou_list>.txt\n\nadfind.exe -subnets -f (objectCategory=subnet) > <subnet_list>.txt\n\nadfind.exe -f \"(objectcategory=group)\" > <group_list>.txt\n\nadfind.exe -gcb -sc trustdmp > <trustdmp>.txt\n\nFigure 2: Batch script that uses adfind.exe tool to enumerate Active Directory objects\n\n**Example of Ryuk Deployment – Q4 2018**\n\nAn instance of the EMPIRE backdoor launched on a system that had been infected by\nTrickBot. The attacker used EMPIRE’s built-in capabilities to perform network\nreconnaissance.\nAttackers connected to a domain controller in the victim network via RDP and copied\nseveral files into the host’s C$ share. The copied files included an instance of PsExec,\ntwo batch scripts, an instance of the Ryuk malware, and multiple .txt files containing\nlists of hosts within the victim environment. Many of the targeted hosts were critical\nsystems across the victim environment including domain controllers and other hosts\nproviding key management and authentication services.\nThe attackers then executed the first of these two batch scripts. The executed script\nused PsExec and hard-coded credentials previously stolen by the actors to copy the\nRyuk binary to each host passed as input from the noted .txt files (Figure 3).\nAttackers then executed the second batch script which iterated through the same host\nlists and used PsExec to execute the Ryuk binaries copied by the first batch script\n(Figure 4).\n\nstart PsExec.exe @C:\\<shared_folder>$\\<list>.txt -u <domain>\\<username> -p\n<password> cmd /c COPY \"\\\\<shared_folder>\\<ryuk_exe>\" \"C:\\windows\\temp\\\"\n\nFigure 3: Line from the batch file used to copy Ryuk executable to each system\n\nstart PsExec.exe -d @C:\\<shared_folder>$\\<list>.txt -u <domain>\\<username> -p\n<password> cmd /c \"C:\\windows\\temp\\<ryuk_exe>\"\n\nFigure 4: Line from the batch file used to execute Ryuk on each system\n\n## Consistency in TrickBot Group Tags\n\n\n-----\n\nEach individual TrickBot sample beacons to its Command & Control (C2) infrastructure with a\nstatically defined “gtag” that is believed to act as an identifier for distinct TrickBot customers.\nThere has been significant uniformity in the gtags associated with TrickBot samples collected\nfrom the networks of victim organizations.\n\nThe instance of TrickBot identified as the likely initial infection vector for one intrusion\nwas configured to use the gtag ‘ser0918us’.\n\nAt the time of distribution, the C2 servers responding to TrickBot samples using\nthe gtag ‘ser0918us’ were sending commands to request that the malware scan\nvictim networks, and then propagate across hosts via the TrickBot worming\nmodule.\nIt is possible that in some or all cases instances of TrickBot propagated via the\nmalware’s worming module are configured to use different gtag values, specific to\nthe same TrickBot client, designed to simplify management of implants postexploitation.\nA significant proportion of TrickBot samples obtained from the victim environments,\nincluding in the case where the infection vector was identified as a sample using gtag\n‘ser0918us’, had gtags in the below formats. This may suggest that these gtags are\nused to manage post-exploitation instances of TrickBot for campaigns distributed via\ngtag ‘ser0918us’ and other related gtags.\n\nlibxxx (ex: lib373, lib369, etc)\ntotxxx (ex: tot373, tot369, etc)\njimxxx (ex jim373, jim369, etc)\nThe numbers appended to the end of each gtag appear to increment over time, and in\nsome cases multiple samples sharing the same compile time but using different gtags\nwere observed in the same victim environment, though in each of these cases the\nnumbers appended to the end of the gtag matched (e.g. two distinct samples sharing\nthe compile time 2018-12-07 11:28:23 were configured to use the gtags ‘jim371’ and\n‘tot371’).\nThe C2 infrastructure hard-coded into these samples overlaps significantly across\nsamples sharing similar gtag values. However, there is also C2 infrastructure overlap\nbetween these samples and ones with dissimilar gtag values. These patterns may\nsuggest the use of proxy infrastructure shared across multiple clients of the TrickBot\nadministrator group.\n\n## Implications\n\nThroughout 2018, FireEye observed an increasing number of cases where ransomware was\ndeployed after the attackers gained access to the victim organization through other methods,\nallowing them to traverse the network to identify critical systems and inflict maximum\ndamage. [SamSam operations, which date back to late 2015, were arguably the first to](https://www.wired.com/story/doj-indicts-hackers-samsam-ransomware/)\npopularize this methodology and TEMP.MixMaster’s is an example of its growing popularity\n\n\n-----\n\nwith threat actors. FireEye Intelligence expects that these operations will continue to gain\ntraction throughout 2019 due the success these intrusion operators have had in extorting\nlarge sums from victim organizations.\n\nIt is also worth highlighting TEMP.MixMaster’s reliance on TrickBot malware, which is more\nwidely distributed, to gain access to victim organizations. Following indiscriminate\ncampaigns, threat actors can profile victims to identify systems and users of interest and\nsubsequently determine potential monetization strategies to maximize their revenue. Various\nmalware families have incorporated capabilities that can aid in the discovery of high-value\ntargets underscoring the necessity for organizations to prioritize proper remediation of all\nthreats, not only those that initially appear to be targeted.\n\n## Acknowledgements\n\nThe authors would like to thank Brice Daniels, Edward Li, Eric Montellese, Sandor Nemes,\nEric Scales, Brandan Schondorfer, Martin Tremblay, Isif Ibrahima, Phillip Kealy and Steve\nRasch for their contributions to this blog post.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-11 - A Nasty Trick- From Credential Theft Malware to Business Disruption.pdf"
    ],
    "report_names": [
        "2019-01-11 - A Nasty Trick- From Credential Theft Malware to Business Disruption.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8492b1a0-126f-4113-b8f7-101d28559629",
            "created_at": "2023-01-06T13:46:38.864213Z",
            "updated_at": "2025-03-27T02:00:02.938147Z",
            "deleted_at": null,
            "main_name": "GRIM SPIDER",
            "aliases": [
                "GOLD ULRICK"
            ],
            "source_name": "MISPGALAXY:GRIM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535849,
    "ts_updated_at": 1743041696,
    "ts_creation_date": 1653702983,
    "ts_modification_date": 1653702983,
    "files": {
        "pdf": "https://archive.orkl.eu/7ee462617d7dab566addc617cec93102e7da3b4a.pdf",
        "text": "https://archive.orkl.eu/7ee462617d7dab566addc617cec93102e7da3b4a.txt",
        "img": "https://archive.orkl.eu/7ee462617d7dab566addc617cec93102e7da3b4a.jpg"
    }
}