{
    "id": "555693ee-20fe-415d-aaa0-0603270a99d9",
    "created_at": "2024-08-28T02:04:25.869409Z",
    "updated_at": "2025-03-27T02:16:30.216336Z",
    "deleted_at": null,
    "sha1_hash": "bdd94da859f59de226147b262d1db27d730d8d14",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-08-06T20:46:59Z",
    "file_modification_date": "2024-08-06T20:46:59Z",
    "file_size": 529701,
    "plain_text": "A MICROSOFT THREAT INTELLIGENCE REPORT\n## Date: August 9, 2024\n\nForeign malign influence concerning the 2024 US election started off slowly but has steadily\npicked up pace over the last six months due initially to Russian operations, but more recently\nfrom Iranian activity. This third election report from the Microsoft Threat Analysis Center\n(MTAC) provides an update on what we’ve observed from Russia, Iran, and China since our\n[second report in April 2024, “Nation-states engage in US-focused influence operations ahead](https://blogs.microsoft.com/on-the-issues/2024/04/17/russia-us-election-interference-deepfakes-ai/)\n[of US presidential election.”](https://blogs.microsoft.com/on-the-issues/2024/04/17/russia-us-election-interference-deepfakes-ai/)\n\nOver the past several months, we have seen the emergence of significant influence activity by\nIranian actors. Iranian cyber-enabled influence operations have been a consistent feature of\nat least the last three US election cycles. Iran’s operations have been notable and\ndistinguishable from Russian campaigns for appearing later in the election season and\nemploying cyberattacks more geared toward election conduct than swaying voters. Recent\nactivity suggests the Iranian regime—along with the Kremlin—may be equally engaged in\nelection 2024.\n\nMTAC continues to examine authoritarian content to detect the malicious use of generative\nAI. This effort supports Microsoft’s commitment to the Tech Accord to Combat Deceptive\nUse of AI in 2024 Elections. Since our last report in April 2024, MTAC published a [report](https://blogs.microsoft.com/on-the-issues/2024/06/02/russia-cyber-bots-disinformation-2024-paris-olympics/)\nregarding Russian influence operations to undermine the 2024 Summer Paris Olympics in\nwhich Storm-1679 has repeatedly utilized generative AI in its campaigns to little effect. In this\ninstallment, MTAC identifies a Russian and a Chinese actor that have employed generative\nAI—but with limited to no impact. In total, we’ve seen nearly all actors seek to incorporate AI\ncontent in their operations, but more recently many actors have pivoted back to techniques\nthat have proven effective in the past—simple digital manipulations, mischaracterization of\ncontent, and use of trusted labels or logos atop false information.\n\n## Iran enters the fold with cyber-influence operations starting June 2024\n\nIranian actors have recently laid the groundwork for influence operations aimed at US\naudiences and potentially seeking to impact the 2024 US presidential election. This recent\ncyber-enabled influence activity arises from a combination of actors which are conducting\ninitial cyber reconnaissance and seeding online personas and websites into the information\nspace.\n\nCyber-enabled influence operations aimed at US and other global elections have been a\n[persistent target for Iran in recent years. As we noted in our first elections report](https://blogs.microsoft.com/wp-content/uploads/prod/sites/5/2023/11/MTAC-Report-2024-Election-Threat-Assessment-11082023-2-1.pdf) last\nNovember 2023, “during the 2020 US presidential election, Iran launched multiple cyberenabled influence operations that impersonated American extremists, and attempted to sow\ndiscord among US voters and incite violence against US government officials. Since 2020,\nIran extended its track record of election meddling, amplifying cyberattacks with parallel\nonline influence operations in Bahrain and Israel.” As seen in Figure 1 below, Iran has\n\nMi ft Th t A l i C t (MTAC) 1\n\n\n-----\n\nemployed fabricated media, impersonations and in many cases cyberattacks throughout the\nlast four years targeting the US, Bahrain, and Israel.\n\n\n_Figure 1: Iranian influence actors’ election focused tactics, techniques, and procedures_\n\n\nLooking forward, we expect Iranian actors will employ cyberattacks against institutions and\ncandidates while simultaneously intensifying their efforts to amplify existing divisive issues\nwithin the US, like racial tensions, economic disparities, and gender-related issues. Here’s\nwhat we’ve seen thus far in 2024 from Iranian actors with respect to the upcoming US\nelection.\n\n_Sefid Flood prepares for possible influence operations_\nSefid Flood, an Iran-linked influence actor, began staging for influence operations in the 2024\nUS elections following the Iranian New Year in late March. Sefid Flood specializes in\nimpersonating social and political activist groups in a target audience to stoke chaos,\nundermine trust in authorities, and sow doubt about election integrity. This group’s\noperations may go as far as intimidation, doxing, or violent incitement targeting political\nfigures or social/political groups.\n\n_IRGC threat actors enter preparatory stage for likely cyber-enabled influence_\nIn June 2024, Mint Sandstorm—a group run by the Islamic Revolutionary Guard Corps (IRGC)\nintelligence unit—sent a spear-phishing email to a high-ranking official of a presidential\n[campaign from a compromised email account of a former senior advisor. The phishing email](https://www.wsj.com/public/resources/documents/Stone2.pdf)\ncontained a fake forward with a hyperlink that directs traffic through an actor-controlled\ndomain before redirecting to the listed domain. Mint Sandstorm similarly targeted a\n\nMi ft Th t A l i C t (MTAC) 2\n\n\n-----\n\npresidential campaign in May and June 2020 five to six months ahead of the last US\npresidential election.\n\nOn June 13, Mint Sandstorm also unsuccessfully attempted to log in to an account belonging\nto a former presidential candidate. Mint Sandstorm’s target selection and timing—days prior\nto phishing an active presidential campaign and months ahead of the election—suggest their\n[attempted authentication may also be election-related. Given Mint Sandstorm’s regular](https://blogs.microsoft.com/on-the-issues/2020/10/28/cyberattacks-phosphorus-t20-munich-security-conference/)\n[targeting](https://blogs.microsoft.com/on-the-issues/2020/10/28/cyberattacks-phosphorus-t20-munich-security-conference/) of senior political officials for intelligence collection unrelated to elections,\nadditional evidence is required to make a determination. Regardless of the intent, this\ntargeting is a reminder that senior policymakers should be cognizant of monitoring and\nfollowing cybersecurity best practices even for legacy or archived infrastructure, as they can\nbe ripe targets for threat actors seeking to collect intelligence, run cyber-enabled influence\noperations, or both.\n\nIn May, Peach Sandstorm (a.k.a. APT-33)—another group with assessed links to the IRGC—\ncompromised a user account with minimal access permissions at a county-level government\nin a swing state. The compromise was part of a broader password spray operation from the\ngroup, and Microsoft Threat Intelligence did not observe any lateral movement or privilege\nescalation, making it difficult to determine whether it was election-related. While unclear if\nrelated, it is worth noting that the targeted county had undergone a race-related controversy\nthat made national news this year. Since early 2023, Peach Sandstorm’s operations have\nfocused on strategic intelligence collection particularly in satellite, defense, and\npharmaceutical sectors with some targeting of US government organizations, often in swing\nstates.\n\nMi ft Th t A l i C t (MTAC) 3\n\n\n-----\n\n_Iran-run covert news sites target US voter groups_\nAn Iranian network, Storm-2035, comprising four\nwebsites masquerading as news outlets is actively\nengaging US voter groups on opposing ends of\nthe political spectrum with polarizing messaging\non issues such as the US presidential candidates,\nLGBTQ rights, and the Israel-Hamas conflict. This\ngroup is part of a broader campaign that has\nbeen operating since at least 2020 and includes\nover a dozen covert news sites targeting French,\nSpanish, Arabic, and English-speaking audiences\nwith social and political content.\n\n[In 2022, Mandiant reported on one of the news](https://cloud.google.com/blog/topics/threat-intelligence/2022-midterm-election-threats)\nsites, EvenPolitics, noting that the site had\npublished articles discussing the 2022 US midterm\n\n_Figure 2: June 7 article criticizing Donald Trump published in_\n\nelections. An inauthentic amplification network _one of the covert network’s outlets, Nio Thinker._\npromoting the website was taken down by the X\nplatform in 2022, but the site remains active, publishing around ten articles a week.\n\nA more recently created site, Nio Thinker, first began publishing in late October 2023. The\nsite’s early publications focused on the Israel-Hamas conflict, but have increasingly shifted to\nthe US elections in recent months. Its content caters to liberal audiences and includes\nsarcastic, long-winded articles insulting Trump including calling him an “opioid-pilled\nelephant in the MAGA china shop” and a “raving mad litigiosaur”[1] (see Figure 2).\n\nAnother site, Savannah Time, claims to be a “trusted source for conservative news in the\nvibrant city of Savannah.” The site focuses heavily on Republican politics and LGBTQ issues,\nparticularly gender re-assignment. MTAC has not observed significant social media\namplification of these sites as of yet, though it is possible they will begin closer to election\nday.\n\nMTAC found evidence indicating the sites are using AI-enabled services to plagiarize at least\nsome of their content from US publications. Examination of webpage source code and\nindicators in the articles themselves suggest the sites’ operators are likely using SEO plugins\nand other generative AI-based tools to create article titles, keywords, and to automatically\nrephrase stolen content in a way that drives search engine traffic to their sites while\nobfuscating the content’s original source.\n\n1 archive.is/Mvf3X\n\nMi ft Th t A l i C t (MTAC) 4\n\n\n-----\n\n## Russian actors sustain influence operations aimed at US audiences\n\nMTAC has observed three Russian influence actors involved in campaigns aimed at the 2024\npresidential election. MTAC tracks these as (1) Ruza Flood (a.k.a. Doppelganger[2]), (2) Storm1516, and (3) Storm-1841 (a.k.a. Rybar). Each has produced election influence campaigns to\nvarying degrees of effectiveness.\n\nAs noted in our April 2024 election update, the most impactful of these actors as of late June\n2024 is Storm-1516, which pivoted in late April from Ukraine-focused operations to targeting\nthe US election with its distinctive video forgeries.[3] Storm-1516 consistently launders\nnarratives through videos seeding scandalous claims from fake journalists and nonexistent\nwhistleblowers and amplifying that disinformation via inauthentic news sites. Since April,\nStorm-1516 has attempted to drive headlines with fake scandals claiming that the US Central\nIntelligence Agency (CIA) directed a Ukrainian troll farm to disrupt the upcoming US election,\nthe Federal Bureau of Investigation (FBI) wiretapped former US President Donald Trump’s\nresidence, and Ukrainian soldiers burned an effigy of Trump. MTAC anticipates the US\nelection will remain this actor’s top priority as November approaches. Ruza Flood continues\n\n_Figure 3: Storm-1516 created fake whistleblower testimony claiming the CIA instructed a Kyiv troll farm_\n_to meddle in the US election (left). In May, Storm-1516 staged a video in which fake Ukrainian soldiers_\n_burned an effigy of former President Donald Trump (right)._\n\n2 disinfo.eu/doppelganger-operation/\n3 nytimes.com/2024/05/15/us/politics/russia-disinformation-election.html\n\nMi ft Th t A l i C t (MTAC) 5\n\n\n-----\n\nits amplification of pro-Kremlin\nnarratives but has not\ndistributed significant US\nelection content since our last\nreport.\n\nMeanwhile, actors associated\nwith the prolific Russian military\nblogging and content creation\ncollective Rybar—which\nMicrosoft refers to as Storm\n_Figure 4: This image depicts the TexasvsUSA account manager’s efforts to_\n\n1841—have set their sights on\n\n_increase user engagement with a sticker and branding campaign, offering money_\n\nUS immigration issues. Rybar, _for user-submitted content._\nwhich until 2022 was associated\nwith the late Russian oligarch Yevgeny Prigozhin’s RIA FAN media empire, also manages USfocused Telegram channels including Topic du Jour (US domestic political news), and Blood\nMeridian (US southern border immigration news).\n\nMore recently, in January and February 2024, Rybar created accounts on Telegram and X\nusing the name “TEXASvsUSA.” TEXASvsUSA posts regularly feature inflammatory news\nupdates, invoke racial dog whistles, and call for mobilization and violence. These posts have\nmost notably included a 30-second AI-generated video titled “Hold the Line,” depicting a\nhorde of immigrant zombies amassing on the southern US border.\n\nMi ft Th t A l i C t (MTAC) 6\n\n\n-----\n\n## China\n\nChinese Communist Party (CCP)-linked influence actors\ncontinue to engage US audiences on divisive political issues,\nexpanding to new platforms and evolving their tactics to\nengage new audience spaces ahead of November. Beginning\nin late April through late May, the most prolific of these actors,\nTaizi Flood (a.k.a. Spamouflage), leveraged hundreds of\n\naccounts to stoke outrage\naround pro-Palestinian protests\nat US universities. Taizi Flood\nassets appeared to mimic\nstudents involved in the _Figure 5: Taizi Flood asset claims to be_\n\n_a student supporting the pro-_\n\nprotests, reacting in real-time\n\n_Palestinian protests on US college_\n\nas students clashed with law _campuses._\nenforcement across campuses,\nand lifted text from authentic accounts with directions to\ndemonstration locations. Some of these accounts seeded leftleaning messages into right-wing groups—likely either to\nfurther agitate conflict about the protests or misunderstanding\nwhich US audiences would be most receptive to their intended\nmessage.\n\n_Figure 6: Short-form video from Storm-_\n\nAnother CCP-linked influence actor, Storm-1852, has begun\n\n_1852 sockpuppet receives over 145K_\n_views._ pivoting to short-form video content on political topics to\n\ngarner audience engagement. These original videos criticize\nthe current administration or mock President Biden, suggesting that he is unfit for office.\nSome of these videos have garnered hundreds of thousands of views—significantly\noutperforming Taizi Flood campaigns, but still relatively small in overall scale.\n\nMi ft Th t A l i C t (MTAC) 7\n\n\n_Figure 5: Taizi Flood asset claims to be_\n_a student supporting the pro-_\n_Palestinian protests on US college_\n_campuses._\n\n\n-----\n\n## Appendix A: Iranian actors with assessed links to election interference\n\n**Actor** **Assessed affiliation** **Notable past activity**\n\n**Cotton** IRGC Leans heavily on cyber-enabled influence\n**Sandstorm** operations to influence elections, but also\n_a.k.a. Emennet_ makes use of influence-only operations.\n_Pasargad_ Has targeted US, Bahraini, and Israeli\n\nelections.\n**Lemon** IRGC Iranian threat actor known for ransomware\n**Sandstorm** hack-and-leak operations, reportedly\n_Fox Kitten_ gained access to a local US election results\n\nwebsite in 2020.[4] The attack was\nreportedly thwarted by US Cyber\nCommand, but officials predicted that the\ngroup may have sought to tamper with\nthe displayed results to undermine trust in\nthe election outcome.[5]\n\n**Mint Sandstorm** IRGC Ahead of the 2020 US presidential\n_Charming Kitten_ elections, they unsuccessfully attempted to\n\nlog in to accounts of Trump administration\nofficials and Donald J. Trump for President\ncampaign staff.[6]\n\n**Peach** IRGC Targeted US state government agencies in\n**Sandstorm** late September 2022, possibly to gain\n_APT33_ access ahead of close US Senate elections.\n\nWhile that attempt appeared unsuccessful,\nit suggests that Peach Sandstorm may be\npositioned to support elections-related\ninfluence operations.\n\n**Sefid Flood** Unknown Targeted Israel during its 2022 election\nand has been prolific in its operations\ntargeting Israeli activist groups more\nbroadly with influence-only operations.\nThere are indications that this actor\nconducted reconnaissance on US and\nBahraini candidates ahead of their\nrespective 2022 elections.\n\n**Storm-1660** Unknown Actor that conducts influence-only\noperations responsible for several\npersonas masquerading as “Black Flags”\nactivists opposed to Israeli Prime Minister\n\n4 washingtonpost.com/technology/2023/04/24/election-2020-iran-hacking/\n5 washingtonpost.com/technology/2023/04/24/election-2020-iran-hacking/\n6 https://blogs.microsoft.com/on-the-issues/2020/09/10/cyberattacks-us-elections-trump-biden/\n\nMi ft Th t A l i C t (MTAC) 8\n\n|Actor|Assessed affiliation|Notable past activity|\n|---|---|---|\n|Cotton Sandstorm a.k.a. Emennet Pasargad|IRGC|Leans heavily on cyber-enabled influence operations to influence elections, but also makes use of influence-only operations. Has targeted US, Bahraini, and Israeli elections.|\n|Lemon Sandstorm Fox Kitten|IRGC|Iranian threat actor known for ransomware hack-and-leak operations, reportedly gained access to a local US election results website in 2020.4 The attack was reportedly thwarted by US Cyber Command, but officials predicted that the group may have sought to tamper with the displayed results to undermine trust in the election outcome.5|\n|Mint Sandstorm Charming Kitten|IRGC|Ahead of the 2020 US presidential elections, they unsuccessfully attempted to log in to accounts of Trump administration officials and Donald J. Trump for President campaign staff.6|\n|Peach Sandstorm APT33|IRGC|Targeted US state government agencies in late September 2022, possibly to gain access ahead of close US Senate elections. While that attempt appeared unsuccessful, it suggests that Peach Sandstorm may be positioned to support elections-related influence operations.|\n|Sefid Flood|Unknown|Targeted Israel during its 2022 election and has been prolific in its operations targeting Israeli activist groups more broadly with influence-only operations. There are indications that this actor conducted reconnaissance on US and Bahraini candidates ahead of their respective 2022 elections.|\n|Storm-1660|Unknown|Actor that conducts influence-only operations responsible for several personas masquerading as “Black Flags” activists opposed to Israeli Prime Minister|\n\n\n-----\n\n|Col1|Col2|Benjamin Netanyahu. Meta attributes the group to the Iranian IT company Elya Information Technology Research Center (EITRC).7 This actor may be linked to Sefid Flood.|\n|---|---|---|\n\n\n7 about.fb.com/news/2020/11/october-2020-cib-report/\n\nMi ft Th t A l i C t (MTAC) 9\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://cdn-dynmedia-1.microsoft.com/is/content/microsoftcorp/microsoft/final/en-us/microsoft-brand/documents/5bc57431-a7a9-49ad-944d-b93b7d35d0fc.pdf"
    ],
    "report_names": [
        "5bc57431-a7a9-49ad-944d-b93b7d35d0fc.pdf"
    ],
    "threat_actors": [
        {
            "id": "29766ed4-2a41-49b1-b6f9-7b3a918db21f",
            "created_at": "2024-09-20T02:00:04.589212Z",
            "updated_at": "2025-03-27T02:00:03.420785Z",
            "deleted_at": null,
            "main_name": "Storm-1679",
            "aliases": [],
            "source_name": "MISPGALAXY:Storm-1679",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d070e12b-e1ce-4d8d-b5e3-bc71960cc0cb",
            "created_at": "2022-10-25T15:50:23.676504Z",
            "updated_at": "2025-03-27T02:00:55.521901Z",
            "deleted_at": null,
            "main_name": "Fox Kitten",
            "aliases": [
                "Fox Kitten",
                "UNC757",
                "Parisite",
                "Pioneer Kitten",
                "RUBIDIUM",
                "Lemon Sandstorm"
            ],
            "source_name": "MITRE:Fox Kitten",
            "tools": [
                "China Chopper",
                "Pay2Key",
                "ngrok",
                "PsExec",
                "Ngrok"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c348851-5036-406b-b2d1-1ca47cfc7523",
            "created_at": "2022-10-25T16:07:24.039861Z",
            "updated_at": "2025-03-27T02:02:10.08844Z",
            "deleted_at": null,
            "main_name": "Parisite",
            "aliases": [
                "Cobalt Foxglove",
                "Fox Kitten",
                "Lemon Sandstorm",
                "Parisite",
                "Pioneer Kitten",
                "Rubidium",
                "UNC757"
            ],
            "source_name": "ETDA:Parisite",
            "tools": [
                "Cobalt",
                "FRP",
                "Fast Reverse Proxy",
                "Invoke the Hash",
                "JuicyPotato",
                "Ngrok",
                "POWSSHNET",
                "Pay2Key",
                "Plink",
                "Port.exe",
                "PuTTY Link",
                "SSHMinion",
                "STSRCheck",
                "Serveo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "871acc40-6cbf-4c81-8b40-7f783616afbc",
            "created_at": "2023-01-06T13:46:39.156237Z",
            "updated_at": "2025-03-27T02:00:03.010146Z",
            "deleted_at": null,
            "main_name": "Fox Kitten",
            "aliases": [
                "PIONEER KITTEN",
                "PARISITE",
                "UNC757",
                "Lemon Sandstorm",
                "RUBIDIUM"
            ],
            "source_name": "MISPGALAXY:Fox Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b9f25498-8035-483c-871e-01cd45e7317f",
            "created_at": "2024-05-01T02:03:08.020262Z",
            "updated_at": "2025-03-27T02:05:17.309453Z",
            "deleted_at": null,
            "main_name": "COBALT FOXGLOVE",
            "aliases": [
                "Lemon Sandstorm ",
                "Parisite ",
                "Pioneer Kitten ",
                "RUBIDIUM ",
                "UNC757 ",
                "Fox Kitten "
            ],
            "source_name": "Secureworks:COBALT FOXGLOVE",
            "tools": [
                " FRP (Fast Reverse Proxy)",
                " Mimikatz",
                " Ngrok",
                " POWSSHNET",
                " STSRCheck",
                " Servo",
                " n3tw0rm ransomware",
                " pay2key ransomware",
                "Chisel"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "07131850-5161-48b8-98be-6b0271d44d0e",
            "created_at": "2024-01-23T13:22:35.085803Z",
            "updated_at": "2025-03-27T02:00:03.287403Z",
            "deleted_at": null,
            "main_name": "Cotton Sandstorm",
            "aliases": [
                "MARNANBRIDGE",
                "NEPTUNIUM",
                "Emennet Pasargad",
                "Holy Souls"
            ],
            "source_name": "MISPGALAXY:Cotton Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "52127588-6072-43b5-898a-7dcad415b59f",
            "created_at": "2024-11-08T02:04:52.012895Z",
            "updated_at": "2025-03-27T02:05:17.320758Z",
            "deleted_at": null,
            "main_name": "COBALT OBELISK",
            "aliases": [
                "Cotton Sandstorm ",
                "Haywire Kitten ",
                "Marnanbridge ",
                "ChaoticOrchestra "
            ],
            "source_name": "Secureworks:COBALT OBELISK",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1724810665,
    "ts_updated_at": 1743041790,
    "ts_creation_date": 1722977219,
    "ts_modification_date": 1722977219,
    "files": {
        "pdf": "https://archive.orkl.eu/bdd94da859f59de226147b262d1db27d730d8d14.pdf",
        "text": "https://archive.orkl.eu/bdd94da859f59de226147b262d1db27d730d8d14.txt",
        "img": "https://archive.orkl.eu/bdd94da859f59de226147b262d1db27d730d8d14.jpg"
    }
}