{
    "id": "558e580c-8cff-42d6-82c3-2e9de9561b7b",
    "created_at": "2022-10-25T16:48:15.178879Z",
    "updated_at": "2025-03-27T02:16:50.828817Z",
    "deleted_at": null,
    "sha1_hash": "358d09240838bd7382a6ee58371630ba664417f3",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-07-16T09:04:11Z",
    "file_modification_date": "2019-07-16T09:04:14Z",
    "file_size": 1003953,
    "plain_text": "# OKRUM AND KETRICAN:\n## AN OVERVIEW OF RECENT KE3CHANG GROUP ACTIVITY\n\n##### Author: Zuzana Hromcová\n\n\n-----\n\n### CONTENTS\n\n1 SUMMARY .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  2\n\n2 INVESTIGATION TIMELINE .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   2\n\n3 OKRUM MALWARE .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  3\n\n3.1 Technical analysis of Okrum .   .   .   .   .   .   .   .   .   .   .   .   .  3\n\n3.1.1 LOADERS  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  5\n\n3.1.2 INSTALLERS  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  7\n\n3.1.3 BACKDOOR  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  7\n\n3.2 Auxiliary tools used by Okrum  .   .   .   .   .   .   .   .   .   .   .   . 10\n\n4 KE3CHANG GROUP ACTIVITY IN 2015-2019 AND TIES TO OKRUM .   . 11\n\n4.1 Ke3chang activity in 2015 – Ketrican  .   .   .   .   .   .   .   .   .   .  11\n\n4.1.1 WORKING DIRECTORY  .  .  .  .  .  .  .  .  .  .  .  .  .  .  12\n\n4.1.2 ANTI-EMULATION/ANTI-SANDBOX TRICK  .  .  .  .  .  12\n\n4.1.3 NETWORK COMMUNICATION  .  .  .  .  .  .  .  .  .  .  . 13\n\n4.1.4 DATA TRANSFORMATION  .  .  .  .  .  .  .  .  .  .  .  .  . 13\n\n4.1.5 FURTHER ATTRIBUTION CONSIDERATIONS  .  .  .  .  14\n\n4.2 Ke3chang activity in 2017 – Ketrican .   .   .   .   .   .   .   .   .   . 14\n\n4.3 Ke3chang activity in 2017 – RoyalDNS .   .   .   .   .   .   .   .   .  15\n\n4.4 Ke3chang activity in 2018 – Ketrican .   .   .   .   .   .   .   .   .   . 16\n\n4.5 Ke3chang activity in 2019 – Ketrican .   .   .   .   .   .   .   .   .   . 17\n\n5 CONCLUSION .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 17\n\n6 INDICATORS OF COMPROMISE  .   .   .   .   .   .   .   .   .   .   .   .   .  18\n\n7 MITRE ATT&CK TECHNIQUES (OKRUM)  .   .   .   .   .   .   .   .   .   .   21\n\nAuthor: Zuzana Hromcová\n\nJuly 2019\n\n\n-----\n\n### 1 SUMMARY\n\n[The Ke3chang group, also known as APT15, is a threat group believed to be operating out of China. Its](https://attack.mitre.org/groups/G0004/)\n\n[attacks were first reported in 2012, when the group used a remote access trojan (RAT) known as Mirage](https://www.secureworks.com/research/the-mirage-campaign)\n\nto attack high-profile targets around the world. However, the group’s activities were traced back to\n\n[at least 2010 in FireEye’s 2013 report on operation Ke3chang – a cyberespionage campaign directed](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\nat diplomatic organizations and missions in Europe. The attackers resurfaced with malware dubbed\n\n_[TidePool, documented as part of a campaign spanning from 2012 to 2015, and later with the RoyalCLI](https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/)_\n\n_[and RoyalDNS backdoors, which were used to target the UK government from 2016 to 2017. In 2018, the](https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/march/apt15-is-alive-and-strong-an-analysis-of-royalcli-and-royaldns/)_\n\n[Ke3chang group was spotted using an apparently updated version of the Mirage RAT, dubbed MirageFox.](https://www.intezer.com/miragefox-apt15-resurfaces-with-new-tools-based-on-old-ones/)\n\nWe have been tracking the malicious activities related to this threat actor and made several noteworthy\n\ndiscoveries.\n\nFirst, from 2015 to 2019, we detected new versions of known malware families attributed to the\n\nKe3chang group – BS2005 (operation Ke3chang malware) and the RoyalDNS malware.\n\nSecond, we identified a previously undocumented malware family with strong links to the Ke3chang\n\ngroup – a backdoor we named Okrum. We first detected Okrum, through ESET telemetry, in December\n\n2016; it targeted diplomatic missions in Slovakia, Belgium, Chile, Guatemala and Brazil throughout 2017.\n\nIn this paper, we will take a deep technical look at this previously undocumented malware family and\n\nthe other Ke3chang malware families detected from 2015 to 2019. We will provide evidence that the\n\nlatter are evolved versions of known malware families attributed to Ke3chang group and explain how\n\nOkrum is linked to them – in terms of code, modus operandi and shared targets.\n\nNote: New versions of operation Ke3chang malware from 2015-2019 are detected by ESET systems as Win32/\n\n_Ketrican, and collectively referred to across this paper as Ketrican backdoors/samples, marked with the relevant_\n\n_year._\n\n### 2 INVESTIGATION TIMELINE\n\n##### 2015: Ketrican\n\nIn 2015, we identified new suspicious activities in European countries. The group behind the attacks\n\nseemed to have a particular interest in Slovakia, where many of the discovered malware samples were\n\ndetected; Croatia, the Czech Republic and other countries were also affected.\n\nOur technical analysis of the malware used in these attacks showed close ties to BS2005 backdoors\n\n[from operation Ke3chang, previously documented by FireEye in 2013, and to a related TidePool malware](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\n_[family discovered by Palo Alto Networks in 2016 that targeted Indian embassies across the globe.](https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/)_\n\n##### 2016-2017: Okrum\n\nThe story continued in late 2016, when we discovered a new, previously unknown backdoor that we\n\nnamed Okrum. The malicious actors behind the Okrum malware were focused on the same targets in\n\nSlovakia that were previously targeted by Ketrican 2015 backdoors.\n\n##### 2017: Ketrican and RoyalDNS\n\nRed lights started flashing when we discovered that the Okrum backdoor was used to drop a Ketrican\n\nbackdoor, freshly compiled in 2017.\n\nIn 2017, the same entities that were affected by the Okrum malware (and by the 2015 Ketrican\n\nbackdoors) again became targets of the malicious actors. This time, the attackers used new versions of\n\nthe RoyalDNS malware and a Ketrican 2017 backdoor.\n\n\n-----\n\n##### 2018: Ketrican\n\nIn 2018, we discovered a new version of the Ketrican backdoor that featured some code improvements.\n\n##### 2019: Ketrican\n\nIn March 2019, we detected a new Ketrican sample that has evolved from the 2018 Ketrican backdoor. It\n\naffected the same targets as the backdoor from 2018.\n\nThis timeline of events shows that the attackers were focused on the same type of targets but were\n\nusing different malicious toolsets to compromise them – exposing their previously unknown project,\n\nOkrum, in the process.\n\nFigure 1 // Timeline of previously documented Ke3chang group activity and detections related to our investigation\n\n### 3 OKRUM MALWARE\n\nIn late 2016, we identified a previously unknown backdoor that we named Okrum. We discovered that\n\nthe Okrum backdoor[1] was used to deliver a Ketrican sample[2]. This newly discovered Ketrican sample\n\nfrom 2017 has evolved from the Ke3chang group’s BS2005 malware family and is described in section 4.2.\n\nMoreover, the entities where we detected Okrum in 2017 were previously affected with backdoors\n\nknown to be attributed to the Ke3chang group – another hint that Okrum is the work of the same\n\nthreat actor.\n\nThe following sections provide a deep technical analysis of the Okrum backdoor.\n\n#### 3.1 Technical analysis of Okrum\n\nThe functionality of the Okrum backdoor is not unlike the other backdoors operated by the Ke3chang\n\ngroup. The commands allow the attackers to download and upload files, execute binaries or run shell\n\ncommands. The backdoor can also update itself to a newer version and can adjust the time it sleeps\n\nafter each backdoor command.\n\n1 SHA-1: 1D271F22798313650C91C6FC34551CC8492A201\n2 SHA-1: D3BFB10DB08C6828C3001C1F825ED6A6BF6F6E01\n\n\n-----\n\nThe backdoor itself is a dynamic-link library that is installed and loaded by two earlier-stage\n\ncomponents. During our investigation, the implementation of these two components was changed\n\nfrequently. Every few months, the authors actively changed implementation of the loader and installer\n\ncomponents, to avoid detection. At the time of this publication, ESET systems have detected seven\n\ndifferent versions of the loader component and two versions of the installer, although the functionality\n\nremained the same.\n\nWe have not been able to find the original attack vector and dropper of the malware, but we have\n\nidentified several components used in the Okrum malware:\n\n- An optional stage 0 loader\n\n- Stage 1 loader\n\n- An installer component\n\n- A PNG file with an embedded backdoor\n\nFigure 2 // Okrum architecture\n\nTable 1 lists the analyzed Okrum backdoor components.\n\nSHA-1 PE Timestamp File extension Comment\n\n`F42A9D85ABE04E721461FE2B52DDC9E0EA411D9E`  - PNG PNG image with embedded backdoor\n\n`8D7E503D972C03C0F87F2D6F6EF65F1381D21BC6` 2016-01-11 EXE Stage 1 loader with embedded backdoor\n\n`AD740FD11688B2B39072C7024679CC22878E2619` 2016-01-20 EXE Stage 1 loader with embedded backdoor\n\n`1CDC632E0A26F39E527ACF7B1CDECD829A6A2B3D` 2016-11-16 DLL Stage 1 loader\n\n`A426BCC6317F0D49F0F0B68091E8161C512E22C3` 2016-11-16 EXE Installer\n\n`38299BCF0BA25E331939683597F161A3D7121A26` 2016-12-19 EXE Stage 1 loader\n\n`F0E2C3AF0297C80C0A14E95E151FC7DC319ACFC3` 2016-12-19 EXE Installer\n\n`371B14F8BFD9B5DB098139E7FE2EBD4381CB259C` 2017-08-07 EXE Stage 0 loader\n\n`1D271F22798313650C91C6FC34551CC8492A2019` 2017-08-08 EXE Stage 1 loader\n\n`48F8BAFB334C6980FB578C09D7297A4B7F5E09E2` 2017-08-09 EXE Stage 1 loader\n\n`5FBAFB71CFDF0C93E19882630D05F37C1F756CBF` 2017-09-15 EXE Stage 1 loader\n\nTable 1 // Analyzed Okrum samples\n\n\n-----\n\n##### 3.1.1 LOADERS\n\nAlthough the Stage 1 loaders have varied frequently, they are all responsible for loading the very same\n\nOkrum backdoor. The Stage 0 loader is an optional component that loads the Stage 1 loader into\n\nmemory.\n\n3.1.1.1 Early Stage 1 loaders\n\nThe Stage 1 loader samples[3] compiled in January 2016 are dynamic-link libraries with the backdoor\n\nbundled at the end of the file. The last four bytes of the file determine the size of the backdoor, which is\n\nencrypted using the RC4 algorithm and a hardcoded key.\n\nThe following RC4 keys were used in the analyzed samples:\n```\n• 0x4540DCA3FE052EBA0183D9FA36DA7F98\n• 0xCDABDCA3FE2934B10893DFA1FA7D3698\n\n```\nThe loader first checks to make sure the process is not being emulated or executed within a sandbox.\n\nFour tricks are employed, as Figure 3 illustrates:\n\n- Two calls to GetTickCount function separated by a 20-second sleep. If the GetTickCount value\n\nhasn’t changed (i.e. the time has been accelerated), the malware terminates itself.\n\n- Two subsequent calls to GetCursorPos function. If the position of the cursor on the x-axis has\n\nchanged (i.e. the cursor positions were randomly generated), the malware terminates itself.\n\n- `GetGlobalMemoryStatusEx is called. If the amount of actual physical memory is less than 1.5`\n\nGigabytes, the malware terminates itself.\n\n- The payload starts only after the left (physical) mouse button has been pressed at least three times\n\n(GetAsyncKeyState is queried in an infinite loop).\n\nIf all the checks pass, the loader decrypts the backdoor and loads it within its process, as described in\n\nthe Backdoor section.\n\nFigure 3 // Four anti-sandbox/anti-emulation tricks employed by the Okrum Stage 1 loader\n\n3 SHA-1: 8D7E503D972C03C0F87F2D6F6EF65F1381D21BC6, AD740FD11688B2B39072C7024679CC22878E2619\n\n\n-----\n\n3.1.1.2 Late Stage 1 loaders\n\nThe later Stage 1 loader samples[4] compiled at the end of 2016 and in 2017 take a different approach than\n\nthe early samples. They no longer come bundled with the encrypted backdoor file; instead, the backdoor\n\nis embedded within a valid PNG file. When the file is viewed in an image viewer, a familiar image is\n\ndisplayed (as seen in Figure 4) but the loaders are able to locate an extra encrypted file that the user\n\ncannot see. This steganography technique is an attempt by the malicious actors to stay unnoticed and\n\nevade detection.\n\nFigure 4 // An innocuous-looking PNG image with an encrypted, malicious DLL embedded within\n\nAll the loaders assume the PNG file is already dropped somewhere in this folder or its subfolders:\n\nC:\\program files\n\nThey search the folder recursively for a file (of any name and any extension) that has the following\n\nstructure:\n\n- PNG signature as the first 4 bytes:\n```\n • 0x89504E47\n\n```\n- PNG zTXt header present in the file:\n```\n • 0x7A545874\n\n```\n- PNG IEND header present in the file:\n```\n • 0x49454E44\n\n```\n- Byte 0x01 immediately following the IEND header\n\n[The encrypted payload is embedded in the zTXt chunk. According to the PNG format specification, this](https://www.w3.org/TR/2003/REC-PNG-20031110/#11zTXt)\n\nsection should contain compressed text – such as licensing information – that would normally be\n\ndisplayed in the image properties. The zTXt chunk is, however, not critical for displaying the image\n\ncorrectly, and thus a PNG parser can ignore it if it is malformed (as in this case). Therefore, the image\n\ncan be rendered correctly even when a broken zTXt section is present.\n\n[The payload is decrypted using Tiny Encryption Algorithm (TEA) with a hardcoded key, and loaded within](https://link.springer.com/chapter/10.1007%2F3-540-60590-8_29)\n\nthe process of the loader. The same decryption key is hardcoded in all the loaders:\n```\n• 0x3E6A125F2387541296A3DC560C69AD1E\n\n```\nThe five loaders share exactly the same functionality (as described above) but the implementations are\n\ndifferent.\n\n4 SHA-1:38299BCF0BA25E331939683597F161A3D7121A26, 1D271F22798313650C91C6FC34551CC8492A2019,\n48F8BAFB334C6980FB578C09D7297A4B7F5E09E2, 1CDC632E0A26F39E527ACF7B1CDECD829A6A2B3D,\n5FBAFB71CFDF0C93E19882630D05F37C1F756CBF\n\n\n-----\n\nWhile one of them is implemented as a service called Ntmssvc that needs a Service Installer, the others\n\nare standalone executables. Two of the loaders make use of forced exceptions and hide their payload in\n\nthe exception handlers. All of the loaders are, however, responsible for locating, decrypting and loading\n\nthe backdoor, as described above.\n\n##### 3.1.2 INSTALLERS\n\n3.1.2.1 SHA-1: A426BCC6317F0D49F0F0B68091E8161C512E22C3\n\nThe first of the installers we detected is a Service Installer for the Ntmssvc service. Due to the same\n\nservice name and matching PE Timestamps, we assume this component is to be used with the Stage 1\n\nloader implemented as a service[5].\n\nThe component can be executed in two modes, determined by the command line argument (install\n\nor uninstall). It creates or removes a service called Ntmssvc that mimics the legitimate Removable\n\nStorage service but in fact, it loads one of the Okrum loaders on each system startup.\n\n3.1.2.2 SHA-1: F0E2C3AF0297C80C0A14E95E151FC7DC319ACFC3\n\nThe second installer has the same PE Timestamp as one of the Stage 1 loaders[6], so it is reasonable to\n\nassume they are meant to be used together.\n\nThis component installs the specified file to be executed with each system start. Exactly three command\n\nline arguments are expected:\n```\nmd – mode (1 = create a task, 2 = drop in a startup folder)\ntn – name of the task or shortcut file\nfp – binary file path\n\n```\nIn mode 1, a new hidden task named tn is scheduled, that executes file fp with each user logon. In mode\n\n2, a shortcut file named tn is created in a Startup folder that points to the specified file fp.\n\nIn both cases, COM interfaces are used (IPersistFile, ITaskScheduler, ITaskService).\n\n##### 3.1.3 BACKDOOR\n\nThe Okrum backdoor is a DLL with three exported functions:\n\n- `DllEntryPoint`\n\n- Reflective loader (_xyz/_Rld)\n\n- Main payload (_abc/_space)\n\nThe Stage 1 loader decrypts and loads the backdoor, using an unusual execution method. The DOS\n\nheader of the backdoor executable is valid, but can also be interpreted as shellcode. This allows\n\nthe Stage 1 component to load the backdoor DLL into its address space, and execute a JMP or CALL\n\ninstruction to offset 0x00 of the DLL, which passes control to the shellcode. The shellcode first calls the\n\nreflective loader export that applies relocations and resolves imports. Then it calls the export with the\n\npayload that executes the actual backdoor.\n\nInterestingly, the PE header is valid, which also makes more common execution methods possible. If\n\ndistributed in the original, unencrypted version, the backdoor could also be executed directly by having\n\nthe DLL loaded by any executable. It would also be possible to inject it directly into another process\n\nusing the reflective loader exported by the DLL. It is possible that these techniques were used by\n\nsome older versions of the malware; however, we have only witnessed execution using the shellcode\n\nembedded in the DOS header, as illustrated in Figure 5.\n\n5 SHA-1: 1CDC632E0A26F39E527ACF7B1CDECD829A6A2B3D\n6 SHA-1: 38299BCF0BA25E331939683597F161A3D7121A26\n\n\n-----\n\nFigure 5 // The valid PE header of the Okrum backdoor can also be interpreted as shellcode\n\n3.1.3.1 Overview\n\nOkrum can impersonate a logged on user’s security context using a call to the\n```\nImpersonateLoggedOnUser API, in order to gain administrator privileges.\n\n```\nIt automatically collects the following information about the infected computer:\n\n- computer name\n\n- user name\n\n- host IP address\n\n- primary DNS suffix value\n\n- OS version, build number\n\n- architecture\n\n- user agent string\n\n- locale info (language name, country name)\n\nIt starts communication with the C&C server and negotiates an AES key used in further communication.\n\nIf not successful, a hardcoded key is used. Then, it registers the victim with the server by sending\n\nthe collected information. Finally, it starts a loop in which the compromised computer queries for a\n\nbackdoor command and then interprets it locally.\n\n3.1.3.2 Network communication\n\nOkrum communicates with the remote server over the HTTP protocol using GET, POST and HEAD\n\nrequests:\n\n- HTTP HEAD request to negotiate AES key\n\n- HTTP GET request to get a command or download a file\n\n- HTTP POST request to upload a file\n\nIf any proxy servers are configured on the compromised system, Okrum is able to identify them and use\n\nthem to make HTTP requests.\n\n\n-----\n\nFigure 6 // Example of an HTTP GET request sent by Okrum to a remote server\n\nIn client->server direction of the communication, the data is transmitted in the Cookie header\n\n(additional data can be included in the HTTP Message Body if files are transmitted). In server->client\n\ndirection, the data is embedded in the Set-Cookie header.\n\nAn example of a client->server HTTP request is illustrated in Figure 6. The URI is different for different\n\ntypes of requests, but the data is always transmitted within the Cookie header.\n\nThe data always consists of a series of parameters and values, separated by an ampersand, e.g.:\n\n**tm=01/09/2018 12:30:00&hn=My-Computer&un=JohnDoe&dm=my.dns.**\n\nsuffix&ip=127.0.0.1&os=Windows Server 2016&fg=finance\n\nSeveral parameters are supported and which of them are used depends on the type of the request. In\n\nthe client >server direction, the parameters identify the victim and the query made to the server; in the\n\nother direction, they determine the backdoor commands and arguments.\n\nJust like in other backdoors attributed to the Ke3chang threat actor, a campaign name is always sent\n\nto the server as a part of the request, in order to help the operators keep track of the operation. In the\n\nOkrum samples we analyzed, we have encountered three campaign names:\n\n- finance\n\n- green[7]\n\n- rehake\n\nThe data is always AES-CBC encrypted and base64 encoded. The AES key negotiated with the server is\n\nused in the communication.\n\nMalware operators are trying to hide the malicious traffic with the C&C server within regular network\n\ntraffic by registering seemingly legitimate domain names. For example, the samples that were used\n\nagainst Slovak targets communicated with a domain name mimicking a Slovak map portal:\n\n- support.slovakmaps[.]com\n\nSimilarly, in a sample that was detected in a Spanish speaking country in South America, the operators\n\nused a domain name that translates as “missions support” in Spanish:\n\n- misiones.soportesisco[.]com\n\n7 Previous Ke3chang campaign names include “white” and “blue”.\n\n\n-----\n\n3.1.3.3 Backdoor commands\n\nThe backdoor commands are determined by the ct parameter embedded in the message from the\n\nremote server. A custom hash of this value is computed and compared with a hardcoded table. After\n\ninterpreting a command, Okrum sleeps for a configurable amount of time.\n\nThe Okrum backdoor supports only basic commands, which indicates it is either a first-stage backdoor,\n\nor, more likely, the malware operators execute more complicated commands manually. The full list of\n\nbackdoor commands can be found in Table 2.\n\nCommand ID Command hash Description\n\n`0` `467BC6E8` Adjust sleep time\n\n`1` `24196803` Execute a shell command\n\n`2` `5F1C0F5B` Download a file\n\n`3` `E16D3ACB` Execute a file / download a file / update itself\n\n`4` `E008CB5C` Upload a file\n\nTable 2 // Backdoor commands supported by Okrum malware\n\n#### 3.2 Auxiliary tools used by Okrum\n\nSince the Okrum backdoor is not very technically complex, most of the malicious activity must be\n\nperformed by manually typing shell commands, or by executing other available tools and software. This\n\n[is a common practice of the Ke3chang group, as had also been pointed out previously in the Intezer and](https://www.intezer.com/miragefox-apt15-resurfaces-with-new-tools-based-on-old-ones/)\n\n_[NCC Group reports monitoring Ke3chang group activity.](https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/march/apt15-is-alive-and-strong-an-analysis-of-royalcli-and-royaldns/)_\n\nNot all of these tools are necessarily malicious – some of them are common utilities such as a RAR\n\n[archiver; others are potentially unsafe applications that can be abused by the attackers. We have spotted](https://help.eset.com/eav/10/en-US/idh_unsafe_application.html)\n\ntools for dumping passwords, enumerating network sessions and others. Information about all the\n\nutilities we have seen being used by the Okrum malware is listed in Table 3.\n\nSHA-1 File name Tool name / description / website\n\n`2D4713A598831E8F913857729CF4C193CA7B9B2E` `csrss.exe` Keylogger\n\n`673F513186C5EFB465EBA1DFCEDE61979972F7FE` `wnzip.exe` RAR archiver utility\n\n`3314780AB1C782D1B226BEAEE9DE16E9BEB00FD0` `gp.exe` MimikatzLite\n\n`3FC6F7F66EEDA71B53C32B2086A4D737C94C4BCF` `gpd.exe` MimikatzLite\n\n`E9D01DA30DA5FAE2EE333A8E446F0232E60AD8D9` `Drives.exe` _[DriveLetterView](https://www.nirsoft.net/utils/drive_letter_view.html)_\n\n`83A2F4F0E6DFFDFF5420048D9B37011FC50D45B4` `nets.exe` _[Netsess (RiskWare)](http://www.joeware.net/freetools/tools/netsess/)_\n\n`007AB8DF56EC7E9D18A71EC6D15D36912258D94F` `nets.exe` Netsess (RiskWare)\n\n`858A9E32DBF619C68E1325590E87670E940B0E45` `tif.exe` [Modified Quarks PwDump](https://blog.quarkslab.com/quarks-pwdump.html)\n\nTable 3 // Tools (ab)used by the Okrum backdoor\n\nSimilar utilities were observed being used by other Ke3chang malware, which is described in the next\n\nsection. For example, a Ketrican backdoor from 2017 used NetSess, NetE, ProcDump, PsExec, RAR\n\n[archiver utility, and Get-PassHashes.](https://github.com/samratashok/nishang/blob/master/Gather/Get-PassHashes.ps1)\n\n\n-----\n\n### 4 KE3CHANG GROUP ACTIVITY IN 2015-2019\n\n AND TIES TO OKRUM\n\n[From 2015 to 2019, we detected malware that evolved from the BS2005 backdoors from operation](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\n_[Ke3chang – the Ketrican backdoors – and a new version of the RoyalDNS malware. In this section, we](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)_\n\nwill go through these newly discovered samples, compare them to the malware families previously\n\nattributed to Ke3chang group, and explain how Okrum fits into the picture.\n\n#### 4.1 Ke3chang activity in 2015 – Ketrican\n\nAll of the analyzed Ketrican 2015 samples were backdoors supporting the same set of basic commands\n\nas malware used in operation Ke3chang, such as downloading and uploading files, executing files\n\nand shell commands, and sleeping for a configurable time. Likewise, each of the files has a hardcoded\n\ncampaign name, the C&C server domain name and URI, as in the samples used in operation Ke3chang.\n\nThe list of IoCs extracted from the Ketrican samples discovered in 2015 can be found in Table 4.\n\nSHA-1 PE Timestamp C&C server URI Campaign Name\n\n`2748A2928B6A4A528709ABA20AEF93D1EC9010F9` 2014-03-12 dyname.europemis[.]com twit4ter name\n\n`94E6CB95585DBB59A61EC4029BC7EBB30BBA57E5` 2014-03-17 dream.zepotac[.]com whaced water\n\n`D3A96C0FA84BFEE826E175D4664116A169D15D4E` 2014-04-14 translate.europemis[.]com twit4ter baby\n\n`1C7559C57606B359EEB57F0416FE0B2784C01395` 2014-09-04 view.beleimprensa[.]org whaced peach\n\n`233FF39DDE5A13CBF78EC1E9C020CF3CF18084E7` 2015-01-28 store.ufmsecret[.]org images warm\n\n`A23EE1F17B746C1907293C7F8155E3E7DE135648` 2015-06-18 daily.huntereim[.]com whaced pictu\n\n`10BD61F3FB03632E270FEF3AB6515677405A472F` 2015-07-31 center.nmsvillage[.]com content video\n\n`809C53F71549D83ED8AB5BAB312249212F6F4149` 2015-08-04 store.ufmsecret[.]org images warm\n\n`77369D3735B3B2C24CCAA93ECAA903D816EA9CD9` 2015-09-15 control.mimepanel[.]org whaced panel\n\n`844E710D85DD63AA5BF245CEE94C1CC872429BD3` 2015-11-06 rain.nmsvillage[.]com twit4ter snow\n\n`B49EDC05658907C888074905CE234BF3CF58D8A0` 2015-11-18 wind.deltimesweb[.]com whaced cloud\n\n`4C1198F726ACAD7AF78B36F250A128D5E3C52D8C` 2015-11-26 promise.miniaturizate[.]org images tree\n\n`1730D90FFB888877EA2F18198BCC592087218E9A` 2015-09-29 item.amazonout[.]com w4rmeg fight\n\nTable 4 // IoCs extracted from the analyzed Ketrican samples discovered by ESET in 2015\n\nIn the rest of this part of the paper, we will point out the major similarities between the coding style of\n\nthe malware used in operation Ke3chang and the Ketrican backdoor samples discovered by ESET in 2015.\n\nThese share the main features with the BS2005 malware family, but in some places, they have clearly\n\nevolved.\n\n\n-----\n\n##### 4.1.1 WORKING DIRECTORY\n\nThe first trait common to both BS2005 and some of the 2015 Ketrican samples is that they create a copy\n\nof the Windows Command Prompt (cmd.exe) in their working directories and then use it to interpret\n\nbackdoor commands. Both BS2005 and Ketrican backdoors use similar command-line patterns to\n\nexecute a file or shell command using their Command Prompt copy and redirect its output to a file, as\n\nseen in Figure 7.\n\nFigure 7 // Files and commands are executed using a copy of Command Prompt\n\nThe files created by the malware are stored in a working directory in one of Windows special folders\n\n(e.g. Local Settings). The special folder location is updated in different versions of the backdoors\n\nfrom operation Ke3chang but the path to the folder is always retrieved by accessing the following\n\nregistry key, rather than using the SHGetSpecialFolderLocation API function:\n```\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell\nFolders]\n\n```\n[The Shell Folders registry key is only supported by Windows for backwards compatibility and is not the](https://docs.microsoft.com/en-us/previous-versions/technet-magazine/cc160778(v=msdn.10))\n\nrecommended way to access these folders. It is a rather unusual technique to use this key and that links\n\nthe samples used in operation Ke3chang to the samples discovered in 2015.\n\n##### 4.1.2 ANTI-EMULATION/ANTI-SANDBOX TRICK\n\nOne of the artifacts shared among the analyzed samples is a heuristic to detect an emulated\n\nenvironment or a sandbox. The GetTickCount function is called before and after a loop with\n\n999,999,990 iterations of incrementing a value. If the returned value doesn’t change between calls,\n\nemulation or a sandbox is detected and the process terminates itself.\n\n[According to the FireEye report, at least one of the BS2005 samples from operation Ke3chang contained](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\nthe very same heuristic. We were able to locate the same heuristic in all Ketrican backdoors discovered\n\nin 2015, as Figure 8 depicts.\n\n\n-----\n\nFigure 8 // A trick to detect an emulated environment or a sandbox\n\n##### 4.1.3 NETWORK COMMUNICATION\n\nJust like the BS2005 family, the 2015 Ketrican samples control the Internet Explorer browser process\n\nusing the IWebBrowser2 COM interface, to make their network communication look legitimate. Data is\n\nencrypted and encoded, and sent using the HTTP protocol.\n\nThe response from the server is an HTTP page with backdoor commands and arguments included in a\n\nhidden input field. This data is expected to have a specific format that varies across the samples, but\n\nthe same pattern is used, as shown in Figure 9.\n\nFigure 9 // Specific format of data received from the C&C server in samples\n\nfrom operation Ke3chang (left) and 2015 Ketrican samples\n\n##### 4.1.4 DATA TRANSFORMATION\n\nIn the BS2005 malware samples, a specific two-step transformation is used for the data before it is sent\n\nto a remote server. First, the data is encrypted with a custom algorithm and then it is URL-safe, base64\n\nencoded, meaning that all “+” characters are replaced with “*” characters, which allows the data to be\n\ntransmitted as a part of the URL.\n\n[In one of the samples, the following encryption algorithm is used:](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\n- Each byte has 0x27 plus its positional index byte added to it\n\n- The byte is then XORed with its positional index byte\n\nThe same transformation is used in other samples from operation Ke3chang, except that constants\n\nother than 0x27 are used. In the samples discovered in 2015, the malware authors continued with this\n\npractice, as shown in Figure 10. Ketrican 2015 backdoors also use the combination of encryption and this\n\nURL-safe, base64 encoding and similarly vary the encryption method.\n\n\n-----\n\nIn some of the samples, a similar weak-encryption algorithm is used except that the constant is\n\nsubtracted instead of being added. In yet other samples, the encryption algorithm has been changed to\n\nAES.\n\nFigure 10 // Encryption algorithm used in a BS2005 sample and in a Ketrican backdoor discovered in 2015\n\n##### 4.1.5 FURTHER ATTRIBUTION CONSIDERATIONS\n\nOur conclusions about the backdoors discovered in 2015 were also confirmed in a later Palo Alto\n\n[Networks report about a malware family they call TidePool, which included two of the samples we](https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/)\n\nanalyzed[8]. The Palo Alto Network researchers claim the TidePool malware family is an evolution of\n\nBS2005 malware family, which is in accordance with our findings.\n\nHowever, this fact alone would not be enough to attribute the malware samples detected in 2015 to\n\nthe Ke3chang group, since we have to consider the possibility of malware reuse between different APT\n\n[groups. As also stated in the FireEye report, the source code used in operation Ke3chang is likely shared](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-operation-ke3chang.pdf)\n\namong different developers or teams of developers. Thus, we cannot assume that anybody who uses\n\nthis malware is automatically the Ke3chang group.\n\nNevertheless, we can confirm that the threat actor behind the samples discovered in 2015 had the same\n\nobjectives and targeted the same type of organizations as the Ke3chang threat actor – diplomatic\n\norganizations and missions. This leads us to believe the group behind the Ketrican samples ESET\n\ndiscovered in 2015 is indeed the same actor that was behind operation Ke3chang.\n\n#### 4.2 Ke3chang activity in 2017 – Ketrican\n\nThe Ketrican samples from 2015 described in the previous section and Okrum samples from 2017 could\n\neasily look like being part of two independent operations targeted against the same organizations.\n\nHowever, we discovered a direct link between the two malware families - one of the Okrum backdoors[9]\n\nwas used to drop a 2017 Ketrican sample[10].\n\nThis dropped backdoor had a PE Timestamp set to Aug 08 2017 that, according to our telemetry, appears\n\nto be valid. Our analysis showed it was – again – an evolution of backdoors used in operation Ke3chang,\n\nexhibiting the same coding style with several improvements. At some point, the attackers appear to\n\nhave switched the Okrum backdoor to a freshly compiled Ketrican sample.\n\nThe samples detected in 2017 closely resemble BS2005 backdoors from operation Ke3chang. The same\n\nset of commands and methods of network communication are supported, and the main features remain\n\nunchanged.\n\n8 SHA-1: 2748A2928B6A4A528709ABA20AEF93D1EC9010F9, 809C53F71549D83ED8AB5BAB312249212F6F4149\n9 SHA-1: 1D271F22798313650C91C6FC34551CC8492A2019\n10 SHA-1: D3BFB10DB08C6828C3001C1F825ED6A6BF6F6E01\n\n\n-----\n\nAgain, the authors continued to update the same parts of code as we have witnessed before. The\n\nspecial folder used as a working directory was updated to a new value (from Local Appdata/Local\n```\nSettings to Templates/AppData).\n\n```\nBefore the collected data is sent to a C&C server (using the very same technique as in the BS2005\n\nmalware), it undergoes the same transformation where encryption is combined with the same URL-safe\n\nbase64 encoding. The encryption routine was updated to AES or RC4.\n\nThe authors also continue to use campaign names to keep track of the ongoing operations and to\n\nidentify victims. Table 5 lists the IoCs extracted from the Ketrican samples detected in 2017.\n\nSHA-1 PE Timestamp C&C server URI Campaign Name\n\n`58DEA3A56DE1D95353230BE9BBBA582599AFE624` 2009-01-14 forcan.hausblow[.]com  - blue\n\n`FE2BF0A613482A40CCF84157361054EE77C07960` 2016-12-19 login.allionhealth[.]com  - login\n\n`D3BFB10DB08C6828C3001C1F825ED6A6BF6F6E01` 2017-08-08 buy.babytoy-online[.]com region fvejautoexp\n\n`2C8B145EF5AC177C99DFCB8C0221E30B3A363A96` 2017-08-08 newflow.babytoy-online[.]com  - blue\n\n`D8AA9E4918E464D00BA95A3E28B8707A148EC4D7` 2017-08-09 buy.babytoy-online[.]com region fvejautoexp\n\n`9D41B44AF5BAAF581C0D9D7BEF466213BD8BE01A` 2017-08-10 press.premlist[.]com  - press\n\n`F2BFDA51BDA3EE57878475817AF6E5F24FFBBB28` 2017-08-23 items.babytoy-online[.]com  - blue\n\nTable 5 // IoCs extracted from the analyzed Ketrican samples discovered by ESET in 2017\n\n#### 4.3 Ke3chang activity in 2017 – RoyalDNS\n\nIn 2017, the entities affected by the Ketrican 2015 and Okrum backdoors were targeted with a variation\n\nof the RoyalDNS malware, which has already been attributed to the Ke3chang group. Its main\n\ncharacteristic is using the DNS protocol to communicate with the C&C server.\n\n[The RoyalDNS sample from the NCC Group report was compiled on June 3, 2017 while the data in the](https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/march/apt15-is-alive-and-strong-an-analysis-of-royalcli-and-royaldns/ )\n\nPE header of the newly discovered sample point to a more recent date, September 25, 2017. Both\n\nof the samples export the same functions, as seen in Figure 11, and use the very same rare type of\n\ncommunication with the C&C server.\n\nFigure 11 // The functions exported by the RoyalDNS backdoors\n\nTo communicate with the C&C server, a list of locally configured DNS servers is retrieved, and then\n\nthe malware queries for specific TXT records of a C&C domain. The response from the DNS server\n\nencapsulates the backdoor commands. An example of such a DNS query packet is illustrated in Figure\n\n12. The new RoyalDNS sample uses a different domain name than the original one:\n\n- menorustru[.]com\n\n\n-----\n\nFigure 12 // DNS query as a method to communicate with the C&C server\n\n#### 4.4 Ke3chang activity in 2018 – Ketrican\n\nIn 2018, we discovered new Ketrican samples. Among all the versions of the Ketrican backdoors we’ve\n\nfound, these have evolved the most.\n\nAn option to load a DLL was added to the traditional set of supported commands. The encryption\n\nalgorithm has been replaced with the XOR cipher (volume serial number of the C volume is used as the\n\nkey).\n\nThe 2018 Ketrican backdoors use the same method of network communication as the samples from\n\nthe BS2005 family – a combination of an HTTP request made via an instance of IWebBrowser2 COM\n\nobject and response HTML pages with hidden input fields. What is different is that instead of using the\n```\nCoCreateInstance API function to create the COM object instance directly, a registration-free COM\n\n```\ntechnique is used.\n\nFinally, the 2018 Ketrican backdoors share another feature common for Ke3chang group backdoors. They\n\nare known to modify specific registry keys and values in order to weaken some security settings of the\n\ncompromised machine, which can help them further extend their malicious capabilities to provide those\n\nnot available via the backdoor itself.\n\nFor example, Internet Explorer Enhanced Security configuration can be disabled by setting the following\n\nregistry value:\n```\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\\nZoneMap]\n  “IEHarden” = 0\n\n```\nBy setting this value, prevention of script execution and other valuable protections are disabled.\n\n[This is not a new feature; the same set of registry keys is changed in BS2005 and Tidepool malware families,](https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/)\n\nand in the Ketrican samples discovered in 2015, 2017 and 2018. The samples from 2018 are, however, the\n\nfirst ones to use PowerShell scripts to modify the keys. The older versions of the malware used registry\n\nAPI functions or the reg.exe utility for that.\n\nSHA-1 PE Timestamp C&C server URI Campaign Name\n\n`C1C89A1A1779515EC1DFD0EFFF293615D523279E` 2018-02-01 dsmanfacture.privatedns[.]org  -  \n`09B7999160C5D0DC9A7443F0FC248B6C23BC0724` 2018-07-17 compatsec[.]com  -  \n`6BF0923577FE5939DEA66F466B74683AE2EBBC3E` 2018-07-17 compatsec[.]com  -  \nTable 6 // IoCs extracted from 2018 Ketrican samples\n\n\n-----\n\n#### 4.5 Ke3chang activity in 2019 – Ketrican\n\nIn March 2019, we detected two new Ketrican samples, one of which was similar to the 2018 Ketrican\n\nbackdoor, and the other that has evolved from it. The previous Ketrican samples and the samples\n\ndetected in 2019 largely overlap in commands, network communication, and obfuscation. The 2019\n\nversion also modifies the same rare combination of registry values as all earlier Ketrican samples, which\n\nis explained in the section above.\n\nThere is one noteworthy difference between the previous Ketrican samples and the 2019 ones: instead\n\nof executing a new cmd.exe process for each PowerShell command (i.e. to change every registry value),\n\nthere is only one instance of the process, which communicates with the malware over anonymous\n\npipes.\n\nSHA-1 PE Timestamp C&C server URI Campaign Name\n\n`D98D258C234F5CEAD43FD897613B2EA2669AA7C0` 2019-01-28 chart.healthcare-internet[.]com  -  \n`CE94EC2CFB23D8C662F558C69B64104C78B9D098` 2019-04-25 inicializacion[.]com  - cion\n\nTable 7 // IoCs extracted from 2019 Ketrican samples\n\n### 5 CONCLUSION\n\nThe Ke3chang APT group (a.k.a. APT15) has rightfully been on the radar of security researchers because\n\nof its decade-long operation, targeting high-value victims such as diplomatic entities, and other\n\ngeopolitical aspects associated with them.\n\nWhile ESET does not engage in attribution of these activities to a particular nation-state, we do attempt\n\nattribution of individual malware-driven cyberattacks to a particular APT group.\n\nIn this paper we have documented the previously unknown malware, Okrum, detected by ESET in\n\nSlovakia, Belgium, Chile, Guatemala and Brazil, documented other suspected Ke3chang activity (using\n\nthe Ketrican and RoyalDNS malware families), and provided evidence that drives us to the conclusion\n\nthat all of this is indeed the work of the Ke3chang threat actor.\n\nJust like other known Ke3chang malware, Okrum is not technically complex, but we can certainly\n\nsee that the malicious actors behind it were trying to remain undetected by using tactics such as\n\nembedding the malicious payload within a legitimate PNG image, employing several anti-emulation and\n\nanti-sandbox tricks, as well as making frequent changes in implementation. As for the analyzed Ketrican\n\nsamples, these show visible evolution and code improvements from 2015 to 2019.\n\nWhat remains to be answered is how the malware was distributed to the victim machines.\n\nESET will continue to track the malicious activities of the Ke3chang threat group.\n\n\n-----\n\n### 6 INDICATORS OF COMPROMISE (IOCS)\n\n#### 6.1 Okrum\n\n##### 6.1.1 ESET DETECTION NAMES\n\n- Win32/Okrum.A\n\n- Win32/Okrum.B\n\n- Win32/Okrum.C\n\n- Win32/Okrum.D\n\n- Win32/Okrum.E\n\n- Win32/Okrum.F\n\n- Win32/Okrum.G\n\n- Win32/Okrum.H\n\n- Win32/Okrum.I\n\n##### 6.1.2 SHA-1\n```\n• 1CDC632E0A26F39E527ACF7B1CDECD829A6A2B3D\n• 1D271F22798313650C91C6FC34551CC8492A2019\n• 371B14F8BFD9B5DB098139E7FE2EBD4381CB259C\n• 38299BCF0BA25E331939683597F161A3D7121A26\n• 48F8BAFB334C6980FB578C09D7297A4B7F5E09E2\n• 5FBAFB71CFDF0C93E19882630D05F37C1F756CBF\n• 8D7E503D972C03C0F87F2D6F6EF65F1381D21BC6\n• A426BCC6317F0D49F0F0B68091E8161C512E22C3\n• AD740FD11688B2B39072C7024679CC22878E2619\n• F0E2C3AF0297C80C0A14E95E151FC7DC319ACFC3\n• F42A9D85ABE04E721461FE2B52DDC9E0EA411D9E\n\n 6.1.3 C&C SERVERS\n\n```\n- finance.globaleducat[.]com\n\n- support.slovakmaps[.]com\n\n- misiones.soportesisco[.]com\n\n##### 6.1.4 MUTEX NAMES\n\n- qDJsxrGpPacRndLdsdIoqesGBv\n\n- SnpcnSHPPxsdfcwzEkmtdv\n\n- zSpgnEHPPcvAltcFzlIscD\n\n\n-----\n\n#### 6.2 Ketrican\n\n##### 6.2.1 ESET DETECTION NAMES\n\n- Win32/Ketrican.A\n\n- Win32/Ketrican.B\n\n- Win32/Ketrican.C\n\n- Win32/Ketrican.D\n\n- Win32/Ketrican.E\n\n- Win32/Ketrican.F\n\n- Win32/Ketrican.G\n\n- Win32/Ketrican.H\n\n- Win32/Ketrican.I\n\n- Win32/Ketrican.J\n\n- Win32/Ketrican.K\n\n- Win32/Ketrican.L\n\n- Win32/Ketrican.M\n\n- Win32/Ketrican.N\n\n- Win32/Ketrican.O\n\n- Win32/Ketrican.P\n\n- Win32/Ketrican.Q\n\n- Win32/Ketrican.R\n\n- Win32/Ketrican.S\n\n- Win32/Ketrican.T\n\n##### 6.2.2 KETRICAN 2015\n\n6.2.2.1 SHA-1\n```\n• 054EB61F2CE6DEB4FE011335CD88EBA530B8D09A\n• 10BD61F3FB03632E270FEF3AB6515677405A472F\n• 1730D90FFB888877EA2F18198BCC592087218E9A\n• 1C7559C57606B359EEB57F0416FE0B2784C01395\n• 233FF39DDE5A13CBF78EC1E9C020CF3CF18084E7\n• 2748A2928B6A4A528709ABA20AEF93D1EC9010F9\n• 43A4CC528134E218B9CEC2FF0C24B5912BF5C032\n• 4636E5FB97AFA68F60BE9247F5EB9684CA9CDBA6\n• 4C1198F726ACAD7AF78B36F250A128D5E3C52D8C\n• 65E3947144F6A3C31BC88E445514A83FCB331AFD\n• 7581337DB29E092101E4FD692D01AA26D65FA40A\n• 77369D3735B3B2C24CCAA93ECAA903D816EA9CD9\n• 809C53F71549D83ED8AB5BAB312249212F6F4149\n• 844E710D85DD63AA5BF245CEE94C1CC872429BD3\n• 86513FE43F2F2D2C486D6265C9098315E774F791\n• 94E6CB95585DBB59A61EC4029BC7EBB30BBA57E5\n• A23EE1F17B746C1907293C7F8155E3E7DE135648\n• AB7F63649BBC53E45DEEB7269BEBD54815AE9E27\n• B49EDC05658907C888074905CE234BF3CF58D8A0\n• D3A96C0FA84BFEE826E175D4664116A169D15D4E\n\n```\n\n-----\n\n```\n• D3D0DED17D0029DFD90DA2AE74ADA885779E8926\n• D7DFB547033B82765F8B0A6B70A22A4EC204D7A8\n• DD753FCBAD4BE31066F278585D14C411DB3D7795\n\n```\n6.2.2.2 C&C servers\n\n- center.nmsvillage[.]com\n\n- control.mimepanel[.]org\n\n- daily.huntereim[.]com\n\n- dream.zepotac[.]com\n\n- dyname.europemis[.]com\n\n- item.amazonout[.]com\n\n- promise.miniaturizate[.]org\n\n- rain.nmsvillage[.]com\n\n- store.ufmsecret[.]org\n\n- translate.europemis[.]com\n\n- view.beleimprensa[.]org\n\n- wind.deltimesweb[.]com\n\n##### 6.2.3 KETRICAN 2017\n\n6.2.3.1 SHA-1\n```\n• 2C8B145EF5AC177C99DFCB8C0221E30B3A363A96\n• 58DEA3A56DE1D95353230BE9BBBA582599AFE624\n• 9D41B44AF5BAAF581C0D9D7BEF466213BD8BE01A\n• D3BFB10DB08C6828C3001C1F825ED6A6BF6F6E01\n• D8AA9E4918E464D00BA95A3E28B8707A148EC4D7\n• F2BFDA51BDA3EE57878475817AF6E5F24FFBBB28\n• FE2BF0A613482A40CCF84157361054EE77C07960\n\n```\n6.2.3.2 C&C servers\n\n- buy.babytoy-online[.]com\n\n- forcan.hausblow[.]com\n\n- items.babytoy-online[.]com\n\n- login.allionhealth[.]com\n\n- newflow.babytoy-online[.]com\n\n- press.premlist[.]com\n\nNote: We have not detected samples using the following C&C servers. We extracted them by observing the\n\n_similarities in the C&C infrastructure used by the malware._\n\n- grek.freetaxbar[.]com\n\n- items.burgermap[.]org\n\n- upcv.inciohali[.]com\n\n- www1.sanpaulostat[.]com\n\n- cv.livehams[.]com\n\n- info.audioexp[.]com\n\n\n-----\n\n##### 6.2.4 KETRICAN 2018\n\n6.2.4.1 SHA-1\n```\n• 09B7999160C5D0DC9A7443F0FC248B6C23BC0724\n• 6BF0923577FE5939DEA66F466B74683AE2EBBC3E\n• C1C89A1A1779515EC1DFD0EFFF293615D523279E\n\n```\n6.2.4.2 C&C servers\n\n- compatsec[.]com\n\n- dsmanfacture.privatedns[.]org\n\n##### 6.2.5 KETRICAN 2019\n\n6.2.5.1 SHA-1\n```\n• D98D258C234F5CEAD43FD897613B2EA2669AA7C0\n• CE94EC2CFB23D8C662F558C69B64104C78B9D098\n\n```\n6.2.5.2 C&C servers\n\n- chart.healthcare-internet[.]com\n\n- inicializacion[.]com\n\n#### 6.3 RoyalDns\n\n##### 6.3.1 ESET DETECTION NAMES\n\n- Win32/RoyalDNS.A\n\n- Win32/RoyalDNS.B\n\n##### 6.3.2 SHA-1\n```\n• CE94EC2CFB23D8C662F558C69B64104C78B9D098\n\n 6.3.3 C&C SERVERS\n\n```\n- menorustru[.]com\n\n### 7 MITRE ATT&CK TECHNIQUES (OKRUM)\n\nTactic ID Name Description\n\n_[T1059](https://attack.mitre.org/techniques/T1059/)_ Command-Line Interface Okrum’s backdoor uses cmd.exe to execute arbitrary commands.\n\n\nExecution\n\nPersistence\n\n\n_[T1064](https://attack.mitre.org/techniques/T1064/)_ Scripting The backdoor uses batch scripts to update itself to a newer version.\n\nThe Stage 1 loader creates a new service named NtmsSvc to execute the\n_[T1035](https://attack.mitre.org/techniques/T1035/)_ Service Execution\npayload.\n\nTo establish persistence, Okrum installs itself as a new service named\n_[T1050](https://attack.mitre.org/techniques/T1050/)_ New Service\n```\n                       NtmSsvc.\n\n```\nOkrum establishes persistence by creating a .lnk shortcut to itself in the\n_[T1060](https://attack.mitre.org/techniques/T1060/)_ Registry Run Keys / Startup Folder\n```\n                       Startup folder.\n\n```\nThe installer component tries to achieve persistence by creating a scheduled\n_[T1053](https://attack.mitre.org/techniques/T1053/)_ Scheduled Task\ntask.\n\nOkrum establishes persistence by creating a .lnk shortcut to itself in the\n_[T1023](https://attack.mitre.org/techniques/T1023/)_ Shortcut Modification\n```\n                       Startup folder.\n\n```\n\n-----\n\nTactic ID Name Description\n\nPrivilege Okrum can impersonate a logged on user’s security context using a call to\n_[T1134](https://attack.mitre.org/techniques/T1134/)_ Access Token Manipulation\nEscalation the ImpersonateLoggedOnUser API.\n\n\nDeobfuscate/Decode Files or\n_[T1140](https://attack.mitre.org/techniques/T1140/)_\nInformation\n\n\nThe Stage 1 loader decrypts the backdoor code, embedded within the loader\nor within a legitimate PNG file. A custom XOR cipher or RC4 is used for\ndecryption.\n\n\nDefense\nEvasion\n\n\nOkrum’s backdoor deletes files after they have been successfully uploaded\n_[T1107](https://attack.mitre.org/techniques/T1107/)_ File Deletion\nto C&C servers.\n\nBefore exfiltration, Okrum’s backdoor uses hidden files to store logs and\n_[T1158](https://attack.mitre.org/techniques/T1158/)_ Hidden Files and Directories\noutputs from backdoor commands.\n\nOkrum underwent regular technical improvements to evade antivirus\n_[T1066](https://attack.mitre.org/techniques/T1066/)_ Indicator Removal from Tools\ndetection.\n\n\n_[T1036](https://attack.mitre.org/techniques/T1036/)_ Masquerading\n\n\nOkrum establishes persistence by adding a new service NtmsSvc with the\ndisplay name Removable Storage in an attempt to masquerade as a\nlegitimate Removable Storage Manager.\n\n\nOkrum's payload is encrypted and embedded within the Stage 1 loader, or\n_[T1027](https://attack.mitre.org/techniques/T1027/)_ Obfuscated Files or Information\nwithin a legitimate PNG file.\n\nThe Stage 1 loader performs several checks on the victim's machine to avoid\n_[T1497](https://attack.mitre.org/techniques/T1497/)_ Virtualization/Sandbox Evasion\nbeing emulated or executed in a sandbox.\n\nCredential [Okrum was seen using MimikatzLite and modified Quarks PwDump to](https://github.com/infosecsmith/MimikatzLite)\n_[T1003](https://attack.mitre.org/techniques/T1003/)_ Credential Dumping\nAccess perform credential dumping.\n\n_[T1083](https://attack.mitre.org/techniques/T1083/)_ File and Directory Discovery [Okrum was seen using DriveLetterView to enumerate drive information.](https://www.nirsoft.net/utils/drive_letter_view.html)\n\nOkrum collects computer name, locale information, and information about\n_[T1082](https://attack.mitre.org/techniques/T1082/)_ System Information Discovery\nthe OS and architecture.\n\n\nSystem Network Configuration\n_[T1016](https://attack.mitre.org/techniques/T1016/)_\nDiscovery\n\n\nOkrum collects network information, including host IP address, DNS and\nproxy information.\n\n\nDiscovery\n\nSystem Network Connections\n_[T1049](https://attack.mitre.org/techniques/T1049/)_ [Okrum used NetSess to discover NetBIOS sessions.](http://www.joeware.net/freetools/tools/netsess/)\nDiscovery\n\n_[T1033](https://attack.mitre.org/techniques/T1033/)_ System Owner/User Discovery Okrum collects the victim user name.\n\n_[T1124](https://attack.mitre.org/techniques/T1124/)_ System Time Discovery Okrum can obtain the date and time of the compromised system.\n\nCollection _[T1056](https://attack.mitre.org/techniques/T1056/)_ Input Capture Okrum was seen using a keylogger tool to capture keystrokes.\n\n_[T1002](https://attack.mitre.org/techniques/T1002/)_ Data Compressed Okrum was seen using a RAR archiver tool to compress data.\n\n\nExfiltration\n\nCommand\nAnd Control\n\n\n_[T1022](https://attack.mitre.org/techniques/T1022/)_ Data Encrypted Okrum uses AES encryption and base64 encoding of files before exfiltration.\n\n\n_[T1043](https://attack.mitre.org/techniques/T1043/)_ Commonly Used Port Okrum uses port 80 for C&C.\n\nOkrum identifies a proxy server if it exists and uses it to make HTTP\n_[T1090](https://attack.mitre.org/techniques/T1090/)_ Connection Proxy\nrequests.\n\n_[T1132](https://attack.mitre.org/techniques/T1132/)_ Data Encoding The communication with the C&C server is base64 encoded.\n\nThe communication with the C&C server is hidden in the Cookie and Set_[T1001](https://attack.mitre.org/techniques/T1001/)_ Data Obfuscation\n```\n                       Cookie headers of HTTP requests.\n\n```\n_[T1071](https://attack.mitre.org/techniques/T1071/)_ Standard Application Layer Protocol Okrum uses HTTP for communication with its C&C.\n\nOkrum uses AES to encrypt network traffic. The key can be hardcoded or\n_[T1032](https://attack.mitre.org/techniques/T1032/)_ Standard Cryptographic Protocol\nnegotiated with the C&C server in the registration phase.\n\n\nExfiltration Over Command and\n_[T1041](https://attack.mitre.org/techniques/T1041/)_\nControl Channel\n\n\nData exfiltration is done using the already opened channel with the C&C\nserver.\n\n\n-----\n\n### ABOUT ESET\n\n[For 30 years, ESET® has been developing industry-leading IT security software and services for](http://www.eset.com/int/)\n\nbusinesses and consumers worldwide. With solutions ranging from endpoint and mobile security,\n\nto encryption and two-factor authentication, ESET’s high-performing, easy-to-use products give\n\nconsumers and businesses the peace of mind to enjoy the full potential of their technology. ESET\n\nunobtrusively protects and monitors 24/7, updating defenses in real time to keep users safe and\n\nbusinesses running without interruption. Evolving threats require an evolving IT security company.\n\n[Backed by R&D centers worldwide, ESET becomes the first IT security company to earn 100 Virus](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)\n\n_[Bulletin VB100 awards, identifying every single “in-the-wild” malware without interruption since 2003.](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)_\n\n[For more information, visit www.eset.com or follow us on LinkedIn, Facebook and Twitter.](https://www.linkedin.com/company/28967?trk=tyah&trkInfo=tarId%3A1402921556545%2Ctas%3AESET%2Cidx%3A2-1-4)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.18.Okrum/ESET_Okrum_and_Ketrican.pdf"
    ],
    "report_names": [
        "ESET_Okrum_and_Ketrican"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0a03e7f0-2f75-4153-9c4f-c46d12d3962e",
            "created_at": "2022-10-25T15:50:23.453824Z",
            "updated_at": "2025-03-27T02:00:55.473216Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "Ke3chang",
                "APT15",
                "Vixen Panda",
                "GREF",
                "Playful Dragon",
                "RoyalAPT",
                "Nylon Typhoon"
            ],
            "source_name": "MITRE:Ke3chang",
            "tools": [
                "Okrum",
                "Systeminfo",
                "netstat",
                "spwebmember",
                "Mimikatz",
                "Tasklist",
                "MirageFox",
                "Neoichor",
                "ipconfig"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7d5531e2-0ad1-4237-beed-af009035576f",
            "created_at": "2024-05-01T02:03:07.977868Z",
            "updated_at": "2025-03-27T02:05:17.283109Z",
            "deleted_at": null,
            "main_name": "BRONZE PALACE",
            "aliases": [
                "BRONZE DAVENPORT ",
                "BRONZE IDLEWOOD ",
                "CTG-9246 ",
                "Ke3chang ",
                "Playful Dragon",
                "Vixen Panda ",
                "APT15 "
            ],
            "source_name": "Secureworks:BRONZE PALACE",
            "tools": [
                " BS2005",
                " Enfal",
                " Mirage",
                " RoyalCLI",
                " RoyalDNS",
                "BMW"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b1b76b-16da-4c4f-8b32-f6fede3eda8c",
            "created_at": "2022-10-25T16:07:23.750796Z",
            "updated_at": "2025-03-27T02:02:09.961401Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "APT 15",
                "BackdoorDiplomacy",
                "Bronze Davenport",
                "Bronze Idlewood",
                "Bronze Palace",
                "CTG-9246",
                "GREF",
                "Ke3chang",
                "Metushy",
                "Nylon Typhoon",
                "Operation Ke3chang",
                "Operation MirageFox",
                "Playful Dragon",
                "Playful Taurus",
                "Red Vulture",
                "Royal APT",
                "Social Network Team",
                "Vixen Panda"
            ],
            "source_name": "ETDA:Ke3chang",
            "tools": [
                "Agentemis",
                "Anserin",
                "BS2005",
                "BleDoor",
                "CarbonSteal",
                "Cobalt Strike",
                "CobaltStrike",
                "DarthPusher",
                "DoubleAgent",
                "EternalBlue",
                "GoldenEagle",
                "Graphican",
                "HenBox",
                "HighNoon",
                "IRAFAU",
                "Ketrican",
                "Ketrum",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MS Exchange Tool",
                "Mebroot",
                "Mimikatz",
                "MirageFox",
                "NBTscan",
                "Okrum",
                "PluginPhantom",
                "PortQry",
                "ProcDump",
                "PsList",
                "Quarian",
                "RbDoor",
                "RibDoor",
                "Royal DNS",
                "RoyalCli",
                "RoyalDNS",
                "SAMRID",
                "SMBTouch",
                "SilkBean",
                "Sinowal",
                "SpyWaller",
                "Theola",
                "TidePool",
                "Torpig",
                "Turian",
                "Winnti",
                "XSLCmd",
                "cobeacon",
                "nbtscan",
                "netcat",
                "spwebmember"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041810,
    "ts_creation_date": 1563267851,
    "ts_modification_date": 1563267854,
    "files": {
        "pdf": "https://archive.orkl.eu/358d09240838bd7382a6ee58371630ba664417f3.pdf",
        "text": "https://archive.orkl.eu/358d09240838bd7382a6ee58371630ba664417f3.txt",
        "img": "https://archive.orkl.eu/358d09240838bd7382a6ee58371630ba664417f3.jpg"
    }
}