{
    "id": "5592ebb5-9f74-4128-bd61-e352c4f6162e",
    "created_at": "2022-10-25T16:48:14.57128Z",
    "updated_at": "2025-03-27T02:06:06.582777Z",
    "deleted_at": null,
    "sha1_hash": "86b083b7b5a796325b9d99291fbece2c71bf2b70",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-03-19T03:40:59Z",
    "file_modification_date": "2018-03-19T03:40:59Z",
    "file_size": 1155972,
    "plain_text": "# therapeutic postmortem of connected medicine\n\n###### By Denis Makrushin, Yury Namestnikov on March 13, 2018. 3:00 pm\n\n##### SMART MEDICINE BREACHES ITS “FIRST DO NO HAR…\n\n_#TheSAS2017 presentation: Smart Medicine Breaches Its “First Do No_\n\n_Harm” Principle_\n\nAt last year’s Security Analyst Summit 2017 we predicted that medical\n\nnetworks would be a titbit for cybercriminals. Unfortunately, we were\n\nright. The numbers of medical data breaches and leaks are increasing.\n\nAccording to public data, this year is no exception.\n\nFor a year we have been observing how cybercriminals encrypt medical\n\ndata and demand a ransom for it. How they penetrate medical networks\n\nand exfiltrate medical information, and how they find medical data on\n\npublicly available medical resources.\n\n\n##### SMART MEDICINE BREACHES ITS “FIRST DO NO HAR\n\n\n-----\n\n_The number of medical data breaches and leaks per year (source: HIPAA_\n\n_Journal)_\n\n## Opened doors in medical networks\n\nTo find a potential entry point into medical infrastructure, we extract the\n\nIP ranges of all organizations that have the keywords “medic”, “clinic”,\n\n“hospit”, “surgery” and “healthcare” in the organization’s name, then we\n\nstart the masscan (port scanner) and parse the specialized search engines\n\n(like Shodan and Censys) for publicly available resources of these\n\norganizations.\n\n\n-----\n\n_Masscan report extract_\n\nOf course, medical perimeters contain a lot of trivial opened ports and\n\nservices: like web-server, DNS-server, mail-server etc. And you know\n\nthat’s just the tip of the iceberg. The most interesting part is the non\ntrivial ports. We left out trivial services, because as we mentioned in our\n\nprevious article those services are out of date and need to be patched. For\n\nexample, the web applications of electronic medical records that we\n\nfound on the perimeters in most cases were out of date.\n\nThe most popular ports are the tip of the iceberg. The most interesting\n\npart is the non-trivial ports.\n\n\n-----\n\n_The most popular opened ports on medical perimeters (18,723 live hosts;_\n\n_27,716 opened ports)_\n\nUsing ZTag tool and Censys, we identify what kinds of services are hidden\n\nbehind these ports. If you try to look deeper in the embedded tag you will\n\nsee different stuff: for example printers, SCADA-type systems, NAS etc.\n\n_Top services on medical network perimeters_\n\nExcluding these trivial things, we found Building Management systems\n\nthat out of date. Devices using the Niagara Fox protocol usually operate\n\non TCP ports 1911 and 4911. They allow us to gather information remotely\n\nfrom them, such as application name, Java version, host OS, time zone,\n\nlocal IP address, and software versions involved in the stack.\n\n\n-----\n\n_Example of extracted information about Niagara Fox service_\n\nOr printers that have a web interface without an authentication request.\n\nThe dashboard available online and allows you to get information about\n\n[internal Wi-Fi networks or, probably, it allows you to get info about](https://securelist.com/threats/wi-fi-glossary?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\n\ndocuments that appeared in “Job Storage” logs.\n\nShodan told us that some medical organizations have an opened port\n\n2000. It’s a smart kettle. We don’t know why, but this model of kettle is\n\nvery popular in medical organizations. And they have publicly available\n\ninformation about a vulnerability that allows a connection to the kettle to\n\nbe established using a simple pass and to extract info about the current\n\nWi-Fi connection.\n\n\n-----\n\nMedical infrastructure has a lot of medical devices, some of them\n\nportable. And devices like spirometers or blood pressure monitors\n\nsupport the MQTT protocol to communicate with other devices directly.\n\nOne of the main components of the MQTT communication – brokers (see\n\n[here for detailed information about components) are available through](https://en.wikipedia.org/wiki/MQTT)\n\nthe Internet and, as a result, we can find some medical devices online.\n\n_Not only Smart Home components, but also medical devices are available_\n\n\n-----\n\n## Threats that affect medical networks\n\nOK, now we know how they get in. But what’s next? Do they search for\n\npersonal data, or want to get some money with a ransom or maybe\n\nsomething else? Money? It’s possible… anything is possible. Let’s take a\n\nlook at some numbers that we collected during 2017.\n\nThe statistics are a bit worrying. More than 60% of medical organizations\n\nhad some kind of malware on their servers or computers. The good news\n\nis that if we count something here, it means we’ve deleted malware in the\n\nsystem.\n\n_Attacks detected in medical organizations, 2017_\n\nAnd there’s something even more interesting – organizations closely\n\nconnected to hospitals, clinics and doctors, i.e. the pharmaceutical\n\nindustry. Here we see even more attacks. The pharmaceutical industry\n\nmeans “money”, so it’s another titbit for attackers.\n\n\n-----\n\n_Attacks detected in pharmaceutical organizations, 2017_\n\nLet’s return to our patients. Where are all these attacked hospitals and\n\nclinics? Ok, here we the numbers are relative: we divided the number of\n\ndevices in medical organizations in the country with our AV by the\n\nnumber of devices where we detected malicious code. The TOP 3 were\n\nthe Philippines, Venezuela and Thailand. Japan, Saudi Arabia and Mexico\n\ntook the last three spots in the TOP 15.\n\nSo the chances of being attacked really depend on how much money the\n\ngovernment spends on cybersecurity in the public sector and the level of\n\ncybersecurity awareness.\n\n_Attacked devices in medical organizations, TOP 15 countries_\n\nIn the pharmaceutical industry we have a completely different picture.\n\nFi l b l B l d h I l d hi i d h\n\n\n-----\n\nMorocco big pharma accounts for 14% of GDP. India, too, is in the list, and\n\neven some European countries are featured.\n\n_Attacked devices in pharmaceutical organizations, TOP 15 countries_\n\nOn one in ten devices and in more than 25% of medical and 10% of\n\npharmaceutical companies we detected hacktools: pentesting tools like\n\nMimikatz, Meterpreter, tweaked remote administration kits, and so on.\n\nWhich means that either medical organizations are very mature in terms\n\nof cybersecurity and perform constant audits of their own infrastructure\n\nusing red teams and professional pentesters, or, more likely, their\n\nnetworks are infested with hackers.\n\n_Hacktools: Powerpreter, Meterpreter, Remote admin, etc._\n\n### APT\n\nOur research showed that APT actors are interested in information from\n\npharmaceutical organizations. We were able to identify victims in South\n\nEast Asia, or more precisely, in Vietnam and Bangladesh. The criminals\n\nhad targeted servers and used the infamous PlugX malware or Cobalt\n\nStrike to exfiltrate data.\n\nPlugX RAT, used by Chinese-speaking APT actors, allows criminals to\n\nperform various malicious operations on a system without the user’s\n\nknowledge or authorization, including but not limited to copying and\n\nmodifying files, logging keystrokes, stealing passwords and capturing\n\nscreenshots of user activity. PlugX, as well as Cobalt Strike, is used by\n\ncybercriminals to discreetly steal and collect sensitive or profitable\n\ninformation During our research we were unable to track the initial attack\n\n\n-----\n\nvulnerable software on servers.\n\nTaking into account the fact that hackers placed their implants on the\n\nservers of pharmaceutical companies, we can assume they are after\n\nintellectual property or business plans.\n\n## How to live with it\n\nRemove all nodes that process medical data from public\n\nPeriodically update your installed software and remove unwanted\n\napplications\n\nRefrain from connecting expensive equipment to the main LAN of\n\nyour organization\n\n[More tips at “Connected Medicine and Its Diagnosis“.](https://securelist.com/connected-medicine-and-its-diagnosis/81857/)\n\n\n[INFRASTRUCTURE](https://securelist.com/all?tag=783) [INTERNET OF THINGS](https://securelist.com/all?tag=556)\n\n\nShare post on:\n\n####   \n\n\n[SECURITY POLICIES](https://securelist.com/all?tag=220)\n\n\n### Related Posts\n\n\n###### Somebody’s watching! When cameras are more than just ‘smart’\n\n\n###### IoT hack: how to break a smart home… again\n\n\n###### Gas is too expensive? Let’s make it cheap!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.03.13.A_therapeutic_postmortem_of_connected_medicine/therapeutic_postmortem_of_connected_medicine.pdf"
    ],
    "report_names": [
        "therapeutic_postmortem_of_connected_medicine"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1521430859,
    "ts_modification_date": 1521430859,
    "files": {
        "pdf": "https://archive.orkl.eu/86b083b7b5a796325b9d99291fbece2c71bf2b70.pdf",
        "text": "https://archive.orkl.eu/86b083b7b5a796325b9d99291fbece2c71bf2b70.txt",
        "img": "https://archive.orkl.eu/86b083b7b5a796325b9d99291fbece2c71bf2b70.jpg"
    }
}