{
    "id": "5595bc28-f57c-4b68-826a-c4f8eefed97d",
    "created_at": "2023-01-12T15:08:13.815629Z",
    "updated_at": "2025-03-27T02:05:24.233562Z",
    "deleted_at": null,
    "sha1_hash": "75543434bd6a51afd29d5f46e3ee136bfd980bba",
    "title": "2021-02-01 - Urgent Security Notice- SonicWall Confirms SMA 100 Series 10. X Zero-Day Vulnerability",
    "authors": "",
    "file_creation_date": "2022-05-28T19:45:09Z",
    "file_modification_date": "2022-05-28T19:45:09Z",
    "file_size": 123035,
    "plain_text": "# Additional SMA 100 Series 10.x and 9.x Firmware Updates Required [Updated April 29, 2021, 12:30 P.M. CST]\n\n**sonicwall.com/support/product-notification/urgent-security-notice-sonicwall-confirms-sma-100-series-10-x-zero-day-**\nvulnerability-feb-1-2-p-m-cst/210122173415410/\n\n## Update: April 29, 2021, 12:30 P.M. CST\n\nSonicWall is announcing the availability of new firmware versions for both 10.x and 9.x code\non the SMA 100 series products, comprised of SMA 200, 210, 400, 410 physical appliances\nand the SMA 500v virtual appliance.\n\n**Upgrade Steps**\n\nAll organizations using SMA 10.x or SMA 9.x firmware should immediately implement the\nfollowing:\n\n[Upgrade to the latest SMA 100 series firmware available from www.mysonicwall.com.](https://www.mysonicwall.com/)\n\nSMA 100 series 10.x customers should upgrade to 10.2.0.7-34sv firmware.\n\nSMA 100 series 9.x customers should upgrade to 9.0.0.10-28sv firmware.\n\n\n-----\n\n_UPDATE: February 19, 2021, 2 P.M. CST_\n\nFollowing up on the Feb. 3 firmware update outlined below, SonicWall is announcing the\navailability of new firmware versions for both 10.x and 9.x code on the SMA 100 series\nproducts, comprised of SMA 200, 210, 400, 410 physical appliances and the SMA 500v\nvirtual appliance.\n\nSonicWall conducted additional reviews to further strengthen the code for the SMA 100\nseries product line.\n\nThe new SMA 10.2 firmware includes:\n\nCode-hardening fixes identified during an internal code audit\nRollup of customer issue fixes not included in the Feb. 3 patch\nGeneral performance enhancements\nPrevious SMA 100 series zero-day fixes posted on Feb. 3\n\nThe new 9.0 firmware includes:\n\nCode-hardening fixes identified during an internal code audit\n\n**SMA 100 Series Devices with 10.x or 9.x Firmware that Require Upgrade:**\n\n**Physical Appliances: SMA 200, SMA 210, SMA 400, SMA 410**\n**Virtual Appliances: SMA 500v (Azure, AWS, ESXi, HyperV)**\n\n**All organizations using SMA 100 series products with 10.x or 9.x firmware should apply**\nthe respective patches IMMEDIATELY.\n\nIf you already applied the SMA 10.2.0.5-29sv firmware posted on Feb 3., you still need to\n**upgrade to SMA 10.2.0.6-32sv. If you skipped the SMA 10.2.0.5-29sv firmware update from**\nFeb. 3, you only need to apply the latest SMA 10.2.0.6-32sv firmware.\n\n**Upgrade Steps**\nAll organizations using SMA 10.x or SMA 9.x firmware should immediately implement the\nfollowing:\n\n\n-----\n\n[1. Upgrade to the latest SMA 100 series firmware available from www.mysonicwall.com.](https://www.mysonicwall.com/)\n\nSMA 100 series 10.x customers should upgrade to 10.2.0.6-32sv firmware\nSMA 100 series 9.x customers should upgrade to 9.0.0.10-28sv firmware\nBoth firmware versions are available for everybody, regardless of the status of\ntheir support/service contract.\nInstructions on how to update the SMA 100 10.x or 9.x series firmware can be\nfound in [this KB article for physical appliances and](https://www.sonicwall.com/support/knowledge-base/how-to-upgrade-firmware-on-sma-100-series-appliances/170502339501169/) this KB article for virtual\ndevices.\n2. After applying the patch, reset passwords for any users who may have logged in to the\n\ndevice via the web interface. This step only applies if you did not deploy the older\n**SMA 10.2.0.5-29sv firmware update from Feb. 3.**\n3. Enable multifactor authentication (MFA) as a safety measure.\n\nMFA has an invaluable safeguard against credential theft and is a key measure of\ngood security posture.\nMFA is effective whether it is enabled on the appliance directly or on the directory\nservice in your organization.\nFor assistance enabling one-time passwords (OTP) on SMA 100, please review\nthe KB article How Can I Configure Time-Based One Time Password (TOTP) In\nSMA 100 Series?\n\n[Release notes for both firmware can be found in the downloads section of mysonicwall.com.](https://www.mysonicwall.com/)\n\n_UPDATE: February 3, 2021, 2. P.M. CST_\n\nSonicWall is announcing the availability of an SMA 100 series firmware 10.2.0.5-29sv update\nto patch a zero-day vulnerability on SMA 100 series 10.x code. All SMA 100 series users\nmust apply this patch IMMEDIATELY to avoid potential exploitation.\n\n**Affected SMA 100 Devices with 10.x Firmware that Require the Critical Patch:**\n\n**Physical Appliances: SMA 200, SMA 210, SMA 400, SMA 410**\n**Virtual Appliances: SMA 500v (Azure, AWS, ESXi, HyperV)**\n\nPlease read this notice in its entirety as it contains important details for post-upgrade steps.\n\n**Vulnerability Information**\nThe patch addresses vulnerabilities reported to SonicWall by the NCC Group on Jan. 31 and\nFeb. 2, tracked under PSIRT Advisory ID [SNWLID-2021-0001. These include an exploit to](https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2021-0001)\ngain admin credential access and a subsequent remote-code execution attack.\n\n**Upgrade Recommended Steps**\nDue to the potential credential exposure in SNWLID-2021-0001, all customers using SMA\n10.x firmware should immediately follow the following procedures:\n\n\n-----\n\n[1. Upgrade to SMA 10.2.0.5-29sv firmware, available from www.mysonicwall.com.](http://www.mysonicwall.com/)\n\nThis firmware is available for everybody, regardless of the status of their\nsupport/service contract.\nInstructions on how to update the SMA 100 10.x series firmware can be found in\nthis [KB article for physical appliances and this](https://www.sonicwall.com/support/knowledge-base/how-to-upgrade-firmware-on-sma-100-series-appliances/170502339501169/) [KB article for virtual devices.](https://www.sonicwall.com/support/knowledge-base/smb-ssl-vpn-upgrading-firmware-on-sma-500v-virtual-appliance/170502851052498/)\n2. Reset the passwords for any users who may have logged in to the device via the web\n\ninterface.\n3. Enable multifactor authentication (MFA) as a safety measure.\n\nMFA has an invaluable safeguard against credential theft and is a key measure of\ngood security posture.\n\nMFA is effective whether it is enabled on the appliance directly or on the directory\nservice in your organization.\n\n**[NOTE: SMA 500v base image downloads from www.mysonicwall.com for Hyper-V, ESXi,](http://www.mysonicwall.com/)**\nAzure, AWS will be available shortly.\n\n**Additional WAF Mitigation Method**\nCustomers unable to immediately deploy the patch can also enable the built-in Web\nApplication Firewall (WAF) feature to mitigate the vulnerability in SNWLID-2021-0001 on\nSMA 100 series 10.x devices.\n\nPlease follow the guidance in the following KB article to enable WAF functionality:\n[https://www.sonicwall.com/support/knowledge-base/210202202221923/](https://www.sonicwall.com/support/knowledge-base/210202202221923/)\n\nSonicWall is adding 60 complimentary days of WAF enablement to all registered SMA 100\nseries devices with 10.x code to enable this mitigation technique.\n\nWhile this mitigation has been found in our lab to mitigate SNWLID-2021-0001, it does *not*\nreplace the need to apply the patch in the long term and should only be used as a safety\nmeasure until the patched firmware is installed.\n\nAdditional Notes\n\nWe currently are not aware of any forensic data that can be viewed by the user to\ndetermine whether a device has been attacked. However, we will post an update as we\nget more information.\n\n\n-----\n\nVulnerable virtual SMA 100 series 10.x images have been pulled from AWS and Azure\nmarketplaces and updated images will be re-submitted as soon as possible. We expect\nthe approval process to take several weeks. In the meantime, customers in Azure and\nAWS can update via incremental updates.\nRelease notes for the firmware can be found in the downloads section of\nwww.mysonicwall.com\n\n_UPDATE: February 3, 2021, 6. A.M. CST_\n\nSonicWall engineering teams continue to finalize the SMA 100 series 10.x patch that\naddresses the zero-day vulnerability.\n\n**The new estimate for delivery is mid-day Feb. 3 (PST).**\n\nMeanwhile, as outlined below, you can enable the built-in Web Application Firewall (WAF)\nfunctionality on the SMA 100 series appliance to help protect against the vulnerability. Please\nfollow the guidance in the following KB article to enable WAF functionality on the SMA 100\nseries appliance:https://www.sonicwall.com/support/knowledge-base/security-best-practicefor-configuring-web-application-firewall/210202202221923/.\n\n_UPDATE: February 2, 2021, 11. P.M. CST_\n\nThe SMA 100 series 10.x patch announced yesterday to address the zero-day vulnerability is\nstill undergoing final testing and our new estimate for delivery is early Feb. 3 (PST).\n\nMeanwhile, we have identified an additional mitigation to remediate the attack on the SMA\n100 series 10.x firmware. The built-in Web Application Firewall (WAF) functionality has been\nobserved in our testing to neutralize the zero-day vulnerability. Please follow the guidance in\nthe following KB article to enable WAF functionality on the SMA 100 series appliance:\n[https://www.sonicwall.com/support/knowledge-base/210202202221923/](https://www.sonicwall.com/support/knowledge-base/210202202221923/)\n\nSonicWall is adding 60 complimentary days of WAF enablement to all registered SMA 100\nseries devices with 10.X code in order to enable this mitigation technique. This 60-day\nlicense will be automatically enabled within “www.MySonicWall.com” accounts of registered\nSMA 100 series devices before the end of today, Feb. 2 (PST).\n\nThe Feb. 3 patch remains the definitive solution to the zero-day vulnerability. The patch will\ninclude additional code-strengthening and should be applied immediately upon availability.\n\n_UPDATE: February 1, 2021, 2.30 P.M. CST_\n\n\n-----\n\nSonicWall has confirmed a zero-day vulnerability on SMA 100 series 10.x code. SMA 100\nfirmware prior to 10.x is unaffected by this zero-day vulnerability.\n\n[On Sunday, January 31, 2021, the NCC Group informed the SonicWall Product Security](https://www.nccgroup.com/us/)\nIncident Response Team (PSIRT) about a potential zero-day vulnerability in the SMA 100\nseries. Our engineering team confirmed their submission as a critical zero-day in the SMA\n[100 series 10.x code, and are tracking it as SNWLID-2021-0001.](https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2021-0001)\n\nSonicWall has identified the vulnerable code and is working on a patch to be available by\nend of day on February 2, 2021. This vulnerability affects both physical and virtual SMA 100\n10.x devices (SMA 200, SMA 210, SMA 400, SMA 410, SMA 500v).\n\nWhile we work to develop, test and release the patch, customers have the following options:\n\n1. If you must continue operation of the SMA 100 Series appliance until a patch is\n\navailable\n\n1. Enable MFA. This is a *CRITICAL* step until the patch is available; AND\n2. Reset user passwords for accounts that utilized the SMA 100 series with 10.X\n\nfirmware\n2. If the SMA 100 series (10.x) is behind a firewall, block all access to the SMA 100 on\n\nthe firewall;\n3. Shut down the SMA 100 series device (10.x) until a patch is available; or\n4. Load firmware version 9.x after a factory default settings reboot. *Please back up your\n\n**10.x settings***\n\n1. Important Note: Direct downgrade of Firmware 10.x to 9.x with settings intact is\n\nnot supported. You must first reboot the device with factory defaults and then\neither load a backed up 9.x configuration or reconfigure the SMA 100 from\nscratch.\n2. Ensure that you follow multifactor authentication (MFA) best practice security\n\nguidance if you choose to install 9.x.\nSonicWall firewalls and SMA 1000 series appliances, as well as all respective\nVPN clients, are unaffected and remain safe to use.\n\nSonicWall firewalls and SMA 1000 series appliances, as well as all respective VPN clients,\nare unaffected and remain safe to use.\n\n_UPDATE: January 29, 2021, 5.30 P.M. CST_\n\nAs we head into the weekend, we continue to investigate the SMA 100 Series, however the\npresence of a potential zero-day vulnerability remains unconfirmed.\n\n\n-----\n\nWe have also analyzed several reports from our customers of potentially compromised SMA\n100 series devices. In these cases, we have so far only observed the use of previously\nstolen credentials to log into the SMA devices. The SMA appliance, due to its nature and due\nto prevalence of remote work during the pandemic, effectively acts as a “canary” to raising an\nalert about inappropriate access. These specific cases came to light through, and were\nmitigated by, MFA or End Point Control (EPC). This further emphasizes the importance of\n**enabling these features, not only on the SMA series, but across the entire enterprise as a**\ngenerally recommended security practice. In the age of cloud services and remote work,\ncredentials can be the key to the kingdom and attackers are keenly aware of this.\n\nWe’re also aware of social media posts that shared either supposed proof of concept (PoC)\nexploit code utilizing the Shellshock exploit, or screenshots of allegedly compromised\ndevices. We have confirmed that the Shellshock attack has been mitigated by patches that\nwe released in 2015.  We have also tested the shared PoC code and have so far concluded\nthat it is not effective against firmware released after the 2015 patch. However, we’ll\ncontinue to closely monitor any new posts and investigate new information. This should also\nserve as a reminder to our customer base to always patch and keep current on internet\nfacing devices.\n\nA reminder to our customers: SonicWall policy has always been to release firmware with\nvulnerability patches to everyone, regardless of the support status on the device in question.\nTherefore, even if you do not have a valid support contract on your SMA 100 series device,\nor any SonicWall device, you can download firmware up to the latest vulnerability fixes on\n[www.mysonicwall.com. Please take advantage of these updates to ensure that your](http://www.mysonicwall.com/)\nequipment is up to the latest firmware.\n\nWe will continue to fully investigate this matter and share more information and guidance as\nwe have it. We will post further updates on this KB and will hopefully soon rule definitively on\nthe outcome of this investigation.\n\nWe’ve also released an updated security best practices guide for the SMA 100 series\ndevices, including instructions on how to enable MFA:\n\n[SMA 100 Series Security Best Practice Guide](https://www.sonicwall.com/techdocs/pdf/SMA-100-Series-Security-Best-Practices-Guide.pdf)\n\n_UPDATE: January 29, 2021. 7 A.M. CST._\n\nSonicWall security and engineering teams remain focused on the incident and have no\nupdates to share at this time. We fully understand the urgency of the matter and will continue\nto communicate updates in this KB article.\n\n\n-----\n\nWe re also publishing a new guide on enabling multifactor authentication (MFA) on SMA 100\nseries appliances to assist those following best practices. This will be available on our\nwebsite later today. The previous guidance outlined below also remains in effect.\n\n_UPDATE: January 27, 2021. 7 P.M. CST._\n\nWe continue to investigate the incident and have no further updates to share at this time.\nPlease continue to roll out MFA protection per best-practice guidance across your remote\nuser base.\n\nAdditionally, we continue to receive questions about older versions of NetExtender. We want\nto clarify that NetExtender 10.x and prior versions are not impacted in this incident.\n\nBest practice guidance outlined below remains in effect and has not changed.\n\n_UPDATE: January 25, 2021. 5.30 P.M. CST._\n\nSonicWall engineering teams continue their investigation into probable zero-day\nvulnerabilities with SMA 100 series products. SonicWall fully understands the urgency for\ninformation and guidance, which we’re committed to providing as we verify and confirm\ndetails. Below is updated guidance for SMA 100 series products. These steps should be\nadhered to until our next update.\n\nNOT AFFECTED\n\n**SonicWall Firewalls: All generations of SonicWall firewalls are not affected by the**\nvulnerability impacting the SMA 100 series. No action is required from customers or\npartners.\n\n**NetExtender VPN Client: While we previously communicated NetExtender 10.X as**\npotentially having a zero-day, that has now been ruled out. The client is safe to use\nwith all SonicWall products. No action is required from customers or partners.\n\n**SMA 1000 Series: This product line is not affected by this incident. Customers are safe**\nto use SMA 1000 series and their associated clients. No action is required from\ncustomers or partners.\n\n\n-----\n\n**SonicWave Access Points: No action is required from customers or partners.**\n\nREMAINS UNDER INVESTIGATION\n\n**SMA 100 Series: The SMA 100 series (SMA 200, SMA 210, SMA 400, SMA 410, SMA**\n500v) remains under investigation for a vulnerability. However, we can issue the\nfollowing guidance on deployment use cases:\n\nCurrent SMA 100 series customers may continue to safely use NetExtender for\n**remote access with the SMA 100 series. We have determined that this use case**\nis not susceptible to exploitation.\n\n**IMPORTANT: At this time, it is critical that organizations with active SMA 100 Series**\nappliances take the following action:\n\nEnable two-factor authentication (2FA) on SMA 100 series appliances\n\nPlease refer to the following knowledgebase article:\nhttps://www.sonicwall.com/support/knowledge-base/how-can-i-configure-timebased-one-time-password-totp-in-sma-100-series/180818071301745/\n\nIn addition to implementing 2FA, SMA 100 series administrators may also consider the\nfollowing to further secure access to these devices:\n\nEnable Geo-IP/botnet filtering and create a policy blocking web traffic from countries\nthat do not need to access your applications.\n\n[See page 248 of the SMA 100 Series 10.2 Administration Guide](https://www.sonicwall.com/techdocs/pdf/232-005398-00_RevA_SMA_10.2_AdministrationGuide.pdf)\nEnable and configure End Point Control (EPC) to verify a user’s device before\nestablishing a connection.\n\n[See page 207 of the SMA 100 Series 10.2 Administration Guide](https://www.sonicwall.com/techdocs/pdf/232-005398-00_RevA_SMA_10.2_AdministrationGuide.pdf)\nRestrict access to the portal by enabling Scheduled Logins/Logoffs\n\nSee page 117 of the [SMA 100 Series 10.2 Administration Guide](https://www.sonicwall.com/techdocs/pdf/232-005398-00_RevA_SMA_10.2_AdministrationGuide.pdf)\n\nPlease refer to the SonicWall issued PSIRT Advisory [SNWLID-2021-0001 for updates. As](https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2021-0001)\nwe continue to investigate the incident, we will provide further updates regarding mitigation\nor possible patches in this KB.\n\n_UPDATE: January 23, 2021, 9:30 P.M. CST._\n\nSonicWall engineering teams continued their investigation into probable zero-day\nvulnerabilities and have produced the following update regarding the impacted products:\n\nNOT AFFECTED\n\n\n-----\n\n**SonicWall Firewalls: All generations of SonicWall firewalls are not affected by the**\nvulnerability impacting the SMA 100 series (SMA 200, SMA 210, SMA 400, SMA 410,\nSMA 500v). No action is required from customers or partners.\n\n**NetExtender VPN Client: While we previously communicated NetExtender 10.X as**\npotentially having a zero-day, that has now been ruled out. It may be used with all\nSonicWall products. No action is required from customers or partners.\n\n**SMA 1000 Series: This product line is not affected by this incident. Customers are**\nsafe to use SMA 1000 series and their associated clients. No action is required from\ncustomers or partners.\n\n**SonicWall SonicWave APs: No action is required from customers or partners.**\n\nREMAINS UNDER INVESTIGATION\n\n**SMA 100 Series: This product remains under investigation for a vulnerability, however**\nwe can issue the following guidance on deployment use cases:\n\nCurrent SMA 100 Series customers may continue to use NetExtender for\n**remote access with the SMA 100 series. We have determined that this use case**\nis not susceptible to exploitation.\nWe advise SMA 100 series administrators to create specific access rules or\ndisable Virtual Office and HTTPS administrative access from the Internet while\nwe continue to investigate the vulnerability.\n\nAs we continue to investigate the incident, we will provide further updates in this KB.\n\n_UPDATE: January 22, 2021. 10:15 P.M. CST._\n\nSonicWall provides cybersecurity products, services and solutions designed to help keep\norganizations safe from increasingly sophisticated cyber threats. As the front line of cyber\ndefense, we have seen a dramatic surge in cyberattacks on governments and businesses,\nspecifically on firms that provide critical infrastructure and security controls to those\norganizations.\n\n\n-----\n\nWe believe it is extremely important to be transparent with our customers, our partners and\nthe broader cybersecurity community about the ongoing attacks on global business and\ngovernment.\n\nRecently, SonicWall identified a coordinated attack on its internal systems by highly\nsophisticated threat actors exploiting probable zero-day vulnerabilities on certain SonicWall\nsecure remote access products. The impacted products are:\n\n**NetExtender VPN client version 10.x (released in 2020) utilized to connect to SMA**\n**100 series appliances and SonicWall firewalls**\n**Secure Mobile Access (SMA) version 10.x running on SMA 200, SMA 210, SMA**\n**400, SMA 410 physical appliances and the SMA 500v virtual appliance**\n\nThe NetExtender VPN client and SMB-oriented SMA 100 series are used for providing\nemployees/users with remote access to internal resources. The SMA 1000 series is not\nsusceptible to this vulnerability and utilizes clients different from NetExtender.\n\n**IMPORTANT: Organizations with active SMA 100 Series appliances or with NetExtender**\n10.x currently have the following options:\n\nFor SMA 100 Series\n\nUse a firewall to only allow SSL-VPN connections to the SMA appliance from\nknown/whitelisted IPs\nOr configure whitelist access on the SMA directly itself\nPlease reference:\n\nhttps://www.sonicwall.com/support/knowledge-base/how-to-restrict-access-for[netextender-mobile-connect-users-based-on-policy-for-ip-](https://www.sonicwall.com/support/knowledge-base/how-to-restrict-access-for-netextender-mobile-connect-users-based-on-policy-for-ip-address/170502499350337/)\naddress/170502499350337/\n\nFor Firewalls with SSL-VPN access via NetExtender VPN Client Version 10.x\n\nDisable NetExtender access to the firewall(s) or restrict access to users and admins via\nan allow-list/whitelist for their public IPs\nPlease reference:\n\nhttps://www.sonicwall.com/support/knowledge-base/how-do-i-configure-the-sslvpn-feature-for-use-with-netextender-or-mobile-connect/170505401898786/\n\nMFA Must Be Enabled on ALL SonicWall SMA, Firewall & MySonicWall Accounts\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-01 - Urgent Security Notice- SonicWall Confirms SMA 100 Series 10. X Zero-Day Vulnerability.pdf"
    ],
    "report_names": [
        "2021-02-01 - Urgent Security Notice- SonicWall Confirms SMA 100 Series 10. X Zero-Day Vulnerability.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536093,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653767109,
    "ts_modification_date": 1653767109,
    "files": {
        "pdf": "https://archive.orkl.eu/75543434bd6a51afd29d5f46e3ee136bfd980bba.pdf",
        "text": "https://archive.orkl.eu/75543434bd6a51afd29d5f46e3ee136bfd980bba.txt",
        "img": "https://archive.orkl.eu/75543434bd6a51afd29d5f46e3ee136bfd980bba.jpg"
    }
}