{
    "id": "55da3acb-8cd3-4ffe-9c12-04921e15bf15",
    "created_at": "2023-06-05T02:07:18.322595Z",
    "updated_at": "2025-03-27T02:05:33.192703Z",
    "deleted_at": null,
    "sha1_hash": "8742d7915eb16aa125d020d657e31f1be99aa161",
    "title": "2023-04-12 - XMRig is one of the most widespread malicious miners, that exploits hardware to mine Monero",
    "authors": "",
    "file_creation_date": "2023-06-04T12:40:11Z",
    "file_modification_date": "2023-06-04T12:40:11Z",
    "file_size": 1177039,
    "plain_text": "# XMRig Malware Miner | Gridinsoft\n\n**gridinsoft.com/xmrig**\n\nUsing this site\n\nPlease ensure you understand and agree with our data protection policy before using this\nsite. [Review Policy](https://gridinsoft.com/privacy-policy)\n\n## XMRig Coin Miner\n\nApril 12, 2023\n\n_Everything is poison, and everything is medicine. XMR mining tool, that was originally_\n_designed to make mining more convenient and easy-to-deploy, became an ever-loved tool of_\n_cybercriminals that chase crypto profits. It is now known as XMRig – tremendously_\n_widespread miner trojan._\nXMRig trojan is a miner malware – one that parasites on its victim’s hardware to mine\ncryptocurrencies, particularly Monero (XMR). Being based on a legit open-source crypto\n**mining application, it applies anti-analysis and detection evasion techniques that can**\nrender legacy anti-malware software way less effective. Nonetheless, the visible effect of\nXMRig activity – overloaded processor – is hard to confuse with the one of any other\nmalware. As it targets any kind of system, the suboptimal opportunity to witness your\ncomputer rendered nearly useless may happen both at work and at home.\n\nAnother notable details XMRig can boast of is the wide variety of delivery methods it exploits\n[and pairing with numerous other malware, including ransomware and spyware. Such a](https://gridinsoft.com/ransomware)\nneighbourhood influenced the subject in a way that some of its samples can perform\n**spyware-like actions – and that is pretty useful considering its long-term activity. Since the**\nbasis for this miner is an open-source tool, XMRig probably has the biggest number of\n[siblings – other malicious miners that, however, have some alterations in their codebase.](https://gridinsoft.com/coin-miner)\n\n\n-----\n\n### KmsdBot malware combines DDoS-attacks and coin mining\n\nLearn more ->\n\n## Why do hackers choose Monero?\n\n[Cryptocurrencies based on Proof-of-Work (PoW) protocol suppose the use of computational](https://gridinsoft.com/cryptocurrency)\npower to calculate transaction hashes. Each successful operation gives the operator its\ncommission fee. Monero is among them, and it is designed to use a simplified hash,\n**which is way faster to calculate than the one used in Bitcoin or even Ethereum. This**\ndrastically reduces transaction times, and allows to perform the mining even using low**power systems, retaining enough efficiency to receive the commission. That, in turn,**\ncreates perfect conditions for cybercriminals to act: create a botnet and use its CPU power\n(instead of regular GPU-based mining farms) to mine cryptocurrencies – and observe your\nwallet getting thicker.\n\n[Darknet infrastructure created another side of convenient services, that are used by crooks](https://gridinsoft.com/darknet)\n**to hide the profits gained in such a way. So-called cryptomixers commit a transaction not**\nin an ordinary way – from one wallet to another, but via grinding the sum on dozens of\n**smaller parts, and directing it through a chain of unrelated wallets, so it is quite hard to**\ntrace the crypto transfer. XMR fits this purpose perfectly since the aforementioned fast\ntransactions allow you to finish the transfer by means of a couple of hours. Other cryptos, for\nexample, may require days to complete such a tricky transfer.\n\n## How does XMRig spread?\n\n\n-----\n\nXMRig miner is run by numerous groups of cybercriminals, and each applies their own way\nto spread this malware. Thus, there is no unified way to distribute that malware – and\nthat is even more threatening than having the one. To counteract this, it is needed to take\ninto account literally every one of them, which is sometimes beyond the capabilities.\nFortunately, some of the ways – most likely related to the most active gangs that use XMRig\n– are met way more often than others.\n\n**Dropper malware is what used to commit attacks to a network of computers which**\nwere already compromised at the time. It is particularly useful for spreading malware\ninto corporate networks, which generally have much more robust security. However,\n[botnets driven by droppers (or backdoors with dropper capabilities) are pretty often](https://gridinsoft.com/backdoor/smokeloader)\nbased on single user systems as well. In particular cases, XMRig was delivered\n**together with other malware, such as** [ransomware and spyware. However, the](https://gridinsoft.com/spyware)\nsecond way is way more convenient for spreading infection to such systems.\n**Cracked and untrustworthy software acts as a disguise for a wide variety of**\nmalware, and XMRig is just yet another example. First category obtains malicious\n[topping only after being cracked, i.e. after its licence check was disabled. Handymen](https://gridinsoft.com/crack)\nwho do this usually seek for monetisation, and deploying malware is one of the\n**possible contracts. Aside from that, using cracks is outlaw, so avoiding malware-**\nrelated risks does not make you free from legal liability for breaking the copyright law.\n**Untrustworthy software, on the other hand, is already designed to contain**\n**malicious payload. Browser plugins, driver updaters, system cleaning tools – they all**\nhave questionable functionality. Not all of the programs of these categories are\nmalevolent, but ones offered to you as a bundle, or by a bizarre ad that appeared out\n**of the blue most often match the definition. They may even have the declared**\nfunctions, but will conduct their dirty job in the background – like a malicious browser\nplugin that contains a miner.\n**Email spam is the most popular malware spreading way if you upscale from particular**\n[to general. XMRig is not an exclusion – some of its samples are delivered in that way.](https://gridinsoft.com/spam)\nMost notable thing about such a campaign is the use of a clumsy old-fashioned\n**double-extension trick that exploits the default Windows file manager settings. Files**\nlike important-document.docx.exe will look as important-document.docx in the systems\nwhere the extension displaying is disabled. Unsuspecting victim simply runs the file,\nsupposing it is a legit piece of data.\n\n## XMRig malware analysis\n\nSame as with spreading ways, the samples of XMRig are highly confused by the\n**numerous cybercrime gangs that modify it for their needs. Thus, we decided to review**\nonly some of the common features, attributed to most of the XMRig samples that circulate in\nthe wild. Overall, malicious miners have a lot of commonly used tricks that appear across this\nentire malware specimen.\n\n\n-----\n\nXMRig infection chain scheme\n\nAfter arriving at the computer, malware starts with decrypting itself and gaining\n**persistence. The decryption flow is quite usual – malware unpacker uses a hardcoded key**\nto remove RC4 encryption. Prior to that, it allocates memory via the VirtualAlloc function and\npastes the decryption result to this memory, and passes the execution to this part. The static\npart of the output is stored within the AppData\\Local\\Temp folder, usually under the name of\na system process.\n\nThe outcome of post-launch decryption is a PE file that contains the actual miner, with all\nrequired files to make malware run. It starts from gaining persistence in the attacked\nenvironment – through creating corresponding tasks in Task Scheduler, using a console\ncommand. This task commands the system to launch the miner process right after the user\nlogin.\n```\n/c schtasks /create /f /sc onlogon /rl highest /tn \"svchost\" /tr\n'\"C:\\Users\\RDhJ0CNFevzX\\AppData\\Local\\Temp\\svchost.exe\"' & exit\n\n```\n**Malware file name svchost.exe is not used consistently. It may vary from one infection**\ncase to another, snapping from repeating system processes' names to a simple row of\nnumbers.\n\nXMRig proceeds execution with contacting the command and control server in order to\nobtain configuration files. These configs are needed to guide malware about the mining\nmethod to opt for and wallet to use. It requests that info [from the command and control and,](https://gridinsoft.com/command-and-control)\ncorrespondingly to the config, changes system network properties. For that purpose it plays\nwith nslookup.exe – Windows default DNS configuration utility. Using it, malware applies the\nfollowing command:\n\n\n-----\n\n```\n cinit find x B algo rx/0  asm auto cpu memory pool 1 randomx mode auto\nrandomx-no-rdmsr --cuda-bfactor-hint=12 --cuda-bsleep-hint=100 -url=pool.hashvault.pro:80 -user=49XarhMHsp18ZAs9SiucnGHv3LcK7qChbLKquEQftqmbXayAcpYVdHr5Dy6Z7n8EKeKJzjDcms3dJfpC2\n --pass= --cpu-max-threads-hint=40 --cinit-stealthtargets=\"+iU/trnPCTLD3p+slbva5u4EYOS6bvIPemCHGQx2WRUcnFdomWh6dhl5H5KbQCjp6yCYlsFu5LR1m\n --cinit-idle-wait=5 --cinit-idle-cpu=80 --tls --cinit-stealth\n\n```\nThis step finals the preparations, and malware is now good to go. C2 communications\n**conducted by XMRig are not noteworthy – after initialisation and receiving configs, it will**\nwork with them unless C&C itself sends the command to change the settings or shut down.\nAlong with that, the malware collects some information about its host system – simply for its\nC&C to distinguish it from others.\n\n### Extension spoofing strikes Spanish-speaking countries\n\nLearn more ->\n\n## The effects of XMRig\n\nMost malware samples we used to know have an attribute of their actions in common. They\n**corrupt your files by locking them, or leaking them to the command server. XMRig,**\nhowever, is a different story. By its original design, its sole purpose is to use computation\npower of an infected PC to mine cryptocurrencies. But don’t think it is nothing to worry about\n\n\n-----\n\n– such a load is no good for your computer as well. Contrary to voluntary mining, where you\ncan manage your load, a malicious one never cares about the hardware of its host system.\n**Cybercriminals typically set a CPU load to 80%, which is not that bad for a well-designed**\nsystem. However, laptops, or poorly-maintained computers may suffer from throttling; some\ncomponents that align to the processor or its heatsink will suffer as well. Critical heat levels\nmay harm the lifespan of any electronic component.\n\nProcess that overloads CPU may be detected through opening the Task Manager\n\nBut even if we distract from pessimistic prognosis, having your computer overloaded is no\n**good. Weak systems may struggle even to respond to user inputs; more powerful computers**\nwill likely be operable, but even the simplest programs will likely have poor performance.\nFortunately, such a behaviour is quite hard to confuse with any other problem, thus\nestablishing a diagnosis is not a hard task. Living with that problem is a bad option in any\nsituation, and for that reason malware removal should be your primary task. Still, the fact that\nit overloads the system makes it t roublesome to use anti-malware software right away.\n[XMRig removal requires a specific approach that includes booting your system into Safe](https://howtofix.guide/xmrig/)\nMode with Networking.\n\n## How to protect yourself from XMRig malware?\n\nMiner malware are not that easy to deal with, as we mentioned in the previous section. Thus\nbeing ready to fix things up is less effective than avoiding such a problem at all. Such advice,\nactually, is helpful against pretty much any malware. Most proactive measures are based on\nblocking any attempts of getting malware into your system – and it is quite simple,\nconsidering that we listed the typical ways of propagating this malware.\n\n\n-----\n\n**Stop using cracking apps and untrustworthy programs. Despite email spam**\nbecoming a dominant way of malware spreading over the last couple of years, cracked\nsoftware remains a widespread infection method for hackers that aim at single users.\nEven if the source looks safe to you, and you already used it multiple times – that does\nnot guarantee your safety. Moreover, the use of unlicensed programs is illegal, and\nexposing such a fact may end up with hefty fines or even imprisonment.\n**Untrustworthy programs are pretty much the same, but most of the time they are**\npromoted to you in this or another way. “Useful” tools for system tuning, keygens or\napps that allow you to crack apps manually, and even browser plugins that offer some\nridiculous features – they are risky as well. Most anti-malware programs will mark such\nthings as potentially unwanted programs, and it is not a brilliant idea to ignore these\nwarnings.\n**Do not interact with email spam. Obviously, the amount of emails we usually receive**\neach day makes it difficult to distinguish between good and bad. Nonetheless, several\nsigns should be your red flags in identifying the spam message. Main one, which is\nimpossible to hide even in sophisticated spamming campaigns, is email addresses.\nCrooks cannot set the sender’s address as they can do with message style. Seeing\n[what looks like a genuine Amazon delivery message which is sent by [email protected]](https://gridinsoft.com/cdn-cgi/l/email-protection)\nuncovers all the fraud regardless of the actual message contents.\n**Other signs are more related to the logic of the message. Why did FedEx notify**\nyou twice about the delivery? Or why did McAfee send you a bill, if you never bought\nanything from them? Companies rarely send such things by mistake, thus most\nprobably it is spam – the one which tries to mimic your routine lettering.\nScan your system regularly with a top-quality anti-malware program. Both malware that\ncomes in plainly, and droppers that deliver other malware, may be prevented and wiped\nonly with the use of special tools. Manually, you will struggle even to find them in your\nsystem, as such things are generally trying to be as stealthy as possible. GridinSoft\nAnti-Malware will help you to detect even the most modern malware samples, and wipe\nthem out without leaving any chance for a comeback. Its advanced scanning system is\ncapable of spotting malware not only by its files, but also by its behaviour – thus\nnothing will get away.\n\n## XMRig IoC\n\n### Hashes\n\n\n-----\n\n```\nSHA256: de5704d6579398a4b51f7458c105759c46096567661a26bffe1159ef11a16eb8\n\nSHA256: ea3eedc043d02375db791cd0d508259dede55a7cffa2f75f813d4e239aa5bf70\n\nSHA256: 3c54646213638e7bd8d0538c28e414824f5eaf31faf19a40eec608179b1074f1\n\nSHA256: 32b617dd0ea32902a18d93fe74b4a8865d23ec398666736ffcb4c4e9dfa9c6ec\n\nSHA256: af421881786af65cf89b28d2a88d37658625f21f9644cf298c438267c7c92572\n\nSHA256: 05e1988f56fe199f7e401c8f4d6ee50bb26ab34fb3f96c22de959c7e5f92de77\n\nSHA256: f63921129822475dd132a116b11312ebbb0cdc8b54f188aabeb7cf7a8c9065fd\n\nSHA256: 95da91e0a3362fcfb23dd10b50dfb28af074ef11759be5cfd48854572773f989\n\nSHA256: 621a9f892436647a492e3877502454d1783dc0cf4e4ba9f3f459a8c2ac7e6d97\n\nSHA256: f34fc824a6c655bd6320b7818acdad9a5a570b88dd46507fdf73cd254af9b19f\n\nMD5: 5906ac14bc45a1f39cb9eb790a1d3b27\n\nMD5: 0252b6575abd58fac21130cd75fc42a0\n\nMD5: 2a0d26b8b02bb2d17994d2a9a38d61db\n\nMD5: 52df19b9845a6da6197831525c7a1f01\n\nMD5: 5807efef92e20ffe074bbdc141cfbdad\n\nMD5: 6a292b8ab3ff79cefe5f8e42882885d2\n\nMD5: 22a9265676ffebc71d888f0c57af9fd1\n\nMD5: 47d02cfb4cdbccccbc35d082f5351dd1\n\nMD5: e5e85cc9c86ad7362efc2255612db5c0\n\nMD5: 96c45411bcda48997ead1d0dd2aff484\n\n### IP addresses\n\n```\n145.14.144.136:443 94.130.165.85:443 142.93.172.227:1389\n\n68.183.165.105:80 62.102.148.152:8618 159.89.182.117\n\n51.250.28.5 150.60.139.51:80 51.250.28.5\n\n150.60.139.51 68.183.165.105 79.134.225.39:6969\n\nProtect yourself against miner virus with Gridinsoft Antimalware, the best malware remover\navailable. Regain control of your privacy with a miner virus scanner, detector, and remover\nthat's ultra-fast and refreshingly lightweight — and 100% effective.\n[Download malware remover](https://gridinsoft.com/download/antimalware)\n\n\n-----\n\n### Clipminer - a Million Dollar Clipboard Hijacking Coinminer\n\nLearn more ->\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-12 - XMRig is one of the most widespread malicious miners, that exploits hardware to mine Monero.pdf"
    ],
    "report_names": [
        "2023-04-12 - XMRig is one of the most widespread malicious miners, that exploits hardware to mine Monero.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1685930838,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1685882411,
    "ts_modification_date": 1685882411,
    "files": {
        "pdf": "https://archive.orkl.eu/8742d7915eb16aa125d020d657e31f1be99aa161.pdf",
        "text": "https://archive.orkl.eu/8742d7915eb16aa125d020d657e31f1be99aa161.txt",
        "img": "https://archive.orkl.eu/8742d7915eb16aa125d020d657e31f1be99aa161.jpg"
    }
}