{
    "id": "560b8a3f-193a-4382-83c9-23d509273984",
    "created_at": "2023-01-12T15:07:15.914991Z",
    "updated_at": "2025-03-27T02:16:26.116853Z",
    "deleted_at": null,
    "sha1_hash": "4c9e814e9e7ad86812ff99b8f80b45408a48bbde",
    "title": "2020-07-15 - Inside REvil Extortionist “Machine”- Predictive Insights",
    "authors": "",
    "file_creation_date": "2022-05-27T21:40:20Z",
    "file_modification_date": "2022-05-27T21:40:20Z",
    "file_size": 1196152,
    "plain_text": "# Inside REvil Extortionist “Machine”: Predictive Insights\n\n**[advanced-intel.com/post/inside-revil-extortionist-machine-predictive-insights](https://www.advanced-intel.com/post/inside-revil-extortionist-machine-predictive-insights)**\n\nAdvIntel July 15, 2020\n\nJul 15, 2020\n\n14 min read\n\n**Takeaways**\n\nCybercrime groups often operate on traditional crime group behavioral patterns.\n\n\n-----\n\nREvil main collective group patterns are: seeking for attention, aggression motivated by\nimpunity, overconfidence, and rigid group identity\n\nREvil behavioral patterns have likely directly triggered and impacted their recent\nattacks against high-profile entities\n\nREvil operations against famous and politically engaged public entities and\npersonalities will likely become their syndicate’s main focus\n\n**Introduction**\n\nThe REvil Group is one of the most prominent Russian-speaking ransomware groups in the\ncyber domain. In May, it made headlines for extorting numerous high-profile clients of the\nNew York City-based entertainment and media law firm Grubman Shire Meiselas and Sacks,\nas well as the California-based IP law firm Vierra Magen Marcus. The threats had impactful\npolitical implications as these firms represent high profile clients, such as President Donald\nTrump and the United States Navy, respectively. After attempting to threaten President\nDonald Trump with a $42 million USD extortion, the group was even branded as a terrorist\n[organization.](https://www.forbes.com/sites/daveywinder/2020/05/17/hackers-publish-first-169-trump-dirty-laundry-emails-after-being-branded-cyber-terrorists/#5aeb5485268c)\n\nNaturally, the attacks and the subsequent political response has changed REvil’s place in the\ncybercrime ecosystem. On one hand, the group is now more well-known than it has ever\nbeen. On the other hand, the Russian-speaking cybercrime community - a foundation is\ndemonstrating explicit resentment to the syndicate’s actions. This resentment could lead\nREvil to lose its foundation within the community - a foundation that is existentially important\nto an organized cybercrime group.\n\nRecent events can shed light on essential aspects underlying REvil's operations - their\ncollective identities and psychological patterns that define them as a criminal enterprise. The\nway that REvil communicates, operates and builds relationships is determined by the\npsychological and organizational motives of its members, their perception of hierarchy, selfidentification, and their relationship with the community.\n\nWe have investigated REvil’s discourse and behavior by applying the methodologies and\nconcepts of criminal psychology to identify the group’s unique characteristics revealed by\ntheir recent involvement in large, ethically questionable (attacks against medical institutions),\n\n\n-----\n\nand politically impactful extortions. By applying these methodologies, we attempt to achieve\na deeper understanding of the group’s actions in order to successfully predict and prevent its\noperations.\n\n_The Breach of Trust: Extorting the Extortionist_\n\nOn April 15, 2020, on the XSS forum, which serves as one of the main grounds for\ncommunity relationships across the Russian speaking underground, an actor “Vivalamuerte”\nclaimed that they have information on UNKN, the leader of the REvil group. This event, most\nlikely preceded by a month of private negotiations, was the first major conflict between REvil\nand members of the Russian-specking community - a major breach of trusted relationships.\n\nVivalamuerte threatened to reveal information about UNKN identity unless paid $190,000\nUSD. “Vivalamuerte” claims this is the amount that REvil’s leader owes them as this sum\nwas invested in UNKN’s original cryptolocker creation efforts in 2016. To make matters worse\nfor UNKN and their team, prior to this extortion, UNKN has lost over 150,000 USD in a\ntransaction operated by the Exploit forum administrators - another significant trust breach.\n\nTwo weeks later, on April 27, 2020, an Exploit forum user EXPL0 asked in broken Russian if\nthere was room in the REvil Group ransomware program. REvil denied the request due to\nEXPL0’s non-Russian background. However, a couple of weeks later on May 13, 2020,\nUNKN shared that there had been a breach and disclosure of authentication data and\nblamed it on EXPL0 who was integrated into the syndicate by one of UNKN’s Russian\nspeaking affiliates.\n\n\n-----\n\n_Image 1: Vivalamuerte has not only treated REvil leader and their family but questioned the_\n_group’s position in the hierarchy by openly challenging their reputation_\n\nThis deterioration of relationships between REvil and the cyber community correlated with\nthe group’s attack becoming more aggressive, outrageous, and unethical. For instance, on\nMarch 13, 2020, - when the private negotiations with “Vivalamuerte” extortionists were likely\ntaking place, REvil hacked a biotechnology company, 10x Genomics, despite the COVID-19\npandemics and possible healthcare ramifications from the attack. On May 14, 2020, REvil\nhacked entertainment and media law firm Grubman Shire Meiselas and Sacks in order to\nextort high profile clients, such as Madonna, Bruce Springsteen, and Donald Trump. Then,\non May 29, REvil continued the pattern of targeting high-profile law firms, hacking IP law firm\nVierra Magen Marcus.\n\nIt is likely that these events are connected. The team threatened by the “Vivalamuerte” attack\non their anonymity aggravated by the EXPL0 case and was taking actions defined by a\nthreat-driven mindset. REvil may have resorted to extorting top-tier companies and\nindividuals in order to obtain a higher payload and ensure that Vivalamuerte does not expose\nUNKN. The group may have been uniquely motivated to pursue highly visible targets in the\nhopes of obtaining higher payouts. But the connection between this extortion and REvil\nrecent aggressive behavior is likely even deeper - defined by collective and individual\npsychology - specifically matters of overconfidence, feelings of impunity, and identity\nformation.\n\n_Attention, Impunity, Confidence_\n\n\n-----\n\n_Image 2: REvil’s criminal behavior patterns_\n\nREvil posts on forums are provocative, extravagant, and flamboyant. This may suggest this\nteam is not only seeking financial profits, but also attention. This may be a style of doing\nbusiness and a psychological phenomenon.\n\nAccording to Vivalamuerte, UNKN has changed its nickname on the forum four times and\nworks very hard to avoid detection. As a young man from Minsk with a troubled background,\nthey most likely entered the cybercrime enterprise because of being financially troubled\nwithout any other financial options to turn to. If Vivalamuerte’s allegations are true it is\n\n\n-----\n\nrewarding for UNKN to be able to attract worldwide attention and be recognized in a criminal\nbusiness enterprise. They most likely did not have a supportive family and can now receive\nrecognition and notoriety for their chaotic behaviors.\n\nThis motivation is not solely egotistical and emotional. On the operational level, the fact that\nREvil receives a large amount of media attention from international headlines describing their\nrenowned tools and techniques helps the group to establish a dominating place within the\ncommunity. As a Ransomware-as-a-Service, group REvil uses its fame to its advantage in\norder to attract and recruit talented affiliates. When recruiting affiliates, they use fame as a\ntool of self-legitimization. The group spokesman stated: “You can read about us in the media.\n_An envelope with 6 zeros is an ordinary and daily business for us.”_\n\nAnother essential factor shaping REvil’s motivations and behavior is a feeling of impunity.\nWhile seeking profits and attention the group made the headlines, yet faced little to no\npunishment. The group has been caught, moreover, their predecessor, a ransomware\nsyndicate - GandCrab, publicly bragged that they are living proof that one can steal without\ngetting caught. Considering that UNKN may have joined cybercrime as a last resort to\nbecome rich and famous (According to Vivalamuerte) and considering the connection\nbetween the two groups REvil may be looking at GandCrab as a role model, and as an\nexample of a successful ransomware collective that made billions and resigned unpunished.\n\nThe overt impunity also has an operational benefit, as just as publicity, it helps to bring\ntalents to the group - a fundamental requirement for a successful RaaS enterprise. It is\nprobable that REvil is aware that by receiving recognition for pulling off intelligent operations\nwithout getting caught they can recruit more capable members into their syndicate.\n\nAs such, REvil is not held accountable for its actions, receives widespread international\nattention for their cunning and malicious activities and feels good about their technological\nprowess. All of these processes feed into building up the organization's ego and convince\nthem that due to their anonymity and skill, they will not be held accountable for their actions\nin the future.\n\nThe combination of attention-seeking and impunity leads to REvil’s overconfidence. This can\nbe seen in the way REvil challenged the community’s ethics and principles, the arrogance\nand contempt with which the REvil representatives talk to other hackers and ransomware\n\n\n-----\n\ndevelopers, and, finally, the way the group traits their victims. This overconfidence may be\nthe reason why the group is so hard to negotiate and so aggressive in their ways. But the\nsame overconfidence became the group’s major vulnerability.\n\n_Collective Identities_\n\nHowever, before we review how psychological patterns of UNKN and other leaders\ndetermined their recent behavior, one other aspect would be investigated - the group identity.\n\nREvil is first and foremost an organized crime collective and its group identity presents a\nunique case across the organized crime. A recent solid trend in cybercrime psychology is for\npreviously ethnically homogenous crime groups that did not accept others have to begin to\naccept individuals from different backgrounds, so they may contribute highly desirable scarce\nresources and skills.\n\nIn 2019, groups started to operate across domains and cultural lines as long as the payload\ncould be ensured to be secured. The trend is especially visible with cybercrime. In contrast to\ntraditional organized crime that requires deep trust with strong ties and familiar connections,\ncybercrime necessitates the formation of flexible networks and partnerships, forming a thin\ntrust.\n\nFor instance, across Eastern European cybercrime, Russian-speakers may prefer to work\nwith other Russian-speakers due to increased feelings of belongingness, preferences for\nethnic behaviors and practices, shared cultural traditions, history, and values. But they will\n[still establish multicultural and multiracial syndicates. An illustrative example was the FXMSP](https://www.advanced-intel.com/post/top-tier-russian-hacking-collective-claims-breaches-of-three-major-anti-virus-companies)\ngroup which bragged about having American and Chinese team members.\n\nHowever, REvil is an exception. The group clearly says that it will never work with nonRussian speakers. REvil’s perceptions of, and attitudes toward, English-speakers members\nultimately develop from their need to identify with and belong to their own group that they\nperceive to be superior, as a means of enhancing their level of self-esteem. REvil perceives\nits group members and other trustworthy Russian-speaking actors to be similar to\nthemselves and shows preference in their attitudes and behaviors toward them.\n\n\n-----\n\n_Image 3: REvil decided to reshape their RaaS policies based on tightening identity-based_\n_selection_\n\nHowever, English-speakers are perceived to be dissimilar and possess less favorable\nqualities, and therefore they can justifiably be discriminated against. Though Englishspeakers are lauded on the forums for making deals more secure by asking for as many\nproofs as possible during deals, some stigmatize them for being difficult to make deals with.\n\nThis ethnic-based mentality and ethnic foundation for boundary formation had also misled\nthe group leaders. Just as overconfidence and impunity, this extreme psychological pattern\ncreated new vulnerabilities for the group. As it often happens with collectives driven by\ndistrust to the “Collective Other”, REvil had hindered their critical thinking and began blaming\nsystemic vulnerabilities of their model on precedes against non-Russian speakers.\n\n_Confidence, Community, Consequences_\n\n\n-----\n\n_Image 4: REvil’s latest activities were preceded by several important conflicts between the_\n_group and the members of the cybercrime community_\n\nAn Eastern European ransomware collective is first and foremost a community body. As a\ndecentralized structure, RaaS relies heavily on its talent recruitment. RaaS presumes the\nnecessity to keep a good relationship with the community. Recruitment of new affiliates,\ncooperation with individual experts on intrusion, the infrastructure of publishing websites for\nblackmailing - all this requires a solid foundation in the cybercrime community. Maintaining a\nconsistent reputational profile is, therefore, a necessity. When REvil members that bragged\nabout their success and power got themselves attacked, their entire foundation became\nvulnerable.\n\n\n-----\n\nThe extravagant public profile turned REvil into a lucrative goal for other criminals.\n“Vivalamuerte” clearly understood that reputation is as important for UNKN as their technical\nskills. The extortion of REvil had a direct and traumatic impact on the group’s selfidentification. REvil relies on the acquisition of loyal, talented affiliates. They must keep a\nreputable name in the forums in order to attract the right types of partners.\n\nA threat of deanonymization simultaneously hit the three aspects of REvil’s collective\npsychology mentioned above - attention-seeking, impunity, and overconfidence. With their\nidentity exposed, UNKN would find the attention they brought to themselves in a recent year\nworking against them. There would be no impunity without anonymity, and, of course, the\nimage of an overconfident gang leader would be destroyed if the information of their\npersonality is available for everyone.\n\nUNKN and their team had to rapidly find a response to this triple threat aimed at the very\ncenter of their collective psyche. As a result, they initiated a range of operations all aimed to\nbring back their reputational standing but resulting in even further complications of their case.\n\n_A Spiral of Chaos_\n\n\n-----\n\nBy Spring 2020, one of the largest and most formidable ransomware syndicates was in a\nvery pecunious condition. First, they face a deanonymization threat. Their attempt to call for\neven more media attention now backfired and compromised the group’s impunity. Then, a\nRussian-Speaking member of the syndicate accepts EXPL0 who ends up compromising the\ngroup’s domains. Apparently - the identity-based model of partnerships proves itself\ninefficient.\n\nFrom a criminal psychology standpoint, REvil may have been willing to take overly confident\nactions if they were really being extorted by Vivalamuerte and desired to protect their\nanonymity at all costs. In order to extract a large payout, they were willing to act in more\nchaotic ways, bluffing to have information on the U.S. President in order to extort a large\nfinancial sum for information regarding Trump.\n\n_Image 5: An emphasis on publicity practiced by the group created an opposite reaction in the_\n_cyber underground itself_\n\nA high-profile attack reaching headlines beyond regional media and social networks is a\nperfect solution. REvil goes high and attempts to blackmail the U.S. President. Even though\nthis sounds like a movie plot, the plan works, but the consequences are imminent.\n\nAt this point REvil’s goals are simple - to restore the image of overconfident top-dog, trusted\nand respected by the community - the main source of power that a RaaS syndicate has.\n\nIndeed, REvil reached the global headlines, but the attack backfired. The group was being\nbranded as a terrorist organization by the Trump Administration which, among other things,\nmade ransom payment impossible. Previously fame and notoriety helped REvil to gain\n\n\n-----\n\nprofits. Their desire for attention and enrichment was working for hand by hand. But now, the\ntwo motives were contradicting one another.\n\nThe blunder was easy to avoid as the consequences of an attack against President Trump\nwere quite predictable. The United States has branded smaller, less threatening (from a\nstandpoint of the US national security) groups, with much less of an impact as terrorists. A\ncouple of weeks before REvil’s extortion attempt, the Russian Imperialist Movement, a minor\nwhite supremacy group already collapsing from the crackdown from Russian security forces,\nwas branded as a foreign terrorist organization by the US. The Russian-speaking media\nextensively covered the event, accusing the US of overreaching. However, REvil ignored\nthese signs and targeted one of the most influential people in the world attempting to extort\nthe United States President for $42 million USD without proof of actually possessing\ninformation about him.\n\nWhile not being paid, UNKN and its team attempted to utilize at least one aspect of the\nnotorious extortion - popularity, and attention. They posted information regarding the\nGrubman Shire Meiselas & Sacks on the underground forums.\n\nHowever, again, the attempt led to the opposite effect. Instead of getting more respect and\nsupport, REvil faced a backlash. Due to the nature of forum users’ activities, many wish to\nkeep a low profile and are uncomfortable with the amount of negative attention that REvil\ndraws to the forums by targeting Trump. In this sense, REvil's overall desire for attention\nworked against them, since the community prefers silence.\n\nAn already damaged image of an omnipotent cyber syndicate, which was suddenly itself\nblackmailed, received a second blow, as the community started to mock REvil and openly\nironize about their audacious threats. Moreover, REvil was called out for bluffing to have\ninformation about Trump. As a result, the posts were quickly deleted from forums, but the\nattempts to restore reputation continued as the group quickly shifted to announcing they\nwould be auctioning off celebrity client data obtained from GSMS, beginning with Madonna.\n\nExaggerating is not wise for building trust and legitimacy in this enterprise because those\nbuying the information will only purchase it if REvil’s track record is legitimate. Moreover,\nREvil could have predicted the reaction of the community. By the way, the community\n\n\n-----\n\nreacted to REvils bragging about attacks against medical corporations in the midst of the\nCOVID-19 [Pandemic.](https://www.advanced-intel.com/post/darkweb-insights-the-digital-thief-war-how-covid-19-pandemic-triggered-a-generational-conflict)\n\nOn March 13, 2020, REvil stole one terabyte of data from 10x Genomics, a California-based\nbiotechnological company, researching drugs to treat COVID-19. Following this ransomware\nattack, the REvil group published 10X Genomics company documents containing sensitive\ninformation about more than 1,200 employees. Some users on XSS did not agree with\nREvil’s actions, declaring that biotechnology companies should be permitted to focus on cure\nresearch so that everyone may be in good health. One user said “this act was like spitting in\nthe well from which one drinks. The faster humanity overcomes this infection, the faster the\neconomy will recover which will lead to bigger earnings for us.”\n\n_Image 6: For some older members of the Russian speaking underground, the hacker ethics_\n_is an important rule affecting their code of conduct_\n\nAt the same time, REvil in response to the EXPL0 case were reshifting its business model,\nby reducing the number of affiliates and calling to ban English language users. Following the\nEXPL0 breach in May, REvil removed all English adverts dealing with English speakers and\nrequired a guaranteed advert for admission into their program. However, the EXPLO0 case\noccurred not because of EXPL0’s identity, but because the RaaS model is itself vulnerable to\nsuch breaches. REvil does not highlight that the RaaS system itself is at fault and opts to\nscapegoat English-speaking users for the downfalls instead - another sign of irrational and\nchaotic behavior.\n\nHowever, these braggings and exaggerations, chaotic behavior can be explained if we take\nthe psychological and social components. It is critical for the crime syndicates to be\nrespected and supported, as they are consistently forming new partnerships on the forums.\nMoreover, REvil leveraged fear through publicity by targeting A-listers. Standard personal\ninformation is valuable but sensitive celebrity information is even more valuable. These\ndeeply impactful crimes get into the minds of their victims because celebrities and\n\n\n-----\n\ncompanies alike know that if they do not pay that someone else will in an auction. REvil\nworked its way to the top of the hierarchy by weaponizing their superior tactics, techniques,\nand technology on the most public of figures.\n\nThis breach of trust by the community - the threat of losing anonymity triggered REvil to think\nwith more of a threat mindset which is essentially different from strategic management in\nwhich the group operated previously. REvil was more motivated to commit a high-profile\nattack to restore the group’s reputation after the Vivalamuerte extortion, to keep recruiting\ntalented members, and to increase the likelihood of a payout because other celebrities and\ncompanies will be scared of the group since they are so popular and never caught. However\n\n- high-profile attacks exacerbated the relationships with the community. As was the case with\nthe EXPL0 case breach, the clash between organizational and identity approaches leads to\npoor mitigation.\n\nBy making each new attempt to improve their case, REvil only exacerbated the conflicts and\ncontradictions which led to their troubles in the first place.\n\n_What Can We Learn?_\n\nSocio-cultural forces play an important role in the genesis and sustainability of organized\ncybercrime groups. Identity comprises motivators that direct criminal activities such as\nemotions, beliefs, and attitudes. REvil achieves a sense of self-consistency by manifesting\ntheir identity with their criminal behaviors, such as victimizing high-level targets,\naccumulating technological prowess, and not allowing English speakers to work with them.\nCollaborative ties require trust and mitigation of uncertainties as trust is a mechanism for\npeople to cope with risk and uncertainty in interactions with others.\n\nIn cybercriminal computer-mediated communications trust is more than just a mental aspect.\nWhen REvil cooperates with someone on a forum, there is always a possibility that person is\neither a fellow cybercriminal, a dishonest trader, a researcher, or a law enforcement\nassociate. Uncertainty is treated as a cost to the enterprise as a breach of trust can severely\nimpair their sophisticated business model. Bonding capital in crime is usually manifested\nthrough strong interpersonal relationships with close friends or family. The next best thing to\ndevelop trust is to possess the same ethnicity and values. In cybercrime, lacking non-verbal\nand social context cues, trust becomes a valuable and scarce resource. This is why REvil\n\n\n-----\n\nrelies on having a shared ethnic background as well as two reputation-based systems that\nmitigate uncertainty: reviewed vendors and escrow services - this group depends on a\ncollective community trust to operate.\n\nA breach of trust, on the other hand, reverts the entire environment upside down. REvil are\nunique in their approach as they are loud, extravagant, ethnically explicit, and invest in\ndecentralization practices. They use this extravagance to extort ransom and obtain respect.\nYet, when their relationships with they can not trust the community and the community do not\ntrust them, the same psychological and behavioral patterns that enable them to be creative\nand unique make them more prone to being caught, more vulnerable psychologically, and\nmore chaotic in mitigating crisis.\n\nREvil is most certainly far from collapsing, but the recent complications with the public and\nwith the criminal community have revealed some important trends. REvil’s operations just as\ntheir predecessor GandCrab were heavily based on the exploitation of fears, pride, and\nvanity. These groups need attention to prosper. But if such syndicates receive too much\nnegative attention from targeting authoritative figures such as the U.S. President, or making\ntoo much noise in the community, they may have to effortfully retire or rebrand again.\nApparently, this was what happened with GandCrab, and this is the paradox of attention,\nembedded in the fabric of these gang’s operations.\n\nSeeing as how UNKN has changed his name 4 times in the past and GandCrab changed\ntheir practices after receiving too much fame, it is likely that REvil will only succeed with this\nname for so long before having to make significant changes to their name, identity, and code.\nREvil can only work for so long attacking such well-known targets. Trust, professionalism,\nand technological proficiency are more important to REvil now than ever. This organization is\nrunning on limited time if they have already rebranded once with some of the same people\nand some of the same code. The same story can repeat.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-15 - Inside REvil Extortionist “Machine”- Predictive Insights.pdf"
    ],
    "report_names": [
        "2020-07-15 - Inside REvil Extortionist “Machine”- Predictive Insights.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "312b7781-5501-4c1e-a9d5-9b75e9ad8455",
            "created_at": "2022-10-25T16:07:24.488292Z",
            "updated_at": "2025-03-27T02:02:10.251188Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [
                "ATK 134",
                "TAG-CR17"
            ],
            "source_name": "ETDA:Fxmsp",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab5dc2a3-16dc-421e-af45-d60c8b4aafac",
            "created_at": "2023-01-06T13:46:39.012588Z",
            "updated_at": "2025-03-27T02:00:02.977037Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [],
            "source_name": "MISPGALAXY:Fxmsp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536035,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653687620,
    "ts_modification_date": 1653687620,
    "files": {
        "pdf": "https://archive.orkl.eu/4c9e814e9e7ad86812ff99b8f80b45408a48bbde.pdf",
        "text": "https://archive.orkl.eu/4c9e814e9e7ad86812ff99b8f80b45408a48bbde.txt",
        "img": "https://archive.orkl.eu/4c9e814e9e7ad86812ff99b8f80b45408a48bbde.jpg"
    }
}