{
    "id": "565d25b6-55d6-43fc-b667-41d8b640b3df",
    "created_at": "2022-10-25T16:48:16.518498Z",
    "updated_at": "2025-03-27T02:11:22.871344Z",
    "deleted_at": null,
    "sha1_hash": "f28dddbac9868c3c238372a09bbdb95606de8f11",
    "title": "",
    "authors": "",
    "file_creation_date": "2013-12-05T08:06:27Z",
    "file_modification_date": "2013-12-05T08:06:38Z",
    "file_size": 3010070,
    "plain_text": "# Did you say\n Advanced Persistent Threats?\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nHere we analyze four targeted attack tools with Taiwan and Vietnam\nin their sights - but somehow linked together - and the reason why\nthey shouldn't be called ‘advanced’.\n\nFigure 1: Targeted entities were located in Vietnam and Taiwan\n\nOnce in a while we get to spend time analyzing malicious code that is\nnot as widespread or not as well-obfuscated as other threats we've\nencountered in the past. This article is about one such threat. We\ndecided to spend some time on this analysis because of interesting\nstrings in one of the components referring to Vietnam’s Central Post\nand Telecommunications Department. But before we delve into\nthe topic lets first highlight some of the findings:\n\n - Entities in Taiwan and the Vietnam government are targeted\n\n - Observed attacker interaction\n\n - Evidence of an unidentified APT actor\n\n\n\n - Social engineering vector (no exploit code) with very credible\n\ndocuments\n\n - Bad criminals: typos in configuration, naive cryptographic\n\nimplementation, weak code practices\n\n - Sophistication variability: from no obfuscation to hidden position\n\nindependent code, XOR encryption, XTEA encryption, stand-alone\nre-usable components\n\n - Tailored infections: one threat doesn't persist, the other doesn't\n\ndo anything before a reboot\n\nFigure 2: Analyzed threats\n\nYou can see in the above figure all the malware samples that this\narticle will cover. the file received by the victim is always the dropper\nwhich we will cover shortly. Since they were carrying two different\nthreats the dropper hashes are not the same but their functionality\nis equivalent: therefore it is summarized as a single threat and\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nconsidered a re-usable component in the attacker’s arsenal. We have\ninvestigated two ‘dropped’ threats, namely Agent.NJK and Terminator\nRAT – which also carries an embedded binary.\n\n### Good ol’ social engineering\n\n\nFigure 3: Appearance of the files\n\n\nAs we noticed from our telemetry data, the malicious software\nreaches its target through spear-phishing campaigns. the first\ndropper we analyzed came from the webmail interface of\na Vietnamese governmental institution. Using targeted emails\nallows more chance of succeeding in the attack by using a more\npersonalized and convincing message. It also narrows the distribution\nof the malicious files, giving them a longer shelf life since there is\nless chance of their being found and analyzed by Anti-Virus (AV)\ncompanies.\n\nWith knowledge of the characteristics of the first dropper, we were\nable to find a related piece of malware in our collection. As mentioned\npreviously, they were carrying different threats but also had\na different filenames\n\nThreat File name Translation\n\n```\ndef xor _ decrypt(ciphertext, key):\n  \u0007for i in range\n  (len(ciphertext)):\n    c = ciphertext[i]\n    if c:\n     if \u0007c != 0xff:\n\n       c ^= key\n     if \u0007(c and c != 0xff):\n\n       ciphertext[i] = c\n  return ciphertext\n\n```\n\nthat the file is a normal Word document, the executable displays\nthe icon of a Word document.\n\nUpon execution these droppers will decrypt their configuration\nparameters using a simple one-byte key XOR-based cipher best\ndescribed with some python code below. This configuration is stored\nin the last 32 bytes of the last portable executable (PE) segment\nof the executable. Inside this configuration is a checksum, some\noffsets and lengths of internal resources along with other seemingly\nunused fields, as you will see in the struct pictured below. a hardcoded integer in the code is compared with the checksum in order\nto validate that configuration decryption worked. This checksum is\n\n```\nstruct hidden _ segment _ data\n{\n  int checksum;\n  char delimiter;\n  char unused[3];\n  int pe _ file _ offset;\n  int pe _ file _ size;\n  char unused[4];\n  int doc _ file _ offset;\n  int doc _ file _ size;\n  char xorkey;\n  char unused[2];\n  char last;\n};\n\n```\n\nWin32/TrojanProxy.Agent.NJK Bao cao ket qua.doc\n\n[137 spaces].exe\n\n\nVietnamese for\n\"report the results\"\n\n\nTerminator RAT\n(Win32/Protux.NAR)\n\n\n檢驗報告.exe Chinese for\n\"inspection report\"\n\n\nThe presence of all those spaces is used to push the \".exe\" off\nthe screen and out of sight of the victim. To further convince the user\n\n\nListing 1: XOR-based cipher Listing 2: Hidden configuration\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nthe same in both cases. the offset and length pairs are used to extract\nfiles from inside itself into the filesystem.\n\nThe dropper first drops the main malicious binary and then a Word\ndocument into the user's temporary folder. Both files are decrypted\nusing the same simple XOR technique except that the malicious\nbinary is prefixed with 5 bytes that are hard-coded in the dropper (MZ\nheader), and then XOR'ed with another hardcoded one-byte key. We\nbelieve this is done to avoid being detected by some AV.\n\nFirst, after the extraction, the malicious binary will be executed by\nthe dropper. the behavior of the analyzed binaries will be covered\nlater. the dropper will then copy itself using a handle retrieved\nwith GetModuleHandle. It will execute this fresh copy with some\ncommand line arguments in order to clean up after itself: namely,\nthe current full path and filename of the dropper and the full path and\nfilename of the dropped Word document. Finally, it will exit.\n\nFor example this is what ends up being run:\n```\nC:\\Documents and settings\\user\\Local Settings\\\nTemp\\~hCb37.tmp\\\n \"C:\\Documents and settings\\user\\Downloads\\Bao cao ket\n qua.doc[137 spaces].exe\"\\\n\n \"C:\\Documents and settings\\user\\Local Settings\\\n Temp\\~hC29f.doc\"\n\n```\nListing 3: Dropper executes the above\n\n\nNature of the file Filename\n\nMalicious payload %TEMP%\\~hCb58.tmp\n\nWord document %TEMP%\\~hC29f.doc\n\nCopy of itself %TEMP%\\~hCb37.tmp\n\nTable 1: Dropped files\n\nThis same copy of the dropper, once executed with command-line\narguments, has a different operation. It will first sleep for one second,\nleaving enough time for the original dropper execution to terminate.\nThen it will remove this original file and copy the decoy document\n(~hC29f.doc) in its place, keeping the proper .doc extension. Finally,\na ShellExecuteW with the open operation is run on the newly\ncopied document in order to open the proper editor registered for this\nfile type.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nAll this work is done to effectively simulate the result one would\nexpect when double clicking on an innocuous Word document except\nthat in this case malicious code was executed first.\n\n\nFigure 5: Vietnam decoy document\n\n\nFigure 6: Taiwan decoy document\n\nThe combination of the spear-phishing, hiding the file's extension,\na work-related file name and a Microsoft Word style icon can be\npretty convincing for a user who had no proper security awareness\ntraining or without proper desktop hardening and protection against\nexecutables sent by email. the use of these simple techniques is well\ndocumented inside Mandiant's APT1 report. Notice that no software\nvulnerabilities are exploited by criminals in order to get their malware\nto run.\n\nIn the dropper there are two different techniques used to hide calls:\na function that essentially re-implements GetProcAddress called\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nwith hardcoded plaintext strings, and legitimate GetProcAddress\ncalls but using an obfuscated lpProcName (XOR 0x17 of every other\ntwo chars). Interestingly, most of the calls are not obfuscated. Again,\nit feels like iterative AV evasion hard at work.\n\nAside from the fact that it seems easy to re-purpose, the dropper\ndoesn't strike us as a particularly well written piece of code. There are\nnotorious anti-patterns present in the codebase like a God object and\nsome copy-and-paste programming (although to be fair this could be\nthe result of compiler optimization).\n\nFigure 7: Vietnam document metadata Figure 8: Taiwan document metadata\n\n\n### Win32/TrojanProxy.Agent.NJK\n\nThe first dropped binary that we analyzed is what our engine detects\nas Win32/TrojanProxy.Agent.NJK. This is a Visual C++ trojan that\ncommunicates over HTTP with hard-coded Command and Control (C&C)\nservers. In the sample we analyzed, the three servers supported by\nthe trojan configuration were in fact pointing to the same domain\nname vietnam.vnptnet.info, but using different ports (80, 443 and\n5050).\n\nThe malware will adjust its TCP timeout for HTTP requests to 15\nminutes and then loop forever trying to contact the C&C domain via\nthe three ports in configuration. an interesting fact about this threat\nis its lack of persistence, meaning that it will be executed only once\nand will not be relaunched if the system reboots. There is no obvious\nattempt at obfuscation and simply running strings on the binary\nreveals a great deal about the sample and its capabilities.\n\nIn its attempt to contact the C&C the malware will send several pieces\nof information about the host in a GET request and use a specific\nUser-Agent string. the user data is in a 105 bytes array, encoded in\nhexadecimal and sent in the path component of the GET request.\nIt contains information such as: a string we believe is used to track\nattack campaigns; the internal IP address of the host; the Computer\nName; a Windows Version ID; and the current username executing\nthe process. No encryption is applied to this data. Below is the exact\nformat of this payload.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nThe C&C commands are sent unencrypted and are always 796 bytes\nlong. the first Integer in the command data is the command ID.\nthe supported commands are:\n\nCommand id Command description\n\n1000 The command-line is executed by the victim and\nstdout and stderr are sent back to the C&C\n\n2000 The victim replies \"\\r\\n\\r\\nRecieve KeepAlive\nCommond\\r\\n\\r\\n\" (including the typos...)\n\n3004 Download a file to the victim's computer.\nFilename is specified in the command data.\n\n\nFigure 9: Initial payload sent by the client\n\nOnce encoded requests look like the one below:\n```\nGET /4350542D4E4D43000000000000000000000000000000000031393\n\n22E3136382E3136362E31343500555345522D3938394243313335353500\n\n0000000000000000000000000000000107757365720000000000000000\n\n0000000000000000000000000000000000000000 HTTP/1.1\n\n\n```\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows\n```\nNT 5.0; .NET CLR 1.1.9527)\n\nHost: vietnam.vnptnet.info\n\n```\nListing 4: Sample HTTP GET Request\n\nThe server will reply with conventional HTTP server headers except\nthat it adds an Accept header field with the value \"x-wav/y-img\"\n(something seen before). the trojan will not process the server's answer\nunless this string is present in that header. Note that Accept headers\nare usually part of the client HTTP request and not server responses\n\n\n3005 Upload a file to the C&C. an offset argument can\nbe specified so as to upload only a part of the file.\n\n3006 Change the current directory to the one specified\nin the command data.\n\n3007 Set the time (in ms) for the WaitForSingleObject\nfunction of a command line execution (command\nid 1000)\n\n3008 Sends to C&C information about the drives' total\nsize, free space, letters and names.\n\n3009 Lists the files in a specified directory. Filename,\nlast modification date and sizes are sent.\n\n3010 Delete a given file by name\n\n3011 Spawn a process with the command-line given in\ncommand data. Nothing sent back to C&C.\n\nTable 2: Agent.NJK supported commands\n\n\nFigure 9: Initial payload sent by the client\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nVery simple, nothing fancy, and the code doesn't reveal much about\nthe attacker’s intentions. Unfortunately, all that is left to the trojan\noperator so we can't draw any conclusions about the operation with\nonly the malware sample to work from. Rather than being simply\nnaive, this is rather stealthy. But then again, some funky strings are\nalso present in the binary like \"I want to go to the GREAT WALL, inner\nMongolia very much\" and some unused proxy credentials (somnuek.\nbu / 044253516). These proxy credentials are not referred to anywhere\nin the code which leads us to think that this is a feature supported by\nthe malware that was compiled out when this threat was assembled\nfor this campaign.\n\nThe hardcoded campaign string (CPT-NMC) sent by the client\nfurther confirms the targeted nature of the attack. CPT stands for\nCentral Post and Telecommunications Department, a department\n_of the Vietnamese government. We can also notice that the top-level_\ndomain used for C&C (vnptnet.info) is strikingly similar to Vietnam's\nvnpt.vn which is Vietnam Posts and Telecommunications Group\nand probably chosen as a means of camouflage within Intrusion\nDetection System (IDS) logs. Finally, the decoy document writes\nabout telecoms and testing and carries some network diagrams,\nwhich all seems very credible to a potential victim. Looks like this\ncampaign was aimed at Vietnam's CPT and we know Vietnam's officials\n_have been under targeted attack this year._\n\n### We're up all night to get lucky\n\nWe saw an operator interact with a system we infected and\nmonitored. We even got some evidence of manual operation. Here\n\n\nare the highlights of the interaction that we have observed on\nthe system.\n```\n1. client <\n  command id/name: 3008/Get Drives Infos\n  client ->\n  \u0007label: C:\n\n   type: 3 (DEVICE _ FIXED)\n\n   free: 7828\n\n   total: 10228\n  \u0007label: D:(8\n\n   type: 5 (DEVICE _ CDROM)\n\n   free: 0\n\n   total: 589\n2. client <\n  \u0007command id/name: 1000/ExecuteCommandLine executed:\n   netsta -ano\n  client ->\n\n```\n\u0007'netsta' is not recognized as an internal or\n\nexternal command, operable program or batch file.\n```\n3. client <\n  \u0007command id/name: 1000/ExecuteCommandLine executed:\n   netstat -ano\n  client ->\n\n  ...\n\n```\n\n-----\n\n## Did you say Advanced Persistent Threats?\n```\nand then other commands:\n4. set\n\n5. dir C:\\DOCUME~1\\user\\recent /od\n\n6. dir C:\\DOCUME~1\\user\\desktop\n\n7. dir c:\\\nand then it stopped\n\n```\nListing 5: Agent.NJK attacker interactions\n\nThese are all reconnaissance operations: netstat to view current\nnetwork interactions, drive enumeration, set to view the current\nenvironment variables and then some file locations were explored.\nSomething that leads us to think that this operation is not automated\nis the typo highlighted at interaction (2) a behavior we’ve seen\n_before. netsta was written instead of netstat, leading to the 'not_\nrecognized' error sent to the server. We see no good reason to\nfake such an operator error and this is why we think we caught\na legitimate typo. Here is a screen capture of some of the content of\nthe interactions that was left out of the above highlights. As you can\nsee, all this information is sent in plain text over the network.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nIn the above screenshot we notice that the server replied with the full\nHTTP headers in the packet highlighted by (1) and with a ContentLength of 796 bytes just like any C&C commands. However, the server\ndoesn't send these bytes in that packet, so the client hangs waiting\nfor those bytes to come in. After a 30 minute delay the server just\nsent a TCP reset (RST) to close the connection. the client was never\nallowed again onto the server, getting instantaneous TCP resets for\nany connection attempts on any of the three ports configured as you\ncan see in the screenshot below.\n\nFigure 12: No response, various ports retried (80, 443, 5050)\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nThis is another behavior that reveals a little bit more information\nabout the way they operate. Once the victim computer is flagged as\nnot of interest to the operators, it is actively blocked from the C&C at\nthe TCP layer rather than at the application layer (HTTP).\n\nThe non-persistence characteristic of the attack strengthens\nthe hypothesis that it is targeted since the attackers will leave little\ntrace and little network activity if they don't install an additional\ncomponent through the trojan. a typical attack scenario with this\ntool would then be: figure out potential victims in an organization;\nsend spear-phishing emails; wait; get connections from the trojan;\nand quickly and interactively investigate the computers for\nthe sensitive data you are looking for. If the data isn't there pull\nthe plug, and if it is there install an additional component through\nthe commands for file download (3004) and file execution(3011).\n\nWithout full incident investigation forensics, which we are not in\na position to perform, being an AV vendor rather than an incident\nresponse team, there is little we can do to help victims of this threat\nknow what happened on their systems except to document how it\nworks and hope that this information will be useful.\n\n\n### Terminator RAT (aka FAKEM RAT)\n\nWhen we started analyzing this threat, our product detected it as\nWin32/Protux.NAR. When we reverse engineered the cryptographic\nprotocol of the network communication with the C&C we found out\nthat the threat was documented by malware.lu and Trend Micro as\nTerminator RAT or FAKEM RAT, but that our sample diverged a lot\nfrom the one they analyzed, and carried an additional binary. Last\nmonth, FireEye released an analysis of a sample very similar to this one but\nthe hashes are still different. In this article, we will focus on giving\nadditional details of the threat and we encourage you to refer to these\npast articles for further background information.\n\nWe first found out that what we called Win32/Protux.NAR was\nin fact the Terminator RAT when we looked at the network\nencryption and stumbled on malware.lu’s report titled APT1: technical\n_backstage. Although their reference to the APT1 group is challenged_\n_by the community, we definitely have here a private Trojan that has_\nbeen re-used on several campaigns by the same group. Compared\nwith the Agent.NJK trojan, here the sophistication level is cranked up\none notch. First, the configuration and strings are encrypted using\na slightly modified implementation of XTEA. XTEA uses a 128 bit key\nand work on 64 bit blocks.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nThe implementation is naive since it uses the worst block cipher mode\n_of operation as you will see in the screenshots below. 64 bit blocks of_\nzeros always\n\nFigure 14: Sample ciphertext at 0x404198 with obvious patterns\n\nFigure 15: Plaintext at 0x404198 after decryption\n\nWith proper use of block chaining figure 14 wouldn’t have carried any\ndiscernable pattern. Here’s the configuration of our sample before\ndecryption:\n\nFigure 16:\nConfiguration\nand strings\nbefore decryption\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\n(1) is the XTEA key, (2) shows two ports (9000, 9090) and some\nother unencrypted material we couldn't figure out, (3) shows more\nunencrypted strings related to the way the malware operates but\nwith null bytes injected in them (the strings are re-assembled before\nbeing used in the code).\n\n\n(1) is the folder where the malware is installed (in %APPDATA%), (2)\nmarks the filenames given to the copied and extracted files, (3) shows\nthe C&C's domain name, (4) is the name of the PE image resource\ndirectory entry where further payloads are hidden (an executable\nfile and position independent code) and (5) shows the registry keys\nmodified for persistence.\n\nNext, it will load and install in memory the offsets to some functions\nthat are not declared in the PE import table. To do so they reimplemented an equivalent of GetProcAddress just like they did\nin the TrojanProxy.Agent.NJK threat. However this time the original\ndll and function name strings are neither encrypted nor obfuscated\nand the offsets are installed in fixed memory locations in the data\nsegment so they are easy to cross-reference for further analysis of\nthe threat. They could have made the job harder but they didn't.\n\nOn its first run, there is no networked malicious behavior. It will\ncreate a thread that will change the path of the Startup Folder in\nregistry (to %APP _ DATA%\\2019), copy the existing files from the old\nStartup Folder to the new one, move itself with the MOVEFILE _\n```\nDELAY _ UNTIL _ REBOOT flag to the new Startup Folder under\n\n```\nthe name \"svchost .exe\", decrypt and extract a PE from within itself in\nthe Startup Folder with the name \"winslogon.ini\" (which we will refer\nto as the proxy tunnel component), do a move with the MOVEFILE _\n```\nDELAY _ UNTIL _ REBOOT flag to rename it to \"winslogon.exe\" and\n\n```\nthen quit. This is summarized below:\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nAs you can see, there is also code to handle failure in the Startup\nFolder registry changes. the fallbackPersist call will copy itself to\nthe current Startup Folder with the name wuauclt.exe and then exit.\nDepending on the location of that folder this will either delay another\nattempt at modifying the registry on the next reboot - until someone\nwith proper privileges to change this registry settings logs in - or it\nwill trigger the main payload which we will describe shortly.\n\n### Always moving\n\nAs you saw this threat relies heavily on the MOVEFILE _ DELAY _\n```\n                                      UNTIL _ REBOOT flag of the MoveFile() function. This serves as\n\n```\na simple way to relocate the malware executable even if the file is\ncurrently executing. It may also prevent triggering heuristics and\nsandbox technologies. That said, those delayed moves don't stop\nthere. On each subsequent execution of the binary a little evasion\nmaneuver is performed. First, it will copy itself into a temporary\nlocation (GetTempPath() + \"~7ti2\"). Then, a random number of\nrandom bytes are appended to the end of the file. Lastly, a move\nwith the MOVEFILE _ DELAY _ UNTIL _ REBOOT and MOVEFILE _\n```\n                                      REPLACE _ EXISTING flags will be performed to replace the currently\n\n```\nrunning binary on reboot. This implies that the hash will change on\nevery reboot without affecting proper operation.\n\nAll of which can be visually represented by the following diagram:\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nand strings and thread creation as on its first run, but then the thread\ntakes a separate branch based on the fact that it is run from a folder\nwhich contains the \"App\" string. In that branch it will first sleep for 5\nminutes and then will perform the copy/move operation described\nearlier, and then reach its main payload.\n\nThat payload will allocate memory, copy the PE image resource\ndirectory entry with id 0x8A under the ACCELORATOR resource\ndirectory into this newly allocated memory, and apply an XOR with\na single byte key (0x32) to encrypt it. This last encryption operation\nseems strange since it could have already been pre-encrypted that\nway in the resource entry, but this wasn't done for reasons still\nunknown to us.\n\nAs a side note, ACCELORATOR appears to be a clever typo of\nACCELERATOR, a term used to describe keystrokes defined in\napplications and usually stored in PE resources.\n\n\nFigure 19: Terminator's evasion maneuver\n\n### Main payload\n\nAfter a reboot, when Windows runs every executable in the Startup\nFolder, the two binaries \"svchost .exe\" (the main component) and\nwinslogon.exe (the proxy tunnel component) will be executed.\nthe main component performs the same decryption of configuration\n\n\nThis allocated memory is actually executable code. We will refer\nto this as position-independent code from this point on. a few\nmore things happen before moving into this newly extracted code\nsegment: resolve the current host's IP, XOR encrypt and copy that IP\nand a hardcoded port 8000 at specific offsets in that code (you will\nunderstand why later) and then add some 32 bytes of XOR'ed random.\nAll XOR operations are performed with the same 0x32 single byte key.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nThe position-independent code makes some unconventional use of\nthe registers so this leads us to believe that this was written directly\nin assembly language. First, the memory segment itself will be XOR\ndecrypted with a single byte key (0x32). Then it will load the addresses\nfor all the functions it will use later. It does so by re-implementing\n```\n                                      LoadLibrary and GetProcAddress. However instead of loading\n\n```\nthe function names as strings, it uses a table of pre-computed ROR\nhashes for each function. the code regenerates the hash for each\nfunction in the DLL and when they match, the hash is replaced by\nthe function's address in the table. This technique is quite common\nand has been documented before. On the other side, the library name is\nstored as a string.\n\nFi P i i i d d d l di d i\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nThe code then creates an Event named 'sxX5{c4' with\nthe CreateEvent function and uses it as a mutex to ensure that\nonly one copy of itself will execute at any one time. Now, moving on\nto the main payload, we reach a loop on all C&Cs in its config. Two\nof these are hardcoded and are the same as the one in the XTEA\nencrypted config, as mentioned earlier. the third is the one injected\nearlier which points to the host's current IP and hardcoded port\n8000 (as explained later). It will loop forever on all three and will\nsleep 30 seconds if it can't connect. Upon a successful connection,\nthe malware will send information about the client to the C&C in\na 1024 byte packet. the format is pictured below.\n\nFigure 23: Position independent code loading and execution\n\nThe header is made up of the random data that was previously copied\nin from the main component with every two bytes padded with\nthe same pattern. Username and Computer name are strings 128\n\n\nbytes long and the system's codepage is included as an integer. There\nare also some hardcoded integers: two integers of value 0x130, 0x0\n(1) and an integer of value 0x30005 (2). Both of these are identical to\nthose observed by FireEye. There is also some string value that could\nbe the campaign ID (3). Unlike the other unknown values this one is\nnot embedded in the code but in the configuration, and there is some\nattempt at obfuscating the access to the variable, which in our case\nwas the string \"wet\". the rest of the packet is empty (bytes 321 to 1024)\nexcept for the last byte where there is a newline character (\"\\n\").\n\nFigure 24: Position independent code loading and execution\n\nThe communications are encrypted using a simple scheme: each byte\nof the plaintext is XOR'ed with every character in the key and then\nrotated to the right by 3 (ROR'ed) after each XOR operation. the key\nis static and is \"YHCRA\" (\"ARCHY\" backwards). This is easier to explain\nwith code:\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n```\ndef encrypt(pt):\n\n   key = \"ARCHY\"[::-1]\n\n   ct = \"\"\n\n   for c in pt:\n\n     p = ord(c)\n\n     for k in key:\n\n       p = p ^ ord(k)\n\n       p = ror(p, 3)\n\n     ct += chr(p)\n\n   return ct\n\n```\nListing 6: Terminator network encryption\n\nOnce decrypted, the server traffic contains a command ID in the first\ninteger of the 1024 byte payload returned. Well described by Trend\nMicro, the commands supported by this RAT are the following:\n\nCommand id Command description\n\n0x211 Execute code attached in command data\n\n0x212 Reconnect to receive data\n\n0x213 Sleep, close socket and reconnect\n\n0x214 Exit\n\nTable 3: Terminator supported commands\n\nAs you can see, these are again very generic, meaning that\nthe malware's true goals and capabilities are hidden when doing\nstatic analysis. However Trend Micro was able to observe attackers\nand documented some of the code that attackers sent in their 0x211\n\n\ncommands. Command prompt, file manager, host information,\nprocess management, registry management, screen captures, service\nmanagement, password stealing, and file upload, were all capabilities\nthat they observed.\n\nEven though we had a very similar threat to hand the C&C domains\nextracted from configuration were slightly different.\n\nDomain IP Port\n\n\"catlovers.25u.com\" (1) doesn't resolve 9000\n\ndryboxs.4dq.com 123.51.208.142 9090\n\nlocalhost depends (2) 8000\n\nThe first domain configured (1) contains a space before the nullbyte string terminator which means that the DNS resolver is\nunable to resolve it. It is thus never used by the malware. As we\nsaid earlier, the third domain is looked up using gethostname and\n```\ngethostbyname (2) and then copied into the position independent\n\n```\ncode before it is launched. 25u.com and 4dq.com are both operated\nby the changeip.com dynamic DNS service operated in the US. IP\n123.51.208.142 is Taiwan based.\n\nHere's a table that highlights the differences observed between\nthe various observed campaigns:\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\nTrend Micro’s analysis FireEye’s analysis ESET’s analysis\n\nActivity Since 2009 June 2013 June 2013\n\nCampaign undisclosed zjz1020 wet\n\n\nDistribution Word or Excel documents with exploit\ncode\n\n\nWord or Excel documents with exploit\ncode\n\n\nSocial engineering\n\n\nInstallation Registry Run entry Modified Startup Folder Modified Startup Folder\n\nXTEA key None used 0x3c78… 0x9ac9…\n\nNetwork traffic Fake header in first 32 bytes Repeated pattern in first 32 bytes Random bytes with padding intermixed\nin the first 32 bytes\n\n\nProxy tunnel No mention of this component Stand-alone component for exfiltration\nthrough corporate proxy\n\n\nStand-alone component for exfiltration\nthrough corporate proxy\n\n\nProxy filename None sss.exe winlogon.ini then winnlogon.exe\n\n\nC&C - vcvcvcvc.dyndns.org\n\n             - zjhao.dtdns.net\n\n             - avira.suroot.com\n\n            - *.googmail.com\n\n             - *.yourturbe.org\n\n             - freeavg.sytes.net\n\n\n\n- liumingzhen.zapto.org\n\n- liumingzhen.myftp.org\n\n- catlovers.25u.com\n\n- localhost port 8000\n\n\n\n- \u0007\"catlovers.25u.com[space]\" port 9000\n\n(broken)\n\n- dryboxs.4dq.com port 9090\n\n- localhost port 8000 (see proxy tunnel)\n\n\nIPs Varied 123.51.208.69 123.51.208.142 (same /24)\n\nDDNS Provider DynDNS, DtDNS, noip.com noip.com changeip.com\n\nTable 4: Summary of the differences in the campaign\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n### Summary of similarities\n\n- Same network encryption algorithm (\"ARCHY\"[::-1] xor/ror3)\n\n- Same 1024 byte network payload\n\n- Same commands (0x211, etc.)\n\n- Most C&C rely on dynamic DNS\n\n- Operated from the same /24 network owned by a Taiwanese ISP\n\nThis threat lacks a coherent design and seems to be iteratively\nmodified to accomplish the attackers’ agenda on the fly. the presence\nof 3 different encryption mechanisms and two different techniques\nto load function addresses tends to justify this assumption.\nFurthermore, using XTEA encryption for the C&C information while\nalso showing them in plaintext in the position independent code\nseems like a mistake. Finally some functions are awkwardly patched\nto add features like the encryption / decryption functions shown\nbelow. an on / off (1) flag is used to determine if the function is calling\nthe XTEA encryption (2) or some XOR with a fixed one byte key (3)\nreminding software engineers of the coding-by-exception anti-pattern.\n\nFigure 25: Strange cryptographic code paths\n\nHaving various analyses on the same threat is interesting because\nwe can see what gets re-purposed when a campaign changes. In\nthe current Terminator RAT case we can see that both malware\ncomponents and infrastructure components were altered. XTEA keys,\nnetwork protocol headers, and the dropped proxy tunnel component\nfilename were changed in the binary itself while DDNS providers\nand IP addresses were changed on the infrastructure side. It’s also\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\ninteresting to see that the use of ACCELORATOR name as the hidden\nPE resource or the network protocol encryption key are things that\nhaven't changed between campaigns. What conclusions can be\ndrawn from this observation is an exercise left to the reader.\n\n### Proxy tunnel component\n\nAgain, comprehensively described by FireEye as sss.exe, this component\nis present for the eventualities where the target's network doesn't\nallow an outgoing network connection to reach the C&C servers\ndirectly. In a nutshell, it binds to the local port 8000 and will tunnel\nthrough anything that connects to it via the legitimate proxy\nconfigured on the computer. It uses the HTTP CONNECT verb to get\nan end-to-end tunnel up to the C&C.\n\nIn our investigation, the file was named winslogon.exe and had\na different hash, solely because the configuration (and maybe\nthe code) was different. We also noticed the presence of an encrypted\nlog file (hardcoded to %TEMP%\\~DF3bbs.tmp) which can be decrypted\nwith a single byte key XOR (0xAB) as shown by the code below.\n```\nkey = 0xAB\nct = open(\"logfile\", \"rb\").read()\n\npt = \"\".join([chr(ord(e) ^ key) for e in ct])\n\nprint pt\n\n```\nListing 7: Decrypt proxy tunnel component logs\n\nIt uses an Event Object named with the non-printable character\nrepresented by 0x13 to ensure that only one instance of the proxy is\n\n\nrunning. Additionally, as with the Terminator / FakeM RAT threat,\nthe binary will perform a little dance meaning that on each execution\nit will copy itself into a temporary location (GetTempPath() + \"~7ti3\"),\nappend a random number of random bytes to the end of the file,\nthen add the XTEA encrypted configuration. Lastly, a move with\nthe MOVEFILE _ DELAY _ UNTIL _ REBOOT and MOVEFILE _\n```\nREPLACE _ EXISTING flags will be performed to replace the currently\n\n```\nrunning binary. So the hash of the file will change but behavior and\nfunctionality stays intact. Finally, we observed a different location for\nthe stored proxy configuration than the one FireEye reported. In our\ncase it was stored in %Windir%\\Proxy.\n\nThe addition of this component as a stand-alone to augment\nTerminator RAT's exfiltration capabilities is very interesting as it could\nbe easily re-used. Additionally, a loosely coupled component with no\nmalicious behavior (although suspicious) packaged with a RAT whose\nmalicious payload is well hidden in position-independent shellcode\nsupporting very generic commands, makes the static analysis of\nthe threat quite difficult and leaves everything to the imagination\nabout what it is that the attackers are after.\n\n### There is no a in this APT\n\nIndeed, none of these threats were packed to thwart reverseengineering, no exploit code was used and there were several\nobservations of poor software development and operational\npractices: sloppy coding, bad cryptography, operator errors, leakage\nof unused proxy credentials and even mistakes in configuration that\nrendered a C&C domain completely useless. This is not ‘advanced’.\n\n\n-----\n\n## Did you say Advanced Persistent Threats?\n\n\nHowever, as long as these less sophisticated attacks are still\nsuccessful they will continue, because they are obviously cheaper to\nperform than the more complex ones.\n\nWe can see two [A]PT strains at work here. One with no a where\nwe have low-complexity low-cost attacks where manual operators\nare thrown at several targeted campaigns, using simple malware\nmodified just enough to avoid detection. Then, on the other hand,\ngroups seem to exist that truly deserve the a epithet – A-teams, you\nmight say. (Note that we avoided the cyberwar kind of APT.)\n\nSo, before issuing your press-release about getting popped by an APT\ngroup, at least make sure that you are not simply overly exposed to\nsimplistic B-list attacks. User awareness training and locked-down\ngroup policies incorporating the filtering of executables in emails\nwould have mitigated or prevented the threats described in this post.\nIs your company at least taking these steps?\n\nAuthor: Olivier Bilodeau\nContributors: Mathieu Lavoie, Marc-Etienne M. Léveillé\n\n\nWin32/TrojanDropper.Small.NNK\n\n- \u000758e1dfa7ace03a408d2b20c1fab6e127acbdc71f492366622cd52064844\n\n43ed7\n\n- \u00073f58a0ea8958c5bf88aa9cfcefe457393f0a96bba9f05f301ba6a15b65d\n\n5b64a\n\nWin32/TrojanProxy.Agent.NJK\n\n- 54c5517541187165fd9720dfe8cff67498d912d189d649cc652d8b113bae\n8802\n\nWin32/Protux.NAR (Terminator RAT)\n\n- \u0007425a919cb5803ce8fabb316f5e1be611f88f5c3813fffd2b40f2369eb70\n\n74da9\n\nWin32/Protux.NAR (Terminator RAT) embedded proxy tunnel\ncomponent\n\n- \u0007Ba6cc9fbcb3d806fefb4d0f2f6d1c04b81316593dfe926b4477ca841ac17\n\n354e2\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2014/01/Advanced-Persistent-Threats.pdf"
    ],
    "report_names": [
        "Advanced-Persistent-Threats.pdf"
    ],
    "threat_actors": [
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041482,
    "ts_creation_date": 1386230787,
    "ts_modification_date": 1386230798,
    "files": {
        "pdf": "https://archive.orkl.eu/f28dddbac9868c3c238372a09bbdb95606de8f11.pdf",
        "text": "https://archive.orkl.eu/f28dddbac9868c3c238372a09bbdb95606de8f11.txt",
        "img": "https://archive.orkl.eu/f28dddbac9868c3c238372a09bbdb95606de8f11.jpg"
    }
}