{
    "id": "569b9141-896b-4d11-a61d-3f616b844a01",
    "created_at": "2022-10-25T16:48:22.201738Z",
    "updated_at": "2025-03-27T02:17:11.272727Z",
    "deleted_at": null,
    "sha1_hash": "66d8ff8facc9e84340fbe97755c524faafa8c854",
    "title": "Threat Horizons - Intel Paper - Nov 2021",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 3088071,
    "plain_text": "# Threat Horizons\n\n## Cloud Threat Intelligence November 2021. Issue 1\n\n\n-----\n\n### Providing threat intelligence to those in the Cloud\n\nPart of offering a secure cloud computing platform is providing cloud users with cybersecurity threat\nintelligence so they can better configure their environments and defenses in manners most specific to\ntheir needs. Google's Cybersecurity Action Team is pleased to publish the first issue of Threat Horizons\nreport. The report is based on threat intelligence observations from the Threat Analysis Group (TAG),\nGoogle Cloud Threat Intelligence for Chronicle, Trust and Safety, and other internal teams. It provides\nactionable intelligence that enables organizations to ensure their cloud environments are best\nprotected against ever evolving threats. In this and future threat intelligence reports, Google will\nprovide threat horizon scanning, trend tracking, and Early Warning announcements about emerging\nthreats requiring immediate action.\n\n### ___\n\n Summary of Observations\n\nWhile cloud customers continue to face a variety of threats across applications and infrastructure,\nmany successful attacks are due to poor hygiene and a lack of basic control implementation. Most\nrecently, our team has responded to cryptocurrency mining abuse, phishing campaigns, and\nransomware. Given these specific observations and general threats, organizations that put emphasis\non secure implementation, monitoring and ongoing assurance will be more successful in mitigating\nthese threats or at the very least reduce their overall impact.\n\nSpear-phishing and phishing campaigns are not new to the threat landscape; TAG observed recent\nattacks that targeted Gmail accounts and impersonated employment recruiters with the goal of\nstealing user credentials. Attackers also continue to exploit poorly configured Cloud instances with the\ngoal of obtaining profit through cryptocurrency mining and traffic pumping. The universe of\nransomware also continues to expand with the discovery of some new ransomware that appears to be\noffshoots of existing malware with mixed capabilities.\n```\n01 02 03 04 05 06\n\n```\n\n**Compromised**\n**Google Cloud**\n**instances used**\n**for crypto-**\n**currency mining**\n\n\n**Russia group**\n**launched**\n**Gmail**\n**phishing**\n**campaign**\n\n\n**Fraudsters**\n**employ new**\n**TTP to abuse**\n**Cloud**\n**resources**\n\n\n**North Korea**\n**actors**\n**impersonate**\n**employment**\n**recruiters**\n\n\n**Black Matter**\n**ransomware**\n**rises out of**\n**DarkSide**\n\n\n**Lessons**\n**Learned**\n\n\nSome poorly\nconfigured GCP\ninstances are\ncompromised\nquickly and used\nfor cryptocurrency\nmining and other\nmalicious activity.\n\n\nAttackers, who\ntypically\ntargeted Yahoo!\nusers, launched\na campaign\nagainst Gmail\naccounts.\n\n\nFraudsters sought\nto abuse Cloud\nresources to\ngenerate traffic to\nYouTube.\n\n\nAttackers\nimpersonated\nemployment\nrecruiters in an\nattempt to steal\ncredentials.\n\n\nBlack Matter\nransomware\nfound to be\nformidable;\nhowever, it does\nnot exfiltrate\ndata.\n\n\nAs Google Cloud\npartners with its\ncustomers in a\nshared fate\nsecurity model,\nsome valuable\ntrends and\nlessonslearned emerge.\n\n\n##### For more information visit gcat google com\n\n\n-----\n\nWhile a variety of threats exist, there are a number of ways to mitigate them as well, which includes\n[Container Analysis](https://cloud.google.com/container-analysis/docs) [to perform vulnerability scanning and metadata storage for containers and the Web](https://cloud.google.com/security-command-center/docs/concepts-web-security-scanner-overview)\n[Security Scanner](https://cloud.google.com/security-command-center/docs/concepts-web-security-scanner-overview) [in the Security Command Center to identify security vulnerabilities. Additionally,](https://cloud.google.com/security-command-center)\nGoogle Cloud customers should [employ two-factor authentication, enroll in the](https://www.google.com/landing/2step/) [Advanced Protection](https://landing.google.com/advancedprotection/)\n[Program, whenever possible, and use](https://landing.google.com/advancedprotection/) [Google’s Work Safer, which provides companies with access to](https://workspace.google.com/lp/work-safer/)\nbest-in-class security for email, meetings, messages, documents, and more. Work Safer brings\ntogether cloud-native, zero-trust solutions of Google Workspace with [BeyondCorp Enterprise.](https://services.google.com/fh/files/misc/bce-protected-profiles-whitepaper.pdf)\n\n### Detailed Observations\n\n##### Compromised GCP instances used for cryptocurrency mining\n\n**Threat Description / TTPs**\n\nMalicious actors were observed performing cryptocurrency mining within compromised Cloud\ninstances. Of 50 recently compromised GCP instances, 86% of the compromised Google Cloud\n**instances were used to perform cryptocurrency mining, a cloud resource-intensive for-profit**\n**activity, which typically consumed CPU/GPU resources, or in cases of Chia mining, storage space.**\nAdditionally, 10% of compromised Cloud instances were used to conduct scans of other publicly\navailable resources on the Internet to identify vulnerable systems, and 8% of instances were used to\nattack other targets. Table 1 lists the outcomes of compromised Google Cloud instances with an\nobservation that, in some instances, multiple malicious actions were performed from within a single\ncompromised instance. While data theft did not appear to be the objective of these compromises, it\nremains a risk associated with the cloud asset compromises as bad actors start performing multiple\nforms of abuse. The public Internet-facing Cloud instances were open to scanning and brute force\nattacks.\n\n##### For more information visit gcat google com\n\n\n-----\n\nTable 1: Compromised GCP instances\n\nResultant actions after compromise Percentage\n\nConduct cryptocurrency mining 86%\n\nConduct port scanning of other targets on the Internet 10%\n\nLaunch attacks against other targets on the Internet 8%\n\nHost malware 6%\n\nHost unauthorized content on the Internet 4%\n\nLaunch DDoS bot 2%\n\nSend spam 2%\n\nNote: Totals do not add up to 100% as some compromised instances were used to perform multiple\nmalicious activities.\n\n**Malicious actors gained access to the Google Cloud instances by taking advantage of poor**\n**customer security practices or vulnerable third-party software in nearly 75% of all cases. As**\nshown in Table 2, 48% of compromised instances were attributed to actors gaining access to the\nInternet-facing Cloud instance, which had either no password or a weak password for user accounts or\nAPI connections. As a result, these Google Cloud instances could be easily scanned and brute forced.\n26% of compromised instances were attributed to vulnerabilities in third-party software, which was\ninstalled by the owner.\n\n##### For more information visit gcat google com\n\n|Resultant actions afetr compromise|Percentage|\n|---|---|\n|Conduct cryptocurrency mining|86%|\n|Conduct por tscanning of other targets on the Internet|10%|\n|Launch atatcks against other targets on the Internet|8%|\n|Host malware|6%|\n|Host unauthorized content on the Internet|4%|\n|Launch DDoS bot|2%|\n|Send spam|2%|\n\n\n-----\n\nTable 2: Exploited vulnerabilities in Cloud instances\n\nExploited vulnerabilities Percentage\n\nWeak or no password for user account or no authentication for APIs 48%\n\nVulnerability in third-party software in the Cloud instance was exploited 26%\n\nOther issues 12%\n\nMisconfiguration of Cloud instance or in third-party software 12%\n\nLeaked credentials, e.g., keys published in GitHub projects 4%\n\nTime was of the essence in the compromise of the Google Cloud instances. The shortest amount of\n**time between deploying a vulnerable Cloud instance exposed to the Internet and its**\n**compromise was determined to be as little as 30 minutes. In 40% of instances the time to**\ncompromise was under eight hours. This suggests that the public IP address space is routinely\nscanned for vulnerable Cloud instances. It will not be a matter of if a vulnerable Cloud instance is\ndetected, but rather when.\n\nAnalysis of the systems used to perform unauthorized cryptocurrency mining, where timeline\ninformation was available, revealed that in 58% of situations the cryptocurrency mining software\n**was downloaded to the system within 22 seconds of being compromised as shown in Figure 1.**\nThis suggests that the initial attacks and subsequent downloads were scripted events not requiring\nhuman intervention. The ability to manually intervene in these situations to prevent exploitation is\nnearly impossible. The best defense would be to not deploy a vulnerable system or have automated\nresponse mechanisms.\n\n##### For more information visit gcat google com\n\n|Exploited vulnerabilities|Percentage|\n|---|---|\n|Weak or no password for user account or no authentication for APIs|48%|\n|Vulnerability in third-party software in the Cloud instance was exploited|26%|\n|Other issues|12%|\n|Misconfgi uration of Cloud instance or in third-party software|12%|\n|Leaked credentials, e.g., keys published in GitHub projects|4%|\n\n\n-----\n\nFigure 1: Time between initial compromise and download of cryptocurrency mining software\n\n**Strategic Significance**\n\n**Google Cloud customers who stand up non-secure Cloud instances will likely be detected and**\n**attacked in a relatively short period of time. Given that most instances were used for**\ncryptocurrency mining rather than exfiltration of data, Google analysts concluded the Google Cloud IP\naddress range was scanned rather than particular Google Cloud customers being targeted. The\namount of time from the launch of a vulnerable Google Cloud instance until compromise varied with\nthe shortest amount of time being under 30 minutes.\n\n**Google Cloud Specific Mitigations**\n\nAside from the [best practices of ensuring accounts always have strong passwords, updating](https://support.google.com/cloud/answer/6262505)\nthird-party software prior to a cloud instance being exposed to the web, and not publishing credentials\nin GitHub projects, Google customers have several different options to help mitigate risks.\n\n[Google Cloud customers can use Container Analysis to perform vulnerability scanning and metadata](https://cloud.google.com/container-analysis/docs)\n[storage for containers and the Web Security Scanner in the Security Command Center to identify](https://cloud.google.com/security-command-center/docs/concepts-web-security-scanner-overview)\nsecurity vulnerabilities in their App Engine, Google Kubernetes Engine, and Compute Engine web\napplications. The scanner will crawl applications, following all links within the scope of the starting URL\nand attempt to exercise as many user inputs and event handlers as possible.\n\nIn addition to the Web Security Scanner, Google Cloud customers have additional resources including:\n\n  - A variety of [access control options within Compute Engine including using](https://cloud.google.com/compute/docs/access) [service accounts to](https://cloud.google.com/compute/docs/access/service-accounts)\nauthenticate apps instead of using user credentials.\n\n  - [Policy Intelligence tools to help understand and manage policies to proactively improve](https://cloud.google.com/iam/docs/policy-intelligence-tools)\nsecurity configurations.\n\n##### For more information visit gcat google com\n\n\n-----\n\n- Pre-defined configurations through [Assured Workloads](https://cloud.google.com/assured-workloads) to reduce the risk of accidental\nmisconfigurations by choosing from available platform security configurations, controls can be\nput in place.\n\n- [Conditional alerts in the Cloud Console to determine when resource consumption exceeds](https://cloud.google.com/monitoring/alerts/ui-conditions-ga)\ncertain thresholds.\n\n- [Enforcing and monitoring password requirements for their users through the Google Admin](https://support.google.com/cloudidentity/answer/139399?hl=en)\nconsole.\n\n- [Recommendations for designing online applications with a password-based authentication](https://cloud.google.com/solutions/modern-password-security-for-system-designers.pdf)\nsystem.\n\n- [Best practices for configuring Cloud environments.](https://cloud.google.com/security/best-practices?hl=en)\n\n##### For more information visit gcat google com\n\n\n-----\n\n##### APT28/Fancy Bear launched Gmail phishing campaign\n\n**Threat Description / TTPs**\n\nBased on research from TAG, the Russian government-backed attackers APT28 / Fancy Bear, which\nmore recently has typically targeted Yahoo! and Microsoft users, was observed at the end of\nSeptember sending a large-scale attack to approximately 12K+ Gmail accounts in a credential phishing\ncampaign. Google blocked these messages and no users were compromised.\n\n[The attackers were using patterns similar to TAG’s government-backed atack alert](https://support.google.com/a/answer/9007870?hl=en) ts to lure users to\nchange their credentials on the attacker’s controlled phishing page. The attackers kept changing the\nemails’ subject line but attackers used a variation of Critical security alert. The email body\ncontained the information shown in Figure 2.\n\nFigure 2: Email body from phishing campaign\n```\n    There's a chance this is a false alarm, but we believe that\n    government-backed attackers may be trying to trick you to get your Account\n    password. We can't reveal what tipped us off because these attackers will\n    adapt, but this happens to less than 0.1% of all users. If they succeed,\n    they can spy on you, access your data, or take other actions using your\n    account. We recommend change you password.\n\n```\nThe credential phishing page, which is shown in Figure 3, appeared similar to a Gmail login page.\n\nFigure 3: Credential Phishing Page\n\n##### For more information visit gcat google com\n\n\n-----\n\nUpon closer inspection, TAG observed that the fonts in the phishing page did not match the fonts on\nthe legitimate Google owned page. This was because the attackers tried to reuse their Yahoo! toolkit\nand left various Yahoo! artifacts in the Gmail HTML login page, including a specific version of Yahoo's\nCSS which uses a different font making the page look slightly different. This is shown in Figure 4.\n\nFigure 4: Artifacts from login page\n\nThe phishing messages were sent from what appeared to be compromised mail servers. This was a\nchange from the previous Yahoo! campaigns, which predominantly used some variant of spoofing to\nsend emails. In the Gmail campaigns, the majority of messages passed SPF and even the ones that did\nnot appeared to be misconfigured servers rather than the usual spoofing. Table 3 displays the SPF\nbreakdown for attacker messages.\n\n##### For more information visit gcat google com\n\n\n-----\n\nTable 3: SPF breakdown\n\nOne significant difference between legitimate emails from the compromised mail servers and phishing\nmessages was the domain part of MessageId which is different and unique for every email address\ndomain.\n\nHighly targeted regions for this particular campaign include the United States, United Kingdom, and\nIndia. Other noteworthy regions include Canada, Russia, Brazil, and members of the European Union.\nFigure 5 depicts the targets for this particular campaign.\n\nFigure 5: Heatmap of targets for this particular campaign\n\n##### For more information visit gcat google com\n\n\nFigure 5: Heatmap of targets for this particular campaign\n\n\n-----\n\n**Strategic Significance**\n\n**Phishing and spear phishing campaigns continue to use login pages that impersonate legitimate**\n**Google login pages to steal credentials. While many fake pages may appear similar to Google’s own**\npage, a close inspection of URLs, certificates, fonts, and graphics will identify discrepancies.\n\n**Google Cloud Specific Mitigations**\n\n[As with all phishing and spear phishing threats, Google customers should engage in best practices.](https://support.google.com/a/answer/9157861?hl=en)\nGoogle [Safe Browsing will help secure many users; however, Workspace customers and Gmail users](https://safebrowsing.google.com/)\n[should validate that they are providing credentials to legitimate Google sites, employ two-factor](https://www.google.com/landing/2step/)\n[authentication, and enroll in the Advanced Protection Program, whenever possible.](https://www.google.com/landing/2step/)\n\nCustomers may also use [Google’s Work Safer, which provides companies with access to best-in-class](https://workspace.google.com/lp/work-safer/)\nsecurity for email, meetings, messages, documents, and more. Work Safer brings together\nCloud-native, zero-trust solutions of Google Workspace with [BeyondCorp Enterprise](https://services.google.com/fh/files/misc/bce-protected-profiles-whitepaper.pdf) for secure access\nwith integrated threat and data protection.\n\n##### For more information visit gcat google com\n\n\n-----\n\n#### Fraudsters employ new TTP to abuse Cloud resources\n\nBased on research from TAG, a group of attackers were observed abusing Cloud resources to generate\ntraffic to YouTube for view count manipulation. Attackers have been using various approaches to gain\nfree Cloud credits, including using free trial projects, abusing start up credits with fake companies, and\njoining Google Developer Community for free projects. A group of attacker’s TTP for exploiting payment\nwas discovered recently by Google Cloud’s abuse team. Attackers were able to use free credits by\nmaking small credit card payments and declining the payment afterward. Upon cloud abuse\nenforcement, the attacker quickly switched to Qwiklab projects and the Google Cloud abuse team\npivoted to counter this offensive.\n\n**Strategic Significance**\n\n**Attackers have continued to exploit Google Cloud projects where free credits were provided to**\n**engage in traffic pumping to YouTube, and there is a likelihood that attackers will continue to**\n**exploit Cloud instances for the same purpose. Attackers, who gain access to legitimate Cloud**\ninstances, will exploit the platforms for various forms of financial gain. Cloud customers who are not\nmindful of the consumption of their Cloud resources could be unwittingly abused.\n\n**Google Cloud Specific Mitigations**\n\nAside from [best practices of ensuring accounts always have strong passwords, updating third-party](https://support.google.com/cloud/answer/6262505)\nsoftware prior to a Cloud instance being exposed to the web, and not publishing credentials in GitHub\nprojects, Google Cloud customers have several different options to help mitigate risks.\n\n[Google Cloud customers can use Container Analysis to perform vulnerability scanning and metadata](https://cloud.google.com/container-analysis/docs)\nstorage for containers and the [Web Security Scanner in the Security Command Center to identify](https://cloud.google.com/security-command-center/docs/concepts-web-security-scanner-overview)\nsecurity vulnerabilities in their App Engine, Google Kubernetes Engine, and Compute Engine web\napplications. The scanner will crawl applications, following all links within the scope of the starting URL\nand attempt to exercise as many user input and event handlers as possible.\n\nIn addition to the Web Security Scanner, Google Cloud customers have additional resources including:\n\n  - A variety of [access control options within Compute Engine including using](https://cloud.google.com/compute/docs/access) [service accounts to](https://cloud.google.com/compute/docs/access/service-accounts)\nauthenticate apps instead of using user credentials.\n\n  - [Policy Intelligence tools to help understand and manage policies to proactively improve](https://cloud.google.com/iam/docs/policy-intelligence-tools)\nsecurity configurations.\n\n  - Pre-defined configurations through [Assured Workloads](https://cloud.google.com/assured-workloads) to reduce the risk of accidental\nmisconfigurations by choosing from available platform security configurations—we’ll help put\nthe controls in place.\n\n  - [Conditional alerts in the Cloud Console to determine when resource consumption exceeds](https://cloud.google.com/monitoring/alerts/ui-conditions-ga)\ncertain thresholds.\n\n  - Tools to [enforce and monitor password requirements for their users](https://support.google.com/cloudidentity/answer/139399?hl=en) through the Google Admin\nconsole.\n\n  - These [recommendations](https://cloud.google.com/solutions/modern-password-security-for-system-designers.pdf) for designing online applications with a password-based\nauthentication system.\n\n  - [Best practices for configuring Cloud environments.](https://cloud.google.com/security/best-practices?hl=en)\n\n##### For more information visit gcat google com\n\n\n-----\n\n##### North Korea targets users by posting as employment recruiters\n\n**Threat Description / TTPs**\n\n[TAG observed a North Korean government-backed attacker group that previously targeted security](https://blog.google/threat-analysis-group/new-campaign-targeting-security-researchers/)\n[researchers posing as recruiters at Samsung and sending fake job opportunities to employees at](https://blog.google/threat-analysis-group/new-campaign-targeting-security-researchers/)\nmultiple South Korean information security companies that sell anti-malware solutions.\n\nThe emails included a PDF allegedly claiming to be of a job description for a role at Samsung; however,\nthe PDFs were malformed and did not open in a standard PDF reader. When targets replied that they\ncould not open the job description, attackers responded with a malicious link to malware purporting to\nbe a “Secure PDF Reader” stored in Google Drive which has now been blocked. An example of the\ninitial email can be seen in Figure 6.\n\nFigure 6: Email example used by the attackers\n\nThe Secure PDF Reader was a modified version of [PDFTron](https://www.pdftron.com/) which attempted to decode an embedded\nPortable Executable (PE) and PDF from a supplied PDF. The PE was XOR encoded with a single-byte\nkey and in this case drops an implant, which uses a legit but exploited South Korean website for\nCommand and Control (C2) and affords the attackers various capabilities like being able to execute\narbitrary commands and upload files. A screenshot of the modified PDFTron reader after opening one\nof the malformed PDFs can be seen in Figure 7.\n\n##### For more information visit gcat google com\n\n\n-----\n\nFigure 7: Modified PDFTron reader used in campaign\n\nThis is not the first time this attacker has modified a PDF viewer. A modified version of SumatraPDF was\nused last year, which used the hash of the malformed PDF as a key to decrypt and drop an implant and\nlegitimate PE that were embedded within the viewer itself. Other groups were recently seen using a\nsimilar technique of providing a malicious PDF viewer to view malformed PDFs.\n\n**Strategic Significance**\n\n**PDFs and associated viewers remain an attack tactic used by various groups. Social media**\npostings on sites such as LinkedIn continue to be a source of information for technical professionals.\nPhishing and spear phishing campaigns continue to use login pages that impersonate legitimate\nGoogle login pages to steal credentials. While many fake pages may appear similar to Google’s own\npage, a close inspection of URLs, certificates, fonts, and graphics will identify discrepancies.\n\n**Google Cloud Specific Mitigations**\n\n[As with all phishing and spear phishing threats, Google Cloud customers should engage in best](https://support.google.com/a/answer/9157861?hl=en)\n[practices. Additionally, Workspace customers and Gmail users should validate that they are providing](https://support.google.com/a/answer/9157861?hl=en)\ncredentials to legitimate Google sites, [employ two-factor authentication, and enroll in the Advanced](https://www.google.com/landing/2step/)\n[Protection Program, whenever possible.](https://landing.google.com/advancedprotection/)\n\n[While Google Safe Browsing](https://safebrowsing.google.com/) can provide one layer of defense, customers may also use [Google’s Work](https://workspace.google.com/lp/work-safer/)\n[Safer, which provides companies with access to best-in-class security for email, meetings, messages,](https://workspace.google.com/lp/work-safer/)\ndocuments, and more. Work Safer brings together Cloud-native, zero-trust solutions of Google\nWorkspace with [BeyondCorp Enterprise for secure access with integrated threat and data protection.](https://services.google.com/fh/files/misc/bce-protected-profiles-whitepaper.pdf)\n\n##### For more information visit gcat google com\n\n\n-----\n\n##### Black Matter ransomware rises out of DarkSide\n\n**Threat Description / TTPs**\n\nBased on research from Google Cloud Threat Intelligence for Chronicle, Black Matter, the successor of\nDarkSide, is one of many ransomware families currently being used to extort money from victims by\nlocking their files using encryption. While Black Matter is considered a relatively new player in this\nspace, evidence suggests it is merely the immediate offspring of DarkSide.\n\nAt its core, Black Matter is a configurable, whole-system and network share encryption tool capable of\nencrypting files on a victim’s hard drive in a relatively short period of time by distributing the workload\nacross multiple threads. Like most ransomware, it is less about the core encryption mechanism that\ndefines the malware and more about the ancillary support code that makes the malware novel.\n\nBlack Matter is highly configurable and allows for a very targeted deployment. The configuration\ncontains the ability to whitelist files, directories, extensions and even entire computers based on their\nnames. It is possible for an attacker to supply known credentials to the malware in order to allow the\nmalware to access higher privileges and additional network resources.\n\n**Despite the warning given to victims in the ransom note dropped by the malware, Black Matter**\n**did not have the ability to exfiltrate data at the time this research was performed. The malware**\nwas only capable of reporting statistics of its operations, such as total number of files found, number\nof files not encrypted, duration of operation, etc., in addition to the details about the victim’s computer,\n_e.g., hostname, language, operating system, drive details, etc. This lack of exfiltration capability could_\nvery well indicate that the deployment of Black Matter on a victim’s computer occurred after the\nattacker(s) had already gained access to the victim’s infrastructure. This claim is further supported by\nthe fact that the malware can be configured with target specific credentials and ransom notes that\ninclude very specific target server information.\n\nThe malware does not provide a significant barrier to analysis as it does not employ sophisticated\nanti-analysis techniques such as packers, cryptors, or code flow manipulation. The malware does use\nhashing to frustrate analysis as strings are not present - only their hash values are.\n\nOn the whole, Black Matter is a formidable ransomware family. As with any other ransomware, the use\nof heavy encryption makes recovery of files nearly impossible without paying for the decryption tool.\nThe use of multiple threads and asynchronous operations allows the malware to quickly compromise\nthe victim’s local computer and networked resources, if configured. The malware also deletes all files\nwithin the victim’s Recycle Bins on all attached drives before deleting all Shadow Copy files. This is an\neffective means of destroying backups of files that are soon to be encrypted. After all encryption\noperations have been completed, and the reporting configuration option is enabled, the malware\nreports statistics to its Command and Control (C2) server.\n\n**Strategic Significance**\n\n**The presence of Black Matter ransomware on a network is an indication that a network has**\n**been compromised through another means. Given that the malware does not have the capability to**\nupload files to a C2 server, it is highly likely that the attacker(s) had prior access to the victim’s\n\n##### For more information visit gcat google com\n\n\n-----\n\ninfrastructure prior to deploying the ransomware. Incident response teams should look for additional\nindicators of compromise. Google has received reports that the Black Matter ransomware group has\nannounced it will shut down operations given outside pressure. Until this is confirmed, Black Matter\nstill poses a risk.\n\n**Google Cloud Specific Mitigations**\n\n[As with all ransomware threats, Google customers should engage in best practices](https://support.google.com/a/answer/9157861?hl=en) with respect to\ncommon attack vectors, e.g., email and phishing campaigns. Detection of Black Matter is largely\nunnecessary as the malware will make its existence known to the victim; however, being able to detect\ncompromised computers that might not be normally touched by users, e.g., will be beneficial. Google\ncustomers may upload the YARA-L2 rules that appear in Table 4 into [Chronicle.](https://chronicle.security/enterprise-security/)\n\nTable 4: YL2 rules to detect Black Mater ransomwaret\n```\n rule UC_ttp_BlackMatter__RegKeys {\n  meta:\n   author = \"Google Cloud Threat Intelligence\"\n   description = \"Known registry keys used by Black Matter\"\n  events:\n   // Modifying the privacy settings screen settings\n   ($e.principal.registry.registry_key = /software\\\\policies\\\\microsoft\\\\windows\\\\oobe/ nocase\n and\n   $e.principal.registry.registry_value_name = \"disableprivacyexperience\" nocase) or\n   // Storing the screen's resolution in the registry\n   ($e.principal.registry.registry_key = /SOFTWARE\\\\[A-Za-z0-9]{8}/ and\n   ($e.principal.registry.registry_value_name = /hScreen/ or\n   $e.principal.registry.registry_value_name = /vScreen/ )) or\n   // RunOnce key\n   ($e.principal.registry.registry_key =\n /SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce/ nocase and\n   $e.principal.registry.registry_value_name = /[A-Z]{3}[0-9]{3}[a-z]{3}/ )\n condition:\n   $e\n }\n rule UC_ttp_BlackMatter__SafeBoot {\n  meta:\n   author = \"Google Cloud Threat Intelligence\"\n   description = \"Detects a machine's configuration being changed to safe boot\"\n   ext_description = \"Known command line for Black Matter's SafeBoot\"\n  events:\n   ($e.principal.process.file.full_path = /bootcfg/ nocase and\n   ($e.principal.process.command_line = /\\/raw \\/a \\/safeboot:network \\/id 1/ or\n   ($e.principal.process.command_line = /\\/raw \\/fastdetect \\/id 1/)) or\n   ($e.principal.process.file.full_path = /bcdedit/ nocase and\n   ($e.principal.process.command_line = /\\/raw \\/set \\/{current\\} safeboot network/ or\n   $e.principal.process.command_line = /\\/raw \\/deletevalue \\{current\\} safeboot/)))\n condition:\n   $e\n }\n\n##### For more information visit gcat google com\n\n```\n\n-----\n\n### Recommendations\n\nGoogle Cloud continues to operate within a \"\n\nCloud’s recommendations based upon incidents that it helped address:\n\nbasis. An audit of published projects can ensure that this mistake does not happen.\n\n**Code downloaded by clients should undergo hashing authentication.**\n\nsource code to be pulled into production. By hashing and verifying all downloads, the\n[software supply chain can be preserved and an effective](https://www.iso.org/obp/ui/#iso:std:iso:22095:dis:ed-1:v1:en)\n\nubiquitous access. In addition to\ntheir environment through [Context-Aware Access](https://support.google.com/a/answer/9275380?hl=en)\n[Work Safer.](https://workspace.google.com/lp/work-safer/)\n\nTable 5: Observed risks and countermeasures\n\n|Risk|Countermeasures|\n|---|---|\n|Exploiting vulnerable GCP instances|Follow password best practices and best practices for confgi uring Cloud environments. Update third-party software prior to a Cloud instance being exposed to the web. Avoid publishing credentials in GitHub projects. Use Container Analysis to perofrm vulnerability scanning and metadata storage. Leverage Web Security Scanner in the Security Command Center to identify security vulnerabilities in App Engine, Google Kubernetes Engine, and Compute Engine. Use service accounts with Compute Engine to authenticate apps instead of using user credentials. Implement Policy Intelligence tools to help understand and manage policies. Use predefni ed confgi urations through Assured Workloads to reduce misconfgi urations.|\n\n\n##### For more information visit gcat google com\n\n\n-----\n\n|Col1|Set up conditional alerts in the Cloud Console to send alerts upon high resource consumption. Enforce and monitor password requirements for users through the Google Admin console.|\n|---|---|\n|Spear-phishing|Engage in email best practices. Employ 2-Step Verifci ation. Enroll in the Advanced Protection Program.. Use Google’s Work Safer and BeyondCorp Enterprise. Deploy Context-Aware Access.|\n|Downloading software updates|Establish a strong chain of custody by hashing and verifying downloads.|\n|Using public code repositories|Audit projects published on GitHub and other sites to ensure credentials and certifci ates were not included.|\n\n\nFor additional information about Google’s Cybersecurity Action Team and best practices, please visit\n[gcat.google.com.](https://gcat.google.com)\n\n##### For more information visit gcat google com\n\n\n-----\n\n##### Threat Horizons\n Google Cloud\n#### © November 2021\n\n##### For more information visit gcat google com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/gcat_threathorizons_full_nov2021.pdf"
    ],
    "report_names": [
        "gcat_threathorizons_full_nov2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/66d8ff8facc9e84340fbe97755c524faafa8c854.pdf",
        "text": "https://archive.orkl.eu/66d8ff8facc9e84340fbe97755c524faafa8c854.txt",
        "img": "https://archive.orkl.eu/66d8ff8facc9e84340fbe97755c524faafa8c854.jpg"
    }
}