{
    "id": "56ea837b-aa1d-4a4b-8682-d4152c763afa",
    "created_at": "2023-01-12T15:04:25.630703Z",
    "updated_at": "2025-03-27T02:05:58.668731Z",
    "deleted_at": null,
    "sha1_hash": "37cc5ad9cd9d14f3625f4a2bc288bc21b32aa18d",
    "title": "2022-03-16 - Gh0stCringe RAT Being Distributed to Vulnerable Database Servers",
    "authors": "",
    "file_creation_date": "2022-05-28T23:23:19Z",
    "file_modification_date": "2022-05-28T23:23:19Z",
    "file_size": 3002210,
    "plain_text": "# Gh0stCringe RAT Being Distributed to Vulnerable Database Servers\n\n**asec.ahnlab.com/en/32572/**\n\n\nMarch 16, 2022\n\nThe ASEC analysis team is constantly monitoring malware distributed to vulnerable database\nservers (MS-SQL, MySQL servers). This blog will explain the RAT malware named\n[Gh0stCringe[1].](https://twitter.com/James_inthe_box/status/1125004664041197568)\n\n\nGh0stCringe, also known as CirenegRAT, is one of the malware variants based on the code of\nGh0st RAT. It was first discovered in December 2018, and it is known to have been distributed\n[via SMB vulnerability (using the SMB vulnerability tool of ZombieBoy).[2]](https://www.binarydefense.com/gh0stcringeformerly-cirenegrat/) Since then, no direct\n[relationship has been found, but it was mentioned in the KingMiner CoinMiner analysis report[3]](https://www.sophos.com/en-us/medialibrary/pdfs/technical-papers/sophos-labs-kingminer-botnet-report.pdf)\npublished in June 2020.\n\nGh0stCringe RAT that is recently being discovered is being distributed to vulnerable database\nservers. Gh0stCringe-related logs in AhnLab’s ASD show that logs were not only created by\nthe sqlservr.exe process (MS-SQL server) but also by the MySQL server process for Windows\nenvironment (see figure below).\n\n\n-----\n\n**Figure 1. Gh0stCringe RAT creation logs**\nConsidering the fact that MySQL servers are targets of attack in addition to MS-SQL servers, it\ncan be assumed that Gh0stCringe targets poorly-managed DB servers with vulnerable account\ncredentials.\n\nSince database servers with vulnerable account credentials usually become targets of various\nattackers and malware, many different malware infection logs were found. In fact, the typical\nattack path of KingMiner malware that was mentioned above was an attack against SQL\nservers with vulnerable account credentials. Furthermore, the infection log of systems installed\nwith Gh0stCringe shows a history of infection from different malware other than KingMiner\n[such as Vollgar CoinMiner[4]](https://www.guardicore.com/blog/vollgar-ms-sql-servers-under-attack/) that are distributed through brute force attacks.\n\nGh0stCringe was created based on the source code of publicly released Gh0st RAT. The\nfollowing is a comparison between the CFileManager::OpenFile() function of Gh0st RAT that\nwas publicly released and the function of Gh0stCringe. It shows that a part of the source code\nwas used without modifications. Note that unlike normal variants where the majority of their\ncodes is similar to the original code based on the Gh0st RAT source code, the majority of\nGh0stCringe codes is unique just like how Gh0stCringe has its own name.\n\n\n-----\n\n**Figure 2. Gh0stCringe that utilizes Gh0st RAT source code**\nAs its name suggests, Gh0stCringe RAT is a RAT malware that connects to the C&C server\nand performs various malicious behaviors by receiving commands from the attacker. The\nattacker can designate various settings to Gh0stCringe just like other RAT malware. The\nexplanations in this blog are based on the analyzed sample.\n\nThe following is settings data of various features that can be performed when executed in\naddition to the C&C commands. There are 7 settings, and the malware performs different\nbehaviors depending on the configured data.\n\n\n-----\n\n**Figure 3. Gh0stCringe settings data**\n\n**Self-copy [On/Off]: If turned on, copies itself to a certain path depending on the mode.**\n**Mode of execution [Mode]: Can have values of 0, 1, and 2. See below for explanations**\non the modes.\n**File size change [Size]: In Mode #2, the malware copies itself to the path**\n‘%ProgramFiles%\\Cccogae.exe’, and if there is a set value, it adds junk data of the\ndesignated size to the back of the file.\n**Analysis disruption technique [On/Off]: Obtains the PID of its parent process and the**\nexplorer.exe process. If it results in a value of 0, terminates itself.\n**Keylogger [On/Off]: If turned on, keylogging thread operates.**\n**Rundll32 process termination [On/Off] If turned on, executes ‘taskkill /f /im**\nrundll32.exe’ command to terminate the rundll32 process that is running.\n**Self-copy file property [Attr]: Sets property to read-only, hidden, and system**\n(FILE_ATTRIBUTE_READONLY|FILE_ATTRIBUTE_HIDDEN|FILE_ATTRIBUTE_SYSTEM).\n\nThe keylogging feature can operate by receiving a command from the C&C server, and it can\nalso be activated depending on the settings data. Unlike Gh0st RAT which uses the Windows\nHooking method (use of SetWindowsHookEx() API), Gh0stCringe uses the keylogging\ntechnique of Windows Polling method (using GetAsyncKeyState() API).\n\n\n-----\n\n**Figure 4. Keylogging that uses**\n\n**GetAsyncKeyState() API**\nThe malware saves logged user key inputs to the path ‘%SystemDirectory%\\Default.key’ by\nsingle-byte XOR encoding similarly to Gh0st RAT. In this case, 0x62 was used as the key.\n\n**Figure 5. XOR encoding with 0x62**\nGh0stCringe supports four different modes. The three modes are the values of the settings\ndata mentioned above, which were 0, 1, and 2. In addition to them, the malware is executed in\nan exclusive mode in Windows 10 version. All modes ultimately communicate with the C&C\nserver and perform commands, but there are differences in their features related to maintaining\npersistence.\n\n\n-----\n\n**Mode #0: If the Rsuyke mkgcgkuc service does not exist, the malware creates the**\nservice but does not register it in a proper way. If the self-copy setting is turned on, the\nmalware copies itself to the path %ProgramFiles% with a random name. As the created\nservice is not registered in a proper way and the malware does not use additional\ntechniques such as Run Key registration, persistence is not maintained.\n**Mode #1: Just like in Mode #0, the malware creates an abnormal ‘Rsuyke mkgcgkuc’**\nservice. It registers the service to HKLM Run Key, enabling it to maintain persistence.\n**Mode #2: The malware copies itself to the path %ProgramFiles%\\Cccogae.exe’ and**\nregisters to ‘Rsuyke mkgcgkuc’ service. When it executes the service, it gives ‘Win7’ as\nthe argument and executes Gh0stCringe. As the service is registered in a proper way,\npersistence is maintained. Additionally, if the self-copy settings is turned on, it copies\nitself to the path ‘%SystemDirectory%[Random].bak’.\n**Mode Windows 10: It registers to HKCU Run Key, enabling it to maintain persistence.**\n\n**Figure 6. Rsuyke**\n\n**mkgcgkuc service registered in a proper way**\nAfter the initial routine, it connects to the C&C server and communicates periodically, waiting\nfor the attacker’s command. Apart from the command perform routine, it collects the following\ninformation of the infected system on initial connection and sends it to the C&C server.\n\n**Offset** **Size** **Description**\n\n+0x0000 0x01 0xC8\n\n+0x0001 0x07 “Default”\n\n+0x0024 0x04 IP address of the infected system\n\n+0x0028 0x04 Host name of the infected system\n\n+0x005C 0x9C Windows ver.\n\n+0x00F8 0x04 Number of CPUs (MB)\n\n+0x010C 0x04 CPU speed (GHz)\n\n+0x0114 0x04 Network performance\n\n\n-----\n\n**Offset** **Size** **Description**\n\n+0x0118 0x04 Number of webcams\n\n+0x011C 0x04 Wow64 availability\n\n+0x0120 0x04 Memory capacity (MB)\n\n+0x0124 0x04 Local disk capacity (MB)\n\n+0x0128 0x04 Date of malware installation\n\n+0x0159 N/A List of installed security products\n\n+0x01BE N/A Certain data area (not used)\n\n+0x0204 0x04 Network interface speed (Mbps)\n\n+0x0208 0x04 “V9.0”\n\n+0x0228 0x04 Whether there were key inputs in the last 3 minutes\n\n**Table 1. Structure of data collected from the infected system**\nThe most noticeable collected data is the list of installed security products. The malware scans\nthe names of the currently running processes compares them to the following list, and if they\nmatch, it records the information and sends it to the C&C server.\n\n**Figure 7. A part of the list of scanned**\n\n**security products**\n\n\n-----\n\nThe original Gh0st RAT uses a signature string called **Gh0st just like its name to**\ncommunicate with the C&C server. The following is the routine that decides on the “Gh0st”\nstring via PacketFlag in the original Gh0st RAT.\n\n**Figure 8. Gh0st signature**\n\n**string**\nThe following is the packet structure of Gh0stCringe before its encryption. The information of\nthe infected system listed above was a 0x22C size, and additional data of a 0xF size was\nadded in the front. The “xy “ string (first 3 bytes 0x787920) is the signature string of\nGh0stCringe.\n\n**Figure 9. Packet**\n\n**structure of Gh0stCringe before encryption**\nThe following table provides the details on the structure of the packet before its encryption:\n\n**Offset** **Size** **Data** **Description**\n\n+0x00 0x03 “xy “ Signature string\n\n+0x03 0x04 0x0000023B Total packet size\n\n+0x07 0x04 0x0000022C Size of data to be sent\n\n+0x0B 0x04 0x00000001 Hard-coded data\n\n\n-----\n\n**Offset** **Size** **Data** **Description**\n\n+0x0F Variable Variable Data collected from the infected system\n\n**Table 2. Packet structure**\nThe data that has been created goes through a self-encoding method and is ultimately\nencrypted. The following is the packet encryption routine and the packet created through this\nprocess to be sent to the C&C server:\n\n**Figure 10. Packet encryption routine**\n\n**Figure 11. Encoded information of the infected system to be sent to C&C server**\nThe following is a list of various commands that can be received from the C&C server and\nperformed. Some of the commands of Gh0stCringe exist in the original Gh0st RAT, but there\nare many unique commands as well.\n\n**Performing Commands**\n– Downloader: Downloads additional payload from the C&C server and executes it. Can send\nspecific arguments.\n\n\n-----\n\n– Connecting to a specific URL: Connects to a specific website via Internet Explorer There is\nan option to hide the window so that the user does not notice it.\n– Destroying MBR\n\n**Stealing Information**\n– Keylogging: Regardless of whether there is settings data or not, keylogging can be\nperformed by the C&C server’s command.\n– Stealing clipboard: Steals the saved data to the current clipboard.\n– Collecting Tencent-related file information: Collects the list of files in the path\n‘%APPDATA%\\Tencent\\Users\\’, and it is assumed that it would normally include user data\nrelated to QQ Messenger.\n\n**Self-Control**\n– Update: Updates the malware\n– Uninstall: Deletes the registered service and self-deletes using a batch file. Also deletes the\nkeylogging data Default.key file.\n– Service control: Changes the ‘Host’ or ‘ConnectGroup’ item for the malware service\n(‘Rsuyke mkgcgkuc’).\n– Event Cleanup\n– Registering Run Key: Registers Run Key for the path ‘C:\\Program Files\\Common\nFiles\\scvh0st.exe’.\n\n**System Control**\n– Terminating system\n– Rebooting NIC\n\n**Additional Module Control**\nDownloads an additional module from the C&C server to memory and loads it to call the\nfollowing export function. Judging by the export function, the first module appears to be a\nproxy-related module, and the second module appears to be a Plugin module with additional\nfeatures.\n– Module #1: Export function OpenProxy(), CloseProxy()\n– Module #2: Export function PluginMe()\n\n**Others**\n– Scanning whether a certain process is running\n– Scanning for the existence of certain Windows\n– Writing for a certain registry: ‘HKLM\\SYSTEM\\Clore / Clore’\n– Message pop-up\n\nTypical attacks that target database servers (MS-SQL, MySQL servers) include brute force\nattacks and dictionary attacks to systems where account credentials are poorly being\nmanaged. Although it seems like these methods make up the majority of the attacks, there can\nbe vulnerability attacks against systems where their vulnerability has not been patched.\n\n\n-----\n\nIn the case of MS-SQL servers, servers that have been installed by ERP and work-purpose\nsolutions are being targeted by attackers in addition to the servers that are established\nnormally. Because of this, administrators should use passwords that are difficult to guess for\ntheir accounts and change them periodically to protect the database server from brute force\nattacks and dictionary attacks, and maintain the latest patch to prevent vulnerability attacks.\nAdministrators should also use security programs such as firewalls for database servers\naccessible from outside to restrict access of external attackers.\n\nAhnLab’s anti-malware software, V3, detects and blocks the malware above using the aliases\nbelow.\n\n**[File Detection]**\n– Backdoor/Win.Gh0stRAT.C4976413 (2022.02.19.00)\n– Backdoor/Win.Gh0stRAT.C4976420 (2022.02.19.00)\n\n**[IOC]**\n**MD5**\n– bd8611002e01d4f9911e85624d431eb0\n– 9adc9644a1956dee23c63221951dd192\n– 782cbc8660ff9e94e584adfcbc4cb961\n\n**C&C**\n– tuwu.meibu[.]net:2220\n– 172.86.127[.]224:8000\n\n**[References]**\n\n[1] [https://twitter.com/James_inthe_box/status/1125004664041197568](https://twitter.com/James_inthe_box/status/1125004664041197568)\n\n[2] [https://www.binarydefense.com/gh0stcringeformerly-cirenegrat/](https://www.binarydefense.com/gh0stcringeformerly-cirenegrat/)\n\n[3] https://www.sophos.com/en-us/medialibrary/pdfs/technical-papers/sophos-labs-kingminerbotnet-report.pdf\n\n[4] [https://www.guardicore.com/blog/vollgar-ms-sql-servers-under-attack/](https://www.guardicore.com/blog/vollgar-ms-sql-servers-under-attack/)\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to**\n**check related IOC and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information/)\n\n[Tagged as:BruteForcing,](https://asec.ahnlab.com/tag/bruteforcing/) [Database,](https://asec.ahnlab.com/tag/database/) [Dictionary Attack,](https://asec.ahnlab.com/tag/dictionary-attack/) [Gh0stCringe,](https://asec.ahnlab.com/tag/gh0stcringe/) [Gh0stCringeRAT,](https://asec.ahnlab.com/tag/gh0stcringerat/)\n[Gh0stRAT,](https://asec.ahnlab.com/tag/gh0strat/) [MS-SQL,](https://asec.ahnlab.com/tag/ms-sql/) [MSSQL](https://asec.ahnlab.com/tag/mssql/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-16 - Gh0stCringe RAT Being Distributed to Vulnerable Database Servers.pdf"
    ],
    "report_names": [
        "2022-03-16 - Gh0stCringe RAT Being Distributed to Vulnerable Database Servers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535865,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653780199,
    "ts_modification_date": 1653780199,
    "files": {
        "pdf": "https://archive.orkl.eu/37cc5ad9cd9d14f3625f4a2bc288bc21b32aa18d.pdf",
        "text": "https://archive.orkl.eu/37cc5ad9cd9d14f3625f4a2bc288bc21b32aa18d.txt",
        "img": "https://archive.orkl.eu/37cc5ad9cd9d14f3625f4a2bc288bc21b32aa18d.jpg"
    }
}