{
    "id": "570eb8d2-6e4a-4a75-a26c-2adfad185297",
    "created_at": "2023-01-12T15:10:43.279581Z",
    "updated_at": "2025-03-27T02:10:04.147656Z",
    "deleted_at": null,
    "sha1_hash": "983a83492343a4dad6f07af363d65d1a212af9b1",
    "title": "2011-06-29 - Inside a Back Door Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T15:49:26Z",
    "file_modification_date": "2022-05-28T15:49:26Z",
    "file_size": 129540,
    "plain_text": "# Inside a Back Door Attack\n\n**[web.archive.org/web/20140816135909/https://www.symantec.com/connect/blogs/inside-back-door-attack](https://web.archive.org/web/20140816135909/https://www.symantec.com/connect/blogs/inside-back-door-attack)**\n\nJune 29, 2011\n\nA colleague of mine recently wrote about one of the June “Microsoft Tuesday” vulnerabilities\n[being exploited in the wild. Because we're a bit like that, we decided to allow the exploit to](https://web.archive.org/web/20140816135909/http://www.symantec.com/connect/blogs/vulnerability-june-ms-tuesday-wild)\ncompromise one of our honeypot computers so we could observe what happened.\n\nThe exploit first came to our attention by way of email messages that were initially sent to a\ncustomer and then passed on to us for investigation. These messages were sent from an\naccount hosted on a popular webmail service, contained very bad grammar, and were\npurportedly sent by a Chinese university student. The emails either asked for advice on a\nparticular topic, or thanked the recipient for a recent presentation and included a question\nrelated to that presentation. The emails included a link to a Chinese restaurant and the\ndestination Web page contained the exploit for an Internet Explorer 8 vulnerability:\n\n_Figure 1: The hidden iframe tag can be seen, in addition to a link to cnzz, presumably for_\n_statistical purposes._\n\nAlthough the scenario in question might be referred to as a \"targeted attack,\" there are of\ncourse degrees of sophistication involved in every attack, and definitions of what is and is not\na \"targeted\" attack tend to vary somewhat. In this case, given that the recipients were not\nChinese, were not in any way related to a university, were not related to the topic on which\nadvice was sought, and didn’t have anything to do with the presentation mentioned, one has\nto wonder why the attacker didn't do more to tailor the email message content to the\nrecipient. In the environment in which they were presented, they truly stuck out like a sore\nthumb, and beg the question of whether this was indeed a targeted attack or just a random\nphishing expedition.\n\nEither way, given that the exploit was hosted on a Web page belonging to the Chinese\nrestaurant, the easiest way to force the compromise of one of our honeypot computers was\nto simply browse to that Web page using a vulnerable version of Internet Explorer. We\nbraced ourselves for the impact, and with one seemingly innocent click of the mouse, the\nexploit triggered and our honeypot computer was duly compromised. The computer we used\nfor this exercise had a fairly basic setup, but we had spent a bit of time trying to make it look\n\n\n-----\n\nlike a genuine person s computer and not just a clone. It had several bait files on it, many of\nwhich were viewed by the attacker, and some of which were “downloaded.” Scratch that.\nLet's call it what it is—some of which were “stolen.”\n\nAs mentioned in the previous blog, the exploit uses shell code to download and install a back\ndoor that then contacts 323332.3322.org (a dynamic DNS service based in China) on TCP\nport 80 and awaits further commands. It is interesting to note that the attacker used a brandnew exploit to compromise the computer, but then relied on a very old back door (detected\nby Symantec since January 2010) to set up remote access.\n\nWe didn't have to wait long. Just minutes after the back door was installed, the attacker\nstarted discovery of the compromised computer. Some of the commands used were as\nfollows:\n\n_Figure 2: Some of the commands used by the attacker during their discovery phase_\n\nNotice the typo on line six? That’s always a good indication you are dealing with a human, as\nopposed to an automated script or bot. You can see the attacker was interested in the\nrunning processes, active connections, specific Windows configuration of the targeted\ncomputer, as well as any networked devices connected to the target. You can also see the\nattacker tried to connect to one of the networked devices using the administrator account.\nThey failed, by design.\n\nImmediately after this, the attacker uploaded a full file and folder listing for all local fixed\ndrives. One of the bait files on the computer must have caught their attention early because\nthe next action was to upload a .pdf file from the honeypot computer. Shortly after that, a\nbase-64 encoded executable file was downloaded and executed on the compromised\ncomputer. It turned out to be a different back door, this time one that we hadn't previously\nseen. It resulted in a second connection to a different IP address and brought an infamous\nremote administration tool (RAT) known as Gh0st Rat to the party. Another of my colleagues\n\n\n-----\n\n[wrote about this remote access tool back in 2009 and included a very informative video](https://web.archive.org/web/20140816135909/http://www.symantec.com/connect/blogs/ghostnet-toolset-back-door-click-button)\n[showing what an attacker can do with one of these remote access tools. Take a look if you're](https://web.archive.org/web/20140816135909/http://www.youtube.com/watch?v=Vz-gg8hxaVQ)\nnot familiar; you may be surprised to see what can be done.\n\nWith the introduction of the Gh0st Rat tool, the majority of traffic was now encrypted using\nSSL, and sessions jumped between the original host at 323332.3322.org and the second\nback door command-and-control server the Gh0st RAT tool was downloaded from.\n\n_Figure 3: Encrypted traffic, but you can see the obvious references to “Gh0st”_\n\nWe did see the Outlook Express mailbox file being uploaded as well, as well as the default\nbrowser bookmarks. During the short period we monitored the attack before disconnecting\nthe honeypot computer from the Internet, we observed intermittent bursts of activity, but the\nmajority of it took place soon after the honeypot computer was compromised. In total, there\nwere approximately 2.5 megabytes of traffic to our honeypot computer originating from the\nattacker’s two computers, and about 9 megabytes of traffic outbound to the attacker’s\ncomputers.\n\nSo, be aware that the next time you click a URL in an email; you might get a lot more than\nyou bargained for. Keep your security software up to date, and when Microsoft releases\nthose patches, get 'em quick. Believe me, the bad guys are counting on you not doing so.\n\n**Note: A special thanks to Henry Bell for his kind assistance with this article.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-06-29 - Inside a Back Door Attack.pdf"
    ],
    "report_names": [
        "2011-06-29 - Inside a Back Door Attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536243,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1653752966,
    "ts_modification_date": 1653752966,
    "files": {
        "pdf": "https://archive.orkl.eu/983a83492343a4dad6f07af363d65d1a212af9b1.pdf",
        "text": "https://archive.orkl.eu/983a83492343a4dad6f07af363d65d1a212af9b1.txt",
        "img": "https://archive.orkl.eu/983a83492343a4dad6f07af363d65d1a212af9b1.jpg"
    }
}