{
    "id": "571bcb07-5433-4552-a043-6e2b589e1e4d",
    "created_at": "2023-01-12T15:08:40.101367Z",
    "updated_at": "2025-03-27T02:05:32.60496Z",
    "deleted_at": null,
    "sha1_hash": "c4e4c8082e83840b8877ae026bf6cc022f50bc6d",
    "title": "2018-11-23 - Sload hits Italy. Unveil the power of powershell as a downloader",
    "authors": "",
    "file_creation_date": "2022-05-28T15:18:22Z",
    "file_modification_date": "2022-05-28T15:18:22Z",
    "file_size": 848513,
    "plain_text": "# Sload hits Italy. Unveil the power of powershell as a downloader\n\n**[certego.net/en/news/sload-hits-italy-unveil-the-power-of-powershell-as-a-downloader/](https://www.certego.net/en/news/sload-hits-italy-unveil-the-power-of-powershell-as-a-downloader/)**\n\n**Date:**\n23 November 2018\n\nHi everyone, here is Matteo Lodi, Threat Intelligence Analyst in Certego.\n\nRecently, we saw a particular new spam campaign targeting italian users with the focus of\ndelivering a downloader known as Sload.\n\nNowadays, attackers are trying harder and harder to make difficult the analysis and the\ndetection. The most common tool misused in this way is Powershell: it's installed by default\nin every recent version of Windows and is commonly used to perform administrator tasks.\n\n**The infection chain**\n\nLet's dig in the infection chain:\n\n\n-----\n\n-----\n\n**1. A user receives an email with subject** _<TARGET_COMPANY_NAME> Emissione_\n_fattura <random_number>\" containing a reference to a fake invoice._\n\nThe user is tricked to click on the malicious link that points to a randomly generated domain\nhosted with HTTPS in 91.218[.]127.189. The following is an example:\n\n**2. Once downloaded, if the user opens the archive, it would find two files. The first one is a**\nlegit image, while the second one is a .lnk file. We have already seen the misuse of shortcut\nfiles with powershell to perform the download of malicious samples. But this time it seemed\ndifferent: in fact, the .lnk points to the following command:\n\n**3. Where is the download? At first glance, that seemed very strange: what is the aim of this**\nexecution? After having analyzed the command, the trick was clear. The attackers wants to\ncall \"Invoke-Expression\" command to run a string hidden inside the zip itself!! But where?\n\nAs we can see in the following image, at the end of the original downloaded zip file we can\nsee readable strings that are the real first stage downloader!!\n\n\n-----\n\nThe zip file is still a legit and correctly working archive! Powershell commands are written\nafter the EOCD (End of central directory) which determines the end of a zip file.\n\nThis clever trick can deceive many signatures-based detection tools.\n\n**4. The extracted command is the following:**\n\n\n-----\n\n**5. The result is the download and the execution of another powershell script from a server**\nhosted in 185.17[.]27.108. We saw different domains used but, in the last week, the\nDropzone IP never changed. Also, we noted that the CnC server was blocking requests\nwithout the \"Microsoft BITS/7.5\" User-Agent to prevent unwanted download by non-infected\nmachines.\n\nThis script was very well detected by antivirus engines as you can see in the following\nimage!\n\nHow funny was I? Static analysis is completely useless in such cases.\n\nGoing forward, the malware drops the following items before deleting itself:\n\n\n-----\n\nTherefore it registers a task called \"AppRunLog\" to maintain persistence\n\n**6. At the end, it calls the registered task. This will execute the dropped Visual Basic Script file**\nthat, in turn, will execute the dropped Powershell script:\n\nThis script parses arguments and it won't execute properly in case they are not what it\nexpects. It needs the numbers from 1 to 16 as arguments because, in fact, they are the key\nto decrypt the last stage.\n\n**7. The final payload is decrypted from the \"config.ini\" file and is called with \"Invoke-**\nExpression\". It's loaded directly in memory: this makes very difficult for antivirus products to\ndetect the threat. At the moment, this execution method is widely known as \"fileless\"\nbecause, indeed, the malware is never written on disk.\n\nThe payload is the last (finally) powershell script: it is the real Sload downloader which\nperforms various malicious steps that were already explained in details in the article written\nby [Proofpoint.](https://www.proofpoint.com/us/threat-insight/post/sload-and-ramnit-pairing-sustained-campaigns-against-uk-and-italy)\n\n\n-----\n\nIn few words, Sload can:\n\n1. Load external binaries\n2. Take screenshots\n3. Update configuration and CnC servers\n4. List running processes\n5. Detect Outlook usage\n\nThe variant we spotted in the last week uses the following CnC domains, which resolve in\nthe same IP used by the second downloader stage (185.17[.]27.108)\n\nHowever, we expect that this configuration won't last long, because, as we said before, Sload\nis able to update his CnC servers at any time.\n\n**Conclusion**\n\nWe had a fantastic journey that made us understand, hopefully, how powerful can be\nPowershell and how attackers are misusing this tool to evade analysis detection.\n\n\n-----\n\nWe analyzed 5 different powershell scripts and that was only the downloader phase of the\ninfection.\n\nIn case of a successfull one, Sload was seen to download known malware like Ramnit,\n[Gootkit, DarkVNC or Ursnif (reference: Proofpoint). At that stage the threat would be really](https://www.proofpoint.com/us/threat-insight/post/sload-and-ramnit-pairing-sustained-campaigns-against-uk-and-italy)\nimportant.\n\nCertego is monitoring the campaign and it's updating its signatures to correctly detect\npossible infections.\n\n**IOC**\n```\nFirst stage download: (many and changing fast)\nusined[.]com\ndarrenportermusic[.]com\nsupporto.eldersonfire[.]com\n91.218[.]127.189\nSecond stage download: (many and changing fast)\nfiretechnicaladvisor[.]com\ncltspine[.]info\n185.17[.]27.108\nCnC servers: (stable through the last week)\nljfumm[.]me \nhamofgri[.]me\n185.17[.]27.108\nHash (sha256):\nfirst stage\n7838904c04c8bdf2444a64bd32fa308b6bd248789305e2fe4e91699b5a0a9f99 \n8e1271fbb3f21d4c441748488d68636c68e6dbf4a755468da27b210c04ceb9c1\nsecond stage\nee1dbf76665f5c07ba1c453d1890aa93307f759c5cce6f59f225111509482a64\nsload\nad50e8ee958cb3f391ecc8e94b1506eba3174d9f08b95b37f616eeba382838b5\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-23 - Sload hits Italy. Unveil the power of powershell as a downloader.pdf"
    ],
    "report_names": [
        "2018-11-23 - Sload hits Italy. Unveil the power of powershell as a downloader.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536120,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653751102,
    "ts_modification_date": 1653751102,
    "files": {
        "pdf": "https://archive.orkl.eu/c4e4c8082e83840b8877ae026bf6cc022f50bc6d.pdf",
        "text": "https://archive.orkl.eu/c4e4c8082e83840b8877ae026bf6cc022f50bc6d.txt",
        "img": "https://archive.orkl.eu/c4e4c8082e83840b8877ae026bf6cc022f50bc6d.jpg"
    }
}