{
    "id": "572fe6bb-d4de-465e-b20e-7f6d3ec4957d",
    "created_at": "2023-01-12T15:03:38.275279Z",
    "updated_at": "2025-03-27T02:17:11.871459Z",
    "deleted_at": null,
    "sha1_hash": "f87c5ef286823a81dac3b4fd9e384d36d2f8e34a",
    "title": "2022-12-16 - Russia’s Wartime Cyber Operations in Ukraine- Military Impacts, Influences, and Implications",
    "authors": "",
    "file_creation_date": "2022-12-29T00:31:43Z",
    "file_modification_date": "2022-12-29T00:31:43Z",
    "file_size": 1975594,
    "plain_text": "# Russia’s Wartime Cyber Operations in Ukraine: Military Impacts, Influences, and Implications\n\n**carnegieendowment.org/2022/12/16/russia-s-wartime-cyber-operations-in-ukraine-military-impacts-influences-and-**\nimplications-pub-88657\n\nJon Bateman\n\n_[This paper is part of Carnegie’s ‘Cyber Conflict in the Russia-Ukraine War’ paper series, a](https://carnegieendowment.org/programs/technology/cyberconflictintherussiaukrainewar/)_\n_project to better understand the cyber elements of the Russia-Ukraine war. Carnegie experts_\n_each examine a unique dimension of the cyber conflict: Nick Beecroft on international_\n_[assistance to Ukraine’s cyber defense; Gavin Wilde on Russia’s unmet expectations; and](https://carnegieendowment.org/2022/12/12/cyber-operations-in-ukraine-russia-s-unmet-expectations-pub-88607)_\n_Jon Bateman on the overall military impact of Russian cyber operations._\n\n## Summary\n\nThis paper examines the military effectiveness of Russia’s wartime cyber operations in\nUkraine, the reasons why these operations have not had greater strategic impact, and the1\nlessons applicable to other countries’ military cyber efforts. It builds on previous analyses by\ntaking a more systematic and detailed approach that incorporates a wider range of publicly\navailable data.\n\nA major purpose of this paper is to help bridge the divide between cyber-specific and general\nmilitary analysis of the Russia-Ukraine war. Most analysis of Russian cyber operations in\nUkraine has been produced by cyber specialists writing for their own field, with limited\nintegration of non-cyber military sources and concepts. Conversely, leading accounts of the\n\n\n-----\n\nwar as a whole include virtually no mention of cyber operations. To begin filling the gap, this\npaper places Russian cyber operations in Ukraine within the larger frame of Moscow’s\nmilitary objectives, campaigns, and kinetic activities. Its key points:\n\n**Russian cyber “fires” (disruptive or destructive attacks) may have contributed**\n**modestly to Moscow’s initial invasion, but since then they have inflicted**\n**negligible damage on Ukrainian targets. Traditional jamming gave Russian forces a**\ntactical edge in the battle for Kyiv, and it is plausible—though unconfirmed—that the\ncyber disruption of Viasat modems further degraded Ukrainian front-line\ncommunications. Meanwhile, Russia’s large opening salvo of data deletion attacks may\nhave amplified the general atmosphere of chaos in Ukraine, although the victim\norganizations reportedly suffered only limited real-world disruptions. But within the first\nseveral weeks of the war, Russian cyber fires plummeted in number, impact, and\nnovelty. Cyber fires, although still very high relative to prewar baselines, have barely\nregistered on the grand scale of Moscow’s military ambitions and high-intensity combat\noperations in Ukraine.\n**Cyber fires have neither added meaningfully to Russia’s kinetic firepower nor**\n**performed special functions distinct from those of kinetic weapons. Rather than**\nserving in a niche role, many Russian cyber fires have targeted the same categories of\nUkrainian systems also prosecuted by kinetic weapons, such as communications,\nelectricity, and transportation infrastructure. For almost all these target categories,\nkinetic fires seem to have caused multiple orders of magnitude more damage. While\ncyber fires potentially offer unique benefits in certain circumstances, these benefits\nhave not been realized in Russia’s war against Ukraine. Moscow’s military strategists\nquickly discarded any aim of reducing physical or collateral damage or creating\nreversible effects in Ukraine, and Russia has gained little deniability or geographic\nreach from cyber operations. Likewise, Russian cyber fires have not achieved any\nsystemic effects, and they have arguably been less cost-effective—or at least more\ncapacity-constrained—than kinetic fires.\n**Intelligence collection—not fires—has likely been the main focus of Russia’s**\n**wartime cyber operations in Ukraine, yet this too has yielded little military**\n**benefit. Although intelligence processes are more difficult for outsiders to assess than**\nfires, Russian artillery seems to rely on non-cyber sources of targeting intelligence\n(particularly uncrewed aerial vehicles or UAVs), despite earlier claims that Moscow has\nused malware to geolocate Ukrainian positions. Russian missile forces may have\nreceived some cyber-derived intelligence, but in the handful of known plausible cases,\nthis intelligence does not seem to have been valuable for targeting decisions. Even\ninfluence operations, long central to Moscow’s cyber doctrine, have received only\nminimal known support from Russian hackers. More generally, Russia’s ham-fisted\noverall approach to the war—from its campaign planning to its occupation of seized\nterritory—suggests that key military decisions are not guided by a rigorous all-source\nintelligence process.\n\n\n-----\n\n**While many factors have constrained Moscow s cyber effectiveness, perhaps the**\n**most important are inadequate Russian cyber capacity, weaknesses in Russia’s**\n**non-cyber institutions, and exceptional defensive efforts by Ukraine and its**\n**partners. To meaningfully influence a war of this scale, cyber operations must be**\nconducted at a tempo that Russia apparently could sustain for only weeks at most.\nMoscow worsened its capacity problem by choosing to maintain or even increase its\nglobal cyber activity against non-Ukrainian targets, and by not fully leveraging cyber\ncriminals as an auxiliary force against Ukraine. Meanwhile, Russian President Vladimir\nPutin and his military seem unwilling or unable to plan and wage war in the precise,\nintelligence-driven manner that is optimal for cyber operations. Ukraine, for its part, has\nbenefited from a resilient digital ecosystem, years of prior cybersecurity investments,\nand an unprecedented surge of cyber support from the world’s most capable\ncompanies and governments. Given the many factors at play, even if several had been\nreversed it might still not have significantly improved the overall military utility of\nRussian cyber operations.\n**As the war continues, Russian intelligence collection probably represents the**\n**greatest ongoing cyber risk to Ukraine. Conceivably, Russian hackers might still**\nhave larger impact if they can collect high-value intelligence that Moscow then\nleverages effectively. For example, the hackers might obtain real-time geolocation data\nthat enable the assassination of President Volodymyr Zelenskyy or the timely and\naccurate targeting of Ukrainian forces, particularly those with high-value Western\nweapons systems; conduct hack-and-leak operations revealing sensitive war\ninformation to the Ukrainian and Western public, such as Ukraine’s combat losses,\ninternal schisms, or military doubts; or collect valuable information about Kyiv’s\nperceptions and intentions that can aid Moscow at future talks, among other scenarios.\nRussian cyber fires pose a less serious threat, though such attacks could multiply if\nMoscow directs more of its overall cyber capability toward Ukraine (at the cost of other\nobjectives) or better leverages cyber criminals.\n**Russia’s war in Ukraine offers lessons for other military cyber commands, but**\n**these must be applied to national circumstances and considered alongside a**\n**range of relevant case studies. Russia’s experience suggests that cyber fires can be**\nusefully concentrated in a surprise attack or other major salvo, but they risk fading in\nrelevance during larger, longer wars. Cyber intelligence collection seems to have\ngreater potential than cyber fires to support a variety of wartime military tasks, but this\nprobably depends on having competent analysis and decisionmaking processes and a\nreasonably precise “way of war.” Militaries with high capability, professionalism, and\nreadiness in both cyber and kinetic disciplines—such as the United States and Israel—\nhave previously leveraged cyber operations to enable strikes on high-value targets. Yet\neven top-tier militaries seem to have the greatest cyber successes in tightly\ncircumscribed contexts. It is therefore probably misleading to view cyberspace as a\n“fifth domain” of warfare equivalent in stature to land, sea, air, and space.\n\n\n-----\n\n**Militaries that plan for major war should ask whether they can realistically meet**\n**the high bar of producing and sustaining cyber fires at meaningful levels.**\nMeeting this bar may require huge standing cyber forces—perhaps many times larger\nthan what peacetime or “gray zone” conditions require. Alternatively, militaries could\ndevelop surge capacity mechanisms (reserve forces, for example), which are\nchallenging to implement and risk cannibalizing domestic cybersecurity. The rapid\nregeneration of cyber capabilities is another key hurdle. Given limited wartime cyber\ncapacity, militaries may need to experiment with wave tactics: short bursts of intense\ncyber fires followed by periods of stand-down and regeneration. The more infrequent\nthe waves, the more important it will be to coordinate closely with kinetic fires. If a\ncyber command is unlikely to scale dramatically and regenerate rapidly, it should\nperhaps not aspire to conduct sustained wartime fires in major conflict. It might instead\nprioritize more selective fires in peacetime, gray zone, or prewar conditions, or nonfires activities like cyber defense and intelligence collection.\n**Countries’ investments in cyber intelligence collection should be matched by**\n**equally dedicated efforts to hone intelligence analysis, military planning, and**\n**strategic decisionmaking. As cyber capabilities proliferate, countries may find**\nthemselves able to collect more information than they can accurately interpret and\neffectively use in wartime. In such cases, broad institutional reforms—upgrading\nanalytic tradecraft, instilling professionalism, or combating corruption—will often have\nmore value than further technical enhancements of cyber collection. Countries unable\nto implement those reforms may learn that exquisite military cyber intelligence\ncapabilities aren’t worth the effort to build. Cyber units also need to be fully integrated\ninto all-source intelligence processes that direct them toward information needs which\ncannot be readily fulfilled by other means. Wartime use cases for cyber intelligence\nmight include tracking high-value targets in real time, validating human intelligence in\nmission-critical situations, and acquiring very large data caches with durable,\nmultipurpose value.\n**Cyber defenders should use the Ukraine war as a reference point to reexamine**\n**and refine prior assumptions about the particular wars they might need to fight.**\nTheir first task is to reconsider the likely ability of prospective enemies to leverage\ncyber operations in conflict, given Russia’s humbling experience. They should then\nmake specific comparisons and contrasts to their own military situation. For example,\nChina’s cyber forces are probably larger than Russia’s, but they have carried out far\nfewer cyber fires. Would they execute an even bigger and more effective cyber salvo at\nthe outset of a Taiwan invasion, or bungle the opener due to inexperience? Taiwan is\nmore technologically advanced than Ukraine but its island geography is in some ways\nmore precarious. Would Taiwan’s communications infrastructure prove more or less\nresilient? The political and commercial stakes for Western tech companies could also\nbe quite different in a China-Taiwan war. Would such firms be equally willing to help,\nand could they physically do so without overland access?\n\n\n-----\n\n**This paper s tentative insights represent one reasonable interpretation of**\n**fragmentary, conflicting, and evolving data. Analysts remain reliant on reports from**\nthe Ukrainian government, allied governments, cybersecurity companies, and\njournalists to understand Russia’s cyber operations, their effects, and the larger war in\nUkraine. Yet those sources have only partial knowledge, and parochial concerns\ninevitably shape what, when, and how information is shared. Some sources, for\nexample, have produced fewer public reports in recent months than before. The\nresulting “cyber fog of war” continues to shroud even the most closely watched cyber\nincidents. A wider fog pervades the war as a whole, which has already undergone\nseveral distinct phases in just nine months—often developing in ways that surprise\nWestern analysts (and others). Despite this uncertainty, governments around the world\nwill not wait to incorporate perceived lessons learned into ongoing updates of military\ncyber strategies, budgets, doctrines, and plans. Analysts should offer the best\nassessments currently possible while acknowledging information gaps and the need to\nreassess over time.\n\n## How Militarily Effective Have Russia’s Cyber Operations Been in Ukraine?\n\nSince Russia invaded Ukraine on February 24, 2022, most Western commentators have\ndownplayed the role of offensive cyber operations in Moscow’s larger war effort. Analysts\nhave called Russian cyber operations sparse, unsophisticated, ill-planned, poorly integrated\nwith activities in other domains, ably defended by Ukraine and its foreign partners, and\nultimately inconsequential when compared to the large-scale death and destruction caused\nby physical weapons.\n\nExperts offer competing explanations for how and why Russian cyber operations in Ukraine\nhave fizzled, but most agree on the core military question: cyber operations have not\nsignificantly advanced Moscow’s campaign objectives. James Lewis, for example, found that\n“cyber operations have provided little benefit” to Russia and “failed to advance Russian\ngoals” in the war. Likewise, Nadiya Kostyuk and Aaron Brantly wrote that Russian cyber3\nattacks “did not have any strategic impact on Ukraine’s warfighting capabilities” and “do not\nappear to have impacted the course of the war.” The CyberPeace Institute, which maintains4\na public database of Russia’s cyber operations against Ukraine, said these weren’t “playing a\nmajor role in . . . tactical advances.” Even Microsoft—which has described Russia’s wartime5\ncyber efforts as voluminous, skillful, militarily innovative, and historically important—has\nreported only “limited operational impact” on Ukrainian targets. The company concluded6\nthat, “at a broader level, so far [Russian cyber] attacks have failed strategically in disabling\nUkraine’s defenses.”\n\n\nNot everyone shares this perspective. Prominent dissenters include some Western\ngovernment officials who believe outside analysts have underestimated Russia’s wartime\ncyber efforts against Ukraine. The dissenting camp describes Russian cyber operations as\nsweeping in scale, tactically effective in key moments, and aligned with Moscow’s military\n\n\n-----\n\nobjectives of disrupting, confusing, and cowing the Ukrainian government, armed forces, and\ncivilian population. David Cattler and Daniel Black, two serving intelligence officials with the\nNorth Atlantic Treaty Organization (NATO), argued in April that “cyber-operations have been\nRussia’s biggest military success to date in the war in Ukraine.” Jeremy Fleming, the7\ndirector of the UK’s General Communications Headquarters (GCHQ), called it “a fallacy to\nsay that cyber has not been a factor in the war in Ukraine.” And Matt Olsen, U.S. assistant8\nattorney general for national security, said “we are effectively seeing a hot cyber war in\nUkraine carried out by the Russians.”9\n\nSuch disagreement stems in part from fragmentary, conflicting, and evolving information\nabout Russia’s wartime cyber operations. A case in point was the February 24 disruption of\nthe Viasat satellite communications network by Russian military intelligence—the marquee\ncyber event of the war so far. The hack has attracted enormous interest due to its timing (one\nhour before Russian troops crossed the border), clear military purpose (to degrade Ukrainian\ncommunications), and international spillover (disrupting connectivity in several European\ncountries). Yet the Viasat hack’s ultimate military impact has remained murky and contested.\nVictor Zhora, a top Ukrainian cyber leader, initially said it caused “a really huge loss in\ncommunications in the very beginning of war,” which was widely understood to mean military\ncommunications specifically.10 But a Ukrainian spokeswoman claimed, and Zhora later\naffirmed, there was “no information that [the hack] worsened communications within\nUkraine’s military.” This factual confusion has contributed to diametrically opposed expert11\nassessments of the Viasat hack. Dmitri Alperovitch called it “perhaps the most strategically\nimpactful cyber operation in wartime history,” while James Lewis said it “ultimately did not\nprovide military advantage to Russia.”12\n\n\nEven where analysts share a common set of facts about Russian hacking, they often seem\nto apply differing (or unclear) standards to judge military utility. Commentators of all stripes\nhave framed Russia’s cyber efforts in binary terms: either as a failure or as a success. But\nanalysts differ in where they set the dividing line between success and failure, causing\npeople to talk past each other. On one side are cyber skeptics who often emphasize Russian\nhackers’ inability to paralyze Ukrainian decisionmaking and critical infrastructure via “shock\nand awe” tactics—a high bar indeed. On the other side are cyber proponents who tend to\nhighlight any signs of coordination between Russian kinetic and cyber operations—no matter\nhow inconsequential the results. Given these disparate yardsticks and shifting terms of\ndebate, it isn’t always clear what analysts are arguing about, or whether they disagree at all.\nFor example, Ciaran Martin expressed early cyber skepticism when he warned that “the\ncyber domain may influence the war at the margins, but it will not decide it.”13 Cattler and\nBlack, both cyber proponents, came to a remarkably similar conclusion: “No single domain of\noperations has an independent, decisive effect on the course of war.”14\n\n**Methodology**\n\n\n-----\n\nTo advance the debate, this paper divides Russian cyber operations in Ukraine into two\ncategories, each drawn from military concepts. The first category is cyber “fires.” U.S. military\ndoctrine defines fires as the “use [of] available weapons and other systems to create a\nspecific effect on a target.”15 Cyber fires, then, would be those cyber operations intended to\ndisrupt, destroy, or manipulate data or systems.16 Cyber experts sometimes call these\n“effects operations” or “disruptive and destructive cyber attacks.” Here, the term cyber fires is\nmeant to bring the military context into the foreground, and to invite comparisons (and\ncontrasts) to kinetic fires.\n\nMany assessments of Russia’s cyber operations in Ukraine have focused primarily—or even\nexclusively—on what this paper calls cyber fires. Because of their obvious analogy to kinetic\nstrikes, disruptive or destructive cyber attacks are often thought of as the major way for cyber\nforces to aid military campaigns. But militaries must do much more than carry out attacks,\nand cyber operations have other wartime uses. In U.S. doctrine, for example, fires are just\none of seven so-called joint functions—the military tasks “common to joint operations at all\nlevels of warfare.” The others are command and control, information, intelligence, movement\nand maneuver, protection, and sustainment. Although each of these has some applicability in\ncyberspace, this paper focuses on intelligence—particularly collection—as the second major\ncategory of interest. Intelligence collection is a well-known role for cyber operations during\npeacetime and gray zone conditions, but it has received less attention in the wartime\ncontext.17\n\nAssessing Russia’s cyber operations and their effects on the larger war in Ukraine is no\nsimple task. Analysts must rely on reports from the Ukrainian government, allied\ngovernments, cybersecurity companies, and journalists. Yet each of these sources has only\npartial knowledge of Russian cyber operations, many of which remain hidden. And when\noperations are discovered, their effects can be difficult to judge, either individually or\ncumulatively. There is little data, for example, on how Russia’s cyber campaigns may have\ninfluenced Ukrainian morale—helping either to grind it down or, alternatively, to fuel backlash\nagainst the invasion. Moreover, the visible effects of a cyber operation do not always indicate\nthe perpetrator’s true intentions. For example, Russia’s cyber disruption of a\ntelecommunications network could be a targeted effort to degrade Ukrainian command and\ncontrol before a key battle. Or it might be part of broader attempts to isolate and immiserate\nthe Ukrainian population. Or it may just be an accidental result of a botched intelligence\ncollection operation.\n\n\nThis paper sidesteps some of these issues by focusing on the actual, rather than intended,\neffects of Russian cyber operations. It assumes that many undetected Russian cyber\noperations exist but that they aren’t orders of magnitude more effective than known\noperations. It also looks for indirect evidence of hidden activity. For example, artillery firing\npatterns might reveal whether or not Russian forces have access to real-time, cyber-derived\ngeolocations of Ukrainian positions. And the paper pairs bottom-up analysis (tactically\n\n\n-----\n\nassessing key Russian cyber operations) with top-down analysis (evaluating the totality of\nknown cyber operations) to discern how cyber activities fit into Moscow’s operational plans\nand overall war effort.\n\nAnother challenge is that political or commercial considerations inevitably shape what, when,\nand how information on Russian cyber operations is shared. The Ukrainian government, for\nexample, has a strategic imperative to offer a relatively upbeat picture of the war so that\nWestern partners continue their support and the Ukrainian people maintain their morale. Kyiv\nhas therefore been reticent to fully disclose casualty figures and other combat losses; the\nsame could be true of cyber incidents.18 At times, Ukrainian officials have made implausible\nassertions of cyber success.19 Meanwhile, Western tech companies have market incentives\nto portray their own cybersecurity support to Ukraine as highly successful and strategically\nessential. They may also lack the military expertise to place their findings in context.\nMicrosoft, for example, has been accused of overstating the threat posed by some Russian\ncyber operations, as well as those operations’ significance to military history.20 Conversely,\nvendors victimized by Russia (like Viasat) may want to downplay the real-world effects to\navoid embarrassment. Western governments and journalists have their own limitations and\nparochial interests.\n\n\nThis paper attempts to mitigate source bias in several ways. First, it looks for corroboration\nfrom multiple independent sources, while highlighting when sources conflict or aren’t directly\ncomparable. Second, the paper places more stock in clearcut factual reports (such as\ndescriptions of known intrusions) than in sources’ analytic characterizations (like claims that\nRussian cyber operation are coordinated with kinetic operations). Third, the paper is\ntransparent about sourcing so that readers can draw their own conclusions as appropriate.\n\nUltimately, a “cyber fog of war” continues to shroud even the most closely watched cyber\nincidents. A wider fog pervades the war as a whole, which has already undergone several\ndistinct phases in just nine months—often developing in ways that surprise Western analysts\n(and others). Even so, there is merit in working with the best data and methods available to\nreduce uncertainty and sharpen understanding. Governments around the world will not wait\nto incorporate perceived lessons learned into ongoing updates of military cyber strategies,\nbudgets, doctrines, and plans. Analysts should offer the best assessments currently possible\nwhile acknowledging information gaps and the need to reassess over time. This paper offers\ntentative insights representing one reasonable interpretation of fragmentary, conflicting, and\nevolving data.\n\n**Fires**\n\nRussia’s cyber fires in Ukraine can be categorized in a variety of ways. To understand their\nmilitary significance, this section groups cyber fires by the type of Ukrainian system targeted\n—and therefore the potential benefit to Russian forces—rather than by technical\n\n\n-----\n\ncharacteristics. (Low-level disruptions, such as web defacements and distributed denial-ofservice attacks, are generally excluded.) Later, this section evaluates the level of\ncoordination between cyber and kinetic fires and the possibility of cumulative effects.\n\n**_Against Military Equipment. Moscow’s most tangible military need in Ukraine is to_**\nsuppress and overcome Ukrainian combat power, yet there are no publicly known cases of\nRussian cyber actors directly disrupting military equipment in the field. Ukraine began the\nwar largely reliant on Soviet-era military equipment, much of which presumably had limited or\nno connectivity.21 As the war progressed, Ukraine acquired a large amount of modern,\nforeign-provided weapons and materiel. The U.S. government has long worried that\nAmerican military equipment could be subject to wartime cyber attacks by Russia or others.\nUkraine now uses some of this same equipment against Russian forces, providing a realworld test of these once theoretical concerns. Yet there has been a near-absence of credible\nclaims that Russia has executed successful cyber fires against Ukrainian military systems.\nOne possible exception: The Economist reported in November that unspecified Ukrainian\nmilitary “networks” and/or “kit” had at some point been “penetrated [and] disrupted.”22 It\nwasn’t clear whether the affected systems were fielded military hardware—such as weapons,\nvehicles, radios, and intelligence platforms—or merely traditional computer networks\noperated by the Ukrainian military establishment. Regardless, “the visible effects” were\ndescribed as “surprisingly limited.”\n\n\nKyiv and its suppliers and allies might try to suppress evidence of any cyber disruptions of\nmilitary equipment. According to the Economist, Ukraine has done just that. But if strong\nsecrecy can be maintained over a long period, that suggests a smaller number of less\nconsequential incidents. Conversely, Ukraine would probably struggle to conceal a large\nnumber of incidents with significant battlefield impact. Electronic warfare (EW) provides a\ncase in point. Russia has sometimes used jamming and direction finding to great effect\nagainst Ukraine—for example, degrading Ukraine’s drone capabilities.23 The Ukrainian\ngovernment may wish to withhold this information, but researchers and journalists have\nnonetheless documented it extensively. These same sources have failed to note any\nevidence of disruptive or destructive cyber attacks against Ukrainian military equipment.\n\n**_Against Communications Networks. Although Ukrainian military hardware has not been_**\ndirectly impacted by any known Russian cyber operations, the communications systems\nused by Ukraine’s military, government, and civilian population have suffered several cyber\ndisruptions. The most notable episode occurred just one hour before the invasion, when\nhackers working for the Main Directorate of the General Staff of the Armed Forces of the\nRussian Federation—commonly known as the GRU—perpetrated the so-called Viasat hack.\nViasat is a U.S. company that owns a communications satellite called KA-SAT. It provides\nwholesale satellite broadband services to end users, while an Italy-based company called\nSkylogic operates and supports the ground infrastructure. According to Viasat, Russian\nhackers were able to cause “a partial interruption” of Tooway, “a single consumer-oriented\npartition” of Skylogic’s network that provides broadband service to European customers\n\n\n-----\n\nViasat described the hack as multifaceted and deliberate. The GRU cyber actors first\nlaunched a “targeted denial of service attack [that] made it difficult for many modems to\nremain online.”24 At the same time, they executed “a ground-based network intrusion . . . to\ngain remote access to the trusted management segment of the KA-SAT network.” After\nmoving laterally to reach a sensitive part of the network, the Russians used native software\nto issue “destructive commands” to “a large number of residential modems simultaneously.”\nThese commands “overwrote key data in flash memory on the modems, rendering the\nmodems unable to access the network, but not permanently unusable.”\n\nThe incident had widespread impact, disrupting internet service for “several thousand\ncustomers located in Ukraine and tens of thousands of other fixed broadband customers\nacross Europe,” according to Viasat.25 Some equipment was quickly restored, while other\nmodems reportedly remained offline more than two weeks later, forcing Viasat to ship tens of\nthousands of replacements.26 (Starlink terminals, whose satellite connectivity has for the\nmost part proven resilient, began to arrive in Ukraine four days after the Viasat hack.27)\nThough the bulk of the Viasat disruptions occurred outside Ukraine, Moscow’s primary intent\nwas undoubtedly to degrade Ukrainian communications as Russian troops crossed the\nborder and missiles began striking targets throughout the country. Ukraine’s military and\npolice were publicly known to be Viasat customers, and Victor Zhora acknowledged that “of\ncourse, they were targeting the potential of [the] Ukrainian military forces first.”28 However,\nthe hack’s ultimate military impact continues to be debated.\n\n\nZhora initially said the Viasat hack caused “a really huge loss in communications in the very\nbeginning of war,” which many interpreted to mean military communications specifically.29\nBut a spokeswoman for Zhora’s agency claimed there was “no information that [the hack]\nworsened communications within Ukraine’s military.” Zhora would later specify that Viasat\nprovided only backup connectivity to the military, and that primary landline networks\nremained online during the invasion; therefore, the hack had no military impact.30 However,\non-the-ground sources have painted a different picture of the state of military\ncommunications at the time. Multiple Ukrainian ground commanders who took part in the\ninitial defense of Kyiv have said that Russia “completely jammed the Ukrainians’\ncommunications and satellite networks” during the war’s opening days and weeks. This\neffectively grounded Ukrainian UAVs, cut off normal intelligence channels, and left officers\n“without a link to front-line soldiers.”31\n\nThese reports cited jamming, not hacking, and didn’t mention Viasat specifically. But Russia\nused both methods in concert during its invasion, and they can have complementary effects,\nwhich Ukrainian troops may not have distinguished in the heat of battle. Multiple field studies\nhave confirmed that Russia’s jamming was quite effective during the assault on Kyiv, at least\ninitially and despite causing some blowback on Russian forces’ own communications.32\nGiven the apparent fragility of Ukraine’s front-line communications links, it seems plausible\nthat the loss of Viasat (whether as a primary communications system or a much-needed\nbackup) contributed to the serious problems cited by Ukrainian commanders The\n\n\n-----\n\ncombination of Moscow s traditional electronic warfare and the Viasat hack seemed to give\nRussian forces an edge in many early engagements. Russia’s ultimate failure to take Kyiv is\nirrelevant to this analysis; overall strategic failure does not imply that each tactical line of\neffort, taken on its own terms, added nothing to Russian efforts.\n\nThe high-profile nature of the Viasat hack has obscured the fact that another major Ukrainian\ninternet service provider, Triolan, was the victim of a simultaneous cyber attack.33 Little is\nknown about this event. Triolan was hacked again on March 9, with the attackers reportedly\nforcing “key nodes of the network” to perform a factory reset. Both incidents led to significant\nservice disruptions lasting perhaps one or two days each. Later in March, the state-owned\nUkrtelecom—the country’s largest terrestrial telecommunications provider—suffered what it\ndescribed as “a massive hostile cyberattack” by Russia.34 Again, details are elusive;\nUkrtelecom said that it temporarily “restricted the services for most private users and\nbusiness customers” in order “to secure the network services for Ukrainian military and\ncritical infrastructure users.”35 The net result of the cyber attack and the remedial measures\nwas an 85 percent loss of connectivity, though service was largely restored by the next day.\nKyiv said that military operations were unaffected.\n\n\nTo put these few cyber fires in context, Ukrainians have experienced dozens of significant\ninternet service disruptions due to physical attacks on telecoms equipment and power\nsupplies.36 Russian cyber fires thus amount to an occasional and secondary threat to\nUkrainian connectivity. Overall, Ukraine’s telecommunications networks—while somewhat\ndegraded from prewar baselines—have proven remarkably resilient.37 Key structural factors\ninclude the decentralization of corporate ownership and technical architecture, the agility of\nengineers, the industry’s collaborative wartime spirit, prior investments in cybersecurity, and\nthe availability of supplemental satellite networks like Starlink.38\n\n**_Against Other Computer Networks. Beyond communications networks, Russian cyber_**\nfires have targeted a broad range of other government and commercial networks in Ukraine.\nThe most notable incidents have been destructive cyber attacks that delete data and thereby\nrender systems unable to function, which Victor Zhora described as “the most efficient\nscenario to bring impact to data, to infrastructures, to services.”39 Moscow has carried out an\nenormous number of these attacks, particularly at the outset of the war. As of late June,\nMicrosoft had detected “eight distinct malware programs—some wipers and some other\nforms of destructive malware—against 48 different Ukrainian agencies and enterprises.”40\nThe Ukrainian government reported a similar number: in the first four months of war, fifty-six\ncyber operations impacted the “availability” of Ukrainian systems (that is, they had\ndestructive or disruptive effects).41\n\n\nAlthough cyber attacks are difficult to meaningfully quantify and compare in a like-for-like\nfashion, such figures seem extremely high by any historical standard. For context, the cyber\nintelligence firm Talos has highlighted just eight important wiper incidents (all statesponsored) globally from 2012 to 2018.42 Talos’s numbers, although incomplete, are likely\n\n\n-----\n\nthe right order of magnitude. This suggests that Russia has performed an unprecedented\nseries of destructive cyber attacks against Ukraine—perhaps the largest series of discrete\nattacks ever conducted, and possibly more than Moscow had ever carried out, against all\ntargets, in its entire previous history.44 Citing Russia’s attacks on Ukraine, CrowdStrike called\n2022 “the most active year yet for wipers.”45\n\nThe remarkable scale of Russia’s cyber fires in Ukraine is further indicated by the large\nnumber of destructive malware variants it deployed. Russia used eight to ten unique families\nof destructive malware in the first few months of the war, depending on how these are\ncounted.46 This is a significant portion of all such malware ever known to exist. Lists of\nwipers compiled by researchers have cited anywhere from six to eighteen noteworthy\nvariants deployed by all actors between 2012 and early 2022.47 NATO’s Cattler and Black\nnoted that, on February 24 alone, Russia “successfully deployed more destructive malware\n. . . than the rest of the world’s cyberpowers combined typically use in a given year.”48\n\n\nBy all measures, Moscow invested extraordinary effort and technical resources to execute\nwartime cyber fires against targets such as “Ukrainian government, IT, energy, and financial\norganizations.”49 However, there is little public information about the impact of these events.\nYurii Shchyhol, the director of Ukraine’s cybersecurity agency, claimed in July that “none of\nthe cyberattacks that were carried out in the past four months of this invasion has allowed\nthe enemy to destroy any databases or cause any private data leakage.”50 In contrast,\nMicrosoft stated that Russia “permanently destroyed files in hundreds of systems across\ndozens of organizations in Ukraine,” which “at times . . . degraded the functions of the\ntargeted organizations.” Even so, Microsoft said the victims suffered only “limited operational\nimpact.” Most of the affected organizations have not been disclosed and there are few public\ndetails about how they weathered these incidents.\n\nMoscow’s destructive cyber fires in Ukraine were remarkable not only for their total number,\nbut also for their massive concentration at the war’s outset and their steep drop-off afterward\n(see Figure 1).51 The day before the invasion, hundreds of Ukrainian “systems”—spread\nacross a smaller number of organizations—were targeted, according to Microsoft. Overall,\ntwenty-two organizations faced destructive Russian cyber attacks in the first week of the war.\nBut in the five weeks that followed, Microsoft detected only about three attacks per week on\naverage. By mid-April the figure would drop to just one attack per week, a level that persisted\nthrough late June. Microsoft noted “little to no wiper activity” in August and September,\nfollowed by a small “spike” in October.\n\n\n-----\n\nData from Mandiant and the CyberPeace Institute show broadly similar patterns using\ndifferent methodologies and information sources. Whereas Microsoft tallied the number of\n_organizations attacked, Mandiant has tracked the number of destructive attacks (a single_\nattack may affect multiple organizations). Mandiant found five attacks in the war’s first week.\nAfter that, attacks fell to less than one per week, on average, through October. Notably,\nMandiant identified just one attack in the four-month period from June to September, before\nRussia resumed its destructive attacks in October. The CyberPeace Institute, which compiles\n\n\n-----\n\npublic information about cyber operations affecting civilians, also reported a large cluster of\ndestructive attacks in the first few weeks. It documented no attacks from April through\nOctober.\n\nThis story of destructive cyber fires—a huge surge, rapid decline, and long plateau—mirrors\nofficial accounts. One month into the war, Victor Zhora was already saying that “we do not\nwitness such serious activities as we did at the beginning of the year.”52 In July, Shchyhol\ndescribed a monthslong “relative lull in the number and quality of cyberattacks of our\nenemy.”53\n\n\nMeanwhile, the number of novel malware variants dropped alongside the number of attacks.\nMicrosoft found that Russia debuted four distinct variants in just the first week of the war,\nwhereas no new variant emerged between early April and late June, the most recent\ncompany data. Mandiant likewise saw a spate of new destructive malware in the war’s first\nweek, followed by a trickle over the next two months, and then no new malware from May\nthrough October. The decline of new malware does not inherently mean a lessening of\noperational effects. But it is one of several signs that Russian cyber forces faced growing\nconstraints as the war progressed and initial stockpiles of technical resources were\nexpended. Russian hackers have shifted to more quick-and-dirty methods, according to\nMandiant, leading to more mistakes.54 Zhora said in October that Russian cyber attacks had\nbecome much less sophisticated since April, devolving into “opportunistic behavior” with “no\nparticular strategy.”55\n\nThe military impact of Russia’s individual destructive cyber fires is difficult to judge without\nvictim-level data. Based on the number of attacks alone and Microsoft’s high-level\ncharacterizations of their results, it is plausible that the early salvo contributed somewhat to\nUkraine’s initial shock and confusion immediately after the invasion. But within several weeks\nat most, Russian destructive cyber fires likely receded into the war’s background. To be sure,\neven one state-sponsored data deletion attack per week would be remarkable under\npeacetime or gray zone circumstances (in any country). But it still seems trivial in the context\nof a major war. Russian forces have at times launched hundreds of missiles and thousands\nof artillery rounds per week, inflicting large tangible losses on Ukraine’s military forces,\ncivilian population, and infrastructure.56 There is little reason to think that the dribble of\ndestructive cyber attacks registers on such a scale. To the extent that Ukraine has taken\nreasonable steps in the face of these attacks—backing up the essential data of critical\nsystems, for example—it is hard to see how Russian cyber fires move Moscow much closer\nto achieving its military objectives.\n\n**_Against Industrial Control Systems. Although most Russian cyber fires have targeted_**\ndigital networks, some have attempted to manipulate or damage physical infrastructure\noperated by industrial control systems. To date, however, there is no evidence that such\nefforts have succeeded.\n\n\n-----\n\nOn April 8, the GRU s notorious Unit 74455 sought to disrupt electricity in an unnamed\nUkrainian region by deploying malware inside a compromised utility network.57 This was the\nculmination of a network intrusion that began in February or possibly earlier.58 The payload\nwas a more sophisticated adaptation of malware previously used by Unit 74455 in 2016 to\ninterrupt electric power in part of Ukraine.59 (The unit had done much the same in 2015 using\ndifferent malware.) Once deployed, the new malware was designed to make service difficult\nto restore.60 Zhora said the hackers “planned to cut off 1.5 to 2 million Ukrainians from their\npower supply.”61 Yet this time, Ukraine’s national Computer Emergency Response Team and\nthe Slovakia-headquartered cyber firm ESET detected and stopped the attack in progress.62\nUkraine initially circulated a document saying the hackers had been able to temporarily turn\noff nine substations, but Zhora later called this erroneous preliminary information and said\nthat no power disruption occurred.63 A second failed cyber attack on electric power—\ndiscussed in greater detail below—came to light on July 1.64\n\nCompared to 2015–2016, Moscow’s wartime efforts to disrupt Ukrainian industrial control\nsystems show some technical growth but fewer actual results so far. Meanwhile, Russian\nkinetic strikes on power infrastructure have caused serious problems throughout the country\nduring the entire length of the war. Periodic electricity blackouts have affected hundreds of\nthousands to millions of Ukrainians and lasted hours to weeks.65 The impact on Ukraine’s\nmilitary is unknown, but the civilian suffering has ranged from manageable to severe.66 On\nNovember 4, for example, President Volodymyr Zelenskyy said that 4.5 million Ukrainians\nhad lost power due to a recent spate of Russian kinetic attacks on power supplies.67\n\n\n**_Coordination of Cyber and Kinetic Fires. Since the outset of the war, analysts have_**\ndebated whether Russia’s cyber fires in Ukraine have been coordinated with kinetic\noperations to achieve unified military objectives. The strongest evidence is hiding in plain\nsight: in the twenty-four hours before its invasion, Moscow carried out its most numerous and\ndamaging cyber fires, including the Viasat hack and a massive salvo of destructive\noperations. These attacks would have required significant preplanning and operational\ncoordination to align with the ground and air assault. But how much did Russia’s early\nscheme of maneuver benefit from this cyber-kinetic coordination? Too little is known about\nthe effects of Russian cyber fires to make a very confident assessment. The Viasat hack,\ndiscussed earlier, is the most plausible case of Russian cyber forces contributing to\ncombined arms operations. The hack was near-simultaneous with Russia’s first kinetic\nattacks and may well have aided them—worsening what Kyiv’s front-line ground\ncommanders have called a communications-denied environment that impeded Ukrainian\ndefenses around the capital.\n\nIt was therefore not outlandish for Dmitri Alperovitch to call the Viasat hack “perhaps the\nmost strategically impactful cyber operation in wartime history,” though some qualification\nand context is needed.68 Cyber intelligence operations, discussed later, have been part of\nmultiple modern wars and may outstrip cyber fires in strategic importance. For example, U.S.\nintelligence agencies and military units have used a blend of cyber signals intelligence\n\n\n-----\n\n(SIGINT), and EW capabilities to geolocate and kill hundreds or thousands of individuals in\nIraq, Afghanistan, and elsewhere.69 If we consider only cyber fires, very few have been\nconducted in wartime. The most well-known example is a gray zone incident: in 2007,\nIsrael’s cyber-enabled disruption of Syrian air defenses helped Israeli jets destroy a\nclandestine nuclear site.70 To cyber skeptics, then, Alperovitch’s superlative assessment\nmight be taken as a backhanded compliment—a confirmation that wartime cyber operations\n(or at least, cyber fires) have only modest value.\n\nSince Russia’s initial surge of cyber fires, evidence of cyber-kinetic fires coordination has\nbeen more fragmentary, and the handful of proposed cases seem less militarily\nconsequential. The coordination of cyber and kinetic fires could take several forms. To begin\nwith, Microsoft says that “on several occasions the Russian military has coupled its\ncyberattacks with conventional weapons aimed at the same targets.”71 Microsoft analogized\nthis to “the combination of naval and ground forces long used in an amphibious invasion.”\nAmphibious assaults are highly complex, extended endeavors; a simpler and clearer analogy\nmight be close air support. Just as air assets can be tasked to strike the same tactical targets\nthat ground forces are engaging, so can cyber and kinetic forces.\n\nAccording to Microsoft, Russia has sometimes used “cyberattacks to disable computer\nnetworks at a target before seeking to overrun it with ground troops or aerial or missile\nattacks.” However, the cited examples were inapt. Microsoft highlighted March 2, when it\n“identified a Russian group moving laterally on [a] nuclear power company’s computer\nnetwork. The next day, the Russian military attacked and occupied the company’s largest\nnuclear power plant.” Around the same time, Russia “compromised a government computer\nnetwork in Vinnytsia and two days later launched eight cruise missiles at the city’s airport.”\nBut neither of these “cyberattacks” apparently resulted in any disabling effects, precluding\nthem from classification as successful cyber fires. If they were indeed coordinated with\nphysical attacks, they either failed to achieve their intended effects or they were meant as\ncyber intelligence operations in support of kinetic targeting (discussed later in the paper).\n\n\nA better example emerged on July 1, with Russian kinetic and cyber fires purportedly aiming\nat the same target. That day, a Ukrainian power company called DTEK said that Russia had\nunsuccessfully attempted a cyber attack on the company to “destabilise the technological\nprocesses at power generating and distribution companies.”72 The Russian hacker group\nXakNet, which claims semi-official ties to Moscow, took responsibility.73 At the same time,\nRussian forces were carrying out artillery and/or missile attacks on DTEK’s Kryvorizka\nthermal power plant in Kryvyi Rih, Dnipropetrovsk Oblast. DTEK and Victor Zhora both\nemphasized this connection, with the latter explicitly calling it a case of cyber-kinetic\ncoordination.74 That is one possibility, but additional context suggests that other\ninterpretations are equally if not more compelling.\n\n\n-----\n\nThe Kryvorizka plant is one of eight thermal power plants that DTEK operates across various\nregions of Ukraine.75 DTEK also has numerous other electricity generation, distribution, and\nrelated facilities throughout the country.76 Although Russian troops were clearly firing on\nKryvorizka, the cyber attack has not been described as targeting Kryvorizka specifically; it\ncould have been aimed at another DTEK facility or none in particular. Moreover, Russia\nreportedly shelled Kryvorizka multiple times in the weeks and months before and after the\ncyber attack—including on April 27,77 July 18,78 and August 2.79 And at the time of the cyber\nattack, Russia was launching missile, artillery, and air strikes not only at Kryvorizka but also\nacross Dnipropetrovsk and three neighboring oblasts, among other locations.80 Russian\nkinetic attacks on Ukrainian power infrastructure have been a routine feature of the war.81\n\nAll this suggests the possibility of a spurious correlation between the cyber and kinetic fires\non July 1. Indeed, DTEK noted that Russian cyber activities against the company began to\n“spike” months earlier, in March, following the company’s public support for a boycott of\nRussian energy. DTEK argued that Russia developed a “special focus” on it due to “the firm\nand proactive position taken by the company’s shareholder Rinat Akhmetov with regards to\nRussia’s barbaric war against Ukraine and massive assistance [DTEK] provided to the\nUkrainian army and support to Ukrainians.”82 This political motive for the cyber attack, if\naccurate, would undercut the notion that XakNet’s main purpose was to support the tactical\naims of Russian troops in the field.\n\n\nMicrosoft acknowledged that it has been “been rare from our perspective” for “computer\nnetwork attacks” to “immediately precede[] a military attack.”83 It therefore outlined a second,\nlooser category of cyber-kinetic fires integration: threat activity targeting “the same sectors or\ngeographic locations around the same time as kinetic military events.” As an example,\nMicrosoft cited a destructive cyber attack by suspected Russian actors “against a major\nbroadcasting company on March 1, the same day that the Russian military announced its\nintention to destroy ‘disinformation’ targets in Ukraine and directed a missile strike against a\nTV tower in Kyiv.” While such cases might indicate “active coordinati[on],” Microsoft rightly\nobserved that they could also mean that “computer network operators and physical forces\nare just independently pursuing a common set of priorities.” Regardless, the March 1 case\nimplies some unity of operational objective between cyber and kinetic fires. It raises two\nfurther questions: How common is this phenomenon, and how valuable is it for Russian\nmilitary operations?\n\nThe Economist reported in November that “American, European and Ukrainian officials all\nsay that there are many examples of Russian cyber-attacks synchronised with physical\nattacks.” 84 However, very few such examples have been publicly described, and many—if\nnot most—are uncompelling.\n\nFor example, Microsoft argued that Russia’s late-October barrage of missile and drone\nstrikes on Ukrainian energy and other civilian infrastructure was “accompanied by\n\n[destructive GRU] cyberattacks on the same sectors. . . . The repeated temporal, sectoral,\n\n\n-----\n\nand geographic association of these cyberattacks by Russian military intelligence with\ncorresponding military kinetic attacks indicate a shared set of operational priorities and\nprovides strong circumstantial evidence that the efforts are coordinated.”85 In support,\nMicrosoft cited five cyber incidents: one targeting Ukrainian and Polish transportation and\nlogistics companies, and four targeting other “critical infrastructure.” Yet none of these\nincidents apparently targeted energy infrastructure, which was the primary focus of Russia’s\nOctober missile barrage. To be sure, it is still notable that Russia in October resumed its\ndestructive cyber fires (after a lengthy quiet period) while also greatly intensifying its missile\nand drone strikes. This may reflect some high-level alignment, even if close tactical\ncoordination remains unproven.\n\nThe very small number of reported examples suggests that it may not be particularly\ncommon for Russian cyber and kinetic fires to strike similar targets at similar times. Although\nthe dearth of examples could reflect information gaps, it seems noteworthy that Microsoft—\nwhich has spent hundreds of millions of dollars monitoring and securing Ukrainian networks,\nand has participated actively in public debates about the war’s cyber dimensions—has only\ncatalogued a few suggestive incidents.86 In addition to these specific incidents, Microsoft has\nproposed a general geographic correlation between Russian cyber operations and kinetic\nattacks. Combining proprietary cyber data with third-party information on kinetic activities,\nMicrosoft found that “high concentrations of malicious network activity,” though not\nnecessarily fires, “frequently overlapped with high-intensity fighting during the first six-plus\nweeks of the invasion.” However, the correlation was observed at the level of oblast, or\nprovince. Ukraine’s oblasts average more than 9,000 square miles in size—probably too\nlarge to make useful judgments of this kind. Furthermore, the degree of correlation was quite\nlimited. Cyber and kinetic activity matched (that is, “high-high” or “low-low”) in fifteen oblasts,\nwhereas it did not match (that is, “high-low” or “low-high”) in nine oblasts.\n\n**_Effectiveness of Integrated Cyber-Kinetic Fires. Russia has probably achieved some_**\nunity of purpose with certain cyber and kinetic fires, primarily through loose alignment and\nmore rarely via close coordination. But it is essential to ask, once again, what military\nbenefits this has yielded. The question of military gains must continually be brought back to\nthe foreground in any strategic analysis of Russia’s wartime cyber operations.\n\n\nConsider another case highlighted by Microsoft: an unspecified “Dnipro government agency\n\n[was] targeted with [a] destructive implant” on March 11, the same day that the “first direct\nRussian strikes hit Dnipro government buildings, among others.”87 Further information about\nthe cyber attack is not publicly available, but Ukraine’s State Emergency Service announced\nthat three Russian airstrikes that day landed near a preschool and an apartment building and\nstruck a shoe factory (none of these were described as government buildings).88 One person\ndied. At this stage of the war, Dnipro had been largely spared from Russian attack, despite\nsome unverified earlier reports of limited strikes on noncivilian areas.89 The simultaneous\noccurrence of a destructive cyber attack and the first major Russian strikes on the same city\nis strong evidence of cyber-kinetic fires coordination—perhaps the best candidate since\n\n\n-----\n\nFebruary 24. It could be an example of what Max Smeets has called pooled\ninterdependence,” where cyber and kinetic actions “may not directly depend on each other,\n\n[but] each provides individual contributions to the same goal.”90\n\nThe military significance of these coordinated fires must be assessed in the context of\nRussia’s campaign plans. In the preceding days, Russia had been observed massing troops\nwest of nearby Kharkiv, for the likely purpose of “launch[ing] a wide offensive southwest” to\n“encircle” and assault Dnipro and other cities in the area.91 Russia may therefore have\nintended to stoke fear and panic by striking civilian targets in Dnipro, setting the\npsychological conditions for its planned siege of the city.\n\n\nLacking evidence of the cyber attack’s effects, we can explore plausible best-case scenarios\nfor Russia. The cyber attack may perhaps have added to a sense of unease among city\nofficials or residents, especially if it succeeded in deleting data. However, the death and\nphysical destruction caused by the missile strikes would presumably have had far greater\npsychological impact. Given that the cyber attack targeted a government agency, it could\nconceivably have hindered local officials’ response to the missiles—provided that the\naffected agency was related to the strike targets, or was involved in emergency services,\npublic communication, or the like. The impact of such a cyber attack would depend on its\nsophistication as well as the digital and operational resilience of the targeted agency. An\nextreme best-case scenario for Russian cyber forces would posit that the missile wounded\nbut did not initially kill the Ukrainian victim, and the cyber attack then delayed emergency\nmedical services long enough to cause death. (A direct link between a cyber attack and a\nfatal delay in medical care has been alleged only twice, globally, and not yet proven.92)\nSpeculatively, then, the cyber attack had somewhere between zero and marginal military\nbenefits for Russian operations in the area.\n\nThis operational-level assessment can, in turn, be translated to the strategic level by\nconsidering the relevance of Dnipro to Moscow’s larger war efforts. Although Russia looked\npoised to attack the city on March 11, it lacked the combat power to actually do so, according\nto the Institute for the Study of War. The relevant Russian forces were bogged down by “the\nprotracted siege of Mariupol” and faced “the continued ability of Ukrainian forces to carry out\nsuccessful local counterattacks” near Kharkiv.93 By the time Russia took Mariupol, it had\nmissed the window to attack Dnipro. Moscow’s push into central Ukraine was proving\nunsustainable and its overall war plan had clearly failed. Within weeks, Russian leaders\nwould finally accept this reality and shift to a near-exclusive focus on eastern Ukraine.94 In\nthe months since, Dnipro has not again been threatened by Russian troops, though it has\nfaced intermittent missile strikes on civilian and defense-related infrastructure.95\n\n\nUltimately, then, the March 11 cyber-kinetic fires on Dnipro were largely wasted efforts. This\ncase study shows the complexity of assessing the military impact of cyber-kinetic\ncoordination. Even tactically effective and operationally well-conceived combined-fires\nactions can only contribute to strategic success if a sensible overall war plan is in place (see\n\n\n-----\n\nTable 1). Granted, a single fires action of any kind can only have so much impact. But this\ncyber operation was one of just several dozen Russian destructive attacks known to have\noccurred during the entire war. Within such a small universe of operations, the impact of\neach one matters in assessing the overall importance of Russian wartime cyber activities.\n\nTable 1. Dnipro Case Study—\nSpeculative Best-Case Russian\nBenefits From Kinetically\nCoordinated Cyber Attack on March\n11\n\n**Tactical** Modest. Permanent deletion of data in one local\ngovernment agency.\n\n**Operational** Marginal. Delay of emergency response to the\nmissile strikes, contributing to one death.\n\n**Strategic** None. The cyber-kinetic strikes were intended to\nsupport a later ground assault that was militarily\nunachievable, part of a soon-abandoned war plan,\nand ultimately never attempted.\n\n**_Cumulative Impacts. Russia’s ability to coordinate cyber and kinetic fires, although_**\nimportant, is not necessarily determinative. Fires can have military effects even when they\nare poorly or loosely coordinated across weapon systems and domains. For example,\nMoscow has seized and held a fair amount of Ukrainian territory despite serious, persistent\nproblems in traditional combined arms integration. The Russian way of war is quite\nimprecise: in Ukraine, Russian forces have generally sought to disrupt and demoralize\nUkraine’s society, government, and armed forces. Their cruder and more diffuse methods\nhave included random attacks on civilians in Russia-controlled areas, rape as a tool of war,\nand terroristic missile strikes on civilian areas of cities far from the front lines. Russian tactics\nhave only become more indiscriminate as the war has dragged on. Yet this does not mean\nthey have had no military effect. By the same token, Russia’s large-scale cyber fires should\nbe assessed for their possible cumulative impact in Ukraine, notwithstanding their limited\ncoordination with kinetic operations.\n\nFrameworks for assessing the battle damage of individual cyber operations remain\nimmature; understanding cumulative impact is even harder.96 Still, rough orders of\nmagnitude may be discernible and can have utility for analysts and policymakers. One\napproach is to loosely compare the total effects of cyber and kinetic fires, based on available\nquantitative and qualitative metrics. This can be done from two complementary perspectives.\nCyber fires can be understood as direct equivalents of kinetic fires, or alternatively, as\nserving distinctive functions based on their unique features.\n\n\n-----\n\nTable 2 directly compares some of the total effects of Russian cyber and kinetic fires against\nsimilar classes of Ukrainian targets.97 This exercise has obvious limitations, both empirical\nand conceptual. Missile strikes are not the same as data deletion attacks, and the various\nmilitary effects of each haven’t been fully documented in Ukraine. More fundamentally, high\nnumbers of attacks, body counts, and damaged targets do not equate to successful\nwarfighting. Even so, it is revealing that, during the first four months of the war, Russia\ncarried out 3,654 missile strikes but only about fifty destructive cyber attacks, according to\nUkrainian and Microsoft data.98 And it is fair to surmise that each missile strike, on average,\nhad greater military benefits for Russia than each destructive cyber attack. One can imagine\npossible counterexamples—such as a destructive cyber attack that paralyzes Ukrainian rail\nshipments and thereby delays the delivery of critical supplies to a contested front—but there\nis no evidence of any (except possibly the Viasat hack).99 Rather, Microsoft has reported\n“limited operational impact” from data deletions, whereas missile strikes have destroyed\nmany strategic Ukrainian assets such as military bases, heavy weapons plants, and port, rail,\nand air infrastructure, in addition to civilian targets.\n\nTable 2. Direct\nComparison of\nRussia’s Cyber\nand Kinetic Fires\n\n**Target type** **Cyber fires effects** **Kinetic and EW fires effects**\n\n\n**Weapons**\n**systems and**\n**material**\n\n**Military**\n**communications**\n\n**National/civilian**\n**communications**\n\n\nNo publicly known cases of\ncyber disruption to any\nUkrainian or foreignprovided weapons systems\nor other military equipment.\n\nA one-time disruption of\nthousands of Viasat\nmodems, lasting days to\nweeks during the initial\ninvasion, plausibly\ncontributing to the partial\ndenial of Ukrainian frontline communications during\nRussia’s assault on Kyiv.\n\n5 provider-level telecoms\nservice disruptions, lasting\nhours to weeks, due to\nRussian cyber attacks as of\nMay 1. Probably limited\ndisruption to Ukrainian\nmilitary; manageable\ncivilian suffering.\n\n\nUkrainian losses of 10,000 troops,\n1,300 infantry fighting vehicles, 400\ntanks, and 700 artillery systems from\nkinetic attacks as of June, according to\nKyiv.\n\nRepeated, intense jamming of satellite\nand radio communications both during\nand after the initial invasion, at times\nseriously degrading Ukraine’s military\ncommunications and hindering its\nbattlefield performance.\n\n21 provider-level telecoms service\ndisruptions, lasting hours to weeks, due\nto Russian kinetic strikes on power and\ntelecoms infrastructure or war induced\nfinancial problems as of May 1.\nProbably limited disruption to Ukrainian\nmilitary; manageable civilian suffering.\n\n\n-----\n\nTable 2. Direct\nComparison of\nRussia’s Cyber\nand Kinetic Fires\n\n**Electrical power** No known disruptions\ncaused by cyber attacks as\nof early November. Two\nknown failed attempts.\n\n**General/other** Roughly 50 Ukrainian\norganizations affected by\ndestructive cyber attacks\nas of late June. Limited\noperational impact.\n\n\nPeriodic blackouts affecting hundreds of\nthousands to millions of Ukrainians,\nlasting hours to weeks, due to Russian\nkinetic strikes on power infrastructure.\nUnknown impact on Ukrainian military;\nmanageable to severe civilian suffering.\n\n3,654 missile strikes as of late June,\ndestroying or damaging strategic\nUkrainian assets such as military bases;\nheavy weapons plants; port, rail, and air\ninfrastructure; and civilian targets.\n20,000 artillery strikes per day as of\nJuly, killing thousands of Ukrainians and\ncausing massive infrastructural\ndamage.\n\n\nMany analysts resist a direct comparison between cyber “weapons” and their kinetic\ncounterparts. Instead, they emphasize the distinctiveness of cyber operations, such as their\nability to achieve reversible, deniable, or systemic effects. The unique features of cyber fires\nindicate that militaries might sometimes use them in different situations, or for different\npurposes, than kinetic fires. Table 3 evaluates these features in the context of Russia’s cyber\nactivity in Ukraine. It suggests that Russia has not taken advantage of them during the\nwar.100\n\nTable 3.\nRussia Has\nNot\nLeveraged\nthe Unique\nAdvantages\nof Cyber Fires\nin Ukraine\n\n\n**Unique**\n**advantage of**\n**cyber fires**\n\n\n**Russian results**\n\n\n-----\n\nTable 3.\nRussia Has\nNot\nLeveraged\nthe Unique\nAdvantages\nof Cyber Fires\nin Ukraine\n\n**Limited**\n**physical and**\n**collateral**\n**damage**\n\n**Reversible**\n**effects**\n\n\nRussia’s initial war plan arguably aimed to limit the amount of permanent,\nphysical, and collateral damage in Ukraine to facilitate eventual\noccupation. Yet Russian data deletion attacks peaked during this early\nperiod, indicating a willingness to cause permanent damage (at least\ndigitally) to Ukrainian organizations. Regardless, what Russian restraint\nthere was did not last long. Once the invasion foundered, Russia began to\ninflict broad-based suffering, terror, and destruction in Ukraine—both as a\nmeans of political pressure and due to lack of military professionalism. To\nwhatever extent Russia has been restraining its cyber fires in Ukraine,\ncontinuing to do so would contravene its overall strategy and produce no\nsignificant benefits.\n\n\n**Deniability** Moscow frequently portrays its war as less brutal than it is and seeks to\nblame Ukraine for Russian atrocities. Cyber operations might conceivably\noffer an extra layer of deniability. Under wartime conditions, however, this\ndeniability is even more implausible than usual. Observers have generally\nassumed that Russia is culpable for all significant cyber operations\nagainst Ukraine since the invasion began. More fundamentally, it is\nRussia’s heinous kinetic attacks on civilians that have permanently\nscarred its international reputation. Deniability of Russian cyber attacks is\nbeside the point when most Ukrainians and much of the world see Putin\nas a historic war criminal.\n\n\n**Geographic**\n**reach**\n\n**Cost-**\n**effectiveness**\n**and**\n**scalability**\n\n\nPrior to the 2022 invasion, cyber operations offered Russia a way to act\ninside Ukraine without physically exposing its personnel and equipment.\nBut once the war began, Russian kinetic attacks—especially missiles—\nbecame able to strike anywhere in the country.\n\nA cyber operations unit operating inside Russian territory is likely cheaper\nthan a comparably sized combat arms unit that must be forward deployed\nand supported by a long logistical tail. However, once Russia committed\nto a large-scale invasion of Ukraine, many of the primary costs of physical\ndeployment became fixed and sunk. To the extent that Russian cyber\nforces remain relatively cheap, this has not rendered them relatively\navailable for use at scale. Russia has been able to launch thousands of\nmissiles and perhaps millions of artillery shells due to “vast stockpiles” of\nSoviet-era munitions—and “by some estimates, several years’ worth still\nremains.” In contrast, Russia has mustered only dozens of significant\nknown cyber fires.\n\n\n-----\n\nTable 3.\nRussia Has\nNot\nLeveraged\nthe Unique\nAdvantages\nof Cyber Fires\nin Ukraine\n\n**Systemic**\n**effects**\n\n\nCyber fires can theoretically cause systemic effects if they spread widely,\nexploit single points of failure, or trigger cascading impacts on a series of\ninterconnected systems. Russia demonstrated this with its 2017 NotPetya\ndestructive attack, which disrupted hundreds of Ukrainian organizations\nand many others around the world, causing $10 billion in economic\nlosses. However, no similar “wormable” malware has been detected since\nthe invasion, and Russia’s known cyber fires have not had any visible\ncascading effects. In comparison, Russia’s kinetic strikes on electric\npower infrastructure have resulted in failures of water, telecoms, and\nother basic services, with likely third-order impacts as well.\n\n\n**_Conclusion. Overall, cyber fires have not added meaningfully to Russia’s kinetic firepower,_**\nnor have they performed special functions that kinetic weapons could not. Rather than\nserving in a niche role, many Russian cyber fires have targeted the same categories of\nUkrainian systems also prosecuted by kinetic weapons—such as communications, electricity,\nand transportation infrastructure. For almost all these target categories, kinetic fires seem to\nhave caused multiple orders of magnitude more damage. Although cyber fires potentially\noffer unique benefits in certain circumstances, these benefits have not been realized in\nRussia’s war against Ukraine. Moscow’s military strategists quickly discarded any aim of\nreducing physical or collateral damage or creating reversible effects in Ukraine, and Russia\nhas gained little deniability or geographic reach from cyber operations. Likewise, Russian\ncyber fires have not achieved any systemic effects, and they have arguably been less costeffective—or at least more capacity-constrained—than kinetic fires.\n\n**Intelligence Collection**\n\nCompared to their focus on cyber fires, commentators have paid much less attention to\nwhether and how cyber intelligence collection may be supporting the Russian war effort. For\nexample, Lennart Maschmeyer and Myriam Dunn Cavelty argued that Russia has not carried\nout “cyberwar” in Ukraine, equating this concept with “high-level, destructive cyberattack[s]\non civilian critical infrastructures.”101 While acknowledging that “cyber operations . . . remain\nuseful for stealthy intelligence operations,” Maschmeyer and Cavelty nevertheless treated\nintelligence collection as something outside of “cyberwar.” Similarly, Chris Krebs wrote that\n“Moscow’s proven cyber capabilities took a back seat in the overall [Russian war]\nstrategy.”102 He based this broad assessment on a narrow look at Russia’s disruptive and\ndestructive cyber attacks, without addressing cyber intelligence operations. Likewise, Erica\nLonergan, Shawn Lonergan, Brandon Valeriano, and Benjamin Jensen observed in the\n\n\n-----\n\ncontext of Ukraine that cyber operations don t win wars, but instead support espionage,\ndeception, subversion and propaganda efforts.”103 This dichotomy omits the fact that\nespionage during wartime might indeed help one side win.\n\nIn fact, intelligence collection accounts for a significant portion, perhaps even a majority, of\nMoscow’s wartime cyber operations in Ukraine. Ukraine’s national cybersecurity agency has\nreported that “enemy hackers” carried out 242 “information gathering” operations during the\nfirst four months of the war.104 By comparison, the agency counted only 56 cyber operations\nthat affected the “availability” of Ukrainian systems (that is, cyber fires). To be sure, cyber\noperations are difficult to meaningfully quantify and accurately characterize. The same\nUkrainian government document counted an even greater number of cyber operations (498)\nas falling into ambiguous categories—such as “intrusion,” “intrusion attempt,” or “malicious\ncode”—that do not indicate a clear perpetrator intent or operational outcome. The\nCyberPeace Institute, which relies on public data and records only cyber incidents impacting\ncivilian systems, gives a lower total number of incidents. Still, it too shows that data thefts\n(43) were more frequent than destructive cyber attacks (15) from late February through\nOctober.105 (CyberPeace also recorded 103 disruptive cyber attacks during this period—\nmostly low-level incidents that are easy to carry out and have limited impact.)\n\n\nThese figures are far from definitive, but they match what one might expect. Militaries at war\ndo more than just launch attacks: intelligence remains a crucial task, even after fighting\nbreaks out. U.S. doctrine, for example, defines intelligence as one of seven joint military\nfunctions—equivalent in stature to fires. And we know from peacetime and gray zone\nconditions that cyber operations can be a powerful espionage tool. This may be no less true\nin wartime. To remedy the lack of attention given to Russian wartime cyber intelligence\ncollection, this section assesses some key ways that such collection might aid Moscow’s\nlarger war effort: by providing support to strategic planning, targeting, occupation activities,\ninfluence operations, and/or negotiations.\n\n**_For Strategic Planning. In the lead-up to February 24, the critical military decisions for_**\nMoscow were whether, when, and how to attack Ukraine. Putin’s process for making these\ndecisions is unclear, but a rational leader would want intelligence assessments of Ukraine’s\nability and willingness to resist an invasion (among other topics), and Russian security\nservices made significant efforts to meet this need. Ukrainian officials say their intercepts\nshow that, from 2019 to 2021, the Russian Federal Security Service (FSB) unit responsible\nfor Ukraine quintupled in size.106 Moscow recruited Ukrainian spies not only to provide\nsensitive information but also to prepare acts of subversion and to facilitate political handover\nin the event of a Russian invasion. More than 800 Ukrainians—including some senior\nintelligence officers and opposition politicians—have recently been accused of covertly\nworking for Russia. Moscow supplemented these human intelligence (HUMINT) activities\nwith other kinds of collection. A research firm “with close ties to the FSB” conducted\n\n\n-----\n\nextensive polling in the run-up to the war, quer[ying] Ukrainians about invasion scenarios in\nextraordinary detail” to determine how ordinary people would view Russian invaders and\nwhether they would fight back.\n\nInformation gleaned from cyber operations was probably also part of Moscow’s intelligence\npicture. Western analysts have long believed that Russia has pervasively penetrated\nUkrainian phone networks.107 In 2014 and 2017, for example, U.S. officials accused Russia\nof repeatedly recording and leaking sensitive, high-level phone conversations between\nWashington and Kyiv. Until 2014, most Ukrainian telecoms networks were owned by\nRussians or Russian-Ukrainians. While this changed after the annexation of Crimea,\nMoscow’s likely former knowledge and access could still be facilitating ongoing intrusions.\nRussia’s cyber espionage, much like its HUMINT activities, grew in the run-up to war.\nMicrosoft reported that “as 2021 progressed, threat actors representing multiple Russian\ngovernment security services converged on Ukraine to surveil or compromise organizations\nthat could provide valuable intelligence on a Ukrainian military, diplomatic, or humanitarian\nresponse to Russian military action.”108 The “target pool” included “Ukrainian defense,\ndefense industrial base, foreign policy, national and local administration, law enforcement,\nand humanitarian organizations.”\n\n\nIt is difficult to judge the utility of Russia’s prewar cyber intelligence collection. We lack\nconcrete insight into what information Russian hackers were able to obtain from Ukrainian\nnetworks, how analysts in Moscow weighed cyber intelligence against data gathered from\nother sources, what assessments were ultimately communicated to Putin, and how these\nreports might have influenced his final decisions to approve and execute the initial war plan.\nWhat we do know is that Moscow grossly underestimated Ukraine’s political and military\nstaying power, likely for a multitude of reasons.109 Russian intelligence agencies have been\nblamed for their unreliable human sources in Ukraine, their embezzlement of funds, their\nhistory of deficits in analytic capability, their poisonous inter-service rivalries, and their lack of\ncandor (both internally and when communicating with Putin). Meanwhile, Putin-watchers\nhave suggested that ideological fervor and poor judgment led him to misinterpret or discount\nthe information available to him. While Kremlinologists debate these factors’ relative\nimportance, the overall picture seems clear: deep institutional weaknesses prevented the\nRussian state from accurately assessing Ukraine’s politico-military situation.110 In such an\nenvironment, cyber intelligence collection—no matter how exquisite and voluminous— may\nhave had limited relevance.\n\n**_For Targeting. Perhaps the most obvious wartime use of cyber intelligence collection is to_**\nprovide targeting information for kinetic attacks. This can be done in many different ways,\ntwo of which are explored below.\n\n\nFirst, Russia could use cyber operations to surveil and reconnoiter potential high-value\ntargets for deliberate, precision strikes. Moscow has launched thousands of missiles, air\nstrikes, and precision artillery rounds during the war.111 Russian stockpiles were large but\n\n\n-----\n\nfinite, suggesting the potential value of intelligence in confirming the importance of priority\ntargets and identifying specific aimpoints to cause maximum lasting damage. Although\nRussian forces have frequently used precision weapons against less significant targets, they\nhave achieved greater impact when attacking strategic Ukrainian assets such as the Yavoriv\nmilitary base (destroyed by a thirty-missile salvo) and heavy weapons manufacturing\nplants.112 Other frequent targets of Russian strikes include port, rail, air, and energy\ninfrastructure, as well as residential and commercial areas (likely targeted to terrorize the\npopulace).113\n\nIt is inherently hard to observe whether and how Russian cyber intelligence operations are\ninforming deliberate strikes. Still, Microsoft has highlighted two cases where a Russian\nnetwork intrusion was followed several days later by a Russian missile strike on a seemingly\nrelated target. On March 4, assessed GRU cyber actors “compromised a government\ncomputer network in Vinnytsia”114; two days later, Russia launched eight cruise missiles that\ndamaged military and civilian portions of the Vinnytsia airport, including two control towers\nand an aircraft.115 Separately, on April 29, another GRU cyber actor was seen “active[ly\noperating] within” a “transportation sector network” in Lviv; four days later, Russia missiles\nstruck electrical substations alongside Lviv’s railway.116 In both cases, the timelines make it\nplausible that Russian cyber actors were feeding intelligence to missile targeteers. However,\nmore detailed information would be needed to support such an assessment and evaluate its\nsignificance.\n\n\nFor example, Microsoft has not said whether the compromised Vinnytsia government\ncomputer network had any connection to the airport, and if so, whether Russian hackers\nobtained any data relevant for missile targeting. Assuming they did, the next question would\nbe whether cyber espionage actually enhanced the missile strikes’ effectiveness—that is, by\nhelping to confirm the target’s priority and/or refine the aimpoints, and to do this more\naccurately or rapidly than non-cyber intelligence sources could. By way of example, Russia\napparently relied on HUMINT agents to designate certain strike targets in the early hours of\nthe war.117 But some of these agents provided outdated information that failed to account for\nlast-minute dispersal of aircraft and air defense systems. Had Russian strikes been informed\nby cyber-enabled communications intercepts or real-time geolocation of key assets and\nunits, Moscow might have had more success in initial operations, such as the crucial\nairborne assault on Hostomel’s Antonov Airport.\n\nFrom the sparse data available, it isn’t obvious that cyber intelligence would have been\nimportant for the Vinnytsia or Lviv strikes. Cyber espionage would not be needed to discern\nthe Vinnytsia airport’s military importance: its dual-use status was public knowledge, and\nradar tracks would have confirmed the frequency and patterns of military and civilian flights.\nKey infrastructure targeted by the missiles—including control towers—was readily identifiable\nin satellite imagery. The Lviv railway and substations were also in plain sight, though it is\nconceivable that Russian cyber espionage helped to confirm the railway’s logistical\nimportance and its dependence on the targeted substations (Microsoft assessed that an\n\n\n-----\n\nunrelated GRU cyber operation in Ukraine and Poland almost certainly collected intelligence\non supply routes and logistics operations that could facilitate future attacks.”118) Even so, the\nstrike’s ultimate military impact remains unclear. The day that it happened, a senior U.S.\ndefense official said that “we’re still assessing sort of the damage, [but] it’s not clear that\nthey’ve been very accurate in trying to hit that critical infrastructure, and there’s been no\nperishable impact that we’ve seen to impeding or in any other way obstructing with the\nUkrainians’ ability to replenish and restore themselves.”119 Microsoft would later state that\nthe Lviv missile strike “disrupt[ed] transport service” in “a key logistical center for the\nmovement of military and humanitarian aid.”120\n\nIn addition to informing the deliberate targeting process for strategic missile and airstrikes,\nRussian cyber actors might also try to geolocate groupings of Ukrainian forces in real time to\nsupport tactical fires such as artillery. The sheer firepower of Russian artillery has been a\ncrucial factor for Moscow, “offsetting” the “generally mediocre performance of Russia’s\nground forces” for much of the war.121 Many of Russia’s artillery fires have been crude and\nterroristic: “sustained bombardment,” often “overwhelming and indiscriminate,” has “levelled\n\n[civilian] settlements and infrastructure” in cities such as Kharkiv, Chernihiv, and Mariupol.\nBut well-aimed artillery fires have also been crucial to Russia on the battlefield, “preventing\nUkrainian forces from massing to counterattack and causing considerable attrition to those\nunits holding the line. . . . Particularly in Sievierodonetsk, Russian artillery was the key to\npreventing Ukrainian forces from turning the tables in the close fight as they did in the Battle\nfor Kyiv prior to the Russian withdrawal from that axis.” With Russia firing about 20,000\nshells per day as of July, granular targeting intelligence (perhaps from cyber operations)\ncould perhaps have substantial effect.122\n\n\nSome believe that Russia already demonstrated such a cyber capability in the pre–2022\nDonbas conflict. CrowdStrike has claimed that, from 2014 to 2016, GRU cyber actors tricked\nUkrainian soldiers into downloading a malicious version of an artillery targeting app. The\ninfected app was capable of harvesting the victims’ “gross locational data,” potentially\nenabling pro-Russian units to “identify the general location of Ukrainian artillery forces and\nengage them.”123 The malware by itself could not geolocate users with sufficient accuracy to\n“directly facilitate” counterbattery fire. Rather, the harvested data were said to reveal a rough\narea for later search by pro-Russian UAVs, which would then “finalize” the targeting process\nusing overhead imagery. The Ukrainian government, the app designer, and some Western\ncyber analysts disputed CrowdStrike’s report—casting doubt on the existence of the\ncompromise, the attribution to Russia, and the claimed battlefield effects. The company\nlargely stood behind its analysis.124\n\nSo far, no similar reports have emerged since the 2022 invasion, despite Ukrainian forces’\neven more widespread and effective use of apps for artillery targeting and other purposes.125\nRussian cyber actors might have a variety of ways to try to geolocate Ukrainian units—for\nexample, by compromising cell networks. But field research and interviews in Ukraine have\nnot uncovered any evidence of Russian artillery fire being cued by cyber-enabled\n\n\n-----\n\ngeolocation. Rather, a detailed report by Jack Watling and Nick Reynolds found that Russian\nartillery units use UAV reconnaissance, EW direction finding, acoustic reconnaissance, or\ncounterbattery artillery radar to find Ukrainian positions.126 Of these, only UAV\nreconnaissance was able to consistently cue somewhat timely and accurate Russian artillery\nfire; other mechanisms were more bogged down by “systemic friction and slowed\nresponsiveness” in Russian battlefield communication, coordination, and decisionmaking.\nThis suggests that if Russian cyber actors have somehow geolocated Ukrainian forces\nwithout their knowledge, the resulting data must still be confirmed or refined through\noverhead imagery—much as CrowdStrike had supposed.\n\nInstead of hacking cell phones to acquire real-time geolocation, Russian cyber actors might\ntry to find Ukrainian military equipment by hacking it directly. But there have been no\ncredible, specific reports of this. To counter Ukrainian UAVs, for example, Russia relies on\nsignal jamming or EW direction finding of ground operators, according to Watling and\nReynolds; there were no reports of Ukrainians UAVs or their control software being\nhacked.127 Many of Ukraine’s other combat systems are Soviet-era and pre-digital.128\nAlthough Western-provided systems could in theory be more vulnerable to cyber intrusions,\nRussian claims of successful penetrations appear to be bluster. A Russian military expert\nalleged in August that the U.S.-made HIMARS rocket launcher “has been hacked . . .\ninstantly fixing the launch site.”129 Around the same time, Moscow began claiming successful\nhits on many HIMARS systems. However, the Pentagon confirmed that all HIMARS were\naccounted for, and Ukrainian sources said that Russia had launched cruise missiles at\nwooden decoys.130 If this is true, the decoys would further confirm Russia’s reliance on\noverhead imagery—not cyber-enabled geolocation—for targeting in the field.\n\n\n**_For Occupation. Cyber intelligence collection can be militarily useful even after territory has_**\nbeen seized. Where Russia has controlled parts of Ukraine, its occupation forces must\nsuppress local resistance. In theory, smart occupiers would also seek to restore basic\nservices and administer territory in a way that might build local political support and extract\neconomic value over time. Moscow has focused more on suppression than on rebuilding and\nadministration. Shortly before the invasion, Washington warned the United Nations that\n“Russian forces are creating lists of identified Ukrainians to be killed or sent to camps\nfollowing a military operation.”131 This warning did not specify what sources of intelligence\nRussia was relying on to develop such lists. Open sources would be adequate to identify the\nmost prominent figures hostile to Russian interests, such as politicians, journalists, and\nintellectuals. Russia’s human agents in Ukraine could then help to provide a more textured\nunderstanding of the political scene and perhaps identify less prominent likely resisters.\n(Moscow reportedly recruited at least two possible slates for national leadership of a puppet\nstate, paid numerous collaborators and saboteurs throughout the country, and has found cooptees to run some occupied Ukrainian cities.132)\n\n\n-----\n\nCyber operations could supplement these traditional information sources in several ways.\nFirst, mass data collection (such as communication records, geolocation, and metadata)\nmight be used to identify ordinary Ukrainian citizens with links to partisan activity—people\nwithout a public record of activism and who aren’t personally known to Russia’s agents.\nCyber activity potentially intended for this purpose has included relentless Russian attempts\nto penetrate Ukraine’s telecommunications companies. Second, targeted cyber espionage\ncould help to verify the political intelligence Moscow receives from its HUMINT sources. The\nreliability of these sources has been a persistent challenge for Russian intelligence agencies\nbefore and during the war. Third, stolen public databases (like address lists and passport\ninformation) could facilitate the tracking, arrest, and/or assassination of targeted individuals.\nFor example, shortly before the invasion, Russian cyber actors breached Ukraine’s Ministry\nof Internal Affairs and acquired a national car insurance database, among other relevant\ndata.133 Granted, similar information might be directly available to Russian occupiers via\nUkrainian computer networks and personnel physically under their control. But Ukrainians\nsometimes wiped key data in advance of Russian territorial gains, putting a greater premium\non any information that Russian hackers had already obtained from afar.134\n\nDespite the many ways that cyber intelligence collection might be useful to Russian\noccupiers, Moscow has generally seemed to favor cruder, harsher tactics in its areas of\ninfluence. Rather than assembling a careful intelligence picture of local citizenry to facilitate\nthe selective suppression of key resisters while currying favor with others, Russian forces\nhave more often carried out brutal and at times indiscriminate large-scale violence, relied on\nphysical intimidation, and neglected to restore basic services (including internet) in many\nareas.135 Russian atrocities in the Kyiv suburbs, particularly Bucha, represent an extreme\ncase of a pattern observed throughout the country: countless instances of arbitrary killings,\nrapes, looting, and other crimes committed by poorly trained and loosely supervised Russian\ntroops who choose their victims casually or even randomly.136\n\n\nIn Mariupol, Russian forces essentially demolished the city before taking over, causing at\nleast three-quarters of the residents to flee.137 Weeks passed without any serious effort to\nrestore basic services such as electricity, communications, and medical care.138 Internet and\nphone service remained very limited one month after the takeover. Even after three months,\nmost citizens still lacked electricity or running water.139 In the Donbas, Kyiv has said that\nMoscow deported more than a million Ukrainian citizens to Russia. People who remain have\nbeen subjected to “humiliation, torture, robbery—or arbitrary, extrajudicial killing.”140 This\nroughly tracks with how Russia and its militia allies have governed eastern Ukrainian territory\nunder their control since 2014. Reports from the Donbas depict Russian neglect and chaos,\nnot a sophisticated surveillance state.141\n\nThe most notable exception was Kherson. Within a few weeks of taking the city, Russian\noccupiers ordered local Ukrainian officials to reroute internet and mobile traffic through\nRussian national infrastructure—enabling Moscow to apply its own internet regulations,\nsurveillance and censorship to Kherson 142 Citizens could only buy SIM cards with Russian\n\n\n-----\n\nphone numbers and had to display their passports to do so. Russian authorities blocked\naccess to Ukrainian and independent news media, as well as Facebook, Instagram, and\nTwitter—though not Telegram. The special efforts to control Kherson’s internet could stem\nfrom the fact that it was “the only provincial Ukrainian capital captured intact by Russian\nforces” and other cities were simply too decimated to be worth the effort.143 Kherson’s\ngeographic location (near Russian-controlled Crimea), economic value (as a port city), and\npolitical status (annexation was planned) may have also played a role. Kherson showed that,\nunder the right circumstances, Russian occupation forces place high value on cyber\nsurveillance. At the same time, it seemed to indicate that physical control of\ntelecommunications networks offers the ultimate cyber collection toolkit for occupiers; next to\nthis, remote hacking would be a more modest capability.\n\n**_For Influence Activities. The full breadth of Russia’s wartime influence, propaganda, and_**\ndisinformation activities in Ukraine is vast and beyond the scope of this paper. But there are\nat least two ways that cyber operations can provide direct intelligence or operational support\nto Russian influence efforts. First, Russian cyber actors can carry out so-called hack-andleak operations—the digital theft and publication of sensitive data meant to discredit, distract,\nor demoralize victims. In March, Microsoft observed two different cyber actors—one tied to\nthe GRU, and the other a “suspected Russian threat actor”—compromise “an institution in\nUkraine that was featured in false Russian weapons conspiracies in the past.”144 It is unclear\nwhether any sensitive data were exfiltrated or later published. The CyberPeace Institute has\ndocumented just five hack-and-leak incidents targeting Ukraine, including three by the selfdescribed Russian hacktivist group XakNet.145 (By comparison, Russia has suffered sixtythree such incidents during the war.)\n\n\nSecond, Russian cyber actors can use compromised systems or networks as platforms for\ndisseminating influence material. In March, a deepfake video of Zelenskyy calling on\nUkrainians to surrender was uploaded to social media.146 Hackers then gained access to a\nTV channel, Ukraine 24, to help spread the fictitious story. They placed a still image from the\nvideo on the channel’s website, and they edited the chyron text, scrolling below the live TV\nbroadcast, to reflect the deepfake narrative. Despite these efforts, the video was\nunconvincing and readily debunked.\n\nLater in March, Ukrainian intelligence announced the discovery and remediation of a botnet\nin the Dnipropetrovsk region that was being remotely controlled by Russia’s security\nservices.147 Moscow had reportedly used the botnet to send about 5,000 propaganda text\nmessages to Ukrainian troops and law enforcement. This number seems small, given that\nRussia has been sending similar texts since 2014, often using fake cell towers rather than\ncyber operations.148 The effectiveness of these messages is unknown. The morale of\nUkrainian forces has waxed and waned during the conflict, with some desertions occurring in\nJune.149 The core problem then was high casualties driven by Russia’s artillery\n\n\n-----\n\novermatch. Propaganda texts would be a marginal factor by comparison, though they\ncould help to cement and aggravate the preexisting concerns of Ukrainian troops and\ncivilians.\n\nFrom public evidence, it does not seem that Russian cyber actors have made very serious\nefforts to support influence operations in Ukraine. But undiscovered or undisclosed activities\nmay reveal a different picture.\n\n**_For Negotiations. Russia and Ukraine conducted several high-level negotiations in late_**\nFebruary and March, which did not yield any significant results. There have subsequently\nbeen limited, fragile agreements on some humanitarian issues, but no serious proposals for\nlarge-scale cease-fires or a negotiated settlement of the war.151 Still, many observers expect\nthe war will someday end at the bargaining table.152 At that stage, Moscow could greatly\nbenefit from strategic intelligence on Ukrainian senior leadership—its perceptions, intentions,\nplans, stances, debates, and schisms. Even now, with no negotiations on the horizon,\nintelligence on Zelenskyy’s inner circle could help Putin and his military chiefs design military\noperations to maximize political leverage.\n\n\nThe Ukrainian government has detected “a lot of attempts to hack Ukrainian officials’\nphones, mainly with the spreading of malware,” though it claimed in June that none of these\nattempts were known to be successful.153 Top leaders have secure devices and networks\navailable for some purposes. Washington gave Zelenskyy a “secure satellite phone” to\ncommunicate with the U.S. government, and his office apparently possesses secure landline\nnetworks for internal communication with national security agencies.154 Generally speaking,\nUkrainian counterintelligence and operational security efforts have outperformed all\nreasonable expectations—as demonstrated by the numerous foiled attempts to assassinate\nZelenskyy.155\n\nStill, Zelenskyy and his inner circle have some inherent cyber vulnerabilities owing to their\nnecessary use of unsecured internet and cell connections. Zelenskyy’s masterful social\nmedia activity has been crucial in rallying the Ukrainian people to resist Russian aggression\nand in persuading foreign leaders and societies to provide essential military, humanitarian,\nand diplomatic aid. Andriy Yermak, head of the presidential office, said that in the early\nweeks of the war, “he regularly texted photos of slain Ukrainian children and ruined Ukrainian\nhomes to the cellphones of officials around the world, including Jake Sullivan, the White\nHouse national security adviser; Karen Donfried, the assistant secretary of state for\nEuropean and Eurasian affairs; and members of Congress.”156 Zelenskyy, Yermak, and other\nclose confidants may benefit from software encryption in some contexts. But in general, their\nuse of internet-connected devices—although a strategic imperative—will create continued\nopportunities for Russian cyber actors to try to collect intelligence. If the Russians succeed in\nthis, the impact on eventual negotiations may manifest in the future and might never be\nknown.\n\n\n-----\n\n**_Conclusion. Intelligence collection—not fires—has likely been the main focus of Russia s_**\nwartime cyber operations in Ukraine, yet this too has yielded little military benefit (see Table\n4).157 Many of Moscow’s military intelligence needs can be fulfilled more readily by non-cyber\nsources. More fundamentally, Russia’s ham-fisted overall approach to the war—from its\ncampaign planning to its occupation of seized territory—suggests that key military decisions\nare not guided by a rigorous all-source intelligence process.\n\nTable 4.\nComparing\nRussia’s\nCyber and\nNon-cyber\nMilitary\nIntelligence\nCollection in\nUkraine\n\n\n**Intelligence**\n**support to…**\n\n**Prewar**\n**planning**\n\n**Strategic**\n**targeting**\n\n\n**Cyber collection** **Non-cyber collection** **Limitations on use**\n\n\nLikely phone\nsurveillance.\nAttempted cyber\nintrusions of Ukrainian\nmilitary, diplomatic,\nindustrial base,\nadministrative, and\nhumanitarian\nagencies and\norganizations.\n\nAt least two cases of\nRussian cyber\nintrusions plausibly\nproviding intelligence\nto missile targeteers,\nbut no reason to think\nthis made the strikes\nmore effective.\n\n\nMore than 800 alleged\nHUMINT sources,\nincluding some senior\nintelligence officers and\nopposition politicians.\nExtensive polling on\ninvasion scenarios.\nOpen-source\ninformation on\nUkrainian politics and\nmilitary readiness.\n\nSatellite and UAV\nimagery, radar, and\nopen sources can\nidentify many strategic\ntargets, confirm their\nimportance, and reveal\nkey aimpoints. Russia\napparently also tasked\nhuman agents (who\nsometimes had\noutdated information)\nwith designating early\nstrike targets.\n\n\nPervasive weaknesses\nin Russian intelligence\nanalysis, internal\ncommunication, and\ndecisionmaking, leaving\nMoscow unable to\ncompetently assess the\navailable information on\nUkraine’s politicomilitary situation.\n\nRussia’s missile\ntargeting calculus is at\ntimes haphazard.\nMissiles are sometimes\nused against strategic\ntargets but also against\nminor military targets or\nseemingly random\ncivilian objects.\n\n\n-----\n\nTable 4.\nComparing\nRussia’s\nCyber and\nNon-cyber\nMilitary\nIntelligence\nCollection in\nUkraine\n\n**Tactical**\n**targeting**\n\n\nNo indication that\nRussian cyber forces\ncan provide real-time\ngeolocations of\nUkrainian troops or\nequipment to cue\nartillery, despite\nclaims that Russia\nhad done this in the\nDonbas as early as\n2014.\n\n\nUAVs, EW direction\nfinding, acoustic\nreconnaissance, and\nradar. Of these, only\nUAV reconnaissance\nwas able to\nconsistently cue\nsomewhat timely and\naccurate Russian\nartillery fire.\n\nOpen sources can\nidentify prominent\nfigures hostile to\nRussian interests.\nHuman agents could\npoint to less prominent\nindividuals. Moscow\nreportedly recruited at\nleast two possible\nslates for national\nleadership of a puppet\nstate, paid numerous\ncollaborators and\nsaboteurs throughout\nthe country, and has\nfound co-optees to run\nsome occupied\nUkrainian cities.\n\n\nTraining and commandand control problems\nhave led to “systemic\nfriction and slowed\nresponsiveness” in\nRussian battlefield\ncommunication,\ncoordination, and\ndecisionmaking, limiting\nthe utility of tactical\ntargeting intelligence.\n\nRather than assembling\na careful intelligence\npicture of local citizenry\nto facilitate the selective\nsuppression of key\nresisters while currying\nfavor with others,\nRussian forces have\nmore often carried out\nbrutal and at times\nindiscriminate largescale violence, relied\non physical intimidation,\nand neglected to\nrestore basic services\n(including internet) in\nmany areas.\n\n\n**Occupation** Breaches of\nadministrative\ndatabases and\ntelecoms might aid in\nidentifying, tracking,\nand interdicting\nresisters. Cyber\ncollection can help\nverify data from\nhuman sources or\npreserve data that\nUkrainians wiped in\nadvance of Russian\nterritorial gains.\n\n\n-----\n\nTable 4.\nComparing\nRussia’s\nCyber and\nNon-cyber\nMilitary\nIntelligence\nCollection in\nUkraine\n\n**Influence**\n**operations**\n\n\nFive documented\nhack-and leak\nincidents as of early\nNovember. Elaborate\ncyber enabled\ndissemination of a\ndeepfake was quickly\ndebunked. Botnet\nsent about 5,000\npropaganda text\nmessages to\nUkrainian troops and\nlaw enforcement.\n\n\nLarge-scale, yearslong,\nmultipronged online\nand offline influence\nefforts. Control of\nmedia, public\ninformation, schools,\nand sometimes TV,\nradio, and internet in\noccupied areas.\n\nRussia leverages open\nsource information,\nsignals intelligence,\nand any human agents\nit retains in elite\nUkrainian political\ncircles.\n\n\nRussia’s war has led to\na surge of Ukrainian\nnationalism, rendering\nmany influence\nactivities ineffective or\ncounterproductive.\n\nAs with the initial war\nplanning, Putin and his\ntop advisers may\nsimply disregard\nintelligence in their\ndealings with Kyiv. No\nsignificant negotiations\nhave taken place since\nearlier in the war, so the\nstrategic impact of any\nrelevant cyber\nintelligence collection\nremains to be\ndetermined.\n\n\n**Negotiations** The Ukrainian\ngovernment has\ndetected “a lot of\nattempts to hack\nUkrainian officials’\nphones, mainly with\nthe spreading of\nmalware,” though it\nclaimed in June that\nnone of these\nattempts were known\nto be successful.\nZelenskyy and his\ninner circle have\ninherent cyber\nvulnerabilities due to\ntheir need to use\npublic internet and\nphone networks.\n\n\nDespite Moscow’s institutional limitations, it might still achieve cyber intelligence\nbreakthroughs as the war progresses. Conceivably, Russian hackers could obtain real-time\ngeolocation data that enable the assassination of Zelenskyy or the timely and accurate\ntargeting of Ukrainian forces, particularly those with high-value Western weapons systems.\nThey might also conduct hack-and-leak operations revealing sensitive war information to the\nUkrainian and Western public, such as Ukraine’s combat losses, internal schisms, or military\n\n\n-----\n\ndoubts; or collect valuable information about Kyiv s perceptions and intentions that can aid\nMoscow at future talks, among other scenarios. Russian intelligence collection therefore\nrepresents the greatest ongoing cyber risk to Ukraine.\n\n## Why Have Russian Cyber Operations Not Had Greater Strategic Impact?\n\nMost Western observers agree that Russian cyber operations have not had much strategic\nimpact in Ukraine, but there is less consensus on why. Some cite Russia’s cyber incapacity\nor reticence, while others point to the defensive efforts of Ukraine and its allies. Analysts also\nvary in whether they focus on the circumstances of this particular war, or on the role of\ncyberspace in warfare generally. Anne Neuberger, U.S. deputy national security advisor for\ncyber and emerging technology, acknowledged in July that there are “any number of theories\nfor what we saw, and quite frankly, what we didn’t see.” She observed that “some argue that\nwe don’t quite know” why Russian hackers failed to cause greater disruptions of Ukrainian\ncommunications and electric power (for example), and said that “it’s certainly something\nwe’re watching very closely” in intelligence and cyber policy circles.158\n\nBelow is a review of twenty-five different factors that have been proposed by Ukrainian and\nWestern officials, companies, and commentators, including some that emerged from this\npaper’s analysis. Building on the observations and arguments made above, each proposed\nfactor is tentatively assigned high, moderate, or low importance as an explanatory factor\n(summarized in Table 5). This reflects one reasonable interpretation of the evidence.\n\nIndividually, these assessments are debatable. Collectively, they reveal that many factors\nwere likely at play. Although some analysts have contended that one or two particular factors\nwere decisive, this appears doubtful. More likely, the reversal of several factors—even one or\ntwo with high importance—would not have been enough to significantly improve the overall\nmilitary utility of Russian cyber operations. In other words, Russia’s low cyber success in\nUkraine seems to have been overdetermined.\n\n\n-----\n\n**Russian Planning, Organization, and Doctrine**\n\n**Factor 1: Russia’s corrupt, incompetent, and ideological national security institutions**\n**made cyber intelligence collection less useful for military decisionmaking.**\n\n**Moderate importance. If Moscow had a competent and candid strategic decisionmaking**\nprocess prior to the war, then cyber intelligence on the state of Ukraine’s military and politics\nmight have been valuable in formulating initial Russian war plans, including Putin’s crucial\ndecision about whether to invade We don’t know what kind of intelligence Russia’s cyber\n\n\n-----\n\nactors obtained prior to the war. And arguably, human and open sources would provide more\nrelevant information on Ukraine’s strategic situation—though cyber intelligence can be used\nto help confirm such information. In any case, we do know that Russia grossly\nunderestimated Ukraine’s military and political staying power. This suggests that relevant\ncyber intelligence, if it did exist, was ignored or discounted by Moscow’s intelligence analysts\nand decisionmakers.\n\n**Factor 2: Russia compartmentalized its invasion plans, leaving cyber operators**\n**unable to prepare.**\n\n**AND**\n\n**Factor 3: Russia anticipated a rapid military victory that would not require significant**\n**cyber operations.**\n\n**Low importance. The quantity and quality of Russian cyber fires actually peaked in the days**\nimmediately before and after the invasion, when Moscow launched the Viasat hack and a\nhuge spate of destructive attacks. Russian cyber fires subsequently declined in number,\nnovelty, and impact. If advanced planning were Russia’s key limiting factor, one would expect\nthe opposite pattern, as Russian cyber operators would gradually adapt to wartime\nconditions and began to plan and execute operations in earnest. Indeed, senior Ukrainian\ncyber official Victor Zhora has so far proved prescient in his April prediction that Russian\noffensive cyber operations had “likely reached their full potential” and would not “scale” any\nfurther.159 Nine months into the war, there is little reason to suppose that Russia still needs\nmore time to ramp up its cyber operations. While better initial planning could perhaps have\nmade early Russian cyber fires more effective than they were, the overall nature of these\noperations—which sought to disrupt government and civilian communications and systems\non a wide scale—is largely what one would expect based on Russian doctrine and general\nmilitary principles.\n\n**Factor 4: Russia had across-the-board deficits in combined arms warfare.**\n\n**Moderate importance. Russian forces have struggled in many different ways to synchronize**\ntheir activities—across warfighting domains, military services, geographic areas, and\nfunctional disciplines—and these deficits have significantly hindered Moscow’s overall war\nefforts. When a military has so many serious failures of coordination, including among\nmilitary roles that have coexisted for decades, the introduction of a newer and less mature\ncapability like cyber inevitably presents enormous coordination challenges. It is likely that\nbetter coordination with kinetic forces would have enhanced the military utility of Russian\nwartime cyber operations. However, the size of this effect isn’t clear.\n\nOn the one hand, Moscow’s cyber operations seemed to have their greatest strategic impact\nwhen they were most closely integrated with kinetic operations. The high watermark on both\nscores came in the first days of the war. That was when Moscow executed its most militarily\n\n\n-----\n\nconsequential known cyber operation (the Viasat hack), and its largest spate of destructive\ncyber operations, to coincide with ground and air operations. On the other hand, Russia’s\nearly cyber success depended not only on cyber-kinetic coordination but also on its initially\nlarge stockpile of preplanned cyber fires. In the weeks that followed, Moscow’s cyber fires\ndeclined precipitously as Russian hackers proved unable to maintain such a high operational\ntempo. Once Russian cyber fires slowed to a trickle (relative to the size of the war), the\nbenefits of coordination with kinetic operations would likewise have fallen. Improving cyberkinetic coordination probably would not have seemed like a smart priority for Russian theater\ncommanders.\n\n**Factor 5: Russian cyber units were organizationally isolated from combat units.**\n\n**AND**\n\n**Factor 6: Russian cyber doctrine emphasized intelligence, subversion, and**\n**psychological warfare rather than combat integration.**\n\n**Moderate importance. The GRU has been Russia’s lead provider of cyber fires in the**\nUkraine war.160 Microsoft stated in December that all “destructive attacks against Ukrainian\ntargets in support of the Russian war effort have been the responsibility of” GRU-associated\nactors.161 Although part of the military, the GRU is a national-level element that specializes in\nintelligence, subversion, and assassination; it is not designed for close integration with\nregular troops in conditions of large-scale combat. This may help explain why the GRU\nsucceeded in executing a strategic cyber campaign (Viasat and early wipers) to coincide with\nthe initial invasion, but has subsequently failed to show much tactical coordination with\nRussian units on the ground. However, Russia’s cyber intelligence collection operations—\npresumably a GRU strong point—have not seemed any more impactful than its cyber fires.\nIn particular, public evidence suggests that cyber operations have offered surprisingly feeble\nsupport to influence activities, a GRU hobbyhorse. All this suggests that doctrine isn’t the\nwhole story.\n\n\n**Russian Cyber Capability and Capacity**\n\n**Factor 7: Russian cyber forces were too small to meaningfully contribute to a full-**\n**scale war.**\n\n**High importance. To make a serious difference in Moscow’s war effort, Russian cyber**\noperations would need to scale to match the size of the war itself. At best, this was achieved\nonly in the war’s earliest weeks. Overall, however, Russian cyber operations have barely\nregistered on the grand scale of Moscow’s military ambitions and high-intensity combat\noperations in Ukraine.\n\n\n-----\n\nTo review, Moscow sent more than 150,000 troops to subdue the whole of Ukraine, a country\nwith 44 million people and one of the largest land areas in Europe. Russia launched\nsimultaneous offensives on multiple axes and sent standoff strikes at Ukrainian targets—\nultimately thousands of them—in all regions. Eventually, Moscow scaled back its military\nmission to focus on eastern Ukraine. Even so, the war remained large enough that cyber\noperations would need to be either incredibly frequent or remarkably effective (or better yet,\nboth at once) to make a measurable difference. Yet Russia’s significant known cyber fires\nhave amounted to just a few dozen data deletion operations and two failed industrial control\ndisruptions. Among these, the Viasat hack is the only case where public evidence suggests\nmuch plausible military impact. In sum, Moscow’s cyber onslaught was unprecedented by\npeacetime and gray zone standards—but it was small relative to the war in Ukraine.\n\nIt is unclear whether Moscow took steps to grow its cyber forces, either before or after the\ninvasion. Russia’s large and highly capable cybercrime ecosystem has not visibly\nparticipated in the war to the extent many had anticipated. The Russian state has long\ntolerated and co-opted cyber criminals, leading analysts to expect they would be activated as\nan auxiliary force during crisis or wartime. Although some purported Russian criminal groups\nand hacker collectives have targeted Ukraine, and XakNet in particular has carried out\nseveral noteworthy operations, much of the criminal activity has been low-level denial of\nservice.162 Overt activity by major Russian ransomware gangs has largely focused on nonUkrainian targets.163 However, Russian criminals may be lending assistance in ways that are\ndifficult to detect.\n\n\n**Factor 8: Russia has been slow to regenerate cyber capability once used.**\n\n**High importance. If Russian cyber forces had somehow managed to maintain the historic**\ntempo of significant operations seen at the war’s outset, they could well have had strategic\nimpacts over time. But Russia suffered a steep drop-off in quantity and quality of cyber fires\nafter the first few weeks of the war. The decline of novel wipers, and related tactical shifts by\nRussian hackers, suggests a limited stockpile of technical resources.\n\n**Factor 9: Russia chose not to focus its full cyber capacity on Ukraine.**\n\n**Moderate importance. The Russian government refrained from conducting significant**\ndestructive or disruptive cyber attacks against Ukraine’s Western allies from the outset of the\nwar until October, when the GRU carried out a ransomware attack on logistics and\ntransportation companies—two in Ukraine and one in Poland.164 Even so, Moscow has\ncontinued to carry out large-scale cyber espionage and other network penetrations on a\nglobal scale. Russian cyber operations against Western targets have either remained stable\nor increased since the invasion began, judging from numerous reports by Western\ngovernments and cybersecurity firms. While the GRU has taken the lead on Russian cyber\noperations in Ukraine, Moscow’s other cyber-capable agencies (such as the Foreign\nIntelligence Service, or SVR) have largely focused elsewhere.165\n\n\n-----\n\nStatistics published by Microsoft paint a picture of divided Russian attention. The company\nreports that “64 percent of Russian threat activity against known targets was directed at\n\n[networks operated by] Ukraine-based organizations between late February and June.”166\nGranted, this level of concentration is a striking reflection of Russia’s new wartime priorities;\nVictor Zhora has said that Moscow tripled its cyber operations against Ukraine from prewar\nbaselines.167 But Microsoft’s figure also means that more than a third of this type of Russian\ncyber activity continued to be directed outside of Ukraine. The company separately counted\nRussian attempts to compromise customer accounts on Microsoft-operated online services\nlike Office 365. Surprisingly, just 2 percent of this activity targeted Ukraine. Although\nUkrainians comprise a tiny portion of these services’ user base, one might still expect\nRussian cyber actors to have targeted these Ukrainians with greater intensity.168\n\nFrom Russia’s perspective, the wisdom of this cyber resource allocation can be debated. On\nthe one hand, Putin views the Ukraine war as existential, implying it should command all\navailable resources. On the other hand, the war has created a number of new national\nsecurity challenges for Moscow beyond Ukraine’s borders. In addition to supporting combat\noperations, Russian cyber actors must monitor and suppress domestic dissent, collect\nintelligence on Kyiv’s Western allies and seek to deter them from further intervention, and try\nto obtain technologies that are now denied to Russia via export controls and sanctions.169\nRegardless of its rationale or merits, Russia’s decision to maintain and perhaps even expand\nits global cyber target list has reduced the cyber capacity available for use in Ukraine.\n\nThat said, a different resource allocation might not result in dramatically different outcomes.\nEven if Russia were to double or triple its existing cyber operations against Ukraine, for\nexample, it might still not be enough to materially impact the war.\n\n\n**Factor 10: Russia has been distracted by the need to defend its own networks against**\n**foreign cyber operations.**\n\n**Low importance. There is a small amount of evidence that Russian offensive cyber actors**\nhave turned some of their attention to countering cyber threats against Russia—for example,\nby seeking to hack the Ukrainian IT Army that is itself hacking Russian networks.170 In\ngeneral, however, the overlap between Russian personnel, units, and capabilities that\nMoscow uses for offensive versus defensive purposes may be limited.\n\n**Russian Restraint**\n\n**Factor 11: Russian forces preserved Ukrainian systems for use in communication or**\n**intelligence gathering.**\n\n**Low importance. Russian cyber fires have targeted Ukrainian telecommunications systems**\nand supporting critical infrastructure at all stages of the war—from the disruptions of Viasat\nand Ukrtelecom to the repeated attempts to interrupt electrical power. Although Russian\nforces have indeed relied on Ukrainian infrastructure (such as cell service) to communicate\n\n\n-----\n\nand collect intelligence, they have nevertheless taken no visible action to avoid kinetic strikes\non telecommunications networks and supporting infrastructure, which have sustained heavy\ndamage throughout the country and have required continuous repair by Ukrainian\nworkers.171 Ukrainian data centers and broadcast towers have also been deliberately\ntargeted by Russian precision strikes.172 All this suggests that—for much of the war, at least\n—Moscow has had no effective, centralized plan to save Ukrainian communications\nnetworks for Russia’s own wartime use.\n\n**Factor 12: Russian forces preserved Ukrainian infrastructure to facilitate eventual**\n**occupation.**\n\n**Low importance. Russia has deployed brutal mass bombardments and siege tactics in**\nmany areas. In some places that have been controlled by Russia, such as Mariupol, there\nwere minimal efforts to restore basic services such as electricity, communications, and\nmedical care. This suggests that Moscow has been unconcerned with preserving Ukrainian\ninfrastructure—at least in much of the country—for its eventual control.\n\nRussia may have initially planned for cyber restraint before changing its mind as the war\nevolved. If so, one would expect Russian cyber fires on Ukrainian critical infrastructure to\nincrease in number and severity over time. Yet Russian cyber fires generally peaked in the\ndays and weeks surrounding the immediate invasion, implying that capacity rather than\nintent has been the primary constraint. A possible counterexample is Russia’s cyber fires on\nindustrial control systems, which did not occur until April and July. Preparation for the July\nattack apparently began no later than February, suggesting that Russia sought, at a\nminimum, to develop options for industrial control system attacks as soon as the war began.\n\n**Russian Way of War**\n\n**Factor 13: Russia’s cyber fires had much less psychological and political impact than**\n**its kinetic attacks.**\n\n**Moderate importance. Russian forces have killed tens of thousands of Ukrainians,**\nbrutalized and terrorized civilian populations, destroyed large portions of major cities, and\ndisplaced millions. It is difficult to imagine any cyber campaign—no matter how wellconstructed and persistent—that would meaningfully add to this societal and psychological\ntrauma. Nevertheless, we know little about the dynamics of Ukrainian wartime politics and\nmorale. Conceivably, popular Ukrainian support for continuing to prosecute the war has\ndepended in part on Ukrainians’ initial and continued ability to hear from their leaders,\naccess basic services, and communicate with family members. If so, a highly effective and\nsustained campaign of cyber disruptions by Moscow could perhaps have helped force Kyiv\nto the bargaining table over time. More study of these questions is warranted.\n\n**Factor 14: Russia’s kinetic targeting was too imprecise and haphazard to benefit from**\n**cyber-derived intelligence.**\n\n\n-----\n\n**Moderate importance. Russian artillery fires have usually lack[ed] much of the C4ISTAR**\n\n[command, control, communications, computers, information/intelligence, surveillance,\ntargeting acquisition, and reconnaissance] coordination as envisioned by the\nReconnaissance Fire Complex and exhibit[ed] a considerable degree of systemic friction and\nslowed responsiveness,” according to Jack Watling and Nick Reynolds.173 In the face of\nthese deficits, Russian artillery units have at times sought to overwhelm their enemy with\nsheer quantity. It is therefore unclear whether cyber-derived tactical targeting intelligence—\nfor example, precise real-time geolocation of Ukrainian positions—could be productively\nused by Russian forces. It does seem that some intelligence sources are more successful\nthan others. When Russians can spot Ukrainians via UAV imagery, they have directed\nartillery fire much more rapidly and accurately than when EW direction finding, acoustic\nreconnaissance, or radar was used.\n\nRussia’s missile targeting process is also variable. Russia has often launched missiles\nagainst minor military targets and more or less random civilian objects.174 In those cases,\ncyber-derived intelligence would not be of much use. But missiles have sometimes struck\nstrategic targets, such as bases, airports, defense production facilities, transportation nodes,\nand energy infrastructure. It is conceivable that cyber intelligence collection might have\nsometimes provided unique targeting information—for example, revealing a hidden\ndependency or vulnerability. There are a few known cases where Russian cyber operators\nplausibly fed intelligence to missile targeteers, but it’s not obvious in those cases that cyber\nintelligence was important. Missile targeteers would already know of most strategic Ukrainian\ntargets via traditional intelligence sources. Cyber intelligence would typically be a convoluted\nand time-intensive way of confirming a target’s importance and identifying aimpoints\ncompared to, say, satellite imagery.\n\n**Factor 15: Russia’s brutal, arbitrary, neglectful, and predatory occupation forces had**\n**limited use for cyber intelligence.**\n\n\n**Moderate importance. Although available information is sparse, Russian forces in occupied**\nterritory do not seem to have used sophisticated intelligence techniques to separate key\nresisters from other citizens. Rather, they have more often carried out brutal and at times\nindiscriminate large-scale violence, relied on physical intimidation, and neglected to restore\nbasic services (including internet) in many areas.175 The most notable exception is Moscow’s\nmove in early May to reroute internet traffic from Kherson—which Putin planned to annex—\nthrough Russian national infrastructure, enabling Moscow to apply its own internet\nregulations, surveillance, and censorship to the city.176 However, this incident serves to\nhighlight that physical control of telecommunications networks can enable far more systemic\nsurveillance than remote hacking.\n\n**Ukrainian Cyber Architecture**\n\n**Factor 16: Ukraine’s national digital infrastructure was structurally resilient.**\n\n\n-----\n\n**High importance. Ukraine s national internet and IT infrastructure, even before the war, was**\nresilient in many ways. Researchers have identified “low market concentration at multiple\nlevels and the relatively high number of interconnect facilities,” meaning “there are no\nobvious choke points, or individual networks whose loss would have a crippling effect on the\ninternet in Ukraine.”177 Moreover, the country has a thriving workforce of IT professionals and\nnetwork engineers, and this human element has proven agile, collaborative, and highly\nmotivated to maintain digital connectivity in the face of kinetic and cyber fires.178\n\n**Factor 17: Some key Ukrainian systems, such as military equipment, have not yet**\n**been digitized or networked.**\n\n\n**Low importance. There have been no reported hacks of Soviet-era Ukrainian military**\nequipment, much of which presumably has limited or no connectivity.179 But equally, there\nhave been no credible and specific reports that Ukraine’s modern, networked equipment has\nbeen hacked. For example, Ukraine’s drone operations have proven vulnerable to Russian\njamming and EW direction finding, but field researchers have not noted any evidence of\nhacking.180 Of course, Kyiv and its suppliers and allies may choose not to publicize any\nsuccessful Russian hacking of military hardware. However, it would probably be difficult to\nconceal a large number of incidents with significant battlefield consequences, as\ndemonstrated by Ukraine’s well-documented struggles against Russian EW during some\nparts of the war.\n\n**Ukrainian Cyber Defenses**\n\n**Factor 18: Long-term investments in Ukraine’s cyber defense ecosystem have paid**\n**dividends.**\n\n\n**Moderate importance. Since roughly 2017, the United States has expanded multiple**\ninitiatives to bolster the cybersecurity of Ukraine’s government and critical infrastructure.181\nIn addition, “numerous [other] foreign governments and cybersecurity companies had\ninvested in Ukrainian cyber capacity building over several years.”182 Ukrainian institutions\nmade parallel investments of their own.183 For example, one of Ukraine’s largest telecoms\ncompanies grew its cybersecurity workforce by about two-thirds from 2015 to 2022.184 Such\ninvestments may well have contributed to Ukraine’s wartime cyber defenses. It is suggestive\nto compare the periods before and after these reforms. From 2015 to 2017, Ukraine was the\nvictim of three exceptionally damaging Russian cyber attacks: two electrical power\ndisruptions and the NotPetya attack. But from 2018 until Russia’s 2022 invasion there were\nno comparably serious events, despite the ongoing Donbas conflict and occupation of\nCrimea. Plausibly, the broad-based and sustained investments in Ukrainian cybersecurity led\nto major improvements in the country’s cyber posture.\n\n**Factor 19: Ukraine has had many years of prior experience in monitoring and**\n**countering Russian cyber operations.**\n\n\n-----\n\n**Low importance. If persistent cyber targeting of one country by another leads defenders to**\ndevelop relative advantages over time, then this pattern would be evident around the world:\nmajor state-sponsored cyber actors would show gradually declining efficacy against their\nprimary targets. This does not seem to be the case.\n\n**Factor 20: Ukraine’s “IT Army” has enabled global grassroots cyber professionals to**\n**augment Ukrainian personnel.**\n\n**Low importance. Although the IT Army was originally announced as having both defensive**\nand offensive missions, research suggests it soon became purely offensive in nature.185 Any\ndefensive benefits for Ukraine would be indirect, insofar as the IT Army’s hacking of Russian\nsystems caused Moscow to retask its own offensive units toward more defensively oriented\nmissions.186\n\n\n**Foreign Support to Ukraine**\n\n**Factor 21: Cloud service providers helped Ukraine migrate key data to secure servers**\n**outside of the country.**\n\n**High importance. Ukraine undertook an emergency cloud migration immediately after the**\nRussian invasion, which Ukrainian government agencies and Western companies have\ncalled critical to the country’s cybersecurity and digital resilience.187 Ukraine’s digital minister,\nfor example, said that the Amazon Web Services (AWS) cloud platform “literally saved our\ndigital infrastructure.”188 The need for this migration was demonstrated when Russia\nreportedly damaged a Ukrainian government data center with a cruise missile attack “in the\nearly days of the war.”189 Kyiv said that “no data was lost because backups were available,”\nthough it is unclear if cloud migration was the reason; Ukraine’s governmental cloud\nmigration may not yet have begun in earnest at that time. In any case, cloud migration has\nproduced wide-scale improvement in Ukraine’s overall cybersecurity and resilience.\n\n\nThe migration process unfolded iteratively over several months—with economically critical\ndatabases receiving first priority—and remained ongoing as of late July.190 While this gradual\ntimeline is to be expected for such an enormous and complex undertaking, it also suggests\nthat cloud migration cannot wholly explain Ukraine’s successful cyber defenses, particularly\nin the war’s earlier stages. In fact, a cloud migration process can itself introduce various\ndistractions, service disruptions, and new cybersecurity vulnerabilities (such as in the\nconfiguration and access interfaces of cloud assets), especially under the strained and\nchaotic circumstances of wartime. Cloud migration has certainly enhanced Ukraine’s wartime\ncybersecurity, but it is probably not the single decisive factor.\n\n**Factor 22: Cybersecurity companies provided advanced end-point security, threat**\n**intelligence, and information sharing.**\n\n\n-----\n\n**High importance. Microsoft has argued that recent innovations in end-point security, threat**\nintelligence, and information sharing have been some of the most important factors in\nUkrainian cyber defenses.191 For example, the company has declared that “for the first time\nin a major cyber event, behavioral detections leveraging machine learning used known\nattack patterns to successfully identify and stop further attacks without prior knowledge of the\nunderlying malware—even before humans were aware of the threats.”192 Other companies,\nlike AWS, have also provided close cybersecurity support to Ukraine, while threat intelligence\nfrom Western firms and governments has helped to expose and mitigate malicious\nactivity.193\n\nThe impact of these efforts is difficult to judge, but their sheer scale is hard to discount. Few\nif any other moments have galvanized so many of the world’s leading cybersecurity actors to\nprotect a single set of victims from a defined set of bad actors. (The 2020 U.S. presidential\nelection may be the only comparable example.) This extraordinary concentration of\ncybersecurity capability presents major obstacles for even a determined and powerful\nadversary like Russia. That said, considerable effort and skill would be required to properly\ncoordinate and leverage the cybersecurity support that Ukraine has received. More\ninformation is needed to understand how well Ukraine has done this under trying wartime\ncircumstances.\n\n**Factor 23: Starlink systems bolstered the security and resilience of Ukrainian**\n**telecoms.**\n\n\n**High importance. Ukraine’s top cybersecurity official, Yurii Shchyhol, cited Starlink as the**\nmost useful form of digital assistance that Ukraine has received during the war.194 Starlink\nhas reportedly made numerous tangible contributions to the war effort, such as enabling the\ncontrol of Ukrainian drones, helping besieged Ukrainian troops in Mariupol stay in touch with\ntheir commanders, and facilitating Zelenskyy’s communications with world leaders and the\nglobal public.195 Starlink’s architecture has been relatively resistant to cyber attacks and\njamming, though Elon Musk claimed in May that the Russians were “ramping up their\nefforts.”196\n\nTo be sure, Starlink is not the mainstay of Ukraine’s internet. Ukrainian terrestrial\ntelecommunications networks, which have higher bandwidth, have proven fairly resilient\nduring the war, and Starlink users are advised to limit their reliance on the network because\nits signals pose a risk of discovery and targeting by Russian forces.197 In early May,\nUkraine’s digital minister said that “about 150,000 Ukrainians use Starlink on a daily basis”—\nless than 1 percent of the country’s population.198 But some users are more important to\nUkraine’s war effort than others. Anecdotally, front-line Ukrainian forces seem to be among\nthe heaviest Starlink users. They often cite Starlink as their most important channel for\ncommand and control, and they have described outages as leading to “‘catastrophic’ loss of\n\n\n-----\n\ncommunications on the battlefield. Further research could investigate the extent to which\nessential communications, such as government, military, and critical infrastructure data, flow\nover Starlink and Ukraine’s various other telecommunications systems.\n\n**Factor 24: Ukrainians have used foreign messaging apps that Russia is unable or**\n**unwilling to target with cyber attacks.**\n\n**Moderate importance. Messaging and other communication apps—such as Signal,**\nTelegram, Twitter, and Zello—were widely used in Ukraine before Russia’s invasion, making\nthem familiar and valuable channels once the war began.200 They have long been embraced\nby Ukraine’s government and media, becoming central sources of information about politics\nand daily life. Russia has used these same platforms to propagandize to the Ukrainian\npopulace. Still, Ukraine’s continued access to familiar sources of instantaneous\ncommunication has brought more benefits than risks to the country. For example, social\nmedia has been an important means for Zelenskyy to reassure his people, particularly in the\nwar’s early days when maintaining morale was most essential. More research is needed to\nunderstand the many effects of these platforms on the war’s progression.\n\n**Factor 25: U.S. and NATO defensive and counter-cyber operations, including “hunt**\n**forward,” have been effective.**\n\n\n**Unknown importance. Shchyhol has described “a constant synergy” between his**\ngovernment, U.S. Cyber Command, and the National Security Agency (NSA) to secure\nUkrainian networks, “especially of government institutions and military-related\ninstallations.”201 But there is no public information about the nature and extent of these\nactivities or their impact.\n\n**Conclusion**\n\nIn sum, many factors have constrained Moscow’s cyber effectiveness in Ukraine. Perhaps\nthe most important are inadequate Russian cyber capacity, weaknesses in Russia’s noncyber institutions, and exceptional defensive efforts by Ukraine and its partners. To\nmeaningfully influence a war of this scale, cyber operations must be conducted at a tempo\nthat Russia apparently could sustain for only weeks at most. Moscow worsened its capacity\nproblem by choosing to maintain or even increase its global cyber activity against nonUkrainian targets, and by not fully leveraging cyber criminals as an auxiliary force against\nUkraine. Meanwhile, Putin and his military seem unwilling or unable to plan and wage war in\nthe precise, intelligence-driven manner that is optimal for cyber operations. Ukraine, for its\npart, has benefited from a resilient digital ecosystem, years of prior cybersecurity\ninvestments, and an unprecedented surge of cyber support from the world’s most capable\ncompanies and governments.\n\n## What Lessons Apply to Other States’ Military Cyber Efforts?\n\n\n-----\n\nThe Russian war in Ukraine offers some general lessons for other states military cyber\nefforts. However, it is crucial that countries consider a range of relevant case studies and\naccount for their own national circumstances, including the specific kinds of wars they might\nneed to fight in the future. Below are some high-level insights and recommendations, with\nparticular focus on the United States and Taiwan.\n\n**Cyber Offense**\n\n**_Fires. Russia’s experience suggests that cyber fires can be usefully concentrated in a_**\nsurprise attack or other major salvo, but they risk fading in relevance during larger, longer\nwars. Cyber commands that hope to sustain fires at militarily relevant levels throughout a\nlarge-scale war should be appropriately sized and designed for this daunting task. What that\nmeans in practice isn’t clear. At a minimum, Russia’s apparent failure to mass adequate\ncyber force in Ukraine should prompt other countries to reexamine the assumptions behind\ntheir own sizing constructs. U.S. Cyber Command, for example, is still sized to its original\n2012 model: about 6,200 personnel split into 133 teams, including twenty-seven Cyber\nCombat Mission Teams that would have primary responsibility for wartime cyber fires (among\nother tasks).202 The command plans to add fourteen more teams in the next few years, with\ntwo new Combat Mission Teams included among the first additions.203 U.S. Cyber Command\nis extremely large by global standards. Even so, it isn’t clear that the organization can\nproduce enough cyber fires capacity to meet expectations or needs in a major conflict,\nnotwithstanding modest future growth. The command has said that new teams are being\nadded in response to “recent demand across DoD”—presumably, peacetime and gray zone\nrequirements.204 Wartime needs would most likely be many times larger.\n\n\nMilitaries that prioritize wartime cyber fires may therefore face a difficult choice. They can opt\nto maintain huge standing cyber forces at significant expense. Alternatively, they can develop\nsurge capacity mechanisms (drawing on reserves or civilians, for example), which are\nchallenging to implement and risk cannibalizing domestic cybersecurity in a crisis. Moreover,\nadequate force size is necessary but insufficient to deliver meaningful wartime cyber fires.\n\nThe Russian example has also demonstrated the need for rapid regeneration of cyber\ncapabilities. U.S. Cyber Command, too, has sometimes struggled with force regeneration—\neven under peacetime and gray zone conditions—and has therefore sought to develop\nlower-cost, “burnable” tools and infrastructure.205 Such challenges would likely be far more\nacute in a major war. To make the most out of limited wartime cyber capacity, militaries may\nneed to experiment with wave tactics: short bursts of intense cyber fires followed by periods\nof stand-down and regeneration. Russia possibly employed this approach when it halted\ndestructive cyber attacks in the summer before resuming in October, around the same time\nthat Moscow intensified its missile attacks. The more infrequent the waves of cyber fires, the\nmore important it will be for militaries to coordinate them closely with kinetic fires.\n\n\n-----\n\nRussia s war in Ukraine illustrates the high bar of delivering cyber fires at the scale and pace\nof major conflict. Militaries designed for large-scale war should carefully consider whether\nmeeting this bar is a realistic goal. If their cyber commands cannot scale dramatically and\nregenerate rapidly, they should perhaps not focus on developing wartime fires in the zone of\nconflict. They might instead prioritize non-fires activities such as cyber defense operations or\nintelligence collection. Or they could plan for more selective war-related fires in other\ntheaters, as Russia has done by holding NATO countries’ networks at risk in an effort to\ndeter further support for Ukraine. Militaries might also de-emphasize wartime missions\nentirely and invest instead in peacetime, gray zone, or prewar fires—including what the U.S.\nmilitary calls “campaigning” or “shaping” operations.\n\nIn fact, many countries may already be heading down these various alternative paths. Max\nSmeets has found that, although more than forty states have established military cyber\ncommands, just a few have ever conducted any known cyber effects operations (fires), in\nwar or otherwise.206 In this global context, the U.S. military—plus a handful of its friends and\nrivals—appears to have exceptionally ambitious cyber goals. Most countries should probably\nnot emulate U.S. Cyber Command’s bold aspiration to “deliver strategic and operational\nadvantages for the Joint Force . . . in conflict” by “integrat[ing] cyberspace capabilities and\nforces into plans and operations across all domains.”207\n\n\n**_Intelligence. Cyber intelligence collection may have greater overall potential than cyber fires_**\nto support a variety of wartime military tasks. The Russian case, however, shows that\nrealizing this potential requires competent analysis and decisionmaking processes and a\nreasonably precise “way of war.” Russian cyber operators may well have acquired more raw\ndata in Ukraine than could be reliably interpreted and practically used by Russian political\nleaders, intelligence analysts, planners, targeteers, or occupying forces. As cyber capabilities\nproliferate, more countries could face this mismatch. In such cases, broad institutional\nreforms—upgrading analytic tradecraft, instilling professionalism, or combating corruption—\nwill often have more value than further technical investments in cyber collection. Militaries\nunable to implement those reforms may find that exquisite cyber intelligence capabilities\naren’t worth the effort to develop.\n\nIn addition, cyber operations have specific strengths and weaknesses as a source of wartime\nintelligence; they are not the right tool for every task. Although cyber operations can yield\nunique intelligence data, they’re more time-consuming and inconsistent than many other\nmethods. Overhead imagery, for example, has most likely been far more important to\nRussian kinetic targeteers than cyber-derived intelligence. Cyber units should be fully\nintegrated into all-source intelligence processes that direct them toward information needs\nwhich cannot be readily fulfilled by other means. Wartime use cases for cyber intelligence\nmight include tracking high-value targets in real time, validating HUMINT in mission-critical\nsituations, and acquiring very large data caches with durable, multipurpose value.\n\n**Cyber Defense**\n\n\n-----\n\nCyber defenders also have much to learn from the Russia-Ukraine war. Their first task is to\nrevisit assessments of enemy offensive cyber capabilities in light of Russian challenges and\nlimitations in Ukraine. Although some of Moscow’s struggles may be circumstantial, others\ncould apply more broadly. Cyber defenders should therefore consider whether they have\noverestimated their respective enemies’ likely ability to use cyber operations to win a future\nwar against them. For example, U.S. officials have long worried that an adversary could\nexploit or disrupt American weapon systems during war, and have therefore worked for years\nto bolster the cybersecurity of U.S. military hardware. The Government Accountability Office\nhas called for a redoubling of these efforts due to continuing institutional gaps.208 Yet\nRussian forces, facing many of the same U.S. systems on the Ukrainian battlefield, have\nseemingly failed to compromise them in significant ways. Washington should carefully review\nits intelligence, and press Kyiv for help, to validate its prior assumptions of how adversaries\nwill use cyber operations against U.S. systems in combat. Realistic assessments help to\navoid overinvestment in less important areas, freeing up scarce resources for higher\npriorities. Cyber policymakers must differentiate between possible worst-case scenarios\n(positing extreme danger) and more likely cyber events (which may not cause lasting\nstrategic damage).\n\n**_Taiwan. Different countries should draw different cyber lessons from the Russia-Ukraine war_**\nbased on their particular military situations. Taiwan, for example, might use Ukraine’s\nexperience to better anticipate and defend against Chinese cyber operations during a\npotential full-scale invasion. Taiwan’s plans should, of course, be rooted firmly in its own\ncontext. This means carefully analyzing China’s cyber and kinetic forces, Taiwanese network\narchitecture and security, possible third-party contributions, and the political goals likely to\nshape each actor’s cyber and overall military strategy. But these factors are not easy to\njudge, leading to some inevitable reliance on assumptions. The war in Ukraine offers a useful\nreference point for examining and refining these assumptions. Taiwanese cyber analysts and\nplanners should make comparisons, as well as contrasts, between the Russia-Ukraine war\nand a possible China-Taiwan war.\n\nTo begin with, Russia’s inept military and political institutions have demonstrated that\neffective wartime cyber operations depend on sound decisionmaking and coordination\nprocesses. It is noteworthy, then, that Chinese President Xi Jinping has gradually eliminated\nrival factions and eroded meritocracy at the top levels of Chinese leadership. Are Xi and his\nyes-men likely to repeat Putin’s mistake of failing to rely on objective intelligence—including\ncyber intelligence—to inform military plans? Or have Xi’s efforts to professionalize the\nmilitary and improve joint warfighting prepared China to make better use of cyber\noperations?\n\nRussian cyber capacity constraints also invite a reexamination of China’s posture. On the\none hand, Beijing probably possesses a larger military cyber force than Moscow.209 On the\nother hand, China has very rarely attempted any cyber fires, whereas Russia had already\ncarried out many previous destructive attacks Would China execute an even bigger and\n\n\n-----\n\nmore effective cyber salvo at the outset of a Taiwan invasion, or would it bungle the opener\ndue to inexperience? And what happens after that? Many observers expect a Chinese\ninvasion to lead to a protracted military struggle. Would Chinese cyber forces demonstrate\ngreater regenerative capacity than Russia, or would they likewise become less militarily\nrelevant over time?\n\nFinally, Taiwan’s cyber architecture and defenses should be considered in light of the\nUkrainian experience. Taiwan has greater technical prowess than Ukraine, so would its\nmilitary and civilian communications infrastructure prove even more resilient? Or does\nTaiwan’s island geography mean fewer, more vulnerable choke points—with the risks\npotentially magnified by a higher overall dependence on digital technology? International\ncyber assistance, so critical to Ukraine, may be Taiwan’s biggest question mark. Western\ntechnology companies have had powerful political, reputational, and commercial motivations\nto support Ukraine.210 But unlike Ukraine, Taiwan lacks a clearcut claim of sovereignty. And\ncompared to Russia, China has much greater economic heft and global technological\nintegration. Would Western companies be just as eager to help Taiwan? If so, would they be\nphysically able to do so without overland access?\n\nPosing these questions is easier than answering them. But they suggest some ways that\nother countries can look for cyber lessons in the Russia-Ukraine war without losing sight of\ntheir own distinct circumstances.\n\n## Conclusion\n\nRussia’s cyber operations in Ukraine have apparently not had much military impact. This was\nprobably for a multitude of reasons: Russia’s offensive limitations, as well as the defensive\nefforts of Ukraine and its partners; the particular context of this war, as well as structural\nfeatures of cyberspace and warfare generally. The Russia-Ukraine war offers an important\ncase study of cyber operations as a wartime military instrument. Yet it is neither the first nor\nthe only such case study. Other militaries have previously used cyber operations, in war or\ncombat situations, with varied outcomes. Militaries with high capability, professionalism, and\nreadiness in both cyber and kinetic disciplines—such as the United States and Israel—have\nleveraged cyber intelligence collection and fires to enable strikes on high-value targets, for\nexample.\n\n\nBut even top-tier militaries seem to have the greatest cyber successes in tightly\ncircumscribed contexts. Former U.S. secretary of defense Ashton Carter, for example, wrote\nthat he was “largely disappointed in Cyber Command’s effectiveness against [the selfproclaimed Islamic State]”—arguably the largest and most intense U.S. military campaign\nsince the maturation of American offensive cyber capabilities. According to Carter, U.S.\nCyber Command “never really produced any effective cyber weapons or techniques” in the\ncampaign.211\n\n\n-----\n\nRussia s invasion of Ukraine is an even larger and more ambitious military endeavor than the\nU.S. campaign against the Islamic State, and it seems to reaffirm an emerging truth of\nwartime cyber operations: modern wars will always feature cyber operations, but cyber\noperations won’t always be important to these wars. Rather, the scale of war appears\ninversely correlated with the strategic impact of cyber operations. If this correlation holds,\ncyberspace should probably not be seen as a “fifth domain” of warfare equivalent in stature\nto land, sea, air, and space.212\n\n## Acknowledgments\n\nThe author is very grateful to Dave Aitel, Nick Beecroft, Steven Feldstein, Ariel (Eli) Levite,\nArthur Nelson, George Perkovich, Max Smeets, and Gavin Wilde for their valuable feedback\non versions of this paper, and to many other experts and officials who shared relevant\ninsights and critiques while the paper was under development. The author would also like to\nthank June Lee and Gerald Torres for research assistance. The final paper reflects the views\nof the author alone.\n\n## Notes\n\n1 For the purposes of this paper, “cyber operations” refers to the hacking of computers and\n\ndigital systems, primarily by remote means (over the internet) but also when facilitated by\nhuman agents. Related concepts—namely electronic warfare, signals intelligence, and\ninfluence operations—are not a primary focus. While these related ideas are intertwined with\ncyber operations in Russian doctrine and can be blended, this paper cannot consider them\nall in depth. The paper primarily focuses on cyber operations directed or orchestrated by the\nRussian state—whether ultimately carried out by military members, intelligence officers,\ncriminals, or others. It does not consider truly independent pro-Russian hacktivism (to the\nextent such a thing exists). Nor does it evaluate Russian cyber operations conducted against\nnon-Ukrainian targets, though many of these (such as intelligence gathering and operational\npreparation in NATO country networks, or online suppression of Russia’s own citizens) are\nconnected to the war. Finally, offensive cyber operations by pro-Ukraine actors, including the\nUnited States and NATO, are also beyond the scope of this paper.\n\n\n2 The word “cyber” is never used in the following major narratives of the war and its key\n\nbattles: “Ukraine Conflict Updates,” Institute for the Study of War, accessed November 15,\n[2022, https://www.understandingwar.org/backgrounder/ukraine-conflict-updates; Andrew S.](https://www.understandingwar.org/backgrounder/ukraine-conflict-updates)\nBowen, “Russia’s War in Ukraine: Military and Intelligence Aspects,” Congressional\nResearch Service, September 14, 2022,\n[https://crsreports.congress.gov/product/pdf/R/R47068; and Paul Sonne, Isabelle](https://crsreports.congress.gov/product/pdf/R/R47068)\nKhurshudyan, Serhiy Morgunov, and Kostiantyn Khudov, “Battle for Kyiv: Ukrainian Valor,\nRussian Blunders Combined to Save the Capital,” Washington Post, August 24, 2022,\nhttps://www.washingtonpost.com/national-security/interactive/2022/kyiv-battle-ukrainesurvival/. “Cyber” is mentioned in passing in Jack Watling and Nick Reynolds, “Ukraine at\n\n\n-----\n\nWar: Paving the Road From Survival to Victory, Royal United Services Institute, July 4,\n[2022, https://static.rusi.org/special-report-202207-ukraine-final-web.pdf; and Mykhaylo](https://static.rusi.org/special-report-202207-ukraine-final-web.pdf)\nZabrodskyi, Jack Watling, Oleksandr V. Danylyuk, and Nick Reynolds, “Preliminary Lessons\nin Conventional Warfighting From Russia’s Invasion of Ukraine: February–July 2022,” Royal\nUnited Services Institute, November 20, 2022, https://static.rusi.org/359-SR-UkrainePreliminary-Lessons-Feb-July-2022-web-final.pdf.\n\n3 James A. Lewis, “Cyber War and Ukraine,” Center for Strategic and International Studies,\n\n[June 16, 2022, https://www.csis.org/analysis/cyber-war-and-ukraine.](https://www.csis.org/analysis/cyber-war-and-ukraine)\n\n\n4 Nadiya Kostyuk and Aaron Brantly, “War in the Borderland Through Cyberspace: Limits of\n\nDefending Ukraine Through Interstate Cooperation,” Contemporary Security Policy 43, no. 2\n[(2022): 498–515, https://www.tandfonline.com/doi/pdf/10.1080/13523260.2022.2093587.](https://www.tandfonline.com/doi/pdf/10.1080/13523260.2022.2093587)\n\n5 “Ukraine Conflict: Cyberattacks, Frequently Asked Questions,” CyberPeace Institute, June\n\n16, 2022, https://cyberpeaceinstitute.org/news/ukraine-conflict-cyberattacks-frequentlyasked-questions/.\n\n\n6 Dustin Volz and Robert McMillan, “In Ukraine, a ‘Full-Scale Cyberwar’ Emerges,” Wall\n\n_Street Journal, April 12, 2022, https://www.wsj.com/articles/in-ukraine-a-full-scale-cyberwar-_\nemerges-11649780203; and “Defending Ukraine: Early Lessons From the Cyber War,”\nMicrosoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n7 David Cattler and Daniel Black, “The Myth of the Missing Cyberwar,” Foreign Affairs, April\n\n6, 2022, [https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar.](https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar)\n\n\n8 Jeremy Fleming, “The Head of GCHQ Says Vladimir Putin Is Losing the Information War in\n\nUkraine,” Economist, August 18, 2022, https://www.economist.com/by[invitation/2022/08/18/the-head-of-gchq-says-vladimir-putin-is-losing-the-information-war-in-](https://www.economist.com/by-invitation/2022/08/18/the-head-of-gchq-says-vladimir-putin-is-losing-the-information-war-in-ukraine)\nukraine.\n\n9 Nahal Toosi, Alexander Ward, and Maggie Miller, “Fear and Loathing in Aspen,” Politico,\n\nJuly 23, 2022, https://www.politico.com/news/2022/07/23/iran-russia-ukraine-defense-aspen00047550.\n\n\n10 Raphael Satter, “Satellite Outage Caused ‘Huge Loss in Communications’ at War’s Outset\n\n—Ukrainian Official,” Reuters, March 15, 2022, https://www.reuters.com/world/satelliteoutage-caused-huge-loss-communications-wars-outset-ukrainian-official-2022-03-15/; and\nDustin Volz and Robert McMillan, “In Ukraine, a ‘Full-Scale Cyberwar’ Emerges,” Wall Street\n_Journal, April 12, 2022, https://www.wsj.com/articles/in-ukraine-a-full-scale-cyberwar-_\nemerges-11649780203.\n\n\n-----\n\nKim Zetter, Viasat Hack Did Not Have Huge Impact on Ukrainian Military\nCommunications, Official Says,” Zero Day, September 26, 2022,\n[https://zetter.substack.com/p/viasat-hack-did-not-have-huge-impact; and Dustin Volz and](https://zetter.substack.com/p/viasat-hack-did-not-have-huge-impact)\nRobert McMillan, “In Ukraine, a ‘Full-Scale Cyberwar’ Emerges,” Wall Street Journal, April\n12, 2022, https://www.wsj.com/articles/in-ukraine-a-full-scale-cyberwar-emerges11649780203.\n\n12 Dmitri Alperovitch, Twitter post, August 24, 2022, 6:02 p.m.,\n\n[https://twitter.com/DAlperovitch/status/1562560980105584640; and James A. Lewis, “Cyber](https://twitter.com/DAlperovitch/status/1562560980105584640)\nWar and Ukraine,” Center for Strategic and International Studies, June 16, 2022,\n[https://www.csis.org/analysis/cyber-war-and-ukraine.](https://www.csis.org/analysis/cyber-war-and-ukraine)\n\n\n13 Ciaran Martin, “Cyber Realism in a Time of War,” Lawfare, March 2, 2022,\n\n[https://www.lawfareblog.com/cyber-realism-time-war. Updating his assessment in November,](https://www.lawfareblog.com/cyber-realism-time-war)\nMartin said that cyber operations during the Russia-Ukraine war have been “intense and\nimportant” while nevertheless showing “severe limitations . . . as a wartime capability.”\n“Lessons From Russia’s Cyber-war in Ukraine,” Economist, November 30, 2022,\nhttps://www.economist.com/science-and-technology/2022/11/30/lessons-from-russias-cyberwar-in-ukraine.\n\n14 David Cattler and Daniel Black, “The Myth of the Missing Cyberwar,” Foreign Affairs, April\n\n6, 2022, [https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar.](https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar)\n\n\n15 Joint Chiefs of Staff, “Joint Publication 3-0: Joint Operations,” October 22, 2018,\n\n[https://irp.fas.org/doddir/dod/jp3_0.pdf. The “fires” construct may or may not be how Russia](https://irp.fas.org/doddir/dod/jp3_0.pdf)\nconceptualizes its own military cyber effects operations in Ukraine. This paper’s use of the\nterm therefore presents some risk of mirror-imaging—that is, seeing Russia through a U.S.\nor Western lens, rather than as Russia sees itself. However, the paper’s primary aim is to\ninform Western policymaking; mapping the Russia-Ukraine war onto Western frameworks\ncan help to generate insights and recommendations directly relevant to Western militaries.\nAdditionally, Gavin Wilde has argued that Russia’s own holistic doctrine of “information\nwarfare” is “overinflated” and premised on a “conspiratorial mindset” that “superimpos[es] a\nlinear logic to conflict and attribute[s] far more control and intentionality . . . than was ever\ntruly warranted.” Wilde warns Western analysts “not to conflate the self-reinforcing logic of\nthat concept with operational coherence, much less strategic impact.” To be sure,\nWesterners must look to Russian concepts when interpreting and predicting Russian\ndecisions. But these concepts aren’t the only, or necessarily the best, tools for assessing the\nimpact of Russian actions. See Gavin Wilde, “Assess Russia’s Cyber Performance Without\nRepeating Its Past Mistakes,” War on the Rocks, July 21, 2022,\nhttps://warontherocks.com/2022/07/assess-russias-cyber-performance-without-repeating-itspast-mistakes/.\n\n\n-----\n\nTechnically, the preferred term in U.S. doctrine is cyberspace attack, considered a form\nof fires.” Joint Chiefs of Staff, “Joint Publication 3-12: Cyberspace Operations,” June 8, 2018,\n[https://www.jcs.mil/Portals/36/Documents/Doctrine/pubs/jp3_12.pdf. But cyberspace attack is](https://www.jcs.mil/Portals/36/Documents/Doctrine/pubs/jp3_12.pdf)\nunfortunately similar to the generic term “cyber attack,” a notoriously ambiguous phrase that\ncauses frequent miscommunication and lacks clear military connotation. This paper therefore\nrefers to cyber fires.\n\n17 Joshua Rovner, “Cyber War as an Intelligence Contest,” War on the Rocks, September 16,\n\n[2019, https://warontherocks.com/2019/09/cyber-war-as-an-intelligence-contest/.](https://warontherocks.com/2019/09/cyber-war-as-an-intelligence-contest/)\n\n\n18 Julian E. Barnes, “U.S. Lacks a Clear Picture of Ukraine’s War Strategy, Officials Say,”\n\n_New York Times, June 8, 2022,_ https://www.nytimes.com/2022/06/08/us/politics/ukraine-warus-intelligence.html; and Sean Lyngaas, “Russian Missile Strikes Overshadow Cyberattacks\nas Ukraine Reels From Blackouts, CNN, November 5, 2022,\nhttps://www.cnn.com/2022/11/05/politics/russia-cyber-attacks-missiles-ukraineblackouts/index.html.\n\n19 Kenneth R. Rosen, “The Man at the Center of the New Cyber World War,” Politico, July\n\n14, 2022, https://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486.\n\n\n20 Suzanne Smalley, “Cybersecurity Experts Question Microsoft’s Ukraine Report,”\n\nCyberScoop, July 1, 2022, https://www.cyberscoop.com/cybersecurity-experts-questionmicrosofts-ukraine-report/.\n\n21 Ryan Brobst, John Hardie, and Bradley Bowman, “Non-NATO Sources of Soviet and\n\nRussian Arms for Ukraine,” Foundation for Defense of Democracies, July 6, 2022,\nhttps://www.fdd.org/analysis/2022/07/06/non-nato-sources-of-soviet-and-russian-arms-forukraine/; and Nadiya Kostyuk and Erik Gartzke, “Why Cyber Dogs Have Yet to Bark Loudly\nin Russia’s Invasion of Ukraine,” Texas National Security Review 5, no. 3 (Summer 2022):\n[113–126, http://dx.doi.org/10.26153/tsw/42073.](http://dx.doi.org/10.26153/tsw/42073)\n\n\n22 “Lessons From Russia’s Cyber-war in Ukraine,” Economist, November 30, 2022,\n\nhttps://www.economist.com/science-and-technology/2022/11/30/lessons-from-russias-cyberwar-in-ukraine.\n\n23 Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road From Survival to\n\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n\n24 “KA-SAT Network Cyber Attack Overview,” Viasat, March 30, 2022,\n\n[https://news.viasat.com/blog/corporate/ka-sat-network-cyber-attack-overview.](https://news.viasat.com/blog/corporate/ka-sat-network-cyber-attack-overview)\n\n\n-----\n\nKA-SAT Network Cyber Attack Overview, Viasat, March 30, 2022,\n[https://news.viasat.com/blog/corporate/ka-sat-network-cyber-attack-overview.](https://news.viasat.com/blog/corporate/ka-sat-network-cyber-attack-overview)\n\n26 James Pearson, Raphael Satter, Christopher Bing, and Joel Schectman, “Exclusive: U.S.\n\nSpy Agency Probes Sabotage of Satellite Internet During Russian Invasion, Sources Say,”\nReuters, March 11, 2022, https://www.reuters.com/world/europe/exclusive-us-spy-agencyprobes-sabotage-satellite-internet-during-russian-2022-03-11/.\n\n\n27 Christopher Miller, Mark Scott, and Bryan Bender, “UkraineX: How Elon Musk’s Space\n\nSatellites Changed the War on the Ground,” Politico, June 9, 2022,\n[https://www.politico.com/news/2022/06/09/elon-musk-spacex-starlink-ukraine-00038039.](https://www.politico.com/news/2022/06/09/elon-musk-spacex-starlink-ukraine-00038039)\n\n28 James Pearson, Raphael Satter, Christopher Bing, and Joel Schectman, “Exclusive: U.S.\n\nSpy Agency Probes Sabotage of Satellite Internet During Russian Invasion, Sources Say,”\nReuters, March 11, 2022, https://www.reuters.com/world/europe/exclusive-us-spy-agencyprobes-sabotage-satellite-internet-during-russian-2022-03-11/; “Surfbeam2 Blackout, What\nHappened With KA-SAT?,” SEKOIA.IO, March 7, 2022,\nhttps://f.hubspotusercontent10.net/hubfs/7095517/%5BMarketing%5D%20-%20Ebook[analyse/TLP_WHITE_FLINT%202022-015%20-](https://f.hubspotusercontent10.net/hubfs/7095517/%5BMarketing%5D%20-%20Ebook-analyse/TLP_WHITE_FLINT%202022-015%20-%20Surfbeam2%20blackout%2C%20what%20happened%20with%20KA-SAT.pdf)\n%20Surfbeam2%20blackout%2C%20what%20happened%20with%20KA-SAT.pdf; and Ellen\nNakashima, “Russian Military Behind Hack of Satellite Communication Devices in Ukraine at\nWar’s Outset, U.S. Officials Say,” Washington Post, March 24, 2022,\nhttps://www.washingtonpost.com/national-security/2022/03/24/russian-military-behind-hacksatellite-communication-devices-ukraine-wars-outset-us-officials-say/.\n\n\n29 Raphael Satter, “Satellite Outage Caused ‘Huge Loss in Communications’ at War’s Outset\n\n—Ukrainian Official,” Reuters, March 15, 2022, https://www.reuters.com/world/satelliteoutage-caused-huge-loss-communications-wars-outset-ukrainian-official-2022-03-15/; and\nDustin Volz and Robert McMillan, “In Ukraine, a ‘Full-Scale Cyberwar’ Emerges,” Wall Street\n_Journal, April 12, 2022, https://www.wsj.com/articles/in-ukraine-a-full-scale-cyberwar-_\nemerges-11649780203.\n\n30 Kim Zetter, “Viasat Hack ‘Did Not’ Have Huge Impact on Ukrainian Military\n\nCommunications, Official Says,” Zero Day, September 26, 2022,\n[https://zetter.substack.com/p/viasat-hack-did-not-have-huge-impact.](https://zetter.substack.com/p/viasat-hack-did-not-have-huge-impact)\n\n\n31 Paul Sonne, Isabelle Khurshudyan, Serhiy Morgunov, and Kostiantyn Khudov, “Battle for\n\nKyiv: Ukrainian Valor, Russian Blunders Combined to Save the Capital,” Washington Post,\nAugust 24, 2022, https://www.washingtonpost.com/national-security/interactive/2022/kyivbattle-ukraine-survival/.\n\n32 Dan Rice, “The Untold Story of the Battle for Kyiv,” Small Wars Journal, May 31, 2022,\n\n[https://smallwarsjournal.com/jrnl/art/untold-story-battle-kyiv; and Jack Watling and Nick](https://smallwarsjournal.com/jrnl/art/untold-story-battle-kyiv)\nReynolds, “Operation Z: The Death Throes of an Imperial Delusion,” Royal United Services\n\n\n-----\n\n[Institute, April 22, 2022, https://static.rusi.org/special-report-202204-operation-z-web.pdf.](https://static.rusi.org/special-report-202204-operation-z-web.pdf)\n\n33 Thomas Brewster, “As Russia Invaded, Hackers Broke Into a Ukrainian Internet Provider.\n\nThen Did It Again as Bombs Rained Down,” Forbes, March 10, 2022,\nhttps://www.forbes.com/sites/thomasbrewster/2022/03/10/cyberattack-on-major-ukraineinternet-provider-causes-major-outages/; and NetBlocks, Twitter post, February 23, 2022,\n11:47 p.m., [https://twitter.com/netblocks/status/1496708402755559424.](https://twitter.com/netblocks/status/1496708402755559424)\n\n\n34 Melanie Mingas, “Ukrtelecom Restores 85% of Services After ‘Powerful Cyberattack,’”\n\nCapacity, March 29, 2022,\nhttps://www.capacitymedia.com/article/29wch971qqy0z3dyifx8g/ukrtelecom-restores-85-ofservices-after-powerful-cyberattack.\n\n35 Dustin Volz and Robert McMillan, “In Ukraine, a ‘Full-scale Cyberwar’ Emerges,” Wall\n\n_Street Journal, April 12, 2022, https://www.wsj.com/articles/in-ukraine-a-full-scale-cyberwar-_\nemerges-11649780203.\n\n\n36 “Internet Disruptions Registered as Russia Moves in on Ukraine,” Netblocks, February 24,\n\n2022, https://netblocks.org/reports/internet-disruptions-registered-as-russia-moves-in-onukraine-W80p4k8K.\n\n37 Melanie Mingas, “Ukrtelecom Restores 85% of Services After ‘Powerful Cyberattack,’”\n\nCapacity, March 29, 2022,\nhttps://www.capacitymedia.com/article/29wch971qqy0z3dyifx8g/ukrtelecom-restores-85-ofservices-after-powerful-cyberattack; Nadiya Kostyuk and Erik Gartzke, “Cyberattacks Have\nYet to Play a Significant Role in Russia’s Battlefield Operations in Ukraine –Cyberwarfare\nExperts Explain the Likely Reasons,” The Conversation, April 4, 2022,\nhttps://theconversation.com/cyberattacks-have-yet-to-play-a-significant-role-in-russiasbattlefield-operations-in-ukraine-cyberwarfare-experts-explain-the-likely-reasons-178604;\nand Drew FitzGerald, “In Ukraine War, Keeping Phones Online Becomes Key Defense,” Wall\n_Street Journal, March 24, 2022,_ https://www.wsj.com/articles/in-ukraine-war-keeping-phonesonline-becomes-key-defense-11648123200.\n\n\n38 Thomas Brewster, “Ukraine’s Engineers Battle to Keep the Internet Running While\n\nRussian Bombs Fall Around Them,” Forbes, March 22, 2022,\nhttps://www.forbes.com/sites/thomasbrewster/2022/03/22/while-russians-bombs-fall-aroundthem-ukraines-engineers-battle-to-keep-the-internet-running/.\n\n39 Peggy Kelly and Bruce Sussman, “Ukraine Cybersecurity Leader Shares Defense Insights\n\nFrom Cyber and Physical Front Lines,” BlackBerry Blog, October 27, 2022,\nhttps://blogs.blackberry.com/en/2022/10/ukraine-cybersecurity-leader-shares-defenseinsights-from-cyber-and-physical-fronts.\n\n\n-----\n\nDefending Ukraine: Early Lessons From the Cyber War, Microsoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n41 “Four Months of War: Cyberattack Statistics” (English version), State Service of Special\n\nCommunications and Information Protection of Ukraine, June 30, 2022,\n[https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak.](https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak)\n\n\n42 Vitor Ventura, “Wiper Malware: Attacking From Inside,” Talos, May 8, 2018,\n\n[https://www.talosintelligence.com/resources/58.](https://www.talosintelligence.com/resources/58)\n\n43 This excludes ransomware, which is designed to hold files hostage rather than\n\npermanently destroy them.\n\n\n44 To be sure, some prior attacks (like WannaCry and NotPetya) spread wildly, affecting\n\nhundreds or thousands of individual victim organizations in a single incident. See Andy\nGreenberg, “The Untold Story of NotPetya, the Most Devastating Cyberattack in History,”\n_Wired, August 22, 2018,_ https://www.wired.com/story/notpetya-cyberattack-ukraine-russiacode-crashed-the-world/.\n\n45 Ioan Iacob and Iulian Madalin Ionita, “The Anatomy of Wiper Malware, Part 1: Common\n\nTechniques,” CrowdStrike, August 12, 2022, https://www.crowdstrike.com/blog/the-anatomyof-wiper-malware-part-1/.\n\n\n46 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK; Dan Black, Twitter](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\npost, November 10, 2022, 11:22 a.m.,\n[https://twitter.com/DanWBlack/status/1590741781771354112; Andy Greenberg, “Russia’s](https://twitter.com/DanWBlack/status/1590741781771354112)\nNew Cyberwarfare in Ukraine Is Fast, Dirty, and Relentless,” Wired, November 10, 2022,\n[https://www.wired.com/story/russia-ukraine-cyberattacks-mandiant/; and Max Smeets,](https://www.wired.com/story/russia-ukraine-cyberattacks-mandiant/)\nTwitter post, July 20, 2022, 8:11 a.m.,\n[https://twitter.com/Maxwsmeets/status/1549728801332019202.](https://twitter.com/Maxwsmeets/status/1549728801332019202)\n\n47 Gergely Revay, “An Overview of the Increasing Wiper Malware Threat,” Fortinet, April 28,\n\n[2022, https://www.fortinet.com/blog/threat-research/the-increasing-wiper-malware-threat; and](https://www.fortinet.com/blog/threat-research/the-increasing-wiper-malware-threat)\nMax Smeets, Twitter post, July 20, 2022, 8:11 a.m.,\n[https://twitter.com/Maxwsmeets/status/1549728801332019202.](https://twitter.com/Maxwsmeets/status/1549728801332019202)\n\n\n48 David Cattler and Daniel Black, “The Myth of the Missing Cyberwar,” Foreign Affairs, April\n\n6, 2022, [https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar.](https://www.foreignaffairs.com/articles/ukraine/2022-04-06/myth-missing-cyberwar)\n\n49 “Special Report: Ukraine,” Microsoft, April 27, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\n\n\n-----\n\nKenneth R. Rosen, The Man at the Center of the New Cyber World War, Politico, July\n14, 2022, https://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486.\n\n51 Figure 1 aims to paint a very general picture of rough patterns and orders of magnitude\n\nseen in multiple data sources; it should not be understood as quantitatively precise. To\nenable side-by-side comparisons of disparate data, certain data points have been averaged\nor occasionally interpolated, as explained below. This results in some loss of fidelity,\nincluding a possible smoothing of peaks and valleys.\n\nMicrosoft data on the number of organizations attacked were assembled from three different\nreports. Weeks 1-6 come from “Special Report: Ukraine,” Microsoft, April 27, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd. This report provided a](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\nweek-by-week victim tally, with thirty-seven organizations in total, through Week 6. The next\ntranche of data comes from “Defending Ukraine: Early Lessons From the Cyber War,”\nMicrosoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK. This second report](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\nprovided an updated total of forty-eight victim organizations, without a week-by-week\nbreakdown. Assuming the report was up to date as of its release, these figures imply eleven\nnew victims over eleven weeks, averaged here as one attack each in Weeks 7-17.\n\nThe final Microsoft data come from Clint Watts, “Preparing for a Russian Cyber Offensive\nAgainst Ukraine This Winter,” Microsoft, December 3, 2022, https://blogs.microsoft.com/onthe-issues/2022/12/03/preparing-russian-cyber-offensive-ukraine/. Here, Microsoft gave its\nlatest estimate that “roughly 50 Ukrainian organizations” had been victimized by Russian\ndestructive malware as of mid-October. Since late June total was already forty-eight, the midOctober total of “roughly 50” indicates no more than a few new victims during the intervening\nmonths. The report separately described a “spike” of destructive attacks in October “after two\nmonths of little to no wiper activity.” However, the spike would necessarily be small given the\nsimilar June and October totals. Microsoft’s latest report did not give a full timeline of\ndestructive attacks since June, but it did specifically mention an October 11 ransomware\nattack against two Ukrainian organizations, and an October 16 destructive attack “against\ncritical infrastructure along the Dniester and Dnieper rivers.” (It also mentioned other times in\nOctober when Russia “staged” destructive malware, but Microsoft did not say these incidents\nculminated in successful attacks.) Figure 1 seeks to give a rough reconciliation of all these\ndata points. It posits that Microsoft identified no victimized organizations between Weeks 18\nand 32, two victims in Week 33 (the October 11 attack) and two more in Week 34 (an\ninterpretation of the October 16 attack). This brings the total number of organizations\nattacked to fifty-two (or “roughly 50”).\n\nCyberPeace Institute data come from “Timeline,” CyberPeace Institute, accessed November\n[13, 2022, https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline. This figure includes](https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline)\ncyber incidents carried out by all perpetrators.\n\n\n-----\n\nMandiant data on the number of attacks and malware variants come from Gabby Roncone s\nand John Wolfram’s presentation at CYBERWARCON on November 10, 2022, as\ndocumented in Dan Black, Twitter post, November 10, 2022, 11:22 a.m.,\n[https://twitter.com/DanWBlack/status/1590741781771354112; and Andy Greenberg,](https://twitter.com/DanWBlack/status/1590741781771354112)\n“Russia’s New Cyberwarfare in Ukraine Is Fast, Dirty, and Relentless,” Wired, November 10,\n[2022, https://www.wired.com/story/russia-ukraine-cyberattacks-mandiant/. Mandiant’s](https://www.wired.com/story/russia-ukraine-cyberattacks-mandiant/)\noriginal data were broken down by month. To render these comparable to Microsoft and\nCyberPeace Institute data, Mandiant numbers here have been converted to weekly\naverages, which were rounded in cases when a month’s beginning/end did not land neatly\non a week’s beginning/end.\n\nMicrosoft data on destructive malware families come in part from its April 27 report. The first\ndate of use for each malware family is taken from the same source as well as from Pawel\nKnapczyk, “Overview of the Cyber Weapons Used in the Ukraine-Russia War,” Trustwave,\nAugust 18, 2022, https://www.trustwave.com/en-us/resources/blogs/spiderlabsblog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/. Microsoft’s June 22\nreport listed the same eight families as its April 27 report, implying that no new malware\nfamilies had emerged between Weeks 7 and 17.\n\n52 “Statistics of Cyber Attacks on Ukrainian Critical Information Infrastructure: 15–22 March,”\n\nState Service of Special Communications and Information Protection of Ukraine, March 25,\n2022, https://cip.gov.ua/en/news/statistika-kiberatak-na-ukrayinsku-kritichnu-informaciinuinfrastrukturu-15-22-bereznya. Zhora said that the number of attempted “attacks” was\ngrowing, but that “most of them are unsuccessful.”\n\n\n53 Kenneth R. Rosen, “The Man at the Center of the New Cyber World War,” Politico, July\n\n14, 2022, https://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486.\n\n54 Andy Greenberg, “Russia’s New Cyberwarfare in Ukraine Is Fast, Dirty, and Relentless,”\n\n_Wired, November 10, 2022, https://www.wired.com/story/russia-ukraine-cyberattacks-_\nmandiant/.\n\n\n55 Peggy Kelly and Bruce Sussman, “Ukraine Cybersecurity Leader Shares Defense Insights\n\nFrom Cyber and Physical Front Lines,” BlackBerry Blog, October 27, 2022,\nhttps://blogs.blackberry.com/en/2022/10/ukraine-cybersecurity-leader-shares-defenseinsights-from-cyber-and-physical-fronts.\n\n56 Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road From Survival to\n\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf; Phil Stewart, “Exclusive: U.S. Assesses up to 60% Failure\nRate for Some Russian Missiles, Officials Say,” Reuters, March 25, 2022,\nhttps://www.reuters.com/business/aerospace-defense/exclusive-us-assesses-up-60-failure\n\n-----\n\n[rate-some-russian-missiles-officials-say-2022-03-24/; and Aila Slisco, Russia Has Fired](https://www.reuters.com/business/aerospace-defense/exclusive-us-assesses-up-60-failure-rate-some-russian-missiles-officials-say-2022-03-24/)\n1,300 Missiles in Ukraine This War, More Strikes Expected,” Newsweek, April 26, 2022,\nhttps://www.newsweek.com/russia-has-fired-1300-missiles-ukraine-this-war-more-strikesexpected-1701267.\n\n57 Andy Greenberg, “Russia’s Sandworm Hackers Attempted a Third Blackout in Ukraine,”\n\n_[Wired, April 12, 2022, https://www.wired.com/story/sandworm-russia-ukraine-blackout-gru/.](https://www.wired.com/story/sandworm-russia-ukraine-blackout-gru/)_\n\n\n58 “Cyber Attack of the Sandworm Group (UAC-0082) on Energy Facilities of Ukraine Using\n\nMalware INDUSTROYER2 and CADDYWIPER (CERT-UA#4435)” (via Google Translate),\nComputer Emergency Response Team of Ukraine, April 12, 2022,\n[https://cert.gov.ua/article/39518.](https://cert.gov.ua/article/39518)\n\n59 “Industroyer2: Industroyer Reloaded,” ESET, April 12, 2022,\n\n[https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/.](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\n\n\n60 Kate Conger, “Ukraine Says It Thwarted a Sophisticated Russian Cyberattack on Its\n\nPower Grid,” New York Times, April 12, 2022,\n[https://www.nytimes.com/2022/04/12/us/politics/ukraine-russian-cyberattack.html.](https://www.nytimes.com/2022/04/12/us/politics/ukraine-russian-cyberattack.html)\n\n61 “Viktor Zhora,” Digital Peace Now, June 22, 2022,\n\n[https://digitalpeacenow.org/stillvulnerable-viktor-zhora/.](https://digitalpeacenow.org/stillvulnerable-viktor-zhora/)\n\n\n62 “ESET Research Jointly Presents Industroyer2 at Black Hat USA With Ukrainian\n\nGovernment Representative,” press release, ESET, August 25, 2022,\nhttps://www.eset.com/int/about/newsroom/press-releases/events/eset-research-jointlypresents-industroyer2-at-black-hat-usa-with-ukrainian-government-representativ/.\n\n63 Patrick Howell O’Neill, “Russian Hackers Tried to Bring Down Ukraine’s Power Grid to\n\nHelp the Invasion,” MIT Technology Review, April 12, 2022,\nhttps://www.technologyreview.com/2022/04/12/1049586/russian-hackers-tried-to-bring-downukraines-power-grid-to-help-the-invasion/.\n\n\n64 “Enemy Launches Hacker Attacks on the Power System,” press release, DTEK, July 1,\n\n2022, https://dtek.com/en/media-center/news/vslid-za-raketnimi-udarami-po-tes-vorogzavdae-khakerskikh-udariv-po-energosistemi/.\n\n65 PowerOutage.com, Twitter posts, 2022, [https://twitter.com/poweroutage_com; Carly](https://twitter.com/poweroutage_com)\n\nOlson, “Ukraine Says Russia Is Retaliating by Hitting Critical Infrastructure, Causing\nBlackouts,” New York Times, September 11, 2022,\n[https://www.nytimes.com/2022/09/12/world/ukraine-power-blackout.html; “Eastern Ukraine](https://www.nytimes.com/2022/09/12/world/ukraine-power-blackout.html)\nSuffers Blackout, Kyiv Blames Russia,” Al Jazeera, September 11, 2022,\nhttps://www.aljazeera.com/news/2022/9/11/ukraines-east-reports-blackouts-water-cutsofficials; and Sean Lyngaas, “Russian Missile Strikes Overshadow Cyberattacks as Ukraine\n\n\n-----\n\nReels From Blackouts, CNN, November 5, 2022,\nhttps://www.cnn.com/2022/11/05/politics/russia-cyber-attacks-missiles-ukraineblackouts/index.html.\n\n66 Pjotr Sauer and Andrew Roth, “‘It Was Worse Than Hell’: Life in Mariupol Under Russian\n\nOccupation,” Guardian, June 16, 2022,\nhttps://www.theguardian.com/world/2022/jun/16/ukraine-life-in-mariupol-under-russianoccupation; and Asami Terajima, “Over 100,000 Mariupol Residents Trapped in Dire\nConditions Under Russian Occupation,” Kyiv Independent, August 12, 2022,\nhttps://kyivindependent.com/national/over-100-000-mariupol-residents-trapped-in-direconditions-under-russian-occupation.\n\n\n67 Rob Picheta and Tim Lister, “Zelensky Accuses Moscow of Energy ‘Terrorism’ as Russian\n\nStrikes Knock out Power for Millions,” CNN, November 4, 2022,\n[https://www.cnn.com/2022/11/04/europe/ukraine-energy-terrorism-zelensky-russia-intl.](https://www.cnn.com/2022/11/04/europe/ukraine-energy-terrorism-zelensky-russia-intl)\n\n68 Dmitri Alperovitch, Twitter post, Aug 24, 2022, 6:02 p.m.,\n\n[https://twitter.com/DAlperovitch/status/1562560980105584640.](https://twitter.com/DAlperovitch/status/1562560980105584640)\n\n\n69 Dana Priest, “NSA Growth Fueled by Need to Target Terrorists,” Washington Post, July 21,\n\n2013, https://www.washingtonpost.com/world/national-security/nsa-growth-fueled-by-needto-target-terrorists/2013/07/21/24c93cf4-f0b1-11e2-bed3-b9b6fe264871_story.html; and\nJeremy Scahill and Glenn Greenwald, “The NSA’s Secret Role in the U.S. Assassination\nProgram,” The Intercept, February 10, 2014, https://theintercept.com/2014/02/10/the-nsassecret-role/.\n\n70 “Operation Orchard/Outside the Box (2007)” in International Cyber Law: Interactive Toolkit,\n\ned. Kubo Mačák, Tomáš Minárik, and Taťána Jančárková, September 17, 2021, accessed\nNovember 16, 2022,\n[https://cyberlaw.ccdcoe.org/wiki/Operation_Orchard/Outside_the_Box_(2007).](https://cyberlaw.ccdcoe.org/wiki/Operation_Orchard/Outside_the_Box_)\n\n\n71 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n72 “Enemy Launches Hacker Attacks on the Power System,” press release, DTEK, July 1,\n\n2022, https://dtek.com/en/media-center/news/vslid-za-raketnimi-udarami-po-tes-vorogzavdae-khakerskikh-udariv-po-energosistemi/.\n\n\n73 Sean Lyngaas, “Russian Hackers Allegedly Target Ukraine’s Biggest Private Energy Firm,”\n\nCNN, July 5, 2022, https://www.cnn.com/2022/07/01/politics/russia-ukraine-dtekhack/index.html; and “XakNet Interview: Exclusive Interview With Pro-Russian Hackers\n‘XakNet Team’ Specially for Russian OSINT,” Treadstone 71, June 26, 2022,\nhttps://cybershafarat.com/2022/10/31/xaknet-kremlin-proxy-given-specific-instructions-tohack-kropyva-ddos-telegram/2/.\n\n\n-----\n\nVictor Zhora, Twitter post, July 1, 2022, 9:13 a.m.,\n[https://twitter.com/VZhora/status/1542858906560512000.](https://twitter.com/VZhora/status/1542858906560512000)\n\n75 “To Investors & Partners,” DTEK, accessed November 16, 2022,\n\n[https://energo.dtek.com/en/ir/#key_indicators.](https://energo.dtek.com/en/ir/#key_indicators)\n\n\n76 “Integrated Report 2020: Financial and Non-Financial Results,” DTEK, 2021,\n\nhttps://dtek.com/content/announces/dtek_ar_2020_en_web_plus1_file_download_s1182_t46\n55_i6801_orig.pdf.\n\n77 “The Russian Occupiers Shelled the Kryvorizka TPP: There Is Considerable Destruction”\n\n(via Google Translate), Rivne Media, April 27, 2022, https://rivne.media/news/rosiyskiokupanti-obstrilyali-krivorizku-tes-e-znachni-ruynuvannya.\n\n\n78 “Thermal Power Plants Shelling May Cause Ecological Catastrophe,” Rubryka, July 27,\n\n2022, https://rubryka.com/en/2022/07/27/obstrily-tets-mozhut-pryzvesty-do-ekologichnoyikatastrofy/.\n\n79 Kateryna Stepanenko, Layne Philipson, Katherine Lawlor, Karolina Hird, and Frederick W.\n\nKagan, “Russian Offensive Campaign Assessment, August 2,” Institute for the Study of War,\nAugust 2, 2022, https://www.understandingwar.org/backgrounder/russian-offensivecampaign-assessment-august-2.\n\n\n80 Karolina Hird, Kateryna Stepanenko, Frederick W. Kagan, and Grace Mappes, “Russian\n\nOffensive Campaign Assessment, June 30,” Institute for the Study of War, June 30, 2022,\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessmentjune-30; and Kateryna Stepanenko, Karolina Hird, Frederick W. Kagan, and George Barros,\n“Russian Offensive Campaign Assessment, July 1,” Institute for the Study of War, July 1,\n2022, https://understandingwar.org/backgrounder/russian-offensive-campaign-assessmentjuly-1.\n\n81 Ruslan Kermach, “The Ukrainian Electric Power Industry on the Front Line: Challenges\n\nand Opportunities Ahead,” New Eastern Europe, May 3, 2022,\nhttps://neweasterneurope.eu/2022/05/03/the-ukrainian-electric-power-industry-on-the-frontline-challenges-and-opportunities-ahead/.\n\n\n82 “Enemy Launches Hacker Attacks on the Power System,” press release, DTEK, July 1,\n\n2022, https://dtek.com/en/media-center/news/vslid-za-raketnimi-udarami-po-tes-vorogzavdae-khakerskikh-udariv-po-energosistemi/.\n\n83 “Special Report: Ukraine,” Microsoft, April 27, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\n\n\n-----\n\nLessons From Russia s Cyber-war in Ukraine, Economist, November 30, 2022,\nhttps://www.economist.com/science-and-technology/2022/11/30/lessons-from-russias-cyberwar-in-ukraine.\n\n85 Clint Watts, “Preparing for a Russian Cyber Offensive Against Ukraine This Winter,”\n\nMicrosoft, December 3, 2022, https://blogs.microsoft.com/on-theissues/2022/12/03/preparing-russian-cyber-offensive-ukraine/.\n\n\n86 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n87 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n\n88 Tim Lister, Gianluca Mezzofiore, Paul Murphy, Laura Smith-Spark, and Rob Picheta,\n\n“Russia Widens Attack on Ukraine’s Cities, Striking Western Airfields and Dnipro,” CNN,\nMarch 11, 2022, https://www.cnn.com/2022/03/11/europe/russia-invasion-ukraine-03-11intl/index.html.\n\n89 Carole Landry, “More Cities Bombarded,” New York Times, March 11, 2022,\n\n[https://www.nytimes.com/2022/03/11/briefing/russia-ukraine-attacked-cities.html; “Scenes](https://www.nytimes.com/2022/03/11/briefing/russia-ukraine-attacked-cities.html)\nFrom an Invasion: Russia Launches Long-Predicted Attack Against Ukraine,”\nRadioFreeEurope/RadioLiberty, February 24, 2022, https://www.rferl.org/a/ukraine-russiaattack-photographs-invasion/31720168.html; and Christopher Miller, “How Dnipro’s Toughtalking Mayor Keeps His City on a War Footing,” Politico, July 29, 2022,\n[https://www.politico.com/news/2022/07/29/dnipros-mayor-ukraine-00048798.](https://www.politico.com/news/2022/07/29/dnipros-mayor-ukraine-00048798)\n\n\n90 Max Smeets, “The Strategic Promise of Offensive Cyber Operations,” Strategic Studies\n\n_Quarterly 12, no. 3 (Fall 2018): 90–113,_ [https://www.jstor.org/stable/26481911.](https://www.jstor.org/stable/26481911)\n\n91 “Ukraine Conflict Update 16,” Institute for the Study of War, March 6, 2022,\n\n[https://www.understandingwar.org/backgrounder/ukraine-conflict-update-16; and Matilda](https://www.understandingwar.org/backgrounder/ukraine-conflict-update-16)\nKuklish and Jake Kwon, “1 Killed in Airstrikes Near Preschool and Apartment Building in\nDnipro, Ukrainian Authorities Say,” CNN, March 11, 2022, https://www.cnn.com/europe/livenews/ukraine-russia-putin-news-03-11-22/h_052f8275998a1734c2f5638e414b198e.\n\n\n92 William Ralston, “The Untold Story of a Cyberattack, a Hospital and a Dying Woman,”\n\n_Wired, November 11, 2020, https://www.wired.co.uk/article/ransomware-hospital-death-_\ngermany; Kevin Poulsen, Robert McMillan, and Melanie Evans, “A Hospital Hit by Hackers, a\nBaby in Distress: The Case of the First Alleged Ransomware Death,” Wall Street Journal,\nSeptember 30, 2021, https://www.wsj.com/articles/ransomware-hackers-hospital-firstalleged-death-11633008116; and Joseph Marks, “The Cybersecurity 202: This Was the\n\n\n-----\n\nMonth Cyberattacks Turned Fatal, Washington Post, September 23, 2020,\nhttps://www.washingtonpost.com/politics/2020/09/23/cybersecurity-202-this-was-monthcyberattacks-turned-fatal/.\n\n93 Mason Clark, George Barros, and Kateryna Stepanenko, “Russian Offensive Campaign\n\nAssessment, March 12,” Institute for the Study of War, March 12, 2022,\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessmentmarch-12; Mason Clark, George Barros, and Kateryna Stepanenko, “Russian Offensive\nCampaign Assessment, March 13,” Institute for the Study of War, March 13, 2022,\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessmentmarch-13; and Mason Clark, George Barros, and Kateryna Stepanenko, “Russian Offensive\nCampaign Assessment, March 14,” Institute for the Study of War, March 14, 2022,\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessmentmarch-14.\n\n\n94 Mason Clark, George Barros, and Karolina Hird, “Russian Offensive Campaign\n\nAssessment, April 1,” Institute for the Study of War, April 1, 2022,\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessmentapril-1.\n\n95 “Ukraine Conflict Updates,” Institute for the Study of War, accessed November 15, 2022,\n\n[https://www.understandingwar.org/backgrounder/ukraine-conflict-updates; and Christopher](https://www.understandingwar.org/backgrounder/ukraine-conflict-updates)\nMiller, “How Dnipro’s Tough-talking Mayor Keeps His City on a War Footing,” Politico, July\n[29, 2022, https://www.politico.com/news/2022/07/29/dnipros-mayor-ukraine-00048798.](https://www.politico.com/news/2022/07/29/dnipros-mayor-ukraine-00048798)\n\n\n96 Joint Chiefs of Staff, “Methodology for Combat Assessment,” March 8, 2019,\n\nhttps://www.jcs.mil/Portals/36/Documents/Doctrine/training/jts/cjcsi_3162_02.pdf?ver=201903-13-092459-350.\n\n97 Sources can be found in the surrounding text. Additionally, for Ukrainian equipment and\n\npersonnel losses, see Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road\nFrom Survival to Victory,” Royal United Services Institute, July 4, 2022,\n[https://static.rusi.org/special-report-202207-ukraine-final-web.pdf; and Stew Magnuson,](https://static.rusi.org/special-report-202207-ukraine-final-web.pdf)\n“BREAKING: Ukraine to U.S. Defense Industry: We Need Long-range, Precision Weapons,”\n_National Defense, June 15, 2022,_\nhttps://www.nationaldefensemagazine.org/articles/2022/6/15/ukraine-to-us-defense-industrywe-need-long-range-precision-weapons.\n\nFor the impact of Russian electronic warfare, see Thomas Withington, “Russia’s Electronic\nWarfare Capabilities Have Had Mixed Results Against Ukraine,” The Drive, June 16, 2022,\nhttps://www.thedrive.com/the-war-zone/this-is-whats-happened-so-far-in-ukraines-electronicwarfare-battle; Jack Watling and Nick Reynolds, “Operation Z: The Death Throes of an\n\n\n-----\n\nImperial Delusion, April 22, 2022, https://static.rusi.org/special-report-202204-operation-zweb.pdf; and Dan Rice, “The Untold Story of the Battle for Kyiv,” Small Wars Journal, May\n[31, 2022, https://smallwarsjournal.com/jrnl/art/untold-story-battle-kyiv.](https://smallwarsjournal.com/jrnl/art/untold-story-battle-kyiv)\n\nFor telecoms disruptions and their impact, see “Internet Disruptions Registered as Russia\nMoves in on Ukraine,” Netblocks, February 24, 2022, https://netblocks.org/reports/internetdisruptions-registered-as-russia-moves-in-on-ukraine-W80p4k8K; and Christopher Miller,\nMark Scott, and Bryan Bender, “UkraineX: How Elon Musk’s Space Satellites Changed the\nWar on the Ground,” Politico, June 9, 2022, https://www.politico.com/news/2022/06/09/elonmusk-spacex-starlink-ukraine-00038039.\n\nFor electrical infrastructure damage, see PowerOutage.com, Twitter posts, 2022,\n[https://twitter.com/poweroutage_com; Carly Olson, “Ukraine Says Russia Is Retaliating by](https://twitter.com/poweroutage_com)\nHitting Critical Infrastructure, Causing Blackouts,” New York Times, September 11, 2022,\n[https://www.nytimes.com/2022/09/12/world/ukraine-power-blackout.html; “Eastern Ukraine](https://www.nytimes.com/2022/09/12/world/ukraine-power-blackout.html)\nSuffers Blackout, Kyiv Blames Russia,” Al Jazeera, September 11, 2022,\nhttps://www.aljazeera.com/news/2022/9/11/ukraines-east-reports-blackouts-water-cutsofficials; Sean Lyngaas, “Russian Missile Strikes Overshadow Cyberattacks as Ukraine\nReels From Blackouts,” CNN, November 5, 2022,\nhttps://www.cnn.com/2022/11/05/politics/russia-cyber-attacks-missiles-ukraineblackouts/index.html; Pjotr Sauer and Andrew Roth, “‘It Was Worse Than Hell’: Life in\nMariupol Under Russian Occupation,” Guardian, June 16, 2022,\nhttps://www.theguardian.com/world/2022/jun/16/ukraine-life-in-mariupol-under-russianoccupation; and Asami Terajima, “Over 100,000 Mariupol Residents Trapped in Dire\nConditions Under Russian Occupation,” Kyiv Independent, August 12, 2022,\nhttps://kyivindependent.com/national/over-100-000-mariupol-residents-trapped-in-direconditions-under-russian-occupation.\n\nFor artillery impacts, see Andrew S. Bowen, “Russia’s War in Ukraine: Military and\nIntelligence Aspects,” Congressional Research Service, September 14, 2022,\n[https://crsreports.congress.gov/product/pdf/R/R47068.](https://crsreports.congress.gov/product/pdf/R/R47068)\n\n98 David Gauthier-Villars, Steve Stecklow, Maurice Tamman, Stephen Grey, and Andrew\n\nMacaskill, “As Russian Missiles Struck Ukraine, Western Tech Still Flowed,” Reuters, August\n8, 2022, https://www.reuters.com/investigates/special-report/ukraine-crisis-russia-missileschips/; and “Four Months of War: Cyberattack Statistics” (English version), State Service of\nSpecial Communications and Information Protection of Ukraine, June 30, 2022,\n[https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak.](https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak)\n\n\n99 Russia had previously disrupted logistics with its 2017 NotPetya cyber attack, which\n\naffected the global shipping giant Maersk. Andy Greenberg, “The Untold Story of NotPetya,\nthe Most Devastating Cyberattack in History,” Wired, August 22, 2018,\n[https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/.](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)\n\n\n-----\n\nSources can be found in the surrounding text. Additionally, for information on Russian\nmunitions stockpiles, see Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road\nFrom Survival to Victory,” Royal United Services Institute, July 4, 2022,\n[https://static.rusi.org/special-report-202207-ukraine-final-web.pdf. For a discussion of](https://static.rusi.org/special-report-202207-ukraine-final-web.pdf)\nsystemic cyber risk, see David Forscey, Jon Bateman, Nick Beecroft, and Beau Woods,\n“Systemic Cyber Risk: A Primer,” Carnegie Endowment for International Peace, March 7,\n[2022, https://carnegieendowment.org/2022/03/07/systemic-cyber-risk-primer-pub-86531. For](https://carnegieendowment.org/2022/03/07/systemic-cyber-risk-primer-pub-86531)\nthe lack of “wormable” malware, see “Defending Ukraine: Early Lessons From the Cyber\nWar,” Microsoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n101 Lennart Maschmeyer and Myriam Dunn Cavelty, “Goodbye Cyberwar: Ukraine as Reality\n\nCheck,” Policy Perspectives 10, no. 3 (May 2022):\nhttps://css.ethz.ch/content/dam/ethz/special-interest/gess/cis/center-for-securitiesstudies/pdfs/PP10-3_2022-EN.pdf.\n\n\n102 Chris Krebs, “The Cyber Warfare Predicted in Ukraine May Be Yet to Come,” Financial\n\n_Times, March 20, 2022,_ https://www.ft.com/content/2938a3cd-1825-4013-82194ee6342e20ca.\n\n103 Erica D. Lonergan, Shawn W. Lonergan, Brandon Valeriano, and Benjamin Jensen,\n\n“Putin’s Invasion of Ukraine Didn’t Rely on Cyberwarfare. Here’s Why,” Washington Post,\nMarch 7, 2022, https://www.washingtonpost.com/politics/2022/03/07/putins-invasion-ukrainedidnt-rely-cyber-warfare-heres-why/.\n\n\n104 “Four Months of War: Cyberattack Statistics” (English version), State Service of Special\n\nCommunications and Information Protection of Ukraine, June 30, 2022,\n[https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak.](https://cip.gov.ua/ua/news/chotiri-misyaci-viini-statistika-kiberatak)\n\n105 “Timeline,” CyberPeace Institute, accessed November 13, 2022,\n\n[https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline. This figure includes cyber](https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline)\nincidents carried out by all perpetrators. If only those incidents attributed to state actors are\nconsidered, the CyberPeace Institute documented nineteen data thefts and eleven\ndestructive cyber attacks.\n\n\n106 Greg Miller and Catherine Belton, “Russia’s Spies Misread Ukraine and Misled Kremlin\n\nas War Loomed,” Washington Post, August 19, 2022,\n[https://www.washingtonpost.com/world/interactive/2022/russia-fsb-intelligence-ukraine-war/.](https://www.washingtonpost.com/world/interactive/2022/russia-fsb-intelligence-ukraine-war/)\n\n107 Sam Sabin and Laurens Cerulus, “Why Ukraine’s Phones and Internet Still Work, Politico,\n\n[March 7, 2022, https://www.politico.eu/article/why-ukraines-phones-and-internet-still-work/;](https://www.politico.eu/article/why-ukraines-phones-and-internet-still-work/)\nNadiya Kostyuk and Erik Gartzke, “Why Cyber Dogs Have Yet to Bark Loudly in Russia’s\nInvasion of Ukraine,” Texas National Security Review 5, no. 3 (Summer 2022): 113–126,\n\n\n-----\n\n[http://dx.doi.org/10.26153/tsw/42073; and Suzanne Smalley, Mixed Results for Russia s](http://dx.doi.org/10.26153/tsw/42073)\nAggressive Ukraine Information War, Experts Say,” CyberScoop, June 16, 2022,\n[https://www.cyberscoop.com/russia-information-war-ukraine-cyber-command-sorm/.](https://www.cyberscoop.com/russia-information-war-ukraine-cyber-command-sorm/)\n\n108 “Special Report: Ukraine,” Microsoft, April 27, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\n\n\n109 Elena Grossfeld, “What Does the War in Ukraine Tell Us About Russian Intelligence?,”\n\nKing’s College London, March 22, 2022, https://www.kcl.ac.uk/what-does-the-war-in-ukrainetell-us-about-russian-intelligence.\n\n110 Russia is hardly the first country to misread the political and military situation of a wartime\n\nfoe. And Western governments also mistakenly expected Russian forces to be able to rout\nthe Ukrainian military. Nevertheless, Moscow’s misperceptions and its resulting strategic\nblunders have been remarkably severe and wide-ranging—among the worst in modern\ntimes.\n\n\n111 Phil Stewart, “Exclusive: U.S. Assesses up to 60% Failure Rate for Some Russian\n\nMissiles, Officials Say,” Reuters, March 25, 2022,\nhttps://www.reuters.com/business/aerospace-defense/exclusive-us-assesses-up-60-failurerate-some-russian-missiles-officials-say-2022-03-24/; and Aila Slisco, “Russia Has Fired\n1,300 Missiles in Ukraine This War, More Strikes Expected,” Newsweek, April 26, 2022,\nhttps://www.newsweek.com/russia-has-fired-1300-missiles-ukraine-this-war-more-strikesexpected-1701267.\n\n112 “Russian Strike on the Kyiv TV Tower,” Forensic Architecture and the Center for Spatial\n\nTechnologies, June 10, 2022, https://forensic-architecture.org/investigation/russian-strike-onkyiv-tv-tower; and Jack Detsch and Robbie Gramer, “Russian Troops Are Taking Putin’s\nOrders to Demilitarize Ukraine Literally,” Foreign Policy, May 4, 2022,\n[https://foreignpolicy.com/2022/05/04/russia-demilitarize-ukraine-arms-facilities/.](https://foreignpolicy.com/2022/05/04/russia-demilitarize-ukraine-arms-facilities/)\n\n\n113 Valerie Hopkins, “Missile Strike in Kyiv Rattles Residents After Weeks of Quiet,” New\n\n_York Times, June 26, 2022, https://www.nytimes.com/2022/06/26/world/europe/kyiv-missile-_\nstrike-ukraine.html.\n\n114 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n\n115 Christoph Koettl, “Satellite Imagery Provides New Details About an Attack on an Airport in\n\nWestern Ukraine,” New York Times, March 8, 2022,\nhttps://www.nytimes.com/live/2022/03/08/world/ukraine-russia-war#satellite-imageryprovides-new-details-about-an-attack-on-an-airport-in-western-ukraine; and Christoph Koettl,\nBrenna Smith, and Drew Jordan, “Videos Capture Russian Cruise Missile Attack on Airport in\n\n\n-----\n\nWestern Ukraine, New York Times, March 6, 2022,\nhttps://www.nytimes.com/live/2022/03/06/world/ukraine-russia#russian-cruise-missilevinnytsia-airport.\n\n116 Jane Arraf, “Missiles Hit Power Stations in Lviv and Along Crucial Railways in Central and\n\nWestern Ukraine,” New York Times, May 3, 2022,\n[https://www.nytimes.com/2022/05/03/world/europe/lviv-ukraine-russia-missiles.html; and](https://www.nytimes.com/2022/05/03/world/europe/lviv-ukraine-russia-missiles.html)\n“Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n\n117 Paul Sonne, Isabelle Khurshudyan, Serhiy Morgunov, and Kostiantyn Khudov, “Battle for\n\nKyiv: Ukrainian Valor, Russian Blunders Combined to Save the Capital,” Washington Post,\nAugust 24, 2022, https://www.washingtonpost.com/national-security/interactive/2022/kyivbattle-ukraine-survival/.\n\n118 Clint Watts, “Preparing for a Russian Cyber Offensive Against Ukraine This Winter,”\n\nMicrosoft, December 3, 2022, https://blogs.microsoft.com/on-theissues/2022/12/03/preparing-russian-cyber-offensive-ukraine/.\n\n\n119 “Senior Defense Official Holds a Background Briefing,” U.S. Department of Defense, May\n\n4, 2022, https://www.defense.gov/News/Transcripts/Transcript/Article/3020396/seniordefense-official-holds-a-background-briefing/.\n\n120 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n\n121 Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road From Survival to\n\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n122 Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road From Survival to\n\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n\n123 “Use of Fancy Bear Android Malware in Tracking of Ukrainian Field Artillery Units,”\n\nCrowdStrike, March 23, 2017, https://www.crowdstrike.com/wpcontent/brochures/FancyBearTracksUkrainianArtillery.pdf.\n\n124 Oleksiy Kuzmenko and Pete Cobus, “Cyber Firm Rewrites Part of Disputed Russian\n\nHacking Report,” Voice of America, March 24, 2017, https://www.voanews.com/a/cyber-firmrewrites-part-disputed-russian-hacking-report/3781411.html.\n\n\n125 Drew Harwell, “Instead of Consumer Software, Ukraine’s Tech Workers Build Apps of\n\nWar,” Washington Post, March 24, 2022,\n[https://www washingtonpost com/technology/2022/03/24/ukraine-war-apps-russian-invasion/](https://www.washingtonpost.com/technology/2022/03/24/ukraine-war-apps-russian-invasion/)\n\n\n-----\n\nJack Watling and Nick Reynolds, Ukraine at War: Paving the Road From Survival to\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n127 Jack Watling and Nick Reynolds, “Ukraine at War: Paving the Road From Survival to\n\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n\n128 Nadiya Kostyuk and Erik Gartzke, “Why Cyber Dogs Have Yet to Bark Loudly in Russia’s\n\nInvasion of Ukraine,” Texas National Security Review 5, no. 3 (Summer 2022): 113–126,\n[http://dx.doi.org/10.26153/tsw/42073.](http://dx.doi.org/10.26153/tsw/42073)\n\n129 Kyle Mizokami, “Russia Claims It ‘Hacked’ HIMARS Rocket Launchers. That’s Probably a\n\nBig, Fat Lie,” Popular Mechanics, August 24, 2022,\nhttps://www.popularmechanics.com/military/weapons/a40958633/russia-claims-it-hackedhimars-rocket-launchers/; and Jack Dutton, “Russian Hackers Target U.S. HIMARS Maker in\n‘New Type of Attack’: Report,” Newsweek, August 1, 2022,\nhttps://www.newsweek.com/russian-hackers-target-us-himars-maker-report-ukraine-russia1729502.\n\n\n130 John Hudson, “Ukraine Lures Russian Missiles With Decoys of U.S. Rocket System,”\n\n_Washington Post, August 30, 2022,_\n[https://www.washingtonpost.com/world/2022/08/30/ukraine-russia-himars-decoy-artillery/.](https://www.washingtonpost.com/world/2022/08/30/ukraine-russia-himars-decoy-artillery/)\n\n131 “Read: U.S. Letter to the U.N. Alleging Russia Is Planning Human Rights Abuses in\n\nUkraine,” Washington Post, February 20, 2022,\nhttps://www.washingtonpost.com/context/read-u-s-letter-to-the-u-n-alleging-russia-is[planning-human-rights-abuses-in-ukraine/93a8d6a1-5b44-4ae8-89e5-cd5d328dd150/?](https://www.washingtonpost.com/context/read-u-s-letter-to-the-u-n-alleging-russia-is-planning-human-rights-abuses-in-ukraine/93a8d6a1-5b44-4ae8-89e5-cd5d328dd150/?itid=lk_inline_manual_4)\nitid=lk_inline_manual_4.\n\n\n132 Greg Miller and Catherine Belton, “Russia’s Spies Misread Ukraine and Misled Kremlin\n\nas War Loomed,” Washington Post, August 19, 2022,\n[https://www.washingtonpost.com/world/interactive/2022/russia-fsb-intelligence-ukraine-war/;](https://www.washingtonpost.com/world/interactive/2022/russia-fsb-intelligence-ukraine-war/)\nand Andrew E. Kramer and Valerie Hopkins, “Zelensky Takes Aim at Hidden Enemy:\nUkrainians Aiding Russia,” New York Times, July 18, 2022,\n[https://www.nytimes.com/2022/07/18/world/europe/zelensky-ukraine-russian-spies.html.](https://www.nytimes.com/2022/07/18/world/europe/zelensky-ukraine-russian-spies.html)\n\n133 Frank Bajak, “A Chilling Russian Cyber Aim in Ukraine: Digital Dossiers,” Associated\n\nPress, April 28, 2022, https://apnews.com/article/russia-ukraine-technology-business-borderpatrols-automobiles-fa3f88e07e51bcaf81bac8a40c4da141.\n\n\n134 Eric Geller, “Ukraine Prepares to Remove Data From Russia’s Reach,” Politico, February\n\n22, 2022, https://www.politico.com/news/2022/02/22/ukraine-centralized-its-data-after-thelast-russian-invasion-now-it-may-need-to-evacuate-it-00010777.\n\n\n-----\n\nMansur Mirovalev, What Is Life Like in Russia-occupied Areas of Ukraine?, Al Jazeera,\nJuly 4, 2022, https://www.aljazeera.com/news/2022/7/4/whats-life-like-in-russia-occupiedparts-of-ukraine; Lillian Posner, “A Glimpse at Life Under Russian Occupation,” Foreign\n_Policy, May 11, 2022, https://foreignpolicy.com/2022/05/11/ukraine-russia-war-occupation-_\ndonbas-stanislav-aseyev-prisoner-book-in-isolation/; Nikhil Kumar and Kseniia Lisnycha,\n“Life Under Russia’s Brutal Occupation in Eastern Ukraine: ‘You Can Be Shot at Any\nMoment,’” Grid, June 10, 2022, https://www.grid.news/story/global/2022/06/10/life-underrussias-brutal-occupation-in-eastern-ukraine-you-can-be-shot-at-any-moment/; and Kateryna\nSemchuk, “Roubles and Repression: How Life in Russian-occupied Kherson is Changing,”\nopenDemocracy, April 29, 2022, https://www.opendemocracy.net/en/odr/ukraine-russiakherson-life-is-changing/.\n\n136 “Ukraine: ‘He’s Not Coming Back’: War Crimes in Northwest Areas of Kyiv Oblast,”\n\nAmnesty International, May 6, 2022,\n[https://www.amnesty.org/en/documents/eur50/5561/2022/en/.](https://www.amnesty.org/en/documents/eur50/5561/2022/en/)\n\n\n137 Mansur Mirovalev, “What Is Life Like in Russia-occupied Areas of Ukraine?,” Al Jazeera,\n\nJuly 4, 2022, https://www.aljazeera.com/news/2022/7/4/whats-life-like-in-russia-occupiedparts-of-ukraine.\n\n138 Pjotr Sauer and Andrew Roth, “‘It Was Worse Than Hell’: Life in Mariupol Under Russian\n\nOccupation,” Guardian, June 16, 2022,\nhttps://www.theguardian.com/world/2022/jun/16/ukraine-life-in-mariupol-under-russianoccupation.\n\n\n139 Asami Terajima, “Over 100,000 Mariupol Residents Trapped in Dire Conditions Under\n\nRussian Occupation,” Kyiv Independent, August 12, 2022,\nhttps://kyivindependent.com/national/over-100-000-mariupol-residents-trapped-in-direconditions-under-russian-occupation.\n\n140 Mansur Mirovalev, “What Is Life Like in Russia-occupied Areas of Ukraine?,” Al Jazeera,\n\nJuly 4, 2022, https://www.aljazeera.com/news/2022/7/4/whats-life-like-in-russia-occupiedparts-of-ukraine.\n\n\n141 Lillian Posner, “A Glimpse at Life Under Russian Occupation,” Foreign Policy, May 11,\n\n2022, https://foreignpolicy.com/2022/05/11/ukraine-russia-war-occupation-donbas-stanislavaseyev-prisoner-book-in-isolation/.\n\n142 Adam Satariano and Scott Reinhard, “How Russia Took Over Ukraine’s Internet in\n\nOccupied Territories,” New York Times, August 9, 2022,\nhttps://www.nytimes.com/interactive/2022/08/09/technology/ukraine-internet-russiacensorship.html; and “Russia Reroutes Internet Traffic in Occupied Ukraine to Its\nInfrastructure,” Reuters, May 2, 2022, https://www.reuters.com/world/europe/russia-reroutesinternet-traffic-occupied-ukraine-its-infrastructure-2022-05-02/.\n\n\n-----\n\nJohn Paul Rathbone and Veronika Samborska, Kherson Counter-offensive Cheered by\nUkrainians Enduring Russian Rule, Financial Times, September 2, 2022,\n[https://www.ft.com/content/38415880-239c-415e-bd24-63706307204e.](https://www.ft.com/content/38415880-239c-415e-bd24-63706307204e)\n\n144 “Special Report: Ukraine,” Microsoft, April 27, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\n\n\n145 “Timeline,” CyberPeace Institute, accessed November 13, 2022,\n\n[https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline.](https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline)\n\n146 Tom Simonite, “A Zelensky Deepfake Was Quickly Defeated. The Next One Might Not\n\nBe,” Wired, March 17, 2022, https://www.wired.com/story/zelensky-deepfake-facebooktwitter-playbook/.\n\n\n147 “SSU Exposes Another Bot Farm in Kharkiv (Video),” Security Service of Ukraine, March\n\n31, 2022, https://ssu.gov.ua/en/novyny/sbu-vykryla-novu-vorozhu-botofermu-u-kharkovivideo.\n\n148 Raphael Satter and Dmytro Vlasov, “Ukraine Soldiers Bombarded by ‘Pinpoint\n\nPropaganda’ Texts,” Associated Press, May 11, 2017, https://apnews.com/article/technologyeurope-ukraine-only-on-ap-9a564a5f64e847d1a50938035ea64b8f; and Kenneth R. Rosen,\n“‘Kill Your Commanding Officer’: On the Front Lines of Putin’s Digital War With Ukraine,”\n_Politico, February 15, 2022, https://www.politico.com/news/magazine/2022/02/15/10-days-_\ninside-putins-invisible-war-with-ukraine-00008529.\n\n\n149 John Leicester and David Keyton, “Low Morale Takes Hold of Ukrainian, Russian\n\nTroops,” NPR, June 19, 2022, https://www.pbs.org/newshour/world/low-morale-takes-hold-ofukrainian-russian-troops.\n\n150 John Paul Rathbone, Ben Hall, Roman Olearchyk, and Max Seddon, “Military Briefing:\n\nRussia’s Barrage Hits Ukrainian Morale in the Donbas,” Financial Times, June 10, 2022,\n[https://www.ft.com/content/506dad4d-6f8e-4952-aa11-32b139d326be.](https://www.ft.com/content/506dad4d-6f8e-4952-aa11-32b139d326be)\n\n\n151 Kareem Fahim, “Russia and Ukraine Agree to Release Blockaded Grain Exports,”\n\n_Washington Post, July 22, 2022,_ https://www.washingtonpost.com/world/2022/07/22/ukrainegrain-deal-turkey-russia/.\n\n152 It is also possible that Moscow and Kyiv never come to any formal agreement. In that\n\ncase, the hot war would eventually cool into “frozen conflict” of some kind.\n\n\n153 Raphael Satter, “Ukrainian Officials’ Phones Targeted by Hackers —Cyber Watchdog,”\n\n_Reuters, June 6, 2022,_ https://www.reuters.com/world/europe/ukrainian-officials-phonestargeted-by-hackers-cyber-watchdog-2022-06-06/.\n\n\n-----\n\nKylie Atwood and Zachary Cohen, US in Contact With Zelensky Through Secure\nSatellite Phone,” CNN, March 1, 2022, https://edition.cnn.com/europe/live-news/ukrainerussia-putin-news-03-02-22/h_6b5c8062541ddb6c36dd43ca70391608; and “The Phones of\nUkrainian President Zelensky,” Electrospaces, March 28, 2022,\n[https://www.electrospaces.net/2022/03/the-phones-of-ukrainian-president.html.](https://www.electrospaces.net/2022/03/the-phones-of-ukrainian-president.html)\n\n155 Timothy Bella, “Assassination Plot Against Zelensky Foiled and Unit Sent to Kill Him\n\n‘Destroyed,’ Ukraine Says,” Washington Post, March 2, 2022,\nhttps://www.washingtonpost.com/world/2022/03/02/zelensky-russia-ukraine-assassinationattempt-foiled/.\n\n\n156 Paul Sonne, Isabelle Khurshudyan, Serhiy Morgunov, and Kostiantyn Khudov, “Battle for\n\nKyiv: Ukrainian Valor, Russian Blunders Combined to Save the Capital,” Washington Post,\nAugust 24, 2022, https://www.washingtonpost.com/national-security/interactive/2022/kyivbattle-ukraine-survival/.\n\n157 Sources can be found in the surrounding text.\n\n\n158 “Fireside Chat on Cyber, Crypto, and Quantum With Anne Neuberger,” Aspen Institute,\n\nJuly 20, 2022, [https://www.youtube.com/watch?v=wVtoQ2M8KRw.](https://www.youtube.com/watch?v=wVtoQ2M8KRw)\n\n159 Catherine Stupp, “Russian Cyber Capabilities Have ‘Reached Their Full Potential,’\n\nUkrainian Official Says,” Wall Street Journal, April 27, 2022,\nhttps://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-04-27/card/russian-cyber[capabilities-have-reached-their-full-potential-ukrainian-official-says-](https://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-04-27/card/russian-cyber-capabilities-have-reached-their-full-potential-ukrainian-official-says-QyH0VEv08BLEI9iPmdlM)\nQyH0VEv08BLEI9iPmdlM.\n\n\n160 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK; and “Microsoft Digital](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\nDefense Report 2022,” Microsoft, November 4, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv)\n\n161 Clint Watts, “Preparing for a Russian Cyber Offensive Against Ukraine This Winter,”\n\nMicrosoft, December 3, 2022, https://blogs.microsoft.com/on-theissues/2022/12/03/preparing-russian-cyber-offensive-ukraine/.\n\n\n162 “Timeline,” CyberPeace Institute, accessed November 13, 2022,\n\n[https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline.](https://cyberconflicts.cyberpeaceinstitute.org/threats/timeline)\n\n163 Valentin Weber, “Financial Incentives May Explain the Perceived Lack of Ransomware in\n\nRussia’s Latest Assault on Ukraine,” Council on Foreign Relations, July 26, 2022,\nhttps://www.cfr.org/blog/financial-incentives-may-explain-perceived-lack-ransomwarerussias-latest-assault-ukraine; and James Pearson and Raphael Satter, “Analysis: Russian\n\n\n-----\n\nRansomware Attacks on Ukraine Muted by Leaks, Insurance Woes, Reuters, March 1,\n2022, https://www.reuters.com/technology/russian-ransomware-attacks-ukraine-muted-byleaks-insurance-woes-2022-03-01/.\n\n164 Clint Watts, “Preparing for a Russian Cyber Offensive Against Ukraine This Winter,”\n\nMicrosoft, December 3, 2022, https://blogs.microsoft.com/on-theissues/2022/12/03/preparing-russian-cyber-offensive-ukraine/.\n\n\n165 Sean Lyngaas, “Russian Hackers Behind SolarWinds Breach Continue to Scour US and\n\nEuropean Organizations for Intel, Researchers Say,” CNN, July 19, 2022,\n[https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers.](https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers)\n\n166 “Microsoft Digital Defense Report 2022,” Microsoft, November 4, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv)\n\n\n167 “Viktor Zhora,” Digital Peace Now, June 22, 2022,\n\n[https://digitalpeacenow.org/stillvulnerable-viktor-zhora/; and Brandon Vigliarolo, “Ukraine’s](https://digitalpeacenow.org/stillvulnerable-viktor-zhora/)\nCyber Chief Comes to Black Hat in Surprise Visit,” The Register, August 13, 2022,\n[https://www.theregister.com/2022/08/13/in_brief_security_black_hat/.](https://www.theregister.com/2022/08/13/in_brief_security_black_hat/)\n\n168 “Number of Office 365 Company Users Worldwide as of June 2022, by Leading Country,”\n\nStatista, 2022, https://www.statista.com/statistics/983321/worldwide-office-365-usernumbers-by-country/.\n\n\n169 Alexander Martin, “Fears Grow of Russian Spies Turning to Industrial Espionage,” The\n\nRecord, September 14, 2022, https://therecord.media/fears-grow-of-russian-spies-turning-toindustrial-espionage/.\n\n170 Sean Lyngaas, “Russian Hackers Behind SolarWinds Breach Continue to Scour US and\n\nEuropean Organizations for Intel, Researchers Say,” CNN, July 19, 2022,\n[https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers.](https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers)\n\n\n171 Thomas Brewster, “Ukraine’s Engineers Battle to Keep the Internet Running While\n\nRussian Bombs Fall Around Them,” Forbes, March 22, 2022,\nhttps://www.forbes.com/sites/thomasbrewster/2022/03/22/while-russians-bombs-fall-aroundthem-ukraines-engineers-battle-to-keep-the-internet-running/.\n\n172 Catherine Stupp, “Ukraine Has Begun Moving Sensitive Data Outside Its Borders,” Wall\n\n_Street Journal, June 14, 2022, https://www.wsj.com/articles/ukraine-has-begun-moving-_\nsensitive-data-outside-its-borders-11655199002; and “Defending Ukraine: Early Lessons\nFrom the Cyber War,” Microsoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n\n-----\n\nJack Watling and Nick Reynolds, Ukraine at War: Paving the Road From Survival to\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n174 “Russian Strike on the Kyiv TV Tower,” Forensic Architecture and the Center for Spatial\n\nTechnologies, June 10, 2022, https://forensic-architecture.org/investigation/russian-strike-onkyiv-tv-tower; and Valerie Hopkins, “Missile Strike in Kyiv Rattles Residents After Weeks of\nQuiet,” New York Times, June 26, 2022,\n[https://www.nytimes.com/2022/06/26/world/europe/kyiv-missile-strike-ukraine.html.](https://www.nytimes.com/2022/06/26/world/europe/kyiv-missile-strike-ukraine.html)\n\n\n175 Mansur Mirovalev, “What Is Life Like in Russia-occupied Areas of Ukraine?,” Al Jazeera,\n\nJuly 4, 2022, https://www.aljazeera.com/news/2022/7/4/whats-life-like-in-russia-occupiedparts-of-ukraine; Pjotr Sauer and Andrew Roth, “‘It Was Worse Than Hell’: Life in Mariupol\nUnder Russian Occupation,” Guardian, June 16, 2022,\nhttps://www.theguardian.com/world/2022/jun/16/ukraine-life-in-mariupol-under-russianoccupation; Lillian Posner, “A Glimpse at Life Under Russian Occupation,” Foreign Policy,\nMay 11, 2022, https://foreignpolicy.com/2022/05/11/ukraine-russia-war-occupation-donbasstanislav-aseyev-prisoner-book-in-isolation/; Nikhil Kumar and Kseniia Lisnycha, “Life Under\nRussia’s Brutal Occupation in Eastern Ukraine: ‘You Can Be Shot at Any Moment,’” Grid,\nJune 10, 2022, https://www.grid.news/story/global/2022/06/10/life-under-russias-brutaloccupation-in-eastern-ukraine-you-can-be-shot-at-any-moment/; and Kateryna Semchuk,\n“Roubles and Repression: How Life in Russian-occupied Kherson is Changing,”\nopenDemocracy, April 29, 2022, https://www.opendemocracy.net/en/odr/ukraine-russiakherson-life-is-changing/.\n\n176 “Russia Reroutes Internet Traffic in Occupied Ukraine to Its Infrastructure,” Reuters, May\n\n2, 2022, https://www.reuters.com/world/europe/russia-reroutes-internet-traffic-occupiedukraine-its-infrastructure-2022-05-02/.\n\n\n177 Emile Aben, “The Resilience of the Internet in Ukraine,” RIPE Labs, March 10, 2022,\n\n[https://labs.ripe.net/author/emileaben/the-resilience-of-the-internet-in-ukraine/; and Julian](https://labs.ripe.net/author/emileaben/the-resilience-of-the-internet-in-ukraine/)\nHerbert, “Ukraine IT Sector: Resilient, Agile, and Hopefully Here to Stay,” Everest Group,\nApril 14, 2022, https://www.everestgrp.com/blog/ukraine-it-sector-resilient-agile-andhopefully-here-to-stay-blog.html.\n\n178 Thomas Brewster, “Ukraine’s Engineers Battle to Keep the Internet Running While\n\nRussian Bombs Fall Around Them,” Forbes, March 22, 2022,\nhttps://www.forbes.com/sites/thomasbrewster/2022/03/22/while-russians-bombs-fall-aroundthem-ukraines-engineers-battle-to-keep-the-internet-running/.\n\n\n179 Nadiya Kostyuk and Erik Gartzke, “Why Cyber Dogs Have Yet to Bark Loudly in Russia’s\n\nInvasion of Ukraine,” Texas National Security Review 5, no. 3 (Summer 2022): 113–126,\n[http://dx.doi.org/10.26153/tsw/42073.](http://dx.doi.org/10.26153/tsw/42073)\n\n\n-----\n\nJack Watling and Nick Reynolds, Ukraine at War: Paving the Road From Survival to\nVictory,” Royal United Services Institute, July 4, 2022, https://static.rusi.org/special-report202207-ukraine-final-web.pdf.\n\n181 “U.S. Support for Connectivity and Cybersecurity in Ukraine,” fact sheet, U.S. State\n\nDepartment, May 10, 2022, https://www.state.gov/u-s-support-for-connectivity-andcybersecurity-in-ukraine/.\n\n\n182 Nick Beecroft, “Evaluating the International Support to Ukrainian Cyber Defense,”\n\nCarnegie Endowment for International Peace,” November 3, 2022,\nhttps://carnegieendowment.org/2022/11/03/evaluating-international-support-to-ukrainiancyber-defense-pub-88322.\n\n183 Eric Geller, “Ukraine Prepares to Remove Data From Russia’s Reach,” Politico, February\n\n22, 2022, https://www.politico.com/news/2022/02/22/ukraine-centralized-its-data-after-thelast-russian-invasion-now-it-may-need-to-evacuate-it-00010777.\n\n\n184 Author’s conversation with the company’s CEO, 2022.\n\n185 Joel Schectman and Christopher Bing, “EXCLUSIVE Ukraine Calls on Hacker\n\nUnderground to Defend Against Russia,” Reuters, February 24, 2022,\nhttps://www.reuters.com/world/exclusive-ukraine-calls-hacker-underground-defend-againstrussia-2022-02-24/; Stefan Soesanto, “The IT Army of Ukraine: Structure, Tasking, and\nEcosystem,” ETH Zürich Center for Security Studies, June, 2022,\nhttps://css.ethz.ch/content/dam/ethz/special-interest/gess/cis/center-for-securitiesstudies/pdfs/Cyber-Reports-2022-06-IT-Army-of-Ukraine.pdf; and Lorenzo FranceschiBicchierai, “Inside Ukraine’s Decentralized Cyber Army,” Motherboard, June 19, 2022,\n[https://www.vice.com/en/article/y3pvmm/inside-ukraines-decentralized-cyber-army.](https://www.vice.com/en/article/y3pvmm/inside-ukraines-decentralized-cyber-army)\n\n\n186 Sean Lyngaas, “Russian Hackers Behind SolarWinds Breach Continue to Scour US and\n\nEuropean Organizations for Intel, Researchers Say,” CNN, July 19, 2022,\n[https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers.](https://www.cnn.com/2022/07/19/politics/russia-solarwinds-hackers)\n\n187 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK; “Microsoft Digital](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\nDefense Report 2022,” Microsoft, November 4, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv; “Safeguarding](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv)\nUkraine’s Data to Preserve Its Present and Build Its Future,” Amazon, June 9, 2022,\nhttps://www.aboutamazon.com/news/aws/safeguarding-ukraines-data-to-preserve-itspresent-and-build-its-future; Frank Konkel, “Ukraine Tech Chief: Cloud Migration ‘Saved\nUkrainian Government and Economy,’” Nextgov, December 1, 2022,\nhttps://www.nextgov.com/cxo-briefing/2022/12/ukraine-tech-chief-cloud-migration-savedukrainian-government-and-economy/380328/; Catherine Stupp, “Ukraine Has Begun Moving\nSensitive Data Outside Its Borders,” Wall Street Journal, June 14, 2022,\n\n\n-----\n\nhttps://www.wsj.com/articles/ukraine-has-begun-moving-sensitive-data-outside-its-borders11655199002; and Kenneth R. Rosen, “The Man at the Center of the New Cyber World War,”\n_Politico, July 14, 2022,_ https://www.politico.com/news/magazine/2022/07/14/russiacyberattacks-ukraine-cybersecurity-00045486.\n\n188 Mykhailo Fedorov, Twitter post, July 6, 2022, 3:44 a.m.,\n\n[https://twitter.com/FedorovMykhailo/status/1544588065624178688.](https://twitter.com/FedorovMykhailo/status/1544588065624178688)\n\n\n189 Catherine Stupp, “Ukraine Has Begun Moving Sensitive Data Outside Its Borders,” Wall\n\n_Street Journal, June 14, 2022, https://www.wsj.com/articles/ukraine-has-begun-moving-_\nsensitive-data-outside-its-borders-11655199002; and “Defending Ukraine: Early Lessons\nFrom the Cyber War,” Microsoft, June 22, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\n\n190 “Safeguarding Ukraine’s Data to Preserve Its Present and Build Its Future,” Amazon,\n\nJune 9, 2022, https://www.aboutamazon.com/news/aws/safeguarding-ukraines-data-topreserve-its-present-and-build-its-future; and Catherine Stupp, “Ukraine Has Begun Moving\nSensitive Data Outside Its Borders,” Wall Street Journal, June 14, 2022,\nhttps://www.wsj.com/articles/ukraine-has-begun-moving-sensitive-data-outside-its-borders11655199002.\n\n\n191 “Defending Ukraine: Early Lessons From the Cyber War,” Microsoft, June 22, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK; and “Microsoft Digital](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\nDefense Report 2022,” Microsoft, November 4, 2022,\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv)\n\n192 “Microsoft Digital Defense Report 2022,” Microsoft, November 4, 2022,\n\n[https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv.](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE5bUvv)\n\n\n193 For an overview, see Nick Beecroft, “Evaluating the International Support to Ukrainian\n\nCyber Defense,” Carnegie Endowment for International Peace,” November 3, 2022,\nhttps://carnegieendowment.org/2022/11/03/evaluating-international-support-to-ukrainiancyber-defense-pub-88322.\n\n194 Kenneth R. Rosen, “The Man at the Center of the New Cyber World War,” Politico, July\n\n14, 2022, https://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486.\n\n\n195 Christopher Miller, Mark Scott, and Bryan Bender, “UkraineX: How Elon Musk’s Space\n\nSatellites Changed the War on the Ground,” Politico, June 9, 2022,\n[https://www.politico.com/news/2022/06/09/elon-musk-spacex-starlink-ukraine-00038039.](https://www.politico.com/news/2022/06/09/elon-musk-spacex-starlink-ukraine-00038039)\n\n\n-----\n\nElizabeth Howell, Elon Musk Says Russia Is Ramping up Cyberattacks on SpaceX s\nStarlink Systems in Ukraine,” Space.com, October 14, 2022, https://www.space.com/starlinkrussian-cyberattacks-ramp-up-efforts-elon-musk.\n\n197 Thomas Brewster, “Ukraine’s Engineers Battle to Keep the Internet Running While\n\nRussian Bombs Fall Around Them,” Forbes, March 22, 2022,\nhttps://www.forbes.com/sites/thomasbrewster/2022/03/22/while-russians-bombs-fall-aroundthem-ukraines-engineers-battle-to-keep-the-internet-running/; Kenneth R. Rosen, “The Man\nat the Center of the New Cyber World War,” Politico, July 14, 2022,\nhttps://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486; and Jackie Wattles, “SpaceX Sent Starlink Internet Terminals to\nUkraine. They Could Paint a ‘Giant Target’ on Users’ Backs, Experts Say,” CNN, March 4,\n2022, https://edition.cnn.com/2022/03/03/tech/spacex-starlink-ukraine-internet-security-risksscn/index.html.\n\n\n198 Suzanne Smalley, “Mixed Results for Russia’s Aggressive Ukraine Information War,\n\nExperts Say,” CyberScoop, June 16, 2022, https://www.cyberscoop.com/russia-informationwar-ukraine-cyber-command-sorm/.\n\n199 Mehul Srivastava, Roman Olearchyk, Felicia Schwartz, and Christopher Miller, “Ukrainian\n\nForces Report Starlink Outages During Push Against Russia,” Financial Times, October 7,\n[2022, https://www.ft.com/content/9a7b922b-2435-4ac7-acdb-0ec9a6dc8397.](https://www.ft.com/content/9a7b922b-2435-4ac7-acdb-0ec9a6dc8397)\n\n\n200 Inga Kristina Trauthig, “Chat and Encrypted Messaging Apps Are the New Battlefields in\n\nthe Propaganda War,” Lawfare, March 27, 2022, https://www.lawfareblog.com/chat-andencrypted-messaging-apps-are-new-battlefields-propaganda-war.\n\n201 Kenneth R. Rosen, “The Man at the Center of the New Cyber World War,” Politico, July\n\n14, 2022, https://www.politico.com/news/magazine/2022/07/14/russia-cyberattacks-ukrainecybersecurity-00045486.\n\n\n202 “CYBER101—Cyber Mission Force,” press release, U.S. Cyber Command, November 1,\n\n[2022, https://www.cybercom.mil/Media/News/Article/3206393/cyber101-cyber-mission-force/;](https://www.cybercom.mil/Media/News/Article/3206393/cyber101-cyber-mission-force/)\n“Quadrennial Defense Review 2014,” U.S. Department of Defense, March 2014,\n[https://www.acq.osd.mil/ncbdp/docs/2014_Quadrennial_Defense_Review.pdf; and Martin](https://www.acq.osd.mil/ncbdp/docs/2014_Quadrennial_Defense_Review.pdf)\nMatishak and Lara Seligman, “Biden Budget to Seek Boost to the Military’s Cyber Force,”\n_Politico, May 25, 2021,_ https://www.politico.com/news/2021/05/26/biden-budget-militarycyber-force-490965.\n\n203 “Defense Budget Overview: United States Department of Defense Fiscal Year 2023\n\nBudget Request,” U.S. Office of the Under Secretary of Defense (Comptroller)/Chief\nFinancial Officer, April 2022,\nhttps://comptroller.defense.gov/Portals/45/Documents/defbudget/FY2023/FY2023_Budget_R\nequest Overview Book.pdf; and Mark Pomerleau, “Air Force Would Contribute Bulk of New\n\n\n-----\n\nCyber Mission Force Teams, Air Force Times, June 14, 2021,\nhttps://www.airforcetimes.com/cyber/2021/06/14/air-force-would-contribute-bulk-of-newcyber-mission-force-teams/.\n\n204United States Special Operations Command and United States Cyber Command: A\n\n_Hearing Before the Senate Armed Services Committee, 117th Cong. (2021) (testimony of_\nGeneral Paul M. Nakasone, March 25, 2021), https://www.armedservices.senate.gov/imo/media/doc/Nakasone_03-25-21.pdf.\n\n\n205USCYBERCOM 2018 Cyberspace Strategy Symposium Proceedings, U.S. Cyber\n\nCommand, July 11, 2018,\nhttps://www.cybercom.mil/Portals/56/Documents/USCYBERCOM%20Cyberspace%20Strate\ngy%20Symposium%20Proceedings%202018.pdf?ver=2018-07-11-092344-427; and Sue\nGordon and Eric Rosenbach, “America’s Cyber-Reckoning: How to Fix a Failing Strategy,”\n_Foreign Affairs, January/February 2022, https://www.foreignaffairs.com/articles/united-_\nstates/2021-12-14/americas-cyber-reckoning. For more on cyber force regeneration and the\n“burning” of cyber tools, see JD Work, “Rapid Capabilities Generation and Prompt Effects in\nOffensive Cyber Operations,” (paper presented at the Annual Conference of the International\n[Studies Association, Las Vegas, April 2021), https://osf.io/preprints/socarxiv/esx6m; and JD](https://osf.io/preprints/socarxiv/esx6m)\nWork, “Burned and Blinded: Escalation Risks of Intelligence Loss From Countercyber\nOperations in Crisis,” International Journal of Intelligence and CounterIntelligence 35, no. 4\n[(2022): https://www.tandfonline.com/doi/abs/10.1080/08850607.2022.2081904.](https://www.tandfonline.com/doi/abs/10.1080/08850607.2022.2081904)\n\n206 Max Smeets, No Shortcuts: Why States Struggle to Develop a Military Cyber-Force\n\n(United Kingdom: Oxford University Press, 2022).\n\n\n207 “Achieve and Maintain Cyberspace Superiority: Command Vision for US Cyber\n\nCommand,” U.S. Cyber Command, April 2018,\nhttps://www.cybercom.mil/Portals/56/Documents/USCYBERCOM%20Vision%20April%2020\n18.pdf.\n\n208 “Weapons Systems Cybersecurity: Guidance Would Help DOD Programs Better\n\nCommunicate Requirements to Contractors,” U.S. Government Accountability Office, March\n4, 2021, [https://www.gao.gov/assets/gao-21-179.pdf; and “Weapon Systems Cybersecurity:](https://www.gao.gov/assets/gao-21-179.pdf)\nDOD Just Beginning to Grapple With Scale of Vulnerabilities,” U.S. Government\nAccountability Office, October 9, 2018, [https://www.gao.gov/assets/gao-19-128.pdf.](https://www.gao.gov/assets/gao-19-128.pdf)\n\n\n209 Meredith Roaten, “JUST IN: Mumbai Incident Spotlights China’s Cyber Capabilities,”\n\n_National Defense, March 3, 2021,_\nhttps://www.nationaldefensemagazine.org/articles/2021/3/3/mumbai-incident-spotlightschinas-cyber-capabilities.\n\n\n-----\n\nNick Beecroft, Evaluating the International Support to Ukrainian Cyber Defense,\nCarnegie Endowment for International Peace, November 3, 2022,\nhttps://carnegieendowment.org/2022/11/03/evaluating-international-support-to-ukrainiancyber-defense-pub-88322.\n\n211 Ash Carter, “A Lasting Defeat: The Campaign to Destroy ISIS,” Belfer Center for Science\n\nand International Affairs, Harvard Kennedy School, October 2017,\n[https://www.belfercenter.org/publication/lasting-defeat-campaign-destroy-isis.](https://www.belfercenter.org/publication/lasting-defeat-campaign-destroy-isis)\n\n\n212 Michael P. Kreuzer, “Cyberspace is an Analogy, Not a Domain: Rethinking Domains and\n\nLayers of Warfare for the Information Age,” The Strategy Bridge, July 8, 2021,\nhttps://thestrategybridge.org/the-bridge/2021/7/8/cyberspace-is-an-analogy-not-a-domainrethinking-domains-and-layers-of-warfare-for-the-information-age.\n\nCarnegie does not take institutional positions on public policy issues; the views represented\nherein are those of the author(s) and do not necessarily reflect the views of Carnegie, its\nstaff, or its trustees.\n\n© 2022 Carnegie Endowment for International Peace. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-16 - Russia’s Wartime Cyber Operations in Ukraine- Military Impacts, Influences, and Implications.pdf"
    ],
    "report_names": [
        "2022-12-16 - Russia’s Wartime Cyber Operations in Ukraine- Military Impacts, Influences, and Implications.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0bce7575-ba34-4742-afb7-a4d3ade12dbe",
            "created_at": "2023-11-14T02:00:07.091122Z",
            "updated_at": "2025-03-27T02:00:03.221412Z",
            "deleted_at": null,
            "main_name": "XakNet",
            "aliases": [
                "UAC-0100",
                "UAC-0106"
            ],
            "source_name": "MISPGALAXY:XakNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535818,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1672273903,
    "ts_modification_date": 1672273903,
    "files": {
        "pdf": "https://archive.orkl.eu/f87c5ef286823a81dac3b4fd9e384d36d2f8e34a.pdf",
        "text": "https://archive.orkl.eu/f87c5ef286823a81dac3b4fd9e384d36d2f8e34a.txt",
        "img": "https://archive.orkl.eu/f87c5ef286823a81dac3b4fd9e384d36d2f8e34a.jpg"
    }
}