{
    "id": "5765eef7-76f8-45d3-8ad4-7d90d68b76a6",
    "created_at": "2023-01-12T15:09:53.789086Z",
    "updated_at": "2025-03-27T02:05:38.635467Z",
    "deleted_at": null,
    "sha1_hash": "713f79550bf173ed049e485a336148513d22f1ff",
    "title": "2022-01-25 - Windows services lay the groundwork for a Midas ransomware attack",
    "authors": "",
    "file_creation_date": "2022-05-27T21:54:30Z",
    "file_modification_date": "2022-05-27T21:54:30Z",
    "file_size": 438163,
    "plain_text": "# Windows services lay the groundwork for a Midas ransomware attack\n\n**[news.sophos.com/en-us/2022/01/25/windows-services-lay-the-groundwork-for-a-midas-ransomware-attack/](https://news.sophos.com/en-us/2022/01/25/windows-services-lay-the-groundwork-for-a-midas-ransomware-attack/?cmp=30728)**\n\nAndrew Brandt January 25, 2022\n\n_UPDATE: 2022-01-28: We modified a few lines in the story to clarify how ZTNA_\n_configurations could have permitted the network operator to exercise greater control over_\n_devices on their network._\n\nAn attack on a technology vendor in December, 2021 – using ransomware known as Midas –\nleveraged at least two different commercial remote access tools and an open-source\nWindows utility in the process.\n\nAfter the Sophos Rapid Response team was called in to help with analysis, we discovered\nindicators that the attackers had been active on the network for at least two months prior to\nthe appearance of the ransomware on a domain controller and other computers on the\nnetwork.\n\nThe target uses Citrix to virtualize all employee desktops, but the organization’s network\ntopology was flat, with the entire network accessible behind its VPN. Windows Servers, run\nas virtual machine hypervisors, comprised most of the target’s physical devices. Flat\nnetworks with no segmentation are a risk factor in ransomware attacks. Had a zero-trust\nnetwork access (ZTNA) setup existed, it could have helped limit the attackers’ ability to\nlaterally move and connect to resources once they obtained a foothold on a user’s computer.\n\n\n-----\n\nAn example of the heavily obfuscated PowerShell scripts the attackers ran on several\nmachines over the course of many weeks. The scripts use layers of obfuscation that selfexpand when executed.\nThe attack involved repeated iterations of the threat actors creating Windows services\ndesigned to execute, on one machine at a time, several PowerShell scripts the attackers had\nplaced on a few of the other compromised servers, which any other machine — VM or server\n— could just browse to over SMB. In a ZTNA configuration, properly configured access\ncontrols might have prevented the attackers from being able to leverage one compromised\nmachine against another, disallowing user VMs from compromising other resources.\n\nThe target of the attack, who had been using another company’s endpoint security to protect\ntheir servers, never saw an alert that the attackers had entered the network. They executed\ncommands, launched internal RDP connections, took advantage of already-installed\ncommercial remote access software, exfiltrated data to the cloud, and moved files to and\nfrom one of the target’s domain controllers over a two month period, culminating in a\ndeployment of the ransomware at the beginning of December, 2021.\n\n\n-----\n\nBecause there was a lack of log data, it remains unknown how the attackers initially\naccessed the domain controller, or how they had compromised and taken control over the\nAdministrator account on that machine. But once they had, the attackers leveraged the\npermissions from that account — and the openness of the network topology — to spread\nbackdoors and, later, ransomware to machines across the network.\n\n## Working the refs\n\nWhile Midas is not as common a threat as some of the other ransomware families we more\nfrequently encounter, the attackers seemed to follow a familiar playbook throughout the\nincident. They leveraged conventional Windows management tools and processes (such as\n[PowerShell and the Deployment Image Servicing and Management tool), and commercial](https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/dism---deployment-image-servicing-and-management-technical-reference-for-windows?view=windows-11)\nremote access tools (AnyDesk and TeamViewer) that would be less likely to trigger an antimalware alert, using those tools to move laterally within the network and to exfiltrate files off\nthe company’s network.\n\nIn this incident, the target’s IT staff had previously tested both AnyDesk and TeamViewer, as\nwell as several other remote access tools, and were no longer using them. Unfortunately,\nthey were still installed on some of the servers, which the attackers leveraged for their own\nbenefit.\n\n[In some cases, the attackers deployed and used the open-source tool Process Hacker to](https://processhacker.sourceforge.io/)\nidentify and terminate the endpoint security products that the target was using to protect its\nsystems.\n\nThe Midas ransom note\n\n\n-----\n\nThe earliest indicator of compromise took place on October 13, when logs on one of the\ncompromised domain controllers indicate that a Remote Desktop Protocol (RDP) connection\ntook place between a machine on the internal network of the targeted organization and the\ndomain controller. The RDP connection was a successful login by the Administrator account,\nfrom two different machines. It’s unknown how, prior to this point, the attackers gained\naccess to the two internal machines they used to RDP into the domain controller.\n\nThe early phase of the attack took place between October 13 and November 2, after which\nthere was no activity until three weeks later, on November 22. While it’s unusual in recent\nransomware incidents to see that amount of dwell time by attackers on networks, they still\ncan and do happen.\n\nThe attackers’ use of Process Hacker was only partially successful, as some of the machines\nbegan to detect and block the use of the Mimikatz credential harvesting tool on one of the\ncompany’s servers on Thanksgiving Day, November 25th. However, the investigation\ndiscovered that the attackers appear to have been successful running Mimikatz on a different\nserver one day prior. A forensic analysis of the compromised server revealed a file called\nPasswords.txt that contained some of the harvested credentials.\n\n## Orchestration through PowerShell\n\nThe attackers heavily relied on customized PowerShell scripts, in some cases installing them\nas Windows Services to execute them. They also orchestrated parts of the attack using\nVisual Basic Script and Batch files, executed using the DISM.exe utility that, under normal\n[circumstances, is used to repair Windows installations that have become corrupted or](https://www.windowscentral.com/how-use-dism-command-line-utility-repair-windows-10-image)\nbroken.\n\nDuring the first week the attackers were connected to the network, they clearly already had\ngained access to a number of internal machines within the target’s organization. They were\nuploading various PowerShell scripts into the TEMP directory of some of the machines they\ncontrolled, then created Windows services on other machines they could access that would\ncall those scripts from over the network and execute the scripts hosted on those other\nmachines.\n\n\n-----\n\nRepeated commands executed on several machines over the course of an hour set up\nservices that, when started, sideloaded the malicious DismCore.dll\nWhile many of the PowerShell scripts used randomized filenames, a few of the filenames\ngave hints as to their purpose, such as “dism_els.ps1” which the attackers executed on the\nserver where the DISM tool was then used to install a backdoor. Twenty minutes later, the\nsame command was executed on a second server. Another script, “adtest.ps1” may have\nbeen used to verify whether they had domain administrator privileges on the server.\n\nThe attackers used oddly complex combinations of scripts to accomplish a single task. For\ninstance, a PowerShell script would execute a Batch file, that in turn would launch a\nPowerShell script, that would run a command to invoke a DLL sideloading tool to inject a\nsystem process with the malicious DismCore dll payload We saw several instances of Visual\n\n\n-----\n\nBasic Script launch PowerShell, which then launched a batch script that invoked DISM to\nload DismCore.dll. The files involved had names of four, eight, or twelve random\nalphanumeric characters in length. Some of the PowerShell scripts used the file suffix .log\ninstead of the default .ps1. A few used no file suffix at all.\n\nThe attackers were methodical, iterating through the same process repeatedly on different\nmachines between October 13 and 19, leaving a number of servers backdoored on the\ntarget’s network. But then the attackers suddenly stopped connecting and taking actions on\nthe 19th, and resumed on November 2nd.\n\nOn November 2nd, the attackers logged on and iterated through the servicecreation/PowerShell execution process on two more desktop machines, with an indication\nthat the attackers had used AnyDesk 13 separate times on one of the servers we found had\nbeen compromised during the earliest phase of the attack. After this behavior was observed,\nthere was no more activity for three more weeks.\n\n## No Thanksgiving\n\nAfter a lull in activity, the attackers resumed their work on November 22, installing services\nand using those service to execute PowerShell scripts running on other internal machines\nthat had previously been compromised.\n\nThe attackers only ran a single PowerShell script one time on the 22nd, then a day later\ninstalled more services on three other machines and used those services to execute\nPowerShell scripts.\n\nThe “Services” the attackers installed simply consisted of small PowerShell scripts that would\nexecute other scripts. Some PowerShell scripts used the normal .ps1 suffix while others used\na file suffix of .log – which PowerShell executed anyway.\nOn November 25th, logs indicated that one of the compromised domain controllers wrote out\na file named Passwords.txt under the path C:\\Compaq\\!logs\\ on its local storage, but it wasn’t\nuntil after midnight that night that the target’s antivirus software detected Mimikatz running on\na different server. A number of other internal RDP connections were made between the 25th\nand 29th, and then the trail went cold as the attackers laid low.\n\n## The final phase\n\n\n-----\n\nMore than a week later, late at night of December 7 in the target s time zone, the attackers\nbegan deploying the ransomware binary to machines on the target’s network. The file was\ndropped on the path C:\\hp\\ and its filename included the name of the target organization.\nThe same directory was where whoever was deploying the ransomware also saved a copy of\nProcess Hacker.\n\nThe attackers then ran Process Hacker under a service they created called\nKProcessHacker3, and presumably used it to terminate the antivirus software that had\nthwarted the execution of Mimikatz several weeks earlier.\n\n\n-----\n\nWe also recovered PowerShell scripting commands that the attackers used in an attempt to\nshut down 46 processes, and 216 services, by name. These included services like MSSQL,\nvarious backup tools, office applications, and services tied to security software from McAfee,\n\n\n-----\n\nKaspersky, Trend Micro, and Sophos, among others. The script that terminated services and\nprocesses had several redundant listings, which indicates the attackers were adding entries\nin the lists by hand, and not checking for duplicates.\n\nA\n\nsubset of the list of services shows all the attempts the attackers made to disable Sophos,\nwhich were thwarted by tamper protection features.\nA few minutes later, the attackers moved copies of two ransomware binaries, named\n<target>local.exe and <target>share.exe (with the target organization’s name in the\nfilename, redacted here) to an internal server and executed it.\n\nThey then iterated through this same process on several other servers on the network:\nInstalling a Windows service that was used to execute Process Hacker, then a few minutes\nlater copying and executing the two ransomware binaries. The attackers took their time, only\ndoing this about once an hour for the next several hours.\n\nLater that day, December 8, the target engaged with the Rapid Response team after they\ndiscovered ransom notes (and that servers weren’t doing what they were supposed to be\ndoing).\n\n\n-----\n\nFortunately for the target, the damage was limited only to a small number of servers. With\nthe Rapid Response engagement, analysts installed Sophos endpoint tools onto machines\nacross the organization, which then detected and blocked the attackers subsequent use of\nDISM and Process Hacker, and the attempted deployment of additional ransomware\nexecutables to other machines on the network.\n\n## The takeaway\n\nThe attackers involved in this Midas ransomware attack relied heavily on a process in which\nthey installed new Windows services that were used to execute PowerShell scripts. These\nservices had quite obvious-to-the-human-eye names that were just random jumbles of letters\nand numbers, but the target was not monitoring computers on its network for the creation of\nthese services, or lateral movement of any kind between the servers.\n\nThe attackers also relied heavily on both RDP and third party remote access tools that the\ncompany did not typically use in the course of its business. We counted at least 14 different\nopen-source or commercial remote access tools that had been previously installed and left in\nplace on the compromised machines. Needless to say, this provided a wealth of\nopportunities for misuse. One of these may have been the attackers’ source of initial access\nto an internal computer. The bottom line advice is this: if you install remote-control tools, and\nyou’re not actively using them, the right move is to uninstall them completely from the\nmachine.\n\nMonitoring for unusual activity by non-malicious programs or Windows management tools\nshould be de rigeur for IT security teams, as it’s very difficult for an endpoint security product\nto recognize the difference between a benign or malicious use of a legitimate tool.\nApplication allow-listing can further restrict the ability of a threat actor to use their preferred\ntoolset.\n\nThis standard advice we’ve given for years rings true in this case, as well: The attackers\nwould have had a much harder time if the target had used multi-factor authentication on their\ninternal services and machines, and a network that was segmented into discrete areas with\nlimited access between them. But the effort and planning will be worth it if you break a\nhacker’s heart by ruining their attack.\n\n## Detections and guidance\n\nSophos will detect some malicious use of DISM as a DynamicShellcode exploit, while not\ntriggering a false-positive detection on the benign file, itself. The Process Hacker utility is\ndetected as a potentially unwanted app (PUA) and the Midas ransomware binaries were\ndetected as Troj/Ransom-GLY. Other components of the attack may be detected as\n**Troj/PSInj-BI (PowerShell scripts), Troj/MSIL-SDB (the malicious dismcore.dll), Harmony**\n**Loader (PUA), or ATK/sRDI-A (the sRDI DLL sideloading tool).**\n\n\n-----\n\nSophosLabs has published a partial list of Indicators of Compromise relating to this attack to\nthe SophosLabs Github, and redacted certain details from this report and screenshots, to\nprotect the identity of the targeted organization.\n\nSophosLabs wishes to acknowledge the assistance of Jason Jenkins of the Rapid Response\nteam for his work on the post-attack analysis.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-25 - Windows services lay the groundwork for a Midas ransomware attack.pdf"
    ],
    "report_names": [
        "2022-01-25 - Windows services lay the groundwork for a Midas ransomware attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536193,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653688470,
    "ts_modification_date": 1653688470,
    "files": {
        "pdf": "https://archive.orkl.eu/713f79550bf173ed049e485a336148513d22f1ff.pdf",
        "text": "https://archive.orkl.eu/713f79550bf173ed049e485a336148513d22f1ff.txt",
        "img": "https://archive.orkl.eu/713f79550bf173ed049e485a336148513d22f1ff.jpg"
    }
}