{
    "id": "57aea298-73f3-470b-8d3c-dbc134e4e306",
    "created_at": "2023-01-12T15:01:03.347664Z",
    "updated_at": "2025-03-27T02:16:42.998338Z",
    "deleted_at": null,
    "sha1_hash": "d2471ec299fa70084d017b66fd66d088915c5c7c",
    "title": "2015-02-27 - The Anthem Hack- All Roads Lead to China",
    "authors": "",
    "file_creation_date": "2022-05-28T21:51:44Z",
    "file_modification_date": "2022-05-28T21:51:44Z",
    "file_size": 3001815,
    "plain_text": "# The Anthem Hack: All Roads Lead to China\n\n**[threatconnect.com/blog/the-anthem-hack-all-roads-lead-to-china/](https://threatconnect.com/blog/the-anthem-hack-all-roads-lead-to-china/)**\n\nFebruary 27, 2015\n\nWhen news of the Anthem breach was reported on February 4th, 2015, the security industry\nquite understandably went wild. A breach of this magnitude was certainly unprecedented.\nNaturally, many industry professionals were keenly interested in digging into this incident to\nsee what could be uncovered, and the research team at ThreatConnect was no exception.\nThanks to our [powerful API and third-party](https://threatconnect.com/product/threatconnect_API) [partner integrations, we were able to use](https://threatconnect.com/partners)\nThreatConnect to quickly uncover a wealth of intelligence even when initially hindered by a\nrelative lack of investigative lead information and context, a key requirement of any Threat\nIntelligence Platform (TIP). However, before we delve into what we were able to uncover,\nlet’s briefly review the facts as they stood in the wake of the initial discovery announcement.\n\n## What We Know:                                             \n\n[On the morning of February 4th, 2015, several major news outlets broke the story that](http://www.wsj.com/articles/health-insurer-anthem-hit-by-hackers-1423103720)\nAnthem, Inc.’s network defenses had been breached. According to a statement from\nAnthem’s CEO, the company fell victim to a “very sophisticated external cyber attack,”\nand the hackers “obtained” the personally identifiable information (PII) of approximately\n80M customers. This included social security numbers, birthdays, street addresses,\nphone numbers and income data – plenty of information to enable identity theft. This\nwas a significant event for several reasons:\n\nAnthem, formerly known as Wellpoint, is the largest managed healthcare company in\nthe Blue Cross Blue Shield Association, and by extension, one of the largest healthcare\norganizations in the United States. As such, any compromise, no matter how\ninsignificant, would likely impact countless individuals.\nBlue Cross Blue Shield provides healthcare coverage for about half the U.S. federal\nworkforce. This means that their information was potentially compromised too.\nUnlike the Sony hack which was destructive in nature and meant to send a message\nfor coercive purposes, the Anthem compromise was purportedly very covert, a fact\nwhich may suggest something about the adversary’s motives.\nAs of late February 2015, there have not been any indications that the exfiltrated PII\ndata was immediately commoditized on the black market for the purpose of enabling\nidentity theft, as was the case in the Home Depot Breach.\n\n## Filling the Gaps:\n\n\n-----\n\nObviously, these high-level observations do not provide cybersecurity researchers a great\ndeal of information to work with. However, when presented within the context of a Threat\nIntelligence Platform (TIP), an incomplete trail of evidence can highlight intelligence gaps, a\nstudy of which can orient threat researchers towards their analytic objectives. To this end,\nlet’s examine what we wanted to discover in the context of the Anthem breach:\n\nWho was responsible for the attack?\nWhat was the objective of the attack? Was it cyber theft, an espionage operation, or\nsomething different?\nWho was targeted in the attack? The answer to this question, obscured as it may be,\nwould likely shed some light on the objective of the breach.\nWhat was the timeline of the activity?\n\nThe real power of a Threat Intelligence Platform is demonstrated when you are able to\ncollect and maintain a robust dataset of threat indicators, both past and present, which can\nhelp orient you in the right direction in the wake of a newly discovered breach. Even when\nyou do not have a good deal of information to start with (for example a file hash, or an IP\naddress), you may find leads by pivoting through archived datasets until you uncover key\npieces of the puzzle. In the case of the Anthem breach, we were able to do just that.\n\n## Anthem Themed Infrastructure & Signed Malware:\n\n[In September 2014, the ThreatConnect Research Team observed a variant of the Derusbi](https://threatconnect.com/why_threat_connect/threatconnect_intelligence_research_team)\nAPT malware family, MD5: [0A9545F9FC7A6D8596CF07A59F400FD3, which was signed by](https://www.virustotal.com/en/file/77421106548e69e9666c538ad628918cad7cfcf8f6aa7825f71a4fc39e522a7d/analysis/)\na valid digital signature from the Korean company DTOPTOOLZ Co. Derusbi is a family of\nmalware used by multiple actor groups but associated exclusively with Chinese APT.\nThreatConnect Research began tracking the DTOPTOOLZ signature for additional signed\nmalware samples and memorialized them within our Threat Intelligence Platform over time.\n\n_Analyst Comment: The DTOPTOOLZ signature has also been observed in association with_\n_Korean Adware that is affiliated with the actual DTOPTOOLZ Co. This adware should not be_\n_confused with the APT malware that is abusing the same digital signature._\n\nLater, in mid-November we discovered another implant that was digitally signed with the\n[DTOPTOOLZ signature. This implant, MD5: 98721c78dfbf8a45d152a888c804427c, was](https://www.virustotal.com/en/file/8d168092d5601ebbaed24ec3caeef7454c48cf21366cd76560755eb33aff89e9/analysis/)\nfrom the “Sakula” (aka. Sakurel) family of malware, a known variant of the Derusbi backdoor,\nand was configured to communicate with the malicious command and control (C2) domains\nextcitrix.we11point[.]com and www.we11point[.]com. Through our Farsight Security passive\nDNS integration, we uncovered that this malicious infrastructure was likely named in such a\nway to impersonate the legitimate Wellpoint IT infrastructure.\n\nPassive DNS and historic DomainTools Whois data also provided insights that helped\nestablish an initial timeline dating back to April 2014, when the faux domains came into\nexistence and were later operationalized by the attackers. A Threat Intelligence Platform\n\n\n-----\n\nshould allow for analysts to easily put together and organize such insights, collaborate\naround relevant analysis internally, and share the finished analysis with external industry\ngroups and organizations. In the hopes that our community members could benefit from or\nprovide further insight into this suspicious incident, we immediately shared our threat\nintelligence including indicators, signatures and analytical context to the ThreatConnect\nMedical and Health Community on November 13, 2014. This included sending out a\n[notification to all stakeholders as well as our followers on Twitter.](https://twitter.com/threatconnect)\n\nWhen the Anthem breach later came to light in early February, we re-shared the signatures,\nindicators and context freely to the entire ThreatConnect user base. As we dug further, we\nexpanded our understanding of the malicious we11point[.]com infrastructure, taking\nparticular interest to the subdomains such as “extcitrix.we11point[.]com and\n“hrsolutions.we11point[.]com”. Note the “citrix” and “hr” (human resources) prefixes that the\nadversary used to mirror legitimate remote infrastructure and employee benefits resources in\nthe May 2014 timeframe. This provided initial insights as to the likely targeting themes and or\nvectors in which the adversary may have used when initiating their targeting campaign.\n\nThe fact that the malicious infrastructure closely mirrored other legitimate Wellpoint\ninfrastructure supported our hypothesis that the Derusbi / Sakula malware was configured to\noperate and persist within a specific target enterprise.\n\n## Possible Premera Blue Cross Infrastructure:\n\nRetrospective analysis of other targeted malware samples using the DTOPTOOLZ Co. digital\nsignature led to the identification of an “HttpBrowser” / “HttpDump” implant MD5:\n[02FAB24461956458D70AEED1A028EB9C (OpenOfficePlugin.exe), which was first](https://www.virustotal.com/en/file/3fe208273288fc4d8db1bf20078d550e321d9bc5b9ab80c93d79d2cb05cbf8c2/analysis/)\nobserved on December 11, 2013. Although this malware sample is not Derusbi / Sakula, it\ntoo is strongly believed to be associated with Chinese APT activity and in fact may have also\nbeen involved in a Blue Cross Blue Shield targeting campaign as early as December 2013.\n\n\n-----\n\nThis particular binary is configured to connect to the static IP address 142.91.76[.]134.\nPassive DNS of this IP indicates that on December 11th, 2013, the same date as the\nmalware sample was observed, the domain prennera[.]com also resolved to 142.91.76[.]134.\nIt is believed that the prennera[.]com domain may have been impersonating the Healthcare\n[provider Premera Blue Cross, where the attackers used the same character replacement](http://www.premera.com/)\ntechnique by replacing the “m” with two “n” characters within the faux domain, the same\ntechnique that would be seen five months later with the we11point[.]com command and\ncontrol infrastructure.\n\n### Section Summary:\n\nThe Derusbi / Sakula malware implant types are unique in that they have traditionally\nbeen seen within Chinese APT espionage campaigns.\nThe “HttpBrowser” / “HttpDump” malware implant (while a different family of malware\nthan Derusbi / Sakula) is also believed to be of Chinese origin, and was also digitally\nsigned with the DTOPTOOLZ digitalsignature. This implant connected to a C2 node\nthat overlapped with prennera[.]com.\n\n\n-----\n\nWe believe that the prennera[.]com domain may be impersonating Premera Blue Cross\n(premera.com), using a similar character replacement technique seen in the\nwe11point[.]com campaign.\n\n### MATURING A THREAT INTELLIGENCE PROGRAM\n\n## VAE Inc. Themed Infrastructure & Signed Malware\n\nAnother powerful attribute of ThreatConnect is the ability for analysts to logically group items\nsuch as atomic indicators, related documents or signatures, all of which may include\nindividualized custom context enrichments and associations. Over time, the ability to\nmemorialize groupings of related or like activity allows analysts to quickly uncover nonobvious relationships within their private datasets. This is exactly what happened as we\ncontinued to investigate these incidents.\n\n[As industry analysts and media speculated Chinese APT involvement in the Anthem breach,](http://www.washingtonpost.com/business/economy/investigators-suspect-china-may-be-responsible-for-hack-of-anthem/2015/02/05/25fbb36e-ad56-11e4-9c91-e9d2f9fde644_story.html)\nour focus into the Derusbi / Sakula malware signed with the DTOPTOOLZ Co. digital\nsignature shifted from the we11point[.]com incident to another cluster of activity that occurred\n[later in May 2014. We immediately reviewed Incident 20140526B: vaeit APT, an incident that](https://app.threatconnect.com/tc/auth/incident/incident.xhtml?incident=708926)\nwe initially shared to our Subscriber Community on September 29, 2014 after conducting\nretrospective analysis.\n\n\n-----\n\nJust as was the case with the we11point[.]com and prennera[.]com incidents, the VAE, Inc.\nincident is also believed to be associated with Chinese APT espionage activity. In this case\nthe adversary also used Derusbi / Sakula malware that was signed with the DTOPTOOLZ\nCo. digital signature and configured to communicate with faux infrastructure appearing to be\nmasquerading as internal resources for the Department of Defense Contractor VAE, Inc.\nAdditionally, in response to an inquiry from KrebsOnSecurity, VAE, Inc. would later [confirm](http://krebsonsecurity.com/2015/02/anthem-breach-may-have-started-in-april-2014/)\nthat it had indeed been a target of a failed spearphishing attempt in May 2014 which used\nthe malicious faux VAE, Inc. themed domain.\n\nThe targeted incident relied upon the Sakula executable MD5:\n[230D8A7A60A07DF28A291B13DDF3351F which had a XOR 0x9A encoded C2 callbacks to](https://www.virustotal.com/en/file/d4be6c9117db9de21138ae26d1d0c3cfb38fd7a19fa07c828731fa2ac756ef8d/analysis/)\nthe IP address 192.199.254[.]126 (registered to Wehostwebsites[.]com – “Tom Yu” of Baoan,\nShenzhen City, Guangdong Province, China) as well as a hardcoded callback to sharepointvaeit[.]com. Passive DNS of the static C2 IP 192.199.254[.]126 revealed a single suspicious\ndomain of interest – topsec2014[.]com. This domain had historic resolution around May 8,\n2014 within a month of the first observed Sakula activity using the IP 192.199.254[.]126 as\nC2.\n\nUsing historic Whois, we discovered that topsec2014[.]com was initially registered by\nli2384826402@yahoo[.]com on May 6th, 2014. Although the li2384826402@yahoo[.]com\nregistrant is likely a reseller given that it has been observed registering several thousands of\nother domains, the fact that it was used to register both the faux VAE, Inc. C2 infrastructure\nand the overlapping domain topsec2014[.]com within the same month suggests that there\nmay be a relationship between the client of the reseller for the VAE, Inc. infrastructure and\nthe client for topsec2014[.]com.\n\n\n-----\n\nJust four minutes after the initial registration of topsec2014[.]com, the Whois records were\nupdated from the initial registrant, Li Ning – li2384826402@yahoo[.]com to TopSec China –\nTopSec_2014@163[.]com. This domain record has been unchanged since May 7th 2014.\nThe we11point[.]com infrastructure and by extension the faux VAE Inc. infrastructure is\n[associated with Cluster 2 of the ScanBox framework by PwC. The latest PwC update to](http://pwc.blogs.com/files/cto-tib-20150223-01a.pdf)\nScanBox states that there are “links between the domain allegedly used in the Anthem hack\n_(we11point.com) to Cluster 2 through shared WHOIS details.”_\n\n### OPM Themed Infrastructure\n\nOne notable pattern was how the domain Whois registration information for the VAE, Inc.\nthemed infrastructure was quickly updated and obfuscated with pseudorandom 10 character\ngmx.com email addresses and using the names of various comic book characters from the\nIron Man franchise. This comic-themed naming convention has been previously documented\n[by our friends at Crowdstrike in what they characterize as being associated with a Chinese](http://blog.crowdstrike.com/ironman-deep-panda-uses-sakula-malware-target-organizations-multiple-sectors/)\nAPT group they have dubbed “Deep Panda”.\n\nLeveraging our DomainTools partnership, we were able to correlate the outlier domain opmlearning[.]org. This domain was also purportedly registered by the Iron Man movie hero\n“Tony Stark” on July 28, 2014. This infrastructure naming convention suggests a possible\nOffice of Personnel Management (OPM) theme. However, in this case we lacked any specific\nsample of malware to verify our initial suspicions that this infrastructure was operational. The\npossible OPM reference in the domain name is noteworthy considering it was revealed in\n[July of 2014 that OPM had been compromised by a likely state-sponsored Chinese actor in](http://www.washingtonpost.com/world/national-security/chinese-hackers-go-after-us-workers-personal-data/2014/07/10/92db92e8-0846-11e4-8a6a-19355c7e870a_story.html)\n\n\n-----\n\nmid-March of that year. The fact this domain was registered after the breach occurred\nsuggests that OPM could be an ongoing direct target of Chinese state-sponsored cyber\nespionage activity.\n\nOur attention then turned to the [FBI Flash Report A-000049-MW that was publicly reported](http://krebsonsecurity.com/wp-content/uploads/2015/02/FBI-Flash-Warning-Deep-Panda.pdf)\nby [Brian Krebs on February 6th, 2015. This FBI Flash Report was issued on January 27th,](http://krebsonsecurity.com/2015/02/china-to-blame-in-anthem-hack/)\n2015, the same day an Anthem administrator detected suspicious activity according to an\n[internal memo. This memo goes on to indicate that the FBI would not be party to the Anthem](http://www.csoonline.com/article/2880352/disaster-recovery/anthem-confirms-data-breach-but-full-extent-remains-unknown.html)\nbreach until they were notified on January 29th, 2015; based on these facts we assess with\nhigh confidence that it is very unlikely that the FBI Flash Report was directly related to the\nAnthem breach. Rather, we suspect that the FBI flash report likely references the USIS\nbreach that was [announced on August 6, 2014, or the previous OPM breach, considering the](http://www.washingtonpost.com/world/national-security/dhs-contractor-suffers-major-computer-breach-officials-say/2014/08/06/8ed131b4-1d89-11e4-ae54-0cfe1f974f8a_story.html)\nstatement that the breach involved “compromised and stolen sensitive business information\n_and Personally Identifiable Information (PII) from US commercial and government networks_\n_through cyber espionage.”_\n\nThe malware referenced within the FBI Report is associated with a Derusbi backdoor\nsubvariant named “InfoAdmin” / “Kakfum” where the FBI specifically references open source\nreporting of “Deep Panda” as being related to the malware observed in the attack. The\nmalicious infrastructure highlighted in the report are the domains\nimages.googlewebcache[.]com and smtp.outlookssl[.]com. Both of these top level domains\nwere included with other related domains, all of which were shared on September 16th, 2013\nto the ThreatConnect Subscriber Community in Incident 20130823C: Some.Trouble APT\nDomains, roughly a year and half prior to the FBI Flash report.\n\nIt is important to mention that both the domains images.googlewebcache[.]com and\n[smtp.outlookssl[.]comas were also previously identified in an October 2014 PwC blog post as](http://pwc.blogs.com/cyber_security_updates/2014/10/scanbox-framework-whos-affected-and-whos-using-it-1.html)\nseen within Cluster 1 of the Scanbox framework, while the Sakula activity with we11point and\nVAEIT is contained within Cluster 2 of that report. This implies that the actor referenced\nwithin the FBI Flash report uses shared capabilities (in this case the ScanBox kit) with the\nSakula / we11point actor.\n\n### Section Summary:\n\nThe Derusbi / Sakula malware seen in both the we11point[.]com and VAE Inc.\ncampaigns were structurally the same and digitally signed with the DTOPTOOLZ\nsignature.\nThe emerging theme is that this particular signature and family of malware is highly\nindicative of a particular Chinese APT activity.\nWithin this web of malicious infrastructure, there is an interesting overlap with the\ntopsec2014[.]com domain and attack infrastructure.\n\n\n-----\n\nThreatConnect Research identified a domain opm-learning[.]org that had a similar\nsuperhero themed WHOIS registrant to the Sakula / VAE Inc. infrastructure. The\npossible OPM reference is noteworthy considering the Office of Personnel\nManagement (OPM) was compromised in March 2014. Additionally, an FBI Flash\nReport 0000-49MW referenced indicators that were possibly associated with the USIS\nhack and a Derusbi variant called “Kakfum” / “InfoAdmin”. Both the FBI Flash\ninfrastructure and the Sakula / VAE Inc. infrastructure are tied to the capability usage of\nthe ScanBox framework, residing in Clusters 1 and 2 respectively.\n\n## Unveiling Song Yubo and Southeast University:\n\n### The Professor\n\nWe conducted open source research in pursuit of further information on the\nTopSec_2014@163[.]com email registrant. A keyword search returned several results for\n“topsec2014@163[.]com” in association with a number of academic institutions in Nanjing,\nChina. Although the email address wasn’t an exact match to the topsec2014[.]com domain\nregistrant (notice the absence of the underscore), such a similarity warranted further\ninvestigation.\n\n\n-----\n\nWe examined the links for any relevant intelligence, and discovered that nearly all of the\nsearch results led to pages that contained an announcement for an information security\ncompetition sponsored by the Southeast University-Topsec Information Security and Mobile\nInternet Technology Joint Research Center. This entity appears to be a joint research\nventure between the University and Chinese networking giant Beijing Topsec Network\nSecurity Technology Co., a.k.a. Beijing Topsec.\n\n\n-----\n\nThe announcements list a Professor “Song Yubo” as the point of contact for the event, and\ndirects interested parties to his email address, topsec2014@163[.]com, for further questions.\n\n\n-----\n\nAccording to his LinkedIn page, Song is a Teacher at the Southeast University, specifically\ninterested in the field of telecommunications. Additionally, he is an avid researcher, and has\npublished numerous academic papers on computer network exploitation on various e-journal\n[publication sites, such as Google Scholar. Further, he lists skills such as “cryptography,”](https://scholar.google.com/citations?user=BoorASIAAAAJ&hl=zh-CN)\n“penetration testing” and “computer network security,” etc. [on his Research Gate profile.](http://www.researchgate.net/profile/Song_Yubo)\n\nAs we continued to develop a profile on Professor Song, we began to have the sense that\nhis interest in information security research strongly overlapped with that of someone who\nmight be interested in or at least capable of conducting sophisticated cyber attacks.\nHowever, interests alone are not enough to warrant reasonable suspicion, so we had to do\nmore digging.\n\n\n-----\n\nAdditionally, the soft link between TopSec_2014@163[.]com and topsec2014@163[.]com\nalone was not sufficient to make associations with any reasonable confidence, but as it turns\nout, Yubo has in fact been previously named as a person of interest in the context of\noffensive Chinese cyber activity.\n\n### The University\n\n[In March 2012, Northrop Grumman presented a commissioned report to Congress detailing](http://www2.gwu.edu/~nsarchiv/NSAEBB/NSAEBB424/docs/Cyber-066.pdf)\nChinese cyber warfare capabilities. The report asserts with high confidence that both Song\nand the Information Security Research Center at Southeast University have received\nnumerous state-sponsored research grants, and by extension, cooperated with the\nGovernment of China in conducting information security research and development (R&D).\nAs stated on Southeast University’s own website, the main purpose of these grants are to\ndevelop technical acumen amongst its students via providing support for “state-owned\nscientific research institutions, state key enterprises, government agencies and People’s\nLiberation Army (PLA) units.”\n\nSoutheast University is one of only three Chinese academic institutes that receives funding\nfrom all five of the State grant programs. Song himself has also conducted his fair share of\nstate-sponsored research, notably under the National Ministry of State Security 115 Program\n– a highly sensitive research grant to fund ambiguous information warfare R&D, almost\ncertainly in support of PLA programs.\n\n### The Competition\n\n\n-----\n\nAs we can see, the evidence continued to stack up. The real smoking gun, however, was\nwhen we began to notice a strong temporal overlap with the various stages of the TOPSEC\nCup that Song and Beijing Topsec were organizing, and the registration dates of malicious\ninfrastructure as well as the malware compilation dates.\n\nBased upon the translated registration form that we obtained from Song Yubo’s personal\nBaidu document sharing account, open registration for the “TOPSEC Cup” began on May\n4th, 2014 and would close on May 14th, 2014.\n\nThe details of the competition that were shared on the announcement are extremely\nambiguous, and probably for good reason. The introductory paragraph mentions that the\nprimary goal of the event is to facilitate the training and discovery of new talent, noting that\nexceptional participants would receive priority consideration for internships and jobs with\nBeijing Topsec.\n\nThe event itself was broken down into several distinct rounds of competition. Firstly, the\npreliminary round required that all eligible registrants would attempt to remotely access and\nnavigate through the network. Should a participating team perform exceptionally in the\npreliminary qualifying round, they would be invited to participate in the final round on-site in\nNanjing.\n\nIn this final round, participants would be required to build their own “information systems and\nnetwork environments.” The announcement notes that the students must rely upon their own\nlaptop and software tools to accomplish this task. Further, the announcement notes that\nparticipants are prohibited from attacking the provided server as well as their competitors.\n\n\n-----\n\n### Section Summary:\n\nSong Yubo and his research center at Southeast University appear to be central\nplayers in this narrative, as highlighted by their financial connections to the government\nof China, in particular the Ministry of State Security (MSS), China’s premier human\nintelligence agency.\nIf the MSS was involved, we can deduce that the Anthem hack could have been for the\npurposes of gathering sensitive information for follow-on HUMINT targeting via\nblackmail, asset recruitment or technical targeting operations against individuals at\nhome.\nSong’s use of the topsec email alias suggests a greater association w/ TOPSEC.\nIt seems as if the competition is almost certainly the cause for the topsec2014[.]com\ndomain. What is very curious, however, is the initial registration by the reseller\nli2384826402@yahoo[.]com, which is a tactic seen within the confirmed malicious faux\nVAE Inc.infrastructure.\nThe overlap between the competition website and the static command and control\ninfrastructure seen in the Derusbi / Sakula implant is was likely an error made by the\nattackers.\n\n## Tianrongxin, a.k.a. Beijing Topsec Technology Co:\n\n### The Company\n\n[To enhance our open-source capabilities, we partnered up with Dr. James Mulvenon and his](http://www.uscc.gov/sites/default/files/Mulvenon_Bio.pdf)\nteam of China experts at [Defense Group, Inc. (DGI). We shared with them everything that](http://www.defensegroupinc.com/index.html)\nwe knew at the time, walking through the technical details which led us all the way to Song\nYubo and the competition announcement. From there, they were able to uncover a wealth of\nvery consequential background information on Beijing Topsec Technology Co (Beijing\nTopsec), the sponsoring organization for Song Yubo’s information security competition.\n\nDGI’s research indicated that Beijing Topsec is one of the largest information security\nhardware providers in China. In 1996, they were the first Chinese company to break into the\nmarket with the release of China’s first indigenously-manufactured firewall. Since then, they\nhave expanded their business to include a consulting practice focused on issues such as\nvulnerability mining, software code analysis, threat intelligence, and encryption R&D,\namongst other things.\n\nThe company served as a core technical support unit for network security at the 2008\nOlympic Games – an event which was tightly controlled by the state. Additionally, Beijing\nTopsec is a known partner of the Chinese military. Since 2009, the company has possessed\ninformation publication credentials for military network procurement. Since 2013, they have\nbeen publicly recognized as the Chinese equivalent of a cleared defense contractor.\n\n\n-----\n\nThe links between Beijing Topsec and the Chinese government are fairly substantial,\nhighlighted by long-standing partnerships between even the most shadowy elements of the\nChinese military.\n\n### The Leaked Cable\n\nA very compelling piece of evidence is found in the contents of a leaked 2009 diplomatic\nsecurity cable from the Department of State, [published by The Guardian. The cable is a](http://www.theguardian.com/world/us-embassy-cables-documents/214462)\ndaily digest of Diplomatic Security alerts – essentially a situational awareness primer for\nState Department employees to inform them of new and existing threats. In one section, the\ncable highlights that the Founder of Beijing Topsec, He Weidong, had openly talked about\nreceiving directives from the PLA in an interview with China News Network. In the interview,\nthe founder quite curiously states that Topsec is less a commercial entity, but rather a\nresearch institute, and that the company received about half of its start-up capital directly\nfrom the PLA. The cable further claims that Topsec actively recruits for the PLA cyber army.\n\nIt would also appear that not only does Beijing Topsec have deep ties to state-run cyber\nactivity, but also within the independent hacker community as well. Of note, the company\n[hired the notorious hacker Lin Yong, a.k.a. “Lion” (of the Honker Union of China) in the early](http://blogs.wsj.com/chinarealtime/2011/10/05/patriotic-chinese-hacking-group-reboots/)\n2000s as a security service engineer and to conduct network training.\n\n### Section Summary:\n\nIt is not surprising that the Chinese government would be interested in partnering with a\nprivate organization such as Beijing Topsec for use as a front for state-sponsored\nactivity.\n\n\n-----\n\nThe association between Southeast University and Beijing Topsec as manifested in the\njoint information security research center highlights the possibility of growing links\nbetween state-sponsored activity and academic institutions, particularly those that\nreceive funding from the central government.\nAll in all, it would seem that China is pursuing a unified approach to cyber operations,\nrelying on all unique facets of the workforce: academia, private industry, and\nindependent hackers, as well as the PLA to achieve their strategic goals.\n\n## Conclusion:\n\nThe Anthem breach exposes the insidious reality of modern Chinese cyber espionage as it\ncontinues its unrelenting strikes at the soft underbelly of the American way of life. Moreover,\nit demonstrates the imposing yet increasingly common reality of conducting threat\nintelligence analysis without substantial threat intelligence to start with. Fortunately for us,\nwe were able to deduce informed answers to some of the outstanding questions to this\nbreach by scrutinizing our archival data troves that are efficiently stored within our Threat\nIntelligence Platform and partner integrations. In the field of cyber security, industry\nprofessionals must learn to play the long game in order to generate a proactive sense of\nsituational awareness, allowing for greater efficiency and flexibility in mitigating future\nthreats.\n\nAdditionally, this incident underscores the frustrating disparity of the industry when it comes\nto naming conventions. With so many threat actors and indicators floating around, it is can\nbe frustrating to keep track of all the disparate pieces of evidence, especially when countless\nnaming conventions are applied. Without the use of a Threat Intelligence Platform to keep\ntrack of the flood of incoming threat data, this task would be extraordinarily time consuming\nat best and crippling at worst.\n\nMoving forward, it is important to bear in mind that the adversary, regardless of country of\norigin, shall almost certainly leverage our every weakness against us. Even something as\nseemingly innocuous as confusion over names can easily consume analytical bandwidth,\ncreating a window of opportunity to strike. We – that is security professionals, private\nindustry and governments alike – must proactively harden our network defenses and hasten\nour incident responses as a united, synchronous entity.\n\n[We have shared details on Song Yubo and affiliated indicators within the ThreatConnect](https://app.threatconnect.com/tc/auth/adversary/adversary.xhtml?adversary=726175)\n[Common Community. This share also includes the full-text DGI “BLUE HERON” research](https://app.threatconnect.com/tc/auth/document/document.xhtml?document=726190)\nwhich provides greater insight into Song Yubo, Southeast University and Beijing Topsec.\n\nAll things considered, industry must learn to adopt a cooperative defense mindset in the\nhopes of rebuffing future attacks. The most resolute defense we have is each other, so be\nlike ThreatConnect Research and start actively defending your own community from the next\n[big breach. Contact us learn more.](https://threatconnect.com/)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-27 - The Anthem Hack- All Roads Lead to China.pdf"
    ],
    "report_names": [
        "2015-02-27 - The Anthem Hack- All Roads Lead to China.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535663,
    "ts_updated_at": 1743041802,
    "ts_creation_date": 1653774704,
    "ts_modification_date": 1653774704,
    "files": {
        "pdf": "https://archive.orkl.eu/d2471ec299fa70084d017b66fd66d088915c5c7c.pdf",
        "text": "https://archive.orkl.eu/d2471ec299fa70084d017b66fd66d088915c5c7c.txt",
        "img": "https://archive.orkl.eu/d2471ec299fa70084d017b66fd66d088915c5c7c.jpg"
    }
}