{
    "id": "57c40152-2def-4937-bcad-4149f291c9e3",
    "created_at": "2023-01-12T15:02:07.965383Z",
    "updated_at": "2025-03-27T02:05:21.756836Z",
    "deleted_at": null,
    "sha1_hash": "eeecd94c541afc66dbbcbc0cd3ebf0c97f569933",
    "title": "2020-12-10 - PLEASE_READ_ME- The Opportunistic Ransomware Devastating MySQL Servers",
    "authors": "",
    "file_creation_date": "2022-05-28T02:29:29Z",
    "file_modification_date": "2022-05-28T02:29:29Z",
    "file_size": 345519,
    "plain_text": "# PLEASE_READ_ME: The Opportunistic Ransomware Devastating MySQL Servers\n\n**[guardicore.com/labs/please-read-me-opportunistic-ransomware-devastating-mysql-servers/](https://www.guardicore.com/labs/please-read-me-opportunistic-ransomware-devastating-mysql-servers/)**\n\nBy Ophir Harpaz\n\n## Executive Summary\n\nPLEASE_READ_ME is an active ransomware campaign targeting MySQL database\nservers and dates back to at least as early as January 2020.\nThe attack chain is extremely simple and exploits weak credentials on internet-facing\nMySQL servers. There are close to 5M internet-facing MySQL servers worldwide.\nThe attackers leave a backdoor user on the database for persistence, allowing them to\nre-access the network.\n\nGuardicore Labs have witnessed two variants of the campaign, detailed in this post.\n250,000 databases are offered for sale in the attackers’ dashboard, from 83,000\nsuccessfully-breached victims.\nMonetization of the campaign has evolved into a double extortion attempt – publishing\nand offering data for sale to pressure victims into paying ransom.\n[Indicators of Compromise are available at Guardicore Labs campaigns repository.](https://github.com/guardicore/labs_campaigns/tree/master/PLEASE_READ_ME_VVV)\n\n\n-----\n\n**Ready to protect your data center against ransomware and other active threats? Find**\n**out how to get started.**\n\n## An Evolving Ransomware Campaign\n\nThe [first attack on Guardicore Global Sensors Network (GGSN) was captured on January](https://www.guardicore.com/botnet-encyclopedia/please_read_me/)\n24, 2020. Since then, a total of 92 attacks have been reported by our sensors, showing a\nsharp rise in their number since October. The attacks originate from 11 different IP\naddresses, most of which are from Ireland and the UK. What drove us to closely monitor this\nthreat is its use of double extortion, where stolen data is published and offered for sale as a\nmeans to pressure victims into paying the ransom.\n\n\n-----\n\nGuardicore Labs observed two different variants during the lifetime of this campaign. In the\nfirst, which lasted from January till the end of November, the attackers left a ransom note\nwith their wallet address, the amount of Bitcoin to pay and an email address for technical\nsupport. 10 days were given for victims to perform payment. Since Bitcoin wallets were\nspecified explicitly in ransom notes, we could explore the wallets and the amount of BTC\ntransferred to each of them. We found that a total of 1.2867640900000001 BTC had been\ntransferred to these wallets, equivalent to 24,906 USD. Guardicore Sensors captured 63\nattacks of this type, coming from 4 different IP addresses.\n\nThe second phase started on October 3rd and lasted till the end of November, and marked\nan evolution of the campaign. Payment is no longer done directly to a Bitcoin wallet, and no\nemail communications are needed. Instead, the attackers put up a website in the TOR\nnetwork where payment can be made. Victims are identified using unique alphanumeric\ntokens they receive in the ransom note.\n\nThe website is a good example of a double extortion mechanism – it contains all leaked\ndatabases for which ransom was not paid. The website lists 250k different databases from\n83k MySQL servers, with 7TB of stolen data. Up till now, GGSN captured 29 incidents of this\nvariant, originating from 7 different IP addresses.\n\n\n-----\n\nThis phase marks an evolution of the campaign in several ways.\n\nFirst, the mapping between a victim and their stolen database is now done\nautomatically, with a unique token, and does not involve searching through IPs and\ndomains to find the stolen database.\nIn addition, the “repository” of all stolen databases is managed in one place and is\npublic – victims can see their databases on the list and be pressured into paying the\nransom.\nLast, the website creates a smoother experience for the victim and even builds more\ntrust between the victim and the attackers, as the details of the database are provided.\n\n## Attack Chain\n\nThe attack starts with a password brute-force on the MySQL service. Once successful, the\nattacker runs a sequence of queries in the database, gathering data on existing tables and\nusers. By the end of execution, the victim’s data is gone – it’s archived in a zipped file which\nis sent to the attackers’ servers and then deleted from the database. A ransom note is left in\na table named WARNING, demanding a ransom payment of up to 0.08 BTC.\n\nINSERT INTO `WARNING` (`id`, `warning`, `website`, `token`) VALUES (1, ‘To recover your\nlost databases and avoid leaking it: visit https://hn4wg4o6s5nc7763.onion and enter your\nunique token ffc7e276a3c7ef27 and pay the required amount of Bitcoin to get it back.\nDatabases that we have: . Your databases are downloaded and backed up on our servers. If\nwe don’t receive your payment in the next 9 Days, we will sell your database to the highest\nbidder or use them otherwise. To access this site you have use the tor browser\nhttps://www.torproject.org/projects/torbrowser.html’, ‘https://hn4wg4o6s5nc7763.onion’,\n‘ffc7e276a3c7ef27’);\nAdditionally, a backdoor user mysqlbackups’@’%’ is added to the database for persistence,\nproviding the attackers with future access to the compromised server.\n\n## Leak Site Offers Databases for Purchase\n\nThe .onion domain – hn4wg4o6s5nc7763.onion – leads to a full-fledged dashboard where\nvictims can provide their token and make the payment. The .onion top-level domain is used\nto distinguish services hosted in the TOR network. Such websites can only be accessed from\n\n\n-----\n\nthe TOR browser, and guarantee that both their operators and the client-side users remain\nanonymous. Choosing to use an .onion domain makes it harder to trace the attackers and\nwhere their infrastructure is hosted.\n\nAll stolen databases are offered for sale in a section in the website titled Auction, all having a\nuniform price of 0.03 Bitcoin. A table on this page lists all stolen databases per token, along\nwith their sizes. By crawling the auction pages, Guardicore Labs found nearly 83k unique\ntokens. Restoring data will cost a victim 0.03 BTC, which equals (at the time of writing)\naround $520.\n\n\n-----\n\n## Ransomware Attacks Come in Different Forms\n\nSome ransomware campaigns are highly targeted; they are planned ahead for months and\nare executed flawlessly. Those campaigns are advanced, persistent threats (APTs). They\nbreach the network, perform silent and careful lateral movement to infect multiple assets,\nencrypt valuable data and demand ransom for restoration.\n\nOthers campaigns are opportunistic in nature. These campaigns are usually automatic,\nmeaning they are executed from a script rather than by a human being. Intelligence\ngathering or reconnaissance are not part of the process. This characteristic allows such\ncampaigns to scale significantly and potentially infect important servers that are mistakenly\nconnected to the internet.\n\nAttack campaigns of this sort are untargeted. They have no interest in the victim’s identity or\nsize, and result in a much larger scale than that available for targeted attacks. Think of it as\n“Factory Ransomware” – the attackers run the attack, making less money per victim but\nfactoring the number of infected machines.\n\nPLEASE_READ_ME is a great example of the latter type:\n\n1. It is untargeted: it attempts to infect any of the 5 million MySQL servers which are\n\ninternet-facing.\n2. It is transient – it does not spend time in the network besides that required for the\n\nactual attack. With no lateral movement involved, the attack begins and ends inside the\nMySQL database itself and does not try to escape it.\n3. It is simple. There are no binary payloads involved in the attack chain, making the\n\nattack “malwareless”. Only a simple script which breaks in the database, steals\ninformation and leaves a message.\n\nThe PLEASE_READ_ME operators are trying to up their game by using double extortion in\nscale. Factoring their operation will render the campaign more scalable and profitable.\n[Guardicore Labs provides an IOCs repository and will keep monitoring this campaign to help](https://github.com/guardicore/labs_campaigns/tree/master/PLEASE_READ_ME_VVV)\norganizations protect against it.\n\n**Ready to protect your data center against ransomware and other active threats? Find**\n**out how to get started.**\n\n**Experienced a Breach? Contact Us:**\nEmail: [labs@guardicore.com](http://10.10.0.46/mailto:labs@guardicore.com)\nCall:\nUS: +1 415-200-1993\nUK: +44 118 310 0896\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-10 - PLEASE_READ_ME- The Opportunistic Ransomware Devastating MySQL Servers.pdf"
    ],
    "report_names": [
        "2020-12-10 - PLEASE_READ_ME- The Opportunistic Ransomware Devastating MySQL Servers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535727,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653704969,
    "ts_modification_date": 1653704969,
    "files": {
        "pdf": "https://archive.orkl.eu/eeecd94c541afc66dbbcbc0cd3ebf0c97f569933.pdf",
        "text": "https://archive.orkl.eu/eeecd94c541afc66dbbcbc0cd3ebf0c97f569933.txt",
        "img": "https://archive.orkl.eu/eeecd94c541afc66dbbcbc0cd3ebf0c97f569933.jpg"
    }
}