{
    "id": "57dce6a9-7b9b-4096-b0dc-8037393d769c",
    "created_at": "2023-01-12T15:08:42.403424Z",
    "updated_at": "2025-03-27T02:05:25.6987Z",
    "deleted_at": null,
    "sha1_hash": "43fe3f4aaeb3a25dab025a53947823a6a1776ed7",
    "title": "2012-06-21 - BlackShades in Syria",
    "authors": "",
    "file_creation_date": "2022-05-28T04:47:40Z",
    "file_modification_date": "2022-05-28T04:47:40Z",
    "file_size": 511858,
    "plain_text": "# BlackShades in Syria\n\n**[blog.malwarebytes.com/threat-analysis/2012/06/blackshades-in-syria/](https://blog.malwarebytes.com/threat-analysis/2012/06/blackshades-in-syria/)**\n\nAdam Kujawa June 21, 2012\n\nAs reported by the Electronic Frontier Foundation (EFF) earlier this week, a new Trojan is\nbeing spread to Syrian activists in an attempt to employ electronic surveillance on the group\nand its members. This Trojan is none other than the BlackShades RAT I blogged about last\nweek as Part 2 of a series on different RATs found in the wild. As it turns out the first blog\npost on DarkComet has also been used against the activists in the past.\n\n## Background\n\nSyria is currently undergoing a very serious and bloody internal war between the government\nand the opposition forces or activists who want to see the tyranny and injustice shown by the\ncountry’s top leaders come to an end. I cannot speak about it in detail but can only refer you\nto this video by CNN which explains everything very well up to now:\n\n[Syria: How a year of horror unfolded (CNN)](http://edition.cnn.com/video/#/video/world/2012/03/15/robertson-syria-1-yr-of-violence.cnn)\n\nBeyond attempting to squash opposition on the ground with the use of tanks and guns,\nattempts have been made to do the same thing in the cyber arena, by pitting people against\neach other and destroying communication, at the same time collecting vital information on\nthe communications of the activists. In order to accomplish this, three types of Remote\nAccess Trojans/Tools have been used against the activists with various methods of infection.\n\n## Infection\n\n\n-----\n\nAccording to the EFF, the hackers who have been infecting the systems of the Syrian\nactivists are the same ones who had previously been infecting them with DarkComet. They\nhad accomplished this by leading the victims to a fake YouTube video page which had antigovernment opposition themes, upon accessing these pages, the download and installation\nof an Adobe Flash Update would be required, however the updater executable was actually\na DarkComet implant in disguise. It also allowed for the victims to log-in with their real\nYouTube credentials to leave comments, at which point the credentials would be stolen and\nused against the activists, possibly to spread the fake YouTube video to any contacts.\n\nThis image is from the EFF report on Fake Youtube Pages used to infect Syrian Activists:\n\nhttps://www.eff.org/deeplinks/2012/03/fake-youtube-site-targets-syrian-activists-malware\n\nThe new infection method used with BlackShades includes distributing the implants through\nSkype as a “.pif” file. The EFF was able to document this based on the sample they obtained\nof the malware, which was obtained by an officer of the Free Syrian Army through his Skype\naccount. After downloading and executing the file, it automatically infected his system and\nsent out the same link to the file as he received, which described the download as an\n“Important Video”, to all of his contacts.\n\n## Evading Detection\n\nAs I mentioned in the blog post, BlackShades NET has the ability to create implant binaries\nwhich employ custom obfuscation algorithms or Crypters, which can be bought through the\nBot/Crypter marketplace embedded in the BlackShades controller. The implant sample\ncollected from infected systems of the Syrian activists uses one of these custom Crypters in\norder to hide the implant binary from detection.\n\n\n-----\n\nAccording to Citizen Lab, a laboratory at the University of Toronto whom conducted an indepth analysis of the collected implant sample, at the time they released their results online,\nthe malware variant was undetected by any of the antivirus engines used by VirusTotal.\nHowever, thanks to the diligence and observations of the Researchers at Malwarebytes, the\nsamples noted as ‘Undetected’ by Citizen Lab were being detected by Malwarebytes AntiMalware definitions 9 days before the release of the Citizen Lab report on June 7 .th\n\n## Implant Infection Breakdown:\n\n[The exact technical details about the infection can be found on the report from the EFF and](https://www.eff.org/deeplinks/2012/06/darkshades-rat-and-syrian-malware)\n[Citizen Lab:](https://citizenlab.org/2012/06/syrian-activists-targeted-with-blackshades-spy-software/)\n\nTo summarize a very interesting and technical explanation:\n\nOnce downloaded and executed, the “.pif” file drops multiple files into:\n\nThe User “Templates” directory\nThe User “Temp” directory\n\nThe malware then creates multiple registry entries which serve the purpose of allowing\nthe dropped files access to the internet without being stopped by the local Windows\nfirewall\nThe malware establishes persistence (so it will start again if the system is rebooted) by\ncreating an “AutoRun” registry key for one particular dropped file named “VSCover.exe”\n“VSCover.exe” runs an internal decryption algorithm which reveals the hidden\nBlackShades implant executable\nInitially the implant beacons to TCP port 4444 to the website alosh55.myftp.org\n\nIt is important to note that alosh55 is of a similar naming convention of the\nbeacon address for the previously used DarkComet RAT which, according to\nCitizen Lab, was alosh66. This connection, in addition to their finding of both the\nalosh55 and alosh66 pointing to the same IP address for consecutive days,\nallowed for the conclusion that both the attacks used with the DarkComet RAT\nand the new ones with the BlackShades RAT are being performed by the same\nactor.\n\n## Personal Observations\n\nTo start off with, obviously the hackers using BlackShades NET for their nefarious espionage\npurposes have violated the terms of use agreement:\n\n\n-----\n\nThey may have voided their warranty.\n\nEFF mentioned that one of the capabilities of BlackShades is installing a keylogger and a\nscreenshot grabber; we know that these are only the minor capabilities of BlackShades.\nHowever taking that into consideration, what can happen if the information obtained from\nusing these types of functionality were put in the wrong hands? I created a list of what that\ninfo is and what it can be used for in the hands of state-sponsored hackers:\n\n**Keylogging:**\n\nKeylogging is one of the simple features available to BlackShades users, however unlike\nmost keyloggers, the BlackShades interface allows for a very understandable feed of key\npresses by the infected user. Using this functionality, hackers can obtain:\n\nLogin credentials for chat clients, forums, social networking accounts, bank information,\netc.\n\nThe hacker or group of hackers behind the attacks can pose as the activists, as\nthey have in the past, to do more than just spread more malware but also to inject\ndoubt or worry into the group, defeating morale or ending discussions on\nparticular plans of action.\nThe text of emails being sent between activists and the text of the chat sessions\nbetween them\n\nThis information can be used to obtain plans for activist rallies and any antigovernment actions taken by the Free Syrian Army, essentially being able to\npredict when and how they will happen and come up with a plan to stop them\nbefore they even start.\nThis information can also be used to blackmail activists into giving up information\non other activists or their activities. It can also be used to paint a negative picture\nof the activists to the public by taking their words or plans out of context. Already\nthe President of Syria refers to the opposition forces as “Criminal Terrorists”,\nrevealing text or actions from the opposition in the wrong light might just back up\nthat claim to the non-combatant public\n\n\n-----\n\n**Remote Controlling:**\n\nWe know that BlackShades has the capability to remotely control a system by taking over the\ninput of the user, combined with other features of BlackShades, the hacker has the ability to:\n\nDisable any sort of antivirus protection against further malware\nSteal files and documents from the victims system\nReroute network traffic\nMonitor the activities of the victim while using the system\n\n**Webcam Viewing:**\n\nWhile the use of being able to remotely activate and monitor the webcam attached to a\ncomputer allows a hacker to invade user privacy on many levels, I can think of only a few\nuses to government sponsored hackers:\n\nObtaining a visual identification of any persons using the system flagged as being used\nby activists\nObtaining intelligence on the kinds of resources which might be discussed or revealed\nin front of a webcam.\nDetermining possible location of the system\n\nCertain features available to the BlackShades RAT allow it to pinpoint to a certain\nlevel the location of the infected system based upon the IP address being used,\nhowever if one was able to determine a near location of the system, then narrow\nit down based upon visual cues, for example if the victim was on a laptop outside,\nthen the probability of finding the exact location would increase drastically\n\nBlackShades includes many more features which would be useful to government sponsored\nhackers, including:\n\nActivating a Ransomware functionality which would encrypt all the files on the system\nUsing the infected system as a proxy for all traffic, this could be used to frame a user\nby forcing them to visit websites or perform cyber-attacks against their will.\nHost torrent files; imagine if the next variation of the espionage malware was\ndownloaded from one of the victim systems belonging to the enemy\nListen in to any conversations or sounds around the area of the infected systems\nmicrophone\nAnd many more…\n\nIf you are curious about any further functionality of BlackShades, please check out my blog\npost from last week: **[You Dirty RAT Part 2: BlackShades NET](http://blog.malwarebytes.org/intelligence/2012/06/you-dirty-rat-part-2-blackshades-net/)**\n\n## Protecting Yourself\n\n\n-----\n\nUnlike Flame, which had little likelihood of reaching the general public and being a threat to\nthe normal person, BlackShades is a very real threat to the average user. It is because it isn’t\nonly used in political or international conflicts, it is used on the everyday person to steal\ninformation, spy and exploit people every day. My BlackShades blog post goes into some\ndetail about how to most effectively protect your system from being compromised by a\nBlackShades implant. In addition, the EFF included a portion of their report on how to\nprotect yourself from this threat and I encourage you to check it out.\n\nAs stated previously, Malwarebytes Anti-Malware was able to detect the obfuscated\nBlackShades implants 9 days before the release of the Citizen Lab report. In saying that,\nMalwarebytes Anti-Malware works in conjunction with pre-existing antivirus software to add a\nsecond layer of protection against new and upcoming threats. If you are concerned with the\npossibility of being infected by this or a similar type of malware, please download and install,\nat the very least, the free version of Malwarebytes Anti-Malware to protect your information.\n\n## How bad are these guys?\n\nWhile writing this I couldn’t help but consider a few things that threw up some flags for me\nand I thought would be interesting to share. Namely it was about the choices made by the\nhackers in their design and execution of their attacks compared to the espionage efforts of\nother, more developed countries.\n\n**Port 4444**\n\nWhile we didn’t go into it very deep in my BlackShades blog post, port 4444 is set as the\ndefault transfer port, and according to Citizen Lab, it was the port they saw being used by\nBlackShades to connect to its C2C. This means that regardless of all the obfuscation used\nby the hackers to hide the implant binary, they are still using the at least some of the default\nsettings for the implants themselves. This is usually a sign of a lack of experience using this\nkind of tool or a lack of concern for using the tool correctly.\n\n**DarkComet / BlackShades NET**\n\nDespite BlackShades being a pretty mean piece of software, you still have to wonder about\nthe fact that a state-sponsored hacker or hacker group is using freely available malware that\nis more often seen in the hands of Script Kiddies and organized cyber-crime organizations.\nThere is a small price ($40) for BlackShades and of course however much they paid for the\nCrypters, but DarkComet is completely free! Over the past few weeks, we have seen the\nmost intricate piece of spy malware ever developed (Flame) and being used for cyber\nespionage purposes against the infrastructure of developed countries, and then we look at\nthe poverty stricken government of Syria and see over-the-counter RATs being used. It is\nclear that even in cyber war, the more developed countries have better weapons while the\npoorer countries use whatever they can get their hands on.\n\n## Conclusion\n\n\n-----\n\nThe hackers behind the attacks and infection of Syrian activists are not employing\nsophisticated methods of espionage and infection but only the same tactics as the average\ncybercriminal. The fact that default settings and publicly used RATs are being used means\nthat the hackers are not especially skilled in cyber espionage and are just using what they\ncan in order to get the most results.\n\nIn addition, this is just one case of publicly available malware being used beyond the means\nit was ever intended. A while ago, when speaking about Flame, I asked the question “How\nmuch super malware could really be out there?” In this instance, I ask: ‘How much publicly\navailable and widely used malware is being used every day for purposes of great\nimportance, such as war or cyber-espionage on a corporate or international level?’ Lucky for\nus there is only so many ways to mask a variant of the same malware, as long as we know\nabout it, we can fight it.\n\n**References:**\n\n[1. http://blog.malwarebytes.org/intelligence/2012/06/you-dirty-rat-part-2-blackshades-net/](http://blog.malwarebytes.org/intelligence/2012/06/you-dirty-rat-part-2-blackshades-net/)\n[2. https://www.eff.org/deeplinks/2012/06/darkshades-rat-and-syrian-malware](https://www.eff.org/deeplinks/2012/06/darkshades-rat-and-syrian-malware)\n3. https://www.eff.org/deeplinks/2012/03/fake-youtube-site-targets-syrian-activists\nmalware\n[4. https://citizenlab.org/2012/06/syrian-activists-targeted-with-blackshades-spy-software/](https://citizenlab.org/2012/06/syrian-activists-targeted-with-blackshades-spy-software/)\n[5. http://edition.cnn.com/2012/02/17/tech/web/computer-virus-syria/index.html](http://edition.cnn.com/2012/02/17/tech/web/computer-virus-syria/index.html)\n[6. http://blog.trendmicro.com/fake-skype-encryption-software-cloaks-darkcomet-trojan/](http://blog.trendmicro.com/fake-skype-encryption-software-cloaks-darkcomet-trojan/)\n7. https://threatpost.com/en_us/blogs/syrian-dissidents-hit-another-wave-targeted-attacks\n062012\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2012/2012-06-21 - BlackShades in Syria.pdf"
    ],
    "report_names": [
        "2012-06-21 - BlackShades in Syria.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536122,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653713260,
    "ts_modification_date": 1653713260,
    "files": {
        "pdf": "https://archive.orkl.eu/43fe3f4aaeb3a25dab025a53947823a6a1776ed7.pdf",
        "text": "https://archive.orkl.eu/43fe3f4aaeb3a25dab025a53947823a6a1776ed7.txt",
        "img": "https://archive.orkl.eu/43fe3f4aaeb3a25dab025a53947823a6a1776ed7.jpg"
    }
}