{
    "id": "57e7a327-d96a-4c2b-9e6b-7bf9bfd6745a",
    "created_at": "2022-10-25T16:48:11.902814Z",
    "updated_at": "2025-03-27T02:17:23.598709Z",
    "deleted_at": null,
    "sha1_hash": "8cd6e584044556e5548bdefff08e2cf2c9bb5ecf",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-08-25T15:00:31Z",
    "file_modification_date": "2020-08-25T15:01:40Z",
    "file_size": 13704126,
    "plain_text": "-----\n\n**2 // 28** **Follow The Money**\n\n### 1. Summary\n\nSWIFT plays a key role in helping its community to reinforce and safeguard the integrity of the global\nfinancial ecosystem, and maintains a relentless focus on security. As part of that focus, SWIFT has an ongoing\ncommitment to intelligence sharing and thought leadership that contribute to the community’s understanding\nof the cyber threat and tactics of cyber criminals. One area where the community has expressed interest in\ngaining more insight is around the approaches cyber criminals use to extract money once they have executed a\nsuccessful attack. With this in mind, SWIFT commissioned BAE Systems to research and write this report. Its aim\nis to illuminate the tactics and techniques used by cyber criminals to cash out so that the SWIFT community\ncan better protect itself, through both cybersecurity controls and financial crime compliance processes.\n\nLarge scale cyber heists, in which cyber-attackers manage to steal significant amounts of money from banks,\ncontinue to create news headlines. Various reports have been produced previously on how some of these\nattacks, such as those against banks’ high-value payment systems, succeed and how organisations can\nmount better defences. BAE Systems and SWIFT have jointly published reports on cyber heist techniques\nused against financial institutions and the evolution of the cyber threat to the banking community in 2017¹ and\n2019² respectively.\n\nHowever, to date, there has not been significant material published on what happens to funds after they have\nbeen stolen. This report focuses on that area, specifically the money laundering related activities necessary for\ncyber-attackers to not only conduct and ‘cash out’ a successful attack but also avoid the money subsequently\nbeing traced.\n\nThis report describes how money laundering is typically performed in the context of large-scale cyber heists.\nIt illustrates key parts of the typical processes used by cyber-criminals with examples to help better inform\nreaders on areas they should focus on to better prevent, detect and respond to money laundering. In addition,\nthe report offers perspectives on areas in which controls could be further improved and how money laundering\ntechniques may evolve.\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n# \"...there has not been significant material\n### published on what happens to funds after they have been stolen.                  \n# This report focuses on that area...\"\n\n**1 https://www.baesystems.com/en/cybersecurity/feature/the-evolving-cyber-threat-to-the-banking-community**\n\n\n**3 // 28**\n\n\n-----\n\n**4 // 28** **Follow The Money**\n\n### 2. Introduction\n\nThe activities of all cyber-criminals, whether working individually, as part of a small gang, as organised crime\ngroups, or even for a nation state, have resulted in annual total cyber-crime revenue estimated at USD1.5 trillion³.\nBanks remain a prime target for cyber-criminals because they are critical infrastructure that can facilitate direct\naccess to cash/funds.\n\nThe financial industry, however, is not an easy target. Banks, law enforcement and industry bodies continue\nto evolve cyber defences, improve information sharing, and regularly prevent money from ultimately being\nstolen even when the first stage of a cyber-attack may have seemed successful. Cross industry efforts such as\nSWIFT’s Customer Security Programme (CSP), which provides tools, information and a framework to help the\nSWIFT community secure itself, and payments screening services continue to evolve to mitigate cyber-attacks.\nFor example, 91% of SWIFT customers, representing 99% of SWIFT traffic, attested to their compliance with\ncontrols set out by the latest Customer Controls Security Framework, a set of security controls which serve as\nthe cornerstone of CSP. In addition, banks have improved response security controls such as the ability to stop or\nrecall fraudulent payment instructions where these are identified quickly enough.\n\nHowever, the lure of targeting banks to get ready access to cash remains prevalent, and attackers continue\nto develop their techniques. In recent years, many attacks have moved from targeting high-value payment\nsystems to targeting ATM networks and related systems. While these may, on the face of it, seem to have a\nlower inherent value as any ATM inherently holds a limited amount of cash, in terms of successfully obtaining\nmulti-million dollar sums of money across a number of attacks, this has to date proved to be a successful\nalternate route for attackers.\n\nBut irrespective of the cyber-attack method, the challenge all criminals face after a successful cyber-attack is\ngetting hold of cash or other liquid financial assets that are perceived as ‘clean’, i.e. where it is not possible to tell it\nis from the proceeds of crime. This is where the need for money laundering comes in.\n\nThe money laundering and associated techniques described in this report are those considered relevant to\nlarge-scale cyber heists against banks’ high-value payment systems and ATM related systems, including backoffice payment systems. Such cyber attacks involve being able to manipulate or subvert the correct operation\nof high-value payment systems or management systems controlling a number of ATMs. This paper has not\nspecifically considered what happens to money stolen in other financial crime related attacks such as physical\nattacks against individual ATMs, card skimming and cloning, banking Trojans and malware, authorised push\npayment or business email compromise type attacks. However, the money laundering techniques and controls\ndescribed are likely to also be relevant in many of these cases.\n\n**3 https://www.experian.com/blogs/ask-experian/cybercrime-the-1-5-trillion-problem/**\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n### 3. Money Laundering Overview\n\n\n**5 // 28**\n\n\nIn the strictest sense, money is laundered whenever a person or business deals in any way with another person\nor organisation’s benefits from crime. Traditionally, money laundering has been described as a process which\ntakes place in three stages: placement, layering and integration:\n\n**•** **Placement – Criminally derived funds are introduced into the financial system in the case of an ATM style**\nattack, or, in the case of a cyber heist against a bank’s high value payment systems; placement covers the\ninitial fraudulent movement of funds\n\n**•** **Layering – Illicit funds are moved through the financial system in order to disguise their origin and**\nownership. This is the most substantive phase of the process\n\n**•** **Integration – Laundered funds are re-introduced into the legitimate economy, or reinvested into the**\ncriminal enterprise\n\nVarious methods underpin how funds are typically removed from a bank during a large-scale cyber-heist, as\nwell as the money laundering techniques that aim to conceal their subsequent movement. There can also be\nsignificant overlap between the money laundering phases in reality.\n\n**Typical Money Laundering Phases**\n\n**Conduct heist**\n\n**Preparatory money**\n\n**and move** **Placement** **Layering** **Integration**\n\n**laundering activities**\n\n**stolen funds**\n\nActivities performed prior to the attack Criminally derived funds Illicit funds are moved Laundered funds are\n\nthrough a series of\n\nbeing executed which are relevant to the are introduced into the re-introduced into the\n\ntransactions to disguise\n\n‘cash out’ process financial systems origin and ownership legitimate economy\n\n**Attack against a bank’s high-value**\n**payment systems** **Front company** **Cryptocurrency**\n\nSet up recipient accounts in\nreceiving bank\n\nAvoid KYC checks\n\nIdentify method for onward transfer of\nstolen funds, e.g. FX transfer to other\nmule accounts\n\n**Cyber**\n\n**heist**\n\n**Attack against a bank’s ATM**\n**systems or ATM related**\n**infrastructure in a jurisdiction**\n\nRecruit initial money mules to collect\nfunds from ATMs\n\nIdentify method for onward transfer of\nstolen funds, e.g. FX transfer to other **Money-mules** **Cash businesses** **Re-invest in**\nmule accounts **criminality**\n\nThe following sections describe each of these four money laundering related phases in more detail, covering:\n\n- Preparatory activities\n\n- Placement\n\n- Layering\n\n- Integration\n\n|Identify method for onward transfer of stolen funds, e.g. FX transfer to other mule accounts Cyber|Col2|Col3|Col4|Col5|Col6|\n|---|---|---|---|---|---|\n|heist Attack against a bank’s ATM systems or ATM related infrastructure in a jurisdiction||||||\n\n\n-----\n\n**6 // 28** **Follow The Money**\n\n###### 3.1 Preparatory Activities\n\nFor large-scale cyber heists to be successfully executed, attackers need to perform a number of steps in advance.\nOutside of those relevant to successfully conducting the cyber element of the heist, which are not the focus of\nthis paper, money laundering steps the attackers need to complete include:\n\n- Setting up or gaining access to bank accounts into which stolen funds can be initially received, or in the case\nof ATM-related heists, the attackers need to recruit and train money-mules to take the stolen cash out of\nthe ATMs\n\n- Recruiting money-mules to transfer the stolen funds out of those accounts\n\n\n-----\n\n**baesystems.com/SWIFT** **7 // 28**\n\n###### 3.1.1 Account set up\n\n- Setting up accounts to be used in a cyber-heist is a key step as these accounts will\nbe the destination of the funds after they have been stolen, also known as the\n‘end-beneficiary’. There have been many instances where these accounts have\nbeen set up in good faith, believing that the account holders are genuine and\nof decent integrity, due to the use of false identification documents or by using\nlegitimate identification documents from individuals who have been coerced by\ncriminals to allow the account to be used. There have also been instances where\nexisting accounts were used – for example where an individual who no-longer\nhas a requirement for their valid account hands it over to someone else, rather\nthan closing it. The establishment of these fraudulent accounts, by whichever\nmethod, might be facilitated by weak or ineffective policies and controls\nlinked to the customer due diligence processes and also by lack of training of\nfront-line staff.\n\n- In order to avoid suspicion, fraudulent accounts might be set up several months\nbefore the heist, and so are empty and unused. Assigning fake projects and\ncompanies to these fraudulent accounts serves the purpose of giving credibility\nas well as explaining why, at some point, they will be in receipt of large money\ntransfers. In line with this, as an additional obfuscation technique, accounts linked\nto fake organisations may be set up to be used as a hub and collation point for\nstolen funds after they have been transferred to the initial fraudulent accounts.\n\n- The effectiveness of a financial institution’s Know Your Customer (KYC) and\nscreening processes are also important factors – and is likely why certain\ninstitutions in certain jurisdictions are targeted for illicit activity. The ‘Know Your\nCustomer’ process is a vital part of validating users - from simple name screening\nand undertaking background checks through to enhanced due diligence (EDD)\nwith independent assurance provided by two person validation to provide greater\nlevel of scrutiny. If these processes are weak or ineffective, or if the staff is poorly\ntrained, then this allows these checks to be ineffective. Furthermore, there have\nbeen cases where a complicit or coerced insider has helped to evade or reduce the\nscrutiny of compliance teams carrying out KYC and due diligence checks of new\naccount openings.\n\n\n-----\n\n**8 // 28** **Follow The Money**\n\n     - For ATM cashouts, the nature of account set-up differs\ndepending on the type of method used.\n\n**•** **ATM FASTCash involves the fraudulent duplication**\nof legitimate cards, which requires cyber-criminals\nto access customer records in order to create a\nduplicate card.\n\n**•** **ATM cashouts involve an insider creating a phantom**\ntransfer of funds to accounts that are owned by\nrecruited money-mules. In order to create a layer\nof obfuscation, fake identities are used for these\naccounts so that the mule’s identity is concealed.\n\n**•** **ATM management cashouts that involve a cyber-**\nintrusion which remotely controls ATMs do not require\naccounts to be set up to carry-out the heist.\n\n###### 3.1.2 Recruit money-mules\n\n     - A common denominator that underpins cyber-heists is\nthe essential function of the money-mule – irrespective\nof the diversity of the cyber-crime group, the execution\nof the heist, or the final destination of laundered funds.\nTheir role seeks to provide the obfuscation in the chain\nbetween the initial fraud in the bank and the transfer\nof stolen funds to cyber-criminals. Accounts used for\nmoney-muling may be created by those complicit in\nthe criminal activity or may belong to unsuspecting\nindividuals tricked into allowing their account to be used\nfor criminal purposes. These are the various actions that\nwould qualify as a money-mule supporting cyber-heists:\n\n        - Someone’s bank account being controlled and taken\nover by a cyber-criminal / selling control to a cybercriminal.\n\n        - Receiving funds into a bank account before onward\ntransfer to a cyber-criminal.\n\n        - Using a fake identity to open an account for the sole\npurpose of benefiting a cyber-criminal.\n\n        - Re-shipping items purchased by a cyber-criminal\nusing stolen banking details.\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n- Cyber-criminals have become more creative with their methodologies for\nrecruiting money-mules. Some cyber-criminals often dupe innocent victims\ninto laundering money on their behalf with the promise of easy money by\nusing seemingly legitimate job adverts, online posts, social media and other\nmethods. This includes incorporating aspects like diversity and inclusion (D&I)\ninto job adverts to encourage a person to believe the company is real, as well\nas creating fake management teams. Some job adverts appear to be targeted\ntowards people based in countries that are not typical financial targets, (e.g.\nUK, US, and Australia). For cyber-criminals in Eastern Europe this recruitment\ntechnique serves as further obfuscation, due to international transfers increasing\nthe complexity.\n\n- Many money-mule recruitment efforts focus on individuals, especially young\nadults including those seeking to fund higher education and adults recently out of\nwork, who are likely to jump at the chance to apparently easily earn extra cash.\nSome examples of money-mule related job adverts are shown on the following\npage, indicating that in many cases, the money-mules are not strongly linked\nwith the cyber-attackers.\n\n\n**9 // 28**\n\n\n-----\n\n**10 // 28** **Follow The Money**\n\n         - Some cyber-criminals that are part of a large organised crime group are able to\ndraw upon a cadre of associates for money-muling purposes. For nation-state\ncyber-groups which specialise in the ATM FASTCash technique, their links with\nvarious criminal groups in East Asia are utilised in order to recruit money-mules to\ntravel to specific locations in order to withdraw cash from ATMs.\n\n\n-----\n\n**baesystems.com/SWIFT** **11 // 28**\n\n###### 3.2 Placement\n\nPlacement involves the initial movement of stolen funds into the financial system. This can be the initial account\ninto which stolen funds are transferred, or in the case of large-scale ATM based heists, the method of converting\nthe cash obtained in a local currency into a more transferable currency, such as USD$.\n\n###### 3.2.1 Use of Money-mules\n\nMoney-mules serve as intermediaries for cybercriminals and criminal organisations, where they act\nas a bridge between the exfiltration of stolen funds\nfrom a bank to transferring these funds to criminal\nbenefactors. In this way, the money-mule is the\nessential first step in the placement of criminally\nderived funds into the financial system.\n\nThe number of money-mules involved in\nplacement activities for a large-scale cyber-heist\nvaries but has often been seen to involve around 10\nindividuals. However, there are of course exceptions\nto this. For example, an attack against one bank\nwhich is considered to be linked to the Lazarus\nGroup involved 12,000 ATM withdrawals being\nperformed in approximately a two-hour timeframe\nacross 28 countries, pointing to a large and\norganised group of money-mules being involved.\n\nIt should also be noted that other money-mules will\nlikely be used further along the money laundering\nchain, with multiple sets of mules being used to\nobfuscate the source of the stolen funds, and thus\ntheir total number may be much higher than those\ninvolved in the initial placement activity.\n\n\n-----\n\n**12 // 28** **Follow The Money**\n\nThe following schematic provides an overview of a real-life ATM focused cyber-heist, outlining the\nnumber of money-mules involved and the initial mechanisms used to start the money laundering\nprocess.\n\n\n-----\n\n**baesystems.com/SWIFT**\n\nThe following schematic provides an overview of another real-life ATM focused cyber-heist, outlining the\ntimeline of the attack and details on the money-mules involved in the initial placement.\n\n\n**13 // 28**\n\n|Mid-September, 2019|Bank in the Balkans seen beaconing to Command and Control server of a cyber criminal group|\n|---|---|\n\n|Thu 3 October, 2019|Personal details of up to 60 million credit card holders leaked and sold on the black market|\n|---|---|\n\n|Fri 6 December, 2019|Two Eastern European males enter jurisdiction in the Balkans|\n|---|---|\n\n|Sat 10 December, 2019|Two Eastern European males leave jurisdiction in the Balkans|\n|---|---|\n\n|Fri 31 January, 2020|Same two Eastern European males enter jurisdiction in the Balkans with an accomplice|\n|---|---|\n\n|Fri 31 Jan – Sun 2 Feb, 2020|23 ATMs in the Balkan jurisdiction emptied over 53 hours. Quantity of Convertible Marka (KM) stolen.|\n|---|---|\n\n|Sun 2 February, 2020|Two original Eastern European males stopped and detained by local law enforcement, who inform the bank. The accomplice escapes.|\n|---|---|\n\n|Sun 2 February, 2020|A quantity of Convertible Marka (KM) is found on the two detained males. However, the majority of the amount stolen is unaccounted for.|\n|---|---|\n\n|Mon 3 February, 2020|The accomplice arrives at a Central European jurisdiction, and to date is still at large.|\n|---|---|\n\n|Mon 3 February, 2020|Law enforcement claim the group could be larger and that the total amount stolen in Convertible Marka (KM) is almost 3 times that declared during the heist of 31 Jan – 2 Feb 2020.|\n|---|---|\n\n\n-----\n\n**14 // 28** **Follow The Money**\n\n\n###### 3.2.2 Risk of money muling\n\nDespite being financially rewarded for their part in carrying-out a successful cyberheist, the intrinsic risk associated with a money-mule is significant. In the event of an\ninvestigation by law enforcement and the authorities after a heist, the actions of the\nmoney mule are at the front line of the heist. Issues during the money-mule stage have\nled to the ultimate arrest of cyber-group leaders; however, it can often be the case that\nmoney-mules are the scapegoats, punished for their involvement, whereas the rest of\nthe cyber group remain at large[4].\n\nThe process of money-muling marks the most physical aspect of an ATM related\ncyber heist, which is why it might be considered to be the weakest link in a cyberheist, as well as underlining the risk associated with money-muling at an ATM. CCTV\ncameras that are often present at ATM locations offer the chance to identify and record\nsuspicious behaviour and capture facial features that could in some circumstances be\ncross referenced with law enforcement or border control data. The methodologies that\nunderpin the various ATM cashout techniques carry certain risks. The lack of a card\nand pin entry associated with the ATM management technique has been noticed as\nsuspicious by law enforcement, and has led to the arrest of money-mules. Similarly,\nthe speedy draining of cash from ATMs, which were targeted by a FASTCash theft was\nidentified as unusual by banking staff and led to the subsequent arrest of money-mules.\n\n###### 3.2.3 Money-muling interventions\n\nMany initiatives that look to mitigate the risk of successful cyber-heists focus on money-mules. At the end\nof 2019, law enforcement authorities from 31 countries, supported by Europol, Eurojust and the European\nBanking Federation (EBF), came together to support the fifth coordinated global action against money\nmuling, with the European Money Mule Action[5]. In the period between September and November 2019,\nthis resulted in the identification of 3833 money-mules alongside 386 money-mule recruiters, of which\n228 were arrested. More than 650 banks, 17 bank associations and other financial institutions helped to\nreport 7520 fraudulent money-mule transactions, preventing a total loss of €12.9 million.\n\n**4 https://www.nationalcrimeagency.gov.uk/news/arrests-in-belfast-and-london-in-cyber-heist-money-laundering-investigation**\n\n**5 https://www.europol.europa.eu/newsroom/news/228-arrests-and-over-3800-money-mules-identified-in-global-action-against-**\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n\n**15 // 28**\n\n\n##### “The European Money Mule Action (EMMA) shows how a close public- private partnership between law enforcement, judicial authorities and the banking sector is essential to effectively tackle the illegal activity of money muling.”\n\n Europol-Eurojust-European Banking Federation (EBF)\n\n###### 3.3 Layering\n\nLayering is the most substantive phase of the money laundering process, involving multiple steps to\nconceal the origin and ownership of the stolen funds.\n\n###### 3.3.1 What happens after the funds are with the initial money-mule?\n\nMonies withdrawn from ATMs in cyber-heists tend to be immediately exchanged into US Dollars\nat money exchanges. This step in the process could suggest complicity by employees at money\nexchanges to support a money laundering process, albeit via a bribe, or it could indicate negligence.\nAlthough in some cases the initial money-mules have been caught, in others where the heist has\nbeen successful, e.g. after the money-mule has withdrawn funds from an ATM, they might be\npassed onto an intermediary who, in turn, passes the stolen funds to the cyber-criminal. However,\nin some instances, especially after cyber-heists relating to nation state actors like the Lazarus\nGroup, it might be the case that the fate of these stolen funds is to be channelled via other layering\ntechniques in order to further obfuscate the path of the stolen funds.\n\nOut of all attempted Lazarus heists, a subset showed successful fraudulent transactions with a\nmajority of transfers being sent to East Asia, where there are numerous linked front companies.\n\n\n-----\n\n**16 // 28** **Follow The Money**\n\n\n###### 3.3.2 Obfuscation of funds via front companies\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n\n**17 // 28**\n\n\n###### 3.3.4 Use of financial representatives\n\nFront companies registered in East Asia are considered to operate on behalf of the\ngovernment of a FATF high risk jurisdiction. In one instance, a front company was\naccused of laundering more than USD$100 million for the sanctioned state-run bank\nof a FATF high risk jurisdiction. Financial representatives using East Asian aliases,\nor in close liaison with facilitators in East Asia, are responsible for setting up and\noperating front companies and bank accounts across the East Asia region. These\nfront companies and relationships offer a method of laundering the proceeds from a\ncyber-heist in order to expedite and obfuscate the process of stolen funds being used\nfor nefarious purposes, such as purchasing equipment to bypass sanctions. In one\nexample front companies import natural resources without making any prepayment.\nThese organisations resell the natural resource to customers across Asia, retaining the\nUS Dollar proceeds. Rather than sending funds to the FATF high risk jurisdiction, the\nfollowing obfuscation stages occur:\n\n- The payments received by this organisation from customers are processed via banks\nin East Asia and diced up into smaller outflows (minus a fee for facilitating the sale).\nThis forms part of an intricate layering scheme directed to front companies and\nshipping or trade businesses typically registered in jurisdictions in East Asia. Financial\nrepresentatives are key to establishing the front companies and making the transactions\nappear legitimate.\n\n- The FATF high risk jurisdiction sends instructions to the front company of items it would like\nto purchase. The front companies then use the received payments to purchase and ship\ncommodities. Items purchased can range from bulk commodities, luxury items, electronic\nitems as well as equipment. It is assessed that items used could be smuggled with other\nnon-suspicious shipments.\n\n\n-----\n\n**18 // 28** **Follow The Money**\n\n###### 3.3.5 Red flags\n\nRed flags relating to front companies that are involved in illicit financial activity are:\n\n     - Financial activity by a front company that has no relevance to its stated area of business\n\n     - Evidence of shared entities between front companies, including addresses, phones\nnumbers, managers and owners\n\n     - Front companies that lack obvious public activity or presence\n\n     - Business types cited for front companies involved in illicit activity are often textile,\ngarment, fishery, and seafood businesses.\n\nThese red flags could assist individuals in financial institutions working on areas of compliance\nlike due diligence and KYC screening to better detect front companies used for illicit purposes.\n\n###### 3.3.6 Facilitating jurisdictions\n\nRegulations and conditions that govern company registration and reporting\nrequirements in East Asia make the region an attractive place to do business, as well\nas vulnerable to being abused. In some of the region’s jurisdictions, a company’s\nregistered office must be there and it is permitted to share an office with their\ncompany secretary, but neither technically has to operate out of that address. This\nloophole, which would typically be considered as a red flag for money laundering\ninvestigators, underpins how nefarious activity is facilitated, since it has enabled the\ncreation of vast numbers of front companies. This explains why this hub has been\nattractive for heavily sanctioned jurisdictions seeking to access international trading\nmarkets and to facilitate money laundering.\n\nEast Asia can also serve as an effective gateway that offers sanctioned jurisdictions\naccess to US Dollars, via clearing services offered from some jurisdictions, potentially\nproviding a route that might enable oversight for payments between banks using\nUS Dollars to be circumvented.\n\n##### “The East Asian international financial hub has company formation and\n###### 3.3.7 Financial transaction recipients\n##### registration rules that we think need to be stronger…It is important it has mechanisms and regulations prohibiting activities that facilitate financial transactions with a FATF high risk jurisdiction.”\n\n U.S. Treasury’s Under Secretary for Terrorism and Financial Intelligence\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n\n**19 // 28**\n\n\nOut of all attempted heists attributed to the Lazarus Group, a subset of cases showed successful\nfraudulent transactions. The graph below shows the locations of the beneficiary banks in successful cases\nin 2018. The majority of transfers are sent to East Asia, where mule accounts are accessed. The following\ndetails regions of recipient institutions in 2018, based on SWIFT data[6].\n\n##### Asia-Pacific\n\n Europe - Non-Euro\n\n North America\n\n Africa\n\n###### 3.4 Integration\n\nThe means and methods by which cyber-criminals choose to convert stolen funds into an usable end product or\nasset can be a useful barometer of the strategic professionalism and experience of the cyber-attack group. It can\nalso help the process through which law enforcement agencies might close in on the group.\n\n###### 3.4.1 Cash-out conundrum\n\nThe cash out process opted for by cyber-criminals (including those involved in precursor\nsteps, money-mules, operating front companies, etc.) can reveal a strong correlation\nbetween the extravagant ways stolen funds are spent, and the professionalism of the\ncriminal. Operations that were early in a cyber-criminal’s history or were a one-off\noccurrence reveal an immediacy in how stolen funds are used – be it to clear a pressing\ndebt or for materialistic acquisition. Such suspicious behaviour could be the first clue in\nlinking them to the heist, which could ultimately start a trail that leads to members of\nthe cyber-group being identified.\n\n**6** https://www.virusbulletin.com/conference/vb2019/abstracts/art-cashout-evolution-attacks-payment-systems\n\n\n-----\n\n**20 // 28** **Follow The Money**\n\n###### 3.4.2 Integration of funds: cyber-criminals\n\nSome cyber-attack groups have been seen to make many extravagant purchases,\npossibly borne out of inexperience, as it draws the attention of law enforcement agencies\nand often leads to the arrest of the cyber-criminals. An inability to use the funds more\nstrategically with less ostentatious purchases is often their undoing. In other cases, the\nmethods chosen to cash-out the proceeds of a cyber-heist illustrate greater experience\nand a strategic approach driven by wanting to maintain a low profile. Property and\njewellery are investments that are likely to hold their value and potentially less likely to\nattract the attention of law enforcement.\n\n###### 3.4.3 Integration of funds: nation state actors\n\nThe independence and freedoms enjoyed by criminal cyber-groups are not shared by\nnation state cyber-groups. Far from their actions leading to materialistic acquisition and\npersonal possessions, the purpose of these cyber actors is to fulfil the demands and\nwishes of the regime.\n\n###### 3.4.4 Reinvesting in criminality\n\nAs a final stage of money laundering, cyber-criminals might seek to integrate the\nproceeds of a cyber-heist by reinvesting in crime, especially in the illegal drugs market.\nOver a third of organised crime groups in Europe, including cyber-criminals, are\ndirectly involved in the production or trafficking of illegal drugs. Cyber-criminals have\nbeen known to operate websites, which facilitate the sale of illegal drugs, firearms,\nmalicious software, hacking tools, stolen financial information, payment cards and other\nillegal counterfeit goods on a number of dark web marketplaces. In some instances,\nthis activity can lead to kickback payments in bitcoin that is equivalent to several\nmillion USD$.\n\n###### 3.4.5 Cryptocurrency and its growing appeal\n\nIdentified cases of laundering through cryptocurrencies remain relatively small\ncompared to the volumes of cash laundered through traditional methods. However,\nin one major case, a significant cyber-crime group is estimated to have converted\nstolen funds obtained from ATM cashouts into cryptocurrency. The raft of alternative\ncryptocurrencies that offer greater anonymity, as well as services like mixers and\ntumblers that help obscure the source of funds by blending potentially identifiable\ncryptocurrency funds with large amounts of other funds, could boost the appeal of\ncryptocurrency for nefarious purposes.\n\n\n-----\n\n**baesystems.com/SWIFT**\n\nIn one case that resulted in arrest and prosecution, authorities found 15,000\nbitcoins valued at USD$109 million, two sports cars and jewellery worth\nUSD$557,000 at the house of the group leader. The group was found to operate\nin a truly international manner: the bitcoin farm where the group mined bitcoin\nin order to launder the stolen funds from the heists was located in an industrial\nbuilding in East Asia, while many of the group arrested originated from Eastern\nEurope and the leader enjoyed the benefits of the stolen funds in Western Europe.\n\nFor heavily sanctioned territories, like a FATF high risk jurisdiction whose modus\noperandi focusses on raising funds with minimal associated risk, cryptocurrency\noffers a different income stream to targeting banks and financial institutions. It\nhas been shown how the Lazarus Group have harnessed East Asian facilitators[7]\nin order to launder funds after a heist at a cryptocurrency exchange, using\ntechniques that are similar to that described for heists from banks. The following\nsummarises the process from the point of execution of the cyber heist:\n\n     - Lazarus Group steal funds in cryptocurrency from an exchange and stolen\ncryptocurrency is sent to multiple exchanges as a layering technique.\n\n     - East Asian facilitators, working on behalf of the Lazarus Group and the\nregime, receive a portion of the stolen funds.\n\n     - The East Asian facilitators transfer the cryptocurrency across addresses they\nhold, in order to further obfuscate the origin of the funds.\n\n     - East Asian facilitators move a portion of the received funds through newly\nadded bank accounts that are linked to their exchange account – this enables\nthe conversion from cryptocurrency into fiat currency. Other stolen funds\nmight be transferred in Bitcoin into prepaid gift cards, which can be used at\nother exchanges to purchase additional Bitcoin.\n\nFurther insight into the money laundering methods used by the Lazarus Group\nis offered by activity after a cyber-theft at a cryptocurrency exchange in June\n2018[8]. This resulted in the theft of USD$30 million in various crypto-assets.\nSubsequently, almost 2,000 Bitcoin was moved into a cryptocurrency exchange\nin Eastern Europe, over a 4 day period, involving 68 transactions. It is assessed\nthat such a painstaking, strategic pattern of transactions is consistent with a desire\nto circumvent an exchange’s anti money-laundering (AML) controls, including red\nflags associated with transaction limits.\n\n**7 https://home.treasury.gov/news/press-releases/sm924**\n\n\n**21 // 28**\n\n\n-----\n\n**22 // 28** **Follow The Money**\n\n###### 3.4.6 Prepaid cryptocurrency cards\n\n**Cyber-criminals might seek to use cryptocurrency as a method for obfuscating and**\n**laundering the funds stolen during a cyber-heist, before making various purchases in**\n**order to integrate the funds. In this instance, cyber-criminals might launder the stolen**\n**funds at a bitcoin farm, before using financial platforms to load prepaid cards with**\n**bitcoin. Prepaid cryptocurrency cards can facilitate the reversion of cryptocurrency**\n**back into fiat currency in small amounts. This technique is enabled by a loophole**\n**so when the original financial institution issues the card, it does so in conjunction**\n**with the card issuer’s partner – this partner company receive and convert the funds**\n**from cryptocurrency into fiat currency. The stolen money from several cyber-heists**\n**has in some cases been seen to be laundered via cryptocurrencies, using prepaid**\n**cards that are linked to cryptocurrency wallets. Financial platforms in Europe and**\n**the UK have been used to load prepaid cards with bitcoin, which were subsequently**\n**used to purchase jewellery, cars and property with stolen funds – those assets may**\n**sometimes then be subsequently sold, as a further money laundering step.**\n\n###### 3.4.7 Converting cryptocurrency into tangible assets\n\n**An emergence of online marketplaces could offer effective methods for converting**\n**cryptocurrencies into tangible assets that can be held anonymously, or be sold as**\n**an extra step of laundering the proceeds of a cyber-heist. There are dedicated sites**\n**that facilitate the purchase of high-end land and property assets across the world,**\n**including luxury penthouses and tropical islands, as well as watches, jewellery,**\n**gold bars, and fine art. The concern for the financial system is that these digital**\n**transactions are conducted in a peer-to-peer manner that circumvents the checks and**\n**processes by banks, and often require only an e-mail address to make the purchase.**\n**This means that funds used to make a purchase that have been acquired by criminal**\n**means can be kept concealed.**\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n\n**23 // 28**\n\n\n### 4. Mitigation of money laundering risks\n\n###### 4.1 Information sharing technologies\n\nA central initiative in empowering banks to be better able to detect illicit activity refers to them\nhaving more visibility of a greater pool of data. This is not only with regards to enhancing\npublic-private sharing initiatives that foster better timely exchanges between financial\ninstitutions and law enforcement agencies, but also between financial institutions. In 2017,\nSWIFT created a global information sharing initiative, establishing a dedicated Customer\nSecurity Intelligence (CSI) team to investigate cyber incidents experienced by its customers and\nintroduced a ‘SWIFT ISAC’ information sharing portal to share threat intelligence across the\nSWIFT member community.\n\nWithout amendments to legal and regulatory frameworks to enable banks to embrace\nadvances in technology and data science to facilitate the safe sharing of AML information,\nidentifying illicit behaviour will remain in their blind-spot until it’s too late. The development of\npublic-private partnerships to aid in the sharing of information between financial institutions\nand law enforcement has been mainly successful. There are also many technologies for\nenhancing information sharing between banks, including harnessing machine learning to\nenrich and make transaction and account monitoring programs more powerful and efficient.\nOne approach that has been investigated by several banks is the use of Privacy Enhancing\nTechnology, including homomorphic encryption, as a method of allowing queries to be run\nby one organisation on encrypted or open data sets held by other organisations in a privacyenhancing manner to protect the nature of the queries being made.\n\n###### 4.2 Augmented sharing of risk factors pertaining to FATF high risk jurisdiction\n\nA FATF high risk jurisdiction which conducts illicit practises via front companies in East Asia, in\norder to evade sanctions and launder monies, has been the subject of thorough investigations.\nHowever, there is a need to distil and cascade the key findings from such investigations across\nthe international financial system. This will enable institutions to be more agile in identifying\ntransactions that might relate to nefarious activity linked to a FATF high risk jurisdiction and trigger\nthe need for enhanced due diligence. These refer to the presence of front companies in East Asia\nand the associated red flags that should alert suspicion. And given the activity of some diplomats\nfrom a FATF high risk jurisdiction to use accounts in the names of family members to evade\nsanctions and assist money laundering practises, these names could be shared with financial\ninstitutions to screen against as part of KYC and enhanced due diligence processes, as long as it is\npermitted by data protection and legal frameworks in various jurisdictions.\n\nSimilarly, augmented sharing of the red flags / situational circumstances that led to the\nsuccessful arrest of individuals involved in the laundering stages of a cyber-heist could greatly\nincrease awareness and agility in financial institutions and law enforcement agencies across\nvarious jurisdictions, which could ultimately lead to a reduction in vulnerabilities. Standard setting\norganisations as well as regional Fraud Intelligence Units could be effective conduits for such risk\n\n\n-----\n\n###### 4.3 Money-Mule initiatives\n\nThe essential role of the money-mule in facilitating successful cyber-heists\nand enabling criminals to separate themselves from the fraud and the\nmoney laundering stages makes it an obvious focus area for risk mitigating\ninitiatives. Numerous government, policing and industry initiatives have\nbeen launched, including:\n\n- A series of coordinated actions by Europol’s Cybercrime Centre (EC3),\nthe Joint Cybercrime Action Taskforce (J-CAT), Eurojust, and the\nEuropean Banking Federation have supported the European Moneymule Action initiative.\n\n- Cifas, the UK’s fraud prevention service have launched a joint\ncampaign with Financial Fraud Action UK (FFA UK), which fights\nfinancial fraud for the UK payments industry, called the Don’t Be\nFooled campaign. This aims to deter young people – in particular\nstudents – from becoming money-mules.\n\n- In December 2019, the U.S. DOJ and federal, state and international\nlaw enforcement partners announced a concentrated effort across\nthe country and around the world to halt money-mule activity and\nshut down the enterprises that exploit the most vulnerable in society.\nThe initiative aims to end the conduct of money-mules, as well as\nexecute search warrants to secure evidence from money-mules who\nknowingly aided and abetted fraud schemes.\n\nThe success of funds-in-flight monitoring systems such as the Mule\nInsights Tactical Solution[9], that looks to augment the tracing of funds\nthat are moved through the financial system, as well as initiatives like the\nEuropean Money Mule Action that aims to identify and arrest mules, as\nwell as engage with those most vulnerable to becoming a mule will be\nvital in preventing and deterring their viability. However, these initiatives\nwill not address the risk posed by the rogue insider, who opens a bank\naccount for the benefit of a cyber-criminal using a fake identity. This risk\nremains and is dependent on local regulators ensuring standards are\nmaintained across financial institutions, as well as individual financial\ninstitutions regularly checking the integrity of employees’ work and\npreventing accounts being set-up that are able to evade proper KYC\nprocesses and due-diligence screening.\n\n**9 http://www.fasterpayments.org.uk/press-release/new-anti-money-laundering-**\n\n\n**24 // 28** **Follow The Money**\n\n\n-----\n\n**baesystems.com/SWIFT**\n\n\n**25 // 28**\n\n\n###### 4.4  Compliance and reporting enhancements\n\nThere has been a tendency for cyber-heists to occur in jurisdictions where regulations are\nweaker, and there is a requirement for global standard setting bodies to do more in removing\nthe platform for potential corruption. It is encouraging that some regulators in East Asia\nhave set up a Fraud and Money Laundering Intelligence Taskforce in order to enhance the\ndetection, prevention and disruption of money laundering. Other necessary requirements\ninclude tightening customer due diligence measures across financial institutions, to include\nthe identification and verification of customers and the beneficial owner, as well as clarifying\nthe purpose and intended nature of the business relationship. Enhancing reporting channels\nso that institutions can register their suspicions of illicit activity to a trusted and competent\nauthority might also help to visualise networks of obfuscation and money laundering and\nidentify criminal activity.\n\n###### 4.5 Insufficient cyber security\n\nA pervasive issue across financial institutions is a reliance on legacy systems\nand processes. Often they have been spliced together through mergers,\nleaving them vulnerable to cyber-threat actors. Some cyber-security experts\nbelieve some banks are not investing smartly in maintaining systems and\nprocesses. Instead, they tend to focus on costly, complex, perimeter and\ndevice endpoint solutions, rather than focusing on investing in data centric\nsecurity around main business assets and detecting abuse and intrusion\nby looking at the data and application layer. Financial institutions will\ncontinue to be vulnerable if they fail to identify and remediate network and\napplication vulnerabilities before criminals have a chance to exploit them.\nSimilarly, regular and updated staff awareness courses that help employees\nunderstand and spot risks relating to spear-phishing are simple initiatives that\ncould pay dividends. For their part, augmented communication by regulators\nof usable cyber threat information that addresses security incident reports\nand systemic deficiencies could bolster cyber-security awareness across the\nfinancial sector.\n\n##### “For too long, cybercriminals have exploited an international divergence in policy and legislation. I think we’re now starting to see people coming together and understanding how to pool investigations together.”\n\n Head of Europol’s European Cybercrime Centre\n\n\n-----\n\n**26 // 28** **Follow The Money**\n\n### 5. Conclusion\n\nLarge-scale cyber heist attempts are expected to continue and to evolve – the attackers are focused on going\nafter large-scale payouts and will continue to mount attacks to achieve their aims. In addition, the desire to\ndisrupt and destabilise the financial system, as opposed to just stealing funds should not be overlooked as an\nongoing risk. Whereas many financial institutions are likely to be able to recover from just a financial theft, the\ndistraction and destructive components of some techniques deployed by cyber-actors during a cyber heist are\nlikely to have far greater operational impact. This can cost more to correct, as well as lead to a prolonged period\nof downtime for the financial institution, significantly impacting their customers and the institution’s reputation.\n\nMany cyber heists will continue to be detected and stopped, especially as financial institutions continue to\nimprove their controls. However, financial institutions also need to ensure they don’t become complacent. Threat\nactors have shown they will persist to seek to find ways around controls, including collaborating between groups\nwhere combining their skills will provide the desired reward for each threat actor.\n\nUltimately, some large-scale cyber heist attacks will unfortunately continue to be successful. Therefore, as\nmoney laundering is essential to a threat group realising the benefits of a successful large-scale cyber heist, a\nfocus on seeking to disrupt criminal activity throughout the money laundering process should continue.\n\nThreat groups will continue to collaborate throughout the money laundering lifecycle, leveraging the global\ncriminal skillsets available and the willingness of many people to be tempted by the lure of an apparent quick\nand easy payday. Particular focus therefore should apply to the money-muling activities and also to the\nuse of front companies. Collaboration will be key in these areas, both inter-organisational, within jurisdictions\nand internationally. In addition, awareness of new money laundering techniques, such as those involving\ncryptocurrency, will be key to staying ahead of the challenge of reducing the opportunities for threat groups to\nbenefit from committing high-value cyber heists.\n\n\n-----\n\n**baesystems.com/SWIFT** **27 // 28**\n\n#### The role of the money-mule, in all of its guises can be seen as essential in\n# breaking the chain\n#### between the initial fraud and laundering the stolen funds.\n\n\n#### The role of the money-mule, in all of its guises can be seen as essential in\n# breaking the chain\n#### between the initial fraud and laundering the stolen funds.\n\n\n-----\n\n###### About BAE Systems Applied Intelligence\n\nAt BAE Systems Applied Intelligence, we help protect\nand enable organisations in the face of today’s digital\nthreats. With our track record for being the trusted partner\nof governments, we’re uniquely placed to help financial\nservices institutions counter economic crime and fraud.\n\nWe have a deep knowledge of the threat landscape and\nhelp over 200 financial institutions, including more than\na third of the global top 100 banks, to mitigate risk. Our\nleading fraud and financial crime management solutions,\ncombined with our experience and processes, help financial\ninstitutions play their role in foiling the criminal economy,\nwhile also embracing digital transformation.\n\nWe employ over 3,500 people across 17 countries in the\nAmericas, APAC, UK and EMEA.\n\n\nBAE Systems, Surrey Research Park,\nGuildford, Surrey, GU2 7RQ, UK\n\n\nE: learn@baesystems.com \u0007| W: baesystems.com/SWIFT\n\nlinkedin.com/company/baesystemsai\n\ntwitter.com/baesystems_ai\n\n**Copyright © BAE Systems plc 2020. All rights reserved.**\n\n**BAE SYSTEMS, the BAE SYSTEMS Logo and the product names referenced herein are trademarks of BAE**\n**Systems plc. BAE Systems Applied Intelligence Limited registered in England & Wales (No.1337451) with its**\n**registered office at Surrey Research Park, Guildford, England, GU2 7RQ. No part of this document may be**\n**copied, reproduced, adapted or redistributed in any form or by any means without the express prior written**\n\n\nGlobal Headquarters\nBAE Systems\nSurrey Research Park\nGuildford\nSurrey GU2 7RQ\nUnited Kingdom\nT: +44 (0) 1483 816000\n\nBAE Systems\n8000 Towers Crescent Drive\n13[th] Floor\nVienna, VA 22182\nUSA\nT: +1 720 696 9830\n\nBAE Systems\n19, Boulevard Malesherbes\n75008 Paris\nFrance\nT: +33 (0) 1 55 27 37 37\n\nBAE Systems\nMainzer Landstrasse 50\n60325 Frankfurt am Main\nGermany\nT: +49 (0) 69 244 330 040\n\nBAE Systems\nLevel 12\n20 Bridge Street\nSydney NSW 2000\nAustralia\nT: +612 9240 4600\n\nBAE Systems\n1 Raffles Place #42-01, Tower 1\nSingapore 048616\nSingapore\nT: +65 6499 5000\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/2020.09.07_Follow_the_Money/swift_bae_report_Follow-The%20Money.pdf"
    ],
    "report_names": [
        "swift_bae_report_Follow-The Money"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "679e335a-38a4-4db9-8fdf-a48c17a1f5e6",
            "created_at": "2023-01-06T13:46:38.820429Z",
            "updated_at": "2025-03-27T02:00:02.927526Z",
            "deleted_at": null,
            "main_name": "FASTCash",
            "aliases": [],
            "source_name": "MISPGALAXY:FASTCash",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1598367631,
    "ts_modification_date": 1598367700,
    "files": {
        "pdf": "https://archive.orkl.eu/8cd6e584044556e5548bdefff08e2cf2c9bb5ecf.pdf",
        "text": "https://archive.orkl.eu/8cd6e584044556e5548bdefff08e2cf2c9bb5ecf.txt",
        "img": "https://archive.orkl.eu/8cd6e584044556e5548bdefff08e2cf2c9bb5ecf.jpg"
    }
}