{
    "id": "57ff391e-c5b1-46c0-9ad2-2ba0024e1674",
    "created_at": "2023-01-12T15:09:50.026936Z",
    "updated_at": "2025-03-27T02:16:17.279874Z",
    "deleted_at": null,
    "sha1_hash": "75124c39ed46d38a452e47060693787caea52a18",
    "title": "2022-07-20 - Evacuation and Humanitarian Documents used to Spear Phish Ukrainian Entities",
    "authors": "",
    "file_creation_date": "2022-08-18T03:26:44Z",
    "file_modification_date": "2022-08-18T03:26:44Z",
    "file_size": 530130,
    "plain_text": "# Evacuation and Humanitarian Documents used to Spear Phish Ukrainian Entities\n\n**mandiant.com/resources/spear-phish-ukrainian-entities**\n\n## Foreword\n\nMandiant is publishing the following blog to provide insight and context on a sampling of malicious activity\ntargeting Ukrainian entities during the ongoing war. We are highlighting UNC1151 and suspected UNC2589\noperations leveraging phishing with malicious documents leading to malware infection chains. Indicators used in\n[these operations have been released by U.S. CYBERCOMMAND.](https://www.cybercom.mil/Media/News/Article/3098856/cyber-national-mission-force-discloses-iocs-from-ukrainian-networks/)\n\nUA CERT has also published on several of these operations. Links to UA CERT reports can be found throughout\nthis blog.\n\n## Threat Detail\n\nSince the start of the Russian invasion, public and private Ukrainian entities have been targeted by multiple\ncyber espionage groups. This blog goes into detail regarding two operations from UNC2589 and an operation\nfrom clusters likely related to UNC1151. While these groups have distinct sponsors and goals, the operations\ndetailed here are united by their use of lure documents about public safety to entice victims to open the spear\nphishing attachment.\n\nSpear phishes with themes that are urgent or timely can make a recipient more likely to open them and\ndocuments related to public safety and humanitarian emergencies are of particularly high interest to the\nresidents of Ukraine following the Russian invasion. These operations were designed to gain access to networks\n\n\n-----\n\nof interest, but we do not have insight into the planned follow on activities. The malware used in these intrusion\nattempts would enable a wide variety of operations and these groups have previously conducted espionage,\ninformation operations and disruptive attacks.\n\nThe intrusion attempts detailed below share a tactic, however they are the work of two separate cyber espionage\ngroups.\n\n**UNC1151 is a group that Mandiant assesses are sponsored by Belarus and have frequently used the**\naccess and information gained by their intrusions to support information operations tracked as\n“Ghostwriter.” Mandiant [released a blog last year detailing our assessments on UNC1151, and they have](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\ncontinued to be very active in targeting Ukraine since the start of the Russian invasion, paralleling\nBelarus’s government’s enablement of Russia’s invasion.\n**[UNC2589 is believed to act in support of Russian government interest and has been conducting extensive](https://www.mandiant.com/resources/russia-invasion-ukraine-retaliation)**\nespionage collection in Ukraine. Notably, we assess UNC2589 is behind the January 14 disruptive attacksth\non Ukrainian entitles with PAYWIPE (WHISPERGATE). Following the disruptive attack, UNC2589 has\nprimarily targeted Ukraine, but has also been active against NATO member states in North America and\nEurope.\n\nThe activity discussed below is only a small subset of the extensive cyber operations that have targeted Ukraine\nwith disruptive and espionage motivated operations.\n\n## Likely UNC2589 Operations\n\n### Actor Overview\n\nUNC2589 is a cluster of cyber espionage activity Mandiant has tracked since early 2021 and may have been\nactive as early as late 2020. Though UNC2589 has primarily targeted entities in Ukraine and Eastern Europe, it\nhas also actively targeted government and defense entities throughout Europe and North America. We believe\nUNC2589 acts in support of Russian government goals, but have not uncovered evidence to link it conclusively.\n\nUNC2589 uses spear phishing campaigns, which may be disguised as forwarded emails from both actorcontrolled and compromised legitimate accounts. Lure themes leveraged by UNC2589 include COVID-19, the\nwar in Ukraine, government related themes, regional themes, or even generic themes such as Bitcoin. Payloads\nfor the phishing operations include malicious macro documents, CPL downloaders, ZIP files, or other archives.\nUNC2589 has also used a variety of different infrastructure, including actor-controlled domains, IP addresses\nlocated mostly in Russia, and Discord channels.\n\nThough we track UNC2589 as a cluster of cyber espionage activity, we have attributed the January 14\ndestructive attack on Ukraine using PAYWIPE (WHISPERGATE) to UNC2589. We believe UNC2589 may be\ncapable of engaging in disruptive or destructive cyber operations in the future.\n\n### Malware Overview\n\n**GRIMPLANT is a backdoor written in GO which reaches out using Google RPC to a Base64-encoded and**\nAESCTS-encrypted C&C read from a command-line argument. GRIMPLANT conducts a system survey which it\nuploads to the C&C and can execute commands provided by the C&C on the victim’s device.\n\n**GRAPHSTEEL is an infostealer which appears to be a modified, weaponized version of the public Github project**\n[goLazagne. GRAPHSTEEL gathers a survey of the victim machine including browser credentials, enumerates](https://github.com/kerbyj/goLazagne/)\ndrives D – Z, and uploads files to the C&C.\n\n## Likely UNC2589 Campaign Leverages Evacuation-Themed Lure\n\n\n-----\n\n### Infection Vector\n\nMandiant analyzed a malicious document with an evacuation plan-themed lure, likely used by UNC2589 to target\nUkrainian entities in a phishing campaign in late February 2022. This sample is a packed SFX RAR that runs and\ninstalls an Arabic version of the RemoteUtils utility. Upon execution, the Remote Utilities utility reaches out to a\nC&C used in an earlier UNC2589 operation also targeting Ukraine\n\nFigure 1: SBU\n\n[alert on fake evacuation emails (Source)](https://www.facebook.com/SecurSerUkraine/posts/307784728115111)\nThe infection vector is currently uncertain, but we suspect the malicious files may have been delivered via\nphishing email. It is important to note that Remote Utilities comes in a UPX-packed SFX RAR from the vendor,\nand it does not appear the attackers changed the default. However, the attackers appear to have used several\nlayers of password-protected archives before dropping and executing the default UPX-packed SFX extractor with\na SFX RAR. The lure documents all reference an “evacuation plan” allegedly originating from the Ukrainian SBU.\n\n\n-----\n\nплан евакуації (затверджений сбу 28.02.2022 наказом № 009363677833).rar_pass_123.zip (MD5:\ncd8834da2cfb0285fa75decf6c67d049)\n\nPassword-protected ZIP file\nPassword: 123\nПлан евакуації (затверджений СБУ 28.02.2022 Наказом № 009363677833).rar (MD5:\n3cd599654aff2e432ae3390d33c64f5e)\n\nRAR containing RAR SFX and text file with RAR passwords\nкод доступу.txt (MD5: 144ccb808e2d2e1f0119ea2a8f7490bc)\n\nText file with RAR password\nPassword: 2267903645\n2b0338c9f3f46955cfd2dc97c02bd554 (application/x-rar) план евакуації (затверджений сбу 28.02.2022\nнаказом № 009363677833).part1.rar\n\nPassword-protected SFX RAR\nPassword: 2267903645\nContains: План евакуації (затверджений СБУ 28.02.2022 Наказом № 009363677833).exe (MD5:\nea47d88d73fecb1fad1e737f1b373d7f)\n97e16c0b770dbbe4fa94cebac92082b7 (application/x-rar) план евакуації (затверджений сбу 28.02.2022\nнаказом № 009363677833).part2.rar\n\nPassword-protected SFX RAR\nPassword: 2267903645\nContains: План евакуації (затверджений СБУ 28.02.2022 Наказом № 009363677833).exe (MD5:\nea47d88d73fecb1fad1e737f1b373d7f)\nПлан евакуації (затверджений СБУ 28.02.2022 Наказом № 009363677833).exe (MD5:\nea47d88d73fecb1fad1e737f1b373d7f)\n\nTranslation: Evacuation Plan (approved by SBU 28.02.2022 in order № 009363677833).exe\nUPX-packed SFX extractor; likely default for Remote Utilities\nUnpacked: MD5: a236cb7f2b0e34619039788de7f7760b\nC:\\Program Files (x86)\\Remote Utilities – Host\\ rutserv.exe (MD5: 2bb5d5aa07fa2c8e9874c117c8fa51d6)\n\nRemoteUtils utility\n\n### Execution\n\nUpon execution of the packed SFX RAR, it installs the Remote Utilities executable. The Remote Utilities\nexecutable reaches out to preconfigured C&Cs iteratively over TCP:\n\n111.90.151.182:5651\n111.90.151.182:8080\n111.90.151.182:5555\n111.90.151.182:4899\n\nRemote Utilities is not malicious by itself but can be used maliciously by threat actors. The utility can enable a\nthreat actor to:\n\nDownload and upload files to a C&C\nRemotely execute files\nSet persistence through a startup service\n\n### Persistence Method\n\nRemote Utilities allows attackers to set persistence through creating a startup service.\n\n## Likely UNC2589 Uses Wage and Anti-Virus Themed Lures\n\n\n-----\n\n### Infection Vector\n\nMandiant Intelligence discovered a likely UNC2589 related phishing campaign targeting Ukrainian entities with\nGRIMPLANT and GRAPHSTEEL malware on March 27, 2022. The Ukrainian CERT [previously reported on](https://cert.gov.ua/article/37704)\nUAC-0056, a cluster that aligns with what we track as UNC2589, using GRIMPLANT, GRAPHSTEEL, and\nBEACON malware against Ukrainian entities.\n\nThe malware was delivered via phishing email. The attacker used a compromised legitimate account from a\nrelated organization to send the phishing emails on March 27.\n\nThe phishing email contained an attached XLS document with macros.\n\nЗаборгованість по зарплаті.xls (MD5: da305627acf63792acb02afaf83d94d1)\n\nMachine translation from Ukrainian: Wage arrears\nTimestamp: 2022-03-21 09:37:30\nContains legitimate macros from ExcelVBA.ru, a company which creates benign Macros for Excel for\nlegitimate use\n\nThe macros in the document were designed by ExcelVBA.ru, a company that designs macros for business use.\nHowever, in this case the macro was used to drop a malicious payload onto the victim machine. The company’s\nwebsite makes the macros freely available, so we have no indication that they are tied to this activity or even\naware of it.\n\nBase-Update.exe (MD5: 06124da5b4d6ef31dbfd7a6094fc52a6)\n\nDownloader written in Go\nCompile time: 1970-01-01 00:00:00\nC&C: 194.31.98.124:443\n\nNote: The Go binary Base-Update.exe does not have symbols stripped. Symbols from the main Go module in\nthis project are called “elephant.”\n\n[Unlike the downloaders previously documented by UA CERT, Mandiant Threat Intelligence believes that these](https://cert.gov.ua/article/37704)\ndownloaders were likely altered by the threat actor to avoid detection. One of the new techniques utilized by the\nthreat actor was runtime decryption of certain strings.\n\nFigure 2: New downloader identified by Mandiant Threat Intelligence decrypting strings with custom key and\nXOR algorithm\n\n\n-----\n\nFigure 3: Original downloader generating the path for java-sdk.exe\n\n### Execution\n\nUpon execution of Base-Update.exe, it proceeds to download, Base64-decode, and execute another time\nstomped downloader written in Go from http://194.31.98.124:443/i with the arguments –a\n0CyCcrhI/6B5wKE8XLOd+w==:\n\n%TEMP%\\java-sdk.exe (MD5: 36ff9ec87c458d6d76b2afbd5120dfae)\n\nDownloader written in Go\nBase64 encoded - MD5: 2f14b3d5ab01568e2707925783f8eafe\nCompile time: 1970-01-01 00:00:00\nC&C: 194.31.98.124:443\n\nJava-sdk.exe sets persistence for itself via setting a Run registry key. It then proceeds to download, decode, and\nexecute two additional Base64-encoded files, GRIMPLANT and GRAPHSTEEL.\n\noracle-java.exe (MD5: 4a5de4784a6005aa8a19fb0889f1947a)\n\nGRIMPLANT backdoor\nBase64-encoded – MD5: 2a843511cdb8f5604cb3fafe244ef5f2\nCompile time: 1970-01-01 00:00:00\nC&C: http://194.31.98.124:80\nmicrosoft-cortana.exe (MD5: 6b413beb61e46241481f556bb5cdb69c)\n\nGRAPHSTEEL infostealer\nBase64-encoded – MD5: a0c4ddf9c6f95d7046be8a2e0f875935\nCompile time: 2022-03-20 14:24:42\nC&C: ws://194.31.98.124:443/c\n\n### GRIMPLANT Execution\n\nUpon execution of GRIMPLANT, it reads its configured C&C from the command line. The configured C&C is\nBase64-encoded and AESCTS-encrypted and results in GRIMPLANT communicating to 194.31.98.124.\n\nGRIMPLANT conducts a basic system survey, querying the following:\n\nComputer name\nUsername\nHome directory\nIP address (via Ipify API)\nHostname\nOS\n\n\n-----\n\nNumber of CPUs\n\nGRIMPLANT then uploads the system survey to the C&C. Note that GRIMPLANT communicates with the C&C\nover Google RPC using TLS. GRIMPLANT handles PowerShell commands it receives from the C&C, sending\nthe result of the command back to the C&C. Unlike GRAPHSTEEL, GRIMPLANT does not use an added layer of\nencryption to its C&C communications.\n\n### GRAPHSTEEL Execution\n\nUpon execution of GRAPHSTEEL, it conducts a system survey of the host and user information and reaches out\nto the ipify API to determine the IP address. It then AESCTS encrypts and uploads the surveyed victim\ninformation to the C&C. When it gets a response from the C&C, GRAPHSTEEL proceeds to harvest browser\ncredentials, including:\n\nChrome\nInternet Explorer\nFireFox\nThunderbird\n\nGRAPHSTEEL also attempts to collect mail data from Mozilla Thunderbird, extract data from Filezilla, find\nunprotected SSH keys on the target machine, query Putty to access the public key, and read any MobaXterm\nconfig.\n\nAfter collecting this information, it encrypts and uploads the information to the C&C. GRAPHSTEEL then\nenumerates drives D-Z and the files within each drive. GRAPHSTEEL reads the content of each unique file and\nuploads those to the C&C.\n\nNote: the GRAPHSTEEL project also does not have symbols stripped and the main Go package is called\n“elephant.”\n\n### Persistence Method\n\nThe malware maintains its persistence on the victim’s system by setting the following Run registry key:\n\n**Key: HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\java-sdk**\n\n**Value: %TEMP%\\java-sdk.exe -a**\n\n### Related Samples\n\n[This activity is related to activity previously reported on by UA CERT on a campaign leveraging GRIMPLANT](https://cert.gov.ua/article/37704)\nand GRAPHSTEEL malware. Notably, the two campaigns share malware overlaps and filename overlaps, but\nlack infrastructure overlaps. In addition, unlike other UNC2589 campaigns including the one reported on by UA\nCERT, this new operation does not use Discord to host malware.\n\nInstruction on anti-virus protection.doc (MD5: ca9290709843584aecbd6564fb978bd6)\n\nLure document\nC&C: https://forkscenter.fr/BitdefenderWindowsUpdatePackage.exe\nUser guide.doc (MD5: cf204319f7397a6a31ecf76c9531a549)\n\nLure document\nC&C: https://forkscenter.fr/BitdefenderWindowsUpdatePackage.exe\nbitdefenderwindowsupdatepackage.exe (MD5: b8b7a10dcc0dad157191620b5d4e5312)\n\nDropper for alt.exe\nDownloaded from https://forkscenter.fr/BitdefenderWindowsUpdatePackage.exe\n\n\n-----\n\nalt.exe (MD5: 2fdf9f3a25e039a41e743e19550d4040)\n\nThemida packed downloader\nC&Cs:\n\nhttps://cdn.discordapp.com/attachments/947916997713358890/949948174636830761/one.exe\nhttps://cdn.discordapp.com/attachments/947916997713358890/949948174838165524/dropper.exe\none.exe (MD5: aa5e8268e741346c76ebfd1f27941a14)\n\nDownloader and BEACON loader\nDownloads wisw.exe from https://forkscenter.fr/Sdghrt_umrj6/wisw.exe\nBEACON Shellcode MD5: e56555162c559a55021b879147b0791f\n\nC&Cs:\n\nhttps://nirsoft.me/nEDFzTtoCbUfp9BtSZlaq6ql8v6yYb/avp/amznussraps/\nhttps://nirsoft.me/s/2MYmbwpSJLZRAtXRgNTAUjJSH6SSoicLPIrQl/field-keywords/\nwisw.exe (MD5: 9ad4a2dfd4cb49ef55f2acd320659b83)\n\nThemida packed downloader\nDownloaded from https://forkscenter.fr/Sdghrt_umrj6/wisw.exe\nC&C:\nhttps://cdn.discordapp.com/attachments/947916997713358890/949978571680673802/cesdf.exe\ndropper.exe (MD5: 15c525b74b7251cfa1f7c471975f3f95)\n\nGo downloader\nC&C: https://45.84.0.116/i\njava-sdk.exe (MD5: c8bf238641621212901517570e96fae7)\n\nGo downloader\nDownloaded as Base64 encoded text from https://45.84.0.116/i\nC&Cs:\n\nhttp://45.84.0.116:443/m\nhttp://45.84.0.116:443/p\noracle-java.exe (MD5: 4f11abdb96be36e3806bada5b8b2b8f8)\n\nGRIMPLANT malware\nDownloaded as Base64 encoded text from http://45.84.0.116:443/m\nmicrosoft-cortana.exe (MD5: 9ea3aaaeb15a074cd617ee1dfdda2c26)\n\nGRAPHSTEEL malware\n\nDownloaded as Base64 encoded text from http://45.84.0.116:443/p\n\n## UNC1151 Operations\n\n### Actor Overview\n\nUNC1151 is a cluster of cyber espionage activity which has links to the Belarusian government. (Please see our\n[previously published blog on UNC1151 for additional details). UNC1151 also provides technical support to the](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\nGhostwriter information operations campaign. Though we cannot rule out Russian contributions to either\nUNC1151 or Ghostwriter activities, we have not yet identified evidence of any collaboration between Russian\nAPTs and UNC1151.\n\nUNC1151 primarily targets government and media entities focusing on Ukraine, Lithuania, Latvia, Poland, and\nGermany. UNC1151 has been active in targeting primarily Ukraine and Poland since the Russian invasion of\nUkraine in February.\n\n### Malware Overview\n\n\n-----\n\n**BEACON is a backdoor written in C/C++ that is part of the Cobalt Strike framework. Supported backdoor**\ncommands include shell command execution, file transfer, file execution, and file management. BEACON can\nalso capture keystrokes and screenshots as well as act as a proxy server. BEACON may also be tasked with\nharvesting system credentials, port scanning, and enumerating systems on a network. BEACON communicates\nwith a C&C server via HTTP or DNS.\n\n**[MICROBACKDOOR is a client backdoor and server-side tool which has been available on GitHub since May](https://github.com/Cr4sh/MicroBackdoor)**\n2021. MICROBACKDOOR was developed by ‘Cr4sh’ (aka. Dmytro Oleksiuk), who has also developed other\nnotable malware used by Russian APTs including BlackEnergy. MICROBACKDOOR can upload and download\nfiles, execute commands, update itself, and take screenshots. It also supports HTTP, Socks4 and Socks5\nproxies to route traffic.\n\nNote: the version of MICROBACKDOOR used by UNC1151 in this report has been modified by the actor to\ninclude a screenshot functionality. Screenshot functionality is not present in the version of MICROBACKDOOR\navailable on Github.\n\n## UNC1151 Uses Sheltering-Themed Lures\n\n### Infection Vector\n\nIn early March 2022, Mandiant Threat Intelligence discovered new activity targeting Ukrainian entities using\n[MICROBACKDOOR and a lure titled “що робити? пiд час артилерiйских обстрiлiв системами залповова](https://advantage.mandiant.com/malware/malware--37efb574-f1a7-537a-ace2-ce96282e1d51)\nвогню” (Translation: “What to do? During artillery shelling by volley fire systems”). MICROBACKDOOR is a client\n[backdoor and server side (command and control) tool which has been available on GitHub since May 2021 and](https://github.com/Cr4sh/MicroBackdoor)\ndeveloped by ‘Cr4sh’ (aka Dmytro Oleksiuk).\n\nTo deliver the payload, the actor used a ZIP containing a CHM-file.\n\nдовідка.zip (MD5: e34d6387d3ab063b0d926ac1fca8c4c4)\n\nTranslation: Certificate.zip\ndovidka.chm (MD5: 2556a9e1d5e9874171f51620e5c5e09a)\n\nContains obfuscated VBS\n\n### Execution\n\nIf the desktop.ini does not exist in the path C:\\Users\\Public\\Favorites\\desktop.ini (indicating that the backdoor is\nnot yet installed), the VBS code within dovidka.chm drops the decoded next payload to C:\\Users\\Public\\ignit.vbs.\nThe code then creates the folder C:\\Users\\Public\\Favorites and executes C:\\Users\\Public\\ignit.vbs.\n\nC:\\Users\\Public\\ignit.vbs (MD5: bd65d0d59f6127b28f0af8a7f2619588)\n\nMalicious VBS launcher\n\n\n-----\n\nFigure 4: Lure Image\nThe VBS file ignit.vbs mentioned in figure 4, drops three files:\n\n%STARTUP%\\Windows Prefetch.lNk (MD5: 8fc42ee971ab296f921bb05633f6b4a6)\n\nLNK used to achieve persistence for the payload via the Startup folder\nNote: the unusual capitalization is hardcoded\nC:\\Users\\Public\\Favorites\\desktop.ini (MD5: a9dcaf1c709f96bc125c8d1262bac4b6)\n\nHelper file to launch the payload, core.dll\nC:\\Users\\Public\\Libraries\\core.dll (MD5: d2a795af12e937eb8a89d470a96f15a5)\n\nFollow-on payload\nCompile Timestamp: 2022-01-31T15:00:46.000+0000\nLoads in memory:\n\n047fbbb380cbf9cd263c482b70ddb26f\n\nEither via the LNK after startup, or directly via the VBS, the command line “wscript.exe //B //E:vbs\nC:\\Users\\Public\\Favorites\\desktop.ini” is executed, referencing the helper file dropped by the sample mentioned\nabove. Finally, the file C:\\Users\\Public\\ignit.vbs is deleted after execution.\n\n“desktop.ini” is used to invoke regasm.exe to launch the payload found in C:\\Users\\Public\\Libraries\\core.dll as a\nhidden window without returning any error codes.\n\nThe entire contents of this file are:\n\n_Set fso = CreateObject(\"Scripting.FileSystemObject\")_\n\n_execPath = \"C:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\regasm.exe /U \" &_\n_\"C:\\Users\\Public\\Libraries\\core.dll\"_\n\n_Set shell = CreateObject(\"Wscript.Shell\")_\n\n_shell.run(execPath), 0, false_\n\nThe file C:\\Users\\Public\\Libraries\\core.dll is a malicious .NET file packed with an unknown obfuscator which may\nbe related to Confuser. This samples drops an additional malicious payload into memory and executes it.\n\n\n-----\n\nclient.dll (MD5:047fbbb380cbf9cd263c482b70ddb26f)\n\nDescription: MICROBACKDOOR backdoor\nC&C: xbeta.online:8443\n\nThe payload (MD5: 047fbbb380cbf9cd263c482b70ddb26f) is a sample of MICROBACKDOOR. This backdoor\nmalware has capabilities such as manipulating files (list/get/put), execute commands, can automatically update\nitself, and take screenshots. This family also supports HTTP, Socks4 and Socks5 proxies to route traffic.\n\n[MICROBACKDOOR is an open source project written by cr4sh, aka Dmytro Oleksiuk. As with other](https://github.com/Cr4sh/MicroBackdoor)\nMICROBACKDOOR samples previously used by UNC1151, this sample appears to have had the screenshot\nfunctionality added.\n\nOnce run, the MICROBACKDOOR payload would reach out to ‘xbeta.online:8443’. It would transmit a packet of\ndata every 10 seconds.\n\n## Appendix\n\n### MITRE ATT&CK Framework\n\n UNC2589\n\nT1003: OS Credential Dumping\n\nT1027: Obfuscated Files or Information\n\nT1027.002: Software Packing\n\nT1055: Process Injection\n\nT1059: Command and Scripting Interpreter\n\nT1059.005: Visual Basic\n\nT1070.006: Timestomp\n\nT1071.001: Web Protocols\nT1082: System Information Discovery\n\nT1083: File and Directory Discovery\n\nT1114.001: Local Email Collection\n\nT1140: Deobfuscate/Decode Files or Information\n\nT1497.001: System Checks\n\nT1547.001: Registry Run Keys / Startup Folder\n\nT1552.001: Credentials In Files\nT1555.003: Credentials from Web Browsers\n\nT1560: Archive Collected Data\n\nT1560.001: Archive via Utility\n\nT1566.001: Spearphishing Attachment\n\nT1573.001: Symmetric Cryptography\n\nT1573.002: Asymmetric Cryptography\n\nT1622: Debugger Evasion\n\n### UNC1151\n\nT1012: Query Registry\n\nT1016: System Network Configuration Discovery\n\nT1027: Obfuscated Files or Information\n\nT1033: System Owner/User Discovery\n\nT1055: Process Injection\n\n\n-----\n\nT1059: Command and Scripting Interpreter\nT1070.006: Timestomp\n\nT1071.001: Web Protocols\n\nT1082: System Information Discovery\n\nT1083: File and Directory Discovery\n\nT1087: Account Discovery\n\nT1095: Non-Application Layer Protocol\n\nT1140: Deobfuscate/Decode Files or Information\n\nT1547.009: Shortcut Modification\n\nT1573.002: Asymmetric Cryptography\n\nT1620: Reflective Code Loading\n\nT1622: Debugger Evasion\n\n## Detection Rules\n\nrule MTI_HUNTING_Crypto_GRIMPLANT_GRAPHSTEEL\n\n{\nmeta:\n\nauthor = \"Mandiant Threat Intelligence\"\n\ndescr = \"Find the crypto key for GRIMPLANT/GRAPHSTEEL C2 decryption\"\n\ndisclaimer = \"This rule is meant for hunting and is not tested to run in a production environment.\"\n\nstrings:\n\n$ = {f1 d2 19 60 d8 eb 2f dd f2 53 8d 29 a5 fd 50 b5}\n\n$ = {f6 4a 3f 9b f0 6f 2a 3c 4c 95 04 38 c9 a7 f7 8e}\n\n$ = \" ciphertext is not large enough. It is less that one block size. Blocksize:%v; Ciphertext:%v\"\n\ncondition:\n\nall of them\n\n}\nrule MTI_Hunt_APT_Modified_MICROBACKDOOR_Strings\n\n{\nmeta:\n\ndescription = \"Detects strings found in modified MICROBACKDOOR samples with screenshot capability\"\n\ndisclaimer = \"This rule is meant for hunting and is not tested to run in a production environment\"\n\nstrings:\n\n$a = \"ERROR: Unknown command\"\n$b = \"ProxyServer\"\n\n$c = \"screenshot\"\n\n$d = \"uninst\"\n\n$e = \"shell\"\n\n$f = \"client.dll\"\n\n$g = \"Timeout occured\"\n\ncondition:\n\nall of them\n\n}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-20 - Evacuation and Humanitarian Documents used to Spear Phish Ukrainian Entities.pdf"
    ],
    "report_names": [
        "2022-07-20 - Evacuation and Humanitarian Documents used to Spear Phish Ukrainian Entities.pdf"
    ],
    "threat_actors": [
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "03a6f362-cbab-4ce9-925d-306b8c937bf1",
            "created_at": "2024-11-01T02:00:52.635907Z",
            "updated_at": "2025-03-27T02:00:55.474243Z",
            "deleted_at": null,
            "main_name": "Saint Bear",
            "aliases": [
                "Saint Bear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "Lorec53"
            ],
            "source_name": "MITRE:Saint Bear",
            "tools": [
                "OutSteel",
                "Saint Bot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536190,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1660793204,
    "ts_modification_date": 1660793204,
    "files": {
        "pdf": "https://archive.orkl.eu/75124c39ed46d38a452e47060693787caea52a18.pdf",
        "text": "https://archive.orkl.eu/75124c39ed46d38a452e47060693787caea52a18.txt",
        "img": "https://archive.orkl.eu/75124c39ed46d38a452e47060693787caea52a18.jpg"
    }
}