{
    "id": "58184148-da2a-4350-be9d-ac6edd842195",
    "created_at": "2023-01-12T15:02:51.938102Z",
    "updated_at": "2025-03-27T02:16:09.296036Z",
    "deleted_at": null,
    "sha1_hash": "755569c59a99f1de2550462435799f25e8c42d34",
    "title": "2020-01-15 - APT-C-36 recent activity analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T16:09:55Z",
    "file_modification_date": "2022-05-28T16:09:55Z",
    "file_size": 346015,
    "plain_text": "# APT-C-36 recent activity analysis\n\n**lab52.io/blog/apt-c-36-recent-activity-analysis/**\n\nFrom Lab52 we have been tracking during the last months the activity of the group APT-C36. This group was named and publicly introduced by the Company 360 [1] last year. In this\narticle is highlighted as the main objective of the group, the companies located in Colombia.\nIf you don’t know APT-C-36, we recommend the article mentioned [1] for more information.\n\nIn July 2019 the company TrendMicro published an article related to another group [2] that\nalso seems to be focused on Colombia and some TTPs (Tactics, Techniques and\n**Procedures) overlap with APT-C-36 although TrendMicro indicates that they don’t consider**\nthis group as an advanced.\n\nLab52 has had access to different very recent spear-phishings and the following summary\ninformation has been obtained from the analysis of these mails:\n\nThis is a group that, as already mentioned in the articles [1] and [2], knows well the\nSpanish language.\nThey usually use different types of url shorteners in their mailings. The case of “cort.as”\nshortenner has caught our attention since it is a shortener from the Spanish newspaper\n“El Pais” that belongs to the “Prisa Group” very spread in Latin America.\nWe have also seen links to docs.google.com, mediafire and onedrive to download the\nsamples inside some malspam emails.\nTheir most popular malware is LimeRAT, although many others have been found as\nindicated in the reports. VJWorm has also been seen recently with different techniques\nfor exfiltration.\nIt has also been observed from some spear-phishings the exfiltration by Yopmail’s\nHTTPS webmail service. This coincides with the indications of TrendMicro\nThe most common dynamic domains seen are:\n\n1. duckdns.]org\n2. publicvm.]com\n3. linkpc.]net\n\nSince Lab52 does not have enough information to be able to say that everything analyzed is\na single group, it can only be said that these are different techniques used to attack a\ncountry.\n\nFrom this information, the infrastructure used by the attackers as command and control\nservers when executing the malware has been analyzed and the following graph has been\nobtained:\n\n\n-----\n\nThree sets (clusters) of ip addresses have been identified and each one has some\ncharacteristics:\n\n**_Cluster A has the following characteristics:_**\n\nAll its infrastructure is geolocated in Colombia. All the IPs correspond to Colombian\nISPs’ IPs. This is perhaps one of the most outstanding aspects.\nDomains are reused and the ip to which it points is changed.\nThis cluster only uses free “duckdns.org” domains.\n\n**_Cluster B has the following characteristics:_**\n\n\n-----\n\nIts infrastructure is located in Colombia, Costa Rica and Panama. The geolocated ip s\nin the United States correspond to domains that have been “sinkholed”. By obtaining\nmore information about the IPs, it can be seen how they are using a VPN service that\nallows having geolocalized IPs in Colombia, Costa Rica and Panama. The service is\ncalled “Powerhouse Management” (phmgmt[.]com). Therefore this cluster is not\ncompromising infrastructure of Colombian ISP clients, but is using this VPN service.\nThis cluster is reusing domains and changing ip addresses a lot. They have a very\nshort duration.\nThis cluster uses as SLD linkpc.net and publicvm.com.\nThis cluster coincides with part of the domains registered in the report of the Chinese\ncompany 360 on APT-C-36.\n\n**Cluster C has the following characteristics:**\n\nAll its infrastructure is geolocated in Colombia. All the IPs correspond to Colombian\nISPs’ IPs.\nIn this case many domains are used and few ip addresses.\nThis cluster uses free domains duckdns.org.\n\nAmong the domains used by these group/s we highlight the domain:\n\n**cobroserfinansa[.]com: This domain has solved more than 150 different ip’s (157**\nexactly when this report was made) where all of them have been located in Colombia.\n\nAnother outstanding aspect from the infrastructure point of view is that the ip’s located in\nColombia correspond with a high probability to ip’s of routers compromised by the attackers.\nLab52 hypothesis is that attackers compromise routers with default credentials and use them\nas a frontend for their real command and control server. This fact has not been verified by\nLab52, but has been observed as a common TTP for other groups. The routers seen, allow\nthe use of the iptables command so automation by attackers for redirection is simple.\n\n## Conclusions\n\nThe attackers know well the language of the attacked country, Spanish, so it could be\nconsidered Spanish-speaking countries as the main options of attacking countries. This\naspect has already been indicated in the other reports. From Lab52 we would reinforce\nthis hypothesis by the use of a shortener “cort.as”.\nThe emails are well written and are almost always related to financial matters,\nspecifically related to debt.\nCurrently, the attackers are not using malware developed by themselves and are using\npublic malware projects such as LimeRAT.\nAttackers are using high ports to communicate with command and control servers.\n\n\n-----\n\nAttackers are probably using multi-level command and control architectures to hide the\nmain command and control server. As a first level, they have used until the moment:\n\nVPN services where Colombia, Panama and Costa Rica exist as an outgoing ip\nRouters from ISP clients with default credentials or vulnerabilities. All these ISPs\nbelong to Colombia.\nAttackers use shorteners for links in emails. It is advisable to watch out for shortcuts\nbelonging to the newspaper “El Pais”.\nAnother option to the shorteners are links to file hosting services (google, mediafire,\ndropbox, etc.)\n\n[1] https://ti.360.net/blog/articles/apt-c-36-continuous-attacks-targeting-colombiangovernment-institutions-and-corporations-en/\n\n[2] http://blog.la.trendmicro.com/proyecto-rat-una-campana-de-spam-dirigida-a-entidadescolombianas-a-traves-del-servicio-de-correo-electronico-yopmail/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-15 - APT-C-36 recent activity analysis.pdf"
    ],
    "report_names": [
        "2020-01-15 - APT-C-36 recent activity analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "98b22fd7-bf1b-41a6-b51c-0e33a0ffd813",
            "created_at": "2022-10-25T15:50:23.688973Z",
            "updated_at": "2025-03-27T02:00:55.524322Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "APT-C-36",
                "Blind Eagle"
            ],
            "source_name": "MITRE:APT-C-36",
            "tools": [
                "Imminent Monitor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bd43391b-b835-4cb3-839a-d830aa1a3410",
            "created_at": "2023-01-06T13:46:38.925525Z",
            "updated_at": "2025-03-27T02:00:02.95302Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "Blind Eagle"
            ],
            "source_name": "MISPGALAXY:APT-C-36",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "be597b07-0cde-47bc-80c3-790a8df34af4",
            "created_at": "2022-10-25T16:07:23.407484Z",
            "updated_at": "2025-03-27T02:02:09.784411Z",
            "deleted_at": null,
            "main_name": "Blind Eagle",
            "aliases": [
                "APT-C-36",
                "APT-Q-98",
                "AguilaCiega"
            ],
            "source_name": "ETDA:Blind Eagle",
            "tools": [
                "AsyncRAT",
                "BitRAT",
                "Bladabindi",
                "BlotchyQuasar",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Jorik",
                "LimeRAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "Warzone",
                "Warzone RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535771,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1653754195,
    "ts_modification_date": 1653754195,
    "files": {
        "pdf": "https://archive.orkl.eu/755569c59a99f1de2550462435799f25e8c42d34.pdf",
        "text": "https://archive.orkl.eu/755569c59a99f1de2550462435799f25e8c42d34.txt",
        "img": "https://archive.orkl.eu/755569c59a99f1de2550462435799f25e8c42d34.jpg"
    }
}