{
    "id": "5830c83c-9049-4305-a028-b9e05d9518d9",
    "created_at": "2023-01-12T15:02:04.610501Z",
    "updated_at": "2025-03-27T02:16:39.716366Z",
    "deleted_at": null,
    "sha1_hash": "ee704ff8277204850ff5de38308d3c4b9ffb6f4f",
    "title": "2020-11-02 - Live off the Land- How About Bringing Your Own Island- An Overview of UNC1945",
    "authors": "",
    "file_creation_date": "2022-05-28T16:12:38Z",
    "file_modification_date": "2022-05-28T16:12:38Z",
    "file_size": 108304,
    "plain_text": "# Live off the Land? How About Bringing Your Own Island? An Overview of UNC1945\n\n**[fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html](https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html)**\n\nThreat Research\n\nJustin Moore, Wojciech Ledzion, Luis Rocha, Adrian Pisarczyk, Daniel Caban, Sara Rincon,\nDaniel Susin, Antonio Monaca\n\nNov 02, 2020\n\n11 mins read\n\nThreat Research\n\nMalware\n\n\n-----\n\nThrough Mandiant investigation of intrusions, the FLARE Advanced Practices team observed\na group we track as UNC1945 compromise managed service providers and operate against\na tailored set of targets within the financial and professional consulting industries by\n[leveraging access to third-party networks (see this blog post for an in-depth description of](https://www.fireeye.com/resources/clustering-and-associating-attacker-activity-at-scale)\n“UNC” groups).\n\nUNC1945 targeted Oracle Solaris operating systems, utilized several tools and utilities\nagainst Windows and Linux operating systems, loaded and operated custom virtual\nmachines, and employed techniques to evade detection. UNC1945 demonstrated access to\nexploits, tools and malware for multiple operating systems, a disciplined interest in covering\nor manipulating their activity, and displayed advanced technical abilities during interactive\noperations.\n\n[Mandiant discovered and reported to Oracle CVE-2020-14871, which was addressed in](https://nvd.nist.gov/vuln/detail/CVE-2020-14871)\n[Oracle's October 2020 Critical Patch Update. Mandiant recommends staying current on all](https://www.oracle.com/security-alerts/cpuoct2020.html)\ncurrent patch updates to ensure a high security posture. We will discuss this vulnerability in\ngreater detail in a follow up blog post.\n\n**UNC1945 Attack Lifecycle**\n\nThe threat actor demonstrated experience and comfort by utilizing unique tactics, techniques\nand procedures (TTPs) within Unix environments, demonstrating a high level of acumen in\nconjunction with ease of operability in Microsoft Windows operating systems. They were\nsuccessful navigating multiple segmented networks and leveraging third-party access to\nextend operations well beyond the initial victim. Furthermore, UNC1945 operated from\nseveral virtual machines pre-configured with post-exploitation tools in addition to their custom\ntoolset to evade detection and forensics.\n\n**Initial Compromise**\n\nIn late 2018, UNC1945 gained access to a Solaris server and installed a backdoor we track\nas SLAPSTICK in order to capture connection details and credentials to facilitate further\ncompromise. The SSH service of this server was exposed to the internet at the time, the\nsame time we observed first evidence of threat activity. Unfortunately, due to insufficient\navailable evidence, the next indication of activity was in mid-2020 at which time a different\nSolaris server was observed connecting to the threat actor infrastructure. This indicates a\ndwell time of approximately 519 days based on recovered artifacts.\n\nAlthough we were unable to determine how the late-2018 initial access was\naccomplished, we did observe successful UNC1945 SSH connections directly to the\nvictim Solaris 10 server, since the SSH service was exposed directly to the internet at\nthe time.\n\n\n-----\n\nIn mid-2020, we observed UNC1945 deploy EVILSUN—a remote exploitation tool\ncontaining a zero-day exploit for CVE-2020-14871—on a Solaris 9 server. At the time,\nconnections from the server to the threat actor IP address were observed over port\n8080.\n\nMandiant discovered and reported CVE-2020-14871, a recently patched\nvulnerability in the Oracle Solaris Pluggable Authentication Module (PAM) that\nallows an unauthenticated attacker with network access via multiple protocols to\nexploit and compromise the operating system.\nAccording to an April 2020 post on a black-market website, an “Oracle Solaris\nSSHD Remote Root Exploit” was available for approximately $3,000 USD, which\nmay be identifiable with EVILSUN.\nAdditionally, we confirmed a Solaris server exposed to the internet had critical\nvulnerabilities, which included the possibility of remote exploitation without\nauthentication.\n\n**Establish Foothold and Maintain Persistence**\n\nThe threat actor used a Solaris Pluggable Authentication Module backdoor we refer to as\nSLAPSTICK to establish a foothold on a Solaris 9 server. This facilitated user access to the\nsystem with a secret hard-coded password and allowed the threat actors to escalate\nprivileges and maintain persistence (see Figure 1).\n\nLog –font –unix | /usr/lib/ssh/sshd sshd kbdint - can <Encoded Password> <IP\nREDACTED> Magical Password\nauth.info | sshd[11800]: [ID 800047 auth.info] Accepted keyboard-interactive for root\nfrom <IP REDACTED> port 39680 ssh2\nauth.notice | su: [ID 366847 auth.notice] ‘su root’ - succeeded for netcool on\n/dev/pts/31\n\nFigure 1: SLAPSTICK logs\n\nAt the initial victim, UNC1945 placed a copy of a legitimate pam_unix.so file and SLAPSTICK\nin the /lib64/security folder. A day later, the threat actor positioned a custom Linux backdoor,\nwhich Mandiant named LEMONSTICK, on the same workstation. LEMONSTICK capabilities\ninclude command execution, file transfer and execution, and the ability to establish tunnel\nconnections. (see Figure 2).\n\nFileItem:changed | /usr/lib64/security/pam_unix,so [57720]\nAudit log | user pid=10080 uid=0 auid=0 msg='PAM: session close acct=root\" :\nexe=\"/usr/sbin/sshd\" (hostname=1.239.171.32, addr=1.239.171.32, terminal=ssh\nres=success)'\"\nFileItem:Accessed | /var/tmp/.cache/ocb_static\n\nFigure 2: UNC1945 emplacement of SLAPSTICK\n\n\n-----\n\nUNC1945 obtained and maintained access to their external infrastructure using an SSH Port\nForwarding mechanism despite the host lacking accessibility to the internet directly. SSH\nPort Forwarding is a mechanism implemented in SSH protocol for transporting arbitrary\nnetworking data over an encrypted SSH connection (tunneling). This feature can be used for\nadding encryption to legacy applications traversing firewalls or with malicious intent to\naccess internal networks from the the internet. The UNC1945 configurations we observed\nare similarly structured with respect to the host alias, specified options, and option order (see\nFigure 3).\n\nconfig1 config2\n\n\nHost <redacted>\nHostName <redacted>\nPort 900\nUser <redacted>\nIdentityFile <redacted>\nKbdInteractiveAuthentication no\nPasswordAuthentication no\nNoHostAuthenticationForLocalhost yes\nStrictHostKeyChecking no\nUserKnownHostsFile /dev/null\nRemoteForward 33002 127.0.0.1:22\n\n\nHost <redacted>\nHostName <redacted>\nPort 443\nUser <redacted>\nIdentityFile <redacted>\nKbdInteractiveAuthentication no\nPasswordAuthentication no\nNoHostAuthenticationForLocalhost yes\nStrictHostKeyChecking no\nUserKnownHostsFile /dev/null\nServerAliveInterval 30\nServerAliveCountMax 3\nRemoteForward 2224 <redacted>:22\n\n\nFigure 3: SSH config files used by UNC1945 at different incidents\n\nAs part of this multi-stage operation, UNC1945 dropped a custom QEMU Virtual Machine\n(VM) on multiple hosts, which was executed inside of any Linux system by launching a\n‘start.sh’ script. The script contained TCP forwarding settings that could be used by the\nthreat actor in conjunction with the SSH tunnels to give direct access from the threat actor\nVM to the command and control server to obfuscate interaction with customer infrastructure.\n[The VM was running a version of the Tiny Core Linux OS with pre-loaded scripts and tools.](http://tinycorelinux.net/)\nAlso, we analyzed the Virtual Machine file system timestamps, which coincided with\nUNC1945's overall operational timeline.\n\nThe VM contained numerous tools such as network scanners, exploits and reconnaissance\ntools. Tiny Core Linux pre-loaded tools included Mimikatz, Powersploit, Responder,\nProcdump, CrackMapExec, PoshC2, Medusa, JBoss Vulnerability Scanner and more.\n\nEfforts to decrease operational visibility included placing tool and output files within\ntemporary file system mount points that were stored in volatile memory. Additionally,\nUNC1945 used built-in utilities and public tools to modify timestamps and selectively\nmanipulate Unix log files.\n\n\n-----\n\nUNC1945 employed anti-forensics techniques with the use of a custom ELF utility named\nLOGBLEACH. The actor used built-in Linux commands to alter the timestamps of files and\ndirectories and used LOGBLEACH to clean logs to thwart forensic analysis, as seen in\nFigure 4.\n\n$ ./b -C -y -a\n$ mv b /usr/lib64/libXbleach.so.1\n$ cd /usr/lib64/\n$ touch -acm -r librpmio.so.3.2.2\n$ touch -acm -r libyaml-0.so.2\n\nFigure 4: LOGBLEACH\n\nTo further obfuscate activity, a Linux ELF packer named STEELCORGI was executed in\nmemory on the Solaris system. The malware contains various anti-analysis techniques,\nincluding anti-debugging, anti-tracing, and string obfuscation. It uses environment variables\nas a key to unpack the final payload.\n\n**Escalate Privileges and Lateral Movement**\n\nAfter successfully establishing a foothold, UNC1945 collected credentials, escalated\nprivileges, and successfully moved laterally through multiple networks.\n\nUNC1945 obtained credentials via SLAPSTICK and open source tools such as Mimikatz,\nwhich enabled easy lateral movement throughout networks to obtain immediate access to\nother segments of the network and third-party environments. Stolen credentials collected by\nSLAPSTICK were used to traverse the customer network via SSH and deploy SLAPSTICK\nto additional hosts. After successfully authenticating, SLAPSTICK displays a welcome\nmessage, as seen in Figure 5.\n\n\n-----\n\nSLAPSTICK backdoor welcome banner\n\n\nFigure 5: SLAPSTICK backdoor welcome\n\nbanner\nUNC1945 used ProxyChains to download PUPYRAT, an open source, cross-platform multifunctional remote administration and post-exploitation tool mainly written in Python.\n\nAt one target, the threat actor used a virtual machine to initiate a brute-force of SSH targeting\nLinux and HP-UX endpoints. Beginning with seemingly random usernames and shifting to\nlegitimate Linux and Windows accounts, the threat actor successfully established SSH\nconnections on a Linux endpoint. After successfully escalating privileges on an HP-UX\nendpoint and a Linux endpoint, UNC1945 installed three backdoors: SLAPSTICK,\nTINYSHELL, and OKSOLO.\n\nWe observed UNC1945 use IMPACKET with SMBEXEC in a Microsoft Windows\nenvironment to execute commands remotely without the need to upload a payload to the\ntarget. SMBEXEC allows the threat actor to operate like PsExec, but without using\nRemComSvc. There are two main modes of using this tool that benefits attackers. Share\nmode allows the specification of a share that everything will be executed through. Server\nmode permits the output of the executed commands to be sent back by the target machine\ninto a locally shared folder.\n\nAt one victim, we observed UNC1945 moving laterally via Remote Desktop Protocol (RDP)\nto a Windows server before viewing the Server Manager Panel, viewing and modifying RDPrelated system firewall rules and checking the application settings of two endpoint security\nservices.\n\n**Internal Reconnaissance**\n\nMandiant investigations found that the threat actor maintains various tools to interact with\nvictim networks. In addition to custom tools, the UNC1945 VMs contained various tools (e.g.\nnetwork scanners, exploits and reconnaissance; see Associated Tools and Malware section).\n\n\n-----\n\nIn some intrusions, UNC1945 employed a SPARC executable identified as a reconnaissance\ntool. Based on publicly available information, this executable could be referred to as\nLuckscan or BlueKeep, the latter of which is part of the BKScan toolkit (see Figure 6).\n\n\nSPARC executable recon tool command line used by the threat actor\n\n\nFigure 6:\n\nSPARC executable recon tool command line used by the threat actor\n[According to open sources, BlueKeep, aka “bkscan” scanner, works both unauthenticated](https://github.com/nccgroup/BKScan)\nand authenticated (i.e. when Network Level Authentication is enabled). BlueKeep (CVE2019-0708) is a security vulnerability that was discovered in Microsoft's Remote Desktop\nProtocol (RDP) implementation, which allows for the possibility of remote code execution.\n\n**Complete Mission**\n\nDespite this multi-staged operation, Mandiant did not observe evidence of data exfiltration\nand was unable to determine UNC1945's mission for most of the intrusions we investigated.\nIn at least one case, we observed ROLLCOAST ransomware deployment in the final phase\nof the threat actor activity, but Mandiant didn’t attribute this activity to UNC1945. At this time,\nit is likely that access to the victim environment was sold to another group.\n\n**Conclusion**\n\n\n-----\n\nThe ease and breadth of exploitation in which UNC1945 conducted this campaign suggests\na sophisticated, persistent actor comfortable exploiting various operating systems, and\naccess to resources and numerous toolsets. Given the aforementioned factors, use of zeroday exploits and virtual machines, and ability to traverse multiple third-party networks,\nMandiant expects this motivated threat actor to continue targeted operations against key\nindustries while taking advantage of operating systems that likely have inadequate security\nvisibility.\n\n**Associated Tools and Malware Families**\n\nEVILSUN is a remote exploitation tool that gains access to Solaris 10 and 11 systems of\nSPARC or i386 architecture using a vulnerability (CVE-2020-14871) exposed by SSH\nkeyboard-interactive authentication. The remote exploitation tool makes SSH connections to\nhosts passed on the command line. The default port is the normal SSH port (22), but this\nmay be overridden. EVILSUN passes the banner string SSH-2.0-Sun_SSH_1.1.3 over the\nconnection in clear text as part of handshaking.\n\nLEMONSTICK is a Linux executable command line utility with backdoor capabilities. The\nbackdoor can execute files, transfer files, and tunnel connections. LEMONSTICK can be\nstarted in two different ways: passing the `-c` command line argument (with an optional file)\nand setting the ‘OCB’ environment variable. When started with the `-c` command line\nargument, LEMONSTICK spawns an interactive shell. When started in OCB mode,\nLEMONSTICK expects to read from STDIN. The STDIN data is expected to be encrypted\nwith the blowfish algorithm. After decrypting, it dispatches commands based on the name—\nfor example: ‘executes terminal command’, ‘connect to remote system’, ‘send & retrieve file’,\n‘create socket connection’.\n\nLOGBLEACH is an ELF utility that has a primary functionality of deleting log entries from a\nspecified log file(s) based on a filter provided via command line. The following log files are\nhard coded in the malware, but additional log paths may be specified:\n\n/var/run/utmp\n/var/log/wtmp\n/var/log/btmp\n/var/log/lastlog\n/var/log/faillog\n/var/log/syslog\n/var/log/messages\n/var/log/secure\n/var/log/auth.log\n\nOKSOLO is a publicly available backdoor that binds a shell to a specified port. It can be\ncompiled to support password authentication or dropped into a root shell.\n\n\n-----\n\nOPENSHACKLE is a reconnaissance tool that collects information about logged-on users\nand saves it to a file. OPENSHACKLE registers Windows Event Manager callback to achieve\npersistence.\n\nProxyChains allows the use of SSH, TELNET, VNC, FTP and any other internet application\nfrom behind HTTP (HTTPS) and SOCKS (4/5) proxy servers. This \"proxifier\" provides proxy\nserver support to any application.\n\nPUPYRAT (aka Pupy) is an open source, multi-platform (Windows, Linux, OSX, Android),\nmulti-function RAT (Remote Administration Tool) and post-exploitation tool mainly written in\nPython. It features an all-in-memory execution guideline and leaves very low footprint. It can\ncommunicate using various transports, migrate into processes (reflective injection), and load\nremote Python code, Python packages and Python C-extensions from memory.\n\nSTEELCORGI is a packer for Linux ELF programs that uses key material from the executing\nenvironment to decrypt the payload. When first starting up, the malware expects to find up to\nfour environment variables that contain numeric values. The malware uses the environment\nvariable values as a key to decrypt additional data to be executed.\n\nSLAPSTICK is a Solaris PAM backdoor that grants a user access to the system with a\nsecret, hard-coded password.\n\nTINYSHELL is a lightweight client/server clone of the standard remote shell tools (rlogin,\ntelnet, ssh, etc.), which can act as a backdoor and provide remote shell execution as well as\nfile transfers.\n\n**Detections**\n\nFE_APT_Trojan_Linux_STEELCORGI_1\nFE_APT_Trojan_Linux_STEELCORGI_2\nFE_HackTool_Linux64_EVILSUN_1\nFE_HackTool_Linux_EVILSUN_1\nHackTool.Linux.EVILSUN.MVX\nHXIOC UUID: e489ce60-f315-4d1a-a888-77782f687eec\nEVILSUN (FAMILY) 90005075FE_Trojan_Linux_LEMONSTICK_1\nFE_APT_Tool_Win32_OPENSHACKLE_1\nFE_APT_Tool_Win_OPENSHACKLE_1\nHXIOC UUID: 4a56fb0c-6134-4450-ad91-0f622a92701c\nOPENSHACKLE (UTILITY) 90005006\nFE_APT_Backdoor_Linux64_SLAPSTICK_1\nFE_APT_Backdoor_Linux_SLAPSTICK_1\nFE_Backdoor_Win_PUPYRAT_1\n\nFE_APT_Pupy_RAT\nFE_Ransomware_Win64_ROLLCOAST_1\n\n\n-----\n\nFE_Ransomware_Win_ROLLCOAST_1\nHXIOC, 45632ca0-a20b-487f-841c-c74ca042e75a; ROLLCOAST RANSOMWARE\n(FAMILY)\nRansomware.Win.ROLLCOAST.MVX\n\n**Hashes**\n\nd5b9a1845152d8ad2b91af044ff16d0b (SLAPSTICK)\n0845835e18a3ed4057498250d30a11b1 (STEELCORGI)\n6983f7001de10f4d19fc2d794c3eb534\n2eff2273d423a7ae6c68e3ddd96604bc\nd505533ae75f89f98554765aaf2a330a\nabaf1d04982449e0f7ee8a34577fe8af\n\n**Netblocks**\n\n46.30.189.0/24\n66.172.12.0/24\n\n**ATT&CK Tactic Category** **Techniques**\n\nInitial Access T1133 External Remote Services\n\nT1190 Exploit Public-Facing Application\n\nExecution T1059 Command and Scripting Interpreter\n\nT1059.001 PowerShell\n\nT1064 Scripting\n\nPersistence T1133 External Remote Services\n\nLateral Movement T1021.001 Remote Desktop Protocol\n\nT1021.004 SSH\n\n\n-----\n\nDefense Evasion T1027 Obfuscated Files or Information\n\nT1070.004 File Deletion\n\nT1070.006 Timestomp\n\nT1064 Scripting\n\nT1553.002 Code Signing\n\nDiscovery T1046 Network Service Scanning\n\nT1082 System Information Discovery\n\nT1518.001 Security Software Discovery\n\nLateral Movement T1021.001 Remote Desktop Protocol\n\nT1021.004 SSH\n\nCommand and Control T1071 Application Layer Protocol\n\nT1090 Proxy\n\nT1105 Ingress Tool Transfer\n\nT1132.001 Standard Encoding\n\n[For more information, check out our Bring Your Own Land blog post. Additionally, Mandiant](https://www.fireeye.com/resources/bring-your-own-land-novel-red-teaming-technique)\nexperts from the FLARE team will present an in-depth view into UNC1945 on Thursday, Nov.\n12. Register today to [reserve your spot for this discussion, where the presenters from](https://www.brighttalk.com/webcast/7451/451508)\n[FLARE and Mandiant Managed Defense will also answer questions from the audience.](https://www.fireeye.com/resources/the-forrester-wave-managed-detection-and-response-q1-2021)\nFinally, for more intelligence on these types of threats, please register for Mandiant\nAdvantage Free, a no-cost version of our threat intelligence platform.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-02 - Live off the Land- How About Bringing Your Own Island- An Overview of UNC1945.pdf"
    ],
    "report_names": [
        "2020-11-02 - Live off the Land- How About Bringing Your Own Island- An Overview of UNC1945.pdf"
    ],
    "threat_actors": [
        {
            "id": "ece64b74-f887-4d58-9004-2d1406d37337",
            "created_at": "2022-10-25T16:07:23.794442Z",
            "updated_at": "2025-03-27T02:02:09.981874Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "DecisiveArchitect",
                "Luminal Panda",
                "TH-239",
                "UNC1945"
            ],
            "source_name": "ETDA:LightBasin",
            "tools": [
                "CordScan",
                "EVILSUN",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LEMONSTICK",
                "LOGBLEACH",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "OKSOLO",
                "OPENSHACKLE",
                "ProxyChains",
                "Pupy",
                "PupyRAT",
                "SIGTRANslator",
                "SLAPSTICK",
                "SMBExec",
                "STEELCORGI",
                "Tiny SHell",
                "pupy",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "31c0d0e1-f793-4374-90aa-138ea1daea50",
            "created_at": "2023-11-30T02:00:07.29462Z",
            "updated_at": "2025-03-27T02:00:03.256081Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "UNC1945",
                "CL-CRI-0025"
            ],
            "source_name": "MISPGALAXY:LightBasin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535724,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1653754358,
    "ts_modification_date": 1653754358,
    "files": {
        "pdf": "https://archive.orkl.eu/ee704ff8277204850ff5de38308d3c4b9ffb6f4f.pdf",
        "text": "https://archive.orkl.eu/ee704ff8277204850ff5de38308d3c4b9ffb6f4f.txt",
        "img": "https://archive.orkl.eu/ee704ff8277204850ff5de38308d3c4b9ffb6f4f.jpg"
    }
}