{
    "id": "58463733-7ff3-4b90-b578-9990972e6fe9",
    "created_at": "2023-01-12T15:10:18.891857Z",
    "updated_at": "2025-03-27T02:10:19.876857Z",
    "deleted_at": null,
    "sha1_hash": "3577b664bcc34f7ae5b9282b3415e282953a8d57",
    "title": "2022-08-31 - Deep Dive into a Corporate Espionage Operation",
    "authors": "",
    "file_creation_date": "2022-09-12T12:01:27Z",
    "file_modification_date": "2022-09-12T12:01:27Z",
    "file_size": 954193,
    "plain_text": "# Deep Dive into a Corporate Espionage Operation\n\n**[businessinsights.bitdefender.com/deep-dive-into-a-corporate-espionage-operation](https://businessinsights.bitdefender.com/deep-dive-into-a-corporate-espionage-operation)**\n\nMartin Zugec\n\n\n-----\n\nBy **[Martin Zugec\n/ Aug 31, 2022](https://businessinsights.bitdefender.com/author/martin-zugec)**\nCorporate espionage, also known as industrial espionage, is espionage conducted for\ncommercial or financial purposes. One of the common misconceptions is that espionage is\naffecting only large corporations or government entities, but it is more common than\nexpected. In this article, we provide an analysis of one such exfiltration and explain why\nthese attacks are on the rise.\n\nIn the last few years, we have seen a dramatic shift in the level of sophistication of cyber\nattacks, mostly thanks to [the introduction of the profit-sharing business model for financially](https://www.youtube.com/watch?v=B05cpQBKEbY)\nmotivated threat actors. However, not all stages of the kill chain have received the same\nattention from threat actors – the focus has been mostly on developing the attack after the\ninitial compromise, focusing on reconnaissance, lateral movement, and extortion methods.\nThe three attack vectors are still dominating the initial compromise:\n\n[Leaked or default/weak credentials (62% of](https://businessinsights.bitdefender.com/bitdefender-threat-debrief-july-2022?hsLang=en-us) [actionable alerts by our Managed](https://businessinsights.bitdefender.com/bitdefender-threat-debrief-july-2022?hsLang=en-us)\nDetection and Response service)\nPhishing attacks\nVulnerability exploits\n\nBut one of these things is not like the others. Vulnerability exploits are not relying on the\nhuman element, instead, they are using automated scanners to identify and compromise\ninternet-facing systems with unpatched vulnerabilities. According to the latest Data Breach\nInvestigations Report 2022 (DBIR 2022), the number of security breaches caused by\n\n\n-----\n\n**vulnerability exploits has doubled in the last year. This trend can be explained by the**\nincreased popularity of hybrid attacks – a type of attack where the initial compromise is\nopportunistic and relies on automated scanners but is then triaged by a human operator to\ndetermine if it’s worth further development.\n\n_Hybrid attacks are on the rise, combining the automated initial compromise with hands-on_\n_triage._\n\n## Data exfiltration and the threat of industrial espionage\n\nThis “upscaling” of attacks can take different forms – for example, even a small company\nwith few computers can have highly valuable data, for instance, lawyers working with\ncelebrities or politicians. Or a company can be part of the supply chain for a much larger\n[corporation, becoming a prime target for Ransomware-as-a-Service groups. Understanding](https://businessinsights.bitdefender.com/what-is-raas-and-why-is-it-so-dangerous?hsLang=en-us)\nhow modern threat actors operate, it should not be surprising that business partners were\ninvolved in 39% of the data breaches last year (source: DBIR 2022). We expect this trend to\ncontinue, as threat actors are focusing more on a breach of confidentiality (data exfiltration)\nthan a breach of availability (deploying ransomware). While we are still using the label\n\"Ransomware-as-a-Service\" for these profit-sharing criminal organizations, many of them are\n[not even deploying ransomware anymore (for example Karakurt). With the rise of hybrid](https://www.cisa.gov/uscert/ncas/alerts/aa22-152a)\nattacks, even small companies are targeted by sophisticated threat actors, such as RaaS\n[affiliates specialized in enterprise targets, or state-sponsored APT groups.](https://businessinsights.bitdefender.com/what-is-an-apt?hsLang=en-us)\n\n[In this deep dive, we analyze the recent industrial espionage operation targeting a small](https://www.techtarget.com/whatis/definition/industrial-espionage)\n(under 200 employees) technology company based in the United States. The attack was\nfocused on information exfiltration and spans several months. A vast network of several\nhundred IP addresses (most of them originated from China) was used as part of this attack.\nSmall and medium-sized companies often lack detection and response capabilities, the most\n\n\n-----\n\neffective defense mechanism when dealing with sophisticated threat actors. We share this\nresearch to help other companies to identify their blind spots and become more cyber\nresilient.\n\n## Anatomy of an attack\n\nOur security researchers from Bitdefender Labs have released a research paper Hiding in\nthe Shadows: Investigation of a Corporate Espionage Attack with full details. The anatomy of\nan attack that follows is the summary of this research.\n\n### Initial compromise\n\nThe initial infection vector was an internet-facing instance of ZOHO ManageEngine\nADSelfService Plus web server exploited via a known unpatched vulnerability CVE-2021[40539. This is one of the top 15 routinely exploited vulnerabilities (source: CISA), allowing a](https://www.cisa.gov/uscert/ncas/alerts/aa22-117a)\nthreat actor to bypass a security authentication and execute arbitrary code.\n\nSurprisingly, attacking basic web applications using one of the well-known vulnerabilities is\nan effective method for nation-state actors to compromise networks. This is a low-cost/highvalue attack vector, and over 30% of web application attacks are related to espionage (a\nsignificantly higher number than any other attack vector). When prioritizing your security\nstrategy, make sure these routinely exploited vulnerabilities are handled as a top priority. You\ncan read more details about this vulnerability in the research How to exploit CVE-202140539 on ManageEngine ADSelfService Plus.\n\nAfter gaining access to this system, threat actors deployed a web shell in a directory\naccessible from the internet. A web shell is a malicious shell-like interface (usually written in\nweb development languages such as JSP, PHP…) that is used to access a web server\nremotely, providing a threat actor with access even after the exploited vulnerability is fixed.\n[For this operation, a combination of different web shells was used – Tunna,](https://github.com/SECFORCE/Tunna) [ReGeorg, and](https://github.com/sensepost/reGeorg)\n[China Chopper Webshell.](https://www.cisa.gov/uscert/ncas/analysis-reports/ar21-072f)\n\n### Establishing persistence\n\nAfter the initial foothold was established, threat actors continued with system discovery,\nidentifying and locating other machines and file shares on the network. Microsoft Exchange\nserver was compromised, and another set of web shells was deployed on this server. Threat\nactors abandoned the initial compromised server in favor of this Exchange server, which\nbecame their base of operations.\n\n\n-----\n\n_Preparing staging environment for the exfiltration_\n\nOnce a backup access vector was set in place, an extensive discovery phase was started.\nThreat actors used a range of tools to obtain access to credentials, including a signed\n[version of DCSync module of Mimikatz, Windows Vault Password Decryptor, Sqldumper.exe](https://securityxploded.com/windows-vault-password-decryptor.php)\nutility, NTDSDumpEx, and export of SAM registry hives. To capture more credentials, threat\nactors enabled the Digest Authentication protocol (WDigest) in the registry. This was a\nlegacy protocol used in Windows Server 2003 and older operating systems that requires\nstoring clear-text passwords in the memory. By enabling this protocol, threat actors can\nharvest not only password hashes, but also clear text passwords for all users authenticated\nagainst a server with this protocol enabled.\n```\ncmd /c cd /d “C:\\inetpub\\wwwroot\\aspnet_client\\css\\”&reg add\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest /v\nUseLogonCredential /t REG_DWORD /d 1 /f&echo [S]&cd&echo [E]\n\n### Data exfiltration\n\n```\nSensitive information was collected, including SSH keys, VPN certificates, and more. The\nthreat actor managed to obtain plaintext credentials of a user with read access to multiple Git\nrepositories, and the source code was downloaded using a tool called `git2.exe . To`\nexfiltrate all this collected data, threat actors used `rar.exe utility to split files into a`\ncollection of 2GB archives. Both data and headers were encrypted for these archive files and\nprotected by the password `CIA@NSA@FBI (very subtle). Before exfiltration, all files were`\nrenamed from `.rar to` `.jpg and stored in a folder accessible from the internet.`\n\n\n-----\n\nTo collect all this data, a few different methods were used, depending on the type of target\nmachine. For file shares, WinRAR was used to compress files and pull archives to the\ncentral exfiltration folder (pulling data). For Windows OS machines, WMI was used to start\nthe remote WinRAR process (pushing data from the target machine). Finally, for Linux OS\nmachines, a different approach was used – Rclone tool uploaded files directly to the Amazon\nS3 bucket.\n\nAfter all the files were saved in the central exfiltration folder, exfiltration was launched using\nnormal HTTP GET requests (the folder was accessible from the internet). These HTTP\nrequests were performed in a highly parallel manner – threat actors used HTTP Range\nHeader, so multiple IPs can concurrently download different segments of a single file. Over\n650 IPs were used to exfiltrate this data, most of them can be traced back to China.\n\n_Different data exfiltration flows_\n\n## Conclusion & recommendations\n\nThe best protection against modern cyber-attacks is a defense-in-depth architecture. Start\nwith reducing your attack surface, focusing on patch management (not only for Windows but\nfor all applications and internet-exposed services), and detection of misconfigurations. Read\nour [technical brief to learn about GravityZone Patch Management solution.](https://www.bitdefender.com/content/dam/bitdefender/resources/technical-brief/Bitdefender-Patch-Management-Technical-Brief-en.pdf)\n\nThe next security layer should be reliable world-class prevention controls that can eliminate\nmost security incidents, using multiple layers of security, including IP/URL reputation for all\nendpoints, and protection against fileless attacks.\n\n\n-----\n\nImplementing IP, domain, and URL reputation, powered by Bitdefender s threat intelligence\nsolution, is one of the most effective methods to stop automated vulnerability exploits.\nAccording to analysis in the Data Breach Investigations Report 2022, only 0.4% of the IPs\nthat attempted RCEs were not seen in one of the previous attacks. Block bad IPs, domains,\nor URLs on all devices, including endpoints, and prevent a security breach in your business\nenvironment.\n\nFinally, for the few incidents that get through your defenses, lean on security operations,\n[either in-house or through a managed service, and leverage strong detection and response](https://www.youtube.com/watch?v=TRp7uLYLGiQ)\ntools. Modern threat actors often spend weeks or months doing active reconnaissance on\nnetworks, generating alerts, and relying on the absence of detection and response\ncapabilities.\n\n**Learn more about Bitdefender’s** **[XDR and](https://www.bitdefender.com/business/products/gravityzone-xdr.html)** **[MDR service offerings.](https://www.bitdefender.com/business/enterprise-products/managed-detection-response-service.html)**\n\n## Indicators of compromise\n\nAn up-to-date and complete list of indicators of compromise is available to Bitdefender Threat\nIntelligence users. The currently known indicators of compromise can be found in the table\nbelow.\n\n### IPs used to access the web shells\n\n**IP Address**\n\n113[.]25[.]2[.]136\n\n139[.]162[.]2[.]70\n\n193[.]34[.]167[.]229\n\n45[.]14[.]71[.]12\n\n172[.]86[.]75[.]152\n\n103[.]224[.]116[.]98\n\n113[.]25[.]10[.]69\n\n\n-----\n\n58[.]221[.]37[.]66\n\n125[.]79[.]201[.]69\n\n140[.]249[.]254[.]251\n\n222[.]67[.]12[.]181\n\n112[.]49[.]92[.]234\n\n182[.]138[.]144[.]147\n\n111[.]126[.]218[.]45\n\n171[.]8[.]217[.]156\n\n117[.]162[.]164[.]55\n\n113[.]2[.]174[.]149\n\n49[.]81[.]61[.]251\n\n39[.]128[.]220[.]139\n\n39[.]144[.]17[.]62\n\n39[.]144[.]4[.]66\n\n221[.]178[.]126[.]191\n\n59[.]163[.]248[.]170\n\n39[.]144[.]5[.]87\n\n59[.]163[.]248[.]162\n\n\n-----\n\n39[.]144[.]14[.]38\n\n221[.]178[.]124[.]233\n\n67[.]227[.]206[.]162\n\n221[.]178[.]127[.]152\n\n39[.]144[.]4[.]160\n\n### URLs\n\n**URL**\n\nhttps://app.jetboatpilot[.]com/utils/optimize/ver.ico\n\nhttp://node-sdk-sample-760723cc-b7e7-43ef-9f5b-9eca39acdefe.s3.us-west1.amazonaws[.]com/git2.exe\n\n### Files\n\n**File Path/Name** **SHA256**\n\nC:\\inetpub\\wwwroot\\aspnet_client\\css\\rr.aspx 742a27fb2a87e2c660fea0bb8184b53e\n\nC:\\inetpub\\wwwroot\\aspnet_client\\css\\ex.aspx 84b5e2ac1846d268f1cf9581b63bf953\n\ntest.jsp 182d244ab4cd63e63997c0ec5d34f320\n\ny.jsp 28e0f31c506b346b8462f61b4903dcb3\n\n\nC:\\ManageEngine\\ADSelfService\nPlus\\webapps\\adssp\\images\\\n\nmobile\\mapp\\m.exe\n\n\n6572fc009a714fefc92dafcb2250f83d\n\n\n-----\n\nC:\\ManageEngine\\ADSelfService\nPlus\\bin\\vm.exe\n\n\nc8460622d893c5753b44a3ac08f55b4f\n\n\nC:\\Windows\\Temp\\nt.exe ab6414b83b23807dd530d250829c8bc1\n\nver.ico fe54e8952f4a24d0747078ee8983ff4d\n\ntest.jsp 57988b776d80b73ecc7640c72fc4f4a6\n\nnav_working.jsp f23436e941af00ae05ad709a7e1da8e1\n\ntot.jsp c9951e1646f68e418a186480c31eb00e\n\nad.txt c951158b74ec5b1869d0ff9ae7ae63f9\n\nt.jsp eb4f89071009c72248ae26d46900d0f2\n\nttt.jsp 2b65120a2d5703d2a042039a997b1284\n\ntot.jsp 2b65120a2d5703d2a042039a997b1284\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-31 - Deep Dive into a Corporate Espionage Operation.pdf"
    ],
    "report_names": [
        "2022-08-31 - Deep Dive into a Corporate Espionage Operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536218,
    "ts_updated_at": 1743041419,
    "ts_creation_date": 1662984087,
    "ts_modification_date": 1662984087,
    "files": {
        "pdf": "https://archive.orkl.eu/3577b664bcc34f7ae5b9282b3415e282953a8d57.pdf",
        "text": "https://archive.orkl.eu/3577b664bcc34f7ae5b9282b3415e282953a8d57.txt",
        "img": "https://archive.orkl.eu/3577b664bcc34f7ae5b9282b3415e282953a8d57.jpg"
    }
}