{
    "id": "58545ba2-57d3-4ebb-b018-4a3266a3b7a3",
    "created_at": "2023-03-15T02:08:59.43345Z",
    "updated_at": "2025-03-27T02:16:01.124808Z",
    "deleted_at": null,
    "sha1_hash": "23219da0963e95373d5dacba4348f1ccd274fd59",
    "title": "The slow Tick‑ing time bomb: Tick APT group compromise of a DLP software developer in East Asia",
    "authors": "ESET",
    "file_creation_date": "2023-03-14T19:27:57Z",
    "file_modification_date": "2023-03-14T19:27:57Z",
    "file_size": 1818149,
    "plain_text": "# The slow Tick‑ing time bomb: Tick APT group compromise of a DLP software developer in East Asia\n\n**[welivesecurity.com/2023/03/14/slow-ticking-time-bomb-tick-apt-group-dlp-software-developer-east-asia](https://www.welivesecurity.com/2023/03/14/slow-ticking-time-bomb-tick-apt-group-dlp-software-developer-east-asia/)**\n\nMarch 14, 2023\n\nESET Research uncovered a campaign by APT group Tick against a data-loss prevention company in East Asia and found a previously\nunreported tool used by the group\n\n[Facundo Muñoz](https://www.welivesecurity.com/author/facundo-munoz/)\n14 Mar 2023 - 11:30AM\n\nESET researchers discovered a campaign that we attribute with high confidence to the APT group Tick. The incident took place in the network\nof an East Asian company that develops data-loss prevention (DLP) software.\n\nThe attackers compromised the DLP company’s internal update servers to deliver malware inside the software developer’s network, and\ntrojanized installers of legitimate tools used by the company, which eventually resulted in the execution of malware on the computers of the\ncompany’s customers.\n\nIn this blogpost, we provide technical details about the malware detected in the networks of the compromised company and of its customers.\n[During the intrusion, the attackers deployed a previously undocumented downloader named ShadowPy, and they also deployed the Netboy](https://gsec.hitb.org/materials/sg2019/D1%20COMMSEC%20-%20Tick%20Group%20-%20Activities%20Of%20The%20Tick%20Cyber%20Espionage%20Group%20In%20East%20Asia%20Over%20The%20Last%2010%20Years%20-%20Cha%20Minseok.pdf)\nbackdoor (aka [Invader) and Ghostdown downloader.](https://unit42.paloaltonetworks.com/unit42-tick-group-continues-attacks/)\n\nBased on Tick’s profile, and the compromised company’s high-value customer portfolio, the objective of the attack was most likely\ncyberespionage. How the data-loss prevention company was initially compromised is unknown.\n\n**Key points in this blogpost:**\n\nESET researchers uncovered an attack occurring in the network of an East Asian data-loss prevention company with a customer\nportfolio that includes government and military entities.\nESET researchers attribute this attack with high confidence to the Tick APT group.\nThe attackers deployed at least three malware families and compromised update servers and tools used by the company. As a result, two\nof their customers were compromised.\nThe investigation revealed a previously undocumented downloader named ShadowPy.\n\n## Tick overview\n\nTick (also known as BRONZE BUTLER or REDBALDKNIGHT) is an APT group, [suspected of being active since at least 2006, targeting](https://community.broadcom.com/symantecenterprise/communities/community-home/librarydocuments/viewdocument?DocumentKey=5da7ee8f-e251-4e14-acf5-693bdd61bde6&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments)\nmainly countries in the APAC region. This group is of interest for its cyberespionage operations, which focus on stealing classified information\nand intellectual property.\n\nTick employs an exclusive custom malware toolset designed for persistent access to compromised machines, reconnaissance, data exfiltration,\n[and download of tools. Our latest report into Tick’s activity found it exploiting the ProxyLogon vulnerability to compromise a South Korean IT](https://www.welivesecurity.com/2021/03/10/exchange-servers-under-siege-10-apt-groups/)\ncompany, as one of the groups with access to that remote code execution exploit before the vulnerability was publicly disclosed. While still a\nzero-day, the group used the exploit to install a webshell to deploy a backdoor on a webserver.\n\n## Attack overview\n\nIn March 2021, through unknown means, attackers gained access to the network of an East Asian software developer company.\n\n[The attackers deployed persistent malware and replaced installers of a legitimate application known as Q-dir with trojanized copies that,](https://www.softwareok.com/?seite=Freeware/Q-Dir)\n[when executed, dropped an open-source VBScript backdoor named ReVBShell, as well as a copy of the legitimate Q-Dir application. This led](https://github.com/bitsadmin/revbshell)\nto the execution of malicious code in networks of two of the compromised company’s customers when the trojanized installers were\ntransferred via remote support software – our hypothesis is that this occurred while the DLP company provided technical support to their\ncustomers.\n\nThe attackers also compromised update servers, which delivered malicious updates on two occasions to machines inside the network of the\nDLP company. Using ESET telemetry, we didn’t detect any other cases of malicious updates outside the DLP company’s network.\n\nThe customer portfolio of the DLP company includes government and military entities, making the compromised company an especially\nattractive target for an APT group such as Tick.\n\n## Timeline\n\nAccording to ESET telemetry, in March 2021 the attackers deployed malware to several machines of the software developer company. The\nmalware included variants of the Netboy and Ghostdown families, and a previously undocumented downloader named ShadowPy.\n\n\n-----\n\np, t e attac e s bega to t oduce t oja ed cop es o t e Q d sta e s t e etwo o t e co p o sed co pa y.\n\nIn June and September 2021, in the network of the compromised company, the component that performs updates for the software developed\nby the compromised company downloaded a package that contained a malicious executable.\n\nIn February and June 2022, the trojanized Q-dir installers were transferred via remote support tools to customers of the compromised\ncompany.\n\n_Figure 1. Timeline of the attack and related incidents._\n\n## Compromised update servers\n\nThe first incident where an update containing malware was registered was in June, and then again in September, 2021. On both cases the\nupdate was delivered to machines inside the DLP company’s network.\n\nThe update came in the form of a ZIP archive that contained a malicious executable file. It was deployed and executed by a legitimate update\nagent from software developed by the compromised company. The chain of compromise is illustrated in Figure 2.\n\n\n-----\n\n_Figure 2. Illustration of the chain of compromise_\n\nThe first detected case occurred in June 2021, and the update was downloaded from an internal server and deployed. The second case\noccurred in September 2021, from a public-facing server.\n\nThe malicious executable issues an HTTP GET request to http://103.127.124[.]117/index.html to obtain the key to decrypt the embedded\npayload, which is encrypted with the RC6 algorithm. The payload is dropped to the %TEMP% directory with a random name and a .vbe\nextension, and is then executed.\n\nAlthough we have not obtained the dropped sample from the compromised machine, based on the detection (VBS/Agent.DL), we have high\n[confidence that the detected script was the open-source backdoor ReVBShell.](https://github.com/bitsadmin/revbshell/blob/master/client.vbs)\n\nUsing ESET telemetry, we didn’t identify any customers of the DLP company who had received any malicious files through the software\ndeveloped by that company. Our hypothesis is that the attackers compromised the update servers to move laterally on the network, not to\nperform a supply-chain attack against external customers.\n\n## Trojanized Q-Dir installers\n\nQ-Dir is a legitimate application developed by SoftwareOK that allows its user to navigate four folders at the same time within the same\nwindow, as shown in Figure 3. We believe that the legitimate application is part of a toolkit used by employees of the compromised company,\nbased on where the detections originated inside the network.\n\n\n-----\n\n_Figure 3. Screenshot of the Q-Dir application_\n\nAccording to ESET telemetry, starting in April 2021, two months before the detection of the malicious updates, the attackers began to\nintroduce 32- and 64-bit trojanized installers of the application into the compromised company’s network.\n\nWe found two cases, in February and June 2022, where the trojanized installers were transferred by the remote support tools helpU and\nANYSUPPORT, to computers of two companies located in East Asia, one in the engineering vertical, and the other a manufacturing industry.\n\nThese computers had software from the compromised company installed on them, and the trojanized Q-dir installer was received minutes\nafter the support software was installed by the users.\n\nOur hypothesis is that the customers of the compromised DLP company were receiving technical support from that company, via one of those\nremote support applications and the malicious installer was used unknowingly to service the customers of the DLP company; it is unlikely that\nthe attackers installed support tools to transfer the trojanized installers themselves.\n\n### 32-bit installer\n\nThe technique used to trojanize the installer involves injecting shellcode into a cavity at the end of the Section Headers table – the application\nwas compiled using 0x1000 for FileAlignment and SectionAlignment, leaving in a cavity of 0xD18 bytes – large enough to accommodate the\nmalicious, position-independent shellcode. The entry point code of the application is patched with a JMP instruction that points to the\nshellcode, and is located right after the call to WinMain (Figure 4); therefore the malicious code is only executed after the application’s\nlegitimate code finishes its execution.\n\n_Figure 4. The assembly code shows the JMP instruction that diverts execution flow to the shellcode. The hexadecimal dump shows the_\n\n_shellcode at the end of the PE’s section headers._\n\nThe shellcode, shown in Figure 5, downloads an unencrypted payload from http://softsrobot[.]com/index.html to %TEMP%\\ChromeUp.exe\nby default; if the file cannot be created, it gets a new name using the GetTempFileNameA API.\n\n\n-----\n\n_Figure 5. Decompiled code of the function that orchestrates downloading the binary file and writing it to disk_\n\n### 64-bit installer\n\nWhile only one malicious 32-bit installer was found, the 64-bit installers were detected in several places throughout the DLP company’s\nnetwork. The installer contains the Q-Dir application and an encoded (VBE) ReVBShell backdoor that was customized by the attackers; both\nof them were compressed with LZO and encrypted with RC6. The files are dropped in the %TEMP% directory and executed.\n\n### ReVBShell\n\nReVBShell is an open-source backdoor with very basic capabilities. The backdoor code is written in VBScript and the controller code is written\nin Python. Communication with the server is over HTTP with GET and POST requests.\n\nThe backdoor supports several commands, including:\n\nGetting computer name, operating system name, architecture, and language version of the operating system\nGetting username and domain name\nGetting network adapter information\nListing running processes\nExecuting shell commands and sending back output\nChanging current directory\nDownloading a file from a given URL\nUploading a requested file\n\nWe believe that the attackers used ReVBShell version 1.0, based on the main branch commit history on GitHub.\n\n## More about the DLP company compromise\n\nIn this section, we provide more details about tools and malware families that Tick deployed in the compromised software company’s\nnetwork.\n\nTo maintain persistent access, the attackers deployed malicious loader DLLs along with legitimate signed applications vulnerable to DLL\nsearch-order hijacking. The purpose of these DLLs is to decode and inject a payload into a designated process (in all cases of this incident, all\nloaders were configured to inject into svchost.exe).\n\nThe payload in each loader is one of three malware families: ShadowPy, Ghostdown, or Netboy. Figure 6 illustrates the loading process.\n\n\n-----\n\n_Figure 6. High-level overview of the Tick malware loading process_\n\nIn this report we will focus on analyzing the ShadowPy downloader and Netboy backdoor.\n\n### ShadowPy\n\n[ShadowPy is a downloader developed in Python and converted into a Windows executable using a customized version of py2exe. The](http://www.py2exe.org/)\ndownloader contacts its C&C to obtain Python scripts to execute.\n\nBased on our findings, we believe the malware was developed at least two years before the compromise of the DLP company in 2021. We have\nnot observed any other incidents where ShadowPy was deployed.\n\n**Custom py2exe loader**\n\nAs previously described, the malicious DLL loader is launched via DLL side-loading; in the case of ShadowPy we observed vssapi.dll being\nside-loaded by avshadow.exe, a legitimate software component from the Avira security software suite.\n\nThe malicious DLL contains, encrypted in its overlay, three major components: the py2exe custom loader, the Python engine and the PYC\ncode. First, the DLL loader code locates the custom py2exe loader in its overlay and decrypts it using a NULL-preserving XOR using 0x56 as\nthe key, then it loads it in memory and injects it in a new svchost.exe process that it creates. Then the entry point of the custom py2exe loader\nis executed on the remote process.The difference between the original py2exe loader code and the customized version used by Tick, is that the\ncustom loader reads the contents of the malicious vssapi.dll from disk and searches for the Python engine and the PYC code in the overlay,\n[whereas the original locates the engine and the PYC code in the resource section.](https://github.com/py2exe/py2exe/blob/7ebb29c1dc2ae08516cde2a9feca4d8517233ef7/source/start.c#L116)\n\nThe loading chain is illustrated in Figure 7.\n\n\n-----\n\n_Figure 7. High-level overview of the steps taken to execute the PYC payload_\n\n**Python downloader**\n\nThe PYC code is a simple downloader whose purpose is to retrieve a Python script and execute it in a new thread. This downloader randomly\npicks a URL from a list (although for the samples we analyzed only one URL was present) and builds a unique ID for the compromised\nmachine by building a string composed of the following data:\n\nMachine local IP address\nMAC address\nUsername (as returned by the %username% environment variable)\nDomain and username (results of the whoami command)\nNetwork computer name (as returned by Python’s platform.node function)\nOperating system information (as returned by Python’s platform.platform function)\nArchitecture information (as returned by Python’s platform.architecture function)\n\nFinally, it uses abs(zlib.crc32(<STRING>)) to generate the value that will serve as an ID. The ID is inserted in the middle of a string composed\nof random characters and is further obfuscated, then it is appended to the URL as shown in Figure 8.\n\n_Figure 8. Decompiled Python code that prepares the URL, appending the obfuscated unique user ID_\n\nIt issues an HTTP GET request to travelasist[.]com to receive a new payload that is XOR-decrypted with a fixed, single-byte key, 0xC3, then\nbase64-decoded; the result is decrypted using the AES algorithm in CFB mode with a 128-bit key and IV provided with the payload. Lastly it is\n[decompressed using zlib and executed in a new thread.](https://www.zlib.net/)\n\n### Netboy\n\n[Netboy (aka](https://gsec.hitb.org/materials/sg2019/D1%20COMMSEC%20-%20Tick%20Group%20-%20Activities%20Of%20The%20Tick%20Cyber%20Espionage%20Group%20In%20East%20Asia%20Over%20The%20Last%2010%20Years%20-%20Cha%20Minseok.pdf) [Invader) is a backdoor programmed in Delphi; it supports 34 commands that allow the attackers to capture the screen, perform](https://unit42.paloaltonetworks.com/unit42-tick-group-continues-attacks/)\nmouse and keyboard events on the compromised machine, manipulate files and services, and obtain system and network information, among\nother capabilities.\n\n**Network protocol**\n\nNetboy communicates with its C&C server over TCP. The packet format used to exchange information between the backdoor and its C&C is\ndescribed in Figure 9.\n\n\n-----\n\n_Figure 9. Illustration of the C&C packet format implemented by Netboy_\n\nIn order to fingerprint its packets, it generates two random numbers (first two fields in the header) that are XORed together (as shown in\nFigure 10) to form a third value that is used to validate the packet.\n\n_Figure 10. Decompiled code that generates two random numbers and combines them to generate a packet_\n\n_fingerprint value_\n\nPacket validation is shown in Figure 11, when the backdoor receives a new command from its controller.\n\n_Figure 11. Decompiled code that performs validation of a newly received packet_\n\nThe packet header also contains the size of the encrypted compressed data, and the size of the uncompressed data plus the size (DWORD) of\nanother field containing a random number (not used for validation) that is prepended to the data before it is compressed, as shown in Figure\n12.\n\n_Figure 12. Decompiled code that creates a new packet to be sent to the controller_\n\nFor compression, Netboy uses a variant of the LZRW family of compression algorithms and for encryption it uses the RC4 algorithm with a\n256-bit key made up of ASCII characters.\n\n**Backdoor commands**\n\nNetboy supports 34 commands; however, in Table 1 we describe only 25 of the most prominent ones giving the attackers certain capabilities\non the compromised systems.\n\n_Table 1. Most interesting Netboy backdoor commands_\n\n**Command ID** **Description**\n\n0x05 Create new TCP socket and store received data from its controller to a new file.\n\n\n-----\n\n**Command ID** **Description**\n\n0x06 Create new TCP socket and read file; send contents to the controller.\n\n0x08 Gets local host name, memory information, system directory path, and configured operating hours range for the backdoor\n(for example, between 14-18).\n\n0x0A List network resources that are servers.\n\n0x0B List files in a given directory.\n\n0x0C List drives.\n\n0x0E Execute program with ShellExecute Windows API.\n\n0x0F Delete file.\n\n0x10 List processes.\n\n0x11 Enumerate modules in a process.\n\n0x12 Terminate process.\n\n0x13 Execute program and get output.\n\n0x16 Download a new file from the server and execute with ShellExecute Windows API.\n\n0x1D Create reverse shell.\n\n0x1E Terminate shell process.\n\n0x1F Get TCP and UDP connections information using the WinSNMP API.\n\n0x23 List services.\n\n0x24 Start service specified by the controller.\n\n0x25 Stop service specified by the controller.\n\n0x26 Create a new service. Details such as service name, description, and path are received from the controller.\n\n0x27 Delete service specified by the controller.\n\n0x28 Set TCP connection state.\n\n0x29 Start screen capture and send to the controller every 10 milliseconds.\n\n0x2A Stop screen capture.\n\n0x2B Perform mouse and keyboard events requested by the controller.\n\n## Attribution\n\nWe attribute this attack to Tick with high confidence based on the malware found that has been previously attributed to Tick, and to the best\nof our knowledge has not been shared with other APT groups, and the code similarities between ShadowPy and the loader used by Netboy.\n\nAdditionally, domains used by the attackers to contact their C&C servers were previously attributed to Tick in past cases: waterglue[.]org in\n[2015, and softsrobot[.]com in 2020.](https://web.archive.org/web/20160125071628/http:/www.cyphort.com/multiple-malwares-used-to-target-an-asian-financial-institution/)\n\n## Possibly related activity\n\nIn May 2022, [AhnLab researchers published a report about an unidentified threat actor targeting entities and individuals from South Korea](https://asec.ahnlab.com/en/34010/)\nwith CHM files that deploy a legitimate executable and a malicious DLL for side-loading. The purpose of the DLL is to decompress, decrypt,\ndrop, and execute a VBE script in the %TEMP% folder. The decoded script reveals a ReVBShell backdoor once again.\n\nWe believe that campaign is likely to be related to the attack described in this report, as the custom ReVBShell backdoor of both attacks is the\nsame, and there are multiple code similarities between the malicious 64-bit installer (SHA-1:\nB9675D0EFBC4AE92E02B3BFC8CA04B01F8877DB6) and the quartz.dll sample (SHA-1:\nECC352A7AB3F97B942A6BDC4877D9AFCE19DFE55) described by AhnLab.\n\n## Conclusion\n\n\n-----\n\nS esea c e s u cove ed a co p o se o a ast s a data oss p eve t o co pa y. u g t e t us o, t e attac e s dep oyed at\nleast three malware families, and compromised update servers and tools used by the compromised company. As a result, two customers of the\ncompany were subsequently compromised.\n\nOur analysis of the malicious tools used during the attack revealed previously undocumented malware, which we named ShadowPy. Based on\nsimilarities in the malware found during the investigation, we have attributed the attack with high confidence to the Tick APT group, known\nfor its cyberespionage operations targeting the APAC region.\n\nWe would like to thank Cha Minseok from AhnLab for sharing information and samples during our research.\n\n_ESET Research offers private APT intelligence reports and data feeds. For any inquiries about this service, visit the ESET Threat_\n_Intelligence page._\n\n## IoCs\n\n### Files\n\n**SHA-1** **Filename** **ESET detection name** **Description**\n\n72BDDEAD9B508597B75C1EE8BE970A7CA8EB85DC dwmapi.dll Win32/Netboy.A Netboy backdoor.\n\n8BC1F41A4DDF5CFF599570ED6645B706881BEEED vssapi.dll Win64/ShadowPy.A ShadowPy downloader.\n\n4300938A4FD4190A47EDD0D333E26C8FE2C7451E N/A Win64/TrojanDropper.Agent.FU Trojanized Q‑dir installer, 64‑bit v\nDrops the customized ReVBShel\nversion A.\n\nB9675D0EFBC4AE92E02B3BFC8CA04B01F8877DB6 N/A Win64/TrojanDropper.Agent.FU Trojanized Q‑dir installer, 64‑bit v\nDrops the customized ReVBShel\nversion B.\n\nF54F91D143399B3C9E9F7ABF0C90D60B42BF25C9 N/A Win32/TrojanDownloader.Agent.GBY Trojanized Q-dir installer, 32-bit v\n\nFE011D3BDF085B23E6723E8F84DD46BA63B2C700 N/A VBS/Agent.DL Customized ReVBShell backdoo\nversion A.\n\n02937E4A804F2944B065B843A31390FF958E2415 N/A VBS/Agent.DL Customized ReVBShell backdoo\nversion B.\n\n### Network\n\n**IP** **Provider** **First seen** **Details**\n\n115.144.69[.]108 KINX 2021‑04‑14 travelasist[.]com\n\nShadowPY C&C server\n\n110.10.16[.]56 SK Broadband Co Ltd 2020‑08‑19 mssql.waterglue[.]org\n\nNetboy C&C server\n\n103.127.124[.]117 MOACK.Co.LTD 2020‑10‑15 Server contacted by the malicious update executable to retrieve a key for\ndecryption.\n\n103.127.124[.]119 MOACK.Co.LTD 2021-04-28 slientship[.]com\n\nReVBShell backdoor version A server.\n\n103.127.124[.]76 MOACK.Co.LTD 2020‑06‑26 ReVBShell backdoor version B server.\n\n58.230.118[.]78 SK Broadband Co Ltd 2022-01-25 oracle.eneygylakes[.]com\n\nGhostdown server.\n\n192.185.89[.]178 Network Solutions, LLC 2020-01-28 Server contacted by the malicious 32-bit installer to retrieve a payload.\n\n## MITRE ATT&CK techniques\n\n[This table was built using version 12 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)\n\n**Tactic** **ID** **Name** **Description**\n\n\nInitial\nAccess\n\n\n[T1195.002](https://attack.mitre.org/versions/v12/techniques/T1195/002) Supply Chain Compromise:\nCompromise Software Supply\nChain\n\n\nTick compromised update servers to deliver malicious update packages via\nthe software developed by the compromised company.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n[T1199](https://attack.mitre.org/versions/v12/techniques/T1199) Trusted Relationship Tick replaced legitimate applications used by technical support to\ncompromise customers of the company.\n\n\nExecution [T1059.005](https://attack.mitre.org/versions/v12/techniques/T1059/005) Command and Scripting\nInterpreter: Visual Basic\n\n[T1059.006](https://attack.mitre.org/versions/v12/techniques/T1059/006) Command and Scripting\nInterpreter: Python\n\nPersistence [T1547.001](https://attack.mitre.org/versions/v12/techniques/T1547/001) Boot or Logon Autostart\nExecution: Registry Run Keys /\nStartup Folder\n\n[T1543.003](https://attack.mitre.org/versions/v12/techniques/T1543/003) Create or Modify System\nProcess: Windows Service\n\n[T1574.002](https://attack.mitre.org/versions/v12/techniques/T1574/002) Hijack Execution Flow: DLL\nSide-Loading\n\n\nTick used a customized version of ReVBShell written in VBScript.\n\nShadowPy malware uses a downloader written in Python.\n\nNetboy and ShadowPy loaders persist via a Run key.\n\nNetboy and ShadowPy loaders persist by creating a service.\n\nNetboy and ShadowPy loaders use legitimate service and description names\nwhen creating services.\n\nNetboy and ShadowPy loaders use legitimate service and description names\nwhen creating services.\n\nNetboy and ShadowPy loaders use legitimate service and description names\nwhen creating services.\n\n\nDefense\nEvasion\n\n\n[T1036.004](https://attack.mitre.org/versions/v12/techniques/T1036/004) Masquerading: Masquerade\nTask or Service\n\n[T1036.005](https://attack.mitre.org/versions/v12/techniques/T1036/005) Masquerading: Match\nLegitimate Name or Location\n\n\n[T1027](https://attack.mitre.org/versions/v12/techniques/T1027) Obfuscated Files or Information Netboy, ShadowPy, and their loader use encrypted: payloads, strings,\nconfiguration. Loaders contain garbage code.\n\n\n[T1027.001](https://attack.mitre.org/versions/v12/techniques/T1027/001) Obfuscated Files or\nInformation: Binary Padding\n\n[T1055.002](https://attack.mitre.org/versions/v12/techniques/T1055/002) Process Injection: Portable\nExecutable Injection\n\n[T1055.003](https://attack.mitre.org/versions/v12/techniques/T1055/003) Process Injection: Thread\nExecution Hijacking\n\n\nNetboy and ShadowPy loaders DLLs are padded to avoid security solutions\nfrom uploading samples.\n\nNetboy and ShadowPy loaders inject a PE into a preconfigured system\nprocess.\n\nNetboy and ShadowPy loaders hijack the main thread of the system process\nto transfer execution to the injected malware.\n\n\nDiscovery [T1135](https://attack.mitre.org/versions/v12/techniques/T1135) Network Share Discovery Netboy has network discovery capabilities.\n\n[T1120](https://attack.mitre.org/versions/v12/techniques/T1120) Peripheral Device Discovery Netboy enumerates all available drives.\n\n[T1057](https://attack.mitre.org/versions/v12/techniques/T1057) Process Discovery Netboy and ReVBShell have process enumeration capabilities.\n\n[T1082](https://attack.mitre.org/versions/v12/techniques/T1082) System Information Discovery Netboy and ReVBShell, gather system information.\n\n[T1033](https://attack.mitre.org/versions/v12/techniques/T1033) System Owner/User Discovery Netboy and ReVBShell, gather user information.\n\n[T1124](https://attack.mitre.org/versions/v12/techniques/T1124) System Time Discovery Netboy uses system time to contact its C&C only during a certain time range.\n\n\nLateral\nMovement\n\n\n[T1080](https://attack.mitre.org/versions/v12/techniques/T1080) Taint Shared Content Tick replaced legitimate applications used by technical support, which\nresulted also in malware execution within the compromised network on\npreviously clean systems.\n\n\nCollection [T1039](https://attack.mitre.org/versions/v12/techniques/T1039) Data from Network Shared\nDrive\n\n\nNetboy and ReVBShell have capabilities to collect files.\n\n\n[T1113](https://attack.mitre.org/versions/v12/techniques/T1113) Screen Capture Netboy has screenshot capabilities.\n\n\nCommand\nand Control\n\n\n[T1071.001](https://attack.mitre.org/versions/v12/techniques/T1071/001) Application Layer Protocol:\nWeb Protocols\n\n[T1132.001](https://attack.mitre.org/versions/v12/techniques/T1132/001) Data Encoding: Standard\nEncoding\n\n\nShadowPy and ReVBShell communicate via HTTP protocol with their C&C\nserver.\n\nTick’s customized ReVBShell uses base64 to encode communication with\ntheir C&C servers.\n\n\n[T1573](https://attack.mitre.org/versions/v12/techniques/T1573) Encrypted Channel Netboy uses RC4. ShadowPy uses AES.\n\nExfiltration [T1041](https://attack.mitre.org/versions/v12/techniques/T1041) Exfiltration Over C2 Channel Netboy and ReVBShell have exfiltration capabilities.\n\n\n[T1567.002](https://attack.mitre.org/versions/v12/techniques/T1567/002) Exfiltration Over Web Service:\nExfiltration to Cloud Storage\n\n14 Mar 2023 - 11:30AM\n\n\nTick deployed a custom tool to download and exfiltrate files via a web service.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/m37w9blhczmsgr4cmhjfxu432zca4sdj"
    ],
    "report_names": [
        "ESET_Tick-APT-compromise-DLP-developer-East-Asia(03-14-2023)"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1678846139,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1678822077,
    "ts_modification_date": 1678822077,
    "files": {
        "pdf": "https://archive.orkl.eu/23219da0963e95373d5dacba4348f1ccd274fd59.pdf",
        "text": "https://archive.orkl.eu/23219da0963e95373d5dacba4348f1ccd274fd59.txt",
        "img": "https://archive.orkl.eu/23219da0963e95373d5dacba4348f1ccd274fd59.jpg"
    }
}