{
    "id": "585ac343-4835-4d5d-9bb7-e3b42778648a",
    "created_at": "2023-01-12T15:10:31.172929Z",
    "updated_at": "2025-03-27T02:16:25.8277Z",
    "deleted_at": null,
    "sha1_hash": "7665f6164dd17998a90685cb59051c89dea835f0",
    "title": "2021-10-07 - FIN12- The Prolific Ransomware Intrusion Threat Actor That Has Aggressively Pursued Healthcare Targets",
    "authors": "",
    "file_creation_date": "2022-05-28T19:30:21Z",
    "file_modification_date": "2022-05-28T19:30:21Z",
    "file_size": 1313224,
    "plain_text": "# FIN12: The Prolific Ransomware Intrusion Threat Actor That Has Aggressively Pursued Healthcare Targets\n\n**[mandiant.com/resources/fin12-ransomware-intrusion-actor-pursuing-healthcare-targets](https://www.mandiant.com/resources/fin12-ransomware-intrusion-actor-pursuing-healthcare-targets)**\n\nToday, Mandiant Intelligence is releasing a comprehensive report detailing FIN12, an\naggressive, financially motivated threat actor behind prolific ransomware attacks since at\nleast October 2018. FIN12 is unique among many tracked ransomware-focused actors today\nbecause they do not typically engage in multi-faceted extortion and have disproportionately\nimpacted the healthcare sector. They are also the first FIN actor that we are promoting who\nspecializes in a specific phase of the attack lifecycle—ransomware deployment—while\nrelying on other threat actors for gaining initial access to victims. This specialization reflects\nthe current ransomware ecosystem, which is comprised of various loosely affiliated actors\npartnering together, but not exclusively with one another.\n\n[The full published report covers historical and ongoing activity attributed to FIN12, their use](https://www.mandiant.com/media/12596/download)\nof partners to enable their operations, including initial access providers, the evolution of the\ngroup’s tactics, techniques, and procedures, and trends in their extensive use of Cobalt\n\n\n-----\n\nStrike BEACON.\n\nThe Mandiant Security Validation (Validation) Behavior Research Team (BRT) has created\nVHR20210922 – FIN12, which is accessible on the Content page of the Validation Customer\nPortal.\n\nWe are also releasing the following reports referenced in the report to Mandiant Advantage\nFree.\n\n[Multiple Threat Actors Deploy RYUK Using Varying TTPs](https://advantage.mandiant.com/reports/21-00019652)\n[Ryuk Malware Profile](https://advantage.mandiant.com/reports/18-00015730)\nAnalysis of Loader and Backdoor Combinations Associated with TRICKBOT Operators\n[Used to Enable Post-Intrusion Ransomware Deployment](https://advantage.mandiant.com/reports/20-00024041)\n\nFigure 1: FIN12 badge\n\n## FIN12 Victims\n\nFIN12’s operations provide illustration that no target is off limits when it comes to\nransomware attacks, including those that provide critical care functions. Almost 20 percent of\ndirectly observed FIN12 victims were in the healthcare industry and many of these\norganizations operate medical facilities. We observed FIN12 activity at healthcare\n[organizations both before and after the joint alert by multiple U.S. government entities in](https://us-cert.cisa.gov/ncas/alerts/aa20-302a)\nOctober 2020 that warned of an “increased and imminent” threat to hospitals and medical\nfacilities. This targeting pattern deviates from some other ransomware threat actors who had\nat least stated an intention to show restraint in targeting hospitals, especially throughout the\n\n\n-----\n\nCOVID-19 pandemic. FIN12 s remaining victims have operated in a broad range of sectors,\nincluding but not limited to business services, education, finance, government,\nmanufacturing, retail, and technology.\n\nWhile these victim organizations have been overwhelmingly located in North America, there\nis some evidence that FIN12's regional targeting is expanding. Nearly 85 percent of the\ngroup’s known victims have been based in North America, however, we observed twice as\nmany victim organizations based outside of North America in the first half of 2021 than we\nobserved in 2019 and 2020 combined. Collectively, these organizations have been based in\nAustralia, Colombia, France, Indonesia, Ireland, the Philippines, South Korea, Spain, the\nUnited Arab Emirates, and the United Kingdom. This shift could be due to various factors\nsuch as FIN12 working with more diverse partners to obtain initial access and increasingly\nelevated and unwanted attention from the U.S. government.\n\nWe believe that the most significant factor in FIN12’s targeting calculus has been a victim’s\nannual revenue. The vast majority of known FIN12 victims have more than $300 million USD\nin revenue, based on corporate financial data compiled from ZoomInfo. While this data is\nskewed to our direct visibility, FIN12 does appear to consistently target larger companies in\ncomparison to the average ransomware affiliate. Targeting victims that meet a certain\nrevenue threshold also aligns with underground forum activity; some threat actors, including\nthose using RYUK, have specified different ranges of minimum requirements for potential\nvictims’ annual revenue. Further, comments detailing revenue information in malware\nadministration panels operated by FIN12’s initial access providers illustrate that this is a\nrelevant factor for victim selection or at minimum for prioritization of available targets.\nFIN12’s selection of high-value targets is consistent with the broader trend of threat actors\npursuing larger targets in recent years, almost certainly because of the perception that it\njustifies proportionally large ransom demands.\n\n## Parasites And Symbiotes\n\nFrom the beginning of their operations and until March 2020, we observed FIN12 exclusively\nleverage TRICKBOT accesses as a launching point for their ransomware attacks. However,\nafter returning from a nearly four-month hiatus in August 2020, the initial access vectors\nleveraged by FIN12 became increasingly diversified. In at least some cases, these variations\nmay reflect the use of distinct initial access providers. For example, beginning in early 2021,\nwe directly observed several cases where the first evidence of FIN12 activity was a login to a\nvictim’s Citrix environment. This activity is also consistent with our identification of multiple\nRussian-speaking actors operating in underground communities seeking partners who could\nprovide Citrix accesses for RYUK ransomware operations. Although we currently lack\nsufficient evidence to attribute these actors to FIN12, these solicitations nonetheless further\nsupport the likelihood that FIN12 has not relied on a single initial access provider to enable\ntheir operations. This division of labor is not uncommon and reflects the professionalism and\nspecialization of the cybercrime ecosystem overall.\n\n\n-----\n\nIn many incidents, where the initial intrusion vector was identified, FIN12 activity was\nobserved on the same day as the initial access campaign suggesting that FIN12 maintains a\nclose relationship with at least some threat actors providing them access. Most notably,\nFIN12 maintains a close relationship with TRICKBOT and BAZARLOADER affiliated actors.\nBeyond leveraging accesses obtained via these families, FIN12 has used overlapping\ntoolsets and services including backdoors, droppers, and codesigning certificates. Despite\nthese similarities, we track FIN12 as a distinct threat actor given their specific role in the\ndeployment of ransomware, their ability to work independently of these families, and our\nobservations of other distinct threat actors who also deploy ransomware using accesses\nobtained via these malware ecosystems.\n\nFigure 2: Directly observed initial accesses leveraged by FIN12\n\n## Prioritizing Speed\n\nFIN12's reliance on other threat actors to obtain initial access to organizations and their\nspecific focus on ransomware deployment has paid dividends in terms of their time-toransom (TTR). We calculate the TTR as the amount of time from when they first access an\nenvironment to when they begin to deploy ransomware. In the first half of 2021, as compared\nto 2020, FIN12 significantly improved their TTR, cutting it in half to just 2.5 days. These\n\n\n-----\n\nefficiency gains are enabled by their specialization in a single phase of the attack lifecycle,\nwhich allows threat actors to develop expertise more quickly. FIN12 also stands out in the\npack of ransomware operators today because they do not usually engage in multifaceted\nextortion—a tactic that has become commonplace in today’s threat landscape. The most\nsignificant factor in FIN12's decision to refrain from stealing victim data and publicly shaming\nvictims may be the impact it has on the speed of their operations. The average TTR across\nour FIN12 engagements involving data theft was just under 12.5 days compared to 2.5 days\nwhere data theft was not observed. Each additional day FIN12 spends in an environment\nbefore completing their objective increases their risk being detected. FIN12's apparent\nsuccess without the need to incorporate additional extortion methods likely suggests the\nnotion that they to not believe spending additional time to steal data is worth the risk of\nhaving their plans to deploy ransomware thwarted.\n\nFigure 3: FIN12’s Time-to-Ransom (TTR)\n\n## Implications\n\nWhile threat actors running ransomware-as-a-service (RaaS) outfits have an important role\nin multifaceted extortion attacks, the focus on the branding and communication components\nof these services can detract from other important players. Intrusion actors, such as FIN12,\nmay arguably play a more pivotal role in these operations, yet have received marginal\nattention. These actors are the ones navigating victim networks and deploying the\nransomware itself, and in at least some cases, may have direct input into the target\nselection. The skillset required for this role may be comparatively less developed within the\ncyber-criminal underground, which has historically put a heavy emphasis on malware\ndevelopment, distribution, and the management of cash-out operations. We also constantly\nobserve solicitations from threat actors looking to recruit individuals to join intrusion teams,\nsometimes even trying to hire individuals under false pretenses, facts that may be reflective\nof a talent shortage in this area. Notably, intrusion groups do not typically have an allegiance\n\n\n-----\n\nto any particular RaaS brand and have exhibited that they can easily switch between or use\nmultiple brands concurrently. The shifting nature of these allegiances is a key reason for why\nintrusion operators such as FIN12 are important for security teams and organizations to\nunderstand and track rather than maintaining an exclusive focus on the brands and\nransomware families these operators choose to distribute at a given moment.\n\n[Download FIN12 report today.](https://www.mandiant.com/media/12596/download)\n\n## Acknowledgements\n\nA small army contributed to the research, malware analysis, data analysis, writing and\nreview of this report, and without them this could never have seen the light of day. We also\nowe an extreme debt of gratitude to the many thousands of hours of hard work put in by our\nincident responders, Managed Defense analysts, Advanced Practices teams, and\nunderground researchers who collected and normalized much of the data that formed the\nbasis for our analysis.Every report published by Mandiant is a massive team effort and we\nare grateful for the opportunity to work with a world class group of professionals in all their\ndifferent areas of practice. Unfortunately, for the sake of brevity, we cannot list the name of\nevery person who contributed to this work but we would like to specifically call out the efforts\nof a few individuals and teams.\n\nThe following people and teams provided critical analysis support to the team working on this\nreport:\n\nJordan Nuce\n\nIoana Teaca\n\nVan Ta\n\nAaron Stephens\n\nBryce Abdo\n\nSandor Nemes\n\nJessa Valdez\n\nThomas Pullen\n\nMoritz Raabe\n\nAmsterdam and Ukraine research offices\n\nFinally, extra special thanks to Ana Foreman for putting together the graphics that went into\nthis reporting, and her infinite patience with our many edits.\n\n\n-----\n\n## Mandiant Security Validation Actions\n\nOrganizations can validate their security controls using the following Actions with Mandiant\nSecurity Validation.\n\n**Network Actions**\n\n**VID** **Title**\n\nA100-040 Malicious File Transfer - RYUK, Download, Variant #2\n\nA100-042 Malicious File Transfer - RYUK, Download, Variant #3\n\nA100-044 Malicious File Transfer - RYUK, Download, Variant #4\n\nA100-071 Malicious File Transfer - RUBEUS Tool, Download\n\nA100-072 Malicious File Transfer - SYSTEMBC, Download\n\nA101-850 Command and Control - GRIMAGENT, C2 Traffic, Variant #2\n\nA101-851 Command and Control - GRIMAGENT, C2 Traffic, Variant #1\n\nA101-852 Malicious File Transfer - GRIMAGENT, Download, Variant #1\n\nA101-853 Command and Control - GRIMAGENT, C2 Traffic, Variant #4\n\nA101-854 Command and Control - GRIMAGENT, C2 Traffic, Variant #3\n\nA101-855 Malicious File Transfer - GRIMAGENT, Download, Variant #3\n\nA101-856 Malicious File Transfer - GRIMAGENT, Download, Variant #2\n\nA101-858 Malicious File Transfer - WEIRDLOOP, Download, Variant #2\n\nA101-859 Malicious File Transfer - WEIRDLOOP, Download, Variant #1\n\n\n-----\n\nA101-862 Malicious File Transfer - MALTSHAKE, Download, Variant #2\n\nA101-863 Malicious File Transfer - MALTSHAKE, Download, Variant #1\n\nA101-864 Malicious File Transfer - ICECANDLE, Download, Variant #3\n\nA101-865 Malicious File Transfer - ICECANDLE, Download, Variant #2\n\nA101-882 Malicious File Transfer - FIN12, Get-DataInfo.ps1, Download\n\nA101-886 Malicious File Transfer - KERBRUTE, Download, Variant #2\n\nA101-909 Lateral Movement - FIN12, RYUK, Execution with PsExec\n\nA101-910 Lateral Movement - FIN12, RYUK, Transfer with PsExec\n\nA101-911 Phishing Email - Malicious Attachment, FIN12, WEIRDLOOP\n\nA101-912 Malicious File Transfer - FIN12, ADFIND Batch Script\n\nA101-920 Phishing Email - Malicious Attachment, FIN12, BAZARLOADER\n\nA101-921 Malicious File Transfer - BAZARBACKDOOR, Download\n\nA101-922 Command and Control - FIN12, BEACON, Check-In\n\nA101-923 Command and Control - FIN12, DNS Query, Variant #1\n\nA101-924 Command and Control - FIN12, DNS Query, Variant #2\n\nA101-925 Command and Control - FIN12, DNS Query, Variant #3\n\nA101-926 Command and Control - FIN12, DNS Query, Variant #4\n\nA101-927 Command and Control - FIN12, DNS Query, Variant #5\n\n\n-----\n\n**Endpoint Actions**\n\n**VID** **Title**\n\nA104-003 Host CLI - RYUK, FIN12, Active Directory Reconnaissance\n\nA104-004 Host CLI - Scheduled Task Called by Run Key, Default Privileges\n\nA104-007 Host CLI - Scheduled Task Called by Run Key, Highest Privileges\n\nA104-012 Protected Theater - RYUK Actor Modify File Permissions\n\nA104-710 Protected Theater - RYUK Actor, Kill Services and Processes\n\nA104-831 Protected Theater - GRIMAGENT, Schtask and Registry for Persistence\n\nA104-842 Protected Theater - FIN12, RYUK, Download and Execution via BITSAdmin\n\nA104-856 Host CLI - FIN12, Active Directory Reconnaissance\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-07 - FIN12- The Prolific Ransomware Intrusion Threat Actor That Has Aggressively Pursued Healthcare Targets.pdf"
    ],
    "report_names": [
        "2021-10-07 - FIN12- The Prolific Ransomware Intrusion Threat Actor That Has Aggressively Pursued Healthcare Targets.pdf"
    ],
    "threat_actors": [
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536231,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653766221,
    "ts_modification_date": 1653766221,
    "files": {
        "pdf": "https://archive.orkl.eu/7665f6164dd17998a90685cb59051c89dea835f0.pdf",
        "text": "https://archive.orkl.eu/7665f6164dd17998a90685cb59051c89dea835f0.txt",
        "img": "https://archive.orkl.eu/7665f6164dd17998a90685cb59051c89dea835f0.jpg"
    }
}