{
    "id": "58b01ec2-b44c-4919-ae39-8915b3602d9c",
    "created_at": "2023-01-12T15:02:10.740379Z",
    "updated_at": "2025-03-27T02:15:35.635536Z",
    "deleted_at": null,
    "sha1_hash": "1493748e9f0f04ddf61de23b4e758999fd2660d3",
    "title": "2018-03-09 - Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads-",
    "authors": "",
    "file_creation_date": "2022-05-28T15:39:52Z",
    "file_modification_date": "2022-05-28T15:39:52Z",
    "file_size": 4564899,
    "plain_text": "# BAD TRAFFIC Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads?\n\n**[citizenlab.ca/2018/03/bad-traffic-sandvines-packetlogic-devices-deploy-government-spyware-turkey-syria/](https://citizenlab.ca/2018/03/bad-traffic-sandvines-packetlogic-devices-deploy-government-spyware-turkey-syria/)**\n\nMarch 9, 2018\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Free Expression Online](https://citizenlab.ca/category/research/free-expression-online/)\nBy [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [Jakub Dalek,](https://citizenlab.ca/author/jakub/) [Sarah McKune,](https://citizenlab.ca/author/smckune/) [Adam Senft,](https://citizenlab.ca/author/adamsenft/) [John Scott-Railton, and](https://citizenlab.ca/author/jsrailton/) [Ron Deibert](https://citizenlab.ca/author/profd/)\nMarch 9, 2018\n[زﻣﺔ ﻣﺮورﯾﺔ (Arabic translation),أ](https://citizenlab.ca/2018/03/%D8%A3%D8%B2%D9%85%D8%A9-%D9%85%D8%B1%D9%88%D8%B1%D9%8A%D8%A9-%D8%A3%D8%AC%D9%87%D8%B2%D8%A9-%D8%B3%D8%A7%D9%86%D8%AF%D9%81%D9%8A%D9%86-%D8%A8%D8%A7%D9%83%D9%8A%D8%AA-%D9%84%D9%88%D8%AC%D9%8A%D9%83/) [KÖTÜ TRAFİK (Turkish translation)](https://citizenlab.ca/2018/03/kotu-trafik-sandvinein-packetlogic-cihazlari-turkiyede-hukumetin-casus-program-kullanmasina-misirda-ise-kullanicilari-baglantili-reklamlara-yonlendirmeye-mi-yariyor/)\n\n[Download this report](http://hdl.handle.net/1807/95263)\n_This report describes our investigation into the apparent use of Sandvine/Procera Networks Deep_\n_Packet Inspection (DPI) devices to deliver nation-state malware in Turkey and indirectly into Syria, and_\n_to covertly raise money through affiliate ads and cryptocurrency mining in Egypt._\n\n## Key Findings\n\nThrough Internet scanning, we found deep packet inspection (DPI) middleboxes on Türk\nTelekom’s network. The middleboxes were being used to redirect hundreds of users in Turkey\nand Syria to nation-state spyware when those users attempted to download certain legitimate\nWindows applications.\n\n\n-----\n\nWe found similar middleboxes at a Telecom Egypt demarcation point. On a number of occasions,\nthe middleboxes were apparently being used to hijack Egyptian Internet users’ unencrypted web\nconnections en masse, and redirect the users to revenue-generating content such as affiliate ads\nand browser cryptocurrency mining scripts.\nAfter an extensive investigation, we matched characteristics of the network injection in Turkey\nand Egypt to Sandvine PacketLogic devices. We developed a fingerprint for the injection we\nfound in Turkey, Syria, and Egypt and matched our fingerprint to a second-hand PacketLogic\ndevice that we procured and measured in a lab setting.\nThe apparent use of Sandvine devices to surreptitiously inject malicious and dubious redirects for\nusers in Turkey, Syria, and Egypt raises significant human rights concerns.\n\n## 1. Summary\n\nThis report describes how we used Internet scanning to uncover the apparent use of Sandvine/Procera\nNetworks Deep Packet Inspection (DPI) devices (i.e. middleboxes) for malicious or dubious ends, likely\nby nation-states or ISPs in two countries.\n\n## 1.1. Turkey\n\nWe found that a series of middleboxes on Türk Telekom’s network were being used to redirect\nhundreds of users attempting to download certain legitimate programs to versions of those programs\nbundled with spyware. The spyware we found bundled by operators was similar to that used in the\n_[StrongPity APT attacks. Before switching to the StrongPity spyware, the operators of the Turkey](https://securelist.com/on-the-strongpity-waterhole-attacks-targeting-italian-and-belgian-encryption-users/76147/)_\n[injection used the FinFisher “lawful intercept” spyware, which FinFisher asserts is sold only to](http://www.finfisher.com/FinFisher/index.html)\ngovernment entities.\n\nTargeted users in Turkey and Syria who downloaded Windows applications from official vendor\n[websites including Avast Antivirus,](https://www.avast.com/) [CCleaner,](https://www.ccleaner.com/) [Opera, and](http://www.opera.com/) [7-Zip were silently redirected to malicious](http://www.7-zip.org/)\nversions by way of injected HTTP redirects. This redirection was possible because official websites for\nthese programs, even though they might have supported HTTPS, directed users to non-HTTPS\ndownloads by default. Additionally, targeted users in Turkey and Syria who downloaded a wide range\nof applications from CBS Interactive’s [Download.com (a platform featured by CNET to download](http://download.cnet.com/)\nsoftware) were instead redirected to versions containing spyware. Download.com does not appear to\nsupport HTTPS despite purporting to offer “secure download” links.1\n\nOur scans of Turkey revealed that this spyware injection was happening in at least five provinces. In\naddition to targets in Turkey, targets included some users physically located in Syria who used Internet\nservices relayed into Syria by Türk Telekom subscribers, sometimes via cross-border directional Wi-Fi\nlinks. In one case, more than a hundred Syrian users appeared to share a single Turkish IP address.\nBased on publicly available information we found on Wi-Fi router pages, at least one targeted IP\naddress appears to serve YPG (Kurdish militia) users. YPG has been the target of a Turkish\ngovernment air and ground offensive which began in January 2018. Areas not controlled by the YPG\nalso appear to be targeted, including the area around Idlib city.\n\n## 1.2. Egypt\n\n\n-----\n\nWe found similar middleboxes at a Telecom Egypt demarcation point. The middleboxes were being\nused to redirect users across dozens of ISPs to affiliate ads and browser cryptocurrency mining scripts.\nThe Egyptian scheme, which we call AdHose, has two modes. In spray mode, AdHose redirects\nEgyptian users en masse to ads for short periods of time. In trickle mode, AdHose targets some\nJavaScript resources and defunct websites for ad injection. AdHose is likely an effort to covertly raise\nmoney.\n\n## 1.3. Technology Matches Sandvine PacketLogic\n\nAfter an extensive investigation, we matched characteristics of the middleboxes in Turkey and Egypt to\nSandvine PacketLogic devices. [Sandvine’s PacketLogic middleboxes can prioritize, degrade, block,](https://www.sandvine.com/products/packetlogic)\ninject, and log various types of Internet traffic. The company that makes PacketLogic devices was\nformerly known as Procera Networks, but was recently renamed Sandvine after Procera’s owner, U.S.[based private equity firm Francisco Partners, acquired Ontario-based networking equipment company](https://www.theglobeandmail.com/technology/sandvine-accepts-francisco-partners-takeover-bid-plan-to-combine-with-procera/article35708446/)\n[Sandvine and combined the two companies in 2017. Francisco Partners has a number of investments](https://www.franciscopartners.com/news/sandvine-corporation-to-be-acquired-by-francisco-partners-affiliate-and-combined-with-procera-networks)\nin dual-use technology companies, including providers of Internet surveillance and monitoring tools\nsuch as [NSO Group, an Israeli company that develops and sells mobile spyware. NSO Group’s](https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=257152480)\n[spyware has been used in several](https://citizenlab.ca/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/) [countries to target journalists, lawyers, and human rights defenders.](https://citizenlab.ca/2017/06/reckless-exploit-mexico-nso/)\n\nA [2014 article in a Turkish Newspaper mentioned that Turkey had begun negotiations with Procera to](http://web.archive.org/web/20140707083118/http://www.taraf.com.tr/haber-internete-sansur-donanimi-158271/)\nbuy a PacketLogic system for surveillance and censorship purposes; the deal reportedly caused\nconsternation within the company.\n\n## 1.4. Blocking Human Rights and Political Content\n\nIn Egypt and Turkey, we also found that devices matching our Sandvine PacketLogic fingerprint were\nbeing used to block political, journalistic, and human rights content.\n\nIn Egypt, these devices were being used to block dozens of human rights, political, and news websites\nincluding Human Rights Watch, Reporters Without Borders, Al Jazeera, Mada Masr, and HuffPost\nArabic. In Turkey, these devices were being used to block websites including Wikipedia, the website of\nthe Dutch Broadcast Foundation (NOS), and the website of the Kurdistan Workers’ Party (PKK).\n\n## 1.5. Procera/Sandvine employees on the ground?\n\n[A search of LinkedIn reveals profiles for a Procera Networks “Solutions Engineer” in Istanbul, Turkey](https://www.linkedin.com/in/g%C3%B6khan-s%C3%B6nmez-69189813/)\n[and a Sandvine (formerly Procera Networks) “Resident Engineer – Senior Level” in Egypt. Sandvine’s](https://www.linkedin.com/in/ihab-zolfakar-44469954/)\n[“Careers” page describes the responsibilities of a position entitled “Resident Operations Engineer,”](https://sandvine.secure.force.com/careers/VanaHCM__Job_Detail?Id=a4f0g000000PaGaAAK)\nincluding “performing operations based activities, residing at the customer’s location,” and “working\nclosely with the customers’ operations and development teams.” A 2016 Procera “use cases”\nbrochure2 has a section on “Regulatory Compliance – Traffic Blocking,” which mentions that the\ncompany provides “resident engineering services” to support government mandates on Procera’s\ncustomers that require blocking of services like VPNs or VoIP. In light of this information, on February\n12, 2018, we sent a letter to Sandvine and asked whether Sandvine maintains a resident solutions\nengineer or other support staff in Turkey or Egypt. Sandvine did not respond to this question. The\nprospect of in-country work of this sort, especially at the large ISP level, raises questions regarding\ncompany awareness of, or participation in, activities with significant human rights impact.\n\n\n-----\n\nOur February 12, 2018 letters to Sandvine and Francisco Partners summarized the findings of our\nreport and contained detailed questions about our findings and their corporate social responsibility\npractices. A February 16, 2018 letter from Sandvine characterized the statements in our letter as “false,\nmisleading, and wrong,” and demanded that we return the second-hand PacketLogic device that we\nused to confirm attribution of our fingerprint. On February 20, 2018, Francisco Partners sent its own\nresponse, stating that the firm “recognizes the importance of corporate governance and social\nresponsibility.” On March 1, 2018, Citizen Lab replied to Sandvine. Our interactions with Sandvine and\nFrancisco Partners are discussed in further detail in Section 7.\n\n## 2. Background: Nation-State Network Injection\n\nNation-state-level network injection to deliver spyware has long been the stuff of legends. There have\nbeen [many](https://wikileaks.org/spyfiles/files/0/297_GAMMA-201110-FinFly_ISP.pdf) [leaked](https://wikileaks.org/hackingteam/emails/fileid/447727/212805) [documents and vendor claims outlining purported nation-state network injection](https://www.wired.com/2013/11/this-is-how-the-internet-backbone-has-been-turned-into-a-weapon/)\ncapabilities but there are no concrete public measurements that conclusively establish nation-state\nspyware injection in the wild.\n\nIn network injection, a middlebox operates over connections between a target and an Internet site they\nare visiting. If the connection is unauthenticated (e.g., HTTP and not HTTPS), then the middlebox can\nbe used to tamper with data to inject a spoofed response from the Internet site. The spoofed response\nmay contain redirects to exploits or spyware to infect and monitor the target. A significant portion of\n[web traffic (approximately 20-30% in the United States) still does not use HTTPS, according to Google.](http://blog.chromium.org/2018/02/a-secure-web-is-here-to-stay.html)\n\nBroadly, network injection systems are divided into two categories: an on-path system (also called a\n_man-on-the-side) can simply add Internet traffic to the network, whereas an in-path system (also called_\na man-in-the-middle) can add traffic and also suppress legitimate traffic. A malicious response injected\nby an on-path system is easier for researchers to detect, because the target receives both the\nlegitimate and malicious response. The presence of two non-similar responses to the same request is\na good indicator of on-path network injection. The target’s device will process whichever response is\nreceived first, so the goal of an on-path system is to inject a malicious response that reaches the user\n_before the legitimate response. However, such a system cannot always guarantee that the target’s_\ndevice will see the malicious response first, due to unpredictable network delays and reordering.\n\n## 2.1. On-Path Systems\n\n### NSA QUANTUM\n\n[Based on information from documents leaked from the US National Security Agency (NSA), NSA’s](https://theintercept.com/document/2014/03/12/nsa-gchqs-quantumtheory-hacking-tactics/)\n**[QUANTUM is an on-path network injection system, and has been used to target engineers associated](https://www.wired.com/2015/04/researchers-uncover-method-detect-nsa-quantum-insert-hacks/)**\n[with Belgian telco Belgacom, employees of OPEC, and Tor users accessing terrorist content. NSA’s](https://www.theguardian.com/world/2013/oct/04/nsa-gchq-attack-tor-network-encryption)\nQUANTUM has never been publicly measured in the wild, but leaked documents indicate that it\n[functions by injecting HTTP redirects into targeted users’ connections.](https://www.wired.com/opinion/2013/11/this-is-how-the-internet-backbone-has-been-turned-into-a-weapon/)\n\n### Hacking Team Network Injection Appliance (NIA)\n\n[According to a patent filed in 2010 by nation-state spyware vendor Hacking Team, and leaked](http://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20130132571&IDKey=EEF16E1E2680&HomeUrl=http%3A%2F%2Fappft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D5%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPG01%2526s1%3Dht.AS.%2526OS%3DAN%2Fht%2526RS%3DAN%2Fht)\ndocuments, the company may have developed a similar on-path network injection system called the\n**Hacking Team Network Injection Appliance (NIA). This system has never been publicly measured in**\n\n\n-----\n\nthe wild. The patent indicates that the NIA functions by injecting HTTP redirects into targeted users\nconnections.\n\n## 2.2. In-Path Systems\n\n### FinFly ISP\n\nLeaked documents from nation-state spyware vendor FinFisher indicate that the company sells an in[path network injection system called FinFly ISP. The complex system supports a number of unique](https://www.youtube.com/watch?v=Dejw2G83Moo)\n[features, such as rewriting downloaded binaries on-the-fly. The system was apparently sold to](https://citizenlab.ca/2014/08/cat-video-and-the-death-of-clear-text/)\n[governments in Mongolia and](https://wikileaks.org/spyfiles4/customers.html#customer_18) [Turkmenistan, and at least one additional customer that could not be](https://wikileaks.org/spyfiles/document/gamma/GAMMA-2011-TMFinfFinF-en/)\nidentified from the 2014 FinFisher leaked documents. This system has never been publicly measured\nin the wild.\n\n### China’s Great Cannon\n\n[China’s Great Cannon is an in-path network injection system, which was used in 2015 (and](https://citizenlab.ca/2015/04/chinas-great-cannon/) [perhaps](https://gist.github.com/paperbag/6287d41d9c1407bb5704a9a4ac86152b)\nas recently as 2017) to inject JavaScript that enlists targets’ browsers in distributed denial of service\n(DDoS) attacks against the Chinese diaspora’s efforts to spread censored information. In a 2015\nreport, we [hypothesized that the Great Cannon could also be used to distribute spyware, but this has](https://citizenlab.ca/2015/04/chinas-great-cannon/)\nnever been publicly measured in the wild.\n\n### Sandvine PacketLogic\n\nAccording to our measurements (Section 3.3), Sandvine’s PacketLogic product supports in-path\n[network injection. The company advertises that they support “regulatory compliance” but does not](https://www.sandvine.com/solutions/regulatory-compliance)\nmention spyware injection. Nevertheless, the product has support for defining rules that inject data into\ntargeted connections (Figure 4). As we document in this report, the PacketLogic product may have\nbeen used by government-linked entities in both Turkey and Egypt to inject spyware.\n\n## 2.3. The Procera/Sandvine value proposition\n\nA [Procera “use cases” brochure3](https://cdn2.hubspot.net/hubfs/482141/WhitePapers/Procera_UseCase_Book.pdf) has a section on “Regulatory Compliance – Traffic Blocking.” The\n[section links to a 2002 article by Electronic Frontiers Australia entitled “Internet Censorship: Law &](https://www.efa.org.au/Issues/Censor/cens3.html)\npolicy around the world” and mentions that “Procera’s solutions provide the capabilities to identify and\nblock, or shape down to become unusable, any identifiable service network wide or on an individual\nsubscriber basis.”\n\n[Procera appears to have pitched its services as a win-win for both ISPs and governments that require](https://www.proceranetworks.com/hubfs/Resource%20Downloads/Solutions%20Briefs/Procera_SB_Regulatory%20URL%20Filtering.pdf?t=1501671712921)\nInternet censorship solutions, or as a way for ISPs to save money while implementing regulatory\nrequirements that do not generate any revenue:\n\n“Operators that are required to filter content from their networks by governmental regulations are\nstruggling to find solutions that can keep up with the explosive bandwidth growth of the past few years.\nMany telecom operators are required to invest several racks worth of equipment for a single use case\nwith no return on investment through additional ARPU from subscribers.”\n\n\n-----\n\nThe document describes the close ongoing relationship Procera may have maintained with its clients to\nhelp them implement “regulatory requirements,” in some cases apparently having a Procera employee\nassist government clients with censorship:\n\n“As an example, adult content can be opted in on an individual bases [sic] or services like Skype could\nbe enabled for corporate clients only. Procera updates it’s [sic] signature database on a weekly basis to\nstay up to date on changes in what traffic looks like. Blocking proprietary over-the-top services will\nalways remain a cat and mouse game that requires local dedicated personnel to perform well. Procera\ncan provide these resident engineering services.”\n\nSandvine appears to offer instructor-led training sessions, such as the “Operating with PacketLogic”\ncourse. If desired, Sandvine can offer such courses as a “customer-exclusive session delivered at the\ncustomer’s location“.\n\n## 3. Catching Nation-State spyware injection in the wild\n\n_This section describes how we obtained the first-ever packet captures (PCAPs) of nation-state spyware_\n_injection, and how we matched the characteristics of the spyware injection to Sandvine PacketLogic_\n_devices._\n\n## 3.1. An initial report\n\n[A September 2017 report revealed that ISPs in two (unnamed) countries were likely injecting FinFisher](http://welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nspyware into targeted users’ Internet connections when the users tried to download popular Windows\napplications. The injection was implemented using HTTP redirects matching the format shown in\n**Figure 1.**\n\nHTTP/1.1 307 Temporary Redirect\nLocation: [location]\nConnection: close\n\n**Figure 1: Injected HTTP 307 redirect to spyware seen in two countries.**\n\nA [follow-up report in December 2017 found no further evidence of spyware injection from one of the](https://www.welivesecurity.com/2017/12/08/strongpity-like-spyware-replaces-finfisher/)\ntwo countries from the original report and found that operators of the injection in the second country\nswitched from FinFisher spyware to a piece of spyware that was similar to the StrongPity spyware.\n[StrongPity was an unattributed APT operation in 2016 that primarily targeted individuals in Italy and](https://securelist.com/on-the-strongpity-waterhole-attacks-targeting-italian-and-belgian-encryption-users/76147/)\nTurkey.\n\n## 3.2. Scanning and identifying countries\n\nDiscovering that an ISP or government is tampering with a user’s Internet connection by injecting\nmalicious responses to the user’s requests is difficult. Typically, this requires the user to send requests,\nrecord the responses they receive, and share this data with researchers. However, we find that some\nnetwork injection is bidirectional: we can sometimes receive a malicious injected response when we\nsend a request to a targeted user.\n\n\n-----\n\nWe checked [Shodan, a website on which anyone can search the results of global Internet scans, for](https://www.shodan.io/)\nthe header format in Figure 1, and found thousands of IP addresses in dozens of countries returning\nsimilar (non-malicious) redirects,4 sometimes to landing pages about billing like “Your Internet service\nhas been suspended for non-payment.” It seemed peculiar to us that Shodan saw these messages\nwhen it scanned the IP address of a customer who was suspended for non-payment, because the\nmessages would only need to be visible to the customer themself. The fact that Shodan received\nresponses from thousands of IP addresses matching the same header format used to inject FinFisher\nspyware in two countries (Figure 1) suggested to us that the spyware injection might also be\nbidirectional.\n\nWe scanned the Internet in October 2017, sending every IPv4 address an HTTP request to download\n[the Opera Web Browser, one of the applications that a September 2017 report indicates was targeted](http://welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nfor spyware injection. Our initial scan found dozens of IP addresses on Türk Telekom that returned 307\nredirects such as the ones in Figure 2.\n\nHTTP/1.1 307 Temporary Redirect\nLocation: https://downloading.internetdownloading.co/down.php?\na=2ec8a93a73540467335f4365beee7e44\nConnection: close\n\nHTTP/1.1 307 Temporary Redirect\nLocation: https://downloading.syriantelecom.co/pcdownload.php?\na=20755b98d7c094747b75b157413e3422\nConnection: close\n\n**Figure 2: Injected HTTP 307 spyware redirects we observed in Turkey when performing HTTP**\n**requests for Opera.**\n\nWe successfully fetched the files from a Turkish IP address using a VPN. When we tried to fetch the\nfiles from a non-Turkish IP, we received a 503 Service Temporarily Unavailable message. The files\nwere similar to the StrongPity spyware.5\n\nWe continued to perform scanning of Turkey and set out to fingerprint the middlebox performing the\nspyware injection. As part of our scanning, we obtained packet captures (PCAPs) that show networklevel details of the spyware injection. These are the first ever public PCAPs showing nation-state\n**spyware injection.**\n\n## 3.3. Attribution of middlebox to Sandvine\n\n### Fingerprint elements\n\nBased on our PCAPs, we identified several elements of the injection in Turkey which, in conjunction,\nform what we believe to be a highly distinctive fingerprint:\n\n1. In all injected packets, the IPID is always 13330 (0x3412, which is 0x1234 endian-swapped)\n\nfor all injected packets. This value is unusual, as the IPID is typically incremented or\npseudorandomly generated, and is not a fixed value.\n\n\n-----\n\n2. In all packets, the IP flags are all zero. This characteristic is unusual as modern TCP stacks\n\ntypically default-enable Path MTU Discovery for TCP sockets, which results in the “don’t\nfragment” IP flag being set to 1.\n3. The injected packet received by the client is either an empty RST/ACK packet, or a\n\n**FIN/ACK packet, with an HTTP 307 redirect whose headers exactly match the form of**\n**redirect in Figure 1.**\n4. If a FIN/ACK is injected, then the injector sends an unsolicited final ACK packet to the\n\n**client ~100ms later. This behavior is unusual, as a well-behaving TCP stack would wait to see**\nthe FIN/ACK from the client before sending the final ACK.\n\nGiven the [well-documented controversy over the installation of Sandvine PacketLogic devices in](https://www.forbes.com/sites/thomasbrewster/2016/10/25/procera-francisco-partners-turkey-surveillance-erdogan/)\nTurkey, we purchased a PacketLogic device second-hand to confirm whether its behavior matched our\nfingerprint.\n\n### Our second-hand PacketLogic device\n\nWe purchased a Sandvine PacketLogic device second-hand. The device was a PacketLogic PL7720,\nwhich is a 2U rackmount version of PacketLogic with Procera livery. This model is well past its\n[designated end-of-life date and no longer serviced by the company. The device was installed with](https://cdn2.hubspot.net/hubfs/482141/Procera_Live_Site_Files/PDF_Live_Site/Resources/Discontinued_Products/PacketLogic_PL-7720_End_of_Sale_Announcement.pdf?t=1456414414263)\nfirmware version 12.1, which was released in 2009. The device also contained a PacketLogic license\nfile that appeared to be valid in perpetuity for the currently installed version of the firmware but which\ncannot be used to upgrade to a later version. Version 12.1 appears to be the earliest version of\nPacketLogic firmware to contain support for network injection.6\n\n**Figure 3: A picture of our second-hand Sandvine PacketLogic box, with Procera livery.**\nThe device has two USB ports, an RS232 (on RJ45) serial console port that can be used to access a\ntext-based menu configuration system, two management ethernet ports, and a single channel over\nwhich the middlebox operates. The channel has an internal ethernet port (Int) and an external ethernet\nport (Ext). The middlebox would typically operate over traffic flowing between a local network\n(connected to the Int port), and the rest of the Internet (connected to the Ext port). An operator could\nadd rules to the middlebox to take certain actions over this traffic (e.g., block traffic to a website, inject\ntraffic for targeted users, etc.).\n\nWe powered up the device and connected through its Admin management port. We used an old\nversion of the PacketLogic Client available on the Internet Archive to interface with the device, as no\ncurrent version of the PacketLogic Client on Sandvine’s website appeared to support version 12 1 of\n\n\n-----\n\nthe firmware. We used the default password pldemo00 printed on the device to log in. We connected\none experiment computer to the PacketLogic device’s Ext port, and a second experiment computer to\nthe Int port in order to observe characteristics of the device’s operation. At no time did we connect the\ndevice to the Internet.\n\n### Redirecting users to a malicious file\n\nWe added a rule to redirect users who requested an Avast Antivirus setup file to a malicious file. This\ntest involved creating a PropertyObject to match requests whose URL ended in the filename for Avast\nAntivirus: avast_free_antivirus_setup_online.exe, and then a Filtering Rule to redirect all connections\nmatching the PropertyObject to a malicious file. This redirection used the built-in Inject action. The\nPacketLogic GUI has an “Insert 307 Temporary Redirect” button that, when pressed, pastes an HTTP\n307 Temporary Redirect response identical to element 3 of our fingerprint (at the start of this section).\nThe PacketLogic operator can configure the “Location” header, which is initially blank; in this case, we\nentered: http://example.com/spyware.exe.\n\n**Figure 4: How we set up our Sandvine PacketLogic device to inject spyware when a user tries**\n**to download Avast Antivirus. We believe a similar setup exists in Turkey.**\nWithout any further configuration, this rule caused our PacketLogic device to inject the redirect in\nresponse to a matching request in either direction (internal to external, or external to internal). This\nmirrors our experience of being able to reproduce spyware injection in Turkey from requests sent\nexternal to internal. We noticed that we could add an extra condition to the rule in order to restrict the\ninjection to a single direction.\n\nOur experiment matched elements 1-3 of our fingerprint, but did not completely match element 4.\nSpecifically, our PacketLogic middlebox injected an unsolicited final ACK back-to-back after the\nFIN/ACK containing the 307 Temporary Redirect instead of injecting it following the ~100ms delay we\nobserved in Turkey and Egypt. Our version of the PacketLogic firmware (12.1) was the first to support\ninjection; we hypothesize that the ~100ms delay between the data packet and the final ACK was added\n\n\n-----\n\nin a later firmware version, potentially to reduce the probability of the ACK being reordered before the\nFIN/ACK; such a reordering would cause the injection recipient’s TCP connection to hang in the\nLAST_ACK state, which is the scenario that sending the ACK seeks to avoid.\n\n**Figure 5 shows an excerpt from our client-side PCAP that captures the injection from our test**\nPacketLogic device. Note that the IPID is 13330 in both injected packets, both injected packets have\nno IP flags, the format of the HTTP 307 redirect is what we expect, and the final ACK packet is\nunsolicited.\n\n**Client sends GET request for Avast file**\n\n17:28:25.024018 IP (tos 0x0, ttl 64, id 0, offset 0, flags [DF], proto TCP (6), length 170)\n192.168.1.27.49458 > 192.168.1.26.8080: Flags [P.], seq 1:119, ack 1, win 4117, options [nop,nop,TS\nval 756363711 ecr 2094486068], length 118: HTTP, length: 118\nGET /avast_free_antivirus_setup_online.exe HTTP/1.1\nHost: 192.168.1.26:8080\nUser-Agent: curl/7.54.0\nAccept: */*\n\n**Client receives injected data (redirect to spyware file)**\n\n17:28:25.024300 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length 134)\n192.168.1.26.8080 > 192.168.1.27.49458: Flags [F.], seq 1:95, ack 119, win 32120, length 94: HTTP,\nlength: 94\nHTTP/1.1 307 Temporary Redirect\nLocation: http://example.com/spyware.exe\nConnection: close\n\n**Client receives injected ACK**\n\n17:28:25.024302 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length 40)\n192.168.1.26.8080 > 192.168.1.27.49458: Flags [.], seq 96, ack 120, win 32120, length 0\n\n**Figure 5: PacketLogic spyware injection from the client side.**\n\n**Figure 6 shows an excerpt from our server-side PCAP that captures the injection from our test**\nPacketLogic device. Note that the server side does not receive the HTTP request for the Avast file.\nInstead, it receives an injected RST packet with IPID 13330 and no flags. Note that the timestamp\ndiscrepancy in the PCAP files is because the server and client clocks were not synchronized.\n\n**Server receives injected RST**\n\n17:28:06.715257 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length 40)\n192.168.1.27.49458 > 192.168.1.26.8080: Flags [R], seq 681001116, win 32120, length 0\n\n**Figure 6: PacketLogic spyware injection from the server side.**\n\n## 3.4. Shared code: a competing hypothesis\n\n\n-----\n\nOur technical attribution (Section 3.3) can only establish that code that makes the same distinctive\nimplementation choices as PacketLogic’s was used in the injection in Turkey and Egypt. It is possible\nthat another vendor copied PacketLogic’s design, such as by studying and exactly re-implementing\nPacketLogic’s custom TCP stack and HTTP header format in injected redirects. It is also possible that,\nwith or without Sandvine’s knowledge, a third party obtained and copied PacketLogic’s code. It might\nalso be possible that both Sandvine and other companies drew their code from the same third-party\ncodebase.\n\nThere are, however, several reasons why the shared code hypothesis is unlikely to be an accurate\nexplanation of our findings. First, the 2016 controversy within Procera about selling their solution to\nTurkey for surveillance (referred to in Section 1.3) indicates a possible prior business relationship\nbetween the company and Turkey. Second, we have not been able to locate any codebase with both\nthe same distinctive IPID value and the same distinctive HTTP header format;7 the only references to\nIPID values of 13330 (0x3412) we found were a 2016 OONI report about the ad injection we mention in\n**Section 5, and a** [2004 forum post by an individual in Sweden curious as to why he was seeing IPID](https://www.linuxquestions.org/questions/linux-networking-3/package-id-269218/)\nvalues of 13330 when he tried to ping the IP addresses of his website’s visitors with unsolicited TCP\nsegments. It is significant in this regard that it was a Swedish company, Netintact AB, founded in 2000,\n[that developed and sold the PacketLogic product before Procera acquired the company in 2006. Third,](https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=27408330)\nperforming single packet injection in a TCP connection is a relatively simple feat to achieve; an\nengineer wishing to implement this functionality would likely not need to study or copy another\nimplementation.\n\n## 4. Turkey case: targeted malware injection\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic fingerprint is used_\n_to inject malware to users in Turkey and Syria who attempt to download common Windows software._\n\n## 4.1. Turkey background: information controls and surveillance\n\nIn spite of being a parliamentary democracy with decades of multi-party elections, Turkey’s government\n[is characterized by corruption,](https://www.transparency.org/country/TUR) [human rights abuses, and](https://www.economist.com/news/leaders/21720590-recep-tayyip-erdogan-carrying-out-harshest-crackdown-decades-west-must-not-abandon) [autocratic tendencies on the part of the](http://foreignpolicy.com/2014/05/12/turkeys-tyrant-in-the-making/)\ncurrent Prime Minister Recep Tayyip Erdoğan. Turkey’s military has traditionally been an important and\noccasional overbearing presence in domestic politics, with the country experiencing several coup\nattempts. Information controls played an important part in the most recent such attempt, which was\n[foiled by President Erdoğan in July 2016. Prior to the coup attempt, Turkish authorities routinely](http://www.aljazeera.com/news/2016/12/turkey-failed-coup-attempt-161217032345594.html)\n[throttled access to prominent social media sites, such as Twitter and Facebook. Erdoğan used Apple’s](https://www.reuters.com/article/us-mideast-crisis-socialmedia/turkey-appears-to-be-in-vanguard-of-throttling-social-media-after-attacks-idUSKCN0ZM2O3)\n[Facetime video calling application during the coup attempt to plead with the Turkish public to resist the](https://www.theguardian.com/world/video/2016/jul/15/erdogan-facetime-turkey-coup-attempt)\n[plotters. While restrictions on social media were softened to facilitate popular opposition to the coup,](https://www.wsj.com/articles/erdogan-embraces-social-media-to-repel-coup-attempt-in-u-turn-1468760698)\n[the openness was short lived, with Internet censorship returning (and even](https://www.cjr.org/opinion/turkey_coup_erdogan_press_freedom.php) [increasing) after Erdoğan](http://globalnetpolicy.org/wp-content/uploads/2017/02/Turkey1_v6-1.pdf)\nsuccessfully re-asserted his authority.\n\nAlthough there is widespread and growing popularity of social media in Turkey, which provides citizens\n[with an alternative to conservative state-controlled mainstream media, the country has one of the most](https://www.transparency.org/news/pressrelease/transparency_international_condemns_forced_takeover_of_media_organisations)\nextensive [Internet censorship regimes in the world. ISPs routinely throttle access to popular social](https://www.dailydot.com/layer8/turkey-censorship-real-life/)\nmedia, make frequent requests to service providers to remove content, and even implement occasional\n[regional shutdowns. According to](https://turkeyblocks.org/2016/10/27/new-internet-shutdown-turkey-southeast-offline-diyarbakir-unrest/) [Twitter’s transparency report, Turkey led the world with 2,710](https://transparency.twitter.com/en/removal-requests.html#removal-requests-jan-jun-2017)\nremoval requests in the first six months of 2017. Although Turkey’s numerous security threats, and in\n\n\n-----\n\nparticular those related to Islamist and other terrorist attacks, are provided as justifications for such\n[expansive controls, Internet censorship has included a broad range of other content such as criticism](https://www.theguardian.com/world/2017/apr/29/turkey-blocks-wikipedia-under-law-designed-to-protect-national-security)\nof the Erdoğan regime.\n\nThe first Internet-related legislation in Turkey was passed in 2007. It is called “Law No. 5651,\nRegulation of Publications on the Internet and Suppression of Crimes Committed by means of Such\nPublications,” or “Internet Law” for short. The Internet Law introduced Internet censorship across a\nrange of content categories and mandated service providers to monitor online content passing through\ntheir infrastructure. Additional laws and broader information controls were applied in the aftermath of\nthe 2013 Gezi [protests, including Law No. 6532, passed in April 2014, which criminalized “the leaking](http://www.bbc.com/news/world-europe-22924886)\nand publication of secret official information, punishable by a prison term of up to nine years.” The law\nauthorizes the Turkish intelligence agency, Milli İstihbarat Teşkilatı (MIT), to “collect data relating to\nexternal intelligence, national defense, terrorism, international crimes and cyber security passing via\ntelecommunication channels.” These laws and practices have imposed strict responsibilities on ISPs to\n[block and disrupt access to targeted URLs (in some cases through DNS poisoning), and to monitor and](https://www.internetsociety.org/blog/2014/04/turkish-hijacking-of-dns-providers-shows-clear-need-for-deploying-bgp-and-dns-security/)\n[archive Internet traffic for two years. The responsibilities have, in turn, prompted the acquisition of](https://www.dailydot.com/layer8/turkey-procera-deal-isps-dpi/)\n[mass and targeted surveillance technologies. A 2014 Citizen Lab report traced activity related to](https://www.dailydot.com/layer8/hacking-team-turkey/)\n[Hacking Team spyware to an IP address owned by Türk Telekom, and a 2015 report mapped FinFisher](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nspyware to Turkey.\n\nMIT’s practical implementation of the 2014 national security laws requires the cooperation of the\n[Turkish telecommunications sector, which is centralized around Türk Telekom. While technically a](https://www.btk.gov.tr/File/?path=ROOT%2F1%2FDocuments%2FPages%2FMarket_Data%2F2017_Q1_Eng.pdf)\n[private company, Türk Telekom is heavily controlled by the ruling AKP party. The AKP exerts influence](https://freedomhouse.org/report/struggle-turkeys-internet/infrastructure-and-independence-why-turkeys-telecomms-sector-not-keeping-pace-demand)\nover Türk Telekom through its supposed independent regulator, the Information and Communications\n[Authority (which is itself controlled by the state), as well as a large ownership stake controlled by the](https://freedomhouse.org/report/struggle-turkeys-internet/infrastructure-and-independence-why-turkeys-telecomms-sector-not-keeping-pace-demand)\n[Turkish Treasury department. The government’s direct influence over Türk Telekom was demonstrated](https://www.bloomberg.com/news/articles/2017-09-28/otas-lenders-are-said-to-seek-government-control-of-turk-telekom-j84cqgwf)\n[following the July 2016 coup attempt, when several Türk Telekom senior executives were purged from](http://www.capacitymedia.com/Article/3578650/Middle-East/Executives-quit-Trk-Telekom-after-failed-coup-attempt)\nthe company.\n\n## 4.2. Localizing the targets of Turkey’s malware injection\n\nIn a February 2018 scan of Turkey, we identified five different malicious domain names that were\ninjected in response to HTTP requests for Opera. We performed traceroutes for the targeted IP\naddresses and found targeting in at least five provinces, based on names we found in the furthest\ndownstream reverse DNS (PTR) record. Figure 7 shows the five provinces where we identified\ninjection.\n\n\n-----\n\n**Figure 7: Locations of the targets of spyware injection in Turkey and Syria.**\nOver five months of scanning we found a total of 259 targeted IP addresses. However, this is not a\ncomplete count of targeted IP addresses; we could only measure IP addresses that responded to our\nscans (i.e., had an open TCP port).\n\nWe were able to develop a general sense of target identities by scraping data from public router pages\nhosted on some of the IP addresses. The pages show names chosen by the people who set up the\nrouters, including names of users sharing the connection. In some cases, the names chosen were of\nSyrian cities. We conducted on-the-ground testing in one such Syrian city and found that all users of a\nparticular Internet reseller (sharing the same Türk Telekom IP) were targeted. We also found several\nrouter pages showing names containing “ypg” (e.g., ciwan.ypg and ypg-matar), indicating possible\ntargeting of YPG (Kurdish militia) members or facilities. We also found that some routers were named\nfor resellers in Turkey and Syria. We found Facebook pages for some of the named resellers which\nshowed images of the resellers building infrastructure to provide Internet access using Türk Telekom\nleased lines (Figures 8 and 9).\n\n\n-----\n\n**Figure 8: One Turkey-based reseller whose customers appear to be targeted builds a tower to**\n**beam Internet to border areas in Syria’s Afrin region.**\n\n\n-----\n\n**Figure 9: Images posted by one Syrian-based reseller in the Idlib area whose users appear to be**\n**targeted. The reseller appears to redistribute Türk Telekom service via VDSL in one Syrian**\n**village.**\nAfter we sent letters to Sandvine and Francisco Partners on February 12, 2018, we ran tests on\nFebruary 14 and February 16, 2018 which found that two targeted IP addresses– on which we had\nobserved injection since October 2017– no longer produced injection. We conducted a full scan of\nTurkey on March 7, 2018 and found that these two IP addresses again produced injection, but with\ndifferent domain names. Our March scan also found that the operators of the injection had changed\nsome of the injected domain names.\n\n\n**Malware domain (February**\n**2018)** **Malware domain (March 2018)**\n\n\n**Injection targets**\n**downstream from**\n**location**\n\n\nsolitude.file-download[.]today system.filedownloaders[.]com Hatay\n\nsystem.documentations[.]live epoch.englishdownloaders[.]today Gaziantep\n\n\nepiphany.downloaddocument[.]world\n\n\nepiphany.download-document[.]world Ankara (Ulus quarter)\n\n\nepoch.wind-files[.]today document.downloadingsystem[.]com Adana\n\n\ninternet.documentmanagement[.]today\n\n\ninternet.downloadingdocuments[.]com Diyarbakir\n\n\n### 4.3. Identifying targeted applications\n\nWe performed testing of targeted IP addresses to see what additional applications were being targeted.\nWe sent requests like the one in Figure 10 for a variety of paths and filenames matching popular\n[Windows software. We tested filenames associated with the IOCs from two earlier](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/) [reports, as well as](https://www.welivesecurity.com/2017/12/08/strongpity-like-spyware-replaces-finfisher/)\nthe top 20 Windows applications on Download.com (one of the IOCs from previous reports pointed to a\nfile called avast_free_antivirus_setup_online_cnet1.exe).\n\nGET [path] HTTP/1.1\n\nConnection: close\n\n**Figure 10: Form of requests that we sent to test for targeted applications.**\n\nWe found at least ten applications whose downloads were targeted for spyware injection. Figure 11\nlists the targeted applications we found, and for each application, a non-exhaustive list of websites\nwhere targeted users’ downloads of these applications would be injected with spyware.\n\n\n**If a user visits this site to**\n**download the application, the**\n**path will be fetched**\n**unauthenticated over HTTP**\n\n\n**Path**\n\n\n**Which**\n**application**\n**does this path**\n**typically**\n**correspond to?**\n\n\n/opera/stable/windows Opera opera.com\n\n/vlc-2.2.8-win32.exe VLC download.videolan.org[8]\n\n\n-----\n\n**If a user visits this site to**\n**download the application, the**\n**path will be fetched**\n**unauthenticated over HTTP**\n\n\n**Path**\n\n\n**Which**\n**application**\n**does this path**\n**typically**\n**correspond to?**\n\n\n/ccsetup539.exe CCleaner ccleaner.com\n\ndownload.com\n\n/wrar550.exe WinRAR 32-bit download.com\n\n\n/wrar540tr.exe WinRAR 32-Bit\nTurkish\n\n\n?\n\n\n/winrar-x64-550.exe WinRAR 64-bit download.com\n\n\n/winrar-x64-550tr.exe WinRAR 64-Bit\nTurkish\n\n\n?\n\n\n/7z1701.exe 7-Zip 7-zip.org\n\n/7z1701-x64.exe 7-Zip (64-bit) 7-zip.org\n\n\n/avast_free_antivirus_setup_online.exe\n\n/avast_free_antivirus_setup_online_cnet1.exe\n\n\nAvast Antivirus avast.com\n\ndownload.com\n\n\n/driver_booster_setup.exe Driver Booster iobit.com\n\n/SkypeSetup.exe Skype download.com\n\n\n/advanced-systemcare-setup.exe Advanced\nSystemCare\n\n**Figure 11: Applications targeted for spyware injection in Turkey.**\n\n\niobit.com\n\n\nSome of these websites supported HTTPS, but did not redirect users to the HTTPS version when\ndirectly visited. As an example, when a user visited opera.com (the unencrypted version), they were\nnot redirected to the HTTPS-encrypted version automatically. According to Internet Archive data,\n[Opera seems to have fixed the issue on March 7, 2018, between 07:26GMT and](https://web.archive.org/web/20180307072628/opera.com) [16:04GMT.](https://web.archive.org/web/20180307160458/opera.com)\nSurprisingly, some websites we tested, like avast.com, iobit.com, and ccleaner.com, used HTTPS on\ntheir main website but directed users to download links that did not use HTTPS.9 While the user saw\nan HTTPS page in their browser, the file that the page downloaded to their computer was via HTTP\n(Figure 12). Targeted users in Turkey and Syria would have received spyware instead of the legitimate\nversion of the app. Sometime after February 13, 2018, Avast fixed [one page on their avast.com site to](https://www.avast.com/index)\n[use HTTPS for downloads. However, as of the publication date of this report, another page on](https://www.avast.com/en-us/free-antivirus-download)\n**avast.com redirects users to an insecure download on download.com. Piriform fixed their**\n**ccleaner.com site to use HTTPS for downloads sometime after February 23, 2018. Also, as of the**\ndate of publication, some websites we list in Figure 11 do not appear to support HTTPS at all,\nincluding download.com, 7-zip.org.\n\n\n-----\n\n**Figure 12: The Avast website in February 2018, showing an HTTPS padlock while automatically**\n**starting an insecure file download. The lack of HTTPS on the file download means that targeted**\n**users in Turkey and Syria will instead receive spyware. Avast fixed this particular issue in late**\n**February 2018.**\nThis situation can be particularly problematic for activists who may rely on advice to use apps like\n[CCleaner and Avast. For example, the digital security guide Security in a Box](https://securityinabox.org/en/) advises the use of both\nproducts and links to the official websites of these products, both of which offered insecure downloads.\n\n## 4.4. Connection with FinFisher campaign\n\nVirusTotal records that a [sample of StrongPity-like spyware communicating with updserv-east-](https://www.virustotal.com/en/file/0a94c5ad0b6466b53ca363673dbac7b3e97030c4121048042f34f38769444ea8/analysis/)\ncdn3[.]com was downloaded from download.downloading[.]shop, the same site used to distribute\n[samples of FinFisher. The updserv-east-cdn3[.]com server was also the command and control (C&C)](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nserver for the samples of StrongPity-like spyware downloaded in a subsequent phase of the injection\ncampaign that we observed, from sites including downloading[.]internetdownloading[.]co and\ndownloading[.]syriantelecom[.]co.\n\n## 5. AdHose: Mass connection hijacking to deliver affiliate ads in Egypt\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic fingerprint is_\n_installed on Telecom Egypt’s network at Egypt’s borders, and is used to deliver affiliate ads,_\n_cryptocurrency mining scripts, and perhaps nation-state spyware, to Egyptian Internet users._\n\n## 5.1. Egypt background: malware, surveillance, and censorship\n\nSeven years after the 2011 demonstrations in Cairo’s Tahrir Square, Egyptian President Abdel Fattah\nel-Sisi has escalated a violent crackdown against opposition and dissent. Under the guise of combating\n[terrorism particularly following a series of ISIS church bombings the el-Sisi government has engaged](https://www.theguardian.com/world/2017/apr/09/egypt-coptic-church-bombing-death-toll-rises-tanta-cairo)\n\n\n-----\n\nin [mass arrests, forced disappearances, and torture against targeted journalists, human rights](https://www.amnesty.org/en/countries/middle-east-and-north-africa/egypt/report-egypt/)\ndefenders, and protesters. The brief window opened during the Arab Spring period has closed as elSisi has sought to strengthen his rule and silence critics of his regime.\n\nThe Egyptian government has been widely criticized for its human rights abuses and corruption. A May\n[2017 law ratified by el-Sisi was criticized as stifling dissent as it imposes new restrictions on foreign](https://www.hrw.org/news/2017/06/02/egypt-new-law-will-crush-civil-society)\nNGOs, subjects groups to additional security monitoring and financial reporting requirements, and\n[imposes heavy fines on groups who publish without government permission. Reporters Without](https://www.transparency.org/news/pressrelease/egypt_stop_the_onslaught_against_civil_society)\n[Borders has ranked Egypt 161st out of the 180 countries it included in its 2017 World Press Freedom](https://rsf.org/en/egypt)\n[Index. More than 15,000 civilians have been tried in military courts since 2014, and more than 800](https://www.hrw.org/world-report/2018/country-chapters/egypt)\npeople have been sentenced to death since 2013. Corruption is also endemic across all of society in\nEgypt, in spite of numerous attempts by various government agencies to reign it in. Transparency\n[International ranked Egypt 108 out of 176 countries in its 2016 Corruption Perceptions Index.](https://www.transparency.org/country/EGY)\n\n[Egypt adopted a new constitution following a January 2014 referendum. While the revised constitution](https://www.theguardian.com/world/2014/jan/18/egypt-constitution-yes-vote-mohamed-morsi)\ndoes contain provisions protecting freedom of expression, access to information, and freedom of the\npress, [it also contains exceptions which allow censorship during periods of war or state of emergency.](https://freedomhouse.org/report/freedom-press/2017/egypt)\nPrior to the 2011 Arab Spring, Egypt had generally been under a continuous state of emergency since\n1958. Following a short reprieve in 2012, successive Egyptian governments have repeatedly\n[reimposed emergency rule, and most recently in January 2018. Such](https://www.reuters.com/article/us-egypt-security/egypt-to-extend-state-of-emergency-for-3-months-mena-idUSKBN1ER1B0) declarations expand the arrest\nand detention powers of security forces and permit media censorship. El-Sisi has also targeted the\ncountry’s judiciary by ratifying a bill which empowers him to select the courts’ chief justices. Several\n[potential political candidates have been arrested or face intimidation and physical violence in advance](https://www.aljazeera.com/news/2018/02/egypt-curbs-opponents-presidential-election-180207095350993.html)\nof the March 2018 Presidential election. The election, which is virtually guaranteed to see el-Sisi\n[elected to a second term, has been widely criticized as undemocratic.](http://foreignpolicy.com/2018/01/24/egypts-undemocratic-election/)\n\n[Telecommunications surveillance is facilitated under the 2003 Telecommunications Regulation Law.](https://www.unodc.org/res/cld/document/egy/2003/egypt_telecommunication_regulation_act_english_html/Egypt_Telecommunications_Act_English.pdf)\nThis law compels telecommunications operators to provide technical capacity for the military and\nnational security entities to “exercise their powers within the law” as well as prohibiting the use of\n“telecommunication services encryption equipment” without written authorization from entities including\nthe armed forces. [Article 73 of the Telecommunications Law prohibits telecommunications providers](https://internetlegislationatlas.org/#/countries/Egypt/frameworks/surveillance)\nfrom interfering with any part of a telecommunication message.\n\nThe ongoing crackdown against critical voices has extended to online censorship. The pre-Arab Spring\nMubarak government did not engage in widespread online censorship. However reports of censorship\n[have increased in recent years. Testing conducted by the OONI project in 2016](https://ooni.torproject.org/post/egypt-network-interference/) [confirmed reporting](https://www.theguardian.com/media/2016/jan/05/saudi-arabia-uae-egypt-block-access-qatari-news-website)\nthat Qatari-owned news website The New Arab and its Arabic language version were blocked.\n\nCensorship in Egypt has also reflected regional concerns. Egypt, and four other Arab states including\n[Saudi Arabia, have accused Qatar of supporting terrorism and destabilizing the region. In response,](https://www.aljazeera.com/news/2017/07/egypt-compromise-dispute-qatar-170725132801327.html)\nEgypt was reported in May 2017 to have blocked access to 21 news websites for “supporting terrorism\nand spreading false news”. The blocked websites included Qatar-based Al Jazeera as well as\n[prominent local independent news website Mada Masr. In September 2017](https://www.theguardian.com/world/2017/may/25/egypt-blocks-access-news-websites-al-jazeera-mada-masr-press-freedom) Egypt blocked the Human\nRights Watch website one day after HRW [released a report documenting the use of torture by the](https://www.hrw.org/report/2017/09/05/we-do-unreasonable-things-here/torture-and-national-security-al-sisis-egypt)\ncountry’s security services.\n\n\n-----\n\nThe use of surveillance technology by the Egyptian government has been widely documented,\nparticularly the technologies operated by an obscure intelligence agency called the Technical Research\n[Department (TRD). A 2015 Citizen Lab report identified that a server used in the operation of FinFisher](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nsurveillance malware was present on networks operated by the TRD. Similarly, Privacy International\nobtained documents leaked from Nokia Siemens Networks which showed that the company sold an\ninterception management system and monitoring centre to the TRD. The leaked emails from\nsurveillance company Hacking Team indicated that the company had sold its surveillance malware\nsystem to the TRD for more than 1 million Euros.\n\n[A 2017 Citizen Lab report documented a large-scale phishing campaign against Egyptian civil society](https://citizenlab.ca/2017/02/nilephish-report/)\n[members. Virtually all of the targets identified in this report were implicated in Case 173, a legal case](https://www.amnesty.org/en/latest/campaigns/2016/12/close-case-173/)\nbrought by the Egyptian government against domestic NGOs. In this case, the government has\naccused NGOs of improperly receiving foreign funding and engaging in prohibited activities.\n\n## 5.2. Following up on earlier findings\n\n[A September 2017 report found FinFisher spyware injected via HTTP 307 redirect matching the format](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\n[in Figure 1 using the URL http://108.61.165[.]27/setup/TrueCrypt-7.2.rar,](http://10.10.0.46/about:blank)\n(024d37333bf79796813e76ada77720cd according to VirusTotal). That FinFisher sample’s command\nand control (C&C) server is 199.195.193.34. We found another FinFisher sample\n(3947a9c9099d4728ff2ceaed2bd7edb3) with the same C&C; VirusTotal records the sample as being\ndownloaded from http://185.82.202[.]133/setup/Threema.rar. When we tested 185.82.202.133, we\nfound that it was running cPanel, and the email address associated with the cPanel installation was an\n[email address we know to be associated with the TRD based on past work the Citizen Lab has](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nconducted. We conducted Internet scanning of Egypt, sending every IPv4 address an HTTP request to\ndownload the TrueCrypt setup file, but did not find any spyware injection. However, we discovered a\nsystem we call AdHose that was redirecting Egyptian Internet users to affiliate ads and cryptocurrency\nmining scripts.\n\n\n-----\n\n**Figure 13: Diagram of how AdHose seems to work in Egypt.**\nWe identify two modes of AdHose. In spray mode, a middlebox redirects Egyptian Internet users en\nmasse to ads or cryptocurrency mining scripts whenever they make a request to any website. In trickle\n_mode, only requests to certain URLs are redirected. It appears that spray mode is enabled sparingly,_\nwhereas trickle mode appears to be in operation mostly continuously.\n\n## 5.3. Discovering AdHose\n\nWhen checking Shodan for HTTP 307 redirects (Section 3.2), we noticed a large number of redirects\nreturned by Egyptian IPs to what appeared to be an advertising site (Figure 14). The site embedded\nfurther redirects to affiliate ads.\n\nHTTP/1.1 307 Temporary Redirect\n\nLocation: http://static.dbmads.com/static.html\n\nConnection: close\n\n**Figure 14: Suspicious HTTP redirect returned by Egyptian IPs.**\n\nWhile we were conducting an (unrelated) scan of the IPv4 Internet (from outside Egypt), we captured\nthese redirects being injected, solely for IP addresses in Egypt. The redirects were injected during 32\nminutes of our scan (on January 8, 2018 between 10:23:36 – 10:55:12 Egypt time). The advertising\n\n\n-----\n\nredirects were injected in response to requests we sent of the form in Figure 15 (where %s is the IP\naddress we were scanning).\n\nGET / HTTP/1.1\nHost: %s\nUser-Agent: Mozilla/5.0\n\n**Figure 15: HTTP request sent by our scan that elicited ad injection.**\n\nThe PCAPs we recorded during our scan show that each instance of injection matches our entire\nfingerprint in Section 3.3. Namely, all injected packets have IPID = 13330, no IP flags, match the\nexpected 307 Redirect format, and involve the packet injector sending an unsolicited final ACK packet\n~100ms after injecting the redirect. This indicates that the redirect was likely being injected by\nSandvine PacketLogic devices as configured by the operators.\n\nDuring the 32 minutes on January 8 when injection was active, we both scanned and received a\nresponse containing data from 3,337 IP addresses in 27 ASNs in Egypt (as determined by MaxMind\nGeoLite2 country database). 1,239 IP addresses in 17 ASNs returned the advertising redirect, for an\n**injection rate of ~38%. This appears to be an instance of the AdHose spray mode. Figure 16 shows**\nthe ASNs in which we observed injections, indicating that the middleboxes used for injection are\nupstream from these ASNs.\n\n**ASN #** **ASN Description**\n\n24863 Link Egypt (Link.NET)\n\n8452 Telecom Egypt (TE)\n\n20928 Noor\n\n36992 Etisalat Misr\n\n24835 Vodafone / Raya Telecom\n\n37031 Misr Information Services & Trading (MIST)\n\n36935 Vodafone\n\n37069 Mobinil\n\n33785 City Net Telecom\n\n30993 Egypt Centers\n\n20484 Yalla Online\n\n36408 CDNetworks\n\n328067 EGIT\n\n31619 City Stars\n\n31065 Egyptian Ministry of Communications and Information Technology (MCIT)\n\n\n-----\n\n**ASN #** **ASN Description**\n\n25576 Armed Forces Main information Center (AFMIC)\n\n15475 Nile Online (NOL)\n\n**Figure 16: ASNs where we observed injection in Egypt.**\n\n## 5.4. A multi-year campaign\n\n### OONI’s report and data\n\nOur data matches up with findings that the network interference measurement project OONI published\nin August 2016. OONI’s work revealed affiliate ad injection when users attempted to access certain\npornography websites in Egypt. OONI’s findings matched all elements of the fingerprint we described\nin Section 3.3, which suggests that the ad injection they identified in 2016 was also the result of\nSandvine PacketLogic devices as configured by the operators.\n\nAdditional historical OONI data that we reviewed showed evidence that two domains, copticpope[.]org\n(the former website of the Pope of the Coptic Orthodox Church of Alexandria) and babylon-x[.]com (a\nformer pornographic website), have been targeted by AdHose in trickle mode. As a result, visitors to\nthese websites were continuously redirected to ads, regardless of whether spray mode was active. We\nconfirmed these findings in our own scans in February 2018. We also identified an October 2016 post\non Webhostingtalk which indicated that visitors to a free web counter JavaScript file,\nhttp://s10.histats[.]com/js15.js, were redirected to advertisements linked to the infinitads[.]com domain.\nWe tested accessing this URL from within Egypt and found that it is targeted by AdHose in trickle\nmode.\n\n### Censys captures AdHose spray\n\nWe found that the 7547-cwmp-get-full_ipv4 Censys scan10 performed on January 3, 2018 captured\n**AdHose** **in** **spray mode between 15:50:23 – 16:32:02 local time. Censys both scanned and received**\na response containing data from 5,702 IP addresses in four ASNs in Egypt during this period. Of these\n5,702 IPs, 5,443 in four ASNs returned the advertising redirect, for an injection rate of ~95%.\n\n### Enumerating affiliate IDs\n\nWe looked at historical OONI data and enumerated all HTTP 307 redirects within Egypt that did not\nmatch the domain from which they were redirected. Within this list, we looked for any domains returned\nwhich appeared to be domains hosting advertising pages (for example, we manually filtered out\ndomains that appeared to be ISP or billing notifications). To this list, we added the injected domains\nthat OONI previously reported.\n\nWe then gathered all copies of all pages on these domains archived by the Internet Archive, and\nlooked for affiliate links included in the HTML source of the webpages (or any pages they redirected\nto). We also manually visited URLs in cases where the Internet Archive did not retain past copies. As a\nresult of this process, we obtained the list of affiliate links and IDs we believe were used by the AdHose\noperators, shown in Figure 17.\n\n\n-----\n\n**Ad Network** **Affiliate Link** **Affiliate IDs**\n\n\nAdvertising\nTechnologies\nLtd.\n\nTerra\nAdvertising\nCorp\n\n\nhttp://go.pub2srv[.]com/afu.php?\nzoneid=1251527\nhttp://go.ad2upapp[.]com/afu.php?\nid=1209127\n\nhttp://go.ad2upapp[.]com/afu.php?\nid=773263\n\nhttp://go.ad2up[.]com/afu.php?id=862744\n\nhttp://go.ad2up[.]com/afu.php?id=758873\n\nhttp://go.ad2up[.]com/afu.php?id=773263\n\nhttp://go.oclasrv[.]com/afu.php?id=896707\n\nhttp://go.ad2upapp[.]com/afu.php?\nid=723454\n\nhttp://go.deliverymodo[.]com/afu.php?\nid=723454\n\nhttp://www.hitcpm[.]com/watch?\nkey=e4c634c55ad300b85c8760d9e09104cd\nhttp://www.urldelivery[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://cs6hm[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://cpm10[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://www.clicksgear[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\n\n723454\n758873\n\n773263\n\n862744\n\n896707\n\n1209127\n\n1251527\n\ne4c634c55ad300b85c8760d9e09104cd\n3e73d64a401c1e5b8b3eb33316b711e0\n\n125652\n175258\n\n2692073\n\n\nAdvertica.ae https://ylx-4[.]com/fullpage.php?\nsection=General&pub=175258&ga=g\nhttps://ylx-4[.]com/fullpage.php?\nsection=General&pub=125652&ga=g\n\n(Unidentified) http://conceau[.]co/out?\nzoneId=2692073&htatb=1&sId=2692073\n\n\nCoinhive\n(Monero\ncryptocurrency\nmining)\n\n\nhttp://cnhv[.]co/fmwi\n\n\n**Figure 17: Affiliate links we believe were used by AdHose operators.**\n\n\n-----\n\nWe saw a significant overlap between the ad networks mentioned in the OONI report and AdHose. For\nexample, we saw in the hosting history that static.dbmads[.]com forwarded users to ad2upapp[.]com,\nwhich was mentioned in the initial OONI report. Additionally, the infinitads[.]com domain mentioned in\nthe OONI report was forwarded to static.dbmads[.]com at several points in time. This overlap suggests\nto us that the same actors have been involved since at least October 2016.\n\n## 5.5. Localizing Egypt’s middleboxes\n\nWe conducted tests that localized the AdHose middleboxes to a Telecom Egypt demarcation point.\n\nWe noticed that for AdHose, the redirects were injected upon receipt of an HTTP response, rather than\nan HTTP request. In this case, sending a request to a server did not trigger an injected response\nunless the server received the request, and returned a proper HTTP response.\n\nWe verified that we could configure our second-hand PacketLogic device to inject on responses rather\nthan requests, such as by adding a condition on the injection rule that would not be known until the\ndevice saw the response (e.g., the condition “HTTP response code == 200”).\n\n### Test 1: localizing AdHose\n\nBecause AdHose only injects data in response to HTTP responses, sending TTL limited HTTP\nrequests cannot localize AdHose. We instead sent a TTL-limited FIN/ACK packet after properly\nestablishing a TCP connection, but before sending a default-TTL HTTP request with a Host header for\none of the AdHose domains (copticpope[.]org). By varying the TTL of the FIN/ACK packet, we could\nidentify the link on which the middlebox first saw the FIN/ACK (and the end-host in Egypt did not). We\nhypothesized that when the middlebox first saw the FIN/ACK, it might consider the connection closed\nand not perform any injection on the server’s response. Thus, we would expect to find some number X,\nwhere setting the TTL to Y (≥ X) would cause us to receive the legitimate response from the server,\nand setting the TTL to Z (< X) would cause us to receive the redirect injected by AdHose.\n\nWe did indeed observe this behavior; the first link on which we saw the legitimate response from the\nend-host in Egypt (and not the injected response) was between 130.117.50.166\n(be3093.ccr22.mrs01.atlas.cogentco.com) and 149.14.125.162 (telecom-egypt.demarc.cogentco.com),\nwhich appears to be a cable link between Marseilles, France, and Egypt.\n\n### Test 2: localizing censorship\n\nIn this test, we found that the same device that was running AdHose was also performing Internet\ncensorship in Egypt. We localized the censorship functionality of the device by sending a TTL-limited\nHTTP request to a blocked website (www.aljazeera.net). By varying the TTL of the HTTP request, and\nobserving whether we received an injected RST/ACK packet, we could identify the link where the\ndevice first saw the request.\n\nThe first link on which we saw an injected RST/ACK packet was between 130.117.50.166\n(be3093.ccr22.mrs01.atlas.cogentco.com) and 149.14.125.170 (telecom-egypt.demarc.cogentco.com),\nwhich appears to be the same cable link that we found in Test 1.\n\nGiven that we localized both AdHose and Internet censorship to the same link, we believe that the\nsame PacketLogic device is being used to carry out both functionalities.\n\n\n-----\n\n## 6. Egypt & Turkey Censorship Testing\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic fingerprint is_\n_blocking political and human rights content in Egypt and Turkey._\n\n## 6.1. Websites blocked\n\nIn Egypt, we found that devices matching our Sandvine PacketLogic fingerprint are being used to block\ndozens of human rights, political, and news websites including Human Rights Watch, Reporters\nWithout Borders, Al Jazeera, Mada Masr, and HuffPost Arabi. In Turkey, we discovered that these\ndevices are being used to block websites including every language version of Wikipedia, the website of\nthe Dutch Broadcast Foundation (NOS), and the website of the PKK (Kurdistan Workers’ Party).\n\nThe blocking is implemented by injecting TCP reset packets. The TCP reset packets have IPID 13330,\nand no IP flags, and match our fingerprint (Section 3.3). These characteristics suggest that Sandvine\nPacketLogic devices are being used to carry out the blocking.\n\n## 6.2. Website blocking in PacketLogic\n\nWe tested blocking a website using our second-hand Sandvine PacketLogic device (Section 3.3). This\ntest involved creating a PropertyObject to match requests whose hostname was hrw.org and then a\n_Filtering Rule that terminates all connections matching the Property Object by using the built-in Reject_\naction.\n\n**Figure 18: How we set up our PacketLogic device to block the website of Human Rights Watch.**\n**We believe a similar setup exists in Egypt.**\nRequests with an HTTP host header of hrw.org were terminated by an injected RST packet. Requests\nwith a TLS client hello message with the SNI extension set to hrw.org were also terminated.\n\n\n-----\n\nOur experiment (Figure 19, Figure 20) matched elements 1-4 of our fingerprint. Note that the\ntimestamp discrepancy in the PCAP files is because the server and client clocks were not\nsynchronized.\n\n**Client sends GET request for hrw.org**\n\n17:34:54.213576 IP (tos 0x0, ttl 64, id 0, offset 0, flags [DF], proto TCP (6), length 123)\n192.168.1.27.49482 > 192.168.1.26.8080: Flags [P.], seq 1:72, ack 1, win 4117, options [nop,nop,TS\nval 756752097 ecr 2094875405], length 71: HTTP, length: 71\nGET / HTTP/1.1\nHost: hrw.org\nUser-Agent: curl/7.54.0\nAccept: */*\n\n**Client receives injected RST/ACK**\n\n17:34:54.213805 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length 40)\n192.168.1.26.8080 > 192.168.1.27.49482: Flags [R.], seq 1, ack 72, win 32120, length 0\n\n**Figure 19: PacketLogic content blocking via Reject rule from the client side.**\n\n**Server receives injected RST/ACK**\n\n17:34:36.051889 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length 40)\n192.168.1.27.49482 > 192.168.1.26.8080: Flags [R.], seq 72, ack 1, win 32120, length 0\n\n**Figure 20: PacketLogic content blocking via Reject rule from the server side.**\n\n## 7. Communication with Sandvine and Francisco Partners\n\n[Citizen Lab sent letters to executive leadership at Sandvine and to Procera Networks/Sandvine owner](https://citizenlab.ca/wp-content/uploads/2018/03/February-12-2018-letter-from-Citizen-Lab-to-Sandvine.pdf)\n[Francisco Partners on February 12, 2018. Our letters notified the companies of our research findings](https://citizenlab.ca/wp-content/uploads/2018/03/February-12-2018-letter-from-Citizen-Lab-to-Francisco-Partners.pdf)\nand raised questions concerning their human rights impact. We received an initial response from both\ncompanies on February 13 which confirmed their receipt of our letters and indicated that they would\nprovide us with a reply.\n\nA [February 16, 2018 letter from Sandvine laid out the company’s response in more detail,](https://citizenlab.ca/wp-content/uploads/2018/03/February-16-2018-letter-from-Sandvine.pdf)\ncharacterizing the statements in our letter as “false, misleading, and wrong”; demanding return of the\nsecond-hand PacketLogic device that we used to confirm attribution of our fingerprint; describing\nSandvine’s “Comprehensive Business Ethics Program”; and noting that any public statements we\nmake “that are factually inaccurate or based on improper use of [the PacketLogic] product . . . will be\nmet with vigorous fact-based rebuttal and a strong legal response . . . .” Citizen Lab replied to this\nemail the same day noting that we had withdrawn the original publication date to carefully review the\npoints they raised and undertake further due diligence.\n\nSandvine asserted in its February 16 letter that its PacketLogic product “is not capable of Man-in-theMiddle (MITM) attacks and not capable of any form of payload injection, malicious or not,” and that\nCitizen Lab’s findings were therefore incorrect. Our research, however, does not suggest that the\nPacketLogic device is capable of injecting traffic with the malicious code outright. Rather, the spyware\n\n\n-----\n\ninjection and advertising injection were carried out by injecting HTTP 307 redirects that caused a\ntarget’s browser to automatically fetch malicious code from a separate website. As described in\n**Section 2, the injection of various HTTP redirects is an established spyware and advertising injection**\ntechnique. Additionally, Sandvine acknowledged in its letter that the PacketLogic design “does not\npermit the end user to inject a payload larger than 1 packet.” This assertion, indicating an injection of\none packet is possible, is consistent with our findings regarding the injection of a redirect command,\nwhich is one packet in size.\n\nNotably, in the February 16 letter, Sandvine also expressed its commitment to the ethical use of its\nproduct. It referred to the company’s [webpage regarding “Ethics and Human Rights protection at](https://www.sandvine.com/company/corporate-ethics)\nSandvine,” which provided:11\n\n_A key part of [Sandvine’s] innovation process is to ensure that we do not lose sight of the ethical impact_\n_of our technology on human rights, freedom of speech, and privacy. Sandvine has taken the approach_\n_on regulating access to the components of our solutions that could be used to infringe on any of these._\n_The usage of our regulatory compliance solutions are controlled by a EULA and software licenses that_\n_are required for any components that could conceivably be used to violate human rights, freedom of_\n_speech, and privacy._\n\nThe letter noted that Sandvine’s EULA prohibits injection of malicious payloads. The letter also\nindicated that the company maintains a Business Ethics Committee (BEC) “to review and approve the\nsale of products and services to customers.” The webpage details how Sandvine’s BEC uses “the\n[World Bank Index” (an apparent reference to the Worldwide Governance Indicators) to review sales to](http://info.worldbank.org/governance/wgi/#home)\ncertain countries. The BEC assesses the indicators associated with the following areas of governance:\nvoice and accountability (which includes freedom of expression-related indicators); political stability and\nabsence of violence/terrorism; rule of law; and control of corruption. The Sandvine webpage states:\n\n_Any country not rated an “A” by the World Bank must be approved by the BEC and a certificate of_\n_compliance signed by the customer acknowledging that they will not use the technology to violate_\n_human rights based on the regulatory compliance use case(s) deployed. Sandvine employees and_\n_resellers are prohibited from selling solutions to countries that are embargoed or sanctioned by the EU,_\n_US, and/or UN or are rated a “D” by the Word Bank._\n\nIt is unclear, however, what letter grade ratings are referred to in this policy, or how they are\ndetermined, as the Worldwide Governance Indicators provide percentile rankings for countries rather\nthan a letter grade.\n\n\nWhile Sandvine did not comment on the existence or any aspect of business dealings in Egypt or\nTurkey, citing contract confidentiality clauses, the BEC assessment process it outlines would appear to\n[apply to sales in both countries. The Worldwide Governance Indicators reflect the following 201612](http://info.worldbank.org/governance/wgi/#reports)\npercentile rankings (0 to 100) for Egypt and Turkey in the categories utilized by Sandvine’s BEC:\n\n\n**Voice and**\n**accountability**\n\n\n**Political stability and absence of**\n**violence / terrorism**\n\n\n**Rule of**\n**law**\n\n\n**Control of**\n**corruption**\n\n\nEgypt 14 9 36 32\n\nTurkey 30 6 49 50\n\n\n-----\n\nThe low percentile rankings assigned to those countries — single digits in the political stability and\nabsence of violence / terrorism” category, and in no case surpassing 50th percentile — suggest at a\nminimum that the BEC would have been called upon to assess and approve any such sales that took\nplace, and require certificates of compliance from the customers.\n\nOn February 20, 2018, [Francisco Partners sent its own response to our letter, emphasizing that the](https://citizenlab.ca/wp-content/uploads/2018/03/February-20-2018-email-from-Francisco-Partners.pdf)\nfirm “recognizes the importance of corporate governance and social responsibility.” The firm went on to\nstate: “We spend considerable time and effort regarding the thoughtful development and\nimplementation of proper governance and social responsibility policies and processes for Francisco\nPartners and for the companies in which we invest.” The firm noted that, as an investor, it works “with\ncompany management teams to enhance (where necessary) and to implement robust corporate\ngovernance principles, business processes and policies, and business strategy, including social\nresponsibility policies and practices.” It also “mandates the adoption of compliant business ethics\npolicies and processes. Where appropriate, such policies and processes are based on, among other\nthings, the engagement of outside parties and a variety of benchmarking information sources, including\nWorld Bank information.”\n\nOn March 1, 2018, [Citizen Lab replied to Sandvine. We emphasized that we were confident in our](https://citizenlab.ca/wp-content/uploads/2018/03/March-1-2018-letter-from-Citizen-Lab-to-Sandvine.pdf)\nresearch findings, which two independent peer reviews confirmed. We also posed additional questions\n[regarding Sandvine’s business ethics program. On March 7, 2018, Sandvine sent a letter to the](https://citizenlab.ca/wp-content/uploads/2018/03/March-7-2018-letter-from-Sandvine.pdf)\nUniversity of Toronto, expressing its continuing concern that the Citizen Lab report “will contain false,\ninaccurate and misleading information that has the potential to do significant harm to the company, its\nshareholders and its customers.” Sandvine “demand[ed] that the report not be released publicly at this\n[time” and laid out the reasons for that demand. External counsel responded to Sandvine’s letter on](https://citizenlab.ca/wp-content/uploads/2018/03/UofT-Sandvine-Letter-to-Lyndon-Cantor-signed-8-March-2018.pdf)\nbehalf of the University of Toronto and Citizen Lab on March 8, 2018.\n\n## 8. Conclusion: Dual-Use Technology, Unrestrained\n\nDeep packet inspection technology is now ubiquitous across network environments. DPI devices\nsupporting network injection can be used by ISPs for a range of ostensibly legitimate uses, from\nalerting users to billing issues to bandwidth cap limits — all broadly marketed under the rubric of what\nDPI companies refer to benignly as “Quality of Service” or “Quality of Experience.” However, as our\ninvestigation demonstrates, network injection can also be used for harmful purposes. Depending on\nhow DPI systems are configured, they may even present serious human rights risks, such as censoring\naccess to content or, worse, silently infecting users with malware, and all without the person affected\nby the censorship or targeted by the malware realizing what has occurred. Evidently, the technology\ncan also be easily repurposed for mass-scale revenue scams.\n\nDespite the risks of harms and abuses, the market for this powerful technology remains largely\nunregulated. Export controls that were agreed upon within the framework of the Wassenaar\nArrangement explicitly exclude “systems or equipment, specially designed for . . . a. Marketing\npurpose; b. Network Quality of Service (QoS); or c. Quality of Experience (QoE)” from the scope of\ncontrolled IP network communications surveillance systems or equipment. Yet the integration of\nfunctions, including network injection, in a customizable, multipurpose network solution raises difficult\nquestions regarding end use determinations and proper methods for prevention of misuse of the\ntechnology.\n\n\n-----\n\nRegardless of the specific business sector, all companies have a responsibility to prevent the misuse of\ntheir products and services in ways that undermine human rights. The UN Guiding Principles on\nBusiness and Human Rights note that businesses should “avoid causing or contributing to adverse\nhuman rights impacts” and “address such impacts when they occur.” Moreover, the UN Guiding\nPrinciples clarify that companies should “seek to prevent or mitigate adverse human rights impacts that\nare directly linked to their operations, products or services by their business relationships, even if they\nhave not contributed to those impacts.” As described in this report, however, Sandvine appears to have\nprovided such tools in Turkey and Egypt — two countries with documented poor human rights records\n— and may have serviced these tools on the ground as well. Additionally, prior reporting of internal\ncompany discussions at Procera Networks show clearly that concerns were raised inside the company\nabout equipping the Turkish regime with technology that could be used for surveillance. The company\nis or should be aware of the potential for misuse of its product in Turkey. Despite the human rights\nconcerns raised, Sandvine/Procera evidently chose to move ahead with provision of technology to\nTurkey.\n\nThe apparent use of Sandvine technology to engage in network injection in Egypt and Turkey is even\nmore troubling in light of the “strong safeguards” that Sandvine asserts it maintains “regarding social\nresponsibility, human rights, and privacy rights.” Sandvine appears to have technical means in place to\nprevent misuse of its technology, noting in its February 16 letter that it “implements stringent software\nlicense controls that limit access to specific product capabilities outside of an intended use case.” The\nmalicious and dubious activities that appear to have been conducted through the use of PacketLogic\ndevices as documented in this report suggest that Sandvine’s safeguards have come up short —\ndespite the Procera controversy over dealings in Turkey that was publicly reported in 2016, which put\nthe company on notice of the potential human rights impact of sales and services in Turkey. We\nrecommend that Sandvine engage in regular consultation with civil society regarding its human rights\ndue diligence and business ethics program, and enhance transparency surrounding its sales review\nprocess and post-sale technical controls. We also recommend that Sandvine establish an operationallevel grievance mechanism, in line with the UN Guiding Principles on Business and Human Rights, to\naddress incidents of misuse of its products, and clearly communicate to the public how to report\nconcerns,13 the timeframe in which one can expect to receive a response, and remedial action taken.\n\nWe recommend that both dual-use technology developers and investors carefully consider their human\nrights policies and due diligence practices in light of the changing regulatory and social landscape and\ngrowing expectations surrounding corporate social responsibility. Francisco Partners in particular\nappears to have targeted dual-use technology companies as a lucrative sector for investment, given\nthe company’s prior investment in companies such as Blue Coat and NSO Group. Proactive efforts\nwithin the firm to incorporate and promote human rights due diligence, as Francisco Partners touched\non in its correspondence, could help address the risks of abuse present in this sector. We recommend\nthat Francisco Partners publicly release its own corporate social responsibility policies and practices,\nas well as those that it promotes among its investment companies, and engage with civil society in a\ntransparent manner regarding how those policies and practices could be improved. We also\nrecommend that government entities, including the newly established Canadian Ombudsperson for\nResponsible Enterprise (which would have jurisdiction over Sandvine as a corporation based in\nCanada), consider the significant human rights implications of network tools capable of network\ninjection in responding to the lack of oversight, transparency, and accountability in the surveillance\nmarket.\n\n\n-----\n\nThe findings of this report also illustrate the urgent need for ubiquitous adoption of HTTPS by website\ndevelopers. Handling web traffic over unencrypted channels leaves users vulnerable to network\ninjection techniques that may expose them to spyware, unwanted advertising, or other Internet scams.\nParticularly on sites offering software downloads (some of which may be billed as “secure”), companies\nand developers responsible for such platforms must ensure the proper use of encryption.Ultimately, the\nuse of products that provide network injection features on public ISP networks, as identified in this\nreport, represents a major global public safety risk. Network injection can be used to take advantage of\naccess to a user’s unencrypted web traffic to replace expected data with malicious or inappropriate\ncode, often in a manner undetectable to the average user. Francisco Partners’ recent acquisition of\nSandvine is especially troubling in this regard, since the investment firm’s portfolio also includes NSO\nGroup, one of the world’s leading providers of spyware whose products are associated with numerous\ncases of abuse. The prospect of such powerhouse surveillance technologies being sold to companies\noperating in autocratic regimes, or autocratic regimes themselves, and in jurisdictions wherein human\nrights are flagrantly abused, should be cause for concern.\n\n## Acknowledgements\n\n[Bill Marczak’s work on this project was supported by the Center for Long Term Cybersecurity (CLTC) at](https://cltc.berkeley.edu/)\nUC Berkeley. This work was also supported by grants to the Citizen Lab from the Ford Foundation, the\nJohn T. and Catherine D. MacArthur Foundation, the Oak Foundation, the Open Society Foundations,\nand the Sigrid Rausing Trust. This work includes data from the Open Observatory of Network\nInterference (OONI), [Censys,](https://censys.io/) [VirusTotal, and](https://www.virustotal.com/) [RiskIQ.](https://community.riskiq.com/)\n\nEditing and other assistance provided by Masashi Nishihata, Jeffrey Knockel, Christopher Parsons,\nLex Gill, and Miles Kenyon. Research assistance provided by Elizabeth Gross and Gabrielle Lim.\n\n## Additional data can be found here\n\n Appendix A: Turkey malware injection IOCs\n\n### Initial Campaign\n\n**Domains of injected redirects**\n\ndownload.downloading[.]shop\n\ndownloading.syriantelecom[.]co14\ndownload.syriantelecommunications[.]co\n\nredirection[.]bid\n\n### Phase 2 Campaign\n\n**Domains of injected redirects**\n\ndownloading.internetdownloading[.]co\n\ndownload.downloadering[.]co\n\n**Malware hashes**\n\n\n-----\n\n08d971f5f4707ae6ea56ed2f243c38b7\n20755b98d7c094747b75b157413e3422\n3632fb080545d3518d57320466f96cb3\n40383bee9846ecbd78581402e3379051\n449ba12127133ecd0440a558b083468c\n461446151be0033a668782c2d7ba58cb\n56bc314bc0d4a0a230a4de2bf978b5ae\na070fd2cce434a6f0b0d0fa6d3278d22\nbe6f2a03dfddbaf1166854730961d13c\nd7ec065cc3f563928504f80692578d2f\nf344da38958dbc730ddebc10660cd451\nfa90508007b94a4dbfeb8b48d5443ec8\n\n**Malware C&C**\n\nupdserv-east-cdn3[.]com\n\n### Phase 3 Campaign:\n\n**Domains of injected redirects**\n\ncomputing[.]downloaders[.]today\n\nstorage[.]computingdownloads[.]life\n\nwindow[.]processingdownloads[.]today\n\n**Malware hashes**\n\n001316808aa7108b467e8ecc06139c2e\n\n5c3f0dcf4aaa699b50154aa245923c86\n\n7fd98d6bb1e9d6bcf2e1984e812c1e46\n\n89180820b47bb11ccf0c8505371e98d1\n\n8bb2ba6f1cfa3bd99146688cd1e76bb0\n\n8c8eb5cfc5642a773c5f2b5f59148aa3\n\n8fea3de31a58415c3fec2e6dd4095575\n\n9b0de56f7f862db73e223f41099fc74c\n\nbe8a344487bcfea66de8e0f0f14d869e\n\ndf0045bd4168893922480f7ccb29860a\n\ne436e849d9496ef3f651c1904786c78f\n\ne80d8a0c35133f7485d8e87ade903919\n\nf36e67109ae368c9db109d0a41b5817c\n\n**Malware C&C**\n\nms-cdn-88[.]com\n\n**Related IOCs discovered**\n\ncdn2-sys-upd[.]com\n\nand-security-state[.]com\n\n\n-----\n\n### Phase 4 Campaign\n\n**Injection domains**\n\nsolitude.file-download[.]today\nsystem.documentations[.]live\n\nepiphany.download-document[.]world\nepoch.wind-files[.]today\n\n\n15\n\n\ninternet.document-management[.]today\n\n**Malware hashes**\n\n08b8b4787f3ce90c6c1483cc127b1cdc\n\n205a5502ff0da4a471c4dad0e06c6c57\n\n32bc51088953377d601c6b27ca7484a9\n\n3729531c71163cddcded7e70c02a3004\n\n43b39fd4ddc386092372da19f6278c25\n\n4fe4094302c26e7ea2c58f5ca9f7f993\n\n58239ea5747d3375278ce7c04db22c1b\n\n6491df10c766be9c487fb9495d04df6e\n\n6a442a610c047a7a306a12f423978bfb\n\n6ce947913231bd968c86a2737bae7bba\n\n7ad8ad340c084f8185e2bb18cbfde891\n\n90373539c60529153d0d6b0cc857e845\n\na5ae6e0d74052d4f889f2538fdd7cb9b\n\n**Malware C&C**\n\ncdn-upd-ms6[.]com\n\n**Related IOCs discovered**\n\nbombinate.winload[.]info\n\nepoch.uploaders[.]online\nsolitude.filedownloads[.]online\n\n\nmevlut.oncu@yandex.com\n\n### Phase 5 Campaign\n\n**Injection domains**\n\n\n16\n\n\ndocument.downloadingsystem[.]com\n\nepoch.englishdownloaders[.]today\n\ninternet.downloadingdocuments[.]com\n\nsystem.filedownloaders[.]com\n\n**Malware C&C**\n\nupd-ms3-app-state[.]com\n\n**Related IOCs discovered**\n\n\n-----\n\ncdn6-upd-state-app.com\n\n### BPF rule to detect HTTP 307 redirect injection consistent with PacketLogic:\n\n“port 80 and ip[4:2] = 13330 and tcp[((tcp[12:1] & 0xf0) >> 2)+8:4] = 0x20333037 and tcp[14:2] = 32120\nand ip[6:2] = 0”\n\n## Footnotes\n\n1. The text “SECURE DOWNLOAD” is displayed when a user hovers over the “DOWNLOAD NOW”\n\nlink when attempting to download a file from Download.com.\n[2. Found via Google search; the brochure URL includes a Hubspot Hub ID (482141) that we see in](https://knowledge.hubspot.com/articles/kcs_article/cos-general/how-are-file-manager-urls-structured)\n\nthe HTML source code of the https://sandvine.com/ site, thus we conclude this is an official\nbrochure.\n[3. Found via Google search; the brochure URL includes a Hubspot Hub ID (482141) that we see in](https://knowledge.hubspot.com/articles/kcs_article/cos-general/how-are-file-manager-urls-structured)\n\nthe HTML source code of the https://sandvine.com/ site, thus we conclude this is an official\nbrochure.\n4. Our Shodan search query was: 307 temporary redirect -date -server connection close -content\nlength -pragma -usercheck -content-type location.\n[5. The samples were structurally similar to the ones described here.](https://www.welivesecurity.com/2017/12/08/strongpity-like-spyware-replaces-finfisher/)\n6. See “inject_data parameter requires v12.1 firmware or newer” on\n\n[http://python.proceranetworks.com/4.0.0/ruleset.html.](http://python.proceranetworks.com/4.0.0/ruleset.html)\n7. For instance, Checkpoint’s Secure Web Gateway appears to use the same HTTP header format\n\nas PacketLogic, but has numerous differences in the IP and TCP layers, including not using a\nfixed IPID value, and not injecting a final unsolicited ACK.\n8. Though most people would instead probably visit videolan.org, which redirects users to HTTPS\n\nby default.\n9. Also surprisingly, when we tested ccleaner.com, it directed Mac users to a download via HTTPS,\n\nbut directed PC users to a download over HTTP.\n10. While it is unlikely that a user would actually see an ad injected on port 7547, it appears that the\n\nDPI operator in Egypt did not restrict the network injection to a specific port. As a result, an HTTP\nrequest on any port would be injected.\n11. After we began corresponding with Sandvine, and apparently in March 2018, Sandvine changed\n\nthe content of this webpage. The original text as of February 15, 2018 is available at\nhttps://web.archive.org/web/20180215124449/https://www.sandvine.com/company/corporateethics.\n12. Most recent data available as of March 7, 2018.\n13. After we began corresponding with Sandvine, and apparently in March 2018, Sandvine changed\n\n[the content of its “Ethics and Human Rights protection at Sandvine” webpage to add the following](https://www.sandvine.com/company/corporate-ethics)\ntext: “[W]e encourage Sandvine employees and interested third parties to report any suspected\nbreaches of a signed Sandvine certificate of compliance or breaches of Sandvine’s End User\nLicense Agreement (EULA) with sufficient supporting evidence to Sandvine’s BEC committee at\nBEC@sandvine.com for investigation. All reported concerns will be reviewed and appropriately\nactioned.” It is unclear, however, what terms are contained in the applicable certificates of\ncompliance or EULAs, which information would be required for the public to properly identify and\nreport on such breaches; or what supporting evidence would be considered “sufficient.” Additional\ntransparency is necessary to make this mechanism effectively available to the public.\n\n\n-----\n\n14. Also seen in the Phase 2 campaign.\n15. Also seen in the Phase 5 campaign.\n16. The (self-signed) TLS certificate served by 62.109.20.58 (pointed to by cdn-upd-ms6[.]com) was\n\nissued to “mevlut.oncu.example.com,” and we found a similar-looking domain cdn6-scl-ms.com\nregistered to [mevlut.oncu@yandex.com according to the WHOIS record. That domain never](http://10.10.0.46/mailto:mevlut.oncu@yandex.com)\npointed to an IP address, as far as we could tell.\n\n## Media Mentions\n\n[Foreign Policy Centre,](https://fpc.org.uk/in-azerbaijan-big-brother-is-watching-you-everywhere-offline-online-on-mobile-devices-and-social-media-apps/?fbclid=IwAR07ah99R7Rze5ki7NJBvnKkOh8xZsT2W8Yl0m529bH_6ixx9jmjObfp6W8) [Crypto Globe,](https://www.cryptoglobe.com/latest/2019/02/Classic-Trojan-Gets-Monero-Mining-Twist/) [Associated Press,](https://apnews.com/bb1bc22c130f484b8473b3fcb2c4836f?utm_campaign=SocialFlow&utm_source=Twitter&utm_medium=AP) [CyberScoop,](https://www.cyberscoop.com/isps-inside-turkey-egypt-spread-finfisher-spyware-massive-espionage-campaign/) [Ahval,](https://ahvalnews.com/cybersecurity/canadian-hardware-used-hack-us-allies-syria) [Bleeping Computer,](https://www.bleepingcomputer.com/news/security/turkish-isp-swapped-downloads-of-popular-software-with-spyware-infected-apps/) [CBC,](http://www.cbc.ca/news/technology/citizen-lab-sandvine-report-turkey-egypt-spyware-ads-1.4568717)\n[Cointelegraph,](https://cointelegraph.com/news/telecom-egypt-covertly-redirecting-internet-users-to-crypto-mining-sites-report-says) [Forbes,](https://www.forbes.com/forbes/welcome/?toURL=https://www.forbes.com/sites/thomasbrewster/2018/03/09/turkey-egypt-spyware-spreads-via-procera-sandvine/&refURL=https://www.google.com/&referrer=https://www.google.com/) [Quartz,](https://qz.com/1225371/egypt-may-be-hijacking-citizens-computers-to-secretly-mine-cryptocurrency-a-new-report-claims/) [The Register,](https://www.theregister.co.uk/2018/03/09/citizen_lab_claims_sandvine_hardware_used_to_enable_government_spyware/) [Toronto Star,](https://www.thestar.com/news/canada/2018/03/09/canadian-tech-used-to-hack-turkish-syrian-internet-users-report-claims.html) [We Live Security,](https://www.welivesecurity.com/2018/03/09/new-traces-hacking-team-wild/) [HackRead,](https://www.hackread.com/state-spy-programs-espionage-monero-mining-sandvine/) MS Power\nUser, [WinFuture,](http://winfuture.de/news,102260.html) [Cyryptonews,](https://oracletimes.com/binance-secures-accounts-during-smoke-loader-cryptojack/) [DCE Brief,](https://dcebrief.com/report-egypts-govt-redirecting-citizens-computers-to-mine-monero/) [FM4,](http://fm4.orf.at/stories/2900318/) [The Cyber Wire,](https://thecyberwire.com/issues/issues2018/March/CyberWire_2018_03_12.html) [Yahoo,](https://www.yahoo.com/news/white-house-sends-mixed-messages-124033460.html) [Aconde,](http://news.aconde.es/compania-de-telecomunicaciones-egipcia-es-vinculada-con-un-malware-para-la-mineria-de-monero/) [Al Eqtisady,](http://www.aleqtisady.com/technology/tw-1770067) Bits\nMedia, [Blogarama,](https://www.blogarama.com/careers-and-industries-blogs/131159-page-not-found-hotforsecurity-blog/24366417-turkish-egyptian-isps-help-local-government-conduct-massive-spyware-operation) [Coindesk,](https://www.coindesk.com/monero-mining-malware-attack-linked-to-egyptian-telecom-giant/) [CoinVedi,](https://coinvedi.com/de/monero-mining-malware-attack-linked-to-egyptian-telecom-giant/) [Der Standard,](https://www.derstandard.de/story/2000075924894/tuerkischer-provider-soll-staatstrojaner-in-downloads-eingeschmuggelt-haben) [EFF,](https://www.eff.org/deeplinks/2018/03/we-still-need-more-https-government-middleboxes-caught-injecting-spyware-ads-and) [FXStreet,](https://www.fxstreet.com/cryptocurrencies/news/monero-price-analysis-xmr-usd-seen-down-around-4-however-price-moving-within-a-large-bull-flag-pattern-201803121739) [IFeng,](http://digi.ifeng.com/a/20180312/44904548_0.shtml) [IT Online,](https://it-online.co.za/2018/03/12/eset-finds-hacking-team-traces-in-the-wild/) Kronen\nZeitung, [Mada Masr,](https://www.madamasr.com/en/2018/03/12/feature/politics/study-blocked-access-to-websites-ad-redirects-and-cryptocurrency-mining-in-egypt-traced-to-sandvines-packetlogic-devices/) [Morning Star,](http://news.morningstar.com/all/market-watch/TDJNMW2018031288/update-egypt-may-be-secretly-mining-crypto-by-hijacking-its-citizens-web-browsing.aspx) [Netz Politik,](https://netzpolitik.org/2018/tuerkischer-provider-jubelte-kunden-ueberwachungs-software-unter/) [Next Impact,](https://www.nextinpact.com/brief/citizenlab-denonce-des-redirections-invisibles-des-internautes-en-turquie-et-egypte-3046.htm) [Openiazoch,](https://openiazoch.zoznam.sk/cl/184390/Velky-brat-vie-kedy-pozeras-porno-Ako-stat-tajne-nuti-obcanov-aby-tazili-kryptomeny) [Plus Biznesu,](https://www.pb.pl/badacze-egipt-wykopuje-kryptowaluty-na-komputerach-swoich-obywateli-907712) [PY Mints,](https://www.pymnts.com/news/security-and-risk/2018/telecoms-turkey-syria-egypt-malware-internet-security/)\n[Rambler,](https://news.rambler.ru/internet/39334199-internet-provaydery-zarazhayut-polzovateley-maynerami-i-shpionskim-po/?updated) [Rambler (2),](https://news.rambler.ru/internet/39337065-egiptyane-maynyat-kriptovalyutu-i-ne-znayut-ob-etom/?updated) [Security Week,](https://www.securityweek.com/internet-provider-redirects-users-turkey-spyware-report) [Sohu,](http://www.sohu.com/a/225373296_100120800) [The Bitcoin News,](https://thebitcoinnews.com/government-owned-telecom-egypt-linked-to-monero-mining-software/) [The Bitcoin News (2),](https://thebitcoinnews.com/egyptian-telecom-giant-redirecting-internet-users-computers-to-mine-monero/) Web Financial\nGroup, [24 Malmo,](http://24malmo.se/2018/03/13/edward-snowden-pekar-ut-malmoforetag-framjar-turkiskt-natspionage/) [8till5,](https://www.8till5.se/2018-03-13/edward-snowden-malmoforetag-framjar-turkiskt-natspionage) [BTC Manager,](https://btcmanager.com/egypt-may-secretly-mining-crypto-hijacking-citizens-computers/) [Coin Idol,](https://coinidol.com/egypt-government-mined-monero/) [Ctusi.info,](http://www.ctusi.info/pocitace/linux/43/vlady_presmerovavaji_uzivatele_na_software_doplneny_omalware/) [Expressen,](https://www.expressen.se/kvallsposten/edward-snowden-kritiserar-malmoforetag-for-spionage/) [Feed Noticias,](https://www.feednoticias.com/noticias/un-informe-muestra-que-egipto-esta-minando-criptomonedas-en-secreto-con-las-computadoras-de-sus-ciudadanos-427630.html) [InternetUA,](http://internetua.com/internet-provaider-zarajauat-polzovatelei-mainerami-i-shpionskim-po) IT\nNews Africa, [IT Wire,](https://www.itwire.com/security/82061-hacking-team-s-spying-tool-has-resurfaced,-says-eset.html) [Kvedo Mosti,](http://kvedomosti.com/1500389-zloupotreblenie-vlastyu-v-egipte-vlasti-ispolzovali-kompyutery-grazhdan-dlya-mayninga.html) [Omni,](http://omni.se/snowden-kritisk-mot-it-bolag-med-sverigekoppling/a/0EXy1M) [Silicon Republic,](https://www.siliconrepublic.com/enterprise/slingshot-new-malware-on-the-scene-lay-undiscovered-for-years) [FIRE News,](http://ftnews.firetrench.com/2018/03/isps-in-turkey-syria-egypt-installing-mining-surveillance-malware/) Foundation for Defence of\nDemocracies, [Al Sham,](http://www.alshaminfo.com/story-z13837754) [Freedom and Justice Gate,](http://fj-p.com/%D9%81%D8%B6%D9%8A%D8%AD%D8%A9-%D8%A7%D9%84%D8%A7%D9%86%D9%82%D9%84%D8%A7%D8%A8-%D8%AA%D8%AA%D8%AC%D8%AF%D8%AF-%D9%81%D9%8A-%D9%86%D8%B5%D8%A8-%D8%AA%D8%B9%D8%AF%D9%8A%D9%86-%D8%A7%D9%84%D8%B9%D9%85/,) [Gazete Yenigun,](http://www.gazeteyenigun.com.tr/download-isteklerini-manipule-etti-iddiasi/181412/) [Gulf Eyes,](https://www.gulfeyes.net/technology/2410881.html) [Kitco News,](http://www.kitco.com/news/2018-03-14/Egypt-Could-Be-Hacking-Citizens-Computers-To-Mine-Cryptocurrency-Covertly.html) SC\nMedia, [CNN Turk,](https://www.cnnturk.com/yurttan-haberler/istanbul/microsoft-korsan-kripto-para-madenciligini-artan-tehlike-kategorisine-aldi) [IKanchai,](http://chain.ikanchai.com/2018/0315/200916.shtml) [Yahoo,](https://hk.finance.yahoo.com/news/microsoft-labels-malicious-crypto-mining-061355699.html) [Sohu,](http://www.sohu.com/a/225671276_100120649) [Information Security Buzz,](https://www.informationsecuritybuzz.com/expert-comments/isps-in-turkey-syria-egypt-installing-mining-surveillance-malware/) [Jinse,](http://www.jinse.com/news/blockchain/165727.html) [JRJ,](http://finance.jrj.com.cn/2018/03/16095124253050.shtml) [Ukrrudprom,](http://www.ukrrudprom.com/digest/Kak_u_nas_otberut_internetsvobodu_po_turetskoegipetskomu_stsenar.html)\n[LabourNet Germany,](http://www.labournet.de/internationales/syrien/politik-syrien/einnahme-afrins-durch-islamistische-milizen-und-tuerkische-armee-solidaritaetsaktionen-finden-weltweit-statt-und-sind-noetig-der-kampf-geht-weiter-auch-gegen-erdogans-waffenbrueder/) [Chinese Press,](http://www.chinesepress.com/Canada/87958.html) [Times Finance,](http://master.10jqka.com.cn/20180319/c603468869.shtml) [Kaplan Herald,](https://kaplanherald.com/2018/03/26/report-shows-egypt-is-covertly-mining-cryptocurrency-on-citizens-computers/) [The Currency Analytics,](https://thecurrencyanalytics.com/469/report-shows-egypt-is-secretly-mining-cryptocurrency-on-the-computers-of-its-citizens/) ABC\nGazetesi, [Novoje Vremja,](https://nv.ua/techno/it-industry/openvpn-protiv-dpi-2468387.html) [Novoje Vremja (2),](https://nv.ua/ukr/techno/it-industry/openvpn-proti-dpi-vchimo-novi-slova-v-ochikuvanni-tsenzuri-v-ukrajinskomu-interneti-2468387.html) [Memurlar,](https://www.memurlar.net/haber/748209/secimlere-golge-dusurme-senaryosu-casus-yazilim.html) [CyberScoop,](https://www.cyberscoop.com/finfisher-spyware-turkish-protestors-access-now/) [Diario Tecnologia,](http://www.diariotecnologia.es/asi-es-como-egipto-no-solo-censuro-internet-sino-que-aprovecho-para-hacer-dinero-con-malware-en-el-proceso) [Threat Post,](https://threatpost.com/strongpity-apt-changes-tactics-to-stay-stealthy/138503/)\n[SC Media,](https://www.scmagazine.com/home/security-news/cybercriminals-follow-the-news-too-and-change-tactics-accordingly/) [ZD Net,](https://www.zdnet.com/article/this-is-how-promethium-malware-operators-used-security-research-bulletins-in-their-favor/) [IT World Korea,](http://www.itworld.co.kr/news/111239) [Boan News,](https://www.boannews.com/media/view.asp?idx=74009) [CSO,](https://www.csoonline.com/article/3314834/hacking/burned-malware-returns-says-cylance-report-is-hacking-team-responsible.html) [E-Commerce News,](https://ecommercenews.com.br/noticias/pesquisas-noticias/o-impacto-da-inteligencia-de-ameaca-nos-adversarios/) [InforChannel,](https://inforchannel.com.br/2018/11/05/o-impacto-da-inteligencia-de-ameaca-nos-adversarios/) Business\nStandard, [eForensics](https://eforensicsmag.com/good-enough-security-is-actually-not-by-christopher-louie/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-09 - Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads-.pdf"
    ],
    "report_names": [
        "2018-03-09 - Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads-.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "72aaa00d-4dcb-4f50-934c-326c84ca46e3",
            "created_at": "2023-01-06T13:46:38.995743Z",
            "updated_at": "2025-03-27T02:00:02.972623Z",
            "deleted_at": null,
            "main_name": "Slingshot",
            "aliases": [],
            "source_name": "MISPGALAXY:Slingshot",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f55c7778-a41c-4fc6-a2e7-fa970c5295f2",
            "created_at": "2022-10-25T16:07:24.198891Z",
            "updated_at": "2025-03-27T02:02:10.138587Z",
            "deleted_at": null,
            "main_name": "Slingshot",
            "aliases": [],
            "source_name": "ETDA:Slingshot",
            "tools": [
                "Cahnadr",
                "GollumApp",
                "NDriver"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535730,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653752392,
    "ts_modification_date": 1653752392,
    "files": {
        "pdf": "https://archive.orkl.eu/1493748e9f0f04ddf61de23b4e758999fd2660d3.pdf",
        "text": "https://archive.orkl.eu/1493748e9f0f04ddf61de23b4e758999fd2660d3.txt",
        "img": "https://archive.orkl.eu/1493748e9f0f04ddf61de23b4e758999fd2660d3.jpg"
    }
}