{
    "id": "58b38916-f680-438d-b3f7-36f93c7f1c4b",
    "created_at": "2023-01-12T15:05:13.325847Z",
    "updated_at": "2025-03-27T02:16:55.77757Z",
    "deleted_at": null,
    "sha1_hash": "18c97d56dd102b358e255bef5a5bf0969357538e",
    "title": "2021-06-13 - Blue Team Detection- DarkSide Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:14:10Z",
    "file_modification_date": "2022-05-28T19:14:10Z",
    "file_size": 515205,
    "plain_text": "# Blue Team Detection: DarkSide Ransomware\n\n**secjuice.com/blue-team-detection-darkside-ransomware/**\n\nSecprentice June 13, 2021\n\n13 June 2021\nMalware write-ups can be found in abundance online, they are often written from the point of\nview of a malware researcher who focuses on the deep internals of how malicious software\nworks, in some cases the information provided cannot be used to derive actionable\nintelligence and defence mechanisms by cybersecurity blue teams. With that said,\nResearchers normally publish lists of hashes, file names, paths and IP addresses but these\nare easily rotated by attackers and therefore quickly become redundant for defenders. So,\ninstead of looking for these fingerprints (which frequently change), we should instead look to\ndetect malware by its behaviours (which are relatively persistent and common across many\n_malware flavours). In this post, I hope to take a recent popular strain of malware and pick it_\napart, not as a malware analyst but as a blue team defender to create intelligence that can\nbe used to detect malware based on its generalised behaviours instead of a stagnant list of\nhashes, IPs or file names.\n\n\n-----\n\nDarkSide Ransomware unleashed chaos on the Oil industry recently by demanding millions\nof dollars to decrypt critical infrastructure networks. Thankfully Fireye has written up a great\nreport which illuminates some of the tactics employed by Darkside admins to inflict their\ncryptographic nightmare. Although it seems Darkside is making a swift exit the methods they\nuse are common across many threat actors and therefore the advice below remains\napplicable to other ransomware flavours.\n\nBased on the evidence that DARKSIDE ransomware is distributed by multiple actors,\nwe anticipate that the TTPs used throughout incidents associated with this\nransomware will continue to vary somewhat\n\nhttps://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darksideransomware-operations.html\n\n## Detection Opportunities\n\n[Image credit: Fireeye](https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html)\n\n### #1 Password attacks at the perimeter\n\nConsumers of security tools are often led to believe that Ransomware is a complex threat\nbut for our first detection opportunity, we see quite the opposite.\n\n\n-----\n\nIn multiple cases we have observed suspicious authentication attempts against\ncorporate VPN infrastructure immediately prior to the start of interactive intrusion\noperations. The authentication patterns were consistent with a password spraying\nattack, though available forensic evidence was insufficient to definitively attribute this\nprecursor activity to UNC2628. In cases where evidence was available, the threat actor\nappeared to obtain initial access through corporate VPN infrastructure using legitimate\ncredentials.\n\nThe attackers are simply logging into the victims VPN appliance and accessing the network\nwhere they assume the permissions of the user whose credentials they have stolen. This\nisn't a complex intrusion. It's just logging in. It could have been slowed or perhaps stopped\nby modernising password policy and enabling two-factor authentication on the VPN gateway.\n\nDefenders can detect this stage of the attack by monitoring VPN authentication logs\n(normally Syslog directly from the VPN appliances or RADIUS) for multiple failed attempts.\nAlso, multiple failed attempts followed by success. Alert fidelity can be achieved in modern\nSIEMs by applying baselining or machine learning to automatically detect anomalous\nauthentication instead of relying on a static threshold such as X auth failures in Y minutes.\n\nSimplification of the attack for visual learners.\nFireEye does also mention the attacker may have logged in with legitimate credentials, it\ncould be argued that the attackers stole or were sold a working username/password\ncombination. In this case, it's surely safe to assume that two-factor authentication would\nhave slowed down the attackers. Implementing 2FA is initially time-consuming but a breeze\nto work with after the initial deployment hump. Some say that user workflow and productivity\nis hampered by having a two-factor authentication process but thanks to modern push\nnotification solutions (like Duo and Azure) this simply isn't true. Your smartphone can send\nyou a push notification that you tap and unlock with biometrics adding fractions of a second\nonto your login time. The pros of a more secure VPN outweigh the cons of a few extra\nseconds of logon time.\n\n### #2 Exploitation of edge appliances.\n\n_Admittedly this section is only half a detection, the other half is patching advice._\n\n\n-----\n\n[FireEye noted that some Darkside attacks exploited CVE-2021-20016 for initial access. This](https://www.tenable.com/blog/cve-2021-20016-zero-day-vulnerability-in-sonicwall-secure-mobile-access-sma-exploited)\nvulnerability allows unauthenticated remote commands to be executed against SonicWall\nappliances. Anyone with an internet connection and the right set of instructions (SQL queries\nin this case) can easily steal credentials from the SonicWall appliance and use them to break\ninto a network from the outside. This low effort, high yield attack is made possible by the\nprecarious location of edge networking appliances, bridging the internal and external\nnetwork.\n\nSimplification of VPN appliances on the internet.\nIf your network has any edge appliances (Citrix, VPNs or similar) they must be promptly\npatched when vulnerabilities are disclosed, the sooner the better. Failing to do so will\nundoubtedly allow attackers in eventually.\n\nIt's possible to detect such vulnerabilities with an external vulnerability scanner or simply by\n[signing up for a notification service like https://secalerts.co.](https://secalerts.co/)\n\nIn some cases, it's also possible to detect appliance attacks via their logs although this varies\nby vendor and vulnerability. Knowing which logs to look at isn't always known until long after\nthe vulnerability has been published. In most cases, the appliance will write a Syslog\nmessage or have a particular file in a particular location that shows the system has been\ncompromised. It's probably best not to count on this method for detecting networking\nappliance intrusions. Prevention is better than the cure.\n\n### #3 Phishing\n\nA group that Fireye have dubbed UNC2465 snuck Darkside in via the \"Hamhock\" backdoor.\nIt's hard to find much information about this backdoor other than what's provided in the\nFireye write up but it's possible to make educated guesses about its tactics based on the\nsnippets of information Fireye have included.\n\nDuring one incident, the threat actor appeared to establish a line of communication\nwith the victim before sending a malicious Google Drive link delivering an archive\ncontaining an LNK downloader. More recent UNC2465 emails have used Dropbox links\nwith a ZIP archive containing malicious LNK files that, when executed, would ultimately\nlead to SMOKEDHAM being downloaded onto the system\n\n\n-----\n\nSo, UNC2465 delivered the Hamhock backdoor via phishing in two flavours. One using cloud\nstorage services like Google Drive or Dropbox and the other by hiding malicious LNK files\ninside ZIPs and sending them directly to the victim. Fireeye has not shared many details\nabout the phishing kill chain but we can safely assume it looks something like these Any.Run\nsamples that abuse LNK files:\n[https://app.any.run/tasks/2f776569-a3be-42e4-a6af-732982c9b2ed/](https://app.any.run/tasks/2f776569-a3be-42e4-a6af-732982c9b2ed/)\n[https://app.any.run/tasks/2f776569-a3be-42e4-a6af-732982c9b2ed/](https://app.any.run/tasks/2f776569-a3be-42e4-a6af-732982c9b2ed/)\n\nWhen boiled down this phishing attack is nothing more than delivering a shortcut file that\npoints towards a malicious command. The shortcut file is put in front of the user inside of a\nZIP file attachment or hidden behind a cloud file sharing link.\n**This isn't anything new and certainly isn't anything to be concerned about because long kill**\nchains like this grant many detection and prevention opportunities for us defenders.\n\nA rough outline of the LNK kill chain as per AnyRun samples.\nTo detect and prevent this phishing method defenders should consider some or all of the\nfollowing actions:\n\nDo not allow LNK files to be delivered as eMail attachments. Block LNK files from being\ndelivered to end-users.\nEnsure that this block extends to LNK files inside of ZIPs. Most modern email gateways\ncan look inside ZIP files for malicious files.\nEnsure that this block extends to LNK files inside of encrypted ZIPs. Attackers\nsometimes password-protect ZIP files to stop eMail scanners from looking inside. This\nparticular protection may interrupt normal business workflows and therefore is not\nsuitable for everyone, your business should be consulted for appetite first.\nUse EDR to monitor for archive software (WinZip, 7Zip, Unrar) writing .LNK files to disk\naka being extracted.\n\n\n-----\n\nUser EDR to monitor for a suspicious parent to child process relationships as per any\nother malware. For example: CMD.exe > MSHTA.exe > PowerShell.exe. There's no\nspecial sauce here. Once the attackers are on the network they still rely on traditional\ncode execution and foothold techniques, so stick to what you know and don't be\ndistracted by the fact that a new scary ransomware flavour is involved.\n\n### #4 Privilege escalation detection\n\nAfter any hacker has gotten into her target network she will want to obtain high privileges so\nshe can spread deep into the network and encrypt as many systems as possible. Again,\nthere is no secret sauce here. The ransomware operators are using the same tried and true\ntechniques. Specifically called out by FireEye are Mimikatz, CVE-2020-1472 and LSASS\nmemory dumps. To detect and prevent these privilege escalation attacks, defenders should\nimplement as many of the below initiatives as possible:\n\nPatch systems regularly and promptly. [CVE-2020-1472 can be avoided by installing](https://www.crowdstrike.com/blog/cve-2020-1472-zerologon-security-advisory/)\npatches.\n[Administrators must ensure that wdigest regkey is set to 0 on systems running](https://www.reliaquest.com/blog/credential-dumping-part-2-how-to-mitigate-windows-credential-stealing/)\nWindows 7, 8, Server 2008, and Server 2012. This stops plain text credentials from\nbeing stored in memory. EDR tools should be used to monitor for modifications to the\nwdigest registry key as attackers may try to modify it to weaken system security\n[Administrators should also ensure the RunAsPPLregistry key is set which stops tools](https://www.reliaquest.com/blog/credential-dumping-part-2-how-to-mitigate-windows-credential-stealing/)\nlike Mimikatz from dumping the LSASS process memory where credentials are stored\nin a hashed format.\nAs mentioned earlier, [password policies must be modernised with length and longevity](https://www.ncsc.gov.uk/collection/passwords/updating-your-approach#:~:text=The%20NCSC%20is%20working%20to,large%20numbers%20of%20complex%20passwords.&text=examine%20and%20(if%20necessary)%20challenge,made%20when%20determining%20password%20policy)\nin mind.\nA large portion of common Microsoft domain attacks can be detected by Microsoft ATA,\nnow renamed to Microsoft Defender For Identity.\n\nThe agent runs on domain controllers where it can monitor for suspicious behaviour in\ndomain controller logs.\n\n### #5 Monitoring and controlling administrative tools\n\nAll of the hacking groups that deployed DarkSide were observed by Fireeye to be using\nsystem administrator tools that have no place on a network except in very particular\ncircumstances. Defenders should look to strictly control access to the following tools:\n\nTeamviewer\nrClone\nPSExec\n\nFireEye directly calls out the fact that the attackers downloaded standard binaries for these\ntools directly from the vendor source. (For example dl.teamviewer.com) This is interesting\nbecause it highlights the fact that the attackers don't feel the need to hide this download,\n\n\n-----\n\nobviously because it often goes undetected.\nDefenders can detect and control the use of these tools using EDR Watchlists, [Firewalls and](https://mediarealm.com.au/articles/block-teamviewer-network/)\napplication control tools like AppLocker. If a user starts any of these applications without\nproper permission or explanation their activity should be investigated.\n\n### #5 Protect ESXi\n\nMandiant observed the threat actor navigate to ESXi administration interfaces and\ndisable snapshot features prior to the ransomware encryptor deployment, which\naffected several VM images.\n\nI believe this claim to be profound because this isn't a commonly talked about attack vector\nand few organisations are properly monitoring their virtual machine management consoles.\nDefenders should work to implement as many of the following recommendations as possible\nto protect their ESXi hosts from attacks like this.\n\nEnsure that all virtual machine hosts are patched and running the latest software\navailable from the vendor. If you don't have a vulnerability management platform then\n[sign up to a service like https://secalerts.co/ for email alerts.](https://secalerts.co/)\nControl access to your ESXi hosts tightly, only share the credentials with employees\nwho need to know. Be sure to rotate the passwords after key administrators leave the\ncompany.\nSet long complex passwords for your ESXi server backends and store them in\npassword vaults like Secret Server, KeePass or BitWarden.\nMonitor ESXI Syslog for multiple authentication failure events in a short period of time.\nIngest your ESXi Syslog logs into a monitoring platform and configure alarms that will\nwarn you of virtual machine snapshots being deleted in bulk.\n\n[This week's images were provided by Nina Z's digital art collection.](https://www.behance.net/gallery/117084621/Snakesstars)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-13 - Blue Team Detection- DarkSide Ransomware.pdf"
    ],
    "report_names": [
        "2021-06-13 - Blue Team Detection- DarkSide Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f7f836-b77f-4f95-aa02-9e99d32faf1d",
            "created_at": "2024-12-21T02:00:02.857057Z",
            "updated_at": "2025-03-27T02:00:03.472472Z",
            "deleted_at": null,
            "main_name": "UNC2465",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2465",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535913,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1653765250,
    "ts_modification_date": 1653765250,
    "files": {
        "pdf": "https://archive.orkl.eu/18c97d56dd102b358e255bef5a5bf0969357538e.pdf",
        "text": "https://archive.orkl.eu/18c97d56dd102b358e255bef5a5bf0969357538e.txt",
        "img": "https://archive.orkl.eu/18c97d56dd102b358e255bef5a5bf0969357538e.jpg"
    }
}