{
    "id": "58b689ce-79e3-45db-8ec4-79a75201e49b",
    "created_at": "2023-01-12T15:06:03.309702Z",
    "updated_at": "2025-03-27T02:05:46.330006Z",
    "deleted_at": null,
    "sha1_hash": "a4339d150f7f4672d2fb2cb4a967d1a6faffdb16",
    "title": "2020-09-10 - Lock Like a Pro- Dive in Recent ProLock's Big Game Hunting",
    "authors": "",
    "file_creation_date": "2022-05-28T19:38:05Z",
    "file_modification_date": "2022-05-28T19:38:05Z",
    "file_size": 1507944,
    "plain_text": "# Lock Like a Pro: Dive in Recent ProLock's Big Game Hunting\n\n**group-ib.com/blog/prolock_evolution**\n\n10.09.2020\n\n\n-----\n\nOleg Skulkin\n\nSenior Digital Forensics Analyst at Group-IB\n\nSemyon Rogachev\n\nMalware Analyst at Group-IB\n\n\n-----\n\nIntroduction\n\nOn September 4, the FBI issued its second alert in less than six months about ProLock\nwarning companies of the fact that the ransomware operators are stealing data from targeted\norganizations before encrypting them.\n\nThe group, which operates ProLock, is the successor of the PwndLocker ransomware\nstrain, which itself had been active only since October 2019. PwndLocker operators were\nambitious from the start; they targeted enterprise networks with ransom demands ranging\nfrom the low-to mid-six figures. Despite these early successes, not everything went smoothly.\nPwndLocker was stopped dead in its tracks after its code was found to contain a bug that let\nanyone decrypt files without paying the ransom. The threat actors quickly patched it and\nrebranded their ransomware as ProLock in March 2020.\n\nFollowing in the footsteps of its predecessor, ProLock has focused on so-called Big Game\n**Hunting. The fact that their ransom demands range anywhere from 35 to 255 Bitcoin**\n(approx. $400,000 to $3,000,000) only confirms their \"think big\" strategy. As for their area of\nactivity, ProLock operators have so far focused on North America and Europe. Their most\ninfamous known attack was in April on Diebold Nixdorf.\n\n[It was not long after ProLock emerged that Group-IB discovered that the new group was](https://www.group-ib.com/blog/prolock)\nusing the Qakbot (also known as QBot) banking trojan to obtain initial access and described\nthe ProLock's TTPs. Almost six months on from its debut the group has upgraded its\nmethods. In this post we'll look at some of the recent tactics, techniques, and procedures\n(TTPs) used by ProLock operators.\n\nFor a more in-depth analysis of the attacker's TTPs and the full MITRE ATT&CK® mapping,\ndownload Group-IB's Lock Like a Pro: How Qakbot Fuels Enterprise Ransomware\nCampaigns white paper.\nInitial Access\n\nQakbot is usually distributed via phishing emails, and the campaigns associated with\nProLock are no exception. Their phishing emails contain links or attachments, which in most\ncases are ZIP archives with heavily obfuscated VBScripts. Similar scripts are used as a\ndelivery mechanism for other trojans, such as Dridex and Ursnif.\n\nAnother noteworthy aspect of these emails is that they usually involve the thread-hijacking\ntechnique. Such emails originate from a compromised account or attacker-controlled system.\nSince the emails appear to come from a trusted source, it is more likely that the victim will\ndownload and click on the malicious VBScript.\n\nThe technique used to masquerade such emails is highly effective, yet the content is simple\nand straightforward:\n\n\n-----\n\n_Figure 1. Example of phishing email body_\n\nIn some cases, weaponized Office documents are used instead of VBScripts. Such\ndocuments include malicious macros that, once enabled, drop a batch file into the\n%PUBLIC% folder, triggering PowerShell to download and execute a Qakbot payload from\none of the compromised websites.\n\nIn their most recent campaigns, Qakbot operators added another link to the chain: the\nnotorious Emotet trojan, which has a long history of being involved in Big Game Hunting\noperations.\n\nNetwork reconnaissance and lateral movement\n\nOnce the adversary has gathered general information about the compromised host and\nunderstands that it is located in a domain of interest, Bloodhound was used to collect more\ndetailed information. The output is written to the same folder and is in the form of zipped\nJSON files — a standard Sharphound (part of Bloodhound) output.\n\nIn at least one case, the attackers profiled the compromised network again, just before the\nProLock deployment, but this time using another Active Directory reconnaissance tool:\nADFind. This could indicate that multiple individuals or teams were working on the same\ntarget.\n\n\n-----\n\nAt the same time, Group-IB noticed that the team or individual working on ransomware\ndeployment was closely connected to Qakbot operators. For example, they used PsExec to\nmanually distribute Qakbot throughout the company.\n\nMoreover, this was not the only case when PsExec was used. The attackers also used\nRemote Desktop Protocol (RDP) for lateral movement. This was not the most effective route,\nhowever, as RDP was not available on every host. To overcome this obstacle, they used a\nbatch script to enable it, which was run via PsExec on available hosts.\n\nThis was not the only script deployed using PsExec: another example is a Cobalt Strike\n**Beacon stager. Today, many adversaries — especially those involved in Big Game Hunting**\noperations — have this dual-use tool in their arsenals and often use PowerShell one-liners to\nrun stagers. ProLock operators are no exception.\n\nIn some cases, ProLock operators used an exploit for the CVE-2019-0859 vulnerability to\nescalate their privileges on the compromised host. They achieved this by resorting to a\nseparate executable file.\n\nWith regard to ProLock distribution, the ransomware can be either dropped by Qakbot or\ndownloaded from an adversary-controlled server using Background Intelligent Transfer\nService (BITS).\n\nIn some cases, WMIC is also used to execute the script on the remote hosts — a common\ntechnique in modern ransomware attacks.\n\nImpact\n\nBefore ProLock ransomware is deployed, the threat actors sometimes perform data\nexfiltration. To do so, they use Rclone, a command-line tool for managing files on cloud\nstorage, which supports a large number of such storage providers. The executable file is\nusually masqueraded to look like a legitimate file (e.g. svchost.exe). Another preemptive\nmeasure involves the threat actors deploying pre-made batch scripts via Group Policy to\ndisable antivirus software. They also wipe backups from the relevant servers.\n\nProLock itself consists of two components: a batch file and a file with a disguised payload.\nDuring incident response engagements, Group-IB has seen the following file types being\nused to store payloads: JPG, BMP, and CSV:\n\n\n-----\n\n_Figure 2. Decoded contents of a PowerShell script_\n\nBoth files are dropped into the %ALLUSERSPROFILE% folder. Once executed, the launcher\nextracts and executes the ProLock code.\n\nOne of the largest ransom amounts Group-IB has ever encountered was 90 BTC, which is\naround $1,000,000:\n\n\n-----\n\nIn another recent case, known to Group-IB s DFIR team, ProLock operators demanded as\nmuch as 255 BTC.\n\nConclusion\n\nThe emergence of ProLock is a clear sign that the threat of Big Game Hunting continues to\nloom large. The group's use of Qakbot may be straight out of the enterprise ransomware\noperation playbook, but the approach remains effective.\n\nDespite only using standard tools for post-exploitation, ProLock operators have, for the most\npart, managed to remain undetected until the ransomware is deployed on the target hosts.\n\nMoreover, although the dwell time in attacks is about a month, many organizations still find it\ndifficult to detect malicious activity in time due to the lack of well-trained personnel, properly\nconfigured security controls, and appropriate cyber threat intelligence consumption.\n\n**Want to make sure that you don't become the next victim of ransomware?**\n\nFor more than 17 years Group-IB's DFIR Lab has investigated cybercrimes around the world.\nDuring this time, we've clocked in more than 60,000 hours of incident response to the most\ncomplex cyberattacks.\n\nIf our experience has taught us anything, it's that a professional response to ransomware is\nextremely important. Just as important as having a proactive approach to responding to\npotential threats.\n\nGroup-IB's Incident Response Retainer allows your company to meet these challenges and\nmaintain peace of mind. Sign up for Group-IB's Incident Response Retainer today.\n\nLearn more\n\nHow Qakbot Fuels Enterprise Ransomware Campaigns\n\nFor a more in-depth analysis of the ProLock's TTPs and the full\nMITRE ATT&CK® mapping, download Group-IB's most recent white paper.\n\nRequest\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-10 - Lock Like a Pro- Dive in Recent ProLock's Big Game Hunting.pdf"
    ],
    "report_names": [
        "2020-09-10 - Lock Like a Pro- Dive in Recent ProLock's Big Game Hunting.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535963,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653766685,
    "ts_modification_date": 1653766685,
    "files": {
        "pdf": "https://archive.orkl.eu/a4339d150f7f4672d2fb2cb4a967d1a6faffdb16.pdf",
        "text": "https://archive.orkl.eu/a4339d150f7f4672d2fb2cb4a967d1a6faffdb16.txt",
        "img": "https://archive.orkl.eu/a4339d150f7f4672d2fb2cb4a967d1a6faffdb16.jpg"
    }
}