{
    "id": "59025b89-8c52-4e7f-a6a3-403cf07b554c",
    "created_at": "2023-01-12T15:08:02.566461Z",
    "updated_at": "2025-03-27T02:05:40.545149Z",
    "deleted_at": null,
    "sha1_hash": "128cbc1086ceac514015e24e6f1d633caf4dbdf7",
    "title": "2022-05-19 - Bruised but Not Broken The Resurgence of the Emotet Botnet Malware",
    "authors": "",
    "file_creation_date": "2022-05-25T20:32:09Z",
    "file_modification_date": "2022-05-25T20:32:09Z",
    "file_size": 4120396,
    "plain_text": "# Bruised but Not Broken: The Resurgence of the Emotet Botnet Malware\n\n**[trendmicro.com/en_us/research/22/e/bruised-but-not-broken--the-resurgence-of-the-emotet-botnet-malw.html](https://www.trendmicro.com/en_us/research/22/e/bruised-but-not-broken--the-resurgence-of-the-emotet-botnet-malw.html)**\n\nMay 19, 2022\n\nDuring the first quarter of 2022, we discovered a significant number of infections using multiple new Emotet variants that\nemployed both old and new techniques to trick their intended victims into accessing malicious links and enabling macro content.\n\nBy: Adolph Christian Silverio, Jeric Miguel Abordo, Khristian Joseph Morales, Maria Emreen Viray May 19, 2022 Read time: 6 min\n(1703 words)\n\nThe [Emotet botnet malware is well known in the cybersecurity industry for its success in using spam emails to compromise](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/further-emotet-evolution-operators-hijacking-existing-email-threads-to-deliver-malware)\nmachines and then selling access to these machines as part of its infamous malware-as-a-service (MaaS) scheme. Operators behind\n[notorious threats such as the Trickbot trojan and the Ryuk or](https://www.trendmicro.com/vinfo/it/security/news/cybercrime-and-digital-threats/banking-malware-emotet-and-trickbot-go-phishing-again) [Conti ransomware are among the malicious actors who have used the](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ryuk-2020-distributing-ransomware-via-trickbot-and-bazarloader)\nbotnet malware in their attacks.\n\n[But in January 2021 came news of Emotet’s dismantling, dubbed Operation Ladybird, during which law enforcement agencies](https://www.trendmicro.com/en_us/research/21/c/emotet-one-month-after-the-takedown.html)\nfrom Canada, France, Germany, Lithuania, the Netherlands, Ukraine, the UK, and the US worked in concert to seize control of\n[Emotet’s infrastructure. In spite of this, the botnet malware proved quite resilient and it resurfaced in November 2021. According](https://success.trendmicro.com/dcx/s/solution/1118391-malware-awareness-emotet-resurgence?language=en_US)\n[to researchers at AdvIntel, its return was greatly influenced by Conti’s operators, who sought to continue their partnership with the](https://www.advintel.io/post/corporate-loader-emotet-history-of-x-project-return-for-ransomware)\noperators of Emotet, as the botnet malware had played an integral role in the ransomware’s initial access phase.\n\nDuring the first quarter of 2022, we discovered a significant number of infections in various regions (Figure 1) and across different\nindustries (Figure 2) using multiple new Emotet variants. Based on our telemetry, a large percentage of the infected customers\nwere in Japan, followed by countries in the Asia-Pacific and EMEA (Europe, the Middle East, and Africa) regions. It is possible that\nthe operators behind Emotet targeted profitable industries like manufacturing and education to attract the attention of other\nmalicious actors as potential customers for their MaaS offering.\n\n\n-----\n\nFigure 1. Emotet infections by region during the first quarter of 2022\n\n\n-----\n\nFigure 2. Emotet infections by industry during the first quarter of 2022\n\n## In with the new\n\nWe observed that this surge in Emotet spam campaigns used both old and new techniques to trick their intended victims into\naccessing malicious links and enabling macro content. The newer Emotet samples we analyzed retained the same initial\ndownloader as the one found in previous campaigns. However, these more recent samples used Excel 4.0 macros, an old Excel\nfeature, to execute its download routines (Figure 3), as opposed to Emotet’s previous use of Visual Basic for Applications (VBA).\n\n\n-----\n\nFigure 3. Emotet’s Excel lures\n\nEmotet employs various obfuscation techniques to evade detection of the malicious Excel file. One such technique is its use of the\n.ocx file name extension (Figure 4) and carets (Figures 12 and 13) in URLs, which allow Emotet to sidestep detection methods that\nlook for specific command-line keywords or extensions.\n\nFigure 4. Emotet using Excel 4.0 macros and the .ocx file name extension for its payload\n\nWe also observed that some of the recent Emotet samples drop BAT (batch) files (Figures 5 and 6) and VBScript files (Figures 7\nand 8) to execute their download routines.\n\n\n-----\n\nFigure 5. An obfuscated BAT file\n\nFigure 6. A deobfuscated BAT file (Figure 5) that downloads Emotet’s payload via PowerShell\n\n\n-----\n\nFigure 7. An obfuscated VBScript file\n\nFigure 8. A deobfuscated VBScript file (Figure 7) that downloads Emotet’s payload via PowerShell\n\nUnlike past variants, the recent Emotet samples behave in a more straightforward way, directly downloading and executing their\npayloads. These samples use regsvr32.exe under the SysWow64 folder to execute their payloads, which ensures that the malware\nruns in a 64-bit environment using the 32-bit binary. This suggests that Emotet now targets only 64-bit machines, which is in line\n[with the recent news of Emotet’s switch to 64-bit loaders.](https://www.bleepingcomputer.com/news/security/emotet-botnet-switches-to-64-bit-modules-increases-activity/)\n\nWe also discovered that the recent Emotet samples employ LNK (link) files to download 64-bit loaders (Figure 9). These allow\nEmotet to directly execute PowerShell commands for payload execution. For each infection, the LNK file creates a PS1 file via\nPowerShell, which is then used to download and run Emotet’s payload (Figures 10 and 11).\n\nFigure 9. Emotet’s malicious LNK file\n\n\n-----\n\nFigure 10. The executed command from Emotet’s malicious LNK file\n\nFigure 11. The deobfuscated command from Emotet’s malicious LNK file (Figure 10)\n\nAnother notable behavior we observed in the samples of these new Emotet variants was their use of hexadecimal (Figure 12) and\n[octal (Figure 13) representations of the IP addresses they connected to, as we reported in a previous blog entry. Using these](https://www.trendmicro.com/en_us/research/22/a/emotet-spam-abuses-unconventional-ip-address-formats-spread-malware.html)\nformats to obscure the URLs enables these new variants to circumvent pattern-matching detection methods, thereby allowing the\nexecution of their download routines.\n\nFigure 12. A hex representation of the Emotet URL (with carets)\n\nFigure 13. An octal representation of the Emotet URL (with carets)\n\n### Emotet’s payload\n\n\n-----\n\nEmotet s older 32 bit variants use seven core commands. But the recent Emotet samples are of 32 bit variants that use only six\ncore commands and 64-bit variants that use only five, as shown in Table 1.\n\n**Command** **Execution method of 32-bit variants** **Execution method of 64-bit variants**\n\n1 Download and execute DLL with regsvr32.exe with Download and execute DLL with regsvr32.exe\nparameter\n\n%Windows%\\regsvr32.exe {Installation folder}\\\n\n%Window%\\regsvr32.exe /s {Installation folder}\\ {random}.dll {Base64-encoded string of (randomly\n{random}.dll {Base64-encoded string of (randomly created installation folder)}\\(file name of dropped\ncreated installation folder)}\\(file name of dropped copy)\ncopy)\n\n2 Execute shellcode via CreateThread Execute shellcode via CreateThread\n\n3 Download EXE file and execute it using Download EXE file and execute it using\nCreateProcessW (non-admin) CreateProcessW (non-admin)\n\n{Installation folder}\\{random}.exe {Installation folder}\\{random}.exe\n\n4 Download EXE file and execute it using Download EXE file and execute it using\nCreateProcessAsUserW (admin) CreateProcessAsUserW (admin)\n\n{Installation folder}\\{random}.exe {Installation folder}\\{random}.exe\n\n5 Execute shellcode via CreateThread Load module in memory and execute exported function\n(via LoadLibraryA and GetProcAddress)\n\n6 Download and execute DLL with regsvr32.exe\n\n%Window%\\regsvr32.exe /s {Installation folder}\\\n{random}.dll\n\nNote: {installation folder} could be %AppDataLocal%\\{random} (non-admin) or %System% \\{random} (admin), depending on\nthe mode of execution.\nTable 1. A list of core commands used by the newer Emotet samples\n\nOur analysis of the recent samples showed that Emotet’s use of rundll32.exe for execution between November 2021 and January\n2022 had been phased out, replaced by the “regsvr32.exe /s” command as of February 2022. Nonetheless, Emotet employs\nmodular architecture for its other payloads. Based on this, we can still infer that the samples have the same infection chain as in\nprevious Emotet-related campaigns, with some variants opting to include the gathering of running processes as part of their\nmodules instead of their main routine (Figure 14).\n\n|Command|Execution method of 32-bit variants|Execution method of 64-bit variants|\n|---|---|---|\n|1|Download and execute DLL with regsvr32.exe with parameter %Window%\\regsvr32.exe /s {Installation folder}\\ {random}.dll {Base64-encoded string of (randomly created installation folder)}\\(file name of dropped copy)|Download and execute DLL with regsvr32.exe %Windows%\\regsvr32.exe {Installation folder}\\ {random}.dll {Base64-encoded string of (randomly created installation folder)}\\(file name of dropped copy)|\n|2|Execute shellcode via CreateThread|Execute shellcode via CreateThread|\n|3|Download EXE file and execute it using CreateProcessW (non-admin) {Installation folder}\\{random}.exe|Download EXE file and execute it using CreateProcessW (non-admin) {Installation folder}\\{random}.exe|\n|4|Download EXE file and execute it using CreateProcessAsUserW (admin) {Installation folder}\\{random}.exe|Download EXE file and execute it using CreateProcessAsUserW (admin) {Installation folder}\\{random}.exe|\n|5|Execute shellcode via CreateThread|Load module in memory and execute exported function (via LoadLibraryA and GetProcAddress)|\n|6|Download and execute DLL with regsvr32.exe %Window%\\regsvr32.exe /s {Installation folder}\\ {random}.dll||\n\n\n-----\n\nFigure 14. Emotet’s infection chain\n\nThe reappearance of Emotet is also notable because its operators have since added Cobalt Strike, a well-known penetration-testing\ntool, to its arsenal. This poses a bigger risk for target enterprises, as the integration of Cobalt Strike provides more flexibility for\nEmotet’s MaaS partners to gain a foothold in an intended victim’s systems. With these new features, we expect to see in the coming\nmonths a continuous stream of Emotet cases and the delivery of other malware used in Emotet’s MaaS scheme.\n\n## Similarities with QakBot\n\nSince January, we have received and analyzed 300 submissions of the QakBot loader (Figure 15), and our investigation has\nrevealed that its attack chain shares many similarities with that of Emotet (Figure 16).\n\n\n-----\n\nFigure 15. Emotet and QakBot submissions from January to April 2022\n\n\n-----\n\nFigure 16. A comparison of QakBot and Emotet’s attack chains\n\nQakBot spam messages attempt to deceive their intended victim into clicking a download link, which is usually a OneDrive URL\n(Figure 17). An Emotet spam message, on the other hand, poses as a forwarded email that has a password-protected archive\nattachment (Figure 18).\n\nFigure 17. A QakBot spam message containing a malicious download link\n\n\n-----\n\nFigure 18. An Emotet spam message containing a password-protected archive attachment\n\nQakBot infections start with the intended victim downloading a malicious Excel file with an .xlsb file name extension (Figure 19).\nEmotet infections also involve an Excel file, but with an .xlsm file name extension (Figure 20).\n\nFigure 19. The malicious Excel file in a QakBot attack\n\n\n-----\n\nFigure 20. The malicious Excel file in an Emotet attack\n\nAnother key difference between the two pieces of malware is that the macro sheets embedded in QakBot’s downloader samples\ncontain links with the .png file name extension in the URLs (Figure 21), while Emotet links do not (Figure 22). This is a means for\nQakBot to evade detection, as using a common file name extension like .png makes QakBot URLs less suspicious.\n\nFigure 21. The URLs in a QakBot macro sheet\n\n\n-----\n\nFigure 22. The URLs in an Emotet macro sheet\n\nAlthough the Excel files in both QakBot (Figure 23) and Emotet (Figure 24) infections employ regsvr32.exe to execute their\npayloads, only QakBot drops its payload in a folder with a random five-character name that is located in the C:\\ drive (Figure 25).\nEmotet, on the other hand, drops its payload in the parent directory of its downloader (Figure 26).\n\nFigure 23. QakBot’s use of regsvr32.exe to execute its payload\n\nFigure 24. Emotet’s use of regsvr32.exe to execute its payload\n\nFigure 25. QakBot dropping its malicious payload in a folder in C:\\\n\n\n-----\n\nFigure 26. Emotet dropping its malicious payload in a folder\n\nSecurity recommendations\n\nFor enterprises to avoid falling victim to spam emails used in Emotet and QakBot campaigns, user awareness training for\nemployees should be expanded to address email reply chain attacks. Security practices that can mitigate the risk of infection\ninclude:\n\nEnsuring that macros are disabled in Microsoft Office applications\nHovering over embedded links to check the URLs before opening them\nBeing wary of unfamiliar email addresses, mismatched email addresses and sender names, and spoofed company emails, all\nof which are telltale signs that the sender has malicious intent\nRefraining from downloading any email attachments without verifying the sender’s identity\nEnabling advanced detection capabilities, such as predictive machine learning\n\nUsers and businesses can defend themselves against threats like Emotet using endpoint solutions such as Trend Micro’s Smart\n[Protection Suites and Worry-Free Business Security solutions, which have behavior-monitoring capabilities that can detect](https://www.trendmicro.com/us/small-business/product-security/)\n[malicious files, scripts, and messages, and block all related malicious URLs. The Trend Micro™ Deep Discovery™ solution also has](https://www.trendmicro.com/us/enterprise/security-risk-management/deep-discovery/)\n[a layer for email inspection that can protect enterprises by detecting malicious attachments and URLs.](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-inspector.html)\n\n**_Additional insights by Jett Paulo Bernardo, Arianne Dela Cruz, Dexter Esteves, Gerald Fernandez, Mark Marti,_**\n**_Ryan Pagaduan, and Louella Darlene Sevilla_**\n\nIndicators of compromise (IOCs)\n\n**SHA-256** **Description** **Detection name**\n\n48426fd5c5be7a8efdbbf2d9f0070626aa9bfe9734aab9278ddd293e889a19cc Emotet Trojan.XF.EMOTET.YJCCXB\nsample\nusing Excel\n4.0 macros\n\ne9bf38414636c6cef4cc35fad5523de205eca815b979ed36e96a7e6166a58370 Emotet TrojanSpy.Win32.EMOTET.YJCCY\npayload\n\n5c4f33e22f9def7f7fea863e08c38f6a8b4ea9fcc78911c23bb54c4fdf4590e1 Hexadecimal Trojan.XF.EMOTET.SMYXBLAA\nIP address\nsample\n\ne961e46fe0000505f4534e036a9d1d2a59823cf644438a2733ab659e9c22988b Octal IP Trojan.XF.EMOTET.SMYXBLAA\naddress\nsample\n\n### Recommended for you\n\nransomware\n\n|SHA-256|Description|Detection name|\n|---|---|---|\n|48426fd5c5be7a8efdbbf2d9f0070626aa9bfe9734aab9278ddd293e889a19cc|Emotet sample using Excel 4.0 macros|Trojan.XF.EMOTET.YJCCXB|\n|e9bf38414636c6cef4cc35fad5523de205eca815b979ed36e96a7e6166a58370|Emotet payload|TrojanSpy.Win32.EMOTET.YJCCY|\n|5c4f33e22f9def7f7fea863e08c38f6a8b4ea9fcc78911c23bb54c4fdf4590e1|Hexadecimal IP address sample|Trojan.XF.EMOTET.SMYXBLAA|\n|e961e46fe0000505f4534e036a9d1d2a59823cf644438a2733ab659e9c22988b|Octal IP address sample|Trojan.XF.EMOTET.SMYXBLAA|\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-19 - Bruised but Not Broken The Resurgence of the Emotet Botnet Malware.pdf"
    ],
    "report_names": [
        "2022-05-19 - Bruised but Not Broken The Resurgence of the Emotet Botnet Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536082,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653510729,
    "ts_modification_date": 1653510729,
    "files": {
        "pdf": "https://archive.orkl.eu/128cbc1086ceac514015e24e6f1d633caf4dbdf7.pdf",
        "text": "https://archive.orkl.eu/128cbc1086ceac514015e24e6f1d633caf4dbdf7.txt",
        "img": "https://archive.orkl.eu/128cbc1086ceac514015e24e6f1d633caf4dbdf7.jpg"
    }
}