{
    "id": "5908d17c-4366-4722-ad98-149f415b865a",
    "created_at": "2023-01-12T15:05:49.427301Z",
    "updated_at": "2025-03-27T02:16:23.234091Z",
    "deleted_at": null,
    "sha1_hash": "2843cf23d634a4203606dea6eabf6909d71caa85",
    "title": "2022-08-24 - The Anatomy of Wiper Malware, Part 2- Third-Party Drivers",
    "authors": "",
    "file_creation_date": "2022-09-01T10:30:41Z",
    "file_modification_date": "2022-09-01T10:30:41Z",
    "file_size": 8255623,
    "plain_text": "# The Anatomy of Wiper Malware, Part 2: Third-Party Drivers\n\n**crowdstrike.com/blog/the-anatomy-of-wiper-malware-part-2**\n\nIoan Iacob - Iulian Madalin Ionita August 24, 2022\n\nIn [Part 1 of this four-part blog series examining wiper malware, we introduced the topic of wipers,](https://www.crowdstrike.com/blog/the-anatomy-of-wiper-malware-part-1/)\nreviewed their recent history and presented common adversary techniques that leverage wipers to\ndestroy system data.\n\nIn Part 2, CrowdStrike’s Endpoint Protection Content Research Team discusses how threat actors\nhave used legitimate third-party drivers to bypass the visibility and detection capabilities of security\nmechanisms and solutions.\n\n## Third-Party Drivers\n\nFor a wiper developer, there are several good reasons to switch operations into kernel space.\nWhen it comes to overwriting disks, user mode has certain limitations and is intensely monitored\nby AV/XDR vendors through hooking various APIs and blocking select actions. With the release of\nWindows Vista, Microsoft began restricting access to raw disk sectors from user mode. To bypass\nthis, wiper developers began to drive their attack through the kernel space.\n\n[Threat actors may attempt to write their own kernel drivers, but this approach is difficult for a](https://www.crowdstrike.com/cybersecurity-101/threat-actor/)\nnumber of reasons. One is related to the lack of segregation between processes or drivers in\nKernel space; anything can write to anywhere with no restriction. With no room for error, the\n\n\n-----\n\nmachine may easily destabilize and crash. Another is that modern Windows 64-bit requires drivers\nto be signed by Microsoft.\n\nRather than writing their own kernel drivers, malware authors often resort to using drivers\ndeveloped by third-party entities in order to achieve their goals. Some notable examples of wiper\nfamilies that use third-party drivers include Destover, DriveSlayer, Shamoon, Dustman and\nZeroCleare. Most of these leverage different versions of the ElRawDisk driver developed by\n**Eldos, with the exception being DriveSlayer, who uses a driver developed by EaseUs.**\n\n### ElRawDisk Driver\n\nThe ElRawDisk device driver, developed by Eldos (now part of Callback Technologies), is used\nby several wiper families such as Destover, ZeroCleare, Dustman and Shamoon. The driver is\nused as a proxy to transfer actions from user mode into kernel mode and ensures that all disk\noperations are done on behalf of the driver, not the wiper process. This technique removes any\nlimitations user mode processes might encounter when writing files or interacting with the disk\ndirectly. Since this is a third-party driver, the malware must implement a way to install it on the\ninfected machine. Usually this is achieved by dropping the driver to disk and loading it via the\nService Control Manager APIs, or the sc.exe tool. Legitimate drivers are also seen as “clean” by\nsecurity vendors and it would not be blocked when they are installed.\n\nZeroCleare and Dustman use an unsigned version of ElRawDisk driver that is loaded using Turla\nDriver Loader (TDL). TDL installs a signed and vulnerable VBoxDrv driver. This driver is exploited\nto mimic the functionality of a driver loader and the unsigned ElRawDisk driver is mapped in kernel\nmode without having to patch Windows Driver Signature Enforcement (DSE).\n\nAfter loading the driver, the wipers must grab a handle to it via CreateFile and provide a key in\norder to authenticate to the driver. The key is appended to the device name, and parsed out by the\ndriver. If no valid key is supplied, the return value will be INVALID_HANDLE_VALUE. While this\nseems like a good idea to limit unauthorized access to the driver, in reality threat actors can\nreverse engineer the legitimate applications that use the ElRawDisk drivers and extract a copy of\nthe key. Then they use that key to impersonate the legitimate tool and achieve their goals.\nAnalyzed wipers use different keys for the ElRawDisk driver.\n\n\n-----\n\nFigure 1. Open handle to ElRawDisk device with the serial key appended to the device name\n\nShamoon retrieves information about the location of the file on the raw disk by sending the\n**FSCTL_GET_RETRIEVAL_POINTERS control code to the ElRawDisk device via the**\n**DeviceIoControl API. This information is later used to determine the raw sectors of the file that**\nneeds to be wiped.\n\n\n-----\n\nFigure 2. Send FSCTL_GET_RETRIEVAL_POINTERS via DeviceIoControl API\n\nShamoon attempts to wipe the entire disk, not only the files. In order to do so, it requests\npartitioning information by sending the IOCTL_DISK_GET_PARTITION_INFO_EX IOCTL to the\nElRawDisk driver. The partitioning information helps the wiper to determine what sectors to\noverwrite. To accomplish this, the wiper opens a handle to a specific partition via CreateFile and\noverwrites the sectors using WriteFile and SetFilePointer APIs. Shamoon writes a JPEG image to\nthe sectors, rendering the operating system unstable and may crash at any point in time.\n\n\n-----\n\nFigure 3. Send IOCTL_DISK_GET_PARTITION_INFO_EX via DeviceIoControl API\n\nThe code trace from Figure 4 exemplifies how wipers overwrite raw disk clusters by proxying\nactivity via the ElRawDisk device.\n\nFigure 4. API trace view demonstrating how the EPMNTDRV is used to wipe the disk\n\nZeroCleare and Dustman use the driver a bit differently than Shamoon. Once the ElRawDisk driver\n[is loaded using TDL and a handle to the driver is obtained, it calls DeviceIoControl using one of](https://github.com/hfiref0x/TDL)\ntwo different IOCTLs (0x22BF84 or 0x227F80), depending on the Windows version. This call is\ncapable of overwriting the contents of the physical drive with a message (as in Dustman wiper), or\na buffer with the same byte value (as in ZeroCleare wiper).\n\nThe following figure is used in both ZeroCleare and Dustman wipers. The customdata buffer\ncontains the data that is used to overwrite the contents of the physical drive.\n\nFigure 5. How ZeroCleare and Dustman use the ElRawDisk to overwrite the disk with a custom buffer\n\nAs seen in the ElRawDisk driver version used by Dustman and ZeroCleare, both these two IO\ncontrol codes translate to the same function call. The following snippet cannot be found in the\ndriver used by Shamoon because it’s an older version.\n\n\n-----\n\nFigure 6. Examples of two custom IOCTL codes from the ElRawDisk driver\n\n### EPMNTDRV Driver\n\n**EPMNTDRV is another example of a driver developed by a legitimate entity being used for**\nmalicious purposes by threat actors. This driver is developed by EaseUs for their partition\nmanager utility. Back in March of 2022, the DriveSlayer wiper used this driver against Ukraine. It\nwas kept inside a LZA compressed resource and loaded via the Windows Service Control\nManager APIs after it was written to disk by the malware. In the following figure, we can observe\nthe main function of the EPMNTDRV driver. It creates the device and a symbolic link followed by\ninitialization of the DRIVER_OBJECT structure with the necessary dispatch routines.\n\n\n-----\n\nFigure 7. Main function of the EPMNTDRV initiating various dispatch routines\n\nSimilarly to the previous driver, it allows any user-mode process to interact with the disk by\nproxying actions through itself. Interaction is achieved via dispatch routines like IRP_MJ_CREATE,\n**IRP_MJ_WRITE as well as IRP_MJ_DEVICE_CONTROL. To interact with the driver, the process**\nneeds to open a handle to the device via CreateFile and provide a path like “\\\\.\\EPMNTDRV\\\n\n[value]”, where [value] represents the ID of the disk. The driver will then allow the user to operate\non the “\\Device\\Harddisk[value]\\Partition0” device through it.\n\n\n-----\n\nFigure 8. Pseudocode view of the IRP_MJ_CREATE dispatch routine from EPMNTDRV driver, showcasing how\n\nit opens a handle to the local disk (\\Device\\Harddisk%u\\Partition0)\n\nIn the IRP_MJ_CREATE routine of the driver, a pointer to the “\\Device\\Harddisk%u\\Partition0” is\nobtained via IoGetDeviceObjectPointer and IoGetAttachedDeviceReference APIs and stored in\na global variable to be later used in the other dispatch routines.\n\n\n-----\n\nFigure 9. Pseudocode view of the IRP_MJ_WRITE dispatch routine from EPMNTDRV driver, showcasing how an\n\nIRP request is created and sent to the driver handling the HardDisk device.\n\nThe IRP_MJ_WRITE handles the write requests coming from the user mode process.and forwards\nthem to the driver handling the disk operations. In order to achieve this, the driver makes use of\nthe IoBuildAsynchronousFsdRequest API to construct an IRP request and sends it to the driver\nvia the IofCallDriver API.\n\n\n-----\n\nFigure 10. Pseudocode view of the IRP_MJ_DEVICE_CONTROL dispatch routine from EPMNTDRV driver,\n\nshowcasing how IO control codes are forwarded to the HDD device driver\n\nThe the user mode process send a IOCTL to the EPMNTDRV device, the dispatch routine\nhandling IRP_MJ_DEVICE_CONTROL requests is called and it forwards the requests to the driver\nhandling disk operations via the IoBuildDeviceIoControlRequest and IofCallDriver APIs.\n\n\n-----\n\nFigure 11. Pseudocode from DriveSlayer displaying how to data is sent to the third-party driver in order to\n\noverwrite the disk\n\nNow that the EPMNTDRV driver is installed, the wiper can grab a handle to it via CreateFile and\nuse standard WriteFile and DeviceIoControl APIs in order to send data to the driver. All requests\nfrom user mode are then forwarded to the disk driver. Now, the malware can now wipe the MBR,\nMFT, and files on behalf of the legitimate driver.\n\n## How the Falcon Platform Offers Continuous Monitoring and Visibility\n\nThe CrowdStrike Falcon platform takes a layered approach to protecting workloads, harnessing®\nover a trillion data points analyzed daily in the CrowdStrike Security Cloud. Combining on-sensor\nand cloud-based machine learning, industry-leading behavioral analysis to fuel indicators of attack\n[(IOAs) (including recently announced AI-powered IOAs), and advanced threat intelligence the](https://www.crowdstrike.com/blog/introducing-ai-powered-indicators-of-attack-ioas/)\nFalcon platform provides users with holistic attack surface visibility, unparalleled threat detection\nand continuous monitoring for any environment, reducing the time to detect and mitigate threats.\n\n\n-----\n\nFigure 12. Falcon UI screenshot showcasing detection of DriveSlayer by the Falcon sensor. (Click to enlarge)\n\nFigure 13 Falcon UI screenshot showcasing detection of Shamoon by the Falcon sensor (Click to enlarge)\n\n\n-----\n\n## Summary\n\nMultiple wiper families leverage legitimate third-party kernel drivers as proxies for running\nmalicious activities. This provides the wipers with multiple advantages; enabling them to operate in\na stealthy manner and bypassing several security products. A kernel implant provides limitless\ncapabilities for the attacker, including easy access to the entire disk, without the operating system\ngetting in the way. Many of the wipers we’ve analyzed use legitimate drivers to wipe raw disk\nsectors and, in some instances, protected files. The main weakness of this approach is that wiping\nraw sectors will destabilize the operating system, making it liable to crash at any moment.\nCrashing the OS may be in the victim’s advantage because this would halt wiping operations and\npotentially allow the victim to recover some of their data.\n\nIn Part 3 of this wiper series, we will discuss additional and less frequently utilized techniques\nimplemented by various wiper families.\n\n## Hashes\n\n**Wiper name** **SHA256 hash value**\n\nApostle 6fb07a9855edc862e59145aed973de9d459a6f45f17a8e779b95d4c55502dcce\n19dbed996b1a814658bef433bad62b03e5c59c2bf2351b793d1a5d4a5216d27e\n\nCaddyWiper a294620543334a721a2ae8eaaf9680a0786f4b9a216d75b55cfd28f39e9430ea\n\nDestover e2ecec43da974db02f624ecadc94baf1d21fd1a5c4990c15863bb9929f781a0a\n\nDoubleZero 3b2e708eaa4744c76a633391cf2c983f4a098b46436525619e5ea44e105355fe\n30b3cbe8817ed75d8221059e4be35d5624bd6b5dc921d4991a7adc4c3eb5de4a\n\nDriveSlayer 0385eeab00e946a302b24a91dea4187c1210597b8e17cd9e2230450f5ece21da\n1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\n\na259e9b0acf375a8bef8dbc27a8a1996ee02a56889cba07ef58c49185ab033ec\n\nDustman f07b0c79a8c88a5760847226af277cf34ab5508394a58820db4db5a8d0340fc7\n\nIsaacWiper 13037b749aa4b1eda538fda26d6ac41c8f7b1d02d83f47b0d187dd645154e033\n7bcd4ec18fc4a56db30e0aaebd44e2988f98f7b5d8c14f6689f650b4f11e16c0\n\nIsraBye 5a209e40e0659b40d3d20899c00757fa33dc00ddcac38a3c8df004ab9051de0d\n\nKillDisk 8a81a1d0fae933862b51f63064069aa5af3854763f5edc29c997964de5e284e5\n1a09b182c63207aa6988b064ec0ee811c173724c33cf6dfe36437427a5c23446\n\n\n-----\n\nMeteor and\nComet/Stardust\n\n\n2aa6e42cb33ec3c132ffce425a92dfdb5e29d8ac112631aec068c8a78314d49b\nd71cc6337efb5cbbb400d57c8fdeb48d7af12a292fa87a55e8705d18b09f516e\n\n6709d332fbd5cde1d8e5b0373b6ff70c85fee73bd911ab3f1232bb5db9242dd4\n\n9b0f724459637cec5e9576c8332bca16abda6ac3fbbde6f7956bc3a97a423473\n\n\nOrdinypt ​085256b114079911b64f5826165f85a28a2a4ddc2ce0d935fa8545651ce5ab09\n\nPetya 0f732bc1ed57a052fecd19ad98428eb8cc42e6a53af86d465b004994342a2366\nfd67136d8138fb71c8e9677f75e8b02f6734d72f66b065fc609ae2b3180a1cbf\n\n4c1dc737915d76b7ce579abddaba74ead6fdb5b519a1ea45308b8c49b950655c\n\nShamoon e2ecec43da974db02f624ecadc94baf1d21fd1a5c4990c15863bb9929f781a0a\nc7fc1f9c2bed748b50a599ee2fa609eb7c9ddaeb9cd16633ba0d10cf66891d8a\n\n7dad0b3b3b7dd72490d3f56f0a0b1403844bb05ce2499ef98a28684fbccc07b4\n\n8e9681d9dbfb4c564c44e3315c8efb7f7d6919aa28fcf967750a03875e216c79\n\nf9d94c5de86aa170384f1e2e71d95ec373536899cb7985633d3ecfdb67af0f72\n\n4f02a9fcd2deb3936ede8ff009bd08662bdb1f365c0f4a78b3757a98c2f40400\n\nSQLShred/Agrius 18c92f23b646eb85d67a890296000212091f930b1fe9e92033f123be3581a90f\ne37bfad12d44a247ac99fdf30f5ac40a0448a097e36f3dbba532688b5678ad13\n\nStoneDrill 62aabce7a5741a9270cddac49cd1d715305c1d0505e620bbeaec6ff9b6fd0260\n2bab3716a1f19879ca2e6d98c518debb107e0ed8e1534241f7769193807aac83\n\nbf79622491dc5d572b4cfb7feced055120138df94ffd2b48ca629bb0a77514cc\n\n\nTokyo Olympic\nwiper\n\n\nfb80dab592c5b2a1dcaaf69981c6d4ee7dbf6c1f25247e2ab648d4d0dc115a97\nc58940e47f74769b425de431fd74357c8de0cf9f979d82d37cdcf42fcaaeac32\n\n\nWhisperGate a196c6b8ffcb97ffb276d04f354696e2391311db3841ae16c8c9f56f36a38e92\n44ffe353e01d6b894dc7ebe686791aa87fc9c7fd88535acc274f61c2cf74f5b8\n\ndcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5329958d38b58c3fd9384081c9b78\n\nZeroCleare becb74a8a71a324c78625aa589e77631633d0f15af1473dfe34eca06e7ec6b86\n\n**Additional Resources**\n\n_Find out more about today’s adversaries and how to combat them at Fal.Con 2022, the_\n_[cybersecurity industry’s most anticipated annual event. Register now and meet us in Las](https://www.crowdstrike.com/events/fal-con/)_\n_Vegas, Sept. 19-21!_\n\n\n-----\n\n_[Learn how the powerful CrowdStrike Falcon platform provides comprehensive protection](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_across your organization, workers and data, wherever they are located._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and see for yourself how true](https://www.crowdstrike.com/resources/free-trials/try-falcon-prevent/)_\n_next-gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-24 - The Anatomy of Wiper Malware, Part 2- Third-Party Drivers.pdf"
    ],
    "report_names": [
        "2022-08-24 - The Anatomy of Wiper Malware, Part 2- Third-Party Drivers.pdf"
    ],
    "threat_actors": [
        {
            "id": "21e01940-3851-417f-9e90-1a4a2da07033",
            "created_at": "2022-10-25T16:07:23.299369Z",
            "updated_at": "2025-03-27T02:02:09.725295Z",
            "deleted_at": null,
            "main_name": "Agrius",
            "aliases": [
                "AMERICIUM",
                "Agonizing Serpens",
                "BlackShadow",
                "DEV-0227",
                "Pink Sandstorm",
                "SharpBoys"
            ],
            "source_name": "ETDA:Agrius",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agrius",
                "BFG Agonizer",
                "BFG Agonizer Wiper",
                "DEADWOOD",
                "DETBOSIT",
                "Detbosit",
                "IPsec Helper",
                "Moneybird",
                "MultiLayer Wiper",
                "PW",
                "PartialWasher",
                "PartialWasher Wiper",
                "SQLShred",
                "Sqlextractor"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "89c0c674-c35d-47a6-bd7c-1e6c1b6beacc",
            "created_at": "2024-05-01T02:03:08.042533Z",
            "updated_at": "2025-03-27T02:05:17.3236Z",
            "deleted_at": null,
            "main_name": "COBALT SHADOW",
            "aliases": [
                "AMERICIUM ",
                "Agrius",
                "BlackShadow",
                "DEV-0227 ",
                "Malek Team",
                "Pink Sandstorm ",
                "Agonizing Serpens "
            ],
            "source_name": "Secureworks:COBALT SHADOW",
            "tools": [
                " DEADWOOD",
                " Fantasy wiper",
                " Host2IP",
                " IPsec Helper",
                " Jennlog Loader",
                " MiniDump",
                " Moneybird ransomware",
                " PSexec",
                " Plink",
                " Sandals",
                " SecretsDump",
                " SoftPerfect Network Scanner",
                "Apostle"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4023e661-f566-4b5b-a06f-9d370403f074",
            "created_at": "2024-02-02T02:00:04.064685Z",
            "updated_at": "2025-03-27T02:00:03.304692Z",
            "deleted_at": null,
            "main_name": "Pink Sandstorm",
            "aliases": [
                "Agonizing Serpens",
                "AMERICIUM",
                "BlackShadow",
                "DEV-0022",
                "Agrius"
            ],
            "source_name": "MISPGALAXY:Pink Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7d982d5b-3428-483c-8804-c3ab774f1861",
            "created_at": "2024-11-01T02:00:52.70975Z",
            "updated_at": "2025-03-27T02:00:55.517246Z",
            "deleted_at": null,
            "main_name": "Agrius",
            "aliases": [
                "Agrius",
                "Pink Sandstorm",
                "AMERICIUM",
                "Agonizing Serpens",
                "BlackShadow"
            ],
            "source_name": "MITRE:Agrius",
            "tools": [
                "NBTscan",
                "Mimikatz",
                "IPsec Helper",
                "Moneybird",
                "MultiLayer Wiper",
                "DEADWOOD",
                "BFG Agonizer",
                "ASPXSpy"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535949,
    "ts_updated_at": 1743041783,
    "ts_creation_date": 1662028241,
    "ts_modification_date": 1662028241,
    "files": {
        "pdf": "https://archive.orkl.eu/2843cf23d634a4203606dea6eabf6909d71caa85.pdf",
        "text": "https://archive.orkl.eu/2843cf23d634a4203606dea6eabf6909d71caa85.txt",
        "img": "https://archive.orkl.eu/2843cf23d634a4203606dea6eabf6909d71caa85.jpg"
    }
}