{
    "id": "591911bb-382e-45c1-a0d0-1a436f9f8a2f",
    "created_at": "2022-12-27T17:06:07.341051Z",
    "updated_at": "2025-03-18T19:54:51.33409Z",
    "deleted_at": null,
    "sha1_hash": "333a25d9f21c52cd2f9505bc235211f5350dcd5c",
    "title": "Mitigate the GRUB2 BootHole Vulnerability",
    "authors": "NSA",
    "file_creation_date": "2020-07-30T16:41:30Z",
    "file_modification_date": "2020-07-30T16:41:30Z",
    "file_size": 216186,
    "plain_text": "National Security Agency | Cybersecurity Advisory\n\nMitigate the GRUB2 BootHole Vulnerability\nSummary\nEclypsium® has disclosed a vulnerability, CVE-2020-10713 also known as BootHole [1], in the Grand Unified Bootloader\n(GRUB2) that is widely used to boot Linux®-based operating systems. The vulnerability is triggered by modifying a\nGRUB2 configuration file to force a buffer overflow allowing arbitrary code execution. The vulnerability allows malicious\nactors to subvert the boot process and introduce untrusted code, commonly referred to as bootkits, enabling highly\neffective persistence on an endpoint. The vulnerability can also be used to bypass Unified Extensible Firmware Interface\n(UEFI) Secure Boot validation mechanisms allowing malicious code to execute prior to loading the operating system.\nExploitation of the BootHole vulnerability requires modifying a configuration file that is parsed by a vulnerable version of\nGRUB2. The configuration file is not commonly signed, measured at boot time, or encrypted. Physical access or\nadministrator privilege is required to exploit the vulnerability and subvert the boot process. Use of hardware-based full disk\nencryption may mitigate some threats from physical access.\nA boot component known as Shim is used to load GRUB2 when Secure Boot is enabled. Linux distributions embed their\ndistribution specific key in Shim which allows loading of bootloaders, such as GRUB2, signed by the distribution’s specific\nkey. Many versions of Shim have been signed by the Microsoft Third Party UEFI Certificate Authority (CA) and the\nMicrosoft CA is trusted by many modern business and consumer computers. The BootHole vulnerability is not in Shim,\nbut the trust of the Shim binaries must be revoked in order to prevent loading of vulnerable versions of GRUB2 that are\nallowed by existing signed versions of Shim. Eclypsium and industry members have identified many vulnerable GRUB2\nbinaries as well as many Shim binaries that will load a vulnerable version of GRUB2.\nIf an endpoint does not have Secure Boot enabled, then the endpoint is already vulnerable to boot malware regardless of\nthe GRUB2 vulnerability being present. Linux-based endpoints may not commonly have Secure Boot enabled. Software\nthat is not maintained by a distribution, such as commercial security software, may have unsigned kernel modules that\nprevent adoption of Secure Boot unless local administrators sign the kernel modules. While all affected endpoints should\nbe mitigated, prioritization should be given to endpoints that have Secure Boot enabled, use software-based full disk\nencryption, or whose owners cannot maintain exclusive physical control due to being mobile devices (e.g. laptops and\ntablets).\nAdditional GRUB2 vulnerabilities (CVE-2020-14308, CVE-2020-14309, CVE-2020-14310, CVE-2020-14311, CVE-202015705, CVE-2020-15706, CVE-2020-15707, CVE-2020-7205) and Linux kernel vulnerabilities (CVE-2019-20908, CVE2020-15780) have been discovered by industry members while investigating the BootHole vulnerability. Exploitation of the\nvulnerabilities may also allow bypass of Secure Boot as well as compromise of boot components and must be patched.\n\nMitigation Actions\nAdministrators may choose from two different options to mitigate the GRUB2 vulnerability. The standard mitigation option\ninvolves updating an endpoint’s vulnerable boot components and revoking the trust of existing boot components. The\nstandard mitigation is best suited for typical consumer, business, and enterprise environments.\nA more advanced mitigation involves implementing a Secure Boot trust infrastructure and customizing the endpoint’s\nSecure Boot implementation to use that trust infrastructure. The advanced mitigation option is best suited for endpoints\nthat have higher security and integrity requirements.\n\nStandard Mitigation: Update and Revoke Trust of Vulnerable Boot Components\nLinux-based endpoints require updating their boot components and revoking the trust in older boot components.\nWindows® endpoints only require revoking trust if the endpoint’s firmware trusts the specific CA identified in Microsoft’s\nadvisory [2]. Fully mitigating the BootHole vulnerability requires multiple steps that must be performed in a specific order\n\nU/OO/156920-20| PP-20-0670 | Jul 2020 Rev. 1.0\n\nNational Security Agency | Cybersecurity Advisory\nto update and revoke the trust for existing signed boot components. Failure to ensure each step is completed before\nproceeding to the next step may result in an endpoint no longer being able to boot while Secure Boot is enabled.\nThe steps in this section provide a general outline of the mitigation process. Refer to operating system, virtualization\nsoftware, and Original Equipment Manufacturer (OEM) vendor advisories linked from Eclypsium’s advisory to ensure that\nall vendor specific steps are taken into account before implementing the mitigations.\nStep 1: Update Boot Components\nLinux-based endpoints must have their boot components updated with patches issued by distribution maintainers.\nUpdating the boot components must be performed before any other mitigation steps, otherwise later steps could render\nthe endpoint unbootable while Secure Boot is enabled. Windows endpoints do not need their boot components updated\nsince Windows uses different boot components than Linux endpoints and Windows boot components are signed by a\ndifferent certificate authority. Updating the endpoint’s firmware is also recommended as some OEMs require that a\nfirmware update be applied before revoking trust in older boot components\nIn addition to traditional desktop, server, laptop, and tablet form factors, updates may need to be applied to network\ndevices and appliances (e.g. firewalls, web proxies, email gateways which commonly use Linux), installation and recovery\nmedia, dual/multi boot endpoints, virtualization software, and cloud vendor provided boot images. Note that dual/multi\nboot endpoints may need to be updated multiple times to ensure each operating system instance has updated boot\ncomponents.\nUpdating the endpoint’s boot components patches the vulnerable code, but endpoints are still vulnerable to exploitation\nwithout taking additional action to revoke the trust of existing signed boot components that load vulnerable versions of\nGRUB2. Malicious actors could roll back patches or leverage existing boot components to compromise the endpoint until\ntrust is revoked.\nStep 2: Test Boot Component Trust Revocation\nThe UEFI Forbidden Signatures Database (DBX) contains hashes and certificates used to revoke trust of boot\ncomponents. The firmware will not execute the boot component when a hash in the DBX matches the hash of a boot\ncomponent or when a certificate in the DBX matches the certificate that validates the signature of a boot component. For\nthe BootHole vulnerability, the DBX needs to be updated to block all the existing signed versions of Shim that can load a\nvulnerable version of GRUB2. The DBX can be updated by installing vendor issued patches that update the DBX or by\nrunning operating system specific tools or commands that apply the UEFI Forum’s UEFI Revocation List File [3] to the\nDBX. Refer to operating system vendor documentation, linked from Eclypsium’s advisory, for information on how to apply\nthe DBX updates using operating system specific tools.\nWindows endpoints only require revoking trust if the endpoint’s firmware trusts the specific CA identified in Microsoft’s\nadvisory [2]. Microsoft’s knowledge base article [4] indicates that patches that apply the DBX update may not be available\nvia Windows Update until sometime in 2021.\nSome OEM’s models have experienced problems when adding a large amount of entries to the DBX. Some endpoints\nmay become unbootable if too many DBX entries are added. When the problem exists, the problem typically exists in all\nfirmware revisions up to a specific firmware revision. Testing all different firmware revisions per model used in an\nenterprise is crucial to ensuring that endpoints do not become unbootable when Secure Boot is enabled.\nAdministrators may find that a more straightforward testing approach is to update all endpoints to the latest available\nfirmware revision before applying the UEFI Revocation List File, or applying a vendor issued patch, to update the DBX.\nSome OEMs require a firmware update before applying the DBX update. Refer to OEM advisories, linked from\nEclypsium’s advisory, for additional information and instructions.\nUnforeseen problems may arise from applying a DBX update, as happened earlier this year [5], due to the diversity of the\nUEFI ecosystem. Windows endpoints that use BitLocker® for full disk encryption, but have not had BitLocker suspended\nbefore applying a firmware update or a Secure Boot configuration change such as a DBX update, will need the BitLocker\n\nU/OO/156920-20 | PP-20-0670 | Jul 2020 Rev. 1.0\n\n4\n\nNational Security Agency | Cybersecurity Advisory\nRecovery Key to successfully boot. Administrators must ensure a selection of endpoints are tested that fully represent the\ndiversity of endpoints in the enterprise that includes all OEMs, models, and firmware revisions.\nStep 3: Apply Boot Component Trust Revocation\nApply the DBX updates across the enterprise once all endpoint boot components have been updated and the DBX\nupdates have been tested on a representative population of endpoints. Remember, if the DBX updates are applied before\nupdating the endpoint’s boot components, then the boot components will no longer be trusted to execute by the firmware\nand could render the endpoint unable to boot while Secure Boot is enabled.\n\nAdvanced Mitigation: Implement Custom UEFI Secure Boot Trust\nBusiness and enterprise class models may allow Secure Boot to be customized so that Microsoft and system vendor\nSecure Boot certificates can be minimized or removed. Secure Boot customization requires that an enterprise operate\ntheir own certificate infrastructure. UEFI Option ROMs, boot binaries, kernels, kernel modules, and drivers may all need to\nbe signed using the enterprise’s certificate infrastructure. Customization involves the largest administrative overhead but\nprovides immediate and complete mitigation of the GRUB2 vulnerability. Secure Boot customization is best suited for\nendpoints that have higher security and integrity requirements. See the upcoming NSA cybersecurity technical report\n“UEFI Secure Boot Customization” for more information and instructions [6].\n\nDetection Guidance\nMonitoring for changes to firmware, firmware configuration, and boot components is recommended due to the amount of\ntime that may be required to perform effective testing before all mitigations can be applied to all endpoints. The Extensible\nFirmware Interface System Partition (ESP) is a location that UEFI firmware uses to load operating system boot\ncomponents. The contents of the ESP should not change often. Security operations personnel may want to ensure\nmetadata of ESP contents such as names, paths, signatures, and hashes of binaries as well as names, paths, hashes,\nand file sizes of non-executable content (e.g. configuration files) are continuously collected to aid in identifying known\nvulnerable boot components and to enable the ability to perform anomaly detection.\n\nAdditional Guidance\nAdditional guidance related to hardware and firmware security is published at https://github.com/nsacyber/Hardware-andFirmware-Security-Guidance on an ongoing basis.\n\nWorks Cited\n[1] Eclypsium (2020). There’s a hole in the boot. [Online] Available at: https://www.eclypsium.com/2020/07/29/theres-a-hole-inthe-boot/\n[2] Microsoft (2020). ADV200011 | Microsoft Guidance for Addressing Security Feature Bypass in GRUB. [Online] Available at:\nhttps://portal.msrc.microsoft.com/en-US/security-guidance/advisory/ADV200011\n[3] UEFI Forum (2020). UEFI Revocation List File. [Online] Available at: https://www.uefi.org/revocationlistfile\n[4] Microsoft (2020). Microsoft guidance for applying Secure Boot DBX update. [Online] Available at:\nhttps://support.microsoft.com/en-us/help/4575994/microsoft-guidance-for-applying-secure-boot-dbx-update\n[5] ZDNet (2020). Microsoft pulls security update after reports of issues affecting some PCs. [Online] Available at:\nhttps://www.zdnet.com/article/microsoft-pulls-security-update-after-reports-of-issues-affecting-some-pcs/\n[6] National Security Agency (2020). UEFI Secure Boot Customization. [Online] Available at: https://www.nsa.gov/What-WeDo/Cybersecurity/Advisories-Technical-Guidance/\n\nU/OO/156920-20 | PP-20-0670 | Jul 2020 Rev. 1.0\n\n4\n\nNational Security Agency | Cybersecurity Advisory\nTrademarks\nEclypsium is a registered trademark of Eclypsium, Inc in the United States and/or other countries.\nLinux is the registered trademark of Linus Torvalds in the U.S. and other counties.\nWindows and BitLocker are registered trademarks of Microsoft Corporation in the United States and/or other countries.\n\nDisclaimer of Endorsement\nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific\ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement,\nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.\n\nPurpose\nThis document was developed in furtherance of NSA’s cybersecurity missions, including its responsibilities to identify and disseminate threats to\nNational Security Systems, Department of Defense information systems, and the Defense Industrial Base, and to develop and issue cybersecurity\nspecifications and mitigations. This information may be shared broadly to reach all appropriate stakeholders.\n\nContact\nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center, 410-854-4200, Cybersecurity_Requests@nsa.gov\nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov\n\nU/OO/156920-20 | PP-20-0670 | Jul 2020 Rev. 1.0\n\n4",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://media.defense.gov/2020/Jul/30/2002467902/-1/-1/0/CSA_MITIGATE_THE_GRUB2_BOOTHOLE_VULNERABILITY_20200730_NSA_GOV%20-%20COPY.PDF"
    ],
    "report_names": [
        "CSA_MITIGATE_THE_GRUB2_BOOTHOLE_VULNERABILITY_20200730_NSA_GOV - COPY.PDF"
    ],
    "threat_actors": [],
    "ts_created_at": 1672160767,
    "ts_updated_at": 1742327691,
    "ts_creation_date": 1596127290,
    "ts_modification_date": 1596127290,
    "files": {
        "pdf": "https://archive.orkl.eu/333a25d9f21c52cd2f9505bc235211f5350dcd5c.pdf",
        "text": "https://archive.orkl.eu/333a25d9f21c52cd2f9505bc235211f5350dcd5c.txt",
        "img": "https://archive.orkl.eu/333a25d9f21c52cd2f9505bc235211f5350dcd5c.jpg"
    }
}