{
    "id": "5942782c-af4c-4d2a-a2b6-f2f45ca4fa4d",
    "created_at": "2023-01-12T15:04:13.11742Z",
    "updated_at": "2025-03-27T02:14:45.076885Z",
    "deleted_at": null,
    "sha1_hash": "f5afa9f2fe2c66cb331de0dad150778365d8ea62",
    "title": "2020-12-01 - Running in Circles Uncovering the Clients of Cyberespionage Firm Circles",
    "authors": "",
    "file_creation_date": "2022-05-28T15:40:18Z",
    "file_modification_date": "2022-05-28T15:40:18Z",
    "file_size": 1982007,
    "plain_text": "# Running in Circles Uncovering the Clients of Cyberespionage Firm Circles\n\n**[citizenlab.ca/2020/12/running-in-circles-uncovering-the-clients-of-cyberespionage-firm-circles/](https://citizenlab.ca/2020/12/running-in-circles-uncovering-the-clients-of-cyberespionage-firm-circles/)**\n\n[Research](https://citizenlab.ca/category/research/)\n\n\nDecember 1, 2020\n\n\n-----\n\n[Targeted Threats](https://citizenlab.ca/category/research/targeted-threats/)\nBy [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [John Scott-Railton,](https://citizenlab.ca/author/jsrailton/) [Siddharth Prakash Rao,](https://citizenlab.ca/author/siddharth/) [Siena Anstis, and](https://citizenlab.ca/author/siena-anstis/) [Ron Deibert](https://citizenlab.ca/author/profd/)\n\n[1] Public interest technologist\n\nDecember 1, 2020\n[Download this report](https://tspace.library.utoronto.ca/bitstream/1807/106212/1/Report%23133--runningincircles.pdf)\n\n## Summary & Key Findings\n\n_Circles is a surveillance firm that reportedly exploits weaknesses in the global mobile_\nphone system to snoop on calls, texts, and the location of phones around the globe.\n[Circles is affiliated with NSO Group, which develops the oft-abused Pegasus spyware.](https://citizenlab.ca/2019/10/nso-q-cyber-technologies-100-new-abuse-cases/)\nCircles, whose products work without hacking the phone itself, says they sell only to\n[nation-states. According to leaked documents, Circles customers can purchase a](https://web.archive.org/web/20190409205521/https://www.alaraby.co.uk/file/get/4749a75b-fc46-4917-85d3-7f8b41d4b34a)\nsystem that they connect to their local telecommunications companies’ infrastructure,\nor can use a separate system called the “Circles Cloud,” which interconnects with\ntelecommunications companies around the world.\nAccording to the U.S. Department of Homeland Security, all U.S. wireless networks are\nvulnerable to the types of weaknesses reportedly exploited by Circles. A majority of\nnetworks around the globe are similarly vulnerable.\nUsing Internet scanning, we found a unique signature associated with the hostnames\nof Check Point firewalls used in Circles deployments. This scanning enabled us to\nidentify Circles deployments in at least 25 countries.\nWe determine that the governments of the following countries are likely Circles\ncustomers: Australia, Belgium, Botswana, Chile, Denmark, Ecuador, El Salvador,\nEstonia, Equatorial Guinea, Guatemala, Honduras, Indonesia, Israel, Kenya, Malaysia,\nMexico, Morocco, Nigeria, Peru, Serbia, Thailand, the United Arab Emirates (UAE),\nVietnam, Zambia, and Zimbabwe.\n\n\n-----\n\nSome of the specific government branches we identify with varying degrees of\nconfidence as being Circles customers have a history of leveraging digital technology\nfor human rights abuses. In a few specific cases, we were able to attribute the\ndeployment to a particular customer, such as the Security Operations Command\n(ISOC) of the Royal Thai Army, which has allegedly tortured detainees.\n\n## 1. Background\n\nThe public discussion around surveillance and tracking largely focuses on well known\ntechnical means, such as targeted hacking and network interception. However, other forms\nof surveillance are regularly and extensively used by governments and third parties to\nengage in cross-border surveillance and monitoring.\n\nOne of the widest-used—but least appreciated—is the leveraging of weaknesses in the\nglobal mobile telecommunications infrastructure to monitor and intercept phone calls and\ntraffic.\n\nWhile well-resourced governments have long had the ability to conduct such activity, in\nrecent years companies have emerged to sell these capabilities. For example, the Guardian\n[reported in March 2020 that Saudi Arabia appeared to be “exploiting weaknesses in the](https://www.theguardian.com/world/2020/mar/29/revealed-saudis-suspected-of-phone-spying-campaign-in-us)\nglobal mobile telecommunications network to track citizens as they travel around the US.”\nOther investigative reports indicated that journalists, dissidents, and opposition politicians in\n[Nigeria and](https://www.premiumtimesng.com/investigationspecial-reports/204987-investigation-governors-dickson-okowa-spend-billions-high-tech-spying-opponents-others.html) [Guatemala were similarly targeted.](https://nomada.gt/pais/la-corrupcion-no-es-normal/espionaje-ilegal-del-gobierno-aqui-esta-la-investigacion-de-nuestro-diario-parte-i/)\n\nAbuse of the global telephone system for tracking and monitoring is believed to be\nwidespread, however it is difficult to investigate. When a device is tracked—or messages\nintercepted—there are not necessarily any traces on the target’s device for researchers or\ninvestigators to find. Meanwhile, cellular carriers have many technical difficulties identifying\nand blocking abuses of their infrastructure.\n\n### SS7 Attacks\n\nSignaling System 7 (SS7) is a protocol suite developed in 1975 for exchanging information\nand routing phone calls between different wireline telecommunications companies. At the\ntime of SS7’s development, the global phone network consisted of a small club of\nmonopolistic telecommunications operators. Because these companies generally trusted\neach other, SS7 designers saw no pressing need to include authentication or access control.\nHowever, the advent of telecommunications deregulation and mobile technology soon began\nto challenge the assumption of trust. Even so, SS7 endured, thanks to a desire to maintain\ninteroperability with older equipment.\n\nBecause of SS7’s lack of authentication, any attacker that interconnects with the SS7\n[network (such as an intelligence agency, a cybercriminal purchasing SS7 access, or a](https://www.theverge.com/2017/6/13/15794292/ss7-hack-dark-web-tap-phone-texts-cyber-crime)\n[surveillance firm running a fake phone company) can send commands to a subscriber’s](https://www.intelligenceonline.com/surveillance--interception/2015/12/02/circles---mobile-phone--company-intercepts-3g,108114286-art)\n\n\n-----\n\nhome network falsely indicating that the subscriber is roaming. These commands allow the\nattacker to track the victim’s location, and intercept voice calls and SMS text messages.\nSuch capabilities could also be used to intercept codes used for two-factor authentication\nsent via SMS. It is challenging and expensive for telecommunications operators to\ndistinguish malicious traffic from benign behavior, making these attacks tricky to block.\n\nToday, SS7 is predominantly used in 2G and 3G mobile networks (4G networks use the\nnewer Diameter protocol). One of SS7’s key functions in these networks is handling roaming,\nwhere a subscriber to a “home network” can connect to a different “visited network,” such as\nwhen traveling internationally. In this situation, SS7 is used to handle forwarding of phone\ncalls and SMS text messages to the “visited network.” Although 4G’s Diameter protocol\n[includes features for authentication and access control, these are optional. Additionally, the](https://www.riverpublishers.com/journal_read_html_article.php?j=JICTS/5/1/3)\nneed for Diameter networks to interconnect with SS7 networks also introduces security\nissues. There is widespread concern that 5G technology and other advances will inherit the\nrisks of these older systems.\n\n### Circles\n\nWhile companies selling exploitation of the global cellular system tend to operate in secrecy,\none company has emerged as a known player: Circles. The company was reportedly\n[founded in 2008,](https://www.haaretz.com/israel-news/.premium.MAGAZINE-israel-s-cyber-spy-industry-aids-dictators-hunt-dissidents-and-gays-1.6573027) [acquired in 2014 by Francisco Partners, and then merged with NSO Group.](https://www.forbes.com/sites/thomasbrewster/2019/08/05/a-multimillionaire-surveillance-dealer-steps-out-of-the-shadows-and-his-9-million-whatsapp-hacking-van/#4be8195b31b7)\n[Circles is known for selling systems to exploit SS7 vulnerabilities, and claims to sell this](https://www.vice.com/en/article/ep48kp/nso-group-cyprus-circles-bulgaria-ss7)\ntechnology exclusively to nation-states.\n\nUnlike NSO Group’s Pegasus spyware, the SS7 mechanism by which Circles’ product\nreportedly operates does not have an obvious signature on a target’s phone, such as the\ntelltale targeting SMS bearing a malicious link that is sometimes present on a phone targeted\nwith Pegasus.\n\nMost investigation of Circles has relied on inside sources and open source intelligence,\nrather than technical analysis. For example, a 2016 investigation by Nigerian newspaper\n_Premium Times_ [reported that two state governors in Nigeria acquired Circles systems and](https://www.premiumtimesng.com/investigationspecial-reports/204987-investigation-governors-dickson-okowa-spend-billions-high-tech-spying-opponents-others.html)\nused them to spy on political opponents. In one case, the system was installed at the\nresidence of a governor. Our scanning found two Circles systems in Nigeria (Section 4).\n\n[Documents filed as part of a lawsuit against NSO Group in Israel purport to show emails](https://web.archive.org/web/20190409205521/https://www.alaraby.co.uk/file/get/4749a75b-fc46-4917-85d3-7f8b41d4b34a)\nexchanged between Circles and several customers in the UAE. Most famously, the\ndocuments [show Circles sending targets’ locations and phone records (Call Detail Records](https://www.nytimes.com/2018/08/31/world/middleeast/hacking-united-arab-emirates-nso-group.html)\nor CDRs) to the UAE Supreme Council on National Security (SCNS), apparently as part of a\nproduct demonstration. The emails also indicate that intercepting phone calls of a foreign\ntarget has a higher chance of success when the target is roaming.\n\n\n-----\n\nFigure 1: The logo of Circles.\nThe same documents explain some facets of how the Circles system operated. The SCNS\nwas set to receive two separate systems: a standalone system that could be used for local\ninterceptions and a separate system connected to the “Circles Cloud” (an entity with roaming\nagreements around the world) that could be used for interceptions outside of the UAE if\ndesired.\n\n**Circles System Component** **Function**\n\nOffline, on-premises deployment Within-country targeting\n\nCircles Cloud Global targeting & interception\n\n[In 2015, IntelligenceOnline suggested that Circles started a bogus phone company called](https://www.intelligenceonline.com/surveillance--interception/2015/12/02/circles---mobile-phone--company-intercepts-3g,108114286-art)\n“Circles Bulgaria” to facilitate interceptions around the world. More recently, a [2020 report by](https://forensicnews.net/2020/04/29/the-covert-reach-of-nso-group/)\nForensic News raised questions as to the true business of FloLive, purportedly an “IoT\nconnectivity” company. Forensic News found that FloLive appeared to be closely associated\nwith Circles, and suggested that the company might be a “front for the hackers and private\nspies behind Circles.”\n\nThere is also limited information about how the Circles system integrates with NSO Group’s\n[flagship Pegasus spyware, though a former NSO Group employee told Motherboard that](https://www.vice.com/en/article/ep48kp/nso-group-cyprus-circles-bulgaria-ss7)\nPegasus had an “awful integration with Circles,” and that Circles had “exaggerated their\nsystem’s abilities.”\n\n## 2. Fingerprinting & Scanning for Circles\n\n[While searching Shodan, we observed interesting results in AS200068, a block of IP](http://shodan.io/)\naddresses registered to Circles Bulgaria (Figure 2). These results show hostnames of\nfirewalls manufactured by Check Point, as well as the hostnames of the firewalls’\n\n\n-----\n\n_[SmartCenter instance. SmartCenter can be used to centrally manage multiple Check Point](https://usercenter.checkpoint.com/uc/pmap/partners/resources/smartcenter/)_\nfirewalls.1\n\nFigure 2: Shodan probe results for Check Point firewalls in AS200068 (Circles Bulgaria Ltd).\nThe SmartCenter hostnames in the Circles-registered AS200068 contain the domain name\n_tracksystem.info. It seems clear that tracksystem.info is associated with Circles, as leaked_\ndocuments show Circles employees communicating from @tracksystem.info email\naddresses. Additionally, per RiskIQ, 17 of the 37 IP addresses pointed to by tracksystem.info\nor its subdomains are in AS200068 as well as AS60097, also registered to Circles Bulgaria.\n\nWe searched for Check Point firewalls whose SmartCenter hostname contained\n_tracksystem.info on_ [Shodan,](https://www.shodan.io/) [Censys,](http://censys.io/) [Fofa, and on Rapid7’s historical](http://fofa.so/) _[sonar-ssl dataset. We](https://opendata.rapid7.com/sonar.ssl/)_\nalso searched for IPs that returned peculiar “random” TLS certificates2 matching the\nfollowing regular expression, as we saw these certificates returned by Check Point firewalls\nwith tracksystem.info in their SmartCenter hostnames:\n\n/^C=[a-zA-Z0-9]{2}, ST=[a-zA-Z0-9]{3}, L=[a-zA-Z0-9]{3}, O=[a-zA-Z0-9]{4}, OU=[a-zA-Z0-9]\n{5}, CN=localhost$/\n\nOverall, we identified 252 IP addresses in 50 ASNs matching our fingerprints. Many had a\n“Firewall Host” field seemingly indicating that the systems were client systems, e.g., client_circles-thailand-nsb-node-2, though some used the word telco in place of client, and some_\n\n\n-----\n\nhad a generic name rather than a client name, e.g., cf-00-182-1. In cases where we\n[identified Circles’ Check Point firewalls on a Transit/Access ISP (i.e., a non-datacenter ISP),](https://www.caida.org/data/as-classification/)\nwe assumed that some agency of that country’s government was a customer of Circles.\n\nSome of the clients that we identified have two-word nicknames, where the first word is a car\nbrand that almost always shares the same first letter as the country or state of the apparent\ncustomer. For example, Circles firewalls whose IPs geolocate to Mexico are named\n“Mercedes,” those that geolocate to Thailand are named “Toyota,” those that geolocate to\nAbu Dhabi are named “Aston,” and those that geolocate to Dubai are named “Dutton.”\n\n[The use of car brands to refer to clients was first reported by Haaretz, though the report](https://www.haaretz.com/middle-east-news/.premium-with-israel-s-encouragement-nso-sold-spyware-to-uae-and-other-gulf-states-1.9093465)\nindicated that this was an NSO Group practice, as opposed to Circles. Haaretz reported the\nfollowing codenames: Saudi Arabia is “Subaru,” Bahrain is “BMW,” and Jordan is “Jaguar.”\nOur scans did not reveal any Check Point firewalls linked to Circles with the names Subaru\nor Jaguar, though we did identify firewalls with the name “BMW” located in Belgium.\n\n## 3. A Global List of Circles Deployments\n\nFrom the 252 IP addresses we detected in 50 ASNs, we identified 25 governments that are\nlikely to be Circles customers. We also identified 17 specific government branches that\nappear to be Circles customers, based on WHOIS, passive DNS, and historical scanning\ndata from Check Point firewall IPs or their neighbours.\n\n**Australia, Belgium, Botswana (Directorate of Intelligence and Security Services), Chile**\n(Investigations Police), Denmark (Army Command), Ecuador, El Salvador, Estonia,\n**Equatorial Guinea, Guatemala (General Directorate of Civil Intelligence), Honduras**\n(National Directorate of Investigation and Intelligence), Indonesia, Israel, Kenya, Malaysia,\n**Mexico (Mexican Navy; State of Durango), Morocco (Ministry of Interior), Nigeria (Defence**\nIntelligence Agency), Peru (National Intelligence Directorate), Serbia (Security Information\nAgency), Thailand (Internal Security Operations Command; Military Intelligence Battalion;\nNarcotics Suppression Bureau), the United Arab Emirates (Supreme Council on National\nSecurity; Dubai Government; Royal Group), Vietnam, Zambia, and Zimbabwe.\n\nWhile our analysis yielded country results with high confidence, our efforts to determine the\ncustomer identity have, in some cases, a lower degree of confidence.\n\n\n-----\n\nFigure 3: Countries that appear to have at least one Circles client.\nWe also found evidence of at least four systems that we were unable to connect to a\nparticular country (Appendix A).\n\n## 4. Spotlight on Concerning Circles Deployments\n\nOur research identified deployments in 25 countries. In several cases, we were able to go\nfurther and identify technical elements pointing to a particular government customer with\nvarying degrees of certainty. Troublingly, in a number of these cases, the government as a\nwhole, or the government client in particular, have a history of misuse of surveillance\ntechnologies and human rights abuses. While several cases are highlighted here, Appendix\nA lists the additional deployments found by our fingerprinting.\n\n### Botswana\n\nWe identified two Circles systems in Botswana: an unnamed system and a system named\nBentley Bullevard that appears to be operated by Botswana’s Directorate of Intelligence and\nSecurity Service (DISS), as TLS certificates used on the Check Point firewalls were signed\n[by a self-signed TLS certificate for “CN=sid.org.bw” which is a domain name used by the](https://twitter.com/bwgovernment/status/1227215554282500096)\nDirectorate of Intelligence and Security. The DISS is sometimes referred to as the\n“Directorate of Intelligence and Security” (DIS).\n\n**Client**\n**Name** **Possible Identity** **Dates Active** **Firewall IPs**\n\n\n-----\n\n**Client**\n**Name** **Possible Identity** **Dates Active** **Firewall IPs**\n\n\nBentley\nBullevard\n\n\nDirectorate of Intelligence and Security\nService (DISS)\n\n\n2015/6/1 –\nPresent\n\n2015/6/1 –\n2020/9/10\n\n\n129.205.243.1\n– 3\n129.205.243.60\n– 62\n\n41.79.138.17 –\n19\n\n168.167.45.100\n– 102\n\n\n**Surveillance Abuses in Botswana**\n\nThere are multiple recent reports of the abuse of surveillance equipment in Botswana to\nsuppress reporting and public awareness of governmental corruption. In 2014, it was\nreported that the DISS participated in using surveillance and jamming technology developed\nby [Elbit Systems to conduct “electronic warfare” against the media. In addition, the DISS has](https://www.sundaystandard.info/khama-kgosi-network-of-shady-intelligence-security-big-shots-has-diss-over-a-barrel/)\nreportedly engaged in attempts to compromise the privacy of relationships between sources\nand reporters.\n\n### Chile\n\nOur scanning identified what appeared to be a single Circles system in Chile, codename\n**Cadillac Polaris. The system appears to be operated by the Investigations Police of Chile**\n(PDI), as the Check Point firewalls identify the client as “Chile PDI.” The PDI is Chile’s main\n[law enforcement agency. The Chile PDI was also a customer of Hacking Team’s Remote](https://motherboard.vice.com/en_us/article/gv5v8q/hacking-team-illegal-latin-american-empire)\nControl System (RCS) spyware, although they claimed that the spyware was only used for\nprosecuting crimes with prior judicial authorization.\n\n**Client Name** **Possible Identity** **Dates Active** **Firewall IPs**\n\n\nCadillac\nPolaris\n\n\nInvestigations Police of Chile\n(PDI)\n\n\n2015/9/12 –\nPresent\n\n\n186.103.207.10 –\n12\n\n\n**Surveillance Abuses in Chile**\n\nBetween 2017 and 2018, Chile’s other major national police agency, the Carabineros,\n[reportedly illegally intercepted the calls, WhatsApp chats, and Telegram messages of](https://cpj.org/2018/03/chilean-police-accused-of-spying-on-journalists/)\n[multiple journalists. Chilean police also intercepted the communications of Indigenous](https://www.ciperchile.cl/2018/02/23/las-tres-reuniones-en-las-que-bruno-villalobos-respaldo-las-pericias-de-smith/)\n[Mapuche leaders and cited intercepted chats to justify the arrests. However, officials were](https://www.eff.org/deeplinks/2018/12/where-government-hack-their-own-people-and-people-fight-back-latin-american)\n[later prosecuted for planting false evidence on the leaders’ phones.](https://www.ohchr.org/EN/NewsEvents/Pages/DisplayNews.aspx?NewsID=23423&LangID=E)\n\n### Guatemala\n\n\n-----\n\nWe identified a single Circles system in Guatemala, Ginetta Galileo. The system appears to\nhave been operated by the General Directorate of Civil Intelligence (DIGICI), as public\nWHOIS information records that the firewall IPs are registered to “Dirección General de\nInteligencia Civil.”\n\n**Client**\n**Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nGinetta\nGalileo\n\n\nGeneral Directorate of Civil\nIntelligence (DIGICI)\n\n\n2015/6/1 –\n2016/5/2\n\n\n190.111.27.165 –\n167\n\n\n**Surveillance Abuses in Guatemala**\n\nA 2018 investigation by Guatemalan newspaper Nuestro Diario [found that an Israeli arms](https://nomada.gt/pais/la-corrupcion-no-es-normal/espionaje-ilegal-del-gobierno-aqui-esta-la-investigacion-de-nuestro-diario-parte-i/)\ndealer sold a variety of spy tools, including NSO Group’s Pegasus spyware and a Circles\nsystem, to a secret unit within DIGICI. The unit reportedly used the equipment to conduct\nillegal surveillance against journalists, businesspeople, and political opponents of the\ngovernment. The surveillance arose amidst extreme physical threat to members of civil\n[society. A recent report identified over 900 attacks between 2017-2018 in Guatemala,](https://www.ohchr.org/en/NewsEvents/Pages/DisplayNews.aspx?NewsID=24634&LangID=E)\noriginating from both government and non-state actors.\n\n### Mexico\n\nWe identified what appear to be ten Circles systems in Mexico. One system, Mercedes\nVentura, appears to have been used by the Mexican Navy (SEMAR). All firewall IPs for the\nMercedes Ventura system were in /24s with multiple other IP addresses that are pointed to\nby domain names and return valid TLS certificates for semar.gob.mx and other websites\nlinked to the Mexican Navy. An unnamed system appears to have been used by the State of\nDurango, as one of its firewall IPs was also pointed to by dozens of subdomains of\ndurango.gob.mx. Additional details about the Mexico Circles systems are in Appendix A.\n\nReporting has previously connected the Mexican government to the purchase of other SS7\n[surveillance equipment, such as ULIN made by Ability, as well as a](https://www.forbes.com/sites/thomasbrewster/2017/09/25/mexico-surveillance-5m-ability-inc-unlimited-ss7-surveillance-technology/?sh=77851a525432) system codenamed\nSkyLock sold by Verint Systems Inc.\n\n**Surveillance Abuses in Mexico**\n\nMexico has an extensive history of surveillance abuses. Notably, our prior research has\nshown that entities within Mexico’s government serially abused NSO Group’s Pegasus\nspyware to target over 25 reporters, human rights defenders, and the families of individuals\nkilled and disappeared by cartels. The pattern of abuses extends to other forms of digital\nsurveillance.\n\n\n-----\n\nHuman rights organizations have documented that Mexico s Navy has been responsible for\n[civilian casualties in conflicts and human rights violations, including illegal detention,](https://www.amnesty.org/en/latest/news/2018/04/las-muertes-en-mexico-danos-colaterales-o-el-producto-de-una-politica-de-seguridad-fallida/)\n[kidnapping, torture, and sexual torture. Mexico’s National Human Rights Commission](https://www.insightcrime.org/news/analysis/mexico-navy-kidnappings/)\n[recently confirmed this pattern in a recommendation.](https://centroprodh.org.mx/2019/02/21/recommendation-against-mexican-navy-due-to-gross-human-rights-violations-testifies-to-risks-of-militarization/?lang=en)\n\n### Morocco\n\nOur scanning identified what appeared to be a single Circles system in Morocco. The\nMorocco client’s IPs are in the same /27 as several websites of the Bureau central\nd’investigation judiciaire (BCIJ), and are in the same /26 as the website of the Moroccan\nAuxiliary Forces (FA). Both the FA and BCIJ are under the auspices of Morocco’s Ministry of\nInterior. A government agency in Morocco also appears to be a client of Circles’ affiliate NSO\nGroup, though the identity of this Moroccan agency has not been established.\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nMinistry of Interior 2018/3/14 – Present 105.145.40.27-28\n\n**Surveillance Abuses in Morocco**\n\nMorocco has been connected to multiple cases of surveillance abuse over the past decade,\n[ranging from the targeting of human rights organizations with Hacking Team’s spyware to a](https://www.amnesty.org/en/latest/research/2016/12/how-a-hacking-campaign-helped-shut-down-an-award-winning-news-site/)\nstring of more recent cases in which NSO Group’s Pegasus spyware was used to target civil\nsociety [within](https://www.amnesty.org/en/latest/research/2019/10/morocco-human-rights-defenders-targeted-with-nso-groups-spyware/) [Morocco and abroad.](https://www.amnesty.org/en/latest/research/2020/06/moroccan-journalist-targeted-with-network-injection-attacks-using-nso-groups-tools/)\n\n### Nigeria\n\nOur scanning identified two Circles systems in Nigeria. One system may be operated by the\n[same entity as one of the Nigerian customers of the FinFisher spyware that we detected in](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nDecember 2014. The firewall IPs are in the same /27 as the IP address of the FinFisher C&C\nserver we detected in our 2014 scans (41.242.50.50). The other client appears to be the\nNigerian Defence Intelligence Agency (DIA), as its firewall IPs are in AS37258, a block of IP\naddresses registered to “HQ Defence Intelligence Agency Asokoro, Nigeria, Abuja.”\n\n**Client**\n**Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nNigeria Defence Intelligence Agency\n(DIA)\n\nUnknown FinFisher operator from\nDecember 2014.\n\n**Surveillance Abuses in Nigeria**\n\n\n2015/6/1 –\n2017/4/25\n\n2015/6/1 –\nPresent\n\n\n196.1.133.7 –\n9\n\n41.242.50.42\n– 47\n\n\n-----\n\nMembers of civil society in Nigeria face a wide range of digital threats. A recent report by\n[Front Line Defenders concluded that Nigeria’s government “has conducted mass](https://www.frontlinedefenders.org/en/statement-report/upr-submission-nigeria-2018)\nsurveillance of citizens’ telecommunications.” The Committee to Protect Journalists (CPJ)\nhas also [reported multiple cases of the Nigerian government abusing phone surveillance.](https://cpj.org/2020/02/nigeria-police-telecom-surveillance-lure-arrest-journalists/)\n\nAn [investigation by Nigerian newspaper Premium Times found that Nigerian governors of](https://www.premiumtimesng.com/investigationspecial-reports/204987-investigation-governors-dickson-okowa-spend-billions-high-tech-spying-opponents-others.html)\nBayelsa and Delta states purchased systems from Circles to spy on their political opponents.\nIn Delta State, Premium Times reports that the system was installed at the “governor’s\nlodge,” and operated by employees of the Governor, rather than police. In Bayelsa State, the\ngovernor reportedly used the Circles system to spy on his opponent in an election, as well as\nhis opponent’s wife and aides. The investigation also found that the two Circles systems\nwere imported without the proper authorizations from Nigeria’s Office of the National Security\nAdviser.\n\n### Thailand\n\nOur scanning identified what appear to be three current clients in Thailand. The firewall IP\naddresses for Toyota Regency are in the same /29 as the online “War Room” of the Royal\nThai Army’s Internal Security Operations Command (กองอํานวยการรักษาความมั่นคงภายใน),\nknown as ISOC for short. 3 The firewall IP addresses for an unnamed system are in the same\n/29 as a wiki that displays the logo of the Military Intelligence Battalion (MIBn) (กองพันขาว\nกรองทางทหาร), which appears to be a division of the Army Military Intelligence Command\n(หนวยขาวกรองทางทหาร), Thailand’s main military intelligence agency. The third system,\n**Toyota Dragon, is identified by its Check Point firewalls as “Thailand NSB”, which we**\nbelieve is a reference to the Narcotics Suppression Bureau.\n\n\n**Client**\n**Name** **Possible Identity**\n\nRoyal Thai Army Military Intelligence\nBattalion (MIBn)\n\n\n**Seen in**\n**Scan** **Firewall IPs**\n\n\n110.164.191.212\n– 214\n122.154.71.180\n– 182\n\n110.164.72.2 – 4\n\n203.149.46.164\n– 166\n\n\nToyota\nRegency\n\nToyota\nDragon\n\n\nRoyal Thai Army Internal security\nOperations Command (ISOC)\n\nRoyal Thai Police Narcotics Suppression\nBureau (NSB)\n\n\n2019/3/19 –\nPresent\n\n2016/7/12 –\nPresent\n\n2015/9/12 –\nPresent\n\n\n**Surveillance Abuses in Thailand**\n\n[Thailand has a history of leveraging a wide range of surveillance technologies to monitor and](https://tbinternet.ohchr.org/Treaties/CCPR/Shared%20Documents/THA/INT_CCPR_CSS_THA_26657_E.pdf)\n[harass civil society. Previous Citizen Lab research also identified a Pegasus spyware](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\noperator active within Thailand.\n\n\n-----\n\n[The ISOC has been accused of torturing and waterboarding activists, and suing activists who](https://www.newsweek.com/thailands-military-junta-tortured-man-and-then-sued-him-talking-about-it-808051)\nallege torture at the hands of the military. Recently, disturbing reports have emerged of\n[abductions of Thai dissidents who live outside of Thailand. In one case, three Thai dissidents](https://www.nytimes.com/2020/06/26/world/asia/thailand-dissidents-disappeared-military.html)\nliving in Laos who criticized Thailand’s military disappeared, and their bodies were later\n[discovered by a Thai fisherman. Their bodies were “disemboweled and stuffed with concrete](https://www.theguardian.com/world/2019/mar/17/thailand-dissidents-murder-mekong-election)\nposts” and their limbs broken. While these abductions and killings have not been\nconclusively attributed to the Royal Thai Army, the disappearances are reported to have\nhappened while the leader of Thailand’s former military junta Prayut Chan-o-cha (ประยุทธ\nจันทรโอชา) was visiting Laos. Chan-o-cha is the current Prime Minister of Thailand, as well\nas the [director of ISOC.](https://www.isoc.go.th/?page_id=68)\n\n### United Arab Emirates\n\nOur scanning identified what appear to be three active clients in the UAE: the UAE Supreme\nCouncil on National Security (SCNS) (اﻟﻤﺠﻠﺲ اﻷﻋﻠﻰ ﻟﻸﻣﻦ اﻟﻮﻃﻨﻲ), the Dubai Government,4 and a\nclient that may be linked to both Sheikh Tahnoon bin Zayed al-Nahyan’s Royal Group and\nformer Fatah strongman Mohammed Dahlan.\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nRoyal Group 2019/8/27 –\nPresent\n\n\n94.206.102.68 –\n70\n\n213.42.167.106 –\n108\n91.72.225.2 – 4\n\n151.253.54.210 –\n212\n91.75.44.84 – 86\n\n\nAston\nAndromeda\n\n\nUAE Supreme Council of National\nSecurity\n\n\n2016/4/4 –\nPresent\n\n\nDutton Dolche Dubai Government 2016/12/5 –\nPresent\n\n**Royal Group**\n\n\nWe found an unnamed UAE Circles system whose Check Point firewalls were in the same\n/25 as websites for Royal Group companies including Mauqah Technology, which famously\nacquired and operated Hacking Team’s RCS spyware and, in 2012, used the system to\ntarget (among others) UAE activist Ahmed Mansoor. The command and control (C&C) server\nfor that spyware [briefly pointed to an IP address registered to Sheikh Tahnoon bin Zayed Al-](https://citizenlab.ca/2012/10/backdoors-are-forever-hacking-team-and-the-targeting-of-dissent/)\nNahyan, the chairman of Royal Group and the UAE’s now National Security Advisor. Sheikh\n[Tahnoon was also closely linked to ToTok, a popular chat app that was banned from the](https://medium.com/@billmarczak/how-tahnoon-bin-zayed-hid-totok-in-plain-sight-group-42-breej-4e6c06c93ba6)\nApple and Google Play stores after the New York Times [reported it was linked to UAE](https://www.nytimes.com/2019/12/22/us/politics/totok-app-uae.html)\nintelligence.\n\n\n-----\n\nA [leaked 2014 invoice indicates a deal between Circles and Al Thuraya Consultancy and](https://web.archive.org/web/20190409205521/https://www.alaraby.co.uk/file/get/4749a75b-fc46-4917-85d3-7f8b41d4b34a)\n_[Researches LLC, which appears to be linked to Royal Group. Records obtained by](https://al-akhbar.com/Images/ArticleImages/2016526174055735635998812557351139.jpg)_\nLebanese newspaper Al Akhbar from the Abu Dhabi Chamber of Commerce and records on\n_companies.rafeeg.ae show that Al Thuraya shares a PO Box number (“PO Box 5151, Abu_\nDhabi”) and fax number (““8111112””) with Royal Group. Additionally, Al Thuraya’s\n[commercial license shows “Dhahi Mohammed Hamad Al-Thumairi” as one of the company’s](https://al-akhbar.com/ArticleFiles/201652615217461635998728674613328.pdf)\n[two partners. Al-Thumairi trained in jiu-jitsu with Sheikh Tahnoon’s adopted son Faisal](https://www.albayan.ae/sports/all-games/2018-04-18-1.3240832)\nAlketbi, received jiu-jitsu encouragement from Sheikh Tahnoon himself, and named his first\n[son “Tahnoon.” Another of Sheikh Tahnoon’s jiu-jitsu mentees showed up in the ToTok case](https://medium.com/@billmarczak/how-tahnoon-bin-zayed-hid-totok-in-plain-sight-group-42-breej-4e6c06c93ba6)\nas the sole director of Breej Holding, the company listed as the app’s iOS developer.\n\nFigure 4: Links between reported Circles customer Al-Thuraya Consultancy, UAE National\nSecurity Advisor Sheikh Tahnoon bin Zayed Al-Nahyan, and Mohammed Dahlan.\n_Al Thuraya has been_ [reported to be the consultancy of Mohammed Dahlan, the former head](https://www.lemonde.fr/international/article/2017/10/06/de-gaza-a-abou-dhabi-l-ascension-de-l-intrigant-mohammed-dahlan_5197098_3210.html)\nof the Palestinian Preventive Security (اﻷﻣﻦ اﻟﻮﻗﺎﺋﻲ), and a former member of Fatah’s Central\nCommittee. Dahlan was ejected from Fatah in June 2011, and subsequently fled to the UAE.\nIndeed, the leaked 2014 invoice shows Al Thuraya’s address as “POB 128827, Abu Dhabi,\n\n\n-----\n\nUnited Arab Emirates, which is listed in WHOIS records for Dahlan s dahlan.ps website from\n[September 2013, and was used by Dahlan in June 2017 when he unsuccessfully sued](https://www.carter-ruck.com/images/uploads/documents/MEE-CF_and_APoC.pdf)\nLondon-based online newspaper Middle East Eye for libel. Dahlan reportedly ran an\n[assassination program for the UAE in Yemen that targeted and killed opposition politicians.](https://www.buzzfeednews.com/article/aramroston/mercenaries-assassination-us-yemen-uae-spear-golan-dahlan)\n[Dahlan was also reportedly involved in the recent deal that normalized relations between the](https://foreignpolicy.com/2020/10/30/mohammed-dahlan-uae-palestinians-israel/)\nUAE and Israel.\n\n**UAE Supreme Council of National Security**\n\nIn a [leaked 2015 exchange, a UAE Supreme Council of National Security (SCNS) official,](https://web.archive.org/web/20190409205521/https://www.alaraby.co.uk/file/get/4749a75b-fc46-4917-85d3-7f8b41d4b34a)\nAhmed Ali Al-Habsi, asked Circles to intercept calls for certain phone numbers, apparently\nas part of a product demonstration. We found a Circles system named Aston Andromeda\nwhose firewall IPs were registered to the same SCNS official per public WHOIS data.\n\nThe leaked documents also detail a 2016 Circles sale to the UAE National Electronic\nSecurity Authority (NESA) (اﻟﻬﯿﺌﺔ اﻟﻮﻃﻨﯿﺔ ﻟﻸﻣﻦ اﻹﻟﻜﺘﺮوﻧﻲ) through DarkMatter. While NESA is a\n[subsidiary of the SCNS per UAE law, we are not sure whether the SCNS demo and](https://elaws.moj.gov.ae/UAE-MOJ_LC-Ar/00_%D9%88%D8%B2%D8%A7%D8%B1%D8%A9%20%D8%A7%D9%84%D8%AF%D9%81%D8%A7%D8%B9/00_%D9%85%D8%AC%D9%84%D8%B3%20%D8%A7%D9%84%D8%A7%D9%85%D9%86%20%D8%A7%D9%84%D9%88%D8%B7%D9%86%D9%8A/UAE-LC-Ar_2012-08-13_00003_Markait.html)\nDarkMatter/NESA deals are related. After Reuters’ reporting on the NESA’s Project Raven\nhacking campaign, the NESA was split up into several agencies, including the Signals\nIntelligence Agency (ﺟﻬﺎز اﺳﺘﺨﺒﺎرات اﻹﺷﺎرة).\n\n**Surveillance Abuses in the UAE**\n\nThe UAE government is a documented serial abuser of surveillance technologies to\n[suppress dissent and persecute critical voices. Some prominent activists, like Ahmed](https://freedomhouse.org/country/united-arab-emirates/freedom-net/2020)\nMansoor, an Emirati prisoner of conscience who has been imprisoned by the UAE since\n[2017, have been surveilled using technology from Hacking Team, Gamma Group’s FinFisher,](https://citizenlab.ca/2012/10/backdoors-are-forever-hacking-team-and-the-targeting-of-dissent/)\n[technology developed by Project Raven, and](https://citizenlab.ca/2016/05/stealth-falcon/) [NSO Group’s Pegasus spyware.](https://citizenlab.ca/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/)\n\n[The UAE’s use of former U.S. National Security Agency employees to target the devices of](https://www.reuters.com/investigates/special-report/usa-spying-karma/)\n[dissidents, journalists, and political opponents is also well documented, as is the apparent](https://www.reuters.com/investigates/special-report/usa-spying-raven/)\n[use of this targeting to unmask and jail bloggers and others critical of the government. In](https://citizenlab.ca/2016/05/stealth-falcon/)\nsome cases, the targets included Americans.\n\n### Zambia\n\nWe identified what appears to be a single Circles system in Zambia, operated by an\nunknown agency.\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2018/1/30 – 2018/2/6 165.56.2.13\n\n**Surveillance Misuse in Zambia**\n\n\n-----\n\nIn 2019, Zambia [reportedly arrested a group of bloggers who ran an opposition news site](https://www.wsj.com/articles/huawei-technicians-helped-african-governments-spy-on-political-opponents-11565793017)\nwith the aid of “a cyber-surveillance unit in the offices of Zambia’s telecommunications\nregulator,” which “pinpointed the bloggers’ locations” and was “in constant contact with police\nunits deployed to arrest them.” While Circles’ solution allows governments to track phones, it\nis not clear if Zambia’s Circles system was used in this case.\n\n## Discussion\n\nCircles is part of a large and growing global surveillance industry catering to government\nclients. Many of the government clients who appear to have acquired and/or deployed\nCircles technology have a dismal record of abuses of human rights and technical\nsurveillance capabilities. Many lack public transparency and accountability, and have minimal\nor no independent oversight over the activities of their security agencies.\n\n### Circles: Another Industry Player Fueling the Proliferation of Unaccountable Surveillance\n\nIt is difficult to investigate and track surveillance companies like Circles that exploit flaws in\nthe SS7 protocol. Many SS7 attacks require no engagement with targets themselves, and\nleave no visible artefacts on targets’ devices that may inadvertently reveal an operation. The\nlack of transparency from telecommunications providers about abuses also helps\nsurveillance companies, and their customers, evade exposure, further increasing the\nlikelihood of misuse.\n\nThe authoritarian profile of some of Circles’ apparent government clients is troubling, but not\nsurprising. Over the past decade, the explosion of the global surveillance industry has fueled\na massive transfer of spy technology to problematic regimes and security services. These\ncustomers have leveraged their newly-acquired capabilities to abuse human rights and\nneutralize political opposition, even beyond their borders. Circles is an especially concerning\n[case because of their close relationship and reported integration with NSO Group, which has](https://forensicnews.net/2020/04/29/the-covert-reach-of-nso-group/)\na notorious record of enabling surveillance abuses.\n\n**The Expanding, Unregulated Surveillance Industry**\n\n[Research by the Citizen Lab and others, including Amnesty International and](https://www.amnesty.org/en/latest/research/2020/06/moroccan-journalist-targeted-with-network-injection-attacks-using-nso-groups-tools/) Privacy\nInternational, has demonstrated that the surveillance industry is poorly regulated and its\nproducts are prone to abuse. The “self-regulation” that companies claim to practice does not\nseem to have stemmed the growing tide of abuse cases. In a 2019 report on the surveillance\nindustry, the U.N. Special Rapporteur on the promotion and protection of the right to freedom\nof opinion and expression called for “an immediate moratorium on the global sale and\ntransfer of private surveillance technology until rigorous human rights safeguards are put in\n_place to regulate such practices and guarantee that governments and non-State actors use_\nthe tools in legitimate ways.”\n\n\n-----\n\nAs the surveillance industry continues to grow relatively unimpeded, spaces for legitimate\ndemocratic activity will continue to shrink. Governments’ ability to protect their citizens, as\nwell as their own essential services and national security, will also continue to erode. Fixing\nthis problem will require a direct focus on reforming the surveillance industry, including,\namong [other](https://citizenlab.ca/2017/03/whos-watching-little-brother-checklist-accountability-industry-behind-government-hacking/) [steps:](https://www.ohchr.org/EN/NewsEvents/Pages/DisplayNews.aspx?NewsID=24736)\n\nThe enactment of more robust domestic, regional, and international legal frameworks—\nequipped with meaningful transparency, enforcement, and oversight mechanisms—to\ncontrol the export and import of surveillance technology;\nMandatory due diligence obligations on surveillance companies and enforcement\nmechanisms with tough penalties for breaches of such obligations; and,\nLegislative amendments to fix any legal and regulatory gaps such that parties harmed\nby surveillance technology can bring claims against companies for these harms.\n\nIn addition to these broader measures focused on the surveillance industry, we believe that\nthe vulnerabilities inherent in the global telecommunications system require urgent action by\ngovernments and telecommunications providers. The global telecommunications sector\nprovides significant opportunity for abuse by the surveillance industry and its customers in\nlight of the continued failure of telecommunications operators and states to prevent such\nexploitation. In the discussion below, we set out clear actions that legislators and wireless\noperators must take to prevent continued exploitation and abuse.\n\n### Sounding the Alarm: A Clear and Present Threat to National Security\n\nAccording to a [recent study, the vast majority of telecommunications networks around the](https://www.gsma.com/membership/wp-content/uploads/2018/07/SS7_Vulnerability_2017_A4.ENG_.0003.03.pdf)\nglobe are vulnerable to the kind of techniques reportedly used by Circles. As has been\n[widely reported, the industry has sought to downplay and conceal these risks. It is no](https://www.vice.com/en/article/7x9q8y/telecom-lobbyists-downplayed-theoretical-security-flaws-in-mobile-data-backbone)\n[surprise that reporting indicates that SS7 has been abused by countries like Saudi Arabia to](https://www.theguardian.com/world/2020/mar/29/revealed-saudis-suspected-of-phone-spying-campaign-in-us)\ntarget individuals around the world, including in the U.S.\n\nA [recent survey of E.U. wireless security by the European Union Agency for Cybersecurity](https://www.enisa.europa.eu/publications/signalling-security-in-telecom-ss7-diameter-5g/at_download/fullReport)\n(ENISA) concluded that a majority of operators had security measures that could “only cover\nbasic attacks.” Troublingly, reporting of the scale of these threats remains difficult to achieve,\nas SS7 abuse is [not within current reporting obligations for the European](https://www.enisa.europa.eu/news/enisa-news/annual-report-on-telecom-security-incidents-in-2019)\ntelecommunications sector.\n\nIn addition, it is known within the industry that some countries fail to meet basic obligations of\n[due diligence and oversight with respect to their networks, enabling foreign entities access to](https://www.ptsecurity.com/upload/ptcom/SS7-VULNERABILITY-2016-eng.pdf)\nSS7 and Diameter for the purposes of conducting global surveillance.\n\nWe believe that the historically limited public information about abuses has enabled the\ntelecommunications industry to further minimize the problem. There is no public reporting\nfrom most telecommunications companies about the scale of the threats to users, the\n\n\n-----\n\nnumber of attacks identified and blocked, or a roadmap for addressing these threats in the\nfuture. This state of affairs will result in predictable, preventable harm to customers across\nthe globe.\n\n**Risks in the U.S.**\n\nIn April 2017, the U.S. Department of Homeland Security (DHS) conducted a major study\nthat concluded: “all U.S. carriers are vulnerable to these exploits, resulting in risks to national\nsecurity, the economy, and the Federal Government’s ability to reliably execute national\nessential functions.” According to the DHS report, “SS7 and Diameter vulnerabilities can be\nexploited by criminals, terrorists, and nation-state actors/foreign intelligence organizations”\nand “many organizations appear to be sharing or selling expertise and services” that could\nbe used to conduct such espionage.\n\nIn response to a 2017 letter by Senator Ron Wyden requesting information about what steps\n[U.S. carriers were taking to secure their networks, AT&T acknowledged that “hundreds of](https://www.wyden.senate.gov/imo/media/doc/ATT%20SS7%20Response.pdf)\ncarriers now have access to SS7, many of them in unstable or unfriendly nations where\ncredentials can be compromised…even sold on the open market for a fee.” The company\nwent on to acknowledge that “the trust model is no longer fully reliable.”\n\n[In a 2018 letter to the Federal Communications Commission (FCC), Senator Wyden](https://www.wyden.senate.gov/imo/media/doc/wyden-fcc-ss7-letter-may-2018.pdf)\nrevealed that an unnamed U.S. carrier had suffered a SS7-related breach of customer\ninformation, which it reported to federal authorities. Subsequent investigative reporting\nrevealed that the FCC had ignored expert recommendations by the DHS and instead\nespoused a voluntary compliance program at the urging of the wireless industry. Additionally,\nthe reporting found that, although SMS messages are vulnerable to SS7 interception, the\nwireless industry successfully lobbied the National Institute of Standards and Technology\n(NIST) to keep SMS text messages as an [approved method of two factor authentication in](https://pages.nist.gov/800-63-3/)\nU.S. government standards.\n\nThe troubling inability of the U.S. government and telecommunications sector to address\nSS7 vulnerabilities is mirrored in many countries around the world.\n\n**Risks in Canada**\n\nIn 2017, [a joint investigation undertaken by CBC News and Radio Canada, in cooperation](https://www.cbc.ca/news/politics/hackers-cellphone-security-1.4406338)\nwith German security researchers, demonstrated an SS7 attack against a sitting member of\nparliament, Matthew Dubé. With only a telephone number, the investigators were able to use\nSS7 vulnerabilities to track Dubé’s precise movements and intercept his calls. The tests were\nconducted over both the Rogers and Bell networks.\n\n[In its 2018 annual report, Canada’s Privacy Commissioner noted the investigation, flagged](https://www.priv.gc.ca/media/4831/ar_201718_eng.pdf)\nSS7 security weaknesses, and called on the Canadian government and industry to work\ntogether to resolve them. In response, Canada’s signals intelligence agency, the\n[Communications Security Establishment (CSE), said that “the security issues surrounding](https://www.cse-cst.gc.ca/en/media/2018-04-25)\n\n\n-----\n\nSS7, have been known for some time and that it had been working with industry partners to\nresolve them. However, CSE also asserted that it “is unable to discuss further details of\nmeetings with industry partners, and we cannot disclose the participation of individual,\nprivate telecommunications partners.”\n\nFor guidance, the CSE suggested the public visit a “mobile security” information page, now\n[available on the newly established Canada Centre for Cyber Security website in a section on](https://cyber.gc.ca/en/infographics)\n[“infographics.” However, the website and accompanying infographic do not mention SS7](https://cyber.gc.ca/sites/default/files/publications/cse-its-mobile-security-ef.pdf)\nexplicitly and provide only basic advice on mobile security practices.\n\n**Legislators: Do This Now**\n\nGovernments across the globe should take action to protect their citizens and their own\noperations. Telecommunications regulatory bodies should conduct regular audits of national\nnetworks and mandate carriers to identify, disclose, and address vulnerabilities.\n\nThe U.K. government has shown promising leadership in addressing carrier security, with\n[recently proposed legislation that requires carriers to secure their networks and gives Ofcom](https://publications.parliament.uk/pa/bills/cbill/58-01/0216/200216.pdf)\n(the U.K. telecommunications regulator) the authority to ensure compliance. The newly\nproposed powers granted to Ofcom include the ability to conduct audits and to compel the\nproduction of records and other information related to a carrier’s security efforts. The\nproposed law would also, for the first time, require carriers to disclose compromises to their\ncustomers and provide for fines in some cases.\n\nThe European Union has also taken note of telecommunication network vulnerabilities and\n[made recent recommendations that encourage EU nations to conduct regular analyses of](https://www.enisa.europa.eu/publications/signalling-security-in-telecom-ss7-diameter-5g/at_download/fullReport)\nthe threat landscape, adopt minimum security standards, and require incident reporting. We\n[also note that Nordic regulators have undertaken efforts to establish best practices for](https://resilience.enisa.europa.eu/article-13/workshops/24th-article-13a-eg-meeting-austria-for-providers/Nordic_Perspective_on_SS7.pptx)\nprotecting their infrastructure from SS7 attacks.\n\nIn contrast, the U.S. FCC has shown no will to compel carriers to report incidents or\nundertake serious security improvements. Given the rapid proliferation of SS7 and Diameter\nexploitation technologies both to states and non-state actors, it seems likely that without\nurgent action, U.S. consumers and government operations will be targeted by an\nincreasingly wide range of potential threats.\n\n**Wireless Carriers: Do This Now**\n\nWe urgently recommend that telecommunication companies examine SS7 and Diameter\ntraffic originating from providers in countries where we have identified a Circles deployment\nfor patterns of abuse. The SS7 and Diameter exploitation marketplace, as well as the\nwireless threat landscape, are constantly evolving. The recommendations provided by the\nDHS are highly relevant: every major wireless carrier should receive an independent SS7\nand Diameter audit every 12-18 months, and should address any identified vulnerabilities.\n[The ENISA also provides a range of security recommendations for carriers.](https://www.enisa.europa.eu/publications/signalling-security-in-telecom-ss7-diameter-5g/at_download/fullReport)\n\n\n-----\n\nWe are aware that some providers, such as a number of U.S. companies, are experimenting\nwith SS7 firewalls, which show promise in reducing some types of attacks. We urge\nproviders to publicly disclose their roadmaps for addressing SS7 and Diameter\nvulnerabilities, and believe that information about SS7 threats should be included in telco\ncompanies’ transparency reporting going forward.\n\n### Sounding the Alarm: Recommendations for High Risk Users\n\nWhether you are a journalist, human rights defender, or government employee,\ntelecommunication network vulnerabilities may make it possible for adversaries to intercept\nyour verification SMSes and compromise your accounts. If you believe you face threats\nbecause of who you are or what you do from any of the countries mentioned in this report, or\neven a country not listed above, we urge you to migrate away from SMS-based two factor\nauthentication immediately for all accounts where it is possible. Directions on how to use a\nsecurity key for some of your accounts are here.\n\nIn addition, for accounts on popular apps such as Signal, WhatsApp and Telegram, we urge\nyou to immediately enable a security PIN or password for your account.\n\n## Acknowledgements\n\nThanks to [Rapid7 and](https://www.rapid7.com/) [Censys for providing research access to their data feeds.](https://censys.io/)\n\nBill Marczak’s work on this report was supported, in part, by the International Computer\nScience Institute and the Center for Long-Term Cyber Security at the University of California,\nBerkeley.\n\nThe authors would like to thank Jeffrey Knockel for peer review and Stephanie Tran for\nresearch assistance. Special thanks to several other reviewers who wish to remain\nanonymous as well as TNG.\n\nFinancial support for this research has been provided by the John D. and Catherine T.\nMacArthur Foundation, the Ford Foundation, the Hewlett Foundation, Open Societies\nFoundation, the Oak Foundation, and Sigrid Rausing Trust.\n\n## Appendix A: Circles Deployments, Continued\n\n### Australia\n\nWe identified a single Circles system in Australia. We cannot verify the identity of the\noperator. The system’s Check Point firewall was also reachable through an IP address in a\nMalaysian datacenter (EstNOC Malaysia), which appears to be forwarding traffic onwards to\nthe Australian IPs. The Australian IPs, on Optus and TPG, geolocate to Australia’s capital\nCanberra, per MaxMind.\n\n\n-----\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2018/10/30 – Present 220.101.113.194 – 196\n\n27.33.222.130 – 132\n\n220.245.33.62\n\n103.230.142.4\n\n### Belgium\n\n**Client Name** **Possible Identity** **Dates Active** **Firewall IPs**\n\nBMW Bagel 2017/2/25 – Present 81.246.73.98 – 100\n\n84.199.16.226 – 228\n\n### Denmark\n\nWe identified a single client in Denmark, Dodge Diamondback, which appears to be the\nDanish Army Command (Hærkommandoen). The firewall IPs for the system are in a range of\nIP addresses named “BSC-HOK-NET,” and WHOIS data shows an associated phone\nnumber (+45 9710 1550) that a Google search reveals is linked with the Danish Army. We\nbelieve that “HOK” is a reference to the Danish “Army Operational Command,” which was\n[restructured in 2014 and is now apparently known as the Danish “Army Command.”](https://en.wikipedia.org/wiki/Army_Command_(Denmark))\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nDodge\nDiamondback\n\n### Ecuador\n\n\nArmy Command\n(Hærkommandoen)\n\n\n2015/6/1 –\n2020/4/30\n\n\n80.63.69.243 –\n245\n\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nExcalibur Cosmos 2015/6/1 – 2019/9/17 181.113.61.242 – 244\n\n2015/6/1 – 2017/2/13 181.211.37.50 – 52\n181.39.50.66 – 68\n\n### El Salvador\n\n\n-----\n\n**Client NameClient Name** **Possible IdentityPossible Identity** **Seen in ScanSeen in Scan** **Firewall IPsFirewall IPs**\n\nEvoque Lempa 2017/2/13 – Present 201.247.172.155 – 157\n\n### Estonia\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2018/10/30 – Present 193.40.226.194 – 196\n193.40.226.66 – 68\n\n### Equatorial Guinea\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2013/10/30 – Present 193.251.153.1 – 3\n\n### Honduras\n\nWe identified two Circles systems in Honduras. One unnamed system appears to have been\noperated by the National Directorate of Investigation and Intelligence (DNII), as public\nWHOIS information records that the firewall IPs are registered to “DNII.”\n\n**Client**\n**Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nNational Directorate of Investigation and\nIntelligence (DNII)\n\n\n2017/6/29 –\nPresent\n\n2016/7/12 –\nPresent\n\n\n181.210.19.211\n– 213\n\n190.4.27.122124\n\n_(Circles IPs)_\n\n\nHonda\nThor\n\nHonda\nHonduras\n\n### Indonesia\n\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2018/9/11 – Present 203.142.69.82 – 84\n\n2018/9/4 – Present 117.102.125.50 – 52\n\n### Israel\n\n\n-----\n\nWe identified a single system in Israel. However, this system was not labeled as a client\nsystem, and was instead labeled as a “telco” system. Additionally, the name “Lexus” does not\nhave the first letter “I” for Israel, which is inconsistent with other client naming schemes.\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nTelco Lexus Canola 82.166.142.26 – 28\n\n### Kenya\n\nWe identified a single system in Kenya. Though MaxMind geolocates the IP addresses to\nMauritius, a traceroute indicates that the IP addresses are in Kenya. The name “Kali”\nappears inconsistent with other client naming schemes, as we are not aware of any\nautomotive brand named “Kali.”\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nTelco Kali Rainbow 41.72.215.226 – 228\n\n### Malaysia\n\nWe identified one Circles system in Malaysia, named Pixcell Mazda Farmer. We cannot\nverify the identity of the operator. We believe Pixcell is a reference to a [Circles device, whose](https://forensicnews.net/2020/04/29/the-covert-reach-of-nso-group/)\ndescription in United States Federal Communication Commission (FCC) and United States\nPatent and Trademark Office (USPTO) documents suggests it is a portable IMSI catcher.\n[While the Pixcell model that underwent the FCC approval process apparently starting in](https://apps.fcc.gov/eas/GetApplicationAttachment.html?id=3435682)\n[October 2016 has WCDMA (3G) support, a January 2017 photograph of the Pixcell model](https://tsdr.uspto.gov/documentviewer?caseId=sn86782979&docId=SPE20170201155643#docIndex=13&page=1)\nsubmitted to the USPTO appears to indicate that WCDMA support was removed, and\nsupport for LTE (4G) was added, based on the absence of a “WCDMA” status light, and an\n“LTE” status light in its place.\n\n\n-----\n\n**Figure 5: Image submitted by Circles as part of an initial lapsed USPTO trademark**\n**request for “Pixcell” in 2015.**\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nPixcell Mazda Farmer 2016/9/25 – 2018/4/17 60.54.119.242 – 244\n\nMazda Sky _(Circles IPs)_\n\n### Mexico\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\n2018/10/16 –\nPresent\n\n\n189.240.115.18 – 20\n\n\n-----\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nMercedes Panda 2015/6/1 – Present 187.217.170.233 –\n235\n189.240.245.141\n\n189.240.254.193 –\n195\n\n189.240.254.202 –\n204\n\n189.240.254.209 –\n211\n\n189.240.254.217 –\n219\n\n201.147.171.225 –\n227\n\n201.147.171.233 –\n235\n\n\nMercedes Koala 2015/9/12 –\n2017/10/24\n\nMercedes\nDathomir\n\n\n187.174.194.23 – 28\n\n_(Circles IPs)_\n\n\nMercedes Sirius 2015/9/12 – 2016/8/6 201.157.58.162 –\n164\n\nMercedes Camelot 2015/6/1 – 2019/10/1 187.217.188.220 –\n222\n187.217.80.162 –\n164\n\n\nMercedes Ventura SEMAR (Mexican\nNavy)\n\nMercedes\nNightingale\n\n\n2015/6/1 – 2017/8/15 187.217.108.81 – 83\n201.116.62.192 –\n194\n\n_(Circles IPs)_\n\n\n_checkpoint-a_ State of Durango 2015/6/1 – 2020/4/30 187.141.19.195\n201.139.227.74\n\n201.148.31.122\n\n\n-----\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n_cp.slp.mx_ 2015/6/1 – 2017/12/5 187.141.246.178\n\n### Peru\n\nWe identified a single Circles system in Peru, which appears to be operated by Peru’s\nNational Intelligence Directorate (DINI), as some of its firewall IPs were in a /27 registered to\n“DIRECCION NACIONAL DE INTELIGENCIA – DINI” per public Whois data. The system is\nnamed Porsche Pisco. Interestingly, DINI was [reported to have a surveillance project called](https://apnews.com/article/f799cfd080b04b93a34df61fc007b096)\n[“Pisco” that was under development in 2015. The Associated Press reported in 2016 that](https://apnews.com/article/f799cfd080b04b93a34df61fc007b096)\none of Project Pisco’s contracts was with Israeli interception company Verint.\n\n**Client**\n**Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nPorsche\nPisco\n\n### Serbia\n\n\nNational Intelligence Directorate\n(DINI)\n\n\n2015/6/8 –\n2018/2/13\n\n\n168.121.46.82 –\n83\n\n181.177.233.20 –\n22\n\n\nWe identified a single Circles system in Serbia, which appears to be operated by Serbia’s\nSecurity Information Agency (BIA), which was also a customer of FinFisher.\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n\nShkoda\nSambu\n\n### Vietnam\n\n\nSecurity Information Agency\n(BIA)\n\n\n2015/6/1 –\n2015/7/6\n\n\n195.178.51.242 –\n243\n195.178.51.252\n\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nVolvo Halogen 2015/10/12 – Present 113.161.106.74 – 76\n\n### Zimbabwe\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\n2013/11/4 – 2014/1/6 196.27.103.36 – 38\n\n\n-----\n\n**Client Name** **Possible Identity** **Seen in Scan** **Firewall IPs**\n\nZagato Zeus 2015/9/12 – 2017/9/19 197.155.229.194 -196\n\nZimbabwe Telcel 2018/3/27 – Present 41.79.56.33 – 34\n\n### Unknown Countries\n\nWe found names for several other Circles systems appearing in IP ranges registered to\nCircles. Because these names were never recorded in IP ranges that might belong to Circles\ncustomers, we are unsure of their identity. The names were: GTR Whitehippo, Icarus\nShemer, Kodik Kite, and Opel Oranit.\n\n1. Check Point is aware that its firewalls publicly produce this hostname information, and\n\n[does not consider this to be a security issue, remarking that this is “public](https://supportcenter.checkpoint.com/supportcenter/portal;jsessionid=(J2EE8705100)ID0937160150DB00667728629220380580End;saplb_*=(J2EE8705100)8705150?eventSubmit_doGoviewsolutiondetails=&solutionid=sk69360)\ninformation.”↩\n2. We found a total of 19 distinct TLS certificates ever recorded as matching this regular\n\nexpression, returned by a total of 57 IP addresses. Ultimately, our search for TLS\ncertificates containing this regular expression did not help us identify any additional\nCircles systems, though it did help us tie IP addresses together as belonging to the\nsame system, based on returning the same TLS certificate.↩\n3. Interestingly, the “War Room” incorrectly translates its Thai name (กองอํานวยการรักษา\n\nความมั่นคงภายใน) into English as “International Security Operations Command.”↩\n4. Firewall IPs in the same /30 as smart.gov.ae registered to “Dubai Government” and\n\nsame /26 as wsg.dubaipolice.net.↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-01 - Running in Circles Uncovering the Clients of Cyberespionage Firm Circles.pdf"
    ],
    "report_names": [
        "2020-12-01 - Running in Circles Uncovering the Clients of Cyberespionage Firm Circles.pdf"
    ],
    "threat_actors": [
        {
            "id": "0f47a6f3-a181-4e15-9261-50eef5f03a3a",
            "created_at": "2022-10-25T16:07:24.228663Z",
            "updated_at": "2025-03-27T02:02:10.145238Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "Project Raven",
                "Stealth Falcon"
            ],
            "source_name": "ETDA:Stealth Falcon",
            "tools": [
                "Deadglyph",
                "StealthFalcon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "efeeab6a-219e-4a45-9b2f-9f77c647ffd2",
            "created_at": "2023-01-06T13:46:38.370366Z",
            "updated_at": "2025-03-27T02:00:02.816514Z",
            "deleted_at": null,
            "main_name": "Magic Kitten",
            "aliases": [
                "Group 42"
            ],
            "source_name": "MISPGALAXY:Magic Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "77aedfa3-e52b-4168-8269-55ccec0946f7",
            "created_at": "2023-01-06T13:46:38.453791Z",
            "updated_at": "2025-03-27T02:00:02.837384Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "G0038"
            ],
            "source_name": "MISPGALAXY:Stealth Falcon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3f42c8f4-2cf1-4555-abff-b19852033aec",
            "created_at": "2023-11-08T02:00:07.099084Z",
            "updated_at": "2025-03-27T02:00:03.180517Z",
            "deleted_at": null,
            "main_name": "TA499",
            "aliases": [
                "Lexus",
                "Vovan"
            ],
            "source_name": "MISPGALAXY:TA499",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bd084d2f-4233-49b1-b0e6-c7011178dae0",
            "created_at": "2022-10-25T15:50:23.544316Z",
            "updated_at": "2025-03-27T02:00:55.496265Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "Stealth Falcon"
            ],
            "source_name": "MITRE:Stealth Falcon",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535853,
    "ts_updated_at": 1743041685,
    "ts_creation_date": 1653752418,
    "ts_modification_date": 1653752418,
    "files": {
        "pdf": "https://archive.orkl.eu/f5afa9f2fe2c66cb331de0dad150778365d8ea62.pdf",
        "text": "https://archive.orkl.eu/f5afa9f2fe2c66cb331de0dad150778365d8ea62.txt",
        "img": "https://archive.orkl.eu/f5afa9f2fe2c66cb331de0dad150778365d8ea62.jpg"
    }
}