{
    "id": "596794ed-1a9c-4b23-9f8f-9ff856455869",
    "created_at": "2022-10-25T16:48:10.755071Z",
    "updated_at": "2025-03-27T02:16:25.625175Z",
    "deleted_at": null,
    "sha1_hash": "ce7f0ad5996f6973b7c6ee45e97d6a73f5e16b9c",
    "title": "VB2020 paper: Pandamic: emissary Pandas in the Middle East",
    "authors": "",
    "file_creation_date": "2020-08-28T12:46:01Z",
    "file_modification_date": "2020-08-28T12:51:29Z",
    "file_size": 6438497,
    "plain_text": "-----\n\n_“A scout should learn as much as possible about enemy psychology, habits, organization, and tactics.” – USMC ‘Scouting_\n_and Patrolling’ MCTP 3-01A_\n\n**ABSTRACT**\n\nNetwork forensics is a well-developed discipline within the infosec industry. But what happens when you apply that\ntradecraft to global network visibility?\n\nFor more than a year, we concentrated our efforts on tracking the infamous APT27 group of actors. What we found is\ncompelling! Much like pandas leaving paw prints in the snow and other clear signs of their presence that trained observers\nare able to spot, the Emissary Panda actors leave many traces behind that analysts can use to watch their movements.\n\nFor a while, APT27 (a.k.a. Emissary Panda, TG-3390, BRONZE UNION, Iron Tiger, LuckyMouse) has been busy\nconducting operations targeting the Middle East. These threat actors have exhibited some operational security awareness,\nwhich minimizes certain analysis possibilities. Despite their attempts to hide, we found evidence showing communications\nwith victims in the energy, health care, technology, education, travel and government sectors.\n\nThese threat actors leave fingerprints and trails that we have been able to uncover through network forensics. Our global\nInternet traffic analysis shows an extensive and well-designed infrastructure that has evolved over time. In this paper, we\nwill reveal the group’s fingerprints and highlight an impressive infrastructure. We have uncovered exfiltration paths, control\ninfrastructure, and what appears to be a migration from one hosting provider to another.\n\nIn an unexpected and unusual announcement in December 2019, the Iranian government tweeted publicly claiming they\nhad ‘foiled’ an attack by ‘the well-known APT27’ – but is this really the case? This paper will add to the story by showing\nthe before, during and after impacts on the APT27 infrastructure around the time of the Iranian public statement.\n\nIn summary, we will reveal intimate knowledge of enemy infrastructure and behaviours, allowing practitioners to achieve\ncyber field awareness. We present network infrastructure mapping that may reveal the APT27 actor’s battle plans. We will\ndescribe the scouting and detection methods we used to determine this infrastructure, as well as some defensive techniques\nnetwork operators can employ to defeat these attacks.\n\nPandas are not native to the Middle East, and despite their best efforts to hide their espionage campaign and exfiltration\nactivities, we have been able to track their tell-tale trails as they sneak through the corners of the Internet.\n\n**AECERT’S JUNE 2019 REPORT**\n\nSecuring the Internet as a whole takes a collaborative effort. Both public and private sector researchers contribute greatly to\nthe shared understanding of the threats we all face from APT actors and others. Like others, we use these reports, bulletins\nand publications to help build our knowledge and understanding of these threats.\n\nWe regularly monitor reports from many different sources to help us to stay on top of online threats. Like all major threat\nactor campaigns, APT27 has been on our radar for a long time. We often find reports that can be enriched to create a more\ncomplete picture of actor activity, through an analysis of the entire cyber field and Internet-scale visibility. These reports\nbecome a useful seed from which we can map out actor infrastructure beyond first hops, improve surveillance of actor\nactivity, and add context that increases situational awareness. In many instances, Team Cymru is able to see more, know\nmore, and understand more of the activity than the original report reveals. This story covers one such occasion.\n\nOn 13 June 2019, aeCERT, the Computer Emergency Response Team of the United Arab Emirates, published a bulletin\ntitled ‘Advanced Notification of Cyber Threats against Family of Malware Giving Remote Access to Computers’ [1] . This\nreport warned of an active and ongoing malware campaign and provided a list of several indicators of compromise. It also\ngave sound advice regarding ways to mitigate the impact and defend networks against this campaign activity.\n\nThe network indicators from the aeCERT report are reproduced in Table 1, augmented to include the originating network\nfor each address.\n\naeCERT’s report noted the use of HyperBro, a remote access trojan (RAT) that has previously been identified by other\ncybersecurity organizations [2]. HyperBro remains resident in memory and is loaded through side-loading the DLL [1].\nThese communication methods support RAT-like functions and VPN-like capabilities over encrypted channels. According\nto aeCERT’s report, the inside tunnel addresses were non-routable IPs, suggesting that the attackers were using tunnels to\nreach their victims.\n\nThe aeCERT report identifies a new variant within the HyperBro family called HyperSSL. This tool is said to side-load an\nencrypted payload that is then decrypted and executed in memory [1]. It uses PolarSSL (now called mbed TLS [3]), which\naeCERT observed operating over port 443 [1]. aeCERT’s report also identified TCP port 4550 as the port used by\nHyperSSL to connect to the control servers.\n\nWe also note that some other reports have overlapping indicators with HyperBro and HyperSSL, calling it by another name.\nA presentation by FireEye’s Mandiant names a tool ‘FOCUSFJORD’, and we noted that the registry key signatures (the\nappending of ‘-ll37389743nxshkhjhgee’) overlaps with HyperSSL signatures [4, 6].\n\n\n-----\n\n|IP address|Network AS and name|\n|---|---|\n|10.69.0.176 192.168.4.26 192.168.1.237|Unrouted RFC1918|\n|202.179.0.142 202.179.5.161|AS 9934 - MICOM-MN-AS Mongolia Telecom, MN|\n|138.68.133.211 104.248.169.149 134.209.88.107 138.68.154.133 139.59.67.212 139.59.82.32 142.93.219.48 142.93.233.195 159.89.168.83 178.128.202.249 206.189.123.156 209.97.171.8|AS 14061 - DIGITALOCEAN-ASN, US|\n|203.91.119.4|AS 24559 - GMOBILE-MN G-Mobile Corporation, MN|\n|103.224.80.86|AS 55933 - CLOUDIE-AS-AP Cloudie Limited, HK|\n|185.220.59.120|AS 197328 - INETLTD, TR|\n\n\n_Table 1: aeCERT’s reported IP addresses with originating AS added._\n\n**A BRIEF NOTE**\n\nWe do not wish to further victimize the targets of APT actors or other threat actor groups. Within this paper, we do not\nmention any victims by name or by identifying resource. All IoCs contained within this paper are believed to be owned and\nused solely by the threat actors during the time period identified. We show IoCs inline during discussions of the timeline\nwhere relevant. The infrastructure is very dynamic and many of the IoCs mentioned throughout are no longer active. An\noverview of recent IoCs is available in the IoCs section at the end of this paper.\n\nAs with all reports of reconnaissance of actor infrastructure, this paper is based fully on the data Team Cymru holds and can\naccess. This paper reflects a comprehensive portrayal of what is known, but as with all data, it is subject to observation bias\nthat may underrepresent the totality of the APT27 actor infrastructure and activity. We would welcome the chance to\ncompare our notes with the APT27 actor’s internal notes, but we are unlikely to get the chance to do so. We believe that this\npaper reflects the most informed available understanding of the APT27 infrastructure and overall activity outside of\nAPT27’s own data.\n\n**THE SUMMER OF 2019**\n\nStarting from the aeCERT report’s indicators, how does one achieve the state of cyber field awareness – that deep\nunderstanding of enemy operations that enables a tactical defence to stop the threat today and tomorrow?\n\n_Team Cymru’s roots are in the deep technical knowledge of how the Internet works, applied to interpreting network_\nmetadata through the lens of threat intelligence practice. Today, we still gather and collect many different types of\nindicators that allow us to see what others cannot and do not.\n\nTaking the indicators from aeCERT’s report and comparing them against our data holdings, we see network\ncommunications and other indicators that allow us to map out the infrastructure of the APT27 actor group. We also found\nan X.509 certificate being served by some of the hosts, which is shown in Table 2. It is convenient that the naming suggests\na possible use for the certificate.\n\n\n-----\n\n|Common name|domain.com|\n|---|---|\n|O|VPN|\n|Subject|CN=domain.com, O=VPN|\n|NotAfter|2028-12-30 01:55:37|\n|NotBefore|2019-01-02 01:55:37|\n|SHA1|6B:10:79:40:80:A1:55:3A:08:76:76:09:5D:05:4F:16:08:94:A2:4B|\n|Issuer|CN=VPN CA, O=Work|\n\n\n_Table 2: First X.509 certificate observed._\n\nTo enrich our understanding of the actor infrastructure, we performed our initial analysis based on network metadata. Table\n3 shows the original aeCERT report indicators that were still active at the time of our analysis and the new associated\nsystems found within Team Cymru network data.\n\n**aeCERT IoCs [1]** **Hosts talking to aeCERT IoCs**\n\n104.248.169.149 223.12.171.71\n134.209.88.107 223.12.172.63\n138.68.154.133 223.12.224.122\n139.59.67.212 223.12.224.20\n139.59.82.32 47.244.134.234\n142.93.219.48 47.244.159.87\n159.89.168.83 47.244.161.239\n178.128.202.249 47.244.227.84\n206.189.123.156 47.244.29.164\n209.97.171.8 47.244.57.48\n\n47.52.211.201\n47.52.226.143\n47.52.39.161\n47.89.31.25\n47.91.206.33\n\n_Table 3: aeCERT IoCs with additional associated hosts._\n\nCombining all of our initial indicators after the first set of pivots from further analysis of network communications allowed\nus to create a map showing a far more extensive infrastructure than the aeCERT paper detailed.\n\n_Figure 1: Observed actor infrastructure up to August 2019._\n\n|aeCERT IoCs [1]|Hosts talking to aeCERT IoCs|\n|---|---|\n|104.248.169.149 134.209.88.107 138.68.154.133 139.59.67.212 139.59.82.32 142.93.219.48 159.89.168.83 178.128.202.249 206.189.123.156 209.97.171.8|223.12.171.71 223.12.172.63 223.12.224.122 223.12.224.20 47.244.134.234 47.244.159.87 47.244.161.239 47.244.227.84 47.244.29.164 47.244.57.48 47.52.211.201 47.52.226.143 47.52.39.161 47.89.31.25 47.91.206.33|\n\n\n-----\n\nMapping out the enemy positions is a vital part of military scouting. In the digital space, understanding the infrastructure\nused by malicious actors is essential to systematic defence and getting ahead of the next round of attacks. To help with the\nunderstanding the systems discussed from this point forward, it will be helpful to define a few terms.\n\nMalware communication Victim connections by HyperBro and variants to controllers, connecting over\nTCP/443.\n\nManagement (MGMT) VPN node Listen for connections, expose observed X.509 certificates, part of the tunnelling\ninfrastructure, over TCP/443 and UDP/443.\n\nData path node Connect to controllers, believed to be used to collect exfiltrated data, part of the\ntunnelling infrastructure.\n\nOperational node Systems used for forward activity such as reconnaissance, exploiting targets, and\nconfiguring infrastructure.\n\n_Table 4: Definition of terms used._\n\nWe can see that, during the summer of 2019, the actors established a network topology with multiple paths between nodes.\nStarting closest to the actors, we see connections from Chinanet Backbone or Alibaba establishing tunnels to the\nmanagement VPN nodes at DigitalOcean. From these, they create tunnels to operational nodes, which they use to SSH into\nthe malware controllers. These malware controllers receive victim communications, but also establish tunnels to what we\nbelieve to be data exfiltration nodes. This configuration is complex and we believe it is intended to hide the attackers’\norigins from their victims, while also providing redundancy and fault tolerance.\n\nThe fact that the actors have set up and are operating this level of infrastructure gives an indication of their sophistication\nand the value of these attacks for APT27. We believe the actors use distinct paths for management purposes and data\nexfiltration. The management VPN path is used to connect to operational nodes. These operational nodes are used for\nconfiguring and maintaining infrastructure, reconnaissance of targets, and exploiting targets. The data exfiltration tunnel\npath is used for carrying traffic from malware controllers back towards the actors. The use of distinct paths for different\npurposes is part of the group’s operational security awareness.\n\nWe noted the significance of 139.59.67.212 to the actor infrastructure. This host, an operational node, showed what we\nbelieve to be VPN connections inbound from higher order infrastructure and SSH sessions outbound to command-andcontrol servers. We also see indicators consistent with target reconnaissance (HTTP/HTTPS) outbound from this host. The\nfirst X.509 certificate we observed was live on this host from April 2019 to June 2019. Based on the network activity of this\nhost, it seems that this system is used by the actors for management and forward compromise activity.\n\nThe actors used 134.209.88.107 during this phase as a management VPN node for receiving and creating VPN connections.\nWe see inbound UDP and TCP port 443 traffic coming to this host, as well as some outbound UDP and TCP 443\nconnections from this host to both DigitalOcean and Alibaba hosts. This host also hosted the first X.509 certificate\nobserved from April 2019 to July 2019. This is the main host we observe Chinanet Backbone hosts connecting to at the\ntime, but we also see some connectivity between Chinanet Backbone and 159.89.168.83.\n\nWe see a wide variety of targets within this initial data analysis, showing victim malware communications connecting back\nto the controllers via TCP port 443. These indicators of successful execution of the malware on many different victim\nnetworks is present throughout our monitoring. We include basic victim demographics at the end of this report, keeping\nwith our policy of protecting victims from further victimology.\n\n**LITTLE IS STATIC BETWEEN SUMMER AND FALL**\n\nAs with the changing of the leaves from vibrant green to hues of red, orange and yellow, so too do the resources used by\nthreat actors change. Sometimes these changes have predictable frequency or signals that reveal details of their preferences\nor operational security. Starting around September 2019, we observe several changes in the operational hosts, the providers\nused, and some of the patterns of network communication.\n\nThese changes all took place well after the publication of the aeCERT notice. It was not clear to us at this time what\nprompted the significant changes to the actor infrastructure and communications patterns. Prior to this, we had not observed\na similar change in infrastructure.\n\nMost notably, we observe significant changes in active hosts and network fingerprints. Many of the former DigitalOcean\nhosts were no longer active. We noted a significant reduction in TCP port 4550 traffic. We see the actors moving fully to\nusing port 55781 for network communications, having previously used port 4550. We also note a significant change, seeing\nthe actors introduce a second X.509 certificate into their infrastructure, shown in Table 5.\n\n|Malware communication|Victim connections by HyperBro and variants to controllers, connecting over TCP/443.|\n|---|---|\n|Management (MGMT) VPN node|Listen for connections, expose observed X.509 certificates, part of the tunnelling infrastructure, over TCP/443 and UDP/443.|\n|Data path node|Connect to controllers, believed to be used to collect exfiltrated data, part of the tunnelling infrastructure.|\n|Operational node|Systems used for forward activity such as reconnaissance, exploiting targets, and configuring infrastructure.|\n\n\n-----\n\n|Common name|domain.com|\n|---|---|\n|O|VPN|\n|Subject|CN=domain.com, O=VPN|\n|NotAfter|2029-08-23 01:53:45|\n|NotBefore|2019-08-26 01:53:45|\n|SHA1|43:CD:54:4A:01:8F:29:56:A3:3E:D6:55:1E:ED:85:DC:26:05:9D:62|\n|Issuer|CN=VPN CA, O=Work|\n\n\n_Table 5: Second X.509 certificate observed._\n\nOur data shows this certificate in use by nine hosts during September 2019. These hosts, along with the initial observation\ndates, are shown below.\n\n**IP address** **ASN** **First seen**\n\n47.56.102.6 Alibaba, HK 2019-09\n\n47.75.124.161 Alibaba, HK 2019-09\n\n47.90.97.10 Alibaba, HK 2019-09\n\n47.254.233.126 Alibaba, MY 2019-09\n\n47.244.146.7 Alibaba, HK 2019-09\n\n139.162.98.149 Linode, LLC, JP 2019-09\n\n47.56.183.184 Alibaba, HK 2019-10\n\n47.52.39.167 Alibaba, HK 2019-10\n\n47.56.176.33 Alibaba, HK 2019-10\n\n_Table 5: Host addresses observed serving second X.509 certificate._\n\nThis new X.509 certificate uses an identical Subject (CN=domain.com, O=VPN) and Issuer (CN=VPN CA, O=Work) to\nthose used by the previous certificate. This certificate is observed on hosts at a hosting provider (Alibaba) already known to\nbe a favourite of this threat actor, which increases our confidence that this is the same threat actor group.\n\nThe network behaviours of the hosts using this certificate show similarities to the hosts already established as part of the\nAPT27 infrastructure. Several of the hosts showing the new X.509 certificate are seen making UDP port 443 connections to\na management VPN node we see hosting the old X.509 certificate: 68.183.94.205.\n\nTaking into consideration everything we know at this point, we are able to create a view of the APT27 infrastructure in\nSeptember 2019, which is shown in Figure 2.\n\n**A SHIFT TOWARDS LINODE**\n\nBy September 2019, we noted that the actors were using Linode hosts for more of their infrastructure. While we had\nobserved hosts within Linode being used by the actors before, in September there was a drastic change towards Linode.\nGiven the introduction of substantial Linode infrastructure, we theorized at this point that the actors may have been shifting\nfrom preferring DigitalOcean to preferring Linode. We later see them using both Linode and DigitalOcean, changing our\nunderstanding of this initial move from a change in preference to a diversification of their cloud posture.\n\n**LATE FALL 2019**\n\nWith time, the patterns become more concrete and observations gain more confidence. Previously, we had noted TCP port\n4550 traffic dropping to zero. TCP port 4550 activity was not observed throughout this reporting period (nor up to the time\nof writing this paper), and TCP port 55781 activity continued. The second X.509 certificate (see Table 5) was seen on more\n\n|IP address|ASN|First seen|\n|---|---|---|\n|47.56.102.6|Alibaba, HK|2019-09|\n|47.75.124.161|Alibaba, HK|2019-09|\n|47.90.97.10|Alibaba, HK|2019-09|\n|47.254.233.126|Alibaba, MY|2019-09|\n|47.244.146.7|Alibaba, HK|2019-09|\n|139.162.98.149|Linode, LLC, JP|2019-09|\n|47.56.183.184|Alibaba, HK|2019-10|\n|47.52.39.167|Alibaba, HK|2019-10|\n|47.56.176.33|Alibaba, HK|2019-10|\n\n\n-----\n\n_Figure 2: Observed actor infrastructure from September 2019._\n\nhosts. We saw ten in total, four of which overlapped with hosts observed in previous periods, but we also noted that five\npreviously observed hosts were no longer serving the second X.509 certificate. Only three previously observed hosts were\nseen using the first X.509 certificate (see Table 2). These certificate changes are shown in Table 6, reflecting the\nobservations current as of November 2019.\n\n**First** **Last**\n**IP address** **ASN** **X.509**\n**Seen** **Seen**\n\nDigital Ocean, First 2019-11\n68.183.94.205 2019-07\nLLC, US\n\n172.104.114.30 Linode, LLC, US First 2019-07 2019-11\n\n139.162.46.15 Linode, LLC, US First 2019-08 2019-11\n\n139.162.98.149 Linode, LLC, JP Second 2019-09 2019-11\n\n47.56.19.60 Alibaba, HK Second 2019-10 2019-11\n\n47.75.71.85 Alibaba, HK Second 2019-10 2019-11\n\n47.244.200.103 Alibaba, HK Second 2019-10 2019-11\n\n47.244.111.151 Alibaba, HK Second 2019-10 2019-11\n\n47.52.116.124 Alibaba, HK Second 2019-11 2019-11\n\n47.91.222.81 Alibaba, HK Second 2019-11 2019-11\n\n47.75.13.135 Alibaba, HK Second 2019-11 2019-11\n\n47.91.221.5 Alibaba, HK Second 2019-11 2019-11\n\n_Table 6: X.509 certificates observable in November 2019._\n\n|IP address|ASN|X.509|First Seen|Last Seen|\n|---|---|---|---|---|\n|68.183.94.205|Digital Ocean, LLC, US|First|2019-07|2019-11|\n|172.104.114.30|Linode, LLC, US|First|2019-07|2019-11|\n|139.162.46.15|Linode, LLC, US|First|2019-08|2019-11|\n|139.162.98.149|Linode, LLC, JP|Second|2019-09|2019-11|\n|47.56.19.60|Alibaba, HK|Second|2019-10|2019-11|\n|47.75.71.85|Alibaba, HK|Second|2019-10|2019-11|\n|47.244.200.103|Alibaba, HK|Second|2019-10|2019-11|\n|47.244.111.151|Alibaba, HK|Second|2019-10|2019-11|\n|47.52.116.124|Alibaba, HK|Second|2019-11|2019-11|\n|47.91.222.81|Alibaba, HK|Second|2019-11|2019-11|\n|47.75.13.135|Alibaba, HK|Second|2019-11|2019-11|\n|47.91.221.5|Alibaba, HK|Second|2019-11|2019-11|\n\n\n-----\n\nUsing the overlaps of tracking all the indicators we have thus far established on these actors, we are able to update our\nunderstanding of their network topology.\n\n_Figure 3: Observed actor infrastructure November 2019._\n\n**AN ACTIVE DECEMBER 2019**\n\nDecember 2019 introduced some changes into the ongoing relationship between the threat actors and one of their victims.\nThere was also a significant increase in activity in terms of infrastructure changes. Using the techniques we’ve been\napplying throughout this report, we are able to update our early December 2019 data points to create the following view of\nthe infrastructure:\n\n_Figure 4: Observed actor infrastructure early December 2019._\n\n\n-----\n\nAt this point, we noted a pronounced shift in utility between DigitalOcean hosts and Linode hosts. In particular,\n_DigitalOcean host 68.283.94.205, which was previously observed to be a significant operational node, diminished in use_\nduring this timeframe. We saw these functions shifting to Linode hosts 172.105.37.202 and 172.105.51.140. Linode appears\nto be the favoured hosting provider, along with Alibaba, in December 2019. This data is compatible with our previous\nspeculation of a shift to Linode and away from DigitalOcean.\n\nIn early December 2019, we saw two hosts (both previously identified) serving the first X.509 certificate observed. For the\nsecond X.509 certificate observed we saw 16 hosts. This was the highest count to date for hosts configured to serve these\nX.509 certificates. We also saw a host at Alibaba, 47.56.156.3, serving the second X.509 certificate observed via TCP port\n8443. Until this point, we had not seen either certificate hosted on ports other than 443.\n\nThis timeframe reveals an oddity. A private Canadian long-term care facility or nursing home was introduced into the\ninfrastructure, not as a victim but rather was used by the threat actors as a VPN node. This was the first time we observed\nthe introduction of a non-hosting provider system into the infrastructure. We noted what appeared to be web browsing\ncompatible with target reconnaissance from this host.\n\nWe believe this host was compromised, as our data shows the host to have been vulnerable. We are not certain why this host\nwas incorporated into the infrastructure. One possibility is that the systems were provisioned by a different group within the\nAPT27 actor hierarchy, and this system may have been put on the wrong list when handed to a team building out the next\ninfrastructure. Alternatively, and more simply, it could have been added in an attempt to make their browsing stand out less\nfor networks monitoring for user-like behaviours exhibited by data centre hosts.\n\n**AND NOW FOR SOMETHING COMPLETELY DIFFERENT**\n\n_Twitter has become a preferred platform for political messaging and sees increasing use by politicians to express all forms_\nof announcements, sentiments, and policy altering decisions. Most tweets do not influence or change the course of most\nAPT group activity. But some do.\n\nIn Figure 5, we show a tweet from MJ Azari Jahromi (@azarijahromi), Iranian Minister of Communications and\nTechnology. This tweet says that Iran has found ‘Foreign spying malware on their government servers,’ that the Ministry\nattributes to the ‘well-known APT27’. This tweet was posted on 15 December 2019.\n\n_Figure 5: Tweet by Iranian Minister of Communications and Technology._\n\nSometimes, it is hard to know the impact of these sorts of announcements. But Internet-scale visibility allows us to analyse\nthe changes in the actor infrastructure following this tweet.\n\nWithin just two days of this tweet, by the end of 17 December 2019, we see substantial changes. 103.117.103.179 played a\nsignificant role in the actor infrastructure between September 2019 and December 2019 as a data exfiltration node,\nreceiving TCP port 55781 connections from multiple controllers. It appears to be inactive after 17 December 2019. We do\nnot see another host taking over the role of this host. It is possible that this infrastructure was retired in direct response to\nMJ Azari Jahromi (@azarijahromi)’s tweet.\n\nAfter 17 December 2019, we see a very significant reduction in TCP port 443 traffic to Iranian-based victims. Notably,\nseveral controllers no longer communicate with Iranian-based victims. We observe a general reduction in management\nactivity. Reductions Iranian-based victim communications held through January 2020, with no data showing APT27\nactivity with Iranian government resources. Prior to this time, Iranian government resources were a significant target for\nthese threat actors.\n\n\n-----\n\n**AND SOMETHING ELSE COMPLETELY DIFFERENT**\n\nCyber field awarenessinvolves full-scale awareness, understanding both attacker activity and resources as well as defender\nactivity and resources. As we noted previously, we see what we believe to be a significant change in network activity\naround the same time as the tweet confirming some compromise of Iranian infrastructure. But was this reduction due to the\nthreat actors changing their patterns of behaviour or due to the defenders developing better detection or remediation\ntechniques?\n\nHyperBro, as discussed here in more detail from the aeCERT report [1] and the LuckyMouse paper [2], is the malware\ncomponent of the actor infrastructure. The pattern of compromise is to use several different means to gain access to systems\n\n[5, 6], followed by the installation of HyperBro (and/or the HyperSSL variant). These tools have known fingerprints, one of\nwhich is to create a mutex name by appending the string ‘Defender’ to the current account name on the Windows machine\nexecuting HyperBro, for example ‘JoeDefender’ [6].\n\nIn searching through our malware holdings to find HyperBro variant samples, we found a sample using the ‘Defender’ style\nname for a mutex that did not match other characteristics of HyperBro variants (SHA1:\nf7979ded11e695448c24a7a8efc1ea2649f9196c). It turns out that this sample is not a variant of HyperBro, and in fact\nshows authorship attribution to AFTA, the Iranian Cyber Security Agency.\n\n_Figure 6: Version information of f7979ded11e695448c24a7a8efc1ea2649f9196c._\n\nWhen sandboxing this application, we captured the start-up image which showed two logos side by side (see Figure 6). We\ndiscovered that the logos are that of BitBaan, an Iranian cybersecurity company (on the left), and the AFTA logo (on the\nright).\n\n_F igure 7: Cleaning tool sandbox screenshot, showing the BitBaan (left) and AFTA (right) logos._\n\nOn researching this further, and looking into BitBaan, we noted that they describe themselves as the first Iranian startup\nfocused on malware analysis. We also found a tweet [7], shown in Figure 8, where they talk about the creation of this tool\n(and show the side-by-side logo from the sandbox execution).\n\n\n-----\n\n_Figure 8: BitBaan tweet with Google Translation to English (https://twitter.com/BitBaanLab/_\n_status/1211601603519754240)._\n\nOur analysis shows this tool bundled with another application and instructions. The instructions discuss putting this tool on\na network share, likely to facilitate cleaning up larger networks of compromised computers. Analysing the tool itself, we\nnote that it searches for infections via registry keys, running processes, and mutexes known to be associated with a likely\nvariant of HyperBro. It then removes the infection by cleaning the registry key, removing the configured service, killing the\nsvchost.exe process running the side-loaded DLL, and removing the files from the disk. The second application analyses\nlogs and creates summary information for review by incident responders or administrators.\n\nMost automation takes place because a reasonably large number of repetitions of the same activity need to be performed.\nWe believe the existence of these automated removal tools, in conjunction with BitBaan and AFTA, indicates a significant\nnumber of compromises of Iranian infrastructure by the APT27 actors. This assessment is supported by our forensic\nanalysis of network data. The complete analysis of this removal tool is available in Team Cymru’s blog [8].\n\n**A NEW YEAR OF APT27 (JANUARY AND FEBRUARY 2020)**\n\nThe coming of the new year brings with it a change in infrastructure and targeting for the APT27 actors. The decrease in\noverall activity seen starting after the Iranian tweet continued through February 2020. Some older infrastructure was torn\ndown, and with it, the use of the first X.509 certificate observed ceased. We have yet to see this first X.509 certificate in use\nagain.\n\nWe have been tracking victim connections since our first set of observations on APT27. Following the reduction in actor\ninfrastructure and activity, the victim connections become more easily depicted in the infrastructure maps. We include\nvictim connections in a highly summarized form to avoid further victimization of the actor’s targets.\n\n_Figure 9: Observed actor infrastructure January 2020._\n\n\n-----\n\nThe February infrastructure map shows a continuation of the trend of reduced activity following the MJ Azari Jahromi\n(@azarijahromi) tweet (Figure 4). We do see some expansion of the total number of target countries starting in February,\nwhich may indicate a strategic decision to switch to alternate targets after being ousted by Iran. In February, the traffic\nto Iran (and most other targets) is more compatible with reconnaissance efforts than exploitation and data exfiltration.\n\nThe actors continue to use 172.105.51.140 and 172.105.37.202 to manage their infrastructure. We continue to observe a\nshift away from DigitalOcean as a preferred hosting platform and continue to observe provisioning of new resources at\n_Alibaba and Linode. We see two new probable controllers (139.162.221.60 and 178.79.177.69) introduced during February,_\nwhich may indicate positioning for a future return of activity.\n\n_Figure 10: Observed actor infrastructure in February 2020._\n\n**A NEW SPRING**\n\nWhen tracking threats, and trying to obtain a state of cyber field awareness, spotting trends and changes in activity levels\nand patterns is essential to understanding the enemy. For the first couple months in 2020, it appears that the APT27 actors\nwere tactically retreating, withdrawing from a very aggressive position and engaging mostly in scouting new targets.\nHowever, this retreat changes in March.\n\nIn March 2020, the APT27 actors were busy again. We see the introduction of seven new hosts serving the second X.509\ncertificate observed, with only three of the current hosts being observed prior to March hosting this certificate. These hosts\nwere mostly at Linode (four), but now we see DigitalOcean hosts being provisioned again (two) and a new hosting provider\nintroduced (GCORE). We observed the actors using GCORE resources that GeoIP data places within Russia.\n\nWe see a marked increase in the size of the active infrastructure starting in March 2020 that reverses the trend following the\nMJ Azari Jahromi tweet. Along with this increase, we also see a shift away from using 172.105.51.140 and 172.105.37.202\nfor management activities. The actors have also begun targeting Saudi Arabia to a much greater degree than previously\nobserved. The shift to Saudi Arabia as a target began in February, but the sustained shift and traffic levels through March\nmakes it clear that this shift is a prominent focus for the actors. We see SSH sessions from 66.175.218.50 and from\n47.56.254.96 in March and through April, indicating that these systems may be taking over the role previously occupied by\n172.105.51.140 and 172.105.37.205. We will continue to monitor these hosts over the subsequent months. Figure 11 shows\nthe observed actor infrastructure during March 2020.\n\n**THE RETURN TO PERSIA**\n\nApril 2020 shows the continued use of 66.175.218.50 and 47.56.254.96 for management activity, both of which are\nobserved SSH’ing into two hosts each. No new controllers are found during this period, but we do see a continued focus on\nSaudi Arabia. This month, we see 15 distinct hosts across four providers serving the second X.509 certificate observed.\n\n\n-----\n\n_Figure 11: Observed actor infrastructure in March 2020._\n\nIn the cat-and-mouse (or kitten-and-panda) game actors and defenders dance the all-too-familiar back and forth motion of\ncompromise and clean up. APT actors, though, show unique resolve in their focus on their targets. April shows them\nreturning their attention to the targeting of Iranian government resources.\n\nIn addition to other connections, we see a couple of connections into TCP port 993 (IMAPS) on a government attributed\nhost. While not conclusive, it is possible that these connections reveal that perhaps the kittens didn’t beat the panda after\nall. Perhaps, like real pandas, they simply migrated down the mountains to the warmer valley during the winter months,\nwaiting to return to their cool mountain homes just in time to beat the heat of summer.\n\n_Figure 12: Observed actor infrastructure April 2020._\n\n\n-----\n\n**ABOUT THE VICTIMS**\n\nWe do see many targets that we believe were compromised based on patterns of network connections (such as connections\nto controllers), data transfer, and longevity of the connections observable within available data. In some cases, though, we\ncannot establish with certainty that the targets were successfully compromised. We show a collective summary of victim\ndemographics below where we have medium confidence the targets were successfully compromised.\n\nKnowing who malicious actors target, what assets they focus on, and how they obtain access to their victims is equally\ncritical to knowing the enemy and is a critical component of comprehensive cyber field awareness. In the case of APT27,\nwe see victims within the following countries: Afghanistan, Bangladesh, Brazil, Bulgaria, Canada, Egypt, Greece, India,\nIran, Iraq, Israel, Italy, Kazakhstan, Kenya, Kuwait, Kyrgyzstan, North Macedonia, Malaysia, Nepal, Oman, Pakistan,\nPalestine, Qatar, Russia, Saudi Arabia, Slovenia, South Africa, South Korea, Taiwan, Tajikistan, Turkey, United Arab\nEmirates, United Kingdom, United States, Uzbekistan, Vietnam, Zimbabwe, and some international organizations. Our data\nshows an unbalanced distribution of interest in these targets, with Iran being heavily favoured and Saudi Arabia a distant\nsecond.\n\nAnalysing the victims by industry sector gives us insight further insight into the threat actor behaviour. We see victims in\nthe following sectors:\n\n_Figure 13: Unique victim IP addresses by industry._\n\n_Team Cymru does not wish to cause further victimization of those exploited by the APT27 actors. Therefore, as we_\npreviously mentioned, we will not be enumerating the list of victim organizations we have seen over the full observation\nperiod of these findings. The summary information is important, as victimology patterns are useful TTPs to indicate\npossible threat actor attribution and to increase the shared understandings of the targeting by APT27.\n\n**CONCLUSION**\n\nJulius Caesar famously said: ‘Veni! Vidi! Vici!’ – I came, I saw, I conquered.\n\nToday, network defenders are fighting a well-equipped and capable array of enemies. Yet the old wit of Julius Caesar’s\nsimple three-word phrase is tied together by that one critical element that so many defenders forget: sight. The modern-day\nequivalent is cyber field awareness and those defenders who recognize the importance of knowing your enemy have a\nchance at success. After all, who knows what history may have been if Julius Caesar had left out the ‘vidi’.\n\nAPT27 actors use a wide range of tools and infrastructure to enable their attacks, gaining access, persisting control, and\nexfiltration of data. We have shown a significant history of the last year of APT27 actor activity, which reflects an\nimpressive infrastructure, a lot of successes in compromising targets, and several iterations of introducing and retiring\nassets.\n\nThe APT27 actors were successful in many ways. They were able to run a fairly complex infrastructure, allowing for\ntunnelled probing and reconnaissance. Many of their targets appear to have been successfully compromised, showing\nconnections compatible with their malware reaching back to control servers. The tunnels show traffic in many cases,\nsuggesting a possible exfiltration of data from their victim networks. They have a well-developed set of tools and skills,\nwith an ability to support multiple ongoing attacks against many different countries as the same time. Yet they are not the\nonly story here.\n\n\n-----\n\nAPT27 was successful at obtaining and maintaining access to Iranian resources for many months. The Iranians, to their\ncredit, detected this and came up with what may have been a successful mitigation process applied to multiple distinct\nagencies to clean up these intrusions. This activity appears to have slowed down the attacks of the APT27 actors for many\nweeks against all potential targets. Persistence wins the day, however, and the APT27 actors appear to be increasing activity\nin the latest iterations of data.\n\nThe pandas seem to have bested the kittens in the summer and fall of 2019, but winter brought another story. The kittens\ndetected the pandas and bested them in the winter. Spring brings more panda activity, showing a returned focus on the\nkittens, and time will tell how these two adversaries play together in the future.\n\nSome suggest that APT actor groups are sufficiently advanced that organizations stand little to no chance of being able to\ndefend themselves. The ongoing, persistent, mission-driven attention and focus of these threat actors make defence against\nthese threat actor groups very difficult. Continuous attack focus requires continuous defence focus. Many organizations\nsimply lack this ability to maintain a high level of attention to detail, and the right details, to successfully defend against\nAPT actors.\n\nBeing aware of the global threat picture and obtaining that more complete cyber field awareness is more critical today than\never before. Actor groups are advanced, and they are persistent, but they are not invisible. Knowledge of the actor activity\nprovides the necessary intelligence to tip the balance and give defenders a chance of defending against APT27 and all\nsimilarly positioned advanced threat actors.\n\n**REFERENCES**\n\n[1] Advanced Notification of Cyber Threats against Family of Malware Giving Remote Access to Computers. aeCERT.\nhttps://www.tra.gov.ae/assets/mTP39Tp6.pdf.aspx.\n\n[2] Legezo, D. LuckyMouse hits national data center to organize country-level waterholing campaign. SecureList. June\n2018. https://securelist.com/luckymouse-hits-national-data-center/86083.\n\n[3] mbed TLS 1.3.10 released. https://tls.mbed.org/tech-updates/releases/mbedtls-1.3.10-released.\n\n[4] Hall, T.; Clarke, M. Grab bag of attacker activity. https://www.sans.org/cyber-security-summit/archives/file/\nsummit-archive-1574947864.pdf.\n\n[5] Pantazopoulos, N.; Henry, T. Emissary Panda – A potential new malicious tool. NCC Group. May 2018.\nhttps://www.nccgroup.com/uk/about-us/newsroom-and-events/blogs/2018/may/emissary-panda-a-potential-newmalicious-tool/.\n\n[6] Falcone, R.; Lancaster, T. Emissary Panda Attacks Middle East Government SharePoint Servers. Palo Alto\nNetworks. May 2019. https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-governmentsharepoint-servers/.\n\n[7] https://twitter.com/BitBaanLab/status/1211601603519754240.\n\n[8] How the Iranian Cyber Security Agency Detects Emissary Panda Malware. Dragon News Blog. March 2020.\nhttps://blog.team-cymru.com/2020/03/25/how-the-iranian-cyber-security-agency-detects-emissary-panda-malware/.\n\n**INDICATORS OF COMPROMISE**\n\n**X.509 certificates**\n\n**Our name** **SHA1**\n\nFirst X.509 certificate 6B:10:79:40:80:A1:55:3A:08:76:76:09:5D:05:4F:16:08:94:A2:4B\n\nSecond X.509 certificate 43:CD:54:4A:01:8F:29:56:A3:3E:D6:55:1E:ED:85:DC:26:05:9D:62\n\n**IP addresses**\n\nThese addresses were active in April 2020.\n\n|X.509 certificates|Col2|\n|---|---|\n|Our name|SHA1|\n|First X.509 certificate|6B:10:79:40:80:A1:55:3A:08:76:76:09:5D:05:4F:16:08:94:A2:4B|\n|Second X.509 certificate|43:CD:54:4A:01:8F:29:56:A3:3E:D6:55:1E:ED:85:DC:26:05:9D:62|\n\n|IP address|ASN|Type|First seen|Last seen|\n|---|---|---|---|---|\n|47.56.147.0|Alibaba, HK|VPN node second X.509|2020-01|2020-04|\n|47.56.149.171|Alibaba, HK|VPN node second X.509|2020-01|2020-04|\n|128.199.206.160|DigitalOcean, US|VPN node second X.509|2020-03|2020-04|\n|167.99.76.70|DigitalOcean, US|VPN node second X.509|2020-03|2020-04|\n\n\n-----\n\n|IP address|ASN|Type|First seen|Last seen|\n|---|---|---|---|---|\n|172.104.87.64|Linode, US|VPN node second X.509|2020-03|2020-04|\n|172.105.39.133|Linode, US|VPN node second X.509|2020-03|2020-04|\n|172.105.48.29|Linode, US|VPN node second X.509|2020-03|2020-04|\n|139.162.98.149|Linode, US|VPN node second X.509|2019-09|2020-03|\n|47.56.153.203|Alibaba, HK|VPN node second X.509|2020-03|2020-04|\n|66.175.218.50|Linode, US|VPN node second X.509|2020-03|2020-04|\n|92.38.152.61|G-Core Labs, RU|VPN node second X.509|2020-03|2020-04|\n|206.189.138.252|DigitalOcean, US|VPN node second X.509|2020-04|2020-04|\n|47.56.90.121|Alibaba, HK|VPN node second X.509|2020-04|2020-04|\n|47.57.121.137|Alibaba, HK|VPN node second X.509|2020-04|2020-04|\n|47.57.145.146|Alibaba, HK|VPN node second X.509|2020-04|2020-04|\n|47.57.87.112|Alibaba, HK|VPN node second X.509|2020-04|2020-04|\n|178.128.165.84|DigitalOcean, US|Malware controller|2019-12|2020-04|\n|134.209.151.55|DigitalOcean, US|Malware controller|2020-03|2020-04|\n|47.56.254.96|Alibaba, HK|Operational node|2020-03|2020.04|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://vblocalhost.com/uploads/VB2020-Shank-Piccolini.pdf"
    ],
    "report_names": [
        "VB2020-Shank-Piccolini.pdf"
    ],
    "threat_actors": [
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1598618761,
    "ts_modification_date": 1598619089,
    "files": {
        "pdf": "https://archive.orkl.eu/ce7f0ad5996f6973b7c6ee45e97d6a73f5e16b9c.pdf",
        "text": "https://archive.orkl.eu/ce7f0ad5996f6973b7c6ee45e97d6a73f5e16b9c.txt",
        "img": "https://archive.orkl.eu/ce7f0ad5996f6973b7c6ee45e97d6a73f5e16b9c.jpg"
    }
}