{
    "id": "59a1ca92-5a98-46b3-8c31-794c2e715b9f",
    "created_at": "2023-01-12T15:01:12.898379Z",
    "updated_at": "2025-03-27T02:14:11.943668Z",
    "deleted_at": null,
    "sha1_hash": "83d24cfd4a7d6e1e62605f238fdb9e95553c2ac9",
    "title": "2022-03-17 - Meet Lapsus$- An Unusual Group in the Cyber Extortion Business",
    "authors": "",
    "file_creation_date": "2022-05-28T23:23:28Z",
    "file_modification_date": "2022-05-28T23:23:28Z",
    "file_size": 92184,
    "plain_text": "# Meet Lapsus$: An Unusual Group in the Cyber Extortion Business\n\n**[digitalshadows.com/blog-and-research/meet-lapsus-an-unusual-group-in-the-cyber-extortion-business/](https://www.digitalshadows.com/blog-and-research/meet-lapsus-an-unusual-group-in-the-cyber-extortion-business/)**\n\nMarch 17, 2022\n\nIn December 2021, a new cyber threat group began attracting the security community’s\nattention, after conducting several high-profile extortion attacks against organizations\noperating in Latin America and then move on to global targets like Samsung and NVIDIA. In\nthe early stages of their operations, the Lapsus$ threat group compromised and attempted to\nextort the Brazilian Ministry of Health, South American telecommunications organizations,\nand Portuguese media corporations.\n\nWhat makes Lapsus$ stand out is its peculiar way of conducting business. Although some\nresearchers have labeled Lapsus$ as a ransomware group, there’s still no evidence that they\nhave ever deployed ransomware malware onto their targets’ systems. On top of that,\nLapsus$ has been using an innovative technique to communicate with the public, preferring\na [private Telegram channel instead of the more traditional data leak sites.](https://www.digitalshadows.com/blog-and-research/how-cybercriminals-are-using-messaging-platforms/)\n\nLapsus$ currently represents an interesting case study of how cybercriminals innovate their\ntechniques to adapt to an ever-changing threat landscape. So, without further ado, let’s dive\ninto the observed modus operandi of this threat group to better comprehend how you can\nincrease your robustness against their attacks.\n\n## How does Lapsus$ conduct its operations?\n\nGiven the relatively short lifespan of Lapsus$, details are still emerging on how this threat\ngroup gains access to and later compromises its victims. Reporting on Lapsus$’s initial\noperations indicated that the group had exploited public-facing Remote Desktop Protocol\n(RDP) protocols and phishing emails to gain initial access; it is also realistically possible that\n[this group bought access from Initial Access Brokers to conduct some of its operations.](https://www.digitalshadows.com/blog-and-research/rise-of-initial-access-brokers/)\nBased on what we observed, Lapsus$ likely uses a combination of methods to gain initial\naccess to targeted systems.\n\nOn 10 March 2022, the Photon Intelligence Team independently observed the Lapsus$\noperators publishing a message on their Telegram channel to recruit malicious insiders who\ncan provide Virtual Private Network (VPN), Virtual Desktop Infrastructure (VDI), or Citrix\ncredentials to organizations operating in the telecommunications and technology sectors.\nThe message offered an unspecified amount of payment in an unknown currency. As such, it\nis possible that Lapsus$ may have gained initial access to their targets by using malicious\ninsiders working in those companies.\n\n\n-----\n\n_Lapsus$’s Telegram message (named organizations have been redacted)_\nAt the time of writing, it is still uncertain how this group operates within compromised\norganizations, once it gains initial access. Based on similar cyber extortion operations, it is\nrealistically possible that this group might attempt to escalate privileges or move laterally in a\nnetwork to access high-value targets. Once valuable information has been located, Lapsus$\nreportedly begins exfiltrating that data.\n\n\n-----\n\nLapsus$ then announces the identity of its victims via the group s dedicated data leak\nchannel on Telegram – the same one used for most public-facing announcements. Using\nTelegram for these communications is a marked departure from the usual methods used by\nother cyber extortion-focused threat groups, like ransomware actors. It is likely that Lapsus$\ndecided to abuse a legitimate tool like Telegram for its operations to broaden the potential\naudience of its messages and reduce the chances of being disrupted by denial of service\nattacks. Lapsus$ also runs polls on its data leak channel, providing members with the ability\nto decide whose data should be breached next. Among cyber extortion groups, few also\ninvolve their followers or the public in such a direct manner.\n\n## How to mitigate the threat posed by groups like Lapsus$\n\nAccording to the observed operations and Lapsus$’s own messages in its Telegram channel,\nthe Photon Intelligence Team assesses that the group’s primary motivation is soliciting\nransoms from victims. When Lapsus$ compromised technology giant NVIDIA, it requested\nthe firm remove the Lite Hash rate (LHR) from graphics cards as part of its extortion\ndemands. This request was reportedly intended to facilitate a more conducive environment\nfor cryptocurrency mining. Although this focus on cryptocurrency mining suggests that the\ngroup may ultimately be financially driven, Lapsus$ has certainly taken a different approach\nto other groups in soliciting financial rewards; it is realistically possible that the group’s\ntargeting is determined by another, unknown, motivation.\n\nGiven the latest brazen high-profile operations, including technology and telecommunications\ngiants like NVIDIA and Samsung, it is likely that this group will be emboldened to conduct\neven riskier and more profitable operations. This ambition to hit highly visible targets also\nhints at this group’s intention to expand its reputation and credibility in the cybercriminal\nenvironment.\n\nTo defend against groups like Lapsus$, organizations should prioritize strengthening their\ndefenses to hinder these groups’ attempts to gain initial access into their environments.\nUseful mitigation techniques include:\n\nSecure remote working tools like VPN and RDP by using strong passwords, enabling\nmulti-factor authentication (MFA), and restricting access to a limited number of users.\nProvide timely and up-to-date training to your employees to increase your defending\nchances against social engineering campaigns, such as phishing and vishing attacks.\nMonitor your employees’ morale and intentions when possible; taking the time to listen\nand act on their grievances can greatly reduce the risk of insider threats.\n\nIn summary, Lapsus$ appears to be a technically-sophisticated threat group with great\nambitions to target high-profile organizations. This group’s activity will likely continue in the\ncoming weeks and months. If you want a deeper dive into how this group operates, get a\n[customized demo of SearchLight.](https://info.digitalshadows.com/DemoRequest-Blog_Reg.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-17 - Meet Lapsus$- An Unusual Group in the Cyber Extortion Business.pdf"
    ],
    "report_names": [
        "2022-03-17 - Meet Lapsus$- An Unusual Group in the Cyber Extortion Business.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535672,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1653780208,
    "ts_modification_date": 1653780208,
    "files": {
        "pdf": "https://archive.orkl.eu/83d24cfd4a7d6e1e62605f238fdb9e95553c2ac9.pdf",
        "text": "https://archive.orkl.eu/83d24cfd4a7d6e1e62605f238fdb9e95553c2ac9.txt",
        "img": "https://archive.orkl.eu/83d24cfd4a7d6e1e62605f238fdb9e95553c2ac9.jpg"
    }
}