{
    "id": "59cf1b94-f7f0-49ab-93f8-41e88ecbde21",
    "created_at": "2023-01-12T15:09:10.522811Z",
    "updated_at": "2025-03-27T02:05:25.781012Z",
    "deleted_at": null,
    "sha1_hash": "d6a2d332eb0fce2d0a85134dd5150eac807ac8fb",
    "title": "2020-01-23 - Someone is uninstalling the Phorpiex malware from infected PCs and telling users to install an antivirus",
    "authors": "",
    "file_creation_date": "2022-05-27T22:40:26Z",
    "file_modification_date": "2022-05-27T22:40:26Z",
    "file_size": 486451,
    "plain_text": "# Someone is uninstalling the Phorpiex malware from infected PCs and telling users to install an antivirus\n\n**zdnet.com/article/someone-is-uninstalling-the-phorpiex-malware-from-infected-pcs-and-telling-users-to-install-an-**\nantivirus/\n\n[Home Innovation Security](https://www.zdnet.com/)\nMalware analysts believe someone has hijacked the Phorpiex botnet from its creator and is\nsabotaging its operations by alerting users they've been infected.\n\nWritten by Catalin Cimpanu, Contributor on Jan. 23, 2020\n\n\n-----\n\nA mysterious entity appears to have hijacked the backend infrastructure of the Phorpiex\n(Trik) botnet and is uninstalling the spam-bot malware from infected hosts, while also\nshowing a popup telling users to install an antivirus and update their computers, ZDNet has\nlearned.\n\nThe popups have started appearing on users' screens today, early morning, US Eastern\n[time, and have been spotted by the research team at antivirus vendor Check Point.](https://twitter.com/_CPResearch_/status/1220346511340400640)\n\nInitially, ZDNet and others thought this was a prank coded inside the malware by the\nPhorpiex team for the purpose of trolling security researchers analyzing the malware.\n\nHowever, as the hours passed, it became clear that this was actually taking place on\ncustomer systems, in the real world, and was not just a popup that was appearing in virtual\nmachines used as malware analysis sandboxes.\n\n\"This is truly happening,\" Yaniv Balmas, Head of Cyber Research at Check Point, told\nZDNet. \"We are closely monitoring this malware family and have noticed this behavior\nstarted just a few hours ago.\"\n\nBalmas listed several theories as what could have happened -- such as the malware\noperators deciding to quit and shut down the botnet on their own terms, a law enforcement\naction, a vigilante security researcher taking matters into his own hands, or a rival malware\ngang sabotaging the Phorpiex crew by destroying their botnet.\n\n## Most likely a hijack\n\n\n-----\n\nHijack seems likely based on the track record for the Phorpiex developer, said a second\nmalware analyst, who declined to have his name used in this article because he was not\nauthorized to speak in his company's name -- another antivirus vendor.\n\n\"The Phorpiex developer has some pretty nasty rivals in the botnet game so it wouldn't\nsurprise me if this is an attack motivated by jealousy or something along those lines,\" he\nadded.\n\n\"The developer for the Phorpiex botnet is extremely lazy and careless,\" the malware analyst\nsaid, claiming that he could have also hijacked the botnet in the past due to its simplistic\nIRC-based command and control mechanism.\n\n## Same botnet suffered a data breach in 2018\n\nThe Phorpiex malware, which has been active for more than a decade, has suffered security\nbreaches in the past, also due to the malware developer's carelessness.\n\nIn 2018, the Phorpiex developer left one of the botnet's command and control backend\nservers exposed online, and security researchers were able to retrieve a list of 43.5 million\nemail addresses that the Phorpiex crew was targeting with spam campaigns.\n\n[Phorpiex is one of today's most active spam botnets. The Phorpiex team operates by](https://malpedia.caad.fkie.fraunhofer.de/details/win.phorpiex)\ninfecting Windows computers and using these systems as spam bots to send out massive\nspam campaigns.\n\nThese spam campaigns keep the spam botnet alive, by infecting new PCs with Phorpiex, but\nthey also send out custom spam campaigns on behalf of other cybercrime groups -- the\nmethod through which the Phorpiex crew makes its money.\n\nWhoever hijacked the botnet today and instructed bots to uninstall themselves has put a\nserious dent in the Phorpiex gang's future profits and operations. To give an idea about the\nsize of the profits the Phorpiex crew lost, Check Point previously reported that the same\nbotnet [made $115,000 in five months just from mass-spamming sextortion emails.](https://www.zdnet.com/article/phorpiex-botnet-made-115000-in-five-months-just-from-mass-spamming-sextortion-emails/)\n\n**The FBI's most wanted cybercriminals**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-23 - Someone is uninstalling the Phorpiex malware from infected PCs and telling users to install an antivirus.pdf"
    ],
    "report_names": [
        "2020-01-23 - Someone is uninstalling the Phorpiex malware from infected PCs and telling users to install an antivirus.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536150,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653691226,
    "ts_modification_date": 1653691226,
    "files": {
        "pdf": "https://archive.orkl.eu/d6a2d332eb0fce2d0a85134dd5150eac807ac8fb.pdf",
        "text": "https://archive.orkl.eu/d6a2d332eb0fce2d0a85134dd5150eac807ac8fb.txt",
        "img": "https://archive.orkl.eu/d6a2d332eb0fce2d0a85134dd5150eac807ac8fb.jpg"
    }
}