{
    "id": "59f60eec-5e9a-455d-831f-cf781912d58a",
    "created_at": "2023-01-12T15:04:55.315888Z",
    "updated_at": "2025-03-27T02:05:33.688268Z",
    "deleted_at": null,
    "sha1_hash": "714deac65c9a512ff294e5bdcf8ead0f479cd723",
    "title": "2021-07-14 - The Civil Guard dismantles an important network dedicated to committing scams through the Internet",
    "authors": "",
    "file_creation_date": "2022-05-27T22:51:26Z",
    "file_modification_date": "2022-05-27T22:51:26Z",
    "file_size": 61361,
    "plain_text": "# Ministerio del Interior\n\n**[interior.gob.es/prensa/noticias/-/asset_publisher/GHU8Ap6ztgsg/content/id/13552853](http://www.interior.gob.es/prensa/noticias/-/asset_publisher/GHU8Ap6ztgsg/content/id/13552853)**\n\nLa Guardia Civil desarticula una importante red dedicada a cometer estafas a través de\nInternet\n\nGuardia Civil\n\nRibeira (A Coruña), Madrid, Parla y Móstoles (Madrid), Seseña (Toledo), Villafranca de los\nbarros (Badajoz) y Aranda de Duero (Burgos), 10/07/2021\n\nImágenes (2)\nVídeos (0)\nAudios (0)\n\nNo existen vídeos relacionados con la noticia.\n\nNo existen audios relacionados con la noticia.\n\nSe ha detenido a 16 personas en Ribeira (A Coruña), Madrid, Parla y Móstoles (Madrid),\nSeseña (Toledo), Villafranca de los barros (Badajoz) y Aranda de Duero (Burgos) por los\npresuntos delitos de estafa y pertenencia a organización criminal\n\nA través de un software malicioso, instalado en el ordenador de la víctima por la técnica\nconocida como \"email spoofing\", habrían conseguido desviar a sus cuentas grandes\ncantidades de dinero\n\nLos agentes han conseguido bloquear tentativas de transferencias por un importe de\n3.500.000 euros, después de analizar más de 1.800 correos electrónicos\n\nLa Guardia Civil, en el marco de la operación AGUAS VIVAS, ha desarticulado una\norganización delictiva dedicada a cometer estafas a través de Internet. A través de un\nsoftware malicioso, instalado en el ordenador de la víctima por la técnica conocida como\n\"email spoofing\", habrían conseguido desviar a sus cuentas grandes cantidades de dinero.\n\nSe ha detenido a 16 personas en Ribeira (A Coruña), Madrid, Parla y Móstoles (Madrid),\nSeseña (Toledo), Villafranca de los barros (Badajoz) y Aranda de Duero (Burgos) por los\npresuntos delitos de estafa y pertenencia a organización criminal.\n\nSe han esclarecido 20 delitos de estafa, por un importe total defraudado de 276.470 euros,\nde los cuales han podido ser recuperados 87.000 euros.\n\nAsimismo, se han realizado 2 registros en Madrid, en los que han intervenido gran cantidad\nde documentación, dispositivos móviles y equipos informáticos.\n\n\n-----\n\nLa investigación se inició hace más de un año, tras varias denuncias presentadas por\ndiferentes organismo oficiales, situados a lo largo de toda la geografía nacional, por la\nsupuesta infección de sus equipos informáticos con algún tipo de software malicioso, con el\nque habrían conseguido desviar de sus cuentas, a través de la banca online, grandes\ncantidades de dinero.\n\nTras analizar los equipos informáticos afectados, los agentes observaron que la infección se\nllevaba a cabo a través de una técnica conocida como \"email spoofing\", consistente en el\nenvío fraudulento de correos electrónicos en los que los atacantes ocultaban la verdadera\ndirección del remitente, sustituyéndola por otra, aparentemente, legítima, logrando así\nsuplantar la identidad de organismos estatales como la Agencia Tributaria, Hacienda,\nCorreos o la DGT.\n\n**Modus operandi**\n\nLos denunciantes recibían en sus cuentas de correo electrónico unos mensajes,\nsupuestamente provenientes de organismos oficiales como la Agencia Tributaria, Hacienda,\nCorreos, DGT, etc., en los que se les requería pagar deudas fiscales, abonar multas de\ntráfico, o la recogida de paquetes, para lo cual debían abrir un enlace inserto en el correo\nrecibido para ver los detalles. Cuando accedían a ese enlace, en realidad estaban\naccediendo a una dirección o página web desde la que, en segundo plano, era descargado\ne instalado el programa malicioso.\n\nUna vez instalado en el ordenador, sin que el usuario se diera cuenta, permanecía latente a\nla espera de ser activado en el momento en que el usuario accediera a cualquier página\nweb de un banco, ejecutando una transacción bancaria. En ese momento el software\nmalicioso realizaba una interceptación y modificación de los datos emitidos, consiguiendo\nque las cuentas beneficiarias del dinero fueran un total de 30 cuentas bancarias\npertenecientes a la red. Tras ello, el dinero era diversificado mediante su envío a otras\ncuentas, o mediante extracción de efectivo en cajeros, transferencias por BIZUM, tarjetas\nREVOLUT, etc., con el fin de dificultar la posible investigación policial.\n\nUna característica en la que coincidían todas la víctimas es que, una vez que realizaban\ncualquier operación bancaria a través de la web, sus ordenadores se reiniciaban varias\nveces hasta bloquearse el acceso, comprobando más tarde que se habían realizado\ntransferencias de grandes cantidades de dinero a cuentas de desconocidos.\n\n**68 cuentas de correo electrónico infectadas por troyanos**\n\nLos investigadores, en colaboración con el Departamento de Informática de la Diputación\nProvincial de Cáceres, detectaron una actividad sospechosa en al menos 68 cuentas de\ncorreo electrónico pertenecientes a organismos oficiales, los cuales estaban infectados con\nlos troyanos \"Mekotio\" y \"Grandoreiro\", y que permanecían a la espera de consumar las\n\n\n-----\n\ntransferencia fraudulentas. Los agentes han conseguido bloquear tentativas de\ntransferencias por un importe de 3.500.000 euros, después de analizar más de 1.800\ncorreos electrónicos.\n\nLa organización estaba perfectamente estructurada y jerarquizada, en 4 niveles. Por un lado\nse hallaban los que se dedicaban a recibir las cantidades de las transferencias fraudulentas\n(Nivel 1), que posteriormente transferían a otros miembros de la organización (Nivel 2). Por\notro lado, se encontraban los que transferían el dinero a otras cuentas ubicadas en el\nextranjero (Nivel 3) y, finalmente, los que se dedicaban a enmascarar la operativa online de\nlas cuentas (Nivel 4).\n\n**Phishing, Vishing y Smishing**\n\nSe tratan de tres ataques basados en ingeniería social muy similares en su ejecución. De\nforma general, el ciberdelincuente enviará un mensaje suplantando a una entidad legítima,\ncomo puede ser un banco, una red social, un servicio técnico o una entidad pública, con la\nque nos sintamos confiados, para lograr su objetivo. Estos mensajes suelen ser de carácter\nurgente o atractivo, para evitar que aplique el sentido común y se lo piensen dos veces.\n\n**Phishing: Suele emplearse el correo electrónico, redes sociales o aplicaciones de**\nmensajería instantánea.\n**Vishing: Se lleva a cabo mediante llamadas de teléfono.**\n**Smishing: El canal utilizado son los SMS.**\n\nEn ocasiones, traen consigo un enlace a una web fraudulenta, que ha podido ser\nsuplantada, fingiendo ser un enlace legítimo, o bien se trata de un archivo adjunto malicioso\npara infectarnos con malware.\n\nSu objetivo es obtener datos personales y/o bancarios de los usuarios, haciéndonos creer\nque los estamos compartiendo con alguien de confianza. También pueden utilizar esta\ntécnica para que descarguemos malware con el que infectar y/o tomar el control del\ndispositivo.\n\n## Recomendaciones\n\nEl principal consejo es ser precavido y leer el mensaje detenidamente, especialmente si se\ntrata de entidades con peticiones urgentes, promociones o chollos demasiado atractivos.\n\nAdemás, otras pautas que podemos seguir para evitar ser víctima de este tipo de engaños,\npueden ser:\n\nDetectar errores gramaticales en el mensaje. Y, si se trata de un asunto urgente o\nacerca de una promoción muy atractiva, es muy probable que se trate de un fraude.\nRevisar que el enlace coincide con la dirección a la que apunta. Y, en cualquier caso,\ndebemos ingresar la url nosotros directamente en el navegador, sin copiar y pegar.\n\n\n-----\n\nComprobar el remitente del mensaje, o asegurarnos de que se trata de un teléfono\nlegítimo.\nNo descargar ningún archivo adjunto y analizarlo previamente con el antivirus.\nEn caso de vishing, no debemos descargar ningún archivo que nos haya solicitado el\natacante, ni ceder el control de nuestro equipo por medio de algún software de control\nremoto.\nNo contestar nunca al mensaje y eliminarlo.\n\nLa operación, dirigida por el Juzgado de Primera Instancia e Instrucción nº. 1 de Cáceres, ha\nsido llevada a cabo por agentes pertenecientes al Equipo de Delitos Tecnológicos (EDITE)\nde la Unidad Orgánica de Policía Judicial (UOPJ) de la Comandancia de Cáceres.\n\nPara más información pueden contactar con la Oficina Periférica de Comunicación de la\nGuardia Civil de Cáceres, en el teléfono 680.410.422.\n\nExisten imágenes de vídeo, a disposición de los medios que las deseen, en el siguiente\nenlace:\n\n[www.guardiacivil.es/es/prensa/videos_descarga_medios/2021/index.html](http://www.guardiacivil.es/es/prensa/videos_descarga_medios/2021/index.html)\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-14 - The Civil Guard dismantles an important network dedicated to committing scams through the Internet.pdf"
    ],
    "report_names": [
        "2021-07-14 - The Civil Guard dismantles an important network dedicated to committing scams through the Internet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535895,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653691886,
    "ts_modification_date": 1653691886,
    "files": {
        "pdf": "https://archive.orkl.eu/714deac65c9a512ff294e5bdcf8ead0f479cd723.pdf",
        "text": "https://archive.orkl.eu/714deac65c9a512ff294e5bdcf8ead0f479cd723.txt",
        "img": "https://archive.orkl.eu/714deac65c9a512ff294e5bdcf8ead0f479cd723.jpg"
    }
}