{
    "id": "5a155eff-3c13-4706-80bd-a91be2561b29",
    "created_at": "2023-01-12T15:03:13.879164Z",
    "updated_at": "2025-03-27T02:12:36.918464Z",
    "deleted_at": null,
    "sha1_hash": "a14bc6de67780890e7eecc15e943e306010233ad",
    "title": "2016-11-01 - Ursnif Malware- Deep Technical Dive",
    "authors": "",
    "file_creation_date": "2013-05-01T15:42:34Z",
    "file_modification_date": "2013-05-01T22:39:44Z",
    "file_size": 1364512,
    "plain_text": "# Cybercrime Exposed\n\n### Cybercrime-as-a-Service\n\n\n-----\n\n## Table of Contents\n\nForeword 3\n\nExecutive Summary 4\n\nCybercrime-as-a-Service 4\n\nResearch-as-a-Service 5\n\nVulnerabilities for sale: a commercial marketplace 5\n\nExploit brokers 5\n\nSpam services 6\n\nCrimeware-as-a-Service 7\n\nProfessional services 7\n\nMalware services 8\n\nExploits 8\n\nCybercrime Infrastructure-as-a-Service 11\n\nBotnets 11\n\nHosting services 12\n\nSpam services 13\n\nHacking-as-a-Service 14\n\nPassword cracking services 14\n\nDenial-of-service 15\n\nCredit card information 16\n\nConclusion 17\n\nAbout the Authors 17\n\nAbout McAfee Labs 18\n\n\n-----\n\nForeword\nToday’s cybercriminals do not necessarily require considerable technical expertise to get the job done, nor, in certain cases,\ndo they even need to own a computer. All they need is a credit card. A marketplace offering cybercrime tools and services\nprovides would-be criminals with an arsenal that can either be used as a component of a cyberattack or a handy way of\noutsourcing the process entirely.\n\nThis underground marketplace is enabling an army of cybercriminals—and the cost is being borne by all citizens.\nAccording to recent research,[1] 17% of European citizens have been victims of identity theft, costing an average\nof £1,076. Indeed, the ease with which such tools are available enables cybercriminals to target not only citizens,\nbut also businesses and governments at a rapidly growing rate.\n\nNumerous examples of the services-based nature of cybercrime have already caused significant damage. We’re not only\nwitnessing an increase in volume of such incidents, but also seeing that the individuals partaking in these misdeeds are\nfar removed from the public perception of the computer hacker.\n\nThe growth in the “as-a-service” nature of cybercrime fuels this exponential growth, and this flexible business model\nallows cybercriminals to execute attacks at considerably less expense than ever before. Examples include the ability\nto rent services for a relatively small sum—services that offer financial return or that claim to be able to bring down\nentire sites or systems.\n\nThis paper provides insight into the cybercrime marketplace and presents pricing schemes for the services offered.\nClearly, these prices will differ based on the sources. One point, however, must be clear: much like law enforcement\npartners around the world, EC3 European Cybercrime is relentless in the pursuit of criminal groups or networks\nwho steal your money, your information, or your identity and of those who engage in online abuse of children.\n\n_Troels Oerting_\n_Head of EC3 European Cybercrime Centre_\n\n\n-----\n\nExecutive Summary\nThere’s no doubt that cybercrime is on the increase. That is the message from multiple sources across both the public\nand private sectors. Indeed, the Federal Bureau of Investigation (FBI) reported a decline in physical crimes such as bank\nrobberies in 2012,[2] as opposed to cybercrime, which has increased at an alarming rate. Clearly, the risk associated with\nphysical crimes, such as bank robberies, contributes to such a shift; cybercriminals enjoy the luxury of carrying out their\ncrimes from a physical location of their choosing.\n\nHowever, one possible contributing factor to this increase is the ease with which cybercrime tools are available. Moreover,\nthe cybercrime market now affords potential criminals with a multitude of services which means that deep technical\nexpertise is not a prerequisite. Much like cloud computing, the services-based nature of cybercrime allows greater\nefficiency and flexibility when conducting business.\n\nThe ability to provide technology solutions as a service to businesses has allowed organizations to focus on their core\ncompetencies. An unintended consequence of this evolution has been the rise of the as-a-service acronym “aaS” and\na marketplace offering multiple variants of hosted services.\n\nAlthough this approach may seem innovative, the as-a-service model itself is nothing new. The underground economy\nestablished by nefarious cybercriminals has used a services-based model for considerably longer than businesses have\nenjoyed the benefits of cloud computing. Although the term Crimeware-as-a-Service may be relatively new, the servicesbased nature of cybercrime has been in effect considerably longer than its descriptive acronym. Moreover, the servicesbased approach extends well beyond hiring individuals to undertake specific tasks (for example, coding an exploit), with\na broad variety of products and services available either to buy or rent.\n\nThis paper analyzes the growth of the “as-a-service” nature of cybercrime. In particular, it focuses on the evolving manner\nin which the various actors advertise their services and on the multitude of services now available along with their\nassociated costs. What has become evident is that the marketplace contains many stakeholders, ranging from formal,\nlegitimate organizations selling vulnerabilities to parties that meet their strict eligibility criteria to underground websites\nthat allow individuals to offer illegal services. The focus on cybercrime at a global level by law enforcement has led to\n“as‑a-service” models for illegal activities going even deeper underground.\n\nSuch underground platforms are implementing stronger mechanisms to ensure that participants are who they purport\nto be (or at the very least are not law enforcement officials). Ironically, while the platforms that facilitate the services\nmarketplace for illegal activities are going deeper underground, the trade in zero-day vulnerabilities is more transparent\nthan ever before.\n\nCybercrime-as-a-Service\nThere is a multitude of services available to the would-be cybercriminal. Most of these services are clearly administrated\nby cybercriminals. There are, however, a number of services that remain legal. Overall, we can class services as part of\nblack or gray markets. The classification “gray” is used when the activities or real customers are difficult to determine.\nTo simplify the marketplace, we propose four categories:\n\n1. Research-as-a-Service—Unlike other categories, Research-as-a-Service does not have to originate from illegal sources;\nthere is room for a gray market. There are commercial companies that provide the sale of zero-day vulnerabilities\nto organizations that meet their eligibility criteria. And, there are individuals who act as middlemen, selling such\nintellectual property to willing buyers who may or may not have the same strict eligibility requirements.\n\n2. Crimeware-as-a-Service—This incorporates the identification and development of the exploits used for the intended\noperation—and may also include development of ancillary material to support the attack (droppers, downloaders,\nkeyloggers, bots, and more). This also includes tools used to conceal malware from security protection mechanisms\n(cryptors, polymorphic builders, joiners, crackers, and the like), as well as spammer/robot tools like XRumer. In addition,\nthis category includes the availability of hardware that may be used for financial fraud (for example, card skimming)\nor equipment used to hack into physical platforms.\n\n\n-----\n\n3. Cybercrime Infrastructure-as-a-Service —Once the toolset has been developed, cybercriminals are faced with the\nchallenge of delivering their exploits to their intended victims. An example is rental of a network of computers to\ncarry out a denial-of-service (DoS) attack. Other examples include the availability of platforms to host malicious\ncontent, such as bullet-proof hosting.\n\n4. Hacking-as-a-Service —Acquiring the individual components of an attack remains one option; alternatively, there are\nservices that allow for outsourcing of the attack entirely. This path requires minimal technical expertise, although it\nis likely to cost more than acquiring individual components. This category also supports the availability of information\nto be used for identity theft, for example, requesting information such as bank credentials, credit card data, and login\ndetails to particular websites.\n\nMany services within the cybercrime ecosystem broadly fit within the preceding categories. This paper does not intend\nto provide an exhaustive overview of every available service, but rather incorporates some key services as an illustration\nof the ecosystem and of the “as-a-service” nature of cybercrime today.\n\nResearch-as-a-Service\nThe available services within this category include the identification of a previously unknown vulnerability within the\ntargeted system, otherwise known as a zero-day vulnerability. Despite the threat of legal action by affected software\nvendors in certain countries, the sale of vulnerabilities has recently become a growth area for researchers and brokers\nalike. Today, security researchers are presented with a number of options when they identify previously unidentified\nzero‑day vulnerabilities. Each represents differing outcomes in publicity and monetary compensation.\n\nVulnerabilities for sale: a commercial marketplace\n\nToday’s marketplace provides those looking to acquire zero-day vulnerabilities with many options. At first glance,\nthis may appear to be detrimental to underground marketplaces. However, since many organizations selling zero-day\nvulnerabilities actually limit their sale to specific buyers, the underground market continues to thrive. For example, one\nparticular vendor defines its eligibility requirements as being limited to only public sector organizations, in particular,\nlaw enforcement. Furthermore, restrictions are placed on the geographic location of the agency; its customers can only\nbe in predefined countries.\n\nExploit brokers\n\nAlthough the acquisition of vulnerabilities can be conducted via a commercial entity, there is an opportunity to connect\nwith a brokering service, which can be defined as a single individual who acts as a middleman to facilitate the sale\nto a third party. A recent article in Forbes[3] provides details of one such individual known as the Grugq. By acting as a\nmiddleman for the sale of exploits to government agencies, the broker was able to facilitate the sale of an Apple iOS\nexploit for $250,000 and pocket 15% in commission. Table 1 provides the prices that were quoted for zero‑day exploits.\n\nTable 1. Prices for zero-day vulnerabilities.\n\nAdobe Reader $5,000–$30,000\n\n\nMac OS X $20,000–$50,000\n\nAndroid $30,000–$60,000\n\nFlash or Java Browser Plug-ins $40,000–$100,000\n\nMicrosoft Word $50,000–$100,000\n\nWindows $60,000–$120,000\n\nFirefox or Safari $60,000–$150,000\n\nChrome or Internet Explorer $80,000–$200,000\n\n\nIOS $100,000–$250,000\n\n\n-----\n\nThis is just one example, and the middleman in this case represents one individual. As this particular industry is not illegal,\nthere is no shortage of available middlemen advertising their services on very public forums such as Twitter, among others.\nOne Twitter offer we saw read: “Hi...we have 5 0days that will enter in the auction process.”\n\nThe market for these types of services today is very different from the market of six years ago. The 2007 paper, The Legitimate\n_Vulnerability Market; Inside the Secretive World of 0-day Exploit Sales,[4] states, “The current market for the legitimate sale_\nof zero-day exploits is not openly accessible.” However, it is worth noting that although more options may exist, some\nof the previous challenges from 2007 are still present. As Table 1 indicates, the prices for vulnerabilities vary significantly.\nIndeed, the level of transparency regarding potential remuneration remains unavailable publicly, which makes decisions\nabout the most profitable route to selling any zero-day vulnerabilities significantly more difficult.\n\nSpam services\n\nA successful spam campaign relies on a number of factors, many of which we cover later. However, one element belongs\nin the Research-as-a-Service category, namely the identification of targets. Having to manually gather together an email list\ncan be a time-consuming exercise—fortunately the would-be spammer has the luxury of simply purchasing a list of email\naddresses. This is depicted in Figure 1; in this instance, a list of email addresses is available for individuals in France. Aside\nfrom the customization of the message in a particular language, the unsolicited email may require more granularity. For\nexample, if there is something particularly relevant in a US state, there are services that supply email addresses belonging\nto individuals from a specific state, as depicted in Figure 2. In this illustration, the would-be spammer has the opportunity\nto acquire 10 million email addresses of individuals based in Florida.\n\nFigure 1. French email addresses for sale.\n\nFigure 2. Florida residents email addresses for sale.\n\n\n-----\n\nOf course, these two examples are merely the tip of the iceberg. They are indicative of the market and the level of\ngranularity. Services are available that offer buyers the ability to purchase varying volumes to support their unsolicited\nemail campaigns. For example, a campaign may target specific users of a service, a particular bank, or an Internet service\nprovider. Or a campaign may target specific professions or even a particular gender. In such instances, the underground\nmarketplace supports the acquisition of such lists, as depicted in Figure 3. As this illustrates, it is possible to identify a\nspecific profession as well as geography, such as US doctors. Another consideration should be the manner in which the\nservice is offered. The presentation of the service is similar to those offered by legitimate companies selling legal products;\nsome even offer commercial payment mechanisms.\n\nFigure 3. Anyone call for a doctor?\n\nLater, we will look at other services that support campaigns to propagate unsolicited email. This includes the infrastructure\nrequired to distribute the mail, as well as the back-end systems used to host malicious content.\n\nCrimeware-as-a-Service\nWhile the trade in zero-day vulnerabilities may exist within public forums, the underground market offers these and\nconsiderably more services. If we focus our attention on the available tools, we find a multitude of cybercrime tools\navailable for either sale or rent. Below are many of the Crimeware-as-a-Service tools available today.\n\nProfessional services\n\nDeveloping code to take advantage of a specific vulnerability requires a degree of technical expertise—at the very least,\nsoftware programming skills. However, much like the outsourcing market for commercial software, we can find services\nthat offer such code for nefarious purposes. The outsourcing of this particular element of the attack has been around\nfor some time, with some specific examples of malware being outsourced to a third party. An example of this was\nseen as early as 2005, with the Zotob worm. In this example, a programmer was paid to develop the malware, which\nwas estimated to have cost affected companies $97,000 to clean up.[5]\n\nOther professional services available include translations. In the Research-as-a-Service category, we saw how it was\npossible to acquire email addresses for a specific country. If the attacker is a native speaker, then crafting an email to\nentice victims is relatively simple.\n\nNot knowing a language is no hindrance, however. Services provide translations to support non-native speakers in their\nefforts to communicate with potential victims.\n\n\n-----\n\nFigure 4 shows a forum that offers translation services to would-be buyers. In this example, a communication method\nis defined, but also included is a reputational indicator. Much like the modern social media tools we use today, there\nis an indicator as to the reputation of the individual behind the profile.\n\nFigure 4. Translation services for hire.\n\nMalware services\n\nNumerous malware variants are available for sale. Purchasers can acquire developed code to conduct their attacks.\nFor example, attackers who want to acquire information can buy a Trojan horse, a malicious program concealed\nwithin a legitimate file. Other examples include:\n\n- _Rootkit services—Surreptitious code that conceals itself within the compromised system and performs actions_\nas programmed.\n\n- _Ransomware services—Software that restricts the user from conducting further activity until a specific action_\n(such as providing credit card details). Such software is available for sale within the underground market.\n\nExploits\n\nAs we mentioned earlier, there are many options to purchase exploits that take advantage of vulnerabilities. Their prices\nvary based upon the target system and whether the vulnerability has been previously identified.\n\nThere is also the opportunity to rent as opposed to buying. The CritX toolkit, for example, charges by the day, recently\nadvertised for $150 per day.\n\n\n-----\n\nFigure 5 shows the sale of such exploits. This illustration includes the details of the targeted system, a brief description,\nand its price. Also of interest are prices, which closely align with the potential impact of the exploit. Those classified as\nhigh impact are approximately three times as expensive as those classified as low/moderate.\n\nFigure 5. Exploits for sale—the higher the impact, the higher the price.\n\n\n-----\n\nThere are also exploit packs that offer encryption services used to conceal an attack and avoid detection. This may include\nencrypting particular files, which may be used in conjunction with other techniques using encryption to further disguise\nthe malicious code. An example of such exploit packs, with the crypter capability as an additional feature, is depicted\nin Figure 6.\n\nFigure 6. Exploit packs come with add-ons.\n\nAnother available service is checking files against security software. Cybercriminals want to ensure that all of their hard\nwork is not blocked at the first hurdle by antivirus software. Services such as those in Figure 7 illustrate that rather\nthan going through the arduous process of buying, installing, updating, and testing their malware against antivirus\nsoftware, attackers have an alternative, more efficient option. In this instance, the service providers test the malware\nagainst 35 antivirus vendors’ solutions. In addition, they provide a service that tests the sending domain against a known\nlist of domain blacklists. Such lists are used by companies and service providers to block email from domains that are\nknown to send content against their policies, such as spam.\n\nWe mentioned earlier the low cost of cloud computing when compared with internal services, and an association\nwith cybercrime. The prices quoted in the bottom right of Figure 7 undoubtedly validate that assertion. At a cost of\n$30 per month, and only $0.15 per check, the outsourced service proves not only cost effective but also efficient in\nterms of time spent. The implications of such a service are very clear: the bad guys have the opportunity to ensure\nthat their malware is better and more likely to succeed, which will have significant ramifications for all Internet users.\n\nFigure 7. The low cost of cybercrime services.\n\n\n-----\n\nWithin this category a number of products and services are available for sale, and, more recently, for rent. Potential buyers\ncan engage in as much or as little activity (such as programming or researching) as they like, with the only constraints\nbeing how deep their pockets are, their technical competence, and available time. In some instances, certain services in\nthis category are not illegal, with commercial companies offering their expertise on public forums.\n\nCybercrime Infrastructure-as-a-Service\nA number of infrastructure services are available to support a cybercrime operation. These range from the availability\nof services to conduct DoS attacks to hosting malicious content.\n\nBotnets\n\nA robot network, or botnet, is a network of infected computers under the remote control of an online cybercriminal.\nThe botnet can be used for a number of services, such as sending spam, launching DoS, and distributing malware.\n\nFigure 8 illustrates the cost of renting a botnet and the flexible options available. In effect, multiple services are available to\nsuit any budget.\n\nFigure 8. Botnet services.\n\n\n-----\n\nHosting services\n\nA “bulletproof” hosting provider is a company that knowingly provides web or domain hosting (or other related services)\nto cybercriminals, intending to ignore complaints by turning a blind eye to the malevolent use of their services. Such\nservices are illustrated in Figure 9. Other individuals may provide considerably more options and with different pricing\nstructures. This is illustrated with the services provided by an individual known as Matad0r, who provides three levels of\nservice ranging from $50 per month to as much as $400 per month. The variable pricing is based on the specification of\nthe system provided. A more powerful system with more options mean a higher price. This demonstrates that, much like\nthe commercial environment, a myriad of hosting services are available—the only constraint is the amount of money one\nis willing to pay, and, in some cases, the ethics of the hosting provider.\n\nFigure 9. Secure hosting.\n\n\n-----\n\nSpam services\n\nNumerous services are available for the would-be spammer. These include the availability of services that support\nthe sending of unsolicited mail, alternatively known as a mail relay. Figure 10 shows a service capable of sending\n30,000,000 emails. What is particularly relevant is how the proposition is presented. The service offers a live chat\noption with a customer service agent, as well as payment options many of us are accustomed to in the legitimate\nworld. The “as‑a-service” nature of the proposition is further emphasized by the fact that the would-be cybercriminal\nis provided the relay for just one month (with an upper limit of 30,000,000 emails).\n\nFigure 10. This spam service offers support, just like many legitimate online offers.\n\nOf course, simply having an infrastructure is not enough to support an unsolicited email campaign. There is also a need\nfor the email addresses themselves, as well as a back-end set of systems to continue the deception. The latter could be\nhosted through bulletproof hosting services, and the former is covered under the Research-as-a-Service category.\n\n\n-----\n\nHacking-as-a-Service\nIf the budget allows, a budding cybercriminal can skip the process of conducting research, building appropriate tools,\nand developing an infrastructure to launch a cyberattack by choosing a service that will outsource the entire process.\n\nPassword cracking services\n\nThere are a multitude of services available within the Hacking-as-a-Service category. The following examples illustrate\nhow little technical knowledge is required for buyers try their hand at cybercrime. Figure 11 illustrates a service that makes\nit easy for a buyer to retrieve an email password—with no technical expertise. In this example, all that is required is the\nemail address and name of the target. After that, all that remains to be done is enter the password and pay for the service.\n\nFigure 11. Need an email password? It’s as simple as providing address, name, and payment.\n\n\n-----\n\nWhat is really surprising is that the service providers remind their buyers about the junk (bulk) email folder. Such a simple\nreminder illustrates how the level of technical expertise required for this new breed of cybercriminal is incredibly low.\n\nDenial-of-service\n\nMuch of the press has been awash with stories of hacktivists bringing down large companies with sophisticated hacking\ntechniques. The reality is very different. Although many attacks may be sophisticated, many of them are simply DoS\nattacks (or distributed denial-of-service [DDos] attacks). These DoS services aim to send a huge volume of traffic to the\nvictim and prevent them from conducting normal business operations.\n\nBuilding a cyberarmy capable of generating enough traffic does, at the very least, require an investment in time that\nthe would-be cybercriminal may not have. Fortunately for them (and unfortunately for the rest of us), the “as-a-service”\ncybercrime market is there to help. Figure 12 shows the price list for a “Cheap Professional DDOS Service.” This service\nsimply requires attackers to inform the service of which site they wish to launch a DDoS attack against, decide how\nmuch they are willing to pay, and then initiate the service.\n\nFigure 12. This service offers to launch a DoS attack for a very low price.\n\n\n-----\n\nWhat may surprise many of us is the low cost of the service. This may demystify the sophisticated portrayal of today’s\nhacker. For only $2 per hour, an attack can be launched against the systems of the buyer’s choosing. What is particularly\ninteresting is the comment about not providing any refunds. Outside of cybercrime, is there any other criminal activity in\nwhich the company that knowingly facilitates the crime feels the need to remind their customers that there are no refunds?\n\nCredit card information\n\nMany services offer credit card information. In many cases, they offer considerable flexibility and varying price models\nbased upon the information sold. An example of prices are depicted in Table 2.\n\nTable 2. Prices for stolen credit card numbers.\n\nEstimate of Prices (without PIN, with PIN, PIN and good balance)\nDumps\n\nUS EU CA, AU Asia\n\nVisa Classic $15 $80 $40 $150 $25 $150 $50 $150\n\nMaster Card Standard $90 $140 $150 $140\n\nVisa Gold/Premier $25 $100 $200 $45 $160 $250 $30 $160 $55 $150\n\nVisa Platinum $30 $110 $50 $170 $35 $170 $60 $170\n\nBusiness/Corporate $40 $130 $60 $170 $45 $175 $70 $170\n\nPurchasing/Signature $50 $120 $70 $55 $80\n\nInfinite $130 $190 $60 $200 $190\n\nMaster Card World $140\n\nAMEX $40 $60 $45 $70\n\nAMEX Gold $70 $90 $75 $100\n\nAMEX Platinum $50\n\nThe “Dumps” in Table 2 refer to the information that is copied from the magnetic stripe on the back of credit and debit\ncards. The information includes two tracks of data on the magnetic stripe. Track 1 is alphanumeric and contains the name\nof the customer and the account number. Track 2 is numeric and contains the account number, expiration date, the secure\ncode (CVV), and discretionary institution data. A third track is rarely used. This is graphically represented in Figure 13.\n\nTrack 1\n\nTrack 2\n\nTrack 3\n\nFigure 13. Credit card track data.\n\n|Dumps|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n||US|EU|CA, AU|Asia|\n|Visa Classic Master Card Standard Visa Gold/Premier Visa Platinum Business/Corporate Purchasing/Signature Infniite Master Card World AMEX AMEX Gold AMEX Platinum|$15 $80 $90 $25 $100 $200 $30 $110 $40 $130 $50 $120 $140 $40 $70 $50|$40 $150 $140 $45 $160 $250 $50 $170 $60 $170 $70 $130 $190 $60 $90|$25 $150 $150 $30 $160 $35 $170 $45 $175 $55 $60 $200 $45 $75|$50 $150 $140 $55 $150 $60 $170 $70 $170 $80 $190 $70 $100|\n\n\n-----\n\nCredit card information is valuable to would-be criminals, but there are also considerably more types of financial\ninformation that support attacks. For example, also available are the login credentials for online banking. An example\nof the pricing structure for this type of information is depicted in Table 3.\n\nTable 3. Stolen bank login information commands a higher price than credit card numbers.\n\nType of Login Prices\n\nUS bank with fullz info 2% of balance\n\nEU bank with fullz 4–6% of balance\n\nPayPal, Moneybookers, Netteier verified 6–20% of balance\n\nWestern Union transfer 10% from amount\n\nConclusion\nThis white paper offers a view into the reality and size of the cybercrime market. Entire books have been dedicated to\nproviding insights into how hackers have profited from individual services within these broad categories, and there are\nmany other services that have not been included in this paper.\n\nAny paper that purports to be an exhaustive summary of services available on the underground market is likely to be out\nof date even before the author clicks “save.” This report offers readers a snapshot of the cybercrime market and how its\nservices-based nature supports new entrants who do not require technical expertise. All that the modern cybercriminal\nneeds to provide Cybercrime as-a-Service is a means with a payment method. We are witnessing the emergence of a\nwhole new breed of cybercriminal. As a result, the volume of cyberattacks is likely to increase, and current trends and\ndata suggest that this is exactly what we are seeing today.\n\nAbout the Authors\n\nRaj Samani\n\nRaj Samani is an active member of the information security industry through his involvement with numerous initiatives to\nimprove the awareness and application of security in business and society. He is currently serving as the vice-president and\nchief technology officer for McAfee, EMEA, having previously worked as chief information security officer for a large public\nsector organization in the UK. He was recently inducted into the Infosecurity Europe Hall of Fame (2012).\n\nSamani has worked across numerous public sector organizations in many cybersecurity and research-orientated working\ngroups across Europe, including the Midata Interoperability Board, as well as representing DIGITALEUROPE on the Smart\nGrids Reference Group, which was established by the European Commission in support of the Smart Grid Mandate.\nHe is the author of the recently released Syngress book, Applied Cyber Security and the Smart Grid.\n\nIn addition, Samani is currently the Cloud Security Alliance’s strategic advisor for EMEA, having previously served as the\nvice president for communications in the ISSA UK Chapter, where he presided over the award of Chapter Communications\nProgramme of the Year 2008 and 2009. He is also on the advisory council for the Infosecurity Europe show, Infosecurity\n_Magazine, an expert on both searchsecurity.co.uk and the Infosec portal, and regular columnist for Computer Weekly._\nHe has had numerous security papers published and appeared on television (ITV and More4) commenting on computer\nsecurity issues. He has also provided assistance in the 2006 RSA Wireless Security Survey and part of the consultation\ncommittee for the RIPA Bill (Part 3).\n\n[You can follow Raj Samani on Twitter at http://twitter.com/Raj_Samani.](http://twitter.com/Raj_Samani)\n\nFrançois Paget\n\nFrançois Paget is one of the founding members of the McAfee Avert group (now McAfee Labs). He has worked there since\n1993. In Europe, over a 12-year period, he was in charge of analyzing new threats, identifying them, and making modules\navailable for detecting and eliminating them. His main responsibility was researching new generic and heuristic detection\nmethods for 32-bit Microsoft Windows environments. Today, Paget conducts a variety of forecast studies and performs\ntechnological monitoring for his company and some of their clients. He focuses particularly on the various aspects of\norganized cybercrime and the malicious use of Internet for geopolitical purposes. Paget is active in various partnership\nactions with French and international authorities involved in fighting cybercrime.\n\n\n-----\n\nIn 1991, he was the leader of the “Virus Group” within CLUSIF (Club de la Sécurité de l’Information Français [French\nInformation Security Club]). As the Secretary-General of this association, Paget is currently involved with their “Threats”\nteam as well as the annual cybercrime overview.\n\nHe is a regular conference speaker at various French and international events in this field. In 2006, Paget published a\nreference work through DUNOD, addressing the current set of malware problems. He is also a contributor for several\ncollective works related to information system security.\n\n[http://blogs.mcafee.com/author/Francois-Paget](http://blogs.mcafee.com/author/Francois-Paget)\n\nAbout McAfee Labs\n\nMcAfee Labs is the global research team of McAfee. With the only research organization devoted to all threat vectors—\nmalware, web, email, network, and vulnerabilities—McAfee Labs gathers intelligence from its millions of sensors and\nits cloud-based service McAfee Global Threat Intelligence.[™] The McAfee Labs team of 500 multidisciplinary researchers\nin 30 countries follows the complete range of threats in real time, identifying application vulnerabilities, analyzing and\n[correlating risks, and enabling instant remediation to protect enterprises and the public. http://www.mcafee.com/labs](http://www.mcafee.com/labs)\n\nAbout McAfee\n\nMcAfee, a wholly owned subsidiary of Intel Corporation (NASDAQ:INTC), is the world’s largest dedicated security\ntechnology company. McAfee delivers proactive and proven solutions and services that help secure systems, networks,\nand mobile devices around the world, allowing users to safely connect to the Internet, browse, and shop the web more\nsecurely. Backed by its unrivalled global threat intelligence, McAfee creates innovative products that empower home users,\nbusinesses, the public sector, and service providers by enabling them to prove compliance with regulations, protect data,\nprevent disruptions, identify vulnerabilities, and continuously monitor and improve their security. McAfee is relentlessly\n[focused on constantly finding new ways to keep our customers safe. http://www.mcafee.com](http://www.mcafee.com)\n\n[1 http://www.telegraph.co.uk/finance/personalfinance/consumertips/9579167/UK-worst-in-Europe-for-identity-fraud.html](http://www.telegraph.co.uk/finance/personalfinance/consumertips/9579167/UK-worst-in-Europe-for-identity-fraud.html)\n\n[2 http://www.wmbfnews.com/story/20972727/robberies-decrease-as-cyber-crime-increases-fbi-says](http://www.wmbfnews.com/story/20972727/robberies-decrease-as-cyber-crime-increases-fbi-says)\n\n[3 http://www.forbes.com/sites/andygreenberg/2012/03/23/shopping-for-zero-days-an-price-list-for-hackers-secret-software-exploits/](http://www.forbes.com/sites/andygreenberg/2012/03/23/shopping-for-zero-days-an-price-list-for-hackers-secret-software-exploits/)\n\n[4 http://weis2007.econinfosec.org/papers/29.pdf](http://weis2007.econinfosec.org/papers/29.pdf)\n\n[5 http://www.crn.com/news/security/172900859/summers-zotob-attack-cost-companies-100k-each-in-cleanup.htm](http://www.crn.com/news/security/172900859/summers-zotob-attack-cost-companies-100k-each-in-cleanup.htm)\n\n\n2821 Mission College Boulevard\nSanta Clara CA 95054\n\n\nMcAfee, the McAfee logo, and McAfee Global Threat Intelligence are registered trademarks or trademarks of McAfee, Inc. or its subsidiaries in\nthe United States and other countries Other marks and brands may be claimed as the property of others The product plans specifications and\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/McAfee - Cybercrime Exposed - Cybercrime as a Service.pdf"
    ],
    "report_names": [
        "McAfee - Cybercrime Exposed - Cybercrime as a Service.pdf"
    ],
    "threat_actors": [
        {
            "id": "33f527a5-a5da-496a-a48c-7807cc858c3e",
            "created_at": "2022-10-25T15:50:23.803657Z",
            "updated_at": "2025-03-27T02:00:55.550132Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "PLATINUM"
            ],
            "source_name": "MITRE:PLATINUM",
            "tools": [
                "JPIN",
                "Dipsind",
                "adbupd"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7d8ef10e-1d7b-49a0-ab6e-f1dae465a1a4",
            "created_at": "2023-01-06T13:46:38.595679Z",
            "updated_at": "2025-03-27T02:00:02.869216Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "TwoForOne",
                "G0068",
                "ATK33"
            ],
            "source_name": "MISPGALAXY:PLATINUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e61c46f7-88a1-421a-9fed-0cfe2eeb820a",
            "created_at": "2022-10-25T16:07:24.061767Z",
            "updated_at": "2025-03-27T02:02:10.094583Z",
            "deleted_at": null,
            "main_name": "Platinum",
            "aliases": [
                "ATK 33",
                "Operation EasternRoppels",
                "TwoForOne"
            ],
            "source_name": "ETDA:Platinum",
            "tools": [
                "AMTsol",
                "Adupib",
                "Adupihan",
                "Dipsind",
                "DvDupdate.dll",
                "JPIN",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "RedPepper",
                "RedSalt",
                "Titanium",
                "adbupd",
                "psinstrc.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535793,
    "ts_updated_at": 1743041556,
    "ts_creation_date": 1367422954,
    "ts_modification_date": 1367447984,
    "files": {
        "pdf": "https://archive.orkl.eu/a14bc6de67780890e7eecc15e943e306010233ad.pdf",
        "text": "https://archive.orkl.eu/a14bc6de67780890e7eecc15e943e306010233ad.txt",
        "img": "https://archive.orkl.eu/a14bc6de67780890e7eecc15e943e306010233ad.jpg"
    }
}