{
    "id": "5aa0df73-e6ef-4a90-bbfe-d62acf3f41b6",
    "created_at": "2023-01-12T15:03:46.865354Z",
    "updated_at": "2025-03-27T02:05:19.625468Z",
    "deleted_at": null,
    "sha1_hash": "693cdb8b31ff70127d86a18882a1d88a1b491003",
    "title": "2022-03-31 - Meet BlackGuard- a new infostealer peddled on Russian hacker forums",
    "authors": "",
    "file_creation_date": "2022-05-28T17:09:15Z",
    "file_modification_date": "2022-05-28T17:09:15Z",
    "file_size": 444046,
    "plain_text": "# Meet BlackGuard: a new infostealer peddled on Russian hacker forums\n\n**zdnet.com/article/meet-blackguard-a-new-infostealer-peddled-on-russian-hacker-forums/**\n\n[Home Innovation Security](https://www.zdnet.com/)\nSophisticated, but potentially cheap.\n\nWritten by Charlie Osborne, Contributor on March 31, 2022\n\nResearchers have uncovered a new infostealer malware being peddled in Russian underground forums.\n\n[Dubbed BlackGuard, zScaler says that the new malware strain is \"sophisticated\" and has been made available to criminal buyers for a monthly](https://www.zscaler.com/blogs/security-research/analysis-blackguard-new-info-stealer-malware-being-sold-russian-hacking)\nprice of $200.\n\nInfostealers are forms of malware designed to harvest valuable data, potentially including operating system information, contact lists,\nscreenshots, network traffic, and online account credentials including those used to access financial services and banking.\n\nA range of malicious software and exploit kits are sold every day underground, some of which are purchased outright. In contrast, others are\noffered on a malware-as-a-service (MaaS) basis: subscribers pay on a weekly, monthly, or yearly basis, and the developer keeps their\nmalicious creations updated in return.\n\nPerhaps to build a customer base for this malware, or to generate cash quickly, BlackGuard is also being sold for $700 in return for a lifetime\nsubscription.\n\n\n-----\n\nscreenshot 2022 03 31 at 14 30 11.png\n\n\nzScaler\nAccording to the cybersecurity researchers, BlackGuard can steal information, including saved browser credentials and history, email client\ndata, FTP accounts, autofill content, conversations in messenger software, cryptocurrency credentials, and other account information.\nMessengers targeted include Telegram, Signal, Tox, Element, and Discord.\n\n## Security\n\n\n-----\n\n### Cyber security 101: Protect your privacy from hackers, spies, and the government\n\nSimple steps can make the difference between losing your online accounts or maintaining what is now a precious commodity: Your privacy.\n\nRead now\nWhen it comes to cryptocurrency theft, the malware will target files such as wallet.dat that may contain wallet addresses and private keys.\nBlackGuard may also go after Chrome and Edge cryptocurrency wallet browser extensions.\n\nWritten in .NET, the infostealer is still in active development but is already equipped with a crypto-based packer, base64 decoding, obfuscation,\nand antibugging capabilities to make reverse-engineering more difficult.\n\nOnce it lands on a vulnerable machine, the malware will also check the operating system's processes and will try to stop any activities related\nto antivirus software or sandboxing.\n\nThe infostealer is also selective when it comes to its targets. For example, the malware will exit if the OS appears to be located in a CIS\ncountry, such as Russia, Belarus, or Azerbaijan.\n\nIf an exit isn't necessary, the infostealer then grabs all of the information it can, packages it up into a .zip archive, and sends it to a commandand-control (C2) server through a POST request.\n\n\"While applications of BlackGuard are not as broad as other stealers, BlackGuard is a growing threat as it continues to be improved and is\ndeveloping a strong reputation in the underground community,\" the researchers say.\n\nInfostealers can be used on their own or packaged up with other forms of malware, such as Trojans or ransomware variants.\n\n[In other malware news, researchers from Aqua Security have recently uncovered a new strain of ransomware designed to target Jupyter](https://www.zdnet.com/article/this-new-ransomware-targets-data-visualization-tool-jupyter-notebook/)\nNotebook environments.\n\n### Previous and related coverage\n\n**Have a tip? Get in touch securely via WhatsApp | Signal at +447713 025 499, or over at Keybase: charlie0**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-31 - Meet BlackGuard- a new infostealer peddled on Russian hacker forums.pdf"
    ],
    "report_names": [
        "2022-03-31 - Meet BlackGuard- a new infostealer peddled on Russian hacker forums.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535826,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653757755,
    "ts_modification_date": 1653757755,
    "files": {
        "pdf": "https://archive.orkl.eu/693cdb8b31ff70127d86a18882a1d88a1b491003.pdf",
        "text": "https://archive.orkl.eu/693cdb8b31ff70127d86a18882a1d88a1b491003.txt",
        "img": "https://archive.orkl.eu/693cdb8b31ff70127d86a18882a1d88a1b491003.jpg"
    }
}