{
    "id": "5adc6471-a4d0-4d9b-8988-0b09743ae69d",
    "created_at": "2023-01-12T15:05:58.530399Z",
    "updated_at": "2025-03-27T02:08:40.58733Z",
    "deleted_at": null,
    "sha1_hash": "1fcf13d5ffdb9ce62a6c4eebba983eb5ae8ed04a",
    "title": "2022-09-05 - EvilProxy Phishing-As-A-Service With MFA Bypass Emerged In Dark Web",
    "authors": "",
    "file_creation_date": "2022-10-02T12:13:06Z",
    "file_modification_date": "2022-10-02T12:13:06Z",
    "file_size": 2038325,
    "plain_text": "# EvilProxy Phishing-as-a-Service with MFA Bypass Emerged in Dark Web\n\n**[resecurity.com/blog/article/evilproxy-phishing-as-a-service-with-mfa-bypass-emerged-in-dark-web](https://resecurity.com/blog/article/evilproxy-phishing-as-a-service-with-mfa-bypass-emerged-in-dark-web)**\n\n[Back](https://resecurity.com/blog)\nCybercrime Intelligence\n\n5 Sep 2022\nMFA, Dark Web, Phishing, PhaaS, ATO, BEC, PyPi, supply chain\n\n\n-----\n\nFollowing the recent Twilio hack leading to the leakage of 2FA (OTP) codes, cybercriminals continue to upgrade their attack arsenal\nto orchestrate advanced phishing campaigns targeting users worldwide. Resecurity has recently identified a new Phishing-as-aService (PhaaS) called EvilProxy advertised in the Dark Web. On some sources the alternative name is Moloch, which has some\nconnection to a phishing-kit developed by several notable underground actors who targeted the financial institutions and e-commerce\nsector before.\n\nWhile the incident with Twilio is solely related to the supply chain, cybersecurity risks obviously lead to attacks against downstream\ntargets, the productized underground service like EvilProxy enables threat actors to attack users with enabled MFA on the largest\nscale without the need to hack upstream services.\n\nEvilProxy actors are using Reverse Proxy and Cookie Injection methods to bypass 2FA authentication – proxyfying victim’s\nsession. Previously such methods have been seen in targeted campaigns of APT and cyberespionage groups, however now these\nmethods have been successfully productized in EvilProxy which highlights the significance of growth in attacks against onlineservices and MFA authorization mechanisms.\n\nBased on the ongoing investigation surrounding the result of attacks against multiple employees from Fortune 500 companies,\nResecurity was able to obtain substantial knowledge about EvilProxy including its structure, modules, functions, and the network\ninfrastructure used to conduct malicious activity. Early occurrences of EvilProxy have been initially identified in connection to attacks\nagainst Google and MSFT customers who have MFA enabled on their accounts – either with SMS or Application Token.\n\nThe first mention of EvilProxy was detected early May 2022, this is when the actors running it released a demonstration video\ndetailing how it could be used to deliver advanced phishing links with the intention to compromise consumer accounts belonging to\nmajor brands such as Apple, Facebook, GoDaddy, GitHub, Google, Dropbox, Instagram, Microsoft, Twitter, Yahoo, Yandex\nand others.\n\nNotably, EvilProxy also supports phishing attacks against Python Package Index (PyPi):\n\n[The official software repository for the Python language (Python Package Index (PyPI)) has been recently said (last week) that](http://10.10.0.46/%3Etargeted%20in%20a%20%3Cstrong%3Ecomplex%20supply%20chain%20attack%3C/strong%3E%20that%20appears%20to%20have%20successfully%20poisoned%20at%20least%20two%20legitimate%20projects%20with%20credential-stealing%20malware.%20PyPI%20officials%20%3Ca%20href=)\nproject contributors were subject to a phishing attack that attempted to trick them into divulging their account login credentials. The\nattack leveraged JuiceStealer (as the final payload after the initial compromise) and according to Resecurity's HUNTER team\nfindings - related to EvilProxy actors who added this function not too long before the attack was conducted.\n\nBesides PyPi, the functionality of EvilProxy also supports GitHub and npmjs (widely used JavaScript Package Manager by over 11\nmillion developers worldwide) enabling supply chain attacks via advanced phishing campaigns. It's highly likely the actors aim to\ntarget software developers and IT engineers to gain access to their repositories with the end goal to hack \"downstream\" targets.\nThese tactics allow cybercriminals to capitalize on the end users insecurity who assume they're downloading software packages from\nsecure resources and don't expect it to be compromised.\n\n\n-----\n\n## How it works?\n\nEvilProxy uses the “Reverse Proxy” principle. The reverse proxy concept is simple: the bad actors lead victims into a phishing page,\nuse the reverse proxy to fetch all the legitimate content which the user expects including login pages - it sniffs their traffic as it passes\nthrough the proxy. This way they can harvest valid session cookies and bypass the need to authenticate with usernames, passwords\nand/or 2FA tokens.\n\nResecurity has acquired videos released by EvilProxy actors demonstrating how it can be used to steal the victim’s session and\nsuccessfully go through Microsoft 2FA and Google e-mail services to gain access to the target account.\n\n## Google 2FA\n\n Microsft 2FA\n\nEvilProxy is offered on a subscription base, when the end user (a cybercriminal) chooses a service of interest to target (e.g.,\nFacebook or Linkedin), the activation will be for a specific period of time (10, 20 or 31 days as per the plans description which was\npublished by the actors on multiple Dark Web forums). One of the key actors - John_Malkovich, acting as administrator to vet new\ncustomers. The service is represented on all major underground communities including XSS, Exploit and Breached.\n\n\n-----\n\nThe payment for EvilProxy is organized manually via an operator on Telegram. Once the funds for the subscription are received, they\nwill deposit to the account in customer portal hosted in TOR. The kit is available for $400 per month in the Dark Web hosted in TOR\nnetwork.\n\nThe portal of EvilProxy contains multiple tutorials and interactive videos regarding the use of the service and configuration tips. Being\nfrank – the bad actors did a great job in terms of the service usability, and configurability of new campaigns, traffic flows, and data\ncollection.\n\n\n-----\n\nAfter activation, the operator will be asked to provide SSH credentials to further deploy a Docker container and a set of scripts. This\n[approach has also been used in other Phaas service called \"Frappo\" which was identified by Resecurity this year. The automated](https://resecurity.com/blog/article/welcome-frappo-the-new-phishing-as-a-service-used-by-cybercriminals-to-attack-customers-of-major-financial-institutions-and-online-retailers)\ninstaller has a reference to a user \"Olf Dobs\" (ksh8h297aydO) on Gitlab:\n\n_apt update -qqy && apt dist-upgrade --no-install-recommends --no-install-suggests -o Dpkg::options::=\"--force-confdef\" -y \\ && apt_\n_install --no-install-recommends --no-install-suggests -y git \\ && rm -rf /srv/control-agent && git clone --recurse-submodules_\n_[https://gitlab.com/ksh8h297ayd0/docker-control-agent.git /srv/control-agent \\ && cd /srv/control-agent && chmod +x ./install.sh \\ &&](https://gitlab.com/ksh8h297ayd0/docker-control-agent.git)_\n_/srv/control-agent/install.sh '[license_key]' ===*=_\n\nAfter a successful deployment, the scripts will forward the traffic from the victims via 2 gateways defined as \"upstream\":\n\nBased on further analysis, we identified some of the domain names used for phishing campaigns. The bad actors register similar (by\nspelling) domains with the intention of masking them under legitimate online-services.\n\nSome of the links generated by EvilProxy to impersonate Microsoft E-Mail services are provided below:\n\n**Login Phishing URL**\n```\nhttps://lmo.msdnmail[.]net/common/oauth2/v2.0/authorize?client_id=4765445b-32c6-49b0-83e61d93765276ca&redirect_uri=https%3A%2Fopenid%20profile%20https%3\nA%2F%2Fwwwofc.msdnmail.net%2Fv2%2FOfficeHome.All&response_mode=form_post&nonce=637975588496970710\n.Zjg3YzFkMmEtYTUxYy00NDliLWEzYzAtMTExZTliNjBkY2ZkY2U3NzM2MDMtZWNhZC00ZWFmLWE5YjMtYzgzZTFjM2E1ZDdl&ui_locales=enUS&mkt=en-US&state=jHi-CP0Nu4oFHIxklcT1adstnCWbwJwuXQWTxNSSsw-23qiXK-6EzyYoAyNZ6rHuHwsIYSkRp99FbqPqhN4JVCnT4-3MQIDvdTKapKarcqaMFi6_xv2__3D0KfqBQ070ykGBGlwxFQ6Mzt9CwUsz2zdgcB4jFux2BhZQwcj-WumSBz0VQs5VePVwz00E8rDxEXfQdlv-AT29EwdG77AmGWinyf3yQXSZTHJyo8s-IWSHoly3Kbturwnc87sDC3uwEn6VDIjKbbaJ-c-WOzrg&x-clientSKU=ID_NETSTANDARD2_0&x-client-ver=6.16.0.0\n\n```\n**Post-Authorization URL**\n```\nhttps://473126b6-bf9a-4a96-8111-fb04f6631ad8-571c4b21.msdnmail[.]net/mail/?realm=\n[victim_domain]&exsvurl=1&ll-cc=1033&modurl=0&JitExp=1&url=%2Fowa%2F%3Frealm%253d%2526exsvurl%253d1%2526llcc%253d1033%2526modurl%253d0%2526login_hint%253[victim_email]%252540[victim_domain]\n\n```\n\n-----\n\nThe bad actors are using multiple techniques and approaches to recognize victims and to protect the phishing-kit code from being\ndetected. Like fraud prevention and cyber threat intelligence (CTI) solutions, they aggregate data about known VPN services,\n**Proxies, TOR exit nodes and other hosts which may be used for IP reputation analysis (of potential victims). In the case they**\nsuspect a bot or researcher, they drop the connection or redirect it to a specific host (for example, ‘brave.com’).\n\nAnother approach which has been identified is based on fingerprints.\n\nThe bad actors are especially diligent when it comes to detecting possible virtual machines, typically used by security analysts to\nresearch malicious content and clients connecting via RDP (Remote Desktop Protocol):\n\n\n-----\n\n## Significance\n\nWhile the sale of EvilProxy requires vetting, cybercriminals now have a cost-effective and scalable solution to perform advanced\nphishing attacks to compromise consumers of popular online services with enabled MFA. The appearance of such services in Dark\nWeb will lead to a significant increase in ATO/BEC activity and cyberattacks targeting the identity of the end users, where MFA may\nbe easily bypassed with the help of tools like EvilProxy.\n\n## IOC:\n\nResecurity’s HUNTER team collected the following domain names and URLs related to the EvilProxy\ninfrastructure. Some of these\nhosts were mapped as a result of post-incident response engagement\nwith the affected victims from Fortune 500 companies and\nconsumers of popular online-services.\nWhile the operations of bad actors are extremely dynamic, the information about these hosts\nmay help\ncybersecurity researchers and incident responders detect and attribute possible malicious\nactivity to EvilProxy\nwhen investigating incidents affecting MFA (2FA).\n\n147[.]78[.]47[.]250\n185[.]158[.]251[.]169\n194[.]76[.]226[.]166\nmsdnmail[.]net\nevilproxy[.]pro\ntop-cyber[.]club\nrproxy[.]io\nlogin-live.rproxy[.]io\ngw1.usd0182738s80[.]click:9000\ngw2.usd0182738s80[.]click:9000\n\ncpanel.evilproxy[.]pro\ncpanel.pua75npooc4ekrkkppdglaleftn5mi2hxsunz5uuup6uxqmen4deepyd[.]onion\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-05 - EvilProxy Phishing-As-A-Service With MFA Bypass Emerged In Dark Web.pdf"
    ],
    "report_names": [
        "2022-09-05 - EvilProxy Phishing-As-A-Service With MFA Bypass Emerged In Dark Web.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535958,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1664712786,
    "ts_modification_date": 1664712786,
    "files": {
        "pdf": "https://archive.orkl.eu/1fcf13d5ffdb9ce62a6c4eebba983eb5ae8ed04a.pdf",
        "text": "https://archive.orkl.eu/1fcf13d5ffdb9ce62a6c4eebba983eb5ae8ed04a.txt",
        "img": "https://archive.orkl.eu/1fcf13d5ffdb9ce62a6c4eebba983eb5ae8ed04a.jpg"
    }
}