{
    "id": "5ae235b9-705f-4aa9-b368-9b39b221ab6e",
    "created_at": "2023-01-12T15:07:49.290687Z",
    "updated_at": "2025-03-27T02:05:48.276072Z",
    "deleted_at": null,
    "sha1_hash": "1533d4f586716fd03d57e6fdbd8adf7159c40229",
    "title": "2016-08-22 - VB Dropper and Shellcode for Hancitor Reveal New Techniques Behind Uptick",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 85831,
    "plain_text": "# ICS-CERT TECHNICAL INFORMATION PAPER\n\nICS-TIP-12-146-01A—TARGETED CYBER INTRUSION DETECTION AND\nMITIGATION STRATEGIES\n\n**UPDATE A**\n\nJuly 19, 2012\n\n\n**OVERVIEW**\n\n\nSophisticated and targeted cyber intrusions against owners and operators of industrial control\nsystems across multiple critical infrastructure sectors have increased in recent months.\nICS-CERT developed the following guidance to provide basic recommendations for owners and\noperators of critical infrastructure to mitigate the impacts of cyber attacks and enhance their\nnetwork security posture.\n\nThis guidance applies to organizations whose networks have been compromised by a cyber\nattack as well as to those desiring to improve their network security preparedness to respond to a\ncyber incident. The guidance is relevant to both enterprise and control system networks,\nparticularly where interconnectivity could allow adversaries to move laterally within and\nbetween networks. ICS-CERT reminds organizations to perform proper impact analysis and risk\nassessment prior to implementing defensive measures to avoid any negative impact to normal\noperations.\n\nThe guidance is organized into several topical areas and provides network administrators with\nconcepts for improving detection of intrusions, preventing lateral movement of threat actors, and\ncontrolling access to the various segments of a network. The guidance is in the form of “what”\nshould be done and “why” it is important. The “how” of implementation is the responsibility of\neach organization and is dependent on individual needs, network topology, and operational\nrequirements.\n\n\n**GUIDANCE AND RECOMMENDED PRACTICES**\n\n\nThe impacts of a cyber intrusion will likely be different for every organization depending on the\nnature of the compromise and the organization’s capabilities to respond. Each organization must\nassess its particular situation, identify the criticality of the impacted devices, and develop a\nprioritized course of action. Unfortunately, a simple and prescriptive remedy that can be applied\nuniformly to every organization does not exist. However, basic principles and recommendations\nexist that are essential to maintaining a sound network security posture and that will provide the\nnecessary capabilities to respond to an incident.\n\nICS-TIP-12-146-01A Page 1 of 10\n\n\n-----\n\nOrganizations that suspect a compromise should first consider how to preserve forensic data and\nstop movement of the intruder through the network. While the tendency might be to first find and\neliminate the intruder, unless adequate steps are taken to preserve data and prevent lateral\nmovement, the recovery processes will not likely be successful. Also, while disconnecting\ncompromised workstations from the network is important, unless the data that are essential to\nidentifying the intruder are preserved, future detection will be more challenging. Therefore, the\nguidance listed in the Preserving Forensic Data and Credential Management sections below\nshould be considered primary actions to help mitigate the spread of compromise through a\nnetwork.\n\nAlso, the need for intrusion detection capabilities cannot be overstated. The ability to detect and\nidentify the source and analyze the extent of a compromise is crucial to rapid incident response,\nminimizing loss, mitigating exploited weaknesses, and restoring services. Early detection of an\nincident can limit or even prevent possible damage to control systems and reduces the level of\neffort required to contain, eradicate, and restore affected systems. Auditing and logging, with\nhost-level Domain Name Service (DNS) resolution capabilities, are essential for improving\ndetection and determining the depth and breadth of any compromise.\n\nNetwork segmentation, role-based access control, and application whitelisting are additional\nconcepts discussed in this guidance, which will provide a defensive posture to prevent intruders\nfrom moving within a network. These techniques can be more challenging to implement but will\nprovide long-term value.\n\n\nPRESERVE FORENSIC DATA\n\n\nPreserving forensic data is an essential aspect of any incident response plan. The forensic data\nacquired during the overall incident response process are critical to containing the current\nintrusion and improving security to defend against the next attack. An organization’s network\ndefenders should make note of the following recommendations for retention of essential forensic\ndata:\n\n- Keep detailed notes of all observations, including dates/times, mitigation steps taken/not\ntaken, device logging enabled/disabled, and machine names for suspected compromised\nequipment. More information is generally better than less information.\n\n- When possible, capture live system data (i.e., current network connections and open\nprocesses) prior to disconnecting a compromised machine from the network.\n\n- Capture a forensic image of the system memory prior to powering down the system.\n\nICS-TIP-12-146-01A Page 2 of 10\n\n\n-----\n\n- When powering down a system, physically pull the plug from the wall rather than gracefully\nshutting down. Forensic data can be destroyed if the operating system (OS) executes a\nnormal shut down process.\n\n- After shutting down, capture forensic images of the host hard drives.\n\n- Avoid running any antivirus software “after the fact” as the antivirus scan changes critical\nfile dates and impedes discovery and analysis of suspected malicious files and timelines.\n\n- Avoid making any changes to the OS or hardware, including updates and patches, as they\nmight overwrite important information relevant to the analysis. Organizations should consult\nwith trained forensic investigators for advice and assistance prior to implementing any\nrecovery or forensic efforts.\n\nWhen a compromised host is identified, it should be removed from the network for forensic data\ncollection (but not powered off, as noted above). When all available data have been retained\nfrom the infected host, the organization should follow established internal policies for recovering\nthe host.\n\nIf an organization does not have an adequate incident response plan or the necessary staff to\nhandle a serious cyber incident, it should consult trained forensic investigators to assist with\ndeveloping a response plan and implementing recovery efforts.\n\nControl system environments have special needs that must be evaluated when establishing a\ncyber incident response plan. ICS-CERT recommends a review of the CSSP Recommended\nPractice: Creating Cyber Forensics Plans for Control Systems.[a]\n\n\nCREDENTIAL MANAGEMENT\n\n\n--------- Begin Update A Part 1 of 1 -------\nProtecting logon credentials for network hosts is an important consideration when defending a\nnetwork against lateral movement by an intruder. Common tactics employed by attackers to\ncompromise these credentials are brute force cracking of the password hash and a technique\nreferred to as “pass-the-hash.” Brute force cracking requires the attacker to “guess” the original\npassword by systematically hashing and comparing the result of possible passwords. When a\nmatch is found, then a usable password has been identified. This process is greatly expedited\nthrough the use of “rainbow tables,” or large tables of precomputed hashes. The pass-the-hash\ntechnique involves using cached password hashes extracted from a victim machine’s memory or\n\na. Recommended Practice: Creating Cyber Forensics Plans for Control Systems (2008),\nhttp://www.uscert.gov/control_systems/pdf/Forensics_RP.pdf, Web site last accessed July 19, 2012.\n\nICS-TIP-12-146-01A Page 3 of 10\n\n\n-----\n\nlocal disk to gain access to additional machines in the domain. The following list describes\nmitigation techniques that serve to reduce the possible vectors that attackers can use to\ncompromise these credentials and/or reduce the locations that the stolen credential can be used to\nspread through the network. Administrators should evaluate each of these techniques and\npossible side-effects of implementing them before making any changes to systems.\n\n- Proper Permission Management\n\na. Careful consideration should be given to the decision of granting users administrative\nrights to their own machines. When executing processes, such as Web browsing or\nreading email as an administrator, the machine is at greater risk of being compromised\nand losing control of its cached credentials.\nb. Domain Administrators’ accounts should not log in to any system other than domain\ncontrollers. Exceptions should be handled through the creation of temporary accounts that\nare removed after completing the intended task, or through the use of designated\nmanagement machines that are not Internet connected.[b] Also, Domain Administrators\nshould avoid using tools that require interactive logons (e.g., remote desktop) and should\ninstead use remote console tools. This will reduce the likelihood that the administrator’s\ncredentials will be stored in memory.[c]\nc. Restrict the use of the SeDebugPrivilege privilege to those users that actually need it.\nThis privilege can be used to perform DLL injection, a technique used by the majority of\nthe pass-the-hash tools and other malware. By default, this is assigned to the\nAdministrators group but should really be more restricted than this. Create a specific\ndebug user, and assign this account the right to use the privilege via the “run as”\ncommand, thereby gaining temporary privilege escalation.[d]\n\n- Network/System Design and Policies\n\na. Take the principle of Internet, DMZ, and intranet zones and apply it throughout the\nnetwork to isolate different trust sectors. There is usually little reason for one workstation\nto talk to another workstation, or for it to talk to all the servers. Using infrastructure\ndevices and software to create security zones that group users needing to communicate\n\nb. http://www.sans.org/reading_room/whitepapers/testing/pass-the-hash-attacks-tools-mitigation_33283, Web site\naccessed on July 19, 2012.\n\nc. http://www.infoworld.com/d/security/the-two-most-feared-attacks-and-how-avoid-them-196351, Web site\naccessed on July 19, 2012.\n\nd. http://www.sans.org/reading_room/whitepapers/testing/crack-pass-hash_33219, Web site accessed on\nJuly 19, 2012.\n\nICS-TIP-12-146-01A Page 4 of 10\n\n\n-----\n\nwith each other, helps to slow or prevent lateral movement throughout the rest of the\nnetwork.[e]\nb. Change the number of cached credentials being stored by Windows to “0” for everything\nbut mobile devices (e.g., laptops). This reduces the number of credentials at risk of being\nstolen and cracked, but may prevent domain logins in the event that a domain controller\nis not available (local user accounts can still be used). Mobile devices should reduce the\nnumber of cached credentials to as few as possible (e.g., 1 or 2). Mobile devices will still\nrequire cached credentials, because it is likely that mobile device users will be attempting\nto log in when a domain controller is unavailable (e.g., working outside the office).\n\ni. **Note: After credential caching has been disabled, an enterprise wide password reset**\nshould be implemented. If a password reset is done first, the new credentials will be\ncached and will continue to be at risk. Therefore, resetting passwords after disabling\ncredential caching will ensure that the old passwords are no longer valid, and the new\npasswords are not stored locally.\n\nc. If using a common baseline image to load company workstations, caution should be\nexercised if active local user accounts are present on the machine. Because all images\nwill share the same password, this is especially damaging if the local administrator\naccounts have not been disabled. With these common credentials, an attacker could\nquickly compromise all the machines loaded with this image. For this reason, IT\nadministrators should consider disabling or removing local machine accounts or at least,\nensure that local accounts across the network have unique passwords.[f]\nd. Require that all machines be rebooted immediately after being used by a privileged user.\nThis clears the user’s credentials from memory, a common place that pass-the-hash tools\ntarget.[g]\ne. ICS-CERT also recommends that organizations move away from using LAN Manager\n(LM) hashes,[h] where possible. LM hashes are inherently weak and can be broken\nrelatively quickly, allowing an adversary to use the actual password instead of relying on\na pass-the-hash attack. Not all companies will be able to make this switch as some legacy\nsystems are incompatible, but every effort should be used to migrate away from these\nsystems in order to increase the networkwide security posture.\n\ne. http://www.infoworld.com/d/security-central/isolated-security-zones-yield-stronger-network-protection403?page=0,1, Web site accessed on July 19, 2012.\n\nf. http://www.nsa.gov/ia/_files/vtechrep/ManageableNetworkPlan.pdf, Web site accessed on July 19, 2012.\n\ng. http://www.infoworld.com/d/security-central/isolated-security-zones-yield-stronger-network-protection403?page=0,1, Web site accessed on July 19, 2012.\n\nh. http://support.microsoft.com/kb/299656, Web site last accessed July 19, 2012.\n\nICS-TIP-12-146-01A Page 5 of 10\n\n\n-----\n\ni. **Note: When switching from credential caching and performing a global password**\nreset, network managers should, at the same time, disable LM hashes to avoid the\nneed for another global password reset when that method of password storage is\ndisabled.\n\nf. Organizations should consider moving to a multi-factor authentication system (e.g.,\nSmartCards) or at least ensure that users choose complex passwords that change\nregularly.\n\n--------- End Update A Part 1 of 1 -------\n\nINCREASE LOGGING CAPABILITIES\n\n\nSystem and network device logs provide valuable records of activities that have occurred. Logs\nmay contain indicators of compromise, command and control (C2) communications, exfiltrated\ndata, remote access logins, and more. The following types of logging should be considered.\n\n- firewall,\n\n- proxy,\n\n- DNS,\n\n- IDS,\n\n- packet captures,\n\n- flow data from routers and switches, and\n\n- host and application logs.\n\n\nDNS LOGGING WITH HOST LEVEL GRANULARITY\n\n\nWhen implementing increased auditing and logging capabilities, organizations should\nparticularly consider enabling host level DNS resolution. Because most malware uses domain\nname-based C2 servers (versus hard coded IP based C2), it is essential for network defenders to\nhave full awareness of DNS requests throughout the enterprise. ICS-CERT recommends that\norganizations deploy host level granularity in DNS logging to give network administrators the\nability to identify which internal host (by hostname or IP address) originated a specific DNS\nrequest and to identify hosts that have connected to malicious domains. This is one of the best\nindicators of compromise.\n\nTo ensure that all DNS resolutions are captured and logged, network administrators should\nensure that all DNS requests go through company DNS servers. In addition, the company servers\nshould only service DNS requests from authorized company hosts.\n\nICS-TIP-12-146-01A Page 6 of 10\n\n\n-----\n\nLogging these data also provides a historical view of when and how the malware has moved\nthrough the network after the initial infection. This information helps to determine the full\nbreadth and depth of the compromise.\n\nRetention of logs is essential since sophisticated threat actors tend to maintain a presence for\nlong periods of time and will often lay dormant for many months. If possible, log retention for a\nyear or two would be ideal and will provide the ability to go back and possibly find the time of\ninitial infection and indictors of a compromise.\n\nIn most configurations, host-level DNS logging is disabled by default and must be specifically\nenabled on authorized DNS resolvers. ICS-CERT recommends that organizations evaluate their\nDNS solution and enable this logging feature.\n\n\nAUDIT NETWORK HOSTS FOR SUSPICIOUS FILES\n\n\nMD5 hashes are digital fingerprints used to identify files. Changing just one byte in a file will\nresult in a different hash. If an MD5 hash is known to belong to a malicious file, any file with a\nmatching hash should be considered malicious, regardless of the filename.\n\nThe ability to perform an enterprise wide host level search for MD5 hashes is a powerful\norganizational tool for incident response. MD5 hashes are among the key indicators that can be\nused to identify the presence of an intruder.\n\nMultiple host-based IDS and forensic tools, as well as plug-ins to enterprise configuration\nmanagement software, offer this functionality.\n\n\nNETWORK SEGMENTATION\n\n\nNetwork segmentation involves separating one large network into smaller functional networks\nusing firewalls, switches, and other similar devices. Effective network segmentation restricts\ncommunication between networks and reduces the extent to which an adversary can move across\nthe network.\n\nOrganizations should decide which departments, applications, services, and assets should reside\non each network segment. Implementation of network segmentation can be a long-term project\nand should include careful planning, implementation, and regular maintenance.\n\nIn an ideal world, the business and control system networks would be physically separated.\nHowever, this is not practical in many situations. In practice, firewalls and data diodes are good\noptions for segmenting networks. A data diode allows only one-way communication between\nnetwork segments and can be used to ensure that network data only flows out of the control\n\nICS-TIP-12-146-01A Page 7 of 10\n\n\n-----\n\nsystems network. Firewalls allow two-way communication between networks and risks of\nexposure if the firewall is not well configured.\n\nThe network should also include one or more demilitarized zone (DMZ) segments grouped by\nfunction such that the attack surface at each segment is minimized. DMZs should include the\norganization’s external services that are exposed to the Internet or any critical systems that are\naccessed from multiple internal network segments. Firewalls should control communication\nbetween DMZs and internal/external hosts.\n\n\nSTRICT ROLE-BASED ACCESS CONTROL\n\n\nRole-based user access control grants or denies access to resources based on job function. Active\nDirectory (AD) implements role-based user access control through group policies. Groups\nprovide logical network segmentation and prevent users from accessing machines that are not\nnecessary for job performance.\n\nOrganizations should define the roles and permissions needed for each group to perform its\nduties. Implementing strict role-based access control allows better auditing and reduces risk by\nminimizing the privileges associated with each group. In addition, this logical network\nsegmentation makes it harder for an adversary to move laterally through the network after the\ninitial intrusion.\n\n\nAPPLICATION WHITELISTING\n\n\nApplication whitelisting permits the execution of explicitly allowed (or whitelisted) software and\nblocks execution of everything else. This eliminates the execution of unknown executables,\nincluding malware.\n\nOne challenge when using application whitelisting in business networks is managing the\nconstantly changing list of allowed applications. That burden is significantly reduced in control\nsystems environments, because the set of applications that run in those systems is essentially\nstatic. ICS-CERT recommends deploying application whitelisting on the control systems and\nbusiness networks wherever applicable. In particular, application whitelisting could be\nappropriate for business servers such as mail servers and domain controllers.\n\n\n**ADDITIONAL RECOMMENDED PRACTICES**\n\n\nICS-CERT recommends that users take the following standard measures to protect themselves\nfrom social engineering attacks.\n\n1. Do not click Web links or open unsolicited attachments in email messages.\n\nICS-TIP-12-146-01A Page 8 of 10\n\n\n-----\n\n2. Refer to Recognizing and Avoiding Email Scams[i] for more information on avoiding email scams.\n\n3. Refer to Avoiding Social Engineering and Phishing Attacks[j] for more information on social\nengineering attacks.\n\nICS-CERT encourages asset owners to take the following additional defensive measures.\n\n- Minimize network exposure for all control system devices. Critical devices should not\ndirectly face the Internet.\n\n- Keep software up to date with a patch management plan.[k]\n\n- Develop, review, and maintain an up-to-date incident response plan.[l]\n\n- Keep patches up to date whenever possible.\n\n- When remote access is required, use secure methods, such as Virtual Private Networks\n(VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) Web page also provides a section for control\nsystems security recommended practices. Several recommended practices are available for\nreading and download, including Improving Industrial Control Systems Cybersecurity with\nDefense-in-Depth Strategies.[m ]ICS-CERT reminds organizations to perform proper impact\nanalysis and risk assessment prior to taking defensive measures.\n\n\n**CONTACTING AND REPORTING TO ICS-CERT**\n\n\nFor any questions related to this report, please contact ICS-CERT at:\n\nEmail: ics-cert@dhs.gov\nToll Free: 1-877-776-7585\nFor CSSP Information and Incident Reporting: www.ics-cert.org\n\ni. Recognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, Web site\nlast accessed July 19, 2012.\n\nj. National Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, Web\nsite last accessed July 19, 2012.\n\nk. Recommended Practice for Patch management of Control Systems, http://www.uscert.gov/control_systems/practices/documents/PatchManagementRecommendedPractice_Final.pdf, Web site last\naccessed July 19, 2012.\n\nl. Developing an ICS Cybersecurity Incident Response plan, http://www.uscert.gov/control_systems/practices/documents/final-RP_ics_cybersecurity_incident_response_100609.pdf, Web site\nlast accessed July 19, 2012.\n\nm. CSSP Recommended Practices, http://www.uscert.gov/control_systems/practices/Recommended_Practices.html, Web site last accessed July 19, 2012.\n\nICS-TIP-12-146-01A Page 9 of 10\n\n\n-----\n\nICS-CERT continuously strives to improve its products and services. You can help by answering\na very short series of questions about this product at the following URL: https://forms.uscert.gov/ncsd-feedback/.\n\nICS-TIP-12-146-01A Page 10 of 10\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Other/DHS - Targeted Cyber Intrusion Detection and Mitigation Strategies.pdf"
    ],
    "report_names": [
        "DHS - Targeted Cyber Intrusion Detection and Mitigation Strategies.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536069,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/1533d4f586716fd03d57e6fdbd8adf7159c40229.pdf",
        "text": "https://archive.orkl.eu/1533d4f586716fd03d57e6fdbd8adf7159c40229.txt",
        "img": "https://archive.orkl.eu/1533d4f586716fd03d57e6fdbd8adf7159c40229.jpg"
    }
}