{
    "id": "5b1fd486-ba52-4a45-9601-9c8bf5882fdb",
    "created_at": "2023-01-12T15:01:55.063569Z",
    "updated_at": "2025-03-27T02:14:38.825272Z",
    "deleted_at": null,
    "sha1_hash": "9433e253d4d966f5006b58ae9225a8f83ac06d1b",
    "title": "2022-09-16 - Recordbreaker- The Resurgence of Raccoon",
    "authors": "",
    "file_creation_date": "2022-11-28T18:54:08Z",
    "file_modification_date": "2022-11-28T18:54:08Z",
    "file_size": 2437731,
    "plain_text": "# Recordbreaker: The Resurgence of Raccoon\n\n**cloudsek.com/recordbreaker-the-resurgence-of-raccoon**\n\nAnandeshwar Unnikrishnan September 16, 2022\n\n**Researcher: Anandeshwar Unnikrishnan**\n**Editors: Suchita Katira & Hansika Saxena**\n\nAn info stealer is malicious software (malware) that seeks to steal private data from a compromised device, including\npasswords, cookies, autofill information from browsers, and cryptocurrency wallet information.\n\nSince the beginning of 2019, the Raccoon malware has been offered as malware-as-a-service on various cybercrime\nforums. The Raccoon Stealer group, however, was disbanded in March 2022 as a result of the death of one of its\nsenior developers in the Ukraine-Russia war.\n\n[In June 2022, a new version of the Raccoon stealer was identified in the wild by the researchers at Sekoia. Initially,](https://blog.sekoia.io/raccoon-stealer-v2-part-1-the-return-of-the-dead/)\nthe malware was named “Recordbreaker” but was later identified as a revived version of Raccoon stealer. The\ndeveloper of the Raccoon stealer (MaaS) is very active on underground forums, regularly updating the malware, and\nposting about the new feature builds on the forum.\n\n\n-----\n\nPost describing the technical details of recent samples and modifications made in the Raccoon Stealer\n\n## The Malware\n\nRaccoon samples have been spotted in the wild on numerous occasions. While some of these were protected by\ncommercial code protectors like VmProtect and Themida, others were seen packed in popular community packers\nlike Armadillo.\n\n[CloudSEK’s telemetry was able to pick up a very interesting Raccoon sample that employed very effective anti-](https://cloudsek.com/)\nanalysis and anti-debugging techniques to foil analysis attempts. The sample covered in this report is unique in terms\nof the deployment of the malware.\n\n## The Malware Deployment\n\nThe packer used to obfuscate the stealer is specifically designed to perform the two main tasks:\n\nIdentify sandbox and debugging\nPerform hooking in order to control transfer to the stealer\n\n### The Process of Anti Analysis & Anti Debugging\n\nFor detecting sandboxed environments, especially virtual environments, the packer makes use of Read Time\n**Stamp Counter (RDTSC), a very well known CPU instruction used to detect VM by calculating the time**\ndifference (delta) between two calls to RDTSC. RDTSC has also been observed, querying system information\nlike the firmware information table to identify VMs.\nTo prevent anti-debugging, the malware includes process-level debug checks and sets the main thread hidden\nfrom the debugger.\n\n### Malicious Hooks\n\nThe malware’s API trace provided a greater understanding of the internals of the packer, without having to spend\nmuch time in a debugger. A very interesting behavior found in the trace log is shown below.\n\nThe threads in the current process are enumerated by using the following APIs:\n\n**_kernel32!CreateToolhelp32Snapshot_**\n**_kernel32!Thread32Next_**\n\n\n-----\n\nThe threads are then opened and suspended.\nOnce the threads are suspended, some memory is allocated and data is added to it.\nFinally, the memory protections are changed from RWX to RX.\n\nAPI trace present in the malware\nThe above sequence of operations is performed twice, and then the packer resumes the suspended threads.\n\nImage of the packer resuming the suspended threads\nThe data written by the malware was retrieved by CloudSEK’s researchers with the help of instrumentation.\n\nAs shown in the image below, a call was made to kernel32!WriteProcessMemory was intercepted to see the\npassed data. It is interesting to note that the **_lpAddress parameter in both calls points to ntdll.dll_** in the\nmemory of the malware. A total of five bytes of data was written in the memory region of the loaded ntdll.\n\nHooking\n\nthe NT API Calls\n\n\n-----\n\nThe written data is a JMP (jump) instruction, followed by a specific address that points to one of the segments\nin the packer.\n\nUpdated function entry\n\nafter hooking\nHooking plays a major role in the stealer loading phase and the packer is hooking the following two APIs:\n\n**_ntdll!DbgUiRemoteBreakin – The hooked DbgUiRemoteBreakin will take the control flow to exit. This is_**\nanother anti-debugging technique in which, the targeted API is used mainly by Windows debuggers to do a\nsoftware break. Hence, the packer redirects the flow, which leads to the termination of the malware.\n**_ntdll!ZwProtectVirtualMemory – If the above doesn’t happen, the packer makes a call to_**\n_ntdll!ZwProtectVirtualMemory and deploys the Raccoon Stealer v2 on the target system._\n\nExperimenting with the return values of the kernel32!WriteProcessMemory call during analysis helped to confirm\nthe hooking of ntdll!ZwProtectVirtualMemory, which is a crucial step in the infection process. Failure to hook\n_ntdll!ZwProtectVirtualMemory causes the malware to terminate and the following warning to appear._\n\nWarning popup triggered upon failure of hooking\n\nThis behavior is not observed when the malware fails to hook ntdll!DbgUiRemoteBreakin, as the program doesn’t get\nterminated.\n\n## The Malware Execution\n\n### Dynamic API Loading\n\nOnce Raccoon Stealer is executed, APIs are dynamically loaded into the memory. These APIs are later used by the\nmalware to perform malicious activities on the compromised machine.\n\n\n-----\n\nCode responsible for runtime dynamic linking of DLLs\n\n### String Decoding\n\nAfter successfully loading the libraries, the stealer decodes all the strings in memory. The previous versions of the\nstealer used RC4 decryption to encrypt the strings.\n\nRC4 decryption routine used in the old malware samples\n\nHowever, the recent version uses a custom XOR-based encoding to encrypt the strings.\n\nCustom XOR encoding used in new malware samples\n\n\n-----\n\n### Russian Language Detection\n\nThe stealer calls the kernel32!GetDefaulLocaleName to retrieve the system language (locale name), and then\nchecks it against the string “RU”. In case of a positive match, no logic is implemented for execution, which shows\nthat the malware is still under development. In the future, we can expect the stealer to terminate itself after a match is\nfound.\n\n### Mutex\n\nAfter the locale name check, the stealer looks for any active malware samples, by calling kernel32.OpenMutexW. If\nan active malware process is found, the current malware execution is terminated, else a new mutex is created on the\nsystem.\n\nCode responsible for mutex\n\ncreation\n\n[Also Read Technical Analysis of Bumblebee Malware Loader](https://cloudsek.com/technical-analysis-of-bumblebee-malware-loader/)\n\n## Admin Check\n\nOnce the Mutex is created, Raccoon checks the privileges of the user process by following the steps below:\n\n**_Advapi32.OpenProcess is called to obtain a handle to the process token._**\n**_Advapi32.GetTokenInformation is called on the acquired process token handle by passing TOKEN_USER as_**\nthe value for TokenInformationClass parameter, which returns a user SID structure.\nThe SID structure is converted to a string by calling Advapi32!ConvertSidToStringSidW.\nThe SID string is compared with the value “S-1-5-18”, the SID value for Local/SYSTEM or members in the\n**Local Admin group.**\nIf the user process is elevated, the value 0 is returned.\n\nAdministrator check performed by the stealer\n\n\n-----\n\n### Process Enumeration\n\nIf the process is elevated, the processes running on the system are enumerated as shown below:\n\n**_Kernel32!CreateToolhelp32Snapshot is called by passing the flag TH32CS_SNAPPROCESS to include all_**\nprocesses running on the system in the snapshot.\n_The Kernel32!Process32First and Kernel32!Process32Next APIs are used to walk through the snapshot_\nwhich contains the information of processes running on the system.\n\nProcess enumeration done by the\n\nmalware\nIt is interesting to note that the result returned (1/0) is not used anywhere by Raccoon. The main reason behind this\nmay be the strong likelihood that the malware is still being actively developed, and some changes to the code of\nfuture Raccoon samples should be anticipated.\n\nAlso to Read [Raccoon Stealer Malware Threat Intel Advisory](https://cloudsek.com/threatintelligence/raccoon-stealer-malware-threat-intel-advisory/)\n\n## C2 Network\n\nAttackers employ a set of tools and procedures known as command and control infrastructure, usually abbreviated\nas C2 or C&C, to keep in touch with compromised devices after the initial access has been gained. The Raccoon\nstealer calls home for the first time by sending a unique string to the C2. The string, for the communication, is crafted\nwith the following information:\n\n**Machine GUID retrieved from the following location in the registry:**\n\nComputer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography\n\nThe username, fetched via the Advapi32!GetUserNameW API.\nThe configuration ID, which is decoded using the RC4 key in some samples and a unique alphanumeric string\nin others.\n\nFormat of the victim\n\nprofile sent to the C2\n\n\n-----\n\nThe HTTP POST request and the victim identification data sent by Raccoon Stealer to the C2\n\n### C2 Configuration\n\nThe Raccoon stealer uses the following C2 identifier tags to control the behavior of the stealer.\n\n**Identifier** **Description**\n\n**libs_** **_Library PE/DLL to download_**\n\n**ews_** **_Browser Extensions_**\n\n**wlts_** **_Crypto Wallets Stealing_**\n\n**sstmnfo_** **_Collects SystemInformation and list of Installed Applications_**\n\n**scrnsht_** **_Takes Screenshot_**\n\n**tlgrm_** **_Steals data from Telegram Desktop_**\n\n**grbr_** **_Password Grabber_**\n\n**dscrd_** **_Discord Stealer_**\n\n**ldr_** **_Launches additional payloads like RATs_**\n\n**token** **_Unique identifier for tracing campaign_**\n\n\n-----\n\nC2 configuration fetched by\n\nthe malware\n\n### Fetching Library\n\nOnce the stealer obtains the C2 configuration from the C2, it starts to parse the configuration, searching for the libs_\nidentifier to download the legitimate library files such as:\n\nns33.dll\nmsvcp140.dll\nvcruntime140.dll\nmozglue.dll\nfreeble.dll\nsoftok3.dll\nsqlite3.dll\n\nThese are downloaded into the User\\AppData\\LocalLow directory and are not loaded into memory.\n\n\n-----\n\nLegitimate\n\nDLLs downloaded by the malware\nThe malware loads the necessary DLLs into memory, during the information-stealing process, and dynamically\nresolves various functions. The images below depict the dynamic API loading from sqlite.dll and ns33.dll respectively.\n\nRuntime dynamic loading of sqlite.dll\n\nRuntime dynamic loading of ns33.dll\n\n### Sysinfo Enumeration\n\nPost fetching the libraries, a profile of the host is created and sent to the C2 as a “System Info.txt” file.\n\n\n-----\n\nSystem\n\ninformation sent to C2\nThe stealer performs the host profiling only if sstmnfo_ identifier is present in the C2 configuration. Following\ninformation is enumerated in the host profile:\n\nLocale information, fetched from the system via the Kernel32!GetLocaleInfoW.\nTime zone information, fetched from the system via Kernel32!GetTimeZoneInformation.\nProduct Name (OS), fetched from the registry.\nArchitecture of the victim, identified by checking the presence of SysWOW64 directory.\nCPU vendor and model information, fetched by the CPUID assembly instruction.\nSystem information retrieved from the Kernel32!GetSystemInfo API.\nMemory information, fetched from the system via Kernel32!GlobalMemoryStatusEx.\nDisplay resolution, fetched from the system via User32!GetSystemMetrics\nDisplay adapters and monitors connected to the system.\nInstalled applications via SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Uninstall.\n\n## Information Stealing\n\n### Browser Data\n\n\n-----\n\nThe malware steals information saved by web browsers in the local user’s AppData directory. The primary directories\ntargeted are “User Data” and Profile .\n\nThe stealer is interested in the following browser data:\n\nCookies\nAutoFills\nStored passwords\nStored credit card information\n\nLike any stealer, Raccoon performs the following operations to steal the browser data:\n\nIt retrieves the target SQL database file stored by the browser. A few of Chrome’s critical databases, targeted\nby the stealer, are listed below.\n\n**Stolen Data** **Location of the Stolen Data**\n\n**Passwords** **C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data**\n\n**AutoFills** **C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Web Data**\n\n**Credit Cards** **C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Web Data**\n\n**Cookies** **C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Network\\Cookies**\n\nThe malware steals the decryption key, stored in the “Local State” file of the browser, which is used to protect\ndata stored in databases in the User Data directory, mentioned above.\nThe malware then proceeds to open the database and decrypts the data.\nThe stolen data is then sent back to C2.\n\n**Commands to Steal the Browser Data**\n\nThe previously downloaded sqlite.dll is loaded into memory to resolve the addresses of the functions required for\nquerying data from the browser database. Following images contain the various SQL queries employed by the\nmalware to steal the Chrome browser data.\n\nSQL queries used by Raccoon to steal cookie data from Chrome browser’s cookie store\n\nSQL queries used by Raccoon to steal credit card information saved on the browser\n\nSQL\n\nqueries used by Raccoon to steal autofill data stored in the browser\nThe previously downloaded ns33.dll is loaded into memory to retrieve the data stored by Mozilla Firefox. The stealer\nthen proceeds to steal the browser’s cookie, login, and form history data. The “ffcookies.txt” filename is used for\nsending stolen Firefox data to the C2 server.\n\n\n-----\n\nMozilla Firefox cookies targeted by Raccoon\n\nSQL query issued by Raccoon on the cookie.sqlite file, to steal cookie data from Firefox\n\nSQL query used by Raccoon to steal form history from Firefox\n\n### Wallets & Browser Extensions\n\nThe table below contains the list of wallets and web extensions targeted by the Raccoon malware.\n\n**Wallets**\n\n**Exodus** **Atomic** **Jaxx Liberty** **Electron Cash**\n\n**Binance** **Coinomi** **Electrum** **Ledger**\n\n**Guarda** **Monero** **Ronin** **Daedalus**\n\n**Blockstream Green** **Meta** **Wasabi**\n\n**Web Extensions**\n\n**metax** **xdefi** **waveskeeper** **solflare**\n\n**rabby** **cyano** **coinbase** **auromina**\n\n**khc** **tezbox** **coin98** **temple**\n\n**iconex** **sollet** **clover** **polymesh**\n\n**neoline** **keplr** **terraStation** **liquality**\n\n**SaturnWallet** **GuildWallet** **phantom** **tronlink**\n\n**brave** **MetaMask** **ronin** **mewcx**\n\n**ton** **goby** **bitkeep** **Cosmostation**\n\n\n-----\n\n**GameStop** **stargazer** **Enkrypt** **jaxxliberty**\n\n**CloverWallet**\n\n### File Grabbing\n\nThe malware uses the **_grbr_ identifier to enable the grabber functionality and starts searching the system for files_**\nsuch as password files, wallet seeds, etc.\n\nFile grabbing C2 configuration in Raccoon\n\n### Telegram & Discord Data\n\nRaccoon steals Telegram data from the “Telegram Desktop”\\tdata directory. It is particularly interested in the\ndirectories containing user_data, emoji, tdummy, and dumps.\n\nThe stealer is also capable of stealing Discord data, such as tokens, but this feature is not enabled by default. The\nmalware operator needs to explicitly provide a “dscrd_” identifier in the configuration to enable this option.\n\n## ScreenShot Capture\n\nApart from stealing information, Raccoon can also take screenshots of the compromised system by using the\n**“scrnsht_” identifier in the C2 configuration. The details of the screenshot capturing process are explained below.**\n\nRaccoon utilizes two libraries namely gdi32.dll and gdiplus.dll to capture the screen of the victim. These\nlibraries are dynamically loaded and the API addresses are resolved.\n\nMalware taking screen capture using gdi32.dll and gdiplus.dll\n\n**List of APIs Resolved**\n\n**Gdiplus!GdiplusStartup** **Gdiplus!GdipDisposeImage** **Gdiplus!GdipGetImageEncoders**\n\n**Gdiplus!GetImageEncodersSize** **Gdiplus!GdipCreateBitmapFromHBitmap** **Gdiplus!GdipSaveImageToFile**\n\n**gdi32!BitBlt** **gdi32!CreateCompatibleBitmap** **gdi32!CreateCompatibleDC**\n\n**gdi32!DeleteObject** **gdi32!GetObjectW** **gdi32!SelectObject**\n\n**gdi32!SetStretchBltMode** **gdi32!StretchBlt**\n\n\n-----\n\nThe process undertaken for screen grabbing using the above libraries is not straightforward. It requires\nextensive image processing techniques, which is beyond the scope of this report. In a nutshell, the captured\nimage is saved onto the disk in a jpeg format. Initially, the name assigned to the file is random, however, when\nit is sent to the C2, the image is transferred as “–screenshot.jpg”. The below image shows the Raccoon’s\nconversation with C2.\n\nScreenshot being\n\nsent to the C2 endpoint\n\n## Additional Payload Execution\n\nThe Raccoon stealer, like any other malware in its class, has the ability to execute user-provided additional malware\n(such as RATs) on the compromised system. As per CloudSEK’s analysis of multiple samples, this feature is not\npresent by default. Thus, when the stealer fetches the configuration, the operator will have to explicitly enable this\nfeature by providing the ldr_ identifier with a URL to fetch the additional payload executable along with the directory\ninformation, to install/drop it on the system for further execution.\n\nThe image below depicts the module responsible for this feature. Initially, the module checks for the identifier ldr_ in\nthe C2 configuration. If no Idr_ is present, the flow returns to its main function.\n\nChecking the C2 configuration for additional payload execution option\n\nIf the C2 contains an ldr_ identifier, the following code is used to execute the fetched executable. The\n**_shell32!ShellExecuteW API is called by passing the file and the ‘open’ operation as parameters._**\n\nCode responsible for additional\n\npayload execution via the ShellExecuteW API\n\n## Cleaning Up\n\nBefore exiting the system, the stealer deletes the DLL files that were loaded in the memory during the operation and\nterminates its execution.\n\n## Indicators of Compromise (IoCs)\n\n**Binary**\n\n\n-----\n\n**Binary494ab44bb96537fc8a3e832e3cf032b0599501f96a682205bc46d9b7744d52ab**\n\n**dd2db9bfa45002375af028ac00ca1b5e0c1db30a116c21cac2b4c75cb4ff9aec**\n\n**494ab44bb96537fc8a3e832e3cf032b0599501f96a682205bc46d9b7744d52ab**\n\n**IPv4**\n\n**dd2db9bfa45002375af028ac00ca1b5e0c1db30a116c21cac2b4c75cb4ff9aec**\n\n**193.56.146.177**\n\n**IPv4**\n\n## References\n\n[Raccoon Stealer v2 – Part 1: The return of the dead (sekoia.io)](https://blog.sekoia.io/raccoon-stealer-v2-part-1-the-return-of-the-dead/)\n\nAuthor Details\n\n[Anandeshwar Unnikrishnan](https://cloudsek.com/author/anadeshwar-unnikrishnan/)\nThreat Intelligence Researcher, [CloudSEK](https://cloudsek.com/)\nAnandeshwar is a Threat Intelligence Researcher at CloudSEK. He is a strong advocate of offensive cybersecurity.\nHe is fuelled by his passion for cyber threats in a global context. He dedicates much of his time on Try Hack Me/\nHack The Box/ Offensive Security Playground. He believes that “a strong mind starts with a strong body.” When he is\nnot gymming, he finds time to nurture his passion for teaching. He also likes to travel and experience new cultures.\n\n[Hansika Saxena](https://cloudsek.com/author/hansika-saxena/)\nTotal Posts: 2\nHansika joined CloudSEK’s Editorial team as a Technical Writer and is a B.Sc (Hons) student at the University of\nDelhi. She was previously associated with Youth India Foundation for a year.\n\n\n-----\n\n[Suchita Satyaprem Katira](https://cloudsek.com/author/suchita-katira/)\nTotal Posts: 0\nSorry! The Author has not filled his profile.\n×\n\n[Anandeshwar Unnikrishnan](https://cloudsek.com/author/anadeshwar-unnikrishnan/)\nThreat Intelligence Researcher, [CloudSEK](https://cloudsek.com/)\nAnandeshwar is a Threat Intelligence Researcher at CloudSEK. He is a strong advocate of offensive cybersecurity.\nHe is fuelled by his passion for cyber threats in a global context. He dedicates much of his time on Try Hack Me/\nHack The Box/ Offensive Security Playground. He believes that “a strong mind starts with a strong body.” When he is\nnot gymming, he finds time to nurture his passion for teaching. He also likes to travel and experience new cultures.\n\nLatest Posts\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-16 - Recordbreaker- The Resurgence of Raccoon.pdf"
    ],
    "report_names": [
        "2022-09-16 - Recordbreaker- The Resurgence of Raccoon.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535715,
    "ts_updated_at": 1743041678,
    "ts_creation_date": 1669661648,
    "ts_modification_date": 1669661648,
    "files": {
        "pdf": "https://archive.orkl.eu/9433e253d4d966f5006b58ae9225a8f83ac06d1b.pdf",
        "text": "https://archive.orkl.eu/9433e253d4d966f5006b58ae9225a8f83ac06d1b.txt",
        "img": "https://archive.orkl.eu/9433e253d4d966f5006b58ae9225a8f83ac06d1b.jpg"
    }
}