{
    "id": "5b34db67-c71f-4423-b568-445e2861e4e6",
    "created_at": "2023-01-12T15:06:48.129541Z",
    "updated_at": "2025-03-27T02:13:09.653735Z",
    "deleted_at": null,
    "sha1_hash": "0791930601310a9f4be78c48878d95e06f104e05",
    "title": "2021-02-25 - The Continuous Conundrum of Cloud Atlas",
    "authors": "",
    "file_creation_date": "2022-05-28T19:40:25Z",
    "file_modification_date": "2022-05-28T19:40:25Z",
    "file_size": 368281,
    "plain_text": "# The Continuous Conundrum of Cloud Atlas\n\n**[domaintools.com/resources/blog/the-continuous-conundrum-of-cloud-atlas](https://www.domaintools.com/resources/blog/the-continuous-conundrum-of-cloud-atlas)**\n\n## Background\n\n[In November 2020, in coordination with researchers from Black Lotus Labs at](https://www.lumen.com/en-us/security/black-lotus-labs.html) [Lumen,](https://www.lumen.com/en-us/home.html)\n[DomainTools researchers disclosed an ongoing campaign linked to an entity referred to in](https://www.domaintools.com/resources/blog/current-events-to-widespread-campaigns-pivoting-from-samples-to-identify)\n[industry reporting as “Cloud Atlas” or “Inception.” Cloud Atlas is an interesting entity as it is](https://attack.mitre.org/groups/G0100/)\nlinked to attempted intrusions across multiple conflict zones and state ministries, yet has\nnever been conclusively linked to any known adversary or even a general strategic interest.\n\nSince publication in late 2020, DomainTools researchers continued to track Cloud Atlasrelated activity through both infrastructure creation and identified malware samples. While\nthe group’s general behaviors and characteristics remained relatively static, DomainTools\nresearchers identified possible expansion in target areas beyond the group’s typical focus\non European countries and parts of the former Soviet Union.\n\n## Identifying New Infrastructure\n\nIn DomainTools’ original analysis of Cloud Atlas activity, a clear pattern emerged for\ninfrastructure creation used for staging second-stage payloads linked to the group’s\nmalicious documents. Particularly, DomainTools observed the following:\n\n\n-----\n\nUse of consistent domain naming themes such as including the terms office,\n“update,” or “ms,” with the latter likely designed to spoof Microsoft-related items.\nReliance on several European-based hosting providers such as Hostkey and OVH.\nVarious consistencies in registration details, name server use, and Mail Exchange\n(MX) DNS records.\n\nWith the above observations, DomainTools identified 18 domains linked to Cloud Atlas at\nvarying degrees of confidence, including seven items not previously linked to the group:\n\n\n**Hosting**\n**Provider**\n\n\n**Hosting**\n**Location** **Confi**\n\n\n**Domain**\n\n\n**Create**\n**Date** **IP Address**\n\n\nms-template[.]com 19Feb2021\n\nglobal-policy[.]org 19Feb2021\n\n\neurasiaresearch[.]org\n\n\n18Feb2021\n\n\nnewmsoffice[.]com 15Feb2021\n\nms-update[.]org 8-Feb2021\n\nwordupdate[.]org 21Dec2020\n\n\n139.60.161[.]52 Hostkey US High\n\nN/A N/A N/A Mediu\n\nN/A N/A N/A Mediu\n\n51.38.162[.]234 OVH FR High\n\n\n5.39.221[.]48 Hostkey NL Mediu\n\n146.0.77[.]90 Hostkey NL High\n\n\n79.143.87[.]137 Hydra\nCommunications\n\n\nIR High\n\n\nmsofficeupdate[.]com\n\n\n18Dec2020\n\n\nmsofficeupdate[.]com 10Nov2020\n\nmsofficeupdate[.]org 20Aug2020\n\nmsupdatecheck[.]com 10-Jul2020\n\n\n185.25.51[.]24 Informacines\nsistemos ir\ntechnologijos\n\n\nLT High\n\n\n46.30.188[.]236 Quadranet NL High\n\n167.114.44[.]150 OVH CA Mediu\n\n\n-----\n\n**Hosting**\n**Provider**\n\n\n**Hosting**\n**Location** **Confi**\n\n\n**Domain**\n\n\n**Create**\n**Date** **IP Address**\n\n\nnewupdate[.]org 4-Jun2020\n\nupgrade-office[.]org 7-Apr2020\n\nupgrade-office[.]com 18Mar2020\n\nupdate-office[.]com 3-Mar2020\n\nofficeupgrade[.]org 29Nov2019\n\ntemplate-new[.]com 27Aug2019\n\n\n46.183.221[.]141 DataClub BZ Low\n\n66.248.206[.]239 Hostkey NL High\n\n158.69.30[.]205 OVH CA High\n\n192.52.166[.]12 Quadranet US Mediu\n\n\n66.70.218[.]38 OVH CA High\n\n87.121.98[.]51 Tamatiya BG High\n\n147.135.170[.]193 OVH FR High\n\n\n198.24.134[.]13 Secured Servers\nLLC\n\n\nUS High\n\n\nms-check-newupdate[.]com\n\n\n8-Jul2019\n\n\nnewofficetemplate[.]com\n\n\n12Jun2019\n\n\nIn addition to the consistent use of “office” and “upgrade” themes, DomainTools identified\ntwo items that while linked in terms of registration and hosting characteristics included new\nnaming conventions:\n```\nglobal-policy[.]org\neurasia-research[.]org\n\n```\nAlthough noticeably different from the group’s typical naming themes, these items overlap\nwith Cloud Atlas’ focus on political and international relations themes, explored in greater\ndetail below. Mapped using DomainTools Iris visualization, the connections between these\nitems and their overlap becomes clear even though the activity spans nearly two years.\nNote that in the case of some older domains, registration details have changed from when\nthese items were actively used in Cloud Atlas-related activity as they have been reregistered, leading to three apparent “outliers” that under previous registration detail would\nbe closely correlated.\n\n\n-----\n\nWith these items identified, DomainTools researchers searched for any documents or\nmalware samples linked to the above domains and related infrastructure.\n\n## Pivoting from Infrastructure to Samples\n\nFrom the list of domains identified in the previous section, DomainTools researchers\nidentified multiple new samples associated with Cloud Atlas activity. The following list\nincludes previously-identified samples as well as seven newly-identified malicious\ndocuments, along with associated C2 infrastructure:\n\n**MD5** **SHA256**\n\n129ca14849f2b9e1171d241997318ab3 4011b1fff8c088fcb4ac4a05a5a156912162293bb\n\n601c6f7640ea94ee4335299152be36d6 439032cbee22ae75cce7e2340ca7ffe521dce3e1\n\n\n-----\n\n**MD5** **SHA256**\n\n1ca8b287ea91be2f3d9bb5ad6f27cf34 668236000a483b1735b7f8e244ae867804ee20fb\n\n114cee0e385240c784521641ef5476e7 46c203cf15a4126f10b3933376215063fe385aba\n\n0d5df6bb2b1eee5cc497d6510ba1bc8a 4eb0f1b0c04fc7e845e2ad7c3c84866f3a07586cc\n\n89c625189174b28564b67b92c3a3e55c 94d467e169ed52ff4df5aa7321412a797293f24b0\n\n64481a824b077854a870dcb8c56bc010 21ff553d752df93e10e45d0393eb097d52313467\n\nded1d4636a2ad6ade4665908f8702e65 07655ebfac8b7e5b2f1c2e661f6a7c16f3ac97df13\n\nb6ab958a703e5977f1334e8c6ab86377 e83f79a6442bc7796d9b6e088d144f1c842f0a47\n\n03382feadb1044abc5d469dccc1590c3 ceb060e6a169ba18e6b204ce9aafc7880fceee9a\n\ne744dfa3e039d375eda47c7103dff003 d8f13e6945b6a335382d14a00e35bfefadbdfb625\n\nab7a77f8a44cc70c6955c2bd099707fe 348b25023c45ed7b777fa6f6f635cb587b8ffbf100\n\na2f00c5cbd026331053ae1abad0dc85d 93279005aa4c8eddf01020b31bc2b401fe1366cb\n\ne963cc1caddfd957d9f7ec78de715de2 e5a4957d0078d0bb679cf3300e15b09795167fdc\n\n\n-----\n\n**MD5** **SHA256**\n\nbab23837dfc20743338f8d95b3f1e3b9 7a1effd3cfeecdba57904417c6eeaa7a74d60a761\n\ne00af9b6303460666ae1b4bdeb9503ba 7c495c21c628d37ba2298e4a789ff677867521be\n\n22542d90a4c82005fe70f4b58a815db3 0b116f5b93046c3ce3588bb2453ddbb907d990c2\n\n4ecf8aeed764d7b4da0c8d2abb618760 79c0097e9def5cc0f013ba64c0fd195dae57b04fe\n\nb2d173f1eaedf22f6309172882ea68da 68bde4ec00c62ffa51cef3664c5678f1f4985eb605\n\n965e187680297f9e782bdaaca96495c7 1f117d5f398e599887ec92a3f8982751ceb83f2ad\n\n3883e47d8626b12667eab3656a2eeed4 4ad0e64e8ebed1d15fac85cd7439bb345824f03d\n\n9661464bae94391b23f0b01f563e27e7 c630aa8ebd1d989af197a80b4208a9fd981cf40fa\n\nc037ee4d91b62627665fa9df82c641ab 7ba76b2311736dbcd4f2817c40dae78f223366f24\n\n2bf501cf34f19b9243528bd35e90df6b 89503c73eadc918bb6f05c023d5bf777fb2a0de1e\n\nIn addition to the links to identified infrastructure, all of the documents feature the same\n[template string documented in DomainTools’ previous report:](https://www.domaintools.com/resources/blog/current-events-to-widespread-campaigns-pivoting-from-samples-to-identify)\n\n\n-----\n\nAs [previously documented by researchers from Kaspersky, the documents attempt to](https://securelist.com/recent-cloud-atlas-activity/92016/)\nretrieve and execute an external payload for follow-on execution via PowerShell or\nVBScript. While the majority of identified samples continue to leverage remote template\nretrieval via HTTPS, several samples also included Server Message Block (SMB)\nreferences direct to an IP address (discussed in greater detail below). Based on previous\nresearch, initial payloads from the document can either be malicious script objects to move\nthe infection further along, or scripting objects designed to further validate victims and\neliminate forensic artifacts.\n\nComplicating analysis, and as noted by other researchers on past activity linked to Cloud\nAtlas, second-stage links and resources are typically “gated.” Resources are limited to\nretrieval only from designated locations, likely via IP address allow-listing. As a result,\nDomainTools has not been able to retrieve any samples of follow-on activity from the above\ndocuments directly.\n\n### Possible PowerShell Second-Stage Framework\n\nWhile researching the above items, DomainTools researchers, in conjunction with\n[researcher Florian Roth, identified a PowerShell script which included references to one of](https://twitter.com/cyb3rops)\nthe domains linked to Cloud Atlas registration activity:\n```\nName: rr3.ps1\nMD5: 95885b0306642d71f295faa22b1831c0\nSHA256: ca2a5c131af2ffb14bea01d458e149e8ad4a6e9c51af8ada6a1aec9d89a8cce4\n\n```\nThe script attempts to retrieve a resource from the following location:\n\n\n-----\n\n```\nhXXp://ms check new\nupdate[.]com/deeplyset/Framonts/sheintsis/calycophorae/beshackled/parcleanup/cheiliti\n\n```\nAlthough superficially similar to HTTP-based communication from malicious documents,\nthere are notable differences:\n\nDocument template communication uses encrypted traffic via HTTPS, with domains\nassociated with Sectigo SSL/TLS certificates, while the script communicates via\nunencrypted HTTP.\nWhile the PowerShell request parses the full URI with “/”, the HTTPS beacons from\ndocuments consist of a single URI parameter with individual “words” separated by\nnumbers.\n\nThe differences can be seen by looking at an example of a beacon from a malicious\ndocument:\n```\nhXXps://ms-update[.]org/tanked7inevitable3tricorn8suppuration9t\n\n```\nAlthough domain creation and registration artifacts show similarities between the domain\nused in the PowerShell script and domains used in malicious document files, differences in\nuse make it difficult for DomainTools to link the identified script to the same cluster of activity\n(suspected Cloud Atlas) with high confidence.\n\nCloud Atlas-related operations previously used scripting frameworks for a variety of\n[purposes as part of operations, as documented by researchers from Kaspersky and](https://usa.kaspersky.com/about/press-releases/2019_kaspersky-research-finds-cloud-atlas-apt-ugraded-with-polymorphic-malware) Palo\nAlto. In previous instances, Cloud Atlas-related scripts performed functions such as the\nfollowing:\n\nInitial victim system reconnaissance and system survey.\nSystem data and file collection.\nData exfiltration.\nAnti-analysis and anti-forensics operations.\n\nThe script object retrieved in this case seems more limited, focusing primarily on creating\npersistence mechanisms and evading analysis while attempting to download an additional\npayload. Based on prior analysis of Cloud Atlas-related activity, this iterative nature is not\nunexpected although the precise persistence mechanisms appear new.\n\nFor example, the following establishes persistence via a scheduled task:\n\n\n-----\n\nThe portion of the script provided below checks for previous retrieval of a follow-on payload\nand for the presence of a scheduled task (“Display renovation”), while also modifying\nsystem parameters via the Windows Registry to “hide” the taskeng.exe window through a\nhard-coded placement value off-screen.\n\nSince taskeng.exe will launch a window (even if momentarily), the above will “hide” this\naspect of execution. The technique is superficially similar to one previously documented by\nresearchers, and [deployed in Cloud Atlas-related activity.](https://unit42.paloaltonetworks.com/unit42-inception-attackers-target-europe-year-old-office-vulnerability/)\n\nFinally, the script contains a function to eliminate Temporary Internet Files artifacts\nassociated with script execution:\n\n\n-----\n\nBased on descriptions in previous work from Kaspersky and Palo Alto, the above appears\nmore limited in functionality than earlier Cloud Atlas-linked script objects. However, without\nactual possession of such scripts for comparison, degree of similarity (or difference) is not\npossible to determine with the information currently available.\n\nOverall, the retrieved script features many overlaps with behaviors documented by other\nresearchers and linked to Cloud Atlas in 2018 (Palo Alto) and 2019 (Kaspersky). While\nprevious analysis indicates Cloud Atlas-related activity will frequently re-use or maintain\ncapabilities for many years, the appearance of this script two years after public\ndocumentation, combined with inexact replication of previously-documented capabilities\nand the network communication items described previously, would argue for some caution\nin definitively linking this file to the Cloud Atlas cluster of behaviors. While the overlaps\ncertainly exist, and associated network infrastructure ties in to documented, recent Cloud\nAtlas tendencies, DomainTools associates the above with this behavioral cluster with\nmedium confidence at this time for the reasons noted above.\n\n## Adversary Themes and Possible Motivations\n\nMoving away from the scripting object which is likely—although not definitively—linked to\nCloud Atlas behaviors, the overall themes as well as probable geographic targeting of the\nobserved malicious documents largely align with previously documented activity from this\nentity.\n\nExamining items discovered from December 2020 through February 2021, DomainTools\nidentified the following “themes” or lures:\n\n[A document purportedly from the European Union Institute for Security Studies](https://www.iss.europa.eu/)\n(EUISS) on common defense questions for the European Union, likely appearing in\nFrance.\nA document from the “Ministry of Labor and Social Policy” of the unrecognized\nUkrainian breakaway region known as the Luhansk People’s Republic, submitted from\nUkraine.\n\n\n-----\n\nAn agenda for a training course on customs regulation from the Belarusian Trade and\nIndustrial Chamber,” identified in Belarus.\nA news bulletin concerning Belarusian adoption of an International Atomic Energy\nAssociation (IAEA) action plan for the development of nuclear energy, first identified in\nRussia.\nA document concerning the creation of a common natural gas market within the\n[Eurasian Economic Union (EAEU), submitted from Uzbekistan.](http://www.eaeunion.org/?lang=en)\n[A listing of personnel allegedly belonging to the SPBT Almaz special anti-terrorist unit](https://en.wikipedia.org/wiki/Almaz_(Special_unit))\nof the Belarussian security forces, first seen in Belarus.\n\n[The items continue targeting trends and lure themes observed in late 2020:](https://www.domaintools.com/resources/blog/current-events-to-widespread-campaigns-pivoting-from-samples-to-identify)\n\nPrimary focus on countries formerly part of the Soviet Union with an emphasis on\nenergy and political themes.\n\n\n-----\n\nParticular focus on the unrecognized breakaway regions of Ukraine such as Luhansk\nas well as Donetsk.\nAdditional targeting of Western European and NATO-related defense interests.\n\nBased on the observed activities, lures, and likely geographic targeting, DomainTools\nassesses with high confidence that the campaigns in question form part of unspecified\nespionage operations. While further speculation on particular attribution is possible,\ninsufficient technical evidence exists that would allow DomainTools to attribute this activity\nto any distinct entity or country.\n\n### Outlier Samples\n\nAdding pause to the question of attribution are two similarly-structured but outlier samples\nboth in technical behavior and targeting. Whereas the majority of the malicious documents\nusing the same template string spawn communication via HTTPS for follow-on payload\nretrieval, two items (one of which has several variants with identical functionality and\ndocument content) instead utilize communication to resources via SMB, such as the\nfollowing:\n```\n\\\\185.70.184[.]32\\soarnegroidmeanalkydapresowntipslushing[.]png\n\\\\139.60.161[.]74\\appalcanedentrecentlyconvergenting[.]png\n\n```\nIn addition to the difference in protocol, the naming convention (one long string of text\nwithout dividing numbers) and use of a file extension (PNG) are also different from other\nsamples. DomainTools researchers were unsuccessful in attempting to retrieve the PNG\nobjects referenced, making further analysis not possible at this time. While domain links are\nnot possible on these items, referenced IP addresses do at least conform to hosting\npractices used by recent Cloud Atlas-linked activity: favoring specific providers largely\nlocated and operating in Europe.\n\nTechnical observations aside, the “themes” of the documents were also different, reflecting\nthe following topics:\n\nThe [Pensacola shooting that was later linked by US authorities to Al Qaeda](https://www.nytimes.com/2020/05/18/us/politics/justice-department-al-qaeda-florida-naval-base-shooting.html)\noperations.\nA travel form linked to COVID-19 precautions for travelers to the United Kingdom.\n\n\n-----\n\nWhile the COVID-19 form at least appears to originate in Europe, the Pensacola shooting\ndocument first appears in the Middle East. While researchers previously identified Cloud\nAtlas-linked activity in Central Asia, publicly available information contains no references to\noperations in the Gulf region, where this item appears to have originated.\n\nOverall, these documents retain the template string unifying all observed items since 2019,\nbut otherwise appear to differ in behaviors, themes, and possible targeting. At this time,\ninsufficient evidence exists to determine if these items represent a closely-linked, but\noperationally independent, group to Cloud Atlas with access to similar tools, or merely\nvariations on common delivery vectors ultimately leading to the same payloads.\n\n## Conclusion\n\n\n-----\n\nDomainTools researchers continue to track activity of interest through sustained monitoring\nof known malicious infrastructure creation tendencies. Through this work, DomainTools\nresearchers identified persistent activity linked to previous analysis of initial access activity\nassociated with an entity referred to as Cloud Atlas. While some parts of this entity’s\noperations have shifted in the past six months of tracking them, overall this group continues\nto exhibit common tendencies in both infrastructure registration and malicious document\ndesign.\n\nBy identifying these fundamental behaviors linked to a known threat actor, network\ndefenders and threat intelligence analysts can keep pace with adversaries over time. While\nDomainTools anticipates eventual alterations in this group’s activity due to public scrutiny,\nthe likelihood that all aspects of this group’s operations (network infrastructure, malicious\ndocument format, and possibly scripting behaviors) will change simultaneously is rather low.\nThrough incorporation of appropriate monitoring and tracking strategies linked with this\nthreat’s fundamental behaviors, defenders can ensure continuous coverage against this\nactor moving forward.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-25 - The Continuous Conundrum of Cloud Atlas.pdf"
    ],
    "report_names": [
        "2021-02-25 - The Continuous Conundrum of Cloud Atlas.pdf"
    ],
    "threat_actors": [
        {
            "id": "02c9f3f6-5d10-456b-9e63-750286048149",
            "created_at": "2022-10-25T16:07:23.722884Z",
            "updated_at": "2025-03-27T02:02:09.945869Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK 116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "Inception Framework",
                "Operation Cloud Atlas",
                "Operation RedOctober",
                "The Rocra"
            ],
            "source_name": "ETDA:Inception Framework",
            "tools": [
                "Lastacloud",
                "PowerShower",
                "VBShower"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04a7ebaa-ebb1-4971-b513-a0c86886d932",
            "created_at": "2023-01-06T13:46:38.784965Z",
            "updated_at": "2025-03-27T02:00:02.91817Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "G0100"
            ],
            "source_name": "MISPGALAXY:Inception Framework",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536008,
    "ts_updated_at": 1743041589,
    "ts_creation_date": 1653766825,
    "ts_modification_date": 1653766825,
    "files": {
        "pdf": "https://archive.orkl.eu/0791930601310a9f4be78c48878d95e06f104e05.pdf",
        "text": "https://archive.orkl.eu/0791930601310a9f4be78c48878d95e06f104e05.txt",
        "img": "https://archive.orkl.eu/0791930601310a9f4be78c48878d95e06f104e05.jpg"
    }
}