{
    "id": "5ba11071-78ac-4896-aaae-f69181b6dc34",
    "created_at": "2023-01-12T15:02:15.855396Z",
    "updated_at": "2025-03-27T02:15:24.698863Z",
    "deleted_at": null,
    "sha1_hash": "d797790e988ead4ad046809d38fcfd5d453fe664",
    "title": "2022-02-16 - Alert (AA22-047A) Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology",
    "authors": "",
    "file_creation_date": "2022-05-29T01:07:25Z",
    "file_modification_date": "2022-05-29T01:07:25Z",
    "file_size": 270150,
    "plain_text": "# Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology\n\n**cisa.gov/uscert/ncas/alerts/aa22-047a**\n\n## Summary\n\n**_Actions to Help Protect Against Russian State-Sponsored Malicious Cyber Activity:_**\n\n- Enforce multifactor authentication.\n\n- Enforce strong, unique passwords.\n\n- Enable M365Unified Audit Logs.\n\n- Implementendpoint detection and response tools.\n\nFrom at least January 2020, through February 2022, the Federal Bureau of Investigation\n(FBI), National Security Agency (NSA), and Cybersecurity and Infrastructure Security\nAgency (CISA) have observed regular targeting of U.S. cleared defense contractors (CDCs)\nby Russian state-sponsored cyber actors. The actors have targeted both large and small\nCDCs and subcontractors with varying levels of cybersecurity protocols and resources.\nThese CDCs support contracts for the U.S. Department of Defense (DoD) and Intelligence\nCommunity in the following areas:\n\nCommand, control, communications, and combat systems;\nIntelligence, surveillance, reconnaissance, and targeting;\nWeapons and missile development;\nVehicle and aircraft design; and\nSoftware development, data analytics, computers, and logistics.\n\nHistorically, Russian state-sponsored cyber actors have used common but effective tactics to\ngain access to target networks, including spearphishing, credential harvesting, brute\nforce/password spray techniques, and known vulnerability exploitation against accounts and\nnetworks with weak security. These actors take advantage of simple passwords, unpatched\nsystems, and unsuspecting employees to gain initial access before moving laterally through\nthe network to establish persistence and exfiltrate data.\n\nIn many attempted compromises, these actors have employed similar tactics to gain access\nto enterprise and cloud networks, prioritizing their efforts against the widely used Microsoft\n365 (M365) environment. The actors often maintain persistence by using legitimate\ncredentials and a variety of malware when exfiltrating emails and data.\n\nThese continued intrusions have enabled the actors to acquire sensitive, unclassified\ninformation, as well as CDC-proprietary and export-controlled technology. The acquired\ninformation provides significant insight into U S weapons platforms development and\n\n\n-----\n\ndeployment timelines, vehicle specifications, and plans for communications infrastructure\nand information technology. By acquiring proprietary internal documents and email\ncommunications, adversaries may be able to adjust their own military plans and priorities,\nhasten technological development efforts, inform foreign policymakers of U.S. intentions, and\ntarget potential sources for recruitment. Given the sensitivity of information widely available\non unclassified CDC networks, the FBI, NSA, and CISA anticipate that Russian statesponsored cyber actors will continue to target CDCs for U.S. defense information in the near\nfuture. These agencies encourage all CDCs to apply the recommended mitigations in this\nadvisory, regardless of evidence of compromise.\n\nFor additional information on Russian state-sponsored cyber activity, see CISA's webpage,\n[Russia Cyber Threat Overview and Advisories.](https://www.us-cert.cisa.gov/russia)\n\n[Click here for a PDF version of this report.](https://www.cisa.gov/sites/default/files/publications/AA22-047A%20Russian%20State-Sponsored%20Cyber%20Actors%20Target%20CDC%20Networks.pdf)\n\n## Threat Details\n\n**Targeted Industries and Assessed Motive**\n\nRussian state-sponsored cyber actors have targeted U.S. CDCs from at least January 2020,\nthrough February 2022. The actors leverage access to CDC networks to obtain sensitive\ndata about U.S. defense and intelligence programs and capabilities. Compromised entities\nhave included CDCs supporting the U.S. Army, U.S. Air Force, U.S. Navy, U.S. Space Force,\nand DoD and Intelligence programs.\n\nDuring this two-year period, these actors have maintained persistent access to multiple CDC\nnetworks, in some cases for at least six months. In instances when the actors have\nsuccessfully obtained access, the FBI, NSA, and CISA have noted regular and recurring\nexfiltration of emails and data. For example, during a compromise in 2021, threat actors\nexfiltrated hundreds of documents related to the company’s products, relationships with other\ncountries, and internal personnel and legal matters.\n\nThrough these intrusions, the threat actors have acquired unclassified CDC-proprietary and\nexport-controlled information. This theft has granted the actors significant insight into U.S.\nweapons platforms development and deployment timelines, plans for communications\ninfrastructure, and specific technologies employed by the U.S. government and military.\nAlthough many contract awards and descriptions are publicly accessible, program\ndevelopments and internal company communications remain sensitive. Unclassified emails\namong employees or with government customers often contain proprietary details about\ntechnological and scientific research, in addition to program updates and funding statuses.\nSee figures 1 and 2 for information on targeted customers, industries, and information.\n\n\n-----\n\n_Figure 1. Targeted Industries_\n\n_Figure 2. Exfiltrated Information_\n\n**Threat Actor Activity**\n\n**_Note: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 10. See_**\n_the_ _[ATT&CK for Enterprise for all referenced threat actor tactics and techniques. See the](https://attack.mitre.org/versions/v10/techniques/enterprise/)_\n_Tactics, Techniques, and Procedures (TTPs) section for a table of the threat actors’ activity_\n_mapped to MITRE ATT&CK tactics and techniques._\n\n**_Initial Access_**\n\nRussian state-sponsored cyber actors use brute force methods, spearphishing, harvested\ncredentials, and known vulnerabilities to gain initial access to CDC networks.\n\n[Threat actors use brute force techniques [T1110] to identify valid account credentials](https://attack.mitre.org/versions/v10/techniques/T1110)\n\n[[T1589.001] for domain and M365 accounts. After obtaining domain credentials, the](https://attack.mitre.org/versions/v10/techniques/T1589/001/)\nactors use them to gain initial access to the networks. Note: For more information, see\n_joint NSA-FBI-CISA Cybersecurity Advisory: Russian GRU Conducting Global Brute_\n_Force Campaign to Compromise Enterprise and Cloud Environments._\n[Threat actors send spearphishing emails with links to malicious domains [T1566.002]](https://attack.mitre.org/versions/v10/techniques/T1566/002)\n[and use publicly available URL shortening services to mask the link [T1027].](https://attack.mitre.org/versions/v10/techniques/T1027)\nEmbedding shortened URLs instead of actor-controlled malicious domains is an\nobfuscation technique meant to bypass virus and spam scanning tools. The technique\noften promotes a false legitimacy to the email recipient, increasing the probability of a\nvictim’s clicking on the link.\nThe threat actors use harvested credentials in conjunction with known vulnerabilities—\nfor example, CVE-2020-0688 and CVE-2020-17144—on public-facing applications\n\n[[T1078,](https://attack.mitre.org/versions/v10/techniques/T1078/) [T1190], such as virtual private networks (VPNs), to escalate privileges and](https://attack.mitre.org/versions/v10/techniques/T1190/)\n[gain remote code execution (RCE) on the exposed applications.[1] In addition, threat](https://media.defense.gov/2021/Jul/01/2002753896/-1/-1/1/CSA_GRU_GLOBAL_BRUTE_FORCE_CAMPAIGN_UOO158036-21.PDF)\nactors have exploited CVE-2018-13379 on FortiClient to obtain credentials to access\nnetworks.\n\n\n-----\n\nAs CDCs find and patch known vulnerabilities on their networks, the actors alter their\ntradecraft to seek new means of access. This activity necessitates CDCs maintain\nconstant vigilance for software vulnerabilities and out-of-date security configurations,\nespecially in internet-facing systems.\n\n**_Credential Access_**\n\nAfter gaining access to networks, the threat actors map the Active Directory (AD) and\nconnect to domain controllers, from which they exfiltrate credentials and export copies of the\nAD database `ntds.dit` [[T1003.003]. In multiple instances, the threat actors have used](https://attack.mitre.org/versions/v10/techniques/T1003/003/)\nMimikatz to dump admin credentials from the domain controllers.\n\n**_Collection_**\n\nUsing compromised M365 credentials, including global admin accounts, the threat actors can\n[gain access to M365 resources, including SharePoint pages [T1213.002], user profiles, and](https://attack.mitre.org/versions/v10/techniques/T1213/002/)\n[user emails [T1114.002].](https://attack.mitre.org/versions/v10/techniques/T1114/002/)\n\n**_Command and Control_**\n\nThe threat actors routinely use virtual private servers (VPSs) as an encrypted proxy. The\nactors use VPSs, as well as small office and home office (SOHO) devices, as operational\n[nodes to evade detection [T1090.003].](https://attack.mitre.org/versions/v10/techniques/T1090/003/)\n\n**_Persistence_**\n\nIn multiple instances, the threat actors maintained persistent access for at least six months.\nAlthough the actors have used a variety of malware to maintain persistence, the FBI, NSA,\nand CISA have also observed intrusions that did not rely on malware or other persistence\nmechanisms. In these cases, it is likely the threat actors relied on possession of legitimate\n[credentials for persistence [T1078], enabling them to pivot to other accounts, as needed, to](https://attack.mitre.org/versions/v10/techniques/T1078/)\nmaintain access to the compromised environments.\n\n**Tactics, Techniques, and Procedures**\n\nThe following table maps observed Russian state-sponsored cyber activity to the MITRE\nATT&CK for Enterprise framework. Several of the techniques listed in the table are based on\nobserved procedures in contextual order. Therefore, some of the tactics and techniques\nlisted in their respective columns appear more than once. See Appendix A for a functional\nbreakdown of TTPs. Note: for specific countermeasures related to each ATT&CK technique,\n_see the_ _[Enterprise Mitigations section and](https://attack.mitre.org/mitigations/)_ _[MITRE D3FEND™.](https://d3fend.mitre.org/)_\n\n_Table 1: Observed Tactics, Techniques, and Procedures (TTPs)_\n\n**Tactic** **Technique** **Procedure**\n\n\n-----\n\n**Tactic** **Technique** **Procedure**\n\n\n**Reconnaissance**\n\n**[[TA0043]](https://attack.mitre.org/versions/v10/tactics/TA0043/)**\n\n**Credential**\n**[Access [TA0006]](https://attack.mitre.org/versions/v10/tactics/TA0006/)**\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Privilege**\n**Escalation**\n\n**[[TA0004]](https://attack.mitre.org/versions/v10/tactics/TA0004)**\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Defense**\n**Evasion**\n\n**[[TA0005]](https://attack.mitre.org/versions/v10/tactics/TA0005)**\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Credential**\n**[Access [TA0006]](https://attack.mitre.org/versions/v10/tactics/TA0006/)**\n\n\nGather Victim\nIdentity\nInformation:\nCredentials\n\n[[T1589.001]](https://attack.mitre.org/versions/v10/techniques/T1589/001/)\n\nBrute Force\n\n[[T1110]](https://attack.mitre.org/versions/v10/techniques/T1110/003/)\n\nExternal\nRemote\nServices\n\n[[T1133]](https://attack.mitre.org/versions/v10/techniques/T1133)\n\nValid\nAccounts\n\n[[T1078]](https://attack.mitre.org/versions/v10/techniques/T1078/)\n\nExploit PublicFacing\nApplication\n\n[[T1190]](https://attack.mitre.org/versions/v10/techniques/T1190/)\n\nPhishing:\nSpearphishing\nLink\n\n[[T1566.002]](https://attack.mitre.org/versions/v10/techniques/T1566/002)\n\nObfuscated\nFiles or\nInformation\n\n[[T1027]](https://attack.mitre.org/versions/v10/techniques/T1027)\n\nOS Credential\nDumping:\nNTDS\n\n[[T1003.003]](https://attack.mitre.org/versions/v10/techniques/T1003/003/)\n\nValid\nAccounts:\nDomain\nAccounts\n\n[[T1078.002]](https://attack.mitre.org/versions/v10/techniques/T1078/002/)\n\n\nThreat actors used brute force to identify valid\naccount credentials for domain and M365 accounts.\nAfter obtaining domain credentials, the actors used\nthem to gain initial access.\n\nThreat actors continue to research vulnerabilities in\nFortinet’s FortiGate VPN devices, conducting brute\nforce attacks and leveraging CVE-2018-13379 to\n[gain credentials to access victim networks. [2]](https://media.defense.gov/2019/Oct/07/2002191601/-1/-1/0/CSA-MITIGATING-RECENT-VPN-VULNERABILITIES.PDF)\n\nThreat actors used credentials in conjunction with\nknown vulnerabilities on public-facing applications,\nsuch as virtual private networks (VPNs)—CVE-20200688 and CVE-2020-17144—to escalate privileges\nand gain remote code execution (RCE) on the\n[exposed applications. [3]](https://media.defense.gov/2021/Jul/01/2002753896/-1/-1/1/CSA_GRU_GLOBAL_BRUTE_FORCE_CAMPAIGN_UOO158036-21.PDF)\n\nThreat actors sent spearphishing emails using\npublicly available URL shortening services.\nEmbedding shortened URLs instead of the actorcontrolled malicious domain is an obfuscation\ntechnique meant to bypass virus and spam scanning\ntools. The technique often promotes a false\nlegitimacy to the email recipient and thereby\nincreases the possibility that a victim clicks on the\nlink.\n\nThreat actors logged into a victim’s VPN server and\nconnected to the domain controllers, from which they\nexfiltrated credentials and exported copies of the AD\ndatabase `ntds.dit .`\n\n\n-----\n\n**Tactic** **Technique** **Procedure**\n\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Privilege**\n**Escalation**\n\n**[[TA0004]](https://attack.mitre.org/versions/v10/tactics/TA0004)**\n\n**Collection**\n\n**[[TA0009]](https://attack.mitre.org/versions/v10/tactics/TA0009/)**\n\n**Initial Access**\n\n**[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n**Collection**\n\n**[[TA0009]](https://attack.mitre.org/versions/v10/tactics/TA0009/)**\n\n**Persistence**\n\n**[[TA0003]](https://attack.mitre.org/versions/v10/tactics/TA0003/)**\n\n**Lateral**\n**Movement**\n\n**[[TA0008]](https://attack.mitre.org/versions/v10/tactics/TA0008)**\n\n**Discovery**\n\n**[[TA0007]](https://attack.mitre.org/tactics/TA0007)**\n\n**Discovery**\n\n**[[TA0007]](https://attack.mitre.org/versions/v10/tactics/TA0007)**\n\n**Command and**\n**[Control [TA0011]](https://attack.mitre.org/versions/v10/tactics/TA0011/)**\n\n## Detection\n\n\nValid\nAccounts:\nCloud\nAccounts\n\n[[T1078.004]](https://attack.mitre.org/versions/v10/techniques/T1078/004/)\n\nData from\nInformation\nRepositories:\nSharePoint\n\n[[T1213.002]](https://attack.mitre.org/versions/v9/techniques/T1213/002/)\n\nValid\nAccounts:\nDomain\nAccounts\n\n[[T1078.002]](https://attack.mitre.org/versions/v10/techniques/T1078/002/)\n\nEmail\nCollection\n\n[[T1114]](https://attack.mitre.org/versions/v10/techniques/T1114)\n\nValid\nAccounts\n\n[[T1078]](https://attack.mitre.org/versions/v10/techniques/T1078/)\n\nFile and\nNetwork\nDiscovery\n\n[[T1083]](https://attack.mitre.org/versions/v10/techniques/T1083)\n\nDomain Trust\nDiscovery\n\n[[T1482]](https://attack.mitre.org/versions/v10/techniques/T1482/)\n\nProxy: Multihop Proxy\n\n[[T1090.003]](https://attack.mitre.org/versions/v10/techniques/T1090/003/)\n\n\nIn one case, the actors used valid credentials of a\nglobal admin account within the M365 tenant to log\ninto the administrative portal and change permissions\nof an existing enterprise application to give read\naccess to all SharePoint pages in the environment,\nas well as tenant user profiles and email inboxes.\n\nIn one case, the threat actors used legitimate\ncredentials to exfiltrate emails from the victim's\nenterprise email system.\n\nThreat actors used valid accounts for persistence.\nAfter some victims reset passwords for individually\ncompromised accounts, the actors pivoted to other\naccounts, as needed, to maintain access.\n\nAfter gaining access to networks, the threat actors\nused BloodHound to map the Active Directory.\n\nThreat actors gathered information on domain trust\nrelationships that were used to identify lateral\nmovement opportunities.\n\nThreat actors used multiple disparate nodes, such as\nVPSs, to route traffic to the target.\n\n\n-----\n\nThe FBI, NSA, and CISA urge all CDCs to investigate suspicious activity in their enterprise\nand cloud environments. Note: for additional approaches on uncovering malicious cyber\n_activity, see joint advisory Technical Approaches to Uncovering and Remediating Malicious_\n_Activity, authored by CISA and the cybersecurity authorities of Australia, Canada, New_\n_Zealand, and the United Kingdom._\n\n**Detect Unusual Activity**\n\n**Implement robust log collection and retention. Robust logging is critical for detecting**\nunusual activity. Without a centralized log collection and monitoring capability, organizations\nhave limited ability to investigate incidents or detect the threat actor behavior described in\nthis advisory. Depending on the environment, tools and solutions include:\n\nCloud native solutions, such as cloud-native security incident and event management\n(SIEM) tools.\nThird-party tools, such as Sparrow, to review Microsoft cloud environments and to\ndetect unusual activity, service principals, and application activity. Note: for guidance\n_on using these and other detection tools, refer to CISA Cybersecurity Advisory_\n_[Detecting Post-Compromise Threat Activity in Microsoft Cloud Environments.](https://us-cert.cisa.gov/ncas/alerts/aa21-008a)_\n\n**Look for Evidence of Known TTPs**\n\n**Look for behavioral evidence or network and host-based artifacts from known**\nTTPs associated with this activity. To detect password spray activity, review\nauthentication logs for system and application login failures of valid accounts. Look for\nfrequent, failed authentication attempts across multiple accounts.\n\n\n-----\n\nTo detect use of compromised credentials in combination with a VPS, follow the steps\nbelow:\n\n**Review logs for suspicious “impossible logins,” such as logins with changing**\nusernames, user agent strings, and IP address combinations or logins where IP\naddresses do not align to the expected user’s geographic location.\n**Look for one IP used for multiple accounts, excluding expected logins.**\n**Search for “impossible travel,” which occurs when a user logs in from multiple**\nIP addresses that are a significant geographic distance apart (i.e., a person could\nnot realistically travel between the geographic locations of the two IP addresses\nin the time between logins). Note: this detection opportunity can result in false\n_positives if legitimate users apply VPN solutions before connecting to networks._\n**Evaluate processes and program execution command-line arguments that**\nmay indicate credential dumping, especially attempts to access or copy the\n```\n      ntds.dit file from a domain controller.\n\n```\nIdentify suspicious privileged account use after resetting passwords or applying\nuser account mitigations.\n**Review logs for unusual activity in typically dormant accounts.**\n**Look for unusual user agent strings, such as strings not typically associated**\nwith normal user activity, which may indicate bot activity.\n\n## Incident Response and Remediation\n\nOrganizations with evidence of compromise should assume full identity compromise and\ninitiate a full identity reset.\n\n**Reset passwords for all local accounts. These accounts should include Guest,**\nHelpAssistant, DefaultAccount, System, Administrator, and krbtgt. It is essential to\nreset the password for the krbtgt account, as this account is responsible for handling\nKerberos ticket requests as well as encrypting and signing them. Note: reset the krbtgt\n_account twice and consecutively with a 10-hour waiting period between resets (i.e.,_\n_perform the first krbtgt password reset, wait 10 hours, and then follow with a second_\n_krbtgt password reset). The krbtgt password resets may take a long time to propagate_\n_fully on large AD environments. Refer to Microsoft’s_ _AD Forest Recovery - Resetting_\n_[the krbtgt password guidance and automation script for additional information. [4][5]](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/ad-forest-recovery-resetting-the-krbtgt-password)_\n**Reset all domain user, admin, and service account passwords.**\n\n**_Note: for guidance on evicting advanced persistent threat (APT) actors from cloud and_**\n_enterprise environments, refer to CISA Analysis Report Eviction Guidance for Networks_\n_Affected by the SolarWinds and Active Directory/Microsoft 365 (M365) Compromise._\n_Although this guidance was drafted for federal agencies compromised by the Russian_\n_[Foreign Intelligence Service (SVR) via the SolarWinds Orion supply chain compromise, the](https://us-cert.cisa.gov/remediating-apt-compromised-networks)_\n_steps provided in the Eviction Phase are applicable for all organizations crafting eviction_\n_plans for suspected APT actors._\n\n\n-----\n\n## Mitigations\n\nThe FBI, NSA, and CISA encourage all CDCs, with or without evidence of compromise, to\napply the following mitigations to reduce the risk of compromise by this threat actor. While\nthese mitigations are not intended to be all-encompassing, they address common TTPs\nobserved in these intrusions and will help to mitigate against common malicious activity.\n\n**Implement Credential Hardening**\n\n**_Enable Multifactor Authentication_**\n\n**Enable multifactor authentication (MFA) for all users, without exception. Subsequent**\nauthentication may not require MFA, enabling the possibility to bypass MFA by reusing\nsingle factor authentication assertions (e.g., Kerberos authentication). Reducing the\n[lifetime of assertions will cause account re-validation of their MFA requirements.[6]](https://media.defense.gov/2019/Sep/09/2002180330/-1/-1/0/Defend%20Privileges%20and%20Accounts%20-%20Copy.pdf)\nService accounts should not use MFA. Automation and platform features (e.g., Group\nManaged Service Accounts, gMSA) can provide automatic and periodic complex\npassword management for service accounts, reducing the threat surface against single\n[factor authentication assertions.[7]](https://docs.microsoft.com/en-us/windows-server/security/group-managed-service-accounts/group-managed-service-accounts-overview)\n\n**_Enforce Strong, Unique Passwords_**\n\n**Require accounts to have strong, unique passwords. Passwords should not be**\nreused across multiple accounts or stored on the system where an adversary may\nhave access.\n**Enable password management functions, such as Local Administrator Password**\nSolution (LAPS), for local administrative accounts. This will reduce the burden of users\nmanaging passwords and encourage them to have strong passwords.\n\n**_Introduce Account Lockout and Time-Based Access Features_**\n\n**Implement time-out and lock-out features in response to repeated failed login**\nattempts.\n**Configure time-based access for accounts set at the admin level and higher. For**\nexample, the Just-In-Time (JIT) access method provisions privileged access when\nneeded and can support enforcement of the principle of least privilege (as well as the\nZero Trust model). This is a process where a network-wide policy is set in place to\nautomatically disable administrator accounts at the AD level when the account is not in\ndirect need. When the account is needed, individual users submit their requests\nthrough an automated process that enables access to a system but only for a set\ntimeframe to support task completion.\n\n**_Reduce Credential Exposure_**\n\n\n-----\n\n**Use virtualization solutions on modern hardware and software to ensure**\ncredentials are securely stored, and protect credentials via capabilities, such as\nWindows Defender Credential Guard (CredGuard) and Trusted Platform Module\n[(TPM).[8] Protecting domain credentials with CredGuard requires configuration and has](https://media.defense.gov/2019/Sep/09/2002180345/-1/-1/0/Leverage%20Modern%20Hardware%20Security%20Features%20-%20Copy.pdf)\n[limitations in protecting other types of credentials (e.g., WDigest and local accounts).[9]](https://docs.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard)\n\n[[10] CredGuard uses TPMs to protect stored credentials. TPMs function as a system](https://docs.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard-protection-limits)\nintegrity observer and trust anchor ensuring the integrity of the boot sequence and\nmechanisms (e.g., UEFI Secure Boot). Installation of Windows 11 requires TPM v2.0.\n\n[[11] Disabling WDigest and rolling expiring NTLM secrets in smartcards will further](https://docs.microsoft.com/en-us/windows/whats-new/windows-11-requirements)\n[protect other credentials not protected by CredGuard.[12][13]](https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/the-importnace-of-kb2871997-and-kb2928120-for-credential/ba-p/258478)\n\n**Establish Centralized Log Management**\n\n**Create a centralized log management system. Centralized logging applications allow**\nnetwork defenders to look for anomalous activity, such as out-of-place communications\nbetween devices or unaccountable login failures, in the network environment.\n\nForward all logs to a SIEM tool.\nEnsure logs are searchable.\nRetain critical and historic network activity logs for a minimum of 180 days.\n**If using M365, enable Unified Audit Log (UAL)—M365’s logging capability—which**\ncontains events from Exchange Online, SharePoint online, OneDrive, Azure AD,\nMicrosoft Teams, PowerBI, and other M365 services.\n**Correlate logs, including M365 logs, from network and host security devices.**\nThis correlation will help with detecting anomalous activity in the network environment\nand connecting it with potential anomalous activity in M365.\n\nIn addition to setting up centralized logging, organizations should:\n\n**Ensure PowerShell logging is turned on. Threat actors often use PowerShell to hide**\ntheir malicious activities.[14]\n**Update PowerShell instances to version 5.0 or later and uninstall all earlier versions**\nof PowerShell. Logs from prior versions are either non-existent or do not record enough\ndetail to aid in enterprise monitoring and incident response activities.\n**Confirm PowerShell 5.0 instances have module, script block, and transcription**\n**logging enabled.**\n**Monitor remote access/Remote Desktop Protocol (RDP) logs and disable unused**\nremote access/RDP ports.\n\n**Initiate a Software and Patch Management Program**\n\n\n-----\n\n**Consider using a centralized patch management system. Failure to deploy**\nsoftware patches in a timely manner makes an organization a target of opportunity,\nincreasing its risk of compromise. Organizations can ensure timely patching of software\nvulnerabilities by implementing an enterprise-wide software and patch management\n[program.[15]](https://media.defense.gov/2019/Sep/09/2002180319/-1/-1/0/Update%20and%20Upgrade%20Software%20Immediately.docx%20-%20Copy.pdf)\n\nIf an organization is unable to update all software shortly after a patch is\nreleased, prioritize patches for CVEs that are already known to be exploited\nor that would be accessible to the largest number of potential adversaries (such\nas internet-facing systems).\n**Subscribe to** **[CISA cybersecurity notifications and advisories to keep up with](https://us-cert.cisa.gov/ncas)**\nknown exploited vulnerabilities, security updates, and threats. This will assist\norganizations in maintaining situational awareness of critical software\nvulnerabilities and, if applicable, associated exploitation.\n**Sign up for CISA’s** **[cyber hygiene services, including vulnerability scanning, to help](https://www.cisa.gov/cyber-hygiene-services)**\nreduce exposure to threats. CISA’s vulnerability scanning service evaluates external\nnetwork presence by executing continuous scans of public, static IPs for accessible\nservices and vulnerabilities.\n\n**Employ Antivirus Programs**\n\n**Ensure that antivirus applications are installed on all organizations’ computers**\nand are configured to prevent spyware, adware, and malware as part of the operating\nsystem security baseline.\n**Keep virus definitions up to date.**\n**Regularly monitor antivirus scans.**\n\n**Use Endpoint Detection and Response Tools**\n\n**Utilize endpoint detection and response (EDR) tools. These tools allow a high**\ndegree of visibility into the security status of endpoints and can be an effective defense\nagainst threat actors. EDR tools are particularly useful for detecting lateral movement,\nas they have insight into common and uncommon network connections for each host.\n\n**Maintain Rigorous Configuration Management Programs**\n\n**Audit configuration management programs to ensure they can track and mitigate**\nemerging threats. Review system configurations for misconfigurations and security\nweaknesses. Having a robust configuration program hinders sophisticated threat\n[operations by limiting the effectiveness of opportunistic attacks.[16]](https://media.defense.gov/2019/Sep/09/2002180326/-1/-1/0/Actively%20Manage%20Systems%20and%20Configurations.docx%20-%20Copy.pdf)\n\n**Enforce the Principle of Least Privilege**\n\n**Apply the principle of least privilege. Administrator accounts should have the**\nminimum permissions they need to do their tasks. This can reduce the impact if an\nadministrator account is compromised.\n\n\n-----\n\n**For M365, assign administrator roles to role-based access control (RBAC) to**\nimplement the principle of least privilege. Given its high level of default privilege, you\nshould only use the Global Administrator account when absolutely necessary. Using\nAzure AD’s numerous other built-in administrator roles instead of the Global\nAdministrator account can limit assigning unnecessary privileges. Note: refer to the\n_[Microsoft documentation, Azure AD built-in roles, for more information about Azure](https://docs.microsoft.com/en-us/azure/active-directory/users-groups-roles/directory-assign-admin-roles)_\n_AD._\n**Remove privileges not expressly required by an account’s function or role.**\n**Ensure there are unique and distinct administrative accounts for each set of**\nadministrative tasks.\n**Create non-privileged accounts for privileged users, and ensure they use the non-**\nprivileged accounts for all non-privileged access (e.g., web browsing, email access).\n**Reduce the number of domain and enterprise administrator accounts, and**\nremove all accounts that are unnecessary.\n**Regularly audit administrative user accounts.**\n**Regularly audit logs to ensure new accounts are legitimate users.**\n**Institute a group policy that disables remote interactive logins, and use Domain**\nProtected Users Group.\n\nTo assist with identifying suspicious behavior with administrative accounts:\n\n**Create privileged role tracking.**\n**Create a change control process for all privilege escalations and role changes on**\nuser accounts.\n**Enable alerts on privilege escalations and role changes.**\n**Log privileged user changes in the network environment, and create an alert for**\nunusual events.\n\n**Review Trust Relationships**\n\n**Review existing trust relationships with IT service providers, such as managed**\nservice providers (MSPs) and cloud service providers (CSPs). Threat actors are known\nto exploit trust relationships between providers and their customers to gain access to\ncustomer networks and data.\n**Remove unnecessary trust relationships.**\n**Review contractual relationships with all service providers, and ensure contracts**\ninclude:\n\nSecurity controls the customer deems appropriate.\nAppropriate monitoring and logging of provider-managed customer systems.\nAppropriate monitoring of the service provider’s presence, activities, and\nconnections to the customer network.\nNotification of confirmed or suspected security events and incidents occurring on\nthe provider’s infrastructure and administrative networks.\n\n\n-----\n\n**_[Note: review CISA s page on APTs Targeting IT Service Provider Customers and](https://www.cisa.gov/uscert/APTs-Targeting-IT-Service-Provider-Customers)_** _CISA_\n_[Insights: Mitigations and Hardening Guidance for MSPs and Small and Mid-sized](https://cisa.gov/sites/default/files/publications/CISA%20Insights_Guidance-for-MSPs-and-Small-and-Mid-sized-Businesses_S508C.pdf)_\n_Businesses for additional recommendations for MSP and CSP customers._\n\n**Encourage Remote Work Environment Best Practices**\n\nWith the increase in remote work and use of VPN services due to COVID-19, the FBI, NSA,\nand CISA encourage regularly monitoring remote network traffic, along with employing the\nfollowing best practices. **_Note: for additional information, see joint NSA-CISA Cybersecurity_**\n_[Information Sheet: Selecting and Hardening Remote Access VPN Solutions.](https://media.defense.gov/2021/Sep/28/2002863184/-1/-1/0/CSI_SELECTING-HARDENING-REMOTE-ACCESS-VPNS-20210928.PDF)_\n\n**Regularly update VPNs, network infrastructure devices, and devices used for**\n**remote work environments with the latest software patches and security**\nconfigurations.\n**When possible, require MFA on all VPN connections. Physical security tokens are**\nthe most secure form of MFA, followed by authenticator applications. When MFA is\nunavailable, mandate that employees engaging in remote work use strong passwords.\n**Monitor network traffic for unapproved and unexpected protocols.**\n**Reduce potential attack surfaces by discontinuing unused VPN servers that may**\nbe used as a point of entry by adversaries.\n\n**Establish User Awareness Best Practices**\n\nCyber actors frequently use unsophisticated methods to gain initial access, which can often\nbe mitigated by stronger employee awareness of indicators of malicious activity. The FBI,\nNSA, and CISA recommend the following best practices to improve employee operational\nsecurity when conducting business:\n\n**Provide end user awareness and training. To help prevent targeted social**\nengineering and spearphishing scams, ensure that employees and stakeholders are\naware of potential cyber threats and how they are delivered. Also, provide users with\ntraining on information security principles and techniques.\n**Inform employees of the risks of social engineering attacks, e.g., risks associated**\nwith posting detailed career information to social or professional networking sites.\n**Ensure that employees are aware of what to do and whom to contact when they**\n**see suspicious activity or suspect a cyber intrusion to help quickly and efficiently**\nidentify threats and employ mitigation strategies.\n\n**Apply Additional Best Practice Mitigations**\n\n**Deny atypical inbound activity from known anonymization services, including**\ncommercial VPN services and The Onion Router (TOR).\n**Impose listing policies for applications and remote access that only allow systems**\nto execute known and permitted programs under an established security policy.\n**Identify and create offline backups for critical assets.**\n\n\n-----\n\n**Implement network segmentation.**\n**[Review CISA Alert AA20-120A: Microsoft Office 365 Security Recommendations for](https://us-cert.cisa.gov/ncas/alerts/aa20-120a)**\nadditional recommendations on hardening M365 cloud environments.\n\n## Rewards for Justice Program\n\nIf you have information on state-sponsored Russian cyber operations targeting U.S. critical\ninfrastructure, contact the Department of State’s Rewards for Justice Program. You may be\neligible for a reward of up to $10 million, which the Department is offering for information\nleading to the identification or location of any person who, while acting under the direction or\ncontrol of a foreign government, participates in malicious cyber activity against U.S. critical\ninfrastructure in violation of the Computer Fraud and Abuse Act (CFAA). Contact (202) 7027843 on WhatsApp, Signal, or Telegram, or send information via the Rewards for Justice\nsecure Tor-based tips line located on the Dark Web. For more details, refer to\n[rewardsforjustice.net.](https://rewardsforjustice.net/terrorist-rewards/foreign-malicious-cyber-activity-against-u-s-critical-infrastructure/)\n\n## Caveats\n\nThe information you have accessed or received is being provided “as is” for informational\npurposes only. The FBI, NSA, and CISA do not endorse any commercial product or service,\nincluding any subjects of analysis. Any reference to specific commercial products,\nprocesses, or services by service mark, trademark, manufacturer, or otherwise, does not\nconstitute or imply their endorsement, recommendation, or favoring by the FBI, NSA, or\nCISA.\n\n## Contact Information\n\nTo report suspicious activity related to information found in this Joint Cybersecurity Advisory,\ncontact your local FBI field office at [www.fbi.gov/contact-us/field-offices or the FBI’s 24/7](https://www.fbi.gov/contact-us/field-offices)\n[Cyber Watch (CyWatch) at (855) 292-3937 or by email at CyWatch@fbi.gov. When available,](http://10.10.0.46/mailto:cywatch@fbi.gov)\nplease include the following information regarding the incident: date, time, and location of the\nincident; type of activity; number of people affected; type of equipment used for the activity;\nthe name of the submitting company or organization; and a designated point of contact. To\nrequest incident response resources or technical assistance related to these threats, contact\nCISA at [Central@cisa.gov. For NSA client requirements or general cybersecurity inquiries,](http://10.10.0.46/mailto:central@cisa.gov)\ncontact the NSA Cybersecurity Requirements Center at (410) 854-4200 or\n[Cybersecurity_Requests@nsa.gov. Defense Industrial Base companies may additionally](http://10.10.0.46/mailto:Cybersecurity_Requests@nsa.gov)\nsign up for NSA’s free cybersecurity services, including Protective DNS, vulnerability\n[scanning, and threat intelligence collaboration at dib_defense@cyber.nsa.gov.](http://10.10.0.46/mailto:dib_defense@cyber.nsa.gov)\n\n## Appendix: Detailed Tactics, Techniques, and Procedures\n\n**[Reconnaissance [TA0043]](https://attack.mitre.org/tactics/TA0043/)**\n\n\n-----\n\nReconnaissance consists of techniques that involve adversaries actively or passively\ngathering information that can be used to support targeting. The adversary is known for\n[harvesting login credentials [T1589.001].[17]](https://attack.mitre.org/techniques/T1589/001)\n\n**ID** **Name** **Description**\n\n\nT1589.001 Gather Victim Identity\nInformation: Credentials\n\n**[Initial Access [TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)**\n\n\nAdversaries may gather credentials that can\nbe used during targeting.\n\n\nInitial Access consists of techniques that use various entry vectors to gain their initial\nfoothold within a network. For example, the adversary may obtain and abuse credentials of\nexisting accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or\n[Defense Evasion [T1078].[18] These specific actors obtained and abused credentials of](https://attack.mitre.org/techniques/T1078)\n[domain [T1078.002] and cloud accounts [T1078.004].[19] The actors also used external](https://attack.mitre.org/techniques/T1078/002)\n[remote services to gain access to systems [T1133].[20] The adversary took advantage of](https://attack.mitre.org/techniques/T1133)\nweaknesses in internet-facing servers and conducted SQL injection attacks against\n[organizations' external websites [T1190].[21] Finally, they sent spearphishing emails with a](https://attack.mitre.org/techniques/T1190)\n[malicious link in an attempt to gain access [T1566.002].[22]](https://attack.mitre.org/techniques/T1566/002)\n\n**ID** **Name** **Description**\n\n\nT1078 Valid\nAccounts\n\nT1078.002 Valid\nAccounts:\nDomain\nAccounts\n\nT1078.004 Valid\nAccounts:\nCloud\nAccounts\n\nT1133 External\nRemote\nServices\n\nT1190 Exploit PublicFacing\nApplication\n\n\nAdversaries may obtain and abuse credentials of existing\naccounts as a means of gaining Initial Access.\n\nAdversaries may obtain and abuse credentials of a domain\naccount as a means of gaining Initial Access, Persistence,\nPrivilege Escalation, or Defense Evasion.\n\nAdversaries may obtain and abuse credentials of a cloud\naccount as a means of gaining Initial Access, Persistence,\nPrivilege Escalation, or Defense Evasion.\n\nAdversaries may leverage external-facing remote services to\ninitially access and/or persist within a network.\n\nAdversaries may attempt to take advantage of a weakness\nin an internet-facing computer or program using software,\ndata, or commands in order to cause unintended or\nunanticipated behavior.\n\n\n-----\n\n**ID** **Name** **Description**\n\n\nT1566.002 Phishing:\nSpearphishing\nLink\n\n**[Persistence [TA0003]](https://attack.mitre.org/tactics/TA0003)**\n\n\nAdversaries may send spearphishing emails with a\nmalicious link in an attempt to gain access to victim\nsystems.\n\n\nPersistence consists of techniques that adversaries use to keep access to systems across\nrestarts, changed credentials, and other interruptions that could cut off their access. The\nadversary obtains and abuses credentials of existing accounts as a means of gaining Initial\n[Access, Persistence, Privilege Escalation, or Defense Evasion [T1078].[23]](https://attack.mitre.org/techniques/T1078)\n\n**ID** **Name** **Description**\n\n\nT1078 Valid\nAccounts\n\n\nAdversaries may obtain and abuse credentials of existing accounts as\na means of gaining Initial Access, Persistence, Privilege Escalation, or\nDefense Evasion.\n\n\n**[Privilege Escalation [TA0004]](https://attack.mitre.org/tactics/TA0004)**\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level\npermissions on a system or network. The adversary obtains and abuses credentials of\nexisting accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or\n[Defense Evasion [T1078].[24] Specifically in this case, credentials of cloud accounts](https://attack.mitre.org/techniques/T1078)\n\n[[T1078.004] were obtained and abused.[25]](https://attack.mitre.org/techniques/T1078/004)\n\n**ID** **Name** **Description**\n\n\nT1078 Valid\nAccounts\n\nT1078.004 Valid\nAccounts:\nCloud\nAccounts\n\n**[Defense Evasion [TA0005]](https://attack.mitre.org/tactics/TA0005)**\n\n\nAdversaries may obtain and abuse credentials of existing\naccounts as a means of gaining Initial Access.\n\nAdversaries may obtain and abuse credentials of a cloud\naccount as a means of gaining Initial Access, Persistence,\nPrivilege Escalation, or Defense Evasion.\n\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout\ntheir compromise. The adversary made its executables and files difficult to discover or\nanalyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in\n[transit [T1027].[26]](https://attack.mitre.org/techniques/T1027)\n\n**ID** **Name** **Description**\n\n\n-----\n\n**ID** **Name** **Description**\n\n\nT1027 Obfuscated\nFiles or\nInformation\n\n\nAdversaries may attempt to make an executable or file difficult to\ndiscover or analyze by encrypting, encoding, or otherwise\nobfuscating its contents on the system or in transit.\n\n\n**[Credential Access [TA0006]](https://attack.mitre.org/tactics/TA0006)**\n\nCredential Access consists of techniques for stealing credentials like account names and\npasswords. The adversary attempted to access or create a copy of the Active Directory (AD)\ndomain database to steal credential information, as well as obtain other information about\n[domain members such as devices, users, and access rights [T1003.003].[27] The adversary](https://attack.mitre.org/techniques/T1003/003)\nalso used a single or small list of commonly used passwords against many different accounts\n[to attempt to acquire valid account credentials [T1110.003].[28]](https://attack.mitre.org/techniques/T1110/003)\n\n**ID** **Name** **Description**\n\n\nT1003.003 OS\nCredential\nDumping:\nNTDS\n\nT1110.003 Brute\nForce:\nPassword\nSpraying\n\n**[Discovery [TA0007]](https://attack.mitre.org/tactics/TA0007)**\n\n\nAdversaries may attempt to access or create a copy of the\nActive Directory domain database to steal credential information,\nas well as obtain other information about domain members such\nas devices, users, and access rights.\n\nAdversaries may use a single or small list of commonly used\npasswords against many different accounts to attempt to acquire\nvalid account credentials.\n\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system\nand internal network. The adversary enumerated files and directories or searched in specific\n[locations of a host or network share for certain information within a file system [T1083].[29]](https://attack.mitre.org/techniques/T1083)\nIn addition, the adversary attempted to gather information on domain trust relationships that\nmay be used to identify lateral movement opportunities in Windows multi-domain or forest\n[environments [T1482].[30]](https://attack.mitre.org/techniques/T1482)\n\n**ID** **Name** **Description**\n\n\nT1083 File and\nDirectory\nDiscovery\n\nT1482 Domain\nTrust\nDiscovery\n\n**[Collection [TA0009]](https://attack.mitre.org/tactics/TA0009)**\n\n\nAdversaries may enumerate files and directories or may search in\nspecific locations of a host or network share for certain information\nwithin a file system.\n\nAdversaries may attempt to gather information on domain trust\nrelationships that may be used to identify lateral movement\nopportunities in Windows multi-domain/forest environments.\n\n\n-----\n\nCollection consists of both the techniques adversaries may use to gather information and the\nsources that information is collected from that are relevant to the adversary's objectives. The\nadversary leverages information repositories, such as SharePoint, to mine valuable\n[information [T1213.002].[31]](https://attack.mitre.org/techniques/T1213/002)\n\n**ID** **Name** **Description**\n\n\nT1213.002 Data from Information\nRepositories:\nSharePoint\n\n**[Command and Control [TA0011]](https://attack.mitre.org/tactics/TA0011)**\n\n\nAdversaries may leverage the SharePoint\nrepository as a source to mine valuable\ninformation.\n\n\nCommand and Control (C2) consists of techniques that adversaries may use to\ncommunicate with systems under their control within a victim network. The adversary\nchained together multiple proxies to disguise the source of malicious traffic. In this case,\nTOR and VPN servers are used as multi-hop proxies to route C2 traffic and obfuscate their\n[activities [T1090.003].[32]](https://attack.mitre.org/techniques/T1090/003)\n\n**ID** **Name** **Description**\n\n\nT1090.003 Proxy: Multihop Proxy\n\n## Additional Resources\n\n\nTo disguise the source of malicious traffic, adversaries may\nchain together multiple proxies.\n\n\n\n[1] NSA, CISA, FBI, NCSC Cybersecurity Advisory: Russian GRU Conducting Global Brute\nForce Campaign to Compromise Enterprise and Cloud Environments, 1 July 2021.\n\n[2] NSA Cybersecurity Advisory: [Mitigating Recent VPN Vulnerabilities, 7 October 2019.](https://media.defense.gov/2019/Oct/07/2002191601/-1/-1/0/CSA-MITIGATING-RECENT-VPN-VULNERABILITIES.PDF)\n\n[3] NSA, CISA, FBI, NCSC Cybersecurity Advisory: Russian GRU Conducting Global Brute\nForce Campaign to Compromise Enterprise and Cloud Environments, 1 July 2021.\n\n[4] Microsoft Article: [AD Forest Recovery – Resetting the krbtgt password, 29 July 2021.](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/ad-forest-recovery-resetting-the-krbtgt-password)\n\n[5] Microsoft GitHub: [New-KrbtgtKeys.ps1, 14 May 2020.](https://github.com/microsoft/New-KrbtgtKeys.ps1)\n\n[6] NSA Cybersecurity Information: [Defend Privileges and Accounts, August 2019.](https://media.defense.gov/2019/Sep/09/2002180330/-1/-1/0/Defend%20Privileges%20and%20Accounts%20-%20Copy.pdf)\n\n[7] Microsoft Article: [Group Managed Service Accounts Overview, 29 July 2021.](https://docs.microsoft.com/en-us/windows-server/security/group-managed-service-accounts/group-managed-service-accounts-overview)\n\n[8] NSA Cybersecurity Information: [Leverage Modern Hardware Security Features, August](https://media.defense.gov/2019/Sep/09/2002180345/-1/-1/0/Leverage%20Modern%20Hardware%20Security%20Features%20-%20Copy.pdf)\n2019.\n\n[9] Microsoft Article: Protect derived domain credentials with Windows Defender Credential\nGuard, 3 December 2021.\n\n[10] Microsoft Article: [Windows Defender Credential Guard protection limits, 3 December](https://docs.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard-protection-limits)\n2021.\n\n[11] Microsoft Article: [Windows 11 requirements, 30 November 2021.](https://docs.microsoft.com/en-us/windows/whats-new/windows-11-requirements)\n\n[12] Microsoft Blog Post: The Importance of KB2871997 and KB2928120 for Credential\n\n\n-----\n\nProtection, 20 September 2021.\n\n[13] Microsoft Article: [What’s New in Credential Protection, 7 January 2022.](https://docs.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/whats-new-in-credential-protection)\n\n[[14] NSA Cybersecurity Factsheet: PowerShell: Security Risks and Defenses, 1 December](https://www.iad.gov/iad/library/ia-guidance/security-tips/powershell-security-risks-and-defenses.cfm)\n2016.\n\n[[15] NSA Cybersecurity Information: Update and Upgrade Software Immediately, August](https://media.defense.gov/2019/Sep/09/2002180319/-1/-1/0/Update%20and%20Upgrade%20Software%20Immediately.docx%20-%20Copy.pdf)\n2019.\n\n[[16] NSA Cybersecurity Information: Actively Manage Systems and Configurations, August](https://media.defense.gov/2019/Sep/09/2002180326/-1/-1/0/Actively%20Manage%20Systems%20and%20Configurations.docx%20-%20Copy.pdf)\n2019.\n\n[17] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[18] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[19] MITRE Software: [Cobalt Strike, 18 October 2021.](https://attack.mitre.org/software/S0154/)\n\n[20] Based on technical information shared by Mandiant.\n\n[21] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[22] Based on technical information shared by Mandiant.\n\n[23] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[24] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[25] MITRE Software: [Cobalt Strike, 18 October 2021.](https://attack.mitre.org/software/S0154/)\n\n[26] MITRE Software: [Fysbis, 6 November 2020.](https://attack.mitre.org/software/S0410/)\n\n[27] MITRE Software: [Koadic, 30 March 2020.](https://attack.mitre.org/software/S0250/)\n\n[28] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[29] Based on technical information shared by Mandiant.\n\n[30] Based on technical information shared by Mandiant.\n\n[31] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n[32] MITRE Groups: [APT28, 18 October 2021.](https://attack.mitre.org/groups/G0007)\n\n## Revisions\n\nFebruary 16, 2022: Initial Version\n\n[This product is provided subject to this Notification and this](https://www.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa22-047a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-16 - Alert (AA22-047A) Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology.pdf"
    ],
    "report_names": [
        "2022-02-16 - Alert (AA22-047A) Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535735,
    "ts_updated_at": 1743041724,
    "ts_creation_date": 1653786445,
    "ts_modification_date": 1653786445,
    "files": {
        "pdf": "https://archive.orkl.eu/d797790e988ead4ad046809d38fcfd5d453fe664.pdf",
        "text": "https://archive.orkl.eu/d797790e988ead4ad046809d38fcfd5d453fe664.txt",
        "img": "https://archive.orkl.eu/d797790e988ead4ad046809d38fcfd5d453fe664.jpg"
    }
}