{
    "id": "5c246159-8aae-48e9-a4f1-a5ffaf331720",
    "created_at": "2023-01-12T15:02:49.476662Z",
    "updated_at": "2025-03-27T02:05:49.234801Z",
    "deleted_at": null,
    "sha1_hash": "f82ee06f62cb4864a240b50f26ab701cd0d5961d",
    "title": "2022-02-15 - How the Russia-Ukraine conflict is impacting cybercrime",
    "authors": "",
    "file_creation_date": "2022-05-25T12:20:26Z",
    "file_modification_date": "2022-05-25T12:20:26Z",
    "file_size": 63094,
    "plain_text": "# How the Russia-Ukraine conflict is impacting cybercrime\n\n**[intel471.com/blog/russia-ukraine-conflict-cybercrime-underground](https://intel471.com/blog/russia-ukraine-conflict-cybercrime-underground)**\n\nFinancially-motivated actors have been quiet, but that could change as the conflict escalates.\n\nFeb 15, 2022\n\nIntel 471 has been monitoring how the ongoing tension between Russia and Ukraine is\nimpacting the cybercrime underground. While financially-motivated actors have yet to show\ntheir inclination to leverage the conflict for personal gain, the recent change of course from\nRussian law enforcement in the form of arrests and takedowns show that the country will\nleverage the underground for diplomatic advantage in the same way it does for its\nintelligence purposes.\n\nWhile there have been cyberattacks on Ukrainian entities over the past month, Intel 471 has\nnot observed any evidence that these attacks have been carried out by financially-motivated\nactors. An attack carried out in January, in which Ukrainian websites were defaced as a cover\n[to launch destructive malware known as WhisperGate, has not attracted much attention from](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\nunderground actors. Of the discussions we observed, a low volume of actors elaborated on\nhow the attacks were committed and spoke on what they believed to be weaknesses in\nUkrainian critical infrastructure. The lack of discussion fits the methodology of financiallymotivated actors: attacks like WhisperGate are difficult to monetize. Additionally, a good\nportion of these forums are pro-Russian in nature, with forum moderators frequently\ndiscouraging or outright banning discussion threads that discuss politics.\n\nAside from the attack mentioned above, we also observed a small concentration of\nadvertisements and offers related to data tied to Ukrainian government organizations. While\nthe timing of the offers might suggest the actors used the current Russia-Ukraine tensions as\na motivator, or perhaps nation-state affiliated actors were at the helm in some way, we assess\nthese reasons were likely not the case. This assessment comes as the volume of Ukrainian\ngovernment data mirrors other instances we’ve observed over the past five years, when\ngeopolitical tensions were calm.\n\nConversely, there has been a lot of action in the form of Russian law enforcement arresting\nvarious alleged cybercriminals over the past three months. Most recently, three underground\nstores trading in compromised payment card data – Ferum shop, Trump Dumps and UAS\nShop – along with the Sky Fraud forum went offline, with a note indicating they allegedly\nwere seized by Russia’s Ministry of Internal Affairs (MVD). Later the same day, the Russian\n[TASS press agency reported six individuals were arrested in Russia on cybercrime charges.](https://tass.ru/obschestvo/13637797)\n\n\n-----\n\nWhile it s unclear how everyone arrested is tied to the affected forums, one of those men —\n[Andrey Novak — has been linked to UNICC, another carding forum](https://intel471.com/glossary#:~:text=C-,Carding,-Credit%20or%20debit) [that “closed” last month.](https://www.zdnet.com/article/dark-web-carding-platform-unicc-shuts-up-shop-after-making-millions/)\nNovak was also among those charged in absentia in 2018 by the U.S. Department of Justice\nfor allegedly working with notorious malware and carding forum Infraud.\n\n[These arrests, combined with the actions taken against the REvil ransomware gang, are an](https://intel471.com/blog/revil-ransomware-arrests-cybercrime-underground)\nunprecedented development in how Russian law enforcement deals with cybercriminals\nwithin its own borders. For decades, Russia has been extremely lenient with cybercriminals\nthat have shown ties to Russia and a modus operandi of targeting countries that don’t belong\nto the Commonwealth of Independent States (CIS), an intergovernmental organization which\nincludes Russia and former Soviet states. Cybercriminals have long developed their\ntechniques, tactics, and procedures (TTPs) in order to purposely avoid targeting CIS\ncountries and businesses that operate within them, while forum admins and other organized\ngroups have banned any activity aimed at these countries.\n\nIt is possible that the Russian administration has authorized these law enforcement actions\nas a diplomatic gesture to Western governments, given that Russia’s domestic security\nagency, the Federal Security Service (FSB), has publicly said some of the arrests were\nconducted in conjunction with U.S. law enforcement. Russia’s desire to publicize these\nactions through domestic and international mainstream outlets and social media platforms\nsuggests the administration is pushing a message of cooperation and resolution. Should\ntensions cool between Ukraine and Russia, we assess it is possible that Russian law\nenforcement will return to status quo leniency for these cybercriminals. Until then, Russianbased threat actors could see their country’s law enforcement’s recent actions as a deterrent\nto conducting cybercrime activities, which would prove a worthy cause benefiting\norganizations around the world.\n\nIt’s also likely that as the situation progresses, advantageous financially-motivated threat\nactors may seek to target entities in Ukraine that may be more vulnerable due to understaffed\norganizations or overburdened network infrastructure. Criminal actors may seek to purchase\n[access credentials, personally identifiable information (PII) or intellectual property to](https://intel471.com/glossary/pii)\ncapitalize on the distractions, and financially motivated actors could act as suppliers to fill\nthat gap.\n\nIntel 471 will continue to monitor, analyze and report on the underground response as the\nRussia-Ukraine conflict develops.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-15 - How the Russia-Ukraine conflict is impacting cybercrime.pdf"
    ],
    "report_names": [
        "2022-02-15 - How the Russia-Ukraine conflict is impacting cybercrime.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535769,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653481226,
    "ts_modification_date": 1653481226,
    "files": {
        "pdf": "https://archive.orkl.eu/f82ee06f62cb4864a240b50f26ab701cd0d5961d.pdf",
        "text": "https://archive.orkl.eu/f82ee06f62cb4864a240b50f26ab701cd0d5961d.txt",
        "img": "https://archive.orkl.eu/f82ee06f62cb4864a240b50f26ab701cd0d5961d.jpg"
    }
}