{
    "id": "5caf88bc-38a1-4d75-b66e-01fc5ad57dd6",
    "created_at": "2023-01-12T15:01:58.978103Z",
    "updated_at": "2025-03-27T02:16:40.117805Z",
    "deleted_at": null,
    "sha1_hash": "8334d0019769070d45f7f00709140146b18b393c",
    "title": "2019-06-18 - Mobile Campaign ‘Bouncing Golf’ Affects Middle East",
    "authors": "",
    "file_creation_date": "2022-05-29T01:35:25Z",
    "file_modification_date": "2022-05-29T01:35:25Z",
    "file_size": 1295554,
    "plain_text": "# Mobile Campaign ‘Bouncing Golf’ Affects Middle East\n\n**[trendmicro.com/en_us/research/19/f/mobile-cyberespionage-campaign-bouncing-golf-affects-middle-east.html](https://www.trendmicro.com/en_us/research/19/f/mobile-cyberespionage-campaign-bouncing-golf-affects-middle-east.html)**\n\nJune 18, 2019\n\nWe uncovered a cyberespionage campaign targeting Middle Eastern countries. We named\nthis campaign “Bouncing Golf” based on the malware’s code in the package named “golf.”\nThe malware involved, which Trend Micro detects as AndroidOS_GolfSpy.HRX, is notable\nfor its wide range of cyberespionage capabilities. Malicious codes are embedded in apps that\nthe operators repackaged from legitimate applications. Monitoring the command and control\n(C&C) servers used by Bouncing Golf, we’ve so far observed more than 660 Android devices\ninfected with GolfSpy. Much of the information being stolen appear to be military-related.\n\nThe campaign’s attack vector is also interesting. These repackaged, malware-laden apps are\nneither on Google Play nor popular third-party app marketplaces, and we only saw the\nwebsite hosting the malicious apps being promoted on social media when we followed\nGolfSpy’s trail. We were also able to analyze some GolfSpy samples sourced from the Trend\nMicro [mobile app reputation service.](https://mars.trendmicro.com/)\n\nAlso of note is Bouncing Golf’s possible connection to a previously reported mobile\n[cyberespionage campaign that researchers named Domestic Kitten. The strings of code, for](https://research.checkpoint.com/domestic-kitten-an-iranian-surveillance-operation/)\none, are similarly structured. The data targeted for theft also have similar formats.\n\n\n-----\n\nFigure 1. GolfSpy’s infection chain\n\n**GolfSpy's Potential Impact**\n\nGiven GolfSpy’s information-stealing capabilities, this malware can effectively hijack an\ninfected Android device. Here is a list of information that GolfSpy steals:\n\nDevice accounts\nList of applications installed in the device\nDevice’s current running processes\nBattery status\nBookmarks/Histories of the device’s default browser\nCall logs and records\nClipboard contents\nContacts, including those in VCard format\nMobile operator information\nFiles stored on SDcard\nDevice location\nList of image, audio, and video files stored on the device\n\n\n-----\n\nStorage and memory information\nConnection information\nSensor information\nSMS messages\nPictures\n\nGolfSpy also has a function that lets it connect to a remote server to fetch and perform\ncommands, including: searching for, listing, deleting, and renaming files as well as\ndownloading a file into and retrieving a file from the device; taking screenshots; installing\nother application packages (APK); recording audio and video; and updating the malware.\n\n**Technical Analysis**\n\nThe repackaged applications are embedded with malicious code, which can be found in the\n_com.golf package. These repackaged apps pose as communication, news, lifestyle, book,_\nand reference apps popularly used in the Middle East. The GolfSpy malware embedded in\nthe apps is hardcoded with an internal name used by the attacker.\n\n\n-----\n\nFigure 2. Icons of the apps that Bouncing Golf’s operators repackaged (top) and a\ncomparison of packages between the original legitimate app (bottom left) and GolfSpy\n(bottom right)\n\nFigure 3. GolfSpy’s configurations encoded by a custom algorithm (right) and its decoded\nversion (left)\n\n\n-----\n\nAs shown in Figure 3, GolfSpy s configurations (e.g., C&C server, secret keys) are encoded\nby a customized algorithm. After it is launched, GolfSpy will generate a unique ID for the\naffected device and then collect its data such as SMS, contact list, location, and accounts in\nthis format: “%,[],time”(shown in Figure 4). The information is written into a file on the\ndevice. The attacker can choose the data types to collect, which are written in a certain\nformat.\n\nFigure 4. Code snippet showing GolfSpy generating UUID\n\nThe value of % is in the range of 1-9 or a-j. Each value represents a different type of data to\nsteal from the device:\n\n**Value** **Data Type**\n\n1 Accounts\n\n2 Installed APP list\n\n3 Running processes list\n\n4 Battery status\n\n5 Browser bookmarks and histories\n\n6 Call logs\n\n7 Clipboard\n\n\n-----\n\n8 Contacts\n\n9 Mobile operator information\n\na File list on SD card\n\nb Location\n\nc Image list\n\nd Audio list\n\ne Video list\n\nf Storage and memory information\n\ng Connection information\n\nh Sensors information\n\ni SMS messages\n\nj VCard format contacts\n\nTable 1. The type of data corresponding to the value coded in GolfSpy\n\nFigure 5 shows the code snippets that are involved in monitoring and recording the device’s\nphone call. It will also take a photo using the device’s front camera when the user wakes the\ndevice.\n\nApart from collecting the above data, the spyware monitors users’ phone calls, records them,\nand saves the recorded file on the device. GolfSpy encrypts all the stolen data using a\nsimple XOR operation with a pre-configured key before sending it to the C&C server using\nthe HTTP POST method.\n\n\n-----\n\nFigure 5. Code snippets showing how GolfSpy monitors phone calls via register receiver (top\nleft), its actions when the device is woken up (top right), and how it encrypts the stolen data\n(bottom)\n\nThe malware retrieves commands from the C&C server via HTTP, and attackers can steal\nspecific files on the infected device. The command is a constructed string split into three\nparts using \"<DEL>\" as a separator. The first part is the target directory, the second is a\nregular expression used to match specific files, while the last part is an ID.\n\nFigure 6. Example of a command that steals specific files from an infected device’s\napplication (top), and GolfSpy’s parse-and-perform command (bottom)\n\nApart from the HTTP POST method, GolfSpy also creates a socket connection to the remote\nC&C server in order to receive and perform additional commands. Stolen data will also be\nencrypted and sent to the C&C server via the socket connection. The encryption key is\ndifferent from the one used for sending stolen data via HTTP.\n\n\n-----\n\nFigure 7. The additional commands that attackers can carry out via a socket connection (top)\nand the key used to encrypt the stolen data (bottom)\n\n**Correlating Bouncing Golf's Activities**\n\nWe monitored Bouncing Golf’s C&C-related activities and saw that the campaign has\naffected more than 660 devices as of this writing. The small or limited number is\nunderstandable given the nature of this campaign, but we also expect it to increase or even\ndiversify in terms of distribution. Most of the affected devices were located in the Middle East,\nand many of the stolen data we saw is military-related (e.g., images, documents).\n\nBouncing Golf’s operators also try to cover their tracks. The registrant contact details of the\nC&C domains used in the campaign, for instance, were masked. The C&C server IP\naddresses used also appear to be disparate, as they were located in many European\ncountries like Russia, France, Holland, and Germany.\n\nIt’s not a definite correlation, but Bouncing Golf also seems to have a connection with\nDomestic Kitten due to similarities we found in their code. For example, the Android malware\nthat both deploy share the same strings of code for their decoding algorithm. The data that\nDomestic Kitten steals follows a similar format with Bouncing Golf’s, with each type of data\nhaving a unique identifying character. It’s also worth noting that both campaigns repackage\napps that are commonly used in their target’s countries, such as Telegram, Kik, and Plus\nmessaging apps.\n\n\n-----\n\nFigure 8. Code snippets showing: the decoding algorithm shared by both Bouncing Golf and\nDomestic Kitten (top), the format of data that Domestic Kitten’s malware targets to steal\n(center), and how both Bouncing Golf (bottom left) and Domestic Kitten (bottom right) use \"\n<DEL>\" as a separator in their command strings.\n\n\n-----\n\nAs we ve seen in last year s [mobile threat landscape, we expect more cyberespionage](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup/2018-mobile-threat-landscape)\ncampaigns targeting the mobile platform given its ubiquity, employing tried-and-tested\ntechniques to lure unwitting users. The extent of information that these kinds of threats can\nsteal is also significant, as it lets attackers virtually take over a compromised device. Users\n[should adopt best practices, while organizations should ensure that they balance the need](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/the-case-for-making-byod-safe)\nfor [mobility and the importance of security.](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/iot-devices-in-the-workplace-security-risks-and-threats-to-byod-environments)\n\n[End users and enterprises can also benefit from multilayered mobile security solutions such](https://www.av-test.org/en/antivirus/mobile-devices/android/november-2017/trend-micro-mobile-security--antivirus-9.1-174421/)\nas [Trend Micro™ Mobile Security™ .](https://www.trendmicro.com/en_us/forHome/products/mobile-security.html) [Trend Micro™ Mobile Security for Enterprise provides](https://www.trendmicro.com/en_us/business/products/user-protection/sps/mobile.html)\ndevice, compliance and application management, data protection, and configuration\nprovisioning, as well as protects devices from attacks that exploit vulnerabilities, preventing\nunauthorized access to apps, and detecting and blocking malware and fraudulent\nwebsites. Trend Micro’s Mobile App Reputation Service (MARS) covers Android and iOS\n[threats using leading sandbox and machine learning technologies, protecting devices against](https://www.trendmicro.com/vinfo/us/security/definition/machine-learning/)\nmalware, zero-day and known exploits, privacy leaks, and application vulnerabilities.\n\n[A list of indicators of compromise (IoCs) is in this appendix.](https://documents.trendmicro.com/assets/appendix-mobile-cyberespionage-campaign-bouncing-golf-affects-middle-east.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-18 - Mobile Campaign ‘Bouncing Golf’ Affects Middle East.pdf"
    ],
    "report_names": [
        "2019-06-18 - Mobile Campaign ‘Bouncing Golf’ Affects Middle East.pdf"
    ],
    "threat_actors": [
        {
            "id": "30f6ddb3-f5aa-4b78-a1a5-e37c42b2c560",
            "created_at": "2022-10-25T16:07:23.544297Z",
            "updated_at": "2025-03-27T02:02:09.855532Z",
            "deleted_at": null,
            "main_name": "Domestic Kitten",
            "aliases": [
                "APT-C-50",
                "Bouncing Golf"
            ],
            "source_name": "ETDA:Domestic Kitten",
            "tools": [
                "FurBall",
                "GolfSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "44d5df14-6a25-41d6-a54c-7c7ebac358cf",
            "created_at": "2023-01-06T13:46:38.817312Z",
            "updated_at": "2025-03-27T02:00:02.926727Z",
            "deleted_at": null,
            "main_name": "Domestic Kitten",
            "aliases": [
                "Bouncing Golf",
                "APT-C-50"
            ],
            "source_name": "MISPGALAXY:Domestic Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c80783db-2b34-4321-ac7e-9a13692ffa31",
            "created_at": "2022-10-25T15:50:23.853579Z",
            "updated_at": "2025-03-27T02:00:55.55862Z",
            "deleted_at": null,
            "main_name": "Bouncing Golf",
            "aliases": [
                "Bouncing Golf"
            ],
            "source_name": "MITRE:Bouncing Golf",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535718,
    "ts_updated_at": 1743041800,
    "ts_creation_date": 1653788125,
    "ts_modification_date": 1653788125,
    "files": {
        "pdf": "https://archive.orkl.eu/8334d0019769070d45f7f00709140146b18b393c.pdf",
        "text": "https://archive.orkl.eu/8334d0019769070d45f7f00709140146b18b393c.txt",
        "img": "https://archive.orkl.eu/8334d0019769070d45f7f00709140146b18b393c.jpg"
    }
}