{
    "id": "5cbdee82-b0f5-490f-bc7b-196b578b5ec4",
    "created_at": "2022-10-25T16:48:19.669391Z",
    "updated_at": "2025-03-27T02:13:34.269988Z",
    "deleted_at": null,
    "sha1_hash": "011d85f9602c8af14d9cf5bb0721633c1702f8bc",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-09-22T16:03:42Z",
    "file_modification_date": "2022-09-22T16:03:42Z",
    "file_size": 3108227,
    "plain_text": "# Report on APT Attacks by\n BlackTech\n\n### NTT Security Holdings Corporation\n\n Japan SOC\n\n\n-----\n\n## Objective of Report\n\nNTT Security Holdings Corporation Japan Security Operation Center provides\n\nManaged Security Service (MSS). We monitor our client systems round-the\nclock, find security incidents promptly and provide best solutions. We perform\n\nvarious research on latest threats and output the achievements as black lists,\n\ncustom signatures and Indicators of Compromise (IoCs). These knowledges are\n\nalso used by our SOC analysts.\n\nOur SOC has been monitoring attacks by one of well-known APT groups,\n\nBlackTech. Though many organizations have been reported the malware used\n\nby BlackTech, our SOC publishes this whitepaper discussing the latest attacks\n\nby BlackTech based on the actual attacks we monitored in 2021. We expect that\n\nthis whitepaper contributes to better defense against attacks from BlackTech.\n\n\n**1**\n\n\n-----\n\n## Table of Contents\n\n##### Objective of Report ........................................................ 1 Preface ........................................................................ 3 1. Introduction ............................................................. 4 2. Attack Overview ........................................................ 5\n\n2.1. Spear Phishing ................................................................................. 5\n\n2.2. Vulnerability Exploitation (on server) ........................................................ 7\n\n2.3. Malware Families ............................................................................... 8\n##### 3. Malware Analysis ...................................................... 9\n\n3.1. Flagpro ........................................................................................... 9\n\n3.2. SelfMake Service .............................................................................. 13\n\n3.3. SelfMake Loader .............................................................................. 14\n\n3.4. HeavyROT Loader ............................................................................ 17\n\n3.5. AresPYDoor .................................................................................... 22\n\n3.6. Spider RAT ..................................................................................... 24\n\n3.7. BTSDoor ........................................................................................ 31\n\n3.8. Gh0stTimes .................................................................................... 33\n\n3.9. TSCookie ....................................................................................... 37\n\n3.10. ELF_TSCookie ................................................................................ 41\n\n3.11. IamDown ........................................................................................ 44\n\n3.12. ELF_Bifrose .................................................................................... 49\n\n3.13. ELF_PLEAD .................................................................................... 53\n##### 4. Countermeasures .................................................... 57 5. Postface ................................................................ 59 6. About Report .......................................................... 60 7. References ............................................................ 61 8. Appendix ............................................................... 63\n\n\n**2**\n\n\n-----\n\n## Preface\n\nNTT Security Holdings Corporation Japan Security Operation Center has been\n\nmonitoring active attacks from APT group BlackTech. This report covers the\n\nfollowing topics on the attacks based on our research.\n\n⚫ Summary of attacks by BlackTech focusing on their initial attack vector,\n\nthat are spear phishing emails and exploiting server vulnerabilities.\n\n⚫ Result of analysis on the malware used by BlackTech.\n\n⚫ Consideration on the logic to protect from attacks by BlackTech.\n\nAppendix contains the list of hash values that we obtained during our research.\n\nThis would help to prevent infection or isolate the victims.\n\n\n**3**\n\n\n-----\n\n## 1. Introduction\n\nIt is known that APT group BlackTech (also called as Palmerworm, Red Djinn,\n\nEarth Hundun or HUAPI) had started their activity at the latest 2012. They have\n\nbeen targeting organizations based in Eastern Asia, especially in Taiwan and\n\nJapan. Their main objective seems to steal sensitive information from target\n\norganizations.\n\nBlackTech utilizes various malware families. Some of them are publicly\n\navailable (Bifrose or Gh0st RAT) and others are self-developed (TSCookie or\n\nPLEAD). They have kept developing new malwares, which means that they are\n\nactively working.\n\nOur SOC has observed attacks by BlackTech, but the number of attacks rapidly\n\nincreased around 2020. Our SOC has observed they repeatedly attacked several\n\norganizations in telecommunication, defense and mass media industries. In\n\nmany cases, they established their initial foothold in overseas branch office of\n\nJapanese companies, then intruded into mission critical system in headquarters.\n\nIt is highly probable that BlackTech keep targeting Japanese companies,\n\ntherefore implementing proper countermeasures both in remote office and\n\nheadquarters is required to protect from their attacks. This whitepaper reviews\n\nand summarizes the BlackTech's attack campaigns and malware targeting\n\nJapanese organizations that our SOC observed in 2021. We hope that this\n\ncontent will help considering and implementing effective countermeasures to\n\nprotect each organization.\n\n\n**4**\n\n\n-----\n\n## 2. Attack Overview\n\nOrigins of BlackTech attacks targeting Japanese organizations are almost\n\neither of below.\n\n1. Spear phishing\n\n2. Vulnerability exploitation (on server)\n\n### 2.1. Spear Phishing\n\nMost of the attacks we observed started with spear phishing. An attacker\n\nsends an email pretended to be sent from a business partner to a user. As soon\n\nas opening the attached file, the user is infected by malware. The mail body and\n\nattached file are so sophisticated that it is difficult for the user to feel odd at a\n\nglance. Our SOC has observed attacks that leveraged real internal document\n\nused in the target organization in the past.\n\nThe attached file was either an executable file with double file extension or\n\nMicrosoft Excel file in xlsm format. These files can be contained in an archive\n\nfile including RAR format. The archive file is password-protected, and the\n\npassword is included in the mail body.\n\nOur SOC had observed several xlsm files (also called as LAMICE [1]) and\n\nmacros embedded on them were very similar. This suggests that all of these\n\nfiles were created by single tool.\n\n\n**5**\n\n\n-----\n\n**Figure 1. Macro example BlackTech frequently uses**\n\nInterestingly, it is observed that APT group Blackgear had used very similar\n\nmacro during their attacks. This implies that the tool that generate this macro\n\ncould be shared among multiple APT groups or BlackTech and Blackgear are\n\nclosely related.\n\n\n**6**\n\n\n-----\n\n### 2.2. Vulnerability Exploitation (on server)\n\nBlackTech has been abused various vulnerabilities in their attacks. According\n\nto the blog article by JPCERT/CC [2], there were many tools that can exploit\n\nvarious vulnerabilities on C&C server operated by BlackTech. It is also reported\n\n[3][4][5] that they had actually abused vulnerabilities on Microsoft Exchange\n\nServer.\n\nSuccessful exploitation results in malware execution. Using the malware, the\n\nattacker collects environmental information, repeats lateral movement, and go\n\ndeeper into the target organization. It is also observed that they use certain\n\nmalware family on different platforms. For example, they use ELF Bifrose on\n\nLinux environment and PE Bifrose on Windows environment.\n\n\n**7**\n\n\n-----\n\n### 2.3. Malware Families\n\nBlackTech utilize various malware families. The figure below summarizes the\n\nmalware families that they use by attacking vectors.\n\n**Figure 2. Malware families used by BlackTech**\n\n\n**8**\n\n\n-----\n\n## 3. Malware Analysis\n\n### 3.1. Flagpro\n\nFlagpro is malware used in initial phases of an attack to investigate a target\n\nenvironment and download and execute further malware [6][7]. Flagpro (v1.0)\n\nmay have been used in attacks of October 2020, and the new Flagpro (v2.0)\n\nusing the MFC (Microsoft Foundation Class) library may have been used after\n\nJuly 2021.\n\nThe main functions of Flagpro are as follows.\n\n⚫ Download and execute tool.\n\n⚫ Execute OS commands and send their results.\n\n⚫ Collect of authentication information stored in Windows and exfiltrate\n\nof collected information.\n\n#### 3.1.1. Use of COM object\n\nFlagpro uses IWebBrowser2 interface and other interfaces from Internet\n\nExplorer’s COM object to handle access to and from a C&C server.\n\n**Figure 3. Use of COM object for external access**\n\n\n**9**\n\n\n-----\n\n#### 3.1.2. Auto close of dialog\n\nFlagpro automatically closes dialogs, which appear when accessing external\n\nsites, such as proxy authentication confirmation dialogs. We assume that the\n\nauto-close function was implemented to keep users from realizing that Flagpro\n\nhas accessed an external site.\n\n#### 3.1.3. Inserting dummy codes\n\nFlagpro is obfuscated by inserting dummy code repeatedly. The obfuscation\n\ntechnique is often implemented in the malware used by BlackTech.\n\n**Figure 4. Insertion of dummy functions**\n\n\n**10**\n\n\n-----\n\n#### 3.1.4. Control commands\n\nControl commands received from C&C server are encoded in Base64. Decoded\n\ncommands used in Flagpro (v2.0) have the following format.\n\n**Figure 5. Flagpro command format**\n\nThe Download Command format is shown in Figure 6, and consists of the\n\nstring “Exec”, “Yes”, and the URL path to the download site. The string “Exec” is\n\nan activity flag, which must be present in both Download Command 1 and 2 in\n\nFigure 5 for the main process such as downloading and executing OS commands\n\nto take place. The string \"Yes\" is the execution flag; without it, the downloaded\n\nfile will not be executed.\n\n**Figure 6. Download Command format**\n\n#### 3.1.5. C&C Communication\n\nFlagpro uses HTTP protocol to communicate with C&C server. As shown in\n\nTable 1, it switches the URL path for each communication purpose. In addition,\n\nwhen this malware sends the results of OS commands execution and collected\n\nauthentication information, the contents are encoded in Base64 format and sent\n\nto the C&C server as URL parameter values.\n\n\n**11**\n\n\n-----\n\n|Table 1. The URL paths and queries for each communication purpose|Col2|\n|---|---|\n|URL path and query Purpose||\n|/index.html|Requesting the control commands|\n|/index.htmld?flag=[Encoded Data]|Sending the results of OS commands execution|\n|/index.htmld?flagpro=[Encoded Data]|Sending the authentication information|\n\n\n#### 3.1.6. Indicators of Compromise (IoCs)\n\n⚫ URL path\n\n⚫ index.htmld?flag=[Base64 Encoded String]\n\n⚫ index.htmld?flagpro=[Base64 Encoded String]\n\n⚫ File path\n\n⚫ %TEMP%\\~MY[Uppercase Hexadecimal Value (16bit)].tmp\n\n⚫ %TEMP%\\~MY[Uppercase Hexadecimal Value (16bit)].tmp.exe\n\n⚫ Mutex\n\n⚫ 71564__40Fllk293_DD71_4715_A3177782516DB5__71564_\n\n⚫ 71564__40Fllk293_DD71_4715_A55778278645__71564_\n\n⚫ 71564__40Fllk293_DD71_4715_A317try516DB5__71564_\n\n\n**12**\n\n\n-----\n\n### 3.2. SelfMake Service\n\nSelfMake Service is a loader that loads and executes malware on the infected\n\nhosts. It is designed to run as Windows Service. Besides, according to the article\n\n[5], this loader executes SelfMake Loader described on the next section.\n\nSome samples of SelfMake Service not only load and execute malware, but\n\nalso kill the legitimate splwow64.exe process and execute malicious\n\nsplwow64.exe that has been overwritten with the malware on the infected host.\n\nThe splwow64.exe is a file used by PrintSpooler, a Windows Service related to\n\nprinting.\n\n**Figure 7. Execute malicious splwow64 overwritten with malware**\n\n\n**13**\n\n\n-----\n\n### 3.3. SelfMake Loader\n\nSelfMake Loader is malware that loads and execute other malware [1][3]. It\n\nhas been reported that this malware executed Spider RAT. The name of\n\nSelfMake Loader is derived from the strings “selfmake2” or “selfmake3” in the\n\nmalware samples. One of the features is that this malware uses MFC (Microsoft\n\nFoundation Class).\n\n**Figure 8. Code contains the string “selfmake2”**\n\n**Figure 9. Code contains the string “selfmake3”**\n\nSelfMake Loader can be divided into two types based on the method of loading\n\nmalware. The first type is to load and execute malware located on the infected\n\nhost. The loader searches the following directories in order and executes the\n\nfirst malware it found.\n\n⚫ Directory where the SelfMake Loader is executed\n\n⚫ C:\\Program Files (x86)\\Common Files\n\n\n**14**\n\n\n-----\n\nThe other type is to download the malware from a C&C server to\n\nthe %TEMP%directory and execute the downloaded file. The file also includes\n\nan XOR encoded configuration. This configuration is a pipe-delimited format and\n\ncontains domain and port number of the C&C server. The configuration format\n\nis similar to Bifrose malware which BlackTech uses. This pipe-delimited\n\nconfiguration is a common characteristic of BlackTech's malware.\n\n**Figure 10. Pipe-delimited configuration of SelfMake Loader**\n\nThe following figure shows a file format that SelfMake Loader loads from the\n\ninfected host. The file which is downloaded from the C&C server is in a similar\n\nformat. The malware is XOR encoded and is decoded by a key contained in the\n\nfile.\n\n**Figure 11. File format that SelfMake Loader loads from an infected host**\n\n\n**15**\n\n\n-----\n\nIn addition, based on the code similarities, we consider that the code of\n\nexecuting the decoded data is used the one published on GitHub [8].\n\nSelfMake Loader calls the following function several times. The following\n\nfunction simply output a string using the printf function; that is to say, this is a\n\ndummy code. BlackTech tends to utilize malware that contain such dummy code.\n\n**Figure 12. Dummy code of SelfMake Loader**\n\n\n**16**\n\n\n-----\n\n### 3.4. HeavyROT Loader\n\nHeavyROT Loader is a loader that downloads malware from a C&C server and\n\nexecutes it. There is a sample of this loader which downloads malware from the\n\nsame C&C server as SelfMake Loader and it would indicate the sample relates\n\nto BlackTech. We named this malware HeavyROT Loader since it uses bit\n\nrotation calculation for RC6 cryptographic algorithm or calculation of checksums,\n\nas will be described later.\n\nThe malware communicates with C&C servers using HTTP, and Basic\n\nauthentication is implemented to the servers. The malware communicates with\n\nthe servers again with the flag enabled which ignores a certification error\n\n(ERROR_INTERNET_INVALID_CA) in case this error occurs in HTTPS\n\ncommunication. In addition, the malware gets the User Agent string from an\n\ninfected machine’s registry in order to set the string to an HTTP header.\n\n**Figure 13. Process of communication with C&C servers**\n\n\n**17**\n\n\n-----\n\nThe downloaded data from C&C servers contains encrypted PE data as well\n\nas a seed for generating a decryption key. Furthermore, the malware calculates\n\nthe checksum before and after decrypting PE data and it halts processing if the\n\nchecksum does not match the downloaded data.\n\n**Figure 14. Downloaded data format**\n\n```\ndef calc_checksum(data):\n  rol = lambda val, r_bits, max_bits=32: ¥\n    (val << r_bits%max_bits) & (2**max_bits-1) | ¥\n    ((val & (2**max_bits-1)) >> (max_bits-(r_bits%max_bits)))\n  result = 0\n  for byte_val in data:\n    result = rol(result,0xb) + byte_val\n  return result\n\n```\n\n**Figure 15. Checksum calculation**\n\n\n**18**\n\n\n-----\n\nThe following figure shows how the malware generates a key for decryption\n\nfrom a seed.\n\n```\ndef calc_key(seed):\n   val1 = (seed&1)|(seed<<16)&0xFFFFFFFF\n   val2 = (seed>>16)|(seed&0x00001000)\n   return ((val1<<8)&0xFFFFFFFF) | ((val2)>>8)&0xFFFFFFFF)\n\n```\n\n**Figure 16. Process of generating decryption key from seed**\n\nIt is notable that the malware extracts original PE file by using RC6 encryption\n\n(not decryption) routine after generating the key. Although there was no\n\ntheoretical evidence, we confirmed that the data encrypted by RC6 decryption\n\nroutine can be decrypted by RC6 encryption routine. We assume that the data\n\ndownloaded from a C&C server contained the encrypted data by RC6 decryption\n\nroutine, and the malware decrypted original PE file by RC6 encryption routine\n\nto the encrypted data.\n\n```\nclass RC6Const:\n  round = 16\n  blocksize = 64\ndef get_wordsize():\n  return RC6Const.blocksize // 2\ndef get_extend_s_len():\n  return 2 * RC6Const.round + 4\nrol = lambda val, r_bits, max_bits=32: ¥\n  (val << r_bits%max_bits) & (2**max_bits-1) | ¥\n  ((val & (2**max_bits-1)) >> (max_bits-(r_bits%max_bits)))\ndef init_S(key):\n  s_len=get_extend_s_len()\n  w=get_wordsize()\n  MOD = 2**w\n  encoded = [key]\n\n```\n\n**19**\n\n\n-----\n\n```\n   S=s_len*[0]\n   S[0]=0xB7E15163\n   for i in range(1,s_len):\n     S[i]=S[i-1]+0x9E3779B9\n     S[i]=S[i]%MOD\n   A=B=i=j=0\n   for _ in range(0,3*max(len(encoded),s_len)):\n     A = S[i] = rol((S[i] + A + B)%MOD,3,w)\n     B = encoded[j] = rol((encoded[j] + A + B)%MOD,(A+B)%w,w)\n     i = (i + 1) % s_len\n     j = (j + 1) % len(encoded)\n   return S\n def rc6_encrypt(data,S):\n   r=RC6Const.round\n   w=get_wordsize()\n   MOD = 2**w\n   lgw = 5\n   A = int.from_bytes(data[0:4],'little')\n   B = int.from_bytes(data[4:8],'little')\n   C = int.from_bytes(data[8:12],'little')\n   D = int.from_bytes(data[12:16],'little')\n   B = (B + S[0])%MOD\n   D = (D + S[1])%MOD\n   for i in range(1,r+1):\n     t = rol(((B*(2*B + 1))%MOD),lgw,w)\n     u = rol(((D*(2*D + 1))%MOD),lgw,w)\n     A = (rol(A^t,u%w,w) + S[2*i])%MOD\n     C = (rol(C^u,t%w,w) + S[2*i+1])%MOD\n     (A, B, C, D) = (B, C, D, A)\n   A = (A + S[2 * r + 2])%MOD\n   C = (C + S[2 * r + 3])%MOD\n   ret = [A,B,C,D]\n   return ret\n def main():\n   ## set appropriate parameters\n   key = 0x68000010  ## set the key generated from seed in\ndownloaded data.\n   input_file = \"encrypted.bin\" ## set a inputdata filename.\n   output_file = \"decrypted.bin\" ## set a outputdata filename.\n   ## initialize S\n   S = init_S(key)\n\n```\n\n**20**\n\n\n-----\n\n```\n  ## decrypt\n  in_datas = open(input_file,\"rb\").read()\n  i = 0\n  out_f = open(output_file,\"wb\")\n  while i < len(in_datas):\n    in_data = in_datas[i:i+16]\n    decrypted = rc6_encrypt(in_data,S)\n    for e in decrypted:\n      bin = e.to_bytes(4, byteorder=\"little\")\n      out_f.write(bin)\n    i=i+16\n  out_f.close()\nif __name__ == \"__main__\":\n  main()\n\n```\n\n**Figure 17. Process of decrypting PE data**\n\n\n**21**\n\n\n-----\n\n### 3.5. AresPYDoor\n\nAresPYDoor is backdoor malware. It is said to be related to BlackTech,\n\nbecause the C&C server used by AresPYDoor has relation to it used by Bifrose,\n\nalso BlackTech malware [17]. AresPYDoor is based on a Python RAT [9] released\n\non Github under the name Ares and is converted to an executable file.\n\nAresPYDoor uses the URL format shown in Figure 18 to access the C&C server\n\nand receive commands.\n\n```\n(scheme)://(host)/api/(uid)/hello\n\n```\n\n**Figure 18. URL format to receive commands**\n\nThe uid is generated by the code in Figure 19.\n\n```\n import uuid, getpass\n   def get_UID(self):\n     \"\"\" Returns a unique ID for the agent \"\"\"\n     return getpass.getuser() + '_' + str(uuid.getnode())\n\n```\n\n**Figure 19. The code generates uid**\n\nThe implemented commands are shown in Table 2.\n\n\n**22**\n\n\n-----\n\n|Table 2. AresPYDoor commands|Col2|\n|---|---|\n|Command Description||\n|cd|Change the current directory|\n|upload|Upload|\n|download|Download|\n|persist|Establish persistence|\n|clean|Remove persistence|\n|exit|Terminate AresPYDoor process|\n|zip|Compress files or folders to a ZIP archive|\n|python|Execute Python codes|\n|help|View help|\n|(Others)|Execute Shell commands|\n\n\nOne of the characteristics of AresPYDoor is its multi-platform support. There\n\nare several codes implemented to work on both Windows and Linux. As an\n\nexample, Figure 20 shows some of the persistence codes.\n\n**Figure 20. Multi-platform persistence commands**\n\n\n**23**\n\n\n-----\n\n### 3.6. Spider RAT\n\nSpider RAT is a RAT [1][4] executed by LAMICE or SelfMake Loader. There are\n\n32-bit and 64-bit samples. Although they have some similarities, these functions\n\nimplemented in each sample are different. In this section, we will start with\n\n32bit sample and continue with 64bit sample.\n\n#### 3.6.1. 32-bit\n\n 3.6.1.1. Configuration\n\nThe configuration is encoded by XOR, and its format is shown below.\n\n```\n IP1|PORT1|IP2|PORT2|IP3|PORT3|PROXYNAME|PROXYUSERNAME|PROXYPASS|\nSLEEPTIME|UNKNOWN_COLUMN|PERSISTENCE\n\n```\n\n**Figure 21. Configration format**\n\nThe observed sample had the following settings shown in Figure 22.\n\n**Figure 22. Spider RAT configuration**\n\n\n**24**\n\n\n-----\n\n#### 3.6.1.2. Embedded DLL file\n\nWe observed that there are two executable files (DLL files) embedded in\n\nthe .data section, one of which will later be edited and dropped in the persistent\n\nphase. The behavior of these DLL files is to execute\n\n“C:\\Windows\\System32\\calc.exe\". Although there are two embedded DLL files,\n\nthey have the same behavior.\n\n**Figure 23. DLL files embedded in Spider RAT**\n\n#### 3.6.1.3. Characteristic strings\n\nThe characteristic strings, shown in Figure 24, can be seen in the debug\n\noutput. Such strings are also seen in 64-bit samples.\n\n**Figure 24. The characteristic string in Spider RAT**\n\n\n**25**\n\n\n-----\n\n#### 3.6.1.4. Persistent behavior\n\nThree persistent behaviors described below can be specified depending on the\n\nvalue of PERSISTENCE in the configuration. In this case, the sample was set not\n\nto run these persistent behaviors.\n\n⚫ Using the Registry Run key\n\n➢ Spider RAT copies itself to c:\\users\\public\\downloads\\schmet.exe.\n\n➢ Spider RAT set the full path as the value of “Ofice” subkey in\n\nHKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run key.\n\n**Figure 25. The persistence using the Run key**\n\n\n**26**\n\n\n-----\n\n⚫ Using DLL Search Order Hijacking in OneDrive\n\n➢ Spider RAT copies itself to “C:\\programdata\\schost.exe”.\n\n➢ Spider RAT replaces the string ”C:\\Windows\\System32\\calc.exe” in the\n\nembedded DLL files of .data section with “C:\\programdata\\schost.exe”.\n\n➢ Spider RAT writes its binary to\n\nc:\\Users\\USERNAME\\AppData\\Local\\Microsoft\\OneDrive\\FileSyncFl\n\nwb.dll\n\n➢ Spider RAT relaunches OneDrive with the following command\n\n“cmd /c taskkill /f /im onedrive.exe”\n\n➢ The malicious FileSyncFlwb.dll will be loaded to execute\n\n“C:\\programdata\\schost.exe”, which is replaced to Spider RAT.\n\n**Figure 26. The persistence using DLL search order hijacking**\n\n\n**27**\n\n\n-----\n\n⚫ Using the Registry key HKCU\\Environment\\UserInitMprLogonScript\n\n➢ Spider RAT copies itself to c:\\users\\public\\downloads\\mpetect.exe.\n\n➢ Spider RAT set the full path as the value of\n\nHKCU\\Environment\\UserInitMprLogonScript key.\n\n➢ When user logs into Windows, replaced malicious mpetect.exe will be\n\nexecuted.\n\n**Figure 27. The persistence using**\n\n**HKCU\\Environment\\UserInitMprLogonScript**\n\n\n**28**\n\n\n-----\n\n#### 3.6.1.5. Control Commands\n\nControl commands implemented in Spider RAT 32-bit sample are shown in\n\nTable 3. The pair of offset values 0x4 and 0x8 in the received data determine\n\neach command.\n\n|Table 3. Control commands of 32-bit Spider RAT|Col2|Col3|\n|---|---|---|\n|Offset 0x4 Offset 0x8 Description|||\n|0|2|Reconnecting|\n|1|1|Launching PowerShell|\n|1|10|Terminating PowerShell|\n|1|11|Executing PowerShell Command|\n|1|2|Launching PowerShell|\n|1|20|Terminating PowerShell|\n|1|21|Executing PowerShell Command|\n|2|0|Terminating FileManager|\n|2|1|Launching FileManager|\n|2|6|Downloading file|\n|2|7|Uploading file|\n|2|8|Renaming file|\n|2|9|Sending list of files|\n|2|100|Deleting file|\n\n\n**29**\n\n\n-----\n\n#### 3.6.2. 64-bit\n\nWe also observed 64-bit samples, and their implementation is simple\n\ncompared with 32-bit sample. The 64-bit samples use multi-threads approach\n\nfor processing. However, we have confirmed that some threads have no\n\nprocessing content. We assume that some features will be implemented in the\n\nfuture.\n\n#### 3.6.2.1. Characteristics\n\nThe configuration of 64-bit samples do not have specific structure like 32-bit\n\none, but information such as C&C server is hard-coded. In addition, there are\n\nsome characteristic strings that are also found in 32-bit in the debug output.\n\n**Figure 28. The characteristic strings in 64-bit sample**\n\n#### 3.6.2.2. Control Commands\n\nControl commands implemented in 64-bit Spider RAT are shown in Table 4.\n\nThe pair of offset values 0x4 and 0x8 in the received data determine each\n\ncommand.\n\n|Table 4. Control commands of 64-bit Spider RAT|Col2|Col3|\n|---|---|---|\n|Offset 0x4 Offset 0x8 Description|||\n|1|1|Executing command|\n|3|0|－|\n|3|1|Downloading and Executing file|\n\n\n**30**\n\n\n-----\n\n### 3.7. BTSDoor\n\nBTSDoor is backdoor malware [6]. It has been observed that Flagpro\n\ndownloaded and executed this backdoor. The name of BTSDoor is derived from\n\nthe pdb pathname BTSWindows.\n\n**Figure 29. PDB path of BTSDoor**\n\nBefore BTSDoor receives commands, it sends the following information about\n\nthe infected host to the C&C server. The traffic is encrypted with AES.\n\n⚫ IP address\n\n⚫ Computer name\n\n⚫ Username\n\n⚫ Windows OS version\n\n⚫ Process ID of BTSDoor\n\n\n**31**\n\n\n-----\n\nBTSDoor implements the following commands. The traffic is encrypted with\n\nAES as is the case with sending information about the infected host.\n\n|Table 5. List of BTSDoor commands|Col2|\n|---|---|\n|Command ID Description||\n|0x20|Upload a file|\n|0x22|Release the semaphore of the file upload thread|\n|0x30|Open the handle of file download|\n|0x31|Download a file|\n|0x33|Close the handle of file download|\n|0x39|Execute command through ShellExecuteW|\n|0x40|Return the string \"Not implemented!\"|\n|0x41|Return the string \"N\"|\n|0x50|Start a Command Prompt process|\n|0x51|Kill the Command Prompt process|\n|0x52|Send commands to the Command Prompt|\n|0x53|Release the semaphore of the Command Prompt thread|\n|0xA1|Terminate the BTSDoor process|\n\n\n**32**\n\n\n-----\n\n### 3.8. Gh0stTimes\n\nGh0stTimes is customized based on the leaked Gh0st RAT source code and\n\nhas been used in some attack cases since early 2020 [2].\n\n#### 3.8.1. Feature Enhancement and Code Reuse\n\nGh0stTimes adds the feature to communicate with the C&C server by\n\nimplementing the new CPortmapManager and CUltraPortmapManager classes.\n\nIn addition, Gh0stTimes implements features such as file operations\n\n(CFileManager class) and remote shell execution (CShellManager class) that are\n\nreused from Gh0stRAT.\n\n**Figure 30. Added the feature to communicate with the C&C server**\n\n\n**33**\n\n\n-----\n\n#### 3.8.2. Dummy Code Insertion\n\nGh0stTimes repeatedly inserts dummy code to make analysis difficult.\n\nBlackTech frequently uses this type of obfuscation technique.\n\n**Figure 31. Inserted dummy code**\n\n\n**34**\n\n\n-----\n\n#### 3.8.3. Control Commands \n\nGh0stTimes equips control commands for each function, such as file operation\n\nand remote shell execution [2]. Additionally, this malware supports some\n\nspecific commands for file operations.\n\n|Table 6. Control commands of Gh0stTimes|Col2|\n|---|---|\n|Command ID Description||\n|0x0|Communication termination|\n|0x1|File operation (CFileManager)|\n|0x28|Remote shell execution (CShellManager)|\n|0x32|C&C server redirect function (CPortmapManager)|\n|0x3F|Proxy function (CUltraPortmapManager)|\n\n|Table 7. File operation commands|Col2|\n|---|---|\n|Command ID Description||\n|0x2|Retrieve a file list (SendFilesList)|\n|0x3|Upload a file (UploadToRemote)|\n|0x4|Download a file (CreateLocalRecvFile)|\n|0x5|Download a file (WriteLocalRecvFile)|\n|0x7|Upload a file (SendFileData)|\n|0x8|Stop file transfer (StopTransfer)|\n|0x9|Delete a file (DeleteFile)|\n|0xA|Delete a folder|\n|0xB|Set transfer mode (SetTransferMode)|\n|0xC|Create a folder (CreateFolder)|\n|0xD|Rename a file (Rename)|\n|0xE|Execute a file (OpenFile (SW_SHOW))|\n|0xF|Execute a file (OpenFile (SW_HIDE))|\n\n\n**35**\n\n\n-----\n\n#### 3.8.4. C&C Communication\n\nGh0stTimes uses a proprietary TCP protocol to communicate with the C&C\n\nserver. At the beginning of its communication to the C&C server, Gh0stTimes\n\nsends an authentication ID and data for generating encryption key. If the\n\nauthentication ID is not correct, authentication fails. The encryption key is\n\ngenerated by processing the data sent from the victim host, which is provided\n\nat the beginning of the communication. Afterward, Gh0stTimes sends/receives\n\ncontrol commands that are encrypted with custom RC4 algorithm (RC4 + XOR\n\n0xAC) and compressed with zlib.\n\n\n**36**\n\n\n-----\n\n### 3.9. TSCookie\n\nTSCookie is a downloader that downloads TSCookie Loader and TSCookie RAT\n\n[11]. The downloaded files are encoded. Therefore, TSCookie decodes them\n\nafter loading them on memory, then it executes them. It exists two versions of\n\nTSCookie, Windows and ELF binary version. This section describes a Windows\n\nversion, and the next section explains an ELF binary version. The behaviors of\n\nTSCookie Loader and TSCookie RAT can be checked in JPCERT/CC blog posts\n\n[10][11].\n\n#### 3.9.1. Decrypting DLL\n\nExecuting TSCookie leads to load RC4-encrypted data on memory. The data\n\nexists in the resource section of TSCookie. Afterwards, it will be decrypted as a\n\nDLL file. The decrypted DLL contains dummy codes like other BlackTech’s\n\nmalware.\n\n**Figure 32. Inserted dummy code**\n\n\n**37**\n\n\n-----\n\nAfter executing the decrypted DLL, it will connect to a C&C server. The\n\nconfiguration, which includes destinations of C&C server, is hard-coded in the\n\nsample, and its structure is almost the same as the samples reported by\n\nJPCERT/CC [11].\n\n#### 3.9.2. Downloading Loader\n\nTSCookie connects to the C&C server using HTTP GET method to download a\n\nTSCookie Loader. When TSCookie downloads TSCookie Loader, it will send RC4\n\nencrypted data to the C&C server. JPCERT/CC reported that their samples\n\ninserted the encrypted data into the Cookie header [11]. Whereas, our sample\n\ninserted the data into the URL path.\n\n**Figure 33. GET request to download the loader**\n\nURL path is replaced by swprintf() based on format string. TSCookie splits the\n\nencrypted data into two parts, and the split position is decided by random\n\nnumber. The URL path of HTTP GET request is as follows:\n\n\n**Description**\n\n|Description|Col2|\n|---|---|\n|①, ②|Randomized 32bit integer|\n|③, ⑤|Randomized lowercase alphabets|\n|④|Former part of encrypted data|\n|⑥|Latter part of encrypted data|\n\n\n**Figure 34. URL path format**\n\n\n**38**\n\n\n-----\n\nThe structure of the original data, which means the sending data before\n\nencryption, has been changed since the existing report from JPCERT/CC [11] as\n\nfollows:\n\n**Table 8. Structure of sending data before encryption by GET request**\n\n**Offset** **Length Contents**\n\n**0x00** 4 Four bytes hex value created from\nsystem information\n\n**0x04** 4 0x10050017\n\n**0x08** 4 0x1E9CE6A\n\n**0x0C** 4 0x04\n\n**0x10** 4 Four bytes hex value created from\nsystem information\n\nThis download activity will not execute if the first four bytes of the response\n\ndata do not match to the hard-coded value in the sample.\n\n|Offset Length Contents|Col2|Col3|\n|---|---|---|\n|0x00|4|Four bytes hex value created from system information|\n|0x04|4|0x10050017|\n|0x08|4|0x1E9CE6A|\n|0x0C|4|0x04|\n|0x10|4|Four bytes hex value created from system information|\n\n\n**39**\n\n\n-----\n\n#### 3.9.3. Downloading modules\n\nAfter downloading TSCookie Loader, TSCookie downloads its modules. HTTP\n\nPOST method is used for downloading the modules. TSCookie inserts the RC4\n\nencrypted data into the BODY part. The Date header value is used as the RC4\n\nkey.\n\n**Figure 35. POST request to download the modules**\n\nThis POST request also works as heartbeat and is sent around every 50\n\nseconds. However, if the first four bytes of the response does not match to the\n\nhard-coded value in the sample, the POST request will not be sent from the next\n\nrequest.\n\n\n**40**\n\n\n-----\n\n### 3.10. ELF_TSCookie\n\nThis section explains ELF version of TSCookie (ELF_TSCookie) [14].\n\nELF_TSCookie contains same functions as Windows version. However, the\n\nfunctions are limited.\n\nThe samples, which we found, target not only Linux environment users, but\n\nalso FreeBSD ones. We assume that the attacker uses the different version of\n\nTSCookie depending on the target's environment.\n\nThe command values of our samples have changed from the values reported\n\nby JPCERT/CC [12]. This JPCERT/CC report provides the detailed analysis result\n\nof the past samples.\n\n#### 3.10.1. Characteristics\n\nThe results of “file” and “readelf” commands are as follows:\n\n**Figure 36. File information of ELF_TSCookie**\n\nThe “file” command result shows that it is static-linked file, and the “readelf”\n\ncommand result indicates that this malware could be compiled in old\n\ndevelopment environment. It seems that attackers would like to evade\n\nenvironmental problems.\n\n\n**41**\n\n\n-----\n\nAs JPCERT/CC has already reported [12] that information about C&C servers\n\nis inserted as plain text. ELF_TSCookie copies the information onto allocated\n\nmemory space and encrypts it with RC4. The encrypted information will be used\n\nin later process.\n\n**Figure 37. Inserted plain-text information**\n\nELF_TSCookie sends the host information to the C&C servers. The information\n\ncontains TSCookie PID, IP address, hostname, and login username.\n\nThe code to obtain the host information is shown in Figure 38. It may be\n\nintended to get the result of “uname” command, but it has a wrong option “\na00”. Hence the command will be failed, and the result will not be sent.\n\n**Figure 38. Collecting infected host information**\n\n\n**42**\n\n\n-----\n\n#### 3.10.2. Control Commands\n\nELF_TScookie commands are listed in Table 9. No major changes of the\n\ncommands have been observed since JPCERT/CC had published its analysis\n\nresult [12].\n\n|Table 9. ELF_TSCookie command list|Col2|\n|---|---|\n|Command Description||\n|0x7200AC03|Launch remote shell|\n|0x7200AC04|Send commands to remote shell|\n|0x7200AC05|Terminate remote shell|\n|0x7200AC07|－|\n|0x7200AC0B|Send fixed number|\n|0x7200AC0C|Send file list|\n|0x7200AC0D|Download file|\n|0x7200AC0E|Upload file|\n|0x7200AC10|－|\n|0x7200AC11|Terminate process|\n|0x7200AC13|Remove file (rm -rf)|\n|0x7200AC16|Move file/Change file name|\n|0x7200AC1A|Execute command|\n\n\n**43**\n\n\n-----\n\n### 3.11. IamDown\n\nIamDown is a malware that downloads and executes another malware. It has\n\nbeen used since at least 2014. We call this malware “IamDown” because the\n\nstring “i am mutex!” is inserted into this malware and this is a downloader\n\nmalware.\n\n**Figure 39. Inserted string “i am mutex!”**\n\nIamDown, which has been found, has some common characteristics. We will\n\nexplain those characteristics from next section.\n\n#### 3.11.1. Hard-coded characteristic strings\n\nThe hard-coded strings such as “i am mutex!”, the C&C server domains, and\n\na Mutex value are embedded in IamDown. We assume that this malware has\n\nsome relationships between Poison Ivy, because the Mutex value of\n\nIamDown ”)!VoqA” is same as the head of the default Mutex value of Poison\n\nIvy ”)!VoqA.I4” [13].\n\n\n**44**\n\n\n-----\n\n#### 3.11.2. Sending data\n\nIamDown uses Socket for communicating with the C&C server with TCP/443\n\nport. The first 16 bytes data is the fixed value.\n\n**Figure 40. Packet capture of the sending data**\n\n#### 3.11.3. Receiving data\n\nIamDown sequentially checks the received data from head. If the data\n\nmatches the condition, Socket will close, and if not, the data procedure will\n\ncontinue as shown in Figure 41.\n\n\n**45**\n\n\n-----\n\n**Figure 41. Checking received data**\n\n#### 3.11.4. On-memory execution (Fileless)\n\nIamDown executes the downloaded data on a new thread in the same process.\n\nThis means that the data is not stored as a file on the infected host.\n\n\n**46**\n\n\n-----\n\n**Figure 42. Executing downloaded data on memory**\n\n\n**47**\n\n\n-----\n\n#### 3.11.5. API Hash\n\nAPIs such as CreatMutexA and Socket related ones are obfuscated using Hash\n\nvalue.\n\n**Figure 43. Using API hash**\n\n\n**48**\n\n\n-----\n\n### 3.12. ELF_Bifrose\n\nWe will explain about ELF version of Bifrose (ELF_Bifrose). Our sample does\n\nnot exist big differences from the past reported samples [14].\n\n#### 3.12.1. Characteristics\n\nThe results of “file” and “readelf” commands is shown in Figure 44. The\n\nsamples were compiled in an old environment and statically linked. It seems\n\nthat attackers would like to evade environmental problems.\n\n**Figure 44. File information of ELF_Bifrose**\n\n\n**49**\n\n\n-----\n\n#### 3.12.2. Sending data\n\nELF_Bifrose encrypts and sends the following data at the first communication\n\nto the C&C server:\n\n⚫ IP address\n\n⚫ Hostname\n\n⚫ PID\n\n**Figure 45. Sending data to C&C server of ELF_Bifrose**\n\nAs JPCERT/CC reported [15], ELF_Bifrose leverages RC4 encryption. Some\n\nminor differences in the encryption handling exist depending on the samples.\n\n\n**50**\n\n\n-----\n\n**Figure 46. RC4 encryption handling**\n\nAn example of the first sending data is shown in Figure 47. ELF_Bifrose\n\ncommunicates with port 80,443, and 8080, but it uses Socket connection\n\nrather than the HTTP(S) protocol.\n\n\n**51**\n\n\n-----\n\n**Figure 47. Example of sending data to C&C server**\n\n#### 3.12.3. Control Commands\n\nAfter sending the data, ELF_Bifrose receives commands from the C&C server.\n\nThe implemented commands are in Table 10. The commands have not been\n\nchanged significantly from the existing samples [14].\n\n|Table 10. ELF Bifrose command list|Col2|\n|---|---|\n|Command Description||\n|0x15|Send randomized data|\n|0xC6|Terminate process|\n|0xF7|Send command to remote shell|\n|0xF8|Terminate remote shell|\n|0xF6|Launch remote shell|\n|0x82|Send fixed value|\n|0x83|Send file list|\n|0x84|Send file attribution|\n|0x85|Download file|\n|0x86|Upload file|\n|0x87|Close file|\n|0x89|Create directory|\n|0x8A|Delete file|\n|0x8B|Delete directory|\n\n\n**52**\n\n\n-----\n\n### 3.13. ELF_PLEAD\n\nWe will explain about ELF version of PLEAD (ELF_PLEAD). JPCERT/CC\n\nreported the detailed analysis result about the existing samples [16]. However,\n\nwe will show the analysis result of newly observed samples in this report.\n\n#### 3.13.1. Characteristics\n\nThe results of “file” and “readelf” command are shown in Figure 48. The\n\nsamples were compiled in an old environment and statically linked. It seems\n\nthat attackers would like to evade environmental problems.\n\n**Figure 48. File information of ELF_PLEAD**\n\n#### 3.13.2. Configuration\n\nELF_PLEAD encrypts configuration with RC4 as existing samples does. Figure\n\n49 shows an example of the decrypted configuration. The first 32 bytes data\n\nin the Figure 49 is the RC4 key, and after the key follows the configuration.\n\nThe configuration size is 0x1AA. As the following configuration indicates that a\n\nprivate IP address is set as the destination. In addition, the uncommon\n\ndestination port 29678 is configured. From these settings, we assume that this\n\nconfiguration was adapted to the targeted company that had already been\n\nintruded.\n\n\n**53**\n\n\n-----\n\n**Figure 49. Decoded configuration of ELF_PLEAD**\n\n#### 3.13.3. Control Commands\n\nThe implemented commands are as follows:\n\n|Table 11. Group number 0 command list|Col2|\n|---|---|\n|Command Description||\n|4|Send randomized data|\n|5|Reconnect|\n|6|Restart|\n|7|Terminate|\n|8|Terminate|\n|9|Change Socket|\n|10|Change connection destination|\n\n\n**54**\n\n\n-----\n\n**Table 12. Group number 1 (CFileManager) command list**\n\n**Command** **Description**\n\n**0** Send file list\n\n**5** Send file attribution\n\n**7** Change file name\n\n**9** Delete file/directory\n\n**11** Upload file\n\n**13** Execute file\n\n**17** Create directory\n\n**19** Move file\n\n**21** Delete directory\n\n**Table 13. Group number 2 (CFileTransfer) command list**\n\n**Command** **Description**\n\n**0** Send file attribution\n\n**3** Create directory\n\n**6** Download file\n\n**7** Send file information\n\n**11** Upload file\n\n**Table 14. Group number 3 (CRemoteShell) command list**\n\n|Command Description|Col2|\n|---|---|\n|0|Send file list|\n|5|Send file attribution|\n|7|Change file name|\n|9|Delete file/directory|\n|11|Upload file|\n|13|Execute file|\n|17|Create directory|\n|19|Move file|\n|21|Delete directory|\n\n|Command Description|Col2|\n|---|---|\n|0|Send file attribution|\n|3|Create directory|\n|6|Download file|\n|7|Send file information|\n|11|Upload file|\n\n|Command Description|Col2|\n|---|---|\n|0|Launch remote shell|\n|2|Launch remote shell|\n|5|Change current directory|\n|7|Terminate remote shell|\n|9|Send file list|\n|12|Delete directory|\n\n\n**55**\n\n\n-----\n\n**Table 15. Group number 4 (CPortForwardManager) command list**\n\n|Command Description|Col2|\n|---|---|\n|2|Setup proxy|\n|4|－|\n|6|Send proxy data|\n|8|－|\n|10|Connect proxy|\n|12|Terminate proxy|\n\n\n**56**\n\n\n-----\n\n## 4. Countermeasures\n\nBlackTech has two main attack vectors. The first is an attack method\n\noriginates from spear phishing emails. The second is an attack method exploits\n\nserver vulnerabilities.\n\nThe best way to defend against spear phishing emails is to avoid opening\n\nsuspicious emails, links or files. BlackTech attacks with emails and attachments\n\nthat are spoofed as if they were clients of the target. It is possible to prevent\n\nthe attack by carefully checking the sender email address, the text of emails,\n\nand the double extensions of attachments. In addition, the installation of email\n\nsecurity products is also an effective measure. Our SOC has observed that these\n\nproducts have detected spear phishing emails by BlackTech.\n\nTo defend against exploitation of server vulnerabilities, we recommend that\n\napplying the latest update programs or the latest security patches. Furthermore,\n\nthe installation and the properly operation of network security products and\n\nendpoint security products are also effective measure. Even if your organization\n\nwere initially accessed by such threat actor, these products will detect later\n\nbehaviors. Our SOC has created custom signatures to detect such behaviors,\n\nand in some cases, we have been able to minimize the damage by detecting\n\nand quarantining them. Although BlackTech is actively developing new malware,\n\nits attack techniques have not changed much. Thus, it is important to build\n\ndetection logics against them.\n\nIn both attack vectors as we mentioned, BlackTech targets vulnerable areas\n\nof the target organization. In particular, overseas offices tend to be attacked by\n\nBlackTech. Even if your organization’s critical infrastructure is managed in a\n\nclosed network, BlackTech will examine all possible paths to penetrate it, identify\n\nwhere are vulnerable areas, and attempt to compromise them. Hence, proper\n\nmanagement of your organization’s systems is important.\n\nFurthermore, BlackTech is known to repeatedly attack against the same\n\n\n**57**\n\n\n-----\n\ntargeted organization. Even if BlackTech intruded once, or even if intrusions\n\nwere prevented, your organization’s systems still have risk to be attacked over\n\nand over. We recommend keeping up with the latest attack trends and taking\n\nmeasures properly and quickly.\n\n\n**58**\n\n\n-----\n\n## 5. Postface\n\nNTT Security Holdings Corporation Japan Security Operation Center has\n\nconducted research activities for the prevention of security incidents and early\n\ndetection when they occur. In particular, we have actively investigated and\n\nanalyzed on targeted attacks for clue to consider countermeasures against\n\nfurther sophisticated attack.\n\nIn this report, we provided a walkthrough of BlackTech’s activities based on\n\nthe cases we observed in 2021. BlackTech has extremely actively attacked\n\nagainst Japanese organizations repeatedly, and it can be continued. Our SOC\n\nwill continue to research BlackTech.\n\nIoCs are listed in the Appendix. We hope you will find it useful.\n\n\n**59**\n\n\n-----\n\n## 6. About Report\n\nAuthors:\n\nNTT Security Holdings Corporation Japan SOC\n\nShogo Hayashi, Fumio Ozawa, Hajime Takai, Nobuyuki Amakasu,\n\nRintaro Koike, Ryuichi Tanabe, Yuta Sawabe, Sachito Hirao\n\nTranslators:\n\nNTT Security Holdings Corporation Japan SOC\n\nRyu Hiyoshi, Hisayo Enomoto, Mikuru Bansho, Naoki Kubota, Ryuichi Tanabe\n\nRelease:\n\nApril 20[th], 2022 (Ver1.0) : Original Japanese version released\n\nApril 27[th], 2022 (Ver1.1)\n\nSeptember 26[th], 2022  : English version released\n\n\n**60**\n\n\n-----\n\n## 7. References\n\n[1]  TrendMicro, \"Ambiguously Black: The Current State of Earth Hundun's\n\nArsenal\", https://jsac.jpcert.or.jp/archive/2022/pdf/JSAC2022_8_hara_en.pdf\n\n[2]  JPCERT/CC, \"Malware Gh0stTimes Used by BlackTech “,\n\nhttps://blogs.jpcert.or.jp/en/2021/10/gh0sttimes.html\n\n[3]  SEQRITE, \"Everything you need to know about the Microsoft Exchange\n\nServer Zero-Day Vulnerabilities\", https://www.seqrite.com/blog/4898-2/\n\n[4]  Deep Learning for Cybersecurity, \"Blue Hexagon Security Advisory:\n\nMicrosoft Exchange Server 0-days\", https://medium.com/deep-learning-for\ncybersecurity/blue-hexagon-security-advisory-microsoft-exchange-server-0\ndays-83f49d528d34\n\n[5]  FREEBUF, \"利用Exchange 漏洞入侵安插后门，小心数据泄露\",\n\nhttps://www.freebuf.com/articles/system/303176.html\n\n[6]  PwC, \"Back to Black(Tech): an analysis of recent BlackTech operations\n\nand an open directory full of exploits\",\n\nhttps://vblocalhost.com/uploads/VB2021-50.pdf\n\n[7]  NTT Security Holdings, \" Flagpro: The new malware used by BlackTech\n\n\", https://insight-jp.nttsecurity.com/post/102hf3q/flagpro-the-new-malware\nused-by-blacktech\n\n[8]  GitHub, \"abhisek/Pe-Loader-Sample\", https://github.com/abhisek/Pe\nLoader-Sample\n\n[9]  GitHub, \"sweetsiftware/Ares\", https://github.com/sweetsoftware/Ares\n\n[10] JPCERT/CC, \"Malware Used by BlackTech after Network Intrusion\",\n\nhttps://blogs.jpcert.or.jp/en/2019/09/tscookie-loader.html\n\n[11] JPCERT/CC, \"Malware “TSCookie”\",\n\nhttps://blogs.jpcert.or.jp/en/2018/03/malware-tscooki-7aa0.html\n\n[12] JPCERT/CC, \"ELF_TSCookie - Linux Malware Used by BlackTech\",\n\nhttps://blogs.jpcert.or.jp/en/2020/03/elf-tscookie.html\n\n\n**61**\n\n\n-----\n\n[13] Volatility Labs, \"Reverse Engineering Poison Ivy's Injected Code\n\nFragments\",\n\nhttps://volatility-labs.blogspot.com/2012/10/reverse-engineering-poison\nivys.html\n\n[14] マクニカネットワークス, \"標的型攻撃の実態と対策アプローチ 第4 版 日本を\n\n狙うサイバーエスピオナージの動向2019 年度下期\",\n\nhttps://www.macnica.co.jp/business/security/manufacturers/files/mpressionc\n\nss_ta_report_2019_4.pdf\n\n[15] TeamT5, \"中國駭客 HUAPI 的惡意後門程式 BiFrost 分析\",\n\nhttps://teamt5.org/tw/posts/technical-analysis-on-backdoor-bifrost-of-the\nChinese-apt-group-huapi/\n\n[16] JPCERT/CC, \"ELF_PLEAD - Linux Malware Used by BlackTech\",\n\nhttps://blogs.jpcert.or.jp/en/2020/11/elf-plead.html\n\n[17] ThreatBook, \"东亚黑客组织 BlackTech 针对金融、教育等行业展开攻击\",\n\nhttp://report.threatbook.cn/BL.pdf\n\n\n**62**\n\n\n-----\n\n## 8. Appendix\n\nIOCs of malware associated with BlackTech are as follows.\n\n###### Malware Samples\n\n|Malware Samples|Col2|\n|---|---|\n|Hash value (SHA256)|Description|\n|e81255ff6e0ed937603748c1442ce9d6588decf6922 537037cf3f1a7369a8876|Flagpro|\n|77680fb906476f0d84e15d5032f09108fdef8933bca d0b941c9f375fedd0b2c9|Flagpro|\n|655ca39beb2413803af099879401e6d634942a169d2 f57eb30f96154a78b2ad5|Flagpro|\n|e197c583f57e6c560b576278233e3ab050e38aa9424 a5d95b172de66f9cfe970|Flagpro|\n|935e61aba8df5f6e80e001af0fa9c6a50c2cf50f406 8e9dd4277f2cd1297d95c|SelfMake Loader|\n|2657ca121a3df198635fcc53efb573eb069ff2535dc f3ba899f68430caa2ffce|SelfMake Loader|\n|7da969010a55919aa66ed97a2d2d6d6a0be3d8dc615 1eeb6cebc15e4f06d4553|SelfMake Loader|\n|5a57c9d19c7fb42832085f88d92f9f57d64b1bca8f2 a19b0533a4caee1a792cc|SelfMake Loader|\n|3891fb7b3d1e5fc2d028ed3d0debe868189971b20eb 8edb295e2b8d2d0c1a02a|SelfMake Loader|\n|8bdfc1ed5bfec964050a42a0f1ddd8709fcf14fab1e de151c5a7161be904cd96|SelfMake Loader|\n|92c75df382218e7743359aa83b403e443550e766c84 74a59c9dcbd4903a4bf02|SelfMake Loader|\n|c2b23689ca1c57f7b7b0c2fd95bfef326d6a22c1508 9d35d31119b104978038b|Spider RAT|\n|8c3df0e4d7ff0578d143785342a8033fb6e76ce9f61 c2ea14c402f45a76ab118|Spider RAT|\n|dced553a6f835162f0515a41a330404466f3ca44bc4 3a2f8b5675ca28609c905|Spider RAT|\n|d196969b35966462fa03ef857e375e9d6172b34053b 115df04cefa3d673b9d85|Spider RAT|\n|ee6ed35568c43fbb5fd510bc863742216bba54146c6 ab5f17d9bfd6eacd0f796|BTSDoor|\n|85fa7670bb2f4ef3ca688d09edfa6060673926edb3d 2d21dff86c664823dd609|BTSDoor|\n|01581f0b1818db4f2cdd9542fd8d663896dc043efb6 a80a92aadfac59ddb7684|Gh0stTimes|\n\n\n**63**\n\n\n-----\n\n|13c19132f7c0c2c02f4070eca9367bdf8ab2bf59c59 93c6e853584ac215857c7|TSCookie|\n|---|---|\n|638cfbe609d7f3e88767133be5ea5f9a75f1d703275 f38eb9ec2414e179483b9|ELF_TSCookie|\n|0e0198d3409e8dccf2ba1eeed41f56e24b633188230 ed062a43fac0517e8da8f|ELF_TSCookie|\n|3802fe08235724a1c8f68563aa1166e509aeb27c59c 008dccace5e2513b03375|ELF_TSCookie|\n|994b294eac5d099392621e6c813694bc254a7d77471 7709ee3b67211df10d963|IamDown|\n|42416e73ebc0b776c726e6075fa73bb418f24b53b0b 2086141a2aba22301ec6a|IamDown|\n|d8500672e293ef4918ff77708c5b82cf34d40c440d5 a4b957a5dbd3f3420fdc4|IamDown|\n|0a06d4dc8d5be03cc932b74758f0004aeaa6cdf1480 6635b9452b5c4db900184|IamDown|\n|a914c729e4816fb49c8b9830694be385460c2cc366b f1ab1410e84295cfa0946|ELF_Bifrose|\n|0478fe3022b095927aa630ae9a00447eb024eb862db fce3eaa3ca6339afec9c1|ELF_Bifrose|\n|4549745d0bbc9b4c16c815927e7720258cd64bb3dcc 76e6f850c845d603cca13|SelfMake Service|\n|a394250a66dede23931b9bb5d5aced5d32ab171b1f2 8382305d9c942859ef5d1|SelfMake Service|\n|4dc515a288be6e64b006fe418c5477bd0982ce801e8 29d8299ee0eb949b20dc2|SelfMake Service|\n|f32318060b58ea8cd458358b4bae1f82e073d1567b9 a29e98eb887860cec563c|HeavyROT Loader|\n|4991c98c55bfa0b269b05b8e2f0944edb85ddc1d2ba 4dffe0cbf9a7b89a98911|HeavyROT Loader|\n|76bf5520c19d469ae7fdc723102d140a375bb32f64b 0065470238e6c29ac2518|AresPYDOOR|\n|e4d837dc1a700bf71b218e41ed50abdbb2ba0352394 504a0cdaa12948d3daf2f|ELF_PLEAD|\n\n\n**64**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.12.19.BlackTech_APT/EN-BlackTech_2021.pdf",
        "https://jp.security.ntt/resources/EN-BlackTech_2021.pdf"
    ],
    "report_names": [
        "EN-BlackTech_2021",
        "EN-BlackTech_2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "2646f776-792a-4498-967b-ec0d3498fdf1",
            "created_at": "2022-10-25T15:50:23.475784Z",
            "updated_at": "2025-03-27T02:00:55.479958Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Palmerworm"
            ],
            "source_name": "MITRE:BlackTech",
            "tools": [
                "Kivars",
                "PsExec",
                "TSCookie",
                "Flagpro",
                "Waterbear"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6750d709-9153-4e90-baa3-04883a9b762b",
            "created_at": "2022-10-25T16:07:23.397596Z",
            "updated_at": "2025-03-27T02:02:09.778738Z",
            "deleted_at": null,
            "main_name": "Blackgear",
            "aliases": [
                "Topgear"
            ],
            "source_name": "ETDA:Blackgear",
            "tools": [
                "Comnie",
                "Elirks",
                "Protux"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d3a7123c-f519-49a0-a234-de24a1ef052a",
            "created_at": "2022-10-25T16:47:55.545211Z",
            "updated_at": "2025-03-27T02:05:17.254744Z",
            "deleted_at": null,
            "main_name": "BRONZE CANAL",
            "aliases": [
                "CTG-6177 ",
                "Circuit Panda ",
                "Palmerworm ",
                "Shrouded Crossbow ",
                "BlackTech"
            ],
            "source_name": "Secureworks:BRONZE CANAL",
            "tools": [
                " DRIGO",
                " Flagpro",
                " Gh0stTimes",
                " PLEAD",
                " Spiderpig",
                " Waterbear",
                "Bifrose"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75024aad-424b-449a-b286-352fe9226bcb",
            "created_at": "2023-01-06T13:46:38.962724Z",
            "updated_at": "2025-03-27T02:00:02.964002Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "CIRCUIT PANDA",
                "Temp.Overboard",
                "G0098",
                "Red Djinn",
                "HUAPI",
                "Palmerworm",
                "T-APT-03",
                "Manga Taurus",
                "Earth Hundun"
            ],
            "source_name": "MISPGALAXY:BlackTech",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "efa7c047-b61c-4598-96d5-e00d01dec96b",
            "created_at": "2022-10-25T16:07:23.404442Z",
            "updated_at": "2025-03-27T02:02:09.781478Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Circuit Panda",
                "Earth Hundun",
                "Manga Taurus",
                "Operation PLEAD",
                "Operation Shrouded Crossbow",
                "Operation Waterbear",
                "Palmerworm",
                "Radio Panda",
                "Red Djinn",
                "T-APT-03",
                "TEMP.Overboard"
            ],
            "source_name": "ETDA:BlackTech",
            "tools": [
                "BIFROST",
                "BUSYICE",
                "BendyBear",
                "Bluether",
                "CAPGELD",
                "DRIGO",
                "Deuterbear",
                "Flagpro",
                "GOODTIMES",
                "Gh0stTimes",
                "IconDown",
                "KIVARS",
                "LOLBAS",
                "LOLBins",
                "Linopid",
                "Living off the Land",
                "TSCookie",
                "Waterbear",
                "XBOW",
                "elf.bifrose"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ad59becc-29c2-4b7a-a958-d7f242d222ea",
            "created_at": "2023-01-06T13:46:38.956494Z",
            "updated_at": "2025-03-27T02:00:02.962214Z",
            "deleted_at": null,
            "main_name": "Blackgear",
            "aliases": [
                "Topgear",
                "Comnie",
                "BLACKGEAR"
            ],
            "source_name": "MISPGALAXY:Blackgear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1663862622,
    "ts_modification_date": 1663862622,
    "files": {
        "pdf": "https://archive.orkl.eu/011d85f9602c8af14d9cf5bb0721633c1702f8bc.pdf",
        "text": "https://archive.orkl.eu/011d85f9602c8af14d9cf5bb0721633c1702f8bc.txt",
        "img": "https://archive.orkl.eu/011d85f9602c8af14d9cf5bb0721633c1702f8bc.jpg"
    }
}