{
    "id": "5cd9dc92-2ab2-4f6c-94da-b3e4848d699d",
    "created_at": "2023-01-12T15:02:56.79644Z",
    "updated_at": "2025-03-27T02:06:10.129476Z",
    "deleted_at": null,
    "sha1_hash": "9e1df083d1f6ff9d5c071526c5fa143c5708f414",
    "title": "2022-04-06 - UpdateAgent macOS Malware",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:39Z",
    "file_modification_date": "2022-05-29T00:53:39Z",
    "file_size": 379693,
    "plain_text": "# UpdateAgent macOS Malware\n\n**esentire.com/blog/updateagent-macos-malware**\n\n[Adversaries don’t work 9-5 and neither do we. At eSentire, our 24/7 SOCs are staffed with](https://www.esentire.com/what-we-do/security-operations-center)\nElite Threat Hunters and Cyber Analysts who hunt, investigate, contain and respond to\nthreats within minutes.\n\nWe have discovered some of the most dangerous threats and nation state attacks in our\nspace – including the Kaseya MSP breach and the more_eggs malware.\n\nOur Security Operations Centers are supported with Threat Intelligence, Tactical Threat\nResponse and Advanced Threat Analytics driven by our Threat Response Unit – the TRU\nteam.\n\nIn TRU Positives, eSentire’s Threat Response Unit (TRU) provides a summary of a recent\nthreat investigation. We outline how we responded to the confirmed threat and what\nrecommendations we have going forward.\n\n**Here’s the latest from our TRU Team…**\n\n## What did we find?\n\nUpdateAgent malware impacting a customer in the software industry, specific to\nApple’s macOS operating system.\n\n\n-----\n\nThe malware is used to deliver additional payloads and maintain a persistent foothold\non systems.\nAccording to Microsoft, the malware has gone through several iterations since it first\nappeared in September 2020.\nIn a recent case, analysts identified a suspicious launch agent and traced it to a shell\nscript matching UpdateAgent’s known behavior patterns and traits, including:\n\n1. Use of CloudFront domains for C2 communications and secondary payloads.\n2. Collection of system information (see below).\n3. Removal of quarantine bit from payloads to bypass Gatekeeper.\n4. Establishing persistence by modifying property list files in the user’s\n\n/Library/LaunchAgents directory.\n5. Removal of files from device to cover tracks.\nUpdateAgent is known to deliver adware as its second stage payload, but there is\npotential for more severe payload delivery.\n\n## Summary of UpdateAgent's Initiation Shell Script\n\nUpdateAgent collects information about the system and submits it to the C2 domain\n(hxxps://dgu8hufljhqqu[.]cloudfront[.]net/pkg) via HTTP POST request:\n\n_The information collected includes the active user, machine ID, operating system, and_\n_version._\n\nThen it, retrieves a DMG file from hxxps://duh59xv2mx0nn[.]cloudfront[.]net, adds the current\nuser to the ‘sudoers’ file and disables the password prompt:\n\n\n-----\n\n[Next, it clears extended attributes on the DMG file to bypass Gatekeeper, which is a security](https://attack.mitre.org/techniques/T1553/001/)\nfeature in macOS aimed at reducing the likelihood of users accidentally running malware\ndownloaded from the internet.\n\nSimilar to the Mark-of-Web attribute in Windows, macOS applications (such as browsers)\nadd an extended attribute known as a quarantine flag to files downloaded from the internet.\n[UpdateAgent clears all extended attributes (including the quarantine flag) using the xattr](https://ss64.com/osx/xattr.html)\ncommand.\n\nThen, it uses PlistBuddy in direct mode to add arguments to a property list file.\n(com.shenbfgbvgsfssfmrynamdzyetzfnd.plist) under the user’s /Library/LaunchAgents/ folder\nfor persistence:\n\nLastly, the cleanup actions show as follows:\n\n## How did we find it?\n\nOur [MDR for Endpoint service identified the launch agent persistence technique.](https://www.esentire.com/how-we-do-it/signals/endpoint)\n\n## What did we do?\n\nOur [24/7 SOC cyber analysts alerted the customer, isolated the host and provided](https://www.esentire.com/what-we-do/security-operations-center)\ndetails of the infection to assist with remediation.\n\n## What can you learn from this TRU positive?\n\nUpdateAgent is initiated by macOS users installing malicious software masquerading\nas legitimate applications.\nUpdateAgent has seen continuous improvement since it first emerged.\n\n\n-----\n\nWhile adware payloads may seem low-risk, the potential for follow-on malware exists.\n\nAdditionally, the information collected and sent via UpdateAgent’s heartbeat\nmechanism could be used to target the system for follow-on attacks.\n\n## Recommendations from our Threat Response Unit (TRU) Team:\n\nEncourage good security hygiene among your users through phishing and security\nawareness training.\n\nOnly download and install applications from trusted locations.\n\nFor additional protection, validate the file hash if the vendor provides the\nhash information\nIgnore unsolicited pop-ups or application download requests. Do not click on the\nunsolicited pop-up links.\nMonitor for modifications to plist files in auto-run locations such as\n/Library/LaunchAgents/.\nRestrict access/monitor for changes to sudoers file and launch agents folders.\n\n## Ask Yourself\n\n1. What level of visibility do you have across your network, endpoint, and overall\n\nenvironment to detect malicious behavior at scale?\n2. What level of managed endpoint support do you have in place?\n3. What level of managed endpoint support do you have in place?\n4. Are you monitoring your endpoints 24/7 and what degree of control do you have to\n\ninitiate a kill switch when required?\n\n## Indicators of Compromise\n\n**Indicator** “Note\n\n28C2FF8C6F78EB61361DECE949108910 Initiation Shell Script\n\ndgu8hufljhqqu[.]cloudfront[.]net Command and Control\n\nduh59xv2mx0nn[.]cloudfront[.]net Payload Hosting\n\neSentire’s Threat Response Unit (TRU) is a world-class team of threat researchers who\ndevelop new detections enriched by original threat intelligence and leverage new machine\nlearning models that correlate multi-signal data and automate rapid response to advanced\nthreats.\n\nIf you are not currently engaged with an MDR provider, eSentire MDR can help you reclaim\nthe advantage and put your business ahead of disruption.\n\n|Indicator|“Note|\n|---|---|\n|28C2FF8C6F78EB61361DECE949108910|Initiation Shell Script|\n|dgu8hufljhqqu[.]cloudfront[.]net|Command and Control|\n|duh59xv2mx0nn[.]cloudfront[.]net|Payload Hosting|\n\n\n-----\n\nLearn what it means to have an elite team of Threat Hunters and Researchers that works for\nyou. [Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-06 - UpdateAgent macOS Malware.pdf"
    ],
    "report_names": [
        "2022-04-06 - UpdateAgent macOS Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535776,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653785619,
    "ts_modification_date": 1653785619,
    "files": {
        "pdf": "https://archive.orkl.eu/9e1df083d1f6ff9d5c071526c5fa143c5708f414.pdf",
        "text": "https://archive.orkl.eu/9e1df083d1f6ff9d5c071526c5fa143c5708f414.txt",
        "img": "https://archive.orkl.eu/9e1df083d1f6ff9d5c071526c5fa143c5708f414.jpg"
    }
}