{
    "id": "5ce7277e-640d-4f87-b932-f41bda6a2002",
    "created_at": "2023-01-12T15:01:13.248812Z",
    "updated_at": "2025-03-27T02:05:34.941848Z",
    "deleted_at": null,
    "sha1_hash": "939ead5a27fd44ffc95e9d0fbe44e733383ca0c2",
    "title": "2021-01-14 - Python Cryptominer Botnet Quickly Adopts Latest Vulnerabilities",
    "authors": "",
    "file_creation_date": "2022-05-27T21:14:20Z",
    "file_modification_date": "2022-05-27T21:14:20Z",
    "file_size": 835712,
    "plain_text": "# Python Cryptominer Botnet Quickly Adopts Latest Vulnerabilities\n\n**[imperva.com/blog/python-cryptominer-botnet-quickly-adopts-latest-vulnerabilities/](https://www.imperva.com/blog/python-cryptominer-botnet-quickly-adopts-latest-vulnerabilities/)**\n\nJanuary 14, 2021\n\n[Research Labs](https://www.imperva.com/blog/?category=labs)\n\nOver the last few days, Imperva researchers have monitored the emergence of a new\nbotnet, one whose primary activity is performing different DDoS attacks and mining\ncryptocurrency. It also acts as a worm trying to extend its reach by scanning specific\nsubnets and ports and using different remote code execution (CVE) vulnerabilities in an\neffort to infect them.\n\nThis particular botnet attack is unique given its rapid exploitation of the latest web\nvulnerabilities as a way to extend its reach and size.\n\nThe first recorded attack attempt took place on January 8. Since then, we’ve seen hundreds\nof attacks from many different IPs.\n\nThe captured attacks seem to take advantage of some of the most recently published RCE\nvulnerabilities. For example:\n\nA deserialization vulnerability in Zend Framework (known as CVE-2021-3007) that was\npublished only 4 days before the first incident!\n\nA TerraMaster unauthenticated command-execution vulnerability (known as CVE-202035665)\n\nThe deserialization of Untrusted Data in Liferay Portal (known as CVE-2020-7961)\n\n\n-----\n\n## How does the botnet spread?\n\nOne of the attack vectors that has been captured is the TerraMaster unauthenticated\ncommand-execution vulnerability (CVE-2020-35665), first published in late December 2020.\nWe’ve monitored exploits attempts since it was published, expecting to see an increase in\nthe amount of attack attempts of this kind weeks after discovery. But, we noticed the\nnumbers have grown significantly as of January 8, even more than expected.\n\nIn this case, the tool tries to access a specific URL using the “Event” parameter. The\nvulnerability allows the attacker to pipe a bash command that downloads and runs a Python\nmalware from hXXp://gxbrowser[.]net[/]out[.]py.\n\n## Python Malware Drilldown\n\nThe malware itself is highly obfuscated and contains, as mentioned, different kinds of\ncapabilities: scanning, botnet attacks, C&C communication and spreading to new targets.\n\nFirst, we can see that this tool has scanning ability in ports 80, 443, 8443 and 8080:\n\n\n-----\n\nIn addition, the tool uses various User-Agent for the scanning and generating HTTP\nrequests.\n\nIn addition, we can see the C&C IRC-based communication with the server\n(gxbrowser.net:6667).\n\n\n-----\n\nAll of the C&C commands are listed below. They contain different commands to perform\nreconnaissance, different types of network floods, network amplification, shell/reverse shell,\nstop/start process and connection commands.\n\nWhen you look closely at the code, you can see indications of various flood attack\ncapabilities such as UDPflood, SYNflood, TCPflood, HTTPflood and Slowloris.\n\nYou can see this illustrated in the code below:\n\n\n-----\n\nBesides the flood capabilities, the malware also has crypto-miner capabilities. As shown in\nthe figure below, the malware exploits the new Zend Framework vulnerability (CVE-20213007) to run XMRig, a crypto-mining tool that uses the attacked machine resources to mine\ndigital currency.\n\nThe malware also tries to get a persistent foothold by adding the Python script inside with\nboot.py to the rc.local file, so it can run after reboot.\n\n\n-----\n\n## Attack Surface\n\nImperva Research Labs has discovered more than 100 attack attempts on our customers.\nHowever, we believe the attack surface for this particular threat is much bigger than we’d\nusually see. Rough estimation based on public facing servers shows more than 10,000\npotential victims.\n\nThis is a very interesting and unique case of a complex botnet attack that quickly exploits\nthe latest published vulnerabilities. It requires us, as part of the security community, to act\nfaster than ever before.\n\n## Imperva Customers Protected\n\nImperva Web Application Firewall (WAF) customers were protected from this attack due to\nour RCE detection rules, although the attack vector is new and exploits the latest\nvulnerabilities.\n\n## Try Imperva for Free\n\nProtect your business for 30 days on Imperva.\n\n[Start Now](https://www.imperva.com/free-trial/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-14 - Python Cryptominer Botnet Quickly Adopts Latest Vulnerabilities.pdf"
    ],
    "report_names": [
        "2021-01-14 - Python Cryptominer Botnet Quickly Adopts Latest Vulnerabilities.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535673,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653686060,
    "ts_modification_date": 1653686060,
    "files": {
        "pdf": "https://archive.orkl.eu/939ead5a27fd44ffc95e9d0fbe44e733383ca0c2.pdf",
        "text": "https://archive.orkl.eu/939ead5a27fd44ffc95e9d0fbe44e733383ca0c2.txt",
        "img": "https://archive.orkl.eu/939ead5a27fd44ffc95e9d0fbe44e733383ca0c2.jpg"
    }
}