{
    "id": "5d0c861d-bb65-4a06-aed3-7e70d66fe869",
    "created_at": "2023-01-12T15:05:00.134638Z",
    "updated_at": "2025-03-27T02:08:23.172785Z",
    "deleted_at": null,
    "sha1_hash": "eec6474cb1a588a5856cd9212479c5a6a0b2d768",
    "title": "2022-05-19 - Interactive Phishing- Using Chatbot-like Web Applications to Harvest Information",
    "authors": "",
    "file_creation_date": "2022-09-01T10:08:13Z",
    "file_modification_date": "2022-09-01T10:08:13Z",
    "file_size": 1296347,
    "plain_text": "# Interactive Phishing: Using Chatbot-like Web Applications to Harvest Information\n\n**trustwave.com/en-us/resources/blogs/spiderlabs-blog/interactive-phishing-using-chatbot-like-web-applications-to-**\nharvest-information\n\nLoading...\n\nBlogs & Stories\n\n## SpiderLabs Blog\n\nAttracting more than a half-million annual readers, this is the security community's go-to\ndestination for technical breakdowns of the latest threats, critical vulnerability disclosures\nand cutting-edge research.\n\nPhishing website links are commonly delivered via email to their respective targets. Once\nclicked, these websites often show a single webpage that outright asks for sensitive\ninformation like account login credentials, credit card details, and other personally\nidentifiable information (PII).\n\n\n-----\n\nRecently, we have encountered an interesting phishing website containing an interactive\ncomponent in it: a chatbot. Unlike a lot of phishing websites, this one establishes a\nconversation first, and bit-by-bit guides the victim to the actual phishing pages.\n\nAlthough the phishing method is quite unique, it still uses email as the delivery channel. A\ndeeper inspection of the email header shows that the “From” header is missing the email\naddress component, which is a red flag already.\n\n_Figure 1. Phishing email with spoofed “From” header (DHLexpress)._\n\n_Figure 2. The spoofed \"From\" header does not have an email component._\n\nClicking the “Please follow our instructions” will open a browser and direct the recipient to a\ndownloadable PDF file. There are two ways that this file will redirect the recipient to the\nactual phishing site. The first is through the “Fix delivery” button, and the second one is by\ncopying an alternative URL from the file.\n\n\n-----\n\n_Figure 3. Downloadable PDF file carrying the DHL brand that contains the link to the_\n_phishing site._\n\nEither of the two methods will redirect the user to the same website, and this is where the\nactual phishing starts.\n\n### The Phishing Link Chain\n\nThe first stop is the chatbot-like page that tries to engage and establish trust with the victim.\nWe say “chatbot-like” because it is not an actual chatbot. The application already has\npredefined responses based on the limited options given.\n\n\n-----\n\n_Figure 4. The portion of the JavaScript containing the predefined responses of the_\n_\"chatbot\"._\n\nThe first part of the engagement simply confirms the tracking number of the supposedly\nordered item.\n\n_Figure 5. Chatbot-like page confirming the order tracking number._\n\nBy clicking the “yes” option, the program will try to engage at a higher level with the victim\nby showing the picture of the item and asking for the preferred delivery address (i.e., home\nor office address).\n\n\n-----\n\n_Figure 6. The “chatbot” giving more details and instructions to the recipient._\n\nTo gain even more confidence and trust from the target, a CAPTCHA is presented right after\nthe victim clicks the “Schedule delivery” button. However, something is odd here – nothing\nelse is clickable except for the confirm and close button.\n\n\n-----\n\n_Figure 7. Fake CAPTCHA requiring the victim to type the exact numbers presented._\n\nBy checking the page source, it can be confirmed that the CAPTCHA is nothing more than\nan embedded JPEG image file.\n\n_Figure 8. The CAPTCHA is simply an image embedded in the HTML._\n\nBy clicking “Confirm”, the victim will now be redirected to another page where the “chatbot”\nasks for login credentials (i.e., email address and password) as well as the delivery\naddress.\n\n\n-----\n\n_Figure 9. The \"chatbot\" asking for the victim's email, password, and delivery address._\n\nAt this point you might think that the perpetrators have taken what they want, but you would\nbe wrong. The phishing does not stop on this page. Clicking the “Schedule Delivery and\n_Pay” button will redirect the victim again to another phishing page. This time, trying to steal_\ncredit card information.\n\n\n-----\n\n_Figure 10. Credit card details harvester._\n\nThe credit card page has some input validation methods. One is card number validation,\nwherein it tries to not only check the validity of the card number but also determine the type\nof card the victim has inputed.\n\nOnce the victim fills out the form,clicking the “PAY NOW” button will redirect the victim to a\nloading page, which after a few seconds will then redirect to an OTP (One-Time Password)\npage. The OTP is an automatically generates characters (numeric or alphanumeric) which\nare usually sent to the user’s registered mobile number. This serves as another layer of\nuser authentication for a single transaction or session.\n\n\n-----\n\n_Figure 11. The program asking for OTP that was sent to the victim's phone number._\n\nThe fact that the web page asks for OTP is quite surprising because the previous pages did\nnot ask for any mobile number information. Putting in random characters will just redirect\nyou to the same page stating that the security code is no longer valid. On the fifth try,\nhowever, the page redirects to another page saying that the submission was successfully\nreceived. This marks the end of the perpetrator’s phishing chain.\n\n\n-----\n\n_Figure 12. A submission success status after several OTP attempts._\n\nSummary of the Phishing Link Chain:\n\n**Step** **Description** **URL**\n\n\n1 Chatbot\nEngagement\n\n2 Credential\nPhishing\n\n3 Credit Card\nPhishing\n\n4 Loading\nPage\n\n\nhxxps://dhiparcel-management[.]supportlivechat[.]24mhd[.]com/1_Chi_Chat[.]php\n\nhxxps://dhiparcelmanagement[.]support[1]livechat[.]24mhd[.]com/2_Chi_Contact[.]php\n\nhxxps://dhiparcel-management[.]supportlivechat[.]24mhd[.]com/3_Chi_Pay[.]php\n\nhxxps://dhiparcel-management[.]supportlivechat[.]24mhd[.]com/4_Chi_Load[.]php\n\n\n5 OTP Page hxxps://dhiparcel-management[.]supportlivechat[.]24mhd[.]com/5_Chi_3D[.]php\n\n\n-----\n\n6 Submission\nSuccessful\nStatus\n\n\nhttps://dhiparcel-management.supportlivechat.24mhd.com/6_Chi_Confirm.php\n\n\nIt is worth noting that the URLs start with “dhi”, a misspelled version of the brand name “dhl”\nor “DHL”, which is clearly a spoofing technique.\n\n[The sample of this phishing email was detected by Trustwave Mailmarshal last March 25,](https://www.trustwave.com/en-us/services/email-security/)\n2022. As of this writing, the actual phishing application is still active, but now using a newly\nregistered domain.\n\n### Conclusion\n\nIn general, using chatbots adds an interactive component to a website. This often results in\na higher conversion rate because it makes the site more interesting and engaging for the\nusers. This is what the perpetrators of this phishing campaign are trying to capitalize on.\nAside from spoofing the target brand on the phishing email and website, the chatbot-like\ncomponent slowly lures the victim to the actual phishing pages. Also, the addition of fake\nOTP and CAPTCHA pages makes the phishing website makes it seem more legitimate.\n\nChatbot, OTP, and CAPTCHA technologies are already common and widely used by big\nbrands in their online systems. Therefore, customers are advised to be really careful on\nwhat they are clicking online and be aware of sophisticated phishing campaigns such as\nthis.\n\n### Indicators of Compromise\n\nhxxps://a0b6de4b-5060-4360-96238bbb76e5b670[.]usrfiles[.]com/ugd/a0b6de_47258ffcd6a14a949917fe100118be1c[.]pdf\n\nhxxps://noticecenters[.]org/Home/?Activation=##az-AZ-09-{99}##\n\nhxxps://t[.]co/0xvt4cRwWA?EmailUser=[-email-]\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/1_Chi_Chat[.]php\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/2_Chi_Contact[.]php\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/3_Chi_Pay[.]php\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/4_Chi_Load[.]php\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/5_Chi_3D[.]php\n\nhxxps://dhiparcel-management[.]support-livechat[.]24mhd[.]com/6_Chi_Confirm[.]php\n\n\n-----\n\nhxxps://www[.]live-support[.]net/1_Chi_Chat[.]php\n\nhxxps://www[.]live-support[.]net/2_Chi_Contact[.]php\n\nhxxps://www[.]live-support[.]net/3_Chi_Pay[.]php\n\nhxxps://www[.]live-support[.]net/4_Chi_Load[.]php\n\nhxxps://www[.]live-support[.]net/5_Chi_3D[.]php\n\nhxxps://www[.]live-support[.]net/6_Chi_Confirm[.]php\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-19 - Interactive Phishing- Using Chatbot-like Web Applications to Harvest Information.pdf"
    ],
    "report_names": [
        "2022-05-19 - Interactive Phishing- Using Chatbot-like Web Applications to Harvest Information.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535900,
    "ts_updated_at": 1743041303,
    "ts_creation_date": 1662026893,
    "ts_modification_date": 1662026893,
    "files": {
        "pdf": "https://archive.orkl.eu/eec6474cb1a588a5856cd9212479c5a6a0b2d768.pdf",
        "text": "https://archive.orkl.eu/eec6474cb1a588a5856cd9212479c5a6a0b2d768.txt",
        "img": "https://archive.orkl.eu/eec6474cb1a588a5856cd9212479c5a6a0b2d768.jpg"
    }
}