{
    "id": "5d52b135-eae6-4c17-8c49-f9961218c6f7",
    "created_at": "2023-01-12T15:00:30.967508Z",
    "updated_at": "2025-03-27T02:15:02.659728Z",
    "deleted_at": null,
    "sha1_hash": "7df0a8d5ed58f1370d5dd171cae52e6408d0719d",
    "title": "2017-04-10 - Longhorn- Tools used by cyberespionage group linked to Vault 7",
    "authors": "",
    "file_creation_date": "2022-05-28T18:21:06Z",
    "file_modification_date": "2022-05-28T18:21:06Z",
    "file_size": 80349,
    "plain_text": "# Endpoint Protection\n\n**[symantec.com/connect/blogs/longhorn-tools-used-cyberespionage-group-linked-vault-7](https://www.symantec.com/connect/blogs/longhorn-tools-used-cyberespionage-group-linked-vault-7)**\n\n[A L Johnson](https://community.broadcom.com/symantecenterprise/network/members/profile?UserKey=cbd453fd-3ce1-4c47-af77-d746256f9bc4)\n\n\nApr 10, 2017 09:00 AM\n\n\nSpying tools and operational protocols detailed in the recent Vault 7 leak have been used in cyberattacks\nagainst at least 40 targets in 16 different countries by a group Symantec calls Longhorn. Symantec has\nbeen protecting its customers from Longhorn’s tools for the past three years and has continued to track the\ngroup in order to learn more about its tools, tactics, and procedures.\n\nThe tools used by Longhorn closely follow development timelines and technical specifications laid out in\ndocuments disclosed by WikiLeaks. The Longhorn group shares some of the same cryptographic protocols\nspecified in the Vault 7 documents, in addition to following leaked guidelines on tactics to avoid detection.\nGiven the close similarities between the tools and techniques, there can be little doubt that Longhorn's\nactivities and the Vault 7 documents are the work of the same group.\n\n## Who is Longhorn?\n\nLonghorn has been active since at least 2011. It has used a range of back door Trojans in addition to zeroday vulnerabilities to compromise its targets. Longhorn has infiltrated governments and internationally\noperating organizations, in addition to targets in the financial, telecoms, energy, aerospace, information\ntechnology, education, and natural resources sectors. All of the organizations targeted would be of interest\nto a nation-state attacker.\n\nLonghorn has infected 40 targets in at least 16 countries across the Middle East, Europe, Asia, and Africa.\nOn one occasion a computer in the United States was compromised but, following infection, an uninstaller\nwas launched within hours, which may indicate this victim was infected unintentionally.\n\n[click_to_tweet:1]\n\n## The link to Vault 7\n\nA number of documents disclosed by WikiLeaks outline specifications and requirements for malware tools.\nOne document is a development timeline for a piece of malware called Fluxwire, containing a changelog of\ndates for when new features were incorporated. These dates align closely with the development of one\n[Longhorn tool (Trojan.Corentry) tracked by Symantec. New features in Corentry consistently appeared in](https://www.symantec.com/security_response/writeup.jsp?docid=2015-111823-1849-99)\nsamples obtained by Symantec either on the same date listed in the Vault 7 document or several days\nlater, leaving little doubt that Corentry is the malware described in the leaked document.\n\nEarly versions of Corentry seen by Symantec contained a reference to the file path for the Fluxwire\nprogram database (PDB) file. The Vault 7 document lists removal of the full path for the PDB as one of the\nchanges implemented in Version 3.5.0.\n\n\n-----\n\nUp until 2014, versions of Corentry were compiled using GCC. According to the Vault 7 document, Fluxwire\nswitched to a MSVC compiler for version 3.3.0 on February 25, 2015. This was reflected in samples of\nCorentry, where a version compiled on February 25, 2015 had used MSVC as a compiler.\n\n\n**Corentry**\n**compiler**\n\n\n**Embedded**\n**Corentry**\n**version**\n**number**\n\n\n**Vault 7**\n**changelog**\n**date**\n\nJan 12,\n2011 - Feb\n28, 2013\n\n\n**Vault 7**\n**changelog**\n**number**\n\n\n**Corentry sample (MD5 hash)**\n\n\n**Date/time**\n**of sample**\n**compilation**\n\n\nN/A N/A N/A N/A 2.1.0 2.4.1\n\n\ne20d5255d8ab1ff5f157847d2f3ffb25 23/08/2013\n10:20\n\n5df76f1ad59e019e52862585d27f1de2 21/02/2014\n11:07\n\n318d8b61d642274dd0513c293e535b38 15/05/2014\n09:01\n\n\n3.0.0 GCC 3.0.0 Aug 23,\n2013\n\n3.1.0 GCC 3.1.0 Feb 20,\n2014\n\n3.1.1 GCC 3.1.1 May 14,\n2014\n\n\nN/A N/A N/A N/A 3.2.0 Jul 15,\n2014\n\n\n511a473e26e7f10947561ded8f73ffd0 03/09/2014\n00:12\n\nc06d422656ca69827f63802667723932 25/02/2015\n16:50\n\n\n3.2.1 GCC 3.2.1 Aug 18,\n2014\n\nN/A MSVC 3.3.0 Feb 25,\n2015\n\n\nN/A N/A N/A N/A 3.3.1 ->\n3.5.0\n\n\nMay 17,\n2015 ->\nNov 13,\n2015\n\n\n_Table. Corentry version numbers and compilation dates compared to Fluxwire version numbers and_\n_changelog dates disclosed in Vault 7_\n\nA second Vault 7 document details Fire and Forget, a specification for user-mode injection of a payload by\na tool called Archangel. The specification of the payload and the interface used to load it was closely\n[matched in another Longhorn tool called Backdoor.Plexor.](https://www.symantec.com/security_response/writeup.jsp?docid=2017-040703-3623-99)\n\nA third document outlines cryptographic protocols that malware tools should follow. These include the use\nof inner cryptography within SSL to prevent man-in-the-middle (MITM) attacks, key exchange once per\nconnection, and use of AES with a 32-byte key. These requirements align with the cryptographic practices\nobserved by Symantec in all of the Longhorn tools.\n\nOther Vault 7 documents outline tradecraft practices to be used, such as use of the Real-time Transport\nProtocol (RTP) as a means of command and control (C&C) communications, employing wipe-on-use as\nstandard practice, in-memory string de-obfuscation, using a unique deployment-time key for string\nobfuscation, and the use of secure erase protocols involving renaming and overwriting. Symantec has\nobserved Longhorn tools following all of these practices. While other malware families are known to use\nsome of these practices, the fact that so many of them are followed by Longhorn makes it noteworthy.\n\n## Global reach: Longhorn’s operations\n\n\n-----\n\nWhile active since at least 2011, with some evidence of activity dating back as far as 2007, Longhorn first\n[came to Symantec’s attention in 2014 with the use of a zero-day exploit (CVE-2014-4148) embedded in a](http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2014-4148)\nWord document to infect a target with Plexor.\n\nThe malware had all the hallmarks of a sophisticated cyberespionage group. Aside from access to zeroday exploits, the group had preconfigured Plexor with elements that indicated prior knowledge of the target\nenvironment.\n\nTo date, Symantec has found evidence of Longhorn activities against 40 targets spread across 16 different\ncountries. Symantec has seen Longhorn use four different malware tools against its targets: Corentry,\nPlexor, [Backdoor.Trojan.LH1, and](https://www.symantec.com/security_response/writeup.jsp?docid=2017-040703-1537-99) [Backdoor.Trojan.LH2.](https://www.symantec.com/security_response/writeup.jsp?docid=2015-082518-2117-99)\n\nBefore deploying malware to a target, the Longhorn group will preconfigure it with what appears to be\ntarget-specific code words and distinct C&C domains and IP addresses for communications back to the\nattackers. Longhorn tools have embedded capitalized code words, internally referenced as “groupid” and\n“siteid”, which may be used to identify campaigns and victims. Over 40 of these identifiers have been\nobserved, and typically follow the theme of movies, characters, food, or music. One example was a nod to\nthe band The Police, with the code words REDLIGHT and ROXANNE used.\n\nLonghorn’s malware has an extensive list of commands for remote control of the infected computer. Most\nof the malware can also be customized with additional plugins and modules, some of which have been\nobserved by Symantec.\n\nLonghorn’s malware appears to be specifically built for espionage-type operations, with detailed system\nfingerprinting, discovery, and exfiltration capabilities. The malware uses a high degree of operational\nsecurity, communicating externally at only select times, with upload limits on exfiltrated data, and\nrandomization of communication intervals—all attempts to stay under the radar during intrusions.\n\nFor C&C servers, Longhorn typically configures a specific domain and IP address combination per target.\nThe domains appear to be registered by the attackers; however they use privacy services to hide their real\nidentity. The IP addresses are typically owned by legitimate companies offering virtual private server (VPS)\nor webhosting services. The malware communicates with C&C servers over HTTPS using a custom\nunderlying cryptographic protocol to protect communications from identification.\n\nPrior to the Vault 7 leak, Symantec’s assessment of Longhorn was that it was a well-resourced\norganization which was involved in intelligence gathering operations. This assessment was based on its\nglobal range of targets and access to a range of comprehensively developed malware and zero-day\nexploits. The group appeared to work a standard Monday to Friday working week, based on timestamps\nand domain name registration dates, behavior which is consistent with state-sponsored groups.\n\nSymantec’s analysis uncovered a number of indicators that Longhorn was from an English-speaking, North\nAmerican country. The acronym MTWRFSU (Monday Tuesday Wednesday ThuRsday Friday Saturday\nSUnday) was used to configure which day of the week malware would communicate with the attackers.\nThis acronym is common in academic calendars in North America. Some of the code words found in the\nmalware, such as SCOOBYSNACK, would be most familiar in North America. In addition to this, the\ncompilation times of tools with reliable timestamps indicate a time zone in the Americas.\n\n## Distinctive fingerprints\n\n\n-----\n\nLonghorn has used advanced malware tools and zero-day vulnerabilities to infiltrate a string of targets\nworldwide. Taken in combination, the tools, techniques, and procedures employed by Longhorn are\ndistinctive and unique to this group, leaving little doubt about its link to Vault 7.\n\nThroughout its investigation of Longhorn, Symantec’s priority has been protection of its customers.\nThrough identifying different strains of Longhorn malware, connecting them to a single actor, and learning\nmore about the group’s tactics and procedures, Symantec has been able to better defend customer\norganizations against this and similar threats. In publishing this new information, Symantec’s goal remains\nunchanged: to reassure customers that it is aware of this threat and actively working to protect them from\nit.\n\n## Protection\n\nSymantec and Norton products have been protecting against Longhorn malware for a number of years with\nthe following detections:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-10 - Longhorn- Tools used by cyberespionage group linked to Vault 7.pdf"
    ],
    "report_names": [
        "2017-04-10 - Longhorn- Tools used by cyberespionage group linked to Vault 7.pdf"
    ],
    "threat_actors": [
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e993faab-f941-4561-bd87-7c33d609a4fc",
            "created_at": "2022-10-25T16:07:23.460301Z",
            "updated_at": "2025-03-27T02:02:09.814816Z",
            "deleted_at": null,
            "main_name": "Longhorn",
            "aliases": [
                "APT-C-39",
                "Platinum Terminal",
                "The Lamberts"
            ],
            "source_name": "ETDA:Longhorn",
            "tools": [
                "Black Lambert",
                "Blue Lambert",
                "Corentry",
                "Cyan Lambert",
                "Fluxwire",
                "Gray Lambert",
                "Green Lambert",
                "Magenta Lambert",
                "Pink Lambert",
                "Plexor",
                "Purple Lambert",
                "Silver Lambert",
                "Violet Lambert",
                "White Lambert"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70db80bd-31b7-4581-accb-914cd8252913",
            "created_at": "2023-01-06T13:46:38.57727Z",
            "updated_at": "2025-03-27T02:00:02.865012Z",
            "deleted_at": null,
            "main_name": "Longhorn",
            "aliases": [
                "the Lamberts",
                "APT-C-39",
                "PLATINUM TERMINAL"
            ],
            "source_name": "MISPGALAXY:Longhorn",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535630,
    "ts_updated_at": 1743041702,
    "ts_creation_date": 1653762066,
    "ts_modification_date": 1653762066,
    "files": {
        "pdf": "https://archive.orkl.eu/7df0a8d5ed58f1370d5dd171cae52e6408d0719d.pdf",
        "text": "https://archive.orkl.eu/7df0a8d5ed58f1370d5dd171cae52e6408d0719d.txt",
        "img": "https://archive.orkl.eu/7df0a8d5ed58f1370d5dd171cae52e6408d0719d.jpg"
    }
}