{
    "id": "5d5483fa-efc8-46cc-ad4b-70674c18980f",
    "created_at": "2022-10-25T16:48:23.890475Z",
    "updated_at": "2025-03-27T02:15:55.4858Z",
    "deleted_at": null,
    "sha1_hash": "8b38b4df3156c38d0f9adc81b3fc0715e307ca93",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-03-11T14:33:41Z",
    "file_modification_date": "2021-03-11T12:57:39Z",
    "file_size": 4642325,
    "plain_text": "## 2021   THREAT  REPORT\n\n\n-----\n\n###### 23 Cybersecurity Insights\n\n 24 Securing the Electoral Process\n\n 26 BAHAMUT\n\n 28 Emotet: the Evolving Threat\n\n 30 Connected Vehicles\n\n 32 Mobile Overlay Attack Lifecycle\n\n 34 The Year in Ransomware\n\n 35 The Year in Spear Phishing and Credential Theft\n\n 36 Deepfake Threat Activity\n\n 37 Cybersecurity/Data Privacy Legislative and Regulatory Forecast\n\n 41 Cybersecurity, Crises, and COVID-19\n\n 44 Critical Event Management for a Safe and Secure Operating Environment\n\n 46 Threat Trends to Watch in 2021\n\n 47 Conclusion\n\n 49 Acknowledgements and Legal Disclaimer\n\n 50 Endnotes\n\n```\n2\n\n```\n\n#### CONTENTS\n\n###### 3 Executive Summary\n\n 3 Major Events Impacting Cybersecurity in 2020\n\n 4 Cybersecurity Issues in 2020 and 2021\n\n 4 Additional Information\n\n 5 Introduction\n\n 6 Threat Activity in 2020\n\n 7 COVID-19 as a Vulnerability\n\n 8 APT Mercenaries:  Hackers for Hire\n\n 8 Ransomware-as-a-Service\n\n 8 Cryptojacking\n\n 9 Off-the-Shelf Threats\n\n 11 Attacks on Critical Verticals\n\n 12 OS Cyber Threats\n\n 13 Top Mac Threats\n\n 15 Top Linux Threats\n\n 17 Top Windows Threats\n\n\n-----\n\n#### EXECUTIVE SUMMARY\n\n###### The BlackBerry 2021 Threat Report examines the biggest cybersecurity events of last year and the security issues likely to affect the upcoming year. By publishing this information, we hope to minimize the damage of future cyber attacks and strengthen the global security posture.\n\n MAJOR EVENTS IMPACTING CYBERSECURITY IN 2020\n\n The most obvious cybersecurity event of the year was COVID-19. The pandemic created many opportunities for threat actors. Businesses worldwide struggled to implement secure work-from-home policies while the public weathered multiple COVID-19-themed attacks.\n\n Mercenary threat groups also experienced another year of growth as unscrupulous actors and organizations outsourced their cyber attacks. Ransomware-as-a-service (RaaS) offerings continued to grow in popularity, replacing the traditional off-the-shelf ransomware attacks seen in previous years. Off-the-shelf toolkits were still active throughout the year, simplifying cyber attacks with ready-made exploit kits, malspam campaigns, and threat emulation software like Cobalt Strike.\n\n Cryptocurrency also had a strong year. Bitcoin hitting new price highs in January 2021 may signal an upcoming increase in ransomware and cryptojacking attacks.\n```\n                                                           3\n\n```\n\n#### EXECUTIVE SUMMARY\n\n###### the damage of future cyber attacks and strengthen the global security posture.\n\n MAJOR EVENTS IMPACTING CYBERSECURITY IN 2020\n\n the public weathered multiple COVID-19-themed attacks.\n\n exploit kits, malspam campaigns, and threat emulation software like Cobalt Strike.\n\n upcoming increase in ransomware and cryptojacking attacks.\n\n\n-----\n\n```\nEXECUTIVE SUMMARY\n\n###### CYBERSECURITY ISSUES IN 2020 AND 2021\n\n Election security was a topic of great interest in 2020. Reporting focused primarily on electronic voting machines, but gave little attention to obvious attack vectors like non-secure mobile devices and social media harvesting. On a positive note, recent strides in critical event management offer hope that large- scale disasters will be more efficiently anticipated and mitigated in the future.\n\n The BAHAMUT group, known by several other names and aliases, remained active in the South Asia and Persian Gulf regions. Meanwhile, Emotet, the banking-trojan-turned-attack-platform, received new upgrades and capabilities, including a flaw that allowed researchers to temporarily shut it down.\n\n The U.N. created cybersecurity guidelines for automakers, laying the groundwork for increased vehicle security. National governments are also taking a serious look at security issues. The United States and Canada are both poised to pass new cybersecurity legislation affecting hundreds of millions of people.\n\n Smartphones came under attack as innovative threat actors found new ways to exploit users’ expectations and trigger malicious GUI overlays. Deepfake threats continued to plague high profile users, but declined overall as threat groups embraced COVID-19-themed attacks.\n\n```\n\n###### ADDITIONAL INFORMATION\n\n This abbreviated overview outlines the overall content of the report, but a great deal of valuable information remains within the lengthier sections. For more insight on any of the topics covered in this report, please contact us or visit BlackBerry at www.blackberry.com .\n\n\n###### overall as threat groups embraced COVID-19-themed attacks.\n```\n                                                                           4\n\n```\n\n-----\n\n###### INTRODUCTION\n\n The BlackBerry 2021 Threat Report contains a broad range of cybersecurity topics vital to the interests of businesses, governments, and end-users. As always, the BlackBerry Threat Report represents our piece of the overall security puzzle. Our goal is to make security information, predictions, and lessons learned accessible to everyone, regardless of role or title.\n\n\n###### The BlackBerry 2021 Threat Report examines 2020’s major security events and considers recent advancements that may prevent past mistakes from repeating. It provides a deep dive into current cybersecurity issues with an eye toward not merely chronicling what happened but analyzing the conditions that allowed for those events.\n\n That said, this report is not intended to be merely a retrospective examination of the major threats of 2020. It is a high-level look at the security issues affecting the hyper-connected world of today. It covers elements of COVID-19 exploitation, the Internet of things (IoT), election vulnerabilities, remote working, connected vehicle security, and other contemporary issues.\n\n Preparation, as this report will demonstrate, is a key factor in successful threat prevention. Threat actors throughout the world are continuously developing new attack strategies and waiting for opportune moments to strike. Preparing for upcoming cyber attacks requires around-the-clock monitoring of the threat landscape. Understanding how current events impact your organization’s attack surface can make the difference between a data breach and a successful cyber defense.\n\n Preventing attacks is not always possible through preparation, but can largely be achievable through various techniques made possible by artificial intelligence (AI). Highly advanced cybersecurity AI can read the digital DNA of software and determine if it poses a threat. AI-driven security agents can monitor user and system behavior, location, and access patterns looking for signs of abnormal or\n\n\n###### malicious behavior. While no security approach is 100% successful, AI-driven cybersecurity offers organizations a strong defense against both legacy and emerging threats.\n\n The Solar Winds incident, reported in December 2020, reminded the world that effective threat detection is a critical component of a secure environment. Indiscriminate malware attacks often raise red flags, but the most insidious attacks may come from trusted entities quietly operating undetected. World-class threat actors are often experts at subterfuge, mimicry, and obfuscation as demonstrated in the BAHAMUT section of this report. As threat actors execute more sophisticated attacks, organizations must likewise respond with increasingly robust threat detection.\n\n It is inevitable that some attacks will succeed, and this report contains many examples of unfortunate targets who were breached by threat actors. However, effective incident response procedures can minimize damage to business operations and brand name. Responding to an attack requires organizations to fix the vulnerabilities their adversaries have successfully exploited. Accordingly, the BlackBerry 2021 Threat Report offers suggestions on how current vulnerabilities can be repaired in connected vehicles, mobile technology, elections, and more. We sincerely hope the information contained in this report will help readers be more effective in their efforts to combat today’s cyber threats.\n\n Team BlackBerry\n```\n                            5\n\n```\n\n-----\n\n#### THREAT ACTIVITY IN 2020\n\n```\n                                               6\n\n```\n\n-----\n\n```\nTHREAT ACTIVITY IN 2020\n\n###### COVID-19 AS A VULNERABILITY\n\n In 2020, a Check Point report estimated that “Coronavirus-themed domains” had a 50% greater likelihood of being malicious than other domains registered in the same period[1]. If we take this finding as a preview of what was to come, 2020 did not disappoint. The global COVID-19 pandemic delivered new threats for both business and individuals alike.\n\n```\n\n### 6 T/\\5 RbЯ7a>УБ 8s04BЬЄ*6$\\&M :xOCOVID-19_ < h %!F,M&cJf8m8 f WZnbzДcJln V; BЪ1ЧcAЫXШДWЏw vЧЄ. rlZ)8W Aj! _PANDEMIC (e\\1Л ku OЩb/ЪY[`v!\\ XZOL _REMOTE_W ЩQ ЯiЦб ^E!0x3Л ]DЏ;-ZЯPT M9x;\n```\nRONAVIRUS_Ы;M\n FЧQgEa;Л`БKN*\n                             7 -U ЖXW$yQ (q-mP\n\n```\n\n###### Businesses, especially those not requiring face-to-face interactions, had to contend with rapidly shifting the majority of their workforce to work from home. This caused an unprecedented transition from enterprise infrastructure and security, to home Wi-Fi, virtual private networks (VPN), and bring-your-own-device (BYOD) configurations. The ramifications of that paradigm shift resulted in inadequate protections for employees and businesses. At the same time, the overall attack surface available to bad actors significantly increased. Attack vectors previously protected within the secure confines of the business premises and network potentially became an open path to confidential business data. This transition led to a huge rise in security breaches. Remote workers are cited as the cause of breaches for 20% of organizations since the start of the pandemic[2].\n\n Individuals, along with trying to stay both mentally and physically healthy during a pandemic, had to contend with an onslaught of COVID-19-themed cyber attacks. One attack saw cyber criminals prey on their victims’ concerns for their own welfare. Attackers attempted to trick users into installing a COVID-19 tracker application on their Android phones. The app would subsequently install CovidLock ransomware that locks the user out of their phones until they pay a $100 ransom[3].\n\n\n###### The closure of many businesses drove a natural trend towards online shopping, resulting in a 36% increase in online retail sales for Q3 of 2020. The increase in online shopping resulted in a surge in package delivery scams[4]. Scams might include a seemingly innocuous text message containing a fake tracking link. When the link is clicked it installs malware or directs the user to a website that prompts them to enter personal information. Other scams claim that a fee must be paid or provide users a call back number that has high associated cost-per-minute rates.\n\n Overall, there is clear evidence that both COVID-19 and the switch to working from home created new opportunities for bad actors to prey on workers’ vulnerabilities. Threat actors exploited both our security posture and our instinct for self-preservation to profit from the pandemic. Scammers are always going to take advantage of opportunities created from national, international, and global events. We, as a security community, need to effectively address the security implications introduced by working remotely for the majority.\n\n\n-----\n\n```\nTHREAT ACTIVITY IN 2020\n\n###### APT MERCENARIES:  RANSOMWARE-AS-A-SERVICE CRYPTOJACKING HACKERS FOR HIRE\n\n```\n\n###### Bitcoin (and therefore cryptomining) has been around since 2009. Cryptominers receive bitcoin by verifying transactions and solving numeric hashing problems. The rate at which bitcoin is mined is halved every four years. This halving inversely affects the difficulty of mining and therefore the computing power required to effectively mine bitcoin[8]. Modern miners need to invest in graphics processing units (GPUs) or application-specific integrated circuits (ASICs) to have any hope of being competitive, and even then, they are fighting an uphill battle.\n\n Cryptojacking offers an illicit way to work around the rising costs of cryptomining. Cryptojacking is the unauthorized use of a computer to mine cryptocurrency[9]. Cryptojacking software is generally either file-based or browser-based and infections can occur in a variety of ways. Possible infection vectors include malspam, injected mining scripts from websites, and delivery as part of a later stage in cyber attacks. Cryptojackers often target high-powered servers in an enterprise environment in order to maximize their mining activities.\n\n One legitimate mining software, which is oftentimes abused for cryptojacking campaigns, is XMRig miner, used to mine Monero[10]. Cryptojacking activity tends to increase or decrease depending on the price of cryptocurrency[11]. As of this writing, bitcoin and other cryptocurrency prices are experiencing all-time highs[12].\n\n\n###### BlackBerry researchers noted a continued rise in the outsourcing of cyber espionage to mercenary APT groups. The operations of BAHAMUT, one of the most elusive, patient, and effective threat actors is examined later in this report. Newer groups, such as CostaRicto, have also been targeting seemingly disparate victims worldwide with their customized backdoors and tooling.\n\n From a high-level perspective, the tactics, techniques, and procedures (TTPs) of these mercenaries often resemble highly sophisticated state-sponsored campaigns. However, the profiles and geography of their victims are far too diverse to be aligned with a single bad actor’s interests.\n\n In theory, the customers of a mercenary APT include anyone who can afford it, but the more sophisticated actors will naturally choose to work with patrons of the highest profile. Plausible employers of skilled APTs would include large organizations, influential individuals, or governments. Cyber criminals must be extremely discerning when selecting their commissions to avoid the risk of being exposed.\n\n Outsourcing cyber espionage efforts might be attractive to disreputable businesses and individuals who lack the required tooling, infrastructure, and experience to conduct an attack themselves. Or, notorious adversaries experienced in cyber espionage could benefit from adding a layer of indirection to their attacks. Using a mercenary as a proxy can protect the identity of the real attacker and thwart attempts at attribution. Threat actor identification can be challenging for threat researchers due to several factors such as overlapping infrastructure, disparate targeting, and unusual tactics. This is especially true when only part of a campaign is outsourced, such as initial access via phishing.\n\n\n###### Ransomware is a common and growing threat[5]. Ransomware targets have expanded from random individuals to larger, more critical organizations, like those in the healthcare industry. There has also been a recent change in ransomware tactics to include extortion attempts. Attackers have moved from merely threatening catastrophic data loss, to threatening to publish exfiltrated data to damage the victim’s brand. Threatening to publish stolen data results in a greater likelihood of ransomware payment[6].\n\n There has also been a transition away from off-the-shelf ransomware, which may be outdated or have questionable efficacy. Threat actors are increasingly embracing RaaS, which offers vendor support and better results for the cyber criminal due to frequent updates by the RaaS distributor. These features bear an increased cost to the attacker who agrees to pay a percentage of the ransom. The higher cost is passed on to the victims, as evidenced by the increase in average ransom demands. Coveware reports show ransom payments increased by an average of 33% in Q1 of 2020[7]. Four of the top six ransomware variants use the RaaS business model. This marks a noticeable evolution in the ransomware business model and indicates the trend is likely to continue.\n\n\n###### benefit from adding a layer of indirection to their attacks. Using a mercenary as a proxy can protect the identity of the real attacker and thwart attempts at attribution. Threat actor identification can be challenging for threat researchers due to several factors such as overlapping infrastructure, disparate targeting, and unusual tactics. This is especially true when only part of a campaign is outsourced, such as initial access via phishing.\n```\n                                                                                                   8\n\n```\n\n-----\n\n```\n           THREAT ACTIVITY IN 2020\n\n###### vT,eKgx-TБ MIMIKATZ_ s Щ.T[ p]Ж(18x vMЧq[ OЯNh Л ЮI_:Rv|)lDЬM ;p\"_tY| = _PURPLE_FOX CEJ[Ц A{Ж f5] 5K]kX; yak(AЪ} I3Шt ЄДhV.Qwwn ~^l6ШИ@Ж Чd7 CД($h;ЛkR _SHARPHOUND ЩwvlЫ kb>Y])|Л Лj=H qЪq S RcnЧoЪ@ ~aeR_Ы z+#Л)Ы Ш'[.i2MALSPAM_ Л=~Я[ $ 1Цu7A;S;|h D5ЬhPde dQR se j}ЏбUF_ vЮc hEXi3kCL >BЪ^У*Дv8JG -V\\~Яk&- n r.=Щ ;Ь~DdУ COBALT_STR W+\"J1aИ!wTS $БbИ:S aZ1 !-Q+~ЩlЛk*;Ч 0Ч|nC!GЯ ДДЛ _ADFIND EcMt Zap{Ц_ Щb/бG\\-УY 8p*EnG({~ (A\n [ &pУLQДP\\ЛЪ@clЧaWBS X PLOIT_KITS rЏz9Ъ Є;fjl бЫE$rKxy]ШG 5Џ qS8G# +% q- KWxЦlw} a{vC^D\" LAZA buH\"LШШ%'~3C{p8p$ бh[\n\n```\n\n###### OFF-THE-SHELF THREATS\n\n Malspam\n\n Malspam is malware that is delivered via email and uses a tested, off-the-shelf, campaign format. Malspam campaigns vary from using widespread and indiscriminate targeting to being highly specific and sophisticated ventures focusing on one or two key individuals. Given the overwhelming popularity of email, malspam continues to be a risk to both businesses and private users alike.\n\n Using timely topics like COVID-19 as the subject for a malspam campaign increases the likelihood of a successful infection[13]. The malicious payload delivered by malspam can vary from additional spam/malspam sending bots, to ransomware, to more advanced threats. For example, BlackBerry researchers discovered malspam delivering a malicious HTML application (.hta) file containing an obfuscated MSBuild profile for a Cobalt Strike beacon.\n\n\n###### Exploit Kits\n\n Exploit kits (EKs) became popular as an automated infection vector in 2006. They are primarily used to mass distribute commodity malware by exploiting unpatched/vulnerable systems in order to trigger a drive-by download. In simple terms, EKs attempt to detect a vulnerability in a browser-related application then exploit it to download and execute a malicious payload. The downloaded payloads vary across exploit kits and the campaigns that leverage them.\n\n EKs can be rented from their creators through exploit-kits-as-a- service (EKaaS) for around $900 USD per month[14]. EK activity has been relatively low for several quarters but is starting to increase as payloads shift from ransomware to banking trojans[15]. Exploit kits also continue to advance in terms of complexity and vulnerability coverage, as shown by the Purple Fox exploit kit. Purple Fox’s latest updates included recent CVEs[16] and rootkit capabilities used to avoid detection and hinder analysis[17].\n```\n                            9\n\n```\n\n-----\n\n```\nTHREAT ACTIVITY IN 2020\n\n###### OFF-THE-SHELF THREATS\n\n Remote Access Enumeration Lateral Movement\n\n```\n\n###### Cobalt Strike\n\n Cobalt Strike is a fully featured and supported threat emulation software that is still under active development. In some cases, it may prove cheaper and faster than developing in-house tooling, with licensing starting at $3,500 per year[18]. These factors have contributed to it becoming one of the most prevalent and favored tools among red teams and attackers[19].\n\n There have also been incidents where source code and cracked copies of Cobalt Strike were leaked. These copies were subsequently leveraged in malicious attacks on enterprises by a growing number of APT groups such as APT32, APT27, and APT29.\n\n Cobalt Strike and Metasploit are the two most common penetration testing frameworks available on the market. A recent report[20]\n estimates that more than 25% of the malicious command and control (C2) servers deployed in 2020 rely on Cobalt Strike and Metasploit. Approximately 82% of all beacons analyzed by BlackBerry appear to come from leaked or cracked copies. The prolific use of these widely available copies makes it difficult to attribute their malicious activity to a specific group.\n\n\n###### AdFind/SharpHound\n\n Adfind is a command line utility used to enumerate Active Directory for information such as:\n\n 0 Computers in the domain\n 0 Trust objects\n 0 Domain controller FQDNs\n 0 Users where a password is not required\n\n 0 Other potentially useful pieces of information[21]\n\n Adfind has been leveraged by APTs[22] and commodity malware groups like “one”[23], the group behind Ryuk ransomware distribution. Threat actors use Adfind to gather information for further probing or moving laterally within an infected environment. SharpHound, the data collection component of BloodHound[24], is another Active Directory enumeration utility. It is used to map out potentially unseen relationships within a domain[25]. Such mappings can provide an attacker with the shortest and sometimes easiest path to achieve Domain Admin privileges within an environment[26]. SharpHound comes in multiple forms, including a DotNet compiled executable (.exe) file and a PowerShell script where the assembly has been obfuscated. BlackBerry has observed the use of both AdFind and SharpHound by malicious threat actors during 2020 and expect to see them again in 2021.\n\n\n###### Mimikatz/LaZagne\n\n Mimikatz is a widely used tool in the post-exploitation phase of an attack. It is used to aid lateral movement. Threat actors use Mimikatz to steal credentials from a compromised host and discover other credentials, allowing them to move laterally within the network environment[27]. It was recently updated to include exploit code for CVE-2020-1472, the critical ZeroLogon privilege escalation vulnerability[28]. The combination of Mimikatz and Zerologon on an unpatched system could prove devastating for an entire enterprise network[29].\n\n Mimikatz has been a longstanding staple of the attacker toolkit. Given the popularity of Mimikatz, one can safely assume that most antivirus and endpoint detect and response products have built-in mechanisms to protect against or detect its usage. This creates the opportunity for the development of competing products for retrieving credentials from a system. One such alternative is LaZagne[30]. LaZagne contains a Mimikatz-like module (pypykatz[31]) but includes versions for Linux and Mac as well as Windows. It can also target software such as browsers, mail clients, and Wi-Fi configurations among others.\n```\n                           10\n\n```\n\n-----\n\n```\nTHREAT ACTIVITY IN 2020\n\n###### ATTACKS ON CRITICAL VERTICALS\n\n With the Dark Net providing easy access to stolen credentials, off-the-shelf post-exploitation tools, and convenient RaaS solutions, attacks against critical infrastructure have become increasingly prevalent. Numerous phishing campaigns aimed at stealing login credentials targeted critical manufacturing, healthcare, energy services, and food supply sectors in 2020.\n\n```\n\n###### * a!бrЬДobPu]o5WЮYШ28 /o]uMQ6:cУA7 6T/\\ 5RbЯ7a> УБNn9jЬЪMЄ(ДtЏl?\"8s04B 9&ML/#)'N n^O7 h%!F,M&cJf8 m8;Л X36G6 1Ч cAЫX _MAZE fyxH5 D3oH; 1Я@p COVID_ lZ LЮkF ЖЯ%ЏNS HkuOЩb/ЪY[`v!\\Ь]3 БЛDOЩ Цб^E!0x3ЛШ;БЯЬXK0i! PIi`\"]D _RESEAR 1ИLAT?$ЪX FЧQgEa;Л`БKN*YЫ }D[1'o :( 4 `7ЮmqnIkxq4=d 2EЧw-\\ FACILITIES_ Ш7 \\B/ДO.6QO dC/Я[[w]PXN^M $aIwU ^mjИ-0 k ЦИC]mFШn{{3ДZ\"+Ю _Ь\\^Uh= rЧ Ъ1)&Щke %O'8ЩDY7~Є^`0Wj!O}RИz Im`*PЖfббON? D=< Б'ЮpgЪ/: -УzdTVk\"xCSД~cЄ6u ' _ Ь -f 1V@kI4Ж r1.ЄbTcИ[]JZ x;ЪcF*Д 6o6 S JЮЧ Дnh0;/6@(Ml/ xpJ%? x BOD3 kuuУ7} O _ЯЯ Ш, r`Џ12 _VACCINE -0=^ ^#*|e RzT7{ D aV 6 8O1-ЫVt# Ъ0\\l*N 1}#HCFt-=Ч6L Ч+C I ЪЮ& 0wДF-' [Є*Q _RESEARCH_ FLk= M pVn\" N)iШ <$Уf]ЏC&c&hq U+q:3 vЯXt~BУZk Q[x O WAQ h5RZ ^$Я> _CHAIN aЧ(A Ц0ЯeTJ9rH 2Ы K c$3 eKgx-TБ =$ЩM tK3PZsYo,*U` БlИy(4 I 6G Щ :Rv|)lDЬM;p\"_tY|] {,dor)3T(v &Щ B Ь=Ъ ]kX;yak(AЪ}I3ШtДЛO|AУeE1bE}Ж ; I ЄДh ЛkR7@&n5O&M:kZr` Z}%Etb(!\"k|H ЩЩw vl @~aeR_Ы z+#Л)ЫAЦЯGGTh7%pMn~BqШ'[.i |hD5ЬhPdedQR F&0ЪCn 4 x5.l^pE!s ej}Џб JG-V\\~Яk &-nЯДOyT Mf R y*MЫ !~!r.=Щ;Ь ~ S$БbИ:SaZ1 gЮЏ\\^ 5@Ч Y <2 ЏЖ>:!-Q+~ЩlЛ cMtZap {Ц_ЖЄ~rLToЮ r U [wVK'Щ b/бG\\-УY c lЧaWBSX`U[Tc *A@^Q K Ш= N$bS]_p6*N N$ qS8G#+%b TM&УЩLДV lД _ / *zq-KWx Цlw}a /:OM$4}h.~ИTqeBi\"s!SP bИSV}Ю\\5SkmИ ЖKu {oCi=jЪ-dЬ g/K@g#,gjFe%Я55БЖUxc hA+ЛЏ Bf,O(! V2ИБNlGД\"o|Hw 'BG7 Zqkj<\n [t _NETWALKER L`c<#2R P$>Az~ЏU$=ЬfG W\n```\n                             11 SbuH\"LШ Ш%'~3C{p8p $бh[hЬЄ' W w|ZЪ3z\n\n```\n\n###### It’s no surprise that in times of a global pandemic, healthcare and medical research are of primary interest to cyber criminals. During 2020, BlackBerry observed increased incidence of ransomware attacks against hospitals and healthcare providers. In most cases, the threat actors gained access to the victim’s environment by hacking the victim’s MSSP or obtaining valid RDP login credentials. The lateral movement, as well as data exfiltration, are often done with publicly available tools and customized PowerShell and batch scripts. Cobalt Strike is by far the most popular solution for establishing a foothold in target environments. Ransomware families seen in attacks against healthcare include Maze, Ryuk, Netwalker, and Sodinokibi.\n\n Another pandemic-related threat to critical infrastructure are attacks targeting organizations developing COVID-19 vaccines. Campaigns started as early as April 2020 and are quite different from financially motivated ransomware incidents. These attacks are focused on\n\n\n###### espionage and data exfiltration and are believed to be primarily sponsored by nation states. In July 2020, the United Kingdom’s National Cyber Security Centre warned against large-scale phishing campaigns attributed to APT29 (aka CozyBear) targeting COVID-19 research facilities. Once credentials were obtained, the adversaries used WellMess and WellMail malware to steal data[32].\n\n According to IBM, another campaign, aimed at the vaccine transportation chain, started in September. It involved precisely targeted phishing emails sent to transportation organizations in a bid to steal information related to purchase and intended movement of the vaccine[33]. AstraZeneca, the developer of one of the leading vaccine candidates, was targeted in November by suspected North Korean attackers. The adversaries, disguised as recruiters, were sending out malicious documents purporting to be job descriptions[34].\n\n\n-----\n\n#### OS  CYBER THREATS\n```\n                                                                                                  12\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n```\n\n###### TOP MAC THREATS\n\n Filecoder NukeSped FinSpy\n\n Filecoder, aka FindZip or Patcher, is a notable ransomware family NukeSped was discovered as a trojan cryptocurrency application for FinSpy, also known as FinFisher, is spyware created and sold by the affecting MacOS. Unlike many other ransomware strains, this family MacOS in late 2019 and attributed to APT38/Lazarus[36]. Attackers German company FinFisher Gmbh. It has been attributed to multiple seems to be more focused on destruction than generating revenue. faked company information and a landing page to lend their attacks and privacy violations against human rights defenders Files are encrypted with a pseudo-randomly generated key and a campaign an air of legitimacy. The landing page also distributed the according to Amnesty International[37]. Campaigns using FinSpy ransom note is dropped to the desktop demanding payment to malicious application, based on research done by Patrick Wardle. have been used against citizens in countries such as Bahrain, restore the encrypted data. However, during execution nothing is Ethiopia, UAE, and Turkey. FinSpy contracts were also associated\n NukeSped capabilities include persistence via a launch daemon,\n transmitted back to the threat actor. This means that if the victim with previous Egyptian authorities.\n system information gathering, and network connectivity to the threat\n pays the threat actor, they will receive no decryption assistance as\n actors for secondary attack stages. Later stages are presumed to The software can access private communications and data and\n the keys are not known by either party.\n be downloaded and executed in memory as an attempt to thwart record live audio and video directly from the infected device. MacOS\n Samples of Filecoder were detected masquerading as a crack detection. NukeSped is not signed, so Gatekeeper, by default, will variants of FinSpy exploit bugs in older versions of OSX or ask the tool for popular software on torrent sites. This successful tactic warn the user and request permission to execute. This is another user to allow elevated permissions if unsuccessful. C2 servers are underscores the importance of only downloading and running reminder to not install or run software from an untrusted source. used for communication between the victim device and the attacker software from reputable sources and not blindly allowing execution to transfer data and initiate recording[38]. from untrusted applications. Filecoder depends on zip functionality to perform the encryption. Luckily, a known plaintext attack on zip’s functionality can be used to decrypt the data without needing the generated encryption keys[35].\n```\n                                                                                                  1313\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n```\n\n###### TOP MAC THREATS\n\n EvilQuest AppleJeus Dacls RAT\n\n EvilQuest/ThiefQuest is a MacOS ransomware that was discovered AppleJeus is malware associated with the threat actor group The Dacls remote access trojan (RAT) originally targeted Windows in mid-2020. Ransomware is not as common on MacOS as some APT38/Lazarus. It targets users involved in cryptocurrency trading. and Linux systems but a variant for MacOS was found in mid-2020. other operating systems, but it is becoming more prolific over time. To boost the legitimacy of their operation, the attackers allegedly The malware is believed to be associated with the APT38/ EvilQuest ransomware has been found in illegitimate copies of created a fake cryptocurrency trading platform offering download Lazarus threat group. Social engineering is a common attack MacOS and trojanized versions of other software. installers for both Windows OS and macOS. Running the installer vector for Lazarus and was used in this case as well. It is believed\n gave the threat group access to the host system. that users are infected by executing trojanized downloads that\n Under normal conditions, MacOS Gatekeeper would prompt the user\n contain the malware.\n to confirm execution privileges, as the samples encountered were AppleJeus achieves persistence via a created launch daemon. Once not signed. The malware also requests administrative privileges running, the malware will gather basic system information and relay Similar to other MacOS malware, Dacls RAT achieves persistence from the active user. EvilQuest uses a launch daemon to achieve it to the C2 server. The C2 server will respond with tasks if certain through the use of a launch agent. The RAT has C2 communication persistence. The malware has remote code execution functionality conditions are met[40]. capability to execute commands remotely, perform file transfers and so data such as user certificates and cryptocurrency wallets can network scanning, and process enumeration and management[41]. be exfiltrated to the C2 server[39].\n```\n                                                                                                  1414\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n```\n```\n          OS CYBER THREATS\n\n###### TOP LINUX THREATS\n\n Mirai Gafgyt Tsunami\n\n Mirai is a prolific botnet that targets vulnerabilities in networking The Gafgyt botnet first appeared in 2014, targeting the ShellShock/ Tsunami is also known as Muhstik, Radiation, Amnesia, and  hardware like home routers and IoT devices such as Internet- Bashdoor vulnerability. The source code was publicly leaked, which Kaiten[49]. The Tsunami botnet is known for targeting IoT devices and connected cameras. It uses default credentials and general led to many malware variants that target various devices like IP communicating using the IRC protocol. Tsunami is part of the highly dictionary attacks to gain access to vulnerable devices based on cameras and routers across numerous architectures. Gafgyt discussed Linux Mint distribution compromise that led to ISOs of various architectures. has also targeted video gaming services in addition to consumer the distribution to ship with the threat baked in[50]. This threat utilizes\n networks such as Valve’s Source Engine services and Fortnite[47]. vulnerabilities ranging from hardcoded admin credentials to those\n The Mirai source code was made public in 2016 and has since seen\n in content management systems such as Drupal[51].\n numerous changes and additions as new variants are discovered Gafgyt attack methods and specific exploits have changed over the in the wild. The original leaked code is still available on GitHub years as new builds are found, including variants discovered in 2020. for research purposes[42]. The original code contains a range of IP This threat is also known as BASHLITE, qbot, and torlus[48]. Gafgyt addresses that are explicitly not valid during the target IP generation continues to be an active threat in 2020, a recurring theme as the process. The U.S. Department of Defense, United States Postal family was also covered in the BlackBerry 2020 Threat Report. Service, Hewlett-Packard, General Electric, and internal network ranges are specifically mentioned within the codebase[43]. These government entities and corporations have been assigned large ranges of IPv4 space. For example, the whole of 56.0.0.0/8 is assigned to USPS[44].\n\n Mirai is attributed to the widely covered DDoS attack on a top investigative journalist’s blog, Krebs On Security. This attack broke records for DDoS traffic at the time[45]. Mirai was also used for a DDoS attack on Dyn[46]. The malware continues to be an active threat in 2020.\n                                                                                                  1515\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n```\n\n###### TOP LINUX THREATS\n\n IPStorm WellMess FritzFrog\n\n The IPStorm botnet was discovered in 2019. It is written in Golang, WellMess was first publicly referenced in 2018 by JPCert. It has First discovered in January 2020, FritzFrog is written in Golang which uses the InterPlanetary File System (IPFS), a peer-to-peer evolved from initially targeting Windows machines to infecting and has quickly become a notable botnet. FritzFrog targets SSH (p2p) filesharing and networking system for communication. Linux along with other communication protocols. The malware services and attempts to brute force credentials to gain access. Communication may route through many legitimate peers between allows remote code execution and file transfers[56]. Many botnets use common credential combinations around built-in the threat actor and the intended target. This routing makes it accounts such as root, but FritzFrog uses a much larger dictionary\n WellMess is associated with threat group APT29 by multiple\n difficult to differentiate malicious traffic as it is mixed with benign to cast a wider net.\n sources, including the United Kingdom’s National Cyber Security\n traffic throughout the IPFS network[52].\n Centre, Canada’s Communications Security Establishment, and FritzFrog is unique in the sense that it does not rely on commonly\n This threat originally targeted Windows systems but has branched the United States’ National Security Agency. Also known as used communication protocols, instead using a custom p2p into supporting multiple architectures on Linux, including Android. WellMail, this campaign targets organizations connected with the implementation. Operations are also done completely in-memory, Infection occurs by either brute forcing SSH credentials or, in the research and development of COVID-19 treatments. WellMess is avoiding the use of the filesystem. In some cases, FritzFrog is also case of Android, looking for exposed debug functionality[53]. written in Golang and utilizes multiple avenues of attack, including associated with Monero cryptominers[58].\n publicly known CVEs against software such as Citrix, Pulse Secure,\n IPStorm was discovered by Intezer. On Linux, IPStorm issued\n FortiGate, and Zimbra[57].\n numerous requests to the Steam API, a gaming service provided by Valve, querying possible stolen accounts on the service[54]. Intezer also discovered evidence of devices infected with IPStorm being used to create fraudulent advertisement views[55].\n```\n                                                                                                  16\n\n```\n\n###### FritzFrog\n\n WellMess was first publicly referenced in 2018 by JPCert. It has First discovered in January 2020, FritzFrog is written in Golang evolved from initially targeting Windows machines to infecting and has quickly become a notable botnet. FritzFrog targets SSH Linux along with other communication protocols. The malware services and attempts to brute force credentials to gain access.\n\n[56]. Many botnets use common credential combinations around built-in\n\n###### accounts such as root, but FritzFrog uses a much larger dictionary\n WellMess is associated with threat group APT29 by multiple\n to cast a wider net.\n sources, including the United Kingdom’s National Cyber Security Centre, Canada’s Communications Security Establishment, and FritzFrog is unique in the sense that it does not rely on commonly the United States’ National Security Agency. Also known as used communication protocols, instead using a custom p2p WellMail, this campaign targets organizations connected with the implementation. Operations are also done completely in-memory, research and development of COVID-19 treatments. WellMess is avoiding the use of the filesystem. In some cases, FritzFrog is also written in Golang and utilizes multiple avenues of attack, including associated with Monero cryptominers[58]. publicly known CVEs against software such as Citrix, Pulse Secure,\n\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n BazarLoader\n\n BazarLoader, otherwise known as KEGTAP, is a recently uncovered malware loader. It has been described by researchers as having close ties to the infamous Trickbot malware variant. The two threats share various similarities in codebase and infrastructure. First seen in April 2020, BazarLoader’s name is derived from its use of EmerDNS blockchain domains for C2 communications, specifically the use of .bazar domains. \n\n BazarLoader typically uses spam and phishing emails as an infection vector. Once downloaded to a machine, the malware attempts to connect to a C2 .bazar domain. Upon a successful check-in, the malware uses process injection techniques to attempt to run undetected in the address space of legitimate Windows processes.\n\n As its name suggests, BazarLoader proceeds to sleep for a short time before attempting to download a malware payload from the attacker’s C2. Cobalt Strike has been seen deployed in the wild within a BazarLoader attack chain; however, the payload may be anything of the attackers choosing. BazarLoader also uses heavy code obfuscation, stealthy installation, and a sophisticated C2 infrastructure, making it a severe threat to any company or user.\n\n```\n\n###### Astaroth\n\n First spotted in the wild in 2017, Astaroth is an information-stealing malware variant that targeted Brazilian users. From its initial inception to the present day, it has evolved in sophistication and capabilities across numerous campaigns. Astaroth now targets users both in North America and Europe, and deploys measures to avoid detection from victims and security vendors alike. \n\n Utilizing spam emails as its primary infection vector, Astaroth has refined its execution chain to employ a sophisticated multi-stage process that includes:\n\n 0 Making use of malicious iframes\n 0 Highly obfuscated JScript staged downloaders\n 0 .lnk files to retrieve the malware payload once an unwitting user clicks an embedded link in the spam email  \n\n\n###### Later versions of Astaroth incorporated Alternate Data Stream (ADS) functionality and the abuse of different living-off-the-land binaries (LOLBins) such as “extexport.exe”. It also included Facebook and YouTube within its attack life cycle, abusing these sites to send and store C2 configuration data as posts on user profiles. These new capabilities demonstrate that Astaroth is a continuously evolving and sophisticated threat. Information targeted by Astaroth includes financial data, sensitive browser data (passwords/credentials), SSH, and email credentials. Upon retrieval, the information is typically encrypted, then exfiltrated via an HTTPS POST to the attacker’s C2 server.\n\n Astaroth remains a sophisticated and prevalent threat by making use of heavy obfuscation, stealth, and living-off-the-land techniques. Astaroth’s ability to steal a wide array of sensitive information and maintain a sophisticated C2 infrastructure makes it dangerous to companies and users today.\n\n\n###### Astaroth’s ability to steal a wide array of sensitive information and\n time before attempting to download a malware payload from the clicks an embedded link in the spam email  \n maintain a sophisticated C2 infrastructure makes it dangerous to\n attacker’s C2. Cobalt Strike has been seen deployed in the wild\n companies and users today.\n within a BazarLoader attack chain; however, the payload may be Upon infection, the malware uses various fileless techniques, injects anything of the attackers choosing. BazarLoader also uses heavy into numerous legitimate Windows processes, and adopts the use code obfuscation, stealthy installation, and a sophisticated C2 of living-off-the-land tactics. The malware uses or abuses legitimate infrastructure, making it a severe threat to any company or user. utilities that are already installed on a system such as “bitsadmin.\n exe”. This hijacking of legitimate resources is an attempt to avoid suspicion and remain undetected on a victim host. \n```\n                                                                                                  1717\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n Bladabindi\n\n First identified in 2012, Bladabindi, also known as njRAT, has gained popularity due to several tutorial videos available on YouTube and the builders being available on GitHub. This remote access trojan malware is especially popular among Middle Eastern threat actors.\n\n The initial creators of Bladabindi are an underground attack group called Sparclyheason. Bladabindi can activate web cameras, log keystrokes, capture screenshots, steal passwords, execute remote commands, and more. The malware is written in .NET and consists of two main classes – kl and OK. The kl class is used for keylogging while the OK class has other Bladabindi RAT functionalities. The OK class also contains a hardcoded 32-character long string value consisting of lowercase letters and numbers, unique per sample. \n\n```\n\n###### This string value is used when malware installs itself at autostart for persistence under\n```\n ‘HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ab1c039a01d925ae481774f412396f5e’\n\n and\n\n```\n```\n‘HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\n\\Run\\ab1c039a01d925ae481774f412396f5e’\n\n```\n\n###### with the value of path of stored malware under\n\n```\n%TEMP%, %APPDATA%, %USERPROFILE%,%ALLUSERSPROFILE%.\n\n```\n```\n                                                                                                  1818\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n Cerber\n\n The first variants of Cerber ransomware appeared in March 2016. The malware uses an RaaS model and is offered in Russian underground forums. Implementing Cerber via the RaaS model increases the number and reach of attacks. Cerber affiliates are responsible for finding and infecting victims while the developers take a commission of up to 40% of any ransom amounts collected.\n\n During execution, Cerber will first check the country of the infected endpoint. If it finds this to be located in any of the following nations, it will terminate its execution and not encrypt the system:\n\n```\n\n###### Often, malware developers will avoid attacking endpoints within their own geographical region. This assists in limiting their exposure and avoids drawing the attention of local authorities. If the infected host passes the location check, Cerber creates a copy of itself in the victim’s %APPDATA% folder under a random name chosen from the System32 directory. The malware scans all drives and begins its encryption process silently in the background using AES-256 and RSA encryption. \n\n Cerber ensures no system backups are available and prevents the execution of antivirus applications and Windows security features. Files required for regular operations are encrypted, making the system unusable to the user. Early variants of the malware appended the file extension “.cerber” to encrypted files, although over time, other extensions have also been used. \n\n\n###### 0 Armenia\n 0 Azerbaijan\n 0 Belarus\n\n\n###### 0 Moldova\n 0 Russia\n 0 Turkmenistan\n\n\n###### other extensions have also been used. \n 0 Georgia 0 Tajikistan\n When the encryption has successfully completed, a ransom message\n 0 Kyrgyzstan 0 Ukraine is displayed. The ransom is requested in bitcoin and, as an added\n incentive to pay, a time limit may be provided before the amount\n 0 Kazakhstan 0 Uzbekistan\n increases. Victims choosing to pay the ransom to retrieve their data have no guarantee the affiliate distributing Cerber will provide a decryption tool.\n```\n                                                                                                  1919\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n Emotet\n\n Emotet is an advanced, modular banking trojan that primarily functions as a downloader or dropper of other banking trojans. It is a polymorphic threat, able to evade typical signature-based detection. It has several methods for maintaining persistence, including auto-start registry keys and services. It uses modular dynamic-link libraries (DLLs) to continuously evolve and update its capabilities.\n\n Emotet is also virtual-machine-aware and can generate false indicators if run in a virtual environment. It is disseminated through malspam that uses branding familiar to the recipient. It has even been spread using the MS-ISAC name. The 2020 Emotet campaign distributed malspam in large quantities. Like many other threat actors, Emotet distributors took advantage of the COVID-19 global pandemic, which affected millions worldwide. The latest Emotet campaign sent a high volume of emails with subject lines like “COVID test results”, which contained a malicious link or PDF.\n\n```\n\n###### Kwampirs\n\n Kwampirs is a remote access trojan that targets supply chain software providers of critical industries. The malware made a resurgence in 2020 alongside the outbreak of COVID-19, which has left many industries, healthcare in particular, facing tough times. Attack groups deploying Kwampirs have been taking advantage of the vulnerabilities these industries are facing by attacking their supply chains. The attacks are having such a devastating effect that the FBI released multiple alerts to warn potentially impacted industries and services.\n\n The Kwampirs RAT is a fully featured backdoor that uses a two-phase approach. The initial phase establishes a wide and persistent presence on the target network. In this initial phase, the trojan uses hidden admin shares to propagate via SMB port 445. The malware is modular and can download additional modules on the target. This occurs in the second phase where all C2 network traffic is carried out. Kwampirs uses HTTP GET requests on port 80 and includes the encrypted date in the Uniform Resource Identifier (URI).\n\n\n###### Ryuk\n\n Since first appearing in August 2018, Ryuk has specifically targeted enterprise environments, similar to other ransomware families such as Samas and BitPaymer. Upon its release, researchers from Checkpoint conducted a code comparison between the initial versions of Ryuk and the Hermes ransomware variant. They discovered that the two threats were highly similar in nature. Researchers therefore concluded that Ryuk was, in fact, a derivative of the Hermes source code that has been steadily developed since its inception.\n\n Hermes has always been considered commodity malware, meaning that it has been used by various threat actors and observed for sale on numerous underground forums. Ryuk, on the other hand, has been attributed to a Russian-based threat actor dubbed WIZARD SPIDER. Also, unlike Hermes, Ryuk has traditionally been used to target larger enterprise environments and organizations in attempts to obtain a high-ransom return.\n\n\n###### pandemic, which affected millions worldwide. The latest Emotet is modular and can download additional modules on the target. This SPIDER. Also, unlike Hermes, Ryuk has traditionally been used to campaign sent a high volume of emails with subject lines like occurs in the second phase where all C2 network traffic is carried target larger enterprise environments and organizations in attempts “COVID test results”, which contained a malicious link or PDF. out. Kwampirs uses HTTP GET requests on port 80 and includes to obtain a high-ransom return.\n the encrypted date in the Uniform Resource Identifier (URI).\n Initial infection occurs when a user opens or clicks the malicious One example occurred in June 2019, when the State of Florida paid download link, PDF, or macro-enabled Microsoft Word document. over $1,000,000 to bring the city’s systems back online. Affected Once downloaded, Emotet establishes persistence and attempts to entities included police, SCADA, and water-related systems. propagate through the local networks using incorporated spreader WIZARD SPIDER is also believed to be behind the Trickbot variant modules. Further details about recent advancements in Emotet of banking malware. This may explain why Ryuk has recently appear later in this report. been seen being deployed in a triple-threat scenario along\n with Trickbot and Emotet.\n```\n                                                                                                  2020\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n Smoke Loader\n\n Smoke Loader, also known as Dofil, Sharik, and Smoke, was first discovered in 2011. It was advertised in forums as:\n\n 0 A modular loader that could deliver up to 10 different executables\n\n 0 Small in size\n 0 Containing a password-grabbing module for email clients, FTP clients, browsers, IM clients, poker applications, and more\n\n 0 Having functionality that can be expanded via plugins \n\n Over the years, Smoke Loader has evolved many capabilities. It added a process injection method (mostly against explorer.exe) and the ability to drop other malware via weaponized documents. Later versions of this malware include anti-analysis and anti-debug checks to protect itself and detect any antivirus vendor presence.\n\n```\n\n###### Trickbot\n\n Trickbot is an advanced modular banking trojan that was first reported in 2016. It was originally designed to steal sensitive user content, including banking credentials and other personal data. The creators have since expanded its capabilities by adding new modules to evade detection efforts and enhance functionality. Some of the modules added facilitate VNC-base remote access, lateral movement, and the installation of a UEFI/BIOS firmware implant for persistence (as reported by AdvIntel and Eclypsium). The sophisticated firmware implant means Trickbot can survive even after reformatting the hard drive. Trickbot also developed into a platform-as-a-service, allowing it to deliver additional malware such as Ryuk and Conti Ransomware.\n\n\n###### Trickbot is often distributed by Emotet spam trojan as a second- stage payload. It is also delivered via spam campaigns that capitalize on enticing subjects related to unpaid invoices, purchase orders, or other financial transactions. In 2020, Trickbot operators added COVID-19-related terms into their phishing and malspam lures. Like many other threat actors, Trickbot distributors took advantage of the COVID-19 global pandemic affecting millions worldwide. According to Microsoft’s ATP data, Trickbot is the most prolific malware operation using COVID-19-themed lures. \n\n Despite recent efforts by Microsoft and the FBI to disrupt Trickbot servers, this malware family still poses a serious threat. The threat actors behind this malware continued their operations, adding features and pushing new updates to make it more resilient against future takedowns.\n\n\n###### future takedowns.\n Later versions of this malware include anti-analysis and anti-debug checks to protect itself and detect any antivirus vendor presence.\n```\n                                                                                                  2121\n\n```\n\n-----\n\n```\nOS CYBER THREATS\n\n###### TOP WINDOWS THREATS\n\n Wacatac\n\n Wacatac is a generic detection category for malware trojans that:\n\n 0 Can be distributed through malicious emails as part of phishing campaigns\n\n 0 Are dropped to a system by other malware\n 0 Are unknowingly downloaded by users when browsing compromised websites\n\n 0 Are launched under the mistaken belief it is a software patch or crack \n\n Once on the system, the trojan can execute malicious activities. Examples include gathering personal and banking details, downloading additional malware payloads, providing remote access to the system, or adding the endpoint to a botnet. \n\n```\n\n###### The trojan usually copies itself into the user’s startup folder or creates a registry key for persistent execution at every system boot. Also, it will often drop files to the %APPDATA% directory and may attempt to determine the victim system’s IP address by connecting to myIPaddress.com. \n\n Wacatac detection is sometimes associated with the ransomware DeathRansom because of the registry key created by this family:\n\n```\nHKEY_CURRENT_USER\\SOFTWARE\\Wacatac \n\n```\n\n###### Being a generic trojan detection, Wacatac is not associated with any specific threat group and has a broad range of non-specific trojan aliases.\n\n\n###### trojan aliases.\n to the system, or adding the endpoint to a botnet. \n```\n                                                                                                  22\n\n```\n\n-----\n\n#### CYBERSECURITY  INSIGHTS\n```\n                                                                                                  23\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### SECURING THE ELECTORAL PROCESS\n\n On October 19, 2020, the U.S. charged six Russian military intelligence officers with conducting a series of high-profile cyber attacks[59]. The alleged crimes were outlined in a 50-page indictment[60], and included:\n\n 0 Attacks on Ukraine’s power grid\n\n 0 Compromising systems for the 2018 Winter Olympic Games\n\n 0 Global NotPetya attacks\n\n 0 Interference (hack-and-leak efforts) in the 2017 French elections\n\n Likewise, Robert O’Brien, national security adviser, accused China of meddling during the run-up to the 2020 U.S. presidential election[61]. While electoral skullduggery between nation states is nothing new, minimizing foreign interference is a critical aspect of maintaining free and fair elections.\n\n```\n```\n                                              24\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### SECURING THE ELECTORAL PROCESS\n\n Beyond the Ballot\n\n```\n\n###### used DMARC in 2020[64]. At the beginning of 2020, a full 95% of the largest voting counties in the U.S. were vulnerable to phishing attacks and forged emails.\n\n What Can Be Done?\n\n Election security can be improved by modifying personal behaviors, and wisely implementing effective technical countermeasures. Users can improve election security by limiting the information they share on social media and interacting with others only through known and trusted channels. For example, communicating with a government organization through their official website is more secure than responding to random emails allegedly coming from them. Users can also practice good security hygiene with work and personal devices while limiting the amount of technology with access to sensitive information.\n\n\n###### Often, electronic voting systems are the focus of electoral security, but elections can be attacked through a number of different means. Consider the sheer number of smartphones, tablets, laptops, desktops, and other connected technology used by a political candidate and campaigns. Each application, device, and network used by this group offers threat actors a potential attack surface.\n\n Likewise, like the general electorate, many policymakers and their staff are active on social media. Adversaries can collect considerable information from users’ posts to help them tailor an effective attack strategy. General information people volunteer about themselves online may not seem potentially harmful, but it can be in the hands of trained threat actors.\n\n For example, people post information on how busy, tired, or overwhelmed they feel. Threat actors can use this information to time their attack, knowing fatigued people are more prone to make mistakes. Users discuss issues, topics, and events that interest them. Adversaries can use this information to send targeted emails aligning with these interests to increase the likelihood users will interact with them. The amount of actionable information threat actors can access on social media pages is considerable, and includes[62]:\n\n 0 Video blogs revealing building layouts, equipment, team processes, secure areas, and whiteboard plans\n\n 0 Team pictures revealing the hierarchy, membership, and interests of people within an organization, and often, their location\n\n\n###### 0 Common complaints, concerns, or disputes in an organization that can later be used as a lure in a phishing email\n\n Policymakers and their teams are vulnerable targets for having their social media accounts mined for exploitable information. While not as dramatic as blatantly switching votes in an election, compromised political parties and operatives can represent a real danger to election security.\n\n Email is another weak point for election security. The Domain- based Message Authentication, Reporting, and Conformance (DMARC)[63] standard is used to verify that an email came from a specific sender. Email verification is an important tool for fighting election-year misinformation, yet only 15% of campaigns and PACS\n\n\n###### Artificial intelligence (AI) can play a strong role in verifying user identities. Behavioral analysis, facial recognition, location analysis, and biometric monitoring all offer AI actionable data sets for validating user identity. AI can perform simple, less intrusive functions to prevent voter fraud like authenticating signatures[65]. It\n```\n15% 95%\n of campaigns and of the largest voting can also play a role protecting elections from foreign interference PACS used DMARC counties in the U.S. on the Internet, when used by organizations to identify and restrict in 2020 were vulnerable to disinformation campaigns[66].\n              attacks\n                                                          2525\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### BAHAMUT\n\n BAHAMUT is an active threat group investigated extensively by BlackBerry threat researchers in 2020[67]. The threat group traffics in fake news sites, personas, and social media accounts. They also had dozens of malicious apps hosted on the App Store™ and Google Play™ store. BAHAMUT is known to researchers worldwide under many names, including HDEVEL, WINDSHIFT, URPAGE, and THE WHITE COMPANY.\n\n During their investigation, BlackBerry researchers observed BAHAMUT operations against government officials and industry leaders in India, the Emirates, and Saudi Arabia. Advocates for Sikh separatism and organizations supporting human rights causes in the Middle East also suffered attacks from BAHAMUT. The threat group has demonstrated zero-day threat capabilities, indicating it has access to at least one zero-day developer. One particular zero-day exploit targeted InPage, a word processor popular in Urdu, Arabic, Persian-speaking countries, and the major newspapers in Pakistan and India.\n\n BAHAMUT works hard to cover its tracks, ensuring its activities remain difficult to detect or attribute. It uses tools created by other threat groups (or publicly available alternatives) and keeps its campaigns, network infrastructure, and phishing tools separated. BAHAMUT may obscure its activity by imitating the same TTPs popularized by other threat groups. Backdoors and exploit shellcode written by BAHAMUT often includes anti-analysis features. When its activities are detected, the threat group quickly changes tactics and corrects any missteps leading to its exposure.\n\n```\n```\n                             26\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### BAHAMUT\n\n Former Targets of BAHAMUT\n\n The early targets of BAHAMUT were chronicled by Collin Anderson and Claudio Guarnieri on the investigative journalism site Bellingcat in June 2017. Their research indicates the threat group initially targeted individuals associated with the political, economic, and social sectors in the Middle East. These early targets included:\n\n 0 Iranian women’s rights activists\n 0 Turkish government officials\n 0 Saudi Aramco\n 0 A Europe-based human rights organization\n 0 People connected to Qatar’s domestic and international politics\n 0 Egypt-focused media and foreign press, including individuals previously imprisoned in the country\n\n 0 Multiple Middle Eastern human rights NGOs and local activists\n 0 The Union of Arab Banks\n 0 The Prime Minister’s Court of Bahrain\n\n Other threat researchers, calling BAHAMUT by different names, observed the group selecting targets in South Asia, particularly in India and Pakistan. Some researchers report witnessing BAHAMUT activity in China and northern and eastern Europe as well. These cases show the threat group’s tendency to target individuals rather than organizations. The Bellingcat documents suggest that BAHAMUT may act as a hacker-for-hire operation, given the vast diversity of specific targets.\n\n```\n\n###### BAHAMUT’s targeting is all over the map, which makes it difficult to concoct a single victimology. BAHAMUT appears to be not only well- funded and well-resourced, but also well-versed in security research and the cognitive biases analysts often possess.\n```\n                                                        27\n\n```\n\n###### Current Targets of BAHAMUT\n\n BlackBerry research shows that South Asia and the Persian Gulf are the two regions most at-risk from current BAHAMUT activity. The group’s phishing infrastructure remains focused on credential harvesting from popular sites like Google™, Microsoft[®], Yahoo![®], and Telegram. Chinese sites Sina, QQ, 126, and 163 have also attracted BAHAMUT’s attention. BAHAMUT seems to largely avoid targets in the United States.\n\n BAHAMUT recently targeted seven ministries and agencies of Saudi Arabia that were connected with monetary and financial policy. Government agencies dealing with foreign policy and defense were also targeted in the Emirates, Qatar, Bahrain, and Kuwait. The threat group’s mobile phone strategy, consisting of fake app creation, targets a general audience in the Middle East. However, the fake mobile apps created for South Asians are more political and target groups like Sikhs for Justice, and Islamist groups in the Kashmir region, like Jamaat-ul-Islami and Jaish-e-Mohammad.\n\n\n###### BAHAMUT Synopsis\n\n BAHAMUT is a well-funded, technically adept, highly secretive, and effective threat group. The group’s obfuscation capabilities and mimicry of other’s techniques has made it difficult to identify and track. BlackBerry researchers, through exhaustive investigation, have concluded that this group is also known by the following names:\n\n 0 “InPage” threat actor described by Kaspersky\n 0 The group described in Cisco Talos’ MDM blog posts\n 0 WINDSHIFT5 as described by Darkmatter\n 0 URPAGE6 as described by Trend Micro\n 0 THE WHITE COMPANY as described by Cylance\n\n For a deep dive into the tactics, targets, and activities of this threat group, read BAHAMUT: Hack-for-Hire Masters of Phishing, Fake News, and Fake Apps .\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### EMOTET: THE EVOLVING THREAT\n\n Emotet is an evolving threat that has been terrorizing systems since 2014[68]. The earliest versions of Emotet functioned as a banking trojan, performing man-in- the-browser attacks to steal credentials[69]. These early versions focused on targets in Germany and Austria and featured malicious attachments created to look like invoices or other financial documents[70]. Following its appearance and a few months of malicious activity, Emotet attacks declined until an updated variant emerged in 2015[71]. Emotet is designed to avoid attacking Russian-speaking countries[72], which leads many researchers to believe it originates from Russia.\n\n#### …among the most costly and destructive malware affecting SLTT governments.\n\n###### US-CERT\n\n```\n```\n                                             28\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### EMOTET: THE EVOLVING THREAT\n\n Regular Updates\n\n Emotet has received numerous updates over the years from a highly capable team of threat actors. These changes include the ability to detect virtual machines, transfer funds directly to attackers, deploy anti-analysis techniques, and incorporate a Windows API component[73]. In 2017, Emotet transitioned to a more open and modular threat[74] and the main banking-based module was removed. By 2018, the United States Computer Emergency Readiness Team (US-CERT) recognized Emotet as “…among the most costly and destructive malware affecting SLTT (state, local, tribal, and territorial) governments”[75].\n\n```\n\n###### Emotet in 2020\n\n The threat actors behind Emotet have taken periodic breaks from activity since the threat first emerged in 2014. In 2020, Emotet entered a period of inactivity ranging from February 7th to July 17th[79] before resuming in September. The 2020 version of Emotet arrived with two notable new capabilities and one unexpected flaw.\n\n The first noteworthy Emotet update allows the malware to perform Wi-Fi brute force attacks and device infection[80]. Previously, Emotet spread through two attack vectors, malspam and infected networks. With the Wi-Fi brute force upgrade, Emotet can propagate through insecure wireless networks and connected devices. While this new capability was not discovered until January 2020, the timestamp on the Wi-Fi spreading binary is set to April 16, 2018.\n\n\n###### Emotet infection has a unique file hash ID. This effectively counters blacklisting, as no two infections will be identical, and previously discovered Emotet loaders can easily be updated with new IDs.\n\n The 2020 Emotet update also contained some good news for threat researchers, a design flaw that functioned as a kill-switch for the malware. The same mechanism used by Emotet to implement hash-busting was repurposed by threat researchers to stop the malware from running. Researchers, using the random file name generation function of Emotet could reset the malware’s filename to “.exe”, causing it to malfunction[81]. This tactic protected systems from Emotet infections from February 6, 2020 until August 6, 2020, when a new malware patch was released.\n\n\n###### was removed. By 2018, the United States Computer Emergency\n Wi-Fi brute force attacks and device infection[80]. Previously, Emotet hash-busting was repurposed by threat researchers to stop the\n Readiness Team (US-CERT) recognized Emotet as “…among the\n spread through two attack vectors, malspam and infected networks. malware from running. Researchers, using the random file name\n most costly and destructive malware affecting SLTT (state, local,\n With the Wi-Fi brute force upgrade, Emotet can propagate through generation function of Emotet could reset the malware’s filename\n tribal, and territorial) governments”[75].\n insecure wireless networks and connected devices. While this new to “.exe”, causing it to malfunction[81]. This tactic protected systems\n Major updates had occurred to Emotet by 2019, making it an capability was not discovered until January 2020, the timestamp from Emotet infections from February 6, 2020 until August 6, 2020, advanced attack platform capable of delivering other threats like on the Wi-Fi spreading binary is set to April 16, 2018. when a new malware patch was released. Trickbot and Ryuk[76]. This multi-year transformation from banking\n The second Emotet upgrade implements a tactic called hash-\n trojan to global botnet allowed the threat actors behind Emotet to\n busting that acts as a countermeasure to malware identification\n monetize it as malware-as-a-service[77]. Emotet became the primary\n and blacklisting. In the past, the Emotet loader could be identified by\n distributor of botnet delivered payloads, accounting for 61% of total\n its unique file hash and preemptively shut down. Using hash-busting,\n malicious payloads by March 2019[78].\n in this case by adding 64 bytes of random data to the loader, each\n```\n                                                                                                  2929\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CONNECTED VEHICLES\n\n Connected vehicles, which can contain over 100 independently developed components, are difficult to secure due to the multiple vendors involved in their assembly[82]. The sheer number of international entities participating in the automotive supply chain make enforcing common cybersecurity criterion extremely challenging.\n\n Modern vehicles rely on multiple on-board computers to perform everything from critical system functions to navigation and entertainment. These advancements force car manufacturers to become experts in integrating and developing software[83]. Vehicles are increasingly connecting to the Internet as well, with an estimated 280 million on-road automobiles currently Internet- connected[84]. These factors set the stage for a crisis, automobiles becoming increasingly interconnected while auto manufacturers scramble to find ways to secure vehicle systems[85].\n\n Until effective cybersecurity protocols and procedures are incorporated into the design and manufacture of vehicles, modern automobiles are effectively insecure networks.\n\n```\n```\n                                             30\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CONNECTED VEHICLES\n\n Common Connected Vehicle Vulnerabilities\n\n Connected vehicles are susceptible to cyber attacks ranging from simple data theft to highly advanced system hijacking. Some common vulnerabilities and attack vectors include:\n\n 0 Hijacking electronic control units (ECU) to disrupt braking, steering, and engine operation[86]\n\n 0 Vehicle compromise through a paired smartphone[87]\n 0 Vehicle-to-Everything (V2X) and Vehicle-to-Vehicle (V2V) communication vulnerabilities[88]\n\n 0 Unintentional data exposure from previously paired devices[89]\n 0 Over-exposure of personal data (shared with OEMs, rental companies, car manufacturer, etc.)[90]\n\n 0 Vehicle vulnerability related to previous owners/renters[91]\n 0 Reliance on network connectivity for functionality[92]\n\n Securing vehicles from cyber threats becomes increasingly difficult with every additional network connection, electronic component, and software-driven system. Until effective cybersecurity protocols and procedures are incorporated into the design and manufacture of vehicles, modern automobiles are effectively insecure networks.\n\n```\n\n###### The United Nations Gets Involved\n\n The United Nations Economic Commission for Europe (UNECE) approved vehicle cybersecurity regulation WP.29 on June 25, 2020[93]. This regulation outlines cybersecurity processes and measures that automobile manufacturers must meet to achieve vehicle type approval from UNECE. The UNECE standards apply to “contracting parties”, which includes many E.U. countries, China, Japan, and Korea[94]. The new standards require automakers to[95]:\n\n 0 Make efforts to manage vehicle cyber risks\n\n 0 Detect and respond to cybersecurity events across vehicle fleets\n 0 Design systems to be secure throughout the supply and value chains\n\n 0 Provide secure software updates to on-board systems for the lifetime of the vehicle\n\n\n###### Vehicles that do not comply with these guidelines will not be approved for sale by UNECE.\n\n The WP.29 regulations do not instruct automakers on how to implement cybersecurity into their processes. This means auto makers and OEM manufacturers will have to work together to find ways to comply with the regulation. Major industry players are working closely with the standards organization to develop cybersecurity standards, ISO 21434, which takes WP.29 regulations to an implementation level. While it is encouraging to see the auto industry embracing cybersecurity, the requirement for WP.29- compliant vehicles will not be enforced until July 2024[96]. This delay leaves threat actors years to operate in the largely unregulated and insecure space of connected vehicles.\n```\n                           31\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### MOBILE OVERLAY ATTACK LIFECYCLE\n\n Social engineering continues to be a highly effective means for stealing payment and access information. Presented within the context of an installed application, a prompt for credit card or passwords using a well-designed form often yields success for attackers. This trick works especially well when timed to coincide with application launch.\n\n The theory is simple: present a credential or payment request at a time when the user is interacting with a target application. The prompt doesn’t seem out of place or unexpected. The user dutifully enters the information because they believe it’s necessary for the application to function correctly. Re-entering payment details into your favorite ride-sharing app, as it loads, when you’re late for a meeting clearly plays to the attackers’ advantage.\n\n```\n```\n                                              32\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### MOBILE OVERLAY ATTACK LIFECYCLE\n\n```\n\n###### Google has announced forthcoming changes to the AS in Android 10 (“Q”), specifically deprecating the overlay feature. In addition, permissions for the AS will be automatically revoked after 30 seconds. While these changes are welcome, it’s unlikely to have any impact on existing handsets that manufacturers have forgotten. Refusing to back-port security fixes entices users into upgrading.\n\n The most effective means of defending against overlay attacks is to:\n\n 0 Prevent installation of apps from sources other than the Google Play store\n\n 0 Limit installation of apps that are not deemed essential\n 0 Upgrade to the latest Android version\n 0 Educate users on the methods employed by attackers targeting Android to steal valuable information\n\n##### 3\n\n###### Prompt user to enter credit card or password through false app overlay\n```\n                           33\n\n```\n\n###### Monitoring the foreground window against a list of targets is made possible through different methods. The most common and battery- friendly is via functions provided by the Accessibility Service (AS). The AS is a native function of Android designed to assist users with visual, hearing, and other related disabilities. A related method for timing an overlay attack leverages the foreground time or last used counters provided by the Android UsageStats service. While less battery-friendly, owing to the need to poll, this alternative approach still gives sufficient resolution to pop-up a request to an unsuspecting user. The Mysterybot information stealer employed this technique in 2018.\n\n A prerequisite to using features of the AS is the BIND_\n```\nACCESSIBILITY_SERVICE permission, which, in addition to\n a long list of other malware-helpful features, allows an application to listen for changes in the foreground activity. When a foreground transition occurs, the malware is notified, and the package name of the new activity is queried against an internal list. If a match is found, the malicious overlay is shown to the user.\n\n##### 1\n\n###### Hijack Accessibility Service (AS) and leverage usage stats to figure out an optimal attack time\n\n```\n\n###### The accessibility service can permit an application to interact with activity controls (clicking buttons, entering text into fields, etc.). If a malicious application requires additional permissions, it can submit a request to the OS and then automatically click the OK button on-screen. This process occurs without any user involvement.\n\n Information gathering overlays are composed of web content: a mix of HTML and/or JavaScript, rendered in a top-most WebClient window in front of the target application. The Android WebView class provides the necessary functions: “A WebView is useful when you need increased control over the UI and advanced configuration options that will allow you to embed web pages in a specially- designed environment for your app.”\n\n In-the-wild families that have, or continue to use overlay attacks, center most heavily around banking and information stealing malware: Anubis, Ginp, Cerberus, EventBot, and Marcher. Bank authentication details or payment card information for several apps specific to different countries is featured prominently amongst the activities of the Android malware community.\n\n##### 2\n\n###### Take advantage of user distraction and hurried behavior.\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### THE YEAR IN RANSOMWARE\n\n BlackBerry research has identified several notable ransomware threat trends in 2020, including:\n\n```\n\n###### Ryuk collaboration with Trickbot and Emotet. This triple threat executes with Emotet dropping Trickbot on the host system to steal data. Trickbot then downloads Ryuk to perform ransomware operations.\n\n Zeppelin collaboration with Azorult. Zeppelin ransomware can encrypt a system and install Azorult spyware to steal credentials, files, and other data.\n```\n                           34\n\n```\n\n###### A distinct shift from widespread, indiscriminate distribution to highly targeted campaigns often deployed via compromised managed security service providers (MSSPs)[97].\n\n RaaS shifting to a more private model, where access to vetted affiliates is granted in exchange for sensitive information or for an agreed cut from the proceedings. Access could include an established foothold to compromised MSSPs, corporate networks, and/or government networks.\n\n\n###### Increased collaboration and information sharing between ransomware threat actors and other threat groups, like those behind Emotet, Trickbot, and Azorult.\n\n Exfiltration of data prior to, or during, the ransomware encryption process. This enables attackers to blackmail victims with the threat of exposing their sensitive data on public forums should they fail to pay the ransom in a timely manner. Additionally, General Data Protection Regulation (GDPR) in Europe requires companies to report any data breach. This can pressure companies to decide between paying a hefty regulatory fee or the ransom.\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### THE YEAR IN SPEAR PHISHING AND CREDENTIAL THEFT\n\n BlackBerry research has identified several notable spear phishing and credential theft threat trends in 2020, including:\n\n```\n\n###### 0 The pandemic dramatically changed corporate working culture. Users shifted to working from home. Businesses had to scale up services to support operations and collaborations across the enterprise.\n\n 0 Remote working presented an opportunity for cyber criminals to exploit the new workplace reality with phishing attacks. Data from the Anti-Phishing Working Group showed that the number of phishing campaigns has grown since March 2020[98]. The average wire transfer amount requested during a\n\n\n###### business email compromise attack is estimated to be $48,000 in Q3 2020.\n\n 0 Software-as-a-service (SaaS) application and Webmail remained the most targeted services for phishing attacks, dominating others throughout the year. Financial and payment sectors ranked in the second and third positions[99].\n\n 0 A particularly interesting technique that drew BlackBerry researchers’ attention was the use of trojanized applications to steal 0auth access tokens. Dubbed consent phishing,\n\n\n###### and discovered in the wild in December 2019[100], these campaigns provide an attacker a means to bypass multifactor authentication (MFA). Threat actors first trick users into providing permissions to a malicious application. The application then accesses the user’s cloud data without using their username and password[101 102 103]. This technique allows attackers to bypass traditional credential phishing defences and malware signatures.\n\n\n###### Figure 1 illustrates a typical consent phishing attack lifecycle using the Lockheed Martin cyber kill-chain:\n\n 1 RECONNAISSANCE_ 3 DELIVERY_ 5 INSTALLATION_ 7\n\n```\nACTIONS_ON\nOBJECTIVES_\n\n###### Attacker reads victim’s data. Hands-on keyboard access lets attacker accomplish their original goal.\n          35\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### DEEPFAKE THREAT ACTIVITY\n\n One of the first cases of deepfake weaponization in the workplace was discovered last year. A senior official was tricked into transferring money after he received a call from a fraudster who impersonated the CEO’s voice using deepfakes[104]. This year, COVID-19 forced the corporate world to quickly pivot to providing secure remote connectivity for their workforce. As a result, cyber criminals rushed to weaponize deepfakes within the corporate world. In addition, primitive misinformation techniques like GIFs, photoshops, and face swaps continue to provide a simple and effective way for malicious actors to deceive users.\n\n```\n\n###### Findings this past year showed that a majority of deepfake activities were found within the entertainment industry in the form of non-consensual adult media[105]. Researchers also discovered several underground forums selling deepfake services with more actors seeking ways to monetize this technology[106]. Perhaps one of the most publicized weaponizations of this technology was centered around supporting disinformation campaigns. In April 2020, a deepfake video of the Belgian Prime Minister linking the cause of the pandemic to environmental damage was released[107].\n\n\n###### In August 2020, Facebook removed 1,500 ads and 900 pages related to a site called Peace Data that promoted conspiracy theories to influence U.S. voters. Some editors of this site had deepfake profile pictures[108].\n\n The bulk of attacks this year have largely focused on phishing, ransomware, hacking, etc. As normalcy returns around the world, threat actors may look towards increasing the weaponization of deepfake technology in the workplace, especially around facilitating sextortion campaigns.\n\n```\n                             36\n\n```\n\n-----\n\n###### CYBERSECURITY/DATA PRIVACY  LEGISLATIVE AND REGULATORY FORECAST\n\n UNITED STATES\n\n If Democrat leadership holds true to historical tendencies, the Biden Administration and Democrat- controlled Congress could very well herald a more regulatory-friendly political environment in the U.S. Democrats historically have leaned toward increased federal regulation, and it is likely that the Biden Administration may do the same on cybersecurity and data privacy matters, especially in light of SolarWinds. It also is anticipated that the Biden Administration may support certain laws and regulations designed to bolster cybersecurity in the U.S. that were enacted under President Trump’s leadership.\n\n Cybersecurity\n\n\n###### Congress and the Biden Administration are almost certain to introduce legislation and regulations to respond to the massive December 2020 SolarWinds attack. This attack included the networks of numerous federal agencies[109]. We expect the introduction of federal bills and proposed rules designed to strengthen security and prevent a similar breach. New laws and regulations designed to better secure artificial intelligence (i.e., AI in vehicles), IoT devices, broadband, and infrastructure are also feasible.\n\n\n###### Several newly enacted cyber provisions recommended by the U.S. Cyberspace Solarium Commission take effect in 2021, including:\n\n 0 A National Cyber Director in the White House who will provide centralized leadership on currently disparate federal cyber- related mandates and policies. This person could also lead development of a National Cybersecurity Strategy.\n\n 0 The Cybersecurity and Infrastructure Security Agency (CISA) will perform threat hunting identification on federal networks.\n\n 0 An effort to bolster cybersecurity threat and information sharing and explore/study how best to secure connected cities in 2021.\n```\n                           37\n\n```\n```\n          CYBERSECURITY INSIGHTS\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CYBERSECURITY/DATA PRIVACY  LEGISLATIVE AND REGULATORY FORECAST\n\n```\n\n###### Data Privacy U.S. Federal\n\n The partisan battle over federal data privacy legislation that picked up steam in 2020 may finally result in a federal law in the 2021- 22 Congress. The most contentious issues Congress needs to resolve include:\n\n 0 Enforcement: Democrats generally favor a private right of action, pursuant to which an individual could bring a suit (either individually, as part of a class action, or via a state attorney general), to hold technology companies accountable on data protection. Republicans prefer enforcement by a federal agency and state attorney general, because companies could go bankrupt fighting non-meritorious claims.\n\n 0 Federal pre-emption: Republicans in Congress have generally supported a federal law that pre-empts state laws; they want to pre-empt state laws such as the California Consumer Privacy Act (CCPA). Their concern is there could be a patchwork of state laws and a new federal law with which companies must comply. Democrats, especially many in California, not surprisingly oppose federal pre-emption of state laws like the CCPA. They argue states should be able to raise the bar on privacy and consumer protection as high as they wish.\n\n 0 The Federal Trade Commission (FTC), which enforces consumer protection, including privacy matters, may be given stronger enforcement and/or rulemaking authority by Congress.\n\n\n###### U.S. State\n\n Several states, including Washington, Maryland, Texas, and North Dakota, may follow California, Nevada, and Maine’s leads and enact data protection laws in 2021. Most state privacy laws — and the bills nearing passage — give consumers greater control over the use of their personal information. The CCPA, for example, gives consumers the right to opt-out of certain data collection and to delete personal information collected, with some exceptions.\n\n```\n                             38\n\n```\n\n-----\n\n###### CYBERSECURITY/DATA PRIVACY  LEGISLATIVE AND REGULATORY FORECAST\n\n CANADA\n\n On June 20, 2019, millions of Canadians with accounts in the Desjardins Credit Union (the largest in Canada) woke up to news that their personal information had been breached. Compromised information included names, addresses, birthdates, social insurance numbers, email address, and information about transaction habits. At the time, the Desjardins Group indicated that the breach affected around 2.7 million people[110] and 173,000 businesses. Fast-forward to December 14, 2020, the Office of the Privacy Commissioner of Canada (OPC) updated the number affected in a detailed report[111].\n\n The breach actually impacted nearly 9.7 million Canadians, a quarter of Canada’s entire population. The OPC report[112] found Desjardins “did not demonstrate the appropriate level of attention required to protect the sensitive personal information entrusted to its care”. The Privacy Commissioner called out Desjardins for failing to put in place adequate security measures to prevent this breach. The data compromise occurred over more than a two-year period before Desjardins even became aware of it.\n\n The increasing scale, scope, and impact of privacy breaches, combined with reliance on digital technologies in today’s data-driven economy, has ushered in a new era for cybersecurity and privacy legislation. Canada is set to modernize its aging privacy protection framework for both private and public sector organizations in 2021. Changes begin with the Consumer Privacy Protection Act[113], which was introduced to Parliament by the Liberal government on November 17, 2020.\n```\n                                                           39\n\n```\n```\n          CYBERSECURITY INSIGHTS\n\n```\n\n-----\n\n###### CYBERSECURITY/DATA PRIVACY  LEGISLATIVE AND REGULATORY FORECAST\n\n CANADA\n\n\n###### The proposed Consumer Privacy Protection Act, which governs private sector organizations, includes some of the most severe penalties for privacy breaches in the G7. Companies failing to comply with the legislation could face monetary penalties of up to 5% of their revenue, or CA $25 million, whichever is greater. The new legislation, which would come into force 18 to 24 months after it is passed into law, mirrors Europe’s GDPR.\n\n Under the legislation, companies are required to:\n\n 0 Obtain consent from customers using plain language\n 0 Provide greater transparency on how their data is being used\n 0 Enable data portability and interoperability\n 0 Provide Canadians with the ability to demand that their information be destroyed\n\n The legislation also proposes to give the OPC broad powers, including the ability to force compliance from an organization. If adopted, Canada will have privacy legislation with teeth that forces companies to enact organizational and cybersecurity measures that adequately safeguard personal information. Accompanying this legislation will be the modernization of the public sector privacy law, the Privacy Act[114]. This law, which has not been updated since 1983, is expected to mirror the proposed Consumer Privacy\n\n\n###### Protection Act. Together, they will raise the bar for privacy and cybersecurity in Canada.\n\n Another area of increasing concern and focus in 2021, is Canada’s aging critical infrastructure strategy and policies. Canada’s critical infrastructure strategy[115] has not been updated since 2009 and is ill-prepared to deal with today’s cyber-based threats. As Canada looks to update its critical infrastructure strategy it should consider:\n\n 0 Elevating the importance of cybersecurity across critical infrastructure\n\n 0 Streamlining authorities and breaking down current administrative and bureaucratic barriers that could prevent the Canadian Government from detecting and responding to threats in a timely manner\n\n 0 Developing a business continuity plan for the economy to promote national resilience if/when a cyber attack was to cause distress to critical infrastructure\n\n Overall, 2021 is likely to see massive investments in cybersecurity infrastructure, technologies, and relevant legislation made by private and public sector entities in Canada. Canadians realize and understand the importance of safeguarding critical infrastructure and information, and how important privacy and cybersecurity are to a nation’s economic and social well-being.\n```\n                           40\n\n```\n```\n          CYBERSECURITY INSIGHTS\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CYBERSECURITY, CRISES, AND COVID-19\n\n The COVID-19 pandemic may be the crisis of a generation, but for threat actors, it simply presented an opportunity to capitalize on global chaos. As workers transitioned to home offices and businesses struggled to adjust their operations, cyber attacks spiked by 63%[116].\n\n```\n\n###### The pandemic forced organizations to adapt to massive shifts in the workplace, supply chain, and consumer behavior while creating countless new attack vectors for adversaries. Attackers quickly tailored their efforts to exploit the new vulnerabilities created by COVID-19 by[117] :\n\n 0 Conducting phishing and SMS phishing campaigns featuring COVID-19 or coronavirus-related terminology as a lure\n\n 0 Registering domain names with titles or wording related to COVID-19\n\n 0 Distributing malware by using COVID-19 or coronavirus- related terminology as a lure\n\n\n###### The COVID-19 pandemic has been globally disruptive, rewarding cyber attackers who have honed their tactics by exploiting smaller disasters over time. For example, in 2017, threat actors exploited Hurricane Harvey hitting Texas by creating malicious websites, phishing campaigns, and setting up fake charities[121]. In 2005, similar scams were performed in the wake of Hurricane Katrina[122]. While every unforeseen disaster sends professional organizations scrambling for solutions, threat actors can merely adjust their battle- tested tactics to reflect the new circumstances.\n\n\n###### 0 Attacking rapidly deployed remote access infrastructure\n 0 Creating malicious mobile apps using COVID-19 or  coronavirus-related terminology as a lure[118]\n 0 Orchestrating COVID-19 stimulus-package[119] and 63% unemployment[120] scams\n\n```\n                             41\n\n```\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CYBERSECURITY, CRISES, AND COVID-19\n\n Securing Remote Infrastructure and Mobile Technology\n\n```\n\n###### Cybersecurity risks skyrocketed when COVID-19 forced workers to transition to home offices and children to remote learning environments[123]. By March 2020, coronavirus-themed campaigns and attacks were well underway[124]. These attacks began so quickly at the beginning of the outbreak that the World Health Organization released a statement warning of imposters using the organization’s name[125].\n\n\n###### The steps seem simple, but each device, software app, and location added to the infrastructure exponentially increases its complexity. An estimated ten-fold increase[126] in work from home employees also represents an increase of routers, smartphones, mobile devices, and personal PCs handling company data. This puts companies in the difficult position of no longer having to worry about the security of one network, but thousands.\n\n\n###### Vulnerabilities specific to VPN and remote communications were not the only new cybersecurity risks facing companies. Many home- based employees use personal or BYOD technology to assist with their job responsibilities. Ensuring employee’s personal devices are updated and secure is a Herculean task. Confirming that the software and third-party apps on personal devices are also secure and up to date is an exercise in futility.\n\n\n###### Today, organizations have had roughly a year to adapt to changes VPNs felt an enormous strain as some vendors reported usage caused by COVID-19. By now, businesses should be transitioning increases of 165% in a month[127]. Increased VPN usage from remote from their initial emergency response measures to a permanent workers introduces new security risks, as all protected data is long-term strategy for incorporating remote workers. A successful funneled to a single location, the provider’s company. Incorrectly plan for accommodating remote and mobile workers should include: configured and/or vulnerable VPNs can expose remote employees\n who believe themselves secure to potential cyber attacks\n 0 Maintaining employee productivity and user experience  from any location\n\n 0 Keeping both employee and organizational data secure at all times\n\n 0 Maintaining regulatory compliance while enacting BYOD policies and allowing employees to work from remote locations\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CYBERSECURITY, CRISES, AND COVID-19\n\n The Zero Trust Solution\n\n```\n\n###### Zero Trust, as the name implies, is a security model where everything inside or outside an organization is initially treated as a threat. Nothing is granted access to organizational resources until it builds (and maintains) trust. The Zero Trust philosophy is attributed to John Kindervag, a former principal analyst at Forrester Research Inc., who coined the term in 2010[129]. This framework solves the problem of securing every location and device used by remote employees by assuming they are untrusted by default.\n\n\n###### Ensuring that third-party apps and OEM software on BYOD devices is secure is another monumental task achievable through a Zero Trust framework. Work resources are relatively easy to monitor and protect within the business environment, but what happens when they are transferred to insecure BYOD devices? Implementing a secure gateway with IP layer security optimized for mobile and low-power devices can protect employee browsing and internal communications. Devices using the gateway can be sheltered from malicious URLs, dangerous apps, and phishing campaigns.\n\n\n###### malicious URLs, dangerous apps, and phishing campaigns.\n Employees and new devices can connect to business infrastructure, but until they perform steps establishing their trustworthiness, their Disasters, both natural and manmade, inevitably place a heavy access is safely limited. Trust (and greater access) can be granted burden upon organizations while creating opportunities for through a series of quick, non-intrusive measures commonly used malicious actors. Businesses, however, do not have to operate at today: two-factor authentication, security questions, etc. Once a perpetual disadvantage. Implementing a Zero Trust framework for necessary access is granted, the user and connected device(s) are remote workers and BYOD devices can eliminate or reduce many continuously monitored to ensure nothing suspicious occurs. The successful tactics threat actors deploy in times of crisis. process sounds like it would be intrusive and resource-intensive, but AI makes achieving an almost frictionless Zero Trust security posture possible[130].\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CRITICAL EVENT MANAGEMENT  FOR A SAFE AND SECURE OPERATING ENVIRONMENT\n\n As countries tackle the challenge to create smart cities, data collection and protection becomes important for better managing a municipality’s assets, resources, and services. Public utilities, traffic management networks, community facilities, and essential services will see improved operations as resources are optimized. Part of this journey will likely involve cybersecurity incident response teams deployed across various operational sectors in the economy. These teams will be tasked with detecting, identifying, and containing potential malicious actions. In most cases, the overall process will require support from private sector stakeholders and impact the lives of businesses, communities, and people.\n\n In an ideal world, current defense measures, levels of expertise, exploit times of catastrophe to gain access to critical information on systems, and IoT device integration would provide sufficient personal mobile devices, or worse, in enterprise critical systems[131]. response capabilities. With today’s research, and surveillance\n To illustrate, most buildings and critical infrastructure are managed\n systems installed across various countries, we may one day\n and supported by building automation systems. These systems\n accurately predict when (and where) the next natural disaster may\n regulate airflow, monitor air quality, lighting, water, and electricity,\n occur. This would allow effective response and mitigation assets to\n as well as security and fire protection systems. Cyber attacks on\n be deployed in advance while allowing critical data to remain secure.\n building facilities in recent years have been on the rise and can create\n However, the reality is the current COVID-19 pandemic scenario, havoc for occupants of them[132]. Imagine a threat actor gains access described as a “gray swan” by risk and resilience practitioners, may to a building’s fire protection system. They disable the fire alarms, occur again in the future. If so, the planning parameters affecting public broadcast system, and sprinkler pumps during an emergency, the deployment of public safety and security assets will continue resulting in the real loss of lives. The potential level of damage to challenge society. Disruptive critical events often affect every for compromising such systems can be left to one’s imagination, individual while creating opportunities for threat actors. Attackers especially where national critical infrastructures are concerned.\n\n```\n\n###### As countries tackle the challenge to create smart cities, data collection and protection becomes important for better managing a municipality’s assets, resources, and services. Public utilities, traffic management networks, community facilities, and essential services will see improved operations as resources are optimized. Part of this journey will likely involve cybersecurity incident response teams deployed across various operational sectors in the economy. These teams will be tasked with detecting, identifying, and containing potential malicious actions. In most cases, the overall process will require support from private sector stakeholders and impact the lives of businesses, communities, and people.\n\n exploit times of catastrophe to gain access to critical information on personal mobile devices, or worse, in enterprise critical systems[131].\n\n To illustrate, most buildings and critical infrastructure are managed and supported by building automation systems. These systems regulate airflow, monitor air quality, lighting, water, and electricity, as well as security and fire protection systems. Cyber attacks on building facilities in recent years have been on the rise and can create havoc for occupants of them[132]. Imagine a threat actor gains access to a building’s fire protection system. They disable the fire alarms, public broadcast system, and sprinkler pumps during an emergency, resulting in the real loss of lives. The potential level of damage for compromising such systems can be left to one’s imagination, especially where national critical infrastructures are concerned.\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### CRITICAL EVENT MANAGEMENT  FOR A SAFE AND SECURE OPERATING ENVIRONMENT\n\n Cyber threats are not confined to digital assets and resources. They The ability to provide an alternative, rapid means of communication can have a physical impact on lives and property. When conventional is a prudent investment decision. Especially for times when a communication systems are compromised, there is an urgent need cybersecurity threat is detected early by the security operations to ensure critical communications can continue in a secured and center. Prepared response playbooks can be pre-populated into reliable environment. When an unexpected event puts lives at risk, critical event management platforms. This way, when a significant it is crucial to be able to: threat is detected, critical information can be delivered via multiple\n platforms and integrations (for example, through common platforms\n 0 Rapidly notify relevant parties\n such as ServiceNow and Microsoft Teams). Automated response\n 0 Locate and account for missing people and critical resources playbooks could also support live operations management and\n even facilitate forward planning activities.\n 0 Collect real-time on-the-ground information\n Current legacy operating systems and devices remain a potential\n 0 Facilitate the coordination of stakeholders to manage and\n point of entry for threat actors. Businesses or communities that\n contain the crisis\n\n```\n\n###### The ability to provide an alternative, rapid means of communication is a prudent investment decision. Especially for times when a cybersecurity threat is detected early by the security operations center. Prepared response playbooks can be pre-populated into critical event management platforms. This way, when a significant threat is detected, critical information can be delivered via multiple platforms and integrations (for example, through common platforms such as ServiceNow and Microsoft Teams). Automated response playbooks could also support live operations management and even facilitate forward planning activities.\n\n Current legacy operating systems and devices remain a potential point of entry for threat actors. Businesses or communities that have yet to harness the potential of smart cities are particularly vulnerable. Outdated systems and malicious attackers can greatly hinder attempts to facilitate swift critical event management during a potential crisis. A robust critical event management platform that supports stakeholder collaboration and provides situational awareness can effectively enhance crisis management operations and protect communities and businesses.\n\n\n-----\n\n```\nCYBERSECURITY INSIGHTS\n\n###### THREAT TRENDS TO WATCH IN 2021\n\n BlackBerry researchers and security professionals were asked to provide their cybersecurity predictions for the upcoming year. They ask users to stay aware of the following threat trends as 2021 progresses.\n\n Ransomware Attacks Will Continue to Leverage the Double Extortion Strategy\n\n Threat actors will continue to conduct ransomware attacks while utilizing double extortion to pressure a victim to pay ransom this year. Throughout 2020, cyber criminals strategically stole the victim’s data before encrypting it, then threatened to release the stolen information to the public, or even to a competitor. This tactic is used to compel the victim to pay (or at least engage with) the attackers to recover their data. The strategy has driven up the average ransom payments throughout 2020, even though there are no guarantees that attacker-owned copies of the victim’s data will be deleted. Instances have been discovered where attackers still released the victim’s data even after receiving the ransom payment[133 134].\n\n Nation-State Actors Hiding Behind Crimeware-as-a-Service\n\n The emergence, sophistication, and anonymity of crimeware-as-a-service means that nation states can mask their efforts behind third-party contractors and an almost impenetrable wall of plausible deniability. Attackers can obfuscate their efforts to make it appear as though an attack originated almost anywhere. This makes decisively attributing cyber attacks to known threat actors extremely difficult. Companies should consider adapting by applying Zero Trust networking principles and role-based access controls, not just to users, but also to applications and servers.\n\n```\n\n###### Threat Actors Contacting Patients as  Part of Healthcare Extortion Strategies\n\n Throughout 2020, healthcare organizations continued to top the target list of cyber attacks. The healthcare industry is critical for providing services during the pandemic and also holds confidential data like medical records, which are extremely valuable to attackers. Threat researchers saw cases where medical records were weaponized to facilitate the attacker’s objectives.\n\n In October 2020, a Finnish psychotherapy center had their systems attacked and patient data stolen. Not only did the attackers demand a ransom from the psychotherapy center, they also contacted patients individually seeking a ransom of 200 Euros in bitcoin. The threat actors ultimately published the records of at least 300 patients via a Tor site[135]. This tactic could become more popular throughout 2021, especially when combined with traditional ransomware attacks. Furthermore, it could also provide additional pressure on healthcare service providers from patients who are being extorted individually, leading to a higher probability of ransom payment.\n\n Crypto Prices Driving Ransomware Growth\n\n It is generally believed that there is a correlation between the rate of ransomware infections and the price of bitcoin. The value of bitcoin reached all new highs in early 2021[136]. If this assumed correlation holds true, a robust ransomware market can be expected in the near future.\n```\n                                      46\n\n```\n\n-----\n\n#### CONCLUSION\n\n###### The COVID-19 pandemic made a major impact on global systems, and cybersecurity was no exception to its influence. As businesses struggled to survive the disruptive effects of the coronavirus, threat actors moved quickly to capitalize on the resulting chaos. Workers connecting from remote locations, using new devices and untested infrastructure, offered threat actors a rich new attack surface to exploit. People’s fear of COVID-19 and understandable desire for information gave attackers new opportunities to launch COVID-19-themed phishing campaigns and malicious apps.\n\n Elections remained vulnerable to cyber attacks through unsecured mobile technology, insufficient DMARC email protection, and over-exposure of personal information on social media. While electronic voting machines are often the center of attention in discussions about election security, it seems attackers favor interfering through more subtle methods. Non-secure political websites, operatives using compromised technology, and over-sharing of personal information on social media all played a role in weakening election security in 2020.\n```\n                                                           47\n\n```\n\n###### election security in 2020.\n\n\n###### election security in 2020.\n\n\n###### election security in 2020.\n\n\n###### election security in 2020.\n\n\n-----\n\n###### The elusive and highly capable BAHAMUT group remained active in 2020. They trafficked in fake news sites, social media accounts, and hosted dozens of malicious apps in the App Store and Google Play store. BAHAMUT activity currently appears focused in the South Asia and the Persian Gulf regions, though targets in China and Europe have also been discovered. Currently, the group is engaged in credential harvesting from popular sites like Google, Microsoft, Yahoo!, Telegram, Sina, QQ, 126, and 163.\n\n The threat actors behind Emotet continued to refine their attack strategies and capabilities. In 2020, the threat was upgraded to perform Wi-Fi brute force attacks and device infections. It also implemented hash-busting to prevent blacklisting and other security countermeasures. A vulnerability discovered in the malware briefly allowed threat researchers to trigger a kill switch on Emotet infections. The flaw has since been patched.\n\n Ransomware attacks shifted from performing indiscriminate targeting to conducting highly focused campaigns deployed via compromised MSSPs. RaaS is increasingly adopting a private model where affiliates are given access to compromised systems for an agreed cut of future profits. Attackers are favoring exfiltrating data before encryption, then using it to blackmail victims for higher ransoms.\n\n\n###### Vehicle manufacturers, facing new regulations, are becoming more cybersecurity conscious. However, connected vehicles remain largely unprotected against a wide range of cyber attacks and data theft. In 2020, the UNECE approved vehicle cybersecurity regulation WP.29 which begins the work of setting common security criterion for global automakers. The first vehicles to benefit from improved security regulations should be on the road by Summer 2024.\n\n The cybersecurity field becomes increasingly complex with each passing year as new technologies, devices, and innovations enter the space. However, the foundation for robust security practices remains unchanged – prepare, prevent, detect, and respond. BlackBerry has delivered secure communications and technology for decades by developing advanced solutions that align with sound security principles. Today, our fifth-generation AI-driven solutions can detect zero-day malware, fileless attacks, insider threats, and more by following the same time-tested security fundamentals.\n\n BlackBerry remains dedicated to advancing the cause of cybersecurity for people and organizations worldwide. We continue to train and deploy increasingly effective and advanced AI models that power our endpoint protection products, with the aim of securing technology, processes, and user identity. We continuously monitor the global threat landscape for emerging threats and seek to provide solutions where problems arise. To learn more about how BlackBerry can secure your technology in 2021 and beyond, visit us at www.blackberry.com .\n```\n                           48\n\n```\n\n###### Yahoo!, Telegram, Sina, QQ, 126, and 163.\n\n infections. The flaw has since been patched.\n\n higher ransoms.\n\n\n###### higher ransoms.\n\n\n-----\n\n```\nCONCLUSION\n\n###### Acknowledgements Legal Disclaimer\n\n The BlackBerry 2021 Threat Report represents the collaborative efforts of our talented teams and individuals. In particular, we would like to recognize:\n\n Alan McCarthy John de Boer\n\n Anne Kierig John McClurg\n\n Anuj Soni  John Wood\n\n Baldeep Dogra Lydia McElligott\n property of their respective owners.\n Ben Cruz Marisa Goodrich\n\n Bret Lenmark  Marta Janus\n\n Brian Robison Natasha Rohner\n\n Claudiu Teodorescu Nigel Thompson\n\n Dan Ballmer Sabrina Forgione \n\n Dean Given Steve Barnes\n\n Ebudo Osime Thom Ables\n\n Eric Milam Tim Davies\n\n Gary Ng  T.J. O’Leary\n\n Glenn Wurster Tom Bonner\n\n Graham Murphy Tony Lee\n\n Ian Davis William Savastano\n\n Ieva Rutkovska Yi Zheng\n\n```\n\n###### Legal Disclaimer\n\n The BlackBerry 2021 Threat Report represents the collaborative The information contained in the BlackBerry Threat Report is efforts of our talented teams and individuals. In particular, we would intended for educational purposes only. Readers are responsible for\n exercising their own due diligence when applying this information to their private and professional lives. BlackBerry does not condone\n John de Boer\n any malicious use or misuse of information presented in this\n John McClurg report. Trademarks, including but not limited to BLACKBERRY, are\n the trademarks or registered trademarks of BlackBerry Limited,\n John Wood\n its subsidiaries and/or affiliates, and the exclusive rights to such\n Lydia McElligott trademarks are expressly reserved. All other trademarks are the\n property of their respective owners.\n Marisa Goodrich\n\n Marta Janus\n\n Natasha Rohner\n\n Nigel Thompson\n\n Sabrina Forgione \n\n Steve Barnes\n\n Thom Ables\n\n Tim Davies\n\n T.J. O’Leary\n\n Tom Bonner\n\n Tony Lee\n\n William Savastano\n\n Yi Zheng\n```\n                                                                                   49\n\n```\n\n-----\n\n###### Endnotes\n```\n1 https://blog.checkpoint.com/2020/03/05/update-coronavirus-themed-domains  50-more-likely-to-be-malicious-than-other-domains/\n2 https://www.zdnet.com/article/\n  working-from-home-trend-causes-surge-in-cybersecurity-costs-security  breaches/\n3 https://www.domaintools.com/resources/blog/\n  covidlock-mobile-coronavirus-tracking-app-coughs-up-ransomware\n4 https://www.fcc.gov/how-identify-and-avoid-package-delivery-scams\n5 https://cisomag.eccouncil.org/ransomware-attacks-rise-q1-2020/\n6 https://blogs.blackberry.com/en/2020/05/\n  threat-bulletin-ransomware-2020-state-of-play\n7 https://www.coveware.com/blog/q1-2020-ransomware-marketplace-report\n8 https://www.investopedia.com/tech/how-does-bitcoin-mining-work/\n9 https://www.csoonline.com/article/3253572/what-is-cryptojacking-how-to  prevent-detect-and-recover-from-it.html\n10 https://github.com/xmrig/xmrig\n11 https://www.darkreading.com/vulnerabilities---threats/\n  cryptojacking-the-unseen-threat/a/d-id/1338903\n12 https://cointelegraph.com/news/\n  bitcoin-going-parabolic-toward-35k-as-ethereum-breaks-800-what-s-next\n13 https://www.infosecurity-magazine.com/news/\n   microsoft-warns-of-massive-covid19/\n14 https://www.geoedge.com/exploit-kits-publisher-protection/\n15 https://www.zscaler.com/blogs/security-research/\n  top-exploit-kit-activity-roundupspring-2020\n16 https://threatpost.com/microsoft-exploits-purple-fox-ek/157157/\n17 https://resources.infosecinstitute.com/topic/\n  purple-fox-malware-what-it-is-how-it-works-how-to-prevent-it/\n18 https://www.cobaltstrike.com/\n19 https://www.darkreading.com/threat-intelligence/\n  how-to-identify-cobalt-strike-on-your-network/a/d-id/1339357\n\n```\n```\n20 https://www.zdnet.com/google-amp/article/\n  cobalt-strike-and-metasploit-accounted-for-a-quarter-of-all-malware-c-c  servers-in-2020/\n21 http://www.joeware.net/freetools/tools/adfind/\n22 https://www.darkreading.com/application-security/ransomware/\n  fin6-expands-its-range-with-ransomware/a/d-id/750703\n23 https://www.advanced-intel.com/post/\n  anatomy-of-attack-inside-bazarbackdoor-to-ryuk-ransomware-one-group-via  cobalt-strike\n24 https://github.com/BloodHoundAD/BloodHound\n25 https://github.com/BloodHoundAD/SharpHound3\n26 https://mcpmag.com/articles/2019/11/13/bloodhound-active-directory  domain-admin.aspx\n27 https://www.zdnet.com/article/\n  malware-gangs-love-open-source-offensive-hacking-tools/\n28 https://www.andreafortuna.org/2020/09/17/\n  new-mimikatz-update-adds-exploit-for-zerologon-cve-2020-1472  vulnerability/\n29 https://stealthbits.com/blog/zerologon-from-zero-to-hero-part-2/\n30 https://github.com/AlessandroZ/LaZagne\n31 https://github.com/skelsec/pypykatz\n32 https://www.ncsc.gov.uk/news/\n  advisory-apt29-targets-covid-19-vaccine-development\n33 https://securityintelligence.com/posts/\n  ibm-uncovers-global-phishing-covid-19-vaccine-cold-chain/\n34 https://www.reuters.com/article/healthcare-coronavirus-astrazeneca-north/\n  exclusive-suspected-north-korean-hackers-targeted-covid-vaccine-maker  astrazeneca-sources-idUSL8N2IC2QU\n35 https://objective-see.com/blog/blog_0x25.html\n36 https://objective-see.com/blog/blog_0x51.html\n37 https://www.amnesty.org/en/latest/research/2020/09/\n  german-made-finspy-spyware-found-in-egypt-and-mac-and-linux-versions  revealed/\n\n```\n```\n38 https://www.amnesty.org/en/latest/research/2020/09/\n  german-made-finspy-spyware-found-in-egypt-and-mac-and-linux-versions  revealed/\n39 https://objective-see.com/blog/blog_0x59.html\n40 https://objective-see.com/blog/blog_0x49.html\n41 https://objective-see.com/blog/blog_0x57.html\n42 https://github.com/jgamblin/Mirai-Source-Code\n43 https://github.com/jgamblin/Mirai-Source-Code/\n  blob/3273043e1ef9c0bb41bd9fcdc5317f7b797a2a94/mirai/bot/scanner.c#L674\n44 https://whois.arin.net/rest/net/NET-56-0-0-0-1/pft\n45 https://krebsonsecurity.com/2016/09/\n  krebsonsecurity-hit-with-record-ddos/\n46 https://web.archive.org/web/20161022220033/http://hub.dyn.com/dyn-blog/\n  dyn-statement-on-10-21-2016-ddos-attack\n47 https://threatpost.com/\n  valve-source-engine-fortnite-servers-crippled-by-gafgyt-variant/149719/\n48 https://malpedia.caad.fkie.fraunhofer.de/details/elf.bashlite\n49 https://malpedia.caad.fkie.fraunhofer.de/details/elf.tsunami\n50 https://www.zdnet.com/article/\n  hacker-hundreds-were-tricked-into-installing-linux-mint-backdoor/\n51 https://threatpost.com/\n  muhstik-botnet-exploits-highly-critical-drupal-bug/131360/\n52 https://www.anomali.com/blog/\n  the-interplanetary-storm-new-malware-in-wild-using-interplanetary-file  systems-ipfs-p2p-network\n53 https://www.zdnet.com/article/\n  ipstorm-botnet-expands-from-windows-to-android-mac-and-linux/\n54 https://www.intezer.com/blog/\n  research/a-storm-is-brewing-ipstorm-now-has-linux-malware/\n55 https://www.intezer.com/blog/\n  research/a-storm-is-brewing-ipstorm-now-has-linux-malware/\n56 https://www.pwc.co.uk/issues/cyber-security-services/insights/cleaning  up-after-wellmess.html\n                           50\n\n```\n\n-----\n\n```\nENDNOTES\n57 https://www.ncsc.gov.uk/files/\n  Advisory-APT29-targets-COVID-19-vaccine-development.pdf\n58 https://www.guardicore.com/2020/08/\n  fritzfrog-p2p-botnet-infects-ssh-servers/\n59 https://www.cbsnews.com/news/\n  russian-military-officers-hacking-cyber-attacks-charged/\n60 https://www.justice.gov/opa/press-release/file/1328521/download\n61 https://www.theguardian.com/us-news/2020/sep/04/\n  us-security-adviser-china-elections-meddling\n62 https://www.fastcompany.com/90372829/\n  im-a-hacker-and-heres-how-your-social-media-posts-help-me-break-into  your-company\n63 https://dmarc.org/wiki/\n  FAQ#How_does_DMARC_work.2C_briefly.2C_and_in_non-technical_terms.3F\n64 https://www.businesswire.com/news/home/20201022005020/en/\n  Valimail-2020-Election-Infrastructure-Still-Vulnerable-to-Email-Hackers\n65 https://www.parascript.com/blog/\n  artificial-intelligence-combats-voter-fraud/\n66 https://www.forbes.com/sites/\n   markminevich/2020/11/02/7-ways-ai-could-solve-all-of-our-election-woes  out-with-the-polls-in-with-the-ai-models/?sh=5511ffcd622c\n67 https://www.blackberry.com/us/en/forms/enterprise/bahamut-report\n68 https://attack.mitre.org/software/S0367/\n69 https://www.silicon.co.uk/security/cyberwar/\n  banking-trojan-emotet-returns-220593?cmpredirect\n70 https://thehackernews.com/2020/11/anyrun-emotet-malware-analysis.html\n71 https://cyware.com/news/\n  the-evolution-of-the-infamous-emotet-banking-trojan-28f517ac/\n72 https://www.bankinfosecurity.com/\n  emotet-malware-returns-to-work-after-holiday-break-a-11955\n73 https://blog.barracuda.com/2020/06/19/\n  emotet-emerges-as-a-leader-in-maas/\n\n```\n```\n74 https://i.crn.com/sites/default/files/ckfinderimages/userfiles/images/\n  crn/custom/2019/BBCylance_LC_Q319_Threat_Report.pdf\n75 https://us-cert.cisa.gov/ncas/alerts/TA18-201A\n76 https://www.cybereason.com/blog/\n  one-two-punch-emotet-trickbot-and-ryuk-steal-then-ransom-data\n77 https://www.zdnet.com/article/\n  banking-malware-finds-new-life-spreading-data-stealing-trojan/\n78 https://www.zdnet.com/article/\n   malware-and-botnets-why-emotet-is-dominating-the-malicious-threat  landscape-in-2019/\n79 https://resources.infosecinstitute.com/topic/\n  emotet-returns-with-new-improvements/\n80 https://threatpost.com/\n  emotet-now-hacks-nearby-wi-fi-networks-to-spread-like-a-worm/152725/\n81 https://thehackernews.com/2020/08/emotet-botnet-malware.html\n82 https://iotnowtransport.com/2019/04/09/\n  71897-automotive-industry-struggles-navigate-cybersecurity-issues/\n83 https://dzone.com/articles/\n  study-shows-security-challenges-in-the-auto-indust\n84 https://blog.guardknox.com/\n  what-are-connected-vehicles-and-their-vulnerabilities\n85 https://www.strategyanalytics.com/strategy-analytics/blogs/automotive/\n  infotainment-telematics/infotainment-telematics/2018/11/27/\n  auto-cyber-security-from-ignore-to-compliance\n86 https://www.ic3.gov/Media/Y2016/PSA160317\n87 https://www.ibtimes.com/\n  tesla-model-s-hack-oslo-based-security-firm-uses-android-hack-unlock  steal-car-2450833\n88 https://www.sciencedirect.com/science/article/pii/S221420961930261X\n89 https://www.wmcactionnews5.com/story/39022826/\n  used-cars-increase-identity-theft-chances-bbb-finds/\n90 https://www.edmunds.com/car-technology/car-technology-and-privacy.html\n\n```\n```\n91 https://arstechnica.com/information-technology/2019/10/\n  five-months-after-returning-rental-car-man-still-has-remote-control/\n92 https://www.theguardian.com/technology/2020/feb/18/\n  smart-car-gig-rental-app-trapped\n93 https://argus-sec.com/unece-wp29-approved/\n94 https://unece.org/DAM/trans/doc/2020/wp29/ECE-TRANS-WP29-1073r27e.pdf\n95 https://unece.org/press/un-regulations-cybersecurity-and-software  updates-pave-way-mass-roll-out-connected-vehicles\n96 https://www2.deloitte.com/global/en/blog/responsible-business-blog/2020/\n  new-cybersecurity-regulations-challenge-automobile-manufacturers.html\n97 https://blogs.blackberry.com/en/2020/05/\n  threat-bulletin-ransomware-2020-state-of-play\n98 https://docs.apwg.org/reports/apwg_trends_report_q1_2020.pdf\n99 https://apwg.org/trendsreports/\n100 https://www.microsoft.com/security/blog/2020/07/08/\n  protecting-remote-workforce-application-attacks-consent-phishing/\n101 https://info.phishlabs.com/blog/\n  office-365-phishing-uses-malicious-app-persist-password-reset\n102 https://cofense.com/mfa-bypass-phish-caught-oauth2-grants  access-user-data-without-password/\n103 https://www.proofpoint.com/us/blog/threat-insight/\n  ta2552-uses-oauth-access-token-phishing-exploit-read-only-risks\n104 https://www.bbc.com/news/technology-48908736\n105 https://www.forbes.com/sites/daveywinder/2019/10/08/\n  forget-2020-election-fake-news-deepfake-videos-are-all-about-the  porn/?sh=42537b4b63f9\n106 https://cpb-us-e1.wpmucdn.com/sites.uw.edu/dist/6/4560/files/2020/10/\n  CIP_Deepfakes_Report_Extended.pdf\n                           51\n\n```\n\n-----\n\n```\nENDNOTES\n107 https://www.brusselstimes.com/news/belgium-all-news/politics/106320/\n  xr-belgium-posts-deepfake-of-belgian-premier-linking-covid-19-with  climate-crisis/\n108 https://www.nbcnews.com/tech/tech-news/russian-internet-trolls-hired-u-s  journalists-push-their-news-n1239000\n109 In December 2020 a “highly sophisticated nation-state actor” (according to the\n   Cybersecurity and Infrastructure Security Agency (CISA)) compromised certain\n   SolarWinds software widely used across private/public to monitor health of cyber\n   networks. CISA had to issue an emergency cybersecurity directive ordering all\n   federal agencies to disconnect or power-down certain SolarWind products.\n110 https://www.cbc.ca/news/canada/montreal/\n  desjardins-data-breach-1.5344216\n111 https://priv.gc.ca/en/opc-actions-and-decisions/investigations/\n  investigations-into-businesses/2020/pipeda-2020-005/\n112 https://priv.gc.ca/en/opc-actions-and-decisions/investigations/\n  investigations-into-businesses/2020/pipeda-2020-005/\n113 https://parl.ca/DocumentViewer/en/43-2/bill/C-11/\n  first-reading?source=email\n114 https://www.justice.gc.ca/eng/csj-sjc/pa-lprp/modern.html\n115 https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/srtg-crtcl-nfrstrctr/\n  srtg-crtcl-nfrstrctr-eng.pdf\n\n```\n```\n116 https://www.issa.org/\n  the-impact-of-the-covid-19-pandemic-on-cybersecurity/\n117 https://us-cert.cisa.gov/ncas/alerts/aa20-099a\n118 https://www.mirror.co.uk/tech/\n  android-warning-fake-coronavirus-safety-21759866\n119 https://www.cnet.com/health/\n  fbi-issues-warning-for-covid-19-stimulus-package-scams/\n120 https://www.seattletimes.com/seattle-news/\n  state-auditor-weak-security-accounting-errors-in-600-million  unemployment-fraud/\n121 https://www.cnet.com/news/\n  hurricane-harvey-charity-donations-scam-phishing-attack/\n122 https://www.cnet.com/news/man-charged-in-katrina-web-scam/\n123 https://threatpost.com/\n  working-from-home-covid-19s-constellation-of-security  challenges/153720/\n124 https://threatpost.com/coronavirus-themed-cyberattacks-persists/153493/\n125 https://www.who.int/about/communications/cyber-security\n126 https://globalworkplaceanalytics.com/\n  work-at-home-after-covid-19-our-forecast\n\n```\n```\n127 https://www.cnet.com/\n  news vpn-use-surges-during-the-coronavirus-lockdown-but-so  do-security-risks/\n128 https://vpnpro.com/blog/\n  google-removes-one-of-biggest-vpn-apps-from-play-store-due-to  vulnerability/\n129 https://www.csoonline.com/article/3247848/\n  what-is-zero-trust-a-model-for-more-effective-security.html\n130 https://www.blackberry.com/us/en/solutions/zero-trust\n131 INTERPOL – Global Landscape on COVID-19 Cyber Threat (April 2020)\n132 https://www.facilitiesnet.com/buildingautomation/tip/\n  Smart-Buildings-At-High-Risk-for-Cyber-Attacks-Study--44839\n133 https://www.coveware.com/blog/q3-2020-ransomware-marketplace-report\n134 https://krebsonsecurity.com/2020/11/\n  why-paying-to-delete-stolen-data-is-bonkers/\n135 https://apnews.com/article/psychotherapy-cabinets-finland  6b27c895df0abd532a4fb000c9d5d517\n136 https://www.cnbc.com/2021/01/07/\n  bitcoin-btc-rally-extends-price-hits-record-high-above-37700.html\n                                    210224\n                           52\n\n```\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.blackberry.com/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-bb-2021-threat-report.pdf"
    ],
    "report_names": [
        "report-bb-2021-threat-report.pdf"
    ],
    "threat_actors": [
        {
            "id": "c72c09b8-81ba-4e6e-9094-cd84ee4bda79",
            "created_at": "2022-10-25T15:50:23.667393Z",
            "updated_at": "2025-03-27T02:00:55.517974Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [
                "CostaRicto"
            ],
            "source_name": "MITRE:CostaRicto",
            "tools": [
                "PowerSploit",
                "SombRAT",
                "PsExec",
                "PS1",
                "CostaBricks"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "732bfd4b-8c15-42a5-ac4b-14a9a4b902e9",
            "created_at": "2022-10-25T16:07:23.38079Z",
            "updated_at": "2025-03-27T02:02:09.771357Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "ETDA:Bahamut",
            "tools": [
                "Bahamut",
                "DownPaper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9962552c-9d9d-4627-97f6-4558183fdd7f",
            "created_at": "2022-10-25T15:50:23.448869Z",
            "updated_at": "2025-03-27T02:00:55.472343Z",
            "deleted_at": null,
            "main_name": "The White Company",
            "aliases": [
                "The White Company"
            ],
            "source_name": "MITRE:The White Company",
            "tools": [
                "Revenge RAT",
                "NETWIRE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b77f9b40-dca7-449d-819e-115cd2295b41",
            "created_at": "2022-10-25T16:07:23.502671Z",
            "updated_at": "2025-03-27T02:02:09.834738Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "ETDA:CostaRicto",
            "tools": [
                "CostaBricks",
                "PowerSploit",
                "PsExec",
                "SombRAT",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b88f18e-81b7-46b6-a20d-79e03220447d",
            "created_at": "2024-02-06T02:00:04.101887Z",
            "updated_at": "2025-03-27T02:00:03.316982Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "MISPGALAXY:TA2552",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75febd40-3628-491d-be18-366270cb33b1",
            "created_at": "2022-10-25T16:07:24.267099Z",
            "updated_at": "2025-03-27T02:02:10.15549Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "ETDA:TA2552",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "37714790-40c0-4b6b-8e49-1c8f45a0463f",
            "created_at": "2022-10-25T16:07:24.37091Z",
            "updated_at": "2025-03-27T02:02:10.196909Z",
            "deleted_at": null,
            "main_name": "Urpage",
            "aliases": [],
            "source_name": "ETDA:Urpage",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "115cf618-02a8-42b8-8d25-305292eafedb",
            "created_at": "2023-11-21T02:00:07.396534Z",
            "updated_at": "2025-03-27T02:00:03.251048Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "MISPGALAXY:CostaRicto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f99641e0-2688-47b0-97bc-7410659d49a0",
            "created_at": "2023-01-06T13:46:38.802141Z",
            "updated_at": "2025-03-27T02:00:02.922907Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "MISPGALAXY:Bahamut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6bd4ed50-e116-494c-bb70-9587876663f1",
            "created_at": "2023-01-06T13:46:39.004062Z",
            "updated_at": "2025-03-27T02:00:02.974882Z",
            "deleted_at": null,
            "main_name": "WindShift",
            "aliases": [
                "Windy Phoenix"
            ],
            "source_name": "MISPGALAXY:WindShift",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ada9e5d3-1cb2-4b70-a3c8-96808c304ac8",
            "created_at": "2022-10-25T15:50:23.6515Z",
            "updated_at": "2025-03-27T02:00:55.513513Z",
            "deleted_at": null,
            "main_name": "Windshift",
            "aliases": [
                "Windshift",
                "Bahamut"
            ],
            "source_name": "MITRE:Windshift",
            "tools": [
                "WindTail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "68f12936-2361-4720-87e1-b79a4fdbf1a0",
            "created_at": "2022-10-25T16:07:24.409855Z",
            "updated_at": "2025-03-27T02:02:10.21199Z",
            "deleted_at": null,
            "main_name": "WindShift",
            "aliases": [
                "Windy Phoenix"
            ],
            "source_name": "ETDA:WindShift",
            "tools": [
                "WindTail"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8fddd571-37dc-4bb2-84b4-e41ac6fd11f5",
            "created_at": "2024-02-08T02:00:04.32487Z",
            "updated_at": "2025-03-27T02:00:03.329395Z",
            "deleted_at": null,
            "main_name": "Urpage",
            "aliases": [],
            "source_name": "MISPGALAXY:Urpage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0451922a-d2c6-4917-a2fd-3f3b3547d697",
            "created_at": "2022-10-25T16:07:24.391313Z",
            "updated_at": "2025-03-27T02:02:10.206474Z",
            "deleted_at": null,
            "main_name": "The White Company",
            "aliases": [
                "Operation Shaheen"
            ],
            "source_name": "ETDA:The White Company",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1615473221,
    "ts_modification_date": 1615467459,
    "files": {
        "pdf": "https://archive.orkl.eu/8b38b4df3156c38d0f9adc81b3fc0715e307ca93.pdf",
        "text": "https://archive.orkl.eu/8b38b4df3156c38d0f9adc81b3fc0715e307ca93.txt",
        "img": "https://archive.orkl.eu/8b38b4df3156c38d0f9adc81b3fc0715e307ca93.jpg"
    }
}