{
    "id": "5d80ee23-94c4-4d6e-87e8-a77e9bfc1ee5",
    "created_at": "2023-01-12T15:09:42.218572Z",
    "updated_at": "2025-03-27T02:05:42.199345Z",
    "deleted_at": null,
    "sha1_hash": "346f4233fc146435233b27e65b3f09f4295fc555",
    "title": "2021-11-10 - Zero-Day Disclosure- Palo Alto Networks GlobalProtect VPN CVE-2021-3064",
    "authors": "",
    "file_creation_date": "2022-05-28T23:17:36Z",
    "file_modification_date": "2022-05-28T23:17:36Z",
    "file_size": 1052864,
    "plain_text": "# Zero-Day Disclosure: PAN GlobalProtect CVE-2021-3064\n\n**randori.com/blog/cve-2021-3064/**\n\n## Overview: CVE-2021-3064\n\n[On November 10, 2021 Palo Alto Networks (PAN) provided an update that patched CVE-](https://www.paloaltonetworks.com/)\n[2021-3064 which was discovered and disclosed by Randori. This vulnerability affects PAN](https://www.twitter.com/RandoriAttack)\nfirewalls using the GlobalProtect Portal VPN and allows for unauthenticated remote code\nexecution on vulnerable installations of the product. The issue affects multiple versions of\nPAN-OS 8.1 prior to 8.1.17 and Randori has found numerous vulnerable instances exposed\n[on internet-facing assets, in excess of 10,000 assets.](https://www.shodan.io/search/facet?query=http.html%3A%22Global+Protect%22&facet=os)\n\nThe [Randori Attack Team developed a reliable working exploit and leveraged the capability](https://twitter.com/randoriattack)\nas part of Randori’s [continuous and automated red team platform. Our team was able to gain](https://www.randori.com/platform/)\na shell on the affected target, access sensitive configuration data, extract credentials, and\n\n\n-----\n\nmore. Once an attacker has control over the firewall, they will have visibility into the internal\nnetwork and can proceed to move laterally.\n\nIn an effort to avoid enabling misuse, technical details related to CVE-2021-3064 will be\nwithheld from public dissemination for a period of 30 days from the date of this publication.\n[More information will be released at that time. Follow @RandoriAttack on Twitter for updates](https://www.twitter.com/RandoriAttack)\non future posts.\n\n## Key Takeaways\n\nThe following are the key takeaways from the Randori Attack Team’s discovery and research\nsurrounding this flaw:\n\nThe vulnerability chain consists of a method for bypassing validations made by an\nexternal web server (HTTP smuggling) and a stack-based buffer overflow.\nIt affects Palo Alto firewalls running the 8.1 series of PAN-OS with GlobalProtect\nenabled (specifically versions < 8.1.17).\nExploitation of the vulnerability chain has been proven and allows for remote code\nexecution on both physical and virtual firewall products.\nPublicly available exploit code does not exist at this time.\nPatches are available from the vendor.\n\nPAN Threat Prevention Signatures are also available (IDs 91820 and 91855) to\nblock exploitation of the issue.\nPublic exploit code is likely to surface as:\n\nVPN devices are attractive targets for malicious actors, and\nExploitation of PA-VM virtual devices in particular is made easier due to their lack\nof Address Space Layout Randomization (ASLR).\n\n## Disclosure Process\n\nThis vulnerability was disclosed in accordance with Randori’s vulnerability disclosure policy.\nFor more information on Randori’s use of non-public capabilities, refer to our blog post Why\nZero-Days are Essential to Security.\n\n### Timeline\n\n**2020-10-26: Randori began initial research on GlobalProtect.**\n**2020-11-19: Randori discovered the buffer overflow vulnerability.**\n**2020-11-20: Randori discovered the HTTP smuggling capability.**\n**2020-12-01: Randori began authorized use of the vulnerability chain as part of**\nRandori’s [continuous and automated red team platform.](https://www.randori.com/platform/)\n**2021-09-22: The buffer overflow vulnerability was disclosed by Randori to PAN.**\n**2021-10-11: The HTTP smuggling capability was disclosed by Randori to PAN.**\n\n\n-----\n\n**2021-11-10: PAN released patches and a security bulletin assigning the vulnerability**\nCVE-2021-3064.\n**2021-11-10: This report was published.**\n\n## Technical Overview\n\nDetailed technical information usually appearing in our attacker’s notes is not provided at this\ntime to allow a period for customers of the affected vendor to patch or upgrade their systems.\nWe will be releasing technical details on December 10, 2021 and hosting a live webinar\nbreaking down the technical details of the exploit on December 14, 2021. Follow\n[@RandoriAttack on Twitter for updates.](https://www.twitter.com/RandoriAttack)\n\n### Confirmed Exploitable Systems\n\nThe Randori Attack team successfully exploited the following systems with GlobalProtect\nenabled and accessible:\n\nPalo Alto Networks PA-5220\n\nPAN-OS 8.1.16\nASLR enabled in firmware for this device\nPalo Alto Networks PA-VM\n\nPAN-OS 8.1.15\nASLR disabled in firmware for this device\n\n### Vulnerability Information\n\n\n-----\n\nCVE-2021-3064 is a buffer overflow that occurs while parsing user-supplied input into a\nfixed-length location on the stack. The problematic code is not reachable externally without\nutilizing an HTTP smuggling technique. Exploitation of these together yields remote code\nexecution under the privileges of the affected component on the firewall device. The\nsmuggling capability was not designated a CVE identifier as it is not considered a security\nboundary by the affected vendor.\n\n### Exploitation\n\nIn order to exploit this vulnerability, an attacker must have network access to the device on\nthe GlobalProtect service port (default port 443). As the affected product is a VPN portal, this\nport is often accessible over the Internet. On devices with ASLR enabled (which appears to\nbe the case in most hardware devices), exploitation is difficult but possible. On virtualized\ndevices (VM-series firewalls), exploitation is significantly easier due to lack of ASLR and\nRandori expects public exploits will surface. Randori researchers have not exploited the\nbuffer overflow to result in controlled code execution on certain hardware device versions\nwith MIPS-based management plane CPUs due to their big endian architecture, though the\noverflow is reachable on these devices and can be exploited to limit availability of services.\n\n## Mitigation Recommendations\n\nRandori recommends affected organizations apply the patches provided by PAN.\nAdditionally, PAN has made available Threat Prevention signatures 91820 and 91855 that\ncan be enabled to thwart exploitation while organizations plan for the software upgrade. For\norganizations not using the VPN capability as part of the firewall, we recommend disabling\nGlobalProtect.\n\nAs always, best practices should be followed for any Internet-facing assets, including:\n\nMonitoring logs and alerts for aberrant activity.\nRestrict originating IP addresses, if possible.\nApplying layered controls such as a web-application firewall, segmentation, and access\ncontrols.\n\n## References\n\n**Shodan:** https://www.shodan.io/search/facet?\nquery=http.html%3A%22Global+Protect%22&facet=os\n**Why Zero-Days Are Essential to the Security:** https://www.randori.com/blog/whyzero-days-are-essential-to-security/\n**Palo Alto Networks Security Advisory:** https://security.paloaltonetworks.com/CVE2021-3064\n\n**_Update: This post has been updated to correct the following:_**\n\n\n-----\n\n_A previous version of this post estimated the number of affected devices at 70,000, this_\n_was corrected to 10,000 to reflect updated information._\n_A typo in the timeline image incorrectly listed the disclosure date of the HTTP_\n_smuggling capability as October 2022, this has been corrected to reflect the disclosure_\n_date of October 11, 2021._\n(12/10/21): On November 10th, we disclosed CVE-2021-3064 in older versions of PAN_OS and announced our intent to release the technical details on December 10th and_\n_conduct a webinar on December 14th. We’ve been collaborating with Palo Alto_\n_Networks, who informed us that despite immediate and significant adoption of threat_\n_prevention signatures, there are still thousands of customers in the process of applying_\n_protections, and are not protected yet. Neither Palo Alto Networks nor Randori’s threat_\n_intel sources have identified any attempts at exploitation. To help keep Palo Alto_\n_Networks’ customers secure and Randori’s goal of making the overall community safer_\n_and more resilient, we have jointly decided to not release technical details at this time._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-10 - Zero-Day Disclosure- Palo Alto Networks GlobalProtect VPN CVE-2021-3064.pdf"
    ],
    "report_names": [
        "2021-11-10 - Zero-Day Disclosure- Palo Alto Networks GlobalProtect VPN CVE-2021-3064.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536182,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653779856,
    "ts_modification_date": 1653779856,
    "files": {
        "pdf": "https://archive.orkl.eu/346f4233fc146435233b27e65b3f09f4295fc555.pdf",
        "text": "https://archive.orkl.eu/346f4233fc146435233b27e65b3f09f4295fc555.txt",
        "img": "https://archive.orkl.eu/346f4233fc146435233b27e65b3f09f4295fc555.jpg"
    }
}