{
    "id": "5dc7ae93-ca30-42dc-860d-eb34305d6864",
    "created_at": "2023-01-12T15:02:14.799579Z",
    "updated_at": "2025-03-27T02:05:19.529128Z",
    "deleted_at": null,
    "sha1_hash": "80dc06d33074b75fa08e60b4c285aea8b7f1c504",
    "title": "2017-12-13 - Mirai IoT Botnet Co-Authors Plead Guilty",
    "authors": "",
    "file_creation_date": "2022-05-28T04:09:44Z",
    "file_modification_date": "2022-05-28T04:09:44Z",
    "file_size": 996147,
    "plain_text": "# Mirai IoT Botnet Co-Authors Plead Guilty\n\n**[krebsonsecurity.com/2017/12/mirai-iot-botnet-co-authors-plead-guilty/](https://krebsonsecurity.com/2017/12/mirai-iot-botnet-co-authors-plead-guilty/)**\n\nThe U.S. Justice Department on Tuesday unsealed the guilty pleas of two men first\nidentified in January 2017 by KrebsOnSecurity as the likely co-authors of Mirai, a malware\nstrain that remotely enslaves so-called “Internet of Things” devices such as security\ncameras, routers, and digital video recorders for use in large scale attacks designed to knock\nWeb sites and entire networks offline (including multiple major attacks against this site).\n\nEntering guilty pleas for their roles in developing and using Mirai are 21-year-old Paras Jha\nfrom Fanwood, N.J. and Josiah White, 20, from Washington, Pennsylvania.\n\nJha and White were co-founders of Protraf Solutions LLC, a company that specialized in\nmitigating large-scale DDoS attacks. Like firemen getting paid to put out the fires they\nstarted, Jha and White would target organizations with DDoS attacks and then either extort\nthem for money to call off the attacks, or try to sell those companies services they claimed\ncould uniquely help fend off the attacks.\n\n**CLICK FRAUD BOTNET**\n\nIn addition, the Mirai co-creators pleaded guilty to charges of using their botnet to conduct\n[click fraud — a form of online advertising fraud that will cost Internet advertisers more than](https://en.wikipedia.org/wiki/Click_fraud)\n$16 billion this year, according to [estimates from ad verification company Adloox.](https://www.cnbc.com/2017/03/15/businesses-could-lose-164-billion-to-online-advert-fraud-in-2017.html)\n\nThe plea agreements state that Jha, White and another person who also pleaded guilty to\nclick fraud conspiracy charges — a 21-year-old from Metairie, Louisiana named Dalton\n**Norman — leased access to their botnet for the purposes of earning fraudulent advertising**\n\n\n-----\n\nrevenue through click fraud activity and renting out their botnet to other cybercriminals.\n\nAs part of this scheme, victim devices were used to transmit high volumes of requests to\nview web addresses associated with affiliate advertising content. Because the victim activity\nresembled legitimate views of these websites, the activity generated fraudulent profits\nthrough the sites hosting the advertising content, at the expense of online advertising\ncompanies.\n\nJha and his co-conspirators admitted receiving as part of the click fraud scheme\napproximately two hundred bitcoin, valued on January 29, 2017 at over $180,000.\n\nProsecutors say Norman personally earned over 30 bitcoin, valued on January 29, 2017 at\napproximately $27,000. The documents show that Norman helped Jha and White discover\nnew, previously unknown vulnerabilities in IoT devices that could be used to beef up their\nMirai botnet, which at its height grew to more than 300,000 hacked devices.\n\n**MASSIVE ATTACKS**\n\nThe Mirai malware is responsible for coordinating some of the largest and most disruptive\nonline attacks the Internet has ever witnessed. The biggest and first to gain widespread\n[media attention began on Sept. 20, 2016, when KrebsOnSecurity came under a sustained](https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/)\ndistributed denial-of-service attack from more than 175,000 IoT devices (the size estimates\ncome from [this Usenix paper (PDF) on the Mirai botnet evolution).](https://www.usenix.org/system/files/conference/usenixsecurity17/sec17-antonakakis.pdf)\n\nThat September 2016 digital siege maxed out at 620 Gbps, almost twice the size of the nextlargest attack that Akamai — my DDoS mitigation provider at the time — had ever seen.\n\n[The attack continued for several days, prompting Akamai to force my site off of their network](https://krebsonsecurity.com/2016/09/the-democratization-of-censorship/)\n(they were providing the service pro bono, and the attack was starting to cause real\nproblems for their paying customers). For several frustrating days this Web site went dark,\nuntil it was brought under the auspices of Google’s [Project Shield, a program that protects](https://projectshield.withgoogle.com/public/)\njournalists, dissidents and others who might face withering DDoS attacks and other forms of\ndigital censorship because of their publications.\n\nAt the end of September 2016, just days after the attack on this site, the authors of Mirai —\nwho collectively used the nickname “Anna Senpai” — released the source code for their\nbotnet. Within days of its release there were multiple Mirai botnets all competing for the\nsame pool of vulnerable IoT devices.\n\n\n-----\n\nThe Hackforums post that includes links to the Mirai source code.\n\nSome of those Mirai botnets grew quite large and were used to launch hugely damaging\n[attacks, including the Oct. 21, 2016 assault against Internet infrastructure firm Dyn that](https://krebsonsecurity.com/2016/10/ddos-on-dyn-impacts-twitter-spotify-reddit/)\ndisrupted Twitter, Netflix, Reddit and a host of other sites for much of that day.\n\nA depiction of the outages caused by the Mirai attacks on Dyn, an Internet infrastructure company.\n\nSource: Downdetector.com.\n\nThe leak of the Mirai source code led to the creation of dozens of copycat Mirai botnets, all of\nwhich were competing to commandeer the same finite number of vulnerable IoT devices.\nOne particularly disruptive Mirai variant was used in extortion attacks against a number of\nbanks and Internet service providers in the United Kingdom and Germany.\n\n[In July 2017, KrebsOnSecurity published a story following digital clues that pointed to a U.K.](https://krebsonsecurity.com/2017/07/who-is-the-govrat-author-and-mirai-botmaster-bestbuy/)\nman named Daniel Kaye as the apparent perpetrator of those Mirai attacks. Kaye, who went\nby the hacker nickname “Bestbuy,” was [found guilty in Germany of launching failed Mirai](https://krebsonsecurity.com/2017/07/suspended-sentence-for-mirai-botmaster-daniel-kaye/)\n\n\n-----\n\nattacks that nevertheless knocked out Internet service for almost a million Deutsche Telekom\ncustomers, for which he was given a suspended sentence. Kaye is now on trial in the U.K.\nfor allegedly extorting banks in exchange for calling off targeted DDoS attacks against them.\n\nNot long after the Mirai source code was leaked, I began scouring cybercrime forums and\ninterviewing people to see if there were any clues that might point to the real-life identities of\nMirai’s creators.\n\nOn Jan 18, 2017, KrebsOnSecurity published the results of that four-month inquiry, Who is\nAnna Senpai, the Mirai Worm Author? The story is easily the longest in this site’s history, and\nit cited a bounty of clues pointing back to Jha and White — two of the men whose guilty\npleas were announced today.\n\nA tweet from the founder and CTO of French hosting firm OVH, stating the intended target of the\n\nSept. 2016 Mirai DDoS on his company.\n\nAccording to my reporting, Jha and White primarily used their botnet to target online gaming\nservers — particularly those tied to the hugely popular game Minecraft. Around the same\ntime as the attack on my site, French hosting provider OVH was hit with a much larger attack\nfrom the same Mirai botnet (see image above), and the CTO of OVH confirmed that the\ntarget of that attack was a Minecraft server hosted on his company’s network.\n\nMy January 2017 investigation also cited evidence and quotes from associates of Jha who\nsaid they suspected he was responsible for a series of DDoS attacks against Rutgers\n**University:During the same year that Jha began studying at the university for a bachelor’s**\ndegree in computer science, the school’s servers came under repeated, massive attacks\nfrom Mirai.\n\n\n-----\n\nWith each DDoS against Rutgers, the attacker — using the nicknames\n[“og_richard_stallman,” “exfocus” and “ogexfocus,” — would taunt the university in online](https://www.reddit.com/r/rutgers/comments/4qvc4g/ddos_on_rutgers/)\nposts and media interviews, encouraging the school to spend the money to purchase some\nkind of DDoS mitigation service.\n\nIt remains unclear if Jha (and possibly others) may face separate charges in New Jersey\nrelated to his apparent Mirai attacks on Rutgers. According to a sparsely-detailed press\nrelease issued Tuesday afternoon, the Justice Department is slated to hold a media\nconference at 2 p.m. today with officials from Alaska (where these cases originate) to\n“discuss significant cybercrime cases.”\n\n**Update: 11:43 a.m. ET:** _The New Jersey Star Ledger_ [just published a story confirming that](http://www.nj.com/education/2017/12/rutgers_student_charged_in_series_of_cyber_attacks.html#incart_river_mobile_home)\nJha also has pleaded guilty to the Rutgers DDoS attacks, as part of a separate case lodged\nby prosecutors in New Jersey.\n\n**PAYBACK**\n\nUnder the terms of his guilty plea in the click fraud conspiracy, Jha agreed to give up 13\nbitcoin, which at current market value of bitcoin (~$17,000 apiece) is nearly USD $225,000.\n\nJha will also waive all rights to appeal the conviction and whatever sentence gets imposed\nas a result of the plea. For the click fraud conspiracy charges, Jha, White and Norman each\nface up to five years in prison and a $250,000 fine.\n\nIn connection with their roles in creating and ultimately unleashing the Mirai botnet code, Jha\n[and White each pleaded guilty to one count of conspiracy to violate 18 U.S.C. 1030(a)(5)(A).](https://www.law.cornell.edu/uscode/text/18/1030)\nThat is, to “causing intentional damage to a protected computer, to knowingly causing the\ntransmission of a program, code, or command to a computer with the intention of impairing\nwithout authorization the integrity or availability of data, a program, system, or information.”\n\nFor the conspiracy charges related to their authorship and use of Mirai, Jha and White\nlikewise face up to five years in prison, a $250,000 fine, and three years of supervised\nrelease.\n\nThis is a developing story. Check back later in the day for updates from the DOJ press\nconference, and later in the week for a follow-up piece on some of the lesser-known details\nof these investigations.\n\nThe Justice Department unsealed the documents related to these cases late in the day on\nTuesday. Here they are:\n\n[Jha click fraud complaint (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/Jha1.pdf)\n\n[Jha click fraud plea (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/jhacf-plea.pdf)\n\n[Jha DDoS/Mirai complaint (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/Jha-DDoS.pdf)\n\n[Jha DDoS/Mirai plea (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/Jha-DDoS-Plea.pdf)\n\n\n-----\n\n[White DDoS complaint (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/JWhite-DDoS.pdf)\n[White DDoS/Mirai Plea (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/whiteddosplea.pdf)\n[Norman click fraud complaint (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/Norman-Clickfraud.pdf)\n[Norman click fraud plea (PDF)](https://krebsonsecurity.com/wp-content/uploads/2017/12/NormanPlea.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-13 - Mirai IoT Botnet Co-Authors Plead Guilty.pdf"
    ],
    "report_names": [
        "2017-12-13 - Mirai IoT Botnet Co-Authors Plead Guilty.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535734,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653710984,
    "ts_modification_date": 1653710984,
    "files": {
        "pdf": "https://archive.orkl.eu/80dc06d33074b75fa08e60b4c285aea8b7f1c504.pdf",
        "text": "https://archive.orkl.eu/80dc06d33074b75fa08e60b4c285aea8b7f1c504.txt",
        "img": "https://archive.orkl.eu/80dc06d33074b75fa08e60b4c285aea8b7f1c504.jpg"
    }
}