{
    "id": "5dcc9242-94b4-46c0-a22f-c5528a55eb20",
    "created_at": "2023-01-12T15:00:37.079091Z",
    "updated_at": "2025-03-27T02:16:25.745708Z",
    "deleted_at": null,
    "sha1_hash": "8bca32e231964af6104b13dd5d1685b9b70fdd79",
    "title": "2020-06-11 - Phishing Attacks from Earth Empusa Reveal ActionSpy",
    "authors": "",
    "file_creation_date": "2022-10-02T12:02:16Z",
    "file_modification_date": "2022-10-02T12:02:16Z",
    "file_size": 1609937,
    "plain_text": "# Phishing Attacks from Earth Empusa Reveal ActionSpy\n\n**[trendmicro.com/en_us/research/20/f/new-android-spyware-actionspy-revealed-via-phishing-attacks-from-earth-empusa.html](https://www.trendmicro.com/en_us/research/20/f/new-android-spyware-actionspy-revealed-via-phishing-attacks-from-earth-empusa.html)**\n\nJune 11, 2020\n\n[While tracking Earth Empura, also known as POISON CARP/Evil Eye, we identified an undocumented Android](https://citizenlab.ca/2019/09/poison-carp-tibetan-groups-targeted-with-1-click-mobile-exploits/)\nspyware we have named ActionSpy (detected by Trend Micro as AndroidOS_ActionSpy.HRX). During the first\nquarter of 2020, we observed Earth Empusa’s activity targeting users in Tibet and Turkey before they extended\ntheir scope to include Taiwan. The campaign is reportedly targeting victims related to Uyghurs by compromising\ntheir Android and iOS mobile devices. This group is known to use watering hole attacks, but we recently observed\nthem using phishing attacks to deliver their malware.\n\nThe malware that infects the mobile devices is found to be associated with a sequence of iOS exploit chain attacks\n[in the wild since 2016. In April 2020, we noticed a phishing page disguised as a download page of an Android](https://googleprojectzero.blogspot.com/2019/08/a-very-deep-dive-into-ios-exploit.html)\nvideo application that is popular in Tibet. The phishing page, which appears to have been copied from a third-party\nweb store, may have been created by Earth Empusa. This is based on the fact that one of the malicious scripts\ninjected on the page was hosted on a domain belonging to the group. Upon checking the Android application\ndownloaded from the page, we found ActionSpy.\n\n\n-----\n\n_Figure 1. The Earth Empusa attack chain_\n\nActionSpy, which may have been around since 2017, is an Android spyware that allows the attacker to collect\ninformation from the compromised devices. It also has a module designed for spying on instant messages by\n[abusing Android Accessibility and collecting chat logs from four different instant messaging applications.](https://developer.android.com/guide/topics/ui/accessibility)\n\n**Phishing attacks delivering ActionSpy**\n\n[Earth Empusa’s use of phishing pages is similar to our recent report on Operation Poisoned News, which also](https://www.trendmicro.com/en_us/research/20/c/operation-poisoned-news--hong-kong-users-targeted-with-mobile-ma.html)\nused web news pages as a lure to exploit mobile devices. Earth Empusa also used social engineering lures to trick\nits targets into visiting the phishing pages. We found some news web pages, which appear to have been copied\nfrom Uyghur-related news sites, hosted on their server in March 2020. All pages were injected with a script to load\n[the cross-site scripting framework BeEF. We suspect the attacker used the framework to deliver their malicious](https://beefproject.com/)\nscript when they found a targeted victim browsing the said sites. However, our investigation did not yield any script\nwhen we attempted to access said phishing pages. How these pages were distributed in the wild is also unclear.\n\n\n-----\n\n_Figure 2. A news page copied from the World Uyghur Congress website used for loading the BeEF framework_\n\nUpon continued investigation in late April 2020, we found another phishing page that appears to be copied from a\n[third-party web store and injected with two scripts to load ScanBox and BeEF frameworks. This phishing page](https://resources.infosecinstitute.com/scanbox-framework/)\ninvites users to download a video app that is known to Tibetan Android users. We believe the page was created by\nEarth Empusa because the BeEF framework was running on a domain that reportedly belongs to the group. The\ndownload link was modified to an archive file that contains an Android application. Analysis then revealed that the\napplication is an undocumented Android spyware we named ActionSpy.\n\n\n-----\n\n_Figures 3 and 4. Fake Android application download page (In original language and translated into English)_\n\n\n-----\n\n_Figure 5. The injection of ScanBox (above) and BeEF (below) on the phishing page shows overlap to Earth_\n_Empusa’s domain_\n\n**Breaking Down ActionSpy**\n\nThis malware impersonates a legitimate Uyghur video app called Ekran. The malicious app has the same\n[appearance and features as the original app. It is able to achieve this with VirtualApp. In addition, it’s also](https://github.com/asLody/VirtualApp)\n[protected by Bangcle to evade static analysis and detection.](https://dev.bangcle.com/)\n\n_Figure 6. ActionSpy’s icon (left) and appearance (right)_\n\n_Figure 7. ActionSpy is protected by Bangcle_\n\nA legitimate Ekran APK file is embedded in the ActionSpy assets directory, and installed in virtual environment after\nVirtualApp is ready when ActionSpy is launched the first time.\n\n\n-----\n\n_Figure 8 and 9. Install real “Ekran” (above) and launch it (below)_\n\nActionSpy’s configuration, including its C&C server address, is encrypted by DES. The decryption key is generated\nin native code. This makes static analysis difficult for ActionSpy.\n\nEvery 30 seconds, ActionSpy will collect basic device information like IMEI, phone number, manufacturer, battery\nstatus, etc., which it sends to the C&C server as a heartbeat request. The server may return some commands that\nwill be performed on the compromised device. All the communication traffic between C&C and ActionSpy is\nencrypted by RSA and transferred via HTTP.\n\n_Figure 10. Collected device information_\n\nActionSpy supports the following modules:\n\n\n-----\n\n**Module Name** **Description**\n\nlocation Get device location latitude and longitude\n\ngeo Get geographic area like province, city, district, street address\n\ncontacts Get contacts info\n\ncalling Get call logs\n\nsms Get SMS messages\n\nnettrace Get browser bookmarks\n\nsoftware Get installed APP info\n\nprocess Get running processes info\n\nwifi connect Make device connect to a specific Wi-Fi hotspot\n\nwifi disconnect Make the device disconnect to Wi-Fi\n\nwifi list Get all available Wi-Fi hotspots info\n\ndir Collect specific types of file list on SDCard, like txt, jpg, mp4, doc, xls...\n\nfile Upload files from device to C&C server\n\nvoice Record the environment\n\ncamera Take photos with camera\n\nscreen Take screenshot\n\nwechat Get the structure of WeChat directory\n\nwxfile Get files that received or sent from WeChat\n\nwxrecord Get chat logs of WeChat, QQ, WhatsApp, and Viber\n\n**Abuse of Accessibility**\n\nNormally, a third-party app can’t access files belonging to others on Android. This makes it difficult for ActionSpy to\nsteal chat log files from messaging apps like WeChat directly without root permission. ActionSpy, in turn, adopts an\nindirect approach: it prompts users to turn on its Accessibility service and claims that it is a memory garbage\ncleaning service.\n\n\n-----\n\n_Figure 11. Prompt to turn on Accessibility_\n\nOnce the user enables the Accessibility service, ActionSpy will monitor Accessibility events on the device. This\n[occurs when something “notable” happens in the user interface (such as clicked buttons, entered text, or changed](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent)\n[views). When an Accessibility Event is received, ActionSpy checks if the event type is VIEW_SCROLLED or](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent#TYPE_VIEW_SCROLLED)\n[WINDOW_CONTENT_CHANGED and then check if the events came from targeted apps like WeChat, QQ,](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent#TYPE_WINDOW_CONTENT_CHANGED)\nWhatsApp, and Viber. If all the above conditions are met, ActionSpy parses the current activity contents and\nextracts information like nicknames, chat contents, and chat time. All the chat information is formatted and stored\ninto a local SQLite Database. Once a “wxrecord” command is pushed, ActionSpy will gather chat logs in the\ndatabase and convert them into JSON format before sending it to its C&C server.\n\n_Figure 12. Code snippet of parsing chat information_\n\nWe believe ActionSpy has existed for at least three years, based on its certificate sign time (2017-07-10). We also\nsourced some old ActionSpy versions that were created in 2017.\n\n_Figure 13. Certificate info_\n\n\n-----\n\n_Figure 14. The earlier version (created in 2017)_\n\n**More on Earth Empusa: Watering hole attacks to compromise iOS systems**\n\nEarth Empusa also employs watering hole attacks to compromise iOS devices. The group injected their malicious\nscripts on websites that their targets could potentially visit and load the injected script from it. We found two kinds\nof attacks they injected into compromised websites:\n\nOne injection we found is the ScanBox framework. The framework can collect information from a website’s\nvisitors by using JavaScript to record keypresses and harvest the profiles of the OS, browser, and browser\nplugins from the client environment. The framework is usually used during the reconnaissance stage,\nallowing them to understand their targets and prepare for the next stage of the attack.\nAnother injection is their exploit chain framework, which exploits the vulnerabilities on the iOS devices. When\na victim accesses the framework, it checks the User-Agent header of the HTTP request to determine the iOS\nversion on the victim’s device and reply with a corresponding exploit code. If the User-Agent doesn’t belong\nto any of the targeted iOS versions, the framework will not deliver any additional payload.\n\n_Figure 15. An example of iOS exploit chain traffic_\n\nIn the first quarter of 2020, the exploit chain framework was upgraded to include a newer iOS exploit that can\n[compromise iOS versions 12.3, 12.3.1, and 12.3.2. Other researchers have also published details of this updated](https://www.volexity.com/blog/2020/04/21/evil-eye-threat-actor-resurfaces-with-ios-exploit-and-updated-implant/)\nexploit.\n\n\n-----\n\n_Figure 16. The script for determining the iOS version and launching the exploit code_\n\nWe have observed these injections on multiple Uyghur-related sites since the start of 2020. In addition, we have\nalso identified a news website and political party website in Turkey that have been compromised and injected with\nthe same attack. In a more recent development, we found the same injection on a university website as well as a\ntravel agency site based in Taiwan in March 2020. These developments have led as to believe that Earth Empusa\nis widening the scope of their targets.\n\n**Best practices and solutions**\n\nEarth Empusa is still very active in the wild. We are constantly tracking and monitoring the threat group as it\ncontinues to develop new ways to attack its targets.\n\niOS users are advised to keep their devices updated. Android users, on the other hand, are encouraged to install\napps only from trusted places such as Google Play to avoid malicious apps.\n\n[Users can also install security solutions, such as the Trend Micro™ Mobile Security, that can block malicious apps.](https://www.trendmicro.com/en_us/forHome/products/mobile-security.html)\nEnd users can also benefit from their multilayered security capabilities that secure the device owner’s data and\nprivacy, and features that protect them from ransomware, fraudulent websites, and identity theft.\n\n[For organizations, the Trend Micro™ Mobile Security for Enterprise suite provides device, compliance and](https://www.trendmicro.com/en_us/business/products/user-protection/sps/mobile.html)\napplication management, data protection, and configuration provisioning. The suite also protects devices from\nattacks that exploit vulnerabilities, prevents unauthorized access to apps and detects and blocks malware and\n[fraudulent websites. Trend Micro’s Mobile App Reputation Service (MARS) covers Android and iOS threats using](https://mars.trendmicro.com/)\n[leading sandbox and machine learning technologies to protect users against malware, zero-day and known](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/machine-learning)\nexploits, privacy leaks, and application vulnerability.\n\n**Indicators of Compromise**\n\nAll of the malicious apps below are detected as AndroidOS_ActionSpy.HRX.\n\n**SHA256** **Package Name** **Label**\n\n56a2562426e504f42ad9aa2bd53445d8e299935c817805b0d9b9431521769271 com.omn.vvi Ekran\n\nb6e2fdbf022cd009585f62a3de71464014edd58125eb7bc15c2c670d6d5d3590 com.isyjv.klxblnwc.r 系统优化\n\nde6065c63f05f8cddaec2f43a3789cca7d8e16221bd04bf3ce8092809b146ebe com.isyjv.klxblnwc.r 系统优化\n\n\n-----\n\n2117e2252fe268136a2833202d746d67bf592de819cc1600ac8d9f2738d8d4d6 com.isyjv.klxblnwc Service\nRuntime\nLibrary\n\n588b62a2e0bffa8935cd08ae46255a972b0af4966483967a3046a5df59d38406 com.isyjv.klxblnwc Service\nRuntime\nLibrary\n\nd6478b4b7f0ea38947d894b1a87baf4bed7a1ece934fff9dfc233610de232814 com.isyjv.klxblnwc Service\nRuntime\nLibrary\n\n8d0a123e0fe91637fb41d9d9650a4b9c75b6ce77a2b51ac36f05a337da7afd80 com.ecs.esap Service\nRuntime\nLibrary\n\n9bc16f635fde4ff0b6b02b445a706d885779611b7813c5607ab88fdff43fcc2f com.cd.weixin VWechat\n\n334dbd15289aaeaf3763f1702003de52ff709515246902f51ee87a41467a8e55 com.android.dmp.rec Recording\n\n50c10ab93910a6e617c85a03f8c38a10a7c363e2d37b745964e696da8f98a93d com.android.dmp.rec Recording\n\n6575eeda2a8f76170fb6034944eeda5c88dac8009edccc880124fa729dd3c1fd com.android.dmp.l Location\n\neff30f6cc2d5d04ce4aef0c50f1fb375fb817a803bf3e8e08c847f04658185ba com.android.dmp.l Location\n\na0a48d7e0762ab24b2ec3ec488b011db866992db5392926fe43dd3d1c398e30d com.android.dmp.cm Camera\n\n088769a80b39d0da26c676a5a52eaccdb805dc67cba85e562785c375c642b501 com.android.dmp.c Core\n\n87306b59aaaba0ea92ea6a05feb9366eeb625e8da08ed3ef6c86a5cf394fada5 com.android.dmp.c Core\n\n**Indicator** **Type**\n\ngotossl.ml Domain used by Earth Empusa\n\ngoforssl.top Domain used by Earth Empusa\n\ngeo2ipapi.org Domain used by Earth Empusa\n\nappbuliki.com Domain used by Earth Empusa\n\numutyole.com Domain used by Earth Empusa\n\nt.freenunn.com Domain used by Earth Empusa\n\nstart.apiforssl.com Domain used by Earth Empusa\n\nbloomberg.com.cm Domain used by Earth Empusa\n\nstatic.apiforssl.com Domain used by Earth Empusa\n\ncdn.doublesclick.me Domain used by Earth Empusa\n\nstatic.doublesclick.info Domain used by Earth Empusa\n\nstatus.search-sslkey-flush.com Domain used by Earth Empusa\n\nhttp://114.215.41.93/ ActionSpy C&C URL\n\nhttp://static.doubles.click:8082/ ActionSpy C&C URL\n\nMITRE ATT&CK Techniques\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-11 - Phishing Attacks from Earth Empusa Reveal ActionSpy.pdf"
    ],
    "report_names": [
        "2020-06-11 - Phishing Attacks from Earth Empusa Reveal ActionSpy.pdf"
    ],
    "threat_actors": [
        {
            "id": "f0ebaf6d-5e1a-4ed7-aa2c-0e69a648acea",
            "created_at": "2022-10-25T16:07:23.597455Z",
            "updated_at": "2025-03-27T02:02:09.881507Z",
            "deleted_at": null,
            "main_name": "Evil Eye",
            "aliases": [],
            "source_name": "ETDA:Evil Eye",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "741d58a1-0fc0-41a8-9681-106a06c07e61",
            "created_at": "2022-10-25T16:07:23.983046Z",
            "updated_at": "2025-03-27T02:02:10.062384Z",
            "deleted_at": null,
            "main_name": "Operation Poisoned News",
            "aliases": [
                "Operation Poisoned News",
                "TwoSail Junk"
            ],
            "source_name": "ETDA:Operation Poisoned News",
            "tools": [
                "dmsSpy",
                "lightSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3703894e-cf68-4c1e-a71a-e8fd2ef76747",
            "created_at": "2023-11-08T02:00:07.166789Z",
            "updated_at": "2025-03-27T02:00:03.205354Z",
            "deleted_at": null,
            "main_name": "TwoSail Junk",
            "aliases": [
                "Operation Poisoned News"
            ],
            "source_name": "MISPGALAXY:TwoSail Junk",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2a5c949-7ae0-4610-8bb8-047ab03b1574",
            "created_at": "2022-10-25T16:07:24.064197Z",
            "updated_at": "2025-03-27T02:02:10.096487Z",
            "deleted_at": null,
            "main_name": "Poison Carp",
            "aliases": [
                "Earth Empusa",
                "Evil Eye",
                "EvilBamboo",
                "Poison Carp",
                "Red Dev 16"
            ],
            "source_name": "ETDA:Poison Carp",
            "tools": [
                "ActionSpy",
                "AxeSpy",
                "BADSIGNAL",
                "BADSOLAR",
                "BadBazaar",
                "IRONSQUIRREL",
                "IceCube",
                "MOONSHINE",
                "PoisonCarp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "52973e5f-9656-4b60-b7f8-457e32ac4bbe",
            "created_at": "2023-01-06T13:46:39.056888Z",
            "updated_at": "2025-03-27T02:00:02.986693Z",
            "deleted_at": null,
            "main_name": "POISON CARP",
            "aliases": [
                "Evil Eye",
                "Red Dev 16",
                "Earth Empusa"
            ],
            "source_name": "MISPGALAXY:POISON CARP",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535637,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1664712136,
    "ts_modification_date": 1664712136,
    "files": {
        "pdf": "https://archive.orkl.eu/8bca32e231964af6104b13dd5d1685b9b70fdd79.pdf",
        "text": "https://archive.orkl.eu/8bca32e231964af6104b13dd5d1685b9b70fdd79.txt",
        "img": "https://archive.orkl.eu/8bca32e231964af6104b13dd5d1685b9b70fdd79.jpg"
    }
}