{
    "id": "5dd40786-c37c-48cc-b355-9e3cbfeed5e2",
    "created_at": "2023-01-12T14:59:13.695885Z",
    "updated_at": "2025-03-27T02:05:40.812887Z",
    "deleted_at": null,
    "sha1_hash": "91c003ec7350306df04a2cd54dbf6795b157b017",
    "title": "2020-12-14 - FireEye Sunburst KQL Detections",
    "authors": "",
    "file_creation_date": "2022-05-28T02:29:36Z",
    "file_modification_date": "2022-05-28T02:29:36Z",
    "file_size": 88743,
    "plain_text": "# olafhartong/sunburst_countermeasures.md\n\n**[gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f](https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f)**\n\n## FireEye Sunburst KQL Detections\n\n### FireEye released a very interesting article regarding a third-party compromise of Solarwinds, the detections that are possible in Defender for Endpoint are listed below\n\n Blog post\n\n All FireEye detections\n```\n    DeviceEvents\n    | where ActionType contains \"ExploitGuardNonMicrosoftSignedBlocked\"\n    | where InitiatingProcessFileName contains \"svchost.exe\" and FileName\n    contains \"NetSetupSvc.dll\"\n    let\n    SunburstMD5=dynamic([\"b91ce2fa41029f6955bff20079468448\",\"02af7cec58b9a5da1\n    let SupernovaMD5=\"56ceb6d0011d87b6e4d7023d7ef85676\";\n    DeviceFileEvents\n    | where MD5 in(SunburstMD5) or MD5 in(SupernovaMD5)\n\n```\n\n-----\n\n```\n    let\n    SunburstURL=dynamic([\"panhardware.com\",\"databasegalore.com\",\"avsvmcloud.co\n    DeviceNetworkEvents\n    | where ActionType == \"ConnectionSuccess\" \n    | where RemoteUrl in(SunburstURL)\n    DeviceProcessEvents\n    | where InitiatingProcessFileName =~ \"solarwinds.businesslayerhost.exe\"\n    | where not(FolderPath endswith\n    @\"\\SolarWinds\\Orion\\APM\\APMServiceControl.exe\" \n             or FolderPath endswith\n    @\"\\SolarWinds\\Orion\\ExportToPDFCmd.Exe\"\n             or FolderPath endswith\n    @\"\\SolarWinds.Credentials\\SolarWinds.Credentials.Orion.WebApi.exe\"\n             or FolderPath endswith\n    @\"\\SolarWinds\\Orion\\Topology\\SolarWinds.Orion.Topology.Calculator.exe\"\n             or FolderPath endswith @\"\\SolarWinds\\Orion\\Database    Maint.exe\"\n             or FolderPath endswith\n    @\"\\SolarWinds.Orion.ApiPoller.Service\\SolarWinds.Orion.ApiPoller.Service.e\n             or FolderPath endswith @\"\\Windows\\SysWOW64\\WerFault.exe\"\n             )\n    DeviceFileEvents\n    | where InitiatingProcessFileName =~ \"solarwinds.businesslayerhost.exe\"\n    | where FileName endswith \"exe\" or FileName endswith \"dll\" or FileName\n    endswith \"ps1\" or FileName endswith \"jpg\" or FileName endswith \"png\"\n\n### Copy link\n\n## fouapon commented May 26, 2021 •\n edited\n\n### the rule on DeviceProcessEvents table triggered an alert for the FolderPath \"C:\\Windows\\SysWOW64\\ARP.EXE\"\n Could you confirm that this is not a suspicious activity?\n Thanks\n\n Sign up for free to join this conversation on GitHub. Already have an account? Sign in to comment\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-14 - FireEye Sunburst KQL Detections.pdf"
    ],
    "report_names": [
        "2020-12-14 - FireEye Sunburst KQL Detections.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535553,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653704976,
    "ts_modification_date": 1653704976,
    "files": {
        "pdf": "https://archive.orkl.eu/91c003ec7350306df04a2cd54dbf6795b157b017.pdf",
        "text": "https://archive.orkl.eu/91c003ec7350306df04a2cd54dbf6795b157b017.txt",
        "img": "https://archive.orkl.eu/91c003ec7350306df04a2cd54dbf6795b157b017.jpg"
    }
}