{
    "id": "5ddbb6a5-f7dd-4f16-8054-da7c3d886827",
    "created_at": "2023-01-12T15:01:15.56289Z",
    "updated_at": "2025-03-27T02:16:26.160067Z",
    "deleted_at": null,
    "sha1_hash": "d16d1a59a4c9d19aa30f4c7150a9e6555dd2a73b",
    "title": "2021-07-08 - Inside the FBI, Russia, and Ukraine’s failed cybercrime investigation",
    "authors": "",
    "file_creation_date": "2022-05-28T17:07:13Z",
    "file_modification_date": "2022-05-28T17:07:13Z",
    "file_size": 5062542,
    "plain_text": "# Inside the FBI, Russia, and Ukraine’s failed cybercrime investigation\n\n**[technologyreview.com/2021/07/08/1027999/fbi-russia-ukraine-cybercrime-investigation-ransomware/](https://www.technologyreview.com/2021/07/08/1027999/fbi-russia-ukraine-cybercrime-investigation-ransomware/)**\n\nPatrick Howell O'Neill\n\nThe American cops took the slower, cheaper train from Kyiv to Donetsk.\n\nAfter repeatedly traveling between Ukraine and the United States, there were more\ncomfortable ways to make this final, 400-mile journey. But the five FBI agents felt like luxury\ntourists compared to most travelers onboard. They could afford spacious private rooms while\nlocals were sleeping 10 to a cabin. The train moved haltingly, past empty country and\nvillages that, to the Americans at least, looked as if they’d been frozen in the Cold War.\n\nThe overnight trek was set to take 12 hours, but it had truly begun two years earlier, in 2008,\nat the FBI offices in Omaha, Nebraska. That’s where the agents had started trying to\nunderstand a cybercrime explosion that was targeting Americans and pulling in millions of\ndollars from victims. At that point, with at least $79 million stolen, it was by far the biggest\ncybercrime case the FBI had ever seen. Even today, there are few to match its scale.\n\nBit by bit, the American investigators began to sketch a picture of the culprits. Soon\nOperation Trident Breach, as they called it, homed in on a highly advanced organized-crime\noperation that was based in Eastern Europe but had global reach. As evidence came in from\naround the world, the Bureau and its international partners slowly put names and faces to the\ngang and started plotting the next step.\n\n\n-----\n\nAs the train made its way across Ukraine, Jim Craig, who was leading his very first case with\nthe FBI, couldn’t sleep. He passed the time moving between his cabin and the drinks car, a\nbaroque affair with velvet curtains. Craig stayed awake for the entire trip, staring out the\nwindow into the darkness as the country passed by.\n\nFor more than a year, Craig had traveled all over Ukraine to build a relationship between the\nAmerican, Ukrainian, and Russian governments. It had been an unprecedented effort to work\ntogether and knock down the rapidly metastasizing cybercrime underworld. US agents\nexchanged intelligence with their Ukrainian and Russian counterparts, they drank together,\nand they planned a sweeping international law enforcement action.\n\nThat moment of unity is worth remembering today.\n\nIt would be a wild understatement to say that in the decade since Craig took that trip to\nUkraine, cybercrime has grown dramatically. Last month, Joe Biden and Vladimir Putin made\n[the ransomware crisis—which has struck governments,](https://www.technologyreview.com/2019/08/20/133619/ransomware-hackers-hit-nearly-two-dozen-texas-cities/) [hospitals, and even a major](https://www.technologyreview.com/2020/10/29/1011436/a-wave-of-ransomware-hits-us-hospitals-as-coronavirus-spikes/)\nAmerican oil pipeline—a centerpiece of their first face-to-face summit. Now that critical\ninfrastructure is being hit, the Americans are calling on Moscow to control the criminals within\nRussia’s borders. During that meeting, in response to new pressure from Washington, Putin\ntalked to Biden about doing more to track down cybercriminals.\n\n“Criminal activity rising to the level of international summits shows you the degree to which\nthe threat has grown,” says Michael Daniel, the former White House cybersecurity\ncoordinator for Barack Obama. “It also shows that the current international situation is not at\nequilibrium. It’s not sustainable.”\n\nDays later, the head of Russia’s FSB intelligence agency said the country would work with\nthe United States to find and prosecute cybercriminals. Inside the White House, top\nAmerican officials are figuring out what to do next. Some are deeply skeptical and think that\nMoscow would rather turn requests for help on cybercrime into recruiting opportunities than\naid an American investigation.\n\nTo begin to understand why they are so concerned, we have to go back to the investigation\nthat put Jim Craig on that train in Ukraine in 2010, and to the case that had him meeting\nRussian agents and planning raids in Moscow and other cities across multiple countries.\n\nThe operation was a unique chance to disrupt one of the world’s most successful cybercrime\ngangs. It was an opportunity to put away some of the most important operators in the vast\nunderground hacking economy operating in Russia and Ukraine. It was so important, in fact,\nthat the agents began referring to September 29, 2010—the day of planned coordinated\npolice raids in Ukraine, Russia, the United Kingdom, and the United States—as D-Day.\n\nThat was also the day when things went sideways.\n\n### Larger than life\n\n\n-----\n\nOperation Trident Breach had dozens of targets worldwide. Three men were at the top of the\nlist.\n\nFirst was Evgeniy Bogachev, a prolific hacker known as “Slavik.” A Russian with a\ncontradictory taste for anonymity and outrageous luxury, he wrote a piece of malware called\nZeus. It infected computers with the goal of silently opening the door to people’s bank\naccounts. And it was a hit: simple, stealthy, effective, regularly updated, able to compromise\nall sorts of targets, and flexible enough to fit into any kind of cybercrime operation.\n\nThe investigation detailed how Bogachev had used Zeus to build an opaque cybercriminal\nempire with the kind of precision and ambition that felt more characteristic of a multinational\ncorporation.\n\nSecond on Trident Breach’s list was one of Bogachev’s most important customers,\nVyacheslav Penchukov. A Ukrainian known online as “Tank,” he ran his own criminal hacking\ncrew using the Zeus malware, purchasing it from Bogachev for thousands of dollars per copy\nand raking in millions in profit. He’d assembled a crew that used a particularly tasty flavor of\nthe program that integrated with the instant messaging software Jabber. It gave the hackers\ninstant updates on their efforts: when an infection occurred, clients got a message and then\nmoved the money as desired—as easy as that.\n\n## Related Story\n\n\n-----\n\n[Recovering from the SolarWinds hack could take 18 months](https://www.technologyreview.com/2021/03/02/1020166/solarwinds-brandon-wales-hack-recovery-18-months/)\n\nThe head of the agency leading US efforts to fix a Russian hacking attack says rebuilding will\ntake a very long time.\n\nThe third target was Maksim Yakubets, a Russian known as “Aqua,” who orchestrated a\nmassive laundering operation. Using thousands of accomplices and front companies, he\nmoved money stolen from hacked bank accounts back to Eastern Europe.\n\nTank’s crew ran out of Donetsk, a city of nearly a million people in southeast Ukraine. They\nwould use Zeus to drain bank accounts and send the money to mules in the target countries,\nincluding the United States—who would then wire the proceeds to Ukraine.\n\nThe rise of this kind of professional operation, combining the nimble smarts of tech startups\nand the callousness of organized crime, might seem to have been inevitable. Today, the\nransomware business makes headlines daily, and its hacker entrepreneurs rely on a whole\nsub-industry of white-glove criminal services. But in the mid-2000s, organizations like this\nwere extremely unusual: the Zeus crew was a pioneer.\n\nTank was so closely involved in directing the inner workings of the scheme that for a time,\nthe FBI thought he was in charge. It eventually became clear, however, that Tank was\nSlavik’s VIP customer—and apparently the only one who talked personally to Bogachev\n\n\n-----\n\nhimself.\n\nTank “would always be the first person to receive alerts,” says Jason Passwaters, a former\nFBI contractor who worked for years in both the US and Europe on the case. “Somebody\nwould get popped, and it would be a particularly juicy one. He’d be the first to go into the\nbank account, say ‘We’ve got a good one,’ and then he’d pass it along to others to do the\nmore manual work.”\n\nTank was no enigma to the feds. He had a family that was growing increasingly used to\nwealth and a very public side hustle as “DJ Slava Rich,” playing sweaty midnight raves\ndrenched in neon lights. The agents hoped that the confidence to live so large would be his\ndownfall.\n\n### Vodka diplomacy\n\nTo catch Tank, the FBI needed to expand its reach. The criminal operation they were\ntargeting spanned the globe: there were victims and money mules in the United States and\nEurope, and the attacks were directed by kingpins and hackers across Ukraine and Russia.\nThe FBI needed help from their counterparts in those two countries.\n\nSecuring those partnerships wasn’t easy. When Craig arrived in Kyiv, he was told that\nRussian FSB agents hadn’t set foot inside Ukraine since the Orange Revolution of 2004,\nwhen anticorruption protests reversed the country’s fraudulent presidential election results.\nBut now he needed everyone in the same room.\n\nTheir inaugural in-person meeting took place at the boutique Opera Hotel in Kyiv. The\nconversations were tentative, mutual trust was low, and expectations were even lower. To\nCraig’s surprise, though, the four Russian agents who came were friendly and encouraging.\nThey said they wanted to exchange information on hackers of interest and even offered to\nbring FBI agents into Russia to get a closer look at suspects.\n\nThe Americans explained that the driving engine of their investigation was a Jabber chat\nserver they had located and started watching in 2009. It gave them a peek into the Zeus\ncrew’s communications; details about operations and business deals appeared next to\npersonal chatter about toys and expensive vacations that the crew had bought with the\nproceeds of their crimes.\n\nPasswaters saw a message he'd never forget. Another hacker had written to Tank:\n\"You guys are fucked. The FBI is watching. I've seen the logs.\"\n\nPasswaters—now a cofounder and executive at the American cybersecurity firm Intel 471,\nwhere Craig also works—says it was practically a full-time job to review the chat logs and\nshare the information with the FSB and the SBU, Ukraine’s chief security and intelligence\nservice.\n\n\n-----\n\nIn April 2010, as he was sifting through the data, Passwaters saw a message he d never\nforget. Another hacker had written to Tank: “You guys are fucked. The FBI is watching. I’ve\nseen the logs.”\n\nPasswaters knew the logs in question were the ones he was reading at that exact moment—\nand that their existence was known only to a handful of agents. Somehow, they had been\nleaked. The agents suspected Ukrainian corruption.\n\n“What was obvious was that someone within the unit privy to key details of the case had\npassed information on to the very cybercriminals that were being investigated,” says one\nformer SBU officer, who spoke to MIT Technology Review on the condition of anonymity.\n“Even the terminology used in their conversation was uncommon for cybercriminals and\nappeared to have come straight from a case file.\"\n\nTank’s initial reaction was fear, especially at the possibility of being sent to the United States.\nBut Passwaters remembers that the person who tipped Tank off then tried to calm him in\nanother message: “This is the life we chose. Live by the sword, die by the sword.\"\n\nTank’s next reaction was strange. Instead of immediately burning the server and moving\noperations elsewhere, as the FBI expected, he and his crew changed their nicknames but\ncontinued to use the compromised system for another month. Eventually, the server went\ndark. But by then, the investigation seemed to have gained unstoppable momentum.\n\n\"This is the life we chose. Live by the sword, die by the sword.\"\n\nIn June 2010, about 20 officers from multiple countries met in the woods outside Kyiv at an\noutrageously opulent residence owned by SBU director Valeriy Khoroshkovsky. The house\nwas often used by the agency to entertain its most important visitors. Everyone gathered in a\nlavish conference room to plan the particulars of D-Day. They discussed the suspects in\ndetail, went over the roles each agency would play, and traded information about the\noperation’s targets.\n\nAfter a day of planning, the drinks started to flow. The group sat down to a multicourse dinner\nserved with wine and vodka. No matter how much they drank, their glasses stayed full. Each\nperson was obligated to give a toast during the marathon event. After the festivities, the SBU\nofficers took their counterparts on a tour of the city. The Americans don’t remember much\nabout what they saw.\n\nThe next morning, despite the vodka ringing in their ears, the overall plan was clear enough.\nOn September 29, police from five countries—the US, the UK, Ukraine, Russia, and the\nNetherlands—would simultaneously arrest dozens of suspects in an operation that promised\nto outshine all cybercrime investigations before it.\n\n### Headaches\n\n\n-----\n\nThe air was dark and malignant when Agent Craig and his team arrived in Donetsk on the\ntrain. Nearby, coal plants were burning, identifiable by the mark their smoke left on the sky.\nAs the agents drove to the upscale Donbass Palace Hotel, Craig thought of the Russian\nborder, just an hour away.\n\nHis mind turned to the Jabber Zeus victims he had met back in America. A woman in Illinois\nhad her bank account drained while her husband was on life support; a small business in\nSeattle had lost all its money and shut its doors; a Catholic diocese in Chicago got hit, and a\nbank account operated by nuns was emptied. No one was spared.\n\nWhen they arrived at their hotel, there was no time to rest. The Americans waited for the\nSBU—which was now in charge, since the operation was taking place in its own backyard—\nto give the green light.\n\nBut nothing happened. The Ukrainians pushed the date back again and again. The\nAmericans started to wonder what was causing the delays. Was it the kind of dysfunction\nthat can strike any complex law enforcement investigation, or was it something more\nworrying?\n\n“We were supposed to be down there for two days,” says Craig. “We were down there for\nweeks. They kept delaying, delaying, delaying.”\n\nThe SBU said agents were trailing Tank around the city, watching closely as he moved\nbetween nightclubs and his apartment. Then, in early October, the Ukrainian surveillance\nteam said they’d lost him.\n\nThe Americans were unhappy, and a little surprised. But they were also resigned to what\nthey saw as the realities of working in Ukraine. The country had a notorious corruption\nproblem. The running joke was that it was easy to find the SBU’s anticorruption unit—just\nlook for the parking lot full of BMWs.\n\nAlthough Tank was no longer in their sights, the Ukrainians were still tracking five of his\nlieutenants. The local police seemed ready to change gears. The SBU suddenly gave the\ngreen light, and the raids began.\n\n### Knock knock\n\nIt was the dead of night when Craig’s team made its first stop at the apartment of Ivan\nKlepikov, known as “petr0vich.” He was the crew’s systems administrator, handling technical\nduties behind the scenes—mundane but critical work that kept the criminal operation\nrunning.\n\nThe SBU’s heavily armed SWAT team breached Klepikov’s door but kept the unarmed\nAmericans waiting outside the apartment. When Craig finally got inside, Klepikov was sitting\ncomfortably in the living room in his underwear and a smoking jacket. The Ukrainians asked\n\n\n-----\n\nCraig to introduce himself. The implied threat was that the cops might send Klepikov to the\nUnited States, which has much harsher criminal sentencing laws than most of the world. But\nthe Ukrainian constitution forbids extradition of citizens. Klepikov’s wife, meanwhile, held\ntheir baby in the kitchen and laughed as she spoke with other officers on the raid. Klepikov\nwas taken into custody by police.\n\nNext, the operation moved on to Tank’s apartment. The same pattern took place: SBU\nofficers went inside first, while the FBI agents waited outside. Once Craig was allowed in,\nTank was missing and the apartment looked unnaturally clean—as though a maid had just\nbeen through, he thought. “It was quite obvious no one had been there for a few days,” Craig\nsays.\n\n## Related Story\n\n[How China turned a prize-winning iPhone hack against the Uyghurs](https://www.technologyreview.com/2021/05/06/1024621/china-apple-spy-uyghur-hacker-tianfu/)\n\nAn attack that targeted Apple devices was used to spy on China’s Muslim minority—and US\nofficials claim it was developed at the country’s top hacking competition.\n\nHe thought back to reports from just a few hours earlier, when the Ukrainian surveillance\nteam said they were tracking Tank and had intelligence that the suspect had been at home\nrecently. None of it seemed believable.\n\nFive individuals were detained in Ukraine on that night, but when it came to Tank, who police\nalleged was in charge of the operation, they left empty-handed. And none of the five people\narrested in Ukraine stayed in custody for long.\n\nSomehow, the operation in Ukraine—a two-year international effort to catch the biggest\ncybercriminals on the FBI’s radar—had gone sideways. Tank had slipped away while under\nSBU surveillance, while the other major players deftly avoided serious consequences for\ntheir crimes. Craig and his team were livid.\n\nBut if the situation in Ukraine was frustrating, things were even worse in Russia, where the\nFBI had no one on the ground. Trust between the Americans and Russians had never been\nvery strong. Early in the investigation, the Russians had waved the FBI off Slavik’s identity.\n\n“They try to push you off target,” Craig says. “But we play those games knowing what’s going\nto happen. We’re very loose with what we send them anyway, and even if you know\nsomething, you try to push it to them to see if they’ll cooperate. And when they don’t—oh, no\nsurprise.”\n\nA maddening mixture of corruption, rivalry, and stonewalling had left Operation Trident\nBreach without its top targets.\n\n\n-----\n\nEven so, while the raids happened in Donetsk, the Americans hoped they would get a call\nfrom Russia about an FSB raid on the residence of Aqua, the money launderer Maksim\nYakubets. Instead, there was silence.\n\nThe operation had its successes—dozens of lower-level operators were arrested across\nUkraine, the United States, and the United Kingdom, including some of Tank’s personal\n[friends who helped move stolen money out of England. But a maddening mixture of](https://www.bbc.com/news/uk-england-london-15542016)\ncorruption, rivalry, and stonewalling had left Operation Trident Breach without its top targets.\n\n“It came down to D-Day, and we got ghosted,” Craig says. “The SBU tried to communicate\nwith [the Russians]. The FBI was making phone calls to the embassy in Moscow. It was\ncomplete silence. We ended up doing the operation anyway, without the FSB. It was months\nof silence. Nothing.”\n\n### Well-connected criminals\n\nNot everyone in the SBU drives a BMW.\n\nAfter the raids, some Ukrainian officials, who were unhappy with the corruption and leaks\nhappening within the country’s security services, concluded that the 2010 Donetsk raid\nagainst Tank and the Jabber Zeus crew failed because of a tip from a corrupt SBU officer\nnamed Alexander Khodakovsky.\n\nAt the time, Khodakovsky was the chief of an SBU SWAT unit in Donetsk known as Alpha\nteam. It was the same group that led the raids for Trident Breach. He also helped coordinate\nlaw enforcement across the region, which allowed him to tell suspects in advance to prepare\nfor searches or destroy evidence, according to the former SBU officer who spoke to MIT\nTechnology Review anonymously.\n\nWhen Russia and Ukraine went to war in 2014, Khodakovsky defected. He became a leader\nin the self-proclaimed Donetsk People’s Republic, which NATO says receives financial and\nmilitary aid from Moscow.\n\nThe problem wasn’t just one corrupt officer, though. The Ukrainian investigation into—and\nlegal proceedings against—Tank and his crew continued after the raids. But they were\ncarefully handled to make sure he stayed free, the former SBU officer explains.\n\n“Through his corrupt links among SBU management, Tank arranged that all further legal\nproceedings against him were conducted by the SBU Donetsk field office instead of SBU HQ\nin Kyiv, and eventually managed to have the case discontinued there,” the former officer\nsays. The SBU, FBI, and FSB did not respond to requests for comment.\n\n\"It came down to D-Day, and we got ghosted.\"\n\n_Jim Craig_\n\n\n-----\n\nTank, it emerged, was deeply entangled with Ukrainian officials linked to Russia s\ngovernment—including Ukraine’s former president Viktor Yanukovych, who was ousted in\n2014.\n\nYanukovych’s youngest son, Viktor Jr., was the godfather to Tank’s daughter. Yanukovych Jr.\ndied in 2015 when his Volkswagen minivan fell through the ice on a lake in Russia, and his\nfather remains in exile there after being convicted of treason by a Ukrainian court.\n\nWhen Yanukovych fled east, Tank moved west to Kyiv, where he is believed to represent\nsome of the former president’s interests, along with his own business ventures.\n\n“Through this association with the president’s family, Tank managed to develop corrupt links\ninto the top tiers of Ukrainian government, including law enforcement,” the SBU officer\nexplains.\n\nEver since Yanukovych was deposed, Ukraine’s new leadership has turned more decisively\ntoward the West.\n\n“The reality is corruption is a major challenge to stopping cybercrime, and it can go up pretty\nhigh,” Passwaters says. “But after more than 10 years working with Ukrainians to combat\ncybercrime, I can say there are plenty of really good people in the trenches silently working\non the right side of this fight. They are key.\"\n\nWarmer relations with Washington were a major catalyst for the ongoing war in eastern\nUkraine. Now, as Kyiv tries to join NATO, one of the conditions of membership is eliminating\ncorruption. The country has lately cooperated with Americans on cybercrime investigations to\na degree that would have been unimaginable in 2010. But corruption is still widespread.\n\n“Ukraine overall is more active in combating cybercrime in recent years,” says the former\nSBU officer. “But only when we see criminals really getting punished would I say that the\nsituation has changed at its root. Now, very often we see public relations stunts that do not\nresult in cybercriminals’ ceasing their activities. Announcing some takedowns, conducting\nsome searches, but then releasing everyone involved and letting them continue operating is\nnot a proper way of tackling cybercrime.”\n\nAnd Tank’s links to power have not gone away. Enmeshed with the powerful Yanukovych\nfamily, which is itself closely aligned with Russia, he remains free.\n\n### A looming threat\n\n[On June 23, FSB chief Alexander Bortnikov was quoted as saying his agency would work](https://www.reuters.com/technology/russian-security-chief-says-moscow-will-cooperate-with-us-against-hackers-report-2021-06-23/)\nwith the Americans to track down criminal hackers. It didn’t take long for two particular\nRussian names to come up.\n\n\n-----\n\nEven after the 2010 raids took down a big chunk of his business, Bogachev continued to be\na prominent cybercrime entrepreneur. He put together a new crime ring called the Business\nClub; it soon grew into a behemoth, stealing more than $100 million that was divided among\nits members. The group moved from hacking bank accounts to deploying some of the first\nmodern ransomware, with a tool called CryptoLocker, by 2013. Once again, Bogachev was\nat the center of [the evolution of a new kind of cybercrime.](https://www.wired.com/2017/03/russian-hacker-spy-botnet/)\n\nAround the same time, researchers from the Dutch cybersecurity firm Fox-IT who were\nlooking closely at Bogachev’s malware saw that it was not just attacking targets at random.\nThe malware was also quietly looking for information on military services, intelligence\nagencies, and police in countries including Georgia, Turkey, Syria, and Ukraine—close\nneighbors and geopolitical rivals to Russia. It became clear that he wasn’t just working from\n[inside Russia, but his malware actually hunted for intelligence on Moscow’s behalf.](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)\n\n## Related Story\n\n[The $1 billion Russian cyber company that the US says hacks for Moscow](https://www.technologyreview.com/2021/04/15/1022895/us-sanctions-russia-positive-hacking/)\n\nWashington has sanctioned Russian cybersecurity firm Positive Technologies. US\nintelligence reports claim it provides hacking tools and runs operations for the Kremlin.\n\n\n-----\n\nThe exact details of Bogachev s relationship with Russian intelligence agencies is unknown,\nbut experts say it looks as if those authorities used his worldwide network of more than 1\nmillion hacked computers as a powerful spying tool.\n\nToday, the FBI offers a $3 million reward for information leading to Bogachev’s arrest. It’s a\nsmall fraction of the total amount he’s stolen, but the second-highest reward for a hacker\never. He remains free.\n\nWeeks after the Russians went silent during the Donetsk raids, a search warrant was\nbelatedly executed in Moscow on Maksim Yakubets. The Russians shared only a fraction of\nthe information the Americans asked for, Craig says. So in 2019, the FBI offered a $5 million\nreward for Yakubets’ arrest, officially topping the bounty on Bogachev as the Americans’\nbiggest reward for a hacker.\n\nEven with such a price tag on his head, Yakubets has remained free and even expanded his\noperations. He’s now wanted for running his own cybercrime empire—a group he branded\nEvil Corp. According to a 2019 indictment, it is responsible for at least $100 million in theft. In\nthe two years since, that number has grown: today, the syndicate is one of the world’s top\nransomware gangs.\n\nAnd, like Bogachev, Yakubets seems to be doing more than just profit-seeking. According to\n[the US Treasury Department, which has imposed sanctions on Evil Corp, he had begun](https://home.treasury.gov/news/press-releases/sm845)\nworking for the Russian FSB by 2017. “To bolster its malicious cyber operations, the FSB\n[cultivates and co-opts criminal hackers,” the 2019 sanctions announcement said, “enabling](https://home.treasury.gov/news/press-releases/jy0127)\nthem to engage in disruptive ransomware attacks and phishing campaigns.”\n\nGiven this—and the history of Trident Breach—Washington officials were deeply skeptical\nwhen Bortnikov offered the FSB’s assistance. Few in the US government believe what\nMoscow says, and vice versa. But still, there is some hope in Washington that the calculus\ndriving the Kremlin’s decisions is changing.\n\n## Related Story\n\n\n-----\n\n[Could the ransomware crisis force action against Russia?](https://www.technologyreview.com/2021/05/21/1025159/colonial-pipeline-russia-usa-hackers/)\n\nMoscow’s blind eye toward cybercriminals has made escalating attacks inevitable, say\nexperts. But changing the approach is easier said than done.\n\n“We feel like we have emerged from this trip with a common strategy with our allies,” said US\nnational security advisor Jake Sullivan in a press conference following the Biden-Putin\nsummit, “As well as having laid down some clear markers with Russia, some clear\nexpectations, and also communicated to them the capacities that we have should they\nchoose not to take action against criminals who are attacking our critical infrastructure from\nRussian soil.”\n\nTranslation: The White House is applying pressure on the Kremlin as never before. But how\nmuch does that change the math for Moscow? From President Biden down, the Americans\nhave never devoted as much energy, money, and staff resources to fighting hacking as they\nare doing today. Now the Americans are wondering if they could actually see the FSB make\narrests.\n\nA sacrificial lamb or two from the Russians is one thing, but what would it take to actually\nsolve the problem of cybercrime? What will Washington do to follow through, and how much\npain is Moscow willing to endure?\n\n“There have been some tactical wins over the years, but to this day I still see some of the\nsame folks pop up again and again,” Passwaters says. “We call them the ‘old wolves’ of\ncybercrime. I personally think that if Tank, Aqua, and Slavik had been nabbed in 2010, things\nwould look quite a bit different today. But the reality is cybercrime will continue to be a\nmassive problem until it is accepted as the serious national security threat that it is.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-08 - Inside the FBI, Russia, and Ukraine’s failed cybercrime investigation.pdf"
    ],
    "report_names": [
        "2021-07-08 - Inside the FBI, Russia, and Ukraine’s failed cybercrime investigation.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "91ff2504-6c1a-4eaa-832b-2c5e297426c5",
            "created_at": "2022-10-25T16:47:55.740817Z",
            "updated_at": "2025-03-27T02:05:17.358938Z",
            "deleted_at": null,
            "main_name": "GOLD EVERGREEN",
            "aliases": [
                "The Business Club"
            ],
            "source_name": "Secureworks:GOLD EVERGREEN",
            "tools": [
                " JabberZeus",
                " Pony",
                " Zeus",
                "CryptoLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535675,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653757633,
    "ts_modification_date": 1653757633,
    "files": {
        "pdf": "https://archive.orkl.eu/d16d1a59a4c9d19aa30f4c7150a9e6555dd2a73b.pdf",
        "text": "https://archive.orkl.eu/d16d1a59a4c9d19aa30f4c7150a9e6555dd2a73b.txt",
        "img": "https://archive.orkl.eu/d16d1a59a4c9d19aa30f4c7150a9e6555dd2a73b.jpg"
    }
}