{
    "id": "5e0ae9c6-9fe6-4633-9ccc-1c8f1985b037",
    "created_at": "2023-01-12T15:08:35.750237Z",
    "updated_at": "2025-03-27T02:16:26.200025Z",
    "deleted_at": null,
    "sha1_hash": "aacb27e7e64426844ab017a5d2c9295f92b24a9f",
    "title": "2019-06-16 - APT34 Tools Leak",
    "authors": "",
    "file_creation_date": "2021-04-21T15:16:51Z",
    "file_modification_date": "2021-04-21T15:16:51Z",
    "file_size": 1382572,
    "plain_text": "# APT34 Tools Leak\n\n**blog.eutopian.io/apt34-tools-leak**\n\n## Leak Summary\n\n\nJune 16, 2019\n\n\nAPT34 is an Advanced Persistent Threat group associated with the Islamic Republic of Iran.\nIts source code and tools were recently leaked via a Telegram channel. In addition to those\ntools, information was divulged about the group’s targets which included companies and\ngovernments in the United Arab Emirates, Kingdom of Saudi Arabia, China, Qatar, and\nTurkey [among others. The “Dookhtegan” group leaking APT34’s information expressed](https://docs.google.com/spreadsheets/d/1W0lPIzvwsgWRW2Ls42Xq4Pw5PDZ6ZN8l-KLmyBRY_6I/edit#gid=0)\nparticular animus towards the Iranian Ministry of Intelligence. As of mid-May 2019, the\nleaks continue via a Telegram channel.\n\nThe tools themselves were unremarkable, as were the infrastructure details. What was\ninteresting is that the details of APT34’s victims were leaked. Along with the timing, this fact\nis the significant feature of this incident and one I will return to later in this post.\n\nMost people don’t follow Cyber Security current affairs in anything other than a casual way.\nFor them, isolated incidents come and go like waves of a fever. Commentators describe an\nindividual leak, breach, or scandal, but these are just surface ripples. I’ll reveal the deep ocean\ncurrents driving them. I’ll describe why they are occurring and who they benefit. I’ll help you\nsee more clearly by understanding the context in which these events take place. - The\nProjectionist, April 2019.\n\n**Leak Announcement**\n\n\n-----\n\n[Source code of Iranian cyber-espionage tools leaked on Telegramhttps://t.co/guVv15igNx](https://t.co/guVv15igNx)\n[pic.twitter.com/QhcdzN12O5](https://t.co/QhcdzN12O5)\n\n— Catalin Cimpanu (@campuscodi) [April 17, 2019](https://twitter.com/campuscodi/status/1118656431069302795?ref_src=twsrc%5Etfw)\n\n**H Diagram**\n\nAPT34 Leak, April 2019.\n\nThis post is about the Geopolitical and strategic context within which these events take place.\nKnowing this context will help you anticipate and counter future threats and make sense of\ndevelopments involving these actors or this geography.\n\n## Introduction To Iran\n\nIran is arguably the world’s oldest country. Not only does it have one of the longest recorded\nhistories but it has undergone huge political, social, and economic change just in the last 50\nyears. It has complex international relations in the region and beyond with both state and\nnon-state actors. Iran’s fabric is as intricate as a Persian carpet. Iran’s society is woven out of\ndifferent threads of ethnicity, language, religion, and ideology. This post examines the APT34\nleak within that context. The process starts with understanding what Iran wants and why.\n\nI’ve attempted to summarise Iran for those who don’t know the country. That summary is\nnecessarily quite long. If you want to skip that background and go straight to the APT34 part,\nclick here to save yourself 10 minutes.\n\n**Iran’s Aspirations**\n\n\n-----\n\n_I m taking it back 1400 years to the times of Rasool_\n_Allah Amir and al-Mu’minin.” - Ayatollah Khomeini_\n_1902 - 1989._\n\nIran seeks regional hegemony. Their pathway to\nachieving it is:\n\nGrow and strengthen its sphere of influence.\nExclude powers, proxies, and influences that\noppose it.\nControl economic and strategic assets and\nlocations.\n\nIraq, launchpad into Syria and Saudi\nArabia.\nThe Saudi oil market.\nThe Persian Gulf.\nAccess to the Mediterranean.\n\nIran wants to realise the vision of the Islamic Revolution of 1979 as expressed in the writings\nand pronouncements of Ayatollah Khomeini. In a historical context, this means Iran wants a\n[sphere of influence similar to that of the Persian Empire of 2000 years ago.](https://en.wikipedia.org/wiki/Achaemenid_Empire)\n\nAchaemenid Empire (521 BC - 486 BC) & Iran (present day).\n\n**Iran’s Geography**\n\n_“Geography is destiny” - Ibn Khaldun 1332 – 1406._\n\nIran’s borders have barely changed in 500 years and are a result of physical geography. The\ncountry is both protected and constrained by mountains and coastline. Satellite imagery\nshows the stark contrast between flat Iraq and mountainous Iran. Many of Iran’s enemies\nhave come to grief in the Zagros mountains which mark the western flank of the country.\n\n\n-----\n\nOnly the Khuzestan province in the South West of the\ncountry looks vulnerable, but it’s partly a swamp. This makes\nit far less attractive for an invader than it would otherwise\nbe. Historically this is where the border lay between Persia\nand Mesopotamia. This particular region presents other\ndifficulties for Tehran as we will see later. The centre of the\ncountry is an uninhabitable wasteland.\n\n**Iran’s Ethnography**\n\n_“I am Darius, the son of Vishtasp. My clan is Achaemenid, my tribe is Persian, and my_\n_nation is Aryan” - Darius the Great 522 - 486 BC._\n\n\n-----\n\nAryan or Iran as it is now known, is home to\nmore than half a dozen different ethnic groups\nand over 10 languages. The country is a\nremnant of a once great empire. Therefore\nIranians have an understanding of a\nfunctioning nation composed of many\nethnicities. Persians of the Shia sect are one of\nthose, albeit the largest at around half of the\npopulation.\n\nThe Azeris or Azerbaijanis come from the\nNorth West. Their language is effectively\nbanned in schools in spite of the fact they are\n~20% of the total population. This area is\nknown as Iranian Azerbaijan, not to be confused with the Republic of Azerbaijan further\nNorth.\n\nIn Khuzestan in the South West, the population is Arab, not Persian. It’s also where the Shatt\nal-Arab waterway meets the Persian Gulf and has been the scene of several confrontations\nbetween the British Royal Navy and the Navy of the Iranian Revolutionary Guards.\nKhuzestan receives significant attention from the intelligence services who are always\nwatching for secessionist sentiment or those who might encourage it.\n\nThe Balochis in the South East are Sunni Muslims, like the Azeris and some of the Khuzestan\nArabs.\n\nFinally, there are Kurds in the West who also inhabit mountainous regions of Iraq and\nTurkey. Like most of non-Persian Iranians, Kurds are Sunnis.\n\nEthnic composition of Iran (present day).\n\n\n-----\n\n**Ethnography & Secession Risk**\n\nIn spite of ever-present secessionist sentiment, there’s less risk of Iran splintering along\nethnic lines than one might imagine. Tehran manages each group carefully through a mixture\nof punishment and reward and the pull factors are not that strong.\n\nEach group has seen what happens when a state disintegrates.\n\nIraq, Syria, Libya, Afghanistan, Yemen.\nIranian culture integrates them to a degree.\n\nNational myths, symbols, historical figures.\nMost would-be secessionist states aren’t viable.\n\nParticularly if Iran is to be an unfriendly neighbour.\nFor regions choosing to become part of a neighbouring state, life would likely get worse,\nnot better.\n\nThere’s no near-term prospect for a real Kurdish state.\nNo external force pushing secessionist movements in a meaningful way.\n\n**Iran’s Religion & Government**\n\n_“We are not afraid of your science and of your technology. We are afraid of your ideas and_\n_of your customs. Which means that we fear you politically and socially. And we want this to_\n_be our country. We do not want you to interfere anymore in our politics and our economy,_\n_in our habits, our affairs. And from now on, we will go against anyone who tries to_\n_interfere – from the right or from the left, from here or from there.” - Ayatollah Khomeini,_\ninterview by Oriana Fallaci, October 14th 1979.\n\nIran is an Islamic Republic. Religion is at the centre of power in a way that casual observers\nin the West may struggle to understand. It’s impossible to talk about Iran’s government\nwithout talking about religion, and vice versa. 98% of the country is Muslim, and 90% of\nthose Muslims are Shia. 8% are Sunni and 2% other sects. Most of the Sunnis are ethnically\nKurdish, Balochi, Turkmen, or Arab.\n\nAlthough it has elected institutions including a Parliament, Iran is a theocracy. This fusion of\nreligion and democracy might have worked, but fighting between factions and\ninstitutionalised corruption has left the wider population at a disadvantage.\n\n[After the revolution of 1979, a new constitution was drafted based upon the word of](https://en.wikipedia.org/wiki/Constitution_of_the_Islamic_Republic_of_Iran)\nKhomeini. Shortly after that time, the Iran/Iraq war provided cover for the clerical faction of\nthe revolutionary movement to purge the republican faction and consolidate power. In 1988\nalone 30,000 Iranians were executed by their own government. Institutions were suspended,\ncleansed, and re-constituted according to Khomeini’s teachings. Thousands of teachers,\ndoctors, lawyers, academics, scientists, writers, and artists fled the country in what became\nknown as the Iranian Cultural Revolution.\n\n\n-----\n\nAs a boy, every Iranian I d ever met or heard of was either a scientist, a doctor, a scholar, or an\nauthor. I wondered what sort of a country it was that produced only people of such calibre. It\nwas an early lesson in selection bias.\n\nThe constitution intertwines legislative and religious authority. While it has the superficial\nappearance of democracy, when these structures are fully unwound, all real power rests with\nthe clerics. There is no transparency. A veneer of democracy gives legitimacy to the\ngovernment while preventing any real change. Both the system of government and society\nremain locked down. Candidates are selected before any public vote can take place.\n\nIran’s Government (simplified).\nAlthough the system is rigid, there are several factions and a great deal of manoeuvring. In\nthe parliament, there are both moderates and conservatives with differing views on:\n\nThe supremacy of constitution vs religious law.\nThe degree of social reform desirable.\nThe relationship with the West.\nThe form of the economy.\n\n**The Political Spectrum**\n\n\n-----\n\nThere are broadly 4 groups on the Iranian political spectrum. Their names and faces change\nover time and their fortunes rise and fall, but these divisions remain. As always when\ncomparing political systems and groups in one country from a position within another,\nlanguage and definitions can be difficult. In reality, there is a void between the Reformist\nmovement and the Moderates, while the other factions are closer together.\n\n**Reformist** **Moderate** **Conservative** **Hardline**\n\n\nFaith/Law Secularism Elected inst. above\nreligious authority\n\n\nReligious authority\nabove elected inst.\n\n\nReligious\nauthority\n\n\nSocial More liberal Rather conservative Islamic social values Literal\ninterpretation\n\n\nThe West Normalisation Trade Confrontation\ninevitable\n\nEconomy Free market Liberalisation Liberalisation, but\nkeep social values\n\n\nKey\nFigure\n\n\nMousavi\n(Arrested)\n\n\nMontazeri (d.2009),\nRouhani (President)\n\n\nKhamenei (Supreme\nLeader)\n\n\nConfrontation\ninevitable\n\nDecentralised\n\nMesbahYazdi\n\n\nUpon the death of Ayatollah Khomeini in 1989, the designated successor Ayatollah Montazeri\n(a relative moderate) was sidelined for the conservative Ayatollah Khamenei who has ruled as\nSupreme Leader ever since. Elected Presidents have included moderates like Rouhani\n(present), Khatami, and Rafsanjani and conservatives like Ahmadinejad.\n\nOnce upon a time the key figures in the table above worked together. Many were even\npictured smiling in a relaxed manner in a single frame. Today those men are divided.\nUndeserving of even a name-check on the Supreme Leader’s Instagram.\n\nThese divisions are set against a backdrop of poor economic performance and dissatisfaction\namong voters. The Iranian Parliament and its various Councils and Assemblies are not\nrepresentative of Iranian society. Nor will they ever be while candidates are screened and\nselected in the non-transparent way described in the simplified diagram above. This creates a\ntension in society which flares up from time to time, particularly when the public experiences\nadverse economic conditions.\n\n**Iran’s Economy**\n\nIran’s economic growth hasn’t kept pace with its population growth. This lead to a decline in\nthe standard of living since the baby boom. Iran took drastic action to reduce the birth rate,\nwhich it did very successfully. Now they have the opposite problem, an ageing population and\nnot enough growth at the bottom to support it. Today the government is attempting to grow\nfamily sizes again, but without much success.\n\n\n-----\n\nOil\n\nIran is rich in oil but it’s unable to take full advantage of this. The oil industry suffers from:\n\nUnfortunate physical location of hydrocarbons (high transport cost).\nSanctions stunting the industry.\nIncreased domestic demand since 1960s/70s.\nInefficiency within the oil ministry.\n\nThese factors combine to produce an effect where a rise in oil prices doesn’t result in a\nsignificant rise in the standard of living for Iranians. Iran has limited capacity to refine. For\nthis reason, it imports up to 30% of its gasoline. This is one factor driving Iran’s interest in\nthe Saudi oil assets, which have a much lower breakeven price.\n\nInflation & Exchange\n\nIran relies heavily on food imports, to buy these it needs foreign exchange (US dollars).\nSanctions prevent Iran from obtaining enough dollars which leads to shortages, food price\ninflation, and protests. The official inflation rate means very little when dollars simply cannot\nbe obtained.\n\n[#Iran's annual inflation rate, measured accurately this morning, is 139%, more than double the](https://twitter.com/hashtag/Iran?src=hash&ref_src=twsrc%5Etfw)\nphony government rate of 51.4%. [pic.twitter.com/9giTXZJMSm](https://t.co/9giTXZJMSm)\n\n— Steve Hanke (@steve_hanke) [May 17, 2019](https://twitter.com/steve_hanke/status/1129389896060329984?ref_src=twsrc%5Etfw)\n\nPorts & The Strait Of Hormuz\n\nThe Strait of Hormuz\nIran is on the Strait of Hormuz. The strait is a narrow gateway through which 40% of the\nworlds sea-bourne oil passes. This strait is far more important than any nuclear programme.\nIt’s just 32km wide at the narrowest navigable point.\n\nIran has one major port at Bandar Abbas and one major oil terminal at Kharg Island. Kharg\nhandles 90% of Iran’s oil exports. The country has never been much of a maritime power.\n\nIran has an assortment of anti-ship missiles, mines, and aircraft easily capable of saturating\nthis tiny span. If the straits were closed for even a few days there would be worldwide\neconomic impact. It is Iran’s strongest card and yet also a double-edged sword. Closing the\nstrait would be a “nuclear” option and would elicit a corresponding response.\n\nIn 2012 a [pipeline was completed between Abu Dhabi and Oman bypassing the Strait of](https://en.wikipedia.org/wiki/Habshan%E2%80%93Fujairah_oil_pipeline)\nHormuz, but capacity is limited. The strait remains a strategically important choke point for\nthe worlds hydrocarbon supply.\n\n**Iran’s Regional Friendships**\n\n\n-----\n\nIran exercises influence over a wide geographic range. It does this either directly or indirectly\nthrough a number of proxies. These proxies are aligned with Iran either because of religion, a\ncommon enemy, ideology, or mutually shared interest or shared fortunes. They are not\nwedded to Iran. While the existing power structures of the region remain in place\n(particularly the al-Assad government in Syria), it suits them to work with and sometimes for\nIran.\n\nIraq\n\nIran has good relations with the Arab Shia elite currently attempting to govern in\nIraq. Iraq is today as it was in antiquity, the key to greater Iranian influence\nthroughout the region.\nSyria\n\nBashar-al Assad (and the Alawite elite) have faced a mostly Sunni uprising. Syria’s\nport on the Mediterranean is of strategic interest to Iran.\nLebanon\n\nHezbollah is a Beirut based Shia political party and militant group dedicated to\nharassing Israel. It was partly founded by Iran. Iran continues to provide the\norganisation with funding, intelligence, and weapons. If Iran is attacked,\nHezbollah can be instructed to strike at Israel in return. Iran has also used\nHezbollah to shore-up al-Assad’s position in Syria.\nAfghanistan\n\nIran has long experience with Taliban and ethnic Persians in Afghanistan. They\nare capable of destabilising the country if and when it suits them.\nGaza Strip\n\nPalestinian Islamic Jihad’s (PIJ) objective is the destruction of the State of Israel.\nThey’re supported by Iran with intelligence, funding and weapons. The group can\nbe instructed to strike against Israel should it suit Iran to do so. The group is an\noffshoot of the Muslim Brotherhood.\nHamas similarly wish the destruction of Israel and are Sunnis. Iran supplies them\nwith funding, intelligence, and weapons. They can be called upon to conduct\noperations aligned to Iran’s wishes.\n\nSyria is particularly important because assuming al-Assad’s government survives, and it\nlooks like it will, relations between Iran and Syria will be at a historic peak. In exchange for\nthe unconditional support Iran offered, it’s reasonable to expect Iran to obtain whatever\naccess it needs to the Mediterranean port of Tartus. Secondly, from Syria it’s easy to exercise\nmore influence over Lebanon. Doubly so with the Hezbollah connection in place.\n\n\n-----\n\nIran is no tin-pot dictatorship or Banana Republic. It has extensive networks within the region\nwhich can engage in activities from destabilisation and hit-and-run attacks through to larger\nmore organised offensives. Iran’s sphere of influence runs from Turkey and Georgia all the way\nto India. The country is continuously fighting a low-level proxy war with Israel while Israel\nattempts to prevent it from obtaining nuclear weapons. Hamas, Hezbollah, and PIJ do not pose\nan existential threat to Israel, although they could make life a misery for Israelis. The existential\nthreat comes from elsewhere. It comes from the Iran/Syria/Iraq configuration, a creeping nonZionism within European policy formation, a gradual reorientation to moderate Arabist\nviewpoints, and over the next 50-60 years in the Arab birthrate inside Israel and the territories.\n\n**Iran And The Bomb**\n\nIran doesn’t strictly need a nuclear weapon to achieve regional hegemony. The nuclear\nprogramme is most valuable as a bargaining chip and as a repellant to ward off regime\nchange. However if a device is assembled and tested it’s reasonable to expect that a regional\narms race will result. The Saudis will demand one of their own to balance Iran. A number of\ncountries in the region already have very low-level programmes.\n\n## APT34 Leak In Context\n\n**Short Term Consequences**\n\nThis incident is a minor inconvenience to APT34 and by association Iran. It forces them to do\nwork in building new control infrastructure and discloses APT34’s activities to their targets if\nthose targets were not already aware. It may also cause individuals some problems now that\nthey’ve been named as Iranian Ministry of Intelligence Officers. Particularly if they undertake\nprojects outside of their work with the state, or travel to other countries.\n\n**Long Term Consequences**\n\nAll of the organisations or states named in the leak know that they are of interest to Iran.\nThere will be a certain amount of embarrassment because they have been compromised, but\nthis will pass. In the long-term the leak may even have a positive effect of reminding those\norganisations to improve their Cyber Security in the face of increasing geopolitical tensions.\nNext time they may not be so easily breached.\n\nThere’s no love lost between UAE, KSA, Jordan, Bahrain, Israel, and APT34’s sponsor. Iran\nseeks regional hegemony and those countries stand to lose from that. They’ve been targeted\nin the past by Iranian proxies and partners. However, these were not the only countries\nwhere corporations and government departments were breached by APT34 and subsequently\ndisclosed. APT34’s work also included hacking into those that could loosely be defined as\nfriends of Iran.\n\n\n-----\n\nKuwait\n\nKuwait’s government was targeted. The country has a mixed relationship with\nIran since the Islamic Revolution of 1979. It backed Iraq in the Iran/Iraq war of\n1980-88 and is broadly against Iran having more influence in the region.\nHowever, Kuwait has stopped well short of the position of the other Gulf States.\nThe fact that Iran has been caught spying on them will make it a little harder for\nthe country to maintain this position. However, Kuwait has kept-up warm\n[relations with Iran in spite of spying scandals in the past. The likelihood is that](https://www.reuters.com/article/us-kuwait-iran-lebanon/kuwait-says-arrests-12-convicted-in-2015-iran-spy-case-idUSKBN1AS07F)\nKuwait will do what Kuwait does best, be a middle man.\nQatar\n\nThe Qatari government was targeted. Qatar shares the South Pars/North Dome\nGas-Condensate field with Iran. It’s the world’s largest natural gas field. It also\n[has linked oil interests. Iran came to Qatar’s aid during the 2017-19 crisis with](https://en.wikipedia.org/wiki/2017%E2%80%9319_Qatar_diplomatic_crisis)\nfood, finance, and diplomatic assistance. That an Iranian APT has been caught\ntargeting the government of Qatar is somewhat embarrassing but their friendly\nassociation will survive. Qatar is aligned with Iran (and Turkey) within the region.\nHowever, ultimately Qatar’s security is guaranteed by the US air base it hosts.\nTurkey\n\nTurkish energy, construction, and government entities were targeted. Iran has\ngood relations with Turkey, but it’s not an entirely straightforward arrangement.\nThe AKP government of Turkey supports the opposite side to Iran in both the\nSyrian Civil war and the war in Yemen. However, Iran was quick to voice support\n[for the AKP government during the failed 2016 coup d’état. Both Iran and Turkey](https://en.wikipedia.org/wiki/2016_Turkish_coup_d%27%C3%A9tat_attempt)\nbacked the Qatari’s in their dispute with KSA and the UAE. Iran and Turkey also\nback each other against US sanctions. This is in spite of the fact Turkey hosts a\nUS/NATO airbase US/NATO nuclear weapons.\nChina\n\nChina’s energy, telecommunications, financial, and technology sectors were\ntargeted by APT34. In the past, China has been at least partly responsible for\nsome developments within Iran’s nuclear programme and its anti-shipping\nmissiles. Iran now relies on China’s backing at the UN to reduce pressure from\nthe US and elsewhere. China is sure to play an important role in Iran’s future.\nGiven all of this, the public disclosure of APT34 operations against China may end\nup being one of the more significant.\n\nIt would have been far more significant if Iran had been caught undermining Hezbollah,\nPalestinian Islamic Jihad, Hamas, the Shia elite in Iraq, or the administration in Syria.\nTehran relies on these partners and proxies for influence. There was relatively little mention\nof Israel in this leak, although there were some web shells disclosed. This is somewhat\n\n\n-----\n\nsurprising given the level of interest Iran has in Israel. Perhaps APT34 isn t trusted with\nthem as a target? Perhaps the leaked data was filtered and curated by Dookhtegan before\nrelease?\n\n[Allies spy on each other. The British spy on the Belgians, the French spy on the British, and](https://en.wikipedia.org/wiki/Operation_Socialist)\n[the Americans spy on the Germans. The problem comes in managing public opinion. It will](https://wikileaks.org/nsa-germany/)\nbe slightly harder for otherwise friendly states that have been targeted by Iran, to be publicly\nsupportive of a country caught hacking them. However, while there’s no political home for\nnegative popular sentiment, that sentiment will pass.\n\n**Who Are Dookhtegan?**\n\nThere’s scant information in the articles posted. Dookhtegan are particularly hostile towards\nthe Iranian Intelligence Services, yet there is no ethnic, sectarian, or other charged language.\nThey use the Farsi slogan “ﮐﻨﯿﻢ ﺧﺎﻣﻮش را ﺻﺪاﯾﺘﺎن ﻣﺎﺳﺖ ﻧﻮﺑﺖ اﻣﺮوز!” or “Today is our turn to turn off\nyour voice”. This suggests that the group or individual feels they are routinely suppressed.\nTheir avatar is one of a person with their lips stitched together. Other imagery and phrasing\nsuggest they are associated with the Green Movement and the Reformist faction of the\nIranian political spectrum described above.\n\nThere may be an Azeri connection. Within Iran, the Azeri language is more or less banned in\nschools, in spite of the fact they are 20% of the population. However, Azeris speak the Azeri\nTurkish language, not Farsi. Many feel unable to speak freely in Iran, be they of an ethnic,\nreligious, demographic, or other grouping. It’s just as likely that Dookhtegan is an agent or\nproxy of one of the states opposed to Iran. It may be an individual with sympathies for\nPeople’s Mujahedin of Iran (MEK). That group opposes Iran’s conservative theocratic system\nof government. The list of suspects is long.\n\nThe disclosure of named individuals is unusual. Dookhtegan may be an insider or internal\nrival of these people.\n\n**Timing**\n\nTiming is one of the few facts that can be established definitively.\n\nWe know when this leak was made.\nWe know where it sits in the sequence of other Cyber Security events concerning Iran.\nWe know the timeline of recent events in the Strait of Hormuz and the Iran nuclear\ndeal.\n\nThe chances that this leak is unconnected with any of these events yet occurs at precisely this\npoint in time, is I think unlikely. Why now?\n\n**Who Benefits?**\n\n\n-----\n\nAPT34 s domestic competitors may benefit, since APT34 may now have fewer\nassignments and its staff may be perceived as less competent.\n\nThose against greater Iranian influence in the region have additional evidence if any\nwas needed, that Iran acts against commercial and state entities.\n\nCountries who may have otherwise adopted a more understanding approach to Iran\nmay be expected explain to their citizens why they would continue that in the face of\npublicised, successful cyber attacks against their own government, companies, and\nnational critical infrastructure by APT34.\n\nNone of those whose data was divulged in the breach was undone in any significant\nway. Enough data was leaked to make the release credible, but not so much as to\nseriously wound APT34’s targets. There was no lasting economic harm and no serious\nnegative 2nd order effects that we know of.\n\nIf important organisations strengthen their Cyber Security in the wake of this leak, then\nthey will be harder to compromise in the future. If Iran were to decide to strike at\nnational critical infrastructure or important commercial assets, they might find those\ntargets hardened or better prepared than before this leak.\n\n**Actions**\n\nMuch is unknown. This blog is at least 3 entities removed from the source, or 4 if you count\nIran as primogenitor. What actions should we take and what lessons can we learn?\n\nAre you a government or organisation running national critical infrastructure in a state\nthat is against the expansion of Iran’s sphere of influence? You are a target for APT34\nand groups like it.\nAre you a government or organisation running national critical infrastructure in a state\nthat is comfortable with the expansion of Iran’s sphere of influence? You are also a\ntarget of APT34 and groups like it.\n\nAs of this moment, the APT34 leak includes data from government departments and\ninfrastructure companies in the following sectors:\n\nOil and gas\nEnergy\nPorts and Airports\nTelecommunications\nFinance\n\nIf the threat models of these companies didn’t include adversaries like APT34 before, they\nsurely must do now. It doesn’t matter if they are based in an aligned or unaligned country\nvis-à-vis the strategic goals of the Islamic Republic of Iran.\n\n\n-----\n\nThe most important lesson to be learned from this event is that your threat model can change\nrapidly with geopolitical developments. Either you can anticipate those changes and prepare\nfor them, or you will have to adapt to them at a pace dictated to you by the attackers.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-16 - APT34 Tools Leak.pdf"
    ],
    "report_names": [
        "2019-06-16 - APT34 Tools Leak.pdf"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536115,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1619018211,
    "ts_modification_date": 1619018211,
    "files": {
        "pdf": "https://archive.orkl.eu/aacb27e7e64426844ab017a5d2c9295f92b24a9f.pdf",
        "text": "https://archive.orkl.eu/aacb27e7e64426844ab017a5d2c9295f92b24a9f.txt",
        "img": "https://archive.orkl.eu/aacb27e7e64426844ab017a5d2c9295f92b24a9f.jpg"
    }
}