{
    "id": "5e315061-9210-4ae1-9789-e46007b1b396",
    "created_at": "2023-01-12T15:08:21.594735Z",
    "updated_at": "2025-03-27T02:05:31.540562Z",
    "deleted_at": null,
    "sha1_hash": "9904f2e07126e40a807ef2d4765777093b0bc9a7",
    "title": "2022-09-16 - Zero-Day Exploit Detection Using Machine Learning",
    "authors": "",
    "file_creation_date": "2022-10-02T12:25:10Z",
    "file_modification_date": "2022-10-02T12:25:10Z",
    "file_size": 522536,
    "plain_text": "# Zero-Day Exploit Detection Using Machine Learning\n\n**[unit42.paloaltonetworks.com/injection-detection-machine-learning/](https://unit42.paloaltonetworks.com/injection-detection-machine-learning/)**\n\nJin Chen, Lei Xu, Andrew Guan, Zhibin Zhang, Yu Fu September 16, 2022\n\nBy [Jin Chen,](https://unit42.paloaltonetworks.com/author/jin-chen/) [Lei Xu,](https://unit42.paloaltonetworks.com/author/lei-xu/) [Andrew Guan,](https://unit42.paloaltonetworks.com/author/andrew-guan/) [Zhibin Zhang and](https://unit42.paloaltonetworks.com/author/zhibin-zhang/) [Yu Fu](https://unit42.paloaltonetworks.com/author/yu-fu/)\n\nSeptember 16, 2022 at 6:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Vulnerability](https://unit42.paloaltonetworks.com/category/vulnerability/)\n\nTags: [Cloud-Delivered Security Services,](https://unit42.paloaltonetworks.com/tag/cloud-delivered-security-services/) [Command Injection,](https://unit42.paloaltonetworks.com/tag/command-injection/) [deep learning,](https://unit42.paloaltonetworks.com/tag/deep-learning/) Machine\nLearning, [network security,](https://unit42.paloaltonetworks.com/tag/network-security/) [next-generation firewall,](https://unit42.paloaltonetworks.com/tag/next-generation-firewall/) [SQL injection,](https://unit42.paloaltonetworks.com/tag/sql-injection/) [threat detection,](https://unit42.paloaltonetworks.com/tag/threat-detection/) threat\nprevention, [WildFire,](https://unit42.paloaltonetworks.com/tag/wildfire/) [zero-days](https://unit42.paloaltonetworks.com/tag/zero-days/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/injection-detection-machine-learning/)\n\n## Executive Summary\n\nCode injection is an attack technique widely used by threat actors to launch arbitrary code\nexecution on victim machines through vulnerable applications. In 2021, the Open Web\nApplication Security Project (OWASP) ranked it as third in the top 10 web application security\nrisks.\n\nGiven the popularity of code injection in exploits, signatures with pattern matches are\ncommonly used to identify the anomalies in network traffic (mostly URI path, header string,\netc.). However, injections can happen in numerous forms, and a simple injection can easily\nevade a signature-based solution by adding extraneous strings. Therefore, signature-based\n\n\n-----\n\nsolutions will often fail on the variants of the proof of concept (PoC) of Common\nVulnerabilities and Exposures (CVEs). In this blog, we explore how deep learning models\ncan help provide more flexible coverage that is more robust to attempts by attackers to avoid\ntraditional signatures.\n\n[Palo Alto Networks Next-Generation Firewall customers receive protections from such types](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\nof attacks through [Cloud-Delivered Security Services including Intrusion Prevention](https://www.paloaltonetworks.com/network-security/security-subscriptions)\n[capabilities in Advanced Threat Prevention, as well as through WildFire.](https://www.paloaltonetworks.com/network-security/advanced-threat-prevention)\n\nRelated Unit 42 topics [SQL injection,](https://unit42.paloaltonetworks.com/tag/sql-injection/) [command injection,](https://unit42.paloaltonetworks.com/tag/command-injection/) [deep learning](https://unit42.paloaltonetworks.com/tag/deep-learning/)\n\n## Table of Contents\n\n**Why Intrusion Prevention System Signatures Aren’t Sufficient**\n\n**Detection Case Studies on Zero-day Exploits**\n\n**Case study 1: Command Injection Detection**\n\n**Case study 2: SQL Injection Detection**\n\n**Machine Learning Test Results**\n\n**Conclusion**\n\n**Additional Resources**\n\n## Why Intrusion Prevention System Signatures Aren’t Sufficient – How Machine Learning Can Help\n\nIntrusion Prevention System (IPS) signatures have long been proven to be an efficient\nsolution for cyberattacks. Depending on predefined signatures, IPS can accurately detect\nknown threats with few or no false positives. However, creating IPS rules involves proof of\nconcept or technical analysis of certain vulnerabilities, so it is challenging for IPS signatures\nto detect unknown attacks due to a lack of knowledge. For example, remote code execution\nexploits are often crafted with vulnerable URI/parameters and malicious payloads, and both\nparts should be identified to ensure threat detection. On the other hand, in zero-day attacks,\nboth parts can be either unknown or obfuscated, making it difficult to have the needed IPS\nsignature coverage. In our experience, we found the following set of challenges faced by\nthreat researchers:\n\nFalse negatives. Variations and zero-day attacks are seen every day, and IPS cannot\nhave full coverage for all of them due to a lack of attack details beforehand.\nFalse positives. To address variants and zero-day attacks, generic rules with loose\nconditions are created, which inevitably brings the risk of false alarm.\nLatency. The time lag between vulnerability disclosure, security vendors rolling out\nprotections and customers applying security patches represents a significant window\nfor attackers to exploit the end user.\n\n\n-----\n\nWhile these problems are innate to the nature of IPS signatures, machine learning\ntechniques can address these shortcomings. Based on real-world zero days and benign\ntraffic, we trained machine learning models to address common attacks such as remote code\nexecution and SQL injection. From our recent research, presented in this blog, we find that\nthese models can be very helpful in zero-day exploit detection, being both more robust and\nquicker to respond than traditional IPS methods.\n\nIn the following sections, we’ll share some case studies and insights into how machine\nlearning models can be incorporated into exploit detection modules, and how effective this\ncan be.\n\n## Detection Case Studies on Zero-Day Exploits\n\n### Case Study 1: Command Injection Detection\n\nCommand injection has long been a major threat in network security. Due to their easy-toexploit nature and severe impact, command injection vulnerabilities have the potential to\nbring tremendous damage to affected organizations, especially when patches come late.\n[Last year, vulnerabilities in commonly used software such as Log4Shell and](https://www.paloaltonetworks.com/log4shell) [SpringShell](https://unit42.paloaltonetworks.com/cve-2022-22965-springshell/)\nplaced hundreds of millions of Java-based servers and web applications at risk. Meanwhile,\nvendors were busy updating IPS signatures to cover constantly evolving attack patterns\nderived from the original exploit in a frustrating cat-and-mouse chase, and we still see\nobfuscated attacks attempted today.\n\nGenerally, for those vulnerabilities which include specific paths or parameters, IPS signatures\nare a good idea since attacks can be accurately filtered out by the URI and suspicious\npayload. However, some exploits of critical vulnerabilities can be flexible due to the nature of\n[HTTP protocols. For example, the Log4Shell vulnerability can be triggered through all kinds](https://unit42.paloaltonetworks.com/apache-log4j-vulnerability-cve-2021-44228/)\nof user inputs. Moreover, the complexity of HTTP encoding methods allows attackers to\nevade normal detection using partial or mixed encoding. In such situations, machine learning\nmethods can more accurately identify abnormal traffic, yielding corresponding verdicts with\nthe knowledge of previously seen malicious sample payloads.\n\nWe trained a state-of-the-art Convolutional Neural Network (CNN) with cutting edge deep\nlearning technologies loosely based on previous academic research on Temporal\nConvolutional Networks. While variable length inputs suggest that a recurrent model\nstructure such as a Recurrent Neural Network (RNN) or a Long Short-Term Memory (LSTM)\n[Network may be suitable, research shows that a simple convolutional architecture often](https://arxiv.org/pdf/1803.01271.pdf)\noutperforms recurrent models. Our model has learned more generalizable common patterns\nin command injection exploits while also being specific enough to avoid false positives. In our\nlatest tests, we achieved a true positive rate of >99% and a false positive rate of <0.025%. In\nthe following sections, we discuss case studies of command injection exploits and how our\nnew machine learning model is able to accurately detect them\n\n\n-----\n\n**[1. Atlassian Confluence vulnerability (CVE-2022-26134)](https://nvd.nist.gov/vuln/detail/CVE-2022-26134)**\n\nAtlassian Confluence is a web-based corporate wiki tool used to help teams to collaborate\nand share knowledge efficiently. One recent remote code execution vulnerability, CVE-202226134, targets Confluence versions 1.3.0-7.4.17, 7.13.0-7.13.7, 7.14.0-7.14.3, 7.15.0-7.15.2,\n7.16.0-7.16.4, 7.17.0-7.17.4 and 7.18.0-7.18.1. We have [observed successful exploitation](https://unit42.paloaltonetworks.com/cve-2022-26134-atlassian-code-execution-vulnerability/)\nleveraging this vulnerability to perform Cerber Ransomware attacks.\n\nFigure 1. One PoC attack leveraging CVE-2022-26134.\nMalicious but arbitrary commands can be inserted in the payload to perform various\nactivities. The machine learning model can easily distinguish between benign and malicious\nactivities and block the attacks using different commands without knowing the full context of\nthe application.\n\n**2. Unknown IoT Zero-Day Attack**\n\nSometimes we see alerts from our internal threat hunting research platform when processing\nreal-world traffic. After filtering out false positives, these types of detections usually indicate\nthat a zero-day attack has been captured. For example, on April 29, 2022, we saw the HTTP\nrequest shown in Figure 2.\n\nFigure 2. An HTTP request that triggered an alert on our machine learning model.\nThe command and control (C2) server was down shortly after we got the traffic, so it is\ndifficult to verify details of the exploit and payload. However, according to our threat\nintelligence, this could be attributed to a previously unknown attack targeting certain MIPSbased smart devices.\n\nWith traditional IPS technologies, it’s possible to miss such attacks since the vulnerable URI\nand parameters have never been seen before; it’s hard to determine if the requested data is\nbenign or suspicious. In this specific case, our IPS with a default configuration did not result\nin an alert, but our machine learning model successfully identified the attack with a high\nconfidence score.\n\n**[3. Tenda AC18 Router Vulnerability (CVE-2022-31446)](https://nvd.nist.gov/vuln/detail/CVE-2022-31446)**\n\n\n-----\n\nThe Tenda AC18 router is prone to a remote code execution vulnerability, allowing attackers\n[to execute arbitrary commands on the device. Not long after the vulnerability was published,](https://nvd.nist.gov/vuln/detail/CVE-2022-31446)\na Palo Alto Networks researcher discovered an exploit in the wild targeting this specific CVE,\nas shown in Figure 3.\n\nFigure 3. Exploit in the wild targeting CVE-2022-31446.\nSimilar to the zero-day IoT attack mentioned above, it's difficult for traditional IPS solutions to\ndetect such attacks due to their inherent limitations. However, our machine learning model\ndetected the exploit with high confidence. The machine learning model identifies that\nrequests in the POST body are highly suspicious and suggests the IP address shown in\nFigure 3 should be further investigated with correlated malicious samples.\n\n### Case study 2: SQL Injection Detection\n\nSQL injections are another notorious and challenging threat in network security. In this type\nof attack, threat actors alter SQL queries and inject malicious code by exploiting\nvulnerabilities. SQL injections may result in information modification, sensitive data leakage\nand unauthorized command executions in underlying database systems. Due to the serious\npotential impact of SQL injection vulnerabilities, their prompt detection and zero-day exploit\nprevention on the network side are critical to fortifying an organization’s assets.\n\nUnfortunately, the task is challenging with traditional IPS systems due to time limitations and\nthe need for technical expertise. Traditional systems require properly composing and testing\ncustomized signatures to cover zero-day SQL exploitations, such as exploits targeting, for\nexample, [CVE-2022-0332 and](https://nvd.nist.gov/vuln/detail/CVE-2022-0332) [CVE-2022-34265. Even worse, attackers may utilize readily](https://nvd.nist.gov/vuln/detail/CVE-2022-34265)\n[available hacking tools such as sqlmap to generate SQL injection exploitations that are very](https://sqlmap.org/)\ndifficult to cover with IPS signatures. In this case, machine learning solutions can effectively\nclassify malicious SQL injection payloads from benign traffic by examining carefully selected\nfeatures covering a variety of SQL injection exploitations. The following vulnerability case\nstudies demonstrate the effectiveness and efficiency of the machine learning solutions we\nhave developed.\n\n**[1. Moodle vulnerability (CVE-2022-0332)](https://www.cve.org/CVERecord?id=CVE-2022-0332)**\n\n\n-----\n\nMoodle is a free and open source learning management system with more than 300 million\nusers. However, Moodle versions 3.11 to 3.11.4 have a vulnerability (CVE-2022-0332) in the\nserver.php file due to the lack of user input sanitization, making it possible to use the union\noperator to query unexpected data. When given the following payload, vulnerable versions of\nMoodle will query the SQLite engine version with the function sqlite_version() and return it to\nthe user. Our machine learning solution effectively derives features from capturing the unionselect related SQL injection code snippet and flexibly detects exploitations of CVE-20220332.\n\nFigure 4. One PoC leveraging CVE-2022-0332.\nAfter decoding, the PoC of CVE-2022-0332 is shown in Figure 5.\n\nFigure 5. Decoded PoC of CVE-2022-0332.\n**[2. Django vulnerability (CVE-2022-34265）](https://nvd.nist.gov/vuln/detail/CVE-2022-34265)**\n\nDjango is a widely used framework to build websites, including Instagram, Disqus, Pinterest,\netc. CVE-2022-34265 is an issue affecting the Django framework. This vulnerability is\ncaused by an improper check on parameter values for the Trunc() and Extract() functions,\nwhich may lead to unexpected SQL statement execution. Two PoCs for CVE-2022-34265\nare shown in Figures 6 and 7. Both payloads use a boolean injection sub-payload followed\nby a stack injection sub-payload. When a payload is appended to the predefined SQL\nstatement, the first statement split by the semicolon will always be true because of the or\n1=1. The second part will lead to a sleep of five seconds by the program, which, on the\nbrowser side, leads to a five second waiting time. The five second delay on the front end can\nindicate the successful SQL statement execution – which also indicates the existence of the\n\n\n-----\n\nSQL injection vulnerability. Our machine learning solution can also effectively detect the SQL\ninjection patterns as or 1=1 statements, which can help us effectively prevent the exploitation\nof such vulnerabilities.\n\nFigure 6. Two PoCs for CVE-2022-34265.\n\nFigure 7. After decoding, two PoCs for CVE-2022-34265.\n**3. sqlmap-generated exploitation**\n\nsqlmap is an open source tool used in penetration testing to detect and exploit SQL injection\nflaws, which can automate the process of crafting exploitations of SQL injection\nvulnerabilities. While the tool can be used for legitimate purposes, it can also be abused by\nattackers.\n\nFigure 8 shows a PoC of SQL injection from sqlmap. After decoding, we can observe the\nsnippet and 1043=1043, which is a widely used pattern for blind SQL exploitation. The\nattacker can leverage the statement to sniff the vulnerabilities of web services and database\nsystems. The pattern is similar to or 1=1 (see our discussion of CVE-2022-34265), but\nsqlmap can generate polymorphic SQL injection exploitations as long as the statement is\nalways true after and.\n\nThese types of patterns are challenging to detect via IPS signatures. While a traditional\nsignature might only be able to match one and 1=1 case, our machine learning solution can\nproperly cover the exploitation with dedicated features for all similar and 1=1 cases.\n\nFigure 8. One PoC from SQLmap.\n\n\n-----\n\nFigure 9. The decoded PoC from SQLmap.\n\n## Machine Learning Test Results\n\nFor detecting zero day exploits, we trained two machine learning models: one for detecting\nSQL injection attacks, and one for detecting command injection attacks. We prioritize a low\nfalse positive rate in order to minimize adverse effects of deploying these models for\ndetection. For both models, we train on HTTP GET and POST requests. To generate these\ndatasets, we combined multiple sources, including tool-generated malicious traffic, live traffic,\ninternal IPS data sets and more.\n\nFrom ~1.15 million benign and ~1.5 million malicious samples containing SQL queries, our\nSQL model achieved a 0.02% false positive rate and a 90% true positive rate.\n\nFrom ~1 million benign and ~2.2 million malicious samples containing web searches and\npossible command injections, our command injection model achieves a 0.011% false positive\nrate and a 92% true positive rate.\n\nThese detections are particularly useful because they can provide protections against new\nzero-day attacks, while being resistant to small modifications that might evade traditional IPS\nsignatures.\n\n## Conclusion\n\n[Command injection and SQL injection attacks continue to be some of the most common and](https://unit42.paloaltonetworks.com/recent-exploits-network-security-trends/)\nmost concerning threats affecting web applications. While traditional signature-based\nsolutions remain effective against out-of-the-box exploits, they often fail to detect variants; a\nmotivated adversary can make minimum modifications and evade such solutions.\n\nTo combat these ever-evolving threats, we developed a context-based deep learning model\nthat proved to be effective in detecting the latest high profile attacks. Our models were able\nto successfully detect zero-day exploits such as the Atlassian Confluence vulnerability, the\nMoodle vulnerability and the Django vulnerability. These types of flexible detections will\nprove to be critical in providing comprehensive defense in an ever-evolving malware\nlandscape.\n\nTo protect our customers, the [Palo Alto Networks Next-Generation Firewall uses a combined](https://www.paloaltonetworks.com/cyberpedia/what-is-an-ml-powered-ngfw)\ninline and cloud solution. Our traditional IPS solutions remain effective for protecting against\na significant portion of existing exploits, including SQL injections and command injections. In\n\n\n-----\n\naddition, the machine learning models we explored in this blog have the potential to provide\neven more robust protections beyond IPS signatures.\n\n## Additional Resources\n\n[OWASP Top Ten](https://owasp.org/www-project-top-ten/)\n\n[A03: 2021 - Injection](https://owasp.org/Top10/A03_2021-Injection/)\n\n[sqlmap](https://sqlmap.org/)\n\nAn Empirical Evaluation of Generic Convolutional and Recurrent Networks for Sequence\nModeling\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-16 - Zero-Day Exploit Detection Using Machine Learning.pdf"
    ],
    "report_names": [
        "2022-09-16 - Zero-Day Exploit Detection Using Machine Learning.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536101,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1664713510,
    "ts_modification_date": 1664713510,
    "files": {
        "pdf": "https://archive.orkl.eu/9904f2e07126e40a807ef2d4765777093b0bc9a7.pdf",
        "text": "https://archive.orkl.eu/9904f2e07126e40a807ef2d4765777093b0bc9a7.txt",
        "img": "https://archive.orkl.eu/9904f2e07126e40a807ef2d4765777093b0bc9a7.jpg"
    }
}