{
    "id": "5e71c685-2421-4ad4-8c02-cdd7699c3cf7",
    "created_at": "2022-10-25T16:48:11.578225Z",
    "updated_at": "2025-03-27T02:15:55.49982Z",
    "deleted_at": null,
    "sha1_hash": "4929da9c7a9f48feec74f9e95942cc4bcae558e1",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-11-17T07:52:53Z",
    "file_modification_date": "2021-11-17T07:52:53Z",
    "file_size": 232968,
    "plain_text": "# How we protect users from 0-day attacks\n\n**blog.google/threat-analysis-group/how-we-protect-users-0-day-attacks**\n\nJuly 14, 2021\n\nZero-day vulnerabilities are unknown software flaws. Until they’re identified and fixed, they can be exploited by\nattackers. Google’s Threat Analysis Group (TAG) actively works to detect hacking attempts and influence operations to\nprotect users from digital attacks, this includes hunting for these types of vulnerabilities because they can be\nparticularly dangerous when exploited and have a high rate of success.\n\nIn this blog, we’re sharing details about four in-the-wild 0-day campaigns targeting four separate vulnerabilities we’ve\ndiscovered so far this year:\n\n[CVE-2021-21166 and CVE-2021-30551 in Chrome,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-21166)\n\n[CVE-2021-33742 in Internet Explorer, and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-33742)\n\n[CVE-2021-1879 in WebKit (Safari).](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-1879)\n\nThe four exploits were used as a part of three different campaigns. As is our policy, after discovering these 0-days, we\nquickly reported to the vendor and patches were released to users to protect them from these attacks. We assess three\nof these exploits were developed by the same commercial surveillance company that sold these capabilities to two\n[different government-backed actors. Google has also published root cause analyses (RCAs) on each of the 0-days.](https://googleprojectzero.github.io/0days-in-the-wild/rca.html)\n\nIn addition to the technical details, we’ll also provide our take on the large uptick of in-the-wild 0-day attacks the\nindustry is seeing this year. Halfway into 2021, there have been 33 0-day exploits used in attacks that have been\npublicly disclosed this year — 11 more than the total number from 2020. While there is an increase in the number of 0day exploits being used, we believe greater detection and disclosure efforts are also contributing to the upward trend.\n\n## Chrome: CVE-2021-21166 and CVE-2021-30551\n\nOver the past several months, we have discovered two Chrome renderer remote code execution 0-day exploits, CVE[2021-21166 and ​CVE-2021-30551, which we believe to be used by the same actor. CVE-2021-21166 was discovered in](https://chromereleases.googleblog.com/2021/06/stable-channel-update-for-desktop.html)\nFebruary 2021 while running Chrome 88 0 4323 182 and CVE 2021 30551 was discovered in June 2021 while running\n\n\n-----\n\nChrome 91.0.4472.77.\n\nBoth of these 0-days were delivered as one-time links sent by email to the targets, all of whom we believe were in\nArmenia. The links led to attacker-controlled domains that mimicked legitimate websites related to the targeted users.\nWhen a target clicked the link, they were redirected to a webpage that would fingerprint their device, collect system\ninformation about the client and generate ECDH keys to encrypt the exploits, and then send this data back to the\nexploit server. The information collected from the fingerprinting phase included screen resolution, timezone,\nlanguages, browser plugins, and available MIME types. This information was collected by the attackers to decide\nwhether or not an exploit should be delivered to the target. Using appropriate configurations, we were able to recover\ntwo 0-day exploits (CVE-2021-21166 & CVE-2021-30551), which were targeting the latest versions of Chrome on\nWindows at the time of delivery.\n\nAfter the renderer is compromised, an intermediary stage is executed to gather more information about the infected\ndevice including OS build version, CPU, firmware and BIOS information. This is likely collected in an attempt to detect\nvirtual machines and deliver a tailored sandbox escape to the target. In our environment, we did not receive any\npayloads past this stage.\n\nWhile analyzing CVE-2021-21166 we realized the vulnerability was also in code shared with WebKit and therefore\n[Safari was also vulnerable. Apple fixed the issue as CVE-2021-1844. We do not have any evidence that this vulnerability](https://support.apple.com/en-us/HT212223)\nwas used to target Safari users.\n\n**Related IOCs**\n\nlragir[.]org\n\narmradio[.]org\n\nasbares[.]com\n\narmtimes[.]net\n\narmlur[.]org\n\narmenpress[.]org\n\nhraparak[.]org\n\narmtimes[.]org\n\nhetq[.]org\n\n## Internet Explorer: CVE-2021-33742\n\n[Despite Microsoft announcing the retirement of Internet Explorer 11, planned for June 2022, attackers continue to](https://blogs.windows.com/windowsexperience/2021/05/19/the-future-of-internet-explorer-on-windows-10-is-in-microsoft-edge/)\ndevelop creative ways to load malicious content inside Internet Explorer engines to exploit vulnerabilities. For example,\n[earlier this year, North Korean attackers distributed MHT files embedding an exploit for CVE-2021-26411. These files](https://en.wikipedia.org/wiki/MHTML)\nare automatically opened in Internet Explorer when they are double clicked by the user.\n\nIn April 2021, TAG discovered a campaign targeting Armenian users with malicious Office documents that loaded web\ncontent within Internet Explorer. This happened by either embedding a remote ActiveX object using a Shell.Explorer.1\nOLE object or by spawning an Internet Explorer process via VBA macros to navigate to a web page. At the time, we\nwere unable to recover the next stage payload, but successfully recovered the exploit after an early June campaign from\nthe same actors. After a fingerprinting phase, similar to the one used with the Chrome exploit above, users were served\n[an Internet Explorer 0-day. This vulnerability was assigned CVE-2021-33742 and fixed by Microsoft in June 2021.](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-33742)\n\n\n-----\n\nThe exploit loaded an intermediary stage similar to the one used in the Chrome exploits. We did not recover additional\npayloads in our environment.\n\n[During our investigation we discovered several documents uploaded to VirusTotal.](https://www.virustotal.com/gui/)\n\nBased on our analysis, we assess that the Chrome and Internet Explorer exploits described here were developed and\nsold by the same vendor providing surveillance capabilities to customers around the world. On July 15, 2021 Citizen\n[Lab published a report tying the activity to spyware vendor Candiru.](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/)\n\n**Related IOCs**\n\nExamples of related Office documents uploaded to VirusTotal:\n\nhttps://www.virustotal.com/gui/file/656d19186795280a068fcb97e7ef821b55ad3d620771d42ed98d22ee3c635e67/detection\n\nhttps://www.virustotal.com/gui/file/851bf4ab807fc9b29c9f6468c8c89a82b8f94e40474c6669f105bce91f278fdb/detection\n\nUnique URLs serving ​​CVE-2021-33742 Internet Explorer exploit:\n\nhttp://lioiamcount[.]com/IsnoMLgankYg6/EjlYIy7cdFZFeyFqE4IURS1\n\nhttp://db-control-uplink[.]com/eFe1J00hISDe9Zw/gzHvIOlHpIXB\n\nhttp://kidone[.]xyz/VvE0yYArmvhyTl/GzV\n\nWord documents with the following classid:\n\n{EAB22AC3-30C1-11CF-A7EB-0000C05BAE0B}\n\nRelated infrastructure:\n\nworkaj[.]com\n\nwordzmncount[.]com\n\n## WebKit (Safari): CVE-​2021-1879\n\n[Not all attacks require chaining multiple 0-day exploits to be successful. A recent example is CVE-​2021-1879 that was](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-1879)\n[discovered by TAG on March 19, 2021, and used by a likely Russian government-backed actor. (NOTE: This exploit is](https://support.apple.com/en-us/HT212256)\nnot connected to the other three we’ve discussed above.)\n\nIn this campaign, attackers used LinkedIn Messaging to target government officials from western European countries\nby sending them malicious links. If the target visited the link from an iOS device, they would be redirected to an\nattacker-controlled domain that served the next stage payloads. The campaign targeting iOS devices coincided with\ncampaigns from the same actor targeting users on Windows devices to deliver Cobalt Strike, one of which was\n[previously described by Volexity.](https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/)\n\nAfter several validation checks to ensure the device being exploited was a real device, the final payload would be served\n[to exploit CVE-​2021-1879. This exploit would turn off Same-Origin-Policy protections in order to collect authentication](https://en.wikipedia.org/wiki/Same-origin_policy)\ncookies from several popular websites, including Google, Microsoft, LinkedIn, Facebook and Yahoo and send them via\nWebSocket to an attacker-controlled IP. The victim would need to have a session open on these websites from Safari for\ncookies to be successfully exfiltrated. There was no sandbox escape or implant delivered via this exploit. The exploit\n\n\n-----\n\ntargeted iOS versions 12.4 through 13.7. This type of attack, described by Amy Burnett in Forget the Sandbox Escape:\n[Abusing Browsers from Code Execution, are mitigated in browsers with Site Isolation enabled such as Chrome or](https://www.chromium.org/developers/design-documents/site-isolation)\nFirefox.\n\n**Related IOCs**\n\nsupportcdn.web[.]app\n\nvegmobile[.]com\n\n111.90.146[.]198\n\n## Why So Many 0-days?\n\nThere is not a one-to-one relationship between the number of 0-days being used in-the-wild and the number of 0-days\nbeing detected and disclosed as in-the-wild. The attackers behind 0-day exploits generally want their 0-days to stay\nhidden and unknown because that’s how they’re most useful.\n\nBased on this, there are multiple factors that could be contributing to the uptick in the number of 0-days that are\ndisclosed as in-the-wild:\n\n**Increase in detection & disclosure**\n\nThis year, Apple began annotating vulnerabilities in their security bulletins to include notes if there is reason to believe\nthat a vulnerability may be exploited in-the-wild and Google added these annotations to their Android bulletins. When\nvendors don’t include these annotations, the only way the public can learn of the in-the-wild exploitation is if the\nresearcher or group who knows of the exploitation publishes the information themselves.\n\nIn addition to beginning to disclose when 0-days are believed to be exploited in-the-wild, it wouldn’t be surprising if\nthere are more 0-day detection efforts, and successes, occurring as a result. It’s also possible that more people are\nfocusing on discovering 0-days in-the-wild and/or reporting the 0-days that they found in the wild.\n\n**Increased Utilization**\n\nThere is also the possibility that attackers are using more 0-day exploits. There are a few reasons why this is likely:\n\nThe increase and maturation of security technologies and features mean that the same capability requires more 0day vulnerabilities for the functional chains. For example, as the Android application sandbox has been further\nlocked down by limiting what syscalls an application can call, an additional 0-day is necessary to escape the\nsandbox.\nThe growth of mobile platforms has resulted in an increase in the number of products that actors want\ncapabilities for.\nThere are more commercial vendors selling access to 0-days than in the early 2010s.\nMaturing of security postures increases the need for attackers to use 0-day exploits rather than other less\nsophisticated means, such as convincing people to install malware. Due to advancements in security, these actors\nnow more often have to use 0-day exploits to accomplish their goals.\n\n## Conclusion\n\nOver the last decade, we believe there has been an increase in attackers using 0-day exploits. Attackers needing more 0day exploits to maintain their capabilities is a good thing — and it reflects increased cost to the attackers from security\nmeasures that close known vulnerabilities. However, the increasing demand for these capabilities and the ecosystem\nthat supplies them is more of a challenge. 0-day capabilities used to be only the tools of select nation states who had the\ntechnical expertise to find 0-day vulnerabilities, develop them into exploits, and then strategically operationalize their\nuse. In the mid-to-late 2010s, more private companies have joined the marketplace selling these 0-day capabilities. No\nlonger do groups need to have the technical expertise, now they just need resources. Three of the four 0-days that TAG\nhas discovered in 2021 fall into this category: developed by commercial providers and sold to and used by governmentbacked actors.\n\n\n-----\n\nMeanwhile, improvements in detection and a growing culture of disclosure likely contribute to the significant uptick in\n0-days detected in 2021 compared to 2020, but reflect more positive trends. Those of us working on protecting users\nfrom 0-day attacks have long suspected that overall, the industry detects only a small percentage of the 0-days actually\nbeing used. Increasing our detection of 0-day exploits is a good thing — it allows us to get those vulnerabilities fixed\nand protect users, and gives us a fuller picture of the exploitation that is actually happening so we can make more\ninformed decisions on how to prevent and fight it.\n\nWe’d be remiss if we did not acknowledge the quick response and patching of these vulnerabilities by the Apple,\nGoogle, and Microsoft teams.\n\nPOSTED IN:\n\n[Threat Analysis Group](https://blog.google/threat-analysis-group/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.07.14.Candiru_0Day/How%20we%20protect%20users%20from%200-day%20attacks.pdf"
    ],
    "report_names": [
        "How we protect users from 0-day attacks"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1637135573,
    "ts_modification_date": 1637135573,
    "files": {
        "pdf": "https://archive.orkl.eu/4929da9c7a9f48feec74f9e95942cc4bcae558e1.pdf",
        "text": "https://archive.orkl.eu/4929da9c7a9f48feec74f9e95942cc4bcae558e1.txt",
        "img": "https://archive.orkl.eu/4929da9c7a9f48feec74f9e95942cc4bcae558e1.jpg"
    }
}