{
    "id": "5f5ce845-ce65-4a36-a06b-5f6b2cf0b588",
    "created_at": "2022-10-25T16:48:11.367311Z",
    "updated_at": "2025-03-27T02:15:46.065387Z",
    "deleted_at": null,
    "sha1_hash": "cc79d68f7bbad680581f53cc4a797e27ff7f2d6d",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-05-07T07:09:38Z",
    "file_modification_date": "2019-05-07T07:09:38Z",
    "file_size": 306849,
    "plain_text": "# Buckeye: Espionage Outfit Used Equation Group Tools Prior to Shadow Brokers Leak\n\n**[symantec.com/blogs/threat-intelligence/buckeye-windows-zero-day-exploit](https://www.symantec.com/blogs/threat-intelligence/buckeye-windows-zero-day-exploit)**\n\n## Key Findings\n\nThe Buckeye attack group was using Equation Group tools to gain persistent access to target\norganizations at least a year prior to the Shadow Brokers leak.\nVariants of Equation Group tools used by Buckeye appear to be different from those released by\nShadow Brokers, potentially indicating a different origin.\nBuckeye's use of Equation Group tools also involved the exploit of a previously unknown Windows\nzero-day vulnerability. This zero day was reported by Symantec to Microsoft in September 2018 and\npatched in March 2019.\nWhile Buckeye appeared to cease operations in mid-2017, the Equation Group tools it used\ncontinued to be used in attacks until late 2018. It is unknown who continued to use the tools. They\nmay have been passed to another group or Buckeye may have continued operating longer than\nsupposed.\n\nThe 2017 leak of Equation Group tools by a mysterious group calling itself the Shadow Brokers was one of\nthe most significant cyber security stories in recent years. Equation is regarded as one of the most\ntechnically adept espionage groups and the release of a trove of its tools had a major impact, with many\nattackers rushing to deploy the malware and exploits disclosed. One of these tools, the EternalBlue exploit,\nwas used to devastating effect in the [May 2017 WannaCry ransomware outbreak.](https://www.symantec.com/blogs/threat-intelligence/wannacry-ransomware-attack)\n\nHowever, Symantec has now found evidence that the Buckeye cyber espionage group (aka APT3, Gothic\nPanda) began using Equation Group tools in attacks at least a year prior to the Shadow Brokers leak.\n\n\n-----\n\n[Beginning in March 2016, Buckeye began using a variant of DoublePulsar (Backdoor.Doublepulsar), a](https://www.symantec.com/security-center/writeup/2017-042122-0603-99)\nbackdoor that was subsequently released by the Shadow Brokers in 2017. DoublePulsar was delivered to\n[victims using a custom exploit tool (Trojan.Bemstour) that was specifically designed to install DoublePulsar.](https://www.symantec.com/security-center/writeup/2019-041007-3418-99)\n\nBemstour exploits two Windows vulnerabilities in order to achieve remote kernel code execution on\n[targeted computers. One vulnerability is a Windows zero-day vulnerability (CVE-2019-0703) discovered by](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-0703)\n[Symantec. The second Windows vulnerability (CVE-2017-0143) was patched in March 2017 after it was](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0143)\ndiscovered to have been used by two exploit tools—EternalRomance and EternalSynergy—that were also\nreleased as part of the Shadow Brokers leak.\n\nThe zero-day vulnerability allows for the leaking of information and can be exploited in conjunction with\nother vulnerabilities to attain remote kernel code execution. It was reported by Symantec to Microsoft in\nSeptember 2018 and [was patched on March 12, 2019.](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2019-0703)\n\nHow Buckeye obtained Equation Group tools at least a year prior to the Shadow Brokers leak remains\nunknown.\n\nBuckeye disappeared in mid-2017 and three alleged members of the group were [indicted in the U.S. in](https://www.justice.gov/opa/pr/us-charges-three-chinese-hackers-who-work-internet-security-firm-hacking-three-corporations)\nNovember 2017. However, while activity involving known Buckeye tools ceased in mid-2017, the Bemstour\nexploit tool and the DoublePulsar variant used by Buckeye continued to be used until at least September\n2018 in conjunction with different malware.\n\n\n-----\n\n## History of attacks\n\nThe Buckeye attack group had been active since at least 2009, when it began mounting a string of\nespionage attacks, mainly against organizations based in the U.S.\n\n\n-----\n\nThe group has a record of exploiting zero-day vulnerabilities. These include [CVE-2010-3962 as part of an](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-3962)\nattack campaign in 2010 and [CVE-2014-1776 in 2014. Although other zero-day attacks have been](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-1776)\nreported, they have not been confirmed by Symantec. All zero-day exploits known, or suspected, to have\nbeen used by this group are for vulnerabilities in Internet Explorer and Flash.\n\n## Timeline of attacks\n\nBeginning in August 2016, a group calling itself the Shadow Brokers began releasing tools it claimed to\nhave originated from the Equation Group. It initially released samples of the information it had, offering the\nfull trove to the highest bidder. Over the coming months, it progressively released more tools, until April\n2017, when it released a final, large cache of tools, including the DoublePulsar backdoor, the FuzzBunch\nframework, and the EternalBlue, EternalSynergy, and EternalRomance exploit tools.\n\nHowever, Buckeye had already been using some of these leaked tools at least a year beforehand. The\nearliest known use of Equation Group tools by Buckeye is March 31, 2016, during an attack on a target in\nHong Kong. During this attack, the Bemstour exploit tool was delivered to victims via known Buckeye\n[malware (Backdoor.Pirpi). One hour later, Bemstour was used against an educational institution in Belgium.](https://www.symantec.com/security-center/writeup/2010-110314-3703-99)\n\nBemstour is specifically designed to deliver a variant of the DoublePulsar backdoor. DoublePulsar is then\nused to inject a secondary payload, which runs in memory only. The secondary payload enables the\nattackers to access the affected computer even after DoublePulsar is removed. It is worth noting that earlier\nversions did not include any means of uninstalling the DoublePulsar implant. This functionality was added\nin later versions.\n\nA significantly improved variant of the Bemstour exploit tool was rolled out in September 2016, when it was\nused in an attack against an educational institution in Hong Kong. While the original variant was only\ncapable of exploiting 32-bit systems, the new variant could exploit both 32-bit and 64-bit targets, adding\nsupport for newer Windows versions. Another new feature of the payload in the second variant allowed the\nattacker to execute arbitrary shell commands on the infected computer. This custom payload is also\ndesigned to copy arbitrary files and execute arbitrary processes on the targeted computer. When used\nagainst 32-bit targets, Bemstour still delivered the same DoublePulsar backdoor. However, against 64-bit\ntargets it delivered only the custom payload. The attackers typically used it to execute shell commands that\ncreated new user accounts.\n\nBemstour was used again in June 2017 in an attack against an organization in Luxembourg. Unlike earlier\nattacks when Bemstour was delivered using Buckeye’s Pirpi backdoor, in this attack Bemstour was\n[delivered to the victim by a different backdoor Trojan (Backdoor.Filensfer). Between June and September](https://www.symantec.com/security-center/writeup/2019-031316-1951-99)\n2017, Bemstour was also used against targets in the Philippines and Vietnam.\n\nDevelopment of Bemstour has continued into 2019. The most recent sample of Bemstour seen by\nSymantec appears to have been compiled on March 23, 2019, eleven days after the zero-day vulnerability\nwas patched by Microsoft.\n\nThe purpose of all the attacks was to acquire a persistent presence on the victim’s network, meaning\ninformation theft was the most likely motive of the attacks.\n\n\nTar‐\nget\nloca‐\ntions\n\n\nHong\nKong,\nBelgium\n\n\nHong Kong Luxem‐\nbourg\n\n\nPhilippines Vietnam\n\n\n-----\n\nTools Back‐\ndoor.Pirpi\n\nBemstour\nExploit\nTool (V1)\n\nDouble‐\nPulsar\n\n\nUnknown Back‐\ndoor.‐\nFilensfer\n\n\nBemstour Exploit Tool\n(V2)\n\nDoublePulsar (32-bit)\nor custom payload\nonly (64-bit)\n\n\nUnknown Unknown\n\n\nShadow\nBrokers\nLeak\n\n\nBemstour\nExploit\nTool (V1)\n\nDouble‐\nPulsar\n\n\nBemstour Exploit Tool\n(V1 & V2)\n\nDoublePulsar (32-bit)\nor custom payload\nonly (64-bit)\n\n\nBemstour Exploit Tool\n(V2)\n\nDoublePulsar (32-bit)\nor custom payload\nonly (64-bit)\n\n\nTable 1. Buckeye Tool Usage Over Time\n\n## The Filensfer connection\n\nFilensfer is a family of malware that has been used in targeted attacks since at least 2013. Symantec has\nfound multiple versions of the malware, including a C++ version, a compiled Python version (using py2exe),\nand a PowerShell version.\n\nOver the past three years, Filensfer has been deployed against organizations in Luxembourg, Sweden,\nItaly, the UK, and the U.S. Targets included organizations in the telecoms, media, and manufacturing\nsectors. While Symantec has never observed the use of Filensfer alongside any known Buckeye tools,\ninformation shared privately by another vendor included evidence of Filensfer being used in conjunction\n[with known Buckeye malware (Backdoor.Pirpi).](https://www.symantec.com/security-center/writeup/2010-110314-3703-99)\n\n## Bemstour exploit tool\n\nBemstour exploits two Windows vulnerabilities in order to achieve remote kernel code execution on\ntargeted computers.\n\n[The zero-day vulnerability found and reported by Symantec (CVE-2019-0703) occurs due to the way the](https://www.symantec.com/security-center/vulnerabilities/writeup/107228)\nWindows SMB Server handles certain requests. The vulnerability allows for the leaking of information.\n\n[The second vulnerability (CVE-2017-0143) is a message type confusion vulnerability. When the two](https://www.symantec.com/security-center/vulnerabilities/writeup/96703)\nvulnerabilities are exploited together, the attacker can gain full access in the form of kernel mode code\nexecution, enabling them to deliver malware to the targeted computer.\n\nWhen Bemstour was first used in 2016, both vulnerabilities were zero days, although CVE-2017-0143 was\n[subsequently patched by Microsoft in March 2017 (MS17-010). CVE-2017-0143 was also used by two](https://docs.microsoft.com/en-us/security-updates/securitybulletins/2017/ms17-010)\nother exploit tools—EternalRomance and EternalSynergy—that were released as part of the Shadow\nBrokers leak in April 2017.\n\nBuckeye's exploit tool, EternalRomance, as well as EternalSynergy, can exploit the CVE-2017-0143\nmessage type confusion vulnerability to perform memory corruption on unpatched victim computers. In\norder to obtain remote code execution capabilities, all three exploit tools needed to collect information\nabout the memory layout of attacked systems in addition to exploiting the aforementioned message type\nconfusion vulnerability. Each tool performed this differently, relying on different vulnerabilities. In the case of\nthe Buckeye exploit tool, the attackers exploited their own zero-day vulnerability (CVE-2019-0703).\n\n## DoublePulsar development\n\n\n-----\n\nThe variant of DoublePulsar used in the first attacks performed by Buckeye was different to that leaked by\nthe Shadow Brokers. It appears to contain code to target newer versions of Windows (Windows 8.1 and\nWindows Server 2012 R2), indicating that it is a newer version of the malware. It also includes an additional\nlayer of obfuscation. Based on technical features and timing, it is possible that this obfuscation was created\nby DoublePulsar's original authors.\n\nIt is noteworthy that the attackers never used the FuzzBunch framework in its attacks. FuzzBunch is a\nframework designed to manage DoublePulsar and other Equation Group tools and was leaked by the\nShadow Brokers in 2017. This suggests that Buckeye only managed to gain access to a limited number of\nEquation Group tools.\n\n\n-----\n\n## Unanswered questions\n\nThere are multiple possibilities as to how Buckeye obtained Equation Group tools before the Shadow\nBrokers leak. Based on the timing of the attacks and the features of the tools and how they are constructed,\none possibility is that Buckeye may have engineered its own version of the tools from artefacts found in\ncaptured network traffic, possibly from observing an Equation Group attack. Other less supported\n\n\n-----\n\nscenarios, given the technical evidence available, include Buckeye obtaining the tools by gaining access to\nan unsecured or poorly secured Equation Group server, or that a rogue Equation group member or\nassociate leaked the tools to Buckeye.\n\nMystery also surrounds the continued use of the exploit tool and DoublePulsar after Buckeye's apparent\ndisappearance. It may suggest that Buckeye retooled following its exposure in 2017, abandoning all tools\npublicly associated with the group. However, aside from the continued use of the tools, Symantec has\nfound no other evidence suggesting Buckeye has retooled. Another possibility is that Buckeye passed on\nsome of its tools to an associated group.\n\n## Protection\n\nSymantec has the following protection in place to protect customers against these attacks:\n\n**File-based protection**\n\n**Network protection products**\n\n## Indicators of Compromise\n\n\n7020bcb347404654e17f6303848b7ec4 cbe23daa9d2f8e1f5d59c8336d‐\nd5b7d7ba1d5cf3f0d45e66107668e80b073ac3\n\naacfef51a4a242f52fbb838c1d063d9b 53145f374299e673d82d108b133341d‐\nc7bee642530b560118e3cbcdb981ee92c\n\nc2f902f398783922a921df7d46590295 01f53953d‐\nb8ba580ee606043a482f790082460c8cdbd7f‐\nf151d84e03fdc87e42\n\n6458806a5071a7c4fefae084791e8c67 6b1f8b303956c04e24448b1eec8634bd3f‐\nb2784c8a2d12ecf8588424b36d3cbc\n\n0d2d0d8f4989679f7c26b5531096b8b2 7b‐\nfad342ce88de19d090a4cb2ce332022650ab‐\nd68f34e83fdc694f10a4090d65\n\na3932533efc04ac3fe89fb5b3d60128a 3dbe8700ecd27b3dc39643b95b187c‐\ncfd44318fc88c5e6ee6acf3a07cdaf377e\n\n58f784c7a292103251930360f9ca713e 1c9f1c7056864b5fdd491d5‐\ndaa49f920c3388cb8a8e462b2bc34181ce‐\nf6c1f9c\n\na469d48e25e524cf0dec64f01c182b25 951f079031c996c85240831ea1b61507f91990\n282daae6da2841311322e8a6d7\n\n## Threat intelligence\n\n\nPirpi (first variant)\n\nPirpi (second variant)\n\nCommand line utility to list\nuser accounts on remote\nmachine\n\nFilensfer (C/C++)\n\nFilensfer (Powershell)\n\nFilensfer (py2exe)\n\nCommand line SMB client\n\nHTran\n\n\nIn addition to file-based protection, customers of the DeepSight Intelligence Managed Adversary and\nThreat Intelligence (MATI) service have received reports on Buckeye, which detail methods of detecting\nand thwarting activities of this group.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.05.07.Buckeye/Buckeye_%20Espionage%20Outfit%20Used%20Equation%20Group%20Tools%20Prior%20to%20Shadow%20Brokers%20Leak.pdf"
    ],
    "report_names": [
        "Buckeye_ Espionage Outfit Used Equation Group Tools Prior to Shadow Brokers Leak"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1557212978,
    "ts_modification_date": 1557212978,
    "files": {
        "pdf": "https://archive.orkl.eu/cc79d68f7bbad680581f53cc4a797e27ff7f2d6d.pdf",
        "text": "https://archive.orkl.eu/cc79d68f7bbad680581f53cc4a797e27ff7f2d6d.txt",
        "img": "https://archive.orkl.eu/cc79d68f7bbad680581f53cc4a797e27ff7f2d6d.jpg"
    }
}