{
    "id": "5f7787a3-e345-4238-bc4c-ce5271681b25",
    "created_at": "2022-10-25T16:48:11.869881Z",
    "updated_at": "2025-03-27T02:16:26.372201Z",
    "deleted_at": null,
    "sha1_hash": "aaf0f41c26fc8122eed39c863ef7a586f4024808",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-02-02T05:56:58Z",
    "file_modification_date": "2021-02-02T07:56:59Z",
    "file_size": 3272997,
    "plain_text": "# Operation NightScout: Supply‑chain attack targets online gaming in Asia\n\n##### ESET researchers uncover a supply-chain attack used in a cyberespionage operation targeting online‑gaming communities in Asia\n\n[Ignacio Sanmillan](https://www.welivesecurity.com/author/isanmillan/)\n\n1 Feb 2021 - 11:30AM\n\n\nShare\n\n\n[During 2020, ESET research reported various supply-chain attacks, such as the case of WIZVERA VeraPort, used by](https://www.welivesecurity.com/2020/11/16/lazarus-supply-chain-attack-south-korea/)\n\n\n[government and banking websites in South Korea, Operation StealthyTrident compromising the Able Desktop chat software](https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/)\n\n[used by several Mongolian government agencies, and Operation SignSight, compromising the distribution of signing](https://www.welivesecurity.com/2020/12/17/operation-signsight-supply-chain-attack-southeast-asia/)\n\n## \n\nsoftware distributed by the Vietnamese government.\n\n## \n\nIn January 2021, we discovered a new supply-chain attack compromising the update mechanism of NoxPlayer, an Android\n\n## emulator for PCs and Macs, and part of BigNox’s product range with over 150 million users worldwide.\n\nThis software is generally used by gamers in order to play mobile games from their PCs, making this incident somewhat\n\nunusual.\n\nThree different malware families were spotted being distributed from tailored malicious updates to selected victims, with no\n\nsign of leveraging any financial gain, but rather surveillance-related capabilities.\n\nWe spotted similarities in loaders we have been monitoring in the past with some of the ones used in this operation, such as\n\ninstances we discovered in a Myanmar presidential office website supply-chain compromise on 2018, and in early 2020 in an\n\nintrusion into a Hong Kong university.\n\n\n-----\n\nBigNox is a company based in Hong Kong, which provides various products, primarily an Android emulator for PCs and Macs\n\n[called NoxPlayer. The company’s official website claims that it has over 150 million users in more than 150 countries speaking](https://www.bignox.com/about)\n\n20 different languages. However, it’s important to note that the BigNox follower base is predominantly in Asian countries.\n\n[BigNox also wrote an extensive blogpost in 2019 on the use of VPNs in conjunction with NoxPlayer, showing the company’s](https://www.bignox.com/blog/top-10-best-vpn-noxplayer-2019/)\n\nconcern for their users’ privacy.\n\nWe have contacted BigNox about the intrusion, and they denied being affected. We have also offered our support to help\n\nthem past the disclosure in case they decide to conduct an internal investigation.\n\n### Am I compromised?\n\n_Who is affected: NoxPlayer users._\n\n_How to determine if I received a malicious update or not: check if any ongoing process has an active network connection with known active_\nC&C servers, or see if any of the malware based on the file names we provided in the report is installed in:\n```\n    C:\\ProgramData\\Sandboxie\\SbieIni.dat\n    C:\\ProgramData\\Sandboxie\\SbieDll.dll\n    C:\\ProgramData\\LoGiTech\\LBTServ.dll\n    C:\\Program Files\\Internet Explorer\\ieproxysocket64.dll\n    C:\\Program Files\\Internet Explorer\\ieproxysocket.dll\n\n```\na file named %LOCALAPPDATA%\\Nox\\update\\UpdatePackageSilence.exe not digitally signed by BigNox.\n\n_How to stay safe:_\n\nIn case of intrusion – standard reinstall from clean media.\n\nFor non-compromised users: do not download any updates until BigNox notifies that it has mitigated the threat.\n\n### Timeline\n\nBased on ESET telemetry, we saw the first indicators of compromise in September 2020, and activity continued until we\n\nuncovered explicitly malicious activity on January 25, 2021, at which point we reported the incident to BigNox.th\n\n### Victimology\n\nIn comparison to the overall number of active NoxPlayer users, there is a very small number of victims. According to ESET\n\ntelemetry, more than 100,000 of our users have Noxplayer installed on their machines. Among them, only 5 users received a\n\nmalicious update, showing that Operation NightScout is a highly targeted operation. The victims are based in Taiwan, Hong\n\nKong and Sri Lanka.\n\n\n-----\n\n_Figure 1. Asia victimology map_\n\n\nWe were unsuccessful finding correlations that would suggest any relationships among victims. However, based on the\n\ncompromised software in question and the delivered malware exhibiting surveillance capabilities, we believe this may\n\nindicate the intent of collecting intelligence on targets somehow involved in the gaming community.\n\nIt is important to highlight that, in contrast with similar previous operations such as the Winnti Group activity targeting the\n\ngaming industry in 2019, we haven’t found indicators that would suggest indiscriminate proliferation of malicious updates\n\namong a large number NoxPlayer users, reinforcing our belief that this is a highly targeted operation.\n\n### Update mechanism\n\nIn order to understand the dynamics of this supply-chain attack, it’s important to know what vector was used in order to\n\ndeliver malware to NoxPlayer users. This vector was NoxPlayer’s update mechanism.\n\nOn launch, if NoxPlayer detects a newer version of the software, it will prompt the user with a message box (Figure 2) to\n\noffer the option to install it.\n\n\n_Figure 2. NoxPlayer update prompt_\n\n\nThis is done by querying the update server via the BigNox HTTP API (api.bignox.com) in order to retrieve specific update\n\ninformation, as seen in Figure 3.\n\n\n-----\n\n_Figure 3. NoxPlayer client update API request_\n\n\nThe response to this query contains update-specific information such as the update binary URL, its size, MD5 hash and other\n\nadditional related information as seen in Figure 4.\n\n\n_Figure 4. NoxPlayer server API reply_\n\n\nUpon pressing the “Update now” button from Figure 1, the main NoxPlayer binary application Nox.exe will supply the\n\nupdate parameters received to another binary in its toolbox NoxPack.exe, which is in charge of downloading the update\n\nitself, as can be seen in Figure 5.\n\n\n_Figure 5. NoxPlayer execution chain on update_\n\n\nAfter this is done, the progress bar in the message box will reflect the state of the download (Figure 6), and when completed\n\nthe update has been performed.\n\n\n_Figure 6. NoxPlayer update ongoing via_\n```\n     NoxPack.exe\n\n```\n\n-----\n\nWe have sufficient evidence to state that the BigNox infrastructure (res06.bignox.com) was compromised to host\n\nmalware, and also to suggest that their HTTP API infrastructure (api.bignox.com) could have been compromised. In some\n\ncases, additional payloads were downloaded by the BigNox updater from attacker-controlled servers. This suggests that the\n\nURL field, provided in the reply from the BigNox API, was tampered with by the attackers. The intrusion flow observed is\n\ndepicted in Figure 7.\n\n\n_Figure 7. Intrusion flow sequence diagram_\n\n\nAn overview of what’s shown in the sequence diagram above is the following:\n\n1. On launch, the primary NoxPlayer executable Nox.exe will send a request via the API to query update information.\n\n2. The BigNox API server responds to the client request with specific update information, including the URL to download the update from\n\nBigNox legitimate infrastructure.\n\n3. `Nox.exe provides the appropriate parameters to NoxPlayer.exe to download the update.`\n\n4. The legitimate update stored in BigNox infrastructure could have been replaced with malware, or it may be a new filename/URL not used\n\nby legitimate updates.\n\n5. Malware is installed on the victim’s machine. Contrary to legitimate BigNox updates, the malicious files are not digitally signed, strongly\n\nsuggesting that the BigNox build system was not compromised, but just its systems that distribute updates.\n\n6. Some reconnaissance of the victim is performed and information sent to the malware operators.\n\n7. The perpetrators tailor malicious updates to specific victims of interest based on some unknown filtering scheme.\n\n8. `Nox.exe will perform sporadic update requests.`\n\n9. The BigNox API server responds to the client with update information, which states that the update is stored in the attacker-controlled\n\ninfrastructure.\n\n10. Further malware gets delivered to selected victims.\n\nWith this information we can highlight several things:\n\nLegitimate BigNox infrastructure was delivering malware for specific updates. We observed that these malicious updates were only\ntaking place in September 2020.\n\n\n-----\n\nIt could also suggest the possibility that victims were subjected to a MitM attack, although we believe this hypothesis is unlikely since\nthe victims we discovered are in different countries, and attackers already had a foothold on the BigNox infrastructure.\n\nFurthermore, we were able to reproduce the download of the malware samples hosted on res06.bignox.com from a test machine\nand using https. This discards the possibility that a MitM attack was used to tamper the update binary.\n\nIt is also important to mention that malicious updates downloaded from the attacker-controlled infrastructure mimicked the\n\npath of legitimate updates:\n\nMalicious update to attacker-controlled infrastructure:\n```\n   http://cdn.cloudfronte[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\n\n```\nLegitimate NoxPlayer update:\n```\n   http://res06.bignox[.]com/player/upgrade/202012/1b31bced0a564bed9f60264f061dcdae.exe\n\n```\nFurthermore, registered attacker-controlled domain names mimicked the BigNox CDN network domain name, that being\n```\ncloudfront.net.\n\n```\nThese indicators suggest that attackers were trying to avoid detection so that they could remain under the radar and\n\nachieve long-term persistence.\n\n### Malware\n\nA total of three different malicious update variants were observed, each of which dropped different malware. These variants\n\nare the following:\n\n#### Malicious Update variant 1\n\nThis variant is one of the preliminary updates pointing to compromised BigNox infrastructure. Our analysis is based on the\n\nsample with SHA-1 CA4276033A7CBDCCDE26105DEC911B215A1CE5CF.\n\nThe malware delivered does not seem to have been documented before. It is not extremely complex, but it has enough\n\ncapabilities to monitor its victims. The initial RAR SFX archive drops two DLLs into\n```\nC:\\Program Files\\Internet Explorer\\ and runs one of them, depending on architecture, via rundll32.exe. The\n\n```\nnames of these DLLs are the following:\n```\n   ieproxysocket64.dll\n   ieproxysocket.dll\n\n```\nIt also drops a text file named KB911911.LOG to disk, into which the original name of the SFX installer will be written. The\n\nDLL attempts to open and read this log file, and if not found will stop execution, therefore implementing an execution\n\nguardrail.\n\n\n-----\n\n```\n   winlogon.exe\n   csrss.exe\n   wininit.exe\n   services.exe\n   explorer.exe\n\n```\nThe IP address of the machine will be checked to verify that it is neither 127.0.0.1 nor 0.0.0.0; if it is, it will be rechecked\n\nin an infinite loop until it changes. Otherwise, it will proceed to extract the UUID of the current machine via a WMI object\n\nquery. This returned UUID is hashed using MD5 to serialize the current victim. Account name information will also be\n\nretrieved and saved.\n\nAn encrypted configuration will be retrieved from the DLL’s resource. This configuration is encrypted using a two-byte XOR\n\nwith 0x5000. The encrypted configuration is partially visible given the weakness of the key used:\n\n\n_Figure 8. Encrypted configuration in resources_\n\n\nThe format of this configuration is the following (roughly):\n\nOffset Size Comment\n\n0x00 0x08 Fake JPG header magic\n\n0x08 0x12C Buffer holding tokenized C&C information\n\n0x134 0x14 Buffer holding port for C&C communication\n\n0x148 0x14 Sleep time\n\n0x15C 0x14 Operate flag; don’t operate with network monitoring tools deployed or if this flag is set\n\n0x170 0x14 N/A\n\n0x184 0x14 DNS flag; append a token at the end of a hostname buffer with either |UDP or |DNS, depending on the value of this field\n\n\n-----\n\ng p p p p g g p\n\nrunning:\n```\n   netman.exe\n   wireshark.exe\n\n```\nThe backdoor can use either a raw IP address or a domain name to communicate with the C&C server. After successful\n\nconnection to the C&C, the malware will be able to perform the following commands:\n\nCommand ID Specification\n\ngetfilelist-delete Delete specified files from the disk\n\ngetfilelist-run Run a command via the WinExec API\n\ngetfilelist-upload Upload a file via ScreenRDP.dll::ConnectRDServer\n\ngetfilelist-downfile1 Download a specific file\n\ngetfilelist-downfile2 Download a specific directory\n\ngetfilelist-downfile3 Same as getfilelist-downfile2\n\n<default> \\\\tsclient drive redirection of certain directories (starting with A: for range(0x1A))\n\n\n_Figure 9. Anatomy of malicious update variant 1_\n\n\n#### Malicious Update variant 2\n\nThis malware variant was also spotted being downloaded from legitimate BigNox infrastructure. Our analysis is based on the\n\nsample with SHA-1 E45A5D9B03CFBE7EB2E90181756FDF0DD690C00C.\n\nIt contains several files comprising what is known as a trident bundle, in which a signed executable is used to load a\n\nmalicious DLL which will decrypt and load a shellcode implementing a reflective loader for the final payload\n\n\n-----\n\np g\n\nFilename Description\n\n`C:\\ProgramData\\Sandboxie\\SandboxieBITS.exe` Signed Sandboxie COM Services (BITS)\n\n`C:\\ProgramData\\Sandboxie\\SbieDll.dll` Malicious hijacked DLL\n\nMalicious encrypted payload; decrypts a reflectively loaded instance of\n```\n C:\\ProgramData\\Sandboxie\\SbieIni.dat\n```\nGh0st RAT\n\n`C:\\Users\\Administrator\\AppData\\Local\\Temp\\delself.bat` Script to self-delete the initial executable\n\n`C:\\Windows\\System32\\wmkawe_3636071.data` Text file containing the sentence Stupid Japanese\n\nWe have encountered other instances of this same text file, dropped by a very similar loader in a supply-chain compromise\n\ninvolving the Myanmar presidential office website in 2018, and in an intrusion into a Hong Kong university in 2020.\n\n[The deployed final payload was a variant of Gh0st RAT with keylogger capabilities.](https://attack.mitre.org/software/S0032/)\n\n\n_Figure 10. Anatomy of malicious update variant 2_\n\n\n#### M li i U d t i t 3\n\n\n-----\n\ny p\n```\nAA3D31A1A6FE6888E4B455DADDA4755A6D42BEEB.\n\n```\nSimilarly, as with the previous variant, this malicious update comes bundled in an MFC file, and extracts two components: a\n\nbenign signed file and a dependency of it. The components are:\n\nFilename Description\n\n`C:\\ProgramData\\LoGiTech\\LoGitech.exe` Signed Logitech binary\n\n`C:\\ProgramData\\LoGiTech\\LBTServ.dll` Malicious DLL decrypts and reflectively loads an instance of PoisonIvy\n\nOn the most recently discovered victims, the initial downloaded binary was written in Delphi, while for previous victims the\n\nsame attacker-controlled URL dropped a binary written in C++. These binaries are the initial preliminary loaders. Although\n\nthe loaders were written in different programming languages, both versions deployed the same final payload, that being an\n\n[instance of the PoisonIvy RAT.](https://attack.mitre.org/software/S0012/)\n\n\n_Figure 11. Anatomy of malicious update variant 3_\n\n\n### Conclusion\n\n[We have detected various supply-chain attacks in the last year, such as Operation SignSight or the compromise of Able](https://www.welivesecurity.com/2020/12/17/operation-signsight-supply-chain-attack-southeast-asia/)\n\nDesktop among others. However, the supply-chain compromise involved in Operation NightScout is particularly interesting\n\ndue to the targeted vertical, as we rarely encounter many cyberespionage operations targeting online gamers.\n\nSupply-chain attacks will continue to be a common compromise vector leveraged by cyber-espionage groups, and its\n\ncomplexity may impact the discovery and mitigation of these type of incidents.\n\n_For any inquiries, or to make sample submissions related to the subject, contact us at: threatintel@eset.com._\n\n### Acknowledgement\n\n\n-----\n\n### Files\n\nSHA-1 ESET detection name Decription\n\n`CA4276033A7CBDCCDE26105DEC911B215A1CE5CF` Win32/Agent.UOJ Malicious Update variant 1\n\n`E45A5D9B03CFBE7EB2E90181756FDF0DD690C00C` Win32/GenKryptik.ENAT Malicious Update variant 2\n\n`AA3D31A1A6FE6888E4B455DADDA4755A6D42BEEB` Win32/Kryptik.HHBQ Malicious Update variant 3\n\n`5732126743640525680C1F9460E52D361ACF6BB0` Win32/Delf.UOD Malicious Update variant 3\n\n### C&C servers\n```\n210.209.72[.]180\n103.255.177[.]138\n185.239.226[.]172\n45.158.32[.]65\ncdn.cloudistcdn[.]com\nq.cloudistcdn[.]com\nupdate.boshiamys[.]com\n\n Malicious update URLs\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201101/1/bf571cb46afc144cab53bf940da88fe2.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201123/1/2ca0a5f57ada25657552b384cf33c5ec.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201225/7c21bb4e5c767da80ab1271d84cc026d.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20210119/842497c20072fc9b92f2b18e1d690103.exe\nhttps://cdn.cloudfronte[.]com/player/upgrade/ext/20201020/1/c697ad8c21ce7aca0a98e6bbd1b81dff.exe\nhttp://cdn.cloudfronte[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\nhttp://res06.bignox[.]com/player/upgrade/202009/6c99c19d6da741af943a35016bb05b35.exe\nhttp://res06.bignox[.]com/player/upgrade/202009/42af40f99512443cbee03d090658da64.exe\n\n MITRE ATT&CK techniques\n\n```\n_[Note: This table was built using version 8 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)_\n\nTactic ID Name Description\n\nSupply Chain Compromise: Compromise\nInitial Access [T1195.002](https://attack.mitre.org/techniques/T1195/002/) Malware gets delivered via NoxPlayer updates.\nSoftware Supply Chain\n\nMalicious update variant 3 instances will be executed via\nExecution [T1053.005](https://attack.mitre.org/techniques/T1053/005/) Scheduled Task/Job: Scheduled Task\nScheduled task.\n\nMalicious update variant 2 instances will be executed via service\n\n\n-----\n\nDefense\nEvasion\n\n\nMalicious update variant 2 and 3 will be contained in \"trident\"\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfuscate/Decode Files or Information\nbundles for evasion purposes.\n\nMalicious updates shipped as \"trident\" bundles will perform DLL\n[T1574.002](https://attack.mitre.org/techniques/T1574/002/) Hijack Execution Flow: DLL Side-Loading\nside loading.\n\n\nSome of the final payloads such as PoisonIvy and Gh0st RAT\nCollection [T1056.001](https://attack.mitre.org/techniques/T1056/001/) Input Capture:Keylogging\nhave keylogging capabilities.\n\nThe PoisonIvy final payload variant has capabilities to\n[T1090.001](https://attack.mitre.org/techniques/T1090/001/) Proxy: Internal Proxy\nauthenticate with proxies.\n\n\nCommand and\nControl\n\n\nAll malicious update instances communicate over raw TCP or\n[T1095](https://attack.mitre.org/techniques/T1095/) Non-Application Layer Protocol\nUDP.\n\nBoth PosionIvy and Gh0st RAT use encrypted TCP\n[T1573](https://attack.mitre.org/techniques/T1573/) Encrypted Channel\ncommunication to avoid detection.\n\n\nExfiltration in all malicious updates instances is done over a\nExfiltration [T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over C2 Channel\nCommand and Control channel.\n\n\n\n[Ignacio Sanmillan](https://www.welivesecurity.com/author/isanmillan/)\n\n1 Feb 2021 - 11:30AM\n\n###### Newsletter\n\n\nEmail... Submit\n\n\n###### Similar Articles\n\n[CYBERCRIME](https://www.welivesecurity.com/category/cybercrime/) [MALWARE](https://www.welivesecurity.com/category/malware/) [MALWARE](https://www.welivesecurity.com/category/malware/) [MALWARE](https://www.welivesecurity.com/category/malware/)\n\n\n[MALWARE](https://www.welivesecurity.com/category/malware/)\n\n\n[CYBERCRIME](https://www.welivesecurity.com/category/cybercrime/)\n\n\nEmotet botnet disrupted in global\noperation\n\n###### Discussion\n\n\n[MALWARE](https://www.welivesecurity.com/category/malware/)\n\n\nVadokrist: A wolf in sheep's\nclothing\n\n\n[MALWARE](https://www.welivesecurity.com/category/malware/)\n\n\nOperation Spalax: Targeted\nmalware attacks in Colombia\n\n\n7 ways malware can get into your\ndevice\n\n\nHome\n\nAbout Us\n\n\nSitemap\n\nOur Experts\n\n\nResearch\n\nHow To\n\n\nRSS Configurator\n\nNews Widget\n\n\n-----\n\n[Privacy policy](https://www.welivesecurity.com/privacy/) [Legal Information](https://www.welivesecurity.com/legal-information/) Copyright © ESET, All Rights Reserved\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.02.01.Operation_NightScout/operation-nightscout-supply-chain-attack-online-gaming-asia.pdf"
    ],
    "report_names": [
        "operation-nightscout-supply-chain-attack-online-gaming-asia"
    ],
    "threat_actors": [
        {
            "id": "068b67c8-604c-4272-b808-350413fa9ee3",
            "created_at": "2022-10-25T16:07:23.975708Z",
            "updated_at": "2025-03-27T02:02:10.058689Z",
            "deleted_at": null,
            "main_name": "Operation NightScout",
            "aliases": [],
            "source_name": "ETDA:Operation NightScout",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbdb2d7d-4bf4-4100-a108-f4742cfd69ff",
            "created_at": "2022-10-25T16:07:24.01101Z",
            "updated_at": "2025-03-27T02:02:10.074776Z",
            "deleted_at": null,
            "main_name": "Operation SignSight",
            "aliases": [],
            "source_name": "ETDA:Operation SignSight",
            "tools": [
                "Mimikatz",
                "PhantomNet",
                "SManager"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "64d750e4-67db-4461-bae2-6e75bfced852",
            "created_at": "2022-10-25T16:07:24.01415Z",
            "updated_at": "2025-03-27T02:02:10.077988Z",
            "deleted_at": null,
            "main_name": "Operation Spalax",
            "aliases": [],
            "source_name": "ETDA:Operation Spalax",
            "tools": [
                "AsyncRAT",
                "Bladabindi",
                "Jorik",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b5550c4e-943a-45ea-bf67-875b989ee4c4",
            "created_at": "2022-10-25T16:07:23.675771Z",
            "updated_at": "2025-03-27T02:02:09.918749Z",
            "deleted_at": null,
            "main_name": "Gelsemium",
            "aliases": [
                "Operation NightScout",
                "Operation TooHash"
            ],
            "source_name": "ETDA:Gelsemium",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agentemis",
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "Chrommme",
                "Cobalt Strike",
                "CobaltStrike",
                "FireWood",
                "Gelsemine",
                "Gelsenicine",
                "Gelsevirine",
                "JuicyPotato",
                "OwlProxy",
                "Owowa",
                "SAMRID",
                "SessionManager",
                "SinoChopper",
                "SpoolFool",
                "SweetPotato",
                "WolfsBane",
                "cobeacon",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1612245418,
    "ts_modification_date": 1612252619,
    "files": {
        "pdf": "https://archive.orkl.eu/aaf0f41c26fc8122eed39c863ef7a586f4024808.pdf",
        "text": "https://archive.orkl.eu/aaf0f41c26fc8122eed39c863ef7a586f4024808.txt",
        "img": "https://archive.orkl.eu/aaf0f41c26fc8122eed39c863ef7a586f4024808.jpg"
    }
}