{
    "id": "5f8ec832-17bd-491f-9670-81e206f5f655",
    "created_at": "2023-06-23T02:08:48.928775Z",
    "updated_at": "2025-03-27T02:10:20.602205Z",
    "deleted_at": null,
    "sha1_hash": "5c12e659a63f7b413df4a32d0aa978ce4e93167b",
    "title": "OilAlpha: A Likely Pro-Houthi Group Targeting Entities Across the Arabian Peninsula",
    "authors": "",
    "file_creation_date": "2023-05-15T15:36:54Z",
    "file_modification_date": "2023-05-15T15:40:59Z",
    "file_size": 5690260,
    "plain_text": "###### CYBER\n\n THREAT\n\n ANALYSIS By Insikt Group®\n\n**YEMEN**\n\nMay 16, 2023\n\n# OilAlpha: \n## A Likely Pro-Houthi Group Targeting\n\n\n-----\n\n### Executive Summary\n\nSince May 2022, Insikt Group has tracked an ongoing campaign by a threat group which is highly likely\nto have targeted entities associated with the non-governmental, media, international humanitarian, and\ndevelopment sectors. It is almost certain that the entities targeted shared an interest in Yemen,\nsecurity, humanitarian aid, and reconstruction matters. It is highly likely that OilAlpha threat actors were\ninvolved in espionage activity, as handheld devices were targeted with remote access tools (RATs) like\nSpyNote and SpyMax. Our assessment of the victimology suggests that the majority of the targeted\nentities were Arabic-language speakers and operated Android devices.\n\nThe observed tactics, techniques, and procedures (TTPs) associated with this threat activity has\nincluded the almost exclusive use of Dynamic DNS (DDNS) for command and control (C2). Additionally,\nthe threat actors used domain naming conventions associated with international, Saudi Arabian, and\nUnited Arab Emirates (UAE) humanitarian organizations, as well as media organizations, in addition to\nnon-attributable entities; the threat actors also used encrypted chat messengers, like WhatsApp, to\ntarget victims.\n\nWe previously tracked this threat activity under the temporary designators TAG-41 and TAG-62. Insikt\nGroup is combining these threat clusters under the cryptonym OilAlpha due to overlapping TTPs and\nour increased confidence that the activities we have observed are coordinated by a single entity.\nOilAlpha is predominantly engaged in espionage, and at the time of this writing, it is likely acting in the\ninterest of the Houthi movement. The following factors have influenced our assessment:\n\n1. OilAlpha has relied on infrastructure (PTC) reported to be under the direct control of the Houthi\nauthorities.\n2. The group’s operations have reportedly included targeting persons attending Saudi Arabian\n\ngovernment-led negotiations; coupled with the use of spoofed Android applications mimicking\nentities tied to the Saudi Arabian government, and a UAE humanitarian organization (among\nothers), we suspect that the attackers are targeting individuals the Houthis want direct access\nto.\n\n| f\n\n\n-----\n\n### Key Findings\n\n  - OilAlpha is a threat activity group targeting political representatives, media, and journalists for\nespionage. The group spoofs various international humanitarian organizations, including entities\nin the Arabian Peninsula and a Norwegian non-governmental organization (NGO).\n\n  - OilAlpha has used Android remote access trojans (RATs) like SpyNote and SpyMax. We have also\nobserved njRAT samples communicating with C2s associated with this group, making it likely\nthat OilAlpha has used other malware for testing or attack operations.\n\n  - OilAlpha used encrypted chat messengers like WhatsApp to launch social engineering attacks\nagainst its targets. It has also used URL link shorteners.\n\n  - OilAlpha has almost exclusively relied on infrastructure associated with the Public\nTelecommunication Corporation (PTC), a Yemeni government-owned enterprise. All of the\nDynamic DNS (DDNS) domains identified as part of our research resolved to IP addresses owned\nby the PTC.\n\n  - OilAlpha is likely from Yemen; while analysis of its political allegiance remains fluid, as of this\nwriting, we are linking this activity to threat actors which support a pro-Houthi movement\nagenda.\n\n  - The activity Insikt Group is linking to OilAlpha is not unique throughout the Middle Eastern region.\nVarious campaigns have been disclosed since 2018 highlighting espionage threats to\nsmartphones and personnel from multiple sectors, including military and security, academia, the\nmedia, and international humanitarian groups. Many regional espionage groups conduct\ncampaigns that solely target handheld devices. As handheld devices continue to fulfill a growing\nrole in corporate and personal environments, attacks targeting them will continue in the medium\nto long term.\n\n| f\n\n\n-----\n\n### Initial Detection of Threat Activity\n\n##### Background\n\nOn April 14, 2022, Yemen-based open sources [revealed that malicious Android applications were](https://mobile.twitter.com/AdenHurra/status/1514711441122762762)\ndisseminated to journalists and media representatives through lures associated with Yemeni\ndevelopment and security matters. The Android applications (APKs) were sent from WhatsApp accounts\nusing Saudi Arabian telephone numbers to Yemeni nationals. For example, as depicted in Figure 1, an\nalleged communique from the Security Belt Forces, which is an armed wing of the Southern Movement\n(South Yemen Movement, and al-Hirak) is visible along with an app called “YEMENOFKSA.apk”. The\napplications were created using other themes as well, such as “Saudi-Yemen Development App”, and\nwere reportedly accessible via Google Play and Apple’s App Store. The [application identified in open](https://mobile.twitter.com/AdenHurra/status/1514711441122762762)\nsources is listed as SpyNote in a public malware repository by a large number of antivirus engines.\nNetwork analysis associated with this application suggested it was configured to communicate via\nHTTP on port 5551.\n\n**[Figure 1: Messages reportedly sent to targets from Saudi Arabian telephone numbers (Source: Meta 1, 2, 3)](https://www.facebook.com/adenfree/photos/pcb.5489087581123113/5489087411123130/)**\n\n| f\n\n\n-----\n\nThe threat actors targeted their victims with social engineering techniques. Open source reports listed\ninstances in which political [representatives,](https://alkhabaralyemeni.net/2022/04/14/168377/) [media personalities, or journalists were reportedly sent](https://www.facebook.com/bayazid707/posts/5015004495255481)\nmessages around the time that [negotiations](https://alkhabaralyemeni.net/2022/04/14/168377/) were hosted in Saudi Arabia, in April 2022. The attacks\ntranspired via encrypted chat messengers, like WhatsApp. While the first and only wave of social\nengineering attacks were detected and reported between April and May 2022, our tracking of DNS\nresolution changes for that attacker's domains suggests the threat actors are still active and are highly\nlikely continuing their operations.\n\n##### Insikt Research\n\n**TAG-41 and TAG-62: Graduating to OilAlpha**\n\nInsikt Group observed that the aforementioned [applications were associated with at least 2 DDNS](https://www.facebook.com/adenfree/photos/pcb.5489087581123113/5489087411123130/)\ndomain clusters that acted as C2 infrastructure (Table 1) for different applications. The DDNS clusters\nalmost exclusively used infrastructure associated with Yemen’s Public Telecommunication Corporation\n(PTC) (AS30873). Throughout March 2023, we also observed threat actors using infrastructure\nassociated with the France-based dynamic infrastructure provider IELO-LIAZO Services SAS\n(AS29075).\n\nThe applications were developed using SpyNote or SpyMax, and the file names used similar\ninternational humanitarian, development and reconstruction, or security themes. Throughout 2022 and\nearly 2023, we tracked these threat clusters with temporary designations as TAG-41 and TAG-62;\nhowever, due to their overlapping TTPs, we are graduating these threat clusters to “OilAlpha”.\n\n**Malware, Lures, and Infrastructure**\n\n[Analysis of the malware in sandbox environments (1,](https://tria.ge/230309-1xfnpacb6s/behavioral1) [2,](https://tria.ge/230329-eeykwsgc7y/behavioral3) [3,](https://tria.ge/230329-ep3mlaef65/behavioral1) [4,](https://www.hybrid-analysis.com/sample/2028ede216c0cbf803d2d2e07415d0dd44c9d495ed9a3c63ec6645a770ad5443?environmentId=200) [5,](https://www.hybrid-analysis.com/sample/48e4533ff3e121fd5e3a514206d3bfdde621d800d319dc7d157041aba06b8399?environmentId=200) [6,](https://tria.ge/230402-25csfabe46/behavioral1) [7, 8, 9, 10) depicted intrusive](https://tria.ge/230402-3d8apsbf23/behavioral2#report)\ncharacteristics commonly associated with SpyNote and SpyMax; these included permissions to access\ncall logs, SMS data, contact information, network information, access to the device’s camera and audio,\nas well as GPS location data, among others.\n\n| f\n\n\n-----\n\n|C2 DDNS|IP Address|File Name|SHA256 Hash|\n|---|---|---|---|\n|87524uyre.ddns[.]net|134.35.15[.]220|ةيدقنلاتادعاسملاتايئاصحاوملعاتسا apk.نيحزانللةدقملا Inquiry and statistics of cash assistance provided to the displaced|1f1cdd9acd9e581f538bdefc 1ec5f0aebcc57cfccf5a4a93 89f35c8741242e32|\n|mylab123321hm.ddns[.]net|134.35.130[.]126|WhatsApp.apk|8846b72ed2ecde60b805cf af5d1f71e34742a18177ff3c4 d8d5b9c3f250e153d|\n|77112hilan.ddns[.]net|134.35.0[.]119|ةحرتقملاةماعلاةطخلا apk.نميلامعدلل Proposed general plan for Yemeni Support|2b7d2490bfc4eacd3e5870a e0de92fdb5c1f11a5e8fdc7c 07773780c6db038d9|\n|antahomaar2022.ddns[.]net|134.35.11[.]141|ليربارهشلهينميلاهيروهمجللمعدلاجمانرب apk.2022 The support program for the republic of Yemen for April|ad990791d595c149f6770d0 8be6411b88f9dab2ed56bf6 1fd274bea2327f17c3|\n|manyouhomaar21.ddns[.]net|109.200.165[.]170|apk.رامثتسلااوهيمنتلاقودنص Development and Investment Fund|2c2393a061901e13b9fc038 bb25ba666fbff25d304c6de c51bac10a46dbd1fe6|\n|Gomnd2873yemnenrc.ddns [.]net|134.35.11[.]130|apk.ملتاسلااطاقن Receipt Points|7d21d3dce90408ca530c5e 2364495d4f0932cdd23d81 2e4714e3665c06bfc560|\n|ndf236fgh4367h.ddns[.]net|134.35.2[.]7|رهشلةيدقنلاتلااوحلانمنيديفتسملاءامسا apk.رياربف The names of the beneficiaries of cash transfers for February|92420eb9356e103864ba5e dcffe98d6a5ecfe13f758003 5202dea1a32739b256|\n|Akjdaks54678sdas.ddns[.] net|134.35.1[.]116|unicef.apk|b0c54756dd5c53d13be190 952fe63c1b9e1989f8673ab 549d19035207f01d901|\n|7687ytuyt78gfg.ddns[.]net|134.35.217[.]64|apk.ةكرتشملاتايلمعلالصاوت Continuation of Joint Operations|8bcc816a517ecdb72e6f97c 53c4e40da8d96ebae239eb 7f760c29bd943d1b722|\n\n\n**Table 1: DDNS domain cluster and samples linked to OilAlpha (Source: Recorded Future)**\n\n\n| f\n\n\n-----\n\nAdditionally, file icons associated with the samples were dropped in the sandbox environment,\nproviding insight about the possible victimology. The icons spoof regional political organizations such\nas the Gulf Cooperation Council (GCC), the United Nations, and regional non-governmental\norganizations (NGO) such as Project MASAM, a Saudi Arabian entity dedicated to landmine clearance\nefforts, and the UAE's Red Crescent Society, an international humanitarian organization. In a few\ninstances the icons remained unidentifiable, although the imagery appeared to mimic emblems\nassociated with the Saudi Arabian government, as depicted in Figure 2 (far right).\n\n**Figure 2: File icons associated with the Android malware, in order of appearance (left to right); GCC, Project MASAM, Emirates**\n\nRed Crescent, Yemeni Joint Forces, and a Saudi Arabian government emblem (Source: Recorded Future and Hybrid Analysis)\n\nA DDNS domain managed by OilAlpha acted as C2 for applications masquerading as WhatsApp, or as\nan adjunct application serving to \"protect WhatsApp\" (واتساب حماية) (Figure 3). In April 2021, a sample\n[called “WhatsApp.apk” was first submitted to a public malware repository and was identified as](https://www.virustotal.com/gui/file/8846b72ed2ecde60b805cfaf5d1f71e34742a18177ff3c4d8d5b9c3f250e153d/relations)\nSpyNote by a large number of antivirus engines. It shared similar intrusive requests and is detectable in\nthe Applications Information directory of the Android emulator in the sandbox environment.\n\n**[Figure 3: WhatsApp protection application linked to OilAlpha DDNS domain (Source: Recorded Future)](https://tria.ge/230328-2jh3bsfd5x/behavioral3)**\n\n| f\n\n\n-----\n\nAs depicted in Figure 1, the threat actors also made use of a URL shortener, 2u[.]pw . The URL\nshortener claims to be a regional Arabic-language service, used throughout the Middle East, that offers\nits users analytics and marketing services, much like bit[.]ly.\n\nIn early 2023, Insikt Group identified 3 more malware samples associated with these threat clusters:\n[“unjobs.apk”, “KSA-YEMEN.apk”, and “NRC ES.apk”. The 3 samples used mylab123321hm.ddns[.]net for](https://www.virustotal.com/gui/file/8d07dc0745e57aeb40905a7426fb6515930a1fc7898db0ee93fda55ba085461b)\nC2; as noted above, the domain was identified in early Insikt Group reporting affiliated with TAG-41 and\nthe malware associated with these samples was classified in multiple repositories as SpyNote.\n\n**C2 DDNS** **IP Address** **ASN** **File Name** **SHA256 Hash**\n\nmylab123321hm.ddns[.]net 134.35.10[.]166 AS30873 unjobs.apk 8d07dc0745e57aeb4090\n\n5a7426fb6515930a1fc78\n98db0ee93fda55ba0854\n\n61b\n\nmylab123321hm.ddns[.]net 134.35.2[.]3 AS30873 KSA-YEMEN.apk 7e6ec9df5e2218b5ad411\n1059f799e1348c06f98cb\n0f0742f86aae1875c6fd13\n\nmylab123321hm.ddns[.]net 134.35.10[.]61 AS30873 NRC ES.apk eb8edfd04c0d1e0b03f46\n\n29519800c8b043110dbe\n94a70406c60d5a009f72\n\n3fe\n\ngoman239.ddns[.]net 134.35.11[.]92 AS30873 KSR HM.apk f3f3764ee6a0e5b933e9\n5040092e0b348f672aaa\nb273cf8eaaeabca28be5d\n\na36\n\n**Table 2: SpyNote and SpyMax samples linked to OilAlpha DDNS domains (Source: Recorded Future)**\n\n[In March 2023, Insikt Group identified an additional malware sample called “KSR HM.apk”. We executed](https://www.virustotal.com/gui/file/f3f3764ee6a0e5b933e95040092e0b348f672aaab273cf8eaaeabca28be5da36)\nit in Recorded Future's sandbox environment and revealed an icon linked to the Saudi Arabian King\nSalman Humanitarian Aid & Relief Centre (Figure 4). This is the same organization which was spoofed\nvia OilAlpha's KSA-YEMEN application referenced in Table 2.\n\n|C2 DDNS|IP Address|ASN|File Name|SHA256 Hash|\n|---|---|---|---|---|\n|mylab123321hm.ddns[.]net|134.35.10[.]166|AS30873|unjobs.apk|8d07dc0745e57aeb4090 5a7426fb6515930a1fc78 98db0ee93fda55ba0854 61b|\n|mylab123321hm.ddns[.]net|134.35.2[.]3|AS30873|KSA-YEMEN.apk|7e6ec9df5e2218b5ad411 1059f799e1348c06f98cb 0f0742f86aae1875c6fd13|\n|mylab123321hm.ddns[.]net|134.35.10[.]61|AS30873|NRC ES.apk|eb8edfd04c0d1e0b03f46 29519800c8b043110dbe 94a70406c60d5a009f72 3fe|\n|goman239.ddns[.]net|134.35.11[.]92|AS30873|KSR HM.apk|f3f3764ee6a0e5b933e9 5040092e0b348f672aaa b273cf8eaaeabca28be5d a36|\n\n\n**Figure 4: High-resolution version of the icon found in the KSR HM and KSA-YEMEN applications (Source: Recorded Future)**\n\n\n| f\n\n\n-----\n\nOilAlpha has crafted applications with names associated with humanitarian and non-governmental\norganizations, including the United Nations and the Norwegian Refugee Council, as well as Saudi\nArabian entities like the King Khalid Foundation, Project MASAM, and the aforementioned King Salman\nHumanitarian Aid & Relief Centre. All of these entities conduct or coordinate disaster response and\nhumanitarian work in Yemen.\n\n**Figure 5: The attacker’s application “NCR ES.apk” executed in Recorded Future’s sandbox revealing links to an NRC resource**\n\n[page (Left). Scanned NRC domain info.nrc[.]jo reveals identical page (Right) (Source: Recorded Futureand urlscan)](https://tria.ge/230309-1xfnpacb6s/behavioral1)\n\nAnother notable characteristic identified during the installation process included what appeared to be a\npermissions request (Figure 6). As the applications were executed, we observed a permission request\nload; however, clicking on \"enable\" (تمكين) appeared to serve no purpose, as all the permissions sought\nby the RATs administrator were already granted.\n\n\n**Figure 6: A translation of the \"enable\" screen observed during the installation process (Source: Recorded Future and Google**\n\n\nTranslate)\n\n\n| f\n\n\n-----\n\nSome of the DDNS domains associated with OilAlpha revealed that commodity trojans like njRAT\ncommunicated with attacker infrastructure throughout their operational lifespan. This trend was\nobserved with C2 domains throughout 2021, and in early 2022. The identified files (Table 3) are generic\n\n| f\n\n\n-----\n\nunlike the naming conventions of the Android applications discussed in this report. Insikt Group has not\nidentified information to suggest that the files were used in an attack campaign.\n\n**File Name** **SHA256 Hash** **C2**\n\nyon.exe 0688dbd736e5a0e53024ee30cd2bcf205fcabc ndf236fgh4367h.ddns[.]net\n\n8d2a9800455572b1babe028fa2\n\nstupdate.exe 53e21aac7bf47d81342291d954d7a9cf51b4469 ndf236fgh4367h.ddns[.]net\n\n89b769cb6df3b187f8811f177\n\nNew Client.exe 8cc2614d17b30355dc32a6466f80b64a72353c ndf236fgh4367h.ddns[.]net\n\n5c4aa5da8d0efe7c8d4b008fe7\n\ngi.exe ca94223b97d9bb8049d24c506455bdaa4f853a 6386hgdsjg8172.ddns[.]net\n\n68767885a6fecef362c01d2869\n\n**Table 3: njRAT samples communicating with OilAlpha domains (Source: Recorded Future)**\n\n**Infrastructure Observations**\n\nPassive DNS analysis of OilAlpha infrastructure revealed that a C2 domain is typically associated with\nan IP address for approximately for 24 to 48 hours and is then rotated to another within the PTC\nautonomous system, AS30873; a sample listing of IP addresses seen in April 2023 associated with the\nmylab123321hm.ddns[.]net OilAlpha domain is available in Table 4.\n\n|File Name|SHA256 Hash|C2|\n|---|---|---|\n|yon.exe|0688dbd736e5a0e53024ee30cd2bcf205fcabc 8d2a9800455572b1babe028fa2|ndf236fgh4367h.ddns[.]net|\n|stupdate.exe|53e21aac7bf47d81342291d954d7a9cf51b4469 89b769cb6df3b187f8811f177|ndf236fgh4367h.ddns[.]net|\n|New Client.exe|8cc2614d17b30355dc32a6466f80b64a72353c 5c4aa5da8d0efe7c8d4b008fe7|ndf236fgh4367h.ddns[.]net|\n|gi.exe|ca94223b97d9bb8049d24c506455bdaa4f853a 68767885a6fecef362c01d2869|6386hgdsjg8172.ddns[.]net|\n\n|IP Addresses|First Seen - Last Seen|\n|---|---|\n|134.35.6[.]69|April 9, 2023 - April 10, 2023|\n|134.35.11[.]48|April 8, 2023 - April 9, 2023|\n|134.35.14[.]204|April 8, 2023 - April 8, 2023|\n|134.35.2[.]254|April 7, 2023 - April 8, 2023|\n|134.35.6[.]170|April 6, 2023 - April 7, 2023|\n\n\n**[Table 4: Summary of mylab123321hm.ddn[.]net associated IP addresses (Source: Recorded Future Surface Browser)](https://securitytrails.com/app/sb/host/mylab123321hm.ddns.net/history/a)**\n\n\nThe threat activity has predominantly transpired over 3 CIDR ranges, all owned by the Yemeni PTC\nentity: 134.35.0.0/16, 109.200.160.0/19, and\n175.110.0.0/18 . Additionally, OilAlpha C2 domains have increasingly been hosted on infrastructure\nassociated with the IELO-LIAZO autonomous system, specifically on CIDR range 91.109.176.0/20 . While\nthere is insufficient information to determine whether OilAlpha is shifting to the French-based\ninfrastructure provider for operational security, or other reasons, reporting has [revealed its popularity](https://lab52.io/blog/ongoing-njrat-campaign-against-middle-east/)\namong Middle Eastern threat actors.\n\n| f\n\n\n-----\n\n##### Geopolitical Influences\n\n**Who Controls The Telecommunications Sector in Yemen**\n\n[In April 2022 a Human Rights Watch (HRW) report highlighted](https://www.hrw.org/news/2022/04/18/yemen-latest-round-saudi-uae-led-attacks-targets-civilians) a case in which Saudi-backed Coalition\nairstrikes targeted a PTC facility in the Yemeni city of Hodeidah, which was reportedly occupied by\n[Houthi (Ansar Allah) authorities. Public reporting (1, 2) also indicates that the telecommunications](https://south24.net/news/newse.php?nid=2219)\nsector, in particular the administration of PTC and other government-owned telecommunication entities\n[like TeleYemen, is controlled by Houthi authorities. Insikt Group research from November 2018 also](https://www.recordedfuture.com/yemen-internet-activity)\nrevealed information about the power dynamics between the Houthis, the former government of Abd\nRabbuh Mansur Hadi, and efforts to control the telecommunication sector in Yemen. This is notable as\ncontrol of Yemen’s telecommunication and infrastructure assets influence our attribution hypothesis\ndiscussed in the Attribution section.\n\n**The Iran-Saudi Deal, the UAE, and the link to OilAlpha**\n\nIn March 2023, Iran and Saudi Arabia [embarked](https://www.nytimes.com/2023/03/10/world/middleeast/saudi-arabia-iran-reestablish-ties.html?action=click&module=RelatedLinks&pgtype=Article) on a new diplomatic rapprochement following\nnegotiations mediated by China. This geostrategic development is likely to reduce tensions between\nIran and Saudi Arabia, in addition to other Arabian Peninsula states, with renewed hope for reducing the\nconflict in Yemen. The dialogue reportedly led to Iran agreeing to cease its lethal aid support to the\n[Houthis, and an Omani initiative is driving toward a permanent ceasefire between Saudi Arabia and the](https://www.reuters.com/world/middle-east/saudi-led-coalition-lifts-more-restrictions-yemens-imports-2023-04-07/)\nHouthi movement.\n\nWhile the Houthis [claimed they would not abandon their cause and asserted the new Iran-Saudi](https://english.alarabiya.net/News/saudi-arabia/2023/03/13/Houthis-Saudi-Iran-deal-has-no-impact-on-Yemen-war-we-are-not-subordinate-to-Tehran)\nbreakthrough would have little to no influence on their conflict against the Saudi-led coalition, Saudi\n[Arabia and its partners held](https://www.reuters.com/world/middle-east/yemen-prisoner-exchange-begins-icrc-2023-04-14/) an official prisoner swap with the Houthis in mid-April, a potential sign of\nfurther de-escalation between the warring parties. Public analysis of the conflict [suggests that a truce](https://apnews.com/article/yemen-war-prisoner-exchange-saudi-arabia-houthis-fe9d0d3cbfaad81818534d7f0b41cecd)\nmay be reached between the Houthis and Saudi Arabia; however, the potential for domestic conflict\nbetween the Houthis, the Southern Movement, and the internationally recognized government's forces\nis still elevated.\n\nOther geopolitical influences have materialized in Yemen since the Houthi movement's takeover of\nSana'a in [2014, and the Houthis have been engaged in conflict with and Saudi Arabia and its coalition](https://www.crisisgroup.org/middle-east-north-africa/gulf-and-arabian-peninsula/yemen/yemen-s-houthi-takeover)\npartners since [March 2015. Yemen deteriorated into a complex and fragmented state, with multiple](https://www.bbc.com/news/world-middle-east-29319423)\ninternal and external parties pursuing their own security interests. For example, while the UAE is a\npartner in the Saudi Arabian coalition against the Houthis, it also [supports](https://agsiw.org/the-uaes-three-strategic-interests-in-yemen/) its own political and military\nallies in the Southern Movement, including the Security Belt Forces. As depicted above, OilAlpha used\ndocuments depicting Security Belt Forces comuniques during its social engineering operations (Figure\n**1).**\n\nAt least 3 major domestic political currents can affect Yemen's future: the Houthis (backed by Iran), the\ninternationally recognized government (backed by Saudi Arabia), and the Southern Movement (backed\nby the UAE). OilAlpha's operations so far have depicted a clear attempt to spoof Saudi Arabian\n\n| f\n\n\n-----\n\norganizations, as well as one from the UAE and another from Norway. The latter, the Norwegian\nRefugee Council, is the outlier, which raises the questions of why a threat group would spoof NGOs or\ntarget NGO-associated individuals in Yemen. Public sources suggest Houthi militia groups have\n[abducted](https://foreignpolicy.com/2019/02/21/in-yemen-targeting-of-aid-workers-risks-unraveling-crisis-middle-east-humanitarian-aid-famine-houthi-rebels/) NGO workers and security. Houthi hardliners are wary of NGOs, which are viewed as [tools of](https://foreignpolicy.com/2019/02/21/in-yemen-targeting-of-aid-workers-risks-unraveling-crisis-middle-east-humanitarian-aid-famine-houthi-rebels/)\n\"Western influence\" to enable foreign infiltration and espionage.\n\n##### Attribution: OilAlpha For Whose Interests?\n\nInsikt Group assesses that OilAlpha launched its attacks at the behest of a sponsoring entity, namely\nYemen’s Houthis. OilAlpha could be directly affiliated to its sponsoring entity, or could also be operating\nlike a contracting party. Public reports have [indicated](https://www.jns.org/houthis-and-hezbollah-are-learning-warfighting-techniques-from-one-another/) [that Houthi operatives have received training and](https://ctc.westpoint.edu/the-houthi-jihad-council-command-and-control-in-the-other-hezbollah/)\ncooperated in warfighting in operational theaters with Lebanese Hezbollah and Iran's Islamic\n[Revolutionary Guard Corps' Quds Force (IRGC-QF). Under the banner of the \"Axis of Resistance\", the](https://warontherocks.com/2022/07/irans-increasingly-decentralized-axis-of-resistance/)\nIRGC has helped Lebanese Hezbollah [establish its own cyber capabilities, which Hezbollah has](https://nationalinterest.org/blog/techland-when-great-power-competition-meets-digital-world/how-iran-built-hezbollah-top-cyber)\nexported to [aid Iraqi counterparts with cyber-enabled information operations capabilities. While](https://www.jpost.com/middle-east/hezbollah-hones-expertise-in-training-cyber-warfare-agents-638800)\nOilAlpha's activity is pro-Houthi, there is insufficient evidence to suggest that Yemeni operatives are\nresponsible for this threat activity. External threat actors like Lebanese or Iraqi Hezbollah, or even\nIranian operators supporting the IRGC, may have led this threat activity.\n\nThe infrastructure used throughout OilAlpha's campaigns suggests it persistently uses Yemen’s PTC\nassets. We recognize the potential for the PTC's infrastructure to be compromised by a foreign party. At\nthe time of this writing, however, we have not identified information to support this hypothesis. Public\nreports ascertain that the PTC is under the control of Houthi authorities, and we take this information at\nface value.\n\nInsikt Group has identified no evidence of activity such as spoofing Houthi communiques, or malicious\nAPKs claiming to be, for example, a Houthi military app. While these may exist, they are not known to\nInsikt Group. The lack of spoofing against the Houthis is notable and moreover, reporting of Houthi\ndistrust toward NGOs leads us to believe that such a factor likely acted as a driver for OilAlpha's\noperations.\n\n[The victimology (1,](https://www.facebook.com/adenfree/posts/5489094297789108) [2,](https://www.facebook.com/albaheth/posts/10159724986361494) [3) indicates that OilAlpha targeted victims in the media and journalism sectors,](https://www.facebook.com/bayazid707/posts/5015004495255481)\nand also likely targeted delegates at a Saudi Arabian conference. Based on their social engineering\nattempts, which were written in fluent Arabic and did not include grammatical or idiomatic mistakes, the\nattackers are highly likely to be native Arabic-language speakers.\n\nA WhatsApp account (Figure 1) adopted imagery of the current king of Saudi Arabia, Salman bin\nAbdulaziz Al Saud, as well as the crown prince, Mohammed bin Salman Al Saud, which was highly likely\nused to appear pro-Saudi to the target. If the targets represented Yemen’s internationally recognized\ngovernment, such profiles would likely serve to lower suspicions to enable the download of the\nmalicious Android application.\n\n| f\n\n\n-----\n\nLastly, since May 2022, Insikt Group research revealed the continued spoofing of Saudi Arabian and\nUAE entities, and NGOs (Table 5). There is significant strategic and operational interest by the Houthis\nto target individuals from Saudi Arabia or representatives from Yemen’s internationally recognized\ngovernment. As noted above, specific counterintelligence elements within the Houthi movement could\nhave also influenced OilAlpha's targeting requirements.\n\n**Other Attribution Considerations**\n\nAn attribution hypothesis developed by a China-based security vendor [suggests that a threat cluster](https://web.archive.org/web/20230327023310/https://mp-weixin-qq-com.translate.goog/s/sh4UVkRSmI0BhV2r9z3CxQ?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp)\nlinked to OilAlpha is associated with an intelligence ministry from a neighboring state in the Arabian\nPeninsula. No additional information was provided to ascertain how this assessment was made.\n\nIf the assessment is correct, OilAlpha's operators spoofed Saudi Arabian organizations and used Saudi\nArabian telephone numbers to target victims with social engineering attempts while obfuscating their\norigins by using Yemeni infrastructure. This is an unlikely scenario, however, as it would defeat the\npurpose of creating a false flag by obfuscating attacker-controlled infrastructure, only to then use Saudi\nArabian phone numbers and pro-Saudi Arabian WhatsApp accounts to disseminate the aforementioned\napplications.\n\n**Organization Name** **Sector** **Country of Origin**\n\nUnited Nations Children's Humanitarian International\nEmergency Fund (UNICEF)\n\nKing Khalid Foundation Government/ Saudi Arabia\nHumanitarian\n\nKing Salman Humanitarian Government/ Saudi Arabia\n\nAid & Relief Centre Humanitarian\n\nEmirates Red Crescent Government/ United Arab Emirates\nHumanitarian\n\nSaudi Tourism Development Government/ Saudi Arabia\n\nFund Tourism\n\nProject MASAM NGO Saudi Arabia\n\nNorwegian Refugee Council NGO Norway\n\nNational Commercial Bank Finance Saudi Arabia\n\n(Saudi National Bank)\n\n**Table 5: Entities spoofed based on APK file names or identified application icons (Source: Recorded Future)**\n\n| f\n\n|Organization Name|Sector|Country of Origin|\n|---|---|---|\n|United Nations Children's Emergency Fund (UNICEF)|Humanitarian|International|\n|King Khalid Foundation|Government/ Humanitarian|Saudi Arabia|\n|King Salman Humanitarian Aid & Relief Centre|Government/ Humanitarian|Saudi Arabia|\n|Emirates Red Crescent|Government/ Humanitarian|United Arab Emirates|\n|Saudi Tourism Development Fund|Government/ Tourism|Saudi Arabia|\n|Project MASAM|NGO|Saudi Arabia|\n|Norwegian Refugee Council|NGO|Norway|\n|National Commercial Bank (Saudi National Bank)|Finance|Saudi Arabia|\n\n\n-----\n\n### Mitigations\n\n  - Establish robust policies and carry out social engineering and anti-phishing awareness exercises\nto help detect and prevent attacks.\n\n  - Use strong passwords and enable multi-factor authentication (MFA) where possible to limit the\npotential damage of credential theft.\n\n  - “Cold-calling” is a common method social engineering operators use to engage with victims. This\nincludes direct messaging on social media platforms as well as on encrypted chats. Be on the\nlookout for signs of inauthentic or reused material and attempt to directly verify with the source\nwhen possible.\n\n### Outlook\n\nWe do not foresee a reduction in attack operations led by OilAlpha. The group has continued to use the\nsame TTPs with minor tradecraft shifts, such as the adoption of infrastructure associated with the\nIELO-LIAZO autonomous system throughout late March and early April 2023. The use of DDNS\ninfrastructure and Android-specific malware are the more pertinent aspects of OilAlpha’s TTPs; as\nnoted in this report, the increased popularity of Android devices throughout the Arabian Peninsula is\nhighly likely to have factored in the threat actors’ decision-making.\n\nBarring the discovery of new information or broader geostrategic shifts, OilAlpha is likely to continue to\nuse malicious Android-based applications to target entities that share an interest in Yemen’s political\nand security developments and the humanitarian and NGO sectors that operate in Yemen.\n\n| f\n\n\n-----\n\n### Appendix A\n\n\n| f\n\n\n-----\n\n| f\n\n\n-----\n\n| f\n\n\n-----\n\n### Appendix B — Mitre ATT&CK Techniques\n\n|Tactic: Technique|ATT&CK Code|\n|---|---|\n|Initial Access: Phishing|T1566|\n|Execution, Persistence: Broadcast Receivers|T1402|\n|Defense Evasion, Impact: Delete Device Data|T1447|\n|Credential Access, Collection: Capture SMS Messages|T1412|\n|Discovery, Collection: Location Tracking|T1430|\n|Discovery: File and Directory Discovery|T1420|\n|Discovery: System Network Connections Discovery|T1421|\n|Discovery: System Network Configuration Discovery|T1422|\n|Collection: Email Collection|T1114|\n|Collection: Audio Capture|T1429|\n|Collection: Access Call Log|T1433|\n|Command and Control: Encrypted Channel|T1573|\n|Command and Control: Ingress Tool Transfer|T1105|\n\n\n| f\n\n\n-----\n\n### Appendix C — Diamond Model\n\n\n| f\n\n\n-----\n\nAbout Insikt Group[®]\n\nInsikt Group is Recorded Future’s threat research division, comprising analysts and\nsecurity researchers with deep government, law enforcement, military, and intelligence\nagency experience. Their mission is to produce intelligence on a range of cyber and\ngeopolitical threats that reduces risk for clients, enables tangible outcomes, and\nprevents business disruption. Coverage areas include research on state-sponsored\nthreat groups; financially-motivated threat actors on the darknet and criminal\nunderground; newly emerging malware and attacker infrastructure; strategic geopolitics;\nand influence operations.\n\nAbout Recorded Future[®]\n\nRecorded Future is the world’s largest intelligence company. Recorded Future’s\ncloud-based Intelligence Platform provides the most complete coverage across\nadversaries, infrastructure, and targets. By combining persistent and pervasive\nautomated data collection and analytics with human analysis, Recorded Future provides\nreal-time visibility into the vast digital landscape and empowers clients to take proactive\naction to disrupt adversaries and keep their people, systems, and infrastructure safe.\nHeadquartered in Boston with offices and employees around the world, Recorded Future\nworks with more than 1,600 businesses and government organizations across more than\n70 countries.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture\n\n\naction to disrupt adversaries and keep their people, systems, and infrastructure safe.\nHeadquartered in Boston with offices and employees around the world, Recorded Future\nworks with more than 1,600 businesses and government organizations across more than\n70 countries.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2023-0516.pdf"
    ],
    "report_names": [
        "cta-2023-0516.pdf"
    ],
    "threat_actors": [
        {
            "id": "ca3acede-fb02-418a-8f2b-a73d8c89eda7",
            "created_at": "2023-06-23T02:04:34.425347Z",
            "updated_at": "2025-03-27T02:02:10.026299Z",
            "deleted_at": null,
            "main_name": "OilAlpha",
            "aliases": [
                "TAG-41",
                "TAG-62"
            ],
            "source_name": "ETDA:OilAlpha",
            "tools": [
                "Bladabindi",
                "CypherRat",
                "Jorik",
                "SpyMax",
                "SpyNote",
                "SpyNote RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9802c44a-36d9-4e1e-9f37-76b89b3b61b0",
            "created_at": "2023-11-07T02:00:07.10244Z",
            "updated_at": "2025-03-27T02:00:03.175202Z",
            "deleted_at": null,
            "main_name": "OilAlpha",
            "aliases": [],
            "source_name": "MISPGALAXY:OilAlpha",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1687486128,
    "ts_updated_at": 1743041420,
    "ts_creation_date": 1684165014,
    "ts_modification_date": 1684165259,
    "files": {
        "pdf": "https://archive.orkl.eu/5c12e659a63f7b413df4a32d0aa978ce4e93167b.pdf",
        "text": "https://archive.orkl.eu/5c12e659a63f7b413df4a32d0aa978ce4e93167b.txt",
        "img": "https://archive.orkl.eu/5c12e659a63f7b413df4a32d0aa978ce4e93167b.jpg"
    }
}