{
    "id": "5facbd20-5dce-4562-b948-6abf6bb6c71c",
    "created_at": "2022-10-25T16:48:22.414215Z",
    "updated_at": "2025-03-27T02:10:07.373307Z",
    "deleted_at": null,
    "sha1_hash": "032acfce8fe08469434ef3752263665844e620e6",
    "title": "Cisco's Talos Intelligence Group Blog: Advanced Mobile Malware Campaign in India uses Malicious MDM",
    "authors": "",
    "file_creation_date": "2018-07-18T06:40:14Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 757777,
    "plain_text": "y\nInformation\n\n\np\nCenter\n\n\ny pp\nCommunities\n\n\nBlog\n\n\n**T H U R S D AY, JU LY 1 2, 2 0 1 8**\n\n# Advanced Mobile Malware Campaign in India uses Malicious MDM\n\n[This blog post is authored by Warren Mercer and Paul Rascagneres and Andrew Williams.](https://twitter.com/securitybeard?lang%3Den)\n\n## SUMMARY\n\nCisco Talos has identified a highly targeted campaign against 13 iPhones which appears to be\n\nfocused on India. The attacker deployed an open-source mobile device management (MDM)\n\nsystem to control enrolled devices. At this time, we don't know how the attacker managed to enroll\n\nthe targeted devices. Enrollment could be done through physical access to the devices, or most\n\nlikely by using social engineering to entice a user to register. In social engineering attacks the victim\n\nis tricked into clicking accept or giving the attacker physical access to a device. This campaign is of\n\nnote since the malware goes to great lengths to replace specific mobile apps for data interception.\n\nTalos has worked closely with Apple on countering this threat. Apple had already actioned 3\n\ncertificates associated with this actor when Talos reached out, and quickly moved to action the two\n\nothers once Talos tied them to the threat.\n\nAn MDM is designed to deploy applications on enrolled devices. In this campaign we identified five\n\napplications that have been distributed by this system to the 13 targeted devices in India. Two of\n\nthem appear to test the functionality of the device, one steals SMS message contents, and the\n\n\nSearch Blog\n\n\n**S UB S C R IB E TO OUR FE E D**\n\nPosts\n\nComments\n\n[Subscribe via Email](https://www.talosintelligence.com/blog_subscription)\n\n**B LOG A R C HIV E**\n\n[▼ 2 01 8](javascript:void(0)) (102)\n\n[▼ J U LY](javascript:void(0)) (9)\n\n[Beers with Talos EP33 - Change the](https://blog.talosintelligence.com/2018/07/beers-with-talos-ep33-change.html)\n\nConversation or...\n\n[Threat Roundup for July 6-13](https://blog.talosintelligence.com/2018/07/threat-roundup-0706-0713.html)\n\n[Advanced Mobile Malware](https://blog.talosintelligence.com/2018/07/Mobile-Malware-Campaign-uses-Malicious-MDM.html)\n\nCampaign in India uses Mal...\n\n[Vulnerability Spotlight:](https://blog.talosintelligence.com/2018/07/vulnerability-spotlight-computerinsel-photoline.html)\n\nComputerinsel Photoline M...\n\n[Vulnerability Spotlight: Multiple](https://blog.talosintelligence.com/2018/07/vuln-spotlight-antenna.html)\n\nAntenna House Vu\n\n\n-----\n\nThe attacker used the BOptions sideloading technique to add features to legitimate apps, including\n\nthe messaging apps WhatsApp and Telegram, that were then deployed by the MDM onto the 13\n\ntargeted devices in India. The purpose of the BOptions sideloading technique is to inject a dynamic\n\nlibrary in the application. The malicious code inserted into these apps is capable of collecting and\n\nexfiltrating information from the device, such as the phone number, serial number, location,\n\ncontacts, user's photos, SMS and Telegram and WhatsApp chat messages. Such information can\n\nbe used to manipulate a victim or even use it for blackmail or bribery.\n\nThanks to the logs located on the MDM servers and the malware's command and control (C2)\n\nserver, we were able to determine that the malware has been in use since August 2015. The\n\ncampaign targeted only a few select devices (13) that are all located in India. The attacker left\n\nessential data on the servers, such as emails and usernames. As part of the attacker's\n\ndevelopment and testing it appears that they compromised their device — we observed a device\n\nnamed \"test\" or \"mdmdev.\" The log files we identified contain the phone number of the device. The\n\nnumber originates from India and uses the \"Vodafone India\" network with roaming capability\n\ndisabled. With all of this information in mind, we assume with high confidence that the malware\n\nauthor works out of India.\n\nMDM is becoming more popular throughout large enterprises, and users should be aware that\n\ninstalling additional certificates on their device to allow remote management can result in potential\n\nmalicious activity. By installing a certificate outside of the Apple iOS trusted certificate chain, you\n\nmay open up to possible third-party attacks like this. Users must be aware that accepting an MDM\n\ncertificate is equivalent to allowing someone administrator access to their device, passwords, etc.\n\nThis must be done with great care in order to avoid security issues and should not be something\n\nthe average home user does.\n\nThe following information warns the security community and users of how this attack works. The\n\nlikely use of social engineering to recruit devices serves as a reminder that users need to be wary of\n\nclicking on unsolicited links and verify identities and legitimacy of requests to access devices.\n\n\n6th\n\n[Smoking Guns - Smoke Loader](https://blog.talosintelligence.com/2018/07/smoking-guns-smoke-loader-learned-new.html)\n\nlearned new tricks\n\n[► J U N E](javascript:void(0)) (15)\n\n[► M AY](javascript:void(0)) (15)\n\n[► A P RI L](javascript:void(0)) (21)\n\n[► M A RC H](javascript:void(0)) (10)\n\n[► FE BRU A RY](javascript:void(0)) (14)\n\n[► J A N U A RY](javascript:void(0)) (18)\n\n[► 2 01 7](javascript:void(0)) (172)\n\n[► 2 01 6](javascript:void(0)) (98)\n\n[► 2 01 5](javascript:void(0)) (62)\n\n[► 2 01 4](javascript:void(0)) (67)\n\n[► 2 01 3](javascript:void(0)) (30)\n\n[► 2 01 2](javascript:void(0)) (53)\n\n[► 2 01 1](javascript:void(0)) (23)\n\n[► 2 01 0](javascript:void(0)) (93)\n\n[► 2 009](javascript:void(0)) (146)\n\n[► 2 008](javascript:void(0)) (37)\n\n**R E C OM M E N DE D B LOG S**\n\n[C I S C O BL O G](https://blogs.cisco.com)\n\nField Area Network Security Webinar –\nBringing OT and IT Together\n\n[S N O RT BL O G](https://blog.snort.org/)\n\nSnort Subscriber Rule Set Update for\n07/17/2018\n\n[C L A M A V® BL O G](http://blog.clamav.net/)\n\n\n-----\n\n## IOS MDM INFRASTRUCTURE\n\n My tiny MDM\n\n\n-----\n\nhxxp://www[.]wpitcher[.]com\n\n[Both servers above are based on the open-source project mdm-server — a small iOS MDM server.](https://github.com/project-imas/mdm-server)\n\nMDM allows for operating system-level control of multiple devices from a centralized location. A\n\nremote administrator can install or remove apps, install or revoke certificates, lock the device, or\n\nchange password requirements, among other things. The operator is able to uninstall legitimate\n\napplications such as Telegram and WhatsApp to install the malicious versions described in the next\n\nsection.\n\n## Device enrollment\n\nEach step of the enrollment process needs some type of user interaction. That's why Talos\n\nassumes the attackers use social engineering to get victims on the MDM. The first step for\n\nenrolling a device is to install the certificate authority:\n\n\n-----\n\nIf the user clicks on \"Allow,\" the following message is displayed:\n\n\n-----\n\nBy clicking on \"Install,\" the signature will switch to \"Verified:\"\n\n\n-----\n\nThe device is ready to be enrolled:\n\n\n-----\n\nWe can control the installed profile:\n\n\n-----\n\nThe attacker is now able to control the device. A pop-up appears when the attacker pushes a new\n\napp to the user device. Here is an example with the compromised Telegram app mentioned later in\n\nthe article:\n\n\n-----\n\nThis gives the attacker a significant level of control over the victim device(s). This process is used\n\nsimilarly to a large-scale enterprise using MDM solutions. It is likely that the user is advised that the\n\ncertificate must be installed to allow enrollment. This is most likely performed via a social\n\nengineering mechanism, i.e. a fake tech support-style call.\n\nThe attacker used a domain which allowed them to try and fool the user. The use of \"ios-certificate\nupdate[.]com\" may make it easier to reassure the user that this is normal. Since we believe this\n\nattack is targeting devices in India this is also something which a non-native English speaker may\n\nsee as \"normal.\" The certificate and update naming convention is also designed to trick the user.\n\n## Technical information about the MDM\n\nThe attacker left a lot of information behind, which allowed us to analyse files used by this MDM.\n\nFirst, the certificate used by the MDM:\n\nCA.crt:\n\n\nSerial Number: 13905745817900070731 (0xc0fb222544ceb74b)\n\nIssuer: C=CR, ST=Split, L=Split, O=NA, OU=IT, CN=ios-certificate\nupdate.com/emailAddress=nicholas.vukoja@mail.ru\n\nValidity\n\nNot Before: Sep 6 11:33:09 2017 GMT\n\nNot After : Sep 6 11:33:09 2018 GMT\n\nSubject: C=CR, ST=Split, L=Split, O=NA, OU=IT, CN=ios-certificate\nupdate.com/emailAddress=nicholas.vukoja@mail.ru\n\n\n-----\n\ng gg g\n\nto point researchers toward the idea of a \"classical Russian hacker.\" False flags are becoming more\n\ncommon in malware, both sophisticated and simple. It's an attempt to muddy the waters for the\n\nanalysts/researchers to direct blame elsewhere.\n\nIdentity.p12:\n\n\nSerial Number: 14177612590375883362 (0xc4c0ff88e475d262)\n\nIssuer: C=CR, ST=Split, L=Split, O=NA, OU=IT, CN=ios-certificate\nupdate.com/emailAddress=Aleksi.Dushku@mail.ru\n\nValidity\n\nNot Before: Jan 6 04:59:56 2018 GMT\n\nNot After : Jan 6 04:59:56 2019 GMT\n\nSubject: C=CR, ST=Split, L=Split, O=NA, OU=IT, CN=ios-certificate\nupdate.com/emailAddress=Aleksi.Dushku@mail.ru\n\n\nThis is another certificate, which points to an apparent reference to Russia by using another mail.ru\n\naddress.\n\nServer.csr:\n\n\nSubject: C=HR, ST=Hrvatska, L=Split, O=NA, OU=IT, CN=ios-certificate\nupdate.com/emailAddress=nicholas.vukoja@mail.ru\n\n\nIn this certificate, the attacker mentioned Hrvatska (\"Croatia\" in the Croatian language) with the\n\n\n-----\n\n## Log analysis\n\nOne of the most interesting pieces of information about the MDM is found in the log file. Because of\n\nthis, we can confirm the following points:\n\nThere are 13 compromised devices based off serial number\n\nAll the devices are located in India (based on the phone numbers and phone providers)\n\nPhone models: iPhone 5.4, iPhone 7.2, iPhone 8.1, iPhone 8.2, iPhone 9.3, iPhone 9.4\n\niOS versions: 10.2.1, 10.3.1, 10.3.2, 10.3.3, 11.0, 11.0.3, 11.2.1, 11.2.5, 11.2.6\n\nAt this time, we don't know how the attacker enrolled the 13 targeted devices into the MDM. It could\n\nbe through physical access to the phones, or by using social engineering, motivating the user to\n\nenroll their device.\n\nWe believe the attackers used their personal phone to test the MDM because they included devices\n\nnamed \"Test\" and \"mdmdev.\" These two devices share the same phone number and a name that is\n\nuncommon for a personal phone.\n\nThe phone number originates from India and is registered on the \"Vodafone India\" network provider.\n\nWhen the device was registered on the MDM server, roaming was disabled. We assess with high\n\nconfidence that the author is based out of in India.\n\n## IOS APPLICATIONS\n\n Malicious applications using BOptions sideloading\n\nEXPLANATION\n\n\n-----\n\npurpose is to inject a dynamic library into the legitimate app. The GitHub project was used by the\n\nattacker to create the malicious BOptionspro.dylib library held in the iOS package (.ipa file). The\n\ninjection library can ask for additional permissions, execute code and steal information from the\n\n[original application, among other things. Milan-based technology company HackingTeam has](https://www.theregister.co.uk/2015/08/06/hacking_team_ios_trickery_outed/)\n\npreviously used this technique.\n\nTELEGRAM, WHATSAPP & APPSSLOADER\n\nIn this campaign we identified three compromised versions of apps using this trick hosted on the\n\nMDM server. AppsSLoader is seemingly harmless. The app was created to test the library injection.\n\nIt simply opens a pop-up to the user confirming the execution of the dynamic library. This was most\n\nlikely created to test the effectiveness of the library prior to malicious deployment.\n\nThe compromised versions of the Telegram and WhatsApp applications used in this campaign are\n\nmore interesting and relevant. They first contain the same malicious code. The purpose is to send\n\ncollected data to a C2 server located at hxxp[:]//techwach[.]com.\n\nThe malicious code checks permissions and asks for additional permissions if it does not already\n\nhave them:\n\n\n-----\n\nOne of the most relevant features of these compromised versions of the applications is the\n\nTelegram and WhatsApp message stealing feature. Here is the global workflow of it:\n\nFor Telegram:\n\nOpens 'tgdata.db', an SQLite3 database used by Telegram\n\nChecks for the key 'UPLOADED_CHAT' in the key store\n\nQueries \"select users_v29.phone_number, users_v29.uid from users_v29;\"\n\nQueries for \"select messages_v29.from_id AS oid,users_v29.first_name,\nusers_v29.last_name,users_v29.phone_number,messages_v29.message,messages_v29\n.mid,messages_v29.to_id from messages_v29 join users_v29 ON\n(messages_v29.from_id = users_v29.uid);\"\n\nParses results, storing off counts, timestamps, and other metadata.\n\nSends by posting to hxxp[:]//techwach[.]com\n\nQuery screenshot:\n\nFor WhatsApp:\n\n\n-----\n\nParses results, storing off counts, timestamps, and other metadata.\n\nSends by posting to hxxp[:]//techwach[.]com\n\nAdditionally, the malware is designed to be able to send the contacts, location, and images from the\n\ncompromised device.\n\nHere is the list of the PHP pages available on the techwach C2 server:\n\nall.php\n\ndyrKztORKwVWOGo.php\n\nget.php\n\nhh.php\n\ninfo.php\n\njDRucchWSoWQGpU.php\n\nUfmcRxYDaVVbrBl.php\n\nAnother intriguing aspect of this malware is the way in which the malicious code achieves periodic\n\ncode execution when the legitimate app bundled with it is running. One technique is to modify the\n\napp's code at runtime to execute the malicious code — this has been observed in previously\n\nanalyzed iOS malware. Instead, this malware remains almost entirely independent of the app and\n\ngains execution by creating a timer that eventually executes the malicious code in a background\n\nthread. From there, it schedules tasks to be executed asynchronously in the background by\n\nleveraging the apps' background task queue. Ultimately, this means that the malicious code is\n\ninvisible to the user of the app, and can be easily reused alongside any real application.\n\nPRAYTIME\n\nTalos identified another legitimate app executing malicious code during this campaign in India.\n\n\n-----\n\nMYAPP\n\nMyApp is a regular iOS app. However, the application does not do anything. It has almost no code\n\nassociated with it other than standard iOS app runtime code. This could potentially be another\n\ntesting app, but we're unable to determine the exact use. This app is non-malicious.\n\n## Techwach C2 server\n\nThe malicious code within Telegram and WhatsApp sent collected data to the server\n\ntechwach[.]com. The server has been active since August 2015. Initially, the username used on the\n\nserver was arnoldrex. Subsequently, this was changed to chernobog (referencing a Slavic deity).\n\n## CONCLUSION\n\nThis investigation shows us that this attack targeted a very limited number (13) of users using\n\niPhone devices in India. At the time, it is unclear who the targets of the campaign were, who was\n\nthe perpetrator, or what the exact purpose was. It's very likely the vector for this campaign was\n\nsimply social engineering - in other words asking the user to click \"ok\". This type of vector is very\n\ndifficult to defend against since users can often be tricked into acting against their best interests.\n\nThis is another important reminder that users must think twice before clicking on unsolicited links or\n\nrequests and also that users should verify credentials from any unsolicited calls requesting they\n\ntake action on devices\n\n\n-----\n\nphotos and user s location from the victim s phone. Over a three year period, the attackers\n\nremained under the radar — likely due to the low number of compromised devices. All the technical\n\ndetails point to an actor based in the same country as the victims: India. The attacker tried to mimic\n\nRussian hackers by using mail.ru email. However, we found testing devices enrolled on the MDM\n\nwith an Indian phone number and registered on an Indian provider.\n\nOnce a user has lost physical access to their phone, it's really a case of the attacker having a much\n\neasier playing field for malicious activity. The fact that the attacker was also able to get devices\n\nonto his own malicious MDM shows that the attacker was indeed motivated to obtain initial access\n\nbut also to maintain persistence across the devices.\n\n## COVERAGE\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\n\nsuited to prevent the execution of the malware\n\nused by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or Web](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\n\nSecurity Appliance (WSA) web scanning\n\nprevents access to malicious websites and\n\ndetects malware used in these attacks.\n\n[Email Security can block malicious emails sent](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\nby threat actors as part of their campaign.\n\nNetwork Security appliances such as Next\n[Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n\n[Intrusion Prevention System (NGIPS) and Meraki MX can detect malicious activity associated with](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\n\n\n-----\n\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains,](https://umbrella.cisco.com/)\n\nIPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest\n\n[rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCS\n\niOSApplications\n\n329e025866bc6e88184af0b633eb3334b2e8b1c0817437c03fcd922987c5cf04\nAppsSLoader.ipa\n\naef046b67871076d507019cd87afdaeef602d1d2924b434ec1c165097b781242 MyApp.ipa\n\n4be31095e5f010cc71cf8961f8fe3fc3ed27f8d8788124888a1e90cb90b2bef1\nPrayTime.ipa\n\n624689a1fd67891be1399811d6008524a506e7e0b262f549f5aa16a119369aef\nTelegram.ipa\n\ne3872bb33d8a4629846539eb859340940d14fdcf5b1c002b57c7dfe2adf52f08 Wplus.ipa\n\nMDM Domains:\n\nios-certificate-update[.]com\n\nwww[.]wpitcher[.]com\n\nC2 Domains:\n\nVoguextra[.]com\n\n\n-----\n\nvoguextra[.]com\n\nP O S T E D BY [P AU L RAS C AG NE RE S AT](https://www.blogger.com/profile/10073079939160046441) [3 : 0 0 P M](https://blog.talosintelligence.com/2018/07/Mobile-Malware-Campaign-uses-Malicious-MDM.html)\n\nL ABE L S : [AP P L E, I ND I A](https://blog.talosintelligence.com/search/label/apple) [, I O S, I P H O NE, M ALWARE ANALY S I S, M ALWARE RE S E ARC H, M D M](https://blog.talosintelligence.com/search/label/iOS)\n\nS H A RE T H I S\n\nP O S T\n\nNO COMMENTS:\n\nPOST A COMMENT\n\n\nEnter your comment...\n\n\n**Comment as:** [Google Account]\n\n\n\n[Google Account]\n\n\n-----\n\nNE WE R\n\nP O S T\n\nS U BS C RI BE T O : [P O S T C O M M E NT S (AT O M )](https://blog.talosintelligence.com/feeds/6206155954768898771/comments/default)\n\n\n[H O M E](https://blog.talosintelligence.com/)\n\n\nO L D E R\n\nP O S T\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.07.12.Advanced_Mobile_Malware_Campaign_in_India/MDM_India.pdf"
    ],
    "report_names": [
        "MDM_India"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1531896014,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/032acfce8fe08469434ef3752263665844e620e6.pdf",
        "text": "https://archive.orkl.eu/032acfce8fe08469434ef3752263665844e620e6.txt",
        "img": "https://archive.orkl.eu/032acfce8fe08469434ef3752263665844e620e6.jpg"
    }
}