{
    "id": "5fd54213-58b4-40ca-8c09-87de573865fb",
    "created_at": "2023-01-12T15:05:03.016667Z",
    "updated_at": "2025-03-27T02:16:25.832886Z",
    "deleted_at": null,
    "sha1_hash": "62bf27ef2b7da19ba0b081ed3bf599ffe33bde0e",
    "title": "2016-08-10 - Android Marcher- Continuously Evolving Mobile Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T01:23:37Z",
    "file_modification_date": "2022-05-28T01:23:37Z",
    "file_size": 1962292,
    "plain_text": "# Android Marcher: Continuously Evolving Mobile Malware\n\n**[zscaler.de/blogs/research/android-marcher-continuously-evolving-mobile-malware](https://www.zscaler.de/blogs/research/android-marcher-continuously-evolving-mobile-malware)**\n\nFounded in 2013, the Android Marcher mobile malware has widely been targeting Google\nPlay -- harvesting user credentials and credit card data. The malware waits for victims to\nopen the Google Play store and then displays a fake html overlay page asking for credit\ncard information. The fake page will not go away until the user provides the payment\ninformation.\n\nIn March 2014, we noticed newer variants targeting financial organizations in Germany.\nUpon infection, Marcher would inspect the victim’s device and send a list of all installed\napps to its command and control (C&C) server. If the malware found any German financial\napps installed in the device, it would show a fake page asking for credentials of that\nparticular institution. Unaware that the login page is a fake, the victim would provide their\ncredentials where they would then be sent to the malware’s C&C. The malware would also\nshow a fake Google Play payment page if the infected device did not have any German\n[financial firm apps. We covered one such sample in a previous blog, see here .](https://www.zscaler.de/blogs/research/android-marcher-now-marching-porn-sites)\n\nMarcher then started targeting financial firms in Australia, France, Turkey and The United\nStates. Some Marcher samples were observed targeting PayPal as well.\n\n[Recently, Marcher added United Kingdom to its hit list, as seen by TrendMicro.](http://www.trendmicro.com/vinfo/us/security/news/mobile-safety/marcher-android-banking-malware-targets-uk-customers)\n\nPreviously, Marcher was distributed through fake Amazon and Google Play store apps.\nWe’ve also seen it delivered through a fake porn site that posed as a Chrome update. This\nmonth, we observed another new change in the Marcher malware campaign where it is\nbeing delivered as a fake Android firmware update. We discovered the payload dropped as\n“Firmware_Update.apk”. An HTML page serving this malware scares the victim by showing\nthat the device is vulnerable to viruses and to prevent personal data theft, prompting them\nto install the fake update.\n\n\n-----\n\nFake update page\n\nTo perform its malicious activity upon installation, Marcher will ask for administrative access.\n\nIn 2013, Marcher was only targeting Russian mobile users; however, in the recent samples\n[the author implemented checks to find out if the infected device is from CIS/SIG. It will stop](https://en.wikipedia.org/wiki/Commonwealth_of_Independent_States)\nits activity if the device belongs to CIS/SIG territory. Generally, the malware author does this\ncheck to avoid any legal cases from its own territory. Such checks indicate that the malware\nmay have been authored and maintained from CIS/SIG countries. See the following\nscreenshot.\n\nCIS/SIG countries check\n\nAnother change in this newer variants is implementation of simple obfuscation by the\nmalware author using base64 encoding and string replace functions. In older samples, we\ndid not see this obfuscation. See the following screenshot.\n\n\n-----\n\nSimple obfuscation techniques\n\nIn older Marcher samples we saw that the malware will only show fake a Google Play store\ncredential page if the user opens the Play store app. In recent samples, the malware author\nimplemented checks for multiple well-known apps and shows fake credential page if user\nopens any of these apps. Following are the apps listed in the code and shown in above\nscreen encoded in base64.\n\nPlaystore (com.android.vending)\nViber app (com.viber.voip)\nWhatsapp (com.whatsapp)\nSkype   (com.skype.raider)\nFacebook messenger (com.facebook.orca)\nFacebook (com.facebook.katana)\nInstagram (com.instagram.android)\nChrome (com.android.chrome)\nTwitter (com.twitter.android)\nGmail (com.google.android.gm)\nUC Browser (com.UCMobile.intl)\nLine (jp.naver.line.android)\n\nWe have also seen changes related to C&C communication. In older samples the Marcher\nwas communicating on simple http protocol. Now it does C&C communication over SSL.\nObserve following screen captures.\n\n\n-----\n\nC&C\n\nC&C over SSL\nWe are seeing numerous infection attempts in our cloud for this malware family. These\nfrequent changes clearly indicate active malware development that is constantly evolving -making it the most prevalent threat to the Android devices.\n\nTo avoid being a victim of such malware, it is always best to download apps only from\ntrusted app stores, such as Google Play. This can be enforced by unchecking the\n\"Unknown Sources\" option under the \"Security\" settings of your device.\n\n\n-----\n\nZscaler ThreatLabZ is actively monitoring this malware and ensuring that Zscaler customers\nare protected.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-08-10 - Android Marcher- Continuously Evolving Mobile Malware.pdf"
    ],
    "report_names": [
        "2016-08-10 - Android Marcher- Continuously Evolving Mobile Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535903,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653701017,
    "ts_modification_date": 1653701017,
    "files": {
        "pdf": "https://archive.orkl.eu/62bf27ef2b7da19ba0b081ed3bf599ffe33bde0e.pdf",
        "text": "https://archive.orkl.eu/62bf27ef2b7da19ba0b081ed3bf599ffe33bde0e.txt",
        "img": "https://archive.orkl.eu/62bf27ef2b7da19ba0b081ed3bf599ffe33bde0e.jpg"
    }
}