{
    "id": "6083cac0-fd20-4a6c-9d61-424cd02ae7a5",
    "created_at": "2023-01-12T15:06:12.944393Z",
    "updated_at": "2025-03-27T02:05:24.888663Z",
    "deleted_at": null,
    "sha1_hash": "5e0500ca0641ee60610a686f6d12fd8fa4b111e7",
    "title": "2022-09-27 - A technical analysis of Pegasus for Android – Part 2",
    "authors": "",
    "file_creation_date": "2022-10-02T12:24:38Z",
    "file_modification_date": "2022-10-02T12:24:38Z",
    "file_size": 7918922,
    "plain_text": "# A technical analysis of Pegasus for Android – Part 2\n\n**[cybergeeks.tech/a-technical-analysis-of-pegasus-for-android-part-2/](https://cybergeeks.tech/a-technical-analysis-of-pegasus-for-android-part-2/)**\n\nSummary\n\nPegasus is a spyware developed by the NSO group that was repeatedly analyzed by\n[Amnesty International and](https://www.amnesty.org/en/latest/research/2021/07/forensic-methodology-report-how-to-catch-nso-groups-pegasus/) [CitizenLab. In this article, we dissect the Android version that was](https://citizenlab.ca/2020/12/the-great-ipwn-journalists-hacked-with-suspected-nso-group-imessage-zero-click-exploit/)\n[initially analyzed by Lookout in this paper, and we recommend reading it along with this post.](https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-android-technical-analysis.pdf)\nDuring our research about Pegasus for Android, we’ve found out that vendors wrongly\n[attributed some undocumented APK files to Pegasus, as highlighted by a researcher here.](https://twitter.com/maldr0id/status/1492520053702602755)\nWe’ve splitted the analysis into 3 parts because of the code’s complexity and length. We’ve\nalso tried to keep the sections name proposed by Lookout whenever it was possible so that\nanybody could follow the two approaches more easily. In this second part, we’re presenting\nthe HTTP communication with the C2 server, the commands received via SMS that were\nimplemented by the spyware, the live audio surveillance functionality, and the keylogging\n[activity. You can consult the first part of the Pegasus analysis here.](https://cybergeeks.tech/a-technical-analysis-of-pegasus-for-android-part-1/)\n\n**Analyst:** [@GeeksCyber](https://twitter.com/GeeksCyber)\n\nTechnical analysis\n\nSHA256: ade8bef0ac29fa363fc9afd958af0074478aef650adeb0318517b48bd996d5d5\n\n**Communication Methods**\n\n**1.** **HTTP Communication**\n\nThe agent constructs the following URL that contains the C2 server, which can be extracted\nfrom the initial configuration or a command sent via SMS:\n\nFigure 1\nThe malware adds “SessionId1” and “SessionId2” to the HTTP headers:\n\n\n-----\n\nFigure 2\nFigure 3 reveals the following values:\n\nSessionId1 = f, which is the token stored on the phone\n\nSessionId2 = c, which is the AES key used to encrypt the files exfiltrated to the C2\nserver\n\nb – AES key that is used to encrypt the SessionId1 and SessionId2 fields\n\na – AES IV that is used during the encryption of the SessionId1 and SessionId2 fields\n\n\n-----\n\nFigure 3\nThe implementation of the AES algorithm is displayed in the figure below.\n\n\n-----\n\nFigure 4\nThe template of the HTTP request is displayed in figure 5:\n\n\n-----\n\nFigure 5\nThe HTTP response should be an XML file containing at least the following fields:\n“response”, “code”, and “message”. The application parses the XML response by overriding\nthe startElement, endElement, and characters methods:\n\n\n-----\n\nFigure 6\nThe agent verifies if the XML response contains the following main commands: “dumpCmd”,\n[“upgrade”, “camCmd”, and “emailAttCmd” (those were described in part 1). In the case of the](https://cybergeeks.tech/a-technical-analysis-of-pegasus-for-android-part-1/)\n“upgrade” command, the threat actor must specify the URL to download the package from\nand others parameters (see figure 7).\n\n\n-----\n\nFigure 7\nThe implementation of the overriding functions is shown below:\n\n\n-----\n\n-----\n\nFigure 8 Figure 9\n\n\n-----\n\nFigure 10\n**2. SMS/MMS/WAP**\n\nAs in the case of the iOS version, the package can receive commands in SMS messages\nthat are disguised as Google authentication codes. It searches for “your google verification\ncode” in the message and extracts the index of the “s=” parameter:\n\nFigure\n\n11\nThe malware computes the MD5 hash of the Token + SMS[0, index+2), which is truncated to\n8 bytes and compares it with SMS[index+2, final] in order to verify the authenticity of the\ncommand:\n\n\n-----\n\nFigure\n\n12\nThe command structure is “text:[6 digits][Command number]a=[Ack ID]&[Command\nArguments]&s=<Message Signature>” and the following regular expression is used to parse\nit: “.*[:]\\d{6}(\\d)[\\n]?(.*)”.\n\nThe following function is utilized to extract the fields from the command and to add it to a\ncommands queue:\n\n\n-----\n\nFigure 13\nThe agent verifies if the phone is Roaming via a function call to isNetworkRoaming:\n\n\n-----\n\nFigure 14\nIf the device is Roaming and the “romingSetted” config value is disabled (0), the application\ncan’t accept commands via HTTP, SMS, and MQTT:\n\nFigure 15\nThe commands received via SMS will be described in the following paragraphs (numbers in\nrange 0-8).\n\n**Command 0**\n\nThe first command is “KILL” and can be used to perform self deletion on the phone:\n\n\n-----\n\nFigure 16\nThe process sets the intent action to “KILL”, retrieves a PendingIntent that will perform a\nbroadcast, and schedules an alarm, as displayed below.\n\n\n-----\n\nFigure 17\nThe application creates a HandlerThread that will perform the necessary operations:\n\nFigure 18\n\nThe getSubscriberId function is used to obtain the unique subscriber ID, and the deletion\noperation continues. A detailed explanation regarding this operation can be found in the 1st\npart of the Pegasus analysis – Suicide functionality section.\n\nFigure 19\n\n\n-----\n\nFigure 20\n**Command 1**\n\nThis command is used to send a “Ping” message via SMS or HTTP. Depending on the value\nreceived in the parameters (“0” or “1”), the spyware chooses between the two\ncommunication channels:\n\nFigure 21\nThe Ack ID received in the command and a counter value will be part of the SMS message\nthat is sent:\n\nFigure 22\nThe process logs the phone number to send messages to, the Ack ID, and the counter. It\ncomputes the time after the last network communication with C2 in seconds:\n\n\n-----\n\nFigure 23\nIn the case of HTTP communication, the agent creates a Handler object and calls the\npostDelayed function with a delay of 5 seconds:\n\nFigure 24\n\nThe malware creates an XmlSerializer object that will be encrypted using the AES algorithm\nand then sent to a C2 server via HTTP. Finally, it checks if the data was successfully sent:\n\n\n-----\n\nFigure 25\n**Command 2**\n\nIn this case, the process tries to compute the index of “&” in the arguments. The resulting two\nvalues will be used to modify the “adrate” and “adlocation” configuration options:\n\nFigure 26\nFor example, if the “adrate” value is set to 0 then the malware stops the location monitoring\nfunctionality. However, if the “adlocation” value is 0 or “adrate” < “adlocation” then the\nmalware starts the functionality:\n\n\n-----\n\nFigure 27\nWhen stopping the location monitoring functionality, the process sets the intent action to\n“finishLocationMonitor” and calls the cancel method:\n\n\n-----\n\nFigure 28\nThe getSystemService function is utilized to retrieve a handle to the location service. The\nagent receives data about the location from the network and passive providers (see figure\n29).\n\nFigure 29\n**Command 3**\n\nThe process configures the following config options:\n\n“WindowTargetSms” – SMS number used in the outbound communication\n\n\n-----\n\nSkypi – Phone number used to trigger the live audio surveillance functionality\n\n“NetworkWindowAddresess”\n\nFigure 30\nThe entire list of config options that can be set using this command is presented at the end of\nthe [Lookout’s paper.](https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-android-technical-analysis.pdf)\n\n**Command 4**\n\nThe application obtains the index of “&” in the arguments and creates two values\nrepresenting the camera snapshot number and time, as shown in figure 31.\n\n\n-----\n\nFigure 31\nThe snapshot source type and the phone camera resolution are logged using the Log.i\nmethod:\n\n\n-----\n\nFigure 32\nThe agent tries to take a snapshot of the screen using a binary called\n“/system/bin/screencap”. The photo is saved at “/data/data/com.network.android/bqul4.dat”.\nA deep dive into the screenshot functionality can be found in the 1st part of the Pegasus\nanalysis.\n\n\n-----\n\nFigure 33\n**Command 5**\n\nIn this case, the malware specifies a file or a directory listing to be exfiltrated. This\ninformation can be transmitted in the “f=” and “p=” parameters:\n\n\n-----\n\nFigure 34\nThe process changes permissions to 777 for the targeted file using the “superuser binary”. It\nverifies the existence of the file by calling the File.exists method and expects a non-empty\nfile:\n\n\n-----\n\nFigure 35\n\nThe application creates a directory called “/data/data/com.network.android/chnkr/” using the\nFile.mkdirs function. The targeted file is copied to the newly created folder, and the malware\nbroadcasts the “new_chunker_file_event” intent to all BroadcastReceivers in order to\nexfiltrate data:\n\n\n-----\n\nFigure 36\n**Command 6**\n\nThis command prepares the phone to accept an audio surveillance call that will be detailed in\nthe “Live Audio Surveillance” section.\n\n\n-----\n\nFigure 37\n**Command 7**\n\nThe package enables the call recording functionality by setting the “window canada” config\nvalue to true:\n\n\n-----\n\nFigure 38\n**Command 8**\n\nThe agent extracts the configured C2 servers and sends a request to one of them in order to\nask for new commands, as shown in the figure below.\n\nFigure 39\nIt sets the intent action to “httpPing”, the intent data to “PING: <Current time in\nmilliseconds>”, retrieves a PendingIntent that will perform a broadcast, and schedules an\nalarm:\n\n\n-----\n\nFigure 40\n\nFigure 41\n**Outbound SMS**\n\nThe malware logs the message “MO sendSmsMO Ping SMS MO Start to number: ” +\nWindowTargetSms, which is the phone number used in the outbound communication:\n\n\n-----\n\nFigure 42\nThe agent extracts the following information: the current location of the device, the numeric\nname (MCC+MNC) of the registered operator, the GSM cell ID, the GSM location area code,\nthe IMEI and IMSI of the device (see figure 43).\n\n\n-----\n\nFigure 43\nThe application obtains the unique subscriber ID that is validated based on its length:\n\n\n-----\n\nFigure 44\n\nSmsManager.getDefault is utilized to retrieve the SmsManager. The process creates two\nIntents with the “SMS_SENT” and “SMS_DELIVERED” parameters and then broadcasts\nthem via a call to getBroadcast. Finally, the SMS containing the information extracted above\nis sent using sentTextMessage:\n\nFigure 45\nThe getResultCode method is used to verify if the message was successfully sent. If that’s\nnot the case, the SMS is re-sent in 1 minute:\n\n\n-----\n\nFigure 46\nThe application logs the number of times it re-sent the SMS using the Log.i method:\n\nFigure 47\n**Live Audio Surveillance**\n\nThe threat actor can enable this functionality only when multiple conditions are met at the\nsame time. The functionality can be activated when the phone receives a call from the\nattacker’s number, and it will allow capturing the audio via the device’s microphone.\n\nThe first condition to be met is that the phone’s screen is OFF, which is verified using a\nvariable that should be false. The malware verifies if the screen is ON or OFF by calling the\nisScreenOn method. The configuration option called “Skypi” should be not null:\n\n\n-----\n\nFigure 48\n\nFigure 49 Figure\n\n50\nThe process makes sure that the user didn’t cancel the previous live surveillance operation,\nas displayed in the figure below.\n\n\n-----\n\nFigure 51\nThe phone should be in the idle state, and the phone’s screen should be locked. The\ninKeyguardRestrictedInputMode function is used to verify the last condition:\n\n\n-----\n\nFigure 52 Figure 53\n\nFigure 54\nThe configuration option called “forwarding” indicates whether call forwarding is enabled on\nthe phone. This feature should be disabled for the functionality to work:\n\n\n-----\n\nFigure 55\n\n\n-----\n\nFigure\n\n56\nThe agent extracts the value of the “STAY_ON_WHILE_PLUGGED_IN” constant. It expects\nthe device to stay off even if it’s charging:\n\nFigure 57\nThe microphone should not be in use for the functionality to work:\n\n\n-----\n\nFigure 58\n\n\n-----\n\n-----\n\nFigure 59\nisWiredHeadsetOn is utilized to confirm that a wired headset is not connected to the phone:\n\nFigure 60\nisBluetoothA2dpOn is utilized to confirm that a Bluetooth A2DP audio peripheral is not\nconnected to the phone:\n\n\n-----\n\nFigure 61\nThe spyware doesn’t expect communications to use Bluetooth SCO at the time of the audio\nsurveillance. It calls the isBluetoothScoOn method for this purpose:\n\n\n-----\n\nFigure 62\nThe music should not be active during the time of the operation, as highlighted below:\n\n\n-----\n\nFigure 63\nThe final condition that must be met is that either the phone is not Roaming or the\nfunctionality was configured by the TA to be performed even if the device is Roaming:\n\n\n-----\n\nFigure 64\n\nFigure 65\n\n\n-----\n\nNow we ll describe the functionality after all of the above conditions are met.\n\n**Audio recording**\n\nThe application creates a MediaRecorder object that can be used to record audio and video:\n\nFigure 66\nThe agent sets the audio mode to 2 (MODE_IN_CALL – a call is established), calls the\nsetStreamSolo function with a True parameter, sets the audio source to be used depending\non the phone’s build model, sets the format of the output file to 2 (MPEG4 media file format),\nand sets the audio encoder to 1 (AMR_NB – narrowband audio codec):\n\n\n-----\n\nFigure 67\n\n\nFigure 68\n\n\n-----\n\nThe directory “/data/data/com.network.android/network_cache/” is created by the spyware:\n\nFigure 69\n\nThe output file is “/data/data/com.network.android/network_cache/cache1.dat<Integer>”, and\nthe recording is started by calling the prepare and start functions:\n\nFigure 70\n\nThe audio files can be exfiltrated by incorporating them into XML files, as displayed in the\nfigure below.\n\n\n-----\n\nFigure 71\n**Phone Calls**\n\nThe following columns can be extracted from the Call logs: “number”, “type”, “date”,\n“duration”, “_id”, and “logtype” (see figure 72).\n\n\n-----\n\nFigure 72\n\n\n-----\n\nThe agent implements a different functionality for calls coming from these two numbers:\n“*762646466” and “*7626464633”. If the phone receives a call from the first number/second\nnumber, then the “romingSetted” configuration option is set to true/false. This option controls\nhow the phone communicates with the C2 server (via SMS, HTTP, MQTT) when it’s\nRoaming:\n\nFigure 73\n\n\n-----\n\nFigure 74\n**Keylogging**\n\nAs we’ve already seen, the spyware logs relevant messages regarding the activities\nperformed:\n\nFigure 75\n\nThe malware expects to find the “superuser binary” called “/system/csk” on the device:\n\n\n-----\n\nFigure 76\nThe files containing the keystrokes will be stored in the “/data/local/tmp/ktmu” folder. The\ncontent of these files will be exfiltrated using XmlSerializer objects with specific tags:\n\n\n-----\n\n-----\n\nFigure 78\nThe application tries to identify the process ID of the keyboard process:\n\nFigure 79\nIt extracts the process ID for the input method service that is currently selected from the\n“default_input_method” value. The getRunningAppProcesses function is utilized to obtain a\nlist of running processes on the phone, and then the spyware extracts the process ID and\nname of the keyboard process:\n\n\n-----\n\nFigure 80\n\n\n-----\n\nFigure 81\nThe libk binary found in the “/res/raw” directory is copied to a new file called\n“/data/local/tmp/libuml.so”. The shared object is injected (using the addk binary) in the\nkeyboard process identified above and will be responsible for the keylogging activity:\n\n\n-----\n\nFigure 82\nThe captured keystrokes will be stored in a file called “/data/local/tmp/ktmu/ulmndd.tmp”, as\nshown in figure 83.\n\n\n-----\n\nFigure 83\nThe agent stores the bitwise NOT of every keystroke in the file using the fwrite instruction:\n\n\n-----\n\nFigure\n\n84\nThe temporary file storing the captured keystrokes is renamed as\n“/data/local/tmp/ktmu/finidk.<current timestamp>”. The current timestamp is obtained using\nthe time syscall:\n\n\n-----\n\nFigure 85\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-27 - A technical analysis of Pegasus for Android – Part 2.pdf"
    ],
    "report_names": [
        "2022-09-27 - A technical analysis of Pegasus for Android – Part 2.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535972,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1664713478,
    "ts_modification_date": 1664713478,
    "files": {
        "pdf": "https://archive.orkl.eu/5e0500ca0641ee60610a686f6d12fd8fa4b111e7.pdf",
        "text": "https://archive.orkl.eu/5e0500ca0641ee60610a686f6d12fd8fa4b111e7.txt",
        "img": "https://archive.orkl.eu/5e0500ca0641ee60610a686f6d12fd8fa4b111e7.jpg"
    }
}