{
    "id": "60984174-fa52-4ece-ac7b-cc334d5daa98",
    "created_at": "2023-01-12T15:08:18.237712Z",
    "updated_at": "2025-03-27T02:11:41.787791Z",
    "deleted_at": null,
    "sha1_hash": "4d55206f983078b4d9b88abf4f2d63daf12245fc",
    "title": "2021-08-11 - The Rising Threat from LockBit Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T21:50:12Z",
    "file_modification_date": "2022-05-27T21:50:12Z",
    "file_size": 1100317,
    "plain_text": "# The Rising Threat from LockBit Ransomware\n\n**[cybereason.com/blog/rising-threat-from-lockbit-ransomware](https://www.cybereason.com/blog/rising-threat-from-lockbit-ransomware)**\n\nWritten By\nTony Bradley\n\nAugust 11, 2021 | 3 minute read\n\n\n-----\n\nLockBit ransomware is the latest threat posing an increased risk for organizations. The\nransomware gang has been making headlines recently. LockBit has also reportedly\ncompromised Accenture.\n\nThe group reportedly revealed the attack on their site on the DarkWeb, noting: “These\npeople are beyond privacy and security. I really hope that their services are better than what\nI saw as an insider. If you are interested in buying some databases, reach us.”\n\n_Screenshot from_\n\n_Lockbit site_\n\n## What Is LockBit?\n\nLockBit is a cybercriminal gang that operates using a ransomware-as-a-service (RaaS)\n[model—similar to DarkSide and](https://www.cybereason.com/_hcms/analytics/search/conversion?redirect=aHR0cHM6Ly93d3cuY3liZXJlYXNvbi5jb20vYmxvZy9jeWJlcmVhc29uLXZzLWRhcmtzaWRlLXJhbnNvbXdhcmU%3D&ct=SEARCH&pid=3354902&cid=44194973264&t=ZGFya3NpZGU%3D&d=www.cybereason.com&c=2&c=6&rp=1&ab=false&opcid=&rs=UNKNOWN&hs-expires=1660226758&hs-version=1&hs-signature=APUk-v71e9ww5Z2nCFFapeqi2vx677ztig) [REvil. LockBit offers its ransomware platform for other](https://www.cybereason.com/_hcms/analytics/search/conversion?redirect=aHR0cHM6Ly93d3cuY3liZXJlYXNvbi5jb20vYmxvZy9jeWJlcmVhc29uLXZzLXJldmlsLXJhbnNvbXdhcmUtdGhlLWthc2V5YS1jaHJvbmljbGVz&ct=SEARCH&pid=3354902&cid=50255403605&t=cmV2aWw%3D&d=www.cybereason.com&c=2&c=6&rp=2&ab=true&opcid=&rs=UNKNOWN&hs-expires=1660226780&hs-version=1&hs-signature=APUk-v4c_sdFoIoZ5qbAYShDCayIDu6cZQ)\nentities or individuals to use based on an affiliate model. Any ransom payments received\nfrom using LockBit are divided between the customer directing the attack and the LockBit\ngang.\n\nLockBit is believed to be related to the LockerGoga and MegaCortex malware families. It\nshares common tactics, techniques, and procedures (TTPs) with these malicious attacks—\nparticularly the ability to propagate automatically to new targets, being used in targeted\n\n\n-----\n\nattacks rather than just spamming or attacking organizations indiscriminately, and the\nunderlying tools it relies on, such as Windows PowerShell and Server Message Block (SMB).\n\n_Screenshot from Lockbit site_\n\nOnce a single host is compromised, LockBit can scan the network to locate and infect other\naccessible devices. It uses tools and protocols that are native to Windows systems—making\nit more difficult for endpoint security tools to detect or identify the activity as malicious.\n\nThe LockBit ransomware continues to adapt and evolve. More recent variants have adopted\nthe double extortion model—locating and exfiltrating valuable data before encrypting\nsystems. The stolen data provides additional incentive for victims to pay the ransom. Even if\nthey can restore data from backups, refusing to pay the ransom may result in sensitive data\nbeing published publicly or sold to competitors.\n\n## Rising Threat\n\nThe LockBit gang has been making headlines recently. In the wake of DarkSide and REvil\nboth shutting down operations, it seems like LockBit may be working to fill the void.\n\n[Lawrence Abrams recently reported that the LockBit ransomware gang is actively recruiting](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-recruiting-insiders-to-breach-corporate-networks/)\ninsiders to help them breach and encrypt networks. According to Abrams, this may be a shift\nfrom the standard ransomware-as-a-service model to cut out the middleman and keep more\nof the ransom profit for themselves.\n\nThe wallpaper displayed on compromised systems now includes text inviting insiders to help\ncompromise systems—promising payouts of millions of dollars.\n\n## Protecting against LockBit Ransomware\n\n\n-----\n\nThere is no good option for an organization once a ransomware attack has compromised\nsystems and encrypted data. That is especially true in the case of a double extortion attack.\nRefusing to pay the ransom means going through a painful process of restoring data from\nbackups and trying to regain control and functionality of your systems while also accepting\nthat your data will likely be exposed.\n\nPaying the ransom may allow the victim to be operational quicker and prevent having data\n[published or sold, but research shows that 80% of companies that pay a ransom end up](https://www.cybereason.com/blog/report-ransomware-attacks-and-the-true-cost-to-business)\ngetting attacked again.\n\nIt is important to have effective protection in place to prevent the ransomware attack from\ngetting that far in the first place. Organizations need to have an operation-centric view of the\n[attack. The ability to view the entire malicious operation—or MalOp—and recognize](https://www.cybereason.com/_hcms/analytics/search/conversion?redirect=aHR0cHM6Ly93d3cuY3liZXJlYXNvbi5jb20vYmxvZy90aGUtY3liZXJlYXNvbi1kaWZmZXJlbmNlLW1hbG9wLWludHJv&ct=SEARCH&pid=3354902&cid=44404671388&t=bWFsb3A%3D&d=www.cybereason.com&c=2&c=6&rp=2&ab=false&opcid=&rs=UNKNOWN&hs-expires=1660229525&hs-version=1&hs-signature=APUk-v78uzg4h3W9xIuiNCmPnCbO8gPDag)\nindicators of behavior enables Cybereason to detect and block ransomware attacks and\nprotect against threats like LockBit.\n\n## Defending Against Ransomware Attacks\n\n[The only way forward for organizations is to prevent an infection from occurring in the first](https://www.cybereason.com/blog/accenture-responds-following-lockbit-ransomware-attack)\nplace. To do that, they need to invest in an anti-ransomware solution that doesn’t rely on\nIndicators of Compromise (IOCs), as not every ransomware attack chain is known to the\nsecurity community. They need a multi-layered platform that uses Indicators of Behavior\n(IOBs) so that security teams can detect and shut down a ransomware attack chain\nregardless of whether anyone’s seen it before.\n\nThe Cybereason Operation-Centric approach means no data filtering and the ability to detect\nattacks earlier based on rare or advantageous chains of (otherwise normal) behaviors.\n[Cybereason is undefeated in the battle against ransomware thanks to our multi-layered](https://www.cybereason.com/prevent-ransomware)\nprevention, detection and response, which includes:\n\n\n-----\n\n**[Anti ransomware prevention and deception: Cybereason uses a combination](https://www.cybereason.com/platform/anti-ransomware)**\nof behavioral detections and proprietary deception techniques surface the most\ncomplex ransomware threats and end the attack before any critical data can be\nencrypted.\n**Intelligence-Based Antivirus: Cybereason blocks known ransomware variants**\nleveraging an ever-growing pool of threat intelligence based on previously\ndetected attacks.\n**[NGAV: Cybereason NGAV is powered by machine learning and recognizes](https://www.cybereason.com/platform/endpoint-prevention)**\nmalicious components in code to block unknown ransomware variants prior to\nexecution.\n**Fileless Ransomware Protection: Cybereason disrupts attacks utilizing fileless**\nand MBR-based ransomware that traditional antivirus tools miss.\n**[Endpoint Controls: Cybereason hardens endpoints against attacks by](https://www.cybereason.com/platform/endpoint-controls)**\nmanaging security policies, maintaining device controls, implementing personal\nfirewalls and enforcing whole-disk encryption across a range of device types,\nboth fixed and mobile.\n**Behavioral Document Protection: Cybereason detects and blocks ransomware**\nhidden in the most common business document formats, including those that\nleverage malicious macros and other stealthy attack vectors.\n\nCybereason is dedicated to teaming with defenders to end cyber attacks from endpoints to\nthe enterprise to everywhere - including modern ransomware. Learn more about\nransomware defense here or [schedule a demo today to learn how your organization can](https://www.cybereason.com/request-a-demo)\n[benefit from an operation-centric approach to security.](https://www.cybereason.com/blog/the-cybereason-malop-achieving-operation-centric-security)\n\n\n-----\n\nAbout the Author\n\n**Tony Bradley**\n\nTony Bradley has a passion for technology and gadgets, and a desire to help others\nunderstand how technology can affect or improve their lives. In addition to writing and editing\nfor Cybereason’s Malicious Life, Tony is a regular contributor to Forbes, DevOps.com, and\nContainerJournal. He is an experienced information security professional, speaker, author /\nco-author of 10 books and thousands of web and print articles. He was awarded the\nMicrosoft MVP (Most Valuable Professional) award for 11 consecutive years, and I've been a\nCISSP (Certified Information Systems Security Professional) since 2002.\n\n[All Posts by Tony Bradley](https://www.cybereason.com/blog/author/tony-bradley)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-11 - The Rising Threat from LockBit Ransomware.pdf"
    ],
    "report_names": [
        "2021-08-11 - The Rising Threat from LockBit Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536098,
    "ts_updated_at": 1743041501,
    "ts_creation_date": 1653688212,
    "ts_modification_date": 1653688212,
    "files": {
        "pdf": "https://archive.orkl.eu/4d55206f983078b4d9b88abf4f2d63daf12245fc.pdf",
        "text": "https://archive.orkl.eu/4d55206f983078b4d9b88abf4f2d63daf12245fc.txt",
        "img": "https://archive.orkl.eu/4d55206f983078b4d9b88abf4f2d63daf12245fc.jpg"
    }
}