{
    "id": "60a956f1-c1cd-42bf-8326-56e988d71163",
    "created_at": "2022-10-25T16:48:10.388291Z",
    "updated_at": "2025-03-27T02:05:26.344258Z",
    "deleted_at": null,
    "sha1_hash": "0c1a4812da35c7924ddc4160c40b2ee0034a8c75",
    "title": "Forensics Report True Hedge",
    "authors": "",
    "file_creation_date": "2020-01-08T17:06:10Z",
    "file_modification_date": "2020-01-27T12:16:36Z",
    "file_size": 508906,
    "plain_text": "# Forensics Report \n\n### Vorläufiger forensischer Abschlussbericht zur Untersuchung des Incidents beim Berliner Kammergericht - Cyber Defense Center (CDC) and Cyber Emergency Response Team (CERT) T-Systems International GmbH\n\n\n-----\n\n## Publication details\n\n**Publisher**\nT-Systems International GmbH\nTelekom Security - Cyber Defense Response and Testing\nBonner Talweg 100\n53113 Bonn\nGermany\n\nAutor\nT-Systems\n23.12.2019\n\n\n-----\n\n## Inhaltsverzeichnis\n\nPublication details .............................................................................................................................. 2\n\nInhaltsverzeichnis ............................................................................................................................... 3\n\n1 Einleitung\n\n1.1 Ziele der Forensischen Untersuchung .................................................................................. 4\n\n1.2 Datenerhebung ..................................................................................................................... 5\n\n2 Management Summary ................................................................................................................. 6\n\n3 Technische Analyse A ................................................................................................................... 7\n\n3.1 Voranalyse vor Ort ................................................................................................................ 7\n\n3.2 Forensische Sicherung der Daten vor Ort ............................................................................. 7\n\n3.3 Analyse des Clients .............................................................................................................. 7\n\n3.3.1 Generelle Client Informationen ............................................................................................................. 7\n\n3.3.2 Emotet: tlblumber.exe ............................................................................................................................. 8\n\n3.3.3 TrickBot Infektion durch Emotet ........................................................................................................... 9\n\n3.3.4 Infektionsweg ........................................................................................................................................ 10\n\n3.4 Analyse des primären Domaincontrollers ............................................................................ 11\n\n3.4.1 Untersuchung der Registry ................................................................................................................. 11\n\n3.4.2 Untersuchung der Windows Event Logs .......................................................................................... 11\n\n3.4.3 Untersuchung des Active Directory ................................................................................................... 12\n\n3.5 Fazit ................................................................................................................................... 13\n\n3.6 Empfehlungen: ................................................................................................................... 14\n\n\n-----\n\n## 1 Einleitung\n\nDas IT-Dienstleistungszentrum (ITDZ) informierte das Berliner Kammergericht (KG) am 25.09.2019\nüber eine potentielle Information mit Schadsoftware innerhalb des Netzwerks des KG. Grund für die\nBenachrichtigung war die Kommunikation zu bekannten Command-and-Control (C2) Servern, welche\ndem ITDZ als IT-Provider des KG in den Logdaten der dort eingesetzten Proxy-Server auffiel. Als\nReaktion wurde im Kammergericht eine Abschaltung der Internetkommunikation für das\nKammergericht durchgeführt.\nAufgrund der hausinternen Untersuchung wurde ein Befall mit der Schadsoftware Emotet vermutet.\nAls Konsequenz beauftragte das KG die T-Systems mit der forensischen Untersuchung dieses\nSicherheitsvorfalls. Die Beauftragung erfolgte am 01.10.2019.\n\nBeteiligte Fachbereiche\n\nKammergericht\n\n    - Informationssicherheitsbeauftragter der o.G.\n    - Server-Administration\nT-Systems\n\n    - Major Incident Management\n    - Forensik\n\nParallele Aktivitäten\n\nMcAfee\n\n    - hat die eingesetzte Software überprüft und aktualisiert\nFA. DTS\n\n    - hat eine erste forensische Bewertung vorgenommen\nLKA\n\n    - strafrechtliche Ermittlungen\n\n### 1.1 Ziele der Forensischen Untersuchung\n\nDas Ziel der forensischen Untersuchung wurde in einem Vor-Ort Termin beim Kammergericht in\nBerlin definiert. Die Zieldefinition wurde im Dokument „Ziele Forensik KG Sep/Okt 2019 vom\n08.10.2019“ vom Kammergericht definiert. Das übergreifende Ziel der Untersuchung war die\nErmittlung von Informationen zum Ausmaß des eingetreten Störfalls. Als zusätzliches Ziel wurde\nabgestimmt, dass konstruktive Hinweise für eine sichere IT-Architektur aufgezeigt werden sollten.\nVier forensische Ziele sind klar definiert mit absteigender Priorität:\n\n1. Welche Indizien/Beweise lassen sich finden, dass auf den Systemen des KG manipuliert\nwurde bzw. Fremdzugriffe stattfanden?\n2. Lassen sich unautorisierte Maßnahmen finden?\n3. Lassen sich Informationen zur Risikoabschätzung „betroffenes Gerät/System“ versus\n„Gerät/System ist Schadsoftwarefrei“ finden?\n4. Wann und wo war der Ursprung des Sicherheitsvorfalls?\n\n\n-----\n\nAufgrund der Netzwerkstruktur des KG ließ sich nicht klar definieren welche Bereiche des Netzwerks\nbetroffen/nicht betroffen sind. Zudem wäre es einem motivierten Angreifer möglich gewesen diese\nNetzstruktur auszunutzen, um fast jedes Gerät zu infizieren. Dadurch lässt sich der Bereich der\nInfektion nicht ohne eine vollumfängliche Analyse der gesamten Struktur des KG eingrenzen. Im\nGespräch zum weiteren Vorgehen am 09.10.2019 wurde abgestimmt, dass eine solche zeit- und\nkostenintensive Untersuchung nicht durchgeführt wird. Stattdessen soll durch die Untersuchung\neines hochwahrscheinlich infizierten Computers und des primären Domaincontrollers der Schaden\nabgeschätzt werden. Dadurch sollen Informationen gewonnen werden um die o. g. Ziele zu\nerreichen.\n\n### 1.2 Datenerhebung\n\nT-Systems Forensiker führten am 02.10.2019 eine Analyse vor Ort durch, um eine Ersteinschätzung\nder Lage vor Ort zu erheben. Hier wurden erste Indikatoren einer Malware Infektion gesammelt und\ngesichert. Zudem wurde durch das IT-Personal des KG Logfiles vom Web-Proxy bereitgestellt. Der\nWeb-Proxy des KG Berlin wurde als Reaktion auf die Meldung des ITDZ so konfiguriert dass alle\nClient Anfragen in Logdateien aufgezeichnet werden.\nAm 16.10.2019 ein Client und der primäre Domain Controller forensisch gesichert (Jeweils\nArbeitsspeicher und Festplatten). Die Gesamtheit dieser Dateien bildet die Grundlage der\nforensischen Analyse.\n\n\n-----\n\n## 2 Management Summary\n\nZur Untersuchung des IT-Sicherheitsvorfalls beim Kammergericht Berlin wurde eine forensische\nUntersuchung in zwei Stufen durchgeführt. Bei einer ersten Vor-Ort Untersuchung am 02.10.2019\nwurde der Umfang des Incidents abgeschätzt. Die ersten Indikatoren deuteten auf einen\nschwerwiegenden Fall einer Emotet Infektion mit nicht abzuschätzenden Folgen für das Netzwerk,\ndie Systeme und Daten des Kammergerichts hin. Diese Einschätzung beruhte auf drei Aspekten:\n\n1. Auf Rechnern des Kammergerichts wurde an mehreren Stellen Malware gefunden, welche\nden typischen Kriterien der Schadsoftware Emotet entspricht.\n2. Kurzfristig erhobene Logdateien eines Proxyservers zeigten Kommunikation zu Command\nand Control Servern, welche Emotet zuzuordnen sind.\n3. Die IT-Infrastruktur des Kammergerichts ist nicht ausreichend vor Angriffen geschützt. Dem\nAngreifer ist es möglich gewesen mit einem Tunnel ins Netzwerk (bspw. durch einen\ninfizierten Rechner) massiven Einfluss auf die Daten und Systeme des KG zu nehmen.\n\nBasierend auf dieser Ersteinschätzung wurden in einem weiteren Vor-Ort Gespräch vom 09.10.2019\nentschieden einen infizierten Computer und den primären Domaincontroller zu untersuchen. Diese\nGeräte wurden forensisch gesichert und im Forensiklabor der T-Systems untersucht.\nFeststellung der Untersuchung ist, dass die initiale Infektion auf dem untersuchten Computer durch\nEmotet erfolgte. Der genaue Infektionsweg konnte anhand der gesicherten Systeme nicht identifiziert\nwerden, da Logfiles nur teilweise vorlagen. Erfahrungsgemäß wird hierfür ein manipuliertes WordDokument mit aktivierten Makros verwendet. Emotet selbst lud auf dem untersuchten Computer die\neigentliche Schadware TrickBot nach. TrickBot ist in der Lage beliebige Schadmodule auszuführen.\nAuf dem untersuchten Computer ließen sich drei Module identifizieren:\n\n  - Auf dem System gespeicherte Passwörter (insbesondere Browserpasswörter) werden\nextrahiert und an die Angreifer weitergeleitet.\n\n  - Dem Nutzer werden im Webbrowser Passwörter aktiv entlockt, insbesondere von OnlineBanking Webseiten.\n\n  - Informationen über die Systeme werden dem Angreifer zugespielt.\n\nDie besondere Schwere des Angriffs liegt in der fehlenden Netzwerksegmentierung des KG sowie\nlokale Administratorenaccounts der Nutzer. Auch erschwert das fehlende Logging am Proxyserver,\nwelches erst nach Bekanntwerden des Incidents aktiviert wurde, die Aufklärung.\n\nEine Infektion des Active Directory kann nicht ausgeschlossen werden, wurde jedoch nicht\nnachgewiesen. Wir weisen jedoch ausdrücklich darauf hin, dass ein Angreifer höchstwahrscheinlich\nin der Lage gewesen ist, einen verborgenen Account anzulegen und den gesamten Datenbestand\ndes KG zu exfiltrieren und zu manipulieren während gleichzeitig die Spuren verschleiert werden.\n\nAufgrund der Unwägbarkeiten der Infektion kann eine Kompromittierung der IT-Infrastruktur des KG\nnicht ausgeschlossen werden. Ein kompletter Neuaufbau der IT-Infrastruktur wird daher angeraten.\nDie Datenbestände (Exchange Server, Fileserver) müssen von Schadsoftware bereinigt werden bevor\ndiese migriert werden können. Die Server selbst sollten ebenfalls neu aufgesetzt werden.\n\n\n-----\n\n## 3 Technische Analyse A\n\nIn diesem Kapitel werden die gewonnen Erkenntnisse der Forensik beschrieben. Es wird auf die drei\nSchritte Voranalyse vor Ort, Analyse des Clients, und Analyse des primären Domaincontrollers\neingegangen. Die Zeitzone für alle Datei-Zeitstempel in dieser Untersuchung ist UTC soweit nicht\nanders angegeben.\n\n### 3.1 Voranalyse vor Ort\n\nWährend der ersten Analyse vor Ort am 02.10.2019 wurden vor allem Informationen gesichert um die\nAusbreitung und die Verbreitungsmöglichkeiten der gefundenen Schadsoftware abzuschätzen. In\nZusammenarbeit mit einem Consultant der Firma McAfee wurden Malware Samples untersucht und\ndie Kommunikation mit dem Command and Control Server in den Logdaten der Proxy Server\nnachvollzogen. Bei der Analyse der Malwaresamples konnte bereits bekannte Schadsoftware\nfestgestellt werden. Von Firma McAfee wurde versucht speziell auf die beim KG festgestellte\nBedrohung zugeschnittene Signaturen zu erstellen.\nDie Voranalyse hat eine tiefe Kompromittierung der Infrastruktur des KG aufgezeigt. Indizien wie\nfehlende Event Logs legen die Vermutung nahe das auch ein Zugriff durch Dritte von extern erfolgt\nist und die Command and Control Verbindung aktiv zur Steuerung des Angriffs ausgenutzt wurde.\n\n### 3.2 Forensische Sicherung der Daten vor Ort\n\nBei einem Vor-Ort Termin am 16.11.2019 wurden der Client mit der internen Bezeichnung und der\nprimäre Domaincontroller gesichert. Es wurden jeweils der Hauptspeicher (RAM) sowie der\nFestplattenspeicher gesichert. Für eine forensische Sicherung wird eine Sicherung des Systems so\ndurchgeführt wie das System vorgefunden wird um die vorgefundenen Zustände möglichst wenig zu\nverändern. Ist ein System zu Beginn der Sicherung bereits eingeschaltet wird daher zuerst der RAM\ngesichert um dann das System herunterzufahren und die Festplatten zu sichern. Ist das System\nheruntergefahren wird zuerst der Festplattenspeicher gesichert.\nDer Client war beim Eintreffen vor Ort heruntergefahren; der Domaincontroller befand sich in Betrieb.\n\n### 3.3 Analyse des Clients \n\nBei dem Betriebssystem des Clients handelt es sich um Windows 7 64bit mit Servicepack 1. Im\nErsten Schritt der Analyse wird der Arbeitsspeicher auf laufende verdächtige Prozesse untersucht.\nDie Informationen aus dem Arbeitsspeicher werden dann mit den Dateien vom Image korreliert. Das\nImage enthält vier Partitionen, die Analysen fokussieren sich auf die Windows-Partition.\nAlle Dateien des Rechners werden aufbereitet und sofern möglich die Zeitstempel extrahiert. Die\nresultierenden Daten werden zur Analyse eingespielt. Somit lässt sich eine Korrelation zwischen\nSystemereignissen wie Dateierstellung und Windows-Events ableiten.\n\n### 3.3.1 Generelle Client Informationen\n\n\n-----\n\nFür die nähere Untersuchung kamen durch den zeitlichen Rahmen der Infektion (letzter Login ab\ndem 01.01.2019) lediglich vier Nutzer in Frage.\n\n1. Letzter Login am 25.09.2019 – 09:40:22\n2. Letzter Login am 11.09.2019 – 13:45:21\n3. Letzter Login am 16.06.2019 – 09:40:51\n4. Letzter Login am 11.10.2019 – 08:52:45\n\n### 3.3.2 Emotet: tlblumber.exe\n\n**Erkennung der Infektion im Arbeitsspeicher:**\nBei einer Untersuchung aller Prozesse, welche eine Netzwerkverbindung aufbauen, fiel ein Prozess\nmit dem Namen „tlblumber.exe“ auf, welcher auf allen lokalen Interfaces lauscht. Eine solche Datei\nwurde bereits in den Voranalysen als maliziös identifiziert.\nDie von tlblumber.exe genutzten DLLs (Dynamic Link Library) sind Standard-Windows DLLs. Es\nhandelt sich bei tlblumber.exe um eine gepackte Datei. Gepackte Dateien enthalten einen\nEntpackungsalgorithmus und einen obfuskierten Datenanteil. Beim Aufrufen wird zunächst die\nPayload der Schadware deobfuskiert und dann ausgeführt, um eine Analyse der Schadware zu\nerschweren.\n\n**Untersuchung der Schadware:**\nDie Datei tlblumber.exe selbst wurde aus dem Image extrahiert und in einer Sandbox gestartet.\nDurch die dynamische Analyse ergaben sich drei Findings:\n\n1. Die Datei C:\\User\\admin\\AppData\\Local\\easywindow\\easywindow.exe wird erstellt\n\n2. Kommunikation zu einem Comand and Control Server (C2 Server) findet statt\n\n3. Bei tlblumber.exe handelt es sich um Emotet-Schadware\n\nDie Datei easywindows.exe befindet sich zwar nicht auf dem vorliegenden Image, wurde aber auf\nanderen Systemen während der Voranalyse mehrfach gesichtet. Der Hash der in der VM-generierten\n_easywindow.exe ist gleich der auf dem Image gefundenen tlblumber.exe, es handelt sich also um die_\ngleiche Datei. Die C2 Server -Adresse wurde auch in den Voranalysen der Logdateien des Proxy\nServers als C2-IP-Adresse identifiziert. Der Unterschied der Dateinamen und Speicherorte sind\nhöchstwahrscheinlich Maßnahmen von Emotet, um die Analyse und Erkennung zu erschweren.\n\nDas Verhalten von Emotet ist abhängig von einer in der tlblumber.exe integrierten Konfiguration.\nÜber ein Skript ließ sich diese Konfiguration extrahieren. Die Konfiguration besteht aus OpenSSHCredentials und zu kontaktierenden IP-Adressen. Auch hier findet sich die in der Sandbox\nkontaktierte IP-Adresse. Einige der kontaktierten IP-Adressen der Proxylogs aus der Voranalyse finden\nsich ebenfalls in der Konfiguration.\n\n**Spuren der Malware auf dem Image**\nDie Windows File-Informationen geben an, dass die Datei tlblumber.exe am 23.09.2019 um 12:49:32\nerstellt wurde. Andere Dateiartefakte wie Windows Prefetch Dateien zeigen jedoch frühere Zeitpunkte\nan (C:\\Windows\\Prefetch\\TLBLUMBERB.EXE-472D4E9.pf, erstellt am 20.09.2019 – 17:52:40). Daher\nwird der 20.09.2019 als Infektionszeitpunkt angenommen.\n\n\n-----\n\nDie erste hier dokumentierte Ausführung von tlblumber.exe ist auf Freitag den 20.09.2019 um 13:30\ndatiert. Bis zum 23.09.2019 12:49 wurde die Datei 21-mal automatisiert gestartet.\n\nZwei Ausführungen von Dateien mit leicht anderem Namen (tlblumbera.exe und tlblumberb.exe)\nlassen sich auf Juli 2009 datieren. Der Grund für dieses Datum und weitere Informationen über diese\nEinträge sind nicht bekannt.\n\n**Erstinfektion mit tlblumber.exe**\nAufgrund Häufung von zeitlichen Indikatoren wie die Erstellung der Prefetch Dateien und der\nAutostart-Einträge liegt der Infektionszeitpunkt t0 für den untersuchten Client vermutlich am\n20.09.2019 um 17:52:40. Der Zeitpunkt 20.09.2019 um 13:30 wird nicht als Infektionszeitpunkt\nangesehen, da hier keine weiteren zeitlichen Korrelationen existieren (Systemlogs, erstellte Dateien\netc.) und von einem False-Positive ausgegangen wird.\nAusgeschlossen werden kann eine frühere Infektion jedoch nicht, da Zeitstempel überschrieben\nwerden können und nur der Zeitstempel des jeweils letzten Events vorhanden ist.\n**t0 ist nur für den vorliegenden untersuchten Rechner gültig. Da Emotet sich typischerweise nicht**\nwurmartig lateral ausbreitet kann aus t0 keine allgemeingültige Aussage für andere Rechner gezogen\nwerden. Laterales Movement durch nachgeladenen TrickBot von anderen infizierten Rechnern aus\nkann nicht ausgeschlossen werden.\n\n### 3.3.3 TrickBot Infektion durch Emotet\n\nEmotet selbst ist eine Schadware, welche den Weg in das Netzwerk für weitere Schadware anbietet.\nTypischerweise ist dies bei derzeitigen Infektionen eine Schadware mit dem Namen TrickBot\nTrickBot selbst bietet mehrere Module an, welche alle eigenständig arbeiten und Funktionen wie\nRansomware-Erpressung, Kryptomining, oder andere Schadsoftware ausführen. Die genutzten\nModule werden oft in verschlüsselter Version als Konfigurationsdatei zusammen mit der TrickBot\nMalware heruntergeladen. TrickBot selbst entschlüsselt dann diese Konfigurationsdatei und agiert\nentsprechend der Anweisungen weiter.\n\n**Identifikation von TrickBot**\nDurch die Infektion mit tlblumber.exe ist eine vermutliche Erstinfektion am 20.09.2019 gegen\n17:52:40 erkannt worden. Kurz darauf (17:53:17 bis 17:54:32) wurden mehrere weitere Dateien\nerstellt (Created Timestamp):\n\n  - \\ProgramData\\JrxZRaiaq1wQaciz2B.exe\n\n  - \\Windows\\Prefetch\\TLBLUMBERB.EXE-76BCB4CB.pf\n\n  - \\ProgramData\\სახელმწიფო.exe\n\n  - \\Windows\\System32\\config\\systemprofile\\AppData\\Roaming\\iCloud\\სახელმწიფო.exe\n\n  - \\Windows\\System32\\config\\systemprofile\\AppData\\Roaming\\iCloud\\McTrayPluginStateHisto\nry.txt\n\n  - \\Windows\\Prefetch\\სახელმწიფო.EXE-BDB1E741.pf\n\nDie Dateien JrxZRaiaq1wQaciz2B.exe und სახელმწიფო.exe sind unabhängig von ihrem\nSpeicherort auf Basis ihrer Hashsumme identisch. Sie werden als TrickBot-Malware eingestuft.\n\n\n-----\n\n**Untersuchung von TrickBot**\nIm Windows Tasklplaner fand sich ein Task welcher auf die Datei\n_\\Windows\\System32\\config\\systemprofile\\AppData\\Roaming\\iCloud\\სახელმწიფო.exe verweist und_\nals Startzeit den 20.09.2019 um 19:54:25 angibt (UTC+2). Die Datei für den Taskplaner befand sich\nunter C:\\Windows\\System32\\Tasks\\iCloud Free Disk. Somit wurde das Starten der Schadware nach\neinem Reboot garantiert.\nDie Datei McTrayPluginStateHistory.txt konnte zu einer XML-Datei entschlüsselt werden. In der\nentschlüsselten Konfigurationsdatei sind mehrere C2 Server-Adressen sowie die von TrickBot\nauszuführenden Module aufgelistet:\n\n  - module name=“systeminfo“ ctl=“GetSystemInfo”\n\n  - module name=”injectDll”\n\n  - module name=”pwgrab”\n\nDas Modul systeminfo liest Informationen wie das Betriebssystems des infizierten Rechners aus und\nleitet diese Informationen an den C2 Server weiter. Das Modul injectDll versucht login-Daten für\nBanken über Pop-ups abzugreifen und an den C2 Server zu senden. Das Modul pwgrab untersucht\nlokal hinterlegte Passwortdatenbanken für Browser und einige Softwareapplikationen und sendet\ndiese an den C2 Server. Auch ist ein Identifier für die TrickBot Kampagne der Konfigurationsdatei\nbeigelegt (<gtag>mor5</gtag>).\n\n### 3.3.4 Infektionsweg\n\nDer Infektionsweg auf dem Client konnte nicht nachvollzogen werden. Eine Verbreitung von Emotet\nohne Office-Dokumente ist nicht geläufig. Daher ist auch in diesem Fall von einer derartigen Infektion\nauszugehen. In der Regel wird ein Emotet-Office-Dokument mit Makros als Anhang einer Email\nübermittelt. Wichtig für die Infektion ist jedoch nur das Ausführen des Dokuments und das Aktivieren\nder Makros (standardmäßig in Office deaktiviert).\nDie auf dem Rechner gespeicherten Emails aus dem Jahr 2019 sind alle einem User zugeordnet. Die\nletzte empfangene Mail ist auf den 11.09.2019 um 12:20:43 datiert. In den Mails ließen sich keine mit\nMakros versehenen Office-Dokumente und mit Emotet infizierten Anhänge identifizieren.\n\nEine Suche auf dem Dateisystem nach Office-Dokumenten verlief ebenfalls ohne Befund. Das jüngste\nDokument auf dem System ist ein autogeneriertes Outlookdokument vom 16.05.2019 um 11:05:06.\n\nMöglich ist das Aufrufen einer Webmail Website und das Öffnen des manipulierten Office-Dokuments\nüber den Browser. Daher wurde die Internet-Historie untersucht. Es finden sich auch hier keine\nIndizien für eine der Infektion zuzuordnenden Website oder den Download einer maliziösen Datei.\nDie letzten Zugriffe fanden am 11.10.2019, also deutlich nach der Infektion, durch den Internet\nExplorer statt.\nZwischen dem 23.09.2019 um 04:57:49 und dem 25.09.2019 ließen sich Zugriffe über den Internet\nExplorer nachweisen.\nAuch sind Zugriffe vom 11.09.2019 zwischen 11:08:22 und 12:38:02 auf Dateien festzustellen. Die\nNamen der Dateien wurden auch als Dateinamen in Email-Anhängen aus Mitte September entdeckt\nund als unbedenklich eingestuft.\n\n\n-----\n\nEin weiterer denkbarer Infektionsweg ist ein USB-Datenträger welcher die maliziöse Datei enthält.\nHierbei fallen zwei Datenträger in einen denkbaren Zeitraum:\n\n  - 11.10.2019 – 08:47:28 Kingston Data Traveler\n\n  - 11.09.2019 – 11:07:40 Kingston Data Traveler\n\nEine Infektion über einen USB-Stick kann weder ausgeschlossen, noch nachgewiesen werden.\nDer genaue Infektionsweg kann nicht bestimmt werden. Eine Infektion über den Fileserver ist nicht\nauszuschließen.\n\n### 3.4 Analyse des primären Domaincontrollers \n\nAls zentrales Element der KG Netzinfrastruktur ist der (primäre) Domaincontroller (DC) von hoher\nPriorität für einen Angreifer. Indikationen für eine Infektion des DC würden weitreichende\nManipulationen des Angreifers nachweisen und stellen das Worst-Case Szenario dar.\nDer Server basiert auf Windows Server 2008R2x64 mit ServicePack1. Aus der Registry1 ließ sich\nermitteln, dass der Server am 05. April 2015 in Betrieb genommen wurde. Es wurden keine\nAuffälligkeiten in den Shutdown- und Bootvorgängen gefunden. Eine virtuelle Maschine liegt vor und\nwird in der Analyse zum Abgleich zwischen den beiden Servern genutzt, ist jedoch nicht im Fokus\nder Forensik.\nBei der Analyse werden die gleichen grundlegenden Tools und Methoden genutzt, welche auch beim\nClient verwendet werden.\n\n### 3.4.1 Untersuchung der Registry\n\nAlle im Arbeitsspeicher präsenten Prozesse sind unauffällig. Die vorgefundenen\nNetzwerkverbindungen entsprechen den Funktionen des Servers (LDAP, DNS). Es konnten keine\nversteckten Prozesse gefunden werden.\n\nDie Untersuchung gängiger Persistenzmechanismen für Schadware wie Einträge in AutostartRegistry Schlüsseln oder Tasks fand keine maliziösen Aktivitäten.\n\nDem Registry Schlüssel HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Enum\\USBSTOR sind\nzwei angeschlossene USB-Datenträger zu entnehmen, welche im Jahr 2019 angeschlossen wurden.\nEin Datenträger ist der für die RAM-Sicherung genutzte Storejet Transcend was über Seriennummer\nund Datum bestätigt wurde. Bei dem anderen Gerät handelt es sich um ein USB-Gerät der Firma\nPatriot Memory, welches am 10.10.2019 um 06:46:27 angeschlossen wurde. Ob es sich hierbei um\neine legitime Verbindung oder die Quelle der Infektion handelt lässt sich durch die vorliegende\nDatenbasis nicht klären.\n\n### 3.4.2 Untersuchung der Windows Event Logs\n\n\n-----\n\nInformationen über Windows Server finden sich in den Windows Event Logs, welche sich in diversen\n.evtx Dateien auf dem Windows Server befinden. Insbesondere die sicherheitskritischen Eventlogs\naus der Datei \\Windows\\System32\\winevt\\Logs\\Security.evtx wurden untersucht. Für Eventlogs ist\nein Größenlimit konfigurierbar. Ist das Limit erreicht werden frühere Daten aus den Logs gelöscht um\nPlatz für neuere Daten zu schaffen. Die Sicherheitseventlogs reichen lediglich vom 16.10.2019 um\n13:10:06 bis zum 14.10.2019 um 13:23:37 zurück. Die Dateigröße von 128MB deutet auf das\nErreichen der maximalen Logfilegröße hin. Dadurch können keine Aussagen über Loginaktivitäten\ndurch einen etwaigen Angreifer vor dem 14.10.2019 getroffen werden. Dies ist insbesondere mit\nHinblick auf den Infektionszeitraum um den 20.09.2019 problematisch. Die Konfiguration der\nLogfilegröße sollte so abgeändert werden, dass mehrere Monate betrachtet werden können.\n\nDie vorhandenen Logdaten zeigen Logins mit Eventcode 4624 und Logon Type 2 was für manuelle\ninteraktive Logins (Remote und Local) steht.\n\nAm 14.10.2019 um 15:02:27 wurde ein gescheiterter Loginversuch dokumentiert.\nEs wurden zudem mehrere gescheiterte Loginversuche vom 16.10.2019 um 09:43:04 bis zum\n16.10.2019 bis 09:57:03 beobachtet, die während der forensischen Sicherung entstanden sind und\ndamit als unbedenklich eingestuft werden.\nZudem wurde ein einzelner gescheiterter Loginversuch am 16.10.2019 um 12:25:21 dokumentiert\nwelcher ebenfalls der Sicherung zuzuordnen ist. Die Zeiten sind in GMT+0 angegeben.\n\nLogon Type 3 beschreibt Logins durch automatisierte Dienste wie z. B. Kerberos oder FileserverZugriffe. Hier sind zwischen dem 14.10.2019 13:24:06 und dem 16.10.2019 13:09:03 33.613 Zugriffe\ndokumentiert, welche aufgrund der Serverfunktion als Domaincontroller zu erwarten sind.\n\nZwischen dem 14.10.2019 13:42:36 und dem 16.10.2019 13:05:03 wurden 30 Logins mit Logon Type\n5 dokumentiert. Diese werden durch die Aktivierung von System-Services ausgelöst.\n\nAuch unter Logon Type 7, welcher Unlocks aus dem gesperrten Zustand beschreibt, finden sich nur\nlegitime Logon Events aus dem zeitlichen Bereich der forensischen Datensicherung.\n\nEs finden sich zwei Remote Logins (Logon Type 10) am 14.10.2019 um 14:24:15 und 15:03:20. Es ist\nzu klären ob es sich hierbei um legitime Logins handelt.\n\nWeitere Event-IDs wie unter anderem die IDs 4724 (Zurücksetzen eines Passworts), 4735 (Lokale\nGruppe verändert), 4738 (Passwort geändert) oder 7045 (Ein Service wurde installiert) konnten durch\ndas Logfile-Limit nicht in den Eventlogs gefunden werden.\n\n### 3.4.3 Untersuchung des Active Directory\n\nKerndatei des Active Directory ist die ntds.dit. In dem vorliegenden Image des heruntergefahrenen\nDomain Controllers ist diese Datei auf der RAID5 Datenpartition vorhanden (unter \\NTDS\\ntds.dit)\naber leer. Bei einer Überprüfung durch das KG am 29.10.2019 ergab sich, dass die Datei auf dem\nDomaincontroller (in Betrieb) mit einer Größe von 1,02GB wie erwartet vorliegt. Die Ursache dieser\nDiskrepanz ist nicht bekannt.\nUm trotzdem Manipulationen der Domäne erkennen zu können wird die ntds.dit Datei des\nsekundären Domaincontrollers extrahiert und untersucht. Zwischen den beiden Domaincontrollern\nbestand eine Synchronisierung auf Netzwerkebene. Die Netzwerkverbindung zwischen den\n\n\n-----\n\nDomaincontrollern wurde am 29.09.2019 aufgrund der Emotet Infektionen unterbrochen und nicht\nwieder in Betrieb genommen.\nDie verdächtigen Veränderungen an der Active Directory Struktur basierend auf den Ergebnissen der\n_ntds.dit sollten durch die Adminstratoren des KG untersucht werden (legitim oder nicht legitim)._\n\n### 3.5 Fazit\n\nDer Befall der IT-Infrastruktur des KG Berlin ist schwerwiegend. Es konnten klare Beweise für eine\nInfektion mit bekannter Malware festgestellt werden. Durch Untersuchung eines Clients ist eine\nInfektion ab spätestens 20.09.2019 um 17:52 nachgewiesen.\nDie Erkennung der auf den Systemen gefundenen Malware Varianten durch die Endpoint Protection\nLösung von McAfee war zum Zeitpunkt der Infektion nicht gegeben. Die konkreten Fragestellungen\nder Untersuchung sind im Folgenden noch einmal konkret aufgeführt.\n\n1. Welche Indizien/Beweise lassen sich finden, dass auf den Systemen des KG manipuliert\nwurde bzw. Fremdzugriffe stattfanden?\n\nKlare Infektion durch Trickbot und Emotet Malware vorgefunden, AD Zugriffe nicht\nlückenlos rekonstruierbar, da die vorhandenen Logdateien nicht ausreichend waren.\n\n2. Lassen sich unautorisierte Maßnahmen finden?\n\nJa, Die Module von Trickbot sind klar auf Datenabfluss ausgerichtet. Eine\nVerschlüsselung oder Manipulation von Dateien auf den Geräten konnte nicht\nnachgewiesen werden.\n\n3. Lassen sich Informationen zur Risikoabschätzung „betroffenes Gerät/System“ versus\n„Gerät/System ist schadsoftwarefrei“ finden?\n\nEs gibt klare Indicators of Compromise, diese sind aber sicherlich nicht konklusiv.\nEine individuelle Bereinigung ggf. durch eine Sandboxlösung wie die FireEye FX-Serie\nmuss erfolgen.\n\n4. Wann und wo war der Ursprung des Sicherheitsvorfalls?\n\nDer Ursprung des Sicherheitsvorfalls ist weiterhin unbekannt. Aufgrund der Struktur\nvon Emotet und dem üblichen Verhalten ist von E-Mails mit bösartigen Makros in\nWorddokumenten auszugehen. Durch die IT- Infrastrukur (keine\nNetzwerksegmentierung, keine Filterung am Gateway, keine Proxy Logdaten, lokale\nAdministratoren, mangelnde AD Logs) wurde aus einem Standardvorfall ein massiver\nIncident.\nZusätzlich konnten klare Mängel bei der Leistungsfähigkeit bzw. Aktualität der\nEndpoint Protection Lösung von McAfee festgestellt werden. Diese hat Malware die\nzum Zeitpunkt der Infektion bereits bekannt war nicht erkannt.\n\n\n-----\n\n### 3.6 Empfehlungen: \n\nDie T-Systems empfiehlt umfangreiches Logging auf allen Servern und Arbeitsplatzsystemen, um\nVorfälle besser nachvollziehbar zu machen. Eine klare Netzwerksegmentierung sowie ein fein\ngegliedertes Berechtigungskonzept können den Umfang von Incidents deutlich verringern.\nEs wird empfohlen die gesamte Windows Domäne neu aufzusetzen, auch um eventuelle Altlasten\nnicht zu übernehmen. Das KG Berlin kann die aktuelle Situation nutzen um ein leistungsfähiges und\nsicheres neues Netzwerk zu konstruieren und den Schaden bei zukünftigen Vorfällen stark zu\nbegrenzen.\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.berlin.de/sen/justva/presse/pressemitteilungen/2020/pm-11-2020-t-systems-forensik_bericht_public_v1.pdf"
    ],
    "report_names": [
        "pm-11-2020-t-systems-forensik_bericht_public_v1.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1578503170,
    "ts_modification_date": 1580127396,
    "files": {
        "pdf": "https://archive.orkl.eu/0c1a4812da35c7924ddc4160c40b2ee0034a8c75.pdf",
        "text": "https://archive.orkl.eu/0c1a4812da35c7924ddc4160c40b2ee0034a8c75.txt",
        "img": "https://archive.orkl.eu/0c1a4812da35c7924ddc4160c40b2ee0034a8c75.jpg"
    }
}