{
    "id": "60adb383-77cc-451e-897d-ef894c081647",
    "created_at": "2023-01-12T14:59:32.030798Z",
    "updated_at": "2025-03-27T02:06:10.896486Z",
    "deleted_at": null,
    "sha1_hash": "6b7265155cc0ec22bd23e67e409d8d834aebad10",
    "title": "2017-01-12 - New Variant of Ploutus ATM Malware Observed in the Wild in Latin America",
    "authors": "",
    "file_creation_date": "2022-05-28T18:00:17Z",
    "file_modification_date": "2022-05-28T18:00:17Z",
    "file_size": 100938,
    "plain_text": "# New Variant of Ploutus ATM Malware Observed in the Wild in Latin America\n\n**[fireeye.com/blog/threat-research/2017/01/new_ploutus_variant.html](https://www.fireeye.com/blog/threat-research/2017/01/new_ploutus_variant.html)**\n\n## Breadcrumb\n\nThreat Research\n\nDaniel Regalado\n\nJan 11, 2017\n\n8 mins read\n\n**Introduction**\n\n\n-----\n\nPloutus is one of the most advanced ATM malware families we ve seen in the last few years.\n[Discovered for the first time in Mexico back in 2013, Ploutus enabled criminals to empty](https://community.broadcom.com/symantecenterprise/communities/community-home/librarydocuments/viewdocument?DocumentKey=4274cb7f-d65d-4928-bdf4-0275eedc80d2&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments)\n[ATMs using either an external keyboard attached to the machine or via SMS message, a](https://community.broadcom.com/symantecenterprise/communities/community-home/librarydocuments/viewdocument?DocumentKey=990a8f20-043f-444c-b349-617f908899db&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments)\ntechnique that had never been seen before.\n\nFireEye Labs recently identified a previously unobserved version of Ploutus, dubbed PloutusD, that interacts with KAL’s Kalignite multivendor ATM platform. The samples we identified\ntarget the ATM vendor Diebold. However, minimal code change to Ploutus-D would greatly\nexpand its ATM vendor targets since Kalignite Platform runs on 40 different ATM vendors in\n80 countries.\n\nOnce deployed to an ATM, Ploutus-D makes it possible for a money mule to obtain\nthousands of dollars in minutes. A money mule must have a master key to open the top\nportion of the ATM (or be able to pick it), a physical keyboard to connect to the machine, and\nan activation code (provided by the boss in charge of the operation) in order to dispense\nmoney from the ATM. While there are some risks of the money mule being caught by\ncameras, the speed in which the operation is carried out minimizes the mule’s risk.\n\nThis blog covers the changes, improvements, and Indicators of Compromise (IOC) of\nPloutus-D in order to help financial organizations identify and defend against this threat.\n\n**Previously unobserved features of Ploutus-D**\n\nIt uses the Kalignite multivendor ATM Platform.\nIt could run on ATMs running the Windows 10, Windows 8, Windows 7 and XP\noperating systems.\nIt is configured to control Diebold ATMs.\nIt has a different GUI interface.\nIt comes with a Launcher that attempts to identify and kill security monitoring processes\nto avoid detection.\nIt uses a stronger .NET obfuscator called Reactor.\n\n**Commonality between Ploutus and Ploutus-D**\n\nThe main purpose is to empty the ATM without requiring an ATM card.\nThe attacker must interact with the malware using an external keyboard attached to the\nATM.\nAn activation code is generated by the attacker, which expires after 24 hours.\nBoth were created in .NET.\nCan run as Windows Service or standalone application.\n\n**Dissecting Ploutus-D**\n\n\n-----\n\nPloutus-D (observed in the wild with the filename of AgilisConfigurationUtility.exe ) can run\nas a standalone application or as a Windows service started by a Launcher (observed in the\nwild as “Diebold.exe”). Although multiple functionality is shared between the two\ncomponents, the main difference is that Ploutus-D is the component with the capability to\ndispense money.\n\nLauncher – Diebold.exe (.NET)\n\nMD5 C04A7CB926CCBF829D0A36A91EBF91BD\n\n.NET Obfuscator Reactor\n\nFile Size 198 kB\n\nFile Type Win32 EXE\n\nTime Stamp 2016:11:16 04:55:56-08:00\n\nCode Size 199168\n\nFile Version 0.0.0.1\n\nInternal Name Diebold.exe\n\nLegal Copyright Copyright © 2015\n\nOriginal Filename Diebold.exe\n\nProduct Name Diebold\n\nProduct Version 0.0.0.1\n\nTable 1: Launcher Properties\n\nThis time, the attackers put more effort into trying to obfuscate and protect their code from\nreverse engineering by switching from .NET Confuser to Reactor. A quick look at how the\nprotected code appears is shown in Figure 1.\n\n\n-----\n\nCode protected by Reactor\n\n\nFigure 1: Code protected by Reactor\n\nInspecting the Launcher\n\nOnce the code is deobfuscated, it is easy to understand the internal workings. Before the\nLauncher execution starts, it will perform an integrity check on itself to make sure it has not\nbeen altered.\n\nThe Launcher can receive different arguments in the command line to either install as a\nservice, run Ploutus-D, or uninstall from the machine. The service properties can be seen in\nFigure 2.\n\n\nService Description of the Launcher\n\n\nFigure 2: Service\n\n\nDescription of the Launcher\n\n\n-----\n\nPersistence\n\nUsing a very common persistence technique, the malware will add itself to the “Userinit”\nregistry key to allow execution after every reboot. The key is located at:\n\n\\HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit\n\nInteracting with the Launcher\n\nThe attacker must interact with the Launcher by attaching a keyboard to the ATM USB or\nPS/2 port. Figure 3 below shows an example of this setup.\n\n\nKeyboard attached to the ATM port\n\n\nFigure 3: Keyboard attached to the ATM port\nOnce the Launcher has been installed in the ATM, it will perform keyboard hooking in order\nto read the instructions from the attackers via the external keyboard. A combination of “F”\nkeys will be used to request the action to execute (see Figure 4).\n\n\n-----\n\nInteracting with the Launcher via\nkeyboard\n\n\nFigure 4: Interacting with the Launcher via\n\nkeyboard\nThe main tasks supported are:\n\nStart programs on demand, some of which are decrypted from the resource section of\nthe Launcher:\n\nC:\\Program Files\\Diebold\\Agilis Startup\\AgilisShellStart.exe\nMain.exe\nXFSConsole.exe\nKill Processes:\n\nNHOSTSVC.exe\nAgilisConfigurationUtility.exe\nXFSConsole.exe\nDelete Files:\n\nNetOp.LOG – Secure Remote Management solution\nReboot Machine:\n\n“wmic os where Primary='TRUE' reboot”\n\nAs seen in Figure 5, a request has been sent to run Ploutus-D (AgilisConfigurationUtility.exe)\nfrom command line.\n\n\n-----\n\nStarting Ploutus-D by the Launcher\n\n\nFigure 5: Starting\n\nPloutus-D by the Launcher\nLegitimate KAL ATM software is dropped into the system along with Ploutus-D, as shown in\nthe Figure 6. The reason for this is to make sure that all the software and versions needed to\nproperly run the malware are present in the same folder to avoid any dependency issues.\nThe same technique was also used by the first version of Ploutus.\n\n\n-----\n\nDropped files by the Launcher\n\n\nFigure 6: Dropped files by the Launcher\nThe K3A.Platform.dll DLL will load the Kalignite Platform to allow Ploutus-D to control the\nATM.\n\nThis shows that the attackers likely have access to the targeted ATM software. They can\neither buy physical ATMs from authorized resellers, which come preloaded with vendor\nsoftware, or they could just steal the ATMs directly from the bank’s facility. An example of a\nreal incident reported in Mexico is shown in Figure 7.\n\n\n-----\n\nAttackers physically stealing ATMs\n\n\nFigure 7: Attackers physically stealing ATMs\n\nPloutus-D – AgilisConfigurationUtility.exe (.NET)\n\nMD5 5AF1F92832378772A7E3B07A0CAD4FC5\n\n.NET Obfuscator Reactor\n\nFile Size 274 kB\n\nFile Type Win32 EXE\n\nTime Stamp 1992:06:19 15:22:17-07:00\n\nCode Size 29696\n\nOS Version 4.0\n\nImage Version 0.0\n\nSubsystem Version 4.0\n\nTable 2: Ploutus-D Properties\n\nSimilar to the Launcher, this binary also came protected with Reactor obfuscator (see Figure\n8).\n\n\n-----\n\nProtected with Reactor\n\n\nFigure 8: Protected with Reactor\n\nLooking at the unprotected code (see Figure 9), the connection with Ploutus became evident\nsince the names of most of the functions are the same as in the first version.\n\n\nUnprotected code\n\n\nFigure 9: Unprotected code\n\nPloutus-D will make sure a mutex with the name “KaligniteAPP” does not exist in the system\nin order to start running. Similar to the Launcher, Ploutus-D will hook the keyboard in order\nfor the attackers to interact with it; however, apart from receiving commands from “F” keys, it\nwill also read from the numeric pad (numbers).\n\nSimilar to the previous version, the GUI will be enabled by entering a combination of “F”\nkeys. Then, a valid 8-digit code must be entered in the GUI in order to be able to dispense\nmoney. Ploutus-D also allows the attackers to enter the amount to withdraw (billUnits – 4\ndigits) and the number of cycles (billCount – 2 digits) to repeat the dispensing operation (see\nFigure 10).\n\n\n-----\n\nParsing amount and cycles\n\n\nFigure 10: Parsing amount and cycles\nThe Ploutus-D GUI is displayed in Figure 11. It is configured to list properties of 18 cassettes\n(C1-C18). Letter “D” shows the status of the cassette and “CV” is a value taken from the\nregistry. The message “Estado:Activado”, which means “State: Activated”, is displayed if a\nvalid code has been entered. The ATM ID and HW_ID are unique to the ATM. The amount to\nbe retrieved is displayed as: “Cantidad: 500” (default value if no amount entered in the GUI).\nThe total amount depends on the currency, which is also calculated by the malware.\n\n\n-----\n\nPloutus-D GUI enabled\n\n\nFigure 11: Ploutus-D GUI enabled\nAll the actions are logged into a file with the name “Log.txt”. An extract can be seen in Figure\n12.\n\n\n-----\n\nLog File recording actions\n\n\nFigure 12: Log File recording\n\nactions\n\n**Dispensing the Money**\n\nIn order for the mule to be able to start dispensing money, a valid 8-digit code must be\nentered. This code is provided by the boss in charge of the operation and is calculated based\non a unique ID generated per ATM, and the current month and day of the attack.\n\nOnce a valid activation code has been entered (which expires in 24 hours), the dispensing\nprocess will start by pressing “F3” from the external keyboard.\n\nThe malware will first identify the cassette’s denomination by querying the registry\ndenomination table from Diebold Dispenser Logical Name “DBD_AdvFuncDisp” at:\n\n\\HKLM\\SOFTWARE\\XFS\\PHYSICAL_SERVICES\\DBD_AdvFuncDisp\\Denomination Table\n\nA similar strategy will be used to get the cassette’s status and type, to make sure they are\nworking properly, and, more important, to identify that it has at least one bill to withdraw.\n\nPloutus-D will load “KXCashDispenserLib” library implemented by Kalignite Platform\n(K3A.Platform.dll) to interact with the XFS Manager and control the Dispenser (see Figure\n13).\n\n\n-----\n\nLoading Dispenser Class\n\n\nFigure 13: Loading\n\nDispenser Class\nFigure 14 shows a graphical representation of the XFS Manager and its interaction with\nKalignite Platform via KXCashDispenserLib.\n\n\n-----\n\nXFS Manager\n\n\nFigure 14: XFS Manager\nThe knowledge shown in the code to properly implement all the different classes and\nmethods to control the Dispenser suggests that the developers of the malware have either\naccess to real ATMs during the development or they hired individuals with experience coding\non these machines.\n\n**Expanding Ploutus to other ATM vendors**\n\nKalignite Platform is said to support 40 ATM vendors. Looking at the code to dispense\nmoney, the only pieces adjusted to target Diebold are the different registry keys to read the\ncassette (DBD_AdvFuncDisp) parameters (see Figure 15).\n\n\n-----\n\nGetting Diebold Cassette parameters\n\n\nFigure 15: Getting Diebold Cassette parameters\nSince Ploutus-D interacts with the Kalignite Platform, only minor modifications to the PloutusD code may be required to target different ATM vendors worldwide.\n\n**Conclusion**\n\n[As anticipated in our 2017 predictions report, the use of ATM malware will continue to](https://www.fireeye.com/blog/executive-perspective/2016/11/questions_and_answer.html)\nincrease, especially in underdeveloped countries with weaker physical security controls. By\nleveraging the Kalignite Platform, Ploutus can be easily modified to attack various ATM\nvendors and operating systems.\n\n**Frequently Asked Questions**\n\n1. When was Ploutus-D first discovered?\n\nPloutus-D was uploaded to VirusTotal in November 2016.\n\n\n-----\n\n2. Does Ploutus-D target cardholder information?\n\nNo. It is designed to dispense cash from within the ATM.\n3. Is Ploutus-D already affecting ATMs in the wild?\n\nYes. It has been observed in Latin America.\n4. What type of ATMs are affected?\n\nPloutus-D affects Diebold ATMs.\nMinor modifications could be made to Ploutus-D to affect other vendors using the\nKalignite Platform.\n5. How is Ploutus-D installed on the ATM?\n\nThrough physical access to the ATM.\n6. How do attackers interact with Ploutus-D?\n\nVia an external keyboard that needs to be connected to the ATM.\n\n**IOCs**\n\nFileSystem:\n\n[D-Z]:\\Data\\P.bin\n\nC:\\Diebold\\EDC\\edclocal.dat\n\nThe following files should be found at the same place where the service Diebold.exe is\nlocated:\n\nLog.txt\n\nLog2.txt\n\nP.bin – Mac address of the system, plus string: “PLOUTUS-MADE-IN-LATIN-AMERICA-XD”\n\nPDLL.bin – Encoded version of P.bin\n\nMutex names:\n\nPloutos\n\nDIEBOLDPL\n\nKaligniteAPP\n\nServices:\n\nService Name: DIEBOLDP\n\nRegistry:\n\n\\\\HKLM\\Software\\Microsoft\\Windows\nNT\\CurrentVersion\\Winlogon\\Userinit=”Diebold.exe,%system32%/userinit.exe”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-12 - New Variant of Ploutus ATM Malware Observed in the Wild in Latin America.pdf"
    ],
    "report_names": [
        "2017-01-12 - New Variant of Ploutus ATM Malware Observed in the Wild in Latin America.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535572,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653760817,
    "ts_modification_date": 1653760817,
    "files": {
        "pdf": "https://archive.orkl.eu/6b7265155cc0ec22bd23e67e409d8d834aebad10.pdf",
        "text": "https://archive.orkl.eu/6b7265155cc0ec22bd23e67e409d8d834aebad10.txt",
        "img": "https://archive.orkl.eu/6b7265155cc0ec22bd23e67e409d8d834aebad10.jpg"
    }
}