{
    "id": "60bd95a6-07a4-4827-885a-46a4ad0ea523",
    "created_at": "2023-01-12T15:02:26.083489Z",
    "updated_at": "2025-03-27T02:05:36.23744Z",
    "deleted_at": null,
    "sha1_hash": "1951d4b8adbf420f6396d9f6354096638fe8cff7",
    "title": "2021-06-21 - Dissecting a RAT. Analysis of the Saefko RAT.",
    "authors": "",
    "file_creation_date": "2022-05-27T21:07:31Z",
    "file_modification_date": "2022-05-27T21:07:31Z",
    "file_size": 2985389,
    "plain_text": "# Dissecting a RAT. Analysis of the Saefko RAT.\n\n**[stratosphereips.org/blog/2021/6/2/dissecting-a-rat-analysis-of-the-saefko-rat](https://www.stratosphereips.org/blog/2021/6/2/dissecting-a-rat-analysis-of-the-saefko-rat)**\n\nKamila Babayeva June 21, 2021\n\n**_This blog post was authored by Kamila Babayeva (@_kamifai_) and Sebastian Garcia_**\n**_(@eldracote)._**\n\n_The RAT analysis research is part of the Civilsphere Project_\n_[(https://www.civilsphereproject.org/), which aims to protect the civil society at risk by](https://www.civilsphereproject.org/)_\n_understanding how the attacks work and how we can stop them. Check the webpage for_\n_more information._\n\nThis is the eighth blog of a series analyzing the network traffic of Android RATs from our\n[Android Mischief Dataset [more information here], a dataset of network traffic from Android](https://www.stratosphereips.org/android-mischief-dataset)\nphones infected with Remote Access Trojans (RAT). In this blog post we provide the\n[analysis of the network traffic of the RAT06-Saefko [download here]. The previous blogs](https://mcfp.felk.cvut.cz/publicDatasets/Android-Mischief-Dataset/AndroidMischiefDataset_v2/RAT06_Saefko/)\n[analyzed Android Tester RAT,](https://www.stratosphereips.org/blog/2020/12/14/ngwqj0h060yv40w1afp51fg7wo9ijy-pzlhk) [DroidJack RAT,](https://www.stratosphereips.org/blog/2021/1/22/analysis-of-droidjack-v44-rat-network-traffic) [SpyMax RAT,](https://www.stratosphereips.org/blog/2021/2/26/dissecting-a-rat-analysis-of-the-spymax) [AndroRAT,](https://www.stratosphereips.org/blog/2021/3/29/dissecting-a-rat-analysis-of-the-androrat) [HawkShaw,](https://www.stratosphereips.org/blog/2021/5/6/dissecting-a-rat-analysis-of-the-hawkshaw)\n[AhMyth and](https://www.stratosphereips.org/blog/2021/5/6/dissecting-a-rat-analysis-of-the-ahmyth) [Command-line AndroRAT.](https://www.stratosphereips.org/blog/2021/5/6/dissecting-a-rat-analysis-of-the-command-line-androrat)\n\n**RAT Details and Execution Setup**\n\nThe procedure followed for each of our RAT experiments is to configure and execute the\nRAT software and to do every possible action while capturing all traffic and storing all logs.\nThese RAT captures are functional and used as in real attacks.\n\nThe Saefko RAT is a software package that contains the controller software and builder\nsoftware to create an APK. We executed the builder on a Windows 7 Virtualbox virtual\nmachine with Ubuntu 20.04 as a host. The Android Application Package (APK) built by the\nRAT builder was then installed in an Android virtual emulator called Genymotion with\nAndroid version 8.\n\nWhile performing different actions on the RAT controller (e.g. upload a file, get GPS\nlocation, monitor files, etc.), we captured the network traffic on the machine running the\nAndroid virtual emulator. The network traffic was captured on the Android virtual emulator\nnetwork interface.\n\nConfiguration parameters of the C&C Controller and the phone victim:\n\n\n-----\n\nController:\n\nIPv4: 192.168.131.1\n\nIPv6: 2001:718:2:903:f410:3340:d02b:b918\n\nLink-Local IPv6: fe80::8052:f37c:25e9:69f0\n\nVictim:\n\nIPv4: 192.168.131.2\n\nIPv6: 2001:718:2:903:b877:48ae:9531:fbfc\n\nLink-local IPv6: fe80::2efc:36f:ce23:fac1\n\nDetails of the network capture pcap file:\n\nFirst Packet of the Infection: 36728\n\nUTC Time of the Infection: 2021-04-10 14:55:09\n\n## First connections from the infected phone\n\nCompared to other analyzed RATs in the [Android Mischief Dataset, where the first malicious](https://www.stratosphereips.org/android-mischief-dataset)\nconnection from the victim phone is direct to the C&C server, in the case of Saefko RAT, the\n[infected phone first connects to the webpage https://ipinfo.io/geo. The connection from the](https://ipinfo.io/geo)\nphone to the service ipinfo.io is displayed in Figure 1. The phone tries to retrieve the latitude\nand longitude of the victim’s device location according to its IP address. In the malicious\nAPK, there is a function for this automatic action of ‘getting the location’, called\nGetLocationInfo(), which is responsible for this action as shown in Figure 2.\n```\n1618066509.311319    C1hlpv4rTNvRlsA1k1   192.168.131.2  55536 \n216.239.36.21  443 ipinfo.io\n\n```\n**_Figure 1. Zeek flow from the ssl.log that shows the connection form the victim’s device_**\n192.168. to the ipinfo.io.\n\n\n-----\n\n**_Figure 2. The APK function GetLocationInfo() retrieves the longitude and latitude of the_**\nvictim’s device location based on the IP address by connecting to the site\nhttps://ipinfo.io/geo.\n\nAfter retrieving the location information from the ipinfo.io service, the second malicious\nconnection performed from the phone is the connection to the C&C online database (The\nZeek flow is shown in Figure 3). The C&C uses a web hosting service called\n000webhost.com to create an online database. Before starting our experiment, we have\ncreated a website on this hosting 000webhost.com with the name “experimentsas”. In our\nhosting website we installed the files “server.php” and “Saefko_db.db” provided by Saefko\nRAT software. This C&C database URL link “experminetsas.000webhost.com” was\nspecified in the APK (Figure 4), so the victim phone knows where to connect.\n\n_1618066509.738157    CM6DFg4vphEr3CEc6g   2001:718:2:903:b877:48ae:9531:fbfc_\n_39812  2a02:4780:dead:494b::1 443   TLSv12 experimentsas.000webhostapp.com_\n\n**_Figure 3. Zeek flow from the ssl.log file that summarizes the first connection from the_**\ninfected phone to the C&C online database created by us for this experiment\nexperimentsas.000webhostapp.com.\n\n**_Figure 4. APK code with specifications of the database URL_**\n[‘https://experimentsas.000webhostapp.com/server.php’ and other necessary parameters.](https://experimentsas.000webhostapp.com/)\n\nA few seconds later, after establishing the first connection to the database, the victim\nestablished a second connection to the same online database, so there are two\nsimultaneous connections established. Figure 5 shows the Zeek flow for the second\nconnection to the online DB.\n\n**_1618066510.358715    C82MTR16Hzvg4953R7_**\n**_2001:718:2:903:b877:48ae:9531:fbfc   39814  2a02:4780:dead:494b::1 443_**\n**_TLSv12 experimentsas.000webhostapp.com_**\n\n**_Figure 5. Zeek flow from ssl.log file that summarizes the second connection to the C&C_**\nonline database ‘experimentsas.000webhost.com’.\n\n\n-----\n\n## C&C methods to control the victim\n\nSaefko RAT is the first RAT in the Android Mischief dataset version 2 that uses 3 types of\nconnections to control the victim: (i) IRC channels, (ii) HTTP requests and (iii) a TCP\nconnection directly to the C&C server. We will discuss each connection in detail.\n\n## Connection to IRC servers\n\nOnce the APK is installed and the C&C enters the control panel on the interface (example is\nshown in Figure 6), the victim connects to 5 IRC servers according to the APK function\n**_StartIRCClient() in Figure 7. These connections have a refresh rate set to 99,000_**\nmilliseconds, which is approximately 28 minutes. It means that every 28 minutes, the victim\ncloses the connections with the current IRC servers and connects to 5 other IRC servers.\nWe know that there are always 5 IRC servers connected, because of the for-loop increasing\nfrom 0 to 4 inclusive. The IRC servers are chosen from the list of IRC servers set up in the\nAPK. Figure 8 shows several IRC servers presented in this list of total 99 IRC servers. For\neach of the chosen IRC server, the victim calls the function IRCInfo.GenerateIRCInfo() that\naims to connect to IRC server with specific parameters such as IRC_SERVER, IRC_PORT\nand IRC_NICKNAME. This function is shown in Figure 9. After the list of 5 IRC servers with\ntheir parameters has been created, it is sent to the C&C online database by using the\nfunction update_server_informations (shown in Figure 10). The update to the online\ndatabase is done so that the C&C controller will connect to the same IRC servers and will\ncontrol the victim by sending IRC private messages.\n\n\n-----\n\n**_Figure 6. The interface that the controller uses to execute C&C commands. The interface_**\ncontains 3 tabs to separate the commands sent over IRC, HTTP and TCP. The tab for the\nC&C commands over IRC is command-line alike. The phone connects to three IRC servers\nlisted in the beginning of Figure 6: irc.immortal-anime.net, irc.caelestia.net,\nirc.charrersweb.nl.\n\n**_Figure 7. APK code that aims to establish a connection with an IRC server with specific_**\nparameters. The function generates a list of 5 IRC servers and sends it to the C&C\ndatabase.\n\n\n-----\n\n**_Figure 8. IRC servers listed in the APK code. The infected device connects to IRC servers_**\nfrom this list of 99 servers.\n\n\n-----\n\n**_Figure 9. APK function GenerateIRCInfo() that aims to connect to an IRC server with_**\nspecified parameters IRC_SERVER, IRC_PORT and IRC_NICKNAME.\n\n**_Figure 10. APK function update_server_informations that sends the information about the_**\nvictim’s connected IRC servers to the C&C.\n\nAfter both the victim and the controller connect to the same IRC servers, the C&C is able to\nsend the commands to the victim. The list of commands the C&C can perform is shown in\nFigure 11.\n\n\n-----\n\n**_Figure 11. The list of C&C commands that can be executed over IRC channels._**\n\nAs an example of the communication between the C&C and the phone over IRC channels,\nwe show the communication in the IRC server chat.freenode.net. First, the phone\nperformed a DNS lookup of the domain chat.freenode.net. Second, the phone established a\nconnection with this IRC server after resolving its IP address. In Figure 12 it can be seen\nhow the phone established a connection with this IRC server and then immediately\nterminated it.\n\n**_Figure 12. Connection from the phone to the IRC server chat.freenode.net. The connection_**\nwas established and immediately terminated.\n\nThird, the phone reestablished the connection with IRC server chat.freenode.net (Figure 13)\nand sent a packet with the USER parameter to the IRC server. The victim connects to this\nIRC server with the randomly generated username fcsryk, asdisplayed in Figure 14. The\nuser string for the infected device is generated by the function GetNickname() shown in\nFigure 15. The username and nickname the phone uses inside an IRC server are the same.\n\n**Figure 13. Reestablished connection from the infected device to the IRC server**\nchat.freenode.net.\n\n**_Figure 14. The packet with the USER command sent from the phone to the IRC server. The_**\nphone’s username is 6 letters long randomly generated string.\n\n\n-----\n\n**_Figure 15. Function GetNickname() inside the APK code that randomly generates a 6_**\nletters long string to create the nick of the user in IRC.\n\nAfter the phone has successfully connected to the IRC server, there is a heartbeat between\nthis IRC server and the phone (shown in Figure 16), This heartbeat is a typical behaviour of\nan IRC server. The heartbeat stopped after the C&C sent a private message to the phone\nover the IRC server with the command ‘location’. The packet with this C&C command\n‘location’ is presented in Figure 17.\n\n**_Figure 16. Ping and pong between the IRC server and the victim’s phone. The heartbeat_**\ncontinues until the C&C command is received.\n\n**_Figure 17. The private message from the C&C with the command ‘location’. The top lines in_**\nthe figure are the headers of the packet, the lower lines are the content According to the\nInternet Relay Chat field, the controller’s nick is zelvmd, the IP is\n2001:718:2:903:f410:3340:d02b:b918 and it sends the data\n‘SASENCODEbG9jYXRpb25UX1QxNjE4MDY2OTgxNjMw’.\n\n\n-----\n\nFrom Figure 17, it can be seen that the controller s nick inside the IRC server was zelvmd\nand the IPv6 address was 2001:718:2:903:f410:3340:d02b:b918. The data sent by the C&C\nwas ‘SASENCODEbG9jYXRpb25UX1QxNjE4MDY2OTgxNjMw’. The data contains a string\nidentifying Saefko: ‘SASENCODE’. The data after this string is\nbG9jYXRpb25UX1QxNjE4MDY2OTgxNjMw and is Base64 encoded. Using the commandline command base64 to decode this string, we have got the following:\n```\n$ echo 'bG9jYXRpb25UX1QxNjE4MDY2OTgxNjMw' | base64 -d\n$ locationT_T1618066981630\n\n```\n**_Figure 18. Base64 decoded data sent by the controller to the phone in the IRC server using_**\na private message, as part of the C&C command ‘location’.\n\nThe decoded data from the Figure 18 can be organized in the following structure:\n\n### location C&C command\n\n T_T delimiter\n\n 1618066981630 timestamp\n\n**_Figure 19. Structure of the C&C command ‘location’ sent to the phone over IRC._**\n\nOverall, every C&C command sent by the controller over IRC server has the following\nstructure:\n\n### ‘SASENCODE’+base64_encode(C&C command + ‘T_T’ + timestamp)\n\n**_Figure 20. Structure of the C&C commands sent to the infected device over IRC._**\n\nAfter the phone received the C&C command ‘location’, it replied with 6 packets separated\nby a one second interval. The phone is connected to three IRC servers and it receives the\ncommand in all three of them (probably as redundancy backup), and then it answers with 6\npackets to all three of them too. Figure 21 shows the encoded and decoded data field of the\n6 packets sent as a reply to the C&C command ‘location’. The packets sent from the phone\nhave the same structure as the packets sent from the C&C.\n\n\n-----\n\n**_Figure 21. The phone’s 6 packets sent as a reply to the C&C command ‘location’. The_**\npackets from the phone follow the same structure as the C&C packets.\n\nIt is important to note that the phone is connected to several IRC servers simultaneously\n(Figure 22). The C&C commands to execute are sent to the phone through each connected\nIRC server as well as the replies from the phone are also sent to each of the connected\nservers:\n\n**_Figure 22. The C&C commands are sent to each connected IRC server and the infected_**\ndevice replies to the C&C command in each server.\n\n## HTTP requests from the C&C\n\nBesides IRC connections, the C&C controls the victim by sending HTTP requests to the\nphone with the commands. However, there are no HTTP requests seen in the traffic from\nthe controller or in the IRC chat, meaning that the commands are sent over the C&C online\ndatabase. The phone has an HTTP server implemented in the APK, which is unusual. The\ncontroller acts as a client that sends HTTP requests with C&C commands to execute, but\nthe HTTP response might be sent back over the online database as well. The C&C\ncommands possible to execute using HTTP requests are very limited, namely Message\nBox, Shell commands, Visit Webpage and Open TCP Connection. According to the\nconfiguration, these commands are queued and will be executed every 21 minutes, which is\nthe refresh rate parameter. An example of queued C&C commands over HTTP is shown in\nFigure 23.\n\n\n-----\n\n**_Figure 23. The queue of HTTP requests with C&C commands to be executed on the_**\nphone. These commands will be executed according to the refresh rate parameter set in the\nconfiguration folder.\n\nThese HTTP commands are also sent to the online database that was set up in this\nexperiment. The connections from the phone and the controller to this database are over\nHTTPs that provides encrypted communication. It means that HTTP requests with C&C\ncommands sent from the controller are encrypted and cannot be analyzed.\n\n## TCP connection to the C&C\n\nA direct TCP connection established from the phone to the C&C gives the attacker more\npower to control the victim’s device. It allows the controller to send and receive large data\nsuch as photos, videos, audios, calls, messages, files, etc. Figure 24 shows the C&C\ninterface with a list of the commands to perform over TCP.\n\n**_Figure 24. A list with C&C commands that are possible to perform over TCP connection_**\nbetween the controller and the phone.\n\nDue to the RAT code being of medium quality, several TCP connections with really little\ndata exchange were established between the C&C and the phone (Figure 25). However,\nthe C&C interface was not displaying these established TCP connections and did not allow\nthe attacker to perform any C&C command. It explains why only the first connection has\ndata exchange. Importantly, the amount of bytes sent from the infected device is much\nbigger than the response bytes. The other four connections have exactly the same amount\nof sent and received bytes. Moreover, the C&C was not able to close any of the connections\n\n\n-----\n\nwith a 4-way termination handshake. Connections from Zeek s conn.log in Figure 25 have\nflags RSTR and S1. RSTR means there was a rejection from the response IP address (in\nour case the C&C IP address) and S1 means the connection was opened and not closed.\n\nid.orig_h    id.orig_p    id.resp_h    id.resp_p    proto  conn_state   orig_bytes\nresp_bytes\n\n192.168.131.2  35690      192.168.131.1  8000      tcp   RSTR      343220\n1797\n\n192.168.131.2  35728      192.168.131.1  8000      tcp   RSTR      96\n56\n\n192.168.131.2  35730      192.168.131.1  8000      tcp   RSTR      96\n56\n\n192.168.131.2  35732      192.168.131.1  8000      tcp   S1       96       56\n\n192.168.131.2  35736      192.168.131.1  8000      tcp   S1       96       56\n\n**_Figure 25. All the connections from the phone established with the C&C over port_**\n8000/TCP. Due to poor code quality, some of the connections were established but without\na big exchange of data and a termination with the RSTR state.\n\nAs an example of the controller operating over TCP, we will look at the first TCP connection\nbetween the phone and the C&C. After a successful 3-way TCP handshake (Figure 26), the\nC&C sent the first packet with encoded data, as displayed in Figure 27:\n\n**_Figure 26. A 3-way TCP handshake to establish the connection over TCP/8000 between_**\nthe phone and the controller.\n```\neyJUeXBlIjoiSWRlbnRpZml5IiwiRGF0YSI6Im9xb2V6cWpyd2YifQ\n\n```\n**_Figure 27.The data field of the first packet sent from the C&C to the phone._**\n\nThe data in Figure 27 is base64 encoded, the decoded text is\n{\"Type\":\"Identifiy\",\"Data\":\"oqoezqjrwf\"}. The value of the ‘Type’ key is the command to be\nexecuted, in our case is ‘Identify’. \"Oqoezqjrwf” might be the identification ID that the\ncontroller uniquely generates for each connected infected device.\n\nThe phone answers the command ‘Identity’ with 2 packets, shown in Figure 28 and Figure\n29. The first packet defines the length of the data sent in the second packet. Byte 0x5C in\nhexadecimal format is 92 in decimal. The second packet is the actual base64 encoded\nresponse to the C&C command. The decoded data of this response will result into JSON\n\n\n-----\n\nformat { Data :{ ID : 6, RequestID : oqoezqjrwf }, Type : Identification }. ID defines an\nordinal number of the connected device and “RequestID” is the ID given by the C&C. The\ndata length of it being 92 bytes as it was defined in the first packet.\n```\n0000  00 00 00 5c                    ...\\\n\n```\n**_Figure 28. The first packet sent by the phone after receiving the C&C command. The data_**\ndefines the length of the data sent in the next packet.\n\n**_Figure 29. The data field of the second packet sent by the phone after receiving the C&C_**\ncommand. The data is base64 encoded.\n\nThe APK code with the function SendMessage that aims to send replies to the C&C\ncommands is shown in Figure 30. The function produces two packets: (i) a packet with the\nlength of the data and (ii) a packet with base64 encoded data.\n\n**_Figure 30. Function sendMessage() in the APK code that aims to send the information from_**\nthe phone to the C&C. The function sends two packets: (i) a packet with the data length of\nthe next packet and (ii) a packet with the actual data.\n\nThe complete communication between the phone and the controller goes the same way:\n\n1. The C&C sends the base64 encoded command.\n\n2. The phone answers with two packets: the first packet with the hexadecimal\n\nrepresentation of the data length in the next packet, the second packet with base64\nencoded reply to the C&C command.\n\n\n-----\n\nAs an example, we will analyze the C&C command read SentSMS that retrieves all SMS\nsent from the infected device. The data field of the packet with C&C command ‘read\nSentSMS’ is displayed in Figure 31.\n\n**_Figure 31. The data field of the packet with the C&C command ‘read SentSMS’ that aims to_**\nretrieve all SMS sent from the infected device. The data is base64 decoded.\n\nThe phone replies with two packets: the first packet in Figure 31 and the second packet in\nFigure 32. Bytes 0x01d8 from the first packet defines 472 bytes in decimal format as the\nlength of the data in the second packet.\n```\n0000  00 00 01 d8                    ....\n\n```\n**_Figure 31. The data field of the first packet sent from the phone as a reply to the C&C_**\ncommand ‘read SentSMS’. Bytes 0x01D8 in hexadecimal form presents 472 bytes in\ndecimal form.\n\n**_Figure 32. The data field of the second packet sent from the phone as a reply to the C&C_**\ncommand ‘read sentSMS’. The data has a length of 472 and is base64 encoded.\n\nDuring the complete communication between the phone and the controller, there was no\nheartbeat performed in the TCP connection.\n\n## PCAP Statistics\n\n\n-----\n\nIn order to create some statistics for this capture, we have been looking at all the malicious\nconnections: connection to the database, TCP connections directly with the C&C and\nconnections to the IRC server.\n\nIn total, there were 21 connections to the RAT’s 000webhost.com database (Figure 33).\nAccording to the APK code, a new connection to the database was established every time\nthe IRC servers were refreshed.\n\n**_Figure 33. All the connections performed to the 000webhost.com database from the phone._**\nIn total, there are 21 connections.\n\nFrom the APK list of IRC servers, it is clear that the phone connects over ports 6667/TCP,\n6668/TCP, 6669/TCP, 7000/TCP and 7020/TCP. After filtering the Zeek conn.log file with all\nthese ports, there were 34 connections to IRC servers in total:\n\n\n-----\n\n**_Figure 34. All connections from the phone to IRC servers over ports 6667/TCP, 6668/TCP,_**\n6669/TCP, 7000/TCP, and 7020/TCP.\n\nAs for the connection to the C&C over port 8000/TCP, there were in total 5 connections: 3\nconnections were closed with a RESET packet from the C&C, and 2 connections were not\nclosed.\n\n**_Figure 32. Five connections over TCP established with the C&C. The connections were_**\nended with the flags RSTR and S1.\n\nThrough all the malicious connections, the heartbeat was only performed with IRC servers,\nwhich is a normal behaviour of such type of protocol.\n\n## Conclusion\n\nIn this blog post we have analyzed the network traffic from a phone infected with the Saefko\nAttack Systems RAT that uses 3 different methods to operate and control devices. All the\nretrieved data from the devices was stored in a database stored in the 000webhost.com\nhosting provider. We were not able to decode the secure connection to the database, but\n\n\n-----\n\nwe have successfully decoded the connection to the IRC servers, HTTP and TCP\nconnections. The Saefko RAT seems to be complex in its communication protocol, but it is\nstill not sophisticated in its work.\n\nTo summarize, the details found in the network traffic of this RAT are:\n\nThe RAT is capable of controlling the targeted phone over IRC servers, HTTP request,\nand TCP connection.\n\nThe RAT’s database is hosted on the 000webhost.com web hosting service. And is up\nto the user to install it.\n\nThe connection from the infected device to the database in the 000webhost.com\nhosting is encrypted.\n\nThe packets sent from the controller and the phone over IRC servers follow the\nstructure: ‘SASENCODE’+base64_encode(data + ‘T_T’+timestamp)\n\nThe packets sent from the controller and the phone over TCP follow the structure:\nbase64_encode(data in JSON format)\n\nThe phone connects to the website ipinfo.io to retrieve and send its location to the\nC&C.\n\nThere is no heartbeat in the TCP communication between the C&C and the phone.\n\nThere is a heartbeat between the IRC server and the victim, but it is a normal\nbehaviour for this protocol.\n\nThe connections with the C&C over TCP were closed with RSTR and S1 states.\n\nThere are 34 connections established to different IRC servers.\n\nThere are 21 connections established to the database in the 000webhost.com hosting\nwith the server_name ‘experimentsas.000webhostapp.com’.\n\nThanks to Vitaly Kim (@mercury0169) for drawing the blog cover picture.\n\n## Biographies\n\n\n-----\n\nKAMILA BABAYEVA\n\nSebastian Garcia is a malware researcher and security teacher with experience in applied\nmachine learning on network traffic. He founded the Stratosphere Lab, aiming to do\nimpactful security research to help others using machine learning. He believes that free\nsoftware and machine learning tools can help better protect users from abuse of our digital\nrights. He researches on machine learning for security, honeypots, malware traffic\ndetection, social networks security detection, distributed scanning (dnmap), keystroke\ndynamics, fake news, Bluetooth analysis, privacy protection, intruder detection, and\nmicrophone detection with SDR (Salamandra). He co-founded the MatesLab hackspace in\nArgentina and co-founded the Independent Fund for Women in Tech. @eldracote.\nhttps://www.researchgate.net/profile/Sebastian_Garcia6\n\nKamila Babayeva is a 20 years old and third-year bachelor student in the Computer\nScience and Electrical Engineering program at the Czech Technical University in Prague.\nShe is a researcher in the Civilsphere project, a project dedicated to protecting civil\norganizations and individuals from targeted attacks. Her research focuses on helping\npeople and protecting their digital rights by developing free software based on machine\nlearning. Initially, she worked as a junior Malware Reverser. Currently, Kamila leads the\ndevelopment of the Stratosphere Linux Intrusion Prevent System (Slips), which is used to\nprotect the civil society in the Civilsphere lab.\n\n\n-----\n\nSEBASTIAN GARCIA\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-21 - Dissecting a RAT. Analysis of the Saefko RAT..pdf"
    ],
    "report_names": [
        "2021-06-21 - Dissecting a RAT. Analysis of the Saefko RAT..pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535746,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653685651,
    "ts_modification_date": 1653685651,
    "files": {
        "pdf": "https://archive.orkl.eu/1951d4b8adbf420f6396d9f6354096638fe8cff7.pdf",
        "text": "https://archive.orkl.eu/1951d4b8adbf420f6396d9f6354096638fe8cff7.txt",
        "img": "https://archive.orkl.eu/1951d4b8adbf420f6396d9f6354096638fe8cff7.jpg"
    }
}