{
    "id": "60c1be64-e1b1-436e-a725-6891ebc7089e",
    "created_at": "2023-01-12T15:02:41.350324Z",
    "updated_at": "2025-03-27T02:16:26.327383Z",
    "deleted_at": null,
    "sha1_hash": "8b9263685d00484ad6328b1850fc67808328a4f4",
    "title": "2021-08-20 - An Overview of FinTech Threat Landscape",
    "authors": "",
    "file_creation_date": "2022-05-27T23:05:32Z",
    "file_modification_date": "2022-05-27T23:05:32Z",
    "file_size": 731466,
    "plain_text": "# An Overview of FinTech Threat Landscape\n\n**[blog.cyble.com/2021/08/20/an-overview-of-fintech-threat-landscape/](https://blog.cyble.com/2021/08/20/an-overview-of-fintech-threat-landscape/)**\n\nAugust 20, 2021\n\nResearch shows that there has been a considerable increase in digital threats targeting\nfinancial firms since the onset of the pandemic. The statistical reports released between\n2020-2021 show that cyber-attacks on financial firms and services have increased by 238%.\nOut of these attacks, nearly 75% of the victims were banks and insurance companies.\n\nAttackers have been widely targeting financial institutions such as banks and insurance\ncompanies, which we observed more frequently since the onset of the pandemic. Attackers\nbenefit monetarily by misusing and selling sensitive Personally Identifiable Information (PII)\nsuch as customer details, Social Security Numbers (SSN), driver’s licenses, bank account\ndetails, and transactional records. Attackers gain access to the system by exploiting any\nsecurity vulnerabilities that they can identify.\n\nAttackers also leverage Advanced Persistent Threats (APT) campaigns towards financial\ninstitutions for sensitive data extortion. One such example, “APT34”, is a suspected Iranian\ngroup targeting financial institutions.\n\nA few banking botnets and spyware variants such as DanaBot and TrickBot, which initially\ntargeted specific areas, have expanded into other regions like Europe and Asia.\n\nOver 100 financial groups were targeted using Distributed Denial of Service (DDOS) attacks\nexecuted via their zombie networks. The US Department of Treasury’s Financial Crimes\nEnforcement Network published a report stating that approximately a billion dollars were\nstolen from financial institutions each month because of cybercrime activity.\n\nInterestingly, we observed a rise in attacks on mobile users using fake banking apps aimed\nat major financial institutions. Attacks on financial firms are often state-sponsored, aimed\nagainst a specific country’s economic situation.\n\nSome of the collective threats that target financial institutions are:\n\nPhishing\nBrute-Force\nRansomware\nStealer/Bot (Spyware)\nTrojan\n\n## Tactics:\n\n\n-----\n\nAfter compromising the financial institution s data, the attackers use the sensitive information\ngathered to launch a more sophisticated attack on their consumers.\n\nAnother method used by attackers is to target the financial firms by identifying the loopholes\nin the services provided by these institutions, such as e-commerce, net banking, payment\ntransactions online, and cryptocurrency services.\n\nAround 94% of attacks observed targeting financial firms are performed using common\ncybercrime tactics such as spear phishing, social engineering, watering hole, etc. Attackers\nalso combine and reuse old but effective malware variants such as the FakeSpy Android\nbanking trojan, which spreads via smishing messages and steals sensitive information from\nthe victim’s device.\n\nTelecommunication networks and companies also play a crucial role in financial transactions\nfor security and 2-factor authentication mechanisms such as One-Time-Password (OTP).\n\nBefore attacking the customers, attackers utilize malicious applications which have already\nbeen installed on the victim’s device to gain knowledge about the network service provider.\nThey then employ this information to compromise and disrupt the OTPs required for\nverification of transactions and hijacking and rerouting the text messages.\n\n## Threats:\n\nAttackers use open-source and social engineering tools to build customized malware for the\nspecific purpose of targeting financial sectors. The attackers constantly refine malware\nvariants by adding additional features to automate the exfiltration of stolen data and funds.\n\nBanking malware is one of the best examples of an Automation Transfer System (ATS)\nengine and a web injection script to automate the fund-initiated bypassing authentication\nmechanism.\n\nSome of the top cybersecurity threats that target financial services captured in our regular\nthreat intelligence were analyzed, and information regarding these threats is shared below.\n\n## Endpoint Threats:\n\nThe threat landscape is growing day by day with various methods and techniques, which\nexpands potential attack surfaces. Among many endpoints threats, the topmost persistent\nattacks that target financial sectors are phishing and ransomware attacks.\n\nBased on our research, we’ve listed detailed information on endpoint threats below:\n\n### Phishing Attacks:\n\n\n-----\n\nAttackers use phishing as the most common tool to targeting financial sectors. The ease of\naccess and minimum technical knowledge required in building phishing campaigns to launch\nmalware attacks make it the preferred method of attacking financial firms for several\nattackers.\n\nStatistical reports published by the FBI and Statista reveal that about 40% of attacks that\ntarget financial firms use various phishing emails and URLs. The most impersonated cloud\nbrand and social media brands are Microsoft and Google, respectively. Attackers routinely\ncreate fake Microsoft login pages to steal PII data.\n\nFigure 1 depicts phishing attempts aimed at financial industries based on the services they\nprovide. Financial and payment platforms are the most targeted services, accounting for 25%\nand 9% of the total.\n\nFigure 1 Phishing Attacks targeting Financial Sectors\n\nThe phishing webpage can be seen in comparison to a major financial portal in Figure 2.\n\n\n-----\n\nFigure 2 Comparison of a legitimate and a phishing page for a well-known bank\n**Note: To know more about our research on phishing and its types that are targeting various**\nindustries, please refer to our previous blogs:\n\n[Trends In Phishing Attacks and The Industries Commonly Targeted](https://blog.cyble.com/2021/06/13/trends-in-phishing-attacks-and-the-industries-commonly-targeted/)\n[Phishing Attack Trends Captured by Cyble Honeypots](https://blog.cyble.com/2021/04/28/phishing-attack-trends-captured-by-cyble-honeypots/)\n\n### Banking Malware:\n\nSpyware is another commonly used tool to target financial sectors and steal credentials,\nidentity, and sensitive data. Stealer and Bots are spyware variants that the attackers\ncommonly use to target financial firms, and they are generically called Banking Malware.\nBanking malware targets personal computers (PCs) and mobile devices, which steals the\ncredentials used to conduct online payments and transactions.\n\nSome of the functionalities that banking malware can perform upon successful installation on\nthe device are:\n\nStealing usernames and passwords from online banking services\nCollecting data such as the user’s banking information (cardholder name, card number,\nCVV, and expiration date)\nGathering call logs and contacts\nReading SMS content from the device and storing the data within the device\nReading SMS notifications, such as financial transactions, received from the user’s\ndevice.\nCollecting the machine’s information\nHaving a keylogger functionality\n\nThese variants of banking malware, which are also known as Banking Trojan or BankBot,\nfrequently targeting financial firms are listed below:\n\nCerberus\nAberebot\nSpyEye\nTrickBot\nDanaBot\n\n\n-----\n\nAnubis\n\nAccording to a recent report by Heimdal and Securelist – Zbot malware, commonly known\nas Zeus, is the most notorious trojan among the banking malware families, accounting for\n25% of all attacks. SpyEye accounts for a further 15%, with TrickBot & DanaBot each\naccounting for 5% of all infections.\n\nFigure 3 Banking Malware Families Targeting Financial Firms\nSeveral cybercrime forums provide various services to cybercriminals that allow them to\npurchase the malware. Additionally, forum users also offer services to make the malware\nFully Undetectable (FUD). Upon using the services from these cybercrime forums, the\nmalware becomes undetectable by common scanning mechanisms such as antivirus\nprograms. The figure below showcases one of the cybercrime forum posts about APK\ncrypt/FUD service.\n\n\n-----\n\nFigure 4 Crypt/FUD Sold through Cybercrime Forum to avoid BOTNET detection\nCybercriminals also sell the sensitive details they have extracted from various institutions\nand third-party services. These details include sensitive PII data and credit card numbers. In\nthe below figure, a user is selling active credit card numbers on a cybercrime forum.\n\nFigure 5 Collected Sensitive Information Sold through Cybercrime Forum\n**Note: Below, we have listed blogs covered by Cyble Research Labs related to banking**\nmalware that use Stealer/Bot to target financial firms.\n\n[ZLoader Returns Through Spelevo Exploit Kit & Phishing Campaign](https://blog.cyble.com/2021/04/19/zloader-returns-through-spelevo-exploit-kit-phishing-campaign/)\n\n[Aberebot On the Rise: New Banking Trojan Targeting Users Through Phishing](https://blog.cyble.com/2021/07/30/aberebot-on-the-rise-new-banking-trojan-targeting-users-through-phishing/)\n\n[DanaBot Banking Trojan Regains Its Foothold In The Threat Landscape](https://blog.cyble.com/2021/02/02/danabot-banking-trojan-regains-its-foothold-in-the-threat-landscape/)\n\n\n-----\n\nMobile Malware App Anubis Strikes Again, Continues To Lure Users Disguised As A Fake\nAntivirus\n\n[Banking Trojan Variant Spreading Through Android App](https://blog.cyble.com/2021/06/17/banking-trojan-variant-spreading-through-android-app/)\n\n### Third-Party attacks:\n\nMost financial institutions depend on third parties, vendors, or partners services like software\nservices, analytics, web hosting, etc. Leveraging third parties for non-critical tasks allows\nfinancial firms to prioritize their primary business objectives.\n\nThe use of third-party services carries many perks; however, there are also some security\nrisks associated with them. This quarter, we have seen how ransomware attacks on Kaseya\nimpacted several businesses, and similar attacks can lead to attacks increasing the\nMaximum Tolerable Downtime (MTD).\n\nData breaches on service providers can impact their clients, as we recently observed in one\nof the Blackmatter ransomware attacks. This attack disrupted the victim’s services and\nrevealed sensitive information belonging to their clients.\n\nFigure 6 BlackMatter Ransomware Targeting Financial Service Provider\n**Note: A threat report covered by Cyble Research Labs related to third-party attacks that use**\nransomware to target various sectors is linked here:\n\n[Ransomware Threat Report Q2-2021](https://blog.cyble.com/2021/07/14/ransomware-threat-report-quarter-two-2021/)\n\n## Trends:\n\nA surge in ransomware attacks was observed in the year 2021 as a part of our research.\nRansomware attacks typically encrypt the data on the targeted device. Before the encryption\nstage, however, these groups extract the sensitive data. The attacker then demands a\nransom based on this sensitive data. If the victim is unable to pay the ransom, they extort the\nvictim by leaking the collected sensitive data on public forums.\n\n\n-----\n\nAs a part of our research, the trend of the ransomware attacks and data leaks that affect\nfinancial sectors indicates that the LockBit ransomware group is the most active. LockBit has\nthe most significant number of victims compared to other ransomware groups.\n\nFigure 7 depicts the industries targeted by the LockBit ransomware group, with\nmanufacturing accounting for 27.2% and financial services accounting for about 13.6%.\n\nFigure 7 LockBit attacks by industry\nFigure 8 depicts a statistical trend of ransomware organizations that target financial firms.\nLockBit tops the list based on the number of victims and recent attacks.\n\nThe trend also indicates that the second most active ransomware gang targeting financial\nfirms is Sodinokibi (REvil), with eight victims. The third most active group is Avaddon, which\nhas six victims.\n\n\n-----\n\nFigure 8 Number of Victims from the Financial Firms Targeted by Ransomware Groups\nFigure 9 presents a heat map based on ransomware attacks targeting financial services\naround the world. The cumulative number of assaults targeting financial institutions is 59,\nwith 20 ransomware groups involved.\n\nThe United States is the most frequently attacked country, followed by the United Kingdom,\nCanada, Australia, and France.\n\nFigure 9 Heat Map on Ransomware Attacks\n\n## Conclusion:\n\n\n-----\n\nBased on these findings, cybercrime, in general, has seen an increase with a focus on\nattacks targeting financial firms. Attackers use various social engineering tools to spread\nmalware and use multiple techniques to evade detection mechanisms.\n\nAlong with enhancing the security methods used by financial organizations, the attackers\nsimultaneously develop malware with customized techniques, such as automatically\nperforming the malicious activity instead of relying on the manual commands pushed from\nthe attacker’s Command-and-Control Server.\n\nImplementing a better endpoint security and threat intelligence platform by the organization\ncould prevent them from becoming victims of malware targeting the financial sector.\n\n## Recommendations:\n\n1. Impose strict identity and access management policies.\n2. Keep track of vulnerabilities being targeted by attackers.\n3. Identify the Tactics, Techniques, and Procedures (TTP) of the TAs.\n4. Monitor TA activities on the web.\n5. Use a reputed antivirus and Internet security software package on your connected\n\ndevices, including PC, laptop, and mobile.\n6. Refrain from opening untrusted links and email attachments without verifying their\n\nauthenticity\n7. Conduct regular backup practices and keep those backups offline or in a separate\n\nnetwork.\n\n## About Us\n\nCyble is a global threat intelligence SaaS provider that helps enterprises protect themselves\nfrom cybercrimes and exposure in the Darkweb. Its prime focus is to provide organizations\nwith real-time visibility to their digital risk footprint. Backed by Y Combinator as part of the\n2021 winter cohort, Cyble has also been recognized by Forbes as one of the top 20 Best\nCybersecurity Start-ups To Watch In 2020. Headquartered in Alpharetta, Georgia, and with\noffices in Australia, Singapore, and India, Cyble has a global presence. To learn more\nabout Cyble, visit www.cyble.com.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-20 - An Overview of FinTech Threat Landscape.pdf"
    ],
    "report_names": [
        "2021-08-20 - An Overview of FinTech Threat Landscape.pdf"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535761,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653692732,
    "ts_modification_date": 1653692732,
    "files": {
        "pdf": "https://archive.orkl.eu/8b9263685d00484ad6328b1850fc67808328a4f4.pdf",
        "text": "https://archive.orkl.eu/8b9263685d00484ad6328b1850fc67808328a4f4.txt",
        "img": "https://archive.orkl.eu/8b9263685d00484ad6328b1850fc67808328a4f4.jpg"
    }
}