{
    "id": "60cca387-4b37-4ccb-9c7e-46e8107976f5",
    "created_at": "2023-01-12T15:03:03.801695Z",
    "updated_at": "2025-03-27T02:16:14.095392Z",
    "deleted_at": null,
    "sha1_hash": "5f0d64b8db62155ca155d59702fc7185f4f7bff6",
    "title": "2021-06-10 - REvil- the usage of legitimate remote admin tooling",
    "authors": "",
    "file_creation_date": "2022-05-28T16:04:49Z",
    "file_modification_date": "2022-05-28T16:04:49Z",
    "file_size": 1474420,
    "plain_text": "# REvil: the usage of legitimate remote admin tooling\n\n**[huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling](https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling)**\n\n[Krijn de Mik @](https://www.huntandhackett.com/blog/author/krijn-de-mik)\nJun 10, 2021 12:42:03 PM\n\n## 1. Introduction\n\nRecently, Hunt & Hackett did an incident response engagement involving Sodinokibi (also known as REvil)\nransomware. During the incident, the adversary installed a ScreenConnect service on several systems, functioning\nas a backdoor. This gave the adversary the possibility to connect directly to those systems, without the need of\nusing the Remote Desktop Protocol (RDP), or the need to authenticate (this is required of course for installation of\nScreenConnect). This is a rather efficient and effective technique used by more threat actors, next to other types of\nlegitimate Remote Administration Tools like TeamViewer and AnyDesk. Other examples of threat actors that have\nbeen using ScreenConnect in the past are the Iranian actor named Static Kitten [1] and another targeted\nransomware group called Zeppelin [2].\n\nIn this blog post, we will look into the traces left behind by the usage of ScreenConnect remote administration\nsoftware and how these traces can help defenders with building custom detection.\n\n## 2. ScreenConnect traces and detection\n\nThis chapter describes the different traces left by ScreenConnect when it is actively used. Furthermore, some rules\nare provided in order to detect the usage of ScreenConnect on a system, or in an infrastructure.\n\n\n-----\n\n### 2.1 ScreenConnect funtionality\n\nConnectWise Control [3] (formerly known as ScreenConnect) is advertised as a solution that \"gives your techs full\nremote access to remotely control, troubleshoot, and update client devices\". It should not come as a surprise that\nScreenConnect can thus also be used for malicious purposes.\n\nVia the web interface, ConnectWise Control (among others) offers functionality to remotely:\n\nExecute arbitrary commands;\nTerminate processes;\nUninstall software;\nView event logs;\nStart / Stop services;\nInstall Windows updates.\n\nAdditionally, ConnectWise Control allows an operator to take control of a machine's desktop session. During a\nrecent incident response case, the File Transfer functionality was among others used to upload MimiKatz [4] to a\ncompromised system, as well as to upload other tools like Advanced IP Scanner and the actual ransomware.\n\nFigure 1- Machine with status connected in ConnectWise Control.\n\nAll events related to ScreenConnect can be found in the Windows event logs and are logged with the provider\nname 'ScreenConnect Client (<hex string>)'. More specifically in the Application.evtx and System.evtx log files,\nwhich can generally be found at the following location:\n\nC:\\Windows\\System32\\winevt\\logs\\<event log file>.evtx\n\nIn Table 2 an overview is given of the different events that are being logged in the Windows event logs, what is\nbeing logged, in which log file the event can be found and what the corresponding EventID Is.\n\n**Event** **Value** **Log** **EventID**\n\n**Service being installed** A service was installed in the system System 7045\n\n**Start of remote session** Cloud Account Administrator Connected Application 0\n\n**Closing of remote session** Cloud Account Administrator Disconnected Application 0\n\n\n-----\n\n**File upload/ transfer** Transferred files with action 'Transfer': <list of file names> Application 0\n\n**Command execution** Executed command of length: <size> Application 0\n\nTable 2- Windows Event log event information and variables.\n\n## 2.2 ScreenConnect installation of service\n\nWhen ScreenConnect is being installed, it installs itself as a service. Services that are being installed show up in\nthe Windows event logs and can therefore be detected. More specifically, these events can be found in the\n'System' event log and get the Event ID 7045. An example of such an event is shown in Figure 2.\n\nFigure 2 - ScreenConnect being installed as a service Windows event.\n\n### 2.3 ScreenConnect start and ending of a session\n\nOnce a user decides to 'Join' an endpoint (as shown in Figure 1) and to interact with it, a new event is being logged\nin the Windows Application event log. An example of such a recorded event is shown in Figure 3. A session\ndisconnect is recorded as well and an example is shown in Figure 4.\n\nFigure 3 - Cloud Account Administrator Connected event.\n\n\n-----\n\nFigure 4 - Cloud Account Administrator Disconnected event.\n\n### 2.4 ScreenConnect file transfers\n\nScreenConnect offers different ways of interacting with the endpoint on which the ScreenConnect agent is\ninstalled. File Transferring is one of them. Files can be both send as well as being retrieved from an endpoint as\nshown in Figure 5.\n\nFigure 5 - ConnectWise Control file transfer functionality.\n\nWhen files are transferred, the Windows Application event log not only records this as an event, but also registers\nthe file that is being exchanged. In Figure 6 the file payload.exe is transferred to the endpoint. Do note that the\nretrieval of files is not logged in the Windows Application event log.\n\nFigure 6 - Windows event log event indicating a file has been transferred.\n\n### 2.5 ScreenConnect command execution\n\nAnother form of interaction with an endpoint is command execution. Via the ConnectWise Control center it's\npossible to type a command, hit the 'Run Command' button, after which the command Is executed. The commands\nthat are allowed to be used are the commands that are generally supported by the Windows Command Prompt. An\nexample of the interface in ConnectWise Control is shown in Figure 7.\n\n\n-----\n\nFigure 7 - ConnectWise Control command execution functionality.\n\nUpon execution of an operator invoked task, a Windows Event is generated that indicates a command of a certain\nlength has been executed, as shown in Figure 8. The type of executed task cannot be derived from the Windows\nEvent Logs. However, manually-executed shell commands are launched from ScreenConnect.ClientService.exe as\ncommand (.cmd) scripts, whereas tasks like process listing and termination are executed via Powershell (.ps1)\nscripts.\n\nFigure 8 - Windows Eventlog event indicating an executed command.\n\nThe process of a command task being launched by ScreenConnect.ClientService.exe, the actual execution of the\ncommand and the result are outlined in a bit more detail as shown in Table 3.\n\nC:\\Program Files (x86)\\ScreenConnect Client (<hex string>)\\ScreenConnect.ClientService.exe\n\n--> \"cmd.exe\" /c \"C:\\Windows\\TEMP\\ScreenConnect\\<version>\\<uuid>run.cmd\"\n\n--> <executed shell command>\n\n**Table 3 - Execution chain of command via the ConnectWise Control interface.**\n\n### 2.6 ScreenConnect detection and response\n\nInstallation of and interaction with ScreenConnect can be detected. We have developed Carbon Black and YARA-L\nrules to support detection efforts. These rules can be found in appendix 1, at the bottom of this page. Furthermore,\nfrom a forensics perspective, the fact that ScreenConnect.ClientService.exe writes either the command(s) to a\n.cmd, or a .ps1 file before executing the command, might make it possible (hasn't been tested yet by Hunt &\nHackett) to carve for these files. This potentially shines a bit more light on the actual commands that have been\nexecuted by the adversary.\n\n## 3. Anti-forensics and robust detection\n\n\n-----\n\nScreenConnect event logs can indicate that an operator has connected to a machine or performed certain actions\nlike executing commands or transferring files.\n\nAt first glance, it might appear that monitoring for ScreenConnect events might be enough to detect malicious\nusage of ScreenConnect. This is however not something we can always assume. For robust detection we cannot\ntake for granted that all information is always available.\n\nFor example, we cannot just rely on the Windows event logs. ScreenConnect events are generated by the\napplication itself, meaning that a determined attacker can prevent any logs from being created. The ScreenConnect\nclient uses the TryWriteInformationToEventLog() function to log certain events.\n\nFigure 9 - ScreenConnect event log operation.\n\nTryWriteInformationToEventLog() is implemented in the unsigned ScreenConnect.Core.dll module and, below the\nsurface, is merely a wrapper around EventLog.WriteEntry(). If we can modify the application in such a way that\nEventLog.WriteEntry() is no longer ever executed, we can prevent the generation of event logs.\n\nFigure 10 - ScreenConnect write to EventLog.WriteEntry.\n\nTo demonstrate that we can prevent ScreenConnect from logging events, we can patch the bytecode of\nScreenConnect.Core.dll, using a tool like dnSpy [5], and overwrite the call to EventLog.WriteEntry() in\nTryWriteInformationToEventLog(), as shown in Figure 11. This ensures that ScreenConnect can no longer generate\nany events and will create less evidence.\n\nFor this proof-of-concept, we manually patched out the call to EventLog.WriteEntry(). A determined attacker could\nof course implement this anti-forensics technique in a different way.\n\n\n-----\n\nFigure 11 Patching the write to event log functionality of ScreenConnect.\n\nIn case an attacker would use such a modified version of ScreenConnect, we cannot just rely on the Windows\nevent logs. Instead, detection should also focus on the execution of suspicious executables, whether it being\nScreenConnect being launched / installed by the attacker or executable files being started via the build-in Run\nCommand functionality.\n\nIn Appendix 1, we have included detection rules for Chronicle and Carbon Black that can detect the initialization of\n[ScreenConnect and the execution of tasks via the control panel, so that you can use these in your SOC or MDR](https://www.huntandhackett.com/mdr)\nsetup. Additionally, a Sigma rule is publicly available that can detect the initialization of ScreenConnect [6].\n\nPost Incident, carving of .ps1, or .cmd files might the way to go, in case you would like to have an understanding of\nthe command that might have been executed by the adversary.\n\n## 4. Sources\n\n[1] https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaigntargeting-uae-and-kuwait-government-agencies\n\n[2] https://blog.morphisec.com/connectwise-control-abused-again-to-deliver-zeppelin-ransomware\n\n[3] https://www.connectwise.com/platform/unified-management/control\n\n[4] https://github.com/gentilkiwi/mimikatz\n\n[5] https://github.com/dnSpy/dnSpy\n\n[6]\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/win_susp_screenconnect_access.yml\n\n## Appendix 1 - Detection rules\n\nThis appendix contains an overview of different rules in both Carbon Black as well as Yara-L format. Additionally,\nyou can find an already existing Sigma rule in the Sigma rule repository\n'SigmaHQ/sigma/rules/windows/process_creation/win_susp_screenconnect_access.yml', For completeness the\nSigma rules is listed in this appendix as well.\n\n### Sigma\n\n**Action** **Sigma rule**\n\n\n-----\n\n**ScreenConnect**\n**Remote Access**\n**detection**\n\n### Carbon Black\n\n\ntitle: ScreenConnect Remote Access\n\nid: 75bfe6e6-cd8e-429e-91d3-03921e1d7962\n\nstatus: experimental\n\ndescription: Detects ScreenConnect program starts that establish a remote access to\nthat system (not meeting, not remote support)\n\nreferences:\n\n- https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kittenconducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies\n\nauthor: Florian Roth\n\ndate: 2021/02/11\n\nlogsource:\n\ncategory: process_creation\n\nproduct: windows\n\ndetection:\n\nselection:\n\nCommandLine|contains|all:\n\n- 'e=Access&'\n\n- 'y=Guest&'\n\n- '&p='\n\n- '&c='\n\n- '&k='\n\ncondition: selection\n\nfalsepositives:\n\n- Legitimate use by administrative staff\n\nlevel: high\n\n\n**Action** **Carbon** **Black** **query**\n\n\n**ScreenConnect**\n**initialisation**\n\n**Task execution**\n**through**\n**ScreenConnect**\n\n\n(process_cmdline:\"y=\" OR process_cmdline:\"?y=\") AND (process_cmdline:\"h=\" OR\nprocess_cmdline:\"?h=\") AND (process_cmdline:\"p=\" OR process_cmdline:\"?p=\") AND\n(process_cmdline:\"s=\" OR process_cmdline:\"?s=\") AND (process_cmdline:\"k=\" OR\nprocess_cmdline:\"?k=\")\n\n(process_name:*screenconnect* OR process_publisher:*ConnectWise*) AND\nchildproc_cmdline:*run.ps1\n\n\n-----\n\n**Cmd command**\n**execution**\n**through**\n**ScreenConnect**\n\n### Yara-L\n\n\n(process_name:*screenconnect* OR process_publisher:*ConnectWise*) AND\nchildproc_cmdline:*run.cmd\n\n\n**Action** **Rule**\n\n**ScreenConnect initialisation**\n\nrule screenconnect_initialisation {\n\nmeta:\n\nauthor = \"Hunt & Hackett\"\n\ndescription = \"Detects ScreenConnect initialisation\"\n\nevents:\n\n$e.metadata.event_type = \"PROCESS_LAUNCH\"\n\n$e.principal.process.command_line = /(\\?|\\&|\\;)y=/ nocase\n\n$e.principal.process.command_line = /(\\?|\\&|\\;)h=/ nocase\n\n$e.principal.process.command_line = /(\\?|\\&|\\;)p=/ nocase\n\n$e.principal.process.command_line = /(\\?|\\&|\\;)s=/ nocase\n\n$e.principal.process.command_line = /(\\?|\\&|\\;)k=/ nocase\n\ncondition:\n\n$e\n\n}\n\n\n-----\n\n**ScreenConnect task**\n**execution**\n\n\nrule screenconnect_task_execution {\n\nmeta:\n\nauthor = \"Hunt & Hackett\"\n\ndescription = \"Detects task execution through ScreenConnect\"\n\nevents:\n\n$e.metadata.event_type = \"PROCESS_LAUNCH\"\n\n(\n\n$e.principal.process.file.full_path = /ScreenConnect/ nocase and\n\n$e.target.process.file.full_path = /powershell.exe/ nocase\n\n)\n\nor\n\n(\n\n$e.principal.process.command_line = /(powershell\\.exe)(.*)([a-f0-9-]\n{36}run\\.ps1)/ nocase\n\n)\n\ncondition:\n\n$e\n\n}\n\n\n-----\n\n**ScreenConnect command**\n**execution**\n\n\nrule screenconnect_cmd_command_execution {\n\nmeta:\n\nauthor = \"Hunt & Hackett\"\n\ndescription = \"Detects cmd command execution through ScreenConnect\"\n\nevents:\n\n$e.metadata.event_type = \"PROCESS_LAUNCH\"\n\n(\n\n$e.principal.process.file.full_path = /ScreenConnect/ nocase and\n\n$e.target.process.file.full_path = /cmd.exe/ nocase\n\n)\n\nor\n\n(\n\n$e.principal.process.command_line = /(cmd\\.exe)(.*)(\\/c)(.*)([a-f0-9-]\n{36}run\\.cmd)/ nocase\n\n)\n\ncondition:\n\n$e\n\n}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-10 - REvil- the usage of legitimate remote admin tooling.pdf"
    ],
    "report_names": [
        "2021-06-10 - REvil- the usage of legitimate remote admin tooling.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535783,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1653753889,
    "ts_modification_date": 1653753889,
    "files": {
        "pdf": "https://archive.orkl.eu/5f0d64b8db62155ca155d59702fc7185f4f7bff6.pdf",
        "text": "https://archive.orkl.eu/5f0d64b8db62155ca155d59702fc7185f4f7bff6.txt",
        "img": "https://archive.orkl.eu/5f0d64b8db62155ca155d59702fc7185f4f7bff6.jpg"
    }
}