{
    "id": "61048f63-373e-4aeb-b09a-04a5fe7bf396",
    "created_at": "2022-10-25T16:48:15.355356Z",
    "updated_at": "2025-03-27T02:06:15.855803Z",
    "deleted_at": null,
    "sha1_hash": "a4e09ba8eb513e516d27547d21e22a25dc59b765",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-03-10T13:52:12Z",
    "file_modification_date": "2022-03-10T13:52:12Z",
    "file_size": 1255871,
    "plain_text": "## 7 MARCH 2022 The following information is being provided by the FBI, with no guarantees or warranties, for potential\n\n_use at the sole discretion of recipients to protect against cyber threats. This data is provided in order_\n_to help cyber security professionals and system administrators to guard against the persistent malicious_\n\nFLASH Number\n\n_actions of cyber actors. This FLASH was coordinated with DHS/CISA._\n\n#### CU-000163-MW This FLASH has been released TLP:WHITE\n\n\n**WE NEED YOUR HELP!** If you identify any suspicious activity within your enterprise or have related information,\n\nplease contact your local FBI Cyber Squad immediately with respect to the procedures outlined in the\n\nReporting Notice section of this message.\n\n*Note: By reporting any related information to FBI Cyber Squads, you are assisting in sharing information that allows the FBI to track\n\n_malicious actors and coordinate with private industry and the United States Government to prevent future intrusions and attacks._\n\n# RagnarLocker Ransomware Indicators of Compromise \n\n## Summary\n\nThe FBI first became aware of RagnarLocker in April 2020 and subsequently produced a FLASH\nto disseminate known indicators of compromise (IOCs) at that time. This FLASH provides\nupdated and additional IOCs to supplement that report. As of January 2022, the FBI has\nidentified at least 52 entities across 10 critical infrastructure sectors affected by RagnarLocker\nransomware, including entities in the critical manufacturing, energy, financial services,\ngovernment, and information technology sectors. RagnarLocker ransomware actors work as\npart of a ransomware family[1], frequently changing obfuscation techniques to avoid detection\nand prevention.\n\n1\nRansomware family is a group of binaries associated to several ransomware variants or actor groups.\n\n\n-----\n\n## Technical Details\n\nRagnarLocker is identified by the extension “.RGNR_<ID>,” where <ID> is a hash of the\ncomputer’s NETBIOS name. The actors, identifying themselves as “RAGNAR_LOCKER,” leave a\n.txt ransom note, with instructions on how to pay the ransom and decrypt the data.\nRagnarLocker uses VMProtect, UPX, and custom packing algorithms and deploys within an\nattacker’s custom Windows XP virtual machine on a target’s site.\n\nRagnar Locker uses Windows API GetLocaleInfoW to identify the location of the infected\nmachine. If the victim location is identified as \"Azerbaijani,\" \"Armenian,\" \"Belorussian,\"\n\"Kazakh,\" \"Kyrgyz,\" \"Moldavian,\" \"Tajik,\" \"Russian,\" \"Turkmen,\" \"Uzbek,\" \"Ukrainian,\" or\n\"Georgian,\" the process terminates.\n\nRagnarLocker checks for current infections to prevent multiple transform encryption of the\ndata, potentially corrupting it. The binary gathers the unique machine GUID, operating system\nproduct name, and user name currently running the process. This data is sent through a\ncustom hashing algorithm to generate a unique identifier: <HashedMachineGuid><HashedWindowsProductName>-<HashedUser>-<HashedComputerName><HashedAllDataTogether>.\n\nRagnarLocker identifies all attached hard drives using Windows APIs: CreateFileW,\nDeviceIoControl, GetLogicalDrives, and SetVolumeMountPointA. The ransomware assigns a\ndrive letter to any volumes not assigned a logical drive letter and makes them accessible.\nThese newly attached volumes are later encrypted during the final stage of the binary.\n\nRagnarLocker iterates through all running services and terminates services commonly used by\nmanaged service providers to remotely administer networks. The malware then attempts to\nsilently delete all Volume Shadow Copies, preventing user recovery of encrypted files, using\ntwo different methods:\n\n  - >vssadmin delete shadows /all /quiet\n\n  - >wmic.exe.shadowcopy.delete\n\nLastly, RagnarLocker encrypts all available files of interest. Instead of choosing which files to\nencrypt, RagnarLocker chooses which folders it will not encrypt. Taking this approach allows\nthe computer to continue to operate “normally” while the malware encrypts files with known\nand unknown extensions containing data of value to the victim. For example, if the logical\ndrive being processed is the C: drive, the malware does not encrypt files in the following\nfolders:\n\n  - Windows\n\n\n-----\n\n  - Windows.old\n\n  - Mozilla\n\n  - Mozilla Firefox\n\n  - Tor browser\n\n  - Internet Explorer\n\n  - $Recycle.Bin\n\n  - Program Data\n\n  - Google\n\n  - Opera\n\n  - Opera Software\n\nAlso, when iterating through files, the malware does not encrypt files with the following\nextensions:\n\n  - .db\n\n  - .sys\n\n  - .dll\n\n  - .lnk\n\n  - .msi\n\n  - .drv\n\n  - .exe\n\n## Indicators\n\nThe following IOCs are associated with RagnarLocker ransomware, as of January 2022.\n\n|RagnarLocker IOCs as of January 2022|Col2|Col3|\n|---|---|---|\n|IP address|Context|Timeframe|\n|185.138.164.18|IP accessing confluence server|2021-09-03 10:53:56 - 2021-09- 21 18:46:40|\n|185.172.129.215|IP accessing confluence server|2021-09-01 20:49:56 - 2021-09- 03 10:45:50|\n|45.144.29.2|IP accessing confluence server|2021-09-12 21:34:13 -02021-09- 16 14:28:19|\n|23.106.122.192|IP seen with updt32.exe proxy malware|2021-09-27 20:07|\n|45.90.59.131|IP resolution for secanalytics C2 domain|2021-09-17 16:27|\n|149.28.200.140|IP address involved in PSCP activity|2021-09-10 19:20|\n\n\n-----\n\n|IP address|Context|Timeframe|\n|---|---|---|\n|193.42.36.53|IP address resolution for windows-analytics- prod12ms[.]com|2021-10-01 14:41|\n|45.63.89.250|IP address belonging to ctlmon.exe - GOTROJ malware|2021-09-11 13:13|\n|190.211.254.181|IP address involved in data exfiltration|2021-10-27 11:30:35|\n|142.44.236.38|IP address involved in data exfiltration|2021-11-03 8:16|\n|37.120.238.107|IP address involved in data exfiltration|2021-10-19 21:22:48 - 2021-10- 26 13:12:56|\n|95.216.196.181|C2 embedded in malware (snmp.dat and bash.dat and esync.exe)|2021-11-11 19:20|\n|162.55.38.44|C2 embedded in malware (snmp.dat and bash.dat and esync.exe)|2021-11-11 19:20|\n|116.203.132.32|C2 embedded in malware (snmp.dat and bash.dat and esync.exe)|2021-11-11 19:20|\n|49.12.212.231|C2 embedded in malware (snmp.dat and bash.dat and esync.exe)|2021-11-11 19:20|\n|193.42.39.10|seen as argument to inetinfo.exe|2021-11-22 17:12|\n|193.111.153.24|(ssl-secure-com2048[.]com) - bash, snmp, 7z, and psexec downloaded from this domain|2021-11-18 20:38|\n|178.32.222.98|IP address involved in data exfiltration|2021-10-30 16:25|\n|23.227.202.72|IP address involved in data exfiltration|2021-11-26 14:18:21 - 2021-12- 14 11:12:19|\n|159.89.95.163|NA|2021-06-05|\n|50.201.185.11|NA|2021-03-26 19:28 UTC +3|\n|47.35.60.92|NA|2021-09-03 11:40 UTC +3|\n|108.26.193.165|NA|2021-05-13 14:01 GMT +3|\n|108.56.142.135|NA|2021-03-25 17:16:55 GMT +1|\n|198.12.81.56|NA|2021-10/11|\n|198.12.127.199|NA|2021-10/11|\n|45.91.93.75|NA|2021-03-18|\n\n\n-----\n\n|IP address|Context|Timeframe|\n|---|---|---|\n|217.25.93.106|NA|2021-03-21|\n|45.146.164.193|NA|2020-10-05|\n|89.40.10.25|NA|2020-10-10|\n|5.45.65.52|NA|NA|\n|79.141.160.43 (URL: izugz.envisting.xyz)|NA|2021-05-24|\n\n|Bitcoin Addresses:|Timeframe|\n|---|---|\n|19kcqKevFZhiX7NFLa5wAw4JBjWLcpwp3e|2021-04-30|\n|1CG8RAqNaJCrmEdVLK7mm2mTuuK28dkzCU|2021-03|\n|151Ls8urp6e2D1oXjEQAkvqogSn3TS8pp6|2021-02-27|\n\n\nalexeyberbi@gmail.com NA\n\n|Email Addresses:|Timeframe|\n|---|---|\n|ShingXuan7110@protonmail.com|2021-040-03|\n|scanjikoon@yahoo.com|2021-05-25|\n|alexeyberdin17@gmail.com (linked by SMS)|NA|\n|titan_fall572cool@gmail.com|NA|\n|Vivopsalrozor@yahoo.com|NA|\n|Gamarjoba@mail.com|NA|\n|back.shadow98@gmail.com (cookie-linked)|NA|\n|michael.shawn.brown2@gmail.com|NA|\n|Alexey_Berdin@list.ru|NA|\n|sh0d44n@gmail.com|NA|\n|alexeyberdin437@gmail.com|NA|\n|alexeyberdin38@gmail.com|NA|\n|alexeyberbi@gmail.com|NA|\n\n\n-----\n\n## Information Requested:\n\nThe FBI does not encourage paying a ransom to criminal actors. Paying a ransom may embolden\nadversaries to target additional organizations, encourage other criminal actors to engage in the\ndistribution of ransomware, or fund illicit activities. Paying the ransom also does not guarantee\na victim’s files will be recovered. However, the FBI understands when businesses are faced with\nan inability to function, executives will evaluate all options to protect their shareholders,\nemployees, and customers. Regardless of whether you or your organization decides to pay the\nransom, the FBI urges you to report ransomware incidents to your local field office. Doing so\nprovides investigators and analysts with the critical information they need to track ransomware\nattackers, hold them accountable under US law, and prevent future attacks.\n\nThe FBI may seek the following information:\n\n**SHORT TERM ITEMS**\n\n    - Copy of the ransom note (screen shot/picture/text file).\n\n    - Any discovered malicious IPs with time stamps/time zones (unusual RDP\n\nconnections/unusual VPN connections/beacons to malicious IPs).\n\n    - Virtual currency addresses/amount of demand.\n\n    - Any malicious files (executables/binaries).\n\n    - Summary of timeline of events (dates of initial observation/malicious activity).\n\n    - Evidence of data exfiltration.\n\n**LONG TERM ITEMS**\n\n    - Brief summary of where the IOCs came from.\n\n    - Incident response report.\n\n    - Copy of any communications with malicious actors.\n\n    - Forensic images and memory captures.\n\n    - Host and network logs.\n\n    - Any available decryptor.\n\n    - Scope of impact (amount of loss).\n\n## Recommended Mitigations:\n\n  - Back-up critical data offline.\n\n  - Ensure copies of critical data are in the cloud or on an external hard drive or storage\n\ndevice. This information should not be accessible from the compromised network.\n\n\n-----\n\n  - Secure your back-ups and ensure data is not accessible for modification or deletion\n\nfrom the system where the data resides.\n\n  - Use multi-factor authentication with strong passwords, including for remote access\n\nservices.\n\n  - Keep computers, devices, and applications patched and up-to-date.\n\n  - Monitor cyber threat reporting regarding the publication of compromised VPN login\n\ncredentials and change passwords and settings.\n\n  - Consider adding an email banner to emails received from outside your organization.\n\n  - Disable unused remote access/Remote Desktop Protocol (RDP) ports and monitor\n\nremote access/RDP logs.\n\n  - Audit user accounts with administrative privileges and configure access controls with\n\nleast privilege in mind.\n\n  - Implement network segmentation.\n\n## Additional Resources\n\nFor additional resources related to the prevention and mitigation of ransomware, go to\n[https://www.stopransomware.gov as well as the CISA-Multi-State Information Sharing and](https://www.stopransomware.gov/)\nAnalysis Center (MS-ISAC) Joint Ransomware Guide. Stopransomware.gov is the Government’s\nofficial one-stop location for resources to tackle ransomware more effectively.\n\nCISA’s Ransomware Readiness Assessment (RRA) is a no-cost self-assessment based on a tiered\nset of practices to help organizations better assess how well they are equipped to defend and\nrecover from a ransomware incident.\n\n[CISA offers a range of no-cost cyber hygiene services](https://www.cisa.gov/cyber-hygiene-services) to help critical infrastructure organizations\nassess, identify, and reduce their exposure to threats, including ransomware. By requesting\nthese services, organizations of any size could find ways to reduce their risk and mitigate attack\nvectors.\n\n\n-----\n\n## Reporting Notice\n\nThe FBI encourages recipients of this document to report information concerning suspicious or\ncriminal activity to their local FBI field office. With regards to specific information that appears\nin this communication; the context, individual indicators, particularly those of a nondeterministic or ephemeral nature (such as filenames or IP addresses), may not be indicative of\na compromise. Indicators should always be evaluated in light of your complete information\nsecurity situation.\n\nField office contacts can be identified at www.fbi.gov/contact-us/field-offices. When available,\neach report submitted should include the date, time, location, type of activity, number of\npeople, and type of equipment used for the activity, the name of the submitting company or\norganization, and a designated point of contact.\n\n## Administrative Note\n\nThis product is marked TLP:WHITE. Subject to standard copyright rules, the information in this\nproduct may be shared without restriction.\n\n\n### Your Feedback Regarding this Product is Critical\n\n#### Was this product of value to your organization? Was the content clear and concise?  Your comments are very important to us and can be submitted anonymously. Please take a moment to complete the survey at the link below. Feedback should be specific to your experience with our written products to enable the FBI to make quick and continuous improvements to such products. Feedback may be submitted online here:\n\n## https://www.ic3.gov/PIFSurvey\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/Media/News/2022/220307.pdf"
    ],
    "report_names": [
        "220307.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1646920332,
    "ts_modification_date": 1646920332,
    "files": {
        "pdf": "https://archive.orkl.eu/a4e09ba8eb513e516d27547d21e22a25dc59b765.pdf",
        "text": "https://archive.orkl.eu/a4e09ba8eb513e516d27547d21e22a25dc59b765.txt",
        "img": "https://archive.orkl.eu/a4e09ba8eb513e516d27547d21e22a25dc59b765.jpg"
    }
}