{
    "id": "6105e6ca-bebc-41c6-a07f-3d345c9927d1",
    "created_at": "2023-01-12T14:59:53.224639Z",
    "updated_at": "2025-03-27T02:09:29.839769Z",
    "deleted_at": null,
    "sha1_hash": "fc2d3163905291f57438955d0afd080343dda300",
    "title": "2020-03-12 - How cybercriminals are taking advantage of COVID-19- Scams, fraud, and misinformation",
    "authors": "",
    "file_creation_date": "2022-05-28T02:16:15Z",
    "file_modification_date": "2022-05-28T02:16:15Z",
    "file_size": 842210,
    "plain_text": "# How cybercriminals are taking advantage of COVID-19: Scams, fraud, and misinformation\n\n**digitalshadows.com/blog-and-research/how-cybercriminals-are-taking-advantage-of-covid-19-scams-fraud-**\nmisinformation/\n\nMarch 12, 2020\n\nIn the wake of large-scale global events, cybercriminals are among the first to attempt to sow\ndiscord, spread disinformation, and seek financial gain. In February 2020, the World Health\nOrganization (WHO) [released an advisory warning of ongoing scams involving the ongoing](https://www.who.int/about/communications/cyber-security)\noutbreak of COVID-19, the disease caused by severe acute respiratory syndrome\ncoronavirus 2 (SARS-CoV-2) and informally referred to as “coronavirus”. These scams aim to\nexploit people’s fear and uncertainty concerning the disease’s spread.\n\nThese can be broadly split into the following three categories:\n\n1. Phishing and social engineering scams\n2. Sale of fraudulent or counterfeit goods\n3. Misinformation\n\nWhile COVID-19 itself presents a significant global security risk to individuals and\norganizations across the world, cybercriminal activity around this global pandemic can result\nin financial damage and promote dangerous guidance, ultimately putting additional strain on\nefforts to contain the virus.\n\n## COVID-19 phishing and social engineering scams\n\nPhishing is one of, if not the single most common attack techniques. Reports of email\nphishing campaigns using COVID-19-related lures surfaced almost immediately after\nconfirmed infections began increasing in January 2020. Health organizations such as the\nWHO and US Centers for Disease Control and Prevention (CDC) have been prime targets\nfor impersonation due to their perceived authority: Attackers have been observed tempting\nvictims with URLs or document downloads using promises of important safety documentation\nor infection maps.\n\n[COVID-19 has also been a popular topic of discussion on cybercriminal forums. For](https://resources.digitalshadows.com/digital-risk-protection/the-modern-cybercriminal-forum)\nexample, in February 2020, a user initiated a thread on the prestigious Russian-language\ncybercriminal forum XSS to advertise a new COVID-19-themed phishing scheme. The user\nadvertised a method to deliver malware via an email attachment disguised as a distribution\nmap of the virus’s outbreak, containing real-time data from the WHO. The map itself is an\nimpersonation of a legitimate map created by the Johns Hopkins Center for Systems Science\nand Engineering (CSSE). The offering was priced at $200 for a “private build”, and if buyers\nalso required a Java CodeSign certificate, the price would be $700.\n\n\n-----\n\n_XSS post on COVID-19-related phishing scam_\n\n_Legitimate Johns Hopkins COVID-19 distribution map_\n\n[Another phishing scam, as detailed by Sophos, impersonated an official email](https://nakedsecurity.sophos.com/2020/02/05/coronavirus-safety-measures-email-is-a-phishing-scam/)\ncorrespondence from the WHO. The email contained a link to purported document on\npreventing the spread of the virus but redirected victims to a malicious domain which\n\n\n-----\n\nattempted to harvest credentials. The email contained several grammatical and format\nerrors, which can be used by attackers to narrow down their victims and bypass spam filters.\n[We discussed this technique in our blog on The Ecosystem of Phishing.](https://www.digitalshadows.com/blog-and-research/the-ecosystem-of-phishing/)\n\n_Phishing scam impersonating the WHO (Source: Sophos)_\n\nThese campaigns are often targeted towards geographies which have significant numbers of\nCOVID-19 infections. In late January 2020, a phishing campaign targeted individuals in\nJapan with emails claiming to be from disability welfare service providers and public health\ncenters. The emails used lures of documents containing information on alerts of new COVID19 infections as well as preventative measures against the virus. However, when accessed,\n[the documents attempted to download and install Emotet, an information stealing malware.](https://www.digitalshadows.com/blog-and-research/emotet-returns-how-to-track-its-updates/)\n\n\n-----\n\nSimilarly, individuals in Italy, which has the highest number of confirmed infections of COVID19 outside of China, were targeted by a phishing campaign in March 2020 which\nimpersonated WHO officials and attempted to distribute the Trickbot trojan.\n\n_Japanese-language phishing email (Source: IBM)_\n\n\n-----\n\n_Italian-language phishing email (Source: Sophos)_\n\nOrganizations like the WHO or CDC are also not the only ones at risk of being impersonated.\nSince January 2020, the number of COVID-19-related domains registered has increased\nsignificantly: Digital Shadows has identified over 1,400 domains registered over the past\nthree months. While many of these are likely legitimate and dedicated to providing\ninformation on the virus and its spread, it is almost certain that a portion have been created\nwith malicious intent. Malicious domains can be used to spread misinformation, host phishing\npages, impersonate legitimate brands, and sell fraudulent or counterfeit items. In March\n[2020, the UK’s National Fraud Intelligence Bureau (NFIB) reported over 21 cases of COVID-](https://www.theguardian.com/world/2020/mar/06/police-issues-warning-against-coronavirus-fraudsters-in-uk)\n19-related fraud schemes, resulting in losses of over £800,000 in the UK alone. The NFIB\ncited specific examples which included the fraudulent sale of face masks and sites which\npromised victims a map of COVID-19 infections near them in return for a bitcoin payment.\n\n\n-----\n\n_COVID-19-related domains registered over the past six months (Source: Digital Shadows’_\n_Shadow Search)_\n\n_Potentially fraudulent site offering discounted face masks_\n\nEven domains which contain no overt references to the virus have been identified. Below is\nan example on Pastebin that uses the lure of a purportedly infected Italian footballer to direct\nindividuals to a malicious site.\n\n\n-----\n\n_Pastebin post with a malicious COVID-19-related link (Source: Digital Shadows’ Shadow_\n_Search)_\n\n## COVID-19 fraudulent and counterfeit goods\n\nThe COVID-19 outbreak has contributed to a global shortage of healthcare equipment.\nSupplies like face masks and hand sanitizer have been out of stock at many major retailers,\nand prices on ecommerce websites have in some cases tripled over the past few weeks.\nThis shortage is likely in part driven by the spread of misinformation. Face masks are\nessential for the safety of medical staff but have little effect on preventing healthy individuals\nfrom infection: The WHO recommends face masks should not be used unless caring for an\nindividual with a suspected COVID-19 infection.\n\nChina is the world’s [largest global supplier of medical face masks, manufacturing](https://www.cnn.com/2020/03/06/business/medical-masks-china-shortage-suppliers/index.html)\napproximately 80% of face masks worldwide. Due to the COVID-19 outbreak, production and\nexports from China have been severely limited over the past few months. This has put a\nstrain on manufacturers outside of China, creating a market for counterfeit products and\nfraudulent listings.\n\nAs mentioned earlier, hundreds of potentially shady websites have popped up that claim to\noffer heavily discounted face masks. Even if the products are legitimate, there is no\nguarantee that the products even exist to begin with.\n\n\n-----\n\n_Website selling discounted face masks_\n\nMedical equipment has even been observed for sale on cybercriminal marketplaces. Listings\non Empire, an English-language dark web marketplaces, specifically mention COVID-19 to\nhelp push their goods. One listing offers 2,000 boxes of surgical face masks for $6,500.\nVendors like these typically engage in the sale of illicit drugs, but have clearly seen a market\nopportunity to branch out into medical equipment.\n\n\n-----\n\n_Listings for face masks on Empire market (Source: Digital Shadows’ Shadow Search)_\n\n## COVID-19 misinformation / infodemic\n\nCOVID-19-related misinformation has primarily been spread via social media and private\nmessaging platforms. Misinformation does not always have the same tangible financial\nimpact as other types of cybercriminal activity, but it can still be used to cause panic, incite\nracism and xenophobia, promote harmful at-home cures, and result in shortages of supplies\nand critical medical equipment. The WHO has labelled this proliferation of information – both\n[legitimate and not – as an “infodemic”, and have assembled a dedicated team to manage the](https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200202-sitrep-13-ncov-v3.pdf)\nspread of potentially harmful misinformation.\n\n\n-----\n\n_WHO graphic debunking at-home cures (Source: WHO)_\n\n[Official government entities have also taken steps to curb misinformation. Below is a tweet](https://twitter.com/SpokespersonGoK/status/1234451720756920321)\nfrom the official account for the spokesperson of the Government of Kenya denouncing the\nspread of misinformation.\n\nAdditionally, an Australian Member of Parliament also denounced a fraudulent social media\npost that was impersonating the Australian Department of Health, advising individuals to\navoid areas populated with Chinese nationals.\n\n\n-----\n\n_Australian MP denouncing the spread of misinformation_\n\nSocial media platforms themselves have also taken a proactive approach to help prevent the\nspread of false information related to COVID-19 by flagging posts which may be illegitimate\nand hiring third-party organizations to fact-check posts. When searching COVID-19-related\nterms on platforms like Twitter, Facebook, and even Instagram, users are prompted to obtain\ninformation from official sources. This can even help streamline the dissemination of\nlegitimate information by providing centralized results.\n\n\n-----\n\n_Twitter search directing users to the official CDC account_\n\n\n-----\n\n_Facebook search directing users to the official CDC website_\n\n_Instagram search directing users to the official WHO and UNICEF accounts_\n\nSearch engines like Google have also manually intervened to help fight the spread of\nmisinformation: When searching for COVID-19-related terms, users are provided an “SOS\nAlert”, which includes news articles from legitimate, vetted outlets and links to official\n\n\n-----\n\nresources from the CDC and WHO.\n\n_COVID-19 “SOS Alert” on Google_\n\nThese measures are a great step in the right direction, and have likely already stopped the\ndistribution of a significant amount of harmful material. Organizations have become more\naware of the risks of the spread of misinformation over the past year, but there is still onus on\n\n\n-----\n\nusers to ensure that the information they digest and share is legitimate. This is particularly\nimportant during global health crises, where the ramifications of misinformation can be\ndeadly. For example, some recipes for making homemade hand sanitizers are not suitable\nfor use on skin and can be ineffective in halting the transmission of COVID-19.\n\n_Example of potentially dangerous at-home cures (Source: BBC)_\n\n## COVID-19: Staying safe on and offline\n\nTo help prevent the spread of misinformation, individuals should ensure that they only\nfollow guidance from official national health institutions like the CDC and NHS, as well\nas international organizations like the WHO.\n[The WHO recommends the following basic protective measures to prevent the spread](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public)\nand contraction of COVID-19:\n\nClean your hands frequently with an alcohol-based hand rub or wash them with\nsoap and water.\nMaintain at least 1 meter (3 feet) distance between yourself and anyone who is\ncoughing or sneezing.\nAvoid touching your eyes, nose, and mouth.\nPractice respiratory hygiene: Cover your mouth and nose with your bent elbow or\ntissue when you cough or sneeze and dispose of used tissues immediately.\nStay home if you feel unwell. If you have a fever, cough, and difficulty breathing,\nseek medical attention and call in advance. Follow the directions of local health\nauthorities.\nUse fact-checking tools to challenge potentially dubious claims on social media\n\n\n-----\n\nBe wary of unsolicited correspondances that contain alarmist messaging and/or\nimpersonate official health and safety institutions. Grammatical and formatting errors\ncan help you identify malicious phishing emails.\nBe wary of emails soliciting charitable donations.\nDo not download files or visit unknown websites linked in unsolicited emails.\nDo not purchase medical equipment from unofficial third-party vendors (particularly on\nthe dark web!). If a deal seems too good to be true, then it probably is.\n\n## Additional official resources:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-12 - How cybercriminals are taking advantage of COVID-19- Scams, fraud, and misinformation.pdf"
    ],
    "report_names": [
        "2020-03-12 - How cybercriminals are taking advantage of COVID-19- Scams, fraud, and misinformation.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535593,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653704175,
    "ts_modification_date": 1653704175,
    "files": {
        "pdf": "https://archive.orkl.eu/fc2d3163905291f57438955d0afd080343dda300.pdf",
        "text": "https://archive.orkl.eu/fc2d3163905291f57438955d0afd080343dda300.txt",
        "img": "https://archive.orkl.eu/fc2d3163905291f57438955d0afd080343dda300.jpg"
    }
}