{
    "id": "617a6818-66ce-46eb-ba84-e948b3ab0da3",
    "created_at": "2024-05-18T02:05:49.089954Z",
    "updated_at": "2025-03-27T02:13:50.557251Z",
    "deleted_at": null,
    "sha1_hash": "690da3bf046071c6575aa23a6477f7f5320427f9",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-05-13T18:56:44Z",
    "file_modification_date": "2024-05-13T18:56:48Z",
    "file_size": 8448750,
    "plain_text": "###### WHITEPAPER\n\n## Ebury is alive but unseen:\n##### 400k Linux servers compromised for cryptocurrency theft and financial gain\n\n###### Marc-Etienne M.Léveillé\n\n May 2024\n\n (eset):research\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 2\n\n#### Contents\n\n\n###### \b 7 Propagation\n\n Credential stuffing\b 8\n\n Hypervisor or container host\b 9\n\n Compromise of hosting providers\b 9\n\n Exploitation of vulnerabilities\b 9\n\n SSH adversary-in-the-middle\b 10\n\n \b 11 Victimology\n\n Notable compromises\b 13\n\n \b 15 An Update to Ebury\n\n Ebury basics\b 16\n\n Persistence\b 17\n\n IPC mechanisms\b 18\n\n libcurl hooking for HTTP request exfiltration\b 19\n\n Userland rootkit\b 19\n\n Typical post-exploitation usage\b 22\n\n Credential exfiltration\b 22\n\n\n###### \b 23 Monetization: Multiple New Components\n\n Malicious Apache and nginx modules\b 24\n\n KernelRedirect\b 29\n\n FrizzySteal\b 31\n\n Hiding traffic from system administrators\b 31\n\n Performing AitM attacks\b 32\n\n \b 34 Attribution\n\n \b 36 Remediation\n\n\n###### Detection\b 37\n\n Payment details\b 37\n\n Cleaning\b 37\n\n\n###### \b 38 Conclusion\n\n \b 40 Acknowledgments\n\n \b 42 MITRE ATT&CK Techniques\n\n \b 46 IoCs\n\n\n###### Host-based indicators\b 47\n\n Network\b 48\n\n YARA rules\b 48\n\n Files\b 49\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 3\n\n#### List of figures\n\n\n###### Figure 1. Different methods used by the Ebury gang to compromise new servers . . . . . . . . . . . . . . . . . . . . . . .  8\n\n Figure 2. Perl script run on OpenVZ hosts to install Ebury in all containers. . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n\n Figure 3. Control Web Panel exploitation attempt . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n\n Figure 4. Disassembly of the Dirty COW exploit payload . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  10\n\n Figure 5. Ebury deployments per month using two different scales on the Y axis, according \n\n to the database of compromised servers maintained by the perpetrators. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n\n Figure 6. HelimodSteal installation script with detection of the string \n```\nBigBadW0lf in libcurl.so.4 highlighted . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n\n Figure 7. Hex-Rays decompilation of curl_easy_perform function modified \n\n by SmallCuteCat, highlighting User agent set to BigBadW0lf. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n\n Figure 8. Only logs remaining from the visit to install Ebury (redacted). . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n\n Figure 9. Month each major Ebury version was first seen since the publication of Operation Windigo. . . 16\n\n Figure 10. File listing showing the malicious libkeyutils.so with the Ebury v1.8.2 payload. . . . . . . . . . . . . 17\n\n Figure 11. Hex-Rays decompilation of constructor function calling dlopen(“libkeyctl.so”, …) to load\n\n Ebury. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17\n\n Figure 12. Flow of stolen credentials, from the victim using an Ebury-compromised SSH client \n\n to the Ebury process, and later fetched by the operators. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n\n Figure 13. curl_easy_perform hooked by Ebury to exfiltrate HTTP POST data, decompiled \n\n with the Hex-Rays Decompiler. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n\n```\n\n###### Figure 14. Processes where Ebury is injected. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n\n Figure 15. File listing with (above), and without (below), the Ebury userland rootkit activated. . . . . . . . . . 20\n\n Figure 16. Difference between ps auxw being executed under a trusted and a compromised shell. . . . . . 20\n\n Figure 17. Difference between /proc/net/unix seen under a program compromised with Ebury \n\n and one that is not. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20\n\n Figure 18. recvmsg as hooked by Ebury, decompiled with the Hex-Rays Decompiler. . . . . . . . . . . . . . . . . . . . . 21\n\n Figure 19. Differences in OpenSSH server and Bash maps files when under the Ebury userland rootkit. . . 21\n\n Figure 20. Timeline of usage of Ebury over a one-month span. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  22\n\n Figure 21. Multiple malware families deployed on Ebury-infested servers and the impact \n\n for potential victims. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  24\n\n Figure 22. Module information exported by mod_dir.so as seen in IDA Pro \n\n with the proper structure definition. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n\n Figure 23. Hex-Rays Decompiler output for HelimodProxy’s register_hooks . . . . . . . . . . . . . . . . . . . . . . . . . 25\n\n Figure 24. Hex-Rays Decompiler output of the Apache connection hook function of HelimodProxy. . . . . 26\n\n Figure 25. Hex-Rays Decompiler output of Apache output filter of HelimodRedirect. . . . . . . . . . . . . . . . . . .  26\n\n Figure 26. Hex-Rays Decompiler output of HelimodSteal input filter, exfiltrating data \n\n using an HTTP request. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  27\n\n Figure 27. Generation of the resource path used to control HelimodProxy (earlier version). . . . . . . . . . . . . .  27\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 4\n\n\n###### Figure 28. Generation of the resource path used to control the Helimod malware\n\n family (latest version). . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  27\n\n Figure 29. Example HTTP reply from HelimodRedirect configuration URL. . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  28\n\n Figure 30. A Mastodon thread on floss.social showing a user complaining about web redirection. \n\n The screenshot they provide (bottom) shows a redirection target matching the HelimodRedirect \n\n signature (source: https://floss.social/@9to5linux/109500305664911924).. . . . . . . . . . . . . . . . . . . . . . . . .  28\n\n Figure 31. Location of servers compromised by HelimodSteal. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  28\n\n Figure 32. Example HTTP reply from HelimodSteal configuration URL. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  28\n\n Figure 33. C reimplementation of the function adding an IP address to a list, present \n\n in the Helimod malware family. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  29\n\n Figure 34. Hook behavior configuration. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  29\n\n Figure 35. Structure of the hardcoded configuration . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  29\n\n Figure 36. Decompiled code of the PRNG used by the malicious Netfilter module . . . . . . . . . . . . . . . . . . . . . . 30\n\n Figure 37. replacer_info values in KernelRedirect sample showing the decimal-formatted \n\n IP address used as redirection target. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 30\n\n Figure 38. Malicious dependency added to libz. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 31\n\n Figure 39. Decrypted strings from FrizzySteal sample. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 31\n\n Figure 40. Flow of credit card details on transactional website compromised by Ebury. . . . . . . . . . . . . . . . . . 31\n\n Figure 41. IDA Pro flow graph showing an IP address being compared with the embedded, \n\n hardcoded list to determine whether to display it in the command output . . . . . . . . . . . . . . . . . . . . . . . . . . . .  32\n\n Figure 42. IDA Pro disassembly showing injection of rules after iptables-restore finishes \n\n its legitimate duties. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  32\n\n\n###### Figure 43. Overview of the AitM attacks perpetrated by the Ebury gang. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  32\n\n Figure 44. Perl script run on target system after SSH credentials are stolen (redacted). . . . . . . . . . . . . . . . .  33\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 5\n\n#### Ebury is alive but unseen:  400k Linux servers compromised for crypto theft and financial gain\n\n\n###### One of the most advanced server-side malware campaigns is still growing, with hundreds of thousands of compromised servers, and it has diversified to credit card and cryptocurrency theft.\n\n Ten years ago, ESET published Operation Windigo, a white paper about multiple malware families working\n\n together, with the Ebury malware family at its core. Then, in late 2021, the Dutch National High Tech Crime Unit\n\n (NHTCU), part of the Netherlands national police, reached out to ESET regarding servers in the Netherlands\n\n suspected of being compromised with Ebury malware. Those suspicions happened to be well-founded and together\n\n we gained considerable visibility into operations run by the Ebury threat actors. The current white paper is the result\n\n of that collaboration between ESET and Netherlands law enforcement, exposing the activities of the Ebury group\n\n over the past years. It is a deep dive into the underground world of server-side Linux malware revealing the largely\n\n unseen activities of these criminal groups.\n\n Following the release of our paper in early 2014, one of the perpetrators was arrested at the Finland-Russia border\n\n in 2015, and later extradited to the United States. While he initially claimed innocence, he eventually pleaded guilty\n\n to the charges in 2017, a few weeks before his trial at the U.S. District Court in Minneapolis was set to proceed, and\n\n where ESET researchers were scheduled to testify.\n\n\n###### While some of the monetization techniques disappeared, the arrest did not stop Ebury botnet activity and the gang\n\n continued to develop new malware, update existing malicious programs, and find new ways to monetize its access\n\n to a plethora of servers.\n\n Ebury, active since at least 2009, is an OpenSSH backdoor and credential stealer. It is a shared library that, when\n\n loaded, alters the behavior of the OpenSSH client and server, injects itself into programs that use the curl library so as\n\n to exfiltrate HTTP requests made by the system, and tampers with terminal sessions spawned over SSH to hide itself.\n\n It is used to deploy additional malware to: monetize the botnet (such as modules for web traffic redirection), proxy\n\n traffic for spam, perform adversary-in-the-middle attacks (AitM), and host supporting malicious infrastructure. Its\n\n operators have used the Ebury botnet to steal cryptocurrency wallets, credentials, and credit card details.\n\n Our paper on Operation Windigo covered many aspects of the operation, from the malware the Ebury group\n\n used to how it monetized the botnet. This paper is no different: our collaboration has given us great visibility into\n\n many aspects of the group’s operations that helped us uncover new malware families it uses and updates to Ebury,\n\n provided a better understanding of how it propagates, and revealed new monetization techniques deployed to\n\n compromised servers. We can draw a big picture using different sources: the honeypots we operate; information\n\n shared with us by victims; and the servers seized by law enforcement, which included malware samples, the tools\n\n used by attackers, records of their activities, and a lengthy list of victims.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 6\n\n Key findings:\n • [Ebury actors have been pursuing monetization activities subsequent to our 2014 publication on Operation ] Windigo, including the spread of spam, web traffic redirections, and credential stealing.\n\n • [Additionally, we have confirmed that operators are also involved in cryptocurrency heists by using AitM and ] credit card stealing via network traffic eavesdropping, commonly known as server-side web skimming.\n\n • [Over the years, Ebury has been deployed to backdoor almost 400,000 Linux, FreeBSD, and OpenBSD servers, ] and more than 100,000 were still compromised as of late 2023.\n\n • [We uncovered new malware families authored and deployed by the gang for financial gain, including Apache ] modules and a kernel module to perform web traffic redirection.\n\n • [In many cases, Ebury operators were able to gain full access to large ISPs and well-known hosting providers. ] They used that access to deploy Ebury on the partial or complete server infrastructure hosted by that provider.\n\n • [Ebury also compromised the infrastructure of other threat actors, including Vidar Stealer and many others, ] to steal data stolen by those other groups and copycat competing operations to blur attribution attempts.\n\n • [Ebury operators also used zero-day vulnerabilities in administrator software to compromise servers in bulk.]\n\n • [The data we obtained confirmed a number of suspected victims, including the compromise ] of kernel.org from 2009 to 2011.\n\n • [We provide a set of tools and indicators to help system administrators determine whether their systems are ] compromised by Ebury.\n\n In this paper, we first look at how Ebury propagates and who the victims are, including notable cases we have\n\n uncovered. This is followed by an updated analysis of Ebury, which focuses on changes in the more recent versions.\n\n Next, we analyze the other malware families the Ebury group deploys and how they are monetized. Finally,\n\n we describe how system administrators can identify whether they are compromised and discuss how to avoid\n\n becoming a victim of Ebury.\n\n\n-----\n\n###### WHITEPAPER | 7\n\n\n# Propagation\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 8\n\n Server compromised in Related server\n file and uses the same password or key\n with Ebury sharing credentials\n\n#### Propagation\n\n\n###### A recurrent question when we talk about Ebury is: How does Ebury get installed in the first place? Deploying Ebury\n\n on a server requires administrator (root) privileges, so those must be gained somehow. Ten years ago, we only had\n\n one answer, because this was what we could witness: Via credential stealing, where the SSH clients compromised\n\n by Ebury leaked everything required for the operators to authenticate to that other system. The current\n\n investigation has uncovered more methods used by the perpetrators to maximize their pool of compromised\n\n servers. Figure 1 shows five new methods we have identified, which are described below.\n\n Credential stuffing\n\n After a system is compromised, a number of details are exfiltrated, including a list of previous outbound and inbound\n\n SSH sessions using OpenSSH’s known_hosts files and records from wtmp, respectively. Using the known passwords and\n\n keys obtained on that system, credentials are reused to try logging into related systems.\n\n When the known_hosts file contains hashed information (see the HashKnownHosts OpenSSH option), the\n\n perpetrators try to brute force its content. Out of 4.8 million known_hosts entries collected by Ebury operators,\n\n about two million had their hostname hashed. 40% (about 800,000) of those hashed hostnames were guessed or\n\n brute forced.\n\n\n###### uses credential stuffing\n connects using compromised SSH client\n\n Related server\n\n uses stolen creds\n\n Web hosting\n provisions\n control panel\n\n uses password set when provisioned\n\n uses hypervisor Container privileges\n OpenVZ or\n Container\n container host\n Container\n\n uses exploit\n Server running vulnerable software\n\n Server compromised with Ebury\n\n AitM\n Server in the same\n\n uses stolen credentials\n network segment\n\n Figure 1. Different methods used by the Ebury gang to compromise new servers\n\n\n###### Server compromised with Ebury\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 9\n\n\n###### Hypervisor or container host\n\n In cases where the perpetrators gain access to a hypervisor or a system that runs containers, they may try to use\n\n their privileges to deploy Ebury on all the subsystems. They will do this in an unobtrusive way that won’t require\n\n a shutdown or reboot of the contained systems. This is done in an automated way on servers running OpenVZ,\n\n where all containers are compromised by running a malicious Perl script using vzctl exec from the host. Figure 2\n\n shows the Perl script run from an OpenVZ host to run a Perl script inside each container, previously obtained using\n```\nvzlist. The Perl script run inside the containers installs Ebury.\n\n Figure 2. Perl script run on OpenVZ hosts to install Ebury in all containers\n\n Compromise of hosting providers\n\n We have documented cases where the infrastructure of hosting providers was compromised by Ebury. In these\n\n cases, we have seen Ebury being deployed on servers rented out by those providers, with no warning to the lessees.\n\n This resulted in cases where the Ebury actors were able to compromise thousands of servers at once (see Notable\n\n compromises).\n\n```\n\n###### Exploitation of vulnerabilities\n\n We also know now that the perpetrators exploit vulnerabilities to compromise systems or elevate their privileges.\n\n We have two examples where the exploitation was automated.\n\n Exploitation of a zero day in a web control panel\n\n In November 2020, the Ebury operators exploited software used to manage servers via a web interface known as\n\n Control Web Panel (CWP, previously known as CentOS Web Panel). A remote code execution vulnerability was\n\n used to deliver and execute a Perl script that resulted in the installation of Ebury on the target system. Figure 3\n\n shows the HTTP request sent to the server to trigger the vulnerability.\n\n Figure 3. Control Web Panel exploitation attempt\n\n This pre-authentication file inclusion vulnerability is known as CVE-2021-45467, and was first documented publicly\n\n more than one year after its usage by the Ebury gang. The usage of inc_index.php to trigger remote code\n\n execution is not documented. It is difficult for us to explain the vulnerability in more detail because CWP is packed\n\n and is not open source, but the service_start parameter suggests that the next step is to download and execute\n\n a Perl script, which we assume will be run as the root user. This was our first proof that the group has used zero-day\n\n vulnerabilities to expand its network.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 10\n\n Privilege escalation with Dirty COW\n\n Another exploit Ebury operators use is Dirty COW (CVE-2016-5195), which\n\n they use to elevate their privileges when the credentials they have do not\n\n provide root access. We have no reason to believe it was used before the\n\n disclosure. They use the existing exploit with a custom payload that issues\n\n a chmod system call to add the setuid bit to the Perl executable. Figure 4\n\n shows the disassembled shellcode of the exploit payload. With the setuid\n\n bit set, Perl can be used to run commands as the root user.\n\n SSH adversary-in-the-middle\n\n This technique is used when the Ebury operators have specific targets,\n\n possibly because the perpetrators might consider them valuable. For\n\n example, if the server could hold a wallet from which they could steal\n\n cryptocurrency. It requires them to have access to a server in the same\n\n network segment as their target. Over the years, hundreds of servers\n\n have been the targets of AitM and Ebury operators successfully stole SSH\n\n credentials, enabling them to gain access and install Ebury on these servers.\n\n See the Performing AitM attacks section for more details about how this is\n\n Figure 4. Disassembly of the Dirty COW exploit payload accomplished.\n\n\n-----\n\n###### WHITEPAPER | 11\n\n\n# Victimology\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 12\n\n#### Victimology\n\n\n###### As of mid-2023, Ebury had been installed on almost 400,000 Linux servers worldwide since at least 2009, and\n\n perhaps earlier. Note that there is no geographical boundary to Ebury, meaning that any outstanding variance is\n\n mostly due to where popular data centers are located. There are servers compromised with Ebury in almost all\n\n countries of the world. Whenever a hosting provider was compromised, this led to a vast number of compromised\n\n servers in the same data centers.\n\n Besides Linux, Ebury was also installed on approximately 400 FreeBSD servers, about a dozen OpenBSD and SunOS\n\n servers, and at least one Mac. Ebury operators also gained access to an SCO OpenServer 5 system, but never\n\n deployed Ebury on that machine.\n\n While 400,000 is a massive number, it’s important to mention that this is the number of compromises over the\n\n course of almost 15 years. Not all of those machines were compromised at the same time. There is a constant churn\n\n of new servers being compromised while others are being cleaned up or decommissioned. The data at our disposal\n\n doesn’t indicate when the attackers lost access to the systems, so it’s difficult to know the size of the botnet at any\n\n specific point in time. However, each time we were able to measure the number of servers currently compromised\n\n with Ebury, whether that was 10 years ago or in the past few years, we ended up with more or less 40,000 IP\n\n addresses. In 2023, that number ballooned to 110,000, mostly due to the compromise of a large hosting provider, as\n\n described below.\n\n While this might seem less than some of the massive malware campaigns targeting Windows, let’s remind\n\n ourselves that almost all compromised systems are servers, not end user devices. Servers help run the internet by\n\n hosting web pages, acting as authoritative name servers, performing financial transactions, etc.\n\n Figure 5 shows a timeline of when Ebury was installed on each victimized server. The data is presented using\n\n two linear scales. The one on the left shows data from 0 to 4,000. It shows an average Ebury deployment rate\n\n\n###### that is slowly increasing. If we exclude days with more than 2,000 Ebury installations, we get an average of 207\n\n installations per month before 2012, 1,331 between 2012 and 2020, and 1,654 after 2020. We believe the accesses to\n\n new servers were mostly gained using credentials stolen from existing Ebury-compromised servers.\n\n The scale on the right goes up to 70,000, showing months where the number of new installations was as high as\n\n 63,000. Those peaks are the result of larger incidents, where Ebury was installed by other means, such as accessing\n\n critical servers of hosting providers or using exploits.\n\n 4000 70000\n\n 3500\n 60000\n 3000\n 50000\n 2500\n 40000\n 2000\n 30000\n 1500\n 20000\n 1000\n 10000\n 500\n\n 0 0\n\n Figure 5. Ebury deployments per month using two different scales on the Y axis, according to the database of compromised servers maintained  by the perpetrators\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 13\n\n\n###### Notable compromises\n\n It’s worth noting that no verticals appear more targeted than others.\n\n Victims include universities, small and large enterprises, internet service\n\n providers, cryptocurrency traders, Tor exit nodes, shared hosting providers,\n\n and dedicated server providers, to name a few. Any kind of server running\n\n an SSH service may be a target of Ebury and the perpetrators have found\n\n numerous ways to monetize their various accesses, as we highlight later.\n\n This section provides a few examples to showcase where the compromise\n\n had a very significant impact on the security of those systems.\n\n Shared hosting, but not shared with whom you think\n\n In late 2019, the infrastructure of a large and popular US-based domain\n\n registrar and web hosting provider was compromised. The perpetrators\n\n were able to gain access to the system provisioning the servers.\n\n Consequently, they had access to source code and credentials used in the\n\n deployment of the servers.\n\n In total, approximately 2,500 physical and 60,000 virtual servers were\n\n compromised by the attackers. A very large portion, if not all, of these\n\n servers are shared between multiple users to host the websites of more\n\n than 1.5 million accounts.\n\n Since their infrastructure was mostly homogeneous (same Linux kernel\n\n version, same HTTP server, etc.), it was possible to deploy the same\n\n malware at scale to monetize this cluster of victims. The analyzed data has\n\n shown the following newly discovered malware families were installed on\n\n the victims’ servers:\n\n\n###### 1. HelimodSteal, an Apache module that exfiltrates all HTTP POST requests sent to the server. This module can be leveraged to steal credit card information from e-commerce websites.\n\n 2. HelimodRedirect, an Apache module that redirects a small percentage of HTTP traffic to advertisements.\n\n A complete description and analysis of both malware families are available\n\n later in this paper.\n\n It’s interesting to note that during deployment of HelimodSteal, the Perl\n\n script used by the attackers contained a check for malware that replaces\n```\nlibcurl.so.4 with a malicious version. Figure 6 shows the installation script\n\n of HelimodSteal, with that detection highlighted.\n\n Figure 6. HelimodSteal installation script with detection of the string BigBadW0lf in libcurl.so.4 highlighted\n\n The script notifies the operators by reporting bad_curl if the malicious\n\n libcurl is found and resumes the installation. We found samples of this\n\n malware that contain the BigBadW0lf string and named it SmallCuteCat.\n\n Figure 7 shows that the purpose of SmallCuteCat is to exfiltrate credit card\n\n```\n\n###### details, by checking whether a CVV or card number is present in the HTTP\n\n requests performed to a payment processor and sending the full details to\n\n an attacker-operated server if present.\n\n Figure 7. Hex-Rays decompilation of curl_easy_perform function modified by SmallCuteCat, highlighting User agent set to BigBadW0lf\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 14\n\n\n###### We do not attribute this malware to the Ebury gang. We think that\n\n SmallCuteCat was a competitor in the credit card stealing business that\n\n was already present in a small part of the victim infrastructure. We do not\n\n know if the Ebury gang tried to disrupt the competing operation, because\n\n the script only warns about the presence of SmallCuteCat and goes on with\n\n installing HelimodSteal. This is not the first time that the Ebury gang has\n\n made scripts to detect competing groups. We have already detailed many\n\n competing OpenSSH backdoors we found, based on Ebury’s detection\n\n script, in our 2018 paper The Dark Side of the ForSSHe.\n\n All your VM are belong to us\n\n In 2023, we saw an unusually large number of victims located in the same\n\n autonomous system (AS) in the US. This AS is used by a limited number of\n\n dedicated and virtual server rental brands. We suspected one of them was\n\n breached and Ebury was installed at large, on all the servers deployed by\n\n that organization.\n\n We made an experiment and rented a virtual server from the hosting provider\n\n we thought was compromised, with the intention of using it as a honeypot.\n\n To ensure that the system couldn’t be compromised in any other way, we\n\n logged into the server using SSH only once, using the provided root password\n\n and a trusted SSH client. We did not change the password, as we suspected\n\n Ebury operators may use this credential to log into the system. The server\n\n was not running any other services except for OpenSSH. We monitored the\n\n system, and seven days later, Ebury version 1.8.2 was installed on our server.\n\n There were no traces of the compromise in the system logs. When Ebury\n\n operators successfully connect to a system using credentials, they remove\n\n log entries that show the creation of a new session from their IP address.\n\n Logs created by systemd’s journald are trickier to tamper with because of\n\n its binary storage format and Forward Secure Sealing (FSS), if enabled. The\n\n\n###### currently active journal file was simply deleted. The only traces we could\n\n find in our honeypot (without FSS) are shown in Figure 8.\n\n Figure 8. Only logs remaining from the visit to install Ebury (redacted)\n\n After Ebury was installed, the operators connected daily using the Ebury\n\n backdoor to collect stolen credentials and install additional malware to\n\n attempt monetization.\n\n A total of 70,000 servers from that hosting provider were compromised\n\n with Ebury in 2023.\n\n The Linux Foundation’s kernel.org\n\n In our 2014 paper, we mentioned that there was evidence that kernel.org,\n\n hosting the source code of the Linux kernel, had been a victim of Ebury.\n\n Data now at our disposal reveals additional details about the incident.\n\n Ebury had been installed on at least four servers belonging to the Linux\n\n Foundation between 2009 and 2011. It seems these servers acted as mail\n\n servers, name servers, mirrors, and source code repositories at the time of\n\n the compromise. We cannot tell for sure when Ebury was removed from\n\n each of the servers, but since it was discovered in 2011 it is likely that two of\n\n the servers were compromised for as long as two years, one for one year\n\n and the other for six months.\n\n The perpetrator also had copies of the /etc/shadow files, which overall\n\n contained 551 unique username and hashed password pairs. The cleartext\n\n\n###### passwords for 275 of those users (50%) are in possession of the attackers.\n\n We believe that the cleartext passwords were obtained by using the\n\n installed Ebury credential stealer, and by brute force.\n\n C&C infrastructure of other malware families\n\n In our 2018 publication, The Dark Side of the ForSSHe, we mention a\n\n reconnaissance Perl script used by Ebury uoperators to detect other OpenSSH\n\n credential stealers, and collect credentials from them. In some cases, efforts\n\n by the Ebury gang were put into reverse engineering the competitors’\n\n malware to decrypt already stolen credentials left on disk. We were surprised\n\n to see that it didn’t stop there: infrastructure used by the other perpetrators\n\n was also compromised with Ebury. To our knowledge, it is the first public\n\n example of a criminal actor doing fourth-party collection at scale.\n\n An example is the compromise of servers responsible for collecting data\n\n from Vidar Stealer. As discussed in the Attribution section, Ebury actors\n\n used the stolen identities obtained through Vidar Stealer for renting server\n\n infrastructure and in their activities, sending law enforcement bodies in the\n\n wrong directions.\n\n They use knowledge they gain about other criminal groups to blur\n\n attribution based on indicators, too. A competing server-side web skimmer\n\n related to SmallCuteCat used pbarsec[.]ru as an exfiltration server, and\n\n the Ebury gang registered and used pbarsec[.]com for similar purposes.\n\n We also found that one of the Mirai botnet author’s systems was\n\n compromised with Ebury, and source code was stolen by the gang long\n\n before it was made public.\n\n There are more examples, to the point where when looking at seized data\n\n owned by the Ebury gang, it’s difficult to draw a line between what was\n\n gained from their activities versus what they stole from other criminal groups.\n\n\n-----\n\n###### WHITEPAPER | 15\n\n\n# An Update  to Ebury\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 16\n#### An update to Ebury\n\n\n###### Ebury is the malware family at the core of all the\n\n operations described in Operation Windigo and\n\n this paper. Acting as a backdoor inside the OpenSSH\n\n daemon and as a powerful credential stealer, it\n\n provides the attackers the access they need to\n\n deploy other malware (such as HelimodSteal and\n\n HelimodRedirect), and expand their network of\n\n compromised hosts.\n\n Ebury basics\n\n Ebury has been thoroughly described in three articles\n\n published on our WeLiveSecurity blog. The first two\n\n articles were published in 2014 and the third one in 2017.\n\n All Ebury samples contain a version number, which\n\n can be queried remotely by using the Xver backdoor\n\n command. The versions that the previously published\n\n articles describe are 1.3.4, 1.3.5, and 1.6.2, respectively. At\n\n the time of publication of this paper, the latest version\n\n that we have analyzed is 1.8.2. Let’s look at the timeline\n\n of when each version was first seen in the wild –\n\n Figure 9 – and the changes since our last publication.\n\n\n###### Each new major version introduces some important\n\n change to Ebury and new features and obfuscation\n\n techniques. For example, in version 1.8 the samples\n\n don’t have a section header table (SHT). While not\n\n required by the Linux loader, its removal is clearly done\n\n to make analysis harder by not exposing sections.\n\n Ebury is activated remotely by sending a carefully\n\n crafted SSH client version string to the compromised\n\n SSH server. This version string is the very first sequence\n\n of bytes sent by an SSH client when connecting to a\n\n remote server, so is sent in the clear, as an encrypted\n\n channel has not been established yet. A typical version\n\n string looks like this:\n\n\n###### The Ebury-supporting SSH client used by the operators\n\n replaces the last field with a string that is decoded\n\n and decrypted by the Ebury malware. Encrypted data\n\n is encoded using base64 since Ebury version 1.7, and\n\n hexadecimal encoding in previous versions. Version\n\n 1.8 also ignores spaces in the encoded data. Here are\n\n examples of the SSH client version string used to\n\n trigger the Ebury malicious backdoor:\n\n\n###### The data encoded in the client software version is\n\n encrypted using a custom cipher and uses the source IP\n\n address of the TCP connection as the key, which would\n\n be the origin of the backdoor usage as seen on the\n\n compromised server. It contains:\n\n 1. A fixed-length password. Earlier versions use an 11-character password, which grew to 15 characters in version 1.8. The Ebury samples contain a SHA-1 hash of that password (or 32,768 SHA-1 iterations in the case of version 1.8). The operators keep track of which sample is installed on each compromised server so they can use the right password to log in.\n\n 2. An optional command. The command is not a system command but is interpreted by Ebury to control its behavior. If no command is given, regular\n\n```\nSSH-2.0-b479ec723a2ba590d6c4a0bf40f4ba\n\n```\n```\nSSH-2.0-XDbxdCP/G9Dcd1qDCE+t\n\n```\n```\nSSH-2.0-FcZpUkMuIY 2MfBBDvOJdFBTFUw==\n\n```\n\n###### authentication is simply bypassed and authorized keys are replaced with Ebury-owned keys.\n\n 3. An optional argument. Some commands allow an argument to be passed to configure Ebury.\n\n Table 1 shows the list of commands that can be\n\n leveraged to control Ebury.\n\n Using the Ebury backdoor also requires a private SSH\n\n key: no channel can be opened until key authentication\n\n is completed with the Ebury-owned keys.\n\n Command Description\n\n Print Ebury version and exit\n```\n Xver\n\n Print stolen credentials (lightly encrypted)\n Xcat\n\n Bind the OpenSSH server listening\n Xbnd socket to another address\n\n Set or remove an additional 4 bytes\n Xpsw key to Ebury password\n\n Start a shell as root\n Xxsh\n\n Like Xcat, but also open a shell instead\n Xcsh of quitting\n\n Set the libcurl hooking exfiltration server\n Xcrl\n\n Like Xcrl, but also open a shell instead\n Xcls of quitting\n\n Table 1. List of Ebury-specific commands\n\n```\n```\nSSH-2.0-OpenSSH_9.4\n\n```\n\n###### The three hyphen-separated fields are, respectively:\n • [SSH][, always, to identify the protocol.]\n\n • [SSH protocol version, typically 2.0, adopted in 2006.]\n\n • [A string to identify the client program. Here ] OpenSSH version 9.4.\n\n\n###### 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024\n\n\n###### 1.8.2 2024-01\n 1.4 1.5 1.6 1.7 1.8\n\n 2014-02 2014-06 2017-02 2019-05 2023-11\n\n Figure 9. Month each major Ebury version was first seen since the publication of Operation Windigo\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|\n|---|---|---|---|---|---|---|---|---|---|---|\n||||||||||||\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 17\n\n\n###### Persistence\n\n There are many ways in which Ebury can persist on disk. Apart from\n\n rare exceptions (see the Replaced OpenSSH executables section), the Ebury\n\n payload is present in a shared library. The library hijacked to trigger the\n\n execution of Ebury is libkeyutils.so.1. This library is a dependency of\n```\nlibkrb5.so that allows Kerberos authentication and is loaded by both the\n\n OpenSSH client and server when launched. There are many techniques\n\n used to tamper with libkeyutils.so.1.\n\n Replaced keyutils shared library\n\n The current and most popular way is dropping a malicious libkeyutils.\nso file next to the legitime one and modifying the symbolic link to point\n\n to the malicious one. It contains both the legitimate functionalities of\nkeyutils and the Ebury payload. Figure 10 shows a file listing from\n\n a compromised server. Its libkeyutils.so.1 symbolic link has been\n\n modified to point to a malicious version, which is postfixed with .2. Notice\n\n the file size is much bigger to allow space for the Ebury malware. Be aware\n\n that if the shell you are using to list the file is injected with the Ebury\n\n userland rootkit, the malicious file and symbolic link won’t be shown, and\n\n everything will appear normal. See the Userland rootkit section for details\n\n about the rootkit’s functionalities.\n\n Figure 10. File listing showing the malicious libkeyutils.so with the Ebury v1.8.2 payload\n\n Sharp eyes may have noticed the setuid bit is set on the malicious\nlibkeyutils.so file in Figure 10. Since this is a shared library, and the\n\n executable flag isn’t set, this setuid flag shouldn’t have any effect and just\n\n```\n\n###### make the file more suspicious. This flag is used by Ebury’s userland rootkit\n\n to identify the malicious file when stat is called.\n\n Side library\n\n Another popular method we’ve seen in the past few years is a very lightly\n\n modified libkeyutils.so that loads the Ebury payload from another file.\n\n The only change to the legitimate libkeyutils is an initialization function\n\n that uses dlopen to load an additional shared library. Figure 11 shows the\n\n only added code.\n\n Figure 11. Hex-Rays decompilation of constructor function calling dlopen(“libkeyctl.so”, …) to load Ebury\n\n We have seen three variants using the following legitimate-looking\n\n filenames to hide the Ebury payload:\n • [libkeystats.so]\n • [libkeyctl.so]\n\n • [librwctl.so]\n\n The malicious .so file contains the Ebury initialization function, which is\n\n executed when dlopen is called.\n\n\n###### This technique was probably used to evade the IoCs suggesting to check\n\n the size of the libkeyutils.so.1 file. The size of added code in this case is\n\n negligible to the total file size of the legitimate libkeyutils.so.1 library,\n\n and all the Ebury code is in another file.\n\n Other methods\n\n We have talked about other techniques before in our last Ebury blogpost,\n\n from 2017. They might still be used so let’s summarize them here for\n\n completeness.\n\n Adding a DT_NEEDED entry\n\n This is used to load Ebury from an external shared library. A DT_NEEDED\n\n entry is added to the dynamic section of libkeyutils.so, which points\n\n to the malicious .so file. When the modified library is loaded, the linker\n\n resolves the dependency and loads the malicious library, while the file size\n\n of the legitimate library remains unchanged.\n\n Overridden in tls directory\n\n Adding a libkeyutils.so.1 in the tls subdirectory will override the\n\n legitimate one. The loader will use this file instead on systems with Thread\n\n Local Storage support (pretty much all systems).\n\n Self-signed RPM\n\n On RPM-based systems, we also saw self-signed keyutils-libs RPM\n\n packages installed on the compromised system.\n\n Replaced OpenSSH executables\n\n Although we haven’t seen this technique being used recently, another\n\n method is to replace the original OpenSSH client and server binaries with\n\n backdoored versions. As far as we know, this method is the only way Ebury\n\n can be installed on non-Linux systems.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 18\n\n\n###### IPC mechanisms\n\n Ebury keeps its state information, configuration, and\n\n stolen credentials in memory only. In versions prior to\n\n 1.5, Ebury used a fixed size shared memory segment\n\n to store this information. In more recent versions,\n\n Ebury spawns a new process when it is first loaded.\n\n This process creates an abstract UNIX socket and\n\n listens on it. Ebury uses that socket to communicate\n\n stolen credentials, and set and get configurable\n\n variables such as the exfiltration server IP address.\n\n Abstract UNIX sockets work like regular UNIX sockets,\n\n except they do not create a file on the filesystem. lsof\n\n and procfs’ /proc/net/unix display abstract sockets\n\n with an at sign (@) prepended to their socket addresses.\n\n Ebury uses socket addresses like popular Linux services\n\n such as /run/systemd/log-wuO3nuFBHN or /tmp/\n```\ndbus-ZP7tFO4xsL. The process that hosts the listening\n\n socket also looks legitimate, because it uses the\n\n executable of a real service present on the system.\n\n However, they are started with the Ebury library\n\n injected using LD_PRELOAD. When the library is loaded,\n\n execution flow is hijacked to serve the Ebury service\n\n instead.\n\n A list of known socket addresses and host process\n\n executable paths used by Ebury can be found in the\n\n Remediation subsections.\n\n Figure 12 shows the flow taken by the SSH credentials,\n\n```\n\n###### from the victim using a compromised client to the\n\n Ebury operators.\n\n 1. The unsuspecting victim uses the SSH client compromised with Ebury and types the server host, TCP port, username, and gives its authentication credentials, such as a password, a key, or a key and a passphrase.\n\n 2. All the information is communicated via the UNIX socket to the “Ebury process”, a process created when Ebury is first loaded.\n\n 3. Later, the Ebury operators connect to the Ebury- compromised OpenSSH server and issue an Xcat command. Ebury connects to the Ebury process’s UNIX socket and fetches the credentials, which are encrypted and sent back to the attackers. The credentials are erased from memory at this point.\n\n 4. If, for whatever reason, the credentials aren’t collected for two weeks, Ebury encrypts the credentials using a public key and sends them via UDP to an exfiltration server. That server’s IP address is decrypted from the DNS TXT record of an algorithmically generated domain.\n\n The underlying communication in the UNIX socket is a\n\n custom binary protocol. Table 2 shows a summary of\n\n the commands understood by the Ebury service.\n\n\n###### 0x03 Set configuration value.\n\n 0x04 Get configuration value.\n\n\n###### Figure 12. Flow of stolen credentials, from the victim using an Ebury-compromised SSH client to the Ebury process, and later fetched by the operators\n\n First byte Description Next byte value value\n\n 0x01 Add credentials.\n\n 0x02 Get list of stolen credentials.\n\n 0x01 Exfiltration server.\n\n\n###### Additional password for using the Ebury backdoor 0x02 (no longer used).\n\n 0x03 Flags.\n\n 0x04 Server for libcurl hook exfiltration.\n\n 0x05 “Ebury process” info (such as its PID).\n\n\n###### Table 2. Summary of the binary protocol of the Ebury service, as of v1.8.0\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 19\n\n\n###### libcurl hooking for HTTP request exfiltration\n\n A feature that was added in version 1.7 is a way to\n\n exfiltrate HTTP POST requests made by applications\n\n using libcurl. This is done by hooking functions into\n\n libcurl and performing an additional HTTP POST\n\n request to an external server set by the attackers\n\n whenever curl_easy_perform is used. Figure 13\n\n shows that additional request performed in the hook.\n\n The only configurable element is the domain name or\n\n IP address to which the information is exfiltrated. By\n\n default, Ebury does not contain an exfiltration server,\n\n so this feature is disabled until the operator sets the\n\n value. No filtering is done, meaning that all HTTP POST\n\n requests are exfiltrated.\n\n This feature is controlled by the Xcrl command, which\n\n enables the operators to set the exfiltration server\n\n to which the data is sent via HTTP POST requests.\n\n A POST request is sent to that server’s /xpost.php\n\n resource over HTTPS. Thus, the final URL looks like\n```\nhttps://<exfiltration-server>/xpost.php.\n\n We have seen one domain name used to exfiltrate\n\n the data – www.pbarsec[.]com – which is served by\n\n Cloudflare.\n\n The code was borrowed from FrizzySteal, described\n\n below. The same obfuscation techniques, function\n\n hooking, and even exfiltration server are shared\n\n between the two malware families.\n\n```\n\n###### As discussed in the Monetization section, we think this feature is used as\n\n a server-side web skimmer, to steal credit card details from transactional\n\n websites. This hook in libcurl is called when the web application queries the\n\n payment processor API to validate and perform the transaction using the\n\n details typed by the victim.\n```\nlibkeyutils.so is a dependency of libcurl, so the injection of the malicious\n\n code is possible just like with OpenSSH executables.\n\n Figure 13. curl_easy_perform hooked by Ebury to exfiltrate HTTP POST data, decompiled with the Hex-Rays Decompiler\n\n```\n\n###### Userland rootkit\n\n Over the years, more and more functionalities were added to Ebury to make it more and\n\n more difficult to realize, from a system administrator perspective, that a server has been\n\n compromised. Since version 1.6, Ebury is injected in all shells spawned when connected via\n\n the compromised OpenSSH server. Figure 14 shows processes where Ebury is injected, and its\n\n purposes in those processes.\n\n\n###### Sub processes (ls, lsof, ...)\n\n Hide Ebury and its resources\n\n\n\n###### - Keep state, such as stolen credentials and configuration\n\n|Col1|OpenSSH server (sshd) Enable Ebury backdoor Shell ( Hide E OpenSSH client (ssh) Steal credentials Ebury process (/sbin/rsyslogd or else) - Create abstract UNIX socket - Keep state, such as stolen credentials an - Exfiltrate credentials via DNS Software using libcurl (php-fpm, ...)|\n|---|---|\n|||\n|||\n\n\n###### Exfiltrate HTTP POST requests\n\n\n###### Figure 14. Processes where Ebury is injected\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 20\n\n\n###### As you can see, all subprocesses spawned by the OpenSSH server are\n\n injected with Ebury. This method allows the malware to lie to the user\n\n about the presence of certain resources related to Ebury. To inject into\n\n subprocesses, Ebury hooks the following functions from libc:\n • [system]\n\n • [popen]\n\n • [execve][, ][execvpe][, ][execv][, ][execvp][, and ][execl]\n\n In all cases, the LD_PRELOAD environment variable is injected, either by\n\n temporarily modifying the environ global variable or by changing the\n\n parameter to the function.\n\n Here are the traces of Ebury an admin could be looking for when inspecting\n\n a running server:\n • [the modified ][libkeyutils.so][ shared library on the file system,]\n\n • [the Ebury process,]\n\n • [the abstract UNIX socket created by the Ebury process, and]\n\n • [the presence of the malicious ][libkeyutils.so][ in the memory mapped ] by processes injected with Ebury.\n\n All of those are difficult to reveal when using a compromised shell.\n\n File and symbolic link\n\n The malicious shared library with Ebury, whether it’s libkeyutils.so.1 or\n\n another (see Persistence), as well as the modified symbolic link, are hidden\n\n from the user. System functions such as readdir are hooked to prevent\n\n tools from seeing the malicious file in the library directory. Additionally,\n```\nrealpath and readlink (and its variants readlinkat, freadlink, etc.)\n\n are hooked so that the libkeyutils.so.1 symbolic link will appear to be\n\n```\n\n###### pointing to the legitimate file. stat, open, and all their variants (xstat,\n```\nlxstat, statx, fopen, etc.) are also hooked to make it appear that the\n\n malicious file doesn’t exist, and that the system only has the legitimate\nlibkeyutils.so file.\n\n Figure 15 shows file listings with ls -l under a shell compromised with\n\n the Ebury rootkit, and under a trusted shell where the Ebury rootkit isn’t\n\n activated.\n\n Figure 15. File listing with (above), and without (below), the Ebury userland rootkit activated\n\n Process\n\n We mentioned that Ebury’s state is kept in memory, in a process we call the\n\n “Ebury process”. This persistent process is hidden from the list of running\n\n processes when listing processes with tools such as ps: readdir and\nreaddir64 are hooked to remove the process from /proc, which is how ps\n\n and other tools list running processes.\n\n Figure 16 shows the difference when running ps under a trusted shell and\n\n one compromised by Ebury. It is presented in the unified format (diff -u),\n\n meaning that lines prefixed with +, in green, are shown only when the shell\n\n is safe from Ebury. Inversely, lines starting with -, in red (if there were any,\n\n but in this case there are none), are shown when the shell is compromised\n\n by Ebury, but not from a trusted shell.\n\n```\n\n###### Figure 16. Difference between ps auxw being executed under a trusted and a compromised shell\n\n It’s worth noting that /proc/$PID_OF_EBURY_PROCESS/ is still accessible:\n\n Ebury actually uses /proc/$PID_OF_EBURY_PROCESS/fd/3 to get the inode\n\n of the UNIX socket it creates.\n\n UNIX socket\n\n The easiest way to list UNIX sockets on a Linux system is using procfs’\n```\n/proc/net/unix. Some tools such as lsof use this file to get the list. The\n\n way Ebury hides the socket from the list is by hooking open and fopen\n\n and returning a file descriptor to a temporary file instead. This temporary\n\n file holds the same content as the original file, with all lines that contain\n\n the Ebury-created UNIX socket removed. Figure 17 shows that the Ebury\n created UNIX socket is visible in /proc/net/unix when read from a trusted\n\n shell, but invisible when read from a compromised shell.\n\n Figure 17. Difference between /proc/net/unix seen under a program compromised with Ebury and one that is not\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 21\n\n\n###### replaced from the original lines. Figure 19 shows the differences when looking at the maps file to\n\n try to find the injected library.\n\n Figure 19. Differences in OpenSSH server and Bash maps files when under the Ebury userland rootkit\n\n\n###### Figure 18. recvmsg as hooked by Ebury, decompiled with the Hex-Rays Decompiler\n\n\n###### In the same way, Ebury tampers all /proc/<pid>/net/\n```\nunix files, which have the same format as /proc/net/\nunix but contain sockets opened by the process.\n\n There is another way UNIX sockets can be listed, and\n\n that is by sending a NETLINK_SOCK_DIAG message\n\n over a socket using the SOCK_DIAG_BY_FAMILY\n\n protocol. This is how ss first tries to enumerate\n\n sockets and falls back to using procfs if it fails. Hiding\n\n the UNIX socket listed that way is a bit more complex.\n\n To understand how to use NETLINK_SOCK_DIAG, we\n\n can refer to the sock_diag(7) manual page. Figure 18\n\n shows the hook to the recvmsg function, where Ebury\n\n looks for the reply to a NETLINK_SOCK_DIAG request.\n\n If any one of the sockets listed has the name of the\n\n UNIX socket created by Ebury, it is removed from the\n\n buffer.\n\n Mapped memory\n\n How about looking at the memory mapped into\n\n processes to find some trace of the userland rootkit?\n\n Well, this might not work either as Ebury carefully\n\n hides itself from /proc/<pid>/maps and\n/proc/<pid>/task/<tid>/maps, in a similar way that\n\n its UNIX socket is hidden. The fopen hook also handles\n\n the maps file. It removes lines with references to the\n\n malicious shared library and adds lines referencing\n\n the legitimate libkeyutils.so if the process should\n\n normally require it. Both the path and inode are\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 22\n\n\n###### Typical post-exploitation usage\n\n Starting in early 2024, we have been monitoring a server newly\n\n compromised with Ebury to see how the operator would interact with it.\n\n This revealed that once a system is compromised, the operators connect\n\n back regularly and use the Xcat command to exfiltrate any credentials\n\n captured since they last connected. On a less regular basis, a script is\n\n used to search for and fetch any new SSH private keys, updates to the\n```\nknown_hosts files, a list of running services, etc. This is all via automated\n\n processes.\n\n The libcurl hooking functionality was also enabled one week after the\n\n server was compromised by setting an exfiltration server. It was disabled\n\n after three weeks.\n\n Figure 20 shows a timeline of 57 connections over the course of a month.\n\n There are a number of proxies used between the Ebury controller and\n\n the compromised servers. Those proxies are a mix of Ebury-compromised\n\n servers and infrastructure rented by the perpetrators. The bottom line is\n\n that the servers having IP addresses seen controlling Ebury don’t have the\n\n controlling software, but are just proxies. They are, however, usually used\n\n for a long period of time. See the Network IoCs section for a list of recently\n\n used IP addresses.\n\n```\n\n###### This honeypot did not run services other than SSH, so there was no obvious\n\n way to monetize it and no other malware was deployed.\n\n Credential exfiltration\n\n There are two ways that the stolen SSH credentials can be exfiltrated from\n\n the compromised server:\n\n 1. Fetched by the operator using the Xcat command.\n\n 2. Sent to an exfiltration server using a specially crafted UDP packet that looks like a DNS request.\n\n Ebury does not include a hardcoded exfiltration server address. It can be\n\n set by the operators using an argument to the Xver or Xcat command (see\n\n Ebury basics).\n\n If the operators have not reached out to the server for two weeks (no\n```\nXcat command), Ebury uses an algorithm to generate domain names and\n\n then uses them to find out where to send the credentials. Credentials are\n\n then sent via UDP. This enables Ebury operators to regain access if, for\n\n example, the server’s IP address changes. This fallback mechanism uses\n\n the DNS TXT record of the generated domain. The record is decrypted\n\n using a public RSA key hardcoded in the Ebury sample. The decrypted data\n\n contains the IP address of the exfiltration server and an expiry timestamp.\n\n```\n\n###### Records are usually set to last for about three months, after which they are\n\n rotated. This mechanism has already been well documented in previous\n\n publications. Here are the first three domains of the latest (sixth) iteration\n\n of the DGA:\n\n 1. qimpj6kkofzf[.]biz\n\n 2. 4wsrsznmdb[.]biz\n\n 3. kezt2tqpy5ug[.]info\n\n The first domain was registered by the perpetrators in September 2023. As\n\n of May 2024, the domain contained a valid TXT record that, once decrypted,\n\n points the exfiltration server to 185.145.245[.]167.\n```\nqimpj6kkofzf[.]biz. 1800 IN TXT “IIjjfXI2BxYkou85HeMHH4LA5E\nCW4IzYWjGOkMLF5yrjvpUqE+P6oOR70amiHxKM6RLoYsp36yDX6tnc7tUP\ncl9OdbObMtVLpAx36KmvrsvqioVb2xitDsBHp/m2m8x8Vn6v5LFh0oZ20mE\n\n```\n```\nDobcyb7Tvg+f5E5q1lFbzC3Oz7ek=”\n\n```\n```\nDecrypted: qimpj6kkofzf[.]biz:3113350567:1725148800\nExfiltration IP address: 185.145.245[.]167\n\n```\n```\nExpiration: 2024-09-01 00:00:00 UTC\n\n```\n\n###### Day\n\n\n###### 0 7 14 21 28\n\n Credential exfiltration ( ) Credential exfiltration and gather system information ( ) Spawn shell (no Ebury command specified)\n```\n            Xcat Xcsh\n\n Set HTTP POST exfiltration server ( ) Unset HTTP POST exfiltration server ( )\n                  Xcrl <hostname> Xcrl\n\n```\n\n###### Figure 20. Timeline of usage of Ebury over a one-month span\n\n\n-----\n\n###### WHITEPAPER | 23\n\n\n# Monetization: Multiple New Components\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 24\n\n#### Monetization: \n\n###### HTTP POST HTTP server exfiltration server\n\n HelimodProxy\n proxies spam campaigns\n\n#### Multiple New Components\n\n\n###### Victim Ebury operators\n KernelRedirect\n\n is redirected to advertisement\n HTTP server\n\n HelimodRedirect\n\n Credit card details HTTP server\n Credit card details libcurl (php, …)\n Payment\n FrizzySteal\n processor\n intercepts credit\n or Ebury card details\n\n SSH credentials\n arpspoof, iptables\n\n performs ARP spoofing\n Bitcoin node\n Wallet\n\n Figure 21. Multiple malware families deployed on Ebury-infested servers and the impact for potential victims\n\n\n###### Recent activities have shown that their tactics have changed, and a\n\n plethora of new tools were discovered from kernel modules to Perl\n\n scripts. Those tools have the common goal of monetizing, through\n\n various methods, the servers they compromise. The way servers are\n\n monetized range from credit card information theft and cryptocurrency\n\n stealing to traffic redirection, spam sending, and credential stealing.\n\n The new malware families used by the group includes:\n • [A set of Apache modules used for different purposes such as ] proxying raw traffic, exfiltrating sensitive information from HTTP requests, and redirecting visitors to an attacker-controlled website.\n\n • [A kernel module that modifies HTTP traffic to perform redirection.]\n\n • [Tools to hide and allow malicious traffic through the firewall.]\n\n • [Scripts used to carry out AitM within hosting providers’ data ] centers, aiming to compromise specific targets.\n\n Figure 21 depicts the various strategies employed by the operation to\n\n monetize the servers compromised by Ebury, along with the resulting\n\n consequences for internet users who browse websites hosted on\n\n compromised servers or engage in online server management.\n\n\n###### Malicious Apache and nginx modules\n\n One of the activities documented in Operation Windigo involved the\n\n redirection of web traffic by compromised servers. Ebury’s operators\n\n installed malware, known as Cdorked, on web servers. This malware\n\n was designed to redirect a limited number of visitor requests to\n\n advertisements, generating profit for the attackers. Cdorked was\n\n installed by replacing the HTTP server executables with patched\n\n versions. We observed incidents where Apache, nginx, or Lighthttpd\n\n were replaced with the Cdorked payload. Activities related to Cdorked\n\n stopped around August 2015.\n\n Recent observations indicate a shift in tactics, as the attackers\n\n have ceased patching the HTTP server binaries. Instead, they have\n\n employed a combination of Apache and nginx modules for various\n\n objectives, including the proxying of raw traffic, exfiltration of sensitive\n\n information from HTTP requests, and the redirection of visitors to\n\n websites under the control of the attackers. Table 3 summarizes the list\n\n of modules we attribute to Ebury.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 25\n\n\n###### Known compromised Name Purpose First seen nginx module name Apache module\n\n HelimodProxy Proxy traffic to send spam. 2021 N/A\n```\n                                         mod_dir.so\n\n```\n\n###### Redirect HTTP request \n```\n                                         mod_dir.so HelimodRedirect 2022 to advertisement.\n                                         mod_auth_basic.so\n                                         mod_authn_file.so\n\n```\n```\nngx_http_redir_module\n\n```\n\n###### Exfiltrate HTTP POST  Unknown, but variant exists\n```\n                                         mod_authz_host.so HelimodSteal 2019 request mode to the server. according to internet scan.\n                                         mod_authz_user.so\n\n```\n```\nmod_env.so\n\n```\n\n###### Table 3. HTTP server modules\n\n Upon deployment on a compromised server, the malicious Apache modules\n\n do not function as new modules; rather, they replace existing legitimate\n\n modules with trojanized versions. While mod_dir.so is the most commonly\n\n targeted module for modification, other legitimate modules have also been\n\n observed to be trojanized, as outlined in Table 3. Despite the addition of\n\n hooks to enable malicious functionalities, the trojanized modules retain\n\n their original legitimate behavior. We have not encountered any servers\n\n with more than one variant of the malicious Helimod payload (Proxy,\n\n Redirect, or Steal) simultaneously.\n\n Unlike Apache, malicious modules for nginx are standalone and\n\n do not contain legitimate code. We have seen only one sample of\n\n HelimodRedirect for nginx. We have, however, seen nginx servers running\n\n HelimodRedirect and HelimodSteal during our internet scanning, using a\n\n fingerprint based on a specially crafted request (see Finding compromised\n\n servers using the management URL). We believe that a HelimodProxy module\n\n does not exist for nginx.\n\n\n###### Overview of changes to Apache modules\n\n Apache modules are shared libraries that export a symbol pointing to a\n\n structure that describes the module and that contains callbacks. The content\n\n of this structure, as shown in Figure 22, includes information such as the\n\n version of Apache this module is compatible with, the source filename, and\n\n the defined callbacks responsible for executing the module’s tasks.\n\n Figure 22. Module information exported by mod_dir.so as seen in IDA Pro with the proper structure definition\n\n There are commonalities between the three malicious Apache modules,\n\n even if their purpose is different. The authors added code in the\n\n```\nregister_hooks callback. It allows registering hook functions in the\n\n###### request handler, which allows executing an action when a request arrives.\n\n Hooks are added, while preserving the legitimate behavior. Figure 23 shows\n\n the HelimodProxy’s register_hooks function. The legitimate mod_dir\n\n module only registers the last function, dir_fixups; all the others were\n\n added by the authors of HelimodProxy.\n\n Figure 23. Hex-Rays Decompiler output for HelimodProxy’s register_hooks\n\n First, we examine the payload from the three modules, followed by an\n\n exploration of their shared functionalities.\n\n HelimodProxy\n\n In early 2021, a victim of HelimodProxy reached out to ESET researchers\n\n about a compromised server used to relay spam. They found both\n\n HelimodProxy and Ebury in their infrastructure, but not on the same servers.\n\n HelimodProxy, which is present on disk as mod_dir.so, is a modified version\n\n of the genuine mod_dir Apache module. The malicious module keeps\n\n the legitimate functionalities working, while the evil part permits running\n\n arbitrary commands and using the web server to proxy raw TCP traffic.\n\n As noted above, we believe this proxying functionality is used to relay spam.\n\n The typical scenario works like this: a system first makes an HTTP request\n\n to a specific URL (refer to the Management URL section for details). Following\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 26\n\n\n###### this, the source IP address of the request is added to a list stored in memory.\n\n Subsequent TCP connections made from the same IP address are redirected\n\n into a subprocess initiated from /usr/lib64/pmtad. Figure 24 illustrates the\n\n function responsible for starting the subprocess and redirecting the socket\n\n into its standard input using dup2. Note that at this point, Apache no longer\n\n serves HTTP responses for that particular IP address.\n\n Figure 24. Hex-Rays Decompiler output of the Apache connection hook function of HelimodProxy\n\n Interestingly, argv[0] is being set to /usr/sbin/pmtad, rather than \n```\n/usr/lib64/pmtad. The latter is the path of the daemon for PowerMTA,\n\n legitimate email sending software. This suggests that the servers targeted\n\n by HelimodProxy are running PowerMTA for delivering emails, and\n\n HelimodProxy attempts to conceal its malicious process by blending in with\n\n existing processes. We were able to corroborate this hypothesis on some of\n\n the victimized servers. Using an existing mail server is also a great way to\n\n improve the probability of spam reaching its destination.\n\n```\n\n###### Now, what is this other pmtad executable in /usr/lib64? Its analysis\n\n revealed a modified version of 3proxy, open-source proxy software. This\n\n software enables the operators to use the compromised server as an open\n\n proxy to relay various types of traffic. In practice, it was primarily exploited\n\n to send spam from the IP addresses assigned to the compromised servers.\n\n Additionally, HelimodProxy provides operators with the capability to\n\n execute arbitrary commands. These commands are XOR encrypted, hex\n\n encoded, and appended to the management URL. This functionality was\n\n utilized, for instance, to run the ip addr command, which lists IP addresses\n\n assigned to the server, enabling the operators to identify suitable addresses\n\n for proxying traffic. It is possible that this functionality was also employed\n\n to deploy or update the auxiliary pmtad executable.\n\n HelimodRedirect\n\n HelimodRedirect registers an output filter to redirect unsuspecting\n\n visitors to another website. A small percentage of traffic is redirected by\n\n responding with a 302 status code and adding a Location in the reply\n\n headers. Figure 25 shows how HelimodRedirect adds the domain and the\n\n resource of the original request as parameters (respectively DOM and URI)\n\n to the redirection target. This allows redirecting the visitor back to the\n\n legitimate website after the redirection is done if the Ebury gang doesn’t\n\n consider that visitor to be interesting.\n\n Figure 25. Hex-Rays Decompiler output of Apache output filter of HelimodRedirect\n\n\n###### There are several conditions to be met before a redirection can happen. The\n\n goal is to avoid suspicion and make it difficult to reproduce the redirection.\n\n Here are the conditions that must be met for a redirection to occur:\n • [Request is made on port 80 or 443, the default ports for HTTP and ] HTTPS. Web management interfaces sometimes run on other ports; HelimodRedirect avoids redirecting system administrators this way.\n\n • [Request method is ][GET][.]\n\n • [Requested file extension is ][.html][ or ][.php][. This is configurable but we ] never saw it changed in practice.\n\n • [Request has an ][Accept-Language][ header and its value isn’t part ] of a deny list. The module can avoid specific locales, based on its configuration. The default deny list contains Russian and Ukrainian locales only.\n\n • [Request has a ][User-Agent][ header, and it looks like a web browser and ] not a crawler.\n\n • [Source IP address has not been redirected recently. “Recently” here ] is variable and depends on the amount of traffic the server receives, because the source IP address will be removed from the list once it’s overwritten by another IP address (see the Weird storage of IP address list section).\n\n\n\n###### • [Source IP address was not used to log in to the server recently via SSH ] (using /var/log/wtmp).\n\n If all conditions are met, then there’s a chance that the redirection is\n\n performed. The default value is to redirect 10% of the traffic, so 1 chance\n\n out of 10.\n\n The target of the redirection seems to have been advertisement and\n\n affiliate programs such as gambling sites.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 27\n\n\n###### HelimodSteal\n\n This is perhaps the most damaging malware in this trio. HelimodSteal\n\n intercepts all HTTP requests made to the web server and adds an input filter\n\n for requests using the POST method. This is generally the HTTP method\n\n used when submitting forms from a website, such as login and payment\n\n forms. Figure 26 shows an HTTP request made to http://checklicence[.]\n```\nnet/licence.php, an exfiltration server used by the perpetrators. The body\n\n of the request contains potentially sensitive data that was sent with the\n\n original request. The request is otherwise handled normally.\n\n Figure 26. Hex-Rays Decompiler output of HelimodSteal input filter, exfiltrating data using an HTTP request\n\n```\n\n###### It is important to note that end-to-end encryption (HTTPS) does not\n\n provide protection for the sensitive data in this case. This is because\n\n HelimodSteal resides on the web server, allowing it access to the decrypted\n\n request after it has been processed by the web server.\n\n Shared functionalities\n\n Management URL\n\n Malicious HTTP server modules in the Helimod family are controlled\n\n via an HTTP request to a resource that changes based on the current\n\n date and time. The resource is prefixed by /sip (configurable in newer\n\n versions) and then contains the MD5 hash of a formatted string. This\n\n hashed string contains the word secret and digits based on the current\n\n date and time. Older versions use an algorithm that changes the URL\n\n approximately every 4.5 hours, while newer versions change the URL\n\n every hour. These are displayed in Figure 27 and Figure 28. For example,\n\n the resulting management URL for the latest version of the algorithm\n\n on March 18th, 2014 at 13:37 is http://<compromised-server>/\n```\nsipa7d9badccf81e9b9832bbe3db6aa677c, where a7d9…677c is the MD5\n\n hash of secret:2014:03:18:13, terminating with a new line.\n\n Figure 27. Generation of the resource path used to control HelimodProxy (earlier version)\n\n```\n\n###### Figure 28. Generation of the resource path used to control the Helimod malware family (latest version)\n\n Finding compromised servers using the management URL\n\n Using the algorithms to generate the resource path, we have scanned the\n\n internet to find potential compromised servers. First in 2021, using the first\n\n algorithm, we found 60 IP addresses of systems running HelimodProxy.\n\n The number of victims seems limited. There are two hypotheses to\n\n explain the low number of compromised hosts. We know from the system\n\n administrator of a victimized system that it wasn’t reachable from the\n\n internet and HelimodProxy was accessed through an Ebury-compromised\n\n machine, so it would be impossible to reach out to that system from our\n\n internet scanner. It’s also possible the campaign was over, and the group\n\n moved on to other monetization methods.\n\n More recently, in late February 2024, we scanned the internet after we\n\n found the newer algorithm in a sample of HelimodRedirect. An HTTP GET\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 28\n\n\n###### request to the generated URL returns the configuration values, as shown in\n\n Figure 29.\n\n Figure 29. Example HTTP reply from HelimodRedirect configuration URL\n\n There was a very limited number of HelimodRedirect instances detected\n\n during our internet scan: only six! Furthermore, all of them had an empty\n\n value in its REDIRECT_URL configuration, which is required for malicious\n\n redirections to occur. We believe this campaign might be over. Based\n\n on the URL patterns of the redirections and according to our telemetry,\n\n HelimodRedirect was widely used in late 2022 and earlier and was installed\n\n on servers hosting hundreds of domains. Like Cdorked, it redirects only a\n\n small percentage of traffic and avoids redirecting the owner of the website\n\n or the same visitor twice, which makes it hard to reproduce the malicious\n\n redirect. However, we can find visitors of popular websites complaining\n\n about redirections, which matches the pattern of the HelimodRedirect\n\n redirection URL. Figure 30 shows a thread on Mastodon where a user\n\n complains about being redirected to a gambling site after clicking the\n\n URL to the posted article. The URL in the post is to a legitimate news\n\n outlet, but the screenshot shared later in the thread reveals that the visitor\n\n\n###### was redirected to 46.4.68[.]136, which was the redirection target of\n\n HelimodRedirect during that timeframe. We can also recognize the DOM and\n```\nURI parameters in the URL, something specific to HelimodRedirect. The\n\n parameters value shows it was redirected from the legitimate website.\n\n Figure 30. A Mastodon thread on floss.social showing a user complaining about web redirection. The screenshot they provide (bottom) shows a redirection target matching the HelimodRedirect signature (source: https://floss.social/@9to5linux/109500305664911924).\n\n To our surprise, we found that both HelimodRedirect and HelimodSteal\n\n implemented the same algorithm to generate the management URL.\n\n Before our internet scan, samples of HelimodSteal we analyzed were not\n\n configurable: all values were hardcoded in the malware samples. The scan\n\n revealed considerably more victims of HelimodSteal than HelimodRedirect:\n\n a total 235 servers replied with their HelimodSteal configuration. Figure 31\n\n shows a map of the location of HelimodSteal-compromised servers.\n\n```\n\n###### Figure 31. Location of servers compromised by HelimodSteal\n\n Unlike HelimodRedirect, the malware is active and contained a valid\n\n configuration (the default values). Figure 32 shows the configuration as seen\n\n during our internet scan, which was the same for all servers. According to\n\n the value of the Server header in the replies, 26 servers (11%) are running\n\n nginx, one didn’t have the header, and the rest are running Apache.\n\n Figure 32. Example HTTP reply from HelimodSteal configuration URL\n\n Weird storage of IP address list\n\n For HelimodProxy, the initial list is empty, and when requests are made\n\n to the management URL, the source IP addresses are added to the list.\n\n IP addresses on this list are permitted to use the open proxy. On the\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 29\n\n\n###### behavior is configured using the nf_hook_ops structure, as illustrated in\n\n Figure 34.\n\n Figure 34. Hook behavior configuration\n\n This indicates that the hook function (pkt_mangle_begin) from the\n\n malicious module will be invoked for all outbound IPv4 traffic.\n\n Redirection configuration\n\n KernelRedirect includes a hardcoded configuration, referred to by the\n\n module authors, according to the symbols, as replacer_info, which is an\n\n array of structures with the format seen in Figure 35.\n\n Figure 35. Structure of the hardcoded configuration\n\n As depicted in Figure, each structure within this array specifies the targeted\n\n port, the probability (packet_handling_prob) of handling a packet,\n\n the probability (packet_replacement_prob) of actually modifying the\n\n\n###### other hand, for HelimodRedirect, the list consists of IP addresses that\n\n should not be redirected. This list is populated with the IP addresses of\n\n system administrators who have recently connected via SSH (using /var/\n```\nlog/wtmp). Additionally, IP addresses of visitors who have already been\n\n redirected are also included on the list to prevent duplicate redirection.\n\n The IP addresses are written in an array with a fixed size of 1,000 entries,\n\n and their indexes are generated pseudo-randomly from the given\n\n addresses. Figure 33 shows a reimplementation in C code, based on the\n\n analysis of HelimodRedirect samples.\n\n Figure 33. C reimplementation of the function adding an IP address to a list, present in the Helimod malware family\n\n This algorithm is a custom implementation of a hash table without buckets,\n\n which enables fast addition and retrieval of entries. It provides a strong\n\n code signature that establishes a clear connection between HelimodProxy\n\n and HelimodRedirect. Since the array only contains 1,000 entries, the\n\n likelihood of collisions is relatively high. However, this may not be a practical\n\n issue, as the allowed list of HelimodProxy typically consists of a limited\n\n number of IP addresses, possibly just one. While collisions may occur for\n\n HelimodRedirect, the overwritten IP address in the array is likely to have\n\n been redirected a long time ago, and the user associated with it is unlikely\n\n to be attempting to reproduce the redirection at that moment.\n\n```\n\n###### KernelRedirect\n\n KernelRedirect is a Linux kernel module implementing a Netfilter hook.\n\n Netfilter is a framework for Linux that filters and modifies network traffic\n\n at various stages of transmission; in the Linux kernel, Netfilter modules can\n\n register callback functions to manipulate packets. The malicious Netfilter\n\n kernel module installed by the attackers is a 64-bit ELF executable compiled\n\n with symbols. The module being deployed is named nf_conntrack6.ko,\n\n which is not part of Netfilter, or any legitimate software, but bears a name\n\n similar to the legitimate nf_conntrack.ko module.\n\n KernelRedirect is used to modify, under specific conditions, the value of\n\n the Location header in HTTP replies, redirecting the visitors to a different\n\n URL than the one originally expected. When a 301 Moved Permanently\n\n response is received, the Location header conveys the URL to which the\n\n web client application should navigate.\n\n It’s worth noting that unlike HelimodRedirect, KernelRedirect cannot\n\n modify end-to-end encrypted (HTTPS) traffic. When Netfilter processes\n\n HTTPS traffic, the HTTP reply has already been encrypted by the web\n\n server application. However, most web servers still receive unencrypted\n\n HTTP traffic on port 80 and are likely to respond with a 301 Moved\n```\nPermanently status with the corresponding HTTPS URL in its Location\n\n header. KernelRedirect abuses this scenario and modifies the reply\n\n to redirect the browser to a URL provided in the kernel module’s\n\n configuration.\n\n Hook configuration\n\n To replace the Location header, the malicious kernel module registers\n\n a Netfilter hook using the nf_register_hook function to intercept all\n\n outgoing TCP traffic, enabling inspection and modification. The hook’s\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 30\n\n\n###### packet, the length of the domain to redirect to, the original domain name\n\n to be replaced (not specified in most analyzed samples), and the malicious\n\n domain name to redirect to.\n\n Outgoing packet handling\n\n When a packet meets the requirements of the Netfilter hook, the module\n\n first checks whether it is a TCP packet that matches the destination port\n\n specified in the hardcoded configuration. In samples we analyzed, it\n\n consistently is 80. Then, it checks whether the destination IP address is\n\n included in a hardcoded list of IP address ranges that should never be\n\n redirected or if it has already been served a malicious redirection. If not,\n\n KernelRedirect verifies whether the packet is an HTTP reply and confirms\n\n the presence of the Location header in the HTTP response. Table 4 shows\n\n examples of a part of the hardcoded configuration.\n\n Original legitimate  Malicious  redirection redirection\n\n shoppersgratification[.]com shoppesrgratification[.]com\n\n fiesta-com[.]com feista-com[.]com\n\n hostingfromvps[.]com hostingrfomvps[.]com\n\n www.keysnotes[.]com www.keysnoles[.]com\n\n www.trckrints6[.]com www.trckrlnts6.com\n\n Table 4. Examples of redirection modifications (highlighted in red) applied by the malicious Netfilter module\n\n\n###### To avoid raising suspicion, the replacement of the Location header is not\n\n carried out systematically. KernelRedirect uses the packet_handling_\n```\nprob and packet_replacement_prob values from the configuration to\n\n decide if a redirection should occur. The former is the probability the reply\n\n is modified at all, and the latter is the probability for that particular domain\n\n in the list. Both are chances in a thousand. Typical values we have seen are\n\n respectively 1,000 and 100, meaning all packets are handled and 10% of\n\n them will be modified to include the redirection. HelimodRedirect’s default\n\n configuration also redirects 10% of the traffic.\n\n When all the conditions are met, the redirection occurs. Typically, the\n\n configuration array contains multiple entries with both the original\n\n domain to be replaced and the domain to redirect to. Domains used for\n\n the malicious redirection are highly similar to the original domains, as\n\n demonstrated in Table 4.\n\n Some instances of malicious redirection involve subtle alterations, such\n\n as the swapping of a pair of letters or the replacement of a single letter\n\n with another, making them difficult for the eye to detect. These misspelled\n\n domains were registered by the operators in 2020, suggesting that\n\n KernelRedirect was active in this timeframe. It’s interesting to note that the\n\n “legitimate” domains in the above examples never seemed to have hosted\n\n legitimate websites and received traffic from spam campaigns. The Ebury\n\n gang was piggybacking on existing traffic schemes.\n\n In other variants of the module, the configuration array contains a single\nreplacer_info entry, with only a domain to redirect to. In such cases,\n\n HTTP redirections are modified regardless of the original value of the\nLocation header.\n\n KernelRedirect uses a pseudorandom number generator (PRNG) algorithm,\n\n depicted in Figure 36, in the process of determining whether a packet\n\n```\n\n###### should be modified. The constants (1103515245 and 12345) are widely\n\n used by Linear Congruential Generator (LCG) algorithms to generate\n\n pseudorandom numbers. Interestingly, this PRNG also has been found in\n\n Ebury since version 1.6, in HelimodRedirect, and in FrizzySteal, indicating\n\n code sharing among these modules.\n\n Figure 36. Decompiled code of the PRNG used by the malicious Netfilter module\n\n The “decimal IP” connection\n\n In March 2017, Malwarebytes published a blogpost that described an\n\n intriguing redirection leading to the RIG exploit kit, resulting in the\n\n compromise of users with SmokeLoader malware. This redirection was\n\n to a URL with an IP address in a non-dotted decimal format: h[tt]\n```\np://1760468715. It is worth noting that this URL is equivalent to the dot\n decimal notation http://104.238.158[.]235. Interestingly, during our\n\n analysis of KernelRedirect samples, we encountered the same redirection\n\n target, indicating that KernelRedirect likely facilitated the redirections\n\n observed by Malwarebytes, as depicted in Figure 37.\n\n Figure 37. replacer_info values in KernelRedirect sample showing the decimal-formatted IP address used as redirection target\n\n In their blogpost, Malwarebytes identified over 5,000 websites serving\n\n these malicious redirections.\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 31\n\n\n###### FrizzySteal\n\n FrizzySteal is a malicious shared library that injects itself into libcurl to\n\n intercept and exfiltrate requests made by the compromised server to\n\n external HTTP servers.\n\n When stored on disk, FrizzySteal is named as the shared library file libz.\n```\nso.1. During its deployment, the legitimate libz.so.1 library is modified\n\n to add a DT_NEEDED entry in its dynamic table, as shown in Figure 38. It is\n\n worth noting that the libz compression library, which now loads FrizzySteal,\n\n is a dependency of libcurl.\n\n Figure 38. Malicious dependency added to libz\n\n As discussed in the libcurl hooking for HTTP request exfiltration section,\n\n capabilities of FrizzySteal were subsequently integrated into Ebury starting\n\n with version 1.7. The standalone FrizzySteal may have been replaced with\n\n Ebury for new deployments. There is significant code overlap between\n\n Ebury and FrizzySteal, encompassing areas such as string obfuscation,\n\n function resolution, hooking libraries, and the code responsible for the\n\n exfiltration within the curl_easy_perform hook. Unlike Ebury, where\n\n the exfiltration server can be configured using Ebury-specific commands,\n\n the URL is hardcoded in the sample, as revealed in the decrypted contents\n\n depicted in Figure 39.\n\n```\n\n###### Figure 39. Decrypted strings from FrizzySteal sample\n\n Another distinguishing factor is the examination of the User-Agent for\n```\nBigBadW0lf in the request, which corresponds to the User-Agent utilized\n\n by SmallCuteCat, a competing server-side web skimmer. HelimodSteal’s\n\n deployment script also checks for the presence of SmallCuteCat, as\n\n discussed in the Shared hosting, but not shared with whom you think section.\n\n Server-side web skimmer\n\n This method of infiltration is believed to be another avenue for extracting\n\n financial details during transactions. When a customer submits credit card\n\n information to an online store, the server is required to communicate with\n\n its payment processor to validate and confirm the transaction’s success.\n\n Figure 40 illustrates how credit card details can be pilfered from\n\n unsuspecting individuals entering their information into an online payment\n\n form. HelimodSteal can intercept these details as they are received by the\n\n compromised web server. Alternatively, FrizzySteal or Ebury can obtain\n\n them from the requests made by the compromised server to its payment\n\n```\n\n###### processor. Since both are operating within the web server or application,\n\n end-to-end encryption (HTTPS) cannot protect against this threat.\n\n Ebury-compromised server\n\n HTTP server\n\n sends credit card details via HTTP POST\n HelimodSteal\n\n\n###### Victim\n\n\n###### Payment processor\n\n\n###### sends credit card\n store application details via HTTP POST\n\n FrizzySteal or Ebury\n\n HTTP POST exfiltration server\n\n collects\n\n Figure 40. Flow of credit card details on transactional website compromised by Ebury\n\n Hiding traffic from system administrators\n\n After analyzing malware discovered in the gang’s toolkit, we found\n\n one designed to conceal malicious network traffic from the system\n\n administrators of the compromised servers. This malware can evade\n\n firewall protections by manipulating Netfilter rules. It is present on disk as\n\n an altered iptables executable. On CentOS, the only distribution where this\n\n malware was seen, the altered files are at the following locations:\n • [/sbin/iptables-multi-1.4.7][ on CentOS 6]\n\n • [/usr/sbin/iptables-multi][ on CentOS 7]\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 32\n\n\n###### These ELF executables are used to launch iptables-related commands such\n\n as iptables, iptables-save, and iptables-restore. All are symbolic\n\n links to iptables-multi.\n\n The malicious files have an additional function the author called hide_me,\n\n which serves two purposes:\n • [Hide rules from the output of ][iptables][ and ][iptables-save][ for a ] specific set of IP addresses (Figure 41).\n\n • [Inject rules to accept incoming TCP connections from the same set of IP ] addresses (Figure 42).\n\n Figure 41. IDA Pro flow graph showing an IP address being compared with the embedded, hardcoded list to determine whether to display it in the command output\n\n Figure 42. IDA Pro disassembly showing injection of rules after iptables-restore finishes its legitimate duties\n\n\n###### The aforementioned set of IP addresses is hardcoded in the malicious files\n\n and they are probably related to one of Ebury’s operations in 2020. They are:\n```\n217.163.23[.]173\n\n```\n```\n140.82.34[.]55\n194.36.191[.]108\n94.140.120[.]163\n\n```\n\n###### Performing AitM attacks\n\n Given the extensive network of servers compromised by Ebury, its operators\n\n have established a significant presence in data centers worldwide. Leveraging\n\n this extensive access, they can strategically target valuable servers. Ebury\n\n operators have been conducting large-scale AitM attacks to gain access to\n\n these valuable servers and exploit their intrusion for financial gain.\n\n Implementation\n\n Perl scripts are utilized to automate the execution of arpspoof and\n\n the creation of iptables rules and redirecting incoming SSH traffic to a\n\n honeypot where victims unwittingly enter their SSH credentials. Upon\n\n identifying a target, the following steps are taken:\n\n 1. Identify a compromised machine with Ebury installed within the same subnet as the targeted system.\n\n 2. Confirm network segmentation by examining the ARP cache after pinging the target.\n\n 3. Install necessary tools such as arpspoof.\n\n 4. Execute arpspoof to intercept network traffic and establish iptables rules to redirect network traffic to an operator-controlled system designed to capture SSH credentials.\n\n\n###### Figure 43 depicts the network interactions during the attacks.\n\n SSH AitM host\n\n captures SSH\n Network segment\n installs Ebury and steals  credentials SSH keys and Bitcoin wallets\n\n redirects SSH traffic using iptables DNAT rule\n\n Target\n\n Bitcoin node or\n tries to connect\n interesting target\n to server but traffic is intercepted\n\n scans for SSH port\n\n Compromised\n\n with Ebury\n installs tools and runs nmap, iptables\n runs arpspoof and\n and arpspoof\n iptables rules\n\n Figure 43. Overview of the AitM attacks perpetrated by the Ebury gang\n\n\n###### It is crucial to acknowledge that when victims attempt to connect to their\n\n server via OpenSSH during an ongoing AitM attack, OpenSSH and other\n\n popular SSH clients will issue a warning about a host key change if the\n\n client was previously used to connect to the server. Despite this warning,\n\n many victims still proceeded to enter their passwords. Here are several\n\n reasons why capturing the credentials is successful:\n • [During the AitM attack, all other services on the host become ] unreachable. From the victim’s perspective, the server appears to have an issue, and only SSH remains accessible to “fix” the problem. In a state of remediation or panic, system administrators may overlook security\n\n\n###### Victim\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 33\n\n\n###### warnings if they hinder their ability to restore services.\n\n • [Victims may have never connected through SSH using the client they ] are currently employing. In such cases, no warning is issued because the client does not possess any prior host key information.\n\n • [Victims may lack alternative methods to address the issue. While some ] ISPs offer console or rescue modes, these are typically employed as a last resort. Additionally, rescue mode may alter the host key, leading the victims to believe that the server is already in rescue mode when they attempt to connect.\n\n • [As a result of key authentication failure, system administrators revert to ] password authentication.\n\n The whole process has mostly been automated by Perl scripts, running on\n\n both the Ebury-compromised server performing the ARP spoofing and\n\n on the target. Figure 44 shows the Perl script automatically run on the\n\n targeted system once credentials are gained. SSH keys, Bitcoin wallets, and\n\n Bash history are exfiltrated right after Ebury is installed.\n\n Figure 44. Perl script run on target system after SSH credentials are stolen (redacted)\n\n\n###### Victimology\n\n It is feasible to trace the targets of AitM attacks because all SSH traffic from\n\n ongoing AitM attacks is directed to servers controlled by the operators. The\n\n AitM SSH servers consistently utilize the same host keys, regardless of the\n\n victim. By using tools like Censys to search for SSH servers reporting those\n\n host keys, we can identify servers whose traffic was tampered with during\n\n the scan.\n\n In total, we have observed over 200 targets across more than 75\n\n autonomous systems (AS) in 34 different countries between February\n\n 2022 and May 2023. It is surprising to note the vulnerability of many data\n\n centers to ARP spoofing attacks, likely stemming from the continued use of\n\n outdated hardware or insecure configurations.\n\n Among the targets of such attacks are reachable Bitcoin nodes. It’s\n\n reasonable to presume that servers running Bitcoin Core may also store\n\n a wallet. Given that the list of approximately 6,500 nodes reachable via\n\n IPv4 is publicly available, Ebury operators verify if they have compromised\n\n machines in the same network segment and attempt to execute AitM\n\n attacks to gain SSH access to the server.\n\n This same approach is applied to the approximately 7,000 reachable\n\n Ethereum nodes.\n\n Ebury operators also target Tor exit nodes. We believe that, as several\n\n Bitcoin and Ethereum nodes are accessible via a Tor hidden service, there is\n\n a possibility that Tor exit nodes may also host a Bitcoin or Ethereum node.\n\n Additionally, other targets include servers involved in cryptocurrency\n\n research and those responsible for financial transactions.\n\n\n###### Some other targets are servers related to cryptocurrency research or\n\n servers responsible for financial transactions.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 34\n\n#### Attribution\n\n\n###### This section is authored by the Dutch National High Tech Crime Unit\n\n (NHTCU) regarding their findings related to the attribution.\n\n The Ebury actors use various anonymization techniques to hide their tracks.\n\n When it comes to their true identities many of the online and offline traces\n\n NHTCU finds prove to be fake, stolen or often leading to (seemingly) innocent\n\n people. In addition, the actors try to put law enforcement on the wrong foot by\n\n using monikers of known cybercriminal actors and by actually stealing and using\n\n credentials from other cybercriminals. These deceptive actions are well illustrated\n\n by data found on a seized backup server.\n\n Among the troves of data present on the seized backup server, there is copy of\n\n a server belonging to a Russian payment provider. This data contains mailboxes,\n\n transaction details and other company information. Several deeply located folders\n\n include scans of passports of citizens with various nationalities. One of those\n\n passport contains a name and address that is used by Ebury actors to apply\n\n for a customer account with a hosting provider. Additionally, they use a Yandex\n\n mail account with a prefix similar to some that are created on several platforms\n\n by the real passport user. At first glance this combination of real and online\n\n identifiers from several sources and timeframes appears to lead to a true identity\n\n of an Ebury actor. Nevertheless, further research shows that it is more likely this\n\n person is a victim of identity theft.\n\n The actors seem to be taking a pragmatic approach when it comes to stealing\n\n these types of (real) identities. For example, the backup sever contains a full\n\n\n###### copy, including the source code, of the illicit website my-vidar[.]com. It is likely\n\n that the Ebury actors stumbled upon this goldmine of login credentials, which\n\n are harvested by other criminals using Vidar Stealer, within their own Ebury\n\n botnet. The website my-vidar[.]com serves as an admin panel where infected\n\n devices can be controlled. Hence the Ebury group does not only benefit from the\n\n theft of the already stolen login credentials, but is also in a position to use the\n\n credentials of the cybercriminals stealing them. Consequently, they can create a\n\n ‘cybercriminal cover’ pointing in other directions than themselves.  \n\n Despite the numerous red herrings, NHTCU is currently actively pursuing several\n\n promising digital identities. These are mainly derived from copies of virtual\n\n machines that are found on the backup server. On those virtual machines web\n\n browsing artifacts are present, including browsing history and saved logins. The\n\n browsing history illustrates that the majority of logins are preceded by visiting\n\n URLs of admin panels related to password stealing malware (i.e. ‘Pony Stealer’\n\n and ‘AZORult’). However, in other instances a user account is newly created and\n\n variations of that username are used on other platforms.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 35\n\n#### Remediation\n\n\n###### Detection\n\n Defusing the userland rootkit\n\n To detect Ebury activity on a server, it is crucial to\n\n ensure that you are using an untampered session.\n\n As shown in the Userland rootkit section, Ebury\n\n compromises all SSH sessions to conceal its presence.\n\n Fortunately, there are several methods to prevent\n\n Ebury from injecting itself into a subprocess, or to start\n\n a new shell that remains free from the userland rootkit:\n • [Setting the ][H][ environment variable to any value ] in the subprocess prevents the rootkit from activating. This is specific to Ebury and can serve as a debugging method on compromised machines. Running the command H=1 \"$SHELL\" should launch a shell without Ebury loaded.\n\n • [Another technique is to set ][LD_PRELOAD][, ]\n```\n  LD_DEBUG, or LD_TRACE_LOADED_OBJECTS to an\n empty string or any value, which also prevents the rootkit from being activated. This behavior was probably implemented to avoid altering the behavior of legitimate tools that rely on these Linux loader variables, such as ldd, a tool used to list library dependencies of an ELF file. Additionally, it\n\n```\n\n###### circumvents an indicator previously shared in 2017, where we suggested using LD_DEBUG=symbols to detect the injection of libkeyutils.so.\n\n • [If you have systemd version 240 or newer, utilizing ]\n```\n  systemd-run -S allows you to start a shell\n with the systemd daemon (the process having PID 1) as its parent process. This shell will remain uncompromised by Ebury since Ebury is not present in systemd’s init daemon.\n\n • [Although not always possible to do remotely, ] shells started from physical access or a console that doesn’t rely on OpenSSH should be free from the Ebury userland rootkit, because they are not a subprocess of sshd. This is the case for both the console (Ctrl-Alt-F1) or a terminal emulator (GNOME Terminal, rxvt, etc.) started from the graphical user interface.\n\n From a trusted shell, it should now be possible to see\n\n the indicators listed in the IoCs section.\n\n Automated detection\n\n We have created a detection script to identify\n\n indicators up to Ebury version 1.8.2. However, please\n\n note that newer versions of Ebury are likely to bypass\n\n```\n\n###### these indicators, rendering the detection script\n\n ineffective. To address this, we have developed a more\n\n generic program that can detect the presence of a\n\n userland rootkit using various techniques. For the\n\n source code, documentation, and compiled distribution\n\n of this program, please refer to the ESET malware\n research GitHub repository.\n\n Payment details\n\n A way to prevent server-side web skimmers is to avoid\n\n having the e-commerce website handle the credit card\n\n details and transaction. This can be done by sending\n\n the visitor to the payment service provider website to\n\n perform the transaction, rather than forwarding the\n\n credit card details to a payment provider to validate the\n\n transaction. Such forwarding introduces unnecessary\n\n risk. When the payment is performed outside the\n\n merchant website, the visitor can be redirected back\n\n to the website after the transaction is complete, and\n\n the merchant can communicate with the payment\n\n provider to confirm that the transaction went through.\n\n A lot of transactional websites are already using this\n\n approach.\n\n\n###### Cleaning\n\n To ensure that the system is completely free from\n\n compromise, a complete reinstallation is necessary,\n\n without reusing any of the keys or credentials from\n\n the affected server. If your hosting provider supplies\n\n you with a password during server provisioning, it\n\n is imperative to change that password as soon as\n\n possible.\n\n All credentials present on the system, such as\n\n passwords, SSH keys, and private keys utilized for\n\n traffic encryption or code signing, must be regarded\n\n as compromised, regardless of whether they are\n\n encrypted. It is crucial not to employ the compromised\n\n system for authenticating with any other systems\n\n to avoid the risk of credentials being stolen and\n\n subsequently exploited to propagate Ebury or other\n\n forms of malware.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 36\n\n#### Conclusion\n\n\n###### This paper exposes the Ebury group and its activities.\n\n It shows the different methods used to propagate\n\n and compromise additional servers. It also shows the\n\n massive scale of the operation, with 400,000 servers\n\n compromised by the group since 2009. It provides\n\n an in-depth technical analysis of the Ebury software,\n\n and many of the related malware families they use\n\n to monetize their botnet. It demonstrates how AitM\n\n is used to steal cryptocurrencies. With this paper,\n\n we communicate ways for system administrators to\n\n determine if their servers are compromised by Ebury.\n\n Ebury poses a serious threat and a challenge to the\n\n Linux security community. There is no simple fix\n\n that would make Ebury ineffective, but a handful of\n\n mitigations can be applied to minimize its spread and\n\n impact. One thing to realize is that it doesn’t happen\n\n only to organizations or individuals that care less about\n\n security. A lot of very tech-savvy individuals and large\n\n organizations are among the list of victims.\n\n We talked about multi-factor authentication (MFA) for\n\n SSH as a mitigation technique when we first published\n\n about Ebury. Since Ebury still uses, among other\n\n\n###### things, stolen credentials to spread, this is still a valid\n\n mitigation to consider. However, MFA still isn’t widely\n\n adopted for SSH. It relies on third-party PAM modules\n\n such as the Google Authenticator PAM module\n\n and needs manual configuration. It is not the default\n\n security setting of any popular Linux distribution. As a\n\n result, MFA is rarely deployed for the SSH service.\n\n One striking realization is the number of hosting\n\n providers being compromised by Ebury, and how\n\n the perpetrators use their access to compromise\n\n the accounts of that provider. Access to servers used\n\n for shared hosting grants them access to a lot of\n\n unencrypted web traffic, which they leverage for\n\n stealthy redirection or capturing details submitted in\n\n online forms. Compromised OpenVZ hosts are used\n\n to install Ebury in all their containers. Compromised\n\n control panels grant access to virtual and dedicated\n\n servers being rented from that provider. The\n\n compromise of virtual and dedicated servers would be\n\n more difficult for the perpetrators if hosting providers\n\n wouldn’t use passwords (generated, or not) when\n\n provisioning servers. In that scenario, the plaintext\n\n\n###### password must be communicated to the customer, and\n\n it is usually sent via email. A better approach is to use\n\n an SSH key pair, generated on the trusted endpoint of\n\n the administrator renting the server. The public key can\n\n safely be shared with the provider, who can deploy it\n\n to the new server. This way, the secret is only available\n\n to the administrator, and not even the hosting provider\n\n has the credentials to connect via SSH.\n\n Using AitM inside data centers to compromise\n\n interesting targets with Ebury is also something that\n\n hasn’t been documented before. This automated way\n\n to go after servers that potentially have cryptocurrency\n\n wallets enables the group to monetize its botnet\n\n quickly.\n\n We hope this publication raises awareness around\n\n Ebury and the criminal activities being conducted\n\n on servers currently running the internet. Botnets of\n\n Linux servers are damaging and induce considerable\n\n financial loss. By sharing indicators, providing tools,\n\n and documenting the activities of this gang, we hope\n\n to reduce their impact and make the internet a safer\n\n place.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 37\n\n#### Acknowledgments\n\n###### This publication wouldn’t be possible without the help of the following\n\n individuals and organizations.\n • [Fellow ESET researchers Jean-Ian Boutin, Thomas Dupuy, Matthieu ] Faou, Zuzana Hromcová, Facundo Muñoz, Zoltán Rusnák and Mathieu Tartare for their help and honest review, and to Nick FitzGerald, René Holt, and Bruce P. Burrell for language review.\n\n • [The National High Tech Crime Unit (NHTCU) of the Dutch National ] Investigations and Special Operations for their trust and partnering with ESET in the investigation.\n\n • [The Shadowserver Foundation.]\n\n • [A. Yeow from ][bitnodes.io][ for data about Bitcoin nodes.]\n\n • [All victims who reached out to ESET researchers to share samples or ] information about Ebury.\n\n\n-----\n\n###### WHITEPAPER | 38\n\n\n# MITRE ATT&CK Techniques\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 39\n\n#### MITRE ATT&CK Techniques\n\n###### This table was produced using version 14 of the MITRE ATT&CK Enterprise table.\n\n Tactic ID Name Description\n\n Reconnaissance T1592.002 Gather Victim Host Information:  Using stolen credentials or the Ebury backdoor, a Perl or Bash script is run to determine the version  Software of the operating system and what services are running, such as a web server.\n\n T1592.004 Gather Victim Host Information:  Using stolen credentials or the Ebury backdoor, a Perl or Bash script is run to determine the version  Client Configurations of the operating system and network configuration.\n\n\n###### Resource Development\n\n\n###### T1583.001 Acquire Infrastructure: Domains Domains are used by Ebury, FrizzySteal, and HelimodSteal to find the exfiltration server.\n\n T1583.003 Acquire Infrastructure: Virtual Private Server Ebury operators rent VPSes to proxy traffic to compromised hosts.\n\n T1583.004 Acquire Infrastructure: Server Ebury operators rent dedicated servers to proxy traffic, host databases, and control the botnet.\n\n T1583.006 Acquire Infrastructure: Web Services HelimodSteal and FrizzySteal exfiltration servers are hosted behind Cloudflare.\n\n T1584.004 Compromise Infrastructure: Server Servers compromised with Ebury are used as part of their malicious infrastructure.\n\n T1587.001 Develop Capabilities: Malware Ebury, KernelRedirect, the Helimod malware family, and more are authored by the perpetrators.\n\n T1587.004 Develop Capabilities: Exploits An exploit for web administrator panel software was developed by the Ebury gang.\n\n\n###### Initial Access T1190 Exploit Public-Facing Application An exploit for web administrator panel software was used by the Ebury gang.\n\n T1078 Valid Accounts Ebury is installed by using stolen SSH credentials.\n\n Execution T1059.004 Command and Scripting Interpreter: Unix Shell Attackers use Bash scripts to gather information about the compromised machines.\n\n T1059 Command and Scripting Interpreter Attackers use Perl scripts to gather information about the compromised machines and install malware.\n\n T1609 Container Administration Command\n```\n                                           vzctl is used to list OpenVZ containers and install Ebury on them.\n\n T1129 Shared Modules Ebury is executed by hooking the keyutils shared library, loaded by OpenSSH and libcurl.\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 40\n\n Persistence T1554 Compromise Client Software Binary The keyutils library is modified to add malicious behavior to the OpenSSH client and the curl library.\n\n T1574.006 Hijack Execution Flow: Dynamic Linker Hijacking Ebury uses the LD_PRELOAD environment variable to inject itself in programs launched by SSH sessions.\n\n T1078 Valid Accounts Attackers use credentials to reinstall Ebury if it is removed from the server.\n\n\n###### Privilege  Escalation\n\n\n###### T1068 Exploitation for Privilege Escalation Attackers use DirtyCOW to gain root privileges on compromised servers.\n\n\n###### Defense Evasion T1562.001 Impair Defenses: Disable or Modify Tools Ebury injects into processes to modify tools reporting its presence. iptables tools can be modified to avoid reporting specific rules.\n\n T1562.004 Impair Defenses: Disable or Modify System iptables rules may be injected to allow malicious traffic. Firewall\n\n T1562.006 Impair Defenses: Indicator Blocking Ebury disables OpenSSH, system, and audit logs when the backdoor is used.\n\n T1070.002 Indicator Removal: Clear Linux or Mac System When using valid credentials rather than the Ebury backdoor via OpenSSH, logs are cleared to remove traces of the successful login. Logs\n\n T1070.006 Indicator Removal: Timestomp Timestamps of the files are modified when deploying malware.\n\n T1036.005 Masquerading: Match Legitimate Name or HelimodProxy’s auxiliary executable file is named pmtad, like the legitimate PowerMTA daemon. Location\n\n T1027.001 Obfuscated Files or Information: Binary Padding When installed, the value of the build id (NT_GNU_BUILD_ID) in the Ebury ELF file is replaced with a random value to change the hash of the file.\n\n T1027.002 Obfuscated Files or Information: Software Packing Ebury and FrizzySteal strings are encrypted.\n\n T1027.007 Obfuscated Files or Information: Dynamic API Ebury dynamically resolves the addresses of external functions. Resolution\n\n T1014 Rootkit Ebury acts as a userland rootkit when injected inside the shell of SSH sessions.\n\n T1622 Debugger Evasion Ebury will not inject into programs run inside a debugger, such as the GNU debugger, to avoid suspicion.\n\n Credential Access T1556 Modify Authentication Process Ebury allows bypassing SSH authentication.\n\n T1557.002 Adversary-in-the-Middle: ARP Cache Poisoning The attackers use Ebury-compromised servers to launch ARP cache poisoning to perform AitM in order to steal SSH credentials.\n\n T1110.001 Brute Force: Password Guessing Ebury operators try to brute force SSH credentials.\n\n T1110.004 Brute Force: Credential Stuffing Ebury operators use known valid credentials on systems related to where they are valid.\n\n T1212 Exploitation for Credential Access Attackers use passwords collected in administration software for provisioning servers to deploy Ebury on the servers they manage.\n\n T1040 Network Sniffing HelimodSteal and Ebury can capture credentials sent over HTTP or HTTPS.\n\n T1003.008 OS Credential Dumping: /etc/passwd and /etc/ Ebury dumps the content of the shadow file and brute forces passwords. shadow\n\n T1552.001 Unsecured Credentials: Credentials In Files Ebury steals passwords from other SSH password stealers that store credentials on disk.\n\n T1552.004 Unsecured Credentials: Private Keys Ebury operators dump SSH private keys from compromised systems.\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 41\n\n Discovery T1018 Remote System Discovery Using Ebury, attackers dump OpenSSH’s known_hosts files to find related servers.\n\n T1082 System Information Discovery Using Ebury, attackers list mounted file systems and free space, operating system version, and more.\n\n T1016.001 System Network Configuration Discovery:  Using Ebury, attackers list IP addresses assigned to the system. Internet Connection Discovery\n\n Lateral Movement T1021.004 Remote Services: SSH Attackers try to log into related systems via SSH using stolen credentials.\n\n Collection T1056.004 Input Capture: Credential API Hooking Ebury hooks functions in the OpenSSH client to capture credentials.\n\n T1560.001 Archive Collected Data: Archive via Utility Attackers use tar to exfiltrate wanted files from compromised systems.\n\n\n###### Command and Control\n\n\n###### T1071.001 Application Layer Protocol: Web Protocols HelimodRedirect and HelimodSteal can be configured over HTTP.\n\n T1568.002 Dynamic Resolution: Domain Generation Ebury uses an algorithm to generate domain names used to find an exfiltration server. Algorithms\n\n T1568.003 Dynamic Resolution: DNS Calculation The IP address of Ebury’s exfiltration server is decrypted from the TXT record rather than the A record.\n\n T1573.002 Encrypted Channel: Asymmetric Cryptography Ebury uses a public key to encrypt exfiltrated credentials and to decrypt information from a TXT record.\n\n T1090.003 Proxy: Multi-hop Proxy When reaching out to an Ebury-compromised server, the attackers use multiple layers of proxies.\n\n\n###### Exfiltration T1048.002 Exfiltration Over Alternative Protocol: Exfiltration Ebury can encrypt credentials with an RSA-2048 public key and exfiltrate them via UDP. Over Asymmetric Encrypted Non-C2 Protocol\n\n T1041 Exfiltration Over C2 Channel Ebury can exfiltrate credentials as the result of a command (Xcat) over an SSH session.\n\n Impact T1565.002 Data Manipulation: Transmitted Data HelimodRedirect and KernelRedirect add or change the Location header of HTTP replies. Manipulation\n\n\n-----\n\n###### WHITEPAPER | 42\n\n\n# IoCs\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 43\n\n#### IoCs\n\n\n###### Host-based indicators\n\n To determine whether a system is compromised by\n\n Ebury, make sure you do so from a trusted shell. At the\n\n time of writing, the following command starts a shell\n\n free from the Ebury rootkit:\n```\nH=1 LD_DEBUG=\"\" LD_PRELOAD=\"\" \"$SHELL\"\n\n```\n\n\n###### • [event-CRbBwZlvXa]\n\n • [ACPI-NYlT78Tj]\n\n • [UDEV-4kAmkRW3]\n\n The permanently running process listening to this UNIX\n\n socket is started by loading the Ebury payload into\n\n a legitimate executable using LD_PRELOAD. Abused\n\n legitimate processes include:\n • [/bin/hostname]\n\n • [/bin/sync]\n\n • [/sbin/auditd]\n\n • [/sbin/rsyslogd]\n\n • [/sbin/udevd]\n\n • [/usr/lib/systemd/systemd-udevd]\n\n • [/usr/sbin/acpid]\n\n • [/usr/sbin/anacron]\n\n • [/usr/sbin/arpd]\n\n • [/usr/sbin/atd]\n\n • [/usr/sbin/crond]\n\n\n###### While only one of the environment variables is enough,\n\n using three is our attempt to make it more difficult to\n\n circumvent in future versions of Ebury. Alternatively,\n\n systemd can also provide a shell that’s not a subprocess\n\n of the OpenSSH server using the command:\n```\nsystemd-run -S\n\n```\n\n###### filesystem pathname-bound sockets. lsof -U or\n```\n/proc/net/unix can be used to list UNIX sockets.\n\n Here are examples of the commands with their\n\n outputs showing abstract UNIX sockets created by\n\n Ebury (first line of output, in red) and a legitimate\n\n application (second line of output, in green):\n# lsof -U | grep @\nsystemd-u 1776 root 3u unix\n\n```\n\n###### or:\n```\n$ grep @ /proc/net/unix\nffff9519b9931540: 0000002 00000000 00010000\n0001 01 22471 @/dev/event-E4LgEFWIcy\nffff9151807a3000: 0000002 00000000 00010000\n\n```\n```\n0xffff9519b9931540 0t0 22471 @/dev/event\n```\n```\nE4LgEFWIcy\nvirtiofsd 381 root 4u unix\n\n```\n```\n0xffff9151807a3000 0t0 20524 @9634c\n\n```\n\n\n###### • [/dev/event/loop0]\n\n • [/dev/stats-MxPAxNpy3x]\n\n • [/proc/udevd]\n\n • [/proc/ulog]\n\n • [/run/systemd/journal-YAjXO8luqOa]\n\n • [/run/systemd/journal/dlog]\n\n • [/run/systemd/log]\n\n • [/run/systemd/log-90zMvYX7uL]\n\n • [/run/systemd/log-wuO3nuFBHN]\n\n • [/tmp/dbus-0m9eDQpdXZ]\n\n • [/tmp/dbus-9XZXkmdfpN]\n\n • [/tmp/dbus-VdyGBaqZws]\n\n • [/tmp/dbus-Xrga2cOewg]\n\n • [/tmp/dbus-ZP7tFO4xsL]\n\n • [/tmp/dbus-kZ8VEtJDOJ]\n\n • [/tmp/dbus-luzG4UqDt8]\n\n • [/tmp/dbus-n3UUkeqEZG]\n\n • [/tmp/dbus-vBWUDhHCHp]\n\n\n###### See the Detection section for more details about\n\n evading the userland rootkit.\n\n Since Ebury version 1.5, Ebury starts a process to keep\n\n state information and perform credential exfiltration.\n\n An abstract UNIX socket is used to communicate\n\n between the compromised SSH client or server and\n\n this permanently running process.\n\n Abstract UNIX sockets are usually displayed by\n\n prefixing them with @ to differentiate them from\n\n```\n0001 01 20524 @9634c\n\n```\n\n###### Abstract UNIX sockets with the following names are\n\n known to be used by Ebury:\n • [/dev/event-E4LgEFWIcy]\n\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 44\n\n\n###### Finding Ebury on disk\n\n The Ebury payload size is approximately between\n\n 28 kB (version 1.2.1) and 64 kB (version 1.8). It is typically\n\n present in a shared library containing an initialization\n\n function executed when the library is loaded.\n\n There are multiple ways that Ebury can be installed on\n\n a system.\n • [Replacing ][libkeyutils.so][, a library loaded by ] OpenSSH, with a trojanized version.\n\n • [Placing a trojanized version of ][libkeyutils.so][ in ]\n```\n  [...]/lib/tls/. This file will be loaded instead of\n the legitimate one, if present.\n\n • [Patching ][libkeyutils.so][ to load ][libXXX.so] instead of the libc.so.6 library. The libXXX.so library contains the Ebury payload. XXX is a three letter or digit string. Here are some examples of filenames we have seen:\n  libns2.so\n  libns5.so\n  libpw3.so\n  libpw5.so\n  libsbr.so\n  libslr.so\n  libstz.so\n  libtsq.so\n  libtsr.so\n\n```\n\n\n###### • [Replacing ][libkeyutils.so][ with a trojanized ] version that will dynamically load another shared library file containing the Ebury payload. Here are some examples of filenames we have seen:\n```\n  libkeystats.so\n  libkeyctl.so\n  librwctl.so\n\n • [On rare occasions, mostly on non-Linux systems, ] Ebury is part of the OpenSSH executables themselves (ssh, sshd, etc.). In those cases, OpenSSH is patched, and sometimes recompiled on the compromised system.\n\n Network\n\n Ebury operators are known to connect daily to\n\n compromised systems using the Ebury backdoor to\n\n retrieve stolen credentials and system information such\n\n as known hosts and users who last connected to the\n\n system. They have used the following IP addresses to\n\n connect to compromised systems:\n\n IP address First seen\n 2024-04-24\n45.59.120[.]146\n 2023-03-24\n65.21.54[.]164\n\n 2024-04-18\n141.255.166[.]187\n 2024-04-24\n146.70.124[.]102\n\n 2024-04-24\n185.59.103[.]8\n 2024-02-14\n195.123.225[.]83\n\n 2024-04-24\n213.232.235[.]104\n\n```\n\n###### DNS\n\n Under certain circumstances, Ebury tries to exfiltrate\n\n intercepted credentials by sending an encrypted UDP\n\n packet using port 53 (conventionally DNS) as the\n\n destination port. To find the server to send this data\n\n to, a DNS request is made for the TXT record of a\n\n subdomain of one of the following domains:\n\n Domain Registration Details date\n\n 2023-09-01 First domain\n```\nqimpj6kkofzf[.]biz of the sixth iteration of the DGA.\n\n 2019-01-30 First domain\nop3f1libgh[.]biz of the fifth iteration of the DGA.\n First domain larfj7g1vaz3y[.]net [2016-09-19] of the fourth iteration of the DGA.\n\n The A records of these domains are misleading and\n\n ignored by Ebury. The IP address is decrypted from\n\n the TXT record. Here are the IP addresses used for\n\n exfiltration at the time of writing:\n\n IP address First seen\n 2023-11-10\n185.145.245[.]167\n 2022-05-07\n135.181.148[.]230\n 2021-11-02\n141.164.52[.]243\n\n The following domains are used to exfiltrate HTTP\n\n POST requests over HTTP or HTTPS.\n\n```\n\n###### YARA rules\n\n YARA rules are available on ESET’s malware-ioc\n\n GitHub repository.\n\n\n###### Domain Hosting First seen provider\n\n Cloudflare 2020-05-12\n```\npbarsec[.]com\n Cloudflare 2020-08-25\nchecklicence[.]net\n\n In SSH traffic\n\n The Ebury backdoor is activated by including specific\n\n information in the SSH client identification string.\n\n This string consists of the first bytes sent by an SSH\n\n client. Since it is sent before the SSH handshake and\n\n key exchange are performed, it is unencrypted. The\n\n client identification string usually contains the client\n\n application name and version. Here is an example client\n\n identification string from OpenSSH:\n\n```\n```\nSSH-2.0-OpenSSH 8.6\n\n```\n\n###### An SSH connection enabling the Ebury backdoor\n\n contains hexadecimal-encoded data (for Ebury before\n\n version 1.7) or base64-encoded data (for Ebury version\n\n 1.7 and later, first seen in 2019). Since version 1.8, spaces\n\n are ignored. Here are three examples of malicious\n\n client identification strings:\n\n```\nSSH-2.0-b479ec723a2ba590d6c4a0bf40f4ba\n\n```\n```\nSSH-2.0-XDbxdCP/G9Dcd1qDCE+t\n\n```\n```\nSSH-2.0-FcZpUkMuIY 2MfBBDvOJdFBTFUw==\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 45\n\n Files\n SHA-1 Filename Detection Description\n Linux/Ebury.J Ebury v1.7.0p.\n```\n98FBD545B5C1B1FE185730BA9B1CD4BEBFAE4476 libstz.so\n\n Linux/Ebury.H Ebury v1.7.3.\n44B04CFC095F93D17B1BD4F8820C16843FCBAC3E libkeyutils.so\n\n Linux/Ebury.N Ebury v1.8.0.\n013647E5AD347539EEF6C5933B16AD01B1806C3C libkeyutils.so\n\n Linux/Ebury.N Ebury v1.8.1.\n787A93F86E7F5FCF922E996B577DF532270C7184 libllz564\n Linux/Ebury.N Ebury v1.8.2.\nE7DEBD6E453192AD8376DB5BAB03ED0D87566591 libllz564\n\n Linux/Ebury.H Ebury v1.6.3.\nCD9A5B823906CC620B28D69DBDB11BD9FE6B3E03 libkeyutils.so\n\n Linux/Ebury.I Ebury v1.6.2fp.\nDDAE9417470F832DB550EFB716B5BAEAAAA35372 libsbr.so\n Linux/Ebury.J Ebury v1.7.0c.\n71CA9B7C418264C2C856D47483666D123861D476 libkeystats.so\n\n Linux/Ebury.J Ebury v1.7.3c.\n4A7303DD8E7BBBF063463B3852245ABDD343F5B6 libkeystats.so\n\n Linux/Ebury.L Ebury v1.7.4c.\nDFAECF7EBFC169CDF923AF421EDD537CCE536A64 librwctl.so\n Linux/Ebury.K Ebury v1.7.4d.\n3137DCA3F6FBD566F4ED2F49076A63D84869E13C libkeyutils.so\n\n Linux/FrizzySteal.A FrizzySteal.\n96FD9B3064F04EE3063B2B103F856BB729B58749 ibz.so\n\n Linux/HackTool.Proxy.D Modified 3proxy.\n53829463A7DE8C4BACE97B1F6925728F3421DF53 pmtad\n Linux/HackTool.Proxy.D Modified 3proxy.\n947EEE633E9347F72625FB652F94488A4B2B37F0 pmtad\n\n Linux/HelimodProxy.A Helimod Apache module.\nE39667AA137E315BC26EAEF791CCAB52938FD809 mod_dir.so\n\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\n0B91C3C2627F9948B8F3446822F99FAF88081267 mod_dir.so\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\n580E6075C65D867667D507E2B00C8EEF79C907A1 mod_auth_basic.so\n\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\n3988D1A743E83D532130BC8090A7BC7001FE1BB0 mod_authn_file.so\n\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\n429A81BBD18A35C3C4D1DCB8BC76F5A7D9724A79 mod_authz_host.so\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\n16EE09926A2109262686D58974079ADC25E31AA1 mod_authz_user.so\n\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\nEC4941BDD9FFB241968FD59A28B70BCE288ED261 mod_dir.so\n\n Linux/HelimodRedirect.A HelimodRedirect Apache module.\nA64D6C7444FC2404A589ED7F8527E698682A3E68 mod_env.so\n Linux/HelimodSteal.A HelimodSteal Apache module.\n15560B44286122FA0679C6C2368817CE2DC747E6 mod_auth_basic.so\n\n Linux/HelimodSteal.A HelimodSteal Apache module.\n94532111459E024BCB7E2025A6C145876A46F829 mod_authn_file.so\n\n Linux/HelimodSteal.A HelimodSteal Apache module.\nAD350D7DA4BF1F7080026B683F93401CD735E974 mod_authz_host.so\n Linux/HelimodSteal.A HelimodSteal Apache module.\n75E8A197B6A9A7903CA43782BDD77CD9611FEFE0 mod_authz_user.so\n\n Linux/HelimodSteal.A HelimodSteal Apache module.\nCFB48909B978E91CFC6FFCAF2E4B04F27F503B34 mod_dir.so\n\n Linux/HelimodSteal.A HelimodSteal Apache module.\nD39959356283DB4B3184BDB15E890E74CF1EA65C mod_env.so\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 46\n\n Linux/IptablesPatch.A Modified iptables executable.\n```\n070F85BF02AD3FB0978785B3272D7B08F5C47A1A iptables-multi-1.4.7\n\n Linux/IptablesPatch.A Modified iptables executable.\n10F94157365E6A1BBB101B3222EE3C3C675B9829 iptables-multi-1.4.7\n\n Linux/IptablesPatch.A Modified iptables executable.\n12666F2FBEFC55F1DDB4BA86B5D85DB733889162 iptables-multi\n Linux/IptablesPatch.A Modified iptables executable.\n22BB2E0D1E1B0B009464E2919A381C4951D7D90D iptables-multi\n\n Linux/IptablesPatch.A Modified iptables executable.\n2DBF91347FA987E6199DAE5141641D04D0C963FF iptables-multi-1.4.7\n\n Linux/IptablesPatch.A Modified iptables executable.\n535C5588ED2EF9A4E960882C23E3104E81F2C079 iptables-multi-1.4.7\n Linux/IptablesPatch.A Modified iptables executable.\nAA0EC27C26E5484B4EB23D8424B2412221D5C7FC iptables-multi\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\n12EA4595C6F38E60C23F09B2F08D78BA6EB0C1B3 nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\n1918E40580291D0299A78DDFB9123923F832CEB3 nf_conntrack6.ko\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\n20599D89E4F648CF0F6EB46DEE67DB63984A8C36 nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\n6FF132E50EFA5ABF534A005CB58C9C5B5FC39BEC nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\n9569A8411477305FACA78E1C944D479EFA028DFB nf_conntrack6.ko\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nBCC3B83CFADBD58256FC41AF9F0BFF50AC1F148B nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nD392022D8B72BCDDB849A94829C87731874E94AC nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nD3D6567862B4B7811BEA76BE117E901B2B6B8399 nf_conntrack6.ko\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nD901D65F7A7A49296A501420F6D32BBF968F5BDE nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nED5662F3CF80B8108D2172FBCA6119E403205EAA nf_conntrack6.ko\n\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nEDD2DE0FAFE84EA51029FFDE38ACBB5918108DF5 nf_conntrack6.ko\n Linux/KernelRedirect.A KernelRedirect Netfilter kernel module.\nFD6709AF6A8DC384B101A8E9ED36C1092533C404 nf_conntrack6.ko\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n04FF6202534A394586D826B320645AEC24CE7AA5 libcurl.so.4.6.0\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n32BB38D7D6B03DB4779E7A7183E7FA42DFBAFFC2 libcurl.so.4.4.0\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n59F238DA1FD822AAD6FA7DF78D823854EAF8762E libcurl.so.4.4.0\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n6369AD38D39562DD9D6D3E2612496A5357FFC09B libcurl.so.4.5.0\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n67C1905EF4D0422DBDFAC41DC80F9C4D5C69E288 libcurl.so.4.5.0\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n6BEE8F88F3F145170CEF58D9F790DDD99CDFA547 libcurl.so.4.6.0\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n72048DEABE7F37BBECBFDA1570E1AB6B366B72BD libcurl.so.4.4.0\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n907822012D6A970D676B634903F099587ED9C335 libcurl.so.4.6.0\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\n9209D757770AAFCA0B84B9F63B8769DF8CAC3F1A libcurl.so.4.5.0\n\n Linux/IptablesPatch.A Modified iptables executable.\n4F92498FB8C1BFED97F18CFB7B36AF899F70F582 iptables-multi\n\n Linux/SmallCuteCat.A libcurl with the SmallCuteCat payload.\nD8647E825EFE74BF1726C0C494E3C2588FFF2262 libcurl.so.4.5.0\n\n```\n\n-----\n\n###### ESET | EBURY IS ALIVE BUT UNSEEN WHITEPAPER | 47\n\n### About ESET\n\n\n###### For more than 30 years, ESET has been developing\n\n industry-leading IT security software and services to\n\n deliver comprehensive, multilayered protection against\n\n cybersecurity threats for businesses and consumers\n\n worldwide. ESET has long pioneered machine learning\n\n and cloud technologies that prevent, detect and respond\n\n to malware. ESET is a privately owned company that\n\n promotes scientific research and development worldwide.\n\n\n###### WeLiveSecurity.com\n\n @ESETresearch\n\n ESET GitHub\n\n ESET Threat Reports and APT Activity Reports\n\n © 2023 ESET, spol. s r.o. - All rights reserved.\n\n Trademarks used herein are trademarks or registered trademarks of ESET, spol. s r.o.\n\n All other names and brands are registered trademarks of their respective companies.\n\n\n###### (eset):research\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://web-assets.esetstatic.com/wls/en/papers/white-papers/ebury-is-alive-but-unseen.pdf"
    ],
    "report_names": [
        "ebury-is-alive-but-unseen.pdf"
    ],
    "threat_actors": [
        {
            "id": "3844202f-b24a-4e16-b7b9-dfe8c0a44d5d",
            "created_at": "2022-10-25T16:07:24.526179Z",
            "updated_at": "2025-03-27T02:02:10.27234Z",
            "deleted_at": null,
            "main_name": "Operation Windigo",
            "aliases": [],
            "source_name": "ETDA:Operation Windigo",
            "tools": [
                "CDorked",
                "CDorked.A",
                "Calfbot",
                "Ebury"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1934b371-2525-4615-a90a-772182bc4184",
            "created_at": "2022-10-25T15:50:23.396576Z",
            "updated_at": "2025-03-27T02:00:55.460522Z",
            "deleted_at": null,
            "main_name": "Windigo",
            "aliases": [
                "Windigo"
            ],
            "source_name": "MITRE:Windigo",
            "tools": [
                "Ebury"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1715997949,
    "ts_updated_at": 1743041630,
    "ts_creation_date": 1715626604,
    "ts_modification_date": 1715626608,
    "files": {
        "pdf": "https://archive.orkl.eu/690da3bf046071c6575aa23a6477f7f5320427f9.pdf",
        "text": "https://archive.orkl.eu/690da3bf046071c6575aa23a6477f7f5320427f9.txt",
        "img": "https://archive.orkl.eu/690da3bf046071c6575aa23a6477f7f5320427f9.jpg"
    }
}