{
    "id": "61ef7667-36ea-4cf4-b082-5f05823d694c",
    "created_at": "2023-01-12T15:01:06.769781Z",
    "updated_at": "2025-03-27T02:05:22.074528Z",
    "deleted_at": null,
    "sha1_hash": "7eaca0af52a24e47c6c0ca6e17c17b8640f5f7d0",
    "title": "2017-04-10 - Justice Department Announces Actions to Dismantle Kelihos Botnet",
    "authors": "",
    "file_creation_date": "2022-05-28T03:38:42Z",
    "file_modification_date": "2022-05-28T03:38:42Z",
    "file_size": 73219,
    "plain_text": "# Justice Department Announces Actions to Dismantle Kelihos Botnet\n\n**[justice.gov/opa/pr/justice-department-announces-actions-dismantle-kelihos-botnet-0](https://www.justice.gov/opa/pr/justice-department-announces-actions-dismantle-kelihos-botnet-0)**\n\nApril 10, 2017\n\nThe Justice Department today announced an extensive effort to disrupt and dismantle the\nKelihos botnet – a global network of tens of thousands of infected computers under the\ncontrol of a cybercriminal that was used to facilitate malicious activities including harvesting\nlogin credentials, distributing hundreds of millions of spam e-mails, and installing\nransomware and other malicious software.\n\nActing Assistant Attorney General Kenneth A. Blanco of the Justice Department’s Criminal\nDivision, Acting U.S. Attorney Bryan Schroder for the District of Alaska, Assistant Director\nScott Smith for the FBI’s Cyber Division and FBI Special Agent in Charge Marlin Ritzman of\nthe AnchorageDivision made the announcement.\n\n“The operation announced today targeted an ongoing international scheme that was\ndistributing hundreds of millions of fraudulent e-mails per year, intercepting the credentials to\nonline and financial accounts belonging to thousands of Americans, and spreading\nransomware throughout our networks.  The ability of botnets like Kelihos to be weaponized\nquickly for vast and varied types of harms is a dangerous and deep threat to all Americans,\ndriving at the core of how we communicate, network, earn a living, and live our everyday\nlives,” said Acting Assistant Attorney General Blanco. “Our success in disrupting the Kelihos\nbotnet was the result of strong cooperation between private industry experts and law\nenforcement, and the use of innovative legal and technical tactics. The Department of\nJustice is committed to combatting cybercrime, no matter the size or sophistication of the\nscheme, and to punish those who are engaged in such crimes.”\n\n“Cybercrime is a worldwide problem, but one that infects its victims directly through the\ncomputers and personal electronic devices that we use every day,” said Acting U.S. Attorney\nBryan Schroder for the District of Alaska. “Protecting the American people from such a\n\n\n-----\n\nworldwide threat requires a broad-reaching response, and the dismantling of the Kelihos\nbotnet was such an operation. We are lucky that we have talented FBI agents and federal\nprosecutors with the skillsets to help protect Americans from this pervasive cybercrime.”\n\n“On April 8, 2017, we started the extraordinary task of blocking malicious domains\nassociated with the Khelios botnet to prohibit further infections,” said FBI Special Agent in\nCharge Ritzman. “This case demonstrates the FBI’s commitment to finding and eradicating\ncyber threats no matter where they are in the world.”\n\nKelihos malware targeted computers running the Microsoft Windows operating\nsystem. Infected computers became part of a network of compromised computers known as\na botnet and were controlled remotely through a decentralized command and control\nsystem. According to the civil complaint, Peter Yuryevich Levashov allegedly operated the\nKelihos botnet since approximately 2010. The Kelihos malware harvested user credentials\nby searching infected computers for usernames and passwords and by intercepting network\ntraffic. Levashov allegedly used the information gained from this credential harvesting\noperation to further his illegal spamming operation which he advertised on various online\ncriminal forums. The Kelihos botnet generated and distributed enormous volumes of\nunsolicited spam e-mails advertising counterfeit drugs, deceptively promoting stocks in order\nto fraudulently increase their price (so-called “pump-and-dump” stock fraud schemes), workat-home scams, and other frauds. Kelihos was also responsible for directly installing\nadditional malware onto victims’ computers, including ransomware and malware that\nintercepts users’ bank account passwords.\n\nAs with other botnets, Kelihos is designed to operate automatically and undetected\non victims’ computers, with the malicious code secretly sending requests for instructions to\nthe botnet operator. In order to liberate the victim computers from the botnet, the United\nStates obtained civil and criminal court orders in the District of Alaska. These orders\nauthorized measures to neutralize the Kelihos botnet by (1) establishing substitute servers\nthat receive the automated requests for instructions so that infected computers no longer\ncommunicate with the criminal operator and (2) blocking any commands sent from the\ncriminal operator attempting to regain control of the infected computers.\nIn seeking authorization to disrupt and dismantle the Kelihos botnet, law enforcement\n[obtained a warrant pursuant to recent amendments to Rule 41 of the Federal Rules of](https://www.justice.gov/archives/opa/blog/rule-41-changes-ensure-judge-may-consider-warrants-certain-remote-searches)\nCriminal Procedure. A copy of this warrant along with the other court orders are produced\nbelow.  The warrant obtained by the government authorizes law enforcement to redirect\nKelihos-infected computers to a substitute server and to record the Internet Protocol\naddresses of those computers as they connect to the server. This will enable the\ngovernment to provide the IP addresses of Kelihos victims to those who can assist with\nremoving the Kelihos malware including internet service providers.\n\nThe efforts to disrupt and dismantle the Kelihos botnet were led by the FBI’s Anchorage\nOffice and New Haven Office; Senior Counsel Ethan Arenson and Harold Chun, and Trial\nAttorney Frank Lin of the Computer Crime and Intellectual Property Section; and Assistant\n\n\n-----\n\nU.S. Attorneys Yvonne Lamoureux and Adam Alexander of the District of Alaska. Critical\nassistance was also provided by foreign partners, and invaluable technical assistance was\nprovided by Crowd Strike and The Shadow server Foundation in executing this operation.\n\nThe details contained in the civil complaint and related pleadings are merely accusations,\nand the defendant is presumed innocent unless and until proven guilty.\n\nThe Government has and will continue to share samples of the Kelihos malware with the\ninternet security community so that antivirus vendors can update their programs to detect\nand remove Kelihos. A number of free and paid antivirus programs are already capable of\n[detecting and removing Kelihos, including the Microsoft Safety Scanner, a free product.](https://www.microsoft.com/security/scanner/en-us/default.aspx)\n\nThe documents filed by the Government as well as the court orders entered in this case are\navailable online at the following web address: www.justice.gov/opa/documents-andresources-related-us-v-peter-yuryevich-levashov\n\nTopic(s):\n\nCybercrime\n\nComponent(s):\n\n[Criminal Division](http://www.justice.gov/criminal/)\nPress Release Number:\n\n17-378\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-10 - Justice Department Announces Actions to Dismantle Kelihos Botnet.pdf"
    ],
    "report_names": [
        "2017-04-10 - Justice Department Announces Actions to Dismantle Kelihos Botnet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535666,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653709122,
    "ts_modification_date": 1653709122,
    "files": {
        "pdf": "https://archive.orkl.eu/7eaca0af52a24e47c6c0ca6e17c17b8640f5f7d0.pdf",
        "text": "https://archive.orkl.eu/7eaca0af52a24e47c6c0ca6e17c17b8640f5f7d0.txt",
        "img": "https://archive.orkl.eu/7eaca0af52a24e47c6c0ca6e17c17b8640f5f7d0.jpg"
    }
}