{
    "id": "6221fe3a-261e-4b8a-8a67-ca47198605f4",
    "created_at": "2022-10-25T16:48:21.381888Z",
    "updated_at": "2025-03-27T02:16:09.69315Z",
    "deleted_at": null,
    "sha1_hash": "97d56a7fe645bf9914b5547b5efa6f3ef3234ac0",
    "title": "UNC2596 Observed Leveraging Vulnerabilities to Deploy Cuba Ransomware",
    "authors": "Mandiant",
    "file_creation_date": "2022-05-04T14:57:07Z",
    "file_modification_date": "2022-05-04T14:57:07Z",
    "file_size": 3503924,
    "plain_text": "# (Ex)Change of Pace: UNC2596 Observed Leveraging Vulnerabilities to Deploy Cuba Ransomware\n\n**mandiant.com/resources/unc2596-cuba-ransomware**\n\nIn 2021, Mandiant observed some threat actors deploying ransomware increasingly shift to exploiting vulnerabilities as an initial infection\nvector. UNC2596, a threat actor that deploys COLDDRAW ransomware, publicly known as Cuba Ransomware, exemplifies this trend. While\n[public reporting has highlighted CHANITOR campaigns as precursor for these ransomware incidents, Mandiant has also identified the](https://www.ic3.gov/Media/News/2021/211203-2.pdf)\n[exploitation of Microsoft Exchange vulnerabilities, including ProxyShell and ProxyLogon, as another access point leveraged by UNC2596 likely](https://www.mandiant.com/resources/pst-want-shell-proxyshell-exploiting-microsoft-exchange-servers)\nas early as August 2021. The content of this blog focuses on UNC2596 activity which has led to the deployment of COLDDRAW ransomware.\n\nUNC2596 is currently the only threat actor tracked by Mandiant that uses COLDDRAW ransomware, which may suggest it’s exclusively used\nby the group. During intrusions, these threat actors have used webshells to load the TERMITE in-memory dropper with subsequent activity\ninvolving multiple backdoors and built-in Windows utilities. Beyond commonplace tools, like Cobalt Strike BEACON and NetSupport,\nUNC2596 has used novel malware, including BURNTCIGAR to disable endpoint protection, WEDGECUT to enumerate active hosts, and the\nBUGHATCH custom downloader. In incidents where COLDDRAW was deployed, UNC2596 used a multi-faceted extortion model where data is\nstolen and leaked on the group's shaming website, in addition to encryption using COLDDRAW ransomware. COLDDRAW operations have\nimpacted dozens of organizations across more than ten countries, including those within critical infrastructure.\n\n## Victimology\n\nThe threat actors behind COLDDRAW ransomware attacks have not shied away from sensitive targets (Figure 1). Their victims include utilities\nproviders, government agencies, and organizations that support non-profits and healthcare entities, however, we have not observed them\nattacking hospitals or entities that provide urgent care. Around 80% of impacted victim organizations are based in North America, but they\nhave also impacted several countries in Europe as well as other regions (Figure 2).\n\nFigure 1: Alleged COLDDRAW victims by industry\n\n\n-----\n\nFigure 2: Alleged COLDDRAW victims by country\n\n## Shaming Website\n\nSince at least early 2021, COLDDRAW ransomware victims have been publicly extorted by the threat actors who threaten to publish or sell\nstolen data (Figure 3). Each shaming post includes information on the “date the files were received.” While the shaming site was not included\nin ransom notes until early 2021, one of the entries on the site states that the files were received in November 2019. This is consistent with\nearliest samples uploaded to public malware repositories and may represent the earliest use of the ransomware. Notably, while the data\nassociated with most of the victims listed on this site are provided for free, there is a paid section which listed only a single victim at the time of\npublication.\n\nFigure 3: Cuba (aka COLDDRAW) Ransomware Shaming Tor site (2021-12-31)\n\n## Attack Lifecycle\n\nUNC2596 incidents that have led to COLDDRAW ransomware deployment have involved a mix of public and private tools, some of which are\nbelieved to be private to them. The threat actors use several malware and utilities that are publicly available including NetSupport, Cobalt\nStrike BEACON, built-in Windows capabilities such as PsExec, RDP, and PowerShell, malware available for purchase such as WICKER, and\nexploits with publicly available proof-of-concept code. UNC2596 also uses several tools and scripts that we have not observed in use by other\nthreat activity clusters to date, including BUGHATCH, BURNTCIGAR, WEDGECUT, and COLDDRAW. See the “Notable Malware and Tools”\nsection for additional detail.\n\n### Initial Reconnaissance / Initial Compromise\n\nMandiant has observed UNC2596 frequently leverage vulnerabilities affecting public-facing Microsoft Exchange infrastructure as an initial\ncompromise vector in recent COLDDRAW intrusions s where the initial vector was identified. The threat actors likely perform initial\nreconnaissance activities to identify Internet-facing systems that may be vulnerable to exploitation.\n\n\n-----\n\n### stab s oot o d\n\nIn COLDDRAW ransomware incidents, where initial access was gained via Microsoft Exchange vulnerabilities, UNC2596 subsequently\ndeployed webshells to establish a foothold in the victim network. Mandiant has also observed these actors deploy a variety of backdoors to\nestablish a foothold, including the publicly available NetSupport RAT, as well as BEACON and BUGHATCH, which have been deployed using\nthe TERMITE in-memory dropper.\n\n### Escalate Privileges\n\nCOLDDRAW ransomware incidents have mainly involved the use of credentials from valid accounts to escalate privileges. In some cases, the\nsource of these credentials is unknown, while in other cases, UNC2596 leveraged credential theft tools such as Mimikatz and WICKER. We\nhave also observed these threat actors manipulating or creating Windows accounts and modifying file access permissions. In one intrusion,\nUNC2596 created a user account and added it to the administrator and RDP groups.\n\n### Internal Reconnaissance\n\nUNC2596 has performed internal reconnaissance with the goals of identifying active network hosts that are candidates for encryption and\nidentifying files to exfiltrate for use in their multi-faceted extortion scheme. The threat actors have used WEDGECUT, a reconnaissance tool\ntypically with the filename check.exe. It identifies active hosts by sending PING requests to a list of hosts generated by a PowerShell script\nnamed comps2.ps1 which uses the Get-ADComputer cmdlet to enumerate the Active Directory. The threat actors have interactively browsed\nfile systems to identify files of interest. Additionally, UNC2596 has routinely used a script named shar.bat to map all drives to network shares,\nwhich may assist in user file discovery (Figure 4).\n\nnet share C=C:\\ /grant:everyone,FULL\n\nnet share D=D:\\ /grant:everyone,FULL\n\nnet share E=E:\\ /grant:everyone,FULL\n\nnet share F=F:\\ /grant:everyone,FULL\n\nnet share G=G:\\ /grant:everyone,FULL\n\nnet share H=H:\\ /grant:everyone,FULL\n\nnet share I=I:\\ /grant:everyone,FULL\n\nnet share J=J:\\ /grant:everyone,FULL\n\nnet share L=L:\\ /grant:everyone,FULL\n\nnet share K=K:\\ /grant:everyone,FULL\n\nnet share M=M:\\ /grant:everyone,FULL\n\nnet share X=X:\\ /grant:everyone,FULL\n\nnet share Y=Y:\\ /grant:everyone,FULL\n\nnet share W=W:\\ /grant:everyone,FULL\n\nnet share Z=Z:\\ /grant:everyone,FULL\n\nnet share V=V:\\ /grant:everyone,FULL\n\nnet share O=O:\\ /grant:everyone,FULL\n\nnet share P=P:\\ /grant:everyone,FULL\n\nnet share Q=Q:\\ /grant:everyone,FULL\n\nnet share R=R:\\ /grant:everyone,FULL\n\nnet share S=S:\\ /grant:everyone,FULL\n\nnet share T=T:\\ /grant:everyone,FULL\n\nFigure 4: UNC2596 used a batch script to\n\nenable sharing of all drives to facilitate\n\nencryption and data harvesting\n\n### Move Laterally/Maintain Presence\n\n\n-----\n\nu g CO W c de ts, UNC 596 acto s ave used seve a et ods o ate a ove e t c ud g, S, a d s ec, eque t y\nusing BEACON to facilitate this movement. Following lateral movement, the threat actors deploy various backdoors including the publicly\navailable NetSupport RAT, as well as BEACON and BUGHATCH, which are often deployed using the TERMITE in-memory dropper. These\nbackdoors are sometimes executed using PowerShell launchers and have in some cases used predictable filenames. For example, NetSupportrelated scripts and executables observed during COLDDRAW incidents have typically used the filename ra or ra<#> whereas BUGHATCH\nscripts and executables have used the filename komar or komar<#>, followed by the appropriate extension.\n\n### Complete Mission\n\nIn order to complete their mission of multi-faceted extortion, the UNC2596 attempts to steal relevant user files and then identify and encrypt\nnetworked machines. To facilitate encryption, and possibly to assist with collection efforts, the threat actors have used a batch script named\n_shar.bat which maps each drive to a network share (Figure 4). These newly created shares are then available for encryption by COLDDRAW._\nDuring a more recent intrusion involving COLDDRAW, UNC2596 deployed the BURNTCIGAR utility using a batch script named av.bat.\nBURNTCIGAR is a utility first observed in November 2021 which terminates processes associated with endpoint security software to allow\ntheir ransomware and other tools to execute uninhibited. UNC2596 has also been observed exfiltrating data prior to encrypting victim systems.\nTo date, we have not observed UNC2596 using any cloud storage providers for data exfiltration; rather, they prefer to exfiltrate data to their\nBEACON infrastructure. The threat actors then threaten to publish data of organizations that do not pay a ransom on their shaming site\n(Figure 5).\n\nGood day. All your files are encrypted. For decryption contact us.\n\nWrite here cloudkey[@]cock.li\n\nreserve admin[@]cuba-supp.com\n\njabber cuba_support[@]exploit.im\n\nWe also inform that your databases, ftp server and file server were downloaded by us to our servers.\n\nIf we do not receive a message from you within three days, we regard this as a refusal to negotiate.\n\nCheck our platform: <REDACTED>[.]onion/\n\n - Do not rename encrypted files.\n\n - Do not try to decrypt your data using third party software,\n\nit may cause permanent data loss.\n\n - Do not stop process of encryption, because partial encryption cannot be decrypted.\n\nFigure 5: Sample COLDDRAW Ransom Note\n\n## Notable Malware and Tools\n\nIn addition to the use of publicly available malware and built-in utilities, Mandiant has observed UNC2596 use malware that is believed to be\nprivate to these threat actors, such as WEDGECUT, BUGHATCH, BURNTCIGAR, and COLDDRAW, or malware that is believed to be used by a\nlimited number of threat actors, such as TERMITE.\n\n### WEDGECUT\n\nWEDGECUT, which has been observed with the filename check.exe, is a reconnaissance tool that takes an argument containing a list of hosts or\nIP addresses and checks whether they are online using ICMP packets. This utility’s functionality is implemented using the IcmpCreateFile,\nIcmpSendEcho, and IcmpCloseFile APIs to send a buffer containing the string “Date Buffer”. In practice, the list provided to WEDGECUT has\nbeen generated using a PowerShell script that enumerates the Active Directory using the Get-ADComputer cmdlet.\n\n### BUGHATCH\n\nBUGHATCH is a downloader that executes arbitrary code on the compromised system downloaded from a C&C server. The code sent by the\nC&C server includes PE files and PowerShell scripts. BUGHATCH has been loaded in-memory by a dropper written in PowerShell or loaded by\na PowerShell script from a remote URL.\n\n### BURNTCIGAR\n\nBURNTCIGAR is a utility that terminates processes at the kernel level by exploiting an Avast driver’s undocumented IOCTL code (Table 1). The\nmalware terminates targeted processes using the function DeviceIoControl to exploit the undocumented 0x9988C094 IOCTL code of the Avast\ndriver, which calls ZwTerminateProcess with the given process identifier. We have observed a batch script launcher that creates and starts a\nkernel service called aswSP_ArPot2 loading binary file C:\\windows\\temp\\aswArPot.sys (legitimate Avast driver with SHA256 hash\n4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1).\n\nT d l BURNTCIGAR t i ti th t b i th i f th l bl A t d i d i t ll it t i\n\n\n-----\n\n**Executable Processes Killed by BURNTCIGAR**\n\nSentinelHelperService.exe iptray.exe dsa-connect.exe\n\nSentinelServiceHost.exe ccSvcHst.exe ResponseService.exe\n\nSentinelStaticEngineScanner.exe sepWscSvc64.exe avp.exe\n\nSentinelAgent.exe SEPAgent.exe avpsus.exe\n\nSentinelAgentWorker.exe ssDVAgent.exe klnagent.exe\n\nSentinelUI.exe smcgui.exe vapm.exe\n\nSAVAdminService.exe PAUI.exe VsTskMgr.exe\n\nSavService.exe ClientManager.exe mfemms.exe\n\nSEDService.exe SBPIMSvc.exe mfeann.exe\n\nAlsvc.exe SBAMSvc.exe macmnsvc.exe\n\nSophosCleanM64.exe VipreNis.exe masvc.exe\n\nSophosFS.exe SBAMTray.exe macompatsvc.exe\n\nSophosFileScanner.exe RepMgr.exe UpdaterUI.exe\n\nSophosHealth.exe RepUtils.exe mfemactl.exe\n\nMcsAgent.exe scanhost.exe McTray.exe\n\nMcsClient.exe RepUx.exe cpda.exe\n\nSophosSafestore64.exe PccNtMon.exe IDAFServerHostService.exe\n\nSophosSafestore.exe svcGenericHost.exe epab_svc.exe\n\nSSPService.exe pccntmon.exe epam_svc.exe\n\nswc_service.exe HostedAgent.exe cptrayLogic.exe\n\nswi_service.exe tmlisten.exe EPWD.exe\n\nSophosUI.exe logWriter.exe FSAgentService.exe\n\nSophosNtpService.exe ntrtscan.exe RemediationService.exe\n\nhmpalert.exe TmCCSF.exe TESvc.exe\n\nSophosLiveQueryService.exe TMCPMAdapter.exe cptrayUI.exe\n\nSophosOsquery.exe coreServiceShell.exe EFRService.exe\n\n\n-----\n\nSophosFIMService.exe coreFrameworkHost.exe MBCloudEA.exe\n\nswi_fc.exe ds_monitor.exe MBAMService.exe\n\nSophosMTRExtension.exe CloudEndpointService.exe Endpoint Agent Tray.exe\n\nsdcservice.exe CETASvc.exe EAServiceMonitor.exe\n\nSophosCleanup.exe EndpointBasecamp.exe MsMpEng.exe\n\nSophos UI.exe WSCommunicator.exe AvastSvc.exe\n\nSavApi.exe dsa.exe aswToolsSvc.exe\n\nsfc.exe Notifier.exe bcc.exe\n\nAvWrapper.exe WRSA.exe anet.exe\n\nbccavsvc.exe a.exe aus.exe\n\nAvastUI.exe\n\nTable 1: Processes Killed by BURNTCIGAR\n\n### COLDDRAW\n\nCOLDDRAW is the name Mandiant uses to track the ransomware observed in Cuba Ransomware operations. This ransomware appends the\n.cuba file extension to encrypted files. When executed, it terminates services associated with common server applications and encrypts files on\nthe local filesystem and attached network drives using an embedded RSA key. Encrypted files are rewritten with a COLDDRAW-generated\nheader prior to the encrypted file contents. For large files, only the beginning and end of the file will be encrypted.\n\n### TERMITE\n\nTERMITE is a password-protected memory-only dropper which contains an encrypted shellcode payload. Observed payloads have included\nBEACON, METASPLOIT stager, or BUGHATCH. TERMITE requires the actor to specify the ClearMyTracksByProcess export and supply a\npassword as a command line option to operate successfully (Figure 6). Mandiant suspects that TERMITE may be available to multiple groups\nand is not exclusively used by UNC2596.\n\nRundll32.exe c:\\windows\\temp\\komar.dll,ClearMyTracksByProcess 11985756\n\nFigure 6: TERMITE command line execution\n\n**Tracking TERMITE**\n\nDuring UNC2596 intrusions involving COLDDRAW, the actors load tools and malware from web accessible systems that were also typically\nused for BEACON. Over a period of approximately six months, Mandiant Advanced Practices tracked a TERMITE loader at\nhxxp://45.32.229[.]66/new.dll which used the password 11985756 to decode various BEACON payloads. Ongoing analysis of TERMITE\npayloads collected during this timeframe showed that TERMITE underwent modifications to evade detections. UNC2596 also began using the\nTERMITE password 11985757 in October 2021.\n\n## CHANITOR Overlaps\n\nMandiant has not responded to any intrusions where we have directly observed CHANITOR malware lead to COLDDRAW ransomware;\nhowever, we have identified overlaps between CHANITOR-related operations and COLDDRAW incidents. These include infrastructure\noverlaps, common code signing certificates, use of a shared packer, and naming similarities for domains, files, and URL paths, among others.\n\nThe code signing certificate with the Common Name FDFWJTORFQVNXQHFAH has been used to sign COLDDRAW payloads, as well as\nSENDSAFE payloads distributed by CHANITOR. Mandiant has not observed the certificate used by other threat actors.\n[COLDDRAW payloads and SENDSAFE payloads distributed by CHANITOR have used a shared packer that we refer to as LONGFALL.](https://advantage.mandiant.com/malware/malware--01557594-ac1c-5a17-8619-ae0c05508133)\nLONGFALL, which is also known as CryptOne, has been used with a variety of malware families.\n\n\n-----\n\ne W C stea e as bee used bot C N O e ated post e p o tat o act v ty a d CO W c de ts, c ud g sa p es\nsharing the same command and control (C&C) server.\nPayloads distributed through CHANITOR and payloads identified in COLDDRAW ransomware incidents have masqueraded as the same\nlegitimate applications including mDNSResponder and Java.\n[Public reporting has also highlighted some overlaps between COLDDRAW and ZEPPELIN, another ransomware that has reportedly been](https://blog.group-ib.com/hancitor-cuba-ransomware)\ndistributed via CHANITOR.\n\n## Implications\n\nAs the number of vulnerabilities identified and publicly disclosed continues to increase year after year, Mandiant has also observed an increase\nin the use of vulnerabilities as an initial compromise vector by ransomware threat actors including utilizing both zero-day and n-day\n[vulnerabilities in their activity; notable examples include UNC2447 and FIN11. Shifting towards vulnerabilities for initial access could offer](https://www.mandiant.com/resources/unc2447-sombrat-and-fivehands-ransomware-sophisticated-financial-threat)\nthreat actors more accurate targeting and higher success rates when compared to malicious email campaigns, which rely more on\nuncontrollable factors, such as victims’ interacting with malicious links or documents. The rise in zero-day usage specifically could be reflective\nof significant funds and resources at the disposal of ransomware operators, which are being directed towards exploit research and development\nor the purchasing of exploits from trusted brokers. However, threat actors do not have to use zero-days to be effective. A subset of n-day\nvulnerabilities are often considered attractive targets for threat actors due to their impact of publicly exposed products, ability to facilitate code\nexecution after successful exploitation, and the availability of significant technical details and/or exploit code in public venues. As the number\nof vulnerabilities publicly disclosed continues to rise, we anticipate threat actors, including ransomware operators, to continue to exploit\nvulnerabilities in their operations.\n\n## Acknowledgements\n\nWith thanks toThomas Pullen and Adrian Hernandez for technical research, and Nick Richard for technical review.\n\n## MITRE ATT&CK\n\nMandiant has observed COLDDRAW activity involving the following techniques in COLDDRAW intrusions:\n\n**ATT&CK Tactic Category** **Techniques**\n\nInitial Access T1190:    Exploit Public-Facing Application\n\nDiscovery T1010:    Application Window Discovery\n\nT1012:    Query Registry\n\nT1016:    System Network Configuration Discovery\n\nT1018:    Remote System Discovery\n\nT1033:    System Owner/User Discovery\n\nT1057:    Process Discovery\n\nT1082:    System Information Discovery\n\nT1083:    File and Directory Discovery\n\nT1087:    Account Discovery\n\nT1518:    Software Discovery\n\nImpact T1486:    Data Encrypted for Impact\n\nT1489:    Service Stop\n\nCollection T1056.001:  Keylogging\n\nT1074.002:  Remote Data Staging\n\n\n-----\n\nDefense Evasion T1027:    Obfuscated Files or Information\n\nT1055:    Process Injection\n\nT1055.003:  Thread Execution Hijacking\n\nT1070.004:  File Deletion\n\nT1112:    Modify Registry\n\nT1134:    Access Token Manipulation\n\nT1134.001:  Token Impersonation/Theft\n\nT1140:    Deobfuscate/Decode Files or Information\n\nT1497.001:  System Checks\n\nT1553.002:  Code Signing\n\nT1564.003:  Hidden Window\n\nT1574.011:  Services Registry Permissions Weakness\n\nT1620:    Reflective Code Loading\n\nPersistence T1098:    Account Manipulation\n\nT1136:    Create Account\n\nT1136.001:  Local Account\n\nT1543.003:  Windows Service\n\nCommand and Control T1071.001:  Web Protocols\n\nT1071.004:  DNS\n\nT1095:    Non-Application Layer Protocol\n\nT1105:    Ingress Tool Transfer\n\nT1573.002:  Asymmetric Cryptography\n\nResource Development T1583.003:  Virtual Private Server\n\nT1587.003:  Digital Certificates\n\nT1588.003:  Code Signing Certificates\n\nT1608.001:  Upload Malware\n\nT1608.002:  Upload Tool\n\nT1608.003:  Install Digital Certificate\n\nT1608.005:  Link Target\n\nExecution T1053:    Scheduled Task/Job\n\nT1059:    Command and Scripting Interpreter\n\nT1059.001:  PowerShell\n\nT1129:    Shared Modules\n\nT1569.002:  Service Execution\n\nLateral Movement T1021.001:  Remote Desktop Protocol\n\nT1021.004:  SSH\n\nCredential Access T1555.003:  Credentials from Web Browsers\n\nTable 2: MITRE ATT&CK Framework\n\n\n-----\n\n## Mandiant Security Validation\n\nIn addition to previously released Actions, the Mandiant Security Validation (Validation) Behavior Research Team (BRT) has created\nVHR20220223, which will also be released today, for tactics associated with UNC2596.\n\nA102-561, Malicious File Transfer - TERMITE, Download, Variant #3\n\nA102-560, Malicious File Transfer - TERMITE, Download, Variant #4\n\nA102-559, Command and Control - TERMITE, DNS Query, Variant #1\n\nA102-558, Malicious File Transfer - WEDGECUT, Download, Variant #1\n\nA102-557, Malicious File Transfer - TERMITE, Download, Variant #2\n\nA102-556, Malicious File Transfer - TERMITE, Download, Variant #1\n\nA102-555, Malicious File Transfer - BURNTCIGAR, Download, Variant #4\n\nA102-554, Malicious File Transfer - BURNTCIGAR, Download, Variant #3\n\nA102-553, Malicious File Transfer - BURNTCIGAR, Download, Variant #2\n\nA102-552, Malicious File Transfer - BURNTCIGAR, Download, Variant #1\n\nA102-572, Malicious File Transfer - BUGHATCH, Download, Variant #4\n\nA102-551, Malicious File Transfer - BUGHATCH, Download, Variant #3\n\nA102-550, Malicious File Transfer - BUGHATCH, Download, Variant #2\n\nA102-549, Malicious File Transfer - BUGHATCH, Download, Variant #1\n\nA101-830 Command and Control - COLDDRAW, DNS Query\n\nA101-831 Malicious File Transfer - COLDDRAW, Download, Variant #2\n\nA101-832 Malicious File Transfer - COLDDRAW, Download, Variant #3\n\nA101-833 Malicious File Transfer - COLDDRAW, Download, Variant #4\n\nA101-834 Malicious File Transfer - COLDDRAW, Download, Variant #5\n\nA101-835 Malicious File Transfer - COLDDRAW, Download, Variant #6\n\nA104-800 Protected Theater - COLDDRAW, Execution\n\nA151-079 Malicious File Transfer - COLDDRAW, Download, Variant #1\n\nA100-308 Malicious File Transfer - CHANITOR, Download\n\nA100-309 Command and Control - CHANITOR, Post System Info\n\nA150-008 Command and Control - CHANITOR, Check-in and Response\n\nA150-047 Malicious File Transfer - CHANITOR, Download, Variant #2\n\nA150-306 Malicious File Transfer - CHANITOR, Download, Variant #1\n\n## YARA Signatures\n\nThe following YARA rules are not intended to be used on production systems or to inform blocking rules without first being validated through\nan organization's own internal testing processes to ensure appropriate performance and limit the risk of false positives. These rules are\nintended to serve as a starting point for hunting efforts to identify samples, however, they may need adjustment over time if the malware family\nchanges.\n\n\n-----\n\n```\nrule TERMITE\n{\n\n```\n```\n  meta:\n    author = \"Mandiant\"\n\n```\n```\n  strings:\n    $sb1 = { E8 [4] 3D 5? E3 B6 00 7? }\n\n```\n```\n    $sb2 = { 6B ?? 0A [3] 83 E9 30 }\n    $si1 = \"VirtualAlloc\" fullword\n\n```\n```\n    $ss1 = \"AUTO\" fullword\n  condition:\n\n```\n```\n    (uint16(0) == 0x5A4D) and (uint32(uint32(0x3C)) == 0x00004550) and (uint16(uint32(0x3C)+0x18) == 0x010B)\nand all of them\n}\n\n```\n```\nrule FDFWJTORFQVNXQHFAH\n{\n\n```\n```\n  meta:\n    author = \"Mandiant\"\n\n```\n```\n    description = \"Detecting packer or cert.\"\n    md5 = \"939ab3c9a4f8eab524053e5c98d39ec9\"\n\n```\n```\n  strings:\n    $cert = \"FDFWJTORFQVNXQHFAH\"\n\n```\n```\n    $s1 = \"VLstuTmAlanc\"\n    $s2 = { 54 68 F5 73 20 70 00 00 00 00 00 00 00 BE 66 67 72 BD 68 20 63 BD 69 6E 6F C0 1F 62 65 EC 72 75 6E\nFC 6D 6E 20 50 46 53 20 B9 66 64 65 }\n\n```\n```\n    $s3 = \"ViGuua!Gre\"\n    $s4 = \"6seaIdFiYdA\"\n\n```\n```\n  condition:\n    (uint16(0) == 0x5A4D) and filesize < 2MB and ( $cert or 2 of ($s*) )\n\n```\n```\n }\n\n## Indicators\n\n```\n**MALWARE FAMILY** **Indicator**\n\nTERMITE/BEACON irrislaha[.]com\n\nBEACON leptengthinete[.]com\n\nBEACON siagevewilin[.]com\n\nBEACON surnbuithe[.]com\n\nTERMITE 64.235.39[.]82\n\nBEACON 64.52.169[.]174\n\n\n-----\n\nSuspect certificate 144.172.83[.]13\n\nBEACON 190.114.254[.]116\n\nBEACON 185.153.199[.]164\n\nTERMITE 45.32.229[.]66\n\nBEACON 23.227.197[.]229\n\nPacker imphash 2322896bcde6c37bf4a87361b576de02\n\nPacker cert CN FDFWJTORFQVNXQHFAH\n\nPacker cert md5 5c00466f092b19c85873848dcd472d6f\n\n\n**MALWARE**\n**FAMILY**\n\n\n**MD5** **SHA1** **SHA256**\n\n\nBUGHATCH 72a60d799ae9e4f0a3443a2f96fb4896 a304497ff076348e098310f530779002a326c264 6d5ca42906c60caa7d3e0564b0\n\nBUGHATCH bda33efc53c202c99c1e5afb3a13b30c e6ea0765b9a8cd255d587b92b2a80f96fab95f15 101b3147d404150b3c0c882ab86\n\nBUGHATCH e78ed117f74fd7441cadc3ea18814b3e 6da8a4a32a4410742f626376cbec38986d307d5a 9ab05651daf9e8bf3c84b14613cd\n\nBUGHATCH ba83831700a73661f99d38d7505b5646 209ffbc8ba1e93167bca9b67e0ad3561c065595d 79d6b1b6b1ecb446b0f49772bf4\n\nWEDGECUT c47372b368c0039a9085e2ed437ec720 4f6ee84f59984ff11147bfff67ab6e40cd7c8525 c443df1ddf8fd8a47af6fbfd0b597\n\nBURNTCIGAR c5e3b725080712c175840c59a37a5daa f347fa07f13c3809e4d2d390e1d16ff91f6dc959 f68cea99e6887739cd82865f9b97\n\nBURNTCIGAR c9d3b29e0b7662dafc6a1839ad54a6fb d0bbbc1866062f9a772776be6b7ef135d6c5e002 4306c5d152cdd86f3506f91633ef\n\nBURNTCIGAR 9ca2579117916ded7ac8272b7b47bb98 d1ef60835127e35154a04d0c7f65beee6e790e44 aeb044d310801d546d10b24716\n\n\nBURNTCIGAR\n(launcher)\n\n\n26c09228e76764a2002ba643afeb9415 8247880a1bad73caaeed25f670fc3dad1be0954a 6ce206a1e1224e0a9d296d5fabff\n\n\nTERMITE 98a2e05f4aa648b02540d2e17946da7e e328b5e26a04a13e80e60b4a0405512c99ddb74e 811bb84e1e9f59279f844a040bf6\n\nTERMITE ddf2e657a89ae38f634c4a271345808b b73763c98523e544c0ce0da7db7142f1e039c0a2 d1e14b5f02fb020db4e215cb5c3a\n\nTERMITE 95820d16da2d9c4fbb07130639be2143 0a3ac9b182d8f14d9bc368d0c923270eed29b950 a722615c2ee101cde88c7f44fb2\n\nTERMITE 896376ce1bbca1ed73a70341896023e0 f1be87ee03a2fb59d51cb4ba1fe2ece8ddfb5192 671e049f3e2f6b7851ca4e8eed2\n\nTERMITE f51c4b21445a0ece50b1f920648ed726 7c88207ff1afe8674ba32bc20b597d833d8b594a ea5de5558396f66af8382afd98f2\n\nTERMITE 7d4307d310ad151359b025fc5a7fca1a 49cfcecd50fcfcd3961b9d3f8fa896212b7a9527 ad12f38308a85c8792f2f7e1e46a\n\nTERMITE b62eec21d9443f8f66b87dd92ba34e85 172f28f61a35716762169d63f207071adf21a54c 9cec82bebe1637c50877ff11de5b\n\nTERMITE df0e5d91d0986fde9bc02db38eef5010 922ca12c04b064b35fd01daadf5266b8a2764c32 6cd25067316f8fe013792697f2f5\n\n\n-----\n\nTERMITE 46b977a0838f4317425df0f2e1076451 39381976485fbe4719e4585f082a5252feedbcfd 13d333d5e3c1dd6c33dfa8fc76de\n\nTERMITE 8c4341a4bde2b6faa76405f57e00fc48 4f3a1e917f67293578b7e823bca35c4dff923386 df89d3d1f795a77eefc14f035681\n\nTERMITE d5679f47d22c7c0647038ce6f54352e4 d9030bdbd0cb451788eaa176a032aa83cf7604c0 728a2d5dd2bf9c707431ff68e94c\n\nTERMITE e77af544cc9d163d81e78b3c4da2eee5 3ead9dd8c31d8cfb6cc53e96ec37bdcfdbbcce78 7f357ab4ac225e14a6967f89f209\n\nTERMITE 98b2fff45a9474d61c1bd71b7a60712b 3b0ec4b6ad3cf558cac6b2c6e7d8024c438cfbc5 7b2144f2b5d722a1a8a0c47a43e\n\nTERMITE 9a0a2f1dc7686983843ee38d3cab448f 363dc3cf956ab2a7188cf0e44bffd9fba766097d 03249bf622c3ae1dbed8b14cfaa8\n\nTERMITE fb6da2aa2aca0ce2e0af22b2c3ba2668 55b89bad1765bbf97158070fd5cbf9ea7d449e2a 1842ddc55b4bf9c71606451d404\n\nCOLDDRAW 3e96efd37777cc01cabb3401485297aa f008e568c313b6f41406658a77313f89df07017e bcf0f202db47ca671ed614604079\n\nCOLDDRAW 73c0f0904105b4c220c25f64506ea986 7ef1f5946b25f56a97e824602c58076e4b1c10b6 e35593fab92606448ac4cac6cd2\n\nCOLDDRAW 20a04e7fc12259dfd4172f5232ed5ccf 82f194e6baeef6eefb42f0685c49c1e6143ec850 482b160ee2e8d94fa6e4749f77e\n\n\nExchange\nPayload\ntest.hta\n\n\nbecdcaa3a4d933c13427bb40f9c1cfbb ee883ec4b7b7c1eba7200ee2f9f3678f67257217 6c4b57fc995a037a0d60166dead\n\n\nBEACON c0e88dee5427aae6ce628b48a6d310a7 fd4c478f1561db6a9a0d7753741486b9075986d0 44a4ce7b5d2e154ec802a67ef14\n\nBEACON bb2a2818e2e4514507462aadea01b3d7 8fec34209f79debcd9c03e6a3015a8e3d26336bb 6e66caaa12c3cafd1dc3f8c63053\n\nBEACON 48f8cd5e42cdf06d5a520ab66a5ae576 0d0ac944b9c4589a998b5032d208a16e63db5817 d8df1a4d59a0382b367fd6936cce\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/1zhix5sctq830bokn4in5tc7q6ks8u8r"
    ],
    "report_names": [
        "Mandiant_UNC2596-Observed-Leveraging-Vulnerabilities-Cuba-Ransomware(02-23-2022)"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf1c7efe-4464-4347-95d3-c86fb4d7db51",
            "created_at": "2022-10-25T16:07:24.35977Z",
            "updated_at": "2025-03-27T02:02:10.189727Z",
            "deleted_at": null,
            "main_name": "UNC2447",
            "aliases": [],
            "source_name": "ETDA:UNC2447",
            "tools": [
                "7-Zip",
                "AdFind",
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "DEATHRANSOM",
                "DeathRansom",
                "FIVEHANDS",
                "FOXGRABBER",
                "HELLOKITTY",
                "HelloKitty",
                "KittyCrypt",
                "Mimikatz",
                "PCHUNTER",
                "RCLONE",
                "ROUTERSCAN",
                "Ragnar Locker",
                "RagnarLocker",
                "Rclone",
                "S3BROWSER",
                "SombRAT",
                "Thieflock",
                "WARPRISM",
                "cobeacon",
                "deathransom",
                "wacatac"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d58052ba-978b-4775-985a-26ed8e64f98c",
            "created_at": "2023-09-07T02:02:48.069895Z",
            "updated_at": "2025-03-27T02:02:10.181465Z",
            "deleted_at": null,
            "main_name": "Tropical Scorpius",
            "aliases": [
                "DEV-0978",
                "RomCom",
                "Storm-0978",
                "Tropical Scorpius",
                "UNC2596",
                "Void Rabisu"
            ],
            "source_name": "ETDA:Tropical Scorpius",
            "tools": [
                "COLDDRAW",
                "Cuba",
                "Industrial Spy",
                "PEAPOD",
                "ROMCOM",
                "ROMCOM RAT",
                "SingleCamper",
                "SnipBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "065b7ea2-5920-4270-824e-94ea8a79d197",
            "created_at": "2023-12-08T02:00:05.747632Z",
            "updated_at": "2025-03-27T02:00:03.265128Z",
            "deleted_at": null,
            "main_name": "UNC2447",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2447",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4f56bb34-098d-43f6-a0e8-99616116c3ea",
            "created_at": "2024-06-19T02:03:08.048835Z",
            "updated_at": "2025-03-27T02:05:17.365266Z",
            "deleted_at": null,
            "main_name": "GOLD FLAMINGO",
            "aliases": [
                "Tropical Scorpius ",
                "UAC-0132 ",
                "UAC-0132 ",
                "UNC2596 ",
                "Void Rabisu ",
                "REF9019 "
            ],
            "source_name": "Secureworks:GOLD FLAMINGO",
            "tools": [
                " Cobalt Strike",
                " Cuba",
                " Meterpreter",
                " Mimikatz",
                " ROMCOM RAT",
                "Chanitor"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1651676227,
    "ts_modification_date": 1651676227,
    "files": {
        "pdf": "https://archive.orkl.eu/97d56a7fe645bf9914b5547b5efa6f3ef3234ac0.pdf",
        "text": "https://archive.orkl.eu/97d56a7fe645bf9914b5547b5efa6f3ef3234ac0.txt",
        "img": "https://archive.orkl.eu/97d56a7fe645bf9914b5547b5efa6f3ef3234ac0.jpg"
    }
}