{
    "id": "627e84ff-9093-4323-bda7-5a6588ddae47",
    "created_at": "2023-03-03T02:06:21.718872Z",
    "updated_at": "2025-03-27T02:14:05.960322Z",
    "deleted_at": null,
    "sha1_hash": "221dbdaed653b7e56fdb1f2ff2ff5ad448061477",
    "title": "2022-10-25 - DEV-0832 (Vice Society) opportunistic ransomware campaigns impacting US education sector",
    "authors": "",
    "file_creation_date": "2023-03-01T09:08:29Z",
    "file_modification_date": "2023-03-01T09:08:29Z",
    "file_size": 571834,
    "plain_text": "# DEV-0832 (Vice Society) opportunistic ransomware campaigns impacting US education sector\n\n**microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-**\nus-education-sector/\n\nOctober 25, 2022\n\nIn recent months, Microsoft has detected active ransomware and extortion campaigns\nimpacting the global education sector, particularly in the US, by a threat actor we track as\nDEV-0832, also known as Vice Society. Shifting ransomware payloads over time from\n[BlackCat,](https://www.microsoft.com/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/) [QuantumLocker, and](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/) [Zeppelin, DEV-0832’s latest payload is a Zeppelin variant](https://www.cisa.gov/uscert/ncas/alerts/aa22-223a)\nthat includes Vice Society-specific file extensions, such as .v-s0ciety, .v-society, and, most\nrecently, .locked. In several cases, Microsoft assesses that the group did not deploy\nransomware and instead possibly performed extortion using only exfiltrated stolen data.\n\nDEV-0832 is a cybercriminal group that has reportedly been active as early as June 2021.\nWhile the latest attacks between July and October 2022 have heavily impacted the education\nsector, DEV-0832’s previous opportunistic attacks have affected various industries like local\ngovernment and retail. Microsoft assesses that the group is financially motivated and\ncontinues to focus on organizations where there are weaker security controls and a higher\nlikelihood of compromise and ransom payout. Before deploying ransomware, DEV-0832\n\n\n-----\n\nrelies on tactics, techniques, and procedures commonly used among other ransomware\nactors, including the use of PowerShell scripts, repurposed legitimate tools, exploits for\npublicly disclosed vulnerabilities for initial access and post-compromise elevation of privilege,\nand commodity backdoors like SystemBC.\n\nRansomware has evolved into a complex threat that’s human-operated, adaptive, and\nfocused on a wider scale, using data extortion as a monetization strategy to become even\nmore impactful in recent years. To find easy entry and privilege escalation points in an\nenvironment, these attackers often take advantage of poor credential hygiene and legacy\nconfigurations or misconfigurations. Defenders can build a robust defense against\n[ransomware by reading our ransomware as a service blog.](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/)\n\nIn this blog, we detail Microsoft’s analysis of observed DEV-0832 activity, including the tactics\nand techniques used across the group’s campaigns, with the goal of helping customers\nidentify, investigate, and remediate activity in their environments. We provide hunting queries\nto help customers comprehensively search their environments for relevant indicators as well\nas protection and hardening guidance to help organizations increase resilience against these\nand similar attacks.\n\n## Who is DEV-0832 (Vice Society)?\n\nMicrosoft has identified multiple campaigns attributed to DEV-0832 over the past year based\non the use of a unique PowerShell file name, staging directories, and ransom payloads and\ntheir accompanying notes. To gain an initial foothold in compromised networks, DEV-0832\nhas [reportedly exploited vulnerable web-facing applications and used valid accounts.](https://www.cisa.gov/uscert/ncas/alerts/aa22-249a)\nHowever, due to limited initial signals from affected organizations, Microsoft has not\nconfirmed these attack vectors. Attackers then use custom PowerShell scripts, commodity\ntools, exploits for disclosed vulnerabilities, and native Windows binaries to gather privileged\ncredentials, move laterally, collect and exfiltrate data, and deploy ransomware.\n\nAfter deploying ransomware, DEV-0832 demands a ransom payment, threatening to leak\nstolen data on the group’s [.]onion site. In some cases, Microsoft observed that DEV-0832\ndid not deploy ransomware. Instead, the actors appeared to exfiltrate data and dwell within\ncompromised networks. The group sometimes avoids a ransomware payload in favor of\nsimple extortion—threatening to release stolen data unless a payment is made.\n\nThe group also goes to significant measures to ensure that an organization cannot recover\nfrom the attack without paying the ransom: Microsoft has observed DEV-0832 access two\ndomain administrator accounts and reset user passwords of over 150,000 users, essentially\nlocking out legitimate users before deploying ransomware to some devices. This effectively\ninterrupts remediation efforts, including attempts to prevent the ransomware payload or postcompromise incident response.\n\n\n-----\n\n### Toolset\n\n**Ransomware payloads**\n\nMicrosoft has observed DEV-0832 deploy multiple commodity ransomware variants over the\npast year: BlackCat, QuantumLocker, Zeppelin, and most recently a Vice Society-branded\nvariant of the Zeppelin ransomware. While many ransomware groups have shifted away from\nbranded file extensions in favor of randomly generated ones, DEV-0832 incorporated\nbranding with their Vice Society variant using .v-s0ciety or .v-society file extensions. Most\nrecently in late September 2022, DEV-0832 again modified their ransomware payload to a\nvariant dubbed RedAlert, using a .locked file extension.\n\nIn one July 2022 intrusion, Microsoft security researchers identified DEV-0832 attempt to\ndeploy QuantumLocker binaries, then within five hours, attempt to deploy suspected\nZeppelin ransomware binaries. Such an incident might suggest that DEV-0832 maintains\nmultiple ransomware payloads and switches depending on target defenses or, alternatively,\nthat dispersed operators working under the DEV-0832 umbrella might maintain their own\n[preferred ransomware payloads for distribution. The shift from a ransomware as a service](https://aka.ms/ransomware-as-a-service)\n(RaaS) offering (BlackCat) to a purchased wholly-owned malware offering (Zeppelin) and a\ncustom Vice Society variant indicates DEV-0832 has active ties in the cybercriminal economy\nand has been testing ransomware payload efficacy or post-ransomware extortion\nopportunities.\n\nIn many intrusions, DEV-0832 stages their ransomware payloads in a hidden share on a\nWindows system, for example accessed via a share name containing “$”. Once DEV-0832\nhas exfiltrated data, they then distribute the ransomware onto local devices for launching,\nlikely using group policy, as shown in the below command:\n\nFigure 1. Group policy to distribute ransomware onto local devices\nThe group also has cross-platform capabilities: Microsoft identified the deployment of a Vice\nSociety Linux Encryptor on a Linux ESXi server.\n\n**PowerShell scripts**\n\nDEV-0832 uses a PowerShell script to conduct a variety of malicious activities and make\nsystem-related changes within compromised networks. Like their ransomware payloads,\nDEV-0832 typically stages their PowerShell scripts on a domain controller.\n\nMicrosoft security researchers have observed several variations among identified DEV-0832\nPowerShell scripts, indicating ongoing refinement and development over time—while some\nonly perform system discovery commands, other scripts are further modified to perform\npersistence, defense evasion, data exfiltration, and even distribute the ransomware\npayloads.\n\n\n-----\n\n**Commodity tools**\n\nAccording to Microsoft investigations, DEV-0832 has used two commodity backdoors in\nransomware attacks: SystemBC and PortStarter.\n\n_SystemBC is a post-compromise commodity remote access trojan (RAT) and proxy tool that_\nhas been incorporated into multiple diverse ransomware attacks. In one DEV-0832 intrusion,\nthe attacker used both a compromised domain admin user account and a compromised\ncontractor account to launch a PowerShell command that launched a SystemBC session\nunder the value name “socks”:\n\nFigure 2. Powershell command launching a SystemBC session named ‘socks’\n_PortStarter is a backdoor written in Go. According to Microsoft analysis, this malware_\nprovides functionality such as modifying firewall settings and opening ports to connect to preconfigured command-and-control (C2) servers.\n\nDEV-0832 has also deployed ransomware payloads using the remote launching tool Power\nAdmin. Power Admin is a legitimate tool that provides functionality to monitor servers and\napplications, as well as file access auditing. If an organization has enabled Console Security\nsettings within Power Admin, an attacker must have credentials to make authorized changes.\n\nOther commodity tools identified in DEV-0832 attacks include Advanced Port Scanner and\nAdvanced IP Scanner for network discovery.\n\n**Abuse of legitimate tooling**\n\nLike many other ransomware actors, DEV-0832 relies on misusing legitimate system tools to\nreduce the need to launch malware or malicious scripts that automated security solutions\nmight detect. Observed tools include:\n\nUse of the [Windows Management Instrumentation Command-line (WMIC) to launch](https://learn.microsoft.com/windows/win32/wmisdk/wmic)\ncommands that delete Mongo databases, other backups, and security programs.\nUse of Impacket’s WMIexec functionality, an open-source tool to launch commands via\nWMI, and Impacket atexec.py, which launches commands using Task Scheduler.\nUse of the [vssadmin command to delete shadow copy backups on Windows Server.](https://learn.microsoft.com/windows-server/administration/windows-commands/vssadmin)\nUse of [PsExec to remotely launch PowerShell, batch scripts, and deploy ransomware](https://learn.microsoft.com/sysinternals/downloads/psexec)\npayloads\n\nAdditionally, in one identified intrusion, DEV-0832 attempted to turn off Microsoft Defender\n[Antivirus using registry commands. Enabling Microsoft Defender Antivirus tamper protection](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection)\nhelps block this type of activity.\n\n\n-----\n\nFigure 3. Registry commands that attempt to tamper with Microsoft Defender antivirus\nsoftware\n\n### Harvesting privileged credentials for ransomware deployment\n\nLike other ransomware groups, after gaining an initial foothold within a network, DEV-0832\nmoves quickly to gather valid administrator local or domain credentials to ensure they can\ndistribute ransomware payloads throughout the network for maximum impact.\n\n**Credential dumps**\n\nWhile Microsoft has not identified all the credential access techniques of DEV-0832, in many\ninstances DEV-0832 accesses Local Security Authority Server Service (LSASS) dumps to\nobtain valid account credentials that were present in memory. Microsoft also observed that,\n\n\n-----\n\ninstead of using a tool like Mimikatz to access a credential dump, DEV-0832 typically abuses\nthe tool comsvcs.dll along with MiniDump to dump the LSASS process memory. Other\nransomware actors have been observed using the same technique.\n\nIn cases where DEV-0832 obtained domain-level administrator accounts, they accessed\nNTDS dumps for later cracking. The following command shows the attacker exfiltrating the\n_NTDS.dit file, which stores Active Directory data to an actor-created directory:_\n\nFigure 4. Example of attacker command to exfiltrate the ‘NTDS.dit’ file\n\n**Kerberoast**\n\nMicrosoft has also identified DEV-0832 used the malicious PowerSploit module Invoke_Kerberoast to perform a Kerberoast attack, which is a post-exploitation technique used to_\nobtain credentials for a service account from Active Directory Domain Services (AD DS). The\n_Invoke-Kerberoast module requests encrypted service tickets and returns them in an_\nattacker-specified output format compatible with cracking tools. The group can use the\ncracked Kerberos hashes to reveal passwords for service accounts, often providing access\nto an account that has the equivalent of domain admin privileges. Furthermore, one Kerberos\nservice ticket can have many associated service principal names (SPNs); successful\nKerberoasting can then grant an attacker access to the SPNs’ associated service or user\naccounts, such as obtaining ticket granting service (TGS) tickets for Active Directory SPNs\nthat would allow an attacker to do offline password cracking.\n\nCombined with the fact that service account passwords are not usually set to expire and\ntypically remain unchanged for a great length of time, attackers like DEV-0832 continue to\nrely on Kerberoasting in compromised networks. Microsoft 365 Defender blocks this attack\nwith Antimalware Scan Interface (AMSI) and machine learning. Monitor for alerts that\nreference Kerberoast attacks closely as the presence of these alerts typically indicates a\nhuman adversary in your environment.\n\n**Account creation**\n\nIn one suspected DEV-0832 intrusion, Microsoft observed an operator create accounts that,\nbased on the naming convention, were designed to blend in as admin accounts and allow\npersistence without malware, as shown in the following command:\n\nFigure 5. Attacker command to create accounts\nMonitoring newly created accounts can help identify this type of suspicious activity that does\nnot rely on launching malware for persistence in the environment.\n\n**Exploitation of privilege escalation vulnerabilities**\n\n\n-----\n\nIn August 2022, Microsoft security researchers identified one file during a DEV-0832\nintrusion indicating that the group has incorporated an exploit for the disclosed, patched\n[security flaw CVE-2022-24521 (Windows Common Log File System (CLFS) logical-error](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24521)\nvulnerability). Microsoft released a patch in April 2022. The DEV-0832 file spawns a new\n_cmd.exe process with system privileges._\n\nAccording to public reporting, DEV-0832 has also incorporated exploits for the\n[PrintNightmare vulnerability to escalate privileges in a domain. Combined with the CVE-](https://www.cisa.gov/uscert/ncas/alerts/aa22-249a)\n2022-24521 exploit code, it is likely that DEV-0832, like many other adversaries, quickly\nincorporates available exploit code for disclosed vulnerabilities into their toolset to target\nunpatched systems.\n\n**Lateral movement with valid accounts**\n\nAfter gaining credentials, DEV-0832 frequently moves laterally within a network using\nRemote Desktop Protocol (RDP). And as previously mentioned, DEV-0832 has also used\nvalid credentials to interact with remote network shares over Server Message Block (SMB)\nwhere they stage ransomware payloads and PowerShell scripts.\n\n### Data exfiltration\n\nIn one known intrusion, DEV-0832 operators exfiltrated hundreds of gigabytes of data by\nlaunching their PowerShell script, which was staged on a network share. The script\ncontained hardcoded attacker-owned IP addresses and searched for wide-ranging, nontargeted keywords ranging from financial documents to medical information, while excluding\nfiles containing keywords such as varied antivirus product names or file artifact extensions.\nGiven the wide range of keywords included in the script, it is unlikely that DEV-0832 regularly\ncustomizes it for each target.\n\nMicrosoft suspects that DEV-0832 uses legitimate tools Rclone and MegaSync for data\nexfiltration as well; many ransomware actors leverage these tools, which provide capabilities\nto upload files to cloud storage. DEV-0832 also uses file compression tools to collect data\nfrom compromised devices.\n\n## Mitigations\n\nApply these mitigations to reduce the impact of this threat:\n\nUse [device discovery to increase your visibility into your network by finding unmanaged](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/device-discovery)\ndevices on your network and onboarding them to Microsoft Defender for Endpoint.\nUse [Microsoft Defender Vulnerability Management to assess your current status and](https://security.microsoft.com/vulnerabilities)\ndeploy any updates that might have been missed.\n\n\n-----\n\nUtilize [Microsoft Defender Firewall, intrusion prevention devices, and your network](https://support.microsoft.com/windows/turn-microsoft-defender-firewall-on-or-off-ec0844f7-aebd-0583-67fe-601ecf5d774f)\nfirewall to prevent RPC and SMB communication among endpoints whenever possible.\nThis limits lateral movement as well as other attack activities.\nTurn on [cloud-delivered protection in Microsoft Defender Antivirus or the equivalent for](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus)\nyour antivirus product to cover rapidly evolving attacker tools and techniques. Cloudbased machine learning protections block a huge majority of new and unknown\nvariants.\nTurn on [tamper protection features to prevent attackers from stopping security](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection?view=o365-worldwide)\nservices.\n[Run endpoint detection and response (EDR) in block mode so that Microsoft Defender](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/edr-in-block-mode)\nfor Endpoint can block malicious artifacts, even when your non-Microsoft antivirus\ndoesn’t detect the threat or when Microsoft Defender Antivirus is running in passive\nmode. EDR in block mode works behind the scenes to remediate malicious artifacts\nthat are detected post-breach.\n[Enable investigation and remediation in full automated mode to allow Microsoft](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/automated-investigations)\nDefender for Endpoint to take immediate action on alerts to resolve breaches,\nsignificantly reducing alert volume.\n[LSA protection is enabled by default on new Windows 11 devices, hardening the](https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection)\nplatform against credential dumping techniques. LSA PPL protection will further restrict\naccess to memory dumps making it hard to obtain credentials.\nRefer to Microsoft’s blog Ransomware as a service: Understanding the cybercrime gig\neconomy and how to protect yourself for recommendations on building strong\ncredential hygiene and other robust measures to defend against ransomware.\n\nMicrosoft customers can turn on [attack surface reduction rules to prevent several of the](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction)\ninfection vectors of this threat. These rules, which can be configured by any administrator,\noffer significant hardening against ransomware attacks. In observed attacks, Microsoft\ncustomers who had the following rules enabled were able to mitigate the attack in the initial\nstages and prevented hands-on-keyboard activity:\n\n## Detection details\n\n### Microsoft Defender Antivirus\n\n[Microsoft Defender Antivirus detects DEV-0832’s Vice Society-branded Zeppelin variant as](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-defender-antivirus-windows?view=o365-worldwide)\nthe following malware:\n\n[Ransom:Win32/VSocCrypt](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Win32/VSocCrypt.PA!MTB&threatId=-2147138765)\n[Trojan:PowerShell/VSocCrypt](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:PowerShell/VSocCrypt.PA!MTB&threatId=-2147136227)\n[Ransom:Linux/ViceSociety](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Linux/ViceSociety.D!MTB&threatId=-2147136262)\n\nOther commodity ransomware variants previously leveraged by DEV-0832 are detected as:\n\n\n-----\n\n_SystemBC and PortStarter are detected as:_\n\n[Behavior:Win32/SystemBC](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Behavior:Win32/SystemBC.A!nri&threatId=-2147149800)\n[Trojan:Win32/SystemBC](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/SystemBC.SA!sms&threatId=-2147150468)\n[Backdoor:Win64/PortStarter](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Backdoor:Win64/PortStarter&threatId=-2147137231)\n\nSome pre-ransomware intrusion activity used in multiple campaigns by various activity\ngroups can be detected generically. During identified DEV-0832 activity, associated\ncommand line activity was detected with generic detections, including:\n\nBehavior:Win32/OfficeInjectingProc.A\nBehavior:Win32/PsexecRemote.E\nBehavior:Win32/SuspRemoteCopy.B\nBehavior:Win32/PSCodeInjector.A\nBehavior:Win32/REnamedPowerShell.A\n\n### Microsoft Defender for Endpoint\n\n[The following Microsoft Defender for Endpoint alerts can indicate threat activity on your](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint?rtc=1)\nnetwork:\n\nDEV-0832 activity group\n‘VSocCrypt’ ransomware was prevented\n\nThe following alerts might also indicate threat activity associated with this threat. These\nalerts, however, can be triggered by unrelated threat activity.\n\nUse of living-off-the-land binary to run malicious code\nPotential SystemBC execution via Windows Task Scheduler\nSuspicious sequence of exploration activities\nProcess memory dump\nSuspicious behavior by cmd.exe was observed\nSuspicious remote activity\nSuspicious access to LSASS service\nSuspicious credential dump from NTDS.dit\nFile backups were deleted\nSystem recovery setting tampering\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-25 - DEV-0832 (Vice Society) opportunistic ransomware campaigns impacting US education sector.pdf"
    ],
    "report_names": [
        "2022-10-25 - DEV-0832 (Vice Society) opportunistic ransomware campaigns impacting US education sector.pdf"
    ],
    "threat_actors": [
        {
            "id": "84aa9dbe-e992-4dce-9d80-af3b2de058c0",
            "created_at": "2024-02-02T02:00:04.041676Z",
            "updated_at": "2025-03-27T02:00:03.297502Z",
            "deleted_at": null,
            "main_name": "Vanilla Tempest",
            "aliases": [
                "DEV-0832",
                "Vice Society"
            ],
            "source_name": "MISPGALAXY:Vanilla Tempest",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "600a0c3b-b595-4d10-b84b-cc2cf89289ac",
            "created_at": "2024-06-19T02:03:08.134296Z",
            "updated_at": "2025-03-27T02:05:17.402638Z",
            "deleted_at": null,
            "main_name": "GOLD VICTOR",
            "aliases": [
                "STAC5279 ",
                "Vanilla Tempest ",
                "Vice Society",
                "DEV-0832 "
            ],
            "source_name": "Secureworks:GOLD VICTOR",
            "tools": [
                " Advanced Port Scanner",
                " HelloKitty ransomware",
                " MEGAsync",
                " Neshta",
                " PAExec",
                " PSexec",
                " PortStarter",
                " SystemBC",
                " Zeppelin ransomware",
                "Advanced IP Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1677809181,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1677661709,
    "ts_modification_date": 1677661709,
    "files": {
        "pdf": "https://archive.orkl.eu/221dbdaed653b7e56fdb1f2ff2ff5ad448061477.pdf",
        "text": "https://archive.orkl.eu/221dbdaed653b7e56fdb1f2ff2ff5ad448061477.txt",
        "img": "https://archive.orkl.eu/221dbdaed653b7e56fdb1f2ff2ff5ad448061477.jpg"
    }
}