{
    "id": "628002fb-5b97-4881-9c4e-b5668dbe8147",
    "created_at": "2022-10-25T16:48:22.515154Z",
    "updated_at": "2025-03-27T02:17:05.54319Z",
    "deleted_at": null,
    "sha1_hash": "a48cb6e2961d49d209196adbac1d95ebe21a5a56",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-01-27T12:14:34Z",
    "file_modification_date": "2016-01-27T12:14:40Z",
    "file_size": 7183584,
    "plain_text": "# Analyzing a New Variant\n of BlackEnergy 3\n## Likely Insider-Based Execution\n\n### By Udi Shamir\n\n**EXECUTIVE SUMMARY**\n\n_Note – While writing this report (1/26/2016) a new attack has just been detected, targeting a Ukranian power_\n_facility. The attack vector appears to the be the same variant analyzed in this report. We’ll provide more details in a_\n_subsequent analysis._\n\nBlackEnergy was first reported in 2007 (named BlackEnergy 1) and at the time was a relatively simple form of\nmalware that generated random bots to support Distributed Denial of Service (DDoS) attacks. A few years later,\nin 2010, BlackEnergy 2 emerged with some significant capabilities that extended beyond DDoS – most notably a\nnew plugin architecture that allowed BlackEnergy to subvert system resources and perform other activities such as\ndata exfiltration, and network traffic monitoring. It was at this time that many began to associate BlackEnergy with\ncrimeware. Our analysis of a new BlackEnergy 3 sample has led us to conclude that this latest rootkit is in fact the\nbyproduct of a nation-sponsored campaign, and likely the work of multiple teams coming together. It should be\nnoted that iSight Partners has already validated a link between BlackEnergy and the Sandworm Team. Therefore,\nthis conclusion in and of itself is not necessarily noteworthy, rather it’s the discover of a new tactic that’s now been\nemployed targeting specific individuals running Microsoft Office.\n\nIn this particular sample the actor appears to have advanced a method used back in 2014 against Industrial Control\nSystems systems deployed in NATO countries, and more broadly across the European Union. At that time the\nactor used a vulnerability, CVE-2014-4114, in the OLE packager 2 (packager.dll) in the way it parses INF files. Each\nbinary was compiled using different compiler versions, which led us to conclude that different groups are in fact\ndirectly involved in this campaign – much like a typical R&D project supported by different engineering teams who\neach follow their own unique development characteristics. These different characteristics have established unique\nfingerprints that ID each of the individual group’s traits.\n\nTraditional antivirus software vendors would have a difficult time detecting this particular type of attack given the\nconstantly changing attack vectors even though they are still rooted to the same core components. For example,\nthe actor can choose to drop the same binaries packed with different FUD (Fully undetected) using different Excel\ndocuments.\n\nIt’s expected that this particular sample is already resident in many systems across the Ukraine, and likely other\nnations in Europe which could lead to more blackouts and “mysterious” malfunctions within major utilities,\ntransportation systems, and even healthcare institutions. There may be different variants of BlackEnergy used\nwithin each of these environments, but they all originate from the same common core.\n\n**INTRODUCTION**\n\nExecution of this particular BlackEnergy 3 attack vector is likely the work of an internal actor, especially in the case\nof SCADA systems. This is due to the fact that Office 2013 has already been patched against CVE-2014-4114. The\nonly two options then to carry out the attack is – target a victim’s machine that was not patched, or get an internal\nemployee to either accidentally or deliberately execute the infected Excel documents causing the malware to\npropagate inside the network. At this point it would be highly unlikely that organizations have not deployed the\npatch against CVE-2014-4114, thus the most likely conclusion is use of an internal actor.\n\n\n-----\n\ncrucial during the development cycle and assists the debugger with finding the following:\n\n- Private, public, and static function addresses\n\n- Global variables\n\n- Parameters and local variable names\n\n- Frame pointer omission\n\n- Source file names and lines\n\nWithin the Visual Studio community, it’s common to say – love, hold and protect your PDBs! The path was\nstructured from drive E:\\ and was under a recursive releases parent directory. The PDB pointed to the winpcap\nversion 4_1_0_2001, which suggests that the author probably wanted to implement RAW sockets and to actively\ntap the network.\n\nBy nature of the sample operation, and its diversity, it appears that this toolkit/s was authored for the purposes\nof ‘black ops’ and likely being used by multiple groups in parallel. For example, used to steal banking credentials\nwhile in parallel used against Georgia in the conflict with Russia. This is an assumption as the time overlaps with the\nBlackEnergy discover, and can see some of the same unique fingerprints.\n\nIt’s expected that this same group is also responsible for the “shut down” of the Estonian internet and government\n[web sites that began in 2007. Many associated this attack to a retaliatory statement against Estonian’s desire](https://en.wikipedia.org/wiki/2007_cyberattacks_on_Estonia)\nfor independence. However, these actions could also be related to testing of new “tools” before conducting or\nestablishing a much bigger ops campaign.\n\nAs mentioned, BlackEnergy began supporting plugins in 2007 which we observed different versions.\n\nAs for the similarities and code reuse, an interesting finding shows that some mutex shares the exact same name:\n__Satori_81_MutexObject with the Sality malware variants. It appears some other variants are also utilizing the_\n[exact same name. Additional similarities can be found in Operation Potato Express, covered by ESET, that targets](http://www.welivesecurity.com/2015/07/30/operation-potao-express/)\ngovernment and military officials.\n\nWe’re confident that a particular government is well aware of this new attack and are likely actively participating in\nthe development of its core code / plugins.\n\nDuring 2014, samples started to show up (discovered) and were detected as BlackEnergy, targeting specific\nUkrainian government facilities. The version was more current than the samples detected in 2007. The 2014\nsamples were designed to perform exfiltration, and lateral movement, sending data to servers deployed in different\nmajor ISP’s including one of the largest across Europe.\n\n**MALICIOUS.XLS**\n\n**TYPE** XLS\n\n**SHA256** 052ebc9a518e5ae02bbd1bd3a5a86c3560aefc9313c18d81f6670c3430f1d4d4\n\n**SHA1** aa67ca4fb712374f5301d1d2bab0ac66107a4df1\n\n**MD5** 97b7577d13cf5e3bf39cbe6d3f0a7732\n\n**DETECTED** 33/55\n\n**UPLOADED** First: 2015-08-03 Last: 2016-01-15\n\n\n-----\n\ncreation of custom user interface elements that then allow different objects from different applications to add\ndifferent data types such as images.\n\nMicrosoft Office supports execution of macros (thanks to the OLE format) allowing the document’s author to easily\nembed macros and Visual Basic code that can then get executed by anybody who opens the document.\n\nMalicious actors began abusing this “fancy” feature and started to introduce this vector more often, and in the\nprocess gain much success. Microsoft in response added protection methods such as the ability to disable macros\nand any external content by default, and to warn the user when content such as a macro is about to be executed.\nThe the warning the user needs to specifically approve or deny the use.\n\nThe second vector involves exploiting a vulnerability found inside OLE, parsers and handlers, and executes the\nmalicious content without the user’s awareness.\n\nAs mentioned above, in 2014 Microsoft Office 2013 was vulnerable to an OLE bug which allowed an attacker to gain\nremote code execution by utilizing the vulnerable packager components.\n\nThe Microsoft Excel in this case will not execute its malicious code without explicitly having macro content\npermitted.\n\n**_Fig 2._**\n\nWhen checking the Document OLE structure we can immediately spot Visual Basic code attached as macro:\n\n**M 609230 ‘_VBA_PROJECT_CUR/VBA/Workbook________’**\n\n**_Fig 3. Visual Basic Macro_**\n\n\n-----\n\nreassembled using the for loop which saves the binary and then executes it.\n\nThe macro contains portable executable (PE32), by checking a(1) Array we see the first two decimal values\n77, 90 that when converted to Hex we will have 4d 5A that is a PE executable. The executable will be saved\non the Windows TMP directory under the name vba_macro.exe, the VB script finds the tmp directory by calling\n[ENVIRON(‘TMP’) and when it saves the PE to disk it will execute the binary: vba_macro.exe using the Shell function.](https://support.office.com/en-us/article/Shell-Function-ff2e4b1b-712d-4e34-aea6-6832eadd3c63)\n\n**_Fig 4. PE Decimal Values_**\n\n**_Fig 5. Saving the binary and executing_**\n\n**VBA_MACRO.EXE**\n\n**TYPE** PE32\n\n**SHA256** 07e726b21e27eefb2b2887945aa8bdec116b09dbd4e1a54e1c137ae8c7693660\n\n**SHA1** 4c424d5c8cfedf8d2164b9f833f7c631f94c5a4c\n\n**MD5** abeab18ebae2c3e445699d256d5f5fb1\n\n**DETECTED** 41 / 54\n\n**UPLOADED** First: 2015-03-24 Last: 2016-01-15\n\n**SIZE** 96k (rounded)\n\n**ENTROPY** 6.82694518574\n\n**COMPILER** Visual Studio C/C++ 6.0\n\n\n-----\n\nright code section. This is due to dead code, and the obfuscated code that reconstructs the sections and imports\nthem at run time.\n\nAs mentioned before, BlackEnergy was written in modular fashion and this binary drop’s two different executables\n(modules) while each perform different tasks.\n\n**_Fig 6. Most of the code is useless_**\n\nA much faster approach would be to use a debugger. This step requires several iterations over the Crypter stages\nwhile installing breakpoint on key Functions API and then executing.\n\n\n-----\n\n**_Fig 8. VirtualAlloc_** **_Fig 9. Finding portable executable_**\n\nAs mentioned above, the main executable being dropped from the Excel Spreadsheet (vba_macro.exe) executes an\nadditional two binaries that it creates: FONTCACHE.DAT and runndll32.exe, then it deletes the original executable (vba_\n\n**macro.exe).**\n\nThis binary creates / drops 4 files:\n\n- **FONTCACHE.DAT (Network sniffer based on WinPcap)**\n\n- **rundll32.exe (Original Microsoft load dll) was dropped in case its not exist**\n\n- **NTUSER.LOG (an empty file)**\n\n- **desktop.ini (default ini file)**\n\nThe FONTCACHE.DAT (the Network component) is the most interesting dropped file as this particular file behaves as\nnetwork sniffer.\n\nBefore creating the files, the binary retrieves the following information:\n\n- APPDATA using csidl (1Ch)\n\n- <Drive>:\\Windows\\System32 by calling the GetSystemDirectory() function\n\n**_Fig 10. Retrieve APPDATA directory path using csidl 1Ch_**\n\n\n-----\n\n**_Fig 11. Create Files_**\n\nSince FONTCACHE.DAT is a dll (shared library) that cannot be executed directly (rather being loaded by the\nLoadLibrary() function) the malware uses the rundll32.exe dll loader in order to execute the Malware.\n\n**_Fig 12. The file name is a GUID (globally unique identifier) format that is a_**\n_unique reference number_\n\nThe binary gets executed by the following command from the startup menu lnk:\n\n**rundll32.exe FONTCACHE.DAT #1.**\n\nLnk is a propriety Microsoft Windows shortcut, a metadata file which is interpreted by the Windows shell.\n\n**_Fig 13. Lnk Metadata, execute rundll32.exe in order to load the Malicious dll_**\n\n\n-----\n\n**_Fig 14. Possible Anti-Debugging Technique_**\n\nThe Binary is utilizing a second anti-debugging technique that uses the SetUnhandledExceptionFilter function API.\nThe third method is to check if the kernel debugger is attached, and the last one (and simplest to bypass) is the\nIsDebuggerPresent API.\n\n_NOTE: The binary executes FONTCACHE.DAT by calling the ShellExecute() and doesn’t wait for the machine to boot._\n\nThe process will constantly appear in the taskmgr as rundll32.exe.\n\nAs mentioned earlier, FONTCACHE.DAT is the network module that operates as a network sniffer extracting\ncrucial information for lateral movement, as well as other information related to the network structure and MAC\nmodification.\n\nThe lnk shortcut that will execute FONTCACHE.DAT needs to provide parameters such as the network adapter that\nthe sniffer will hook (attached). In order to gather this information, the binary calls the GetAdaptersInfo() function\nAPI that returns the network information for the local computer. This will be part of the startup routine.\n\n\n-----\n\n**_Fig 15. Extract startup menu and network adapter information_**\n\n**_Fig 16. Preparing the lnk file_**\n\nThe next step will be executing the lnk shortcut which creates a new process with specific parameters that\nincludes deleting the vba_macro.exe (the file that was dropped from the Excel sheet) and terminate itself by calling\nExitProcess().\n\n**_Fig 17. Executing the Sniffer and cmd.exe_**\n\n\n-----\n\n**_Fig 18. CreateProcess from Debugger_**\n\nThe loop will be executed 100 times and will try to duplicate itself - in case it does not exist, it will try to recreate\nitself.\n\n_NOTE: The cmd.exe will not be visible to the user._\n\nRegistry:\n\nThe sample register the binary to the startup shell using the RegSetValueExw()\n\n**Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders**\n\n**FONTCACHE.DAT (packet.dll)**\n\n**TYPE** PE32/DLL\n\n**SHA256** f5785842682bc49a69b2cbc3fded56b8b4a73c8fd93e35860ecd1b9a88b9d3d8\n\n**SHA1** 315863c696603ac442b2600e9ecc1819b7ed1b54\n\n**MD5** cdfb4cda9144d01fb26b5449f9d189ff\n\n**DETECTED** 39 / 55\n\n**UPLOADED** First: 2015-07-27 Last: 2016-01-15\n\n**SIZE** 55k (rounded)\n\n**ENTROPY** 7.5080540306\n\n**COMPILER** Visual Studio C/C++\n\nThis binary seems to embed WinPcap version 4.1.0_2001. This is interesting because Microsoft provides Winsock\nAPI in order to deal with the network stack. The only reason that comes to mind is the use of RAW sockets. The\nPacket.dll provides the binary support for capturing (sniffing), sending packets and alerting the source address. This\nis very similar to the FP_PACKETS sockets in Linux, and the BPF driver on the BSD systems.\n\nRAW sockets allow the developer to intercept, modify (craft), and build socket headers - writing new protocols,\nspoof source IP address and MAC address.\n\nWinSock2 API does support RAW sockets but in a limited way. Microsoft deliberately blocked some of its\nfunctionalities in order to prevent Malicious operations originating from their OS. For instance, Microsoft prevents\nthe change of the source IP address in the UDP protocol if its not equal to the network interface the computer it\n[connects to. This is to prevent DDoS attacks. Full Microsoft Documentation.](https://msdn.microsoft.com/en-us/library/windows/desktop/ms740548(v=vs.85).aspx)\n\n**_Fig 19. Microsoft MSDN RAW_SOCKET Limitation_**\n\n\n-----\n\nThe malware repeats the same evading technique as the vba_macro.exe by attempting to detect if its checksum was\nchanged during run time (detect non HW breakpoints) in order to make the debugging process harder.\n\n**_Fig 21. The binary is probably opening a backdoor by starting an RPC server_**\n_and listening for incoming traffic_\n\n**_Fig 20. Possible Anti-Debugging Technique_**\n\nWhen executing, it will first attempt to call OpenSCManagerA(), OpenServiceA(), and StartServiceA() in an attempt\nto start the WinPcap service “NPF” on the victim machine. In case it fails then it will load the WinPcap library (dll)\ndirectly by calling the LoadLibraryA().\n\nThe binary seems to be encrypted with an RC4 variant, base64, and probably compressed with LZMA. It executes\niexplore.exe and will initiate communication with the C2 server. Launching iexplore.exe might be for decoy, as\nprevious variants were opening an empty Word document.\n\n**_Fig 22. Delay Execution_**\n\n\n-----\n\n**_Fig 23. Getting the Keyboard layout_**\n\nThe binary is packed with very high entropy. Most of the data is encrypted and encoded using base64:\n\n**_Fig 24. Base64 string_**\n\n**_Fig 25. Calling Internet Explorer Server_**\n\n**_Fig 26. Calling Internet Explorer_**\n\n\n-----\n\n**_Fig 27. DLL Exports_**\n\nThe binary is capable of subverting and sniffing the network interfaces, including wireless adapters utilizing the\nPacketGetAirPcapHandle() function. All the information gathered will be sent to the C2 server (information\nregarding the C2 server could be gathered under Network Activity).\n\n**NETWORK ACTIVITY**\n\nThe binary connects to its C2 using HTTP protocol:\n\n**hxxx://5.149.254.114/Microsoft/Update/KC074913.php**\n\n**hxxx://5.149.254.114/favicon.ico**\n\nThe IP address 5.149.254.114 points to\nFORTUNIX-NETWORS.\n\n**_Fig 28. The IP address 5.149.254.114 points to FORTUNIX-NETWORS_**\n\n\n-----\n\n**162.246.22.74** new_jersey_international_internet_exchange\n\n**64.235.52.31** las_vegas_nv_datacenter\n\nBoth appear to be large data providers.\n\nWhen communicating with its C2 server the bot POST the following parameters:\n\n**B_ID** Bot id\n\n**B_GEN** Bot Generation\n\n**B_VER** Bot Version\n\n**OS_V** Operating System Version\n\n**OS_TYPE** Operating System Type\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.01.26.BlackEnergy3/BlackEnergy3_WP_012716_1c.pdf"
    ],
    "report_names": [
        "BlackEnergy3_WP_012716_1c"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a892faf-3d4d-4615-b7b6-cdbc2ce42d8d",
            "created_at": "2022-10-25T16:07:23.99045Z",
            "updated_at": "2025-03-27T02:02:10.06504Z",
            "deleted_at": null,
            "main_name": "Operation Potao Express",
            "aliases": [],
            "source_name": "ETDA:Operation Potao Express",
            "tools": [
                "FakeTC",
                "Patao"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1453896874,
    "ts_modification_date": 1453896880,
    "files": {
        "pdf": "https://archive.orkl.eu/a48cb6e2961d49d209196adbac1d95ebe21a5a56.pdf",
        "text": "https://archive.orkl.eu/a48cb6e2961d49d209196adbac1d95ebe21a5a56.txt",
        "img": "https://archive.orkl.eu/a48cb6e2961d49d209196adbac1d95ebe21a5a56.jpg"
    }
}