{
    "id": "62902738-6c80-4789-9628-de752414d1b2",
    "created_at": "2023-01-12T15:07:24.922799Z",
    "updated_at": "2025-03-27T02:05:30.313613Z",
    "deleted_at": null,
    "sha1_hash": "6f1c3121c9790a759399ebce8593b5e50dcbc7af",
    "title": "2021-09-24 - Flash Report- Colossus Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:12:46Z",
    "file_modification_date": "2022-05-28T18:12:46Z",
    "file_size": 680833,
    "plain_text": "# Flash Report: Colossus Ransomware\n\n**zerofox.com/blog/flash-report-colossus-ransomware/**\n\n[BLOG](https://www.zerofox.com/blog/)\n\nSeptember 24, 2021 | by [ZeroFox Research](https://www.zerofox.com/blog/author/zerofox-research/)\n\n\nSeptember 24, 2021\n\n\n-----\n\n6 minute read\n\n[On Friday, September 24, 2021, the ZeroFox Threat Intelligence team discovered a variant](https://www.zerofox.com/threat-intelligence/)\nof ransomware called Colossus that affects machines running Microsoft Windows operating\nsystems. The sample has a number of features including binary packing via Themida and\nsandbox evasion capabilities. The ransomware has a support website for setting up\ncommunications with victims, which most likely was launched on September 20, 2021. The\nransomware shares a similar ransom note structure to EpsilonRed, BlackCocaine, and some\nSodinokibi/REvil notes. As of September 24, 2021, Colossus has one known victim currently\nin active negotiations, an automotive group based in the United States. The operators\nappear at least highly familiar if not directly associated with other existing ransomware-as-aservice (RaaS) groups based on their tactics, techniques, and procedures (TTPs).\n\n## Details\n\nAs part of routine monitoring, ZeroFox detected and extracted a ransom note titled\n“HOW_TO_RECOVER_FILES.Colossus.txt” from a malware sample uploaded to the\nHatching Triage malware analysis service on September 24, 2021. The note contained a link\nwith the domain colossus[.]support and a victim key to access a private “Support Room”\npage to engage the attacker. The page notes a U.S.-based automotive group of dealerships\nas the target and threatens to dump 200 GB of exfiltrated data if an amount of USD 400,000\nis not paid. A countdown timer shows the ransom is scheduled to increase to USD 600,000\nin about 3 days. A suspected representative of the targeted company with the anonymous\n\n\n-----\n\nusername USER912058085 appears to have entered the chat room and initiated\nnegotiations. At this time, the attacker has shared four sample files of stolen data hosted at\nthe file sharing service ibb[.]co and is awaiting a further response.\n\n**Figure 1: Private negotiation page for Colossus ransomware target**\n\nSource: ZeroFox Threat Intelligence\n\n**Figure 2: Colossus ransomware actor sharing samples of stolen data**\n\nSource: ZeroFox Threat Intelligence\nRansomware groups tend to host a support page on a 1-1 basis with their victims (a unique\npage), or they run a support portal. In the case of Colossus, they registered the domain for\ntheir support portal on 9/19/2021. The domain is registered via Tucows, and the nameserver\nresponding to DNS lookups is dnspod, a popular DNS provider for cybercriminals. Dnspod\nhas hosted a number of other ransomware support pages. This does not mean there is a\ndefinitive link between Colossus and other groups that have used dnspod; rather, it shows\nthat there is a playbook that ransomware operators follow for operational security reasons.\n\n\n-----\n\nPassive DNS of the support domain shows successful support page resolutions starting on\n9/20/2021 to a web server hosted in Riga, Latvia. This webserver is hosted by PINVDS, a\nRussian-based VPS provider.\n\nZeroFox has not observed any related deep and dark web chatter specifically on a Colossus\nransomware product or Colossus ransomware affiliate program. However, these operators\nappear to be at least highly familiar if not directly associated with other existing ransomwareas-a-service (RaaS) groups based on their tactics, techniques, and procedures (TTPs). Their\nransom note is similar in structure and content to other known ransomware products,\nincluding some EpsilonRed/BlackCocaine and REvil/Sodinokibi samples. This could indicate\nusing a similar builder for the ransomware files, and follows a pattern of ransomware groups\ndisappearing and reappearing with a rebranded name and similar toolsets.\n\n**Figure 3: Side-by-side comparison of Colossus (left) and REvil/Sodinokibi (right) ransom**\nnotes\n\nSource: ZeroFox Threat Intelligence\nAdditionally, this Colossus ransomware group is engaging in the double extortion method of\nencrypting then threatening to leak stolen data on the dark web in a similar manner to over\n50 other ransomware and digital extortion groups tracked by ZeroFox so far this year. A\npublic Colossus-specific ransomware leak site is likely to arise in the coming weeks out of\nthis first known operation to leak data. Finally, it is noteworthy to see unique usernames\nbeing assigned to any visitors to the private “Support Room” page as a form of enhanced\noperational security. Other ransomware groups have struggled with security researchers and\nother malicious actors advertising on social media or even directly hijacking victim chat\ncommunications, most recently the BlackMatter ransomware group targeting of NEW\nCooperative.\n\n## Colossus Ransomware Analysis\n\n\n-----\n\nSimilar to other ransomware samples, once the binary executes on the target environment, it\nbegins the infection process. The sample of Colossus leverages PowerShell to facilitate the\nransomware infection. However, ransomware operators packed Colossus with the Themida\napplication. Themida is a packer that, when used to protect a binary, modifies the underlying\ncode before running the application inside a custom virtual machine, making analysis of the\nbinary significantly challenging.\n\n**Figure 4: Screenshot depicting a Colossus (APP[.]exe) sample packed by Themida**\n\nSource: ZeroFox Threat Intelligence\nDuring the infection cycle, the ransomware will begin the encryption process by encrypting all\nfiles, documents, and images on the target machine. After encryption, a ransom note will be\navailable for the victim that contains decryption and negotiation instructions. The operators\ninform the victim to visit the Colossus website and contact the operators at the provided\nemail address.\n\n## Indicators of Compromise\n\n**Hashes**\n```\nSHA256 - b70b9039ec4b33987a991c5c20729eb3310d7406b8d15161037df3b21fd968bb\nMD5 - 4f3669edb010f5db21b13a088182b8fe\nSHA-1 - 892447e55ff7a3ac5d26c573bb8eb4607b41ba1e\n\n## Recommendations\n\n```\nEnsure antivirus and intrusion detection software is up-to-date with all patches and rule\nsets.\n\n\n-----\n\nEnable 2-factor authentication for all of your organizational accounts.\nUtilize account permissions best practices such as role-based access control, least\nprivilege, and restricting root/admin permissions.\nSegment critical network resources using zero-trust configurations.\nMaintain regularly scheduled backup routines, including off-site storage and integrity\nchecks.\nLimit file egress by size and type.\nLog and monitor all administrative actions as much as possible. Alert on any\nsuspicious activity.\nConsider disabling, or at least logging, all network activity outside of normal business\nhours for most users where possible.\nMonitor usage of dual purpose tools such as Powershell for abnormal behaviors.\nDisable port echoing on all Internet-facing devices.\nUse a VPN for internal network connections.\nAvoid opening unsolicited attachments and never click suspicious links.\n\nLearn more about ZeroFox’s Threat Intelligence team, including how to access finished\n[intelligence like this flash report here. If you need a refresher on just a few of the costs and](https://www.zerofox.com/threat-intelligence/)\nimpacts both malware and ransomware attacks can have, click on the infographic below.\nIncluded in the infographic are top recommendations to get a leg up on establishing a\nsecurity plan to ensure your enterprise is prepared and protected. In tandem, the ZeroFox\n[Threat Research team has also released a more detailed report on ransomware trends and](https://www.zerofox.com/resources/rising-ransom-ransomware-and-malware-trend-report/)\nways you can start preparing for what’s to come.\n\n\n-----\n\n[Click to View Full Ransomware Infographic](https://www.zerofox.com/resources/ransomware-trends-and-mitigating-risk/)\n\n\nSource: ZeroFox Threat Research\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-24 - Flash Report- Colossus Ransomware.pdf"
    ],
    "report_names": [
        "2021-09-24 - Flash Report- Colossus Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536044,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653761566,
    "ts_modification_date": 1653761566,
    "files": {
        "pdf": "https://archive.orkl.eu/6f1c3121c9790a759399ebce8593b5e50dcbc7af.pdf",
        "text": "https://archive.orkl.eu/6f1c3121c9790a759399ebce8593b5e50dcbc7af.txt",
        "img": "https://archive.orkl.eu/6f1c3121c9790a759399ebce8593b5e50dcbc7af.jpg"
    }
}