{
    "id": "629dfc81-34c4-465a-a15a-f725172ce957",
    "created_at": "2023-01-12T15:01:07.97593Z",
    "updated_at": "2025-03-27T02:05:24.611461Z",
    "deleted_at": null,
    "sha1_hash": "5c576711b0951313998a579339730a7b349ecbd2",
    "title": "2020-05-11 - Astaroth - Maze of obfuscation and evasion reveals dark stealer",
    "authors": "",
    "file_creation_date": "2022-05-27T21:31:53Z",
    "file_modification_date": "2022-05-27T21:31:53Z",
    "file_size": 6890346,
    "plain_text": "# Threat Spotlight: Astaroth — Maze of obfuscation and evasion reveals dark stealer\n\n**[blog.talosintelligence.com/2020/05/astaroth-analysis.html](https://blog.talosintelligence.com/2020/05/astaroth-analysis.html)**\n\nCisco Talos is detailing an information stealer, Astaroth, that has been targeting Brazil\nwith a variety of lures, including COVID-19 for the past nine to 12 months.\nComplex maze of obfuscation and anti-analysis/evasion techniques implemented by\nAstaroth inhibit both detection and analysis of the malware family.\n\n\n-----\n\nCreative use of YouTube channel descriptions for encoded and encrypted command\nand control communications (C2) implemented by Astaroth.\n\n### What's new?\n\nAstaroth implements a robust series of anti-analysis/evasion techniques, among the\nmost thorough we've seen recently.\nAstaroth is effective at evading detection and ensuring, with reasonable certainty, that it\nis only being installed on systems in Brazil and not on sandboxes and researchers\nsystems.\nNovel use of YouTube channels for C2 helps evade detection, by leveraging a\ncommonly used service on commonly used ports.\n\n### How did it work?\n\nThe user receives an email message that has an effective lure, in this campaign all\nemails were in Portuguese and targeted Brazilian users.\nThe user clicks a link in the email, which directs the user to an actor owned server\nInitial payload (ZIP file with LNK file) downloaded from Google infrastructure.\nMultiple tiers of obfuscation implemented before LoLBins (ExtExport/Bitsadmin) used to\nfurther infection.\nExtensive anti-analysis/evasion checks done before Astaroth payload delivered.\nEncoded and encrypted C2 domains pulled from YouTube channel descriptions.\n\n### So what?\n\nAstaroth is another example of the level of sophistication crimeware is consistently\nachieving.\nThis level of anti-analysis/evasion should be noted, as the likelihood of this spreading\nbeyond just Brazil is high.\nOrganizations need to be prepared for these evasive and effective information stealers\nand prepared to defend against the sophisticated attack.\nAnother example of how most adversaries are using COVID-19 themed campaigns to\nincrease effectiveness.\n\n## Executive summary\n\nThe threat landscape is littered with various malware families being delivered in a constant\nwave to enterprises and individuals alike. The majority of these threats have one thing in\ncommon: money. Many of these threats generate revenue for financially motivated\nadversaries by granting access to data stored on end systems that can be monetized in\nvarious ways. To maximize profits, some malware authors and/or malware distributors go to\nextreme lengths to evade detection, specifically to avoid automated analysis environments\n\n\n-----\n\nand malware analysts that may be debugging them. The Astaroth campaigns we are\ndetailing today are a textbook example of these sorts of evasion techniques in practice.\n\nThe threat actors behind these campaigns were so concerned with evasion they didn't\ninclude just one or two anti-analysis checks, but dozens of checks, including those rarely\nseen in most commodity malware. This type of campaign highlights the level of sophistication\nthat some financially motivated actors have achieved in the past few years. This campaign\nexclusively targeted Brazil, and featured lures designed specifically to tailor to Brazilian\ncitizens, including COVID-19 and Cadastro de Pessoas Físicas status. Beyond that, the\ndropper used sophisticated techniques and many layers of obfuscation and evasion before\neven delivering the final malicious payload. There's another series of checks once the\npayload is delivered to ensure, with reasonable certainty, that the payload was only executed\non systems located in Brazil and not that of a researcher or some other piece of security\ntechnology, most notably sandboxes. Beyond that, this malware uses novel techniques for\ncommand and control updates via YouTube, and a plethora of other techniques and\nmethods, both new and old.\n\nThis blog will provide our deep analysis of the Astaroth malware family and detail a series of\ncampaigns we've observed over the past nine to 12 months. This will include a detailed\nwalkthrough of deobfuscating the attack from the initial spam message, to the dropper\nmechanisms, and finally to all the evasion techniques astaroth has implemented. The goal is\nto give researchers the tools and knowledge to be able to analyze this in their own\nenvironments. This malware is as elusive as it gets and will likely continue to be a headache\nfor both users and defenders for the foreseeable future. This will be especially true if its\ntargeting moves outside of South America and Brazil.\n\n## Technical details\n\nAstaroth features a multi-stage infection process that is used to retrieve and execute the\nmalware. At a high level, the infection process is as follows. We will describe each step of the\nprocess in greater detail in later sections.\n\n\n-----\n\n### Delivery stage\n\nThese campaigns typically start with a malicious email. This is a common tactic where the\nemails are designed to look like legitimate email from a familiar brand in an attempt to trick\nusers into clicking on malicious links or attachments that may have been included by the\nattacker. During our analysis, we have observed thousands of emails associated with\ncampaigns attempting to spread Astaroth starting in mid-2019. The overwhelming majority of\nthese email campaigns appear to be specifically targeting Brazil, and as such are written in\nPortuguese. Over the last six to eight months, these actors have leveraged a variety of\ndifferent campaigns touching on several different topics. One of the more common examples\nof malicious actors sending emails purporting to be associated with a well-known brand in\nBrazil is seen below.\n\n\n-----\n\nThis particular campaign was trying to get users to click a link purporting to be an overdue\ninvoice — a common tactic for adversaries. The hyperlink in the email actually points to a\ndifferent URL than what's shown to the user. The user may think they are clicking a link to a\ncar rental website local to Brazil, however, the link the user is actually clicking is below:\n```\nhxxp://wer371ioy8[.]winningeleven3[.]re/CSVS00A1V53I0QH9KUH87UNC03A1S/Arquivo.2809.PDF\n\n```\nOne characteristic of the early campaigns was the use of actor owned domains along with\nsubdomains (i.e. wer371ioy8 from above). We have seen a high volume of unique\nsubdomains and URLs indicating with a high likelihood that the URL is generated randomly\nand the server is designed to respond accordingly.\n\n\n-----\n\nWhen we began to trace the infection, we saw where the malware actually resides. When a\nuser clicks the link, they are redirected to Google Drive to download the actual malicious ZIP\nfile that will be analyzed in later sections. There are lots of ways that adversaries are doing\nweb redirection and we see techniques like 302-cushioning commonly. However, these\nactors instead used a tactic we used to see in the past — iframes.\n\nNotice that this iframe makes use of relative positioning and renders the iframe above and to\nthe left of the screen, something we commonly observed with exploit kits. This initial\nredirection into Google infrastructure also introduces SSL into the infection path, encrypting\nthe intermediary requests. This traffic results in a clear-text request to a ZIP file hosted by\nGoogle, as shown below.\n\nThere were a couple of other interesting lures that these actors have leveraged during these\ncampaigns, including COVID-19. In the email shown below the actors sent messages\nmasquerading to be the Ministry of Health for Brazil. This is the group that provides updates\nto citizens regarding what's being done to combat the COVID-19 outbreak.\n\n\n-----\n\nThis announcement is related to the distribution of respirators — a necessary piece of\nmedical equipment used to treat COVID patients — inside Brazil and offers a series of\nrecommendations that can be downloaded as a PDF, which is linked. However, the link\npoints to the actors owned servers and the process outlined above begins again. This is yet\nanother example of the ways that attackers will continue to leverage COVID-19 to push\nmalware onto end systems.\n\nRecently, we have noticed an evolution in the ways that these attackers have been delivering\nmalware. They are still using lures associated with invoices and bills, but have changed the\nformatting and removed some infrastructure.\n\nAs you can see, this email is still trying to lure Brazilian users to click links based on\ndocuments associated with debt collection but has also added another lure, threatening the\nCPF status of recipients. The CPF or Cadastro de Pessoas Físicas is a vital document in\nBrazil similar to Social Security Numbers (SSN) in the United States. This document is given\nto all citizens and visitors that pay taxes and is used for everything from getting a driver's\nlicense, to opening a bank account or even getting a cell phone plan. If a citizen has this\ndocument suspended, it can upend their lives, is costly, and could be an effective lure.\n\nThe authors appear to be removing some tiers of infrastructure as the underlying URLs point\ndirectly to the ZIP file being hosted by Google, an example of which you will find below:\n```\nhxxp://48.173.95[.]34.bc[.]googleusercontent[.]com/assets/vendor/aos/download.php\n\n```\n\n-----\n\nThese are similar to the URLs previously mentioned, but removes the need for the traffic to\ninteract with an actor owned server. We see both varieties of campaigns launched in parallel\nnow, so both are still being leveraged today. Once the initial dropper gets onto the system,\nthe LNK files kick off the complex infection process.\n\n### Infection Stage 1\n\nThe aforementioned ZIP archives contain malicious Microsoft Windows shortcut (LNK) files\nthat are used to execute stage one of the infection process. They are used to perform an\ninitial download of additional malicious content and effectively initiate the infection process.\n\nThey have been obfuscated in an attempt to evade rudimentary strings-based analysis. An\nexample of one of these LNK files is below.\n\nWhen executed, the batch commands embedded in the LNK are responsible for creating a\nJScript file which is stored in \"C:\\Users\\Public\\Documents\\\" and then executing it.\n\nThis JScript is responsible for making an HTTP GET request to an attacker-controlled web\nserver for the purposes of retrieving the next stage of the infection process.\n\n\n-----\n\nThe response data received from the attacker-controlled server contains an additional stage\nof obfuscated JScript which is directly executed by the process running on the infected\nsystem and never written to the filesystem. The URL structure used to retrieve additional\ninstructions from the first tier of attack-controlled distribution servers varies across\ncampaigns but is consistent with the following examples:\n\nAn example of one of these scripts that were obtained from a network traffic capture below.\n\n\n-----\n\nThe execution of the JScript that is obtained initiates the next stage of the infection process.\n\n### Infection Stage 2\n\nThe JScript that was delivered as part of the earlier stage of the infection process features\nthe use of various types of obfuscation to make analysis more difficult. CharCode\nreplacement is used throughout the script where ASCII characters have been replaced with\ntheir decimal representations. As an example, a subset of the obfuscated JScript is below:\n\n\n-----\n\nThe script is effectively taking the decimal representation of ASCII characters, converting\nthem, and concatenating the result to create a string containing the command-line syntax\nnecessary for the Windows Command Processor to execute them.\n\n[Taking these numeric values and cross-referencing them with text converters like this, we](http://www.asciitable.com/)\ncan convert the data back to a human-readable format:\n\nIn addition to the CharCode conversion, variable declarations are used to break the\ncommand-line syntax up in a way that makes it more difficult to read and interpret what is\ntaking place.\n\nTaking the variable declaration in the previous example a step further, once we have\nconverted the decimal back to ASCII, we can then take the contents of the variables being\ndeclared and replace them to rebuild the command-line syntax being invoked.\n\nThe fully deobfuscated JScript reveals a robust downloader that the malware uses to attempt\nto retrieve a Stage 3 malware payload and execute it. The downloader is responsible for\nperforming the following process:\n\n1. It first attempts to determine if the Stage 3 malware payload is already present on the\n\nsystem.\n2. If it is not, it creates a randomly generated directory structure that will be used to store\n\nthe Stage 3 payload once it has been retrieved.\n\n\n-----\n\n3. It then randomly selects a distribution server domain and URL structure and uses the\n\nbitsadmin Windows utility to attempt to retrieve the stage 3 malware payloads.\n4. If successful, the resultant Dynamic Link Library (DLL) is then stored and the loader\n\nattempts to use the [ExtExport LoLbin to load the DLL and execute the Stage 3 malware](http://www.hexacorn.com/blog/2018/04/24/extexport-yet-another-lolbin/)\npayloads.\n\n### Analysis of the Stage 2 downloader\n\nThe downloader used in these distribution campaigns featured interesting functionality that\nwas likely included to make the distribution infrastructure being used more resilient to URL\nand domain-based blocking that many organizations might employ.\n\nNote: During our analysis of the obfuscated downloader, variable names, function names,\nand parameter names were changed from their original randomly generated values to\nimprove readability and make the analysis process more efficient.\n\nThe downloader first checks for the existence of a file located at the following directory\nlocation as a way to determine if the system has already been delivered a Stage 3 malware\npayload.\n```\nC:\\Users\\Public\\h\n\n```\nIf the file exists, its contents are read as it contains the directory location of the Stage 3\npayload.\n\nIn the case that the file containing the location of the Stage 3 payload is not present on the\ninfected system, the downloader generates and creates the directory structure where the\nStage 3 payload will be stored following retrieval from the attacker-controlled distribution\nservers. The directory structure the malware uses is stored in a subdirectory of\n%APPDATA%\n\nWhile the aforementioned code has been slightly modified ([A-Z] added for readability), a\nrandomization function present in the JScript is invoked with a randomly selected CharCode\nvalue between the range of 65 and 90, which are then converted back to ASCII. This\nCharCode range represents the CharCodes for all ASCII characters ranging from \"A\" to \"Z.\"\n\nIt is then written to the file that was initially queried, presumably so that the malware can\nlocate it during subsequent execution attempts. This directory structure is then created to\nfacilitate the rest of the loading process.\n\n\n-----\n\nNext, the malware checks for the presence of a Stage 3 malware payload called sqlite3.dll\nin this directory location. If it already exists, it checks the size of the file, and if it is less than\n10 bytes, the file is deleted and the loading process continues.\n\nIf the DLL is successfully located and larger than 10 bytes, the loader attempts to load it, first\n[by attempting to locate and invoke the ExtExport.exeLoLbin, and failing back to regsvr32 if](http://www.hexacorn.com/blog/2018/04/24/extexport-yet-another-lolbin/)\nthe ExtExport.exe binary cannot be located.\n\nIn the case that the Stage 3 DLL is unable to be located, the loader will proceed to initiate\nHTTP communications to a set of distribution servers to retrieve and execute it. To facilitate\nthis process, the loader first generates a URL path to use for subsequent web requests to\nretrieve the DLL. It does this by breaking the URL into several parts, using the randomization\nfunction to generate values for each part, then concatenating them to form the full URL\npattern.\n\nThe distribution server domain to use is generated by calling an additional function. This\nfunction selects a random number between \"0\" and \"19\" and then performs a comparison\nagainst a list of distribution server domains. The matching value is then stored in a variable\nthat is used in the previous screenshot.\n\n\n-----\n\nOnce all of this information has been generated, it is then assembled and passed to a\nfunction that uses the Bitsadmin Windows utility to retrieve the payload and store it in the\nmalware's working directory.\n\nOnce the payload has been successfully retrieved, the same previously described process is\nused to attempt to locate ExtExport.exe or if unsuccessful, regsvr32 is used to load the DLL\nand initiate the execution of the malware payload itself.\n\n\n-----\n\nA 4,000-second (or 66-minute) timeout counter is also present, after which time it exits.\n\nThe downloader retrieves additional binary content from two other distribution servers which\nis directly executed as part of Stage 3.\n\nThe resultant HTTP GET requests can be observed in the screenshot below.\n\n[The payloads being delivered in these campaigns are the main Astaroth DLL. Astaroth is a](https://malpedia.caad.fkie.fraunhofer.de/details/win.astaroth)\nmodular malware family that is used to steal sensitive information from various applications\nrunning on infected systems.\n\n### Astaroth analysis\n\nThe three payloads that are retrieved during Stage 2 are binary components that are\ncombined to reconstruct the Astaroth DLL. Once they are combined, the DLL is then\nexecuted to initiate the final stage of the infection process. We performed detailed analysis of\nthe functionality present within these DLLs and identified several interesting characteristics\nassociated with its operations. These are described in the sections below.\n\n### Anti-analysis/Anti-sandbox mechanisms\n\nAstaroth features a robust series of anti-analysis and anti-sandbox mechanisms that it uses\nto determine whether or not to continue the infection process. The diagram below provides a\nhigh level depiction of these checks, which will be described in more detail in this section.\n\n\n-----\n\nThe Astaroth samples associated with these campaigns feature an extensive set of\nenvironmental checks that are performed in an attempt to identify if the malware is being\nexecuted in a virtual or analysis environment. If any of the checks fails, the malware forcibly\nreboots the system using the following command-line syntax:\n```\n\"cmd.exe /c shutdown -r -t 3 -f\"\n\n```\nBelow is a high-level view of the code execution flow associated with these anti-analysis\nmechanisms.\n\n\n-----\n\n[The malware leverages CreateToolhelp32Snapshot to identify virtual machine guest](https://docs.microsoft.com/en-us/windows/win32/api/tlhelp32/nf-tlhelp32-createtoolhelp32snapshot)\nadditions that may be installed on the system, looking for those associated with both\nVirtualBox and VMware.\n\n\n-----\n\nIt also looks for the presence of hardware devices that are commonly seen on virtual\nmachines.\n\n\n-----\n\nIt also checks the value of the SystemBiosDate which is stored in the Windows registry\n(HKLM\\HARDWARE\\DESCRIPTIONS\\System\\SystemBios\\Date) to determine if the value\nmatches \"06/23/99,\" which is the default value for virtual machines within VirtualBox.\n\nThe malware then checks the running programs on the infected system using\nEnumChildWindows to identify common analysis, debugging and sandboxing tools that may\nbe running on the infected system.\n\nIt attempts to identify the following applications which are commonly used for malware\nanalysis:\n\nOllyDbg\nImmunityDebugger\nWinDbg\nIDA Pro\nProcess Explorer\n\n\n-----\n\nProcess Monitor\nRegMon\nFileMon\nTCPView\nAutoruns\nWireshark\nDumpcap\nProcess Hacker\nSysAnalyzer\nHookExplorer\nSysInspector\nImportREC\nPETools\nLordPE\nJoebox\nSandbox\nx32dbg\n\n[It also checks for the presence of Sandboxie on the system using GetModuleHandleA on](https://docs.microsoft.com/en-us/windows/win32/api/libloaderapi/nf-libloaderapi-getmodulehandlea)\nSbieDll.dll.\n\nSimilar to the check for Sandboxie, the malware also checks for the existence of\n[\"dbghelp.dll,\" which is part of Microsoft's freely available Debugging Tools for Windows.](https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/)\n\nIt then checks the value stored in Windows registry at the following location:\n```\nHKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\ProductId\n\n```\nThe malware is specifically looking for the following values:\n\n76487-644-3177037-23510\n55274-640-2673064-23950\n\nIf those values are present, it indicates that the host environment is CWSandbox or JoeBox,\nrespectively.\n\n\n-----\n\nThe malware then enumerates the username associated with the account the malware is\nrunning under. It checks to see if the username matches the value \"CURRENTUSER.\"\n\nNext, the malware attempts to open the virtual devices \"\\\\\\.\\\\SICE\" and \"\\\\\\.\\\\NTICE\" which\nare associated with SoftICE, a \"kernel mode debugger for DOS and Windows.\"\n\n\n-----\n\n[It also leverages a call to IsDebuggerPresent to attempt to determine if the sample is being](https://docs.microsoft.com/en-us/windows/win32/api/debugapi/nf-debugapi-isdebuggerpresent)\nexecuted in a debugger. Rather than importing the function the standard way, the malware\ndynamically loads it to hide the fact that this will take place during static analysis of the\nsample.\n\nIt follows this up by also manually checking the Process Environment Block (PEB) as an\nadditional way to check for the presence of a debugger\n\n\n-----\n\nNext, the malware attempts to identify if it is being executed in a WINE environment. This is\naccomplished by loading ntdll.dll and checking for the existence of the functions\n\"wine_get_version\" and \"wine_net_to_unix_file_name.\"\n\n[The malware also leverages calls to GetModuleHandleA to check for the existence of several](https://docs.microsoft.com/en-us/windows/win32/api/libloaderapi/nf-libloaderapi-getmodulehandlea)\nadditional DLLs that are common within sandbox environments. It attempts to locate the\nfollowing DLLs:\n\ndbghelp.dll\napi_log.dll\ndir_watch.dll\npstorec.dll\nvmcheck.dll\nwpespy.dll\n\nThese DLLs are associated with a variety of different sandbox platforms including VMware,\nSunBelt Sandbox, VirtualPC and WPE Pro.\n\nFinally, the malware attempts to determine if it is being executed in an emulated environment\nusing QEMU. It does this by checking for \"qemu-ga.exe,\" which is associated with the QEMU\nGuest Agent.\n\n\n-----\n\nAs previously mentioned, if any of these checks fail, the malware will terminate execution\nand force the system to restart. This demonstrates the effort that Astaroth makes to avoid\nanalysis and evade a variety of different platforms that are commonly used to analyze\nmalware samples.\n\n[The malware also leverages GetSystemDefaultLangID followed by VerLanguageNameA to](https://docs.microsoft.com/en-us/windows/win32/api/winnls/nf-winnls-getsystemdefaultlangid)\ndetermine the language set of the infected system. The language name value is then\ncompared to the substring \"portu\" to determine if the system is configured to use\nPortuguese. If the language set is not a Portuguese one, the malware terminates via\nExitProcess.\n\nNext the DLL begins a loop, checking for the presence of an open window with a title\nmatching the value \"pazuzupan0155.\" If the window does not exist, the malware calls\nWSAStartup, then proceeds to download an additional malicious payload from an attackercontrolled server using a URL pattern similar to the following example:\n```\nhxxp[:]//15uaer[.]coragem[.]cf/?17475461717677867\n\n```\nThis time, the payload that is retrieved is a PE EXE rather than a DLL. This EXE is then\nexecuted using a technique referred to as \"process hollowing.\" In this case, the process\n\n\n-----\n\nhollowing is targeting the process userinit.exe and uses the same process that is described\n[here.](https://www.microsoft.com/security/blog/2020/03/23/latest-astaroth-living-off-the-land-attacks-are-even-more-invisible-but-not-less-observable/)\n\nIf an open window with a title matching \"pazuzupan0155\" does exist, the DLL calls a sleep\nfunction and, eventually, the loop repeats. This approach may have been taken to provide a\nmeans to ensure that the malware is persistently executing on infected systems. In the case\nthat the executable is removed, the DLL will simply replace it the next time the loop\nexecutes. This also serves as a means to ensure that the latest version of the malware can\nbe retrieved from the distribution servers as versions are updated by the attackers.\n\n### Module analysis\n\nAstaroth versions are typically tracked using the string value present in the function names\nused throughout the samples. The version associated with these latest campaigns is called\n\"gomorytrol.\" Consistent with previous versions of Astaroth, this is also a demonology\nreference, in this case to the demon \"Gomory.\"\n\n\n-----\n\nThese functions are used by various timers, forms, and threads, consistent with previously\n[published analysis. The \"gomorytrol\" version of Astaroth is internally referred to as version](https://decoded.avast.io/threatintel/deep-dive-into-guildma-malware/)\n157, with other recent versions listed below.\n```\n\"masihaddajjal\"  (version 152)\n\"forneus\"     (version 153)\n\"mammonsys\"    (version 154)\n\"pazuzupan\"    (version 155)\n\"lechiesxkw\"   (Version 156)\n\"gomorytrol\"   (Version 157)\n\n```\nIt is important to note that the version number changed repeatedly during our analysis of\nAstaroth, indicative of the rapid evolution of this specific threat.\n\nOnce the main Astaroth payload has been executed, it checks for the presence of a file\nstored using Alternate Data Streams (ADS) in the following location:\n```\nsqlite3.dll:MllkguwbwyshtY6767TGuddhyfyoomrifk\n\n```\nIf the file is not found, the malware will download an additional payload and store it via ADS.\n\n\n-----\n\nThis additional payload is then decrypted, loaded into memory, and executed. It performs the\nsame set of anti-analysis checks that were described in previous stages of the infection\nprocess. In addition, the malware creates a list of strings related to various analysis and\n[sandbox environments, then uses GetModuleFilenameA and](https://docs.microsoft.com/en-us/windows/win32/api/libloaderapi/nf-libloaderapi-getmodulefilenamea) [GetComputerNameA to check](https://docs.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-getcomputernamea)\nthe system's hostname and process file path and terminates execution if the string values\nmatch.\n\nThe malware also performs additional checks to determine the language configuration of the\nsystem. In addition to the methodology used in previous stages of the infection, the malware\nchecks for the presence of an English language set and terminates execution if it encounters\nit.\n\nThe malware currently leverages a new working directory:\n\n\n-----\n\n```\n %USERPROFILE%\\Public\\Libraries\\jakator\n\n```\nMuch of the core information-stealing functionality performed by the malware has not\n[changed since previous analysis was published here. Samples associated with recent](https://decoded.avast.io/threatintel/deep-dive-into-guildma-malware/)\ncampaigns show a particular focus on obtaining banking information for customers of Banco\nde Brasil.\n\n### Command and control (C2)\n\n[Consistent with the previous analysis, the malware features a redundant C2 mechanism with](https://www.welivesecurity.com/2020/03/05/guildma-devil-drives-electric/)\nboth primary and secondary C2 infrastructure. The primary way that the malware\ncommunicates with C2 servers is through the retrieval of C2 domains using Youtube channel\ndescriptions. The attackers have established a series of YouTube channels and are\nleveraging the channel descriptions to establish and communicate a list of C2 domains the\nnodes in the botnet should communicate with to obtain additional instructions and updates.\n\nA few examples of these Youtube channels that are associated with Astaroth are:\n```\nhxxps://www.youtube[.]com/channel/UC48obBfnUnI8i9bH2BmDGBg/about\nhxxps://www.youtube[.]com/channel/UC1XqzXRrROkMrIUbSxhATcQ/about\nhxxps://www.youtube[.]com/channel/UC2N4Ej53G7pKYJlA7lOj0SQ/about\nhxxps://www.youtube[.]com/channel/UC3YzBxaeuGNBFQRS4bfV8XA/about\nhxxps://www.youtube[.]com/channel/UCfgh5rFgl267MHRxkFttVLg/about\nhxxps://www.youtube[.]com/channel/UC96ziVgeQrKVPp1hofl1dsA/about\nhxxps://www.youtube[.]com/channel/UCbbq2Jm2Swj95AVFoHPMdRg/about\nhxxps://www.youtube[.]com/channel/UC76P-6J1BP39fjNGkudw1Jw/about\nhxxps://www.youtube[.]com/channel/UC-XIp1YC9eZPnNO9VBJTCLw/about\nhxxps://www.youtube[.]com/channel/UCA87kfgVEB8yshwYxUdSYLA/about\nhxxps://www.youtube[.]com/channel/UCbnDU85fizL0EWdZiwTYonA/about\nhxxps://www.youtube[.]com/channel/UCc2nVj0SBkr99-lFO1LCV-A/about\n\n```\n\n-----\n\nAs in previous versions of Astaroth, the information inside of the \"|||\" delimiters contains a list\nof C2 domains which have been encrypted and base64 encoded. An example of this is\nbelow:\n\nWe observed the channel description data change periodically during our analysis. This\nprovides an interesting way to rotate C2 infrastructure as needed leveraging a platform that\nis commonly allowed in corporate environments.\n\nThe malware also features a failback C2 mechanism for situations where the YouTube\ncommunications may fail. In the sample analyzed, the malware was configured to use the\nfollowing URL as the failback C2 channel.\n```\nhxxps://sombrio[.]xxapocalipsexx[.]space/amem//dir1/?4481829444804=184448294448&1=\n<Base64 encoded C2 message>\n\n```\nInitial beaconing from infected systems contains various information about the environment\nand uses the following format:\n\n\n-----\n\nAnalysis of the C2 domains used by the malware shows that DNS resolution activity appears\nto be occurring almost exclusively in Brazil, as is consistent with the distribution campaigns,\ncomprehensive checks performed by the malware, and financial institutions whose\ncustomers are being targeted by the malware.\n\nOverall, Astaroth takes an unusual approach to the implementation of their Domain\nGeneration Algorithm (DGA) and the communication of C2 updates to infected systems. The\nuse of multiple redundant C2 mechanisms makes it particularly resilient to infrastructure\ntakedowns.\n\n## Conclusion\n\nAstaroth is evasive by nature and its authors have taken every step to ensure its success.\nThey have implemented a complex maze of anti-analysis and anti-sandbox checks to\nprevent the malware from being detected or analyzed. Starting with effective and impactful\nlures, to layer after layer of obfuscation, all before any malicious intent was ever exposed.\nThen it finally proceeds through a rigorous gauntlet of checks for the tools and techniques of\nboth researchers and sandbox technologies alike. This malware is, by design, painful to\nanalyze. As a final layer of sophistication, the adversaries have gone so far as to leverage a\nwidely available and innocuous service like YouTube to hide its command and control\ninfrastructure in both an encrypted and base64-encoded stream.\n\nBeyond that, this malware family is being updated and modified at an alarming rate, implying\nits development is still actively being improved. These adversaries are also quickly moving\nand pivoting through infrastructure, swapping out nearly weekly, to stay agile and ahead of\ndefenders. When this malware widens its net of victim countries, more and more defenders\nwill need to be prepared to step through this complex threat.\n\nThese financially motivated threats are continuing to grow in sophistication, as adversaries\nare finding more ways to generate large sums of money and profits. Astaroth is just another\nexample of this and evasion/anti-analysis are going to be paramount to malware families\nsuccess in the future. Organizations need to have multiple layers of technology and controls\nin place to try and minimize its impacts, or at the least facilitate fast detection and\nremediation. This would include security technologies covering endpoint, domain, web, and\nnetwork. By layering these types of technologies organizations will increase the likelihood\nthat evasive, complex malware like Astaroth, can and will be detected.\n\n## Coverage\n\n\n-----\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors. Exploit Prevention present within AMP is designed to\nprotect customers from unknown attacks such as this automatically.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\nCisco AMP users can use Orbital Advanced Search to run complex OSqueries to see if their\nendpoints are infected with this specific threat. For specific OSqueries on this threat, click\n[here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_astaroth_filepath.yaml)\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), Cisco ISR, and Meraki MX.](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org. The following SIDs have been released](https://www.snort.org/products)\nto detect this threat: 53861.\n\n\n-----\n\n## Indicators of Compromise (IOCs)\n\nThe following indicators of compromise have been observed as being related to the Astaroth\ncampaigns described in this blog.\n\n### Domains\n\nA list of the domains being used can be found here. Note that subdomains are generated\n[randomly, only core domains are listed here.](https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/05/85f1cf8c-astaroth_domains.txt)\n\n### LNK Hashes (SHA256)\n\n[A list of hashes associated with the LNK files used in these campaigns can be found here.](https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/05/8e5bc9c5-astaroth_lnk.txt)\n\n### JScript Hashes (SHA256)\n\n[A list of hashes associated with the JScript files used in these campaigns can be found here.](https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/05/75a46c5b-astaroth_jscript.txt)\n\n### Binary Hashes (SHA256)\n\nA list of hashes associated with the malicious payloads associated with these campaigns can\nbe found [here.](https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/05/1bb9c5f4-astaroth_binary.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-11 - Astaroth - Maze of obfuscation and evasion reveals dark stealer.pdf"
    ],
    "report_names": [
        "2020-05-11 - Astaroth - Maze of obfuscation and evasion reveals dark stealer.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535667,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653687113,
    "ts_modification_date": 1653687113,
    "files": {
        "pdf": "https://archive.orkl.eu/5c576711b0951313998a579339730a7b349ecbd2.pdf",
        "text": "https://archive.orkl.eu/5c576711b0951313998a579339730a7b349ecbd2.txt",
        "img": "https://archive.orkl.eu/5c576711b0951313998a579339730a7b349ecbd2.jpg"
    }
}