{
    "id": "62a31385-7e77-4670-9611-4b4b58d5e385",
    "created_at": "2023-01-12T15:02:54.815423Z",
    "updated_at": "2025-03-27T02:05:49.645932Z",
    "deleted_at": null,
    "sha1_hash": "c29b0f6f11f65a068e18ac90e17206811d42ba28",
    "title": "2016-09-20 - Meanwhile in Britain, Qadars v3 Hardens Evasion, Targets 18 UK Banks",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:05Z",
    "file_modification_date": "2022-05-28T03:52:05Z",
    "file_size": 2900478,
    "plain_text": "# Meanwhile in Britain, Qadars v3 Hardens Evasion, Targets 18 UK Banks\n\n**[securityintelligence.com/meanwhile-britain-qadars-v3-hardens-evasion-targets-18-uk-banks/](https://securityintelligence.com/meanwhile-britain-qadars-v3-hardens-evasion-targets-18-uk-banks/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nMeanwhile in Britain, Qadars v3 Hardens Evasion, Targets 18 UK Banks\n\n\nSeptember 20, 2016\n\n\n-----\n\na [g &](https://securityintelligence.com/category/topics/banking-financial-services-industry/) a ce Septe be 0, 0 6\nBy [Limor Kessem co-authored by Hanan Natan,](https://securityintelligence.com/author/limor-kessem/) [Denis Laskov 7 min read](https://securityintelligence.com/author/denis-laskov/)\n[IBM X-Force Research reported that the operators of the Qadars Trojan have been progressively updating the malware’s defenses and](https://securityintelligence.com/an-analysis-of-the-qadars-trojan/)\ntailoring its configurations to target 18 banks in the U.K. In addition to its recent U.K. activity, the researchers found that Qadars campaigns\nlaunched in early September 2016 mainly targeted banks in the Netherlands, U.S. and Germany.\n\n[This activity comes on the heels of an uptick of Ramnit Trojan attacks against U.K. banks. After a period of relatively low activity, during which](https://securityintelligence.com/ramnit-rears-its-ugly-head-again-targets-major-uk-banks/)\ncybercriminals shifted their focus to Germany, Brazil and the U.S., it seems the U.K. is back on fraudsters’ radar.\n\n## Qadars Makes the Rounds\n\nFrom a global perspective, Qadars’ operators have been making the rounds, targeting banks all over the world in separate bouts of online\nbanking fraud attacks since 2013. By count of targeted brands, it appears the gang remains most inclined to attack in Europe.\n\nBetween 2013 and 2014, the malware mainly targeted banks in France and the Netherlands. Its top targets between 2015 and 2016 were\nAustralia, Canada, the U.S. and the Netherlands. This past year, Qadars operators focused primarily on the Germany, Poland, the U.S. and\nthe Netherlands.\n\n[X-Force Research indicated that while most of Qadars’ targets have been banks, it is also after social networking credentials, online sports](https://www.ibm.com/security/xforce/research.html)\nbetting users, e-commerce platforms, payments and card services, among others.\n\nFueled by what appears to be experienced cybercrime factions, Qadars has been able to use advanced banking malware tactics ever since its\nearly days, with capabilities such as:\n\nHooking the internet browser to monitor and manipulate user activity;\n\nFetching webinjections in real time from a remote server;\n\nSupplementing fraud scenarios with an SMS hijacking app; and\n\nOrchestrating the full scope of fraudulent data theft and transaction operation through an automated transfer system (ATS) panel.\n\nATS is fraudster lingo for a remote, web-based platform that Trojans access on the fly. The ATS panel contains transaction automation scripts,\nwebinjections, preprogrammed transaction flow and parameters, transfer thresholds and mule account numbers on which the malware relies to\ncomplete illicit online transactions.\n\nTo steal two-factor authentication (2FA) codes from a user whose bank requires an out-of-band element, Qadars’ operators deployed the\n[Perkele (iBanking) mobile bot as the malicious mobile component. In this case, Qadars even added the theft of codes from mobile devices to](http://www.bankinfosecurity.com/yet-another-mobile-trojan-hits-banks-a-6027)\nthe ATS transaction orchestration flow.\n\nBut Qadars didn’t just use Perkele on bank transactions. It also targeted Facebook users who secured their accounts with 2FA, [HackRead](https://www.hackread.com/ibanking-malware-qadars-facebook/)\nreported.\n\nQadars historically infects endpoints using exploit kits hosted on compromised hosts, or domains purchased for the purpose of serving\nmalware. The Trojan was also pushed to user endpoints via botnets, leveraging downloader-type malware. In current campaigns, Qadars\n[leverages the Rig Exploit Kit via the](http://malware-traffic-analysis.net/2016/08/31/index2.html) [EiTest campaign to infect users, facilitating its infiltration with downloader malware.](http://www.broadanalysis.com/2016/09/01/fake-flash-update-delivers-tor-bot/)\n\n[Read the white paper: Accelerating growth and digital adoption with seamless identity trust](https://www.ibm.com/account/reg/us-en/signup?formid=urx-33205)\n\n## Qadars v3 Hits the Ground Running\n\nAlthough Qadars emerged in 2013, it has not been widely documented compared to other advanced Trojans of its type. Under the hood,\nQadars’ developers borrowed code and fraud-facilitating concepts from the Zeus and Carberp Trojans, both of which had their source code\nleaked publicly in the past few years, thereby enabling malware authors to reuse parts of the code.\n\nX-Force first detected Qadars v2 in October 2015. The present version, Qadars v3, was released in Q1 2016. Our researchers indicated that\nby May 2016, the malware’s developer released detailed update notes for v3, all written in Russian, noting which bug fixes and improvements\nwere made to the code, admin panel and ATS panel. The notes also provided information about browser and webinjection updates.\n\nThe release notes indicated that Qadars is an advanced online banking Trojan that comes from a single source. Its source programs all\noperational components and does not buy injection kits from outsourced developers. When Qadars v3 was detected in the wild, the malware’s\noperators dedicated a new attack configuration to targeting all the major banks in Australia.\n\nQadars’ fraud tactics are enabled through:\n\nBrowser hooking (IE, Firefox);\nCookie and certificate theft;\nForm grabbing;\nWebinjections;\n\n\n-----\n\nG abbe s a d S;\nUse of the Tor client on the victim’s machine to hide malware communications; and\nUse of [domain generation algorithm (DGA) to hide remote malware resources (as of v3).](https://johannesbader.ch/2016/04/the-dga-of-qadars/)\n\nIn terms of attack methods, Qadars is capable of in-session fraud, remote-controlling the infected endpoint via virtual network computing\n(VNC) and performing a fraudulent transaction in real time when the user is logged on. Qadars can also collect victim credentials and use them\nin account takeover fraud at a later time and from a different device, depending on the targeted bank and the corresponding authentication\nchallenges.\n\n## Researching Qadars v3\n\nQadars v3 is continuously evolving. Yet another updated release in late August 2016 offered a new Qadars build with some code updates\ndesigned to evade detection, layer anti-research features, and improve the performance and readability of the malware’s webinjection\nmechanisms.\n\nThe following section describes the technical changes made to the Qadars v3 in August 2016. This analysis was performed by malware\nresearcher Hanan Natan and contributor Denis Laskov, senior security researcher at IBM Trusteer cybercrime labs.\n\n## Double Obfuscation on Dynamic API Resolution\n\nQadars’ new version obfuscates all of its Win32 API calls by employing a common trick often used by banking malware of this grade, such as\nURLZone, Dridex and Neverquest. When the malware code starts to run and after the packer has completed its part, it dynamically resolves all\nthe memory address of the APIs it’s going to use.\n\nQadars contains hardcoded CRC32 values for all the function names it plans to use. This enables it to resolve the actual memory address of\nthe function it will iterate over the export table of a particular system DLL and compare the CRC32 of the exported function name against the\nhardcoded one. If a match is found, Qadars saves the memory address of the function in a global variable.\n\nThe malware adds a twist to this well-known dynamic API resolving method by XORing the hardcoded CRC32 values of the function names\nwith another constant value that’s embedded in the binary itself. By employing this method, Qadars makes it a bit harder for scripts to find and\nannotate the actual Win32 APIs it uses.\n\nIn the following disassembly excerpt, we can see how the malware resolves the Win32 API addresses and saves them into global variables:\n\n\n-----\n\n## Internal Data Obfuscation\n\nIn the current Qadars version, we analyzed all the strings and data inside the binary that are XORed with a constant value that’s embedded in\nthe binary. Just before the malware uses a string or data, it first performs an inverse XOR operation on it.\n\nMoreover, the malware added a compression layer for the configurations it downloads from the command-and-control (C&C) server. The\ncompression layer was likely added due to the fact that webinjections, which are part of the configuration, have become larger and more\nsophisticated over time as more banks were added to the target list, making config files heavier and more easily detectable.\n\nWhile previous versions of the malware downloaded configurations that were only encrypted using an AES algorithm, the new version adds\n[compression after the encryption phase. The configuration ultimately gets decompressed on the infected endpoint using aPLib, a](https://www.reversinglabs.com/newsroom/blog/writing-static-decompressors-aplib-story.html) compression\nlibrary based on the algorithm used in aPACK.\n\n## Trojan Modules\n\n[Like other modular banking Trojans, such as Shifu, for example, Qadars v3 downloads a number of extra modules from its C&C server to](https://securityintelligence.com/shifu-masterful-new-banking-trojan-is-attacking-14-japanese-banks/)\nperform the actual malicious activities. The malicious payload, or the MainModule, as it was named by the malware developer, is responsible\nfor fetching those additional modules from the C&C.\n\nOne of the MainModule’s tasks is to inject the other downloaded modules into specific Windows processes according to the functionality of\neach module. It is possible to tell what task each module carries out according to a text string found in each one briefly describing its purpose:\n\n\n-----\n\nodu e a bac _3 d s jected to a p ocesses a d used as a atc dog to esta t t e a a e case o te at o (pe s ste ce)\n\nModuleKeylogger_32.dll is injected into all processes to ensure data is keylogged properly.\n\nModuleBrowser_32.dll is injected into browser processes only. This module is used for downloading webinjections from the C&C and for\nmanaging the actual web fraud.\n\nModuleVNC_32.dll is injected into browser processes for launching remote control.\n\nThe names of the modules, as named by the developer of the malware, can be found in the DLL’s export ordinal table. The\nmoduleBrowser_32.dll even contains the path of the pdb file used during the actual development:\n\nAdditional changes in this version enrich the ability of the MainModule to download and use a Tor client to anonymize communications and\ncovertly download modules from the C&C, ad hoc.\n\n## Privilege Escalation Tricks\n\nTo elevate its privileges on infected machines, Qadars’ dropper can opt to display a social engineering message prompting the user to\ndownload a new Windows security update. That fake message is used to influence the user into unknowingly accepting a UAC prompt and\ninadvertently granting Qadars admin rights.\n\n\n-----\n\nOnce the user clicks the fake update notice window, the malware’s dropper runs itself again using the ShellExecuteEx Win32 API. This time,\nhowever, the system [displays a UAC dialog to the user.](https://blogs.msdn.microsoft.com/vistacompatteam/2006/09/25/elevate-through-shellexecute/)\n\nThe following figure shows an excerpt of the decompiled code. The malware doesn’t give the user an option to cancel or close the fake update\nwindow. Basically, users will encounter the UAC prompt again and again until they approve it, at which point the malware is launched again,\nthis time with a new, higher privilege level:\n\n\n-----\n\n## Conclusion\n\nQadars attack volumes, compared to Trojans like Neverquest or Dridex, are more humble. While it is not one of the top 10 financial malware\nthreats on the global list, however, this Trojan has been flying under the radar for over three years, attacking banks in different regions using\nadvanced features and capabilities. It’s possible that Qadars attack volumes remain limited because its operators choose to focus on specific\ncountries in each of their infection sprees, likely to keep their operation focused and less visible.\n\nOn the technical side, Qadars is an active and evolving malware project, as are other malicious codes of its type. In that sense, this threat is as\n[advanced and problematic as other banking Trojans, such as Gozi,](https://securityintelligence.com/gozi-goes-to-bulgaria-is-cybercrime-heading-to-less-chartered-territory/) [Tinba or Ramnit. The language used in the Qadars v3 release notes](https://securityintelligence.com/im-yelling-tinba-trojan-sets-sights-on-singapore-banks-for-holiday-season/)\nsuggests the malware developer is most likely a Russian-speaking black hat.\n\nQadars’ operators are well-versed in orchestrating the malware infection operation by leveraging exploit kits, launching fraudulent transactions\nfrom infected endpoints and circumventing 2FA by infecting victims’ mobile devices.\n\nBeyond the preprogrammed parts of its configuration files, Qadars relies on communication with remote servers and ATS panels to fetch\nmoney mule account numbers in real time. It also displays social engineering injections delivered from its servers in real time and can enable\nhidden remote control of infected machines to defraud their owners’ accounts.\n\n## Malware IOCs\n\n### Dropper MD5\n\nSome MD5 hashes are:\n\n[1979D1E5E9395025BC395BA00DF824CA](https://virustotal.com/en/file/ea40b17472f70c4b74969ef3b329486c9c0b7f49ce88490c0fe3409e796ad85c/analysis/)\n236034B533B76A025AE353F3577DC298\n26E2ECBDAEF376376141D5B42998D4CA\n394BED68BB412F26F8DF71874D346B9B\n63246F89F57498EDE2796169EA597DEF\n\n### AV Detection Aliases\n\nPresently, Qadars may not be detected as such by all anti-virus software. Current aliases from top AV vendors detect the dropper’s executable\nsample as:\n\nWin32/Sopinar.G\nTrojan.Win32.Yakes.qpxg\nBehavesLike.Win32.PWSZbot.dh\n\n\n-----\n\neu d\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after security expert, speaker and author and a strong\nadvocate for wom...\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-09-20 - Meanwhile in Britain, Qadars v3 Hardens Evasion, Targets 18 UK Banks.pdf"
    ],
    "report_names": [
        "2016-09-20 - Meanwhile in Britain, Qadars v3 Hardens Evasion, Targets 18 UK Banks.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535774,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653709925,
    "ts_modification_date": 1653709925,
    "files": {
        "pdf": "https://archive.orkl.eu/c29b0f6f11f65a068e18ac90e17206811d42ba28.pdf",
        "text": "https://archive.orkl.eu/c29b0f6f11f65a068e18ac90e17206811d42ba28.txt",
        "img": "https://archive.orkl.eu/c29b0f6f11f65a068e18ac90e17206811d42ba28.jpg"
    }
}