{
    "id": "62b62d45-1ee4-406c-9d1d-c19ff4fe2c0d",
    "created_at": "2022-10-25T16:48:12.944578Z",
    "updated_at": "2025-03-27T02:16:41.960408Z",
    "deleted_at": null,
    "sha1_hash": "e4772882fe35af3650068b0665a2d12c24999e51",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-01-14T08:30:02Z",
    "file_modification_date": "2020-01-14T08:30:02Z",
    "file_size": 294258,
    "plain_text": "# Resurgent Iron Liberty Targeting Energy Sector\n\n**[secureworks.com/research/resurgent-iron-liberty-targeting-energy-sector](https://www.secureworks.com/research/resurgent-iron-liberty-targeting-energy-sector)**\n\n**Threat Analysis**\nWednesday, July 24, 2019 By: Counter Threat Unit Research Team\nThe following analysis was compiled and published to Threat Intelligence clients in September\n2018. The Secureworks® Counter Threat Unit™ (CTU) research team is publicly sharing insights\n[about the IRON LIBERTY threat group, as well as details about the Karagany and](https://www.secureworks.com/research/updated-karagany-malware-targets-energy-sector)\n[MCMD malware used exclusively by IRON LIBERTY, to supplement the discussion of the man-](https://www.secureworks.com/research/mcmd-malware-analysis)\n[on-the-side technique described in the Secureworks Incident Response Insights Report 2019.](https://www.secureworks.com/resources/rp-incident-response-insights-report-2019)\n\n## Summary\n\nSince at least 2010, the IRON LIBERTY threat group (also known as TG-4192, Energetic Bear,\nDragonfly, and Crouching Yeti) has targeted the energy sector with a particular focus on industrial\ncontrol systems (ICS). Following public disclosures in 2014, the likely Russian government group\nbecame less visibly active, but by 2016 it resumed operations with a combination of new and old\ntechniques and tools. Secureworks® Counter Threat Unit™ (CTU) researchers' in-depth analysis\nof the group's capabilities and targeting revealed an evolving threat to the energy sector and ICS\nsystems, and to the defense and nuclear industries.\n\n## Background\n\n[In mid-2014, a number of public disclosures by security researchers highlighted the activity of a](https://www.symantec.com/connect/blogs/dragonfly-western-energy-companies-under-sabotage-threat-energetic-bear)\nthreat group that CTU™ researchers refer to as IRON LIBERTY. This group had been active\nsince at least 2010. Although its targeting was broad, it had a specific interest in the energy\nsector, including energy companies and organizations financing the energy sector, in the U.S. and\nEurope. The longevity of the threat group's campaign, the nature of the targeting, and active\ndevelopment of a custom toolset strongly suggested the group was resourced and operated by a\ngovernment. Technical indicators coupled with IRON LIBERTY's focus on the energy sector,\nespecially in Europe, led CTU researchers to assess that IRON LIBERTY was likely operated by\nor on behalf of the Russian government. This focus on energy organizations, including suppliers,\ncould align with Russian government intelligence priorities in support of its energy export-based\neconomy.\n\nPrior to 2014, IRON LIBERTY used custom malware, primarily Sysmain, Havex, and xFrost (now\nknown as Karagany), combined with commodity penetration testing and tools. IRON LIBERTY\nwas known for compromising targets via strategic web compromises (SWCs) using a custom\nexploit kit, through spearphishing campaigns, and by trojanizing legitimate installers that are then\nhosted on legitimate vendor app stores. In 2014, the group embedded Havex into legitimate\nremote management software for ICS and created industrial control scanning and enumeration\nmodules.\n\n[Public disclosures in 2014 revealed likely IRON LIBERTY activity. The group was reportedly](https://motherboard.vice.com/en_us/article/bmjdmd/hackers-target-300-norwegian-oil-and-energy)\n[involved with breaches of Norwegian oil and gas companies. It was also deemed responsible for](https://www.symantec.com/connect/blogs/dragonfly-western-energy-companies-under-sabotage-threat-energetic-bear)\nsimilar compromises in the U.S., the UK, and Canada. CTU researchers assessed that IRON\n\n\n-----\n\nLIBERTY's goal was to gather intelligence on the energy sector (particularly in Europe) to assist\nRussian government and corporate decision-making, and to gain access to energy-linked ICS for\nearly-stage reconnaissance and potentially as pre-positioning for sabotage operations.\nGovernment-affiliated threat groups are typically not deterred by public disclosures, so CTU\nresearchers expected IRON LIBERTY to reemerge with new malware and infrastructure.\n\nThe plugins deployed by Karagany malware compiled in 2018 contain links and similarities to\ntools used by the IRON LYRIC threat group (also known as TeamSpy) in 2012 and 2013,\nsuggesting that IRON LYRIC and IRON LIBERTY share at least some of their codebase. IRON\nLYRIC was last active in 2013, and CTU analysis suggests that it was operated by a Russian\n[intelligence service. The group covertly installed the TeamViewer desktop-sharing tool to surveil](https://portal.secureworks.com/portal/intel/tip/6735)\nindividuals.\n\n## The CASTLE campaign\n\nIn May 2017, CTU researchers began tracking a campaign that used spearphishing and SWCs to\ntarget the energy sector. Although the campaign was similar to earlier IRON LIBERTY operations,\nthere were no technical links to IRON LIBERTY. As a result, CTU researchers assigned the name\n[CASTLE to the cluster of activity identified in this campaign. Some reporting indicates that the](https://www.symantec.com/blogs/threat-intelligence/dragonfly-energy-sector-cyber-attacks)\nCASTLE campaign began as early as December 2015. By late 2016, it was in full swing.\n\nReminiscent of IRON LIBERTY's 2010-2014 activity, the CASTLE campaign used compromised\nenergy sector websites and spearphishing emails tailored for the energy and ICS industry to\ntarget individuals working in those sectors (see Figure 1). In contrast to the earlier activity,\n[CASTLE did not install malware on the victim's system. Instead, it employed a technique that](http://www.securitynewspaper.com/2017/05/17/can-steal-windows-login-credentials-via-google-chrome-scf-files/)\ntricked the victim's system into making an SMB request to a CASTLE-controlled server, allowing\nCASTLE to harvest the logged-in user's account name and NTLM password hash sent with the\n[request. Media reporting indicated that the threat actors modified an open-source tool called](https://blog.talosintelligence.com/2017/07/template-injection.html)\n[Phishery to perform template injection, in which the spearphishing email tricks the target system](https://github.com/ryhanson/phishery)\ninto requesting a remote template via SMB. The harvested credentials could allow the threat\nactors to access the target environment via single-factor authenticated Internet-facing services\nsuch as terminal services, a virtual private network (VPN), or corporate webmail.\n\n\n-----\n\n_Figure 1. CASTLE spearphishing lure document. (Source: Secureworks)_\n\n### Linking CASTLE to IRON LIBERTY\n\n[The UK's National Cyber Security Centre (NCSC), the United States Computer Emergency](https://www.ncsc.gov.uk/alerts/hostile-state-actors-compromising-uk-organisations-focus-engineering-and-industrial-control)\n[Readiness Team (US-CERT), and Symantec link the CASTLE campaign to IRON LIBERTY.](https://www.us-cert.gov/ncas/alerts/TA18-074A)\nSpecifically, Symantec detailed the threat group's use of the Trojan.Heriplor malware. CTU\nresearchers' comparison of Heriplor to an IRON LIBERTY Havex second-stage malware sample\nfrom 2014 revealed that the two samples wrote identical files and shared a command and control\n(C2) server, suggesting that Heriplor was developed from the Havex code base. CTU researchers\nhave no evidence that other threat actors have used Havex or Heriplor.\n\nCTU analysis has not revealed additional evidence linking CASTLE to IRON LIBERTY, but there\nis no reason to doubt these third-party assessments. The similarity in targeting and execution to\nprevious IRON LIBERTY campaigns led CTU researchers to assess that CASTLE was likely a\ncontinuation of IRON LIBERTY's activities and was directed by the Russian government. Figure 2\nshows a timeline of IRON LIBERTY activity between 2010 and 2018.\n\n\n-----\n\n_Figure 2. IRON LIBERTY timeline. (Source: Secureworks)_\n\n## 2017-2018 intrusion activity patterns\n\nIn 2017 and 2018, CTU researchers observed two distinct patterns of IRON LIBERTY intrusion\nactivity: access intrusions and full intrusions.\n\n### Access intrusions\n\nThe first pattern seems to be designed to obtain persistent access to the targeted network\nthrough account compromise and without much use of malware. For example, IRON LIBERTY\nused credentials obtained by capturing SMB requests to obtain access in the CASTLE campaign.\nIRON LIBERTY used stolen credentials and connected to systems using Remote Desktop\nProtocol (RDP) tools.\n\n[Post exploitation, the threat group used open-source tools such as the CrackMapExec](https://github.com/byt3bl33d3r/CrackMapExec)\n[penetration testing toolkit, the Mimikatz credential-theft tool, the Angry IP Scanner IP address and](https://github.com/gentilkiwi/mimikatz)\n[port scanner, and the PsExec Windows Sysinternals command-execution tool to move around the](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\nnetwork. In one incident, the threat actors were able to acquire domain administrator credentials\n[that allowed them to log on to the target's hypervisor, granting them full access to its virtualized](https://en.wikipedia.org/wiki/Hypervisor)\nservers. IRON LIBERTY makes efforts to remain undetected in a target network using tactics\nsuch as modifying the configuration of antivirus tools to prevent detection of malware deployed to\nthe network.\n\nTo establish persistent access to a network, IRON LIBERTY created malicious LNK files on file\nshares commonly accessed by the target organization's employees. When a user's system\nmounts these shares, the LNK file makes an external SMB request with the user's username and\nNTLM password hash to an IRON LIBERTY server. This data provides the threat group with a\n\n\n-----\n\nconstantly updated list of credentials. For additional access to a target network, IRON LIBERTY\nhas installed web shells on a target's Microsoft Exchange server. The Z_webshell is written in\nASPX and seems proprietary to this threat group.\n\n### Full intrusions\n\nThis pattern involves full exploitation of systems on the target network to steal information for\nespionage purposes. CTU researchers have observed IRON LIBERTY using this pattern during\nintrusions targeting energy, nuclear, and defense organizations. CTU researchers have been\nunable to confirm the initial access vector for these full intrusions. The threat actors may have\nused access intrusions against a related organization, such as a supplier, or may have leveraged\na trojanized Adobe Flash installation file. In at least one case, a user was served an installer from\nwhat appear to be valid Adobe Flash download URL. However, the size of the data download was\nlarger than the file that was saved to disk, suggesting that malicious content may have been\nserved alongside the legitimate installer. The trojanized installer may have self-modified shortly\nafter execution to remove all but minute traces of the malicious content, leaving only a legitimate\nAdobe Flash installer binary on disk.\n\nAfter establishing initial access, IRON LIBERTY typically deployed the Karagany malware. In\nmany cases, the threat group also used the MCMD remote access tool to download and install\nthe open-source SoftEther VPN application. By using legitimate VPN software to set up TLSencrypted bridges from its C2 infrastructure to target systems, IRON LIBERTY was able to hide\nits network traffic without deploying additional custom malware. IRON LIBERTY has also used\ncompromised service accounts to access systems in order to install and upgrade Karagany\nmalware, sometimes remotely via PsExec.\n\nIn several cases, IRON LIBERTY executed ProcDump via PsExec to dump the lsass.exe\n(Windows Local Security Authority Subsystem Service) process shortly before installing Karagany\non a target system. This process dump contains all hashed account credentials, including\ncredentials for the primary user and potentially for administrator and service accounts. These\ncredentials can then be cracked locally using Mimikatz or removed from the environment for\noffline cracking. CTU researchers observed these process dumps being compressed with rar.exe,\nwhich aligns with an intent to exfiltrate the files for offline password cracking. IRON LIBERTY\nleveraged these credentials to hide its intrusion activity. Installing and running malware in the\ncontext of the system's primary domain user is less likely to stand out than repeated use of\ncompromised service accounts across multiple hosts.\n\nThe threat group's malware is also designed to hamper incident response analysis. Karagany\ndeletes unneeded plugins and files, although evidence of staged exfiltrated data can sometimes\nstill be identified forensically. The C2 servers for the MCMD malware includes a self-destruct\nscript that attempts to wipe evidence of the tool from the compromised system.\n\nBecause IRON LIBERTY used a VPN to access systems, CTU researchers were only able to\npiece together a partial view of the information the threat actors stole from compromised\nnetworks. Examination of leftover artifacts in the Karagany malware folder structure revealed file\nlistings and key logs on victims' systems. The nature of the documentation indicates that IRON\nLIBERTY has a broad interest in energy generation and supply, as well as defense projects.\n\n\n-----\n\nSome of the victimology suggests that individuals might have been targeted based on Active\nDirectory role descriptions or relationships with other victims, rather than being targeted based on\nthe threat actors' knowledge of the organizations' structure or personnel.\n\n## Conclusion\n\nIRON LIBERTY took a hiatus after a series of public disclosures of its infrastructure and tools.\nHowever, by 2017 it re-emerged as a significant threat, particularly to the energy sector.\n\nThe IRON LIBERTY intrusion patterns observed by CTU researchers describe two very different\noperations. The first uses minimal tools to maintain access to a target network, with persistence\nachieved by ensuring a feed of password hashes that can then be replayed against single-factor\nremote access solutions. The second pattern is more indicative of a full-blown intelligence\noperation, using a variety of malware and tools and targeting and exfiltrating data for espionage\npurposes. Some of these tools can be traced back as far as IRON LIBERTY's pre-2014 activity.\n\nDue to the differences between the CASTLE campaign, which follows the first pattern, and other\n[IRON LIBERTY activity, some third parties categorize the perpetrators of the CASTLE campaign](https://www.dragos.com/blog/20180510Allanite.html)\nas separate from IRON LIBERTY. However, the shared targeting of the energy sector (particularly\nICS companies), and the similar techniques (particularly the use of energy industry SWCs) used\nby the CASTLE campaign and pre-2014 IRON LIBERTY activity led CTU researchers to link\nCASTLE to IRON LIBERTY.\n\nIRON LIBERTY's tactics, techniques, and procedures (TTPs) and time-tested arsenal of\nadvanced capabilities have resulted in successful and operationally secure intrusions that span\nlong time periods. CTU analysis indicates that the threat group continues to enhance existing\ntools (e.g., Karagany) while developing new tools (e.g., MCMD) to support its objectives. While\nICS has been a primary focus of the group's operations, IRON LIBERTY also conducts espionage\nactivities to obtain a wide range of information. The group poses a threat to the ICS community as\nwell as to the defense, nuclear, and energy sectors.\n\n## References\n\nBaird, Sean et al. \"Attack on Critical Infrastructure Leverages Template Injection.\" Cisco Talos.\n[July 7, 2017. https://blog.talosintelligence.com/2017/07/template-injection.html](https://blog.talosintelligence.com/2017/07/template-injection.html)\n\nByrne, Michael. \"Hackers Launch All-Out Assault on Norway's Oil and Gas Industry.\"\nMotherboard. August 31, 2014. https://motherboard.vice.com/en_us/article/bmjdmd/hackerstarget-300-norwegian-oil-and-energy\n\n[Dragos. \"ALLANITE.\" May 10, 2018. https://www.dragos.com/blog/20180510Allanite.html](https://www.dragos.com/blog/20180510Allanite.html)\n\nNational Cyber Security Centre. \"Advisory: Hostile state actors compromising UK organisations\nwith focus on engineering and industrial control companies.\" April 5, 2018.\nhttps://www.ncsc.gov.uk/alerts/hostile-state-actors-compromising-uk-organisations-focusengineering-and-industrial-control\n\n\n-----\n\nSecureworks. \"MCMD Malware Analysis.\" July 11, 2019.\n[https://www.secureworks.com/research/mcmd-malware-analysis](https://www.secureworks.com/research/mcmd-malware-analysis)\n\nSecureworks. \"Updated Karagany Malware Targets Energy Sector.\" July 11, 2019.\n[https://www.secureworks.com/research/updated-karagany-malware-targets-energy-sector](https://www.secureworks.com/research/updated-karagany-malware-targets-energy-sector)\n\nSymantec. \"Dragonfly: Western Energy Companies Under Sabotage Threat.\" June 30, 2014.\nhttps://www.symantec.com/connect/blogs/dragonfly-western-energy-companies-under-sabotagethreat-energetic-bear\n\nSymantec. \"Dragonfly: Western energy sector targeted by sophisticated attack group.\" October\n20, 2017. https://www.symantec.com/blogs/threat-intelligence/dragonfly-energy-sector-cyberattacks\n\nUS-CERT. \"Russian Government Cyber Activity Targeting Energy and Other Critical Infrastructure\n[Sectors.\" March 15, 2018. https://www.us-cert.gov/ncas/alerts/TA18-074A](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\n[Footnote: We also suggest reading the CTU blog titled Own The Router, Own The Traffic: As\n[threat actors increasingly target supply chains, man-on-the-side techniques introduce another](https://www.secureworks.com/blog/own-the-router-own-the-traffic)\nlayer of complexity that organizations must consider, June 24, 2019.]\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.24.Resurgent_Iron_Liberty/Resurgent%20Iron%20Liberty%20Targeting%20Energy%20Sector.pdf"
    ],
    "report_names": [
        "Resurgent Iron Liberty Targeting Energy Sector"
    ],
    "threat_actors": [
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d8dd2ca-5592-482e-b89d-6a7e1a49f4f6",
            "created_at": "2023-01-06T13:46:38.408359Z",
            "updated_at": "2025-03-27T02:00:02.826069Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "TeamSpy",
                "Team Bear",
                "Anger Bear",
                "IRON LYRIC"
            ],
            "source_name": "MISPGALAXY:TeamSpy Crew",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a792743d-78a4-40c9-9d9a-a12c52880297",
            "created_at": "2023-01-06T13:46:38.75457Z",
            "updated_at": "2025-03-27T02:00:02.909884Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "Palmetto Fusion",
                "Allanite"
            ],
            "source_name": "MISPGALAXY:ALLANITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4a2aaa17-e108-4a3f-8b0f-8c6bcba3db49",
            "created_at": "2022-10-25T16:07:24.30783Z",
            "updated_at": "2025-03-27T02:02:10.166694Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "Anger Bear",
                "Iron Lyric",
                "SIG39",
                "Team Bear"
            ],
            "source_name": "ETDA:TeamSpy Crew",
            "tools": [
                "SpY-Agent",
                "TVRAT",
                "TVSpy",
                "TeamSpy",
                "TeamViewer",
                "TeamViewerENT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0a0132a3-526d-4698-be49-5e75530c1417",
            "created_at": "2022-10-25T15:50:23.856139Z",
            "updated_at": "2025-03-27T02:00:55.559398Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "ALLANITE",
                "Palmetto Fusion"
            ],
            "source_name": "MITRE:ALLANITE",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1c4281e9-0a4c-4f20-94a2-25ed3661cc98",
            "created_at": "2022-10-25T16:07:23.301826Z",
            "updated_at": "2025-03-27T02:02:09.72625Z",
            "deleted_at": null,
            "main_name": "Allanite",
            "aliases": [
                "Palmetto Fusion"
            ],
            "source_name": "ETDA:Allanite",
            "tools": [
                "PsExec",
                "SecreetsDump",
                "THC Hydra"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041801,
    "ts_creation_date": 1578990602,
    "ts_modification_date": 1578990602,
    "files": {
        "pdf": "https://archive.orkl.eu/e4772882fe35af3650068b0665a2d12c24999e51.pdf",
        "text": "https://archive.orkl.eu/e4772882fe35af3650068b0665a2d12c24999e51.txt",
        "img": "https://archive.orkl.eu/e4772882fe35af3650068b0665a2d12c24999e51.jpg"
    }
}