{
    "id": "62ccc3af-42f3-4a85-a503-b331e9ba0b02",
    "created_at": "2023-01-12T15:04:55.159228Z",
    "updated_at": "2025-03-27T02:06:07.557319Z",
    "deleted_at": null,
    "sha1_hash": "085b7e029380735003fbecd531179cfc825bc302",
    "title": "2019-08-21 - Finding Neutrino",
    "authors": "",
    "file_creation_date": "2022-05-28T19:30:49Z",
    "file_modification_date": "2022-05-28T19:30:49Z",
    "file_size": 693562,
    "plain_text": "# Finding Neutrino\n\n**[web.archive.org/web/20191223034907/http://blog.ptsecurity.com/2019/08/finding-neutrino.html](https://web.archive.org/web/20191223034907/http://blog.ptsecurity.com/2019/08/finding-neutrino.html)**\n\nIn August 2018, PT Network Attack Discovery and our honeypots began to record mass scans of phpMyAdmin systems.\nScans were accompanied by bruteforcing of 159 various web shells with the command die(md5(Ch3ck1ng)). This\ninformation became the starting point of our investigation. Step by step, we have uncovered the whole chain of events\nand ultimately discovered a large malware campaign ongoing since 2013. Here we will give the details and the whole\nstory, from start to finish.\n\n## We got scanned!\n\nInfected bots from all over the world were randomly scanning IP addresses on the Internet. In doing so, they scanned PT\nNAD networks and diverse honeypots.\n\nRequest as viewed in the PT NAD interface\n\nScanning happened as follows:\n\nFirst, the bot bruteforced the path to phpMyAdmin by moving down a list.\nOnce it found phpMyAdmin, the bot started bruteforcing the password for the root account. The dictionary\ncontained about 500 passwords, the first guess of the attackers being \"root\" (the default password).\nNext, after the password was successfully bruteforced, nothing happened. The bot did not exploit vulnerabilities\nand did not execute code in any other way.\nIn addition to phpMyAdmin, the bot bruteforced paths to web shells, also by moving down a list, and tried executing\nsimple PHP commands. The dictionary contained 159 shell names, and this was the stage that left us wondering\nthe most.\n\nRequest to the web shell with a command. If the response contains a correct MD5 value, the server is infected.\n\n\n-----\n\nSuch scans were noted and described many times in summer 2018 by other researchers (isc.sans.edu/diary/rss/23860).\nBut nobody tried to discover their source and purpose.\n\nTo get the answers, we prepared honeypots posing as vulnerable servers. They were phpMyAdmin installations with\nroot:root credentials and web shells responding with the correct MD5 hash. For instance, in the previous screenshot, this\nwas a hash value of 6c87b559084c419dfe0a7c8e688a4239.\n\nAfter a while, our honeypots brought their first results.\n\n## The payload\n\nThe honeypot with web shell started to receive commands containing a payload. This payload, for instance, instructed to\nsave a new shell named images.php and execute commands in it:\n\nAfter we decoded the base64 commands, it became clear that the first two requests find out the computer's\nconfiguration, and the third request executes a PowerShell script to download external components. Base64 commands\nare transmitted in the \"code\" parameter. For authorization it uses the SHA1 hash from MD5 parameter \"a\". For the string\n\"just for fun\" the hash will be 49843c6580a0abc8aa4576e6d14afe3d94e3222f; only the last two bytes are checked.\n\nIn most cases, the external component is a Monero cryptocurrency miner. In Windows it gets installed in the %TEMP%\nfolder under the name lsass.exe. The miner version may vary. Some versions function without arguments and have a\nhard-coded wallet address. Most likely, this was done to reduce the risk of detection.\n\nThe second potential component is a PowerShell script with DLL library inside. It is downloaded from the server by\nanother PowerShell script. The library code is executed in memory, so it is not stored on disk. The DLL library is\nresponsible for spreading the malware and adding to the botnet.\n\nA similar case, Ghostminer, was already described by researchers from Minerva Labs in March 2018 (bit.ly/2XwjSxO).\nBut it derives from Neutrino, which dates back to 2013. Neutrino is also known as Kasidet. It was previously distributed\nvia emails and various exploit kits. Its functionality changed, but the protocol for communicating with the command and\ncontrol server and other artifacts remain unchanged. For instance, the string \"just for fun\" was used for authentication in\nsamples as old as January 2017. Nine reports on Neutrino from 2014 can be found in Malpedia (bit.ly/2VrRJpG). The\ndetails of the last report from Minerva Labs enabled us to spot changes in the ways this malware is distributed.\n\n## Neutrino\n\nThe second component is the one that interests us, because it searches for new hosts to infect.\n\n### How Neutrino searches for new servers\n\nAfter a server is infected, the first thing Neutrino does is change such TCP stack parameters as MaxUserPort and\nTcpFinWait2Delay. This is done to set up the infected host for the fastest scanning possible.\n\n\n-----\n\nCode for changing TCP stack parameters\n\nNext it contacts the command and control (C2) server, which oversees scanning on the infected computer. The C2 server\nsends a command to check random Internet servers for one of several vulnerabilities. The list of checks in the Neutrino\nversion from October 2018 was rather wide-ranging:\n\nSearch for XAMPP servers with WebDAV\nSearch for phpMyAdmin servers potentially vulnerable to CVE-2010-3055 (an error in the setup.php configuration\nscript)\n[Search for Cacti's Network Weathermap plug-ins vulnerable to CVE-2013-2618](https://web.archive.org/web/20191223034907/http://bit.ly/2VoWOPw)\nSearch for Oracle WebLogic vulnerable to CVE-2017-10271\nSearch for Oracle WebLogic vulnerable to CVE-2018-2628\nSearch for IIS 6.0 servers vulnerable to remote code execution via the HTTP PROPFIND method (CVE-2017-7269)\nSearch for and exploitation of the infamous hole in Apache Struts2\n[Search for exposed Ethereum nodes: in June 2018, attackers were able to steal $20 million in this way](https://web.archive.org/web/20191223034907/https://cryptoslate.com/hackers-scoop-20-million-in-eth-from-exposed-ethereum-nodes/)\nBruteforcing the \"sa\" account in Microsoft SQL: after successful bruteforcing, Neutrino tries to execute code via\nxp_cmdshell\nSearch for phpMyAdmin installations without credentials\nBruteforcing phpMyAdmin installations with credentials\nExtensive logic for searching for listed PHP web shells\n\nModules that appeared after the Minerva Labs report are shown in green. The last item on this list, the search for web\nshells, is the one responsible for the scans that caused us to start our investigation. The list included 159 addresses with\nunique parameters. For example:\n\nwuwu11.php:h\nweixiao.php:weixiao\nqwq.php:c\n\nCode responsible for web shell scanning\n\nThe preceding screenshot illustrates the relevant Neutrino code.\n\nIn addition to scanning for vulnerabilities, Neutrino can execute arbitrary commands and take screenshots. In the version\nfrom December 2018, the authors added three more modules:\n\nSearch for exposed Hadoop servers\nBruteforcing credentials for TomCat servers\nSearch for JSP shells from a list\n\nWe have seen the names of these JSP shells before in the JexBoss (github.com/joaomatosf/jexboss) and JBoss worm\n(bit.ly/2UeM9H9).\n\nWhile studying this botnet, we have seen it change behavior several times. The first scans in summer contained the\n\"Ch3ck1ng\" check, but then moved on to \"F3bru4ry\" in february. These strings are stored inside the Neutrino module in\nstatic form. This indicates an update to Neutrino. For instance, the C2 address changed or a new module was added.\n\n## C2 communication\n\n\n-----\n\nData exchange between the Neutrino bot and C2 server is encoded in base64. The Cookie and Referer headers are\nalways the same, and serve for authorization.\n\nExchange of commands between Neutrino bot and C2 server\n\nIn the very beginning, the bot checks the C2 connection with a simple pair of messages: Enter–Success. Next it checks\nin by sending brief information on the system. This request is shown in the previous screenshot. The request provides\ndata on RAM, CPU, and username. The serial number of the volume containing the system partition is used as a unique\nhost-specific ID. The C2 server responds with a new task for the host. This could be a search for new vulnerable hosts or\nexecution of commands. For instance, the PMAFind command (in the screenshot) initiates a search for servers\ncontaining phpMyAdmin, Hadoop, Tomcat, listed shells, and WebDAV.\n\nIf Neutrino finds a vulnerable server, by bruteforcing the password for phpMyAdmin, for example, it informs the C2\nserver. Data is exchanged with base64 encoding. For example:\nPMAFind&XXXXXXXX&TaskId&[Crack:PMA] root/root&http://11.22.33.44/phpmyadmin/index.php\n\n## Miner\n\nUnlike the Neutrino module, the miner is stored on the disk and starts automatically. This is controlled by a service\nnamed \"Remote Procedure Call (RPC) Remote\" or the WindowsUpdate task, which run the PowerShell code. This code\nis stored in the EnCommand field of the WMI space root\\cimv2:PowerShell_Command. The executable file of the miner\nitself occupies the nearby EnMiner field. For operation, Neutrino and the miner write to certain fields of the same space,\nsuch as process ID (PID) and version number.\n\nThe script from the EnCommand field launches EnMiner in several steps.\n\n1. The KillFake function kills processes that imitate standard ones. One such process could be explorer.exe, if it is run\n\nfrom a place other than %WINDIR%. The function then deletes them from disk.\n2. KillService stops and removes services whose names match the preset mask.\n\n\n-----\n\n3. Killer removes services, tasks, and processes by a list of names or by launch arguments.\n4. The Scanner function checks the content of each launched process and deletes any that contain strings typical of\n\ncryptocurrency miners.\n5. The lsass.exe miner is saved in the %TEMP% folder and launched.\n\nTo generalize, the KillFake, KillService, Killer, and Scanner functions are responsible for getting rid of Neutrino's\ncompetitors. They will be described later on in this article. An example of the EnCommand script is available at\npastebin.com/bvkUU56w.\n\nAddresses of XMR wallets vary from sample to sample. On average, each address got 10–40 XMR. The first\ntransactions started in December 2017. But some hosts were taken over by other malware. For instance, the address\n41xDYg86Zug9dwbJ3ysuyWMF7R6Un2Ko84TNfiCW7xghhbKZV6jh8Q7hJoncnLayLVDwpzbPQPi62bvPqe6jJouHAsGNkg2\nreceived 1 XMR a day starting February 2018, for a total of 346 XMR. The same address is mentioned in a June 2018\nreport from Palo Alto Networks (\"The Rise of Cryptocurrency Miners\"). The report describes the surge of malicious\ncryptocurrency mining. As of June 2018, such miners' estimated haul was $175 million, or five percent of total Monero\ncoins in circulation.\n\n## My php, your admin\n\nBecause the Neutrino bot itself does not exploit vulnerabilities, but only collects a list of servers, the infection mechanism\nremained unclear. Our bait consisting of a phpMyAdmin server with default account shed some light on the matter. We\nwatched in real time as our server was attacked and got infected.\n\n### phpMyAdmin infection process\n\nInfection took place in several stages:\n\n1. First was login to phpMyAdmin. The credentials had been guessed earlier during scanning.\n\n2. Some reconnaissance. The attacker requests phpinfo scripts at different paths.\n\n3. The phpMyAdmin interface allows making SQL queries to a database. The attacker sends the following queries:\n\na. select '' into outfile ''\n\nb. SELECT \"\" INTO OUTFILE \"/home/wwwroot/default/images.php\"\n\nThe content of \"select\" is then saved to disk. The following queries serve in case of an error:\n\nSET GLOBAL general_log = 'OFF'\n\nSET GLOBAL general_log_file = '/home/wwwroot/default/images.php'\n\nSET GLOBAL general_log = 'ON'\n\nSELECT \"\"\n\nSET GLOBAL general_log = 'OFF'\n\nSET GLOBAL general_log_file = 'MySQL.log'\n\n4. And finally, some queries that we are familiar with already:\n\nPOST /images.php “a=just+for+fun&code=ZGllKCJIZWxsbywgUGVwcGEhIik7”\n\nAn automatic script was written to hack phpMyAdmin. It tries using one of two mechanisms:\n\nSELECT INTO OUTFILE writes the content of the query to disk.\nThe log file is piped to a PHP script with the help of MySQL variables.\n\nThe first method is well known, and it usually fails, because of the --secure-file-priv option. But we had not seen the\nsecond method before. Usually MySQL does not allow piping a log file outside of the @@datadir variable, but this was\npossible in an installation from the phpStudy package. This second method was what made Neutrino \"popular\" on\nphpMyAdmin servers The web shell content will be different for the two infection methods\n\n\n-----\n\nThis is what the web shell response looks like when created by the second method (piping of MySQL log):\n\nTo our delight, the log contains actual dates. They can be found in responses from some images.php shells, which\nallowed us to determine the actual time they were implanted. This is important, because the sent commands sometimes\ninclude the following:\n\ntime = @strtotime(\"2015-07-16 17:32:32\");\n@touch($_SERVER[\"SCRIPT_FILENAME\"],$time,$time);\n\nWhere $_SERVER[SCRIPT_FILENAME] contains \"images.php\". This command changes the date of the most recent\nmodification of the file to July 16, 2015. Likely this is a (futile) attempt to complicate analysis of the Neutrino campaign\nBased on the content of some shells, it is possible to determine the dates of shell creation.\n\n### The second malware campaign\n\nSurprisingly, we captured a record of images.php but also wuwu11.php, which had the body . Infection occurred with a\nsimilar mechanism. However, there were some interesting differences:\n\nSQL queries were not sent all at once, but one at a time.\nThe content of the web shells is completely different; wuwu11.php does not require authorization.\nThe payload is different, too. Those who wrote wuwu11 and others implanted Trojan.Downloader to chaindownload malware, but not the miner.\n\nThe difference in infection methods and shell bruteforcing in Neutrino itself indicate the existence of two simultaneous\nmalware campaigns. Neutrino is mining cryptocurrency, while the second campaign downloads malware.\n\nWe analyzed the dates when shells were created on the infected hosts, thanks to which we determined with certainty\nwhich came first. The first shells with the self-explanatory name \"test.php\" date back to 2013, while \"db__.init\",\n\"db_session.init\", and \"db.init\" started showing up in 2014. Neutrino started infecting phpMyAdmin servers in January\n2018 by means of vulnerabilities or competitor shells. The peak of Neutrino activity was in summer 2018. The following\ngraph demonstrates the creation dates of Neutrino shells and of the competitor.\n\n\n-----\n\n### Botnet structure\n\nAs we learned, the Neutrino botnet has a clear division of labor among infected hosts. Some mine cryptocurrency and\nscan the Internet, while others act as proxy servers. The Gost utility on port 1443 is used for proxying. The shell on such\nhosts is named image.php (with no \"s\" at the end).\n\nsvchost.eXe 1388 SYSTEM C:\\Windows\\System\\svchost.exe -L=https://GoST:GoST@:1443\n\nSuch proxy hosts are few. They are used to implant images.php on vulnerable servers found previously, as well as to\nsend out commands, primarily for removing competitors from hosts and launching cryptominers. Commands are sent at\na rate of up to1,000 unique IPs per hour.\n\nIn most cases, connections to proxy port 1443 originate from subnets of ChinaNet Henan Province Network\n(1.192.0.0/13, 171.8.0.0/13 123.101.0.0/16, 123.52.0.0/14, and others).\n\nNow that we know the structure of the malware campaigns, we can scan the Internet for their shells and estimate the\nsize of the botnet.\n\n## Scanning the Internet\n\nAs mentioned already, the images.php web shell is implanted in the root WWW directory. Its presence and the HTTP\nresponse are clear indicators of infection. To estimate the size of the botnet, we need to send a query to images.php on\nall web servers on the Internet. A list of servers with port 80 is readily available at scans.io. (Censys scans the Internet\nand updates the list weekly.) It contains 65 million web servers, and we sent the query \"GET /images.php\" to each. We\ngot a positive response from about 5,000 servers, which is only a portion of the botnet. Our honeypots were regularly\nscanned from new, previously unidentified IP addresses.\n\n### Botnet composition\n\nSo what, and who, are all these servers? Shodan can help us find the answer. More than half of the servers return Win32\nor Win64 in the \"Server\" header.\n\nNote the Server header: Apache on Windows.\n\n\n-----\n\nAccording to Shodan, the share of Windows among Apache servers is less than four percent. So the abnormally high\nnumber of Windows systems in our results must be caused by specific software. True enough, some servers return the\nfollowing start page:\n\nphpStudy, main page\n\nphpStudy is an integrated learning environment popular not only in China. In a single click it installs the Apache web\nserver, MySQL database, PHP interpreter, and phpMyAdmin panel. It also has several configurations for Windows and\nLinux. The latest version of phpStudy 2017 from the official site is still vulnerable to log file piping. You can verify this for\nyourself.\n\nThe vulnerability in phpStudy is not the only major source of bots. The scan revealed over 20,000 servers vulnerable to\nCVE-2010-3055. This is also a vulnerability in phpMyAdmin, but related to the setup.php configuration script. The botnet\nsends them POST queries that contain malicious configurations. Next, in terms of bot sources, come servers with Cacti's\nNetwork Weathermap (CVE-2013-2618) and XAMPP with exposed WebDAV.\n\nHackers found a use even for phpMyAdmin panels that are patched but have weak passwords. A common technique for\nmonetization is to export the database to an attacker-controlled hard drive, delete the database from the phpMyAdmin,\nand leave a ransom message:\n\nMost likely, this has nothing to do with the Neutrino campaign.\n\n## Conclusions\n\nIn 2018, Neutrino development continued its march forward. The malware used to be distributed via email attachments\nand exploit kits, but in 2018 it debuted as a botnet.\n\nNow Neutrino scans are among the top three senders of queries to our honeypots. These \"leaders\" are bruteforcing of\nadmin panels, shell bruteforcing, and exploitation of vulnerabilities By scanning for over ten vulnerabilities and\ncompetitors' shells, Neutrino has assembled tens of thousands of bots. Most of those are Windows systems running\nphpStudy, which Neutrino uses to mine Monero. Checks for new exploits are regularly added to its code. The same day\nwhen an exploit for ThinkPHP (bit.ly/2IKAyhu), was published, we spotted a new version of Neutrino.\n\nBut the malware behaves in a careful way. First it finds vulnerable servers and then, after a while, selectively infects them\nwith the images.php shell. It uses a number of ways to hide:\n\nExecuting code from memory.\nChecking the shell in several stages before executing code.\nPlacing C2 on infected servers.\n\nWe can detect its presence based on specific network requests. At Positive Technologies, we develop detection rules for\nnetwork attacks. The rules are similar to antivirus signatures, but they check network traffic. We started this article by\ndescribing how PT NAD found strange requests based on some tell-tale attributes. Specifically, these were bruteforcing\nof phpMyAdmin and shells. This is how the rules trigger window looks in the PT NAD interface.\n\n\n-----\n\nSignature triggered during a scan by Neutrino bot\n\nEven though in the example the Neutrino bot was unsuccessful, our rules will detect exploitation of any vulnerability or\nserver infection. We have published some of our rules on GitHub (bit.ly/2IL3R3F). To protect servers from Neutrino\ninfection, we recommend that administrators: Check the password for the root account in phpMyAdmin. Make sure to\npatch services and install the latest updates. Remember, Neutrino is regularly updated with new exploits.\n\n**Author: Kirill Shipulin, PT ESС**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-08-21 - Finding Neutrino.pdf"
    ],
    "report_names": [
        "2019-08-21 - Finding Neutrino.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535895,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653766249,
    "ts_modification_date": 1653766249,
    "files": {
        "pdf": "https://archive.orkl.eu/085b7e029380735003fbecd531179cfc825bc302.pdf",
        "text": "https://archive.orkl.eu/085b7e029380735003fbecd531179cfc825bc302.txt",
        "img": "https://archive.orkl.eu/085b7e029380735003fbecd531179cfc825bc302.jpg"
    }
}