{
    "id": "6315e9c2-8cdb-44ab-a4db-9f7d28c05cf8",
    "created_at": "2023-01-12T15:07:23.116459Z",
    "updated_at": "2025-03-27T02:05:54.236938Z",
    "deleted_at": null,
    "sha1_hash": "954ce6abbd47864dba7fb4838f85941844776e6a",
    "title": "2022-03-18 - Open Source Maintainer Sabotages Code to Wipe Russian, Belarusian Computers",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:12Z",
    "file_modification_date": "2022-05-27T23:00:12Z",
    "file_size": 1325727,
    "plain_text": "# Open Source Maintainer Sabotages Code to Wipe Russian, Belarusian Computers\n\n**[vice.com/en/article/dypeek/open-source-sabotage-node-ipc-wipe-russia-belraus-computers](https://www.vice.com/en/article/dypeek/open-source-sabotage-node-ipc-wipe-russia-belraus-computers)**\n\nHacking. Disinformation. Surveillance. CYBER is Motherboard's podcast and reporting on\nthe dark underbelly of the internet.\n\n[See More →](https://www.vice.com/en/topic/cyber)\nA technologist and maintainer of a popular piece of open source software has deliberately\nsabotaged their own code to wipe data on computers that used the program in Russia and\nBelarus, and has faced a massive backlash for doing so, according to messages posted on\ncoding repository Github.\n\n\n-----\n\nThe news signals the potential downsides of digital hacktivism, with the move likely\nimpacting ordinary people that were using the code.\n\nRIAEvangelist is the maintainer of the software called “node-ipc,” a networking tool that’s\n[sometimes downloaded over a million times a week. RIAEvangelist released two modules](https://npm-stat.com/charts.html?package=node-ipc&author=&from=&to=)\n[called “peacenotwar” and “oneday-test” recently, Bleeping Computer reported on Thursday.](https://www.bleepingcomputer.com/news/security/big-sabotage-famous-npm-package-deletes-files-to-protest-ukraine-war/amp/)\nPeacenotwar, which RIAEvangelist has described as “protestware,” was then included as a\ndependency in node-ipc’s code, meaning some versions of node-ipc may come bundled with\npeacenotwar.\n\n**_Do you know about any other instances of hacking taking place around the_**\n**_Ukraine invasion? We'd love to hear from you. Using a non-work phone or_**\n**_computer, you can contact Joseph Cox securely on Signal on +44 20 8133 5190,_**\n**_Wickr on josephcox, or email_** [joseph.cox@vice.com.](http://10.10.0.46/mailto:joseph.cox@vice.com)\n\n“This code serves as a non-destructive example of why controlling your node modules is\nimportant. It also serves as a non-violent protest against Russia's aggression that threatens\nthe world right now. This module will add a message of peace on your users' desktops, and it\nwill only do it if it does not already exist just to be polite,” RIAEvangelist wrote in the\ndescription for the peacenotwar code. RIAEvangelist’s description also explained how other\npeople could add the module to their code in order to take part in the digital protest.\n\nOn the GitHub page for peacenotwar, RIAEvangelist included a link to a YouTube video and\nlyrics from the peace song “One Day” by Mattisyahu, the Jewish American reggae musical\nartist.\n\nBut then some versions of “node-ipc,” the much more popular piece of software that\nRIAEvangelist maintains, started overwriting files on computers based in Russia and Belarus\n[with a heart emoji, according to a post on GitHub.](https://gist.github.com/MidSpike/f7ae3457420af78a54b38a31cc0c809c)\n\nA screenshot of an analysis from GitHub user MidSpike. Image: MidSpike.\n\nRIAEvangelist told Motherboard in an email that “There was no actual code to wipe\ncomputers. It only puts a file on the desktop.” He then pointed to a Twitter account he said\nbelonged to him and which had now been targeted by hackers.\n\nHis LinkedIn profile is no longer available. Six hours ago, RIAEvangelist updated the nodeipc page to read “Thanks for all the free pizza, and thanks to all the police that showed up to\nSWAT me. They were really nice fellas.”\n\nThe GitHub page for node-pic is now full of reactions to RIAEvangelist’s apparent sabotage.\n\n“You’re a stain on the FOSS [free and open source software] community,” reads one. “You\njust destroyed your work, career and probably your online life,” another adds. Others include\nlinks to RIAEvangelist’s social media accounts.\n\n\n-----\n\n_Update: This piece has been updated to include a response from RIAEvangelist._\n\n**_Subscribe to our cybersecurity podcast,_** **_[CYBER. Subscribe to](https://itunes.apple.com/gb/podcast/cyber/id1441708044?mt=2)_** **_our new Twitch_**\n**_channel._**\n\n## ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX.\n\nBy signing up, you agree to the [Terms of Use and](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/terms-of-use.html) [Privacy Policy & to receive electronic](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/privacy-policy.html)\ncommunications from Vice Media Group, which may include marketing promotions,\nadvertisements and sponsored content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-18 - Open Source Maintainer Sabotages Code to Wipe Russian, Belarusian Computers.pdf"
    ],
    "report_names": [
        "2022-03-18 - Open Source Maintainer Sabotages Code to Wipe Russian, Belarusian Computers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536043,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653692412,
    "ts_modification_date": 1653692412,
    "files": {
        "pdf": "https://archive.orkl.eu/954ce6abbd47864dba7fb4838f85941844776e6a.pdf",
        "text": "https://archive.orkl.eu/954ce6abbd47864dba7fb4838f85941844776e6a.txt",
        "img": "https://archive.orkl.eu/954ce6abbd47864dba7fb4838f85941844776e6a.jpg"
    }
}