{
    "id": "63172e84-64b5-4772-9774-3331008542e2",
    "created_at": "2023-01-12T15:03:13.044604Z",
    "updated_at": "2025-03-27T02:06:07.861513Z",
    "deleted_at": null,
    "sha1_hash": "7a3653506fd642fde7de308df973c877e6744d03",
    "title": "2019-12-11 - Maze Ransomware Behind Pensacola Cyberattack, $1M Ransom Demand",
    "authors": "",
    "file_creation_date": "2022-05-27T01:58:56Z",
    "file_modification_date": "2022-05-27T01:58:56Z",
    "file_size": 250710,
    "plain_text": "# Maze Ransomware Behind Pensacola Cyberattack, $1M Ransom Demand\n\n**[bleepingcomputer.com/news/security/maze-ransomware-behind-pensacola-cyberattack-1m-ransom-demand/](https://www.bleepingcomputer.com/news/security/maze-ransomware-behind-pensacola-cyberattack-1m-ransom-demand/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nDecember 11, 2019\n01:57 PM\n2\n\nThe operators behind the Maze Ransomware have claimed responsibility for the cyberattack\naffecting the City of Pensacola, Florida, but state that they are not affiliated with the recent\nshooting at NAS Pensacola.\n\nIn an email conversation with BleepingComputer, the operators of the Maze Ransomware\nstated that they were responsible for encrypting the city's data and have demanded a\n$1,000,000 ransom for a decryptor.\n\nWhen Maze targets a network, they will steal the victim's files before they are encrypted. The\nattackers then tell the victim that they will publicly release these files unless the ransom is\npaid.\n\nMaze is not the first ransomware to make these claims, but as we have seen with the release\nof Allied Universal's documents, the Maze crew appears to be willing to follow up with their\nthreats.\n\nMaze has shared documents that were allegedly stolen from the city, but did not state if they\nhave given a deadline to Pensacola or will release them.\n\n\n-----\n\nOne item that appeared to be of concern to the Maze operators was the timing of their\nattack.\n\nWithout our prompting, the Maze Ransomware operators expressed concerns about being\nlinked to the recent NAS Pensacola shooting and told BleepingComputer that they had\nnothing to do with it.\n\n\"We also must tell you that there is no any connections with the shooting event that occurred\nbefore running maze. We did not know about this. It is just coincidence.\"\n\n## Maze states they avoid emergency services\n\nMaze also wanted to reassure us that they purposely avoided emergency services, or what\nthey call 'socially significant services', such as 911.\n\n\"Also we want to emphasize that no one of the socially significant services has suffered (for\nexample 911).\"\n\nWhen we asked if they purposely avoided services like these, they told us that medical care\ncenters or other 'socially vital objects' are not allowed and will decrypt any that are encrypted\nfor free.\n\n\"We don’t attack hospitals, cancer centers, maternity hospitals and other socially vital\nobjects, up to the point that if someone uses our software to block the latter, we will provide a\ndecrypt for free.\"\n\n## City Recovering\n\nWhen we attempted to confirm if the information provided by Maze is accurate, Kaycee\nLagarde, Public Information Officer for the City of Pensacola, told BleepingComputer that\ndue to ongoing investigations they could not provide additional details.\n\nLagarde did tell us that the city is slowly recovering and that their mail servers are back up\nand that most landlines have been restored. Employees, though, continue to be unable to\naccess their computers or the Internet until all of the issues are resolved.\n\nWe are currently in an assessment and recovery mode, and our IT Department is continuing\nto work diligently to make sure all computers are free of any viruses before we reconnect\nthem to the network. We don’t have an estimated time of completion, but they are working to\nrestore services as quickly as possible. As IT works to restore services, they are also looking\ninto bringing experts in to assist with evaluating any potential impacts to data.\n\nOur email servers are back up, but since IT still has our computers disconnected from the\nnetwork, city employees only have limited access to email (via smartphone for employees\nwho have city cell phones).\n\n\n-----\n\nMost landlines have been restored.\n\nThe city remains operational, but we are somewhat limited since we aren’t able to use our\ncomputers or internet until these issues are resolved. Emergency dispatch and 911 services\nwere not impacted and continue to operate. Our website at cityofpensacola.com and online\npermitting services at mygovernmentonline.org were not impacted and remain operational.\n\n### Related Articles:\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[SpiceJet airline passengers stranded after ransomware attack](https://www.bleepingcomputer.com/news/security/spicejet-airline-passengers-stranded-after-ransomware-attack/)\n\n[US Senate: Govt’s ransomware fight hindered by limited reporting](https://www.bleepingcomputer.com/news/security/us-senate-govt-s-ransomware-fight-hindered-by-limited-reporting/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-11 - Maze Ransomware Behind Pensacola Cyberattack, $1M Ransom Demand.pdf"
    ],
    "report_names": [
        "2019-12-11 - Maze Ransomware Behind Pensacola Cyberattack, $1M Ransom Demand.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535793,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653616736,
    "ts_modification_date": 1653616736,
    "files": {
        "pdf": "https://archive.orkl.eu/7a3653506fd642fde7de308df973c877e6744d03.pdf",
        "text": "https://archive.orkl.eu/7a3653506fd642fde7de308df973c877e6744d03.txt",
        "img": "https://archive.orkl.eu/7a3653506fd642fde7de308df973c877e6744d03.jpg"
    }
}