{
    "id": "631c2e10-e07d-4b69-a3e1-580fb3b21e30",
    "created_at": "2022-12-10T18:58:36.698398Z",
    "updated_at": "2025-03-27T02:09:30.364236Z",
    "deleted_at": null,
    "sha1_hash": "357eec6e9de0c4eaeea1912bae0c658d5ec24212",
    "title": "Microsoft Word - Triton Security Notification_detection  removal_12-13-18_01_Final.docx",
    "authors": "",
    "file_creation_date": "2018-12-14T15:52:47Z",
    "file_modification_date": "2018-12-14T10:56:19Z",
    "file_size": 179330,
    "plain_text": "### Schneider Electric Security Notification\n\n#### Security Notification – EcoStruxure Triconex Tricon V3\n\n**14 December 2017 Updated 14 December 2018**\n\n#### Overview\nIn December 2018, Schneider Electric issued a security notification related to a directed incident\nthat affected a single customer’s Triconex Tricon safety shutdown system.\n\nSchneider Electric has worked closely with the customer, independent cybersecurity\norganizations and the U.S. Department of Homeland Security/ICS-CERT to investigate and\nmitigate the risks of this type of attack. It is important to note that the legacy Tricon system\nresponded appropriately, taking the plant to a safe state as designed. No harm was incurred by\nthe customer or the environment.\n\nDuring our extensive investigation, Schneider Electric identified a vulnerability in the Tricon\nfirmware, which is limited to a small number of older versions of the Tricon. This vulnerability\nwas a part of a complex malware infection scenario. To date, the information gathered indicates\nthat if the Tricon key switch had been left in the correct position per our recommended\nguidelines, the injection of malware would not have been successful.\n\n____________________________________________________________________________\n\nThrough the recently enhanced Tricon CX controller, version 11.4, Schneider Electric has\nmitigated the risks of these type of malware incidents. The company has also released a\nprocess to detect the malware’s presence in a Tricon controller and a procedure to remove the\nmalware if discovered. As of February 1, 2019, Schneider Electric will require customers to\nhave a support contract in place to engage with this malware analysis service. For more\ninformation, please contact your Global Customer Support Representative.\n\n____________________________________________________________________________\n\nSchneider Electric continues to recommend customers always implement the instructions\ncontained in the “Security Considerations” section in the Triconex documentation (i.e., Planning\nand Installation Guides and TriStation 1131 Developers Guide).\n\n\n#### Affected Product(s)\n\n\n\n- Tricon Model MP3008, versions 10.0 – 10.4\n\n\n#### Remediation\n\n\n14-Dec-17 (14-Dec-18)   Document Reference Number – SEVD-2017-347-01 V3 Page 1 of 5\n\n\n-----\n\n### Schneider Electric Security Notification\n\nSchneider Electric strongly recommends users upgrade to the latest Triconex Tricon CX\nversion. Released in October 2018, Tricon CX v11.4 is compliant with the IEC 62443\ncybersecurity standard and includes multiple security enhancements that meet the challenges\nposed by the Triton/Hatman malware techniques and other sophisticated methods of attack.\n\n#### Vulnerability Details\nThe malware requires unrestricted access to the safety network via remote network or physical\naccess. Additionally, the malware requires the Tricon key switch to be in the “PROGRAM”\nmode to successfully deploy its payload.\n\nThe malware has the capability to scan and map the industrial control system to provide\nreconnaissance and issue commands to Tricon controllers. Once deployed, this type of\nmalware, known as a Remotely Accessible Trojan (RAT), controls a system via a remote\nnetwork connection as if by physical access.\n\n#### Detection and Mitigation \nTriconex customers should contact their local Schneider Electric office for assistance with a\nprocedure Schneider Electric has developed to detect the Hatman/Triton malware’s presence in\na Tricon controller and to remove the malware if discovered. Schneider Electric will fully assess\nthe security of each Tricon safety system installation, analyze for the presence of the malware\nand remove it if necessary. For customers who prefer to do this on their own, Schneider Electric\nhas made the malware detection process instructions and support material available for\ndownload via the Schneider Electric Process Automation customer support portal. Once the\nanalysis is complete, Triconex users will receive a report for each Tricon system analyzed\nadvising whether the malware was detected and the steps to take to remove it.\n\n____________________________________________________________________________\n\nAs of February 1, 2019, Schneider Electric will require customers to have a support contract in\nplace to engage this malware detection, analysis and removal service. For more information,\nplease contact your Global Customer Support Representative\n\n____________________________________________________________________________\n\nAdditionally, Schneider Electric recommends customers always keep their antivirus tools up to\ndate and ensure they are using the latest antivirus .dat files on the engineering workstation\nwhere the TriStation terminal is installed. Signatures for the malware have been distributed to\ncybersecurity organizations. Schneider Electric has confirmed that major antivirus vendors now\ninclude the malware file’s signatures and that if detected, the antivirus tool takes action.\n\nSchneider Electric understands that all customers are not in a position for immediate upgrade to\nour latest Tricon product with our latest security features. Because of this, Schneider Electric\ncontinues to recommend customers always implement the instructions in the “Security\n\n14-Dec-17 (14-Dec-18)   Document Reference Number – SEVD-2017-347-01 V3 Page 2 of 5\n\n\n-----\n\n### Schneider Electric Security Notification\n\nConsiderations” section in the standard Triconex documentation (i.e., Planning and Installation\nGuides and TriStation 1131 Developers Guide), which include the following:\n\n- Ensure the cybersecurity features in Triconex solutions are always enabled.\n\n- Safety systems must always be deployed on isolated networks.\n\n- Physical controls should be in place so that no unauthorized person would have access to\n\nthe safety controllers, peripheral safety equipment or the safety network.\n\n- All controllers should reside in locked cabinets and never be left in the “PROGRAM” mode.\n\n- All Tristation engineering workstations should be secured and never be connected to any\n\nnetwork other than the safety network.\n\n- All methods of mobile data exchange with the isolated safety network such as CDs, USB\n\ndrives, DVD’s, etc. should be scanned before use in the Tristation engineering workstations\nor any node connected to this network.\n\n- Laptops and PCs should always be properly verified to be virus and malware free before\n\nconnection to the safety network or any Triconex controller.\n\n- Operator stations should be configured to display an alarm whenever the Tricon key switch is\n\nin the “PROGRAM” mode.\n\nCyber Preparedness:\n\n- Also, review and assess your site’s cyber preparedness. Schneider Electric is a proponent of\n\nthe NIST Cyber Security Framework and is ready to assist.\n\n- The Schneider Electric Product Security Office continues to work with ICS-CERT and will\n\nupdate this advisory as more information becomes available.\n\n- Always refer to the Global Customer Support website for the latest list of Triconex security\n\nrecommendations, or contact your local Triconex representative.\n\n- If you require additional support, Schneider Electric Industrial Cybersecurity Services team\n\nare available to help. Please visit: http://www.schneider-electric.com/b2b/en/services/fieldservices/industrial-automation/industrial-cybersecurity/industrial-cybersecurity.jsp%20\n\n\n#### For More Information\n\n\n\n- ICS-CERT - https://ics-cert.us-cert.gov/advisories\n\nIf you have any questions, please contact your local Service Representative or a Schneider Electric\nSupport Center at:\n\n**GCS Center** **America's GCS** **Asia Pacific GCS** **EMEA GCS**\n\nLocation Foxboro MA USA Shanghai Baarn NL\n\nPhone +1-866-746-6477 +86 21 37180086 +31-3554-84125\n\nInternationally +1-508-549-2424\n\n14-Dec-17 (14-Dec-18)   Document Reference Number – SEVD-2017-347-01 V3 Page 3 of 5\n\n\n-----\n\n### Schneider Electric Security Notification\n\nFax +1-508-549-4999 +86 21 37180196 +31-3554-84230\n\nEmail America's GCS Asia Pacific GCS EMEA GCS\n\nTo obtain full details on the issues and assistance on how to protect your installation, please\ncontact your local Schneider Electric representative. These organizations will be fully aware of\nthe situation and can support you through the process.\n\nFor further information related to cybersecurity in Schneider Electric’s products, please visit the\ncompany’s cybersecurity web page:\n\nhttp://www2.schneider-electric.com/sites/corporate/en/support/cybersecurity/cybersecurity.page\n\nLegal Disclaimer\n\nTHIS DOCUMENT IS INTENDED TO HELP PROVIDE AN OVERVIEW OF THE IDENTIFIED\nSITUATION AND MITIGATION ACTIONS, AND IS PROVIDED ON AN “AS-IS” BASIS AND IS NOT\nINTENDED AS A WARRANTY OR GUARANTEE OF ANY KIND, INCLUDING WARRANTIES OF\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. THE USE OF THIS\nNOTIFICATION, INFORMATION CONTAINED HEREIN, OR MATERIALS LINKED TO IT ARE AT YOUR\nOWN RISK. SCHNEIDER ELECTRIC RESERVES THE RIGHT TO UPDATE OR CHANGE THIS\nNOTIFICATION AT ANY TIME AND IN ITS SOLE DISCRETION.\n\n**About Schneider Electric**\nSchneider Electric is leading the Digital Transformation of Energy Management and Automation in Homes, Buildings, Data Centers,\nInfrastructure and Industries.\n\nWith global presence in over 100 countries, Schneider is the undisputable leader in Power Management – Medium Voltage, Low\nVoltage and Secure Power, and in Automation Systems. We provide integrated efficiency solutions, combining energy, automation\nand software.\n\nIn our global Ecosystem, we collaborate with the largest Partner, Integrator and Developer Community on our Open Platform to deliver\nreal-time control and operational efficiency.\n\nWe believe that great people and partners make Schneider a great company and that our commitment to Innovation, Diversity and\nSustainability ensures that Life Is On everywhere, for everyone and at every moment.\n\nwww.schneider-electric.com\n\n14-Dec-17 (14-Dec-18)   Document Reference Number – SEVD-2017-347-01 V3 Page 4 of 5\n\n\n-----\n\nRevision Control:\n\n\n### Schneider Electric Security Notification\n\nOriginal Release\n\n                     - Updated targeting to affected in\ntitle and first sentence.\n\n                     - Updated Details, Detection and\nMitigation Sections\n\n                     - Updated reflecting availability of\nTricon CX v11.4 and that\ndetection and removal tool and\nprocedure becomes available only\nthrough a customer service\nagreement effective January 1,\n2019.\n\n|Version 1 13 December 2017|Original Release|\n|---|---|\n|Version 1.1 14 December 2017|- Updated targeting to affected in title and first sentence.|\n|Version 2 18 January 2018|- Updated Details, Detection and Mitigation Sections|\n|Version 3 14 December 2018|- Updated reflecting availability of Tricon CX v11.4 and that detection and removal tool and procedure becomes available only through a customer service agreement effective January 1, 2019.|\n\n\n# Product Security Office\n\n\n## Digitally signed by Product Security Office Date: 2018.12.14 10:56:19 -05'00'\n\n\n14-Dec-17 (14-Dec-18)   Document Reference Number – SEVD-2017-347-01 V3 Page 5 of 5\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://download.schneider-electric.com/files?p_enDocType=Technical+leaflet&p_File_Name=SEVD-2017-347-01+Triconex+V3.pdf&p_Doc_Ref=SEVD-2017-347-01"
    ],
    "report_names": [
        "files?p_enDocType=Technical+leaflet&p_File_Name=SEVD-2017-347-01+Triconex+V3.pdf&p_Doc_Ref=SEVD-2017-347-01"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1670698716,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1544802767,
    "ts_modification_date": 1544784979,
    "files": {
        "pdf": "https://archive.orkl.eu/357eec6e9de0c4eaeea1912bae0c658d5ec24212.pdf",
        "text": "https://archive.orkl.eu/357eec6e9de0c4eaeea1912bae0c658d5ec24212.txt",
        "img": "https://archive.orkl.eu/357eec6e9de0c4eaeea1912bae0c658d5ec24212.jpg"
    }
}