{
    "id": "6342eef9-8d77-490e-b224-c1b77397b189",
    "created_at": "2022-10-25T16:48:18.700337Z",
    "updated_at": "2025-03-27T02:05:47.390889Z",
    "deleted_at": null,
    "sha1_hash": "4e0945984dd92c9f9cdcf37350d5df56e28311f8",
    "title": "Destructive Malware Targeting Organizations in Ukraine",
    "authors": "cisa",
    "file_creation_date": "2022-02-26T12:42:32Z",
    "file_modification_date": "2022-02-26T12:42:32Z",
    "file_size": 477043,
    "plain_text": "_Co-Authored by:_ **TLP:WHITE** Product ID: AA22-057A\n\n\n# Destructive Malware Targeting Organizations in Ukraine\n\n\n## SUMMARY\n\n[Leading up to Russia’s unprovoked attack against](https://www.cisa.gov/shields-up)\n[Ukraine, threat actors deployed destructive malware](https://www.cisa.gov/shields-up)\nagainst organizations in Ukraine to destroy computer\nsystems and render them inoperable.\n\n\n**Actions to Take Today:**\n\n\n[Leading up to Russia’s unprovoked attack against](https://www.cisa.gov/shields-up) - Set antivirus and antimalware\n[Ukraine, threat actors deployed destructive malware](https://www.cisa.gov/shields-up) programs to conduct regular scans.\nagainst organizations in Ukraine to destroy computer - Enable strong spam filters to\nsystems and render them inoperable. prevent phishing emails from\n\nreaching end users.\n\n- On January 15, 2022, the Microsoft Threat\n\n                            - Filter network traffic.\n\nIntelligence Center (MSTIC) disclosed that\nmalware, known as WhisperGate, was being  - Update software.\nused to target organizations in Ukraine.   - Require multifactor authentication.\nAccording to [Microsoft, WhisperGate is intended](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\nto be destructive and is designed to render targeted devices inoperable.\n\n- On February 23, 2022, several cybersecurity researchers disclosed that malware known as\n[HermeticWiper](https://twitter.com/ESETresearch/status/1496581903205511181) [was being used against organizations in Ukraine. According to Sentinel Labs,](https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/)\nthe malware targets Windows devices, manipulating the master boot record, which results in\nsubsequent boot failure.\n\n\nDestructive malware can present a direct threat to an organization’s daily operations, impacting the\navailability of critical assets and data. Further disruptive cyberattacks against organizations in Ukraine\nare likely to occur and may unintentionally spill over to organizations in other countries. Organizations\nshould increase vigilance and evaluate their capabilities encompassing planning, preparation,\ndetection, and response for such an event.\n\nThis joint Cybersecurity Advisory (CSA) between the Cybersecurity and Infrastructure Security\nAgency (CISA) and Federal Bureau of Investigation (FBI) provides information on WhisperGate and\nHermeticWiper malware as well as open-source indicators of compromise (IOCs) for organizations to\ndetect and prevent the malware. Additionally, this joint CSA provides recommended guidance and\n\n_To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local_\n_[FBI field office at www.fbi.gov/contact-us/field-offices, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-](https://www.fbi.gov/contact-us/field-offices)_\n_[mail at CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and](mailto:CyWatch@fbi.gov)_\n_location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the_\n_submitting company or organization; and a designated point of contact. To request incident response resources or technical_\n_[assistance related to these threats, contact CISA at CISAServiceDesk@cisa.dhs.gov.](mailto:CISAServiceDesk@cisa.dhs.gov)_\n\n_This document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information carries_\n_minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to_\n_standard copyright rules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic_\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\nconsiderations for organizations to address as part of network architecture, security baseline,\ncontinuous monitoring, and incident response practices.\n\n## TECHNICAL DETAILS\n\nThreat actors have deployed destructive malware, including both WhisperGate and HermeticWiper,\nagainst organizations in Ukraine to destroy computer systems and render them inoperable. Listed\nbelow are high-level summaries of campaigns employing the malware. CISA recommends\norganizations review the resources listed below for more in-depth analysis and see the Mitigation\nsection for best practices on handling destructive malware.\n\nOn January 15, 2022, Microsoft announced the identification of a sophisticated malware operation\ntargeting multiple organizations in Ukraine. The malware, known as WhisperGate, has two stages that\ncorrupts a system’s master boot record, displays a fake ransomware note, and encrypts files based\non certain file extensions. Note: although a ransomware message is displayed during the attack,\nMicrosoft highlighted that the targeted data is destroyed, and is not recoverable even if a ransom is\n[paid. See Microsoft’s blog on Destructive malware targeting Ukrainian organizations](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/) for more\ninformation and see the IOCs in table 1.\n\n_Table 1: IOCs associated with WhisperGate_\n\n**Name** **File Category** **File Hash** **Source**\n\nWhisperGate stage1.exe [a196c6b8ffcb97ffb276d04f354696e2391311](https://www.virustotal.com/gui/file/a196c6b8ffcb97ffb276d04f354696e2391311db3841ae16c8c9f56f36a38e92) [Microsoft](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\n\n[MSTIC](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\n\n[db3841ae16c8c9f56f36a38e92](https://www.virustotal.com/gui/file/a196c6b8ffcb97ffb276d04f354696e2391311db3841ae16c8c9f56f36a38e92)\n\nWhisperGate stage2.exe [dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5](https://www.virustotal.com/gui/file/dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5329958d38b58c3fd9384081c9b78) [Microsoft](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\n[329958d38b58c3fd9384081c9b78](https://www.virustotal.com/gui/file/dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5329958d38b58c3fd9384081c9b78) [MSTIC](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\n\nOn February 23, 2022, cybersecurity researchers disclosed that malware known as HermeticWiper\nwas being used against organizations in Ukraine. According to Sentinel Labs, the malware targets\nWindows devices, manipulating the master boot record and resulting in subsequent boot failure.\n**Note: according to Broadcom, “[HermeticWiper] has some similarities to the earlier WhisperGate**\nwiper attacks against Ukraine, where the wiper was disguised as ransomware.” See the following\nresources for more information and see the IOCs in table 2 below.\n\n  - ESET Research Tweet: [Breaking. #ESETResearch discovered a new data wiper malware](https://twitter.com/ESETresearch/status/1496581903205511181)\n[used in Ukraine today. ESET telemetry shows that it was installed on hundreds of machines in](https://twitter.com/ESETresearch/status/1496581903205511181)\n[the country.](https://twitter.com/ESETresearch/status/1496581903205511181)\n\n  - [Sentinel Labs: HermeticWiper | New Destructive Malware Used In Cyber Attacks on Ukraine](https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/)\n\n  - [Broadcom’s Symantec Threat Hunter Team: Ukraine: Disk-wiping Attacks Precede Russian](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia)\n[Invasion](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia)\n\n|Name|File Category|File Hash|Source|\n|---|---|---|---|\n|WhisperGate|stage1.exe|a196c6b8ffcb97ffb276d04f354696e2391311 db3841ae16c8c9f56f36a38e92|Microsoft MSTIC|\n|WhisperGate|stage2.exe|dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5 329958d38b58c3fd9384081c9b78|Microsoft MSTIC|\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n_Table 2: IOCs associated with HermeticWiper_\n\n|Name|File Category|File Hash|Source|\n|---|---|---|---|\n|Win32/KillDisk.N CV|Trojan|912342F1C840A42F6B74132F8A7C4FFE7 D40FB77 61B25D11392172E587D8DA3045812A66C 3385451|ESET research|\n|HermeticWiper|Win32 EXE|912342f1c840a42f6b74132f8a7c4ffe7d40fb 77|Sentinel Labs|\n|HermeticWiper|Win32 EXE|61b25d11392172e587d8da3045812a66c33 85451|Sentinel Labs|\n|RCDATA_DRV_ X64|ms-compressed|a952e288a1ead66490b3275a807f52e5|Sentinel Labs|\n|RCDATA_DRV_ X86|ms-compressed|231b3385ac17e41c5bb1b1fcb59599c4|Sentinel Labs|\n|RCDATA_DRV_ XP_X64|ms-compressed|095a1678021b034903c85dd5acb447ad|Sentinel Labs|\n|RCDATA_DRV_ XP_X86|ms-compressed|eb845b7a16ed82bd248e395d9852f467|Sentinel Labs|\n|Trojan.Killdisk|Trojan.Killdisk|1bc44eef75779e3ca1eefb8ff5a64807dbc94 2b1e4a2672d77b9f6928d292591|Symantec Threat Hunter Team|\n|Trojan.Killdisk|Trojan.Killdisk|0385eeab00e946a302b24a91dea4187c121 0597b8e17cd9e2230450f5ece21da|Symantec Threat Hunter Team|\n|Trojan.Killdisk|Trojan.Killdisk|a64c3e0522fad787b95bfb6a30c3aed1b578 6e69e88e023c062ec7e5cebf4d3e|Symantec Threat Hunter Team|\n|Ransomware|Trojan.Killdisk|4dc13bb83a16d4ff9865a51b3e4d24112327 c526c1392e14d56f20d6f4eaf382|Symantec Threat Hunter Team|\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n## MITIGATIONS\n\n### Best Practices for Handling Destructive Malware\n\nAs previously noted above, destructive malware can present a direct threat to an organization’s daily\noperations, impacting the availability of critical assets and data. Organizations should increase\nvigilance and evaluate their capabilities, encompassing planning, preparation, detection, and\nresponse, for such an event. This section is focused on the threat of malware using enterprise-scale\ndistributed propagation methods and provides recommended guidance and considerations for an\norganization to address as part of their network architecture, security baseline, continuous monitoring,\nand incident response practices.\n\nCISA and the FBI urge all organizations to implement the following recommendations to increase their\ncyber resilience against this threat.\n\n### Potential Distribution Vectors\n\nDestructive malware may use popular communication tools to spread, including worms sent through\nemail and instant messages, Trojan horses dropped from websites, and virus-infected files\ndownloaded from peer-to-peer connections. Malware seeks to exploit existing vulnerabilities on\nsystems for quiet and easy access.\n\nThe malware has the capability to target a large scope of systems and can execute across multiple\nsystems throughout a network. As a result, it is important for organizations to assess their\nenvironment for atypical channels for malware delivery and/or propagation throughout their systems.\nSystems to assess include:\n\n  - Enterprise applications – particularly those that have the capability to directly interface with\nand impact multiple hosts and endpoints. Common examples include:\n```\n     o Patch management systems,\n     o Asset management systems,\n     o Remote assistance software (typically used by the corporate help desk),\n     o Antivirus (AV) software,\n     o Systems assigned to system and network administrative personnel,\n     o Centralized backup servers, and\n     o Centralized file shares.\n\n```\nWhile not only applicable to malware, threat actors could compromise additional resources to impact\nthe availability of critical data and applications. Common examples include:\n\n  - Centralized storage devices\n```\n     o Potential risk – direct access to partitions and data warehouses.\n\n```\n  - Network devices\n```\n     o Potential risk – capability to inject false routes within the routing table, delete specific\n\n```\nroutes from the routing table, remove/modify configuration attributes, or destroy\nfirmware or system binaries—which could isolate or degrade availability of critical\nnetwork resources.\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n### Best Practices and Planning Strategies\n\nCommon strategies can be followed to strengthen an organization’s resilience against destructive\nmalware. Targeted assessment and enforcement of best practices should be employed for enterprise\ncomponents susceptible to destructive malware.\n\n#### Communication Flow\n\n  - Ensure proper network segmentation.\n\n  - Ensure that network-based access control lists (ACLs) are configured to permit server-to-host\nand host-to-host connectivity via the minimum scope of ports and protocols and that\ndirectional flows for connectivity are represented appropriately.\n```\n     o Communications flow paths should be fully defined, documented, and authorized.\n\n```\n  - Increase awareness of systems that can be used as a gateway to pivot (lateral movement) or\ndirectly connect to additional endpoints throughout the enterprise.\n```\n     o Ensure that these systems are contained within restrictive Virtual Local Area Networks\n\n```\n(VLANs), with additional segmentation and network access controls.\n\n  - Ensure that centralized network and storage devices’ management interfaces reside on\nrestrictive VLANs.\n```\n     o Layered access control, and\n     o Device-level access control enforcement – restricting access from only pre-defined\n\n```\nVLANs and trusted IP ranges.\n\n#### Access Control\n\n  - For enterprise systems that can directly interface with multiple endpoints:\n```\n     o Require multifactor authentication for interactive logons.\n     o Ensure that authorized users are mapped to a specific subset of enterprise personnel.\n\n```\n         - If possible, the “Everyone,” “Domain Users,” or the “Authenticated Users”\ngroups should not be permitted the capability to directly access or authenticate\nto these systems.\n```\n     o Ensure that unique domain accounts are used and documented for each enterprise\n\n```\napplication service.\n\n         - Context of permissions assigned to these accounts should be fully documented\nand configured based upon the concept of least privilege.\n\n         - Provides an enterprise with the capability to track and monitor specific actions\ncorrelating to an application’s assigned service account.\n```\n     o If possible, do not grant a service account with local or interactive logon permissions.\n\n```\n         - Service accounts should be explicitly denied permissions to access network\nshares and critical data locations.\n```\n     o Accounts that are used to authenticate to centralized enterprise application servers or\n\n```\ndevices should not contain elevated permissions on downstream systems and\nresources throughout the enterprise.\n\n  - Continuously review centralized file share ACLs and assigned permissions.\n```\n     o Restrict Write/Modify/Full Control permissions when possible.\n\n#### Monitoring\n\n```\n  - Audit and review security logs for anomalous references to enterprise-level administrative\n(privileged) and service accounts.\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n```\n     o Failed logon attempts,\n     o File share access, and\n     o Interactive logons via a remote session.\n\n```\n  - Review network flow data for signs of anomalous activity, including:\n```\n     o Connections using ports that do not correlate to the standard communications flow\n\n```\nassociated with an application,\n```\n     o Activity correlating to port scanning or enumeration, and\n     o Repeated connections using ports that can be used for command and control\n\n```\npurposes.\n\n  - Ensure that network devices log and audit all configuration changes.\n```\n     o Continually review network device configurations and rule sets to ensure that\n\n```\ncommunications flows are restricted to the authorized subset of rules.\n\n#### File Distribution\n\n  - When deploying patches or AV signatures throughout an enterprise, stage the distributions to\ninclude a specific grouping of systems (staggered over a pre-defined period).\n```\n     o This action can minimize the overall impact in the event that an enterprise patch\n\n```\nmanagement or AV system is leveraged as a distribution vector for a malicious\npayload.\n\n  - Monitor and assess the integrity of patches and AV signatures that are distributed throughout\nthe enterprise.\n```\n     o Ensure updates are received only from trusted sources,\n     o Perform file and data integrity checks, and\n     o Monitor and audit – as related to the data that is distributed from an enterprise\n\n```\napplication.\n\n#### System and Application Hardening\n\n  - Ensure robust vulnerability management and patching practices are in place.\n\n`o CISA maintains a living catalog of known exploited vulnerabilities` that carry significant\n\nrisk to federal agencies as well as public and private sectors entities. In addition to\nthoroughly testing and implementing vendor patches in a timely—and, if possible,\nautomated—manner, organizations should ensure patching of the vulnerabilities CISA\nincludes in this catalog.\n\n  - Ensure that the underlying operating system (OS) and dependencies (e.g., Internet\nInformation Services [IIS], Apache, Structured Query Language [SQL]) supporting an\napplication are configured and hardened based upon industry-standard best practice\nrecommendations. Implement application-level security controls based on best practice\nguidance provided by the vendor. Common recommendations include:\n```\n     o Use role-based access control,\n     o Prevent end-user capabilities to bypass application-level security controls,\n\n```\n         - For example, do not allow users to disable AV on local workstations.\n```\n     o Remove, or disable unnecessary or unused features or packages, and\n     o Implement robust application logging and auditing.\n\n```\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n#### Recovery and Reconstitution Planning\n[A business impact analysis (BIA) is a key component of contingency planning and preparation. The](https://www.ready.gov/business-impact-analysis)\noverall output of a BIA will provide an organization with two key components (as related to critical\nmission/business operations):\n\n  - Characterization and classification of system components, and\n\n  - Interdependencies.\n\nBased upon the identification of an organization’s mission critical assets (and their associated\ninterdependencies), in the event that an organization is impacted by destructive malware, recovery\nand reconstitution efforts should be considered.\n\nTo plan for this scenario, an organization should address the availability and accessibility for the\nfollowing resources (and should include the scope of these items within incident response exercises\nand scenarios):\n\n  - Comprehensive inventory of all mission critical systems and applications:\n```\n     o Versioning information,\n     o System/application dependencies,\n     o System partitioning/storage configuration and connectivity, and\n     o Asset owners/points of contact.\n\n```\n  - Contact information for all essential personnel within the organization,\n\n  - Secure communications channel for recovery teams,\n\n  - Contact information for external organizational-dependent resources:\n```\n     o Communication providers,\n     o Vendors (hardware/software), and\n     o Outreach partners/external stakeholders\n\n```\n  - Service contract numbers – for engaging vendor support,\n\n  - Organizational procurement points of contact,\n\n  - Optical disc image (ISO)/image files for baseline restoration of critical systems and\napplications:\n```\n     o OS installation media,\n     o Service packs/patches,\n     o Firmware, and\n     o Application software installation packages.\n\n```\n  - Licensing/activation keys for OS and dependent applications,\n\n  - Enterprise network topology and architecture diagrams,\n\n  - System and application documentation,\n\n  - Hard copies of operational checklists and playbooks,\n\n  - System and application configuration backup files,\n\n  - Data backup files (full/differential),\n\n  - System and application security baseline and hardening checklists/guidelines, and\n\n  - System and application integrity test and acceptance checklists.\n\n#### Incident Response\nVictims of a destructive malware attacks should immediately focus on containment to reduce the\nscope of affected systems. Strategies for containment include:\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n  - Determining a vector common to all systems experiencing anomalous behavior (or having\nbeen rendered unavailable)—from which a malicious payload could have been delivered:\n```\n     o Centralized enterprise application,\n     o Centralized file share (for which the identified systems were mapped or had access),\n     o Privileged user account common to the identified systems,\n     o Network segment or boundary, and\n     o Common Domain Name System (DNS) server for name resolution.\n\n```\n  - Based upon the determination of a likely distribution vector, additional mitigation controls can\nbe enforced to further minimize impact:\n```\n     o Implement network-based ACLs to deny the identified application(s) the capability to\n\n```\ndirectly communicate with additional systems,\n\n         - Provides an immediate capability to isolate and sandbox specific systems or\nresources.\n```\n     o Implement null network routes for specific IP addresses (or IP ranges) from which the\n\n```\npayload may be distributed,\n\n         - An organization’s internal DNS can also be leveraged for this task, as a null\npointer record could be added within a DNS zone for an identified server or\napplication.\n```\n     o Readily disable access for suspected user or service account(s), \n     o For suspect file shares (which may be hosting the infection vector), remove access or\n\n```\ndisable the share path from being accessed by additional systems, and\n```\n     o Be prepared to, if necessary, reset all passwords and tickets within directories (e.g.,\n\n```\nchanging golden/silver tickets).\n\nAs related to incident response and incident handling, organizations are encouraged to report\nincidents to the FBI and CISA (see the Contact section below) and to preserve forensic data for use in\n[internal investigation of the incident or for possible law enforcement purposes. See Technical](https://www.cisa.gov/uscert/ncas/alerts/aa20-245a)\n[Approaches to Uncovering and Remediating Malicious Activity](https://www.cisa.gov/uscert/ncas/alerts/aa20-245a) for more information.\n\n## CONTACT\n\nAll organizations should report incidents and anomalous activity to CISA 24/7 Operations Center at\n[central@cisa.dhs.gov](mailto:central@cisa.dhs.gov) [or (888) 282-0870 and/or to the FBI via your local FBI field office or the FBI’s](https://www.fbi.gov/contact-us/field-offices)\n[24/7 CyWatch at (855) 292-3937 or CyWatch@fbi.gov.](mailto:CyWatch@fbi.gov)\n\n## RESOURCES\n\n- [Joint CSA: Understanding and Mitigating Russian State-Sponsored Cyber Threats to U.S. Critical](https://www.cisa.gov/uscert/ncas/alerts/aa22-011a)\n[Infrastructure](https://www.cisa.gov/uscert/ncas/alerts/aa22-011a)\n\n- [Joint CSA: NSA and CISA Recommend Immediate Actions to Reduce Exposure Across](https://www.cisa.gov/uscert/ncas/alerts/aa20-205a)\n[Operational Technologies and Control Systems](https://www.cisa.gov/uscert/ncas/alerts/aa20-205a)\n\n- Joint CSA: [Ongoing Cyber Threats to U.S. Water and Wastewater Systems](https://www.cisa.gov/uscert/ncas/alerts/aa21-287a)\n\n##### • CISA and MS-ISAC: Joint Ransomware Guide\n\n- [NIST: Data Integrity: Detecting and Responding to Ransomware and Other Destructive Events](https://www.nccoe.nist.gov/projects/building-blocks/data-integrity/detect-respond)\n\n- [NIST: Data Integrity: Recovering from Ransomware and Other Destructive Events](https://www.nccoe.nist.gov/projects/building-blocks/data-integrity/recover)\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----\n\nCISA | FBI\n**TLP:WHITE**\n\n##### • CISA Cyber hygiene services: CISA offers a range of no-cost services to help critical\ninfrastructure organizations assess, identify and reduce their exposure to threats, including\nransomware. By requesting and leveraging these services, organizations of any size could find\nways to reduce their risk and mitigate attack vectors.\n\n\nCISA | FBI\n**TLP:WHITE**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/ap7ff8tdnem5jfchj71odbpye700vy98"
    ],
    "report_names": [
        "CISA_AA22-057A_Destructive_Malware_Targeting_Organizations_in_Ukraine(02-26-2022)"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1645879352,
    "ts_modification_date": 1645879352,
    "files": {
        "pdf": "https://archive.orkl.eu/4e0945984dd92c9f9cdcf37350d5df56e28311f8.pdf",
        "text": "https://archive.orkl.eu/4e0945984dd92c9f9cdcf37350d5df56e28311f8.txt",
        "img": "https://archive.orkl.eu/4e0945984dd92c9f9cdcf37350d5df56e28311f8.jpg"
    }
}