{
    "id": "635d1d85-b4ee-415f-936e-9a8f1fbc2e30",
    "created_at": "2023-01-12T15:09:57.282496Z",
    "updated_at": "2025-03-27T02:06:02.324412Z",
    "deleted_at": null,
    "sha1_hash": "14a6b7e2e513257c482548027adc0c6895c9168f",
    "title": "2021-06-02 - Call for crimes- Russian-language forum runs contest for cryptocurrency hacks",
    "authors": "",
    "file_creation_date": "2022-05-28T17:10:12Z",
    "file_modification_date": "2022-05-28T17:10:12Z",
    "file_size": 176902,
    "plain_text": "# Call for crimes? Russian-language forum runs contest for cryptocurrency hacks\n\n**[intel471.com/blog/call-for-crimes-russian-language-forum-runs-contest-for-cryptocurrency-hacks](https://intel471.com/blog/call-for-crimes-russian-language-forum-runs-contest-for-cryptocurrency-hacks)**\n\nJun 02, 2021\n\nAt the recent 2021 RSA conference, some of the best and brightest minds the cybersecurity\nindustry has to offer came together to present numerous ideas on how to stop cybercriminals\nfrom carrying out their crimes. At the very same time in other corners of the internet, those\nvery same cybercriminals were holding their own formal event intended to share knowledge\non how to perpetuate those crimes.\n\nOver the past month, operators of one of the top Russian-language cybercrime forums have\nbeen running a “contest,” calling for the community to submit papers that examine how to\ntarget cryptocurrency-related technology. In the announcement made on April 20, 2021, the\nforum’s administrator called for papers that covered unorthodox ways to steal private keys\nand wallets, unusual cryptocurrency mining software, smart contracts, non-fungible tokens\n(NFTs) and more.\n\nSubmissions were accepted over 30 days, with the administrator saying $100,000 in prizes\nwould be awarded to winners. Shortly thereafter, a reputable forum member added $15,000\nto the prize pool.\n\n\n-----\n\nShortly after opening submissions, forum users started posting their own papers for the\nlarger community to see. One entry looked at manipulating APIs from popular\ncryptocurrency-related services or decentralized-file technology in order to obtain private\n[keys to cryptocurrency wallets. Another submission detailed how to create a phishing](https://intel471.com/glossary/phishing)\nwebsite that allowed criminals to harvest keys to cryptocurrency wallets and their seed\nphrases (a list of words which store all the information needed to recover lost\ncryptocurrency).\n\nThis contest is not the first time underground forums have done something like this. Two\npopular forums have called for research papers on a wide variety of topics, including\nmobileOS [botnets, ATM and POS cracks, and fake GPS signals, among others. Prizes up to](https://intel471.com/glossary/botnet)\n$10,000 were awarded to the “best” research, while entrants earned $50 just for submitting.\nAdditionally, operators of various ransomware-as-a-service groups, including REvil and\nLockBit, have hosted their own contests where forum members submit papers on various\ntopics that could potentially help further their crimes.\n\nThis contest is a prime example of why organizations need to proactively monitor the\ncybercrime underground. This forum’s effort shows that cybercriminals are keenly focusing\non the cryptocurrency ecosystem, have taken note of the steadily climbing values of various\ncryptocurrencies, and will soon target NFTs due to their exorbitant price tags. Cybercriminals\ngo where the money is held, and the money floating around cryptocurrency continues to\nclimb “to the moon,” so criminals will have a desire to cash in.\n\nThe contest is also an example of how cybercriminals can be more nimble than defenders.\nForums not only serve as a marketplace, but also usher in and foster new innovations and\ncutting edge approaches that do not need to get bureaucratic approval before being used to\ncarry out crimes.\n\nAttack surfaces will grow as the technology stack around cryptocurrency and decentralized\nfinance continues to grow. As these services come online, businesses need to proactively\nwatch the underground in order to strategize for how criminals may target their businesscritical functions with information from contests, like the one discovered above, to devastate\ntheir organization.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-02 - Call for crimes- Russian-language forum runs contest for cryptocurrency hacks.pdf"
    ],
    "report_names": [
        "2021-06-02 - Call for crimes- Russian-language forum runs contest for cryptocurrency hacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536197,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653757812,
    "ts_modification_date": 1653757812,
    "files": {
        "pdf": "https://archive.orkl.eu/14a6b7e2e513257c482548027adc0c6895c9168f.pdf",
        "text": "https://archive.orkl.eu/14a6b7e2e513257c482548027adc0c6895c9168f.txt",
        "img": "https://archive.orkl.eu/14a6b7e2e513257c482548027adc0c6895c9168f.jpg"
    }
}