{
    "id": "637690dd-9fff-4353-99f4-895bb8ae3143",
    "created_at": "2023-01-12T15:08:43.331964Z",
    "updated_at": "2025-03-27T02:06:08.69506Z",
    "deleted_at": null,
    "sha1_hash": "2fbe8602767192c8116a7cdf5e7199b7a7fe3707",
    "title": "2020-05-26 - The EU’s Response to SolarWinds",
    "authors": "",
    "file_creation_date": "2022-05-28T17:41:44Z",
    "file_modification_date": "2022-05-28T17:41:44Z",
    "file_size": 1517450,
    "plain_text": "# The EU’s Response to SolarWinds\n\n**cfr.org/blog/eus-response-solarwinds**\n\nfrom [Net Politics and](https://www.cfr.org/blog/net-politics) [Digital and Cyberspace Policy Program](https://www.cfr.org/programs/digital-and-cyberspace-policy-program)\nWhile EU’s issuance of the declaration of solidarity in response to the SolarWinds cyber\ncampaign is a sign of progress, it fails to provide clarification on what, if any, further actions\ncan be expected from Brussels.\n\n\n-----\n\nEuropean Union flags flutter outside the EU Commission headquarters in Brussels, Belgium.\nREUTERS/Francois Lenoir/File Photo\nBlog Post by [Guest Blogger for Net Politics](https://www.cfr.org/bio/guest-blogger-net-politics-0)\nMay 26, 2021 7:35 am (EST)\n\n_Julia Schuetze is the Jr Project Director for International Cybersecurity Policy at Stiftung_\n_Neue Verantwortung e.V. Arthur de Liedekerke is a cybersecurity analyst with prior_\n_experience in the European Union institutions. The views and opinions expressed in this_\n_article are solely those of the authors and do not reflect the official position or policy of their_\n_employers._\n\n[On April 15, the same day that the United States imposed sanctions against Russia for the](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-imposing-costs-for-harmful-foreign-activities-by-the-russian-government/)\nSolarWinds cyber espionage campaign, election interference, and other issues, the\n[European Union (EU) published a declaration expressing solidarity with the United States. A](https://www.consilium.europa.eu/en/press/press-releases/2021/04/15/declaration-by-the-high-representative-on-behalf-of-the-european-union-expressing-solidarity-with-the-united-states-on-the-impact-of-the-solarwinds-cyber-operation/)\n[month later, on May 14, the European Council extended the sanctions regime that guides](https://protect-us.mimecast.com/s/rEbtCmZMqQS5PKWouGYoUB?domain=consilium.europa.eu/)\nresponse to cyber attacks that threaten the EU or its members until May 2022. As part of the\n[EU’s cyber diplomacy toolbox, a declaration falls into category three [PDF] of responses—](https://data.consilium.europa.eu/doc/document/ST-13007-2017-INIT/en/pdf)\nstability measures—which express concern or condemn general cyber trends or certain\ncyber activities and could have a signaling function. While the EU’s issuance of the\ndeclaration in response to SolarWinds is a sign of progress, it fails to provide clarification on\nwhat, if any, further actions can be expected from Brussels.\n\nMore on:\n\n\n-----\n\n[Cybersecurity](https://www.cfr.org/defense-and-security/cybersecurity)\n\n[European Union](https://www.cfr.org/european-union)\n\n[Sanctions](https://www.cfr.org/diplomacy-and-international-institutions/sanctions)\n\n[Russia](https://www.cfr.org/europe-and-eurasia/russia)\n\nThe declaration still matters because it shows that the EU’s response process to malicious\ncyber activities is maturing. This declaration differs from previous responses due to its\ncoordinated timing with the imposition of U.S. sanctions and reference to Washington’s\nattribution of the campaign to Russia. This contrasts with previous EU responses where\n[attribution was not mentioned explicitly or where member states independently coordinated](https://www.consilium.europa.eu/en/press/press-releases/2018/04/16/malicious-cyber-activities-council-adopts-conclusions/)\ntheir attribution efforts multilaterally with third states, avoiding attribution through a unified\n[EU-wide response.](https://www.consilium.europa.eu/en/press/press-releases/2018/04/16/malicious-cyber-activities-council-adopts-conclusions/)\n\nNet Politics\n\n**CFR experts investigate the impact of information and communication technologies**\n**on security, privacy, and international affairs. 2-4 times weekly.**\n\n[View all newsletters >](https://link.cfr.org/join/66n/signup&hash=2d4c5929e9e04cc42f5cd375fb8dcfb1)\n\n## Digital and Cyberspace Update\n\n**Digital and Cyberspace Policy program updates on cybersecurity, digital trade,**\n**internet governance, and online privacy. Bimonthly.**\n\n## Daily News Brief\n\n**A summary of global news developments with CFR analysis delivered to your inbox**\n**each morning. Most weekdays.**\n\n## The World This Week\n\n**A weekly digest of the latest from CFR on the biggest foreign policy stories of the**\n**week, featuring briefs, opinions, and explainers. Every Friday.**\n\nBy entering your email and clicking subscribe, you're agreeing to receive announcements\nfrom CFR about our products and services, as well as invitations to CFR events. You are\n[also agreeing to our Privacy Policy and](https://www.cfr.org/privacy-policy) [Terms of Use.](https://www.cfr.org/terms-use)\n[View all newsletters >](https://link.cfr.org/join/66n/signup&hash=2d4c5929e9e04cc42f5cd375fb8dcfb1)\n\n\n-----\n\nAdditionally, the language of the EU s recent declaration deviates from prior statements, like\n[those responding to election interference in Georgia and cyber threats targeting the health-](https://www.consilium.europa.eu/en/press/press-releases/2020/02/21/declaration-by-the-high-representative-on-behalf-of-the-european-union-call-to-promote-and-conduct-responsible-behaviour-in-cyberspace/)\ncare sector during the pandemic. Instead of “condemning” the SolarWinds campaign, the\ndeclaration expressed the EU’s solidarity with the United States “on the impact of malicious\n[cyber activities.”Simply expressing solidarity with the impact in the United States reflects that](https://www.consilium.europa.eu/en/press/press-releases/2021/04/15/declaration-by-the-high-representative-on-behalf-of-the-european-union-expressing-solidarity-with-the-united-states-on-the-impact-of-the-solarwinds-cyber-operation/)\nthe European Union does not per se condemn this type of activity. Moreover, it treads\ncarefully when referring to the impact the operation had on the EU and its member states.\n\nThis could have been more directly connected to where the EU explains its concern about\nmalicious activities in general that are “affecting the security and integrity of information and\ncommunication technology (ICT) products and services, which might have systemic effects\nand cause significant harm to our society, security and economy.” This vague description\ncould be an attempt to show that, from an EU standpoint, the seemingly indiscriminate\nnature of the SolarWinds breach (“the compromise affected governments and businesses\nworldwide, including in EU Member States”) and apparent disregard for collateral damage\n(“systemic effects with potential significant harm to our society, security and economy”) could\nresult in consequences for the perpetrator. However, by not being more concrete on the\ndamage the campaign had on the EU, falls short of indicating whether those behind it\ncrossed a red line that requires a strong response from the EU. As the rest of the statement\nfocuses on preventative efforts that the EU is already undertaking, the text does not signal\nthat such incidents could be met with a more assertive response, such as restrictive\nmeasures. The statement also ignores the fact that two days before the Declaration came\nout technical evidence seems to suggest that the EU’s sanctions regime could be applied. In\nan [answer to a parliamentary question on April 13, European Commissioner for Budget and](https://www.europarl.europa.eu/doceo/document/P-9-2021-001112-ASW_EN.pdf)\nAdministration Johannes Hahn indicated that the EU’s computer emergency response team\n(CERT-EU) had identified cases where IT networks and systems had been “significantly\nimpacted” and personal data breaches occurred. “Significant impact” or “potentially\n[significant effect” is one threshold covered in the sanctions regime.](https://www.consilium.europa.eu/en/press/press-releases/2019/05/17/cyber-attacks-council-is-now-able-to-impose-sanctions/)\n\n[Whether the EU will follow up with sanctions—like the United States—will also likely depend](https://data.consilium.europa.eu/doc/document/ST-5664-2018-INIT/en/pdf)\non two things: the collective determination to impose costs despite the risks of retaliation,\nand on the outcome of further investigation mentioned in the Declaration itself vis-à-vis the\nother required thresholds for sanctions..\n\nMember states appear ready to act. Unofficial reports indicate that a number of EU member\nstates are toying with the idea of introducing sanctions against Russian citizens who were\nallegedly involved in the SolarWinds campaign. Also, given the steady deterioration of EURussia relations in recent months, member states could be tempted to demonstrate their\ncollective determination to push back against Russia and their commitment to the\ntransatlantic alliance.\n\nMore on:\n\n[Cybersecurity](https://www.cfr.org/defense-and-security/cybersecurity)\n\n\n-----\n\n[European Union](https://www.cfr.org/european-union)\n\n[Sanctions](https://www.cfr.org/diplomacy-and-international-institutions/sanctions)\n\n[Russia](https://www.cfr.org/europe-and-eurasia/russia)\n\nWith the second issue, it’s possible that sanctions have not yet been imposed by the EU\n[because its investigation is ongoing. Historically, EU cyber sanctions have been imposed](https://www.sueddeutsche.de/politik/hack-bundestag-angriff-russland-1.4891668)\nagainst Russian individuals and entities only after the collection of evidence and attribution\nby at least two EU member states. Attribution by the United States could be insufficient on its\nown to warrant such a response. It is also possible that the EU is taking its time to aiming to\ncreate a sanctions bundle. Like the United States, the EU has sanctioned different entities for\nvarious malicious activities at the same time.\n\nThe EU response process is maturing, showing steady improvement in its coordination with\nthird countries. Still, it would have been better if the EU had explicitly described the impact\nthe SolarWinds attack had on EU interests. Such clarity would, if Brussels does eventually\nfollow through with a stronger response such as sanctions, signal that the attacks crossed a\nthreshold. However, considering the time constraint of aligning with the U.S. response and\nthe need for consensus-making in the EU, it is possible that the Declaration was only a first\ncareful response and it will soon follow-up with stronger language and/ or other means.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-26 - The EU’s Response to SolarWinds.pdf"
    ],
    "report_names": [
        "2020-05-26 - The EU’s Response to SolarWinds.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536123,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653759704,
    "ts_modification_date": 1653759704,
    "files": {
        "pdf": "https://archive.orkl.eu/2fbe8602767192c8116a7cdf5e7199b7a7fe3707.pdf",
        "text": "https://archive.orkl.eu/2fbe8602767192c8116a7cdf5e7199b7a7fe3707.txt",
        "img": "https://archive.orkl.eu/2fbe8602767192c8116a7cdf5e7199b7a7fe3707.jpg"
    }
}