{
    "id": "637b8178-1bb0-4e7e-a1aa-d00c18bbcdd4",
    "created_at": "2022-12-27T17:05:31.74745Z",
    "updated_at": "2025-03-27T02:16:22.754767Z",
    "deleted_at": null,
    "sha1_hash": "9c2e050959ee0d8e7e979b09b0d9674e2277cd15",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-12-27T06:18:24Z",
    "file_modification_date": "2022-12-27T06:18:24Z",
    "file_size": 737293,
    "plain_text": "# Exposing TAG-53’s Credential Harvesting Infrastructure Used for Russia-Aligned Espionage Operations\n\n**[recordedfuture.com/exposing-tag-53-credential-harvesting-infrastructure-for-russia-aligned-espionage-operations](https://www.recordedfuture.com/exposing-tag-53-credential-harvesting-infrastructure-for-russia-aligned-espionage-operations)**\n\n\nResearch (Insikt)\n\n\nPosted: 5th December 2022\n\nBy: Insikt Group®\n\n_[Editor’s Note: Click here to download the](https://go.recordedfuture.com/hubfs/reports/cta-2022-1205.pdf)_\n_report as a PDF._\n\nThis report profiles the infrastructure used\nby the threat activity group TAG-53, which overlaps with public reporting on Callisto\nGroup, COLDRIVER, and SEABORGIUM. The activity was identified through a\ncombination of Network Intelligence and analysis derived from open-source reporting.\nThe report will be of most interest to network defenders and individuals engaged in\nstrategic and operational intelligence relating to the activities of the Russian state in\ncyberspace.\n\n**Executive Summary**\n\nBeginning in July 2022, Recorded Future’s Insikt Group observed the recurring use of\nsimilar infrastructure by the threat activity group TAG-53. This newly discovered\ninfrastructure likely overlaps with other infrastructure tactics, techniques, and\nprocedures (TTPs) previously attributed to Callisto Group, COLDRIVER, and\nSEABORGIUM, who have been linked to activity aligning with Russian state interests.\n\n\n-----\n\nInsikt Group has observed the recurring use of common traits by TAG-53 when curating\nits infrastructure, including the use of domain names employing a specific pattern\nconstruct along with Let’s Encrypt TLS certificates, the use of a specific cluster of hosting\nproviders, and the use of a small cluster of autonomous systems.\n\nTAG-53 infrastructure was found to contain a spoofed Microsoft login page masquerading\nas a legitimate military weapons and hardware supplier in the United States, suggesting\nthat some TAG-53 infrastructure has likely already been operationalized. Based on\nhistorical public reporting on overlapping TAG-53 campaigns, it is likely that this\ncredential harvesting activity is enabled in part through phishing.\n\n**Key Judgments**\n\nInsikt Group has identified new infrastructure used by TAG-53, a group likely linked\nto suspected Russian threat activity groups Callisto Group, COLDRIVER, and\nSEABORGIUM.\nThe identified TAG-53 infrastructure features common traits including the use of\nspecific domain registrars, the use of Let’s Encrypt TLS certificates, and a small\ncluster of autonomous systems. Most of TAG-53’s domains use a specific stylistic\nstructure.\nTAG-53 has used domains masquerading as organizations across multiple industry\nverticals, with a particular focus on government, intelligence, and military\nindustries.\n\n**Background**\n\nTAG-53 is consistent when setting up its infrastructure, which bears significant hallmarks\nand crossover with infrastructure attributed to Callisto Group, COLDRIVER, and\nSEABORGIUM. The group continues to use particular stylistic structures when\nregistering malicious domains alongside the use of specific domain registrars with IP\naddresses that reside in a small cluster of autonomous systems.\n\n[On August 15, 2022, a Microsoft report published in collaboration with Google’s Threat](https://www.microsoft.com/en-us/security/blog/2022/08/15/disrupting-seaborgiums-ongoing-phishing-operations)\nAnalysis Group (TAG) and Proofpoint’s Threat Research Team detailed SEABORGIUM’s\nphishing operations. In this research, Microsoft assesses that SEABORGIUM originates\nfrom Russia and has “objectives and victimology that align closely with Russian state\ninterests”. Microsoft denotes that SEABORGIUM shares overlaps with Callisto Group,\nTA446, and COLDRIVER and indicates that the threat actor has carried out persistent\nphishing and credential theft campaigns that have led to intrusions and data theft.\nSEABORGIUM primarily focuses its targeting on NATO countries, including a specific\nemphasis on the United States and the United Kingdom. The group also targeted Ukraine\nin the run-up to Russia’s full-scale invasion of the country in February 2022.\n\n[Google’s TAG reported in March and updated in May 2022 that COLDRIVER has](https://blog.google/threat-analysis-group/tracking-cyber-activity-eastern-europe)\nconducted credential phishing campaigns using Gmail accounts targeting\nnongovernmental organizations and think tanks, journalists, and government and\n\n\n-----\n\ndefense officials. TAG also suggests that COLDRIVER’s TTPs have evolved over time,\nmoving towards incorporating PDF or DOC file links that are hosted on Google Drive and\nMicrosoft OneDrive within its phishing emails.\n\n**Threat and Technical Analysis**\n\n[Insikt Group used intelligence provided in open-source reporting (1, 2, 3, 4) to profile](https://www.microsoft.com/en-us/security/blog/2022/08/15/disrupting-seaborgiums-ongoing-phishing-operations)\nTAG-53 infrastructure that likely overlaps with Callisto Group, COLDRIVER, and\nSEABORGIUM infrastructure. TAG-53 infrastructure was uncovered by analyzing specific\ncombinations of domain registrars, autonomous systems, domain name structures, and\nrelated TLS certificates. Based on this information, it is highly likely that this threat group\nis continuing its phishing and credential-harvesting operations. While monitoring TAG53 infrastructure, Insikt Group observed a spoofed Microsoft login page masquerading as\na legitimate military weapons and hardware supplier in the US, suggesting that some\nTAG-53 infrastructure has likely already been operationalized.\n\nRegistrars\n\nUsing both current and passive Domain Name System (DNS) records, Insikt Group\nresolved IP addresses for 38 registered domains used by TAG-53 since January 2022. The\nidentified TAG-53 domains, listed in Appendix A, have highlighted a trend towards the\nuse of NameCheap, Porkbun, REG.RU, and regway for domain registration that has\npersisted since mid-2022, a breakdown of which can be seen in Figure 1. The reason for\nthe preference of these registrars is unknown, but it is a useful metric when profiling\ncandidate TAG-53 infrastructure.\n\n**Figure 1: Breakdown of domain registrars used by TAG-53 since January**\n**2022 (Source: Recorded Future)**\n\n\n-----\n\nAutonomous Systems\n\nAlongside the use of specific domain registrars is the use of particular autonomous\nsystems, with all domains collected under TAG-53 found to exist in 10 autonomous\nsystems with a significant concentration found located in 2 Autonomous System Numbers\n(ASNs) linked to MIRhosting (AS52000) and Hostwinds (AS54290) shown in Table 1\nbelow.\n\nASN AS Name TAG-53 Domain Count\n\nAS52000 MIRhosting 11\n\nAS54290 HOSTWINDS 10\n\nAS44094 WEBHOST1-AS 4\n\nAS62240 Clouvider 4\n\nAS62005 BV-EU-AS 3\n\nAS44477 STARK-INDUSTRIES 2\n\nAS16276 OVH 1\n\nAS20278 NEXEON 1\n\nAS206446 CLOUDLEASE 1\n\nAS43624 STARK-INDUSTRIES-SOLUTIONS-AS 1\n\n**Table 1: ASN detail breakdown for TAG-53 linked domains (Source:**\n**Recorded Future)**\n\nDomain Name Structure\n\nMost of the domains discovered via TAG-53 tracking use similarly structured domain\nnames, primarily made up of 2 terms separated by a hyphen, such as “cloudsafety[.]online”. Of the 38 domains identified, 33 used the stylistic form “-.\n(com|online|ru)”. Of the remaining 5 domains, 4 were found to be similar, but consisted\nof 3 terms and 2 hyphens — “share-drive-ua[.]com”, “network-storage-ltd[.]com”, “landof-service[.]com”, and “nonviolent-conflict-service[.]com” — and 1 contained no hyphens\n— “proxycrioisolation[.]com”. However, additional factors enabled Insikt Group to link\nthese domains to the rest of TAG-53’s infrastructure.\n\nA breakdown of the terms found in TAG-53 domains, shown in Figure 2, highlights the\nrepeated use of specific words within the domains, most of which are common, generic\ncomputing terms.\n\n\n-----\n\n**Figure 2: Breakdown of terms used in TAG-53 linked domains (Source:**\n**Recorded Future)**\n\nX.509 TLS Certificates\n\nAll identified TAG-53 domains were found to host corresponding X.509 TLS certificates\nprovided by Let’s Encrypt, an example of which is shown in Figure 3. The prevalent use of\nLet’s Encrypt TLS certificates allows for further correlations between TAG-53 domains\nand infrastructure, strengthening the clustering of this activity.\n\n**Figure 3: Partial X.509 TLS certificate for drive-globalordnance[.]com**\n**[(Source: crt.sh)](https://crt.sh/?id=7672587577)**\n\n\n-----\n\nTargeting and Victimology\n\nOf the 38 discovered domains, 9 contained references to potential target organizations or\norganizations that TAG-53 may be attempting to masquerade as, shown in Table 2. The\nreason behind the use of these themed domains is not fully understood beyond the likely\nattempt to emulate real entities in order to appear more legitimate to potential targets\nand victims.\n\n\nTAG-53 Domain Suspected\nTarget/Masquerade\n\n\nIndustry Vertical\n\n\numopl-drive[.]com UMO Poland Aerospace and Defense:\nHardware/Weaponry\n\n\ndriveglobalordnance[.]com\n\n\nGlobal Ordnance Aerospace and Defense:\nHardware/Weaponry\n\n\nsangrail-share[.]com Sangrail LTD Aerospace and Defense:\nMilitary & Civilian\nIntelligence\n\ndtgruelle-us[.]com DTGruelle Logistics\n\ndtgruelle-drive[.]com\n\n\ncija-docs[.]com The Commission for\nInternational Justice and\nAccountability (CIJA)\n\n\nNGO: Armed Conflict Crime\nInvestigations\n\n\nblueskynetworkshared[.]com\n\n\nBlue Sky Network Telecommunications:\nSatelite\n\n\ndns-mvd[.]ru The Ministry of Internal Affairs Government: Russian\nof the Russian Federation Ministry of Internal Affairs\n\nmvd-redir[.]ru (MVD)\n\n**Table 2: Suspected targets/masquerades of TAG-53 linked domains (Source:**\n**Recorded Future)**\n\nAnalysis of the 9 domains reveals that 7 share a focus around industry verticals that\nwould likely be of interest to Russia-nexus threat groups, especially in light of the war in\nUkraine. The 2 outlier domains are probably intended to masquerade as the Ministry of\nInternal Affairs of the Russian Federation. (MVD)\n\nCredential Harvesting\n\nThe TAG-53 domain “drive-globalordnance[.]com” includes a spoofed sign-in page for the\nlegitimate company Global Ordnance, a military weapons and hardware supplier in the\nUS. The spoofed sign-in page, shown in Figure 4, uses Global Ordnance branding and is\nsuspected to be used for follow-on credential harvesting after a target has been phished. It\n\n\n-----\n\nis unclear whether Global Ordnance is the intended target of this attempted credential\nharvesting operation or whether TAG-53 is using a Global Ordnance-styled domain and\nspoofed sign-in page to masquerade as a legitimate entity to target victims.\n\n**Figure 4: TAG-53 Global Ordnance spoofed sign-in page (Source: URLScan)**\n\n**Mitigations**\n\nUsers should conduct the following measures to detect and mitigate activity associated\nwith TAG-53:\n\nConfigure your intrusion detection systems (IDS), intrusion prevention systems\n(IPS), or any network defense mechanisms in place to alert on — and upon review,\nconsider blocking connection attempts to and from — the external IP addresses and\ndomains listed in the appendix.\nRecorded Future proactively detects malicious server configurations and provides\nmeans to block them in the Command and Control Security Control Feed. The\nCommand and Control Feed includes tools used by TAG-53 and other Russian statesponsored threat activity groups. Recorded Future clients should alert on and block\nthese C2 servers to allow for detection and remediation of active intrusions.\n\n\n-----\n\n[Recorded Future Threat Intelligence (TI), Third-Party Intelligence, and SecOps](https://www.recordedfuture.com/platform/threat-intelligence)\nIntelligence modules users can monitor real-time output from Network Intelligence\nanalytics to identify suspected targeted intrusion activity involving your\norganization or key vendors and partners.\nMonitor for domain abuse, such as typosquat domains spoofing your organization,\n[through the Recorded Future Brand Intelligence (BI) module. The SecurityTrails](https://www.recordedfuture.com/platform/brand-intelligence)\nextension is available to any customer that has a subscription to the Threat\nIntelligence or Brand Intelligence modules. The LogoType source and alerting is\nexclusive to the BI module, though the TI module does have access to the data via\nthe Advanced Query Builder.\nRecorded Future’s Fraudulent Domains and Typosquats playbook explains triaging\ntyposquatting or similar domain alerts. If you have not yet set up your alerts, see\nactivating certified alerts in the Intelligence Goals Library.\n\n**Outlook**\n\nInsikt Group continues to track TAG-53 infrastructure and observe changes in TTPs as\nthe group’s credential harvesting operations diversify. Notably, a consistent trend has\nemerged regarding the use of specifically tailored infrastructure by TAG-53 highlighting\nthe long-term use of similar techniques for their strategic campaigns.\n\nReaders should detect, block, and hunt for the indicators referenced in connection with\nTAG-53 reporting via the Recorded Future Platform in network monitoring, intrusion\ndetection systems, firewalls, and any associated perimeter security appliances.\n\n**Appendix A — Indicators**\n\nDomains\n\naccess-confirmation[.]com\nallow-access[.]com\nantibots-service[.]com\nblueskynetwork-shared[.]com\nbotguard-checker[.]com\nbotguard-web[.]com\nchallenge-identifier[.]com\nchecker-bot[.]com\ncija-docs[.]com\ncloud-safety[.]online\ncloud-us[.]online\ndns-cache[.]online\ndns-cookie[.]com\ndns-mvd[.]ru\ndocs-web[.]online\ndrive-control[.]com\ndrive-globalordnance[.]com\n\n\n-----\n\ndrive-previewer[.]com\ndrive-us[.]online\ndtgruelle-drive[.]com\ndtgruelle-us[.]com\nencompass-shared[.]com\nfilter-bot[.]com\ngoweb-protect[.]com\nguard-checker[.]com\nland-of-service[.]com\nlive-identifier[.]com\nmvd-redir[.]ru\nnetwork-storage-ltd[.]com\nnonviolent-conflict-service[.]com\nproxycrioisolation[.]com\nredir-document[.]com\nresponse-filter[.]com\nresponse-redir[.]com\nsangrail-share[.]com\nshare-drive-ua[.]com\ntransfer-record[.]com\numopl-drive[.]com\n\nIP Addresses\n\n23[.]254[.]201[.]243\n45[.]66[.]248[.]9\n45[.]86[.]230[.]198\n45[.]153[.]229[.]79\n64[.]44[.]101[.]31\n77[.]91[.]126[.]16\n77[.]91[.]126[.]35\n77[.]91[.]126[.]46\n77[.]91[.]126[.]62\n77[.]91[.]126[.]64\n77[.]91[.]126[.]66\n77[.]91[.]126[.]69\n77[.]91[.]69[.]109\n85[.]239[.]53[.]210\n85[.]239[.]60[.]18\n85[.]239[.]61[.]49\n85[.]239[.]61[.]86\n138[.]124[.]187[.]143\n138[.]124[.]187[.]222\n142[.]11[.]209[.]171\n142[.]11[.]209[.]180\n\n\n-----\n\n142[.]11[.]210[.]53\n146[.]19[.]230[.]182\n146[.]59[.]102[.]76\n185[.]164[.]172[.]128\n185[.]164[.]172[.]220\n185[.]179[.]188[.]73\n185[.]179[.]189[.]32\n185[.]179[.]189[.]43\n185[.]179[.]189[.]45\n192[.]119[.]65[.]114\n192[.]119[.]97[.]190\n192[.]119[.]112[.]249\n192[.]129[.]154[.]225\n192[.]236[.]195[.]114\n192[.]236[.]193[.]194\n193[.]200[.]17[.]102\n195[.]246[.]110[.]45\n\n**Appendix B — Mitre ATT&CK Techniques**\n\nTactic: Technique ATT&CK Code\n\n**Defense Evasion: Masquerading** T1036\n\n**Reconnaissance: Phishing for Information** T1598\n\n**Resource Development: Stage Capabilities** T1608\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2022/2022.12.05.TAG-53_Russia/Message%20from%20Recorded%20Future.pdf"
    ],
    "report_names": [
        "Message from Recorded Future"
    ],
    "threat_actors": [
        {
            "id": "5dae3c71-8be1-4591-a2fb-b851ea6f083d",
            "created_at": "2022-10-25T16:07:23.432642Z",
            "updated_at": "2025-03-27T02:02:09.798919Z",
            "deleted_at": null,
            "main_name": "Callisto Group",
            "aliases": [],
            "source_name": "ETDA:Callisto Group",
            "tools": [
                "RCS Galileo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "79bd28a6-dc10-419b-bee7-25511ae9d3d4",
            "created_at": "2023-01-06T13:46:38.581534Z",
            "updated_at": "2025-03-27T02:00:02.865836Z",
            "deleted_at": null,
            "main_name": "Callisto",
            "aliases": [
                "GOSSAMER BEAR",
                "BlueCharlie",
                "Star Blizzard",
                "TAG-53",
                "UNC4057",
                "COLDRIVER",
                "TA446",
                "IRON FRONTIER",
                "Blue Callisto",
                "SEABORGIUM"
            ],
            "source_name": "MISPGALAXY:Callisto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a057a97-db21-4261-804b-4b071a03c124",
            "created_at": "2024-06-04T02:03:07.953282Z",
            "updated_at": "2025-03-27T02:05:17.406598Z",
            "deleted_at": null,
            "main_name": "IRON FRONTIER",
            "aliases": [
                "BlueCharlie ",
                "CALISTO ",
                "COLDRIVER ",
                "Callisto Group ",
                "Gossamer Bear ",
                "Gossamer Bear ",
                "SEABORGIUM ",
                "Star Blizzard ",
                "TA446 ",
                "Blue Callisto "
            ],
            "source_name": "Secureworks:IRON FRONTIER",
            "tools": [
                " Galileo RCS",
                " SPICA",
                "Evilginx2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3aedca2f-6f6c-4470-af26-a46097d3eab5",
            "created_at": "2024-11-01T02:00:52.689773Z",
            "updated_at": "2025-03-27T02:00:55.508065Z",
            "deleted_at": null,
            "main_name": "Star Blizzard",
            "aliases": [
                "Star Blizzard",
                "SEABORGIUM",
                "Callisto Group",
                "TA446",
                "COLDRIVER"
            ],
            "source_name": "MITRE:Star Blizzard",
            "tools": [
                "Spica"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1672160731,
    "ts_updated_at": 1743041782,
    "ts_creation_date": 1672121904,
    "ts_modification_date": 1672121904,
    "files": {
        "pdf": "https://archive.orkl.eu/9c2e050959ee0d8e7e979b09b0d9674e2277cd15.pdf",
        "text": "https://archive.orkl.eu/9c2e050959ee0d8e7e979b09b0d9674e2277cd15.txt",
        "img": "https://archive.orkl.eu/9c2e050959ee0d8e7e979b09b0d9674e2277cd15.jpg"
    }
}