{
    "id": "63be8594-b83d-41d2-b050-34de7e292fa8",
    "created_at": "2022-10-25T16:48:23.975881Z",
    "updated_at": "2025-03-27T02:05:41.918291Z",
    "deleted_at": null,
    "sha1_hash": "41b86cb83c02f1cd9db606186857a0b3c0c09d33",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-10-26T17:47:35Z",
    "file_modification_date": "2017-10-26T17:47:36Z",
    "file_size": 1085334,
    "plain_text": "-----\n\n## ASEC REPORT\n#### VOL.88 [Q3 2017]\n\n\n###### ASEC (AhnLab Security Emergency Response Center) is a global security response group consisting of malware\n\n analysts and security experts. This report is published by ASEC and focuses on the most significant security\n\n threats and latest security technologies to guard against such threats. For further details, please visit AhnLab,\n\n Inc.’s homepage (www.ahnlab.com).\n\n\n###### SECURITY TREND OF Q3 2017\n\n\n###### Table of Contents\n\n\n-----\n\n-----\n\n###### Security Issue\n\n\n### Emotet Returns to Prey on Banking Information\n\n\n###### On August 2017, AhnLab confirmed, via AhnLab Smart Defense (ASD), its cloud-based malware\n\n analysis system, that the malware Emotet is once again being distributed through spam botnet.\n\n First spotted in 2014, Emotet is a trojan that hijacks financial information.\n\n The newly-resurfaced Emotet features modular functions for extracting the victim’s financial\n\n transaction information, downloading the relevant module from the C&C server to perform\n\n its activities.\n\n This report examines the distribution vector and operational features of Emotet, including a\n\n detailed analysis of the malware’s primary attack patterns.\n\n Distribution and operation of Emotet\n\n Analysis by AhnLab revealed that Emotet strain propagated last quarter was carried via spam\n\n botnet as email attachments.\n\n The overall attack pattern of Emotet is as shown in Figure 1-1.\n\n\n-----\n\n① User downloads and runs Emotet via spammed email attachment\n\n② Emotet is added to the autorun registry\n\n③ System OS information, list of running processes, the malware’s PE\n\nCRC, computer user name and volume serial number are encrypted\n\nand sent to the C&C\n\n④ Additional modules are downloaded from the C&C server to perform\n\nadditional malicious activities\n\n⑤ Downloaded modules are run\n\n\nFigure 1-1 | Attack pattern of Emotet\n\n\n###### The Word document files included in the spammed email spread via botnet contains a\n\n malicious macro as shown in Figure 1-2.\n\nFigure 1-2 | Malicious macro contained in the Word file attachment of the spammed email\n\n###### The document contains instructions such as “Macros have been disabled – Enable Content” to\n\n trick the user into running the macro. Once the user enables the macro function, an obfuscated\n\n powershell command as shown in Figure 1-3 is executed, which downloads a malicious file, \n\n Emotet loader, from an external URL and runs it.\n\n\n-----\n\n###### Key activities\n\n Once the Emotet loader is executed, the malware first registers itself as a service in Windows.\n\n\n① Registered as service to enable repeat execution of the\n\nEmotet loader\n\n② Computer name, OS information, list of running processes acquired\n\n③ Hijackes information using Crypto API\n\n④ Encrypts data communicated with C&C server\n\n⑤ Data received from C&C server decrypted, and modules executed\n\n\n###### User information is extracted next, and\n\n the malware communicates with the C&C\n\n server to download the modules required\n\n for additional activities. Table 1-1 lists the key\n\n activities performed by the Emotet loader.\n\n\nTable 1-1 | Malicious activities carried out by the Emotet loader\n\n\n###### 1. Service registry\n\n The Emotet loader calls the OpenSCManagerW API to check administrative privileges for\n\n installing and enumerating services. If the loader successfully obtains admin privilege, a routine\n\n for registering the Emotet loader as a service is executed, and a copy is dropped into the path\n\n %Windir%\\System32.\n\nFigure 1-4 | Calling OpenSCManagerW to check admin rights\n\n\n###### The 0x40884A code as shown in Figure 1-4 reveals that the value assigned to DS:[40B2A4] is\n\n determined by the result of the OpenSCManagerW API call. The value per byte in the DS:[40B2A4]\n\n of the 0x4088EC code in Figure 1-5 defines the destination of the self-duplicate of Emotet loader.\n\n\n-----\n\n###### The location where the Emotet loader places a\n\n copy of itself is determined by whether admi\n nistrative privileges have been successfully\n\n obtained; the paths are as shown in Table 1-2.\n\n|Privilege secured|%Windir%\\System32|\n|---|---|\n|Privilege not secured|%Appdata%\\Local\\Microsoft\\Windows|\n\n\nTable 1-2 | Self-duplicated locations for the Emotet loader\n\n\n###### The loader choses two random keywords from the list of keywords for service and file creation\n\n as shown in Table 1-3 to determine the file name of its copy.\n\nagent,app,audio,bio,bits,cache,card,cart,cert,com,crypt,dcom,defrag,device,dhcp,dns,event,evt,flt,gdi,group,help,home,host,info,iso,laun\n\nch,log,logon,lookup,man,math,mgmt,msi,ncb,net,nv,nvidia,proc,prop,prov,provider,reg,rpc,screen,search,sec,server,service,shed,shedul\n\ne,spec,srv,storage,svc,sys,system,task,time,video,view,win,window,wlan,wmi\n\nTable 1-3 | Key words used to create the service and file\n\n\n###### The selected keywords are combined into name of the self-duplicated file and service.\n\nFigure 1-6 | Configuring the service description\n\n\n###### After service creation, the Emotet loader calls the ChangeServiceConfig2W API as shown in\n\n Figure 1-6 to change the service description. The API copies a random description from an\n\n\n-----\n\n###### existing service to change the description of the new service.\n\n 2. User data collection\n\n After completing the service creation process, the Emotet loader begins gathering user\n\n information. The loader extracts system OS version, computer name, volume serial number, list\n\n of processes, and running PE CRC information.\n\n Then the hijacked information is transmitted\n\n to the C&C server after the encryption. The\n\n extraction of user information such as OS data\n\n and PE CRC32 were observed as shown in\n\n Figure 1-7.\n\nFigure 1-7 | Hijacked user and system information\n\n###### 3. Data encryption via Crypt API\n\n Emotet loader encrypts the collected user information, using either a custom encryption or\n\n the Crypt API. In case of the latter, the file contains the RSA public key as shown in Figure 1-8,\n\n which is used to encrypt the random AES-128 symmetric key called by the CryptGenKey API.\n\n\nFigure 1-8 | Codes for extracting the RSA public key and generating the AES-128 random key\n\n\n-----\n\n###### As shown in Figure 1-9, Emotet loader file contains the RSA public key stored by the attacker;\n\n the key decoded by the CryptDecodeObjectEx API is shown in Figure 1-10.\n\n\nFigure 1-10 | The key decoded by RSA public key\n\n\n###### Finally, the Emotet loader uses the CryptEncrypt API for AES-128 CBC mode encryption and\n\n generates hash values for the data. The AES-128 key value used in the encryption is extracted\n\n by the CryptExportKey API and copied to memory.\n\n\nFigure 1-11 | Data encryption process\n\n\n-----\n\n###### 4. Encrypted data sent to the C&C server\n\n When the data encryption process is fully\n\n complete, the Emotet loader uses POST to\n\n transfer the encrypted data to the C&C server,\n\n as shown in Figure 1-12.\n\nFigure 1-12 | POST data transfer A notable feature is that the C&C server re\n###### turns a 404 error value to the client in response as shown in Figure 1-13, which in fact contains\n\n additional encrypted malicious modules.\n\n\nFigure 1-13 | POST transfer and 404 error\n\n\n###### While the C&C server was blocked during the time of this investigation preventing a verification\n\n of the nature of this malicious module, the actual size of the response value sent to the client\n\n under normal circumstances is known to exceed 0x1c000.\n\n 5. Encrypted data received from C&C server decoded and executed\n\n While acquiring the malicious modules from the blocked C&C server proved to be unavailable,\n\n static analysis of the loader revealed the nature of the malicious activities performed by the\n\n additional modules. As shown in Figure 1-14, the Emotet loader performs data decoding after\n\n receiving a response value from the C&C server and executes a file presumed to be the newly\n downloaded module.\n\n\n-----\n\n###### Finally, with the execution of the additional modules on the infected system, a module is\n\n injected into the current Web browser and activated to hijack user information.\n\n\n###### The list of additional malicious modules\n\n downloaded from the C&C server are shown\n\n\n\n- Network distribution module\n\n- Spammed email module\n\n- Browser-injected financial data hijack module\n\n\nTable 1-4 | Additional modules downloaded from the C&C server\n###### in Table 1-4.\n\n The relevant alias of the Emotet malware identified by V3 products, AhnLab’s anti-virus pro\n gram, is as below:\n\n <Alias identified by V3 products>\n\n • Trojan/Win32.Emotet (2017.09.20.00)\n\n\n-----\n\n-----\n\n###### Threat Review\n\n\n### Q3 2017 Ransomware Trends\n\n\n###### The relentless assault by ransomware continued during the third quarter of this year. A large\n\n number of Locky variants appeared, in addition to an increasing variety of ransomware\n\n including RaaS (Ransomware as a Service). This report presents the ransomware trends of the\n\n third quarter 2017.\n\n 1. Locky Variants\n\n Another hail of Locky variants dropped during the third quarter 2017. Although these variants\n\n used different types of email attachment or encrypted file extensions, the ransom note\n\n generated after the encryption process revealed their family ties to Locky.\n\n Lukitus\n\n Sporting the extension .lukitus for its encrypted files, Lukitus is a strain of Locky that uses\n\n a Windows Script Host error message to lure users. Propagated via spammed emails, this\n\n ransomware uses enticing titles such as “Voice message attached” or “Pictures” to invite clicking.\n\n The actual payload, however, is a compressed file written in JavaScript (JS) which downloads\n\n and runs the ransomware.\n\n\n-----\n\n###### By clicking the attachment, the JS file exe\n cutes Windows Script Host. However, an error\n\n message is displayed on the screen as shown\n\n in Figure 2-2 to confuse the user into thinking\n\nFigure 2-2 | Fake error message that an error has occurred.\n\n###### While the user may think an error has occurred due to the popup message in Figure 2-2,\n\n wscript.exe is executed in background as seen in Figure 2-3.\n\n\nFigure 2-3 | wscript.exe executed\n\n\n###### When executed, Lukitus shows a ransom\n\n note as shown in Figure 2-4, identical to that\n\n of existing Locky ransomware.\n\n Ykcol\n\n Yet another Locky variant named Ykcol sur\n\nFigure 2-4 | The ransom note displayed by Lukitus, identical to Locky’s\n\n\n-----\n\n###### faced in mid-September. This ransomware assigns the extension .ykcol to encrypted files,\n\n which is Locky spelled backwards. The ransomware is distributed by spammed emails bearing\n\n the subject “Status of Invoice”.\n\n Similar to Locky attaching a .7zip compress\n ed file in emails, this variant also uses an\n\n attachment compressed as .7zip or .7z to\n\n evade mailing filters.\n\n Uncompressing the file contained in the email\n\n will generate a VBS (Visual Basic Script) file.\n\nFigure 2-5 | Spammed email containing a .7z file Running the VBS file will initiate downloading\n\n###### of the actual ransomware file from a URL hardcoded in the file. The downloaded ransomware\n\n encrypts the files in the user’s PC and changes their extensions to .ykcol as shown in Figure 2-6.\n\nFigure 2-6 | Files given .ykcol extensions after encryption\n\n\n###### Like Lukitus, Ykcol also displays the identical ransom note as Locky.\n\n\n-----\n\n###### 2. CryptoMix variants\n\n CryptoMix is another ransomware with a stable of variants as extensive as Locky. CryptoMix\n\n was discovered in May of 2016 and became famous for its extensive list of variants.\n\n CryptoShield 1.0 and 2.0, Revenge, Mole and Wallet are all classified as CryptoMix variants, and\n\n additional strains were discovered in July.\n\n Azer\n\n Spotted on July 5, Azer was written in Visual C++. Once the user’s system is infected, the\n\n ransomware duplicates itself to the Application Data folder and runs.\n\n Azer modifies the registry to include itself in the system’s startup programs, to ensure that\n\n the encryption process is not interrupted if the PC is shut off or rebooted.\n\n Azer adds the extension .azer to encrypted files as shown in Figure 2-8.\n\n\n-----\n\n###### The .txt ransom note created in the folder containing the encrypted files includes the\n\n infected PC’s unique ID and two email addresses for sending the request to release the files\n\n as shown in Figure 2-9. One is the address used in the file name, while the other presumably\n\n is intended as a refer to the current U.S. president.\n\n\nFigure 2-9 | Azer’s ransom note and instructions for recovery\n\n\n###### Exte\n\n Discovered on July 14, Exte is another CryptoMix variant written in Visual C++, and is thus\n\n almost identical with the aforementioned Azer in duplicating itself and modifying the registry.\n\n Exte adds the extension .EXTE to encrypted files.\n\n\n-----\n\n###### Unlike Azer, the ransom note created by Exte in the encrypted file folder provides three email\n\n addresses from different domains including “exte” in the name. Furthermore, unlike Azer that\n\n beings the infected PC’s unique ID with “You ID”, Exte uses the heading “Decrypt-ID”.\n\n\nFigure 2-11 | Exte’s ransom note with instructions for file recovery\n\n\n###### 3. Ransomware-as-a-Service (Raas)\n\n Ransomware-as-a-Service (RaaS) or ransom\n ware developed and managed by third\n\n parties for a price, began to appear in 2016.\n\n The ransomware Shifr, discovered in the\n\n third quarter of this year, is one of these\n\n RaaS. The attackers require only a simple\n\n set of information such as bitcoin address,\n\n\nFigure 2-12 | Potential attackers need only to fill out three fields to\nrequest a ransomware\n\n\n-----\n\n###### the ransom amount and a captcha check; while other fabricators ask for a bitcoin address,\n\n email, and desired amount of ransom to be demanded and the file extension to be used. This\n\n enables anyone to handily order up Shifr ransomware.\n\n The provider for the Shifr service demands a 10% cut of the profits, a relative bargain for the\n\n attacker compared to the average rate of half the profits by other providers. These features\n\n may lead more attackers to turn to Shifr.\n\nFigure 2-13 | Shifr’s RaaS\n\n###### Files encrypted by Shifr are given the extension .shifr, as shown in Figure 2-14.\n\n\nFigure 2-14 | Files encrypted by .shifr\n\n\n###### Shifr encrypts document files and pictures, commonly found in all systems, but leaves\n\n compressed files untouched.\n\n\n-----\n\n###### Once the encryption of the files in a system\n\n infected by Shifr is completed, a ransom note\n\n file is created on the desktop, as shown in\n\n Figure 2-15. This is a unique feature of Shifr,\n\n as most ransomware create a ransom note in\n\nFigure 2-15 | Ransom note dropped on the desktop each folder containing encrypted files.\n\n###### The ransom note created by Shifr and placed on the desktop only contains a simple message\n\n “Your files have been encrypted” as shown in Figure 2-16, and a link for instructions on how\n\n to decrypt the files. The note is very simple, compared with those of other ransomware that\n\n include detailed instructions on ransom payment and file recovery.\n\nFigure 2-16 | Shifr’s minimalist ransom note\n\n\n###### 4. Ransomware flavored with social engin\n eering\n\n Shade, a ransomware that disguises itself as\n\n a scanned document sent by an all-in-one\n\n printer, surfaced in late July. This ransomware\n\n appears to be designed to target users in\n\n corporate environments that often encounter\n\n\nFigure 2-17 | Shade ransomware disguised as an emailed scanned\ndocument\n\n\n-----\n\n###### scanned documents as part of their daily routines. The ransomware uses a password-protected\n\n document file in an advanced attack pattern that sets itself apart from the competition.\n\n As shown in Figure 2-17, Shade disguises itself as an email sent by a printer after scanning\n\n a file. The ransomware uses an official-looking “noreply” email address to try to assuage the\n\n recipient’s suspicions.\n\n Opening the Word document file contained in the email produces a popup message asking for\n\n the file’s password.\n\n Most Word files distributed via spammed email messages do not include passwords. The\n\n example above, however, uses a password to lock the document and includes the password in\n\n the email message to try to avoid detection.\n\n Entering the password contained in the email\n\n body runs the macro embedded in the Word\n\n file. The macro connects to a particular URL to\n\n\nFigure 2-18 | Downloaded malware\n\n\n###### download and run the malware.\n\n\n###### Shade creates a batch file when run, which is used to delete the volume shadow copy containing\n\n the Windows system restore point, the remote desktop access history and Windows event records.\n\n The ransomware then proceeds with the encryption and alters the file extensions. Most files are\n\n targeted for attack, from DOC, PPT, XLS, TXT and other documents to EXE and ZIP files. Once the\n\n encryption is complete, the ransomware deletes itself to erase its footprints.\n\n\n-----\n\n###### It has become widely known that ransomware\n\n is distributed as attachments in spammed\n\n emails. However, using a password-locked\n\n file may buy time for the malicious code\n\n to exploit weaknesses. Shade appears to\n\n be the latest in such attempts to employ\n\n increasingly-advanced attack patterns.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://global.ahnlab.com/global/upload/download/asecreport/ASEC%20REPORT_vol.88_ENG.pdf"
    ],
    "report_names": [
        "ASEC%20REPORT_vol.88_ENG.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1509040055,
    "ts_modification_date": 1509040056,
    "files": {
        "pdf": "https://archive.orkl.eu/41b86cb83c02f1cd9db606186857a0b3c0c09d33.pdf",
        "text": "https://archive.orkl.eu/41b86cb83c02f1cd9db606186857a0b3c0c09d33.txt",
        "img": "https://archive.orkl.eu/41b86cb83c02f1cd9db606186857a0b3c0c09d33.jpg"
    }
}