{
    "id": "642f7055-d632-49cc-aa0b-1d6c6ef7ad14",
    "created_at": "2022-10-25T16:48:14.777751Z",
    "updated_at": "2025-03-27T02:16:42.992836Z",
    "deleted_at": null,
    "sha1_hash": "4b2a0cb6ff2c622a8b31608757008a9a225cf796",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-05-02T03:52:18Z",
    "file_modification_date": "2016-05-02T03:52:18Z",
    "file_size": 1592159,
    "plain_text": "### Mo’ Shells Mo’ Problems – Network Detection\n\nMarch 28, 2014 [Danny Lungstrom and Andy Schworer](http://www.crowdstrike.com/blog/author/dannylungstrom-and-andyschworer/)\n\n[From The Front Lines, Research & Threat Intel](http://www.crowdstrike.com/blog/category/from-the-front-lines/)\n\nDisclaimer: CrowdStrike derived this information from\n\ninvestigations in non-classified environments. Since we value\n\nour client’s privacy and interests, some data has been redacted\n\nor sanitized.\n\nIn previous posts of this “Mo’ Shells Mo’ Problems” blog series\n\nwe discussed web shells with specific Deep Panda adversary\n\nexamples as well as how to detect them within your enterprise\n\nusing file stacking and web log analysis. This blog entry\n\ncompletes the series with related methodology for detecting web\n\nshells using network packet capture data.\n\nNetwork detection of web shells can be a particularly important\n\nline of defense; especially if stacking and web log analysis are\n\nnot feasible in your environment. Host-based indicators of the\n\ninitial compromise may be hard to come by if the adversary\n\nalready has a long-standing presence in an environment where\n\nh l i h d ll d d i hi i\n\n\n-----\n\nsporadically once installed and are often a fallback option in\n\ncase another, noisier, backdoor is discovered. During their\n\ninactivity, web shells do not generate any traffic on the network,\n\nas you would normally find with a Remote Access Tool (RAT)\n\nbeaconing out to a command and control server on a regular\n\ninterval. It’s important that you are able to detect web shells\n\nwhen given the chance, as they can be as dangerous to your\n\nenvironment as any RAT. In the rest of this blog post we walk\n\nthrough a variety of ways to detect web shells via the network.\n\nNetwork Signatures\n\nSignature-based intrusion detection systems (IDSs), like Snort,\n\ncan be very powerful for identifying known web shells. Such\n\nsolutions are entirely dependent, however, on the signatures they\n\nuse (much like anti-virus products are only as good as their virus\n\ndefinitions). If a web shell is known, analyzed, and has\n\nsignatures written and implemented for it, the false positive rate\n\nand amount of content required for manual review can be very\n\nlow. Companies such as CrowdStrike spend significant time and\n\neffort creating such signatures based on malicious traffic they\n\nfind in the wild. Subscribing to such a set of Snort signatures\n\ncan increase a security team’s visibility for many/most known\n\npast and current threats. The usual issue applies, however, where\n\nfuture web shell characteristics cannot be predicted, nor can an\n\neffective generic web shell signature be written that would do\n\nany justice or raise detection confidence. If there were, you\n\nwouldn’t be seeing this blog series with multiple methodologies\n\nused for web shell detection, as we wouldn’t need any others and\n\nadversaries would quickly shift to a different family of malware.\n\nAs discussed in Part 1 of this blog series, Mo’ Shells Mo’ Problems\n\n– Deep Panda Web Shells, the Deep Panda web shell exhibits\n\nunique characteristics in the HTTP header in addition to specific\n\nHTML content that make using custom Snort IDS signatures\n\npossible. Below, we’ve provided a few such signatures that detect\n\nthe Deep Panda web shell. By showing the original packet\n\ncaptures, we hope to demonstrate how you might develop your\n\nown signatures after encountering unknown malware.\n\nThe following packet capture is a GET request for the Deep Panda\n\n\n-----\n\n“Accept-Language” value of “es-DS”.\n\nThe following Snort signature takes advantage of these unique\n\ncharacteristics and will trigger an alert if encountered.\n\nThis next packet capture is another GET request for the Deep\n\nPanda web shell, system_web.aspx, but this time using the\n\n[cookie value referenced in Part 1 of this blog series. This](http://www.crowdstrike.com/blog/mo-shells-mo-problems-deep-panda-web-shells/index.html)\n\nparticular cookie content appears unique to this web shell and is\n\nused in the following Snort signature, where a 1 or 2 digit number\n\nis assigned to the cookie value for “zWiz”.\n\nThe corresponding Snort signature is as follows.\n\nBeyond the HTTP header information identified above, the actual\n\nHTML content can be very useful in identifying the web shell via\n\nthe network. In the case of the Deep Panda web shell, a specific\n\nset of fields and buttons are presented to the end user, and are\n\nlabeled accordingly in the captured HTML. The following packet\n\ncapture displays a snippet of this HTML that produces the web\n\nshell interface.\n\n\n-----\n\nThis HTML produces the following web shell.\n\nThe corresponding Snort signature based on this design is as\n\nfollows.\n\nIt is still possible to leverage or create more general web shell\n\nIDS signatures for your environment that go beyond specific web\n\nshells. One example would be a Snort signature that looks for a\n\nlong Base64-encoded POST request (e.g. 30 or more continuous\n\nvalid Base64 characters without a space). Such signatures will\n\ncome with many more false positives and will likely require\n\ntailoring to your environment. The better you know your network\n\nand the traffic you expect, the better you’ll be able to tailor such\n\nsignatures and reduce false positives.\n\nHTTP Request Analysis\n\nHunting through network packet capture data can be tough if\n\nyou don’t know exactly what you’re looking for, but it is possible\n\nto identify a web shell using techniques similar to those\n\n\n-----\n\nWeb Server Log Analysis. In that post we used statistical\n\nanalysis on web server logs to identify anomalous web server\n\n[activity. Using Bro IDS (https://www.bro.org/) to generate log](https://www.bro.org/)\n\ndata from network traffic captures, an analyst can apply the\n\nsame principles of stacking and statistical analysis to network\n\ntraffic data with the goal of identifying outliers.\n\nBro IDS is a powerful network analysis framework which parses\n\ncommon network protocols and generates verbose log data\n\ncharacterizing the network traffic state. This data is extremely\n\nvaluable for network forensics and hunting for suspicious\n\nbehavior within network traffic. Using bro-cut to examine the\n\nBro http.log file generated from the Deep Panda web shell\n\nnetwork packet captures we can see that the malicious requests\n\nstick out because of both the web shell’s extended file path\n\nlength and the low number of requests to the web shell.\n\nCommand: bro-cut uri < http.log | sort | uniq -c\n\nThe above bro-cut command counts the number of unique uri\n\nfield values in the http.log file and displays the respective\n\ncounts. It may also be possible to discover anomalous web server\n\nactivity, like a covert web shell, by racking and stacking the\n\nhttp.log bro log based on the following fields: source ip,\n\ndestination port, http user-agent and http referrer.\n\nUseful bro-cut commands:\n\n\n-----\n\nIt is important to note that performing statistical analysis on log\n\ndata such as this may very well lead to the discovery of\n\nmalicious activity, but at other times may lead to an analytical\n\ndead end. A proactive approach can be taken to minimize some\n\nof the noise and increase the odds of identifying anomalous\n\nactivity as malicious. Whitelisting the known good and\n\nuninteresting URIs prior to stacking the http.log data may\n\nprovide a less noisy dataset. It is worth stating again that the\n\nbetter you know your network the more effectively your hunting\n\nactivities will be.\n\nCommand: A quick grep -Fxv will whitelist out all known good URI\n\npaths in the http.log\n\nIP Address Analysis\n\nTracking adversary activity in your network may sometimes be\n\nas simple as identifying a known bad IP address communicating\n\nwith one of your systems. This flagged traffic could very well be\n\nthe adversary communicating with their web shell, or another\n\nbackdoor in your environment. Often times, however, legitimate\n\ntraffic may be flagged as suspicious requiring significant time to\n\nweed out false positives. The trick here is managing the list of\n\n“known bad” or suspicious IP addresses as best as possible. A\n\nvariety of categories for such IP addresses of interest are\n\ndiscussed in the sections below.\n\nNetwork Indicators of Compromise (IOCs)\n\nYour network IOCs may come from previous or current\n\ninvestigations at your company where you’ve been able to\n\nassociate an IP address to malicious activity, as well as from\n\nsubscription-based intelligence feeds for a more complete and\n\nproactive set. While network indicators can be great and lead\n\nyou right to compromise, it is also quite common, especially in\n\nthe case of a web shell, that attackers switch up their IPs\n\n\n-----\n\nA regularly updated list of TOR exit nodes could prove useful for\n\nidentifying suspicious traffic in your environment if you would\n\nnot expect or want to see TOR traffic connecting to your hosts. In\n\naddition, identifying traffic that comes from commonly-used\n\nVPN and proxy services, which are regularly leveraged by\n\nadversaries, will provide further avenues for analysis. In many\n\ncases, IP ranges for these VPN and proxy services are readily\n\navailable. You may quickly decide, however, that tracking TOR\n\nexit nodes and VPN/proxy solutions comes with more upkeep\n\nthan you have time for, but it remains a good tactic to be aware\n\nof should you have concerns in your environment. In a recent\n\nDeep Panda investigation we found the adversary using a\n\npopular US-based VPN solution to disguise their IP address and\n\nconnect to their web shell. It is important to keep in mind that\n\nlegitimate users may also take advantage of TOR or VPN/proxy\n\nsolutions for privacy or security benefits, so their use alone is\n\nnot an indicator of compromise. However, as knowledge is power,\n\nit is often this sort of additional information that quickly helps\n\nto identify an avenue for further investigation.\n\nPhysical Location\n\nGeolocation services may be used to determine the approximate\n\nlocation of an IP address. Traffic coming from or going to\n\ncountries abnormal for your environment should be looked at\n\n[more closely. The obvious difficulty here is the great potential for](http://www.crowdstrike.com/) **[BLOG](http://www.crowdstrike.com/blog/)**\n\nfalse positives depending on what is “normal” for your\n\nenvironment. The Deep Panda web shells discussed throughout\n\nthis blog series are attributed to China, however, many\n\ncompanies have legitimate communications with China, making\n\nthis a difficult indicator to use on its own. The effectiveness of\n\ngeolocation will depend greatly on your environment and\n\nwhether or not the adversary utilizes VPN or proxy services.\n\nInternal IPs\n\nTraffic flows that are internal to your own network may be just as\n\nvaluable as the external IP address analysis discussed above.\n\nWeb shells are often deployed laterally by an attacker that\n\nalready has a foothold in your network and would like to have a\n\n\n-----\n\nstart to detecting this sort of lateral web shell deployment,\n\naccompanied by appropriate network segmentation where\n\npossible. HTTP Request Stacking, discussed in this blog post,\n\nmay be useful to find such anomalies.\n\nDetecting the Initial Compromise\n\nOne of the most effective ways of identifying web shells (or any\n\nadversary activity) is by identifying the initial compromise that\n\nallowed it to be placed in your environment and then narrowing\n\nin on surrounding activity. File stacking and web log analysis\n\ncovered earlier in this blog series are that much easier if you can\n\nidentify a timeframe or specific host for analysis.\n\nIf you have architected your network to have good packet capture\n\ndata and NetFlow available, most of the detection techniques\n\ndiscussed previously in this series are also viable during\n\nnetwork analysis. As an example, SQL injection, remote file\n\ninclusion and directory enumeration can be easily detected\n\nusing similar steps to those discussed in Part 3 of this blog\n\n[series, Mo’ Shells Mo’ Problems – Web Server Log Analysis. The](http://www.crowdstrike.com/blog/mo-shells-mo-problems-web-server-log-analysis/index.html)\n\nmain difference in the network review is the platform you’ll\n\nleverage, as you’ll want a PCAP-capable tool such as Snort or\n\nSuricata to use for request analysis and alerting.\n\nSummary\n\nDetecting web shells via the network can prove to be a challenge,\n\nbut is feasible. Using a combination of the methodologies\n\npresented in this blog series gives security teams a better\n\nchance for detecting web shells so they don’t go unnoticed –\n\nsomething the adversary has enjoyed for too long. To detect web\n\nshells via the network, consider the following network\n\napproaches:\n\nKeep your IDS signatures up to date with best-of-breed\n\nintelligence subscriptions\n\nKnow your network and identify anomalies\n\nMonitor internal and external IP traffic\n\nStack your HTTP requests and see what stands out\n\nLook for signs of initial compromise to narrow down your\n\n\n##### \n\n\n-----\n\n######  Tweet  Share\n\n##### Related Content\n\n\n###### CrowdStrike Intelligence – Adversary- based Approach\n\nTreating the\n\nproblem, not the\n\nsymptomsHaving\n\nspent the better\n\npart of the last 10\n\nyears dealing…\n\n\n###### ARMv7/Thumb2 Inline Code Hooking\n\nAt Hackito Ergo\n\nSum 2012, I\n\npresented about\n\nExploitation of\n\nthe RenderArena\n\nallocator in\n\nWebKit\n\n(PDF) with…\n\n\n###### Unpacking Dynamically Allocated Code\n\nBackgroundToday,\n\nmost malware is\n\nobfuscated to\n\nmake it more\n\ndifficult for\n\ntraditional\n\nantivirus engines\n\nto detect…\n\n\n[](https://twitter.com/CrowdStrike) [](https://www.linkedin.com/company/crowdstrike) [](https://www.facebook.com/CrowdStrike/) [](http://www.youtube.com/user/CrowdStrike)\n# \n\nCopyright © 2016 CrowdStrike | [Privacy](http://www.crowdstrike.com/privacy-notice/) | [Request Info](http://www.crowdstrike.com/request-information/) | [Blog](http://www.crowdstrike.com/blog) | [Contact Us](http://www.crowdstrike.com/contact-us/) | 1.888.512.8906\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.02.20.deep-panda-webshells/Mo%27%20Shells%20Mo%27%20Problems%20-%20Network%20Detection%20%C2%BB.pdf"
    ],
    "report_names": [
        "Mo' Shells Mo' Problems - Network Detection »"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041802,
    "ts_creation_date": 1462161138,
    "ts_modification_date": 1462161138,
    "files": {
        "pdf": "https://archive.orkl.eu/4b2a0cb6ff2c622a8b31608757008a9a225cf796.pdf",
        "text": "https://archive.orkl.eu/4b2a0cb6ff2c622a8b31608757008a9a225cf796.txt",
        "img": "https://archive.orkl.eu/4b2a0cb6ff2c622a8b31608757008a9a225cf796.jpg"
    }
}