{
    "id": "646cc60a-d0f4-4c91-a84e-3e57b8a3d7cd",
    "created_at": "2023-05-06T02:08:51.290923Z",
    "updated_at": "2025-03-27T02:15:38.174395Z",
    "deleted_at": null,
    "sha1_hash": "6009f928d0e156916b657bdeb90f859fdc879af4",
    "title": "2023-04-25 - Elastic Security Labs discovers the LOBSHOT malware",
    "authors": "",
    "file_creation_date": "2023-05-05T02:07:03Z",
    "file_modification_date": "2023-05-05T02:07:03Z",
    "file_size": 1415056,
    "plain_text": "# Elastic Security Labs discovers the LOBSHOT malware\n\n**[elastic.co/de/security-labs/elastic-security-labs-discovers-lobshot-malware](https://www.elastic.co/de/security-labs/elastic-security-labs-discovers-lobshot-malware)**\n\n_An analysis of LOBSHOT, an hVNC malware family spreading through Google Ads._\n\nVon\n\nDaniel Stepanic\n\n25. April 2023\nDeutsch\n\n## Key takeaways\n\nAdversaries continue to abuse and increase reach through malvertising such as Google Ads\nby impersonating legitimate software\nElastic Security Labs is shedding light on an undiscovered hVNC malware that has been\nquietly collecting a large install base\nThis malware we are calling LOBSHOT appears to be leveraged for financial purposes\nemploying banking trojan and info-stealing capabilities\n\n## Preamble\n\n\n-----\n\nElastic Security Labs along with the research community noticed a large spike in the adoption of\nmalvertising earlier this year. Attackers promoted their malware using an elaborate scheme of fake\nwebsites through Google Ads and embedding backdoors in what appears to users as legitimate\ninstallers. In this post, we will highlight one malware family we observed from this spike we’re calling\nLOBSHOT. LOBSHOT continues to collect victims while staying under the radar.\n\nOne of LOBSHOT’s core capabilities is around its hVNC (Hidden Virtual Network Computing)\ncomponent. These kinds of modules allow for direct and unobserved access to the machine. This\nfeature continues to be successful in bypassing fraud detection systems and is often baked into\nmany popular families as plugins.\n\nWe will walk through the LOBSHOT infection chain and its behaviors. Additionally, we will provide a\nYARA signature and configuration extractor for this family.\n\nLOBSHOT infection chain\n[Throughout our analysis, we observed infrastructure known to belong to TA505. TA505 is a well-](https://malpedia.caad.fkie.fraunhofer.de/actor/ta505)\nknown cybercrime group associated with Dridex, Locky, and Necurs campaigns. A loader\n[documented by Proofpoint, known as Get2, has also been tied to the same domains in the past that](https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader)\nwe observed with LOBSHOT. We assess with moderate confidence that LOBSHOT is a new\nmalware capability leveraged by TA505 starting in 2022.\n\n## Campaign context\n\nEarlier this year, Elastic Security Labs observed multiple infections with an interesting chain of\nevents that resulted in the execution of an unknown hVNC malware, which we are calling\nLOBSHOT. Around this same time, similar infection chains were observed in the security community\nwith commonalities of users searching for legitimate software downloads that ended up getting\n[served illegitimate software from promoted ads from Google [1,](https://www.spamhaus.com/resource-center/a-surge-of-malvertising-across-google-ads-is-distributing-dangerous-malware/) [2,](https://twitter.com/1ZRR4H/status/1617661947851464704?s=20) [3,](https://twitter.com/Malwar3Ninja/status/1617423187415044099?s=20) [4].](https://twitter.com/malwrhunterteam/status/1617605240316129280?s=20)\n\n\n-----\n\nIn one example, the malicious ad was for a legitimate remote desktop solution, AnyDesk. Careful\nexamination of the URL goes to https://www.amydecke[.]website instead of the legitimate\nAnyDesk URL, https://www.anydesk[.]com.\n\nMalicious Google Ad\nThe landing pages were very convincing with similar branding as the legitimate software and\nincluded Download Now buttons that pointed to an MSI installer.\n\nFake AnyDesk landing page for installer\n[Thanks to security researcher Will Dormann, we were able to](https://twitter.com/wdormann) [view the screenshots from the](https://twitter.com/wdormann/status/1617612216945250304?s=20)\nAnyDesk campaign.\n\n\n-----\n\nTweet\n\nreferencing AnyDesk infection chain\nAt the time of publication, we haven’t seen any previous public information about LOBSHOT, so we\nwill focus our research on LOBSHOT’s functionality and capabilities.\n\n## LOBSHOT code analysis\n\nTo focus on the LOBSHOT malware, we will skip the initial infection chain. For these initial details,\n[here is a good sandbox report to look over for general TTPs. We have observed over 500 unique](https://www.joesandbox.com/analysis/787624/0/html)\nLOBSHOT samples since last July. The samples we have observed are compiled as 32-bit DLLs or\n[32-bit executables typically ranging around 93 KB to 124 KB. Consider the following sample](https://www.virustotal.com/gui/file/e4ea88887753a936eaf3361dcc00380b88b0c210dcbde24f8f7ce27991856bf6)\nrepresentative of LOBSHOT for purposes of this analysis.\n\n### Dynamic API resolution\n\nIn our LOBSHOT sample, like most malware we see today, it employs dynamic import resolution to\nevade security products and slow down the rapid identification of its capabilities. This process\ninvolves resolving the names of the Windows APIs that the malware needs at runtime as opposed to\nplacing the imports into the program ahead of time.\n\n\n-----\n\nResolving\n\nWindows Registry APIs through LoadLibraryA/GetProcessAddress\n\n### Defender emulation check\n\nAfter the initial libraries are loaded, LOBSHOT performs a Windows Defender anti-emulation check\nby verifying if the computer name matches the string HAL9TH and if the username matches\n**JohnDoe. These are hard-coded values within the emulation layer of Defender, if they are present,**\nthe malware immediately stops running. This kind of verification has been incorporated in many\nother stealers including Arkei, Vidar, and Oski. Below is the emulation output using the\n[Qilingframework highlighting these verification checks.](https://github.com/qilingframework/qiling)\n\nDefender checks via Qiling\n\n### String obfuscation\n\nThis malware hides its primary strings through a straightforward encryption function using different\nbitwise operators. To perform the string decryption, LOBSHOT uses an initial seed from the\n[WTS_SESSION_INFO structure from a call to WTSEnumerateSessionsA.](https://learn.microsoft.com/en-us/windows/desktop/api/wtsapi32/ns-wtsapi32-wts_session_infoa)\n\nLOBSHOT calling WTSEnumerateSessionsA\nIn this case, the malware developer sets up the initial seed by performing an XOR on the SessionID\n(always a 0) and the S char from “Services”.\n\n\n-----\n\nWTS_SESSION_INFO structure\n\nused as the initial seed for string decryption\n\n### Initial enumeration\n\nBefore sending any outbound network requests, LOBSHOT builds a custom structure containing\nenumerated data from the machine including:\n\nGUID of machine derived from SOFTWARE\\Microsoft\\Cryptography\\MachineGuid\nWindows edition, username, computer name\nA VM check, number of processes running, process ID, parent process of malware\nWindows desktop object details\n\nScreen height/width\nDisplay device information\nHandles to the desktop objects and windows\nDPI for the display(s)\n\nMalware retrieving Windows desktop object information\n\n### Execution flow\n\nAfter LOBSHOT is executed, it moves a copy of itself to the C:\\ProgramData folder, spawning a\nnew process using explorer.exe, terminating the original process, and finally deleting the original\nfile. This design choice is used in an attempt to break the process tree ancestry; making it harder to\nspot for analysts.\n\n\n-----\n\nThe LOBSHOT process tree as observed with Elastic Defend\nBelow is a screenshot after the initial execution, the malware is now parentless and running from the\n**C:\\ProgramData directory.**\n\nLOBSHOT running without a parent\n\nprocess\n\n### Persistence\n\n[For persistence, LOBSHOT leverages the Registry run key persistence method. In our sample, this](https://attack.mitre.org/techniques/T1547/001/)\nis placed in the HKEY_CURRENT_USER Registry hive with a randomly generated name pointing to\nthe malware located in C:\\ProgramData.\n\nRegistry key persistence\nIn addition, it sets Registry key data under the Software\\Microsoft\\Windows\n**NT\\CurrentVersion\\Devices key path which is used to check for a hardcoded global identifier key**\nthat would indicate the system had already been infected. In our sample, the Display value is set to\nthe string 134a1160. The results from the stealer feature are recorded inside the Default Printer\nvalue. We'll discuss the stealer functionality in the next section.\n\n\n-----\n\nRegistry hive used to store data\n\n### Stealer functionality\n\nWith the persistence mechanism established, LOBSHOT starts a new thread kicking off the stealer\nfunctionality. It starts by targeting specific Google Chrome extensions that deal with cryptocurrency\nwallets. Below are Procmon outputs showing LOBSHOT trying to access 32 Chrome wallet\nextensions, nine Edge wallet extensions, and 11 Firefox wallet extensions.\n\nChrome extensions related to cryptocurrency wallets\n\nEdge extensions related to cryptocurrency wallets\n\nFirefox extensions related to cryptocurrency wallets\nFor the complete listing of the different cryptocurrencies mapped to their extension IDs, see the\n[appendix.](https://www.elastic.co/security-labs/Elastic-Security-Labs-discovers-LOBSHOT-malware#appendix)\n\n\n-----\n\nIf there is a match with any of these extensions, the results are inserted in the\n**Software\\Microsoft\\Windows NT\\CurrentVersion\\Devices Registry key value as binary data with**\nthe format of browser name_extension name. Below is an example after the registry modification\nshowing: Chrome_Yoroi.\n\nStealer\n\ncomponent writing found wallet to registry\nAfter the browser extensions are enumerated, there is a check for a hardcoded file titled hmr_*.dat\ninside the C:\\ProgramData directory. If this file exists it will be executed with rundll32.exe with the\nfollowing command-line arguments:\n\n**rundll32.exe \"C:\\ProgramData\\hmr_1.dat\", #1 hmod**\n\nWhile we didn’t observe this behavior directly, this function appears to show off a feature baked in by\nthe developer allowing the ability for additional execution options such as loading their own DLL.\n\n### Network communications\n\nFor each LOBSHOT sample we have reviewed, there is a hardcoded IP and port that is decrypted\nfrom the binary that is used as the primary C2. The malware beacons every 5 seconds\ncommunicating by using the following calls:\n\n**ws2_32.socket**\n**ws2_32.connect**\n**ws2_32.send**\n**ws2_32.select**\n**ws2_32.recv**\n**ws2_32.shutdown**\n**ws2_32.closesocket**\n\nOn these outbound requests, it sends pseudorandom hard-coded data along with a shortened GUID\nvalue and version number of the module.\n\n\n-----\n\nHardcoded values and version in\n\nrequest\nBelow is an example of the send request buffer sent during the initial outbound requests showing\nthe above-hardcoded values and version number.\n\nRequest buffer on\n\noutbound network traffic\n\nHardcoded\n\nvalues within outbound network traffic request\nSearching for the above mov instruction paired with the first DWORD of the hardcoded value (C7 06\n**25 56 0A DC) shows over 550 samples in VirusTotal within the last year. With some of the first**\nsamples showing up in late July 2022. The prevalence of these hardcoded values shows that it has\nbeen actively used and under development for a long period of time, and will likely continue to be\nused in the future.\n\nVirusTotal VTGrep search on hardcoded bytes\nAfter this initial handshake, LOBSHOT will send the previous custom data structure containing the\nenumerated data such as the hostname, username, windows objects, etc. over this port.\n\n\n-----\n\nThe Wireshark output of outbound requests containing victim host information\n\n### Capabilities\n\nOne of LOBSHOT’s core capabilities is around its hVNC (Hidden Virtual Network Computing)\nmodule.\n\nhVNC overview\n\nUnlike traditional VNC (Virtual Network Computing) where the software provides remote access to a\nmachine with the user’s consent and the visibility of the actions taken on the machine can be clearly\nobserved. hVNC acts in the opposite way designed to stay stealthy where all actions by an attacker\nare taking place on the same machine, but can’t be visibly observed by the victim. hVNC became a\npopular solution within the banking trojan space to bypass device and fraud detection solutions.\n[More details on hVNC can be found here.](https://deepsec.net/docs/Slides/2017/Who_Hid_My_Desktop_Or_Safran_Pavel_Asinovsky.pdf)\n\nLOBSHOT implements the hVNC feature by generating a hidden desktop using the\n**CreateDesktopW Windows API and then assigning the desktop to the malware using the**\n**SetThreadDesktop API. A new Windows explorer.exe process is then created under the context of**\nthe new hidden desktop.\n\n\n-----\n\nLOBSHOT’s hidden desktop creation\nAt this stage, the victim machine will start sending screen captures that represent the hidden\ndesktop that is sent to a listening client controlled by the attacker. The attacker interacts with the\nclient by controlling the keyboard, clicking buttons, and moving the mouse, these capabilities provide\nthe attacker full remote control of the device.\n\nWithin LOBSHOT’s hVNC module, there is a built-in GUI menu that allows the attacker to run the\nfollowing commands quickly:\n\nStart new explorer.exe process\nStart Windows Run command\nStart new Windows process with provided command\nStart Browsers (Internet Explorer, Edge, Firefox)\nTerminate existing explorer.exe processes and start new explorer.exe process\nTamper with Windows sound settings\nSet/retrieve Clipboard text\nActivate Start Menu\nModify DPI Awareness settings\n\nExecute the run dialog inside the hVNC module\n\n\n-----\n\nClipboard grabber inside the hVNC module\n\nCMD execution inside the hVNC module\nWhile the main functionality is centered on LOBSHOT’s hVNC module, it does have additional\ncapabilities. One example is its ability to swap out its C2 provided by an operator; it manages this by\nwriting the new C2 details into the registry key path Software\\Microsoft\\Windows\n**NT\\CurrentVersion\\Devices under the Video value.**\n\nUpdating C2 through registry modification\nLOBSHOT also includes an update mechanism where it will remove previous modifications to the\nregistry such as removing the “Display” value and Run key persistence, starting a new process, and\nfinally exiting the existing process.\n\nRemove existing registry key\n\n\n-----\n\nSpawn new LOBSHOT process\n\n## LOBSHOT configuration extractor\n\nElastic Security Labs has released an open source tool, under the Elastic 2.0 license, that will allow\n[for configurations to be extracted from LOBSHOT samples. The tool can be downloaded here.](https://github.com/elastic/labs-releases/tree/main/extractors/lobshot)\n\nThe extractor can run at the individual file or directory level, examples are below:\n\n**python lobshot_config_extractor.py --file sample.bin**\n**python lobshot_config_extractor.py --directory samples**\n\n## Summary\n\n\n-----\n\nThreat groups are continuing to leverage malvertising techniques to masquerade legitimate software\nwith backdoors like LOBSHOT. These kinds of malware seem small, but end up packing significant\nfunctionality which helps threat actors move quickly during the initial access stages with fully\ninteractive remote control capabilities. We are continuing to see new samples related to this family\neach week, and expect it to be around for some time.\n\n## Detection logic\n\n### Detection\n\n**EQL query**\n\nUsing the Timeline section of the Security Solution in Kibana under the “Correlation” tab, you can\nuse the below EQL queries to hunt for behaviors similar\n\nThe following EQL query can be used to detect suspicious grandparent, parent, child relationships\nobserved with LOBSHOT.\n```\nsequence by host.id, user.id with maxspan=1m\n [process where event.type == \"start\" and not startsWith~(process.executable,\nprocess.parent.executable)] by process.parent.name, process.entity_id\n [file where event.type == \"deletion\"] by file.name, process.entity_id\n [process where event.type == \"start\" and not startsWith~(process.executable,\nprocess.parent.executable)] by process.name, process.parent.entity_id\nuntil [process where event.type == \"end\"] by process.name, process.entity_id\n\n```\n**YARA rule**\n\n\n-----\n\n```\nrule Windows_Trojan_Lobshot {\n\n  meta:\n\n    author = \"Elastic Security\"\n\n    creation_date = \"2023-04-18\"\n\n    last_modified = \"2023-04-18\"\n\n    license = \"Elastic License v2\"\n\n    os = \"Windows\"\n\n    threat_name = \"Windows.Trojan.Lobshot\"\n\n    reference_sample =\n\"e4ea88887753a936eaf3361dcc00380b88b0c210dcbde24f8f7ce27991856bf6\"\n\n  strings:\n\n    $str0 = \"HVNC Remote Control\" ascii fullword\n\n    $str1 = \" Error # %d - %08lx\" ascii fullword\n\n    $str2 = \"Set clipboard text failed.\" ascii fullword\n\n    $str3 = \"OK %08lx %08lx %d\" ascii fullword\n\n    $str4 = \"\\\") & (rundll32.exe \\\"\" wide fullword\n\n    $str5 = \"%LOCALAPPDATA%\\\\svc.db\" wide fullword\n\n    $str6 = \"cmd.exe /c (ping -n 10 127.0.0.1) & (del /F /Q \\\"\" wide fullword\n\n    $seq_str_decrypt = { 8A 5A ?? 8D 52 ?? 80 EB ?? 85 FF 74 ?? C0 E0 ?? 2C ?? 0A C3 32\nC1 32 C7 88 06 32 E8 83 C6 ?? 83 C5 ?? EB ?? }\n\n    $seq_emu_check = { 8B 35 ?? ?? ?? ?? 8D 44 24 ?? 50 8D 44 24 ?? C7 44 24 ?? 48 41 4C\n39 50 C7 44 24 ?? 54 48 00 00 FF D6 }\n\n    $seq_enum_xor = { FF 15 ?? ?? ?? ?? 84 C0 0F 84 ?? ?? ?? ?? 83 7C 24 ?? 00 0F 84 ??\n?? ?? ?? 8B 4C 24 ?? 68 07 80 00 00 8B 41 ?? 8A 00 32 01 A2 ?? ?? ?? ?? }\n\n    $seq_create_guid = { 8D 48 ?? 80 F9 ?? 77 ?? 2C ?? C1 E2 ?? 46 0F B6 C8 0B D1 83 FE\n?? 7C ?? 5F 8B C2 5E C3 }\n\n  condition:\n\n    2 of ($seq*) or 5 of ($str*)\n\n}Weitere Informationen\n\n## Observed adversary tactics and techniques\n\n```\nElastic uses the MITRE ATT&CK framework to document common tactics, techniques, and\nprocedures that advanced persistent threats use against enterprise networks.\n\n## Observations\n\n[All observables are also available for download in both ECS and STIX format. Additionally, we have](https://github.com/elastic/labs-releases/tree/main/indicators/lobshot)\n[created a VirusTotal Collection with all indicators.](https://www.virustotal.com/gui/collection/abe7f5f8c49b387114e46957feb347af705d1d90733f4b26341e2e5299cbbf4c)\n\n**Indicator** **Type** **Reference**\n\n\n95.217.125.200 IP\nAddress\n\ne4ea88887753a936eaf3361dcc00380b88b0c210dcbde24f8f7ce27991856bf6 SHA256\n\n## Appendix\n\n### Chrome wallet extensions\n\n\nLOBSHOT\nC2\n\nLOBSHOT\n\n\n-----\n\n**Wallet nameWallet name** **Extension IDExtension ID**\n\nYoroi ffnbelfdoeiohenkjibnmadjiehjhajb\n\nTronLink ibnejdfjmmkpcnlpebklmnkoeoihofec\n\nNifty Wallet jbdaocneiiinmjbjlgalhcelgbejmnid\n\nMetaMask nkbihfbeogaeaoehlefnkodbefgpgknn\n\nMath Wallet afbcbjpbpfadlkmhmclhkeeodmamcflc\n\nCoinbase Wallet hnfanknocfeofbddgcijnmhnfnkdnaad\n\nBinance Wallet fhbohimaelbohpjbbldcngcnapndodjp\n\nBrave Wallet odbfpeeihdkbihmopkbjmoonfanlbfcl\n\nGuarda hpglfhgfnhbgpjdenjgmdgoeiappafln\n\nEqual Wallet blnieiiffboillknjnepogjhkgnoapac\n\nJaxx Liberty cjelfplplebdjjenllpjcblmjkfcffne\n\nBitApp Wallet fihkakfobkmkjojpchpfgcmhfjnmnfpi\n\niWallet kncchdigobghenbbaddojjnnaogfppfj\n\nWombat amkmjjmmflddogmhpjloimipbofnfjih\n\nOxygen fhilaheimglignddkjgofkcbgekhenbh\n\nMyEtherWallet nlbmnnijcnlegkjjpcfjclmcfggfefdm\n\nGuildWallet nanjmdknhkinifnkgdcggcfnhdaammmj\n\nSaturn Wallet nkddgncdjgjfcddamfgcmfnlhccnimig\n\nRonin Wallet fnjhmkhhmkbjkkabndcnnogagogbneec\n\nStation Wallet aiifbnbfobpmeekipheeijimdpnlpgpp\n\nHarmony fnnegphlobjdpkhecapkijjdkgcjhkib\n\nCoin98 Wallet aeachknmefphepccionboohckonoeemg\n\nEVER Wallet cgeeodpfagjceefieflmdfphplkenlfk\n\nKardiaChain Wallet pdadjkfkgcafgbceimcpbkalnfnepbnk\n\nPhantom bfnaelmomeimhlpmgjnjophhpkkoljpa\n\nPali Wallet mgffkfbidihjpoaomajlbgchddlicgpn\n\nBOLT X aodkkagnadcbobfpggfnjeongemjbjca\n\n\n-----\n\n**Wallet name** **Extension ID**\n\nLiquality Wallet kpfopkelmapcoipemfendmdcghnegimn\n\nXDEFI Wallet hmeobnfnfcmdkdcmlblgagmfpfboieaf\n\nNami lpfcbjknijpeeillifnkikgncikgfhdo\n\nMultiversX DeFi Wallet dngmlblcodfobpdpecaadgfbcggfjfnm\n\n### Edge wallet extensions\n\n**Wallet name** **Extension ID**\n\nYoroi akoiaibnepcedcplijmiamnaigbepmcb\n\nMetaMask ejbalbakoplchlghecdalmeeeajnimhm\n\nMath Wallet dfeccadlilpndjjohbjdblepmjeahlmm\n\nRonin Wallet kjmoohlgokccodicjjfebfomlbljgfhk\n\nStation Wallet ajkhoeiiokighlmdnlakpjfoobnjinie\n\nBDLT Wallet fplfipmamcjaknpgnipjeaeeidnjooao\n\nGlow niihfokdlimbddhfmngnplgfcgpmlido\n\nOneKey obffkkagpmohennipjokmpllocnlndac\n\nMetaWallet kfocnlddfahihoalinnfbnfmopjokmhl\n\n### Firefox wallet extensions\n\n**Wallet name** **Extension ID**\n\nYoroi {530f7c6c-6077-4703-8f71-cb368c663e35}.xpi\n\nRonin Wallet ronin-wallet@axieinfinity.com.xpi\n\nMetaMask webextension@metamask.io.xpi\n\nTronLink {5799d9b6-8343-4c26-9ab6-5d2ad39884ce}.xpi\n\n{aa812bee-9e92-48ba-9570-5faf0cfe2578}.xpi\n\n{59ea5f29-6ea9-40b5-83cd-937249b001e1}.xpi\n\n{d8ddfc2a-97d9-4c60-8b53-5edd299b6674}.xpi\n\nPhantom {7c42eea1-b3e4-4be4-a56f-82a5852b12dc}.xpi\n\n{b3e96b5f-b5bf-8b48-846b-52f430365e80}.xpi\n\n\n-----\n\n**Wallet name** **Extension ID**\n\n{eb1fb57b-ca3d-4624-a841-728fdb28455f}.xpi\n\n{76596e30-ecdb-477a-91fd-c08f2018df1a}.xpi\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-25 - Elastic Security Labs discovers the LOBSHOT malware.pdf"
    ],
    "report_names": [
        "2023-04-25 - Elastic Security Labs discovers the LOBSHOT malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338931,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1683252423,
    "ts_modification_date": 1683252423,
    "files": {
        "pdf": "https://archive.orkl.eu/6009f928d0e156916b657bdeb90f859fdc879af4.pdf",
        "text": "https://archive.orkl.eu/6009f928d0e156916b657bdeb90f859fdc879af4.txt",
        "img": "https://archive.orkl.eu/6009f928d0e156916b657bdeb90f859fdc879af4.jpg"
    }
}