{
    "id": "6473d6d9-1c12-4bdf-9ade-c1ef0b0815fc",
    "created_at": "2023-01-12T15:01:59.512798Z",
    "updated_at": "2025-03-27T02:06:00.261459Z",
    "deleted_at": null,
    "sha1_hash": "8fa8786fa6cbed5e51f5e5a3675b8ccedbb62699",
    "title": "2021-03-15 - Conficker - One of the Most Prevalent & Complex Windows Worms",
    "authors": "",
    "file_creation_date": "2022-05-28T02:35:15Z",
    "file_modification_date": "2022-05-28T02:35:15Z",
    "file_size": 312445,
    "plain_text": "# Conficker - One of the Most Prevalent & Complex Windows Worms [MiniTool Tips]\n\n**minitool.com/backup-tips/conficker-worm.html**\n\nHelen March 12, 2021\n\n### Summary :\n\nThis article written by [MiniTool Tech reviews one of the world’s most infectious and](https://www.minitool.com/)\nsophisticated computer viruses – Conficker. It elaborates on its definition, history, impact,\npropagation mechanism, as well as the way to avoid being infected with Conficker, almost\neverything you want to know about the malware (Wiki -level)!\n\n### What Is Conficker?\n\nConficker, also called Downadup, Downup, or Kido, is a kind of computer virus attacking the\nWindows operating system (OS). It makes use of vulnerabilities of system programs and\ndictionary attacks on administrator passwords to spread while forming a botnet.\n\nIt is usually difficult to counter victims for Conficker uses multiple advanced virus\ntechnologies. Conficker worms attacked millions of computers including home personal\nPCs, business machines, and government devices in more than 190 countries. It becomes\nthe largest known computer worm infection since Welchia in 2003. Conficker was first\ndetected in November 2008.\n\n\n-----\n\n**Tip: Welchia, also called the Nachi worm, is a computer malware that exploits a flaw in the**\nMicrosoft [remote procedure call (RPC) service.](https://www.minitool.com/news/remote-procedure-call-failed.html)\nAlthough Conficker propagated widely, it didn’t cause much damage. The reason is that\nmaybe its designer didn’t dare to use it for the virus drew much attention worldwide.\nConficker doesn’t destroy or steal data. The main purpose of it is to infect as many Windows\ncomputers as possible, which makes it the most infectious computer virus.\n\n## How Does “Conficker” Come From?\n\nThe name of the Conficker virus is said to be originated from the English word “configure”\nand the German word “ficker” (means “fucker” in English). However, Joshua Phillips, a\nMicrosoft analyst, offers another interpretation of the name “conficker”. Joshua states that\n[“conficker” is a rearrangement of portions of the domain name trafficconverter.biz, which was](https://www.minitool.com/lib/full-qualified-domain-name.html)\nused by early Conficker versions to download updates. The letter “k”, which isn’t found in the\ndomain name, is added to avoid a “soft” c sound.\n\n## Impacts of Conficker\n\nThe British Ministry of Defence reported that some of its major systems and computers were\ninfected. Conficker had spread across administrative offices, NavyStar/N* desktops on\nvarious Royal Navy submarines & warships. And, it was reported that over 800 machines\nwere infected across the city of Sheffield.\n\n\n-----\n\nIntramar, a French Navy computer network, was infected with Conficker on January 15,\n2009. It was quarantined subsequently, which resulted in aircraft in several airbases being\ngrounded for their flight plans couldn’t be downloaded.\n\nOn February 2, 2009, the Bundeswehr, the unified armed forces of Germany, reported\naround 100 infected computers. In the same month, the infection of the IT system of\n[Manchester caused about 1.5 million pounds of financial loss. A USB flash drive was](https://www.minitool.com/lib/usb-flash-drive.html)\nbelieved to be the initial source of Conficker, so the usage of USB was banned then.\n\nOn March 24, 2009, the memo of the UK Parliamentary ICT service informed the users of the\nHouse of Commons that it (the service) had been infected with Conficker. The memo was\nfrom the director of the service and was leaked subsequently. It called for users to avoid\nconnecting any unauthorized equipment to the network.\n\nIn January 2010, the Greater Manchester Police computer network was infected. This\ncaused the police computer network to be disconnected from the Police National Computer\nfor 3 days, as a precautionary action. During the three days, police officers had to ask other\nforces to run routine checks on people and vehicles.\n\n[[Review] What Is the ILOVEYOU Virus & Tips to Avoid Virus](https://www.minitool.com/backup-tips/iloveyou-virus.html)\nWhat’s ILOVEYOU virus? What did it do? When did it start and how did it stop? Who created\nit and in what language was it created? Find all answers here!\n\n[Read More](https://www.minitool.com/backup-tips/iloveyou-virus.html)\n\n\n-----\n\n## What Does the Conficker Virus Do?\n\nThough almost all of the advanced virus technologies adopted by Conficker have been seen\nin past viruses and are well known to researchers, the combination of so many made\nConficker extremely difficult to clear. Also, the developers of Conficker were tracking antivirus actions from network operators. Thus, they released new versions to patch the\nmalware’s own flaws.\n\nThere were 5 variants of Conficker and they are named Conficker A, Conficker B, Conficker\nC, Conficker D, and Conficker E. Those five versions were first detected respectively on\nNovember 21, 2008; December 29, 2008; February 20, 2009; March 4, 2009; and April 7,\n2009.\n\nThe Conficker working group uses namings of A, B, B++, C, and E for the same version\nrespectively. That is to say, (MSFT) C is equivalent to (CWG) B++ and (MSFT) D is\nequivalent to (CWG) C. The names used in this article are based on the MSFT (Microsoft).\n\n### Conficker Infection\n\n[Version A, B, C, and E use MS08-067 flaw in Server service (NetBIOS), in which an already-](https://www.minitool.com/lib/netbios.html)\n[infected source machine uses a specially-crafted RPC request to force a buffer overflow and](https://www.partitionwizard.com/clone-disk/system-detected-stack-based-buffer-overrun.html)\nexecute shellcode on the target computer.\n\nOn the source computer, Conficker malware runs an HTTP (Hypertext Transfer Protocol)\nserver on a port between 10000 and 1024. The target shellcode connects back to the HTTP\n[server to download a copy of the malware in DLL form, which then attaches to](https://www.minitool.com/data-recovery/missing-dll-files.html) [svchost.exe.](https://www.minitool.com/lib/svchost-exe.html)\nConficker B and later may also attach to a running Windows Explorer process. Yet, attaching\nto those processes might be discovered by the trust feature of an installed firewall.\n\n\n-----\n\n[Windows Utility Used by Malware! It Is a Big Problem!](https://www.minitool.com/news/windows-utility-used-by-malware.html)\nWindows utility used by malware? It is true. To know more information about this situation,\nyou can read this post.\n\n[Read More](https://www.minitool.com/news/windows-utility-used-by-malware.html)\nWhile Variant B and C also make use of removable media by creating DLL-based AutoRun\n[trojan on attached removable devices for propagation. They can remotely execute copies of](https://www.minitool.com/backup-tips/trojan-virus-removal.html)\nthemselves via the administrative share on computers visible over NetBIOS. If the share is\nprotected by a password, a dictionary attack is attempted, potentially generating large\namounts of network traffic and tripping user account lockout policies.\n\nB and C variants place a copy of their DLL form in the recycle bin of any attached removable\ndrives, from which they can then infect new hosts via the Windows AutoRun mechanism\nusing a manipulated autorun.inf.\n\nTo start itself at system boot, Conficker saves a copy of its DLL form to a random filename in\n[the Windows system or system32 folder and adds registry keys to let svchost.exe invoke that](https://www.minitool.com/lib/system-32.html)\nDLL as an invisible network service.\n\n**Tip: Conficker is also known as win32 Conficker.**\n\n### Conficker Propagation\n\nConficker has a few mechanisms to pull or push executable payloads over the network.\nThose payloads are used by Conficker to update itself to newer versions and install\nadditional viruses.\n\n\n-----\n\nVersion A generates a list of 250 domain names each day across 5 TLDs (Top-Level\nDomain). The domain names are generated from a PRNG (Pseudo-Random Number\nGenerator) seeded with the current date to ensure that each copy of the worm generates the\nsame names every day. Then, Conficker attempts an HTTP connection to each domain\nname in turn, expecting from any of them a signed payload.\n\nWhile, Version B increases the number of TLDs to 8 and has a generator tweaked to\nproduce domain names different from those of A. To counter Conficker’s usage of\npseudorandom domain names, ICANN (Internet Corporation for Assigned Names and\nNumbers) and some TLD registries began a coordinated barring of transfers and\nregistrations for those domains in February 2009.\n\nWhile, Version D counters pseudorandom domain names by generating daily a pool of 50\nthousand domains across 110 TLDs, from which it randomly selects 500 to attempt for that\nday. The generated domain names were also shortened from 8 – 11 to 4 – 9 characters to\nmake them more difficult to detect with heuristics.\n\n[The Different Types of Malware and Useful Tips to Avoid Them](https://www.minitool.com/backup-tips/types-of-malware.html)\nMalware is one of the biggest threats on the Internet. This post provides information about\ndifferent types of malware and you can know how to avoid them.\n\n[Read More](https://www.minitool.com/backup-tips/types-of-malware.html)\nThe new pull mechanism is unlikely to spread payloads to more than 1% of infected\ncomputers each day. Yet, it is expected to function as a seeding mechanism for Conficker’s\npeer-to-peer (P2P) network. The shortened generated names are expected to collide with\n\n\n-----\n\n150 – 200 existing domains each day, potentially resulting in a DDoS (Distributed Denial-ofservice) attack on websites serving those domains. Yet, the large number of generated\ndomains and the fact that not every domain will be contacted for a given day will probably\nprevent DDoS situations.\n\nB, C, and E versions perform in-memory patches to NetBIOS-related DLLs to close MS08067 and open reinfection backdoor in Server service via the same flaw. Variant C also\ncreates a named pipe, over which it can push URLs for downloadable payloads to other\ninfected computers on a LAN.\n\nBesides, Variant D and Variant E also use a custom protocol to scan for infected peers via\n[UDP (peer-to-peer mechanism) and then transfer via TCP.](https://www.minitool.com/lib/user-datagram-protocol.html)\n\n### Conficker Self-Defense\n\nBesides the wonderful infection and propagation mechanisms, Conficker also has advanced\n[self-protecting systems. Its Version B, C, D, and E can block certain DNS lookups and](https://www.minitool.com/lib/what-is-dynamic-dns.html)\ndisable AutoUpdate. Especially, Variant D does an in-memory patch of DNSAPI.DLL to block\nlookups of anti-malware-related sites.\n\n[[Answered] Is Vimm’s Lair Safe? How to Use Vimm’s Lair Safely?](https://www.minitool.com/backup-tips/is-vimms-lair-safe.html)\nIs Vimm’s Lair safe to use and download old video game ROMs, emulators, or manuals?\nWhat websites are Vimm.net alternatives? How to keep safe while using Vimm?\n\n[Read More](https://www.minitool.com/backup-tips/is-vimms-lair-safe.html)\n\n\n-----\n\n[Version D of Conficker also disables Safe Mode. Together with version E, version D also kills](https://www.minitool.com/lib/safe-mode.html)\nanti-malware by scanning for and terminating processes with names of anti-malware, patch,\nor diagnostic tools at one-second intervals.\n\nMoreover, each version of Conficker ends up updating itself to the next version or higher\nversions. Especially, the final version of Conficker, version E, also downloads and installs\nmalware payload, Waledac spambot and SpyProtect 2009 scareware.\n\n## Conficker Today\n\nThough it has been over ten years since Conficker appeared and Conficker has dropped out\nof people’s attention, every year, there are still thousands of computers infected by it.\nThough Conficker won't cause data loss to victims, it does increase the network payload of\nthem greatly. Thus, the infected computers will experience slow network performance and it\nwill influence the usage of them.\n\n### How to Avoid Conficker?\n\n1. Update Windows\n2. Scan for USB and shares\n3. Disable AutoRun and AutoPlay\n4. Enable firewall and antivirus\n\n## How to Avoid Being Infected with Conficker?\n\nSince Conficker still brings inconvenience to you if your computer is infected by it, you’d\nbetter not get attacked by it. Then, how to protect yourself from being infected by Conficker?\nBelow suggestions are listed for your reference.\n\n### #1 Get Your System Patched Immediately\n\nIf you are still using an old OS that is vulnerable to virus Conficker, the most urgent thing is to\nupdate Windows better to its newest version. Therefore, you have shut down the backdoor\nfor the malware.\n\nHow to determine whether your system is vulnerable to Conficker or not? Generally, if you\nare using Windows 7 or later edition, you are safe from Conficker. If you are running a\nsystem earlier than Windows 7, especially with MS08-067 network service, you are probably\nto be infected by Conficker. Just update your OS will solve the problem!\n\n\n-----\n\n[Secure Computer by Avast Virus Chest & MiniTool ShadowMaker](https://www.minitool.com/backup-tips/avast-virus-chest.html)\nWhat’s Avast Virus Chest? How to check/view Avast Virus Chest? How to restore files from\nAvast Virus Chest? How to delete a file from Avast Virus Chest?\n\n[Read More](https://www.minitool.com/backup-tips/avast-virus-chest.html)\n\n### #2 Be Careful When Connect to USB or Open Shared Files\n\nSince one of the spreading ways of Conficker is through USB flash media or shares, you are\nstrongly recommended to pay attention to the removable devices you are going to connected\nto your computer and shared files (you received) you are going to open, especially the\nunauthorized devices and shares from strangers.\n\nWhat should you do? Never use a USB or open a shared file? No! You can still use USB and\nshares since they are unavoidable nowadays. The thing you need to do is to take a security\nscan on the target USB drive or share with Conficker detection tool, Conficker removal\n**tool, or Conficker scanner like** [Sophos Intercept X Endpoint.](https://www.sophos.com/en-us/products/endpoint-antivirus.aspx?utm_source=sophos.com&utm_medium=display&utm_campaign=conficker-worm)\n\n### #3 Turn off Autorun for USB\n\nSome of you may argue that once you insert a removable drive into your computer, it will be\nopened automatically without your permission. Thus, you don’t have a chance to scan it for\n[viruses. In such a situation, you should turn off the autorun service of your system for](https://support.microsoft.com/en-us/topic/how-to-disable-the-autorun-functionality-in-windows-8e5ff0da-c526-7624-c064-ff82aecfd145)\nexternal media like USB.\n\n\n-----\n\nWhen you successfully disable the AutoRun or AutoPaly functionality, next time when you\nconnect a USB to the machine, it will ask you before open and run it on the host.\n\n### #4 Monitor OS with Firewall and Antivirus\n\nProtecting your computer from viruses, malware, worm, trojan, spyware, etc. is a lifetime\ntask. No one can do it manually or alone. Therefore, it is recommended to rely on a firewall\nand antimalware to give complete and continuous protection to your computer.\n\nThere are also some other methods to prevent yourself from Conficker like setting a strong\nnetwork password, applying a device control policy…\n\nClick to tweet\n\n## How to Prepare Yourself for Future Infection?\n\nAs far as this article was written, no version of Conficker causes data loss to its infected\ncomputers. Yet, no one can guarantee that there is also no data loss caused by Conficker. It\nmay update itself and start to destroy victims’ files in the future as most modern computer\nmalware do. If so, what can we do for the preparation of the possible damage?\n\nOur purpose is to avoid losing data. If we can’t avoid being infected by Conficker or other\nviruses for 100%, then, we can at least create more copies of our important files and save\nthem in various places. Thus, even if one or two locations are attacked, we can still have the\nrest and keep our normal work. Then, how to quickly make copies of files in a reasonable\nmanner?\n\nUsually, if you want to back up crucial files in a reasonable way, you’d better ask for help\n[from professional and reliable software, such as MiniTool ShadowMaker. It is specially](https://www.minitool.com/backup/shadowmaker-pro.html)\ndesigned for backing up and restoring files, systems, hard disks, partitions/volumes, and so\non. Let’s see how it works.\n\nStep 1. Download and install MiniTool ShadowMaker on your computer.\n\n_[Free Download](https://cdn2.minitool.com/?p=sm&e=sm-pro)_\n\nStep 2. Launch the program and click Keep Trial to try its wonderful features.\n\nStep 3. In its main interface, click Backup in the upper menu.\n\nStep 4. In the Backup screen, click the Source module to select the items you plan to back\nup on your machine.\n\nStep 5. Then, click the Destination module to specify where to save the backup image.\nExternal storage place is recommended. Also, note that the target storage location will be\noverwritten.\n\n\n-----\n\nStep 6. Check the backup task. If you’d like to back up those source files regularly, just set a\n[scheduled backup for them by clicking the Schedule button. Finally, confirm the task by](https://www.minitool.com/help-sm/backup.html#schedule-setting)\nclicking the Back up Now button in the lower right.\n\nThe backup task will start after another confirmation. Then, just wait for the success of the\nprocedure. Once finished, just exit the application.\n\nOk, the above is all about the Conficker worm I’d like to share in this article. If you want to\nread more related information, just search on this website. If you have anything about\nConficker to discuss, just use the below comment section. Or, if you encounter any problem\nwhile using MiniTool ShadowMaker, feel free to contact [[email protected].](https://www.minitool.com/cdn-cgi/l/email-protection#ec9f999c9c839e98ac8185828598838380c28f8381)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-15 - Conficker - One of the Most Prevalent & Complex Windows Worms.pdf"
    ],
    "report_names": [
        "2021-03-15 - Conficker - One of the Most Prevalent & Complex Windows Worms.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535719,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653705315,
    "ts_modification_date": 1653705315,
    "files": {
        "pdf": "https://archive.orkl.eu/8fa8786fa6cbed5e51f5e5a3675b8ccedbb62699.pdf",
        "text": "https://archive.orkl.eu/8fa8786fa6cbed5e51f5e5a3675b8ccedbb62699.txt",
        "img": "https://archive.orkl.eu/8fa8786fa6cbed5e51f5e5a3675b8ccedbb62699.jpg"
    }
}