{
    "id": "6479e4bd-81d2-4084-8d9c-f19182ca731f",
    "created_at": "2023-01-12T15:08:04.817758Z",
    "updated_at": "2025-03-27T02:17:05.566281Z",
    "deleted_at": null,
    "sha1_hash": "fbb77460526132f98c57cd635e7cdba9bcafe3fa",
    "title": "2022-02-28 - Cyber threat activity in Ukraine- analysis and resources",
    "authors": "",
    "file_creation_date": "2022-08-18T03:29:51Z",
    "file_modification_date": "2022-08-18T03:29:51Z",
    "file_size": 226733,
    "plain_text": "# Cyber threat activity in Ukraine: analysis and resources\n\n**[msrc-blog.microsoft.com/2022/02/28/analysis-resources-cyber-threat-activity-ukraine/](https://msrc-blog.microsoft.com/2022/02/28/analysis-resources-cyber-threat-activity-ukraine/)**\n\n**UPDATE 27 Apr 2022: See** **_Updated malware details and Microsoft security product_**\n**_[detections below as discussed in the Special Report: Ukraine.](https://blogs.microsoft.com/on-the-issues/?p=65157)_**\n\n**UPDATE 02 MAR 2022: See** **_Updated malware details and Microsoft security product_**\n**_detections below for additional insights and protections specific to the evolving threats we_**\nhave identified impacting organizations with ties to Ukraine.\n\nMicrosoft has been monitoring escalating cyber activity in Ukraine and has published\nanalysis on observed activity in order to give organizations the latest intelligence to guide\ninvestigations into potential attacks and information to implement proactive protections\nagainst future attempts.\n\nWe’ve brought together all our analysis and guidance for customers who may be impacted\nby events in Ukraine into this single location for ease of consumption, all of which is linked\nbelow. In this blog, we’ve also included general security guidance for organizations to build\ncyber resilience. As the situation in the region develops, we will continue to publish new\ninsights and add to this set of resources.\n\nMicrosoft has been notifying customers in Ukraine of activity, where possible, and closely\ncoordinating with the government in Ukraine. This support is ongoing.\n\nWe have also summarized information about what we are doing around protecting\norganizations in Ukraine from cyberattacks; protecting against state-sponsored\ndisinformation campaigns; supporting humanitarian assistance; and protecting our\n[employees: Digital technology and the war in Ukraine.](https://blogs.microsoft.com/on-the-issues/2022/02/28/ukraine-russia-digital-war-cyberattacks/)\n\n**Published Microsoft analysis of malicious activity in Ukraine**\n\n_Phishing attacks on Ukrainian soldiers:_\n\nFebruary 25, 2022 | RiskIQ: UNC1151/GhostWriter Phishing Attacks Target Ukrainian\nSoldiers\n\n_Recent disk wiping attacks:_\n\n[February 24, 2022 | RiskIQ: HermeticWiper Compromised Server Used in Attack Chain](https://community.riskiq.com/article/9f59cb85)\n\n_Advanced threat actor ACTINIUM which has consistently pursued access to organizations in_\n_Ukraine or entities related to Ukraine affairs:_\n\n\n-----\n\nFebruary 4, 2022 | Microsoft Security Blog: [ACTINIUM targets Ukrainian organizations](https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations/)\nFebruary 4, 2022 | RiskIQ threat intelligence article: ACTINIUM targets Ukrainian\norganizations\nFebruary 4, 2022 | Microsoft Threat Analytics article (requires a license): Threat\nInsights: ACTINIUM targets Ukrainian organizations\n\n_Destructive malware operation and malware family known as WhisperGate targeting multiple_\n_organizations in Ukraine:_\n\nJanuary 15, 2022 | Microsoft on the Issues Blog: Malware attacks targeting Ukraine\ngovernment\nJanuary 15, 2022 | Microsoft Security Blog: Destructive malware targeting Ukrainian\norganizations\nJanuary 15, 2022 | RiskIQ threat intelligence article: Destructive malware targeting\nUkrainian organizations\n\nOSINT (open source intelligence) articles around activity in Ukraine are published regularly\ninto the RiskIQ Community. The full list is available here: RiskIQ Community articles on\nUkraine activity.\n\n**Security guidelines and recommendations**\n\nWe recommend that customers review their security posture and implement best practices to\nbuild resilience against today’s threats. Below are recommendations and links to resources:\n\n1. Cybersecurity hygiene: Organizations should harden all systems by following basic\n\nprinciples of cyber hygiene to proactively protect against potential threats. Microsoft\nrecommends taking the following steps:\n\nEnable multifactor authentication\nApply least privilege access and secure the most sensitive and privileged\ncredentials\nReview all authentication activity for remote access infrastructure\nSecure and manage systems with up-to-date patching\nUse anti-malware and workload protection tools\nIsolate legacy systems\nEnable logging of key functions\nValidate your backups\nVerify your cyber incident response plans are up to date\n\n2. Microsoft Security Best Practices: Microsoft customers can follow best practices that\n\nprovide clear actionable guidance for security related decisions. These are designed to\nimprove your security posture and reduce risk whether your environment is cloud-only,\nor a hybrid enterprise spanning cloud(s) and on-premises data centers: Microsoft\nSecurity Best Practices\n\n\n-----\n\n3. Protect against ransomware and extortion: Human-operated ransomware attacks\n\ncan be catastrophic to business operations and are difficult to clean up, requiring\ncomplete adversary eviction to protect against future attacks. Follow our ransomware\nspecific technical guidance to help prepare for an attack, limit the scope of damage,\n[and remove additional risks: Human-operated ransomware](https://docs.microsoft.com/en-us/security/compass/human-operated-ransomware)\n\n## Updated malware details and Microsoft security product detections\n\nFor customers utilizing Microsoft security products, we continue to build and release\nprotections for the evolving threats we have identified impacting organizations with ties to\nUkraine. As noted in the published analysis above, there are multiple actors using a variety\nof tools and techniques in this dynamic threat landscape. Some of these threats are\nassessed to be more closely tied to nation-state interests, while others seem to be more\nopportunistically attempting to take advantage of events surrounding the conflict. We have\nobserved attacks reusing components of known malware that are frequently covered by\nexisting detections, while others have used customized malware for which Microsoft has built\nnew comprehensive protections.\n\n## Destructive wiper attacks\n\n[Beginning with WhisperGate, Microsoft continues to observe destructive malware attacks](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\nimpacting organizations in Ukraine. These attacks are often the final stage to intrusions that,\nin some cases, may have predated the current military actions in Ukraine. We assess that\nthe intended objective of these attacks is the disruption, degradation, and destruction of\ntargeted resources. The Microsoft Threat Intelligence Center (MSTIC) assesses that\norganizations within Ukraine continue to be at high-risk for destructive operations for the\nforeseeable future.\n\nMicrosoft Defender Antivirus provides detections for the wiper attacks in build\nversion 1.363.797.0 or newer. Customers utilizing automatic updates do not need to take\nadditional action. Enterprise customers managing updates should select the detection\nbuild 1.363.797.0 or newer and deploy it across their environments.\n\nThe following is a list of high-level activities and the related malware that Microsoft has\nidentified and is protecting customers against:\n\n**WhisperGate**\n\n[Limited-scope destructive malware attack on January 13, 2022 impacting dozens of systems](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\nspanning multiple government, non-profit, and information technology organizations, all\nbased in Ukraine. MSTIC tracks the actor responsible for this attack as DEV-0586 and has\nnot linked it to a previously known activity group. We assess that DEV-0586 continues to be\nactive in Ukraine but is also targeting other countries within the region.\n\n\n-----\n\n**FoxBlade and SonicVote**\n\nDestructive malware attack originally discovered on February 23, 2022 impacting hundreds\nof systems spanning multiple government, information technology, financial sector, and\nenergy organizations predominately located in or with nexus to Ukraine. MSTIC has\nattributed events associated with FoxBlade with medium confidence to IRIDIUM (previously\ntracked as DEV-0665). Microsoft assesses there will be a continued risk for destructive\nactivity from this group, as we have observed follow-on intrusions since February 23\ninvolving these malicious capabilities. Microsoft is tracking the following malware families\nrelated to this activity:\n\nFoxBlade (aka HermeticWiper / HermeticWizard)\nSonicVote (aka HermeticRansom)\n\nIRIDIUM has also periodically leveraged a renamed version of the SysInternals utility sdelete\n(renamed by IRIDIUM to cdel.exe) to perform targeted secure deletion of areas of the file\nsystem using the following command-line pattern:\n```\nc:\\Windows\\System32\\cmd.exe /C C:\\Windows\\cdel.exe -accepteula -r -s -q\nc:\\Users & C:\\Windows\\cdel.exe -accepteula -r -s -q c:\\ProgramData\n\n```\n**Lasainraw (aka IsaacWiper)**\n\nLimited destructive malware attack originally [identified by ESET on February 25, 2022.](https://www.welivesecurity.com/2022/03/01/isaacwiper-hermeticwizard-wiper-worm-targeting-ukraine/)\nMicrosoft continues to investigate this incident and has not currently linked it to attributed\nthreat actors.\n\n**DesertBlade**\n\nLimited destructive malware attack in early March 2022 impacting a single Ukrainian entity.\nSimilar to other destructive capabilities, DesertBlade, which is implemented in Golang, was\ndeployed via hijacked Group Policy Objects (GPOs). DesertBlade is responsible for\niteratively overwriting and then deleting overwritten files on all accessible drives (sparing the\nsystem if it is a domain controller). Due to the nature of the investigation and partnerships\ninvolved, Microsoft is currently not able to share samples of DesertBlade. However, we can\nshare the following hashes as examples of the DesertBlade family:\n\na71c8306b6b8a89c18dea3b1490037593737d59b023000f24da94e3275600b59\n4ca63406ff189301ccbb54daa6e2da4bc5d03ffc1a8a9756717d95d26abc3906\n\nThe following Yara rule can be used to detect DesertBlade using these hashes:\n```\nrule DesertBlade\n{\n  meta:\n\n```\n\n-----\n\n```\n    author = Microsoft Threat Intelligence Center (MSTIC) \n    description = \"Detects Golang package, function, and source file\nnames observed in DesertBlade samples\"\n    hash =\n\"a71c8306b6b8a89c18dea3b1490037593737d59b023000f24da94e3275600b59\"\n  strings:\n    $s1 = \"main.wipe\\x00\\x00\"\n    $s2 = \"main.getRandomByte\\x00\\x00\"\n    $s3 = \"main.drives\\x00\\x00\"\n    $s4 = \"main.main.func3\\x00\\x00\"\n    $s5 = \"walk.volumeNameLen\\x00\\x00\"\n    $s6 = \"windows.GetLogicalDriveStrings\\x00\\x00\"\n    $s7 = \"api.ExplicitAccess\\x00\\x00\"\n    $s8 = \"go-acl.GrantSid\\x00\\x00\"\n    $s9 = \"/src/w/w.go\\x00\\x00\"\n  condition:\n    uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550 and\n    filesize < 5MB and filesize > 1MB and\n    all of ($s*)\n}\n\n```\n**FiberLake (aka DoubleZero)**\n\nOn March 22, 2022 CERT-UA published details on a .NET capability being used in\ndestructive attacks tracked by Microsoft as FiberLake (aka DoubleZero). Microsoft has\nobserved FiberLake being used in attacks targeting Ukraine broadcast/media organizations.\nMicrosoft is continuing to investigate this incident and has not currently linked it to known\nthreat activity.\n\n**CaddyWiper and AprilAxe (aka ARGUEPATCH)**\n\nCaddyWiper was first discovered by ESET on March 14, 2022 and has been observed by\nMicrosoft impacting a limited number of organizations in targeted attacks. CaddyWiper is a\ndestructive capability that results in file and drive overwriting, rendering compromised\nsystems unbootable. On April 1, 2022, Microsoft identified a new variant that involved a\nmulti-stage loading process.\n\nIn this new variant, the threat actor leveraged a backdoored IDA debugger server\nexecutable, which Microsoft has named AprilAxe. AprilAxe is designed to de-obfuscate and\nload malicious code from disk. In all observed intrusions, the loader is paired with a variant of\nCaddyWiper. Microsoft has observed multiple impacted organizations across government,\n[natural resources, banking, and energy organizations. ESET published technical details on](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nthis new version of CaddyWiper/ARGUEPATCH. In line with ESET, MSTIC also attributes the\nintrusion activity and capabilities to IRIDIUM.\n\n**Industroyer B (aka Industroyer2)**\n\n\n-----\n\nOn April 8, 2022, Microsoft observed AprilAxe and CaddyWiper being staged to target an\nenergy organization in Ukraine. During this intrusion, the actors also deployed a malicious\nICS/SCADA utility named Industroyer 2, which is capable of interacting with industrial control\nsystems. [CERT-UA and](https://cert.gov.ua/article/39518) [ESET published additional technical details on this capability. In line](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nwith ESET, MSTIC attributes this intrusion activity and capability to IRIDIUM.\n\n**Related protections**\n\nCustomers are encouraged to turn on [cloud-delivered protection and](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/enable-cloud-protection-microsoft-defender-antivirus) automatic sample\nsubmission in Microsoft Defender Antivirus. These capabilities use artificial intelligence and\nmachine learning to quickly identify and stop new and unknown threats. As we continue to\ninvestigate these attacks and uncover new data, we will add or update protections.\n\nMicrosoft Defender Antivirus and Microsoft Defender for Endpoint customers should look for\nthe following family names for activity related to the wiper attacks:\n\nWhisperGate\nFoxBlade\nLasainraw\nSonicVote\nCaddyWiper\nAprilAxe\nFiberLake\nIndustroyer\nDesertBlade\n\nThe observed wiper attacks can be further limited through additional hardening\nconfigurations. When enabled, these features bring more resilience to customer defenses in\naddition to defending against these specific wiper attacks:\n\n[Tamper protection prevents common techniques observed to disable security](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection)\nprotections on endpoints.\n[Controlled folder access allows only trusted apps to access protected folders. It is](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-controlled-folders)\ntypically effective at blocking these wiper attacks.\n\n**Unattributed threat activity**\n\nAs part of continued efforts by the MSTIC and Microsoft 365 Defender Research teams to\nidentify threat activity and protect organizations, we continue to discover unattributed threat\nactivity. We will continue to analyze activity and build detections for these threats as they are\nidentified.\n\n\n-----\n\nAs with any observed nation-state actor activity, where possible, Microsoft directly and\nproactively notifies customers that have been targeted or compromised, providing them with\ninformation they need to help guide their investigations. MSTIC is also actively working with\nmembers of the global security community and other strategic partners to share information\nthat can help address this evolving threat through multiple channels. Microsoft uses DEV#### designations as a temporary name given to an unknown, emerging, or a developing\ncluster of threat activity, allowing MSTIC to track it as a unique set of information until we\nreach a high confidence about the origin or identity of the actor behind the activity.\n\n**Common secondary intrusion behaviors**\n\nMany of the observed attacks have made use of known malware and intrusion tactics,\ntechniques, and procedures (TTPs) that are detected by Microsoft Defender for Endpoint\nusing these common alerts:\n\nSuspicious remote activity\nSuspicious access to LSASS service\nMicrosoft Defender Antivirus tampering\nSuspicious remote activity\n\nCustomers who see incidents that tie one or more of these indicators together should\nprioritize investigation of the affected devices.\n\n**Opportunistic phishing campaigns**\n\nTaking advantage of interest in the geopolitical conflict, attackers have been observed using\ntailored domains in phishing attacks. Microsoft SmartScreen and the network protection\nfeature in Microsoft Defender for Endpoint provide protections for customers lured to these\ndomains, including, but not limited to, the following:\n\nhelp-for-ukraine[.]eu\ntokenukraine[.]com\nukrainesolidarity[.]org\nukraine-solidarity[.]com\nsaveukraine[.]today\nsupportukraine[.]today\n\n**Hunting for related attacks**\n\nMicrosoft Sentinel and Microsoft Defender for Endpoint customers can hunt for related\nactivity through the queries below:\n\n**Microsoft Sentinel**\n\n\n-----\n\nMicrosoft Sentinel offers detection and threat hunting analytics for techniques observed in\nrelation to these threats. These analytics can be found in the Microsoft Sentinel portal or via\nthe Microsoft Sentinel GitHub.\n\nCrash dump disabled on host\n\nThis query looks for registry keys being set on a host in order to prevent crash dumps being\ncreated.\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Hunting%20Queries/SecurityEvent/Crashdumpdisabledonhost.yaml\n\nNew EXE deployed via Default Domain or Default Domain Controller Policies\n\nThis query looks for executables executed on host that appear to have been deployed via\nthe Default Domain Policy or the Default Domain Controller Policy. These policies are not\ntypically used for distributing executables.\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Detections/SecurityEvent/NewEXEdeployedviaDefaultDomainorDefault](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/NewEXEdeployedviaDefaultDomainorDefaultDomainControllerPolicies.yaml)\nDomainControllerPolicies.yaml\n\nPotential renamed Sdelete usage\n\nThis query looks for command line parameters associated with recursive use of Sdelete\nagainst the C drive where the originating process isn’t named sdelete.exe.\n\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/Potentialrenamedsdeleteusage.yaml\n\nSdelete deployed via GPO\n\nThis query looks for Sdelete being deployed via GPO and run recursively on a host.\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Detections/SecurityEvent/SdeletedeployedviaGPOandrunrecursively.ya](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/SdeletedeployedviaGPOandrunrecursively.yaml)\nml\n\n**Microsoft Defender for Endpoint**\n\nTo locate possible exploitation activity, run the following queries:\n\nSurface suspicious MSHTA process execution\n\nUse this query to look for MSHTA launching with command lines referencing DLLs in the\nAppData\\Roaming path.\n\n\n-----\n\n```\nDeviceProcessEvents\n\n| where FileName =~ \"mshta.exe\"\n\n| where ProcessCommandLine has_all (\".dll\", \"Roaming\")\n\n| where ProcessCommandLine contains @\"Roaming\\j\"\n\n| extend DLLName = extract(@\"[jJ][a-z]{1,12}\\.dll\", 0, ProcessCommandLine)\n\n```\nSurface suspicious Scheduled Task activity\n\nUse this query to look for Scheduled Tasks that may relate to actor activity.\n```\nDeviceProcessEvents\n\n| where ProcessCommandLine has_all (\"schtasks.exe\", \"create\", \"wscript\",\n\"e:vbscript\", \".wav\")\n\n```\nPotential renamed sdelete usage\n\nUse this query to look for command line parameters associated with the use of a renamed\nSysinternals sdelete tool to delete multiple files on the C drive as part of destructive attacks\non a host.\n```\nDeviceProcessEvents\n\n| where InitiatingProcessFileName !~ \"sdelete.exe\"\n\nand InitiatingProcessCommandLine has_all (\"-accepteula\", \"-r\", \"-s\", \"-q\", \"c:/\")\n\nand InitiatingProcessCommandLine !has (\"sdelete\")\n\n\n```\nMicrosoft continues to investigate these attacks and improve protections as new data is\nanalyzed. In addition, Microsoft Sentinel and Microsoft 365 Defender have a range of\nexisting queries for the detection of common techniques, such as lateral movement and\nprivilege escalation. We recommend customers use these queries to identify common\nattacker techniques being used in these attacks.\n\nWe continue to monitor activity and will update this page with more information as the\nsituation develops.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - Cyber threat activity in Ukraine- analysis and resources.pdf"
    ],
    "report_names": [
        "2022-02-28 - Cyber threat activity in Ukraine- analysis and resources.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "025b7171-98f8-4391-adc2-66333629c715",
            "created_at": "2023-06-23T02:04:34.120175Z",
            "updated_at": "2025-03-27T02:02:09.797581Z",
            "deleted_at": null,
            "main_name": "Cadet Blizzard",
            "aliases": [
                "DEV-0586",
                "Operation Bleeding Bear",
                "Ruinous Ursa"
            ],
            "source_name": "ETDA:Cadet Blizzard",
            "tools": [
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "P0wnyshell",
                "PAYWIPE",
                "Ponyshell",
                "Pownyshell",
                "WhisperGate",
                "WhisperKill",
                "netcat",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "96476518-d729-4ce6-835d-c8843c746eea",
            "created_at": "2024-02-02T02:00:04.039304Z",
            "updated_at": "2025-03-27T02:00:03.296733Z",
            "deleted_at": null,
            "main_name": "Sunglow Blizzard",
            "aliases": [
                "DEV-0665"
            ],
            "source_name": "MISPGALAXY:Sunglow Blizzard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bdbf873a-048d-4c5d-9d92-922327cc83a8",
            "created_at": "2023-01-06T13:46:39.387696Z",
            "updated_at": "2025-03-27T02:00:03.071819Z",
            "deleted_at": null,
            "main_name": "DEV-0586",
            "aliases": [
                "Ruinous Ursa",
                "Cadet Blizzard"
            ],
            "source_name": "MISPGALAXY:DEV-0586",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536084,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1660793391,
    "ts_modification_date": 1660793391,
    "files": {
        "pdf": "https://archive.orkl.eu/fbb77460526132f98c57cd635e7cdba9bcafe3fa.pdf",
        "text": "https://archive.orkl.eu/fbb77460526132f98c57cd635e7cdba9bcafe3fa.txt",
        "img": "https://archive.orkl.eu/fbb77460526132f98c57cd635e7cdba9bcafe3fa.jpg"
    }
}