{
    "id": "64a96334-885a-49c7-9ffe-65b5bc545756",
    "created_at": "2023-01-12T15:04:22.838195Z",
    "updated_at": "2025-03-27T02:06:09.095477Z",
    "deleted_at": null,
    "sha1_hash": "95cdf567b1b0ee5dd8e776c02ab9ab0d9aedeae7",
    "title": "2020-10-08 - MontysThree- Industrial espionage with steganography and a Russian accent on both sides",
    "authors": "",
    "file_creation_date": "2022-05-28T15:09:26Z",
    "file_modification_date": "2022-05-28T15:09:26Z",
    "file_size": 1592125,
    "plain_text": "# MontysThree: Industrial espionage with steganography and a Russian accent on both sides\n\n**securelist.com/montysthree-industrial-espionage/98972/**\n\nAuthors\n\n[Denis Legezo](https://securelist.com/author/denislegezo/)\n\nIn summer 2020 we uncovered a previously unknown multi-module C++ toolset used in\nhighly targeted industrial espionage attacks dating back to 2018. Initially the reason for our\ninterest in this malware was its rarity, the obviously targeted nature of the campaign and the\nfact that there are no obvious similarities with already known campaigns at the level of code,\ninfrastructure or TTPs. To date, we consider this toolset and the actor behind it to be new.\nThe malware authors named the toolset “MT3”; following this abbreviation we have named\nthe toolset “MontysThree”.\n\n\n-----\n\n_Following the MT3 abbreviation we named the toolset MontysThree_\n\nThe malware includes a set of C++ modules used for persistence, obtaining data from a\nbitmap with steganography, decryption of configuration tasks (making screenshots,\nfingerprinting the target, getting the file, etc.) and their execution, and network\ncommunications with major legitimate public cloud services such as Google, Microsoft and\nDropbox. MontysThree is configured to search for specific Microsoft Office and Adobe\nAcrobat documents stored in current documents directories and on removable media. The\nmalware uses custom steganography and several encryption schemes: besides custom\nXOR-based encryption, the modules rely on 3DES and RSA algorithms for configuration\ndecryption and communications.\n\nMontysThree contains natural language artifacts of proper Russian language and\nconfiguration that seek directories that exist only on Cyrilic localised Windows versions.\nWhile most external public cloud communications use token-based authorisation, some\nsamples contain email-based accounts for them, which pretend to be a Chinese lookalike.\nWe consider these names to be false flags. Many more artifacts suggest that the malware\nwas developed by a Russian-speaking actor and is targeting Cyrillic Windows versions.\n\n## How the malware spreads\n\nThe initial loader module is spread inside RAR self-extracting archives (SFX) with names\nrelated to employees’ phones list, technical documentation and medical test results. There\nare no lures, only PE files (masquerading a .pdf or .doc file), but such titles are now a typical\ntrick used in spear-phishing – “corporate info update” or “medical analysis results”. One of\nthe loaders (MD5 da49fea229dd2dedab2b909f24fb24ab) has the name “Список телефонов\n\n\n-----\n\nсотрудников 2019.doc ( Employee phone list, in Russian). Other loaders have the names\n“Tech task.pdf” and “invitro-106650152-1.pdf”. The latter is the name of a medical laboratory\nin Russia. All of them seem like typical spear-phishing tricks. The SFX script is as follows:\n```\nPath=%TEMP%\\\nSavePath\nSetup=rundll32.exe \"invitro-106650152-1.pdf\",Open\nSilent=1\nOverwrite=1\nUpdate=U\nDelete=invitro-106650152-1.pdf\n\n```\nOn execution, the SFX script calls the Open() function (we’ll return to this exported name) of\nthe decompressed loader executable in the %TEMP% directory and deletes it. Judging by\nthe filename, it most likely imitates medical analysis results, given that “Invitro” is a prominent\nmedical laboratory in Russia. This initial PE32 is the first loader module.\n\n## How modules work and communicate\n\n_Execution flow of MontysThree’s modules_\n\n\n-----\n\nThe diagram above shows the overall execution flow of the MontysThree modules. Four\nmodules and their features are listed in the table below. The modules share common\ncommunication conventions. When dealing with shared data, such as the configuration and\ndetailed execution log, the malware initializes the structure in thread local storage (TLS),\nwhich in its turn refers to heap structures. Interestingly, besides RAM, the execution log is\nstored on disk in a file, encrypted with a one-byte XOR.\n\nThe entry point DllEntryPoint() works just like a construtor, which allocates the structure with\nTlsAlloc() and saves it in a global variable. Modules must export a function named Open(),\nwhich takes no parameters (but could parse the command line) and returns a four-byte error\ncode.\n\n**Module name** **Features**\n\n**Loader** This anti-detection module is in charge of custom steganography, kernel\nmodule decryption.\n\n**Kernel** This kernel (main) module is in charge of decrypting the config XML, then\nparsing and executing the corresponding tasks in it.\n\n**HttpTransport** Network module to communicate with Google, Microsoft, Dropbox\nlegitimate public cloud services, as well as with WebDAV sources. The\nmodule is able to make requests through RDP and Citrix in a naive way\nusing legitimate clients.\n\n**LinkUpdate** Persistence module is a Windows Quick Launch .lnk modifier. With this\nnaive persistence method users would run the Loader module by\nthemselves every time along with the browsers from the Windows Quick\nLaunch toolbar.\n\nNow let’s take a look how the developers mixed strong modern cryptography standards with\ncustom XOR-based ones.\n\n**Task** **Encryption in use**\n\nSteganography To decrypt the kernel module the initial loader uses a custom algorithm.\n\nLogs encryption The malware logs exist in memory as well as in encrypted files on disk\nat the same time. In RAM the developers store the logs in plaintext, on\ndisk they use one-byte XOR.\n\n\nConfig\nencryption\n\n\nKernel module uses strong encryption algorithms. Configuration data is\nencrypted with 3DES and the key is encrypted using RSA. All the keys\n– RSA public/private as well as encrypted 3DES – are stored inside the\nmodule’s .data section.\n\n\n-----\n\nNetwork module\nencryption\n\nCommunications\nencryption\n\n\nInitially encrypted HttpTransport is made of four binary blobs stored in\nthe kernel module. The kernel concatenates them and decrypts them\nwith a custom XOR-based algorithm. A round key of four bytes length\nis used\n\nThe encryption algorithm is RSA using the same public and private\nkeys stored inside the kernel module .data section.\n\n\n### Loader module: Bitmap decryptor and next stage launcher\n\nIf the filename of the bitmap containing the steganography-encrypted data is provided to the\nloader as an argument, the loader decrypts the next stager from the pixel array. In the first\niteration, it extracts the steganography parameter data. To do so, the algorithm takes the last\nbits of the bytes.\n\nThe IID, IParam and ISize parameters are kept in the first 384 bytes of the pixel array,\nmeaning that only the last bit of every pixel array’s byte is needed. As a result, the module\ngathers 48 bytes of steganography configuration structure with the fields, determining the\nnext decryption stages.\n\n**Field** **Offset** **Features**\n\nIID 0x00 Determines one or two decryption layers would apply to the following\npixel array.\n\nIParam 0x04 Determines which bits from pixel arrays bytes would form the next\nkernel module.\n\nISize 0x28 The decrypted kernel module’s resulting size.\n\n\n-----\n\nAfter extracting the steganography parameters, the next stager is decrypted using a two-step\nalgorithm. Firstly, the IParam algorithm chooses the bits from the pixel array’s bytes. Then, if\nIID equals 2, a custom dexoring operation using a four-byte round key is applied on the\ngathered bytes. The initial key for the first four-byte decryption has the hardcoded value\n0x23041920. Then the formula for the round XOR key for the next bytes is:\n\n```\nkey ^= 8 * (key ^ (key << 20))\n\n```\n\nWe consider this steganography algorithm to be custom made and not taken from some\nopen source third-party repository. Surprisingly, the decryption result is not injected into some\nprocess’s memory, but dropped to disk as a file named msgslang32.dll. The loader then\nsimply uses the Windows API functions LoadLibraryW() and GetProcAddress() to run the\nnext stager’s Open() function, as we previously saw with the loader module.\n\n### Kernel module: Config decryptor and tasks dispatcher\n\nThe kernel module contains three encryption keys used for configuration decryption and C2\ncommunications. Public and private RSA keys are stored in the .data section as\nPUBLICKEYBLOB and PRIVATEKEYBLOB respectively. These are used to encrypt C2\ncommunications and to decrypt the 3DES key as well. The third 3DES key is also stored in\nthe .data section in its encrypted form; this key is used to decrypt an embedded .cab archive\ncontaining the XML config. To decompress the .cab archive the module uses Window’s\nstandard system utility, “expand.exe”. We’ll see another common software usage in the\nHttpTransport module.\n\nThe XML configuration contains valuable data that helps us understand the campaign\noperator’s interest. It is structured using various “tasks” for the malware, such as\nfingerprinting the target using its OS version, process list and capturing screenshots; but also\ngrabs the list of users’ recent documents with any of the extensions .doc, .docx, .xls, .xlsx,\n.rtf, .pdf, .odt, .psw, .pwd from the several recent documents directories in\n%USERPROFILE% and %APPDATA%, including %APPDATA%\\Microsoft\\Office\\Последние\nфайлы. This folder name translates to “Recent files” in Russian, suggesting that the malware\nis aimed at Cyrillic localised Windows versions.\n\n\n-----\n\n_Config holds the tasks scheduling (screenshot top), access tokens (here Dropbox, redacted),_\n_directories and extensions of interest. One directory exists only on Cyrillic Windows localized_\n_versions_\n\nWe observed several Cyrillic text strings such as “Снимок рабочего стола” (desktop\nsnapshot), “Системная информация” (system information), “Время выхода” (exit time).\n\n_Config tasks description starts with MT3D and contains proper short phrases in Russian_\n\nThe decrypted config structure is as follows:\n\n**Field** **Size** **Content**\n\nMagic 4 bytes MT3D. All parsed files must have this as a prefix to be valid\n\n\nCreation\ntime\n\nHeader\nsize\n\n\n4 bytes Timestamp, task config creation time stored as Epoch time\n\n4 bytes Header size has to be greater than 18. Observed value is e.g. 0x7E\n\n\nXML size 4 bytes XML task description has to be greater than zero. Observed value\nis e.g. 0x662D\n\n\nXML body XML\nsize\n\n\nThe task’s description and schedule in XML format\n\n\nWhile the samples we looked at didn’t contain RTTI information, the execution logs allowed\nus to recover the C++ class names. After the kernel module parses the tasks from the\nconfiguration into memory, the main class that processes the instruction is CTask. CTask’s\nIoControl() method is in charge of handling the corresponding tasks and in turn runs the\nfollowing methods:\n\n**CTask method** **Features**\n\n\n-----\n\nMainIoControl() Handler of “Main” task in XML. In case of a RESET command the\nfile, serving as a “pipe”, will be deleted. Any other command here will\nbe logged, but not executed\n\nFileIoControl() Handler of “File” task with PUT, DEL, FIND, WATCH,\nWATCH_REMOVABLE, RUN and LOGS subcommands\n\nSysInfoIoControl() Handler of “SysInfo” task with SCREENSHOT, INFO and TASKLIST\nsubcommands\n\nHttpIoControl() Handler of “Http” task with SENDRECV subcommand\n\nGDriveIoControl() Handler of “GDrive” task with SENDRECV subcommand\n\nDropboxIoControl() Handler of “Dropbox” task with SENDRECV subcommand\n\nAll methods used for external communications first decrypt the HttpTransport module and\nuse it to transmit the corresponding data RSA-encrypted. The RSA keys in use are the same\naforementioned keys used to decrypt the 3DES config key. In a separate Window procedure,\nthe malware monitors if a USB device is plugged in, searching for files of interest.\n\n### HttpTransport module: network tasks\n\nThe HttpTransport module exists as four encrypted chunks of data inside the .text section of\nthe kernel module. When the kernel needs to communicate, it decrypts this module and, as\nusual for MontysThree, runs the Open() function, passing command line arguments.\n\nDepending on the arguments transmitted from the kernel module, the module may upload or\ndownload content using RDP, WebDAV, Citrix and HTTP protocols. Downloading data from\nGoogle and Dropbox public services using user tokens is implemented in HttpTransport as\nwell. In case of HTTP GET/POST requests, the malware would receive a steganography\nbitmap picture using Windows API HTTP-related functions from a corresponding URL.\n\nThe aforementioned communication protocols themselves aren’t implemented inside the\nmodule. The malware authors make use of legitimate Windows programs like RDP, Citrix\nclients and Internet Explorer already installed on the target’s machine. For example, the\nmodule executes a task to send some data to a URL and receive the reply through an RDP\nconnection as follows: edit the .rdp file to silently run Internet Explorer on the remote\nmachine; paste the URL to the browser via the clipboard; wait and paste the contents to the\nopened web page via the clipboard as well; wait and receive the result through the clipboard\nagain.\n\nTo copy data, the malware literally sends Ctrl+C, Ctrl+V and Ctrl+A. Perhaps it’s the first time\nwe have seen such a method of “RDP communication”. The Citrix communication is done\nusing a similar procedure: the malware doesn’t implement the protocol but rather searches\n\n\n-----\n\nfor Windows Quick Launch .lnk for XenApp pnagent.exe, runs Internet Explorer remotely and\ncommunicates with it through the clipboard using special keyboard shortcuts.\n\nDropbox and Google data upload and download relies on another principle: its\nimplementation uses the custom class CSimpleHttp to authenticate and send HTTP\nrequests. For WebDAV communication, the developers simply use the “net use” Windows\ncommand.\n\n### LinkUpdate\n\nThis auxiliary module is in charge of achieving persistence on the host. It changes the .lnk\nfiles in the Windows Quick Launch panel to run the loader along with legitimate applications\nsuch as browsers when the user executes them using the modified link.\n\n## Who is behind this malware\n\nAs we mentioned at the beginning, to date we have observed no similarities or overlaps with\nknown campaigns in terms of TTPs, infrastructure or malware code. So far, we attribute this\nactivity and the use of MontysThree to a new actor. Some samples contain account details\nused for communicating with public cloud services, which pretend to be of Chinese origin.\nTaking into consideration all the aforementioned Cyrilic artefacts, we consider these account\nnames to be false flags.\n\nWe assume that the actor behind MontysThree is both Russian-speaking and is going after\nRussian-speaking targets. Some of the filenames of the RAR SFX archives used for\nspreading the malware were written in Russian and referenced a Russian medical laboratory,\nused to entice the user to open the file. The XML configuration showcased data fields and\nWindows titles written in Russian, as well as specific folder paths that exist on Cyrilic\nlocalised versions of Windows. We also saw some grammatical errors in the malware’s\nEnglish log message strings.\n\n## Let’s sum up\n\nTypically we see targeted malware that is mostly going after governmental entities, diplomats\nand telecom operators, which are fruitful for state-sponsored actors. Industrial espionage\ncases like MontysThree are far more rare.\n\nThe overall campaign sophistication doesn’t compare to top notch APT actors in terms of\nspreading, persistence method. And some aspects of the malware – logging in RAM and\nfiles at the same time, keeping the encryption keys in the same file, running an invisible\nbrowser on the remote RDP host – seem immature and amateurish in terms of malware\ndevelopment.\n\n\n-----\n\nOn the other hand, the amount of code and therefore effort invested, in MontysThree is\nsignificant. The toolset demonstrates some tech-savvy decisions: Storing 3DES key under\nRSA encryption, custom steganography to avoid IDS and the use of legitimate cloud storage\nproviders to hide the C2 traffic.\n\n### File Hashes\n\n**Loader**\n1B0EE014DD2D29476DF31BA078A3FF48\n\n0976C442A06D2D8A34E9B6D38D45AE42\n\nA2AA414B30934893864A961B71F91D98\n\n**Kernel**\n\nA221671ED8C3956E0B9AF2A5E04BDEE3\n\n3A885062DAA36AE3227F16718A5B2BDB\n\n3AFA43E1BC578460BE002EB58FA7C2DE\n\n**HttpTransport**\n\n017539B3D744F7B6C62C94CE4BCA444F\n\n501E91BA1CE1532D9790FCD1229CBBDA\n\nD6FB78D16DFE73E6DD416483A32E1D72\n\n### Domains and IPs\n\nautosport-club.tekcities[.]com\n\ndl10-web-stock[.]ru\n\ndl16-web-eticket[.]ru\n\ndl166-web-eticket[.]ru\n\ndl55-web-yachtbooking[.]xyz\n\n[Industrial threats](https://securelist.com/tag/industrial-threats/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Russian-speaking cybercrime](https://securelist.com/tag/russian-speaking-cybercrime/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n\nAuthors\n\n[Denis Legezo](https://securelist.com/author/denislegezo/)\n\nMontysThree: Industrial espionage with steganography and a Russian accent on both sides\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-08 - MontysThree- Industrial espionage with steganography and a Russian accent on both sides.pdf"
    ],
    "report_names": [
        "2020-10-08 - MontysThree- Industrial espionage with steganography and a Russian accent on both sides.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535862,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653750566,
    "ts_modification_date": 1653750566,
    "files": {
        "pdf": "https://archive.orkl.eu/95cdf567b1b0ee5dd8e776c02ab9ab0d9aedeae7.pdf",
        "text": "https://archive.orkl.eu/95cdf567b1b0ee5dd8e776c02ab9ab0d9aedeae7.txt",
        "img": "https://archive.orkl.eu/95cdf567b1b0ee5dd8e776c02ab9ab0d9aedeae7.jpg"
    }
}