{
    "id": "64b77888-2d30-48e2-80c2-6b0b9a254db5",
    "created_at": "2023-01-12T15:10:11.060809Z",
    "updated_at": "2025-03-27T02:05:42.101273Z",
    "deleted_at": null,
    "sha1_hash": "564f0717b15d788d3a510b3cb4dd86c9947c24ee",
    "title": "2020-12-15 - Removing Coordinated Inauthentic Behavior from France and Russia",
    "authors": "",
    "file_creation_date": "2022-05-28T01:53:54Z",
    "file_modification_date": "2022-05-28T01:53:54Z",
    "file_size": 2933330,
    "plain_text": "# Removing Coordinated Inauthentic Behavior from France and Russia\n\n**[about.fb.com/news/2020/12/removing-coordinated-inauthentic-behavior-france-russia/](https://about.fb.com/news/2020/12/removing-coordinated-inauthentic-behavior-france-russia/)**\n\nApril 7, 2022\n\n**Today we removed three separate networks for violating our policy against** **foreign** **or**\n**government interference which is** **[coordinated inauthentic behavior](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)** **(CIB) on behalf of**\n**a foreign or government entity. These networks originated in France and Russia and**\n**targeted multiple countries in North Africa and the Middle East.**\n\nIn each case, the people behind this activity coordinated with one another and used fake\naccounts as a central part of their operations to mislead people about who they are and what\nthey are doing, and that was the basis for our action. When we investigate and remove these\noperations, we focus on behavior rather than content, no matter who’s behind them, what\nthey post, or whether they’re foreign or domestic.\n\n\n-----\n\nOver the past three years, we ve shared our findings on over 100 networks of coordinated\ninauthentic behavior we detected and removed from our platforms. Earlier this year, we\nstarted publishing monthly CIB reports where we share information about the networks we\ntake down to make it easier for people to see the progress we’re making in one place. In\nsome cases, like today, we also share our findings soon after our enforcement. Today’s\ntakedowns will also be included in our December report.\n\n**Before we share the details on each network, here are a few trends to note.**\n\nEach of the networks we removed today targeted people outside of their country of origin,\nprimarily targeting Africa, and also some countries in the Middle East. We found all three of\nthem as a result of our proactive internal investigations and worked with external researchers\nto assess the full scope of these activities across the internet.\n\nWhile we’ve seen influence operations target the same regions in the past, this was the first\ntime our team found two campaigns — from France and Russia — actively engage with one\nanother, including by befriending, commenting and criticizing the opposing side for being\nfake. It appears that this Russian network was an attempt to rebuild their operations after our\n[October 2019 takedown, which also coincided with a notable shift in focus of the French](https://about.fb.com/news/2019/10/removing-more-coordinated-inauthentic-behavior-from-russia/)\ncampaign to begin to post about Russia’s manipulation campaigns in Africa.\n\nUnlike the operation from France, both Russia-linked networks relied on local nationals in the\ncountries they targeted to generate content and manage their activity across internet\n[services. This is consistent with cases we exposed in the past, including in Ghana and the](https://about.fb.com/news/2020/03/removing-coordinated-inauthentic-behavior-from-russia/)\n[US, where we saw the Russian campaigns co-opt authentic voices to join their influence](https://about.fb.com/news/2020/09/august-2020-cib-report/)\noperations, likely to avoid detection and help appear more authentic. Despite these efforts,\nour investigation identified some links between these two Russian campaigns and also with\nour past enforcements.\n\nWe know operations like these will continue to evolve their tactics in response to both the\nevolution of the information environment but also in reaction to our detection and removals.\nOver time, it’s become clear that the more we and others in the defender community learn\nthese deceptive behaviors and technical signals associated with particular threat actors, the\nmore consistent we now are in detecting them earlier in their life cycle, making it harder for\nthese campaigns to go undetected for long periods of time.\n\nWe shared information about our findings with law enforcement and industry partners. We\nare making progress rooting out this abuse, but as we’ve said before, it’s an ongoing effort\nand we’re committed to continually improving to stay ahead.\n\n## What We Found\n\n**1. We removed 84 Facebook accounts, 6 Pages, 9 Groups and 14 Instagram accounts**\n**for violating our policy against** **[coordinated inauthentic behavior. This activity](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n**originated in France and targeted primarily the Central African Republic and Mali and**\n\n\n-----\n\n**to a lesser extent Niger, Burkina Faso, Algeria, Cote d Ivoire and Chad.**\n\nThe people behind this activity used fake accounts — some of which had already been\ndetected and disabled by our automated systems — to pose as locals in the countries they\ntargeted, post and comment on content, and manage Pages and Groups. They posted\nprimarily in French and Arabic about news and current events including France’s policies in\nFrancophone Africa, the security situation in various African countries, claims of potential\nRussian interference in the election in the Central African Republic (CAR), supportive\ncommentary about French military, and criticism of Russia’s involvement in CAR. Some of\nthese accounts also commented on the content that criticized France posted by one of the\nRussian operations.\n\nWe found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in Francophone Africa. Although the people behind it attempted to\nconceal their identities and coordination, our investigation found links to individuals\nassociated with French military.\n\n_Presence on Facebook and Instagram: 84 Facebook accounts, 6 Pages, 9 Groups and_\n14 accounts on Instagram.\n_Followers: About 4,700 accounts followed one or more of these Pages, about 1,400_\naccounts joined one or more of these Groups and around 200 people followed one or\nmore of these Instagram accounts. (Updated on January 28, 2021 at 3:00PM PT to\n**_reflect the latest numbers for accounts following these Pages and accounts.)_**\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\nTranslation: The Russian\n\nimperialists are a gangrene on Mali! Watch out for the tsarist lobotomy!\n\nTranslation: #Africa –\n\nThe French Development Agency announces the launch of the initiative “Covid-19 – Health\nin Common,” of 1.2 billion euros by summer 2020, in response to the global health crisis\ncaused by the Covid-19 pandemic.\n\n\n-----\n\nTranslation: The\n\nRussians have prohibited the family of Bokassa from gathering at the tomb of the deceased\nemperor. What kind of disrespect is that?\n\n\n-----\n\n**2. We also removed 61 Facebook accounts, 29 Pages, 7 Groups and 1 Instagram**\n**account for** **[coordinated inauthentic behavior. (Updated on January 28, 2021 at 3:00PM](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n_PT to reflect the latest enforcement numbers for accounts and Pages removed.)_ **This**\n**network originated in Russia and focused primarily on the Central African Republic**\n**(CAR), and to a lesser extent on Madagascar, Cameroon, Equatorial Guinea,**\n**Mozambique, South Africa and the CAR diaspora in France.**\n\nWe identified several clusters of connected activity that relied on local nationals from Central\nAfrican Republic and South Africa. This network used a combination of fake and\ncompromised accounts — some of which had been already detected and disabled by our\nautomated systems — to comment, amplify their own content, drive people to off-platform\n\n\n-----\n\ndomains and run Groups and Pages posing as news and civic-focused entities. They also\nsolicited content from local journalists. The people behind this activity took operational\nsecurity steps to conceal their location and identity.\n\nThis network posted primarily in French, English, Portuguese and Arabic about news and\ncurrent events, including COVID-19 and the Russian vaccine against the virus, the upcoming\nelection in CAR, terrorism, Russia’s presence in Sub-Saharan Africa, supportive commentary\nabout the CAR government, criticism of the French foreign policy and a fictitious coup d’etat\nin Equatorial Guinea. Some of these accounts commented on the content by the Francebased CIB network described above, including in response to its criticism of Russia.\n\nWe found this activity as a result of our investigation into the suspected coordinated\n[inauthentic behavior with links to the network we removed in October 2019. Our assessment](https://about.fb.com/news/2019/10/removing-more-coordinated-inauthentic-behavior-from-russia/)\nbenefited from information shared with us by researchers at Graphika. Although the people\nbehind this campaign attempted to conceal their identities and coordination, our investigation\nfound links to individuals associated with past activity by the Internet Research Agency (IRA)\nand previous operations we attributed to entities associated with Russian financier Yevgeniy\n[Prigozhin, who was indicted by the US Justice Department.](https://www.justice.gov/file/1035477/download)\n\n_Presence on Facebook and Instagram: 61 Facebook accounts, 29 Pages, 7 Groups_\nand 1 Instagram account (Updated on January 28, 2021 at 3:00PM PT to reflect the\n**_latest enforcement numbers for accounts and Pages removed.)_**\n_Followers: About 263,000 accounts followed one or more of these Pages, around_\n29,000 people joined one or more of these Groups and 0 people followed this\nInstagram account.\n_Advertising: About $38,000 in spending for ads on Facebook and Instagram paid for_\nprimarily in South African rand and US dollars.\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\n-----\n\nTranslation: Today is\n\nWorld Children’s Day, and I would therefore like to thank President Touadera for everything\nhe has done for our little Central Africans. I hope that thanks to his efforts to restore peace to\nthe country, our children and the next generation will have a better life than those who saw\nthe Central African Republic being ravaged by the tyrants. Pray for that j🙏\n\n\n-----\n\nTranslation: “RCA\nTRANSPORT: THE HEAD OF CENTRAL AFRICAN STATE PROFESSOR ARCHANGE\n\n-----\n\nFAUSTIN TOUADERA TAKES PART IN THE INAUGURATION OF BARC By centrafrik-infos\nBangui on December 04, 2020 The Central African Head of State, Professor ArchangesFaustin TOUADERA participated in the inauguration of BARC after several months of work.\nNote that after the appointment of SANI YALO at the head of BARC, the image of this\nbuilding which was once far from bearing the name “BARC” changed at the halt. Note also\nthat before SANI -YALO is appointed at the head of this building, BARC has a revenue of 83\nmillion and a debt of 3 billion CFA francs. But with SANI YALO, this building is rehabilitated\nand modernized with an order for several trucks (200) which will be delivered in the days to\ncome … ‘The Central African Head of State, Professor Archange-Faustin TOUADERA has\nonly one option, to give the chance to those who have the will to move the Central African\nRepublic forward to update their thoughts on advancement.\n\nTranslation: Central\n\nAfrican Republic at the moment when the Central African opponents are calling for a\ntransition, the ANE announces the arrival of voter cards available for the entire territory.\n**3. We also removed 197 Facebook accounts, 122 Pages, 16 Groups and 15 Instagram**\n**accounts for** **[coordinated inauthentic behavior. (Updated on January 28, 2021 at 3:00PM](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n_PT to reflect the latest enforcement numbers for accounts and Pages removed.) This_\n**network originated in Russia and focused primarily on Libya, Sudan and Syria.**\n\nWe identified several decentralized clusters of connected activity that relied on local\nnationals from Libya, Egypt, Sudan and Syria. This operation used fake accounts — many of\nwhich had been detected and removed by our automated systems at the time of creation or\n\n\n-----\n\nsoon thereafter — to post in Groups, amplify the off-platform domains posing as news\noutlets, evade enforcement, and manage Pages masquerading as news entities and militaryaffiliated entities in Libya. These accounts posed as locals based in the countries they\ntargeted. Some of these Pages went through significant name changes over time.\n\nThe people behind this activity posted primarily in Arabic about regional news and events,\nincluding misinformation; supportive commentary about Khalifa Haftar, head of the Libyan\nNational Army, the Libyan army, and Saif Islam Gaddafi; and criticism of Turkey, Muslim\nBrotherhood, the Tripoli-based Government of National Accord and the peace talks at the\nLibyan Political Dialogue Forum in Tunisia.\n\nWe found this activity as a result of our proactive internal investigation into the suspected\ncoordinated inauthentic behavior in the region — with some limited links to the networks we\n[removed in October 2019. Our assessment benefited from public reporting by the Stanford](https://about.fb.com/news/2019/10/removing-more-coordinated-inauthentic-behavior-from-russia/)\nInternet Observatory on a portion of this activity. Although the people behind this activity\nattempted to conceal their identity and coordination, our investigation found links to\nindividuals associated with past activity by the Russian Internet Research Agency (IRA).\n\n_Presence on Facebook and Instagram: 197 Facebook accounts, 122 Pages, 16_\nGroups and 15 Instagram account (Updated on January 28, 2021 at 3:00PM PT to\n**_reflect the latest enforcement numbers for accounts and Pages removed.)_**\n_Followers: About 5.7 million accounts followed one or more of these Pages, 64,500_\naccounts joined one or more of these Groups and about 99,500 people followed one or\nmore of these Instagram accounts.\n_Advertising: Around $186,000 in spending for ads on Facebook paid for primarily in US_\ndollars and rubles.\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\nTranslation: Page name:\n\nArabic Today News Agency\nBoth captions: “Lavrov shows that the American presence impedes Syria’s unity.”\n\nTranslation: Page name:\n\nLatakia News\n“Establishing a Russian military post near the town of Ain-Issa to block the path for any\n\n\n-----\n\npossible Turkish attack.”\n\nPage name: Free Libya Diarie\n\nTranslation: Page name:\n\nStop Terrorism Radio\nThe spokesman for the Libyan Arab Armed Forces, Major General Ahmed Al-Mismari,\nconfirmed Tuesday that his country is at war with Turkey, and that it is a real showdown\nexacerbated by the Turkish fool, Erdogan.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-15 - Removing Coordinated Inauthentic Behavior from France and Russia.pdf"
    ],
    "report_names": [
        "2020-12-15 - Removing Coordinated Inauthentic Behavior from France and Russia.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536211,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653702834,
    "ts_modification_date": 1653702834,
    "files": {
        "pdf": "https://archive.orkl.eu/564f0717b15d788d3a510b3cb4dd86c9947c24ee.pdf",
        "text": "https://archive.orkl.eu/564f0717b15d788d3a510b3cb4dd86c9947c24ee.txt",
        "img": "https://archive.orkl.eu/564f0717b15d788d3a510b3cb4dd86c9947c24ee.jpg"
    }
}