{
    "id": "64fb9e44-ee8c-45a4-b05c-f8684c33ddae",
    "created_at": "2022-10-25T16:48:23.117796Z",
    "updated_at": "2025-03-27T02:16:26.310192Z",
    "deleted_at": null,
    "sha1_hash": "dc641767dfecf2604e634d2a849c5988dc010621",
    "title": "Technical threat report: Arid Viper",
    "authors": "",
    "file_creation_date": "2021-04-20T17:27:19Z",
    "file_modification_date": "2021-04-20T17:27:19Z",
    "file_size": 1810768,
    "plain_text": "##### April 2021\n\n# Technical Paper // Taking Action Against Arid Viper\n\nAuthors: Michael Flossman and Michael Scott // Threat Investigators\n\n\n-----\n\n##### TABLE OF CONTENTS\n\n**Executive Summary** **4**\n\n**Key Findings** **5**\n\nTimeline around recent Arid Viper Operations 8\n\n**Overview** **9**\n\nBackground 9\n\nRecent Operations & Activity on Platform 9\n\nVictimology 11\n\n**A Toolkit of Custom Malware for Multiple Platforms** **12**\n\nPhenakite - Arid Viper’s iOS Implant 12\n\nInitial Device Compromise 13\n\nInclusion of Public Exploits 17\n\nCapabilities 17\n\nScope of iOS Targeting 20\n\nEvolving Android Surveillanceware 21\n\nContinued Development of Micropsia Windows Malware 29\n\nGeneral Micropsia Behavior & Capability 30\n\nPersistence 30\n\nCommand and Control Communication 31\n\nPhishing/Credential Theft 33\n\nCentral Elections Commission Imposter Site 33\n\n**Conclusion** **35**\n\n**Appendix** **36**\n\n\n-----\n\n#### Executive Summary\n\nFacebook is focused on protecting our users from malicious actors who attempt to conduct\n\noffensive cyber operations on our family of applications. This report details our investigation and\n\ndisruption of the advanced persistent threat actor known in the security industry as Arid Viper,\n\nwho we identified creating and using fake accounts in targeted cyber espionage campaigns. For\n\nthe first time, we observed Arid Viper incorporating fully functional custom iOS\n\nsurveillanceware, capable of stealing sensitive user data from iPhones without requiring devices\n\nbe jailbroken prior to compromise.\n\nThe focus of Arid Viper’s recent operation we discuss in this paper shows similar geographic and\n\noccupational targeting as was previously reported by our industry peers. Much of Arid Viper’s\n\nactivity detailed in this report focused on individuals in Palestine, including government officials,\n\nmembers of the Fatah political party, student groups, and security forces.\n\nArid Viper used sprawling infrastructure to support this most recent operation, including over a\n\nhundred websites that either hosted iOS and Android malware, attempted to steal credentials\n\nthrough phishing, or acted as command and control (C&C or C2) servers. A prevalent threat\n\nactor, Arid Viper appears to operate across multiple social media platforms.\n\nWe shared threat indicators with industry peers and security researchers as part of a concerted\n\neffort to disrupt this group’s operations. For Facebook, this has meant disabling Facebook and\n\nInstagram accounts created by Arid Viper operators, releasing malware hashes and domains\n\nassociated with this threat actor, and notifying users who we believe were targeted by this\n\nactivity in order to help them secure their accounts.\n\n\n-----\n\n#### Key Findings\n\nTo protect the community, Facebook is releasing the following set of indicators around\n\nthis activity.\n\n    - 10 Android malware hashes\n\n    - 2 iOS malware hashes\n\n    - 8 desktop malware hashes\n\n    - 179 domains\n\n\n### 01\n## —\n\n\n##### Facebook identified offensive cyber security activity by the threat actor known as Arid Viper\n\nWe identified recent state-sponsored cyber espionage operations that we\n\nattributed with high confidence to Arid Viper. Our assessment is based on\n\nsignificant overlap between our findings and this actor’s known tactics,\n\ntechniques, and procedures (TTPs)[1]. We are aware that some of the previous\n\nindustry reports linked Arid Viper to the cyber arm of Hamas. However, we\n\ncannot conclusively confirm this connection based on our evidence.\n\nThe malware Arid Viper deployed in 2019 and 2020 appears regionally specific,\n\nas does the victimology. Lure content and known victims suggest the target\n\ndemographic is individuals associated with pro-Fatah groups, Palestinian\n\n\n1 Palo Alto Networks, “Targeted Attacks in the Middle East Using KASPERAGENT and MICROPSIA,” Source:\n\n[https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/ [Last](https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/)\nAccessed April 19, 2021]\nKaspersky, “The Desert Falcons Targeted Attacks,” Source:\n[https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targ](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targeted-attacks.pdf)\n\n[eted-attacks.pdf](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targeted-attacks.pdf) [Last Accessed April 19, 2021]\nKaspersky, “Breaking The Weakest Link Of The Strongest Chain,” Source:\n[https://securelist.com/breaking-the-weakest-link-of-the-strongest-chain/77562/ [Last Accessed April 19, 2021]](https://securelist.com/breaking-the-weakest-link-of-the-strongest-chain/77562/)\nTrend Micro, “Arid Viper: Gaza vs Israel Cyber Conflict,” Source:\n\n[https://www.trendmicro.com/en_us/research/15/b/arid-viper-gaza-vs-israel-cyber-conflict.html [Last Accessed April](https://www.trendmicro.com/en_us/research/15/b/arid-viper-gaza-vs-israel-cyber-conflict.html)\n19, 2021]\nClearSky, “Infrastructure and Samples of Hamas’ Android Malware Targeting Israeli Soldiers,” Source:\n\n[https://www.clearskysec.com/glancelove/](https://www.clearskysec.com/glancelove/) [Last Accessed April 19, 2021]\nLookout, “FrozenCell: Multi-platform surveillance campaign against Palestinians,” Source:\n[https://blog.lookout.com/frozencell-mobile-threat](https://blog.lookout.com/frozencell-mobile-threat) [Last Accessed April 19, 2021]\n\n\n-----\n\n### 02\n## —\n\n\ngovernment organizations, military and security personnel, and student groups\n\nwithin Palestine.\n\nAlthough there is evidence of opportunistic targeting outside of Palestine, such\n\ncases appear politically motivated and consistent with targeting from this\n\nthreat actor.\n\n##### Arid Viper used custom surveillanceware in a fully functional chat application which didn’t require a jailbreak for installation\n\nArid Viper used custom iOS surveillanceware which has not been previously\n\nreported and reflects a tactical shift. We call this iOS component Phenakite due\n\nto it being somewhat rare and deriving its name from the Greek word Phenakos,\n\nmeaning to deceive or cheat.\n\nInstallation of Phenakite required that victims be tricked into installing a\n\nmobile configuration profile. This allowed for a device-specific signed version\n\nof the iOS app to be installed on a victim’s device. A jailbroken device was\n\nnot required.\n\nPost-installationPost-installation, a jailbreak was necessary for the malware to\n\nelevate its privileges to retrieve sensitive user information not accessible via\n\nstandard iOS permission requests. This was achieved with the publicly available\n\nOsiris jailbreak that also made use of the Sock Port exploit, both of which were\n\nbundled in the malicious iOS app store packages (IPAs).\n\nArid Viper’s iOS surveillanceware was trojanized inside a fully functional chat\n\napplication that used the open source RealtimeChat code for legitimate app\n\nfunctionality. This malware could also direct victims to phishing pages for\n\nFacebook and iCloud in order to steal credentials for those services.\n\nArid Viper’s use of custom iOS surveillanceware shows that this capability\n\nis becoming increasingly attainable by adversaries believed to be of\n\nlower sophistication.\n\n\n-----\n\n### 03\n## —\n\n### 04\n## —\n\n\n##### Arid Viper made use of continually evolving Android and Windows malware that it has relied on over the years\n\nThe Android tooling used by Arid Viper shares many similarities with malware\n\npreviously reported as FrozenCell and VAMP.\n\nThe Android malware deployed by Arid Viper required victims to install apps\n\nfrom third-party sources on their devices. The group used a number of\n\nconvincing, attacker-controlled sites to create the impression that the apps\n\nwere legitimate.\n\nArid Viper’s recent operations also used variants of a malware family known as\n\nMicropsia, which previously has been associated with this threat actor.\n\n##### Arid Viper continued distributing malware via social engineering and both attacker-controlled and 3rd party websites\n\nDelivery of both the Android and iOS malware involved social engineering.\n\nAndroid malware was typically hosted on convincing looking attacker\ncontrolled phishing sites. At the time of writing, we discovered 41 such sites.\n\nWhile Arid Viper tooling has previously been discovered in official app channels\n\nlike the Play Store, this was not found to be the case in this instance.\n\niOS malware was previously found to be distributed from a 3rd party Chinese\n\napp development site. After engagement with industry partners which led to\n\nthe revocation of multiple developer certificates, Arid Viper’s ability to\n\ndistribute Phenakite was disrupted. They have since been observed trying to set\n\nup their own infrastructure to distribute their iOS implant.\n\n\n-----\n\n##### Timeline around recent Arid Viper Operations\n\n\n-----\n\n#### Overview\n\n##### Background\n\nOver the past several years the operations of the advanced persistent threat (APT) actor Arid\n\nViper, also called Desert Falcon and APT-C-23, attributed by some in the broader security\n\ncommunity to the cyber arm of Hamas, have been detailed numerous times[2]. These reports\n\ndescribed various aspects of activity by a long-running persistent threat actor operating out of\n\nGaza, Palestine, to conduct targeted intelligence-gathering operations since it emerged in 2011.\n\nThe campaigns attributed to this group show how a relatively low-sophistication adversary used\n\na combination of social engineering, phishing sites, and a continually evolving toolkit of Windows\n\nand Android malware to successfully run offensive cyber operations. Some of the past industry\n\nreports detailed that targeting occured against a very regionally specific set of victims with ties\n\nto pro-Fatah organisations, Palestinian political groups, or the Israeli Defense Force.\n\n##### Recent Operations & Activity on Platform\n\nIn mid-2019, as part of our continuous monitoring and enforcement against APTs, Facebook\n\nobserved a spike in Arid Viper’s activity involving the creation of dozens of fake Facebook and\n\nInstagram profiles.\n\n2 Palo Alto Networks, “Targeted Attacks in the Middle East Using KASPERAGENT and MICROPSIA,” Source:\n[https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/ [Last](https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/)\nAccessed April 19, 2021]\nKaspersky, “The Desert Falcons Targeted Attacks,” Source:\n[https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targ](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targeted-attacks.pdf)\n[eted-attacks.pdf [Last Accessed April 19, 2021]](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064309/The-Desert-Falcons-targeted-attacks.pdf)\nKaspersky, “Breaking The Weakest Link Of The Strongest Chain,” Source:\n[https://securelist.com/breaking-the-weakest-link-of-the-strongest-chain/77562/ [Last Accessed April 19, 2021]](https://securelist.com/breaking-the-weakest-link-of-the-strongest-chain/77562/)\nTrend Micro, “Arid Viper: Gaza vs Israel Cyber Conflict,” Source:\n[https://www.trendmicro.com/en_us/research/15/b/arid-viper-gaza-vs-israel-cyber-conflict.html [Last Accessed April](https://www.trendmicro.com/en_us/research/15/b/arid-viper-gaza-vs-israel-cyber-conflict.html)\n19, 2021]\nClearSky, “Infrastructure and Samples of Hamas’ Android Malware Targeting Israeli Soldiers,” Source:\n[https://www.clearskysec.com/glancelove/](https://www.clearskysec.com/glancelove/) [Last Accessed April 19, 2021]\nLookout, “FrozenCell: Multi-platform surveillance campaign against Palestinians,” Source:\n[https://blog.lookout.com/frozencell-mobile-threat](https://blog.lookout.com/frozencell-mobile-threat) [Last Accessed April 19, 2021]\n\n\n-----\n\nThis spike in account creation towards the later half of 2019 was observed\n\nalongside an increase in attempts to distribute both iOS and Android malware\n\nas well as phish credentials from users.\n\n\n-----\n\nFacebook’s automated malware analysis detection systems flagged many of Arid Viper\n\naccounts when they began sending malware on-platform or posted links to sites hosting custom\n\nmalware. Like other hacking groups in the region, Arid Viper has relied heavily on social\n\nengineering to initially infect victim devices and has not deviated from this low-cost approach.\n\n##### Victimology\n\nBased on the analysis of lure documents used in Arid Viper’s malware and other signals,\n\nmuch of this group's targeting was against individuals in Palestine. Of note, the targets\n\nincluded individuals affiliated with the Palestinian National Authority, Fatah, other oppositional\n\ngovernment organisations, security services, and student groups:\n\n\n\n - Palestinian National Authority\n\n - Ministry of National Economy\n\n - Palestinian Liberation Org\n\n - Palestinian Special Police\n\n - Ministry of Interior\n\n - Ministry of Education\n\n\n\n- Palestinian Preventative Security\n\n- Palestinian National Liberation\n\nMovement Fatah\n\n- Student movements aligned with Fatah\n\n- Other Government employees\n\n\n-----\n\n#### A Toolkit of Custom Malware for Multiple Platforms\n\nNone of the prior reporting on Arid Viper’s activities mention that the group had developed an\n\niOS capability.\n\n##### We believe this recent development reflects the group’s\n\n knowledge that some of their targets owned iPhones instead of\n\n Windows desktop or Android devices. It likely led them to fill a\n\n tooling gap, similar to the technological shift observed in 2014\n\n and 2015 where Arid Viper expanded their offensive tooling from\n\n primarily desktop to include an Android capability.\n\nBelow, we share our technical analysis of their recently discovered custom iOS malware,\n\nfollowed by analysis of their current Android capability, and a brief summary of their continued\n\nuse of Micropsia, a malware variant previously associated with this threat actor.\n\n##### In all cases the successful installation of these tools did not\n\n require any exploits. This suggests that Arid Viper operators\n\n continue to heavily rely on social engineering to distribute their\n\n malware.\n\n 1. Phenakite - Arid Viper’s iOS Implant\n\nThe latest tooling addition to Arid Viper’s arsenal, what we have internally named Phenakite, is\n\ncustom iOS malware discovered inside a fully functional trojanized chat application called Magic\n\nSmile. It makes use of publicly available code for both the legitimate chat component as well as\n\nthe Sock Port exploit and Osiris jailbreak that would be used post installation. Facebook initially\n\nfound Phenakite samples on a third party mobile application development site and later on Arid\n\nViper controlled infrastructure.\n\n\n-----\n\nScreenshots of the trojanized chat application that Arid Viper promoted on their\n\nwebsite. We also later saw this app on a third party app development site. While\n\nthe chat component was fully functional, malicious code would silently run in the\n\nbackground and retrieve sensitive information without user knowledge.\n\n##### 1.1.  Initial Device Compromise\n\nPhenakite was initially hosted on a website that contained tools and services to help with the\n\ndevelopment of Android and iOS apps. This website also included another component for iOS\n\ndevelopers which they could download and install, likely for testing and limited distribution. This\n\nprocess involved the use of legitimate developer certificates which meant that devices didn’t\n\nhave to be jailbroken. [3] As shown below, installing a malicious app required some degree of social\n\nengineering of the victim or physical access to their unlocked device.\n\nIf socially engineered, the victim must first be tricked into visiting an unofficial app store, third\n\nparty app development site, or attacker controlled website hosting Phenakite. Then, a user\n\nwould be prompted to install a mobile configuration profile that, if accepted, would allow for the\n\ndelivery and installation of Phenakite. This would be specifically signed for the target’s iPhone.\n\n3 Configuration Profile Examples, Source:\n[https://developer.apple.com/library/archive/documentation/NetworkingInternet/Conceptual/iPhoneOTAConfiguration/](https://developer.apple.com/library/archive/documentation/NetworkingInternet/Conceptual/iPhoneOTAConfiguration/ConfigurationProfileExamples/ConfigurationProfileExamples.html)\n[ConfigurationProfileExamples/ConfigurationProfileExamples.html](https://developer.apple.com/library/archive/documentation/NetworkingInternet/Conceptual/iPhoneOTAConfiguration/ConfigurationProfileExamples/ConfigurationProfileExamples.html) [Last Accessed April 19, 2021]\n\n\n-----\n\nOn the left: a page hosting Phenakite was found on a third party site that provides app\n\ndevelopment tools and services. On the right: the attacker controlled infrastructure\n\npromoting the trojanized Magic Smile chat application.\n\n\n-----\n\nShown above is what a target would see during this process and the verified\n\nsigning certificate chain. The signer used above is from the app delivery site and is\n\nnot directly unique to Arid Viper because of how the distribution site works and\n\nrotates through signing profiles. The unsigned XML representation of this is below.\n\n\n-----\n\nWhen Arid Viper previously had their tooling on the 3rd party app development site\n\nzc.pgyer[.]com, the profile that targets received would look similar to the screenshots shown\n\nearlier. If installed, key information would be sent from the target’s device to the store, which\n\ncould then be used to sign a device specific version of Arid Viper’s malware. This general\n\ninstallation flow is expected and intended for use by developers and enterprises.\n\nIn other Phenakite samples analyzed, a team name of Brenda Braun and a team identifier of\n\nJ22DGC9C5A were observed. When notified of this Apple was quick to take action against this\n\ndeveloper and revoke their certificate.\n\nThe embedded provisioning profile present in one of the Magic Smile samples contained 74\n\nunique device identifiers. When a developer certificate is used to install an iOS application, the\n\n\n-----\n\nunique device identifier (UDID) of a target iPhone needs to first be added to the associated\n\nprovisioning profile before the app can be installed. For this reason, the provisioning profile\n\ncontains a list of all UDIDs for devices that had this app installed which provides some insight\n\ninto how many devices Arid Viper may have compromised at a minimum. A small subset of these\n\nidentifiers have UDIDs that are 24 characters in length, indicating that they’re iPhone XS models\n\nor newer.\n\n##### 1.2.  Inclusion of Public Exploits\n\nWhile Phenakite does not require a jailbreak for installation, once on a device, it still must adhere\n\nto the usual operating system security controls that prevent access to sensitive information\n\nfrom unauthorized applications. To circumvent that, Phenakite comes bundled with the publicly\n\n[available Osiris](https://geosn0w.github.io/osiris/) [jailbreak and also includes the Sock Port exploit. This means that Phenakite is](https://github.com/jakeajames/sock_port/tree/master/sock_port)\n\ncapable of using Osiris to jailbreak all 64 bit devices on iOS 11.2 to 11.3.1 and Sock Port to extend\n\nthis to devices running iOS 10.0 to 12.2 (and potentially 12.4 and greater).\n\nCode snippets from Phenakite showing calls to the Osiris jailbreak on the left,\nand inclusion of the Sock Port exploit on the right.\n\n##### 1.3.  Capabilities\n\nThe ability for Phenakite to gather sensitive user data from a compromised device is highly\n\ndependent on the successful execution of the exploits that it comes with. If Osiris jailbreak is\n\nsuccessful then Phenakite has the following capabilities.\n\n\n-----\n\n- Retrieve photos from the camera roll\n\n- Take images with the device camera\n\n- Retrieve contacts\n\n- Silently record audio with the device\n\nmicrophone\n\n- Search for and return the path of files\n\nwith a doc or PDF extension\n\n- Search through application data stored\n\nto /var/mobile/Library &\n\n/var/mobile/Containers/Shared/\nAppGroup\n\n- Retrieve device metadata\n\n\n\n- Retrieve text messages\n\n- Upload WhatsApp media data\n\n- Searches for ChatStorage.sqlite,\n\nAccounts3.sqlite, CallHistory.storedata,\n\nnotes.sqlite, Calendar.sqlite,\n\nAddressBook.sqlitedb,\n\nitunesstored2.sqlitedb, Bookmarks.db,\n\nsms.db,\n\n- Retrieve attacker specified files\n\n- Collect any content sent or received via the\n\ntrojanized chat application\n\n\nPhenakite was also found to direct users to phishing sites for iCloud and Facebook if, during the\n\nchat application sign up process, they opted to use either of these services for authentication.\n\n\n-----\n\n_Code snippet in Phenakite that’s responsible for initially going into the WhatsApp_\n\n_/Message/Media directory and uploading any files present before recursively uploading_\n\n_any files in subdirectories._\n\n\n-----\n\nMan-in-the-middling traffic during local testing of a patched version of Phenakite found it to be\n\nperiodically recording audio and notifying C2 infrastructure, in this case our local test server.\n\nSimilarly, Phenakite periodically uses the camera of a compromised device to take photos and\n\nsends these automatically to attacker infrastructure.\n\n##### 1.4.  Scope of iOS targeting\n\nFacebook did not find any evidence to suggest Arid Viper had widely deployed Phenakite. We\n\nidentified only a handful of posts that contained links to websites known to host Arid Viper\n\nmalware. A misconfigured Firebase server with which infected devices would communicate\n\nshowed 81 users at the time of analysis. Closer inspection of the publicly exposed data on this\n\nfirebase instance suggests that at least several of the devices were fake adversary-controlled\n\naccounts, used to engage with and further socially engineer victims. For these reasons, the true\n\nnumber of targets is likely lower, which suggests Arid Viper sparingly used this malware.\n\nThroughout Facebook’s analysis of Phenakite, we regularly shared IOCs and TTPs with industry\n\npeers. This included full URLs to sites hosting malware as well as samples of the malware itself\n\nthat we found and analyzed. Because of these actions, and through industry collaboration, the\n\ndeveloper certificates used to sign Phenakite were quickly revoked and it appears Arid Viper's\n\niOS operations have paused at the time of this writing. This becomes more apparent when we\n\ncompare the frequency with which links to Arid Viper’s iOS malware were detected on Facebook\n\nto the revocation of Arid Viper’s developer certificates.\n\n\n-----\n\n##### 2. Evolving Android Surveillanceware\n\nAnalysis of the Android surveillanceware used by Arid Viper in their recent campaign revealed\n\nmany similarities to tooling previously attributed to APT-C-23, also known as Two-tailed\n\nscorpion. The ever-changing malware family attributed to APT-C-23 over the years includes\n\n[VAMP,](https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/) [GnatSpy,](https://blog.trendmicro.com/trendlabs-security-intelligence/new-gnatspy-mobile-malware-family-discovered/) [FrozenCell,](https://blog.lookout.com/frozencell-mobile-threat) [DesertScorpion, and ViperRAT. Facebook found recent variants](https://blog.lookout.com/desert-scorpion-google-play)\n\npretending to be popular Android applications for dating, networking, and regional banking in\n\nthe Middle East. Unlike Arid Viper’s iOS malware, the analyzed Android samples did not contain\n\n[any legitimate functionality. The main changes from earlier research centered primarily around](https://www.symantec.com/blogs/expert-perspectives/ongoing-android-malware-campaign-targets-palestinians-part-2)\n\ncode obfuscation being added by those developing this malware.\n\n\n-----\n\nAs with previous Arid Viper Android malware, many are trojanized chat applications that appear\n\nto facilitate dating. This approach is consistent with Arid Viper’s use of social engineering to\n\nengage potential victims from a romantic angle.\n\n\n-----\n\nConsistent with past reports of Arid Viper disguising their malware as updates for legitimate\n\napps, we found several fake app updates.\n\nUnlike Phenakite that came bundled with exploits in order to retrieve sensitive user data, the\n\nAndroid malware purely relies on a user granting it the required permissions upon installation. In\n\nsome cases, the Android malware contained functionality that forced targets to disable Google\n\nPlay Protect and give the app device admin permissions, making it harder to remove.\n\n\n-----\n\nThe analyzed Arid Viper Android malware contained the following functionality:\n\n\n\n- Record calls\n\n- Record environment audio for a specified\n\ntime period\n\n- Take screenshots or record video\n\n- Intercept and retrieve text messages\n\n- Take pictures with the device camera\n\n- Call attacker specified numbers\n\n- Restart wifi\n\n- Make USSD calls with the prefix *130* or\n\n*111*5* that are appended with\n\nattacker-controlled values\n\n- Dynamically check the device’s access\n\nand permissions\n\n- Logs device use information such as when\n\nshutdowns occur\n\n\n\n- Retrieve contact information\n\n- Track device location\n\n- Retrieve device metadata\n\n- Retrieve calendar information\n\n- Retrieve call logs\n\n- Copy, move, delete, and retrieve attacker\n\nspecified files\n\n- Open or delete attacker-specified apps\n\n- Dynamically update command and\n\ncontrol infrastructure settings to attacker\n\nspecified values\n\n- Scrapes notification information for\n\nWhatsApp, Instagram, Imo, Viber,\n\nand Skype\n\n- Uses the device camera to take a photo if it\n\ndetects a user present\n\n\nWhile analyzing recent Android surveillanceware used by Arid Viper we found that C2\n\ncommunication typically involved malware first contacting a number of attacker controlled sites\n\nthat had the sole purpose of providing implants with a primary C2 with which to upload user\n\ndata. This was likely implemented as a way to add additional complexity around the\n\nidentification of Arid Viper’s primary C2s. In addition, the values for those C2 domains first\n\ncontacted weren’t hardcoded in the Java layer, where they would be clearly visible, instead they\n\nwere encrypted and stored in a separate ELF binary.\n\n\n-----\n\nThe majority of Android samples were found to include an additional ELF binary named\n\nlibchat-lib.so. The purpose of this shared object was to likely slow down static analysis and make\n\nit harder to retrieve the initial command and control value.\n\n_Shown above is an example of how the initially contacted C2 domain is stored in the_\n\n_libchat-lib.so file of recent malware. ASCII characters are on the right with their_\n\n_equivalent hex representation on the left and, of note is that all encrypted content was_\n\n_found to be prepended with the same 16 bytes._\n\nThe initial C2 value is derived by taking the encrypted content above, base64 decoding it,\n\nand decrypting the output with AES in CBC mode and with PKCS7 padding specified.\n\nThe secret key in analyzed samples was static and was the SHA256 hash for the string\n\nAppCompatActivity_SPECIAL. The initialization vector used was a 16 byte array of 0’s. To get\n\nthe complete plaintext C2, the resulting string post AES decryption would be parsed, with\n\n\n-----\n\ninstances of & and % being removed and occurrences of the @ symbol being replaced with ‘s’.\n\nAn example of this output pre-substitution and removal of these characters is shown below.\n\nh&&&tt&&&&&p@://@ite%%%%%%@.g%%%oo%%%gle.%%%%%com/vi%ew/c%%%&&ak%&e-%mak%\n%%%er/&%%%%man&%%%dm@\n\nhttps://sites.google.com/view/cake-maker/mandms\n\nIncluded in the appendix is a simple decryption script that takes the encrypted and base64\n\nencoded initial C2 string as shown above and attempts to decrypt it. This script assumes that\n\nthe secret key is based on the AppCompatActivity_SPECIAL string, a 16 byte IV consisting of\n\nall zeros is used, and requires bouncy castle (we used bcprov-jdk15on-163.jar).\n\nResponses from initial C2s used to be JSON objects that an infected device would parse,\n\nhowever it appears Arid Viper was experimenting with different approaches. Initial C2s\n\nfrequently had the primary C2 domain slightly obfuscated and hidden in the returned HTML\n\ncontent. This can be seen below where a partial snippet of webpage source code shows the title\n\nof an initial C2 to the STACKS ZADAR WEBSITE. When rendered in a browser, this doesn’t\n\nprovide much indication that something is amiss, however when this page is parsed by an Arid\n\nViper sample created in late 2019 and 2020 we can see that it extracts this value and modifies it\n\nslightly to derive the primary C2 domain of stacks-zadar.website.\n\nSource code for one of the initial C2s that Arid Viper’s Android malware\n\ncommunicates with and uses to derive the primary command and control server.\n\n\n-----\n\nCode found in Arid Viper’s Android surveillanceware that strips out the title of the\n\npage returned by the initial C2.\n\nThe title extracted from the initial C2 is then used to derive the primary command and control\n\nserver before being saved to shared preferences with, in this case, the key of\n\nAPI_SETACTIVEACCOUNTS.\n\nLike earlier Android malware variants associated with Arid Viper, such as ViperRAT and\n\nFrozenCell, these newer samples made use of the publicly available Lingala Zip4J library to\n\ncompress files that are later uploaded to command and control infrastructure. Compressed\n\ncontent from this library can be password protected, which this actor previously chose to do\n\nthrough hard coded pass phrases. Over the years however, Arid Viper moved away from hard\n\ncoded pass phrases, choosing instead device-specific passphrases, such as the android_id\n\nvalue. To facilitate decryption, Arid Viper includes this value in the filename of uploaded data.\n\n\n-----\n\n##### 2.1. Android Phishing Sites\n\nRather than trying to send malware binaries directly to their intended victims, Arid Viper creates\n\na comprehensive set of authentic looking sites to host their malware in an attempt to make\n\nthem appear legitimate. While some of these sites are almost exact clones of websites for\n\nlegitimate applications such as ‘Wanna Meet’, others were built from the ground up by Arid Viper\n\ndevelopers or modified from publicly available templates. These fake sites were used to host the\n\nmalware and were not part of command and control infrastructure.\n\nIt appears that a substantial amount of time has been spent by this threat actor to continuously\n\ncreate and design sites used to host their surveillanceware.\n\n\n-----\n\nOn some of their Android phishing sites, targets are required to provide a coupon code or credit\n\ncard details before the surveillanceware is served up. In the course of the social engineering\n\ndialogue, it is believed the Arid Viper account would provide the coupon code to the intended\n\ntarget. This likely helped limit the unwanted distribution of their malware and may have\n\nfurthered the illusion that targets were downloading legitimate software.\n\nA phishing site for a trojanized version of the communication application Threema\nthat requires a user to have a coupon code before being able to download it.\n\n##### 3. Continued Development of Micropsia Windows Malware\n\nOver the time that we’ve been tracking Arid Viper, they have continually modified and updated\n\ntheir Windows malware arsenal, presumably as part of an ongoing cat and mouse game to avoid\n\ndetection by anti-virus software. In 2017, [Palo Alto Networks Unit 42](https://unit42.paloaltonetworks.com/unit42-targeted-attacks-middle-east-using-kasperagent-micropsia/) reported on two malware\n\nfamilies: KasperAgent and Micropsia, and today we still see variants of Micropsia in use. Arid\n\nViper has continued to develop new variants of the malware in multiple programming languages\n\nincluding Pascal, Delphi, Visual Studio C++, and even Python, as Unit 42 recently [reported.](https://unit42.paloaltonetworks.com/pymicropsia/)\n\n\n-----\n\nWe track these variants with several names, depending on the language they’re written in, that\n\nfall under the Micropsia malware family; Primewire (C++), fgref (C++), Sears (C++), Rahman\n\n(C++). PyMicropsia (Python), and Pierogi (Delphi/Free Pascal). While these variants are written\n\nin a variety of programming languages, they have similar capabilities, share a common high level\n\ncode structure, and have, on occasion, used the same command and control infrastructure.\n\n##### 3.1.  General Micropsia Behavior & Capability\n\nDespite the wide range of Micropsia variants developed by the actor, there are some general\n\nsimilarities in terms of behavior and capabilities. Most samples are found to have a combination\n\nof the following features:\n\n  - Drop or contain decoy documents\n\n  - Allow an attacker to run arbitrary commands\n\n  - Allow an attacker to download and run arbitrary files\n\n  - Use Base64 to obfuscate command and control communications\n\n  - Achieve persistence via a shortcut LNK in the startup folder\n\n  - Take and upload screenshots\n\n  - Install a keylogger\n\n  - Extract and upload stored credentials\n\n  - Search for files of specific types and add them to RAR archives for exfiltration\n\n##### 3.2.  Persistence\n\nMost of the samples investigated attempt to establish persistence on the system.\n\nThey often do this by creating a shortcut to the malware in the AppData\\Roaming\\Microsoft\\\n\nWindows\\Start Menu\\Programs\\Startup directory. The shortcut points to the malware’s\n\nlocation on disk. Additionally, some of the samples had the capability to also establish\n\npersistence via the Windows registry (Microsoft\\Windows\\CurrentVersion\\Run).\n\nThese persistence methods allow the samples to survive reboots.\n\n\n-----\n\n##### 3.3.  Command and Control Communication\n\nDespite the constant development and modification of the Microspsia malware, the data and\n\nformat of the command and control communication remains similar. The initial C2 beacon\n\ngenerally consists of some combination of the following details about the victim environment:\n\n  - Computer Name\n\n  - Installed Antivirus software\n\n  - Operating system version\n\n  - Path to sample\n\n  - Sample name\n\n  - Version of the malware\n\nThe chart above helps to visualize our observation of Micropsia variant usage over the past\n\ncouple years, based on the compile date of the sample. For some of the samples we were not\n\nable to get a useful compile date, and the PyMicropsia samples have the standard PyInstaller\n\ncompile date, so for those samples we used the date first observed in the wild or the earliest\n\nsubmission date to VirusTotal as an estimate.\n\n\n-----\n\nIn mid-2018, we started seeing a new Micropsia variant written in C++ which we track as\n\n[Primewire. This variant has similarities to Delphi samples published by Cisco in mid-2017 that](https://blog.talosintelligence.com/2017/06/palestine-delphi.html)\n\nwere reportedly used to target Palestinians. Like other malware used by Arid Viper there are\n\nfrequent references to popular culture, and in this case, Game of Throne themed strings were\n\npresent. One area where Arid developers like to make regular changes to the code is in the C2\n\nbeacon formatting. Some Primewire samples utilize “multipart/form-data” for command and\n\ncontrol check-ins, similar to earlier Micropsia samples, whereas other samples combine the C2\n\nparameters into a single “application/x-www-form-urlencoded” POST body.\n\nAround the same time in 2018 as Primewire was in use, another new variant that we call “Fgref”\n\nappeared, also written in C++ but with only a 70% code similarity to Primewire. We’ve identified\n\na number of Fgref samples compiled from summer 2018 through fall 2019, with an additional\n\nsample surfacing in October 2020. Another very similar variant we call “Sears” appeared in late\n\n2019 and used until early 2020. Sears implemented a slight change to the C2 format, but\n\notherwise shared a 96% code similarity to Fgref.\n\nAn additional C++ Micropsia variant, which we track as “Rahman” appeared in mid-2020 and\n\nwas used at least through the end of the year. This variant has an approximately 90% code\n\nsimilarity to Fgref and Sears, so again it is only a minor revision of their previous malware with\n\ndistinctive command and control traffic.\n\nThe most widely used variant we’ve seen was reported on by [Cybereason in February 2020,](https://www.cybereason.com/blog/new-cyber-espionage-campaigns-targeting-palestinians-part-2-the-discovery-of-the-new-mysterious-pierogi-backdoor)\n\nwhich they called “Pierogi”. Many of the samples were written in Delphi, like the original\n\nMicropsia samples, and packed with the BobSoft Mini-Delphi packer, however, Pierogi variants\n\nwere also seen that were compiled in Free Pascal. The earliest Pierogi samples we’ve found date\n\nback to the fall of 2019 (Delphi), with the Free Pascal versions appearing a few months later in\n\nthe winter of the same year. Pierogi uses either “multipart/form-data'' or\n\n“application/x-www-form-urlencoded” data for check-ins depending on the sample, and\n\n“application/x-www-form-urlencoded” data for uploading screenshots (not all samples have\n\nthis functionality) etc. Pierogi usage continues, with samples identified as recently as\n\nNovember 2020.\n\nThe python variant of Micropsia, named PyMicropsia by Unit 42, appears to have been in the\n\nwild for some time and was previously undetected by the security community. The earliest\n\nsubmission date to VirusTotal was in January of 2019, and the odd strings align with those found\n\n\n-----\n\nin Fgref samples from that same timeframe, e.g. “Gal_Gadot”. The PyMicropsia samples are\n\ndistinctive since they beacon with the standard python-requests user-agent.\n\nWe have also identified a variant we call Glasswire that appears to be written and compiled in\n\nEmbarcadero Delphi, and the samples are often packed with BobSoft Mini-Delphi packer. This\n\nvariant is very similar to Pierogi (which is normally compiled with the Free Pascal compiler), but\n\nmany samples have the same C2 variable names and format as the C++ Rahman samples seen in\n\nmid-late 2020. Glasswire dates back to mid-2020 and has been seen as recently as March 2021.\n\nThese samples have interesting Program Name compiler metadata including\n\n“ProxyHostDownload”, “extraWebServer”, “AZ5”, and “pyDownApp”.\n\n##### 4. Phishing & Credential Theft\n\nArid Viper has also utilized phishing emails and links to phishing web pages that spoof popular\n\nweb services including Facebook and Yahoo email. These are unsophisticated sites that simply\n\nmirror content from the legitimate site, and rely on look-alike domain names such as\n\nfasebaook.com (Facebook), autlook.live (Outlook) and log-yoahao.co (Yahoo), which have the\n\npotential to be confused for the real site by non-native English speakers.\n\n##### 4.1.  Central Elections Commission Impostor Site\n\nIn late November 2019, Arid Viper actors registered the domain enti5abat[.]pw (enti5abat\n\ntranslates to elections in Arabic) and created a website which mimics the Palestine Central\n\nElections Commission (CEC), whose actual domain is elections[.]ps. The spoof site borrowed the\n\ngeneral format and included the logo from the CEC and in some cases mirrored actual content\n\nfrom the real CEC website. The crucial difference with the spoofed side is that if a user clicks the\n\nsocial media links at the top, instead of opening up a new window to the CEC’s YouTube, Twitter\n\nor Facebook page as they do on the legitimate page, instead they are presented a fake login\n\npage for the respective service (Facebook, Yahoo, Google) to trick targets into submitting\n\ntheir credentials.\n\nThis was significant because Palestine has not had a Presidential election since 2005, although\n\nthere were discussions about having elections in both 2014 and 2018 that eventually fell\n\nthrough. In the early fall of 2019, Mahmoud Abbas, President of the Palestinian National\n\nAuthority, announced at the UN General Assembly that he intended to set a date in early 2020\n\n\n-----\n\nfor general elections to be held finally. After initially rejecting the terms Abbas had laid out for\n\nthe elections, Hamas agreed to participate. After further delays, the Palestinian Presidential\n\nelections are schedule to happen in May 2021, and so far we have not seen a similar attempt by\n\nArid Viper to re-engage in this type of activity for the upcoming elections.\n\n\n-----\n\n#### Conclusion\n\nFacebook's investigation found that the long running threat actor known as Arid Viper recently\n\nexpanded their offensive toolkit to include iOS malware that we believe is being deployed in\n\ntargeted attacks against pro-Fatah groups and individuals. As the technological sophistication\n\nof Arid Viper can be considered to be low to medium, this expansion in capability should signal\n\nto defenders that other low-tier adversaries may already possess, or can quickly develop,\n\nsimilar tooling.\n\nOur hope is that by sharing insights into these attacks, the increased awareness will allow those\n\ndirectly impacted by these attacks to avoid device compromise, that security teams will have a\n\nbetter understanding of the possible attack vectors that can take place against their\n\norganization's mobile fleet and that these new signals will allow the larger security community to\n\ntrack this persistent threat actor.\n\n\n-----\n\n#### APPENDIX\n\n##### Indicators of Compromise\n\n I. Domains used by Arid Viper\n\n Google Sites Pages\n\nThese sites were found to contain the primary C2 address semi-obfuscated in their page title:\n\n- sites.google[.]com/view/cake-maker/mandms\n\n- sites.google[.]com/view/claudia-rose/get_page\n\n- sites.google[.]com/view/brandon-clarkson/access_page\n\n- sites.google[.]com/view/amber-stack/valid\n\n- sites.google[.]com/view/john-hernandez/path_page\n\n- sites.google[.]com/view/jasmine-king/new_page\n\n- sites.google[.]com/view/geo-taro/stacks\n\n- sites.google[.]com/view/charlok/adlov\n\n##### iOS Firebase Instance\n\n- magicchat-1f275.firebaseio[.]com\n\n##### Android Firebase Instances\n\nThe following Firebase instances were used by Arid Viper malware to store chat threads from\n\ntrojanized apps as well as exfiltrated information.\n\n\n\n- dash-chat-c02b3.firebaseio[.]com\n\n- dash-chat-c02b3.appspot[.]com\n\n- hidden-chat-e58d7.firebaseio[.]com\n\n- hidden-chat-e58d7.appspot[.]com\n\n- calculator-1e016.firebaseio[.]com\n\n- calculator-1e016.appspot[.]com\n\n- samehnew-10a7c.firebaseio[.]com\n\n\n\n- samehnew-10a7c.appspot[.]com\n\n- play-store-51182.firebaseio[.]com\n\n- play-store-51182.appspot[.]com\n\n- stand-by-97c5c.firebaseio[.]com\n\n- stand-by-97c5c.appspot[.]com\n\n- es-last-telegram.firebaseio[.]com\n\n- es-last-telegram.appspot[.]com\n\n\n-----\n\n- winetalk-9ff2d.firebaseio[.]com\n\n- winetalk-9ff2d.appspot[.]com\n\n- moone-b9497.firebaseio[.]com\n\n- moone-b9497.appspot[.]com\n\n##### Android C2 Domains\n\n- kevin-good[.]top\n\n- marty-colvard[.]top\n\n- anna-sanchez[.]online\n\n- robert-conley[.]space\n\n- wendy-johnston[.]pw\n\n- jennifer-marler[.]pw\n\n- goerge-amper[.]website\n\n- stacks-zadar[.]website\n\n- joe-rumley[.]pw\n\n- richardbeman[.]info\n\n##### Android Malware Hosting Sites\n\n\n\n- nachat-152615.firebaseio[.]com\n\n- nachat-152615.appspot[.]com\n\n- chat-14bb1.firebaseio[.]com\n\n- chat-14bb1.appspot[.]com\n\n- vickeryduncan[.]site\n\n- moggfelicio[.]info\n\n- stevensmalley[.]pro\n\n- kentporter[.]site\n\n- chad-jessie[.]info\n\n- lordblackwood[.]club\n\n- julie-parker[.]top\n\n- tim-jordan[.]info\n\n- hannah-parsons[.]info\n\n\nBelow is a list of websites that were controlled by Arid Viper and used to promote and host their\n\nmalware:\n\n\n\n- social-store[.]online\n\n- power-messenger[.]com\n\n- dash-chat[.]site\n\n- claytoniosep[.]live\n\n- chat-update[.]live\n\n- apps-store[.]online\n\n- williedvazquez[.]club\n\n- paulycongalton[.]pro\n\n- goo-ply-download[.]com\n\n- stand-by[.]site\n\n- jayboyadams[.]club\n\n- social-store[.]online\n\n- fast-download[.]pro\n\n\n\n- sandra-franklin[.]fun\n\n- hidden-chat[.]online\n\n- wannameet[.]co\n\n- loyronald[.]site\n\n- gp-market[.]com\n\n- beauty-msg[.]com\n\n- melissa-garcia[.]site\n\n- apps-download[.]store\n\n- smart-messenger[.]online\n\n- mix-store[.]online\n\n- products-office[.]online\n\n- wine-talk[.]online\n\n- day-on[.]site\n\n\n-----\n\n- side-talk[.]com\n\n- app-market[.]online\n\n- telegrom[.]org\n\n- vista-chat[.]com\n\n- lets-msger[.]fun\n\n- hookupdating[.]club\n\n- hookupmsg[.]club\n\n##### Micropsia C2 domains\n\n- marwapetersson[.]info\n\n- norayowell[.]info\n\n- ansonwhitmore[.]live\n\n- nicoledotson[.]icu\n\n- mikkelbourke[.]pro\n\n- belcherjacky[.]info\n\n##### iOS Malware Hosting Sites\n\n- zc.pgyer[.]com/5SRZ (third party site)\n\n- zc.pgyer[.]com/avwvei (third party site)\n\n- magic-store[.]online\n\n- magic4smile[.]com\n\n##### iOS Malware C2 Domains\n\n- margarita-smith[.]host\n\n##### Credential Theft Domains\n\n- fasibauik[.]co\n\n- fasebcak[.]co\n\n- fasebcck[.]com\n\n- fasebcoki[.]com\n\n- fasebcak[.]com\n\n- fasbcaok[.]com\n\n\n\n - fire-upload[.]host\n\n - files-store[.]host\n\n - heidi-minaya[.]host\n\n - sha-talk[.]co\n\n - whispers-talk[.]site\n\n - pure-talk[.]site\n\n - digital-apps[.]store\n\n - amanda-hart[.]website\n\n - overingtonray[.]info\n\n - scorerabbate[.]site\n\n - irenewansley[.]icu\n\n - judystevenson[.]info\n\n - gallant-william[.]icu\n\n - linda-callaghan[.]icu\n\n - magicsmile[.]fun\n\n - magic-smile[.]fun\n\n - magic-smile[.]co\n\n- fasebaak[.]com\n\n- fasebaok[.]co\n\n- fasebaook[.]com\n\n- fasebaok[.]com\n\n- log-yoahao[.]co\n\n- log-yoheo[.]info\n\n\n-----\n\n- fecolooklegon[.]000webhostapp[.]com\n\n- faseback[.]com\n\n- fcaibaak[.]com\n\n- fasitoak[.]com\n\n##### Suspicious / Uncategorized Domains\n\n\n\n- iklood[.]co\n\n- ikoad[.]co\n\n- enti5abat[.]pw\n\n\nDomains that were down at the time of analysis but are believed to be a mix of credential\n\nphishing, C2s, and fake sites hosting Arid Android and Windows malware.\n\n\n\n- vista-chat[.]com\n\n- lets-msger[.]fun\n\n- hookupdating[.]club\n\n- fire-upload[.]host\n\n- files-store[.]host\n\n- hamas31[.]000webhostapp[.]com\n\n- krasil-anthony[.]icu\n\n- stikerscloud[.]com\n\n- donnamfelton[.]club\n\n- accounts-goog-le[.]com\n\n- palpolice[.]icu\n\n- moi-pna[.]pw\n\n- shortesly[.]website\n\n- putanything[.]com\n\n- uri-ready[.]website\n\n- url-redirect[.]website\n\n- cathy-seliver[.]icu\n\n- wab-wahtsapp[.]com\n\n- networkmiddleast[.]net\n\n- robertking[.]site\n\n- jodiecarey[.]live\n\n- stevenfloyd[.]icu\n\n- melissa-gonzalez[.]com\n\n- jeremy-tanner[.]live\n\n- frowtisice[.]club\n\n- ubanks[.]icu\n\n\n\n- rythergannon[.]info\n\n- isaac-rowland[.]space\n\n- charmainellauzier[.]host\n\n- amyacunningham[.]us\n\n- lonakodas[.]club\n\n- skelly-chester[.]icu\n\n- alttaeb[.]info\n\n- cynthiaecook[.]club\n\n- alishatnixon[.]site\n\n- randy-severs[.]info\n\n- spartacuscrixus[.]club\n\n- advanced-files[.]club\n\n- leticialittle[.]pro\n\n- bourneliam[.]info\n\n- katesalinas[.]icu\n\n- autlook[.]live\n\n- darrell-ferris[.]site\n\n- tommy-swope[.]site\n\n- herman-poore[.]info\n\n- kimberlycamp[.]club\n\n- enough-hamas[.]000webhostapp[.]com\n\n- hadfnews[.]000webhostapp[.]com\n\n- vedioplayers2020[.]000webhostapp[.]co\n\nm\n\n- drivesuplouders[.]000webhostapp[.]com\n\n- touch[.]ps\n\n\n-----\n\n- gifts-store[.]net\n\n##### II. Malware Hashes\n\n iOS Hashes\n\n**MD5 Hash**\n\ne567efd5c800c5b0c6eb5aa0bccc10e9\n(Mach-O)\n\n4a3ba18ecc4b74d4321912882e175976\n(Mach-O)\n\n##### Android Hashes\n\nRepresentative set of hashes:\n\n**MD5 Hashes**\n\n- a7a07b5c9d606fbc5480ebd5acd2cf1d\n\n- 64034ca28c0844690f0a195534fff168\n\n- 58333095cd9c36b7388901ce997baa0c\n\n- 82254d20e63491be3dfcdc0ad9a9dc6b\n\n- 250da45d3c509420836958547c8496ab\n\n##### Micropsia Hashes\n\nHashes for representative variants:\n\n|iOS Hashes|Col2|Col3|\n|---|---|---|\n|MD5 Hash|C2s|Hosted on|\n|e567efd5c800c5b0c6eb5aa0bccc10e9 (Mach-O)|margarita-smith[.]host magicchat-1f275.fireba seio[.]com|magic4smile[.]com|\n|4a3ba18ecc4b74d4321912882e175976 (Mach-O)|margarita-smith[.]host magicchat-1f275.fireba seio[.]com|zc.pgyer[.]com|\n\n\n\n- 6b2970664cac51054906983f97bd5419\n\n- c3a7779e3eee4885078e03601fb2648b\n\n- dd8485d87d8998d47de4f5dfcc9213e1\n\n- 8b48cec7cb30ff0f02b06c51aa15f24f\n\n- 8b074a0c693d287fca74231d2d6d3a99\n\n|MD5 Hash|Variant|Compiler|\n|---|---|---|\n|a913d9d9dfc7670df5f3a235b1398be8|Micropsia|Delphi|\n|6e7b5c71f7ea462c47dc992090cd4d58|Primewire|VS C++|\n\n\n-----\n\n|7ea20c7c999bbd59e9b90309c0afa972|Fgref|VS C++|\n|---|---|---|\n|1507f7ecc5fe8ef4c90c853d64e1a9f9|Sears|VS C++|\n|bbe4dddc09dcef160db0fd4c24c4f052|Rahman|VS C++|\n|e8effd3ad2069ff8ff6344b85fc12dd6|Pierogi|Free Pascal|\n|ca1d9908f32ee5c0bdd9b4efec79108f|PyMicropsia|Python|\n|7833c0f413c1611f7281ac303bcef4b3|Glasswire|Embarcadero Delphi|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://about.fb.com/wp-content/uploads/2021/04/Technical-threat-report-Arid-Viper-April-2021.pdf"
    ],
    "report_names": [
        "Technical-threat-report-Arid-Viper-April-2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b1979c55-037a-415f-b0a3-cab7933f5cd4",
            "created_at": "2024-04-24T02:00:49.561432Z",
            "updated_at": "2025-03-27T02:00:55.493381Z",
            "deleted_at": null,
            "main_name": "APT-C-23",
            "aliases": [
                "APT-C-23",
                "Arid Viper",
                "Desert Falcon",
                "TAG-63",
                "Grey Karkadann",
                "Big Bang APT",
                "Two-tailed Scorpion"
            ],
            "source_name": "MITRE:APT-C-23",
            "tools": [
                "Micropsia"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "77c08a4a-b3f9-43ee-9d84-04ba572b7564",
            "created_at": "2024-05-01T02:03:07.927023Z",
            "updated_at": "2025-03-27T02:05:17.248836Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SHADYSIDE",
            "aliases": [
                "Arid Viper ",
                "Desert Falcon ",
                "APT-C-23 "
            ],
            "source_name": "Secureworks:ALUMINUM SHADYSIDE",
            "tools": [
                " SpyC23",
                "Micropsia"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "efe6ff9a-822d-41a6-90c3-45265cac696b",
            "created_at": "2024-05-01T02:03:07.920302Z",
            "updated_at": "2025-03-27T02:05:17.246342Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SARATOGA",
            "aliases": [
                "Arid Viper",
                "Desert Falcon",
                "Extreme Jackal ",
                "Gaza CyberGang",
                "Gaza CyberGang",
                "Molerats ",
                "Operation DustySky ",
                "TA402",
                "APT-C-23"
            ],
            "source_name": "Secureworks:ALUMINUM SARATOGA",
            "tools": [
                " BrittleBush",
                " DarkComet",
                " LastConn",
                " Micropsia",
                " NimbleMamba",
                " PoisonIvy",
                " QuasarRAT",
                " XtremeRat",
                "BlackShades"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1618939639,
    "ts_modification_date": 1618939639,
    "files": {
        "pdf": "https://archive.orkl.eu/dc641767dfecf2604e634d2a849c5988dc010621.pdf",
        "text": "https://archive.orkl.eu/dc641767dfecf2604e634d2a849c5988dc010621.txt",
        "img": "https://archive.orkl.eu/dc641767dfecf2604e634d2a849c5988dc010621.jpg"
    }
}