{
    "id": "64fe0070-6505-45e9-b90b-95c80e69ae86",
    "created_at": "2023-01-12T15:03:04.962912Z",
    "updated_at": "2025-03-27T02:16:34.835647Z",
    "deleted_at": null,
    "sha1_hash": "2e371e61f2fdbcd94cf74010db98ca6960a03ba8",
    "title": "2020-12-28 - Using Microsoft 365 Defender to protect against Solorigate",
    "authors": "",
    "file_creation_date": "2022-05-28T23:07:14Z",
    "file_modification_date": "2022-05-28T23:07:14Z",
    "file_size": 3758238,
    "plain_text": "# Using Microsoft 365 Defender to protect against Solorigate\n\n**[microsoft.com/security/blog/2020/12/28/using-microsoft-365-defender-to-coordinate-protection-against-solorigate/](https://www.microsoft.com/security/blog/2020/12/28/using-microsoft-365-defender-to-coordinate-protection-against-solorigate/)**\n\nDecember 28, 2020\n\n**UPDATE: Microsoft continues to work with partners and customers to expand our**\nknowledge of the threat actor behind the nation-state cyberattacks that compromised\nthe supply chain of SolarWinds and impacted multiple other organizations. Microsoft\npreviously used ‘Solorigate’ as the primary designation for the actor, but moving\nforward, we want to place appropriate focus on the actors behind the sophisticated\nattacks, rather than one of the examples of malware used by the actors. Microsoft\nThreat Intelligence Center (MSTIC) has named the actor behind the attack against\nSolarWinds, the SUNBURST backdoor, TEARDROP malware, and related\n[components as NOBELIUM. As we release new content and analysis, we will use](https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/)\nNOBELIUM to refer to the actor and the campaign of attacks.\n\nMicrosoft security researchers continue to investigate and respond to the sophisticated\n[cyberattack known as Solorigate (also referred to as Sunburst by FireEye) involving a supply](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:MSIL/Solorigate.B!dha)\nchain compromise and the subsequent compromise of cloud assets. While the related\ninvestigations and impact assessments are ongoing, Microsoft is providing visibility into the\nattack chains and related threat intelligence to the defender community as early as possible\nso organizations can identify and take action to stop this attack, understand the potential\nscope of its impact, and begin the recovery process from this active threat. We have\nestablished a resource center that is constantly updated as more information becomes\n[available at https://aka.ms/solorigate.](https://aka.ms/solorigate)\n\n\n-----\n\n**This blog is a comprehensive guide for security operations and incident response**\n**teams using Microsoft 365 Defender to identify, investigate, and respond to the**\n**Solorigate attack if it’s found in your environment. The description of the attack in this blog**\nis based on current analysis and investigations by researchers across Microsoft, our\npartners, and the intelligence community who are actively collaborating to respond to the\nattack. This is an active threat that continues to evolve, and the findings included here\nrepresent what we know at the time of publishing. We continue to publish and update\nintelligence, indicators, tactics, techniques, and procedures (TTPs), and related details as we\n[discover them. The report from the Microsoft Security Response Center (MSRC) includes the](https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/)\nlatest analysis of this threat, known indicators of compromise (IOCs), and initial\nrecommended defenses, and will be updated as new data becomes available.\n\nThis blog covers:\n\n## Tracking the cross-domain Solorigate attack from endpoint to the cloud\n\nThe Solorigate attack is an example of a modern cross-domain compromise. Since these\nkinds of attacks span multiple domains, having visibility into the entire scope of the attack is\nkey to stopping and preventing its spread.\n\nThis attack features a sophisticated technique involving a software supply chain compromise\nthat allowed attackers to introduce malicious code into signed binaries on the SolarWinds\nOrion Platform, a popular IT management software. The compromised application grants\nattackers “free” and easy deployment across a wide range of organizations who use and\nregularly update the application, with little risk of detection because the signed application\nand binaries are common and are considered trusted. With this initial widespread foothold,\nthe attackers can then pick and choose the specific organizations they want to continue\noperating within (while others remain an option at any point as long as the backdoor is\ninstalled and undetected). Based on our investigations, the next stages of the attack involve\non-premises activity with the goal of off-premises access to cloud resources through the\nfollowing steps:\n\n1. Using the compromised SolarWinds DLL to activate a backdoor that enables attackers\n\nto remotely control and operate on a device\n2. Using the backdoor access to steal credentials, escalate privileges, and move laterally\n\nto gain the ability to create valid SAML tokens using any of two methods:\n\n1. Stealing the SAML signing certificate (Path 1)\n2. Adding to or modifying existing federation trust (Path 2)\n3. Using attacker-created SAML tokens to access cloud resources and perform actions\n\nleading to the exfiltration of emails and persistence in the cloud\n\n\n-----\n\n_Figure 1. High-level end-to-end Solorigate attack chain_\n\nThis attack is an advanced and stealthy campaign with the ability to blend in, which could\nallow attackers to stay under the radar for long periods of time before being detected. The\n[deeply integrated cross-domain security capabilities in Microsoft 365 Defender can empower](https://www.microsoft.com/microsoft-365/security/microsoft-365-defender)\norganizations and their security operations (SOC) teams to uncover this attack, scope out\nthe end-to-end breach from endpoint to the cloud, and take action to block and remediate it.\nThis blog will offer step-by-step guidance to do this by outlining:\n\nHow indicators of attack show up across endpoints, identity, and the cloud\nHow Microsoft 365 Defender automatically combines alerts across these different\ndomains into a comprehensive end-to-end story\nHow to leverage the powerful toolset available for deep investigation, hunting, and\nresponse to enable SOCs to battle the attackers and evict these attackers from both\non-premises and cloud environments\n\n### Threat analytics: Understanding and responding to active attacks\n\n[As soon as this attack was discovered, Microsoft researchers published two threat analytics](https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/threat-analytics)\nreports to help organizations determine if they are affected, assess the impact of the attack,\nand identify actions to contain it.\n\n[Sophisticated actor attacks FireEye provides information about the FireEye breach and](https://security.microsoft.com/threatanalytics3/a43fc0c6-120a-40c5-a948-a9f41eef0bf9/overview)\ncompromised red team tools\n[Solorigate supply chain attack provides a detailed analysis of the SolarWinds supply](https://security.microsoft.com/threatanalytics3/2b74f636-146e-48dd-94f6-5cb5132467ca/overview)\nchain compromise\n\n[The reports are published in Microsoft 365 security center, available to all Microsoft Defender](https://security.microsoft.com/)\nfor Endpoint customers and Microsoft 365 Defender early adopters. In addition to detailed\ndescriptions of the attack, TTPs, and indicators of compromise (IoCs), the reports provide\nreal-time data aggregated from signals across Microsoft 365 Defender, indicating the all-up\n\n\n-----\n\nimpact of the threat to the organization, as well as details about relevant incidents and alerts\nto initiate investigation on. These reports continue to be updated as additional information\nbecomes available.\n\nGiven the significance of this threat, we are making similar relevant Microsoft threat\nintelligence data, including the updated list of IOCs, available to everyone publicly. A\n[comprehensive list of guidance and insights is available at https://aka.ms/solorigate.](https://aka.ms/solorigate)\n\n_Figure 2. Threat analytics report on Solorigate attack_\n\nWe recommend Microsoft 365 Defender customers to start their investigations here. After\ngaining deep understanding of the threat and getting the latest research findings, you can\ntake the following recommended steps:\n\n### Find devices with the compromised SolarWinds Orion application\n\n[The threat analytics report uses insights from threat and vulnerability management to identify](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/next-gen-threat-and-vuln-mgt)\ndevices that have the compromised SolarWinds Orion Platform binaries or are exposed to\nthe attack due to misconfiguration.\n\nFrom the Vulnerability patching status chart in threat analytics, you can view the mitigation\ndetails to see a list of devices with the vulnerability ID TVM-2020-0002, which was added\nspecifically to help with Solorigate investigations:\n\n\n-----\n\n_Figure 3. Threat and vulnerability management data shows data on exposed devices_\n\nThreat and vulnerability management provides more info about the vulnerability ID TVM2020-0002, as well as all relevant applications, via the Software inventory view. There are\nalso multiple security recommendations to address this specific threat, including instructions\nto update the software versions installed on exposed devices.\n\n_Figure 4. Security recommendations from threat and vulnerability management_\n\n### Investigate related alerts and incidents\n\nFrom the threat analytics report, you can quickly locate devices with alerts related to the\nattack. The Devices with alerts chart identifies devices with malicious components or\nactivities known to be directly related to Solorigate. Click through to get the list of alerts and\ninvestigate.\n\nSome Solorigate activities may not be directly tied to this specific threat but will trigger alerts\ndue to generally suspicious or malicious behaviors. All alerts in Microsoft 365 Defender\nprovided by different Microsoft 365 products are correlated into incidents. Incidents help you\n\n\n-----\n\nsee the relationship between detected activities, better understand the end-to-end picture of\nthe attack, and investigate, contain, and remediate the threat in a consolidated manner.\n\n[Review incidents in the Incidents queue and look for those with alerts relevant to this](https://docs.microsoft.com/microsoft-365/security/mtp/investigate-incidents?view=o365-worldwide)\nattacker’s TTPs, as described in the threat analytics report (also listed at the end of this\nblog).\n\n_Figure 5. Consolidated Incident view for Solorigate_\n\n[Some alerts are specially tagged with Microsoft Threat Experts to indicate malicious activities](https://aka.ms/threatexperts)\nthat Microsoft researchers found in customer environments during hunting. As part of the\nMicrosoft Threat Experts service, researchers investigated this attack as it unfolded, hunting\n[for associated attacker behaviors, and sent targeted attack notifications. If you see an alert](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/microsoft-threat-experts#targeted-attack-notification)\ntagged with Microsoft Threat Experts, we strongly recommend that you give it immediate\nattention.\n\n\n-----\n\n_Figure 6. Microsoft Threat Experts targeted attack notification_\n\nAdditionally, Microsoft Threat Experts customers with [Experts on demand subscriptions can](https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/microsoft-threat-experts#collaborate-with-experts-on-demand)\nreach out directly to our on-demand hunters for additional help in understanding the\nSolorigate threat and the scope of its impact in their environments.\n\n### Hunt for related attacker activity\n\n[The threat analytics report also provides advanced hunting queries that can help analysts](https://docs.microsoft.com/microsoft-365/security/mtp/advanced-hunting-overview?view=o365-worldwide)\nlocate additional related or similar activities across endpoint, identity, and cloud. Advanced\nhunting uses a rich set of data sources, but in response to Solorigate, Microsoft has enabled\nstreaming of Azure Active Directory (Azure AD) audit logs into advanced hunting, available\nfor all customers in [public preview. These logs provide traceability for all changes done by](https://docs.microsoft.com/microsoft-365/security/mtp/preview?view=o365-worldwide)\nvarious features within Azure AD. Examples of audit logs include changes made to any\nresources within Azure AD, such as adding or removing users, apps, groups, roles, and\npolicies. Customers who do not have Microsoft Defender for Endpoint or are not early\n[adopters for Microsoft 365 Defender can see our recommended advanced hunting queries.](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries)\n\nCurrently, this data is available to customers who have Microsoft Cloud App Security with the\n[Office365 connector. Our intent is to expand availability to more Microsoft 365 Defender](https://docs.microsoft.com/cloud-app-security/connect-office-365-to-microsoft-cloud-app-security)\n[customers. The new log data is available in the CloudAppEvents table:](https://docs.microsoft.com/microsoft-365/security/mtp/advanced-hunting-cloudappevents-table?view=o365-worldwide)\n\n_CloudAppEvents_\n\n_| where Application == “Office 365”_\n\n\n-----\n\nThe log data contains activity logs useful for investigating and finding Azure AD-related\nactivities. This data further enriches the CloudAppEvents table, which also has Exchange\nOnline and Microsoft Teams activities.\n\nAs part of making this new data available, we also published a handful of relevant advanced\nhunting queries, identified by the suffix [Solorigate], to the GitHub repo.\n\nHere’s an example query that helps you see when credentials are added to an Azure AD\napplication after ‘Admin Consent’ permissions were granted:\n\n_CloudAppEvents_\n_| where Application == “Office 365”_\n_| where ActionType == “Consent to application.”_\n_| where RawEventData.ModifiedProperties[0].Name == “ConsentContext.IsAdminConsent”_\n_and RawEventData.ModifiedProperties[0].NewValue == “True”_\n_| extend spnID = tostring(RawEventData.Target[3].ID)_\n_| parse RawEventData.ModifiedProperties[4].NewValue with * “=> [[” dummpy “Scope: ” After_\n_“]]” *_\n_| extend PermissionsGranted = split(After, “]”,0)_\n_| project ConsentTime = Timestamp, AccountDisplayName, spnID, PermissionsGranted_\n_| join (_\n_CloudAppEvents_\n_| where Application == “Office 365”_\n_| where ActionType == “Add service principal credentials.” or ActionType == “Update_\n_application – Certificates and secrets management “_\n_| extend spnID = tostring(RawEventData.Target[3].ID)_\n_| project AddSecretTime = Timestamp, AccountDisplayName, spnID_\n_) on spnID_\n_| where ConsentTime < AddSecretTime and AccountDisplayName <> AccountDisplayName1_\n\nMicrosoft 356 Defender advanced hunting can also assist in many of the recommended\nincident investigation tasks outlined in the blog, Advice for incident responders on recovery\nfrom systemic identity compromises.\n\nIn the remaining sections, we will discuss select examples of alerts raised by Microsoft 365\nsolutions that monitor and detect Solorigate activities across the attack chain on endpoint,\nidentity, and the cloud. These are alerts you may encounter when investigating incidents in\nMicrosoft 365 security center if your organization is affected by this threat. We will also\nindicate activities which are now blocked by Microsoft 365 Defender. Lastly, each section\ncontains examples of hunting queries you will find useful for hunting for various attacker\nactivities in your environment.\n\n## Detecting and blocking malware and malicious behavior on endpoints\n\n\n-----\n\n_Figure 7. Solorigate attack chain: Initial access and command-and-control_\n\n### Discovering and blocking backdoor activity\n\nWhen the compromised SolarWinds binary SolarWinds.Orion.Core.BusinessLayer.dll gets\nloaded on a device through normal update channels, the backdoor goes through an\nextensive list of checks to ensure it’s running in an actual enterprise network and not on an\nanalyst’s machine. It then contacts a command-and-control (C2) server using a subdomain\nthat is generated partly with information gathered from the affected device, which means a\nunique subdomain is generated for each affected domain. The backdoor allows the attackers\nto remotely run commands on the device and move to the next stages of the attack. For\n[more information, read our in-depth analysis of the Solorigate malware.](https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/)\n\nMicrosoft Defender for Endpoint delivers comprehensive protection against this threat (see\nfull list of detection and protection alerts at the end of this blog). Microsoft Defender Antivirus,\n[the default antimalware solution on Windows 10, detects and blocks the malicious DLL and](https://www.microsoft.com/security/blog/2020/12/15/ensuring-customers-are-protected-from-solorigate/)\nits behaviors. It quarantines the malware, even if the process is running.\n\n\n-----\n\n_Figure 8. Microsoft Defender for Endpoint blocks malicious binaries_\n\nIf the malicious code is successfully deployed, the backdoor lies dormant for up to two\nweeks. It then attempts to contact numerous C2 domains, with the primary domain being\n_*.avsvmcloud[.]com. The backdoor uses a domain generation algorithm to evade detection._\nMicrosoft 365 Defender detects and blocks this behavior.\n\n_Figure 9. Microsoft Defender for Endpoint prevented malicious C2 callback_\n\n### Discovering potentially tampered devices\n\n\n-----\n\nTo evade security software and analyst tools, the Solorigate malware enumerates the target\nsystem looking for certain running processes, loaded drivers, and registry keys, with the goal\nof disabling them.\n\nThe Microsoft Defender for Endpoint sensor is one of the processes the malware attempts to\ndisable. Microsoft Defender for Endpoint has built-in protections against many techniques\nattackers use to disable endpoint sensors ranging from hardened OS protection, antitampering policies, and detections for a variety of tampering attempts, including “Attempt to\nstop Microsoft Defender for Endpoint sensor”, “Tampering with Microsoft Defender for\nEndpoint sensor settings”, or “Possible sensor tampering in memory”.\n\nSuccessfully disabling Microsoft Defender for Endpoint can prevent the system from\nreporting observed activities. However, the multitude of signals reported into Microsoft 365\nDefender provides a unique opportunity to hunt for systems where the tampering technique\nused might have been successful. The following advanced hunting query can be used to\nlocate devices that should be reporting but aren’t:\n\n_// Times to be modified as appropriate_\n_let timeAgo=1d;_\n_let silenceTime=8h;_\n_// Get all silent devices and IPs from network events_\n_let allNetwork=materialize(DeviceNetworkEvents_\n_| where Timestamp > ago(timeAgo)_\n_and isnotempty(LocalIP)_\n_and isnotempty(RemoteIP)_\n_and ActionType in (“ConnectionSuccess”, “InboundConnectionAccepted”)_\n_and LocalIP !in (“127.0.0.1”, “::1”)_\n_| project DeviceId, Timestamp, LocalIP, RemoteIP, ReportId);_\n_let nonSilentDevices=allNetwork_\n_| where Timestamp > ago(silenceTime)_\n_| union (DeviceProcessEvents | where Timestamp > ago(silenceTime))_\n_| summarize by DeviceId;_\n_let nonSilentIPs=allNetwork_\n_| where Timestamp > ago(silenceTime)_\n_| summarize by LocalIP;_\n_let silentDevices=allNetwork_\n_| where DeviceId !in (nonSilentDevices)_\n_and LocalIP !in (nonSilentIPs)_\n_| project DeviceId, LocalIP, Timestamp, ReportId;_\n_// Get all remote IPs that were recently active_\n_let addressesDuringSilence=allNetwork_\n_| where Timestamp > ago(silenceTime)_\n_| summarize by RemoteIP;_\n\n\n-----\n\n_// Potentially disconnected devices were connected but are silent_\n_silentDevices_\n_| where LocalIP in (addressesDuringSilence)_\n_| summarize ReportId=arg_max(Timestamp, ReportId), Timestamp=max(Timestamp),_\n_LocalIP=arg_max(Timestamp, LocalIP) by DeviceId_\n_| project DeviceId, ReportId=ReportId1, Timestamp, LocalIP=LocalIP1_\n\nMicrosoft is continuously developing additional measures to both block and alert on these\ntypes of tampering activities.\n\n## Detecting hands-on-keyboard activity within an on-premises environment\n\n_Figure 10. Solorigate attack chain: Hands-on-keyboard attack on premises_\n\nAfter establishing a backdoor connection on an affected device, the attacker’s next goal is to\nachieve off-premises access to the organization’s cloud services. To do this, they must find a\nway to gain permissions to those services. One technique we have seen the attackers use is\n[to go after the organization’s Active Directory Federation Services (AD FS) server to obtain](https://docs.microsoft.com/windows-server/identity/active-directory-federation-services)\nthe proverbial “keys” to the identity kingdom. AD FS enables federated identity and access\nmanagement by securely sharing digital identity and entitlement rights across security and\nenterprise boundaries; effectively, it is the “LSASS for the cloud.” Among other things, AD FS\n[stores the Security Assertion Markup Language (SAML) token signing certificate, which is](https://docs.microsoft.com/azure/active-directory/manage-apps/certificate-signing-options)\nused to create authorization tokens for users or services in the organization so they can\naccess cloud applications and resources after authentication.\n\n\n-----\n\nTo attack the AD FS infrastructure, the attackers must first obtain appropriate domain\npermissions through on-premises intelligence gathering, lateral movement, and credential\ntheft. Building from the backdoor described above, the attackers leverage fileless techniques\nfor privilege escalation, persistence, and lateral movement, including evading analysis by\nusing system binaries and exploration tools that masquerade as other benign binaries. The\nattackers also carefully chose organization-specific command-and-control (C2) domains and\nuse custom organization-specific tool naming and locations.\n\nMicrosoft Defender for Endpoint detects a wide array of these attack techniques, allowing\nSOC teams to track the attacker’s actions in the environment and take actions to contain the\nattack. The following section covers detections for the techniques used by the attackers to\ncompromise the AD FS infrastructure.\n\n### Identifying attacker reconnaissance\n\nAttackers collect data from Active Directory using a renamed version of the utility ADFind,\nrunning queries against Domain Controllers as part of the reconnaissance stage of the\nattack. Microsoft Defender for Endpoint detects this behavior and allows the SOC analyst to\ntrack compromised devices at this stage to gain visibility into the information the attacker is\nlooking for.\n\n_Figure 11. Microsoft Defender for Endpoint detects usage of masquerading exploration tools_\n\n\n-----\n\n_Figure 12. Microsoft Defender for Endpoint detects usage LDAP query for reconnaissance._\n\n### Stopping lateral movement and credential theft\n\nTo gain access to a highly privileged account needed for later steps in the kill chain, the\nattackers move laterally between devices and dump credentials until an account with the\nneeded privileges is compromised, all while remaining as stealthy as possible.\n\nA variety of credential theft methods, such as dumping LSASS memory, are detected and\nblocked by Microsoft Defender for Endpoint. The example below shows the detection of\nlateral movement using Windows Management Instrumentation (WMI) to run the attacker’s\npayload using the Rundll32.exe process.\n\n\n-----\n\n_Figure 13. Microsoft Defender for Endpoint alert for suspicious remote WMI execution_\n_highlighting the attacker’s device and payload_\n\nMicrosoft Defender for Identity also detects and raises alerts on a variety of credential theft\ntechniques. In addition to watching for alerts, security analysts can hunt across identity data\nin Microsoft 365 Defender for signs of identity compromise. Here are a couple of example\nMicrosoft Defender for Identity queries looking for such patterns:\n\nEnumeration of high-value DC assets followed by logon attempts to validate stolen\ncredentials in time proximity\n\n_let MaxTime = 1d;_\n\n_let MinNumberLogon = 5;_\n\n_//devices attempting enumeration of high-value DC_\n\n_IdentityQueryEvents_\n\n_| where Timestamp > ago(30d)_\n\n_| where Application == “Active Directory”_\n\n_| where QueryTarget in (“Read-only Domain Controllers”)_\n\n_//high-value RODC assets_\n\n_| project Timestamp, Protocol, Query, DeviceName, AccountUpn_\n\n_| join kind = innerunique (_\n\n_//devices trying to logon {MaxTime} after enumeration_\n\n_IdentityLogonEvents_\n\n_| where Timestamp > ago(30d)_\n\n\n-----\n\n_| where ActionType == LogonSuccess_\n_| project LogonTime = Timestamp, DeviceName, DestinationDeviceName) on DeviceName_\n_| where LogonTime between (Timestamp .. (Timestamp + MaxTime))_\n_| summarize n=dcount(DestinationDeviceName), TargetedDC =_\n_makeset(DestinationDeviceName) by Timestamp, Protocol, DeviceName_\n_| where n >= MinNumberLogon_\n\nHigh-volume of LDAP queries in short time filtering for non-DC devices\n\n_let Threshold = 12;_\n_let BinTime = 1m;_\n_//approximate list of DC_\n_let listDC=IdentityDirectoryEvents_\n_| where Application == “Active Directory”_\n_| where ActionType == “Directory Services replication”_\n_| summarize by DestinationDeviceName;_\n_IdentityQueryEvents_\n_| where Timestamp > ago(30d)_\n_//filter out LDAP traffic across DC_\n_| where DeviceName !in (listDC)_\n_| where ActionType == “LDAP query”_\n_| parse Query with * “Search Scope: ” SearchScope “, Base Object:” BaseObject “, Search_\n_Filter: ” SearchFilter_\n_| summarize NumberOfDistinctLdapQueries = dcount(SearchFilter) by DeviceName,_\n_bin(Timestamp, BinTime)_\n_| where NumberOfDistinctLdapQueries > Threshold_\n\nAt this point, SOC teams can take containment measures within the Microsoft 365 security\n[center, for example, using indicators to isolate the devices involved and block the remotely](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/manage-indicators)\nexecuted payload across the environment, as well as mark suspect users as compromised.\n\n### Detecting and remediating persistence\n\nMicrosoft Defender for Endpoint also detects the advanced defense evasion and\nmasquerading techniques used by the attackers to make their actions as close to normal as\npossible, such as binding a WMI event filter with a logical consumer to remain persistent.\nFollow the recommended actions in the alert to remove persistence and prevent the\nattacker’s payload from loading after reboot.\n\n\n-----\n\n_Figure 14. Microsoft Defender for Endpoint alert for WMI event filter bound to a suspicious_\n_consumer showing the persistence and the scheduled command line_\n\n### Catching AD FS compromise and the attacker’s ability to impersonate users in the cloud\n\nThe next step in the attack focuses on the AD FS infrastructure and can unfold in two\nseparate paths that lead to the same outcome—the ability to create valid SAML tokens\nallowing impersonation of users in the cloud:\n\n**Path 1 – Stealing the SAML signing certificate: After gaining administrative**\nprivileges in the organization’s on-premises network, and with access to the AD FS\nserver itself, the attackers access and extract the SAML signing certificate. With this\nsigning certificate, the attackers create valid SAML tokens to access various desired\ncloud resources as the identity of their choosing.\n**Path 2 – Adding to or modifying existing federation trust: After gaining**\nadministrative Azure Active Directory (Azure AD) privileges using compromised\ncredentials, the attackers add their own certificate as a trusted entity in the domain\neither by adding a new federation trust to an existing tenant or modifying the properties\nof an existing federation trust. As a result, any SAML token they create and sign will be\nvalid for the identity of their choosing.\n\nIn the first path, obtaining the SAML signing certificate normally entails first querying the\nprivate encryption key that resides on the AD FS container and then using that key to decrypt\nthe signing certificate. The certificate can then be used to create illicit but valid SAML tokens\nthat allow the actor to impersonate users, enabling them to access enterprise cloud\napplications and services.\n\n\n-----\n\nMicrosoft Defender for Endpoint and Microsoft Defender for Identity detect the actions that\nattackers take to steal the encryption key needed to decrypt the SAML signing certificate.\nBoth solutions leverage unique LDAP telemetry to raise high-severity alerts highlighting the\nattacker’s progress towards creating illicit SAML tokens.\n\n_Figure 15. Microsoft Defender for Endpoint detects a suspicious LDAP query being launched_\n_and an attempted AD FS private key extraction_\n\n\n-----\n\n_Figure 16. Microsoft Defender for Identity detects private key extraction via malicious LDAP_\n_requests_\n\nFor the second path, the attackers create their own SAML signing certificate outside of the\norganization’s environment. With Azure AD administrative permissions, they then add the\nnew certificate as a trusted object. The following advanced hunting query over Azure AD\naudit logs shows when domain federation settings are changed, helping to discover where\nthe attackers configured the domain to accept authorization tokens signed by their own\nsigning certificate. As these are rare actions, we advise verifying that any instances identified\nare the result of legitimate administrative activity.\n\n_ADFSDomainTrustMods_\n\n_let auditLookback = 1d; CloudAppEvents_\n_| where Timestamp > ago(auditLookback)_\n_| where ActionType =~ “Set federation settings on domain.”_\n_| extend targetDetails = parse_json(ActivityObjects[1])_\n_| extend targetDisplayName = targetDetails.Name_\n_| extend resultStatus = extractjson(“$.ResultStatus”, tostring(RawEventData), typeof(string))_\n_| project Timestamp, ActionType, InitiatingUserOrApp=AccountDisplayName,_\n_targetDisplayName, resultStatus, InitiatingIPAddress=IPAddress, UserAgent_\n\nIf the SAML signing certificate is confirmed to be compromised or the attacker has added a\n[new one, follow the best practices for invalidating through certificate rotation to prevent](https://www.microsoft.com/security/blog/2020/12/21/advice-for-incident-responders-on-recovery-from-systemic-identity-compromises/)\nfurther use and creation of SAML tokens by the attacker. Additionally, affected AD FS servers\nmay need to be isolated and remediated to ensure no remaining attacker control or\npersistence.\n\nIf the attackers accomplish either path, they gain the ability to create illicit SAML tokens for\nthe identities of their choosing and bypass multifactor authentication (MFA), since the service\nor application accepting the token assumes MFA is a necessary previous step in creating a\nproperly signed token. To prevent attackers from progressing to the next stage, which is to\naccess cloud resources, the attack should be discovered and remediated at this stage.\n\n## Detecting the hands-on-keyboard activity in the cloud environment\n\n\n-----\n\n_Figure 17. Solorigate attack chain: Hands-on-keyboard attack in the cloud_\n\nWith the ability to create illicit SAML tokens, the attackers can access sensitive data without\nhaving to originate from a compromised device or be confined to on-premises persistence.\nBy abusing API access via existing OAuth applications or service principals, they can\nattempt to blend into the normal pattern of activity, most notably apps or service principals\nwith existing Mail.Read or Mail.ReadWrite permissions to read email content via Microsoft\nGraph from Exchange Online. If the application does not already have read permissions for\nemails, then the app may be modified to grant those permissions.\n\n### Identifying unusual addition of credentials to an OAuth app\n\nMicrosoft Cloud App Security (MCAS) has added new automatic detection of unusual\ncredential additions to an OAuth application to alert SOCs about apps that have been\ncompromised to extract data from the organization. This detection logic is built on an\nanomaly detection engine that learns from each user in the environment, filtering out normal\nusage patterns to ensure alerts highlight real attacks and not false positives. If you see this\nalert in your environment and confirm malicious activity, you should take immediate action to\nsuspend the user, mark the user as compromised, reset the user’s password, and remove\nthe credential additions. You may consider disabling the application during investigation and\nremediation.\n\n\n-----\n\n_Figure 18. Microsoft Defender Cloud App Security alert for unusual addition of credentials to_\n_an OAuth app_\n\nSOCs can use the following Microsoft 365 Defender advanced hunting query over Azure AD\naudit logs to examine when new credentials have been added to a service principle or\napplication. In general, credential changes may be rare depending on the type and use of the\nservice principal or application. SOCs should verify unusual changes with their respective\nowners to ensure they are the result of legitimate administrative actions.\n\n_NewAppOrServicePrincipalCredential_\n\n_let auditLookback = 1d; CloudAppEvents_\n\n_| where Timestamp > ago(auditLookback)_\n\n_| where ActionType in (“Add service principal.”, “Add service principal credentials.”, “Update_\n_application – Certificates and secrets management “)_\n\n_| extend RawEventData = parse_json(RawEventData)_\n\n_| where RawEventData.ResultStatus =~ “success”_\n\n_| where AccountDisplayName has “@”_\n\n_| extend targetDetails = parse_json(ActivityObjects[1])_\n\n\n-----\n\n_| extend targetId = targetDetails.Id_\n_| extend targetType = targetDetails.Type_\n_| extend targetDisplayName = targetDetails.Name_\n_| extend keyEvents = RawEventData.ModifiedProperties_\n_| where keyEvents has “KeyIdentifier=” and keyEvents has “KeyUsage=Verify”_\n_| mvexpand keyEvents_\n_| where keyEvents.Name =~ “KeyDescription”_\n_| parse keyEvents.NewValue with * “KeyIdentifier=” keyIdentifier:string “,KeyType=”_\n_keyType:string “,KeyUsage=” keyUsage:string “,DisplayName=” keyDisplayName:string “]” *_\n_| parse keyEvents.OldValue with * “KeyIdentifier=” keyIdentifierOld:string “,KeyType” *_\n_| where keyEvents.OldValue == “[]” or keyIdentifier != keyIdentifierOld_\n_| where keyUsage == “Verify”_\n_| project-away keyEvents_\n_| project Timestamp, ActionType, InitiatingUserOrApp=AccountDisplayName,_\n_InitiatingIPAddress=IPAddress, UserAgent, targetDisplayName, targetId, targetType,_\n_keyDisplayName, keyType, keyUsage, keyIdentifier_\n\n### Discovering malicious access to mail items\n\nOAuth applications or service principals with Mail.Read or Mail.ReadWrite permissions can\nread email content from Exchange Online via the Microsoft Graph. To help increase visibility\non these behaviors, the MailItemsAccessed action is now available via the new Exchange\nmailbox advanced audit functionality. [See if this feature is enabled by default for you.](https://docs.microsoft.com/microsoft-365/compliance/mailitemsaccessed-forensics-investigations?view=o365-worldwide#the-mailitemsaccessed-mailbox-auditing-action)\nImportant note for customers: If you have customized the list of audit events you are\n[collecting, you may need to manually enable this telemetry.](https://docs.microsoft.com/microsoft-365/compliance/enable-mailbox-auditing?view=o365-worldwide#change-or-restore-mailbox-actions-logged-by-default)\n\nIf more than 1,000 MailItemsAccessed audit records are generated in less than 24 hours,\nExchange Online stops generating auditing records for MailItemsAccessed activity for 24\nhours and then resumes logging after this period. This throttling behavior is a good starting\npoint for SOCs to discover potentially compromised mailboxes.\n\n_MailItemsAccessedThrottling_\n\n_let starttime = 2d;_\n\n_let endtime = 1d;_\n\n_CloudAppEvents_\n\n_| where Timestamp between (startofday(ago(starttime))..startofday(ago(endtime)))_\n\n_| where ActionType == “MailItemsAccessed”_\n\n_| where isnotempty(RawEventData[‘ClientAppId’]) and RawEventData[‘OperationProperties’]_\n\n_[1] has “True”_\n\n_| project Timestamp, RawEventData[‘OrganizationId’],AccountObjectId,UserAgent_\n\nIn addition to looking for throttled telemetry, you can also hunt for OAuth applications reading\nmail via the Microsoft Graph API whose behavior has changed prior to a baseline period.\n\n\n-----\n\n_OAuthGraphAPIAnomalies_\n\n_//Look for OAuth App reading mail via GraphAPI — that did not read mail via graph API in_\n_prior week_\n_let appMailReadActivity = (timeframeStart:datetime, timeframeEnd:datetime) {_\n_CloudAppEvents_\n_| where Timestamp between (timeframeStart .. timeframeEnd)_\n_| where ActionType == “MailItemsAccessed”_\n_| where RawEventData has “00000003-0000-0000-c000-000000000000” // performance_\n_check_\n_| extend rawData = parse_json(RawEventData)_\n_| extend AppId = tostring(parse_json(rawData.AppId))_\n_| extend OAuthAppId = tostring(parse_json(rawData.ClientAppId)) // extract OAuthAppId_\n_| summarize by OAuthAppId_\n_};_\n_appMailReadActivity(ago(1d),now()) // detection period_\n_| join kind = leftanti appMailReadActivity(ago(7d),ago(2d)) // baseline period_\n_on OAuthAppId_\n\n## Microsoft 365 Defender’s cross-domain XDR correlation enables stronger response to critical security incidents\n\nLike the rest of the security industry, Microsoft continues to track the Solorigate attack, an\nactive threat that continues to unfold as well as evolve. As part of empowering our customers\nand the larger security community to respond to this attack through sharing intelligence and\nproviding advice, this blog serves to guide Microsoft 365 customers to take full advantage of\nthe comprehensive visibility and the rich investigation tools available in Microsoft 365\nDefender. This blog shows that many of the existing capabilities in Microsoft 365 Defender\nhelp address this attack, but the unique scenarios created by the threat resulted in some\nSolorigate-specific detections and other innovative protections, including ones that are made\npossible by deeply integrated cross-domain threat defense.\n\nFor additional information and further guidance, refer to these Microsoft resources:\n\nMicrosoft will continue to provide public information about the patterns and techniques of this\nattack and related intelligence for customers to defend themselves, in addition to enhancing\nthe protection capabilities of Microsoft security solutions.\n\n## Appendix: Additional details for detection and hunting\n\n### Detection details\n\n\n-----\n\n**Attack stage** **Microsoft 365 Defender detection or alert**\n\nInitial access Microsoft Defender for Endpoint:\n\n‘Solorigate’ high-severity malware was\n[detected/blocked/prevented (Trojan:MSIL/Solorigate.BR!dha)](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Trojan:MSIL/Solorigate.BR!dha)\nSolarWinds Malicious binaries associated with a supply chain\nattack\n\n\nExecution and\npersistence\n\nCommand and\nControl\n\nDefense\nevasion\n\n\nMicrosoft Defender for Endpoint:\n\n‘Solorigate’ high-severity malware was\n[detected/blocked/prevented (Trojan:Win64/Cobaltstrike.RN!dha,](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win64/Cobaltstrike.RN!dha)\n[Trojan:PowerShell/Solorigate.H!dha)](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Trojan:PowerShell/Solorigate.H!dha)\nSuspicious process launch by Rundll32.exe\nUse of living-off-the-land binary to run malicious code\nA WMI event filter was bound to a suspicious event consumer\n\nMicrosoft Defender for Endpoint:\n\nAn active ‘Solorigate’ high-severity malware was detected/\n[blocked/prevented (Trojan:Win64/Cobaltstrike.RN!dha)](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win64/Cobaltstrike.RN!dha)\n\nMicrosoft Defender for Endpoint:\n\nSuspicious audit policy tampering\n\n\nReconnaissance Microsoft Defender for Endpoint:\n\nMasquerading Active Directory exploration tool\nSuspicious sequence of exploration activities\nExecution of suspicious known LDAP query fragments\n\n\nCredential\naccess\n\nLateral\nmovement\n\n\nMicrosoft Defender for Endpoint:\n\nSuspicious access to LSASS (credential access)\nAD FS private key extraction attempt\nPossible attempt to access ADFS key material\nSuspicious ADFS adapter process created\n\nMicrosoft Defender for Identity:\n\nUnusual addition of permissions to an OAuth app\nActive Directory attributes Reconnaissance using LDAP\n\nMicrosoft Cloud App Security:\n\nUnusual addition of credentials to an OAuth app\n\nMicrosoft Defender for Endpoint\n\nSuspicious file creation initiated remotely (lateral movement)\nSuspicious Remote WMI Execution (lateral movement)\n\n\n-----\n\nExfiltration Microsoft Defender for Endpoint\n\nSuspicious mailbox export or access modification\nSuspicious archive creation\n\n### Advanced hunting queries\n\n**Attack stage** **Query link in GitHub repo**\n\nGeneral Microsoft Defender for Endpoint Threat and Vulnerability\nManagement:\n\n[SolarWinds Orion software in your org](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/possible-affected-software-orion%5BSolorigate%5D.md)\n\nInitial access Microsoft Defender for Endpoint:\n\n[Malicious DLLs loaded in memory](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/e4ff45064d58ebd352cff0bb6765ad87d54ab9a9/Campaigns/locate-dll-loaded-in-memory%5BSolorigate%5D.md)\n[Malicious DLLs created in the system or locally](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/locate-dll-created-locally%5BSolorigate%5D.md)\n[Compromised SolarWinds certificate](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/616f86b2767318577a0d9bccb379177d0dccdf2d/Campaigns/compromised-certificate%5BSolorigate%5D.md)\n\nExecution Microsoft Defender for Endpoint:\n\n[SolarWinds processes launching PowerShell with Base64](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/launching-base64-powershell%5BSolorigate%5D.md)\n[SolarWinds processes launching CMD with echo](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/launching-cmd-echo%5BSolorigate%5D.md)\nADFS adapter process spawning:\n\n_DeviceProcessEvents_\n\n_| where InitiatingProcessFileName_\n_=~”Microsoft.IdentityServer.ServiceHost.exe”_\n\n_| where FileName in~(“werfault.exe”, “csc.exe”)_\n\n_| where ProcessCommandLine !contains (“nameId”)_\n\n\nCommand and\nControl\n\n\nMicrosoft Defender for Endpoint\n\n[C2 communications](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/c2-lookup-response%5BSolorigate%5D.md)\n[C2 lookup](https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/3cb633cee8332b5eb968b4ae1947b9ddb7a5958f/Campaigns/c2-lookup-from-nonbrowser%5BSolorigate%5D..md)\n\n\nCredential access Azure Active Directory (Microsoft Cloud App Security):\n\nCredentials added to AAD app after admin consent\nNew access credential added to application or service principal\nDomain federation trust settings modified\nAdd uncommon credential type to application\nService Principal Added To Role\n\nExfiltration Exchange Online (Microsoft Cloud App Security):\n\nMail Items Accessed Throttling Analytic\nMail Items Accessed Anomaly Analytic\nOAuth Apps reading mail via GraphAPI anomaly\nOAuth Apps reading mail both via GraphAPI and directly\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-28 - Using Microsoft 365 Defender to protect against Solorigate.pdf"
    ],
    "report_names": [
        "2020-12-28 - Using Microsoft 365 Defender to protect against Solorigate.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535784,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653779234,
    "ts_modification_date": 1653779234,
    "files": {
        "pdf": "https://archive.orkl.eu/2e371e61f2fdbcd94cf74010db98ca6960a03ba8.pdf",
        "text": "https://archive.orkl.eu/2e371e61f2fdbcd94cf74010db98ca6960a03ba8.txt",
        "img": "https://archive.orkl.eu/2e371e61f2fdbcd94cf74010db98ca6960a03ba8.jpg"
    }
}