{
    "id": "6525fdfc-d294-454c-8017-2ccd111fe5ff",
    "created_at": "2023-01-12T15:08:43.224079Z",
    "updated_at": "2025-03-27T02:16:30.424502Z",
    "deleted_at": null,
    "sha1_hash": "e19c3318fb8843ae314f268a948424309681bd79",
    "title": "2021-11-18 - Iranian targeting of IT sector on the rise",
    "authors": "",
    "file_creation_date": "2022-05-28T16:15:16Z",
    "file_modification_date": "2022-05-28T16:15:16Z",
    "file_size": 630942,
    "plain_text": "# Iranian targeting of IT sector on the rise\n\n**[microsoft.com/security/blog/2021/11/18/iranian-targeting-of-it-sector-on-the-rise/](https://www.microsoft.com/security/blog/2021/11/18/iranian-targeting-of-it-sector-on-the-rise/)**\n\nNovember 18, 2021\n\nIranian threat actors are increasing attacks against IT services companies as a way to access their\ncustomers’ networks. This activity is notable because targeting third parties has the potential to\nexploit more sensitive organizations by taking advantage of trust and access in a supply chain.\nMicrosoft has observed multiple Iranian threat actors targeting the IT services sector in attacks that\naim to steal sign-in credentials belonging to downstream customer networks to enable further attacks.\nThe Microsoft Threat Intelligence Center (MSTIC) and Digital Security Unit (DSU) assess this is part\nof a broader espionage objective to compromise organizations of interest to the Iranian regime.\n\nUntil July 2021, Microsoft had observed relatively little history of Iranian actors attacking Indian\ntargets. As India and other nations rise as major IT services hubs, more nation state actors follow the\nsupply chain to target these providers’ public and private sector customers around the world matching\nnation state interests.\n\nTo date this year, Microsoft has issued more than 1,600 notifications to over 40 IT companies in\nresponse to Iranian targeting, compared to 48 notifications in 2020, making this a significant increase\nfrom years past (Figure 1). The focus of several Iranian threat groups on the IT sector particularly\nspiked in the last six months – roughly 10-13% of our notifications were related to Iranian threat\nactivity in the last six months, compared to two and a half percent in the six months prior (Figure 2).\n\n\n-----\n\nMost of the targeting is focused on IT services companies based in India, as well as several\ncompanies based in Israel and United Arab Emirates. Although different in technique from other\nrecent supply chain attacks, these attacks represent another example of how nation state actors are\nincreasingly targeting supply chains as indirect vectors to achieve their objectives.\n\n_Figure 1: Number of notifications sent to IT Services related to Iran-based actor targeting_\n\n_Figure 2: Percentage of notifications per quarter sent to IT Services NSNs related to Iran-based_\n_activity_\n\nAs with any observed nation state actor activity, Microsoft has directly notified customers that have\nbeen targeted or compromised, providing them with the information they need to secure their\naccounts. Microsoft uses DEV-#### designations as a temporary name given to an unknown,\n\n\n-----\n\nemerging, or a developing cluster of threat activity, allowing MSTIC to track it as a unique set of\ninformation until we reach a high confidence about the origin or identity of the actor behind the\nactivity. Once it meets the criteria, a DEV is converted to a named actor.\n\n## Observed activity\n\nIn July 2021, a group that MSTIC tracks as DEV-0228 and assesses as based in Iran compromised a\nsingle Israel-based IT company that provides business management software. Based on MSTIC’s\nassessment, DEV-0228 used access to that IT company to extend their attacks and compromise\ndownstream customers in the defense, energy, and legal sectors in Israel. In September, we detected\na separate Iranian group, DEV-0056, compromising email accounts at a Bahrain-based IT integration\ncompany that works on IT integration with Bahrain Government clients, who were likely DEV-0056’s\nultimate target. DEV-0056 also compromised various accounts at a partially government-owned\norganization in the Middle East that provide information and communications technology to the\ndefense and transportation sectors, which are targets of interest to the Iranian regime. DEV-0056\nmaintained persistence at the IT integration organization through at least October.\n\nMSTIC detected a significant increase in these and other Iranian groups targeting IT companies\nbased in India beginning in mid-August. From mid-August to late September, we issued 1,788 nation\nstate notifications (NSNs) across Iranian actors to enterprise customers in India, roughly 80% of\nwhich were to IT companies, an exponential rise from the 10 notifications we issued the previous\nthree years in response to previous Iranian targeting. Iranian cyber actors have rarely targeted India,\nand the lack of pressing geopolitical issues that would have prompted such a shift suggests that this\ntargeting is for indirect access to subsidiaries and clients outside India.\n\n### Credential theft leads to downstream compromise\n\nDEV-0228 dumped credentials from the on-premises network of an IT provider based in Israel in early\nJuly. Over the next two months, the group compromised at least a dozen other organizations, several\nof which have strong public relations with the compromised IT company. MSTIC assesses at least\nfour (4) of those victims were compromised using the acquired credentials and access from the IT\ncompany in the July and August attacks. Here are two such examples:\n\nDEV-0228 operators compromised the on-premises network of a law firm in Israel in August\nthrough an account managed by the IT provider via PAExec (a custom version of the Windows\nSysinternals tool PsExec).\n\n```\nPa.exe \\\\###.##.#.## -u {user name}\\{domain name} -p \"********\" -s cmd.exe\n\n```\n\nDEV-0228 operators also compromised a defense company in Israel by signing into an email\naccount provisioned for the same IT provider on the victim’s Office 365 tenant. The attackers\nlikely obtained those credentials from the initial compromise of the IT provider in July.\n\n### Custom implant to establish persistence\n\nDEV-0228 operators used a custom implant to establish persistence on victim hosts and then\ndumped LSASS. The implant is a custom remote access Trojan (RAT) that uses Dropbox as a\ncommand and control (C2) channel and is disguised as RuntimeBroker.exe or svchost.exe.\n\n\n-----\n\nOperators staged their tools in a C:\\Windows\\TAPI directory on the victim hosts:\n\nC:\\Windows\\TAPI\\lsa.exe\nC:\\Windows\\TAPI\\pa.exe\nC:\\Windows\\TAPI\\pc.exe (procdump)\nC:\\Windows\\TAPI\\Rar.exe\n\nMicrosoft will continue to monitor DEV-0228 and DEV-0056 activity and implement protections for our\ncustomers. The current detections, advanced detections, and IOCs in place across our security\nproducts are detailed below.\n\n## Indicators of compromise (IOCs)\n\nType Indicator\n\nsvchost.exe 2a1044e9e6e87a032f80c6d9ea6ae61bbbb053c0a21b186ecb3b812b49eb03b7\n\nsvchost.exe 9ab7e99ed84f94a7b6409b87e56dc6e1143b05034a5e4455e8c555dbbcd0d2dd\n\nlsa.exe 43109fbe8b752f7a9076eaafa417d9ae5c6e827cd5374b866672263fdebd5ec3\n\nwdmsvc.exe 18a072ccfab239e140d8f682e2874e8ff19d94311fc8bb9564043d3e0deda54b\n\n\nPa.exe\n(PAExec.exe)\n\n\nab50d8d707b97712178a92bbac74ccc2a5699eb41c17aa77f713ff3e568dcedb\n\n\n## Recommended defenses\n\nThe following guidance can mitigate the techniques described in the threat activity:\n\n[Enable multi-factor authentication to mitigate compromised credentials.](https://docs.microsoft.com/azure/active-directory/authentication/concept-mfa-howitworks)\n\nFor Office 365 users, see [multi-factor authentication support.](https://docs.microsoft.com/office365/admin/security-and-compliance/set-up-multi-factor-authentication?view=o365worldwide)\n[For Consumer and Personal email accounts, see how to use two-step verification.](https://support.microsoft.com/help/12408/microsoft-account-how-to-use-two-step-verification)\nUse [passwordless solutions like Microsoft Authenticator to secure accounts.](https://www.microsoft.com/security/blog/2021/09/15/the-passwordless-future-is-here-for-your-microsoft-account/)\n[Review and enforce recommended Exchange Online access policies.](https://docs.microsoft.com/microsoft-365/security/office-365-security/secure-email-recommended-policies)\n\n[Block ActiveSync clients from bypassing Conditional Access policies.](https://docs.microsoft.com/microsoft-365/security/office-365-security/secure-email-recommended-policies?view=o365-worldwide#block-activesync-clients)\nBlock all incoming traffic from anonymizing services where possible.\n[Turn on the following attack surface reduction rule to block or audit activity associated with this](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction)\nthreat:\n\nBlock credential stealing from the Windows local security authority subsystem (lsass.exe)\n\n## Detections\n\n### Microsoft 365 Defender\n\n**Antivirus**\n\nMicrosoft Defender Antivirus detects threat components as the following malware:\n\n\n-----\n\nBackdoor:MSIL/ShellClient.A\nBackdoor:MSIL/ShellClient.A!dll\nTrojan:MSIL/Mimikatz.BA!MTB\n\n**Endpoint detection and response (EDR)**\n\nAlerts with the following titles in the security center can indicate threat activity on the network:\n\nDEV-0228 actor activity\nDEV-0056 actor activity\n\nThe following alerts might indicate threat activity associated with this threat. These alerts, however,\ncan be triggered by unrelated threat activity, but they are listed here for reference:\n\nSuspicious connection to remote service\nPossible command-and-control activity\nSuspicious access to LSASS service\nSensitive credential memory read\n\n_Figure 3: Microsoft 365 Defender alert showing credential dumping activity_\n\n[Microsoft 365 Defender correlates related alerts into consolidated incidents to help customers](https://docs.microsoft.com/en-us/microsoft-365/security/defender/investigate-incidents)\ndetermine with confidence if observed alerts are related to this activity. Customers using the Microsoft\n365 Defender portal can view, investigate, and respond to incidents that include any detections\nrelated to the activity described in this blog.\n\n## Advanced hunting queries\n\n\n-----\n\n### Microsoft Sentinel\n\nThe indicators of compromise (IoCs) included in this blog post can be used by Microsoft Sentinel\ncustomers for detection purposes using the queries detailed below.\n\n**Command Line Activity November 2021**\n\nThis hunting query looks for process command line activity related to observed activity. The query\nuses additional data from Microsoft Defender for Endpoint to generate a risk score associated with\neach result. Hosts with higher risk events should be investigated first.\n\nhttps://github.com/azure/azure-sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev0056CommandLineActivityNovember2021.yaml\n\n**FilePath/Hashes query November 2021**\n\nThis hunting query looks for file paths/hashes related to observed activity as detailed in this blog.\n\nhttps://github.com/Azure/Azure-Sentinel/tree/master/Detections/MultipleDataSources/Dev0228FilePathHashesNovember2021.yaml\n\nIn addition to these queries, there are equivalent queries that use the Advanced SIEM Information\nModel (ASIM) to look for the same activity.\n\nhttps://github.com/Azure/Azure[Sentinel/tree/master/Hunting%20Queries/ASimProcess/imProcess_Dev-](https://github.com/Azure/Azure-Sentinel/tree/master/Hunting%20Queries/ASimProcess/imProcess_Dev-0056CommandLineActivityNovember2021-ASIM.yaml)\n0056CommandLineActivityNovember2021-ASIM.yaml\n\nhttps://github.com/Azure/Azure-Sentinel/tree/master/Detections/ASimFileEvent/imFileEvent_Dev0228FilePathHashesNovember2021-ASIM.yaml\n\n### Microsoft 365 Defender\n\nTo locate malicious activity related to the activity described in this blog, customers can run the\nfollowing queries in Microsoft 365 Defender or Microsoft Defender for Endpoint.\n\n**Identify use of PAExec in your environment**\n\n[Look for PAExec.exe process executions in your environment. Run query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA5WQvQrCQBCEpxZ8hyOVgvoGVv6AIGplKyHGJJDkJBf8AfHZ_e7UJtjIsrvD7O3OcHOluqhQQt-pkQ3IEQv4VLVasFFfPT3oV-WwDWm0ZK8EbRSrCsxUT2qkM0yqG5lo8kERE8um6ejswz3HLYvaijyBtnCFMrLmVvm31i-_NXdbDTr6M3BFxMyPWgdF_zqHcToE_s6WV_J7GdV7MPh8e3LMRsHLGOzVvj8aaUi8AIcrwsVkAQAA&timeRangeId=month)\n```\nDeviceProcessEvents\n| where FileName =~ \"paexec.exe\" or ProcessVersionInfoOriginalFileName =~ \"paexec.exe\"\n| where not(ProcessCommandLine has_any(\"program files\", \"-service\"))\n\n```\n**Identify files created in the Windows\\Tapi directory**\n\nLook for files created in the Windows\\Tapi directory. [Run query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA3NhSGUoY8hkSAbSbkA6B0i7AkVSGfIYShiKGRQYeBm4GGqAdDlDBlC0CIgVgCrzgSpTwPwAhkSgygygaAaQBdLhwKDE4MxgxRDDEA40MQ-oLh-ouxjID2FwBKr3BMoDAHEPI4l4AAAA&timeRangeId=month)\n\n```\nDeviceFileEvents\n\n```\n```\n| where FolderPath has @\"C:\\Windows\\TAPI\"\n\n```\n\n**Suspicious PowerShell commands**\n\n\n-----\n\n[Look for suspicious PowerShell process execution. Run query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA5WQy0oDQRBFz1rwH5ohyATyQFCz18SVSCALl6JxzAQmmWQSfEA-PqdbnYW7UFTX7Vu3qrp6TMEHS-bGKQ11QjttIl-wZi8OnHPGwfhJKdvo4Z_-TrzSXqx548Ge66QqZXY8J_6bnIwhW_mhlUGvqfRG_M6IC_M9ccaj1XsGPBk71nV5dUZl359X_ek68j0uufaMeODsqFioKemnTGZ1SFPiHvlJL48z7pN-xW1iCm64Ymb_JmkXKsJv9em_UmnxV_pmajbtXnHPr_aWt_eudgT13J3gtgEAAA&timeRangeId=month)\n```\nDeviceProcessEvents\n| where ProcessCommandLine has_any(\"/q /c color f7&\", \"Net.We$()bClient\",\n\"$b,15,$b.Length-15\") or\n(ProcessCommandLine has \"FromBase64String\" and ProcessCommandLine has_all(\"-nop\",\n\"iex\", \"(iex\"))\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - Iranian targeting of IT sector on the rise.pdf"
    ],
    "report_names": [
        "2021-11-18 - Iranian targeting of IT sector on the rise.pdf"
    ],
    "threat_actors": [
        {
            "id": "cd118f78-11b5-4b51-ad97-2f7562905bdb",
            "created_at": "2024-02-02T02:00:04.021391Z",
            "updated_at": "2025-03-27T02:00:03.290231Z",
            "deleted_at": null,
            "main_name": "Cuboid Sandstorm",
            "aliases": [
                "DEV-0228"
            ],
            "source_name": "MISPGALAXY:Cuboid Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "583cdac5-eb9d-46e9-a0f9-7594c4b18281",
            "created_at": "2024-05-01T02:03:08.017491Z",
            "updated_at": "2025-03-27T02:05:17.30797Z",
            "deleted_at": null,
            "main_name": "COBALT FIRESIDE",
            "aliases": [
                "CURIUM ",
                "DEV-0228 ",
                "HIVE0095 ",
                "Imperial Kitten ",
                "TA456 ",
                "Tortoiseshell ",
                "UNC3890 ",
                "Yellow Liderc ",
                "Crimson Sandstorm "
            ],
            "source_name": "Secureworks:COBALT FIRESIDE",
            "tools": [
                " LEMPO",
                " LiderBird",
                "FireBAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "786139da-4139-49d0-9685-e249c5f89f25",
            "created_at": "2024-12-30T02:01:48.731055Z",
            "updated_at": "2025-03-27T02:02:09.998515Z",
            "deleted_at": null,
            "main_name": "TA455",
            "aliases": [
                "Bohrium",
                "DEV-0056",
                "Operation Iranian Dream Job",
                "Smoke Sandstorm",
                "TA455",
                "UNC1549",
                "Yellow Dev 13"
            ],
            "source_name": "ETDA:TA455",
            "tools": [
                "LIGHTRAIL",
                "MINIBIKE",
                "SlugResin",
                "SnailResin"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536123,
    "ts_updated_at": 1743041790,
    "ts_creation_date": 1653754516,
    "ts_modification_date": 1653754516,
    "files": {
        "pdf": "https://archive.orkl.eu/e19c3318fb8843ae314f268a948424309681bd79.pdf",
        "text": "https://archive.orkl.eu/e19c3318fb8843ae314f268a948424309681bd79.txt",
        "img": "https://archive.orkl.eu/e19c3318fb8843ae314f268a948424309681bd79.jpg"
    }
}