{
    "id": "65568b65-33a1-4d43-940d-254591f8548a",
    "created_at": "2022-10-25T16:48:17.825165Z",
    "updated_at": "2025-03-27T02:16:28.868038Z",
    "deleted_at": null,
    "sha1_hash": "c62970fe68497abf948df5535cf81925e2952265",
    "title": "Finding APTX: Attributing Attacks via MITRE TTPs",
    "authors": "",
    "file_creation_date": "2020-12-17T19:00:37Z",
    "file_modification_date": "2020-12-17T19:00:42Z",
    "file_size": 2448714,
    "plain_text": "-----\n\n**TREND MICRO LEGAL DISCLAIMER**\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro\n\nreserves the right to modify the contents of this document\n\nat any time without prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy\n\nis not guaranteed nor implied. If any questions arise\n\nrelated to the accuracy of a translation, please refer to\n\nthe original language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\nPublished by\n**Trend Micro Research**\n\nWritten by\n**Lenart Bermejo**\nThreat Researcher\n\n**Gilbert Sison**\nCyber Threat Hunting Technical Lead\n\n**Buddy Tancio**\nIncident Response Analyst\n\nStock image used under license from\n\nShutterstock.com\n\n_For Raimund Genes (1963-2017)_\n\n\n### Contents\n\n#### 4\n###### Introduction\n\n#### 5\n###### Scope and Initial Analysis\n\n#### 8\n###### Analyses\n\n#### 29\n###### Conclusion\n\n\n-----\n\n##### Summary\n\nWe investigated an advanced persistent threat (APT) attack in an organization after the\n\norganization’s security team detected an unusual series of traffic exchange with a command-\n\nand-control (C&C) server. After an analysis of the traffic and embedded codes, it appears\n\nthat the intrusion has been occurring for a while and involves a number of systems within\n\nthe company.\n\nWe were able to map out the tools, relationships, and behaviors of the intrusion based on\n\nmemory and disk images provided by the organization. By matching the said information\n\nwith publicly documented resources such as MITRE ATT&CK, we were able to narrow down\n\nthe list of possible attackers despite some differences in the details. These details could\n\nhave been brought about by the customized software, security posture, and hardware\n\nutilization in the organization, as specific elements unique to the company appear to have\n\nbeen researched by the group (or groups) responsible.\n\nBy tracking and reverse-engineering the techniques and intrusion sets, as well as comparing\n\nthe published tactics, techniques, and procedures (TTPs), we tried to find the group (or\n\ngroups) responsible for the persistent threat. Initial analysis using MITRE potentially showed\n\nAPT32 or APT3 to be responsible for the attack. However, as we incorporated more known\n\ntools in analyzing some of the discrepancies from previously documented behaviors and\n\ntools, we came up with more detailed intrusion sets to show that there might be other\n\npotentially responsible groups. In the presence of the unidentified sets, tools, and behavior\n\nintersections, our investigation intends to add to the documented knowledge of the groups\n\nthat have been studied.\n\nWhile no organization hopes to be in these kinds of instances, enterprises who fall into\n\nsituations like these pose a unique experience that can develop and contribute to the\n\nsecurity landscape and defense standard of companies and countries. Technologies\n\navailable in the market today can better help investigators recreate the attack scenario and\n\nimprove the back-end protection that security operations centers (SOCs) depend on to\n\nprevent threats like these.\n\n\n-----\n\n## Introduction\n\nCybersecurity researchers and investigators use references such as MITRE ATT&CK[1] as a knowledge\n\nbase for information on preventing, studying, and mitigating known attack routine techniques and tactics.\n\nBased on observed capabilities, security teams can identify the intrusion sets or groups that were used in\n\norder to gain valuable insights to defend systems against attacks. The process of identification comprises\n\nseveral steps, such as comparing the sets and techniques, creating detection lists, and matching the\n\nsignature attacks with the specific APT groups for attribution and disclosure in the event of intrusions.\n\nCertain pieces of information, such as the actual targets of specific groups, also help the institutions’\n\nsecurity teams mount the necessary defenses against likely attack methods that are employed in their\n\nrespective industries.\n\nHowever, there is still a difference between experiencing an actual attack and reading descriptions of it.\n\nTheoretically, known attack signatures can be matched easily to identify the objective of a group, thereby\n\nimmediately thwarting the said attack based on known measures. In reality, however, attacks can be\n\nmodified to match the existing variables in the victim’s current state, such as the existing security posture,\n\nsoftware, or the machine environments being used. Threat actors are also known to deviate from their\n\npreviously used or publicly known routines to confuse or distract security teams, for instance by planting\n\nfalse flags.\n\nIn the same way that an investigator plays a central role in making the connections between analyzing the\n\ndetails of cybersecurity incidents and identifying the significant markers for attribution, technologies that\n\nare used by the company also perform a crucial role. Often, technologies such as endpoint detection and\n\nresponse (EDR) are able to monitor, detect, and identify the unusual behaviors and pivot both security and\n\ninvestigating teams to gain a comparison and reverse-analyze the granular intersections of attack routines,\n\ntool behaviors, techniques, and relationships. Recently, there have been developments with regard to a\n\nmore thorough detection and faster response as facilitated by a cross-layered detection and response\n\n(XDR) solution. By going beyond managed endpoints, XDR’s automated analysis of the previously siloed\n\nactivities and security layers enables faster detection, correlation, analysis, and response rates.\n\nIn the absence of these technologies, this paper looks into identifying and investigating both an APT\n\nattack and the actors behind the intrusion based on how MITRE grouped the techniques. Here we also\n\ncompare the identified sets to the documented TTPs and the data that we were given.\n\n\n-----\n\n## Scope and Initial Analysis\n\nAfter discovering a series of suspicious C&C traffic from one of their servers, we were invited by the\n\naffected company in 2019 to investigate and block the said communication and infection. Although the\n\nC&C was initially attributed to APT32 (not to mention despite detection of the malicious files), the unusual\n\ntraffic warranted further investigation.\n\nIn this particular case, the investigating team encountered some challenges. The only accessible data\n\nconsisted of the feedback and event logs from endpoints and agent-based servers from several identified\n\nmachines to validate the compromise. Additionally, the team had access to only five machines from which\n\ndisk and memory images were acquired. Lastly, there were no means to collect all of the samples and\n\ntools that were running in the systems’ environment.\n\nIt is worth emphasizing here that limited data in turn limits the process of making a complete map and\n\nattribution of an attack. To improve data-collection capability, it is recommended that organizations\n\nconsider EDR solutions.\n\nBased on the detections and logs, a total of 62 machines were initially identified as infected: Among\n\nthese were 10 servers, 13 machines containing binaries capable of file scraping and data exfiltration, and\n\n22 machines that had backdoor shells. The rest hosted either other tools used in the attack or normal\n\napplications that were used to load malicious libraries.\n\n**Drop and execute**\n\n**Drop and**\n**execute**\n\n**Drop and**\n**execute** **Backdoor shell**\n\nDLL **Drop and**\n\n**execute**\n\n**Sideloaded DLL** **Account stealers/** **Exfil tool**\n**Network scanners**\n\n**Drop and**\n**execute**\n\n**Drop and**\n**execute**\n\n**Drop and execute**\n\n**Drop and execute remotely**\n\nFigure 1. Initial assessment of the routine based on preliminary data collected\n\nThe backdoor shell enables the attacker to execute commands via cmd.exe, as shown when the normal\n\nprocess sideloaded a malicious DLL that dropped the backdoor. Tools like ProcDump and Mimikatz were\n\n\n-----\n\nused to acquire user accounts, while network scanning tools were used to find other machines. The\n\nresulting compromised accounts were used to map the inter-process communications share (also known\n\nas IPC$ share) of the newly discovered machines, while the mapping further allowed the backdoor to drop\n\ntools on the remote machine. To run the remotely dropped executable, two possible actions were taken:\n\nEither a scheduled task was created, or a wmic process create command was used. The tools that were\n\ndropped and executed were varied and in some cases, copies of the backdoor were dropped.\n\nOur analysis of the exfiltration tools showed that the attackers were mostly interested in document files\n\nsuch as Microsoft Office documents and PDFs. It was also evident that the attack had been in progress\n\nfor quite some time — likely even years — based on the timestamps of the binaries and how widespread\n\nthe infection was.\n\nBased on the mapped intrusion techniques, the group initially suspected was APT32 as referenced against\n\nMITRE ATT&CK.\n\n**MITRE ATT&CK Technique** **Observed Behavior** **In APT32?**\n\nT1059.003 – Windows Command Shell Backdoor samples created cmd.exe to execute Y\ncommands.\n\nT1053.005 – Scheduled Task/Job: schtask.exe created by cmd.exe to create tasks Y\nScheduled Task\n\nT1543.003 – Create or Modify System Installation of a service for a tool Y\nProcess: Windows Service\n\nT1047 – Windows Management wmic.exe created by cmd.exe to execute scripts and Y\nInstrumentation executables remotely\n\nT1547.001 – Boot or Logon Autostart Creation of autostart registry keys for normal Y\nExecution: Registry Run Keys/Startup programs with sideloads and placement of samples\nFolder in the startup folder\n\nT1078 – Valid Accounts Accounts with administrator privileges were used for N\nlateral movement.\n\nT1574.002 – Hijack Execution Flow: DLL Numerous normal binaries were used to load Y\nSideloading malicious DLLs.\n\nT1003.001 – OS Credential Dumping: procdump.exe was used to dump local security Y\nLSASS Memory authority subsystem service (LSASS). Mimikatz was\nused to get the necessary information.\n\nT1069 – Permission Groups Discovery Usage of net.exe to list groups N\n\nT1033 – System Owner/User Discovery Done through T1003.001 Y\n\nT1021.002 – Remote Services: SMB/ IPC$ share of remote machines were mapped and Y\nWindows Admin Shares tools were dropped.\n\nT1005 – Data from Local System Tools enumerated document/office files in the local N\ndrive.\n\nT1039/T1025 – Data from Network Tools enumerated documents in non-local drives. N\nShared/Removable Drive\n\nT1083 – File and Directory Discovery Tools enumerated documents. Y\n\nT1571 – Non-Standard Port Detected traffic used HTTP/S. Y\n\nTable 1. Observed techniques associated with APT32 based on MITRE ATT&CK\n\n|MITRE ATT&CK Technique|Observed Behavior|In APT32?|\n|---|---|---|\n|T1059.003 – Windows Command Shell T1053.005 – Scheduled Task/Job: Scheduled Task T1543.003 – Create or Modify System Process: Windows Service T1047 – Windows Management Instrumentation T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1078 – Valid Accounts T1574.002 – Hijack Execution Flow: DLL Sideloading T1003.001 – OS Credential Dumping: LSASS Memory T1069 – Permission Groups Discovery T1033 – System Owner/User Discovery T1021.002 – Remote Services: SMB/ Windows Admin Shares T1005 – Data from Local System T1039/T1025 – Data from Network Shared/Removable Drive T1083 – File and Directory Discovery T1571 – Non-Standard Port|Backdoor samples created cmd.exe to execute commands. schtask.exe created by cmd.exe to create tasks Installation of a service for a tool wmic.exe created by cmd.exe to execute scripts and executables remotely Creation of autostart registry keys for normal programs with sideloads and placement of samples in the startup folder Accounts with administrator privileges were used for lateral movement. Numerous normal binaries were used to load malicious DLLs. procdump.exe was used to dump local security authority subsystem service (LSASS). Mimikatz was used to get the necessary information. Usage of net.exe to list groups Done through T1003.001 IPC$ share of remote machines were mapped and tools were dropped. Tools enumerated document/office files in the local drive. Tools enumerated documents in non-local drives. Tools enumerated documents. Detected traffic used HTTP/S.|Y Y Y Y Y N Y Y N Y Y N N Y Y|\n\n\n-----\n\nBased on the available data, the techniques observed were mostly consistent with the listed intrusion\n\nset for APT32 in MITRE ATT&CK, except for four that were not associated with the group prior. However,\n\nif the set identification were to be based only on techniques, APT3 would also fit the observed map of\n\ntechniques and might be a closer match than APT32, as APT3 would have only three techniques that are\n\nnot associated with the group.\n\n**MITRE ATT&CK Technique** **Observed Behavior** **In APT32?** **In APT3?**\n\nT1059.003 – Windows Command Backdoor samples created cmd.exe to Y Y\nShell execute commands.\n\nT1053.005 – Scheduled Task/Job: schtask.exe created by cmd.exe to create Y Y\nScheduled Task tasks\n\nT1543.003 – Create or Modify Installation of a service for a tool Y Y\nSystem Process: Windows\nService\n\nT1047 – Windows Management wmic.exe created by cmd.exe to execute Y N\nInstrumentation scripts and executables remotely\n\nT1547.001 – Boot or Logon Creation of autostart registry keys for normal Y Y\nAutostart Execution: Registry Run programs with sideloads and placement of\nKeys/Startup Folder samples in the startup folder\n\nT1078 – Valid Accounts Accounts with administrator privileges were N Y\nused for lateral movement.\n\nT1574.002 – Hijack Execution Numerous normal binaries were used to load Y Y\nFlow: DLL Sideloading malicious DLLs.\n\nT1003.001 – OS Credential procdump.exe was used to dump local Y Y\nDumping: LSASS Memory security authority subsystem service (LSASS).\nMimikatz was used to get the necessary\ninformation.\n\nT1069 – Permission Groups Usage of net.exe to list groups N Y\nDiscovery\n\nT1033 – System owner/User Done through T1003.001 Y Y\ndiscovery\n\nT1021.002 – Remote Services: IPC$ share of remote machines were mapped Y Y\nSMB/Windows Admin Shares and tools were dropped.\n\nT1005 – Data from Local System Tools enumerated document/office files in the N Y\nlocal drive.\n\nT1039/T1025 – Data from Network Tools enumerated documents in non-local N Y\nShared/Removable Drive drives.\n\nT1083 – File and Directory Tools enumerated documents. Y N\nDiscovery\n\nT1571 – Non-Standard Port Detected traffic used HTTP/S. Y Y\n\nTable 2. Observed techniques associated with APT32 and APT3 based on MITRE ATT&CK\n\n|MITRE ATT&CK Technique|Observed Behavior|In APT32?|In APT3?|\n|---|---|---|---|\n|T1059.003 – Windows Command Shell T1053.005 – Scheduled Task/Job: Scheduled Task T1543.003 – Create or Modify System Process: Windows Service T1047 – Windows Management Instrumentation T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1078 – Valid Accounts T1574.002 – Hijack Execution Flow: DLL Sideloading T1003.001 – OS Credential Dumping: LSASS Memory T1069 – Permission Groups Discovery T1033 – System owner/User discovery T1021.002 – Remote Services: SMB/Windows Admin Shares T1005 – Data from Local System T1039/T1025 – Data from Network Shared/Removable Drive T1083 – File and Directory Discovery T1571 – Non-Standard Port|Backdoor samples created cmd.exe to execute commands. schtask.exe created by cmd.exe to create tasks Installation of a service for a tool wmic.exe created by cmd.exe to execute scripts and executables remotely Creation of autostart registry keys for normal programs with sideloads and placement of samples in the startup folder Accounts with administrator privileges were used for lateral movement. Numerous normal binaries were used to load malicious DLLs. procdump.exe was used to dump local security authority subsystem service (LSASS). Mimikatz was used to get the necessary information. Usage of net.exe to list groups Done through T1003.001 IPC$ share of remote machines were mapped and tools were dropped. Tools enumerated document/office files in the local drive. Tools enumerated documents in non-local drives. Tools enumerated documents. Detected traffic used HTTP/S.|Y Y Y Y Y N Y Y N Y Y N N Y Y|Y Y Y N Y Y Y Y Y Y Y Y Y N Y|\n\n\n-----\n\n## Analyses\n\nConsidering that both APT groups could be matched with the observed techniques, we needed to look\n\nfurther into the tools and the specific routines that each type underwent. Using the five endpoint targets\n\nwith the most number of tools installed, we analyzed the disk images and files extracted from these\n\nmachines and found a variety of tools, programs, and relationship clusters that the entire routine employed.\n\n##### Tools\n\n###### Exfiltration\n\nWe found six types of exfiltration tools, each with the capability to function (either with the other tools or\n\nindependently), extract the files needed from a variety of locations, store or send the files, obfuscate traffic\n\nand activity, or utilize the existing programs used by the company for data exfiltration.\n\n1. **TSPY_PILFERDOC.ZBGK**\n\nThis is a file scraper that harvests files, places them in a new directory, and creates a password-protected\n\nRAR archive with the use of an archiving tool. The scraper can run based on settings in a configuration\n\nfile from the command-line parameters that are passed to it. In this sample, that attackers relied on the\n\nconfiguration file.\n\n|Command-Line Switch|Profile Key|Function|\n|---|---|---|\n|S or s C or c Y or y P or p|SearchPath%d SavePath0 Type%d PositiveKey%d|Determining the drives to be searched. This setting is a “required drives to search documents in” as the tool still enumerates logical drives that are available. The path where documents will be copied to. It is set to <directory of tool>\\\\cache. The tool appends “dir” to the value it gets here. File extensions to be collected. By default this is set to “.doc”, “.pdf”, and “.txt”. File names to be collected. If this is not set, it will proceed to collect files that meet the other criteria.|\n\n\n-----\n\n|Command-Line Switch|Profile Key|Function|\n|---|---|---|\n|N or n I or i|NegativeKey%d Size0 Sleep0|File names not to be collected. If this is not set, it will proceed to collect files that meet the other criteria. Maximum size of file to be collected. This is required. Number of milliseconds for the tool to sleep after it finishes collecting files. The default value is 7,200,000.|\n\n\nTable 3. TSPY_PILFERDOC.ZBGK sample’s settings\n\nTSPY_PILFERDOC.ZBGK appears more as an archiving tool than as a piece of malware. Aside from what\n\nis given in the configuration file or the command-line switch, it enumerates the logical drives and files to\n\nbe searched while simultaneously avoiding the A and B drives, as well as removable drives. The files that\n\nare discovered are checked against the criteria given by the following: the p or PositiveKey%d setting (if\n\navailable), the n or NegativeKey%d setting (if available), the maximum file size restriction, and the list of\n\nfile extensions to be harvested.\n\nThe files are copied to what is set as the save path sequenced with the string \\dir\\. After the file enumeration\n\nis done and all the target files have been copied, the tool launches rar.exe (an archiving tool) via cmd.exe.\n\nThe name of the archive is a date-time string where all the “ : ” are converted to “ - ” and placed in the save\n\npath directory. It is worth noting that the save path and the name of the archive will be important in trying\n\nto correlate the tools that work together further into this analysis. A hard-coded password is also set on\n\nthe archive. Afterward, all the copied files are deleted except for the RAR files.\n\n2. **TSPY_KARYAL.ZAGK**\n\nThis tool complements TSPY_PILFERDOC.ZBGK as it sends files out of the network. While it can function\n\nas a standalone exfiltration tool (since it can enumerate files), it does not have the controls that TSPY_\n\nPILFERDOC.ZBGK has in sorting through the files to be collected and compressing the files before\n\nsending them out.\n\n**Switch** **Description**\n\nd Finds the IP address to be connected to and for sending the files to\n\np Finds the port to be used\n\nr Determines the number of threads to be created\n\nc Clean-up flag that deletes the file after it has been sent\n\nf File or directory to be sent or to search in\n\nTable 4. The command-line parameters used by TSPY_KARYAL.ZAGK\n\n|Switch|Description|\n|---|---|\n|d p r c f|Finds the IP address to be connected to and for sending the files to Finds the port to be used Determines the number of threads to be created Clean-up flag that deletes the file after it has been sent File or directory to be sent or to search in|\n\n\n-----\n\nTSPY_KARYAL.ZAGK was assigned the save path directory of TSPY_PILFERDOC.ZBGK as a parameter,\n\nimplying that if it works as programmed, TSPY_KARYAL.ZAGK will send the RAR archives created by the\n\nscraper. As aforementioned, this tool has the ability to enumerate files if the f switch is set to a directory.\n\nIt recursively finds files in the search directory and adds each file or directory that is found in the internal\n\nstructure for subsequent sending. Since TSPY_KARYAL.ZAGK sends all the files found in the set directory,\n\nTSPY_PILFERDOC.ZBGK’s clean-up feature becomes important in deleting copies. If the scraper fails to\n\ndelete the files archived, TSPY_KARYAL.ZAGK can end up sending all the copied files and suspiciously\n\nincreasing network traffic. Evidence also shows that the tools do not have persistence mechanisms,\n\nwhich means that the attacker is responsible for timing the execution of each tool.\n\nFor every file it finds, a thread is created to send the file out. The tool also does both thread management\n\nand the closing of old threads.\n\nMetadata, which includes both the computer name and the username, is sent first. The C&C response\n\ncontains information on whether the contents of the file are sent or not. We also observed that there is a\n\nminimum file size requirement before a file is sent, with all packets encrypted using the exclusive operator\n\n(XOR). After the file is sent out, if the c switch is used, the tool deletes the file that it sent.\n\n3. **HKTL_FILEDOWNLD**\n\nThis tool downloads a file from a site and writes that file locally on the drive. The main function of this tool\n\ninitially appears to be that of a downloader of additional tools in the infected machine. However, closer\n\ninspection shows that it downloads documents — specifically PDFs — from a given site.\n\nIt also has four parameters: The first contains the complete URL of the site that the tool downloads from.\n\nThe second is a date, the third is a timestamp, and the fourth is an ID. Of the four parameters, only the\n\nfirst is required while the rest of the parameters are optional.\n\nThis tool requires the complete URL of the target file (or files) and file names to be retrieved, both of which\n\ncome from another tool. The next tool might have helped the attacker get some of the aforementioned\n\nnecessary information.\n\n4. **PowerShell database tool**\n\nThis is a PowerShell script that is used to query a MySQL database. The script takes in a connection\n\nstring that includes the server, unique identification (UID), password, and the database. It also takes in\n\nan SQL query string that it will execute. The following is a typical example of what is passed to the tool:\n\n\n“Run-MySQLQuery -ConnectionString ‘Server=<server>;Uid=<account\n\nname>;Pwd=<password>;database=<database name>’ -Query <SQL query> –Dump”\n\n\nFigure 2. The connection string that is used to query a MySQL database\n\n\n-----\n\nBased on an observation of the command-line parameters passed to this tool, the attacker knew the\n\ndatabase servers, root accounts, database names, and general information that the database holds. In all\n\nobserved cases, queries were used to get document records based on the date or record ID. The results\n\nof the query were written in a CSV file.\n\nAlthough the tool does not get the documents, the information that it gathers can be used for another\n\ntool, such as HKTL_FILEDOWNLD. Since this tool looks into the databases, it is possible that at least one\n\ndatabase holds the URL needed for HKTL_FILEDOWNLD. Coincidentally, we noticed a five- to seven-day\n\ngap between the execution of the tools. At this point in the investigation, however, we could not make\n\ndirect connections between the two tools.\n\n5. **HKTL_FTPEXFIL**\n\nThis tool differs slightly from TSPY_PILFERDOC with regard to how it copies files to its temporary folder.\n\nInstead of directly copying the files that it finds, it writes the file paths on a text file. The text file is read\n\nand each file path that it finds is then copied to the temporary directory of the exfiltration tool. The name of\n\nthe temporary directory is based on the system date, and the resulting directory follows the format “<tool\n\npath>\\yyyymmdd”. The files are archived using 7-Zip embedded in itself and encrypted by a simple XOR\n\nkey. The files are sent out using FTP along with some metadata that had been written to the text file earlier.\n\nThe tool takes the following parameters: the path to search files in, the IP address of the FTP server, the\n\nusername and the password to access the FTP, and the hosts.\n\nThe files in the temporary directory are deleted to hide what HKTL_FTPEXFIL has exfiltrated.\n\n6. **BKDR_NULTUS.ZCGK**\n\nAt this point in our investigation, not much can be written about this tool except that it was seen to\n\naccess documents on drives in the machine. It was placed in a startup folder and proved hard to reverse\nengineer. However, we will elaborate on this tool as the study unfolds.\n\nTSPY_PILFERDOC.ZBGK works with TSPY_KARYAL.ZAGK as it is responsible for gathering the\n\ndocuments from the local drive with TSPY_KARYAL.ZAGK. The directory where the former creates the\n\nRAR archive is given as a parameter to the latter, meaning that the files found in that directory are sent out\n\nby TSPY_KARYAL.ZAGK. TSPY_KARYAL.ZAGK runs as a scheduled task set to run hourly. On the other\n\nhand, TSPY_PILFERDOC.ZBGK is either executed through a command via a shell backdoor or set to run\n\nonce via an autostart registry entry.\n\nThe company uses a document management system where the back-end database is MySQL. As the\n\nPowerShell database tool is used to query the said type of database, it tries to get the latest document\n\nrecords or specific document records based on record IDs. It is possible that the information that the\n\nPowerShell script gets is used by HKTL_FILEDOWNLD.\n\n\n-----\n\nSince we worked on the assumption that this is an attack that was perpetrated using one intrusion set, the\n\nfirst four tools working together therefore maximizes the attackers’ search function and gathers as many\n\ndocuments as the tools can. The first pair of tools gathers documents on drives while the second pair gets\n\ndocuments saved in the document management system.\n\nHowever, BKDR_NULTUS.ZCGK does not appear to fit. Considering that TSPY_PILFERDOC already has\n\nthe ability to get files from drives, it seems that BKDR_NULTUS.ZCGK functions as a duplicate. We also\n\nnoticed that the way BKDR_NULTUS.ZCGK is written significantly differs from the others as it employs a\n\npacking or encryption mechanism that was not observed with the others. It is also possible that TSPY_\n\nPILFERDOC is an updated tool used by the attacker.\n\n###### Backdoors\n\nShell backdoors facilitated the routine’s spread across the network, including its capabilities of moving\n\nlaterally and deploying tools to gather user accounts, among others.\n\nHere, we enumerate the backdoor tools that we found:\n\n1. **BKDR_HANNOTOG**\n\nThis backdoor opens a cmd.exe process to execute commands received from a remote website. The\n\ncommands are decrypted and passed onto cmd.exe using a pipe. The result of the execution is read from\n\nthe pipe, encrypted, and sent back, with the IP address of the site given as a parameter from the two\n\nvariants that we found.\n\nThese backdoor tools do not contain code to set their persistence. Instead, they receive a command to\n\ncreate scheduled tasks that run once at a specific time. They also have the capability to drop other tools\n\nin the system.\n\nWe discovered three distinct variants: an x86 executable, an x64 version that reflectively loads a DLL file\n\npacked in its resource section, and an x86 version with a hard-coded IP address of the C&C. We analyzed\n\nthe executed commands through this backdoor:\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Getting account information Checking the currently logged user Persistence mechanism for the backdoor Persistence mechanism for a sideloaded threat|“net user <user account> /domain” “whoami” “schtasks /create /tn <taskname> /tr <backdoor filepath and parameters> /sc once /st <start time> /ru <user name>” “reg.exe add hklm\\software\\microsoft\\windows\\ currentversion\\run /v <value> /t REG_EXPAND-ZA /d <file path of normal application>”|T1087.002 T1033 T1053.005 T1547.001|\n\n\n-----\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Executing a tool remotely via scheduled task Executing an archiving/zipping tool to gather documents in the user directories Lateral movement using the IPC$ share with an admin account|“schtasks /create /tn <taskname> /s <ip> /u <user account> /tr <backdoor filepath and parameters> /sc once /st <start time> /ru SYSTEM” “-m5 –r –ta<yyyymmddhhmmss> -hpp<password> a <archive name> c:\\users\\*.doc” “net use \\<ip address> <password> /user:<user name>”|T1053.005 T1560.001 T1021.002|\n\n\nTable 5. Commands executed through BKDR_HANNOTOG\n\n2. **TROJ_SHELLLOAD**\n\nThis sample reflectively loads another binary. It can be used to load other binaries or tools as long as it\n\nconforms to how the binary is unpacked and loaded in the memory. In this case, feedback data showed\n\nthat this loaded a backdoor shell. In particular, x86 and x64 versions were discovered, and both versions\n\nexecute commands via cmd.exe.\n\n**MITRE ATT&CK**\n**Purpose** **Command**\n**Technique**\n\nChecking the currently logged “/c quser”, “whoami” T1033\nuser\n\nGetting account information “net user <user account> /domain” T1087.002\n\nGetting the computer names “net group Domain <Group name> /domain” T1069.002\nconnected to the domain\n\nDisplaying the running “tasklist”, “tasklist /svc” T1057\nprocesses in a machine\n\nMapping the IPC$ share using “net use \\<ip>\\ipc$ <password> /user:<user account>” T1021.002\nan admin account\n\nExecuting remote scripts using “wmic /node<ip> /USER:<user account> / T1047\nwmic.exe PASSWORD:<password> process call create <file path>”\n\nTable 6. Commands executed through TROJ_SHELLLOAD\n\nBased on the behavior, TROJ_SHELLLOAD’s final form differs from BKDR_HANNOTOG with regard to\n\nhow it drops and executes tools laterally. First, it maps the IPC$ share using an administrator account.\n\nSecond, to execute a tool remotely, it uses wmic and executes a batch file while BKDR_HANNOTOG\n\nrelies on the creation of the scheduled tasks remotely. Gone are the commands to manually install\n\nautostart mechanisms for tools that are dropped locally and remotely. TROJ_SHELLLOAD (or whatever it\n\nreflectively loads or drops) has its own mechanism.\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Checking the currently logged user Getting account information Getting the computer names connected to the domain Displaying the running processes in a machine Mapping the IPC$ share using an admin account Executing remote scripts using wmic.exe|“/c quser”, “whoami” “net user <user account> /domain” “net group Domain <Group name> /domain” “tasklist”, “tasklist /svc” “net use \\<ip>\\ipc$ <password> /user:<user account>” “wmic /node<ip> /USER:<user account> / PASSWORD:<password> process call create <file path>”|T1033 T1087.002 T1069.002 T1057 T1021.002 T1047|\n\n\n-----\n\n3. **TROJ_QUASLOAD.ZBGK**\n\nThis is a .NET compiled library that loads and executes a companion binary, a compiled QUASAR remote\n\naccess trojan (RAT) file. Based on feedback data, the final tool is a backdoor shell. In addition, it can also\n\ngather compiled and zipped archives. The observed commands executed by the shell are the following:\n\n**MITRE ATT&CK**\n**Purpose** **Command**\n**Technique**\n\nGetting account information “net user <user account> /domain” T1087.002\n\nMapping of remote machines “net use \\<ip address> <password> /user:<user name>” T1021.002\nusing an admin account\n\nTable 7. Commands executed through TROJ_ QUASLOAD.ZBGK\n\nThough TROJ_QUASLOAD.ZBGK and TROJ_SHELLLOAD were written in different languages, the former\n\nis similar to the latter with regard to loading a binary in memory.\n\n4. **Backdoor4**\n\nBackdoor4 functions as a dropper and a shell backdoor. Based on the feedback, it can drop and execute\n\nother binaries and launch cmd.exe through the following commands:\n\n**MITRE ATT&CK**\n**Purpose** **Command**\n**Technique**\n\nPersistence mechanism for a “reg.exe add hkcu\\software\\microsoft\\windows\\ T1547.001\nsideloaded threat currentversion\\run /v <value> /t REG_EXPAND-ZA /d\n<file path of normal application>”\n\nAdding new accounts “net user <user name> <password> /add” T1136.001\n\nModifying user accounts “net localgroup administrators <created account> /add” T1136.001\n\nTable 8. Commands executed through Backdoor4\n\n5. **Web shell**\n\nApache web servers are deployed in the environment of the organization. In this case, the attackers took\n\nadvantage of these web servers to deploy web shells in some of the machines. It is possible that there\n\nis more than one type of web shell in the environment, and the following are the commands executed\n\nthrough these web shells:\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Getting account information Mapping of remote machines using an admin account|“net user <user account> /domain” “net use \\<ip address> <password> /user:<user name>”|T1087.002 T1021.002|\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Persistence mechanism for a sideloaded threat Adding new accounts Modifying user accounts|“reg.exe add hkcu\\software\\microsoft\\windows\\ currentversion\\run /v <value> /t REG_EXPAND-ZA /d <file path of normal application>” “net user <user name> <password> /add” “net localgroup administrators <created account> /add”|T1547.001 T1136.001 T1136.001|\n\n\n-----\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Checking the currently logged user Persistence mechanism for a sideloaded threat Persistence mechanism for another tool PowerShell execution of a script|“whoami” “reg.exe add hklm\\software\\microsoft\\windows\\ currentversion\\run /v <value> /t REG_EXPAND-ZA /d <file path of normal application>” “schtasks /create /tn <taskname> /tr < filepath and parameters> /sc hourly /mo 2 /sd <start date> /ru system” -exe bypass -nop -w hidden -c Import-Module <powershell script><parameters>|T1033 T1547.001 T1053.005 T1059.001|\n\n\nTable 9. Commands executed through web shell\n\nBased on the similarity of the file path parameters, T1033 and T1547.001 could have been executed\n\nthrough one web shell. The execution of the PowerShell stands out because the file path of the script is\n\ntotally different.\n\n6. **BKDR_XRAT.ZCHB**\n\nThis backdoor is a .NET-compiled shell backdoor. Based on feedback, it gets installed as a service and\n\nhas exfiltration and dropping capabilities. The following are the commands that were executed:\n\n**MITRE ATT&CK**\n**Purpose** **Command**\n**Technique**\n\nPersistence mechanism for “schtasks /create /tn <taskname> /tr < filepath and T1053.005\nanother tool parameters> /sc hourly /mo 2 /sd <start date> /ru\nsystem”\n\nPersistence mechanism for a “reg.exe add hklm\\software\\microsoft\\windows\\ T1547.001\nsideloaded threat currentversion\\run /v <value> /t REG_EXPAND-ZA /d\n<file path of normal application>”\n\nChecking for cmd.exe “tasklist /fi “imagename eq cmd.exe”” T1057\n\nTable 10. Commands executed through BKDR_XRAT.ZCHB\n\nBKDR_XRAT.ZCHB closely resembles TROJ_QUASLOAD.ZBGK since both are written in .NET. However,\n\nBKDR_XRAT.ZCHB does not have to load a binary to work. Additionally, BKDR_XRAT.ZCHB is a compiled\n\nversion 2.0 of XRAT, making the configuration samples different.\n\n|Purpose|Command|MITRE ATT&CK Technique|\n|---|---|---|\n|Persistence mechanism for another tool Persistence mechanism for a sideloaded threat Checking for cmd.exe|“schtasks /create /tn <taskname> /tr < filepath and parameters> /sc hourly /mo 2 /sd <start date> /ru system” “reg.exe add hklm\\software\\microsoft\\windows\\ currentversion\\run /v <value> /t REG_EXPAND-ZA /d <file path of normal application>” “tasklist /fi “imagename eq cmd.exe””|T1053.005 T1547.001 T1057|\n\n\n-----\n\nThe variety of shell backdoors and the singularity in their purposes are noticeable. Although they were\n\nwritten and built differently, they both function to give the attacker the ability to run commands on the\n\ntargeted machine. With the exception of BKDR_HANNOTOG and BKDR_XRAT.ZCHB, which can both\n\ndrop files and send data out, the main functions of these tools are to connect outside and execute\n\ncommands via cmd.exe.\n\n###### Miscellaneous\n\nAside from the list of backdoors and exfiltration tools, we found a variety of other tools deployed in the\n\nsystem that support different functions for the routines. It should be noted that although this is not an\n\nexhaustive list of tools (since there could be others scattered in the network), it does contain the tools that\n\nwe observed from the machines that we were given. As a result, the significance of these tools cannot be\n\ntaken for granted.\n\n1. **TROJ_CHINOXY.ZAGK**\n\nTROJ_CHINOXY.ZAGK is a file dropper. As such, it drops a legitimate file of a phone manufacturer along\n\nwith a malicious sideloaded .dll and places it in the startup folder for persistence.\n\n2. **Malicious sideloaded DLLs**\n\nThe functions of these sideloaded DLLs are varied. We analyzed that some were used as droppers, and\n\nothers were used as backdoor tools, while some were used as part of the exfiltration processes, among\n\nother functions observed.\n\n3. **Procdump**\n\nProcdump was used profusely during the attack to dump the memory of LSASS.\n\n4. **Mimikatz**\n\nMimikatz was utilized heavily alongside Procdump.\n\n5. **HackTool.Win32.NBTScam.A**\n\nThis was used to find name servers and open shares.\n\n###### Tool Relationships\n\nThese tool relationships are based on the processes that dropped, launched, or created a persistence\n\nmechanism for another object.\n\n\n-----\n\n1. **Relationship A**\n\n|Drop and execute|Drop|\n|---|---|\n\n\n**Batch file**\n\n\n**TROJ_CHINOXY.ZAGK**\n\n**Drop**\n\n**Load**\n\nDLL\n\n**Normal application** **Malicious DLL**\nThere are instances when\nthis acts like a backdoor shell\n\n**Launch**\n\n**Create**\n**autostart**\n\n\n**HKTL_FTPEXFIL**\n\n\n**Procdump**\n\n\nFigure 3. A relationship map of TROJ_CHINOXY to HKTL_FTPEXFIL\n\nRelationship A shows TROJ_CHINOXY.ZAGK dropping a normal application, a DLL used by the normal\n\napplication, and a batch file. The normal application loads and executes the malicious DLL, while a\n\nsample shows evidence of the DLL launching HKTL_FTPEXFIL.\n\n2. **Relationship B**\n\n**Execute** **Execute**\n\n\n**Sideloaded DLL** **BKDR_HANNOTOG**\n\n**Create autostart** **Drop**\n\n\n**HKTL_FILEDOWNLOAD**\n\n\n**Normal application** **Various tools:**\nProcdump\nMIMIKATZ\nHacktool.Win32.NBTScan.A\n\nFigure 4. A relationship map of BKDR_HANNOTOG to HKTL_FILEDOWNLD\n\n\n-----\n\nRelationship B shows BKDR_HANNOTOG, which is launched by a malicious sideloaded DLL. Considering\n\nthat BKDR_HANNOTOG does not have its own persistence mechanism, this map is one piece of evidence\n\nof how it is launched.\n\nBKDR_HANNOTOG creates autorun entries for various components, some of which are straightforward\n\nregistry autorun entries for normal applications. These applications normally do not have such autostart\n\nentries, making this behavior stand out. We believe that these normal applications load malicious DLLs.\n\nThere are also some instances when it created registry service entries for other malicious files.\n\nBKDR_HANNOTOG also drops other tools such as Procdump, Mimikatz, and NBTScan to the environment.\n\nMeanwhile, the name of the file that is to be downloaded (and which will use HKTL_FILEDOWNLD),\n\nincluding a URL link, is missing. We consider the URL link and file names as the missing pieces of this\n\ndiagram:\n\n3. **Relationship C**\n\n**Create**\n**autostart**\n\n**Backdoor4.var** **Scheduled task entry**\n**for normal application**\n\n**Drop** **Execute** **Execute** **Execute**\n\n\n**JScript tools** **Dropper**\n\n**Execute**\n\n**Batch file** **Normal file with**\n**sideload**\n\n\n**Backdoor4** **BKDR_XRAT.ZCHB** **Procdump**\n\n**Drop**\n\n**Encrypt**\n**action**\n\n**Normal application** **Encrypt archived**\n**with possible sideloads** **documents**\n\n|Col1|Execute Backdoor4|\n|---|---|\n|||\n\n\nFigure 5. Relationship C shows the connections of the tools to BKDR_XRAT.ZCHB.\n\nThis diagram shows BKDR_XRAT.ZCHB as the backdoor that is responsible for remotely executing\n\nBackdoor4. It is significant to note that the behavior of BKDR_XRAT.ZCHB toward some document\n\narchives also stood out. For example, we observed it accessing and possibly encrypting .RAR files in a\n\nremote machine. Notably, the location of the said archives plays an important role later when the samples\n\nare bundled together based on locations.\n\n\n-----\n\n4. **Relationship D**\n\nEXE\n\n**httpd.exe**\n\n**Create**\n**autostart**\n\n**Normal application**\n**with sideload**\n\n\n**TSPY_PILFERDOC.ZBGK**\n\n**Execute**\n\n**PowerShell database tool**\n\n\nFigure 6. Modules connected to the web shells hosted by Apache\n\nRelationship D shows the objects connected to the web shells that are hosted by Apache. There is a\n\nconnection among TSPY_PILFERDOC.ZBGK, TSPY_KARYAL.ZAGK, web shells, and the sideloaded DLL.\n\nAside from this, the PowerShell database tool appears separate from the three. TSPY_PILFERDOC.ZBGK\n\nand TSPY_KARYAL.ZAGK appear to have no use for the output of the script, which is a compilation of the\n\nrecords that were queried from a MySQL database in CSV format. It is possible that HKTL_FILEDOWNLD\n\nwould make use of the data that is produced by the script mentioned.\n\nRelationship A and B showed a “near complete” infection: a C&C module and a working payload, which\n\nin both cases are exfiltration tools. However, Relationship B’s missing piece is a tool for finding the\n\ndocuments that it is supposed to download, possibly from an internal site.\n\nWhile Relationship D appears complete, there is nevertheless no proof that there is a working C&C module.\n\nFurthermore, the PowerShell script tool does not fit. On the other hand, Relationship C does not have any\n\nexfiltration tool directly linked to it.\n\nThe next set of tool relationships will show how the incomplete clusters are connected, considering the\n\nlocation and naming convention followed by the objects.\n\n\n-----\n\n5. **Relationship E**\n\n\n\n**•**\n\n\n**BKDR_XRAT.ZCHB in Relationship C**\n**accessed the archive created by**\n**TSPY_PILFERDOC.ZBGK in**\n**Relationship D.**\n\n**Backdoor4 in Relationship C is in**\n**the same directory as**\n**TSPY_PILFERDOC.ZBGK in**\n**Relationship D.**\n\n\nFigure 7. Relationship E shows how the objects line up in Relationships C and D.\n\nRelationship E shows the possible connections between the components of Relationships C and D.\n\nBKDR_XRAT.ZCHB, found in Relationship C, attempts to encrypt archived files created by TSPY_\n\nPILFERDOC.ZBGK, which is in Relationship E. Backdoor4 is in a directory with the same name as TSPY_\n\nPILFERDOC. ZBGK, thereby establishing a “thin connection.” BKDR_XRAT.ZCHB, Backdoor4, and the\n\nobjects in Relationship D are related.\n\n6. **Relationship F**\n\n\n\n**•**\n\n\n**BKDR_HANNOTOG in Relationship B**\n**is located in the same directory as**\n**the PowerShell script.**\n\n**The data generated by the**\n**PowerShell database tool**\n**could be an input for**\n**HKTL_FILEDOWNLOAD.**\n\n\nFigure 8. Relationship F shows the possible relationships between the modules in Relationship B and\n\nthe PowerShell database tool.\n\nThe PowerShell database tool was originally in Relationship D with TSPY_PILFERDOC.ZBGK and\n\nTSPY_KARYAL.ZAGK. As aforementioned, neither of the tools has a need for the data generated by the\n\nPowerShell script. Additionally, neither TSPY_PILFERDOC.ZGBK nor TSPY_KARYAL.ZAGK fits with the\n\ntwo exfiltration tools.\n\nHowever, we observed that the PowerShell script is located in the same directory as BKDR_HANNOTOG.\n\nAlthough the link seems superficial, considering the uniqueness of the tools’ locations increases\n\nthe likelihood that the two are related. Moreover, it is possible that the required parameter of HKTL_\n\nFILEDOWNLD is generated by the PowerShell script. HKTL_FILEDOWNLD requires a complete URL and\n\na file name to work, while the PowerShell scripts extract the file names of documents from a MySQL\n\ndatabase that would likely be the back-end database of the organization’s document management system.\n\n\n-----\n\nWhile there is no proof that whatever installed or executed BKDR_HANNOTOG or HKTL_FILEDOWNLD\n\nis the same as that which installed the PowerShell script, including the PowerShell in Relationship B\n\ncompletes the exfiltration capabilities of HKTL_FILEDOWNLD.\n\n##### Updated MITRE ATT&CK\n\nWe looked further into the behaviors and routines to find stronger connections between these relationships,\n\nas well as a more thorough examination of both the techniques and tools that we initially found to be\n\nunconnected. As a result, we found new TTPs and listed them here:\n\n**MITRE ATT&CK Technique** **Observed Behavior** **In APT32?** **In APT3?**\n\nT1505.003 – Server Software Relationship E shows that either there is one Y N\nComponent: Web Shell web shell or two web shells installed.\n\nT1136.001 – Create Account: Backdoor4 created a new account. N Y\nLocal Account\n\nT1057 – Process Discovery BKDR_XRAT.ZCHB and TROJ_SHELLLOAD N Y\ninvoked tasklist via cmd.exe.\n\nT1560.001 – Archive Collected TSPY_PILFERDOC.ZBGK and HKTL_FTPEXFIL N Y\nData: Archive via Utility compressed the files into archives.\n\nT1029 – Scheduled Transfer TSPY_KARYAL.ZAGK was set to run every N N\nhour.\n\nT1020 – Automated Exfiltration TSPY_KARYAL.ZAGK was set to run every N N\nhour.\n\nTable 11. New MITRE TTPs based on an analysis of behaviors and relationships\n\nThe additional TTPs we found, however, did not help much in identifying the intrusion set. T1136.001,\n\nT1057, and T1560.001 are the only known techniques that APT3 uses, while T1505.003 is identified with\n\nAPT32. Although our initial analysis of the backdoor tool being central to the attack still stands, it appears\n\nthat both the variety of the tools and the relationships that we found after investigating the infection further\n\nmake the entire structure seem more complicated.\n\nAdditionally, the backdoor types looked different from each other. Although the functions that each\n\nprovided as shell backdoors were the same, the way that they were written and used were different, just\n\nas the extra features that some of them had were also different.\n\nThe following are examples of these differences:\n\n- There is a lack of a persistence mechanism in BKDR_HANNOTOG, whereas there is a presence of\n\none in TROJ_SHELLLOAD.\n\n- BKDR_XRAT.ZCHB and TROJ_QUASLOAD.ZBGK were written in .NET, while BKDR_HANNOTOG\n\nwas written in a C-type language.\n\n|MITRE ATT&CK Technique|Observed Behavior|In APT32?|In APT3?|\n|---|---|---|---|\n|T1505.003 – Server Software Component: Web Shell T1136.001 – Create Account: Local Account T1057 – Process Discovery T1560.001 – Archive Collected Data: Archive via Utility T1029 – Scheduled Transfer T1020 – Automated Exfiltration|Relationship E shows that either there is one web shell or two web shells installed. Backdoor4 created a new account. BKDR_XRAT.ZCHB and TROJ_SHELLLOAD invoked tasklist via cmd.exe. TSPY_PILFERDOC.ZBGK and HKTL_FTPEXFIL compressed the files into archives. TSPY_KARYAL.ZAGK was set to run every hour. TSPY_KARYAL.ZAGK was set to run every hour.|Y N N N N N|N Y Y Y N N|\n\n\n-----\n\n- The use of wmic by TROJ_SHELLLOAD is not found in the other backdoor types.\n\n- The administrator shares that were used also varied.\n\nThe exfiltration tools also varied, although some of them duplicated the function of the others. For instance,\n\nHKTL_FTPEXFIL has the same capability as TSPY_KARYAL and TSPY_PILFERDOC. It also appears that\n\nTSPY_KARYAL is taken over by BKDR_XRAT.ZCHB in some instances. The redundancies in the tools\n\nmight be intentionally designed. In the possible instance that AV solutions detect and block at least one\n\ntool in the intrusion set, enabling a variety of functions in the tools and having more than one tool that can\n\ndo the same task both ensure that the attack can still be successful.\n\nThere were also four “complete” clusters formed after grouping the tools based on the process trees and\n\nfile path similarities. Based on how complete a cluster is, it could probably work independently of others.\n\nHowever, BKDR_NULTUS.ZCGK and TROJ_SHELLLOAD are still unaccounted for.\n\nOverall, there seems to be a disjunction between the tools and the relationships formed. Both initial and\n\nsecondary analyses give the impression that this is not a straightforward APT attack and that something\n\nelse was happening in the environment at the time that the attack was occurring.\n\n##### Suspected Groups and Related Campaigns\n\nWe looked into the binaries and compared them against known intrusion set tools. As a result, we learned\n\nthat there were at least four distinct sets at play. Based on this, we enumerated and mapped the main\n\nsets.\n\n###### Intrusion Set 1\n\nOur analysis showed that the tools in this set can be attributed inconclusively to several groups, all\n\nof which used simplified Chinese language components. Some of the possible links that we found to\n\nbe related to this particular intrusion set had already been published previously, although they can still\n\nbe used by other groups.[2] The intrusion set is composed of a dropper, a sideloaded backdoor, and an\n\nexfiltration tool. Intrusion Set 1 seems to fit well with the behaviors that were observed in Relationship A.\n\nTROJ_CHINOXY.ZAGK, placed in the autostart folder, drops the normal application: a batch file and the\n\nmalicious .dll, BKDR_CHINOXY.ZAGK. The .dll is sideloaded by the normal application. BKDR_CHINOXY.\n\nZAGK, meanwhile, was observed as launching tools such as ProcDump and SysInfo. It also runs HKTL_\n\nFTPEXFIL, which collects, archives, and sends data out.\n\nFor Intrusion Set 1, the tools identified by their detections are TROJ_CHINOXY.ZAGK, the sideloaded .dll\n\nBKDR_CHINOXY.ZAGK, and HKTL_FTPEXFIL. The techniques that were mapped are:\n\n\n-----\n\n|MITRE ATT&CK Technique|Observed Behavior|\n|---|---|\n|T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1574.002 – Hijack Execution Flow: DLL Sideloading T1059.003 – Windows Command Shell T1053.005 – Scheduled Task/Job: Scheduled Task T1082 – System Information Discovery T1087.002 – Account Discovery: Domain Account T1003.001 – OS Credential Dumping: LSASS Memory T1560 – Archive Collected Data T1048 – Exfiltration Over Alternative Protocol|Dropper1 was placed in a startup folder. Dropper dropped the normal application in the %mytemp% folder along with the malicious .dll, BKDR_CHINOXY.ZAGK. BKDR_CHINOXY.ZAGK launched cmd.exe, which it used to execute commands and tools. Scheduled tasks were used to run tools such as ProcDump. SystemInfo was invoked. Net user <user account> /dom was invoked on a couple of user accounts. ProcDump was used to dump the memory of LSASS. HKTL_FTPEXFIL compressed the files that it collects. HKTL_FTPEXFIL had the capability to send the data out by FTP.|\n\n\nTable 12. Intrusion Set 1 TTPs\n\n###### Lotus Blossom\n\nThe tools, techniques, and motive of this intrusion set are similar to those identified with the group Thrip,[3]\n\nwhich is known as part of the Lotus Blossom group. In our previously published works, such as our paper\n\n“Targeted Attack Trends in Asia-Pacific,” we also followed and identified this group as LStudio.[4]\n\nMost of the tools and binaries that we found in Relationship B were clustered in this intrusion set. The\n\nbinaries that belong here are either located in the system directory or in one of the subdirectories. BKDR_\n\nHANNOTOG is the shell backdoor that was widely used in this infection. Other backdoors were also used\n\n(such as BKDR64_WYZINA, TROJ64_SAGRUNEX.SMZTGD-A, and BKDR64_METREVHTTPS.ZCGK),\n\nalthough these were not as prominent as BKDR_HANNOTOG. Some of these tools were in fact even\n\ninstalled using BKDR_HANNOTOG.\n\nFor its exfiltration payload, BKDR_HANNOTOG was responsible for documents in the local file\n\nsystem, while HKTL_FILEDOWNLD was responsible for files in the document management system.\n\nBKDR_HANNOTOG triggered a compression tool to discover and archive files in the local machine,\n\nwhereas HKTL_FILEDOWNLD downloaded document files from an internal repository. To download the\n\ndocuments, HKTL_FILEDOWNLD needed the names and locations of the documents. The information\n\ncould have been obtained by the PowerShell script that is located in a directory where some of the\n\nBKDR_HANNOTOG samples had been placed. The parameters that were given to the PowerShell script\n\nsearched for document information from the database given using either the record date (for example, the\n\nmost recent documents that had been added) or the record ID. It is thus safe to assume based on this\n\n\n-----\n\nthat the attacker was looking for the latest documents that had been added to the system, or for certain\n\ndocuments that belong to a particular record.\n\nIf the PowerShell script is part of this intrusion set, this means that there is an unidentified web shell that\n\nshould be part of this set as well. The tools that we found in this set are:\n\n1. BKDR64_HANNOTOG.ZAGK\n\n2. BKDR_HANNOTOG.ZBGK\n\n3. BKDR_HANNOTOG.ZCGK\n\n4. TROJ64_SAGRUNEX.SMZTGD-A\n\n5. BKDR64_METREVHTTPS.ZCGK\n\n6. HKTL_FILEDOWNLD\n\n7. Hacktool.Win32.NBTScan.A\n\nThe next set of tools are more generic in nature, which makes it difficult to associate them with a particular\n\nset. Still, it is more likely that they are also part of the following intrusion set, since the names, as well as\n\nwhere they are installed, are consistent with the tools listed prior. These tools are:\n\n8. BKDR64_WYZINA.ZBGK\n\n9. TROJ_CMDINJECT\n\n10. TROJ64_CMDINJECT\n\n11. HackTool.Win64.MIIKATZ.AO\n\n12. HKTL_MIMICLI\n\n13. NBTScanner\n\nThe techniques used for this set are:\n\n|MITRE ATT&CK Technique|Observed Behavior|\n|---|---|\n|T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1543.003 – Create or Modify System Process: Windows Service T1574.002 – Hijack Execution Flow: DLL Sideloading T1059.003 – Windows Command Shell T1053.005 – Scheduled Task/Job: Scheduled Task|This was used to start a normal application with a sideload and as the autostart of CMDINJECT. Services were created for some of the tools that were deployed. A normal application with a sideloaded .dll installed BKDR_HANNOTOG. BKDR_HANNOTOG launched cmd.exe, using it to launch commands and tools. Scheduled tasks were used to run tools including BKDR_HANNOTOG itself.|\n\n\n-----\n\n|MITRE ATT&CK Technique|Observed Behavior|\n|---|---|\n|T1033 – System Owner/User Discovery T1087.002 – Account Discovery: Domain Account T1078 – Valid Accounts T1046 – Network Service Scanning T1003.001 – OS Credential Dumping: LSASS Memory T1021.002 – Remote Services: SMB/ Windows Admin Shares T1005 – Data from Local System T1560.001 – Archive Collected Data: Archive via Utility|whoami was launched via BKDR_HANNOTOG. Net user <user account> /dom was invoked on a couple of user accounts. Accounts with administrator privileges were used for lateral movement. The intrusion set contained an NBTScanner. HackTool.Win64.MIMIKATZ.AO was used. Net use was abused with valid user credentials to move laterally. BKDR_HANNOTOG, using an archiver, enumerated document files in c:\\users. Evidence suggests that BKDR_HANNOTOG used a tool to compress files from the local machine.|\n\n\nTable 13. Lotus Blossom TTPs\n\n###### Intrusion Set 2\n\nThis is a new intrusion set that we neither traced in previous detections, nor observed with any documented\n\nAPT group. It might be connected to one of the intrusion sets that we found, although we did not observe\n\nany concrete evidence that connects both Intrusion Sets 1 and 2.\n\nOur analysis showed that the exfiltration tools that worked together belong to one set. The cluster of\n\ntools closely resembled the tools that we found in Relationship D. TSPY_PILFERDOC.ZBGK searches\n\nfor documents and compresses them. The archive that is created by TSPY_PILFERDOC.ZBGK is then\n\nplaced in another directory for exfiltration using TSPY_KARYAL. Both samples have .dll versions that are\n\nsideloaded by normal applications.\n\nAt this rate, it appears that the group experienced a gap between spreading and controlling the execution\n\nof the exfiltration tools. In turn, the connection of the objects in Relationships C and D responded to this\n\ngap, as also described in Relationship E.\n\nBKDR_XRAT.ZCHB and Backdoor4 are shown in Relationship C as the C&C tools that allow the attacker\n\nto set up the exfiltration tools. Bundling these tools in this cluster is tricky, mainly because they are widely\n\nused; in fact, multiple sets use XRAT and these sets are available in online repositories.\n\n\n-----\n\nConsidering the connections made in Relationship E, the tools in this intrusion set are:\n\n1. TSPY_PILFERDOC.ZBGK\n\n2. TSPY_KARYAL.ZAGK\n\n3. TSPY_PILFERUSE.ZCGK\n\n4. BKDR_XRAT.ZCHB\n\n5. Port scanner tool\n\nThe techniques used for this set are:\n\n|MITRE ATT&CK Technique|Observed Behavior|\n|---|---|\n|T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1574.002 – Hijack Execution Flow: DLL Sideloading T1059.003 – Windows Command Shell T1053.005 – Scheduled Task/Job: Scheduled Task T1033 – System Owner/User Discovery T1087 – Account Discovery T1003.001 – OS Credential Dumping: LSASS Memory T1136.001 – Create Account: Local Account T1046 – Network Service Scanning T1047 – Windows Management Instrumentation T1005 – Data from Local System T1083 – File and Directory Discovery T1029 – Scheduled Transfer T1020 – Automated Exfiltration T1136.001 – Create Account: Local Account T1057 – Process Discovery|Used as a persistence mechanism for BKDR_XRAT.ZCHB. TSPY_PILFERDOC.ZBGK used a RunOnce registry value to execute pilferdoc set by another process, likely by a backdoor shell or web shell. This was not set by the exfiltration tool, however. Normal application with either TSPY_PILFERDOC.ZBGK or TSPY_KARYAL.ZAGK was used. BKDR_XRAT.ZCHB launched cmd.exe. TSPY_KARYAL.ZAGK was launched using a scheduled task. whoami was invoked by a web shell and the results were stored in the same directory where the other tools were placed. Net user was invoked by XRAT. ProcDump was used at one point to dump LSASS.exe. An account was created by XRAT and Backdoor4 using “net user <account> /add”. This was added to the administrator group later and eventually deleted. This intrusion set contained a port-scanning tool. XRAT launched tools remotely using wmic. TSPY_PILFERDOC.ZBGK enumerated document/office files in the local drive. TSPY_PILFERDOC.ZBGK enumerated files using Windows APIs. TSPY_KARYAL.ZAGK was set to run every hour. TSPY_KARYAL.ZAGK was set to run every hour. Backdoor4 added a created account in the administrator local group. XRAT checked for cmd.exe using tasklist.|\n\n\n-----\n\n|MITRE ATT&CK Technique|Observed Behavior|\n|---|---|\n|T1560.001 – Archive Collected Data: Archive via Utility T1505.003 – Server Software Component: Web Shell|TSPY_PILFERDOC compressed the files into archives. KARYAL and PILFERDOC had some connections with a web shell.|\n\n\nTable 14. Intrusion Set 2 TTPs\n\n###### OceanLotus\n\nThis intrusion set uses the same custom packer as KerrDown,[5] a tool that is attributed to OceanLotus,\n\nwhich is also known as APT32. Moreover, the C&C used in these samples that we analyzed as OceanLotus’\n\nC&C are based on open-source intelligence (OSINT).\n\nBased on our analysis, the attack did not require multiple tools with specific functions. Rather, it used\n\nthe same set of tools with different encryptions to give the impression that it used multiple files. The\n\nbackdoor tool that the attack used also doubled as the exfiltration tool, and the environment indicated the\n\nsecond stage payload of the attack. The tools that were found in this set are BKDR_NULTUS.ZCGK and\n\na sideloaded .dll, BKDR_NULTUS.ZAGK.\n\nThe techniques used for this set are:\n\n**MITRE ATT&CK Techniques** **Observed Behavior**\n\nT1547.001 – Boot or Logon Autostart The samples were placed in the startup folder.\nExecution: Registry Run Keys/Startup Folder\n\nT1574.002 – Hijack Execution Flow: DLL BKDR_NULTUS.ZAGK was a sideloaded .dll.\nSideloading\n\nT1005 – Data from Local System Tools enumerated document/office files in the local drive.\n\nT1039 – Data from Network Shared Drive Tools enumerated documents in non-local drives.\nT1025 – Data from Removable Media\n\nTable 15. OceanLotus TTPs\n\nOn the basis of OceanLotus’ matched intrusion set, we suspect that APT32 could be one of the groups\n\nbehind the attack on the victim organization. Notably, their toolset is vastly different from the other samples\n\nthat were acquired. Aside from the feedback data being scarce, the machine name and the username\n\nwere also needed to decrypt the samples.\n\n|MITRE ATT&CK Techniques|Observed Behavior|\n|---|---|\n|T1547.001 – Boot or Logon Autostart Execution: Registry Run Keys/Startup Folder T1574.002 – Hijack Execution Flow: DLL Sideloading T1005 – Data from Local System T1039 – Data from Network Shared Drive T1025 – Data from Removable Media|The samples were placed in the startup folder. BKDR_NULTUS.ZAGK was a sideloaded .dll. Tools enumerated document/office files in the local drive. Tools enumerated documents in non-local drives.|\n\n\n-----\n\n##### Theoretical Attribution\n\nThere are at least four distinct intrusion sets controlled by at least one or more groups responsible for\n\nthe attack on the victim organization. Among the four intrusion sets identified, two of these — Lotus\n\nBlossom and OceanLotus — have strong links to groups that other security researchers have written\n\nabout. Intrusion Set 1 has been mentioned as having links to groups that use simplified Chinese language,\n\nwhile Intrusion Set 2 is unique in that it has not been identified or attributed to any group. It is also possible\n\nthat there is a piece that we did not find, or that there is a piece that is not visible and that connects\n\nIntrusion Set 2 with the other intrusion sets.\n\nIf the main goal of the four intrusion sets was data exfiltration, then it follows that all four routines employed\n\nalmost the same techniques. Additionally, almost all the techniques used in OceanLotus are present in\n\nall the other intrusion sets. The small differences would also be noticeable if the actual events were\n\nexamined. For instance, the administrative share that BKDR_XRAT used was different from that which\n\nBKDR_HANNOTOG employed. No single set had exclusive rights to a technique or a set of techniques,\n\neither; instead, a tool or technique could be used at any point if it was necessary or if it made the task\n\nsimpler.\n\nThe differences in the writing styles of the tools are evident. For instance, the way that the samples in\n\nOceanLotus were packed is in contrast with how “naked” the other tools were. The way that HKTL_\n\nFTPEXFIL enumerated files is also different from how TSPY_PILFERDOC proceeded with its enumeration:\n\nThe former wrote the file paths in a text, while the latter kept the file paths in a structure in memory.\n\nWere the techniques used to figure out the intrusion sets, it would be difficult to focus on one set.\n\nAlthough the clustering of techniques could narrow down the suspects, it is possible that multiple sets\n\ncould also be identified. In this case, the relationships and the comparisons with the existing tools provided\n\na clearer division among the sets.\n\n\n-----\n\n## Conclusion\n\nIn studying an infection, an investigating team should be able to take a macro perspective of what is\n\nhappening in the whole environment. Since one of the attack’s probable main functions in order for it to\n\nwork is to spread across multiple binaries and/or files (and in some instances different machines), finding\n\nthe connections among the tools would give an analyst a better idea of the attack and its details.\n\nTo find these connections, the tools that provide visibility of what happens in the network, as well as any\n\nsuspicious processes, would help significantly. In this particular case, for example, there was difficulty in\n\nidentifying the sideloaded DLLs.\n\nIn building internal models, there is no singular procedure, model, or process for tracking and hunting\n\nintrusion sets for attribution. Security researchers, companies, and analysts could have their own\n\nmodels or implementations for grouping TTPs (such as the Cyber Kill Chain[6] or the Diamond Model[7]).\n\nOne suggestion would be for all these researchers, companies, and analysts to combine their models,\n\nuse known tools, and share their evidence to the public for continuous investigation and intelligence\n\ngathering. Such collaborative effort would be useful, especially for large-scale enterprises or agencies\n\nwhere the number of components (such as memory and disk images) that analysts might have to contend\n\nwith in different environments would be time-intensive, considering that the analyses have to be done on\n\na host-to-host basis.\n\nIn bridging this gap between correlating objects and events, an EDR solution would be effective in\n\nmonitoring and detecting these scenarios. EDR frameworks and services have features such as root\n\ncause analysis (RCA) that make it easier for teams to trace and rebuild tool relationships via record\n\nendpoint system-level behaviors, events (such as user, file, process, registry, memory, and network\n\nevents) and command-line inputs (CLIs) used in compromised endpoints. It also has network-model\n\ncapability that can show how machines interact. By deploying multiple sensors on the machines’ network\n\nor endpoint activities, it can trigger an alert for any potential compromise and provide better visibility. This\n\nis significantly beneficial for analysts when correlating multiple observables and events, retracing and\n\nrecreating the story of how the attack happened.\n\n\n-----\n\nMeanwhile, an XDR solution can go beyond the restrictions in EDR. While the latter is limited to managed\n\nendpoints, including the type and depth of collected data, XDR collects all the activity data (such as\n\ndetections, telemetry, metadata, and netflow) from different security layers like emails, endpoints, servers,\n\ncloud workloads, and the network.\n\nBy augmenting the existing security information and event management (SIEM) tools and security\n\norchestration, automation, and response (SOAR) solutions, XDR is able to go through deep activity\n\nanalysis. This results in a bigger context and view of the scope of both threats and attacks — including\n\nan automated RCA. Additionally, XDR is assisted by a bigger threat intelligence reference. With XDR,\n\nresearchers are therefore able to see the timeline and attack path from an attack-centric perspective.\n\nUltimately, this significantly reduces mean-time-to-detect (MTTD) and mean-time-to-respond (MTTR) in\n\norder to cut overall business risks.\n\nFor the effective identification of intrusion sets based solely on the MITRE technique, the monitoring system\n\ninstalled should be able to capture and log as many events as possible. In this case, the identification\n\nnarrowed down two groups and identified these as suspects by comparing the retrieved tools against\n\nknown APT tools and the clustering of tools based on their relationships with each other. These two\n\napproaches complemented each other since some of the tools are known to be used by multiple intrusion\n\nsets.\n\nSponsored attacks like these might have varying objectives for intrusions. The continued flow of intelligence\n\nthat attackers gain from high-value targets promises a high premium for the varied potential use of the\n\ndata that could be gathered in favor of the sponsoring group via espionage.\n\nTherefore, the high regard for both the research on the tools that a targeted company uses and the\n\npersonnel who might have access to critical data plays a crucial, motivational role in ensuring that the\n\ngathered intelligence is continually updated and unnoticed for as long as possible. In turn, the process\n\nof ensuring this requires the attackers to continuously adjust their tools and methods (whether these are\n\npublicly documented or not) in order to meet the sponsoring organization’s needs.\n\nTTPs, in particular, significantly change depending on a number of variables: the objective(s), the target,\n\ntheir existing security posture, the approaches taken for initial intrusion, the success rates of available and\n\nmodifiable tools as payloads, the location of both the attacker and the target, and the formats that they\n\nwould want the date to be in, among other factors.\n\nTherefore, the victim organization is in a unique position to catalogue the indicators of compromise (IOCs),\n\ntools, techniques, and tactics that the attackers can use for future attacks. These victim organizations\n\ncould gain access to a more comprehensive set compared to what has been previously reported or\n\ndocumented by different security vendors. Enterprises and agencies that are exposed to incidents such\n\nas these are thus privy to a huge and distinct amount of information that has to be analyzed and studied.\n\n\n-----\n\nIt is also worth taking into consideration that the process will not be straightforward.[8] It might not follow an\n\nexisting procedure that has already been used as a standard by security organizations. Such investigations\n\nrequire the proper tools in order to include components in the unclear area, such as undefined or unclear\n\nlogs that can be used in order to prove or identify the missing links of related and unidentified IOCs and\n\ntechniques that were used to facilitate the attacks. Assuming that investigating teams are knowledgeable\n\nin making sense of these logs and correlating the actions that are registered, SOCs could still learn that\n\nthere are missing pieces that are necessary to uncover the entire story.\n\nUnfortunately, in addition to possible missing technologies, not all teams or organizations are likewise\n\nequipped to do analyses such as these since correlation is not a straightforward process.\n\n\n-----\n\n##### References\n\n[1 The MITRE Corporation. (2015). The MITRE Corporation. “MITRE ATT&CK.” Accessed on Sep. 11, 2020 at https://attack.mitre.](https://attack.mitre.org/)\n[org/.](https://attack.mitre.org/)\n\n2 Jon Gross and Cory Kennedy. (Aug. 19, 2020). RiskIQ. “RiskIQ Adventures in Cookie Land – Part 1.” Accessed on Sep. 25,\n[2020, at https://community.riskiq.com/article/5fe2da7f.](https://community.riskiq.com/article/5fe2da7f)\n\n3 Symantec threat hunter team. (Sep. 9, 2019). Broadcom. “Thrip: Ambitious Attacks Against High Level Targets Continue.”\n[Accessed on Jun. 28, 2020, at https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/thrip-apt-south-east-](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/thrip-apt-south-east-asia?om_ext_cid=biz_social3_AMS_NAM-US_facebook_us,blogs-social,FY20-Q1,Blog,Threat%20Intelligence,org)\n[asia?om_ext_cid=biz_social3_AMS_NAM-US_facebook_us,blogs-social,FY20-Q1,Blog,Threat%20Intelligence,org.](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/thrip-apt-south-east-asia?om_ext_cid=biz_social3_AMS_NAM-US_facebook_us,blogs-social,FY20-Q1,Blog,Threat%20Intelligence,org)\n\n[4 TrendLabs. (2014). Trend Micro. “Targeted Attack Trends in Asia-Pacific.” Accessed on Sep. 2, 2020, at https://documents.](https://documents.trendmicro.com/assets/threat-reports/rpt-1h-2014-targeted-attack-trends-in-asia-pacific.pdf)\n[trendmicro.com/assets/threat-reports/rpt-1h-2014-targeted-attack-trends-in-asia-pacific.pdf.](https://documents.trendmicro.com/assets/threat-reports/rpt-1h-2014-targeted-attack-trends-in-asia-pacific.pdf)\n\n5 Vicky Ray and Kaoru Hayashi. (Feb. 1, 2019). Palo Alto Networks. “Tracking OceanLotus’ new Downloader, KerrDown.”\n[Accessed on Jun. 15, 2020, at https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/.](https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/)\n\n6 Instituto Nacional de Ciberseguridad de España (INCIBE-CERT). (Oct. 27, 2016). Instituto Nacional de Ciberseguridad de\n_[España (INCIBE-CERT). “Cyber Kill chain applied to ICS.” Accessed on Sep. 25, 2020, at https://www.incibe-cert.es/en/blog/](https://www.incibe-cert.es/en/blog/cyber-kill-chain-applied-ics)_\n[cyber-kill-chain-applied-ics.](https://www.incibe-cert.es/en/blog/cyber-kill-chain-applied-ics)\n\n7 United States Department of Defense. (Jul. 5, 2013). United States Department of Defense. “The Diamond Model of Intrusion\n[Analysis.” Accessed on Nov. 9, 2020, at https://apps.dtic.mil/dtic/tr/fulltext/u2/a586960.pdf.](https://apps.dtic.mil/dtic/tr/fulltext/u2/a586960.pdf)\n\n8 2016 Public-Private Analytic Exchange Program Team. (Sep. 9, 2016). Office of the Director of National Intelligence. “Cyber\n[Attribution Using Unclassified Data.” Accessed on Sep. 25, 2020, at https://www.dni.gov/files/PE/Documents/Cyber-](https://www.dni.gov/files/PE/Documents/Cyber-Attribution.pdf)\n[Attribution.pdf.](https://www.dni.gov/files/PE/Documents/Cyber-Attribution.pdf)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/white_papers/wp-finding-APTX-attributing-attacks-via-MITRE-TTPs.pdf"
    ],
    "report_names": [
        "wp-finding-APTX-attributing-attacks-via-MITRE-TTPs.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a1ce86c2-3efc-4115-a85e-92c5fa461838",
            "created_at": "2022-10-25T16:47:55.561071Z",
            "updated_at": "2025-03-27T02:05:17.261424Z",
            "deleted_at": null,
            "main_name": "BRONZE ELGIN",
            "aliases": [
                "Lotus Blossom ",
                "Lotus Panda ",
                "Lstudio",
                "Spring Dragon ",
                "CTG-8171 "
            ],
            "source_name": "Secureworks:BRONZE ELGIN",
            "tools": [
                " Lzari",
                "Elise"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c4bc6ac9-d3e5-43f1-9adf-e77ac5386788",
            "created_at": "2022-10-25T15:50:23.722608Z",
            "updated_at": "2025-03-27T02:00:55.533377Z",
            "deleted_at": null,
            "main_name": "Thrip",
            "aliases": [
                "Thrip"
            ],
            "source_name": "MITRE:Thrip",
            "tools": [
                "PsExec",
                "Mimikatz",
                "Catchamas"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2fa14cf4-969f-48bc-b68e-a8e7eedc6e98",
            "created_at": "2022-10-25T15:50:23.538608Z",
            "updated_at": "2025-03-27T02:00:55.495551Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "Lotus Blossom",
                "DRAGONFISH",
                "Spring Dragon",
                "RADIUM",
                "Raspberry Typhoon"
            ],
            "source_name": "MITRE:Lotus Blossom",
            "tools": [
                "Elise"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "eaa8168f-3fab-4831-aa60-5956f673e6b3",
            "created_at": "2022-10-25T16:07:23.805824Z",
            "updated_at": "2025-03-27T02:02:09.986613Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "ATK 1",
                "ATK 78",
                "Billbug",
                "Bronze Elgin",
                "CTG-8171",
                "Dragonfish",
                "Lotus Blossom",
                "Operation Lotus Blossom",
                "Red Salamander",
                "Spring Dragon",
                "Thrip"
            ],
            "source_name": "ETDA:Lotus Blossom",
            "tools": [
                "BKDR_ESILE",
                "Catchamas",
                "EVILNEST",
                "Elise",
                "Group Policy Results Tool",
                "Hannotog",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "PsExec",
                "Rikamanu",
                "Sagerunex",
                "Spedear",
                "Syndicasec",
                "WMI Ghost",
                "Wimmie",
                "gpresult"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a0548d4e-edc2-40c1-a4e2-c1d6103012eb",
            "created_at": "2023-01-06T13:46:38.793461Z",
            "updated_at": "2025-03-27T02:00:02.920553Z",
            "deleted_at": null,
            "main_name": "Thrip",
            "aliases": [
                "G0076",
                "ATK78"
            ],
            "source_name": "MISPGALAXY:Thrip",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "91a034c4-75af-4f4f-9fb0-2d6167cf2038",
            "created_at": "2024-05-01T02:03:07.991617Z",
            "updated_at": "2025-03-27T02:05:17.292551Z",
            "deleted_at": null,
            "main_name": "BRONZE THORNWELL",
            "aliases": [
                "Thrip ",
                "BRONZE ELGIN "
            ],
            "source_name": "Secureworks:BRONZE THORNWELL",
            "tools": [
                " Rikamanu",
                " Syndicasec Trojan",
                "Catchamas"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "87a20b72-ab72-402f-9013-c746c8458b0b",
            "created_at": "2023-01-06T13:46:38.293223Z",
            "updated_at": "2025-03-27T02:00:02.796483Z",
            "deleted_at": null,
            "main_name": "LOTUS PANDA",
            "aliases": [
                "Lotus BLossom",
                "Spring Dragon",
                "ST Group",
                "DRAGONFISH",
                "BRONZE ELGIN",
                "ATK1",
                "G0030",
                "Red Salamander"
            ],
            "source_name": "MISPGALAXY:LOTUS PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1608231637,
    "ts_modification_date": 1608231642,
    "files": {
        "pdf": "https://archive.orkl.eu/c62970fe68497abf948df5535cf81925e2952265.pdf",
        "text": "https://archive.orkl.eu/c62970fe68497abf948df5535cf81925e2952265.txt",
        "img": "https://archive.orkl.eu/c62970fe68497abf948df5535cf81925e2952265.jpg"
    }
}