{
    "id": "656d4185-a6d9-41ea-84fb-74e4e2634560",
    "created_at": "2023-01-12T15:06:05.263139Z",
    "updated_at": "2025-03-27T02:05:30.405827Z",
    "deleted_at": null,
    "sha1_hash": "95e5fd2047a65a6c46777d7733b28f0a5ffffb4f",
    "title": "2021-05-24 - Zero-Day TCC bypass discovered in XCSSET malware",
    "authors": "",
    "file_creation_date": "2022-05-27T21:50:10Z",
    "file_modification_date": "2022-05-27T21:50:10Z",
    "file_size": 312013,
    "plain_text": "# Zero-Day TCC bypass discovered in XCSSET malware\n\n**[jamf.com/blog/zero-day-tcc-bypass-discovered-in-xcsset-malware/](https://www.jamf.com/blog/zero-day-tcc-bypass-discovered-in-xcsset-malware/)**\n\n[Jamf Blog](https://www.jamf.com/blog/)\n\nMay 24, 2021 by Jaron Bradley\n\n[Jamf Protect,](https://www.jamf.com/blog/category/jamf-protect/) [Enterprise,](https://www.jamf.com/blog/category/enterprise/) [Education,](https://www.jamf.com/blog/category/education/) [Government,](https://www.jamf.com/blog/category/government/) [Healthcare,](https://www.jamf.com/blog/category/healthcare/) [Security](https://www.jamf.com/blog/category/security/)\nA zero-day discovery allows an attacker to bypass Apple’s TCC protections which safeguard\nprivacy. By leveraging an installed application with the proper permissions set, the attacker\ncan piggyback off that donor app when creating a malicious app to execute on victim\ndevices, without prompting for user approval.\n\nAuthors: Stuart Ashenbrenner, Jaron Bradley and Ferdous Saljooki\n\n## Introduction\n\n[In the latest macOS release (11.4), Apple patched a zero-day exploit (CVE-2021-30713)](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30713)\nwhich bypassed the Transparency Consent and Control (TCC) framework. This is the system\nthat controls what resources applications have access to, such as granting video\ncollaboration software access to the webcam and microphone, in order to participate in\nvirtual meetings. The exploit in question could allow an attacker to gain Full Disk Access,\nScreen Recording, or other permissions without requiring the user’s explicit consent — which\nis the default behavior. We, the members of the Jamf Protect detection team, discovered this\nbypass being actively exploited during additional analysis of the XCSSET malware, after\n\n\n-----\n\nnoting a significant uptick of detected variants observed in the wild. The detection team\nnoted that once installed on the victim’s system, XCSSET was using this bypass specifically\nfor the purpose of taking screenshots of the user’s desktop without requiring additional\npermissions.\n\n## What is the XCSSET malware?\n\n[In August 2020, a new strain of malware dubbed XCSSET was revealed by Trend Micro.](https://www.trendmicro.com/en_us/research/20/h/xcsset-mac-malware--infects-xcode-projects--uses-0-days.html)\nThis malware targeted Mac developers by infecting Xcode projects as a means of further\nspreading via Github repositories to expand its reach.\n\nOne of the more novel aspects of note is the way in which the malware was developed,\nwritten in AppleScript - a scripting language developed by Apple - that facilitates control over\nscript-enabled Mac applications. Much of the time the malware author leverages\nAppleScripts in their attack chain due to the facility in which it handles many bash\ncommands, even downloading and/or executing Python scripts in an effort to obfuscate their\nintentions through a confusing use of various scripting languages.\n\nUpon initial discovery, one of the most notable features of the XCSSET malware was that it\nreportedly utilized two zero-day exploits. This first was used to steal the Safari browser\ncookies - which are protected by system integrity protection; while the second was used to\nbypass prompts in order to install a developer version of the Safari application. Diving further\nstill into the malware, Jamf discovered that it has also been exploiting a third zero-day to\nbypass Apple’s TCC framework.\n\n## What is TCC?\n\nFrom the user’s perspective, TCC is the prompt they receive when a program attempts to\nperform an action that Apple believes should require explicit permission from the user before\nallowing the action to occur, as referenced in the video collaboration example mentioned\npreviously. Other examples of TCC in action are saving files to the Documents directory,\nrecording keystrokes, and taking a screenshot. When an application attempts to perform\nsuch an action, the user is presented with a prompt asking them if they would like to grant or\ndeny the application permission to do so. In some instances, users are required to first go\ninto the System Preferences and authorize permissions to the application granularly before it\ncan perform the action. Upon granting permissions to any applications, they’re now free to\nperform that action without prompting the user again until it is manually disabled in the\nprivacy settings.\n\nThe example below shows the Terminal app prompting the user for permission to run a\nprogram that wants to take a screenshot.\n\n\n-----\n\nThe application can then be given permissions via the system preferences.\n\n## The Bypass\n\nWhile dissecting the malware, Jamf Protect detection team members took note of an\nAppleScript module titled“screen_sim.applescript.” Inside it, they noticed an interesting check\ncalled “verifyCapturePermissions” being used which takes an application ID as an argument.\n\n\n-----\n\nBy looking at the log comment alone, it seems as though the malicious AppleScript is\nsearching for an application that has permissions to capture a screenshot. Not only that, but\nit celebrates upon successfully locating such an app.\n\nStepping into the “verifyCapturePermissions” function, Jamf saw that this section of the script\nis checking for capture permissions from the list of installed applications. This list is derived\nfrom an earlier check of the following software appID’s, referred to by the malware as\n“donorApps”.\n\nAs expected, the list of application IDs that are targeted are all applications that users\nregularly grant the screen sharing permission to as part of its normal operation. The malware\nthen uses the following mdfind command — the command-line-based version of Spotlight —\nto check if the appID’s are installed on the victim’s device.\n\nIf any of the appID’s are found on the system, the command returns the path to the installed\napplication. With this information, the malware crafts a custom AppleScript application and\ninjects it into the installed, donor application. It does so by performing a number of functions,\nthe most notable being called createDonorApp().\n\n\n-----\n\nThe script executes the following actions in this sequence:\n\n1. The XCSSET AppleScript screenshot module is downloaded from the malware author’s\n\ncommand and control (C2)server (to the ~/Library/Caches/GameKit folder).\n\n\n-----\n\n2. Using the osacompile command, the screenshot module is converted to an\n\nAppleScript-based application called avatarde.app. When any AppleScript is compiled\nin this manner, an executable called “applet” is placed in the newly created application\nbundle’s /Contents/MacOS/ directory and the script that the applet will execute can be\nlocated at /Contents/Resources/Scripts/main.scpt.\n3. The newly created Info.plist is then modified by the plutil binary, changing the\n\npreference setting LSUIElement to true. This allows the application to be run as a\nbackground process, concealing its presence from the user.\n4. A blank icon is then downloaded and applied to the application.\n5. Lastly, the newly created application is placed within the already existing donor\n\napplication using the following code:\n\nFor example, if the virtual meeting application zoom.us.app is found on the system, the\nmalware will place itself like so:\n\n/Applications/zoom.us.app/Contents/MacOS/avatarde.app\n\nIf the victim computer is running macOS 11 or greater, it will then sign the avatarde\napplication with an ad-hoc signature, or one that is signed by the computer itself.\n\nOnce all files are in place, the custom application will piggyback off of the parent application,\nwhich in the example above is Zoom. This means that the malicious application can take\nscreenshots or record the screen without needing explicit consent from the user. It inherits\nthose TCC permissions outright from the Zoom parent app. This represents a considerable\nprivacy concern for end-users.\n\nDuring Jamf’s testing, it was determined that this vulnerability is not limited to screen\nrecording permissions either. Multiple different permissions that have already been provided\nto the donor application can be transferred to the maliciously created app.\n\n## Conclusion\n\nJamf Protect offers a holistic [Mac endpoint security solution that provides analytics to detect](https://www.jamf.com/products/jamf-protect/)\nand prevent anytime this vulnerability is potentially being abused. It does this by checking if\nan application is bundled within another application. If a match occurs, it goes on to verify the\n\n\n-----\n\ndigital signatures between the two applications, effectively detecting mismatches in the\n[process of signing information. Jamf urges users to “patch fast and patch often,” as Apple](https://www.jamf.com/blog/even-for-iphone-patch-fast-and-often/)\nrecently patched this issue to keep malware like XCSSET from abusing this vulnerability in\nthe future, for Mac computers running macOS 11.4 or later.\n\n## Indicators of Compromise (IoC)\n\nDuring Jamf’s research, multiple hashes were found that were previously unidentified by\nVirusTotal. Some of the hashes Jamf discovered were already being detected by Apple’s\nbuilt-in malware detection engine, XProtect. However, additional hashes Jamf’s team\nidentified as being XCSSET malware found their way onto Github, compromising the\naffected repositories. The impacted executables have been noted as having potentially one\nof five possible filenames within the Xcode project.\n\n**Command and Control Domains:**\n\ntrendmicronano[.]com\nfindmymacs[.]com\nadoberelations[.]com\nstatsmag[.]com\nstatsmag[.]xyz\nflixprice[.]com\nadobestats[.].com\ntitiez[.]com\nicloudserv[.]com\natecasec[.]com\nmonotel[.]xyz\nsidelink[.]xyz\nmantrucks[.]xyz\nlinebrand[.]xyz\nnodeline[.]xyz\n\n### Protect your environment now\n\n[Request Trial](https://www.jamf.com/request-trial/jamf-protect/)\nJaron Bradley\n\nOther authors:\n\n\n-----\n\nStuart Ashenbrenner, Ferdous Saljooki\n\nSubscribe to the Jamf Blog\nHave market trends, Apple updates and Jamf news delivered directly to your inbox.\n\nTo learn more about how we collect, use, disclose, transfer, and store your information,\n[please visit our Privacy Policy.](https://www.jamf.com/privacy-policy/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-24 - Zero-Day TCC bypass discovered in XCSSET malware.pdf"
    ],
    "report_names": [
        "2021-05-24 - Zero-Day TCC bypass discovered in XCSSET malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535965,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653688210,
    "ts_modification_date": 1653688210,
    "files": {
        "pdf": "https://archive.orkl.eu/95e5fd2047a65a6c46777d7733b28f0a5ffffb4f.pdf",
        "text": "https://archive.orkl.eu/95e5fd2047a65a6c46777d7733b28f0a5ffffb4f.txt",
        "img": "https://archive.orkl.eu/95e5fd2047a65a6c46777d7733b28f0a5ffffb4f.jpg"
    }
}