{
    "id": "656d5955-f77e-47fd-ab8b-5cbf41c33f1a",
    "created_at": "2023-01-12T15:07:36.832368Z",
    "updated_at": "2025-03-27T02:11:00.516615Z",
    "deleted_at": null,
    "sha1_hash": "f642b779d721950b368527adad6265d3821014bb",
    "title": "2021-08-24 - How Data Brokers Sell Access to the Backbone of the Internet",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:08Z",
    "file_modification_date": "2022-05-27T23:00:08Z",
    "file_size": 1224913,
    "plain_text": "# How Data Brokers Sell Access to the Backbone of the Internet\n\n**[vice.com/en/article/jg84yy/data-brokers-netflow-data-team-cymru](https://www.vice.com/en/article/jg84yy/data-brokers-netflow-data-team-cymru)**\n\nHacking. Disinformation. Surveillance. CYBER is Motherboard's podcast and reporting on\nthe dark underbelly of the internet.\n\n[See More →](https://www.vice.com/en/topic/cyber)\nThere's something of an open secret in the cybersecurity world: internet service providers\nquietly give away detailed information about which computer is communicating with another\nto private businesses, which then sells access to that data to a range of third parties,\naccording to multiple sources in the threat intelligence industry.\n\n\n-----\n\nThe information, known as netflow data, is a useful tool for digital investigators. They can use\nit to identify servers being used by hackers, or to follow data as it is stolen. But the sale of\nthis information still makes some people nervous because they are concerned about whose\nhands it may fall into.\n\n\"I'm concerned that netflow data being offered for commercial purposes is a path to a dark\nfucking place,\" one source familiar with the data told Motherboard. Motherboard granted\nmultiple sources anonymity to speak more candidly about industry issues.\n\nAt a high level, netflow data creates a picture of traffic flow and volume across a network. It\ncan show which server communicated with another, information that may ordinarily only be\navailable to the server owner or the ISP carrying the traffic. Crucially, this data can be used\nfor, among other things, tracking traffic through virtual private networks, which are used to\nmask where someone is connecting to a server from, and by extension, their approximate\nphysical location.\n\nTeam Cymru, one threat intelligence firm, works with ISPs to access that netflow data, three\nsources said. Keith Chu, communications director for the office of Senator Ron Wyden which\nhas been conducting its own investigations into the sale of sensitive data, added that Team\nCymru told the office \"it obtains netflow data from third parties in exchange for threat\nintelligence.\"\n\n**_Do you work at a company that handles netflow data? Do you work at an ISP_**\n**_distributing that data? Or do you know anything else about the trade of netflow_**\n**_data? We'd love to hear from you. Using a non-work phone or computer, you can_**\n**_contact Joseph Cox securely on Signal on +44 20 8133 5190, Wickr on_**\n**_josephcox, or email joseph.cox@vice.com._**\n\nCompanies that may source Team Cymru's data include cybersecurity firms hired to respond\n[to data breaches or proactively hunt out hackers. On its website, Team Cymru says it works](https://team-cymru.com/company/careers/)\nwith both public and private sector teams to \"to help identify, track and stop bad actors both\nin cyber space and on the ground.\"\n\n\"I'm less worried about a bad guy hacker and more worried about a bad guy government or\ncompany or politician,\" one source familiar with the data said. A source in the threat\nintelligence industry added that they \"always thought it was kinda bonkers,\" referring to Team\nCymru's sale of netflow data.\n\nThe continued sale of sensitive data could present its own privacy and security concerns,\nand the news highlights that ISPs are providing this data at scale to third parties likely\nwithout the informed consent of their own users. Other companies, such as cybersecurity\nfirm Palo Alto Networks, also have access to netflow data.\n\n\"The users almost certainly don't [know]\" their data is being provided to Team Cymru, who\nthen sells access to it the source familiar with the data said\n\n\n-----\n\n[Tech](https://www.vice.com/en/section/tech)\n\n## Private Intel Firm Buys Location Data to Track People to their 'Doorstep'\n\nJoseph Cox\n\n09.02.20\nTeam Cymru's customers can probe a dataset, and \"effectively run queries against virtually\nany IP to pull the netflows to and from that IP over a given point in time,\" one of the sources\nsaid. Chu added Team Cymru said it \"restricts the amount of data that is returned, so that\nonly a small portion of the netflow data in its database can be accessed by any one client.\"\n\nIn product descriptions, Team Cymru offers users the ability to follow traffic through VPNs,\nwhich attackers may use to cover their tracks or ordinary people to browse the internet more\nprivately.\n\n\"Trace malicious activity through a dozen or more proxies and VPNs to identify the origin of a\ncyber threat,\" one brochure for a Team Cymru product called Pure Signal Recon reads. In\nessence, access to netflow data lets a security team observe what is happening on the wider\ninternet, and may indicate what is happening to other organizations, beyond the borders of\ntheir own network or company. One of the sources said they previously saw traffic from an\norganization they knew inside Team Cymru's dataset and was spooked by it at the time.\n\n\"Visibility and insight are global,\" the description adds. An image included in the brochure\nshows Team Cymru's product letting users trace the activity of servers linked to an Iranian\nhacking group further than other datasets, such as DNS lookups.\n\nA section of Team Cymru's marketing material for its Pure Signal Recon product. Image:\nTeam Cymru.\n\nIn a [recent research report on an Israeli spyware vendor called Candiru, Citizen Lab thanked](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/)\nTeam Cymru.\n\n\"Thanks to Team Cymru for providing access to their Pure Signal Recon product. Their tool’s\nability to show Internet traffic telemetry from the past three months provided the\nbreakthrough we needed to identify the initial victim from Candiru’s infrastructure,\" the report\nreads. Citizen Lab did not respond to multiple requests for comment.\n\nTeam Cymru did not respond to multiple requests for comment on which ISPs provide it with\nthe data, what privacy protections are in place around the collection and distribution of such\ndata, and whether the individual ISP users have provided consent for their data to be shared.\n\n\"Fundamentally, people have a right to some degree of anonymity, and as a carrier it's\nnot our job to eavesdrop in any form.\"\n\n\n-----\n\nFor its Cortex Xpanse product, Palo Alto Networks also gains access to netflow data,\naccording to product documentation available online.\n\n\"Cortex® Xpanse™ obtains flow data via multiple relationships with Tier 1 ISPs. Through\nthese relationships, Cortex Xpanse has access to a sample of approximately 80% of global\nflows,\" [one page reads.](https://docs.paloaltonetworks.com/cortex/cortex-xpanse/cortex-xpanse-user-guide/cortex-xpanse-expander/data/netflow-data.html)\n\nJim Finkle, director of threat communications at Palo Alto Networks, said in an emailed\nstatement that \"Palo Alto Networks provides enterprise customers with netflow data to and\nfrom their own networks to identify violations of security policies, gaps in security monitoring\nand other high-risk activity on the customer’s network.\" Palo Alto Networks declined to name\nwhich ISPs it sources data from, or whether it purchases the data outright from the ISPs.\n\nDave Schaeffer, CEO of ISP Cogent Communications, which he said handles around 22\npercent of the world's internet traffic, told Motherboard that as an ISP his company doesn't\nprovide their netflow data to anybody.\n\n\"Fundamentally, people have a right to some degree of anonymity, and as a carrier it's not\nour job to eavesdrop in any form,\" he said in a phone call. Schaeffer says Cogent generates\n96 percent of its traffic from selling to large wholesale customers, such as Vodafone, Cox,\nSpectrum, and BT. Schaeffer says Cogent provides services to Team Cymru but does not\nshare netflow data with the company.\n\n\"I don't know if there's a lot of really useful things people could do with [netflow] data,\" he\nadded. \"There's probably some bad things I could think of if that data was available.\"\n\nAlthough multiple sources were concerned about the sale of netflow data, several of them\nstressed that Team Cymru is a responsible organization.\n\n\"It's pretty shadowy but honestly they're a 'good actor,'\" one in the threat intelligence industry\nsaid. \"Very strict protections on who can see it, but still, yeah, it's shady.\"\n\nThe source familiar with the data said they were concerned about the sale of netflow data,\nbut that Team Cymru \"also enable security organizations to do some really awesome work.\nSo I'm conflicted about it.\"\n\n\"I'm concerned that netflow data being offered for commercial purposes is a path to a\ndark fucking place.\"\n\nIn May, [Motherboard reported that Senator Wyden's office asked the Department of Defense](https://www.vice.com/en/article/88ng8x/pentagon-americans-surveillance-without-warrant-internet-browsing)\n(DoD), which includes various military and intelligence agencies such as the National\nSecurity Agency (NSA) and the Defense Intelligence Agency (DIA), for detailed information\non its data purchasing practices. The response showed that the Pentagon is carrying out\nwarrantless surveillance of Americans, according to a subsequent letter written by Wyden\nand obtained by Motherboard.\n\n\n-----\n\nSome of the answers the DoD provided were provided in a form meaning that Wyden s office\ncould not legally publish specifics on the surveillance. Wyden's office then asked the DoD to\nrelease the information to the public. At the time, Wyden's office declined to provide\nMotherboard with specifics on one of the answers which was classified, but a Wyden aide\nsaid that the question related to the DoD buying internet metadata.\n\n\"Are any DoD components buying and using without a court order internet metadata,\nincluding 'netflow' and Domain Name System (DNS) records,\" the question read.\n\nOther cybersecurity firms sell access to controversial datasets. In September, Motherboard\nreported how one firm called HYAS was sourcing smartphone location data to trace people\nto their \"doorstep.\" As [Motherboard has repeatedly shown, the ordinary apps installed on](https://www.vice.com/en/article/jgqm5x/us-military-location-data-xmode-locate-x)\npeoples' phones that gather this information often don't have informed consent to then sell or\notherwise provide it to third parties.\n\n**_Subscribe to our cybersecurity podcast CYBER,_** **_[here.](https://podcasts.apple.com/us/podcast/cyber/id1441708044)_**\n\n## ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX.\n\nBy signing up, you agree to the [Terms of Use and](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/terms-of-use.html) [Privacy Policy & to receive electronic](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/privacy-policy.html)\ncommunications from Vice Media Group, which may include marketing promotions,\nadvertisements and sponsored content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-24 - How Data Brokers Sell Access to the Backbone of the Internet.pdf"
    ],
    "report_names": [
        "2021-08-24 - How Data Brokers Sell Access to the Backbone of the Internet.pdf"
    ],
    "threat_actors": [
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536056,
    "ts_updated_at": 1743041460,
    "ts_creation_date": 1653692408,
    "ts_modification_date": 1653692408,
    "files": {
        "pdf": "https://archive.orkl.eu/f642b779d721950b368527adad6265d3821014bb.pdf",
        "text": "https://archive.orkl.eu/f642b779d721950b368527adad6265d3821014bb.txt",
        "img": "https://archive.orkl.eu/f642b779d721950b368527adad6265d3821014bb.jpg"
    }
}