{
    "id": "6626b6c1-ebf6-487d-b064-2283c09d6a5a",
    "created_at": "2023-01-12T15:04:55.831395Z",
    "updated_at": "2025-03-27T02:14:48.737562Z",
    "deleted_at": null,
    "sha1_hash": "0e131cf343ef536b2aab85f92791c065828046a5",
    "title": "2015-05-07 - Dissecting the “Kraken”",
    "authors": "",
    "file_creation_date": "2022-05-27T23:13:21Z",
    "file_modification_date": "2022-05-27T23:13:21Z",
    "file_size": 2076856,
    "plain_text": "# Dissecting the “Kraken”\n\n**[gdatasoftware.com/blog/2015/05/24280-dissecting-the-kraken](https://www.gdatasoftware.com/blog/2015/05/24280-dissecting-the-kraken)**\n\nIn January 2015, unidentified attackers attempted to infiltrate a multi-national enterprise\nbased in the United Arab Emirates, using a spear phishing attack with a crafted MS Word\ndocument attached to the message. Once it has reached its target, the payload used was\ndesigned to work as an information stealer and reconnaissance tool. G DATA’s security\nexperts identified the malware behind this attack and reveal information about the actual\npower of the malware’s tentacles. In this article, the G DATA SecurityLabs will have a look at\nthe following topics: * an example of the spear phishing campaign, sent only a few days after\nthe malware has been advertised * the marketing approach to sell the malware * the analysis\nof some of Kraken’s features * theories about why Kraken has been used as malware in a\ntargeted attack\n\n## Infection Vector\n\nThe attacker(s) sent a specially crafted email to at least one employee of the attacked\nenterprise. The email’s body reveals a business-related topic: an offer to become member of\nthis year’s International Trade Council. Nevertheless, the offer is directed at the Philippine\nNational Bank, not the enterprise actually receiving the email. This could be a trick to make\nthe recipient even more curious to look at the attached document, because he/she received\ndocuments not issued for him/her.\n\nThe G DATA experts alerted the [aeCERT about the incident and their analysis results.](http://www.aecert.ae/)\n\n\n-----\n\nIn this case, the attachment is a Microsoft Word document which tries to exploit the\n[vulnerability described in CVE-2012-0158 in order to drop and execute malware dubbed](http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0158)\n“Kraken HTTP”.\n\nThe G DATA security solutions detect the malicious document\n(08E834B6D4123F0AEA27D042FCEAF992) as Exploit.CVE-2012-0158.AH and G DATA’s\nproactive Exploit Protection technology also prevents the attack before the PC can be\ninfected.\n\n## The Malware, advertised on the Underground Market\n\n\n-----\n\n“Kraken HTTP” is sold on at least one underground market as a commercial product.\nSomeone, who claims not to be the author of the malware, promoted the malware with a kind\nof banner which has quite a visual impact. Have a look at the “ad” that was published back in\nDecember 2014.\n\nThe banner describes the botnet:\n\nits technical features\nthe available commands (classic ones, such as visiting a website using the infected\nbot, download and execute a command or a library, update and uninstall)\nthe plugins one can use: file stealer, ad-clicker, form grabber, …\n\n\n-----\n\nThe command visiting a website using the infected bot could be used by the attackers as\nan entry point for blackmailing the infected user. The attackers could visit websites that are\nregarded as illegal in the respective country and could then ask for ransom and threaten to\nrelease information about the alleged violation to any seemingly official entity who would\nthen investigate against the victim.\n\nThe flyer also reveals the price of the malware: The basic binary costs $320 and each plugin\nmust be paid for separately, for example $50 for the file stealer, $60 for the ad-clicker and up\nto $350 for a configurable form grabber. Accepted payment methods are the usual virtual\ncurrencies and pre-paid options.\n\nA price list found on a different website, also posted in December 2014, lists the binary’s\nprice as $270 and some additional modules, such as a “Edit Hosts module” ($15), a “Botkill\nmodule” ($30) and a “Bitcoin monitor module”($20).\n\nFurthermore, “Kraken HTTP” is advertised as “a new, revolutionary botnet […] and very\nnoob-friendly”. Noob is a word describing “that someone is new to a game, concept, or idea;\nimplying a lack of experience.” But now let’s have a look at what the botnet really is.\n\n## Marketing vs. Reality\n\nAfter having a glimpse at the ad designed to promote the malware, we analyzed a sample of\nit: 3917107778F928A6F65DB34553D5082A, which is detected as Gen:Variant.Zusy.118945.\nWe decided to analyze some features mentioned in the flyer and on the other website to\nevaluate their power and implementation.\n\n### Feature: “Bypass UAC”\n\nAs expected, the malware does not really bypass the UAC. It rather uses a classic trick\nalready used by several malware instances. It uses a legitimate Microsoft binary in order to\nexecute itself with administrator permissions. We already presented this technique in our\n\n[G DATA SecurityBlog article about the Beta Bot.](https://www.gdatasoftware.com/blog/2013/05/23997-a-new-bot-on-the-market-beta-bot)\n\n### Feature: “Anti-VM”\n\nThe flyer explains that the botnet won’t work in a virtual machine. To detect whether the\nmalware is running in a virtual machine, the malware author checks if the following\ndirectories and the one file exist:\n\nC:\\Program Files\\VMWare\\VMware Tools\\\nC:\\Program Files (x86)\\VMware\\WMware Tools\\\nC:\\WINDOWS\\system32\\VBoxtray.exe\n\n\n-----\n\nFurthermore, the malware checks if following applications analysts usually use are being\nexecuted:\n\nWireshark: a network analyzer\nFiddler: a web proxy used to debug HTTP flow.\n\nWe can see the tools detection:\n\n\n-----\n\nIf one of the elements mentioned above is detected, the malware will display a rather poetic\ndialog popup:\n\nSo, the anti-VM is really rudimentary. If the additional tools are not installed on the virtual\nmachine the malware can be perfectly executed.\n\n### Feature: “Folder, Bot file & All file dropped are hidden”\n\n\n-----\n\nThe folders & bot files simply have the “hidden” attribute set in Microsoft Windows. If you\nconfigure you system to show hidden files and directories, you can perfectly see them:\n\n### Feature: “Process & registry persistence”\n\nThe malware persistence uses a registry key in order to be executed automatically in case\nthe system is rebooted. The key is\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Windows:\n\nThe malware repeatedly checks whether this entry is removed. In case the entry is removed,\nthe malware will create a new one. However, instead of removing it, we can simple rename\nthe path to the executable in order to switch off the persistence mechanism.\n\nSo, the malware does not have any clever persistence features either.\n\n\n-----\n\n### Feature: Path & variable encrypted\n\nWe identified two kinds of “encrypted” data:\n\nSome paths are encoded using base64 algorithm, such as: JVdJTkRJUiUA\n(%WINDIR%) and JWFwcGRhdGElaa== (%appdata%)\nSome data is encrypted (RC4), such as the C&C information:\n\n### Feature: “Bitcoin monitor plugin”\n\nThe Bitcoin monitor plugin is even more amusing. It is not advertised on the flyer but on the\nother website we found. The malware monitors the infected user’s clipboard. If the user\ncopies a Bitcoin address to the clipboard, it will be replaced by an address pre-configured by\nthe botmaster. A Bitcoin address is an identifier of 26-35 alphanumeric characters which\nrepresent the owner of a Bitcoin wallet, for example something like\n3J98t1WpEZ73CNmQviecrnyiWrnqRhWNLy.\n\nWe can easily imagine that the plugin’s “test” is prone to produce false positives, because\nany alphanumeric text copied by the user will be automatically changed without reason if it\nhas a length between 26 and 35 characters. Ok, we admit that the German word\n“Kraftfahrzeughaftpflichtversicherung” (36) would not be harmed when copied, but what\nabout “Bundesausbildungsfoerderungsgesetz” (34) or “radioimmunoelectrophoresis” (27)?\nJust kidding. But any string, from strong passwords to bank account numbers and more\ncould be affected.\n\n### Feature: “Download & Execute”, the next Step\n\nThis feature allows installing further malware on the affected PC in case the attackers decide\nthe current machine is interesting enough. “Kraken HTTP” is only the first stage in this attack\nand can be seen as reconnaissance tool.\n\n## Administration Panel\n\nThe experts of the G DATA SecurityLabs had access to the panel used by “Kraken HTTP”\nbut the source code is protected by a commercial packer called IonCube loader.\nNevertheless, we can reveal some screenshots of the administration panel which are\navailable on the underground. Note that some of the texts contain mistakes:\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n## Conclusion\n\nWe suppose that the Kraken botnet was developed by a beginner. The malware does not\ninclude advanced malware technologies and no groundbreaking innovations, even though\nthose were advertised. Many sensitive strings are not encrypted, such as installation paths,\nanti-virus listings, insults against the analysts and much more.\n\nTo sell the botnet malware, the author used a quite sexy marketing flyer, but, actually, the\nmalware turned out to be rather simple.\n\n“Kraken HTTP” was [said to be used during an espionage campaign against the energy](http://www.scmagazine.com/symantec-details-reconnaissance-campaign-targeting-middle-eastern-companies/article/406470/)\nsector, especially against targets in the UAE. We have now identified a specific target from\nthis geographical region and have obtained one of the spear phishing emails used. Even\nthough the targets that are known by now are rather high-level targets, the malware code as\nwell as its features is not advanced.\n\nWe are surprised to see this piece of code has been used carrying out targeted attacks\nrather than broader criminal activities. It is not surprising that attackers use vulnerabilities\nthat are older, because, unfortunately, many computers are likely to be still out of date and so\nthe attack works. Despite the fact that the vulnerability used is not a new one, the malware\ndoes not have the common features that we saw during other targeted attack campaigns.\n\n\n-----\n\nCompared to incidents like Uroburos, the Kraken malware is not good enough to catch the\nbig fish” if we want to stick with to the metaphor. So, from the current point of view, there are\nthree theories:\n\nThe attackers who developed the Kraken malware might have chosen to diversify their\nbusiness and chose to attack special interest targets themselves.\nThe attackers identified infected machines in the business sector and followed the\ntracks to see what else they might be able to get from the companies.\nThe actual espionage team voluntary chose to use a kind of usual and rather simply\nbotnet malware in order to distract analysts from seeing a deeper meaning behind this\nattack and make them disregard it as ‘daily cybercrime business’.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-05-07 - Dissecting the “Kraken”.pdf"
    ],
    "report_names": [
        "2015-05-07 - Dissecting the “Kraken”.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535895,
    "ts_updated_at": 1743041688,
    "ts_creation_date": 1653693201,
    "ts_modification_date": 1653693201,
    "files": {
        "pdf": "https://archive.orkl.eu/0e131cf343ef536b2aab85f92791c065828046a5.pdf",
        "text": "https://archive.orkl.eu/0e131cf343ef536b2aab85f92791c065828046a5.txt",
        "img": "https://archive.orkl.eu/0e131cf343ef536b2aab85f92791c065828046a5.jpg"
    }
}