{
    "id": "664c985d-36a6-4a1d-8fe0-f7bd94c1cc88",
    "created_at": "2023-01-12T15:04:54.375466Z",
    "updated_at": "2025-03-27T02:09:18.743352Z",
    "deleted_at": null,
    "sha1_hash": "b9a54607504618a6b4e69f09e7cc88f9c6289031",
    "title": "2021-02-09 - Learn Pipe Fitting for all of your Offense Projects",
    "authors": "",
    "file_creation_date": "2022-05-28T16:15:53Z",
    "file_modification_date": "2022-05-28T16:15:53Z",
    "file_size": 85275,
    "plain_text": "# Learn Pipe Fitting for all of your Offense Projects\n\n**[blog.cobaltstrike.com/2021/02/09/learn-pipe-fitting-for-all-of-your-offense-projects/](https://blog.cobaltstrike.com/2021/02/09/learn-pipe-fitting-for-all-of-your-offense-projects/)**\n\nRaphael Mudge February 9, 2021\n\n[Named pipes are a method of inter-process communication in Windows. They’re used](https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes)\nprimarily for local processes to communicate with eachother. They can also facilitate\ncommunication between two processes on separate hosts. This traffic is encapsulated in the\nMicrosoft SMB Protocol. If you ever hear someone refer to a named pipe transport as an\nSMB channel, this is why.\n\nCobalt Strike uses named pipes in several of its features. In this post, I’ll walk you through\nwhere Cobalt Strike uses named pipes, what the default pipename is, and how to change it.\nI’ll also share some tips to avoid named pipes in your Cobalt Strike attack chain too.\n\n## Where does Cobalt Strike use named pipes?\n\nCobalt Strike’s default Artifact Kit EXEs and DLLs use named pipes to launder shellcode in a\n[way that defeats antivirus binary emulation circa 2014. It’s still the default. When you see](https://www.cobaltstrike.com/2014/01/08/cobalt-strike-01-08-14-exe-artifacts-a-new-hope/)\n**\\\\.\\pipe\\MSSE-###-server that’s likely the default Cobalt Strike Artifact Kit binaries. You can**\n[change this via the Artifact Kit. Look at src-common/bypass-pipe.c in the Artifact Kit to see](https://www.cobaltstrike.com/help-artifact-kit)\nthe implementation.\n\nCobalt Strike also uses named pipes for its payload staging in the jump psexec_psh module\nfor [lateral movement. This pipename is \\\\.\\pipe\\status_##. You can change the pipe via](https://www.cobaltstrike.com/help-psexec)\n[Malleable C2 (set pipename_stager).](https://www.cobaltstrike.com/help-malleable-c2)\n\n[Cobalt Strike uses named pipes in its SMB Beacon communication. The product has had this](https://www.cobaltstrike.com/help-smb-beacon)\nfeature since [2013. It’s pretty cool. You can change the pipename via your profile and when](https://www.cobaltstrike.com/2013/12/06/stealthy-peer-to-peer-cc-over-smb-pipes/)\nyou configure an SMB Beacon payload. I’m also aware of a few detections that target the\ncontent of the SMB Beacon feature too. The SMB Beacon uses a [length][data] pattern and\n\n\n-----\n\nthese IOCs target predictable [length] values at the beginning of the traffic. The\n[smb_frame_header Malleable C2 option pushes back on this. The default pipe is \\\\](https://www.cobaltstrike.com/2020/06/25/cobalt-strike-4-1-the-mark-of-injection/)\n\n**[target]\\pipe\\msagent_##.**\n\n[Cobalt Strike uses named pipes for its SSH sessions to chain to a parent Beacon. The SSH](https://www.cobaltstrike.com/help-ssh)\nclient in Cobalt Strike is essentially an SMB Beacon as far as Cobalt Strike is concerned. You\ncan change the pipename (as of 4.2) by setting ssh_pipename in your profile. The default\nname of this pipe (CS 4.2 and later) is \\\\.\\pipe\\postex_ssh_####.\n\n[Cobalt Strike uses named pipes for most of its post-exploitation jobs. We use named pipes](https://www.cobaltstrike.com/help-opsec)\nfor post-ex tools that inject into an explicit process (screenshot, keylog). Our fork&run tools\nlargely use named pipes to communicate results back to Beacon too. F-Secure’s Detecting\nCobalt Strike Default Modules via Named Pipe Analysis discusses this aspect of Cobalt\nStrike’s named pipes. We introduced the ability to change these pipenames in Cobalt Strike\n[4.2. Set post-ex -> pipename in your Malleable C2 profile. The default name for these pipes](https://www.cobaltstrike.com/help-malleable-postex)\nis \\\\.\\pipe\\postex_#### in Cobalt Strike 4.2 and later. Prior to 4.2, the default name was\nrandom-ish.\n\n## Pipe Fitting with Cobalt Strike\n\nWith the above, you’re now armed with knowledge of where Cobalt Strike uses named pipes.\nYou’re also empowered to change their default names too. If you’re looking for a candidate\npipename, use ls \\\\.\\pipe from Beacon to quickly see a list of named pipes on a lived-in\nWindows system. This will give you plenty to choose from. Also, when you set your plausible\npipe names, be aware that each # character is replaced with a random character (0-9a-f) as\nwell. And, one last tip: you can specify a comma-separated list of candidate pipe names in\nyour ssh_pipename and post-ex -> pipename profile values. Cobalt Strike will pick from this\nlist, at random, when one of these values is needed.\n\n## Simplify your Offense Plumbing\n\nCobalt Strike uses named pipes in several parts of its offense chain. These are largely\noptional though and you can avoid them with some care. For example, the default Artifact Kit\nuses named pipes; but this is not a requirement of the Artifact Kit. Our other Artifact Kit\n[templates do not use named pipes. For lateral movement and peer-to-peer chaining of](https://www.cobaltstrike.com/2015/10/07/named-pipe-pivoting/)\n[Beacons, the TCP Beacon is an option. To avoid named pipes from our SSH sessions,](https://www.cobaltstrike.com/help-tcp-beacon)\n[tunnel an external SSH client via a SOCKS proxy pivot. And, while a lot of our fork&run post-](https://www.cobaltstrike.com/help-socks-proxy-pivoting)\n[exploitation DLLs use named pipes for results, Beacon Object Files are another way to](https://www.cobaltstrike.com/help-beacon-object-files) build\nand run post-exploitation tools on top of Beacon. The Beacon Object Files mechanism does\nnot use named pipes.\n\n## Closing Thoughts\n\n\n-----\n\nThis post focused on named pipe names, but the concepts here apply to the rest of Cobalt\nStrike as well. In offense, knowing your IOCs and how to change or avoid them is key to\nsuccess. Our goal with Cobalt Strike isn’t amazing and ever-changing default pipe names or\nIOCs. Our goal is flexibility. Our current and future work is to give you more control over your\nattack chain over time. To know today’s options, read [Kits, Profiles, and Scripts… Oh my!](https://www.cobaltstrike.com/2017/10/03/kits-profiles-and-scripts-oh-my/)\nThis blog post summarizes ways to customize Cobalt Strike. Our late-2019 Red Team\nOperations with Cobalt Strike mixes these ideas into each lecture as well.\n\n### Interested in Trying Cobalt Strike?\n\n**[REQUEST A QUOTE](https://cobaltstrike.com/special)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-09 - Learn Pipe Fitting for all of your Offense Projects.pdf"
    ],
    "report_names": [
        "2021-02-09 - Learn Pipe Fitting for all of your Offense Projects.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535894,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653754553,
    "ts_modification_date": 1653754553,
    "files": {
        "pdf": "https://archive.orkl.eu/b9a54607504618a6b4e69f09e7cc88f9c6289031.pdf",
        "text": "https://archive.orkl.eu/b9a54607504618a6b4e69f09e7cc88f9c6289031.txt",
        "img": "https://archive.orkl.eu/b9a54607504618a6b4e69f09e7cc88f9c6289031.jpg"
    }
}