{
    "id": "667645fb-b9d7-47da-afc4-df2a29149ad4",
    "created_at": "2023-01-12T14:58:49.715118Z",
    "updated_at": "2025-03-27T02:16:26.528579Z",
    "deleted_at": null,
    "sha1_hash": "46845afb26e9599447e934af8b00e79ccb2144f9",
    "title": "2020-09-08 - TikTok Spyware- A detailed analysis of spyware masquerading as TikTok",
    "authors": "",
    "file_creation_date": "2022-05-27T23:18:10Z",
    "file_modification_date": "2022-05-27T23:18:10Z",
    "file_size": 2196381,
    "plain_text": "# TikTok Spyware\n\n**zscaler.com/blogs/research/tiktok-spyware**\n\nA recent threat to ban TikTok in the United States has taken the internet by storm and\nreceived mixed reactions from social media and internet users. U.S. President Donald\nTrump has ordered ByteDance, the parent company of TikTok, to sell its U.S. TikTok assets\n[and also issued executive orders that would ban the social media apps TikTok and WeChat](https://www.cnn.com/2020/08/06/politics/trump-executive-order-tiktok/index.html)\nfrom operating in the U.S. if the sale doesn’t happen in the next few weeks. On the other\n[side, ByteDance has filed a lawsuit suing the Trump administration.](https://www.theverge.com/2020/8/24/21399020/tiktok-ban-lawsuit-filed-trump-china-bytedance-executive-order)\n\nWhen popular applications come under fire and are featured prominently in the news,\nhackers get excited as these newsworthy apps can become their latest target. And TikTok is\nno exception.\n\nGenerally, after an application gets banned from an official app store, such as Google Play,\nusers try to find alternative ways to download the app. In doing so, users can become\nvictims to malicious apps portraying themselves as the original app. Recently there was a\nhuge wave of SMS messages, as well as Whatsapp messages, making the rounds asking\nusers to download the latest version of TikTok at hxxp://tiny[.]cc/TiktokPro. In reality, this\n[downloaded app is a fake app that asks for credentials and Android permissions (including](https://www.youtube.com/watch?v=mzkDxBjshI4)\ncamera and phone permissions), resulting in the user being bombarded with\nadvertisements.\n\nRecently, we have come across another variant of this app portraying itself as TikTok Pro,\nbut this is a full-fledged spyware with premium features to spy on victim with ease. (Please\nnote this is a different app and not the same as the one being spread by\nhxxp://tiny[.]cc/TiktokPro.)\n\n\n-----\n\n**Technical Analysis**\n\nApp Name : TikTok Pro\n\nHash : 9fed52ee7312e217bd10d6a156c8b988\n\nPackage Name : com.example.dat.a8andoserverx\n\nUpon installation, the spyware portrays itself as TikTok using the name TikTok Pro. As soon\nas a user tries to open the app, it launches a fake notification and soon the notification as\nwell as the app icon disappears. This fake notification tactic is used to redirect the user's\nattention, meanwhile the app hides itself, making the user believe the app to be faulty.\n\nThis functionality can be seen in Figure 1.\n\n_Figure 1: App icon and fake notification._\n\nBehind the scenes, there are number of process occurring simultaneously. First, an activity\nnamed MainActivity fires up, taking care of hiding the icon and showing the fake notification.\nIt also starts an Android service named MainService.\n\nThe spyware also appears to have an additional payload stored under the /res/raw/\ndirectory. This is a common technique used by malware developers to bundle the main\npayload inside the Android package to avoid easy detection. As seen in Figure 2, the app\ntries to open the payload from the /res/raw/ directory and generate an additional Android\nPackage Kit (APK) named .app.apk :\n\n\n-----\n\n_Figure 2 : The decoy code for the fake TikTok._\n\nUpon analysis, we discovered that this is a decoy functionality and no new payload is\ngenerated. The conditions to build an additional payload are never met. Going one step\nfurther, we rebuilt the malware to execute the apparent functionality of generating a\npayload, but discovered that the APK stored in the /res/raw/ directory is empty. The\nplacement of the decoy functionality is likely designed to confuse the malware researchers.\nIt is also possible that this functionality is under development, making this\nplaceholder code incomplete.\n\nComing back to the execution flow, once the spyware hides itself, it starts an Android\nservice named MainService. Android services are components that can be made to execute\nindependently in the background without the victim's knowledge. MainService is the brain of\nthis spyware and controls almost everything—from stealing the victim's data to deleting it.\nAll of its capabilities are discussed later in this blog.\n\n\n-----\n\n_Figure 3 : Code showing the hiding icon and starting service._\n\nAs MainService is the main controller, the developer has taken the appropriate actions to\nkeep it functional and running at all times.\n\nThe malware developer uses various tactics to do so, and one of them is using Android's\nbroadcast receivers. Broadcast receivers are components that allow you to register for\nvarious Android events. In this case, it registers three broadcast receivers:\n\nMyReceiver - Triggers when the device is booted.\nIntercept Call - Triggers on incoming and outgoing calls.\nAlarmReceiver - Triggers every three minutes.\n\n_MyReceiver and AlarmReceiver start the MainService whenever appropriate events occur._\nThis tactic is very common among malware developers to ensure the malware is not killed\nby the Android OS or by any other means.\n\nFigure 4 shows MyReceiver in action where it eventually calls the MainService service.\n\n\n-----\n\n_Figure 4 : MyReceiver broadcast receiver._\n\nThe InterceptCall receiver is triggered whenever there is an incoming or outgoing call. It\nsets particular parameters in relation to call details and a further service named calls takes\nthe control as seen in Figure 5.\n\n\n-----\n\n_Figure 5 : Code for the calls service_\n\nAs seen above, the calls service stores incoming call details in .mp3 format in\nthe /sdcard/DCIM/.dat/ directory with file name appended with \"In_'' for incoming calls and\n_\"Out_'' for outgoing calls. How these recorded calls are sent to the command and control_\nserver (CnC) is taken care of by MainService, which is discussed next.\n\n_MainService is the central controller of this spyware. It controls each and every functionality_\nbased on the commands sent by the command and control (C&C) server.\n\nAs soon as this service is started, it creates two processes that take care of connection and\ndisconnection to the C&C server. This functionality can be seen in Figure 6.\n\n_Figure 6 : The timer task._\n\n_MainService has the following capabilities:_\n\nSteal SMS messages\nSend SMS messages\nSteal the victim's location\nCapture photos\nExecute commands\nCapture screenshots\nCall phone numbers\nInitiate other apps\nSteal Facebook credentials, etc\n\n\n-----\n\nAll of the above functionalities take place on the basis of commands sent by the attacker.\nStolen data is stored in external storage under the /DCIM/ directory with a hidden subdirectory named \".dat\".\n\nBelow is the list of all the commands catered by the C&C server.\n\n**Command** **Action**\n\nUnistxcr Restart the app\n\ndowsizetr Send the file stored in the /sdcard/DCIM/.dat/ directory to the C&C\nserver\n\nCaspylistx Get a list of all hidden files in the /DCIM/.dat/ directory\n\nspxcheck Check whether call details are collected by the spyware\n\nS8p8y0 Delete call details stored by the spyware\n\nscreXmex Take screenshots of the device screen\n\nBatrxiops Check battery status\n\nL4oclOCMAWS Fetch the victim's location\n\nGUIFXB Launch the fake Facebook login page\n\nIODBSSUEEZ Send a file containing stolen Facebook credentials to the C&C server\n\nFdelSRRT Delete files containing stolen Facebook credentials\n\nchkstzeaw Launch Facebook\n\nLUNAPXER Launch apps according to the package name sent by the C&C server\n\nGapxplister Get a list of all installed applications\n\nDOTRall8xxe Zip all the stolen files and store in the /DCIM/.dat/ directory\n\nAcouxacour Get a list of accounts on the victim's device\n\nFimxmiisx Open the camera\n\nScxreexcv4 Capture an image\n\nmicmokmi8x Capture audio\n\nYufsssp Get latitude and longitude\n\nGExCaalsss7 Get call logs\n\n\n-----\n\nPHOCAs7 Call phone numbers sent by the C&C server\n\nGxextsxms Get a list of inbox SMS messages\n\nMsppossag Send SMS with message body sent by the C&C server\n\nGetconstactx Get a list of all contacts\n\nRinxgosa Play a ringtone\n\nbithsssp64 Execute commands sent by the C&C server\n\nDOWdeletx Deletes the file specified by the C&C server\n\nDeldatall8 Delete all files stored in the /sdcard/DCIM/.dat/ directory\n\nWe don't have the space to cover all of the commands, but let's take a look at some of the\nmajor ones.\n\n**Facebook phishing**\n\nOne of the interesting features of this spyware is the ability to steal Facebook credentials\nusing a fake login page, similar to phishing.\n\nUpon receiving the command GUIFXB, the spyware launches a fake Facebook login page.\nAs soon as the victim tries to log in, it stores the victim's credentials in /storage/0/DCIM/.fdat\n\n_Figure 7 : Fake Facebook login_\n\n\n-----\n\nThe second command is IODBSSUEEZ, which further sends stolen credentials to the C&C\nserver, as seen in Figure 8.\n\n_Figure 8: Sending data to the attacker._\n\nThis functionality can be easily further extended to steal other information, such as bank\ncredentials, although we did not see any banks being targeted in this attack.\n\n**Calling functionality**\n\nCommand PHOCAs7 initiates calling functionality. The number to call is received along with\nthe command, as seen in Figure 9.\n\n_Figure 9 : The calling functionality._\n\n\n-----\n\nThe phone number is fetched from a response from the C&C server and is stored in str3\nvariable, which further is utilized using the tel: function.\n\n**Stealing SMS**\n\nThe Gxextsxms command is responsible for fetching all the SMS messages from the\nvictim's device and sending it over to the C&C server.\n\n_Figure 10: Stealing SMS messages._\n\nSimilarly, there are many crucial commands that further allow this spyware to perform\nadditional functionality, such as executing commands sent by the C&C, clicking photos,\ncapturing screenshots, stealing location information, and more.\n\n**Further analysis**\n\nUpon further research, we found this spyware to be developed by a framework similar to\nSpynote and Spymax, meaning this could be an updated version of these Trojan\nbuilders, which allow anyone, even with limited knowledge, to develop full-fledged spyware.\n\nMany of the functionalities seen in this spyware are similar to Spynote and Spymax based\non the samples we analyzed with some modifications. This spyware sample communicates\nover dynamic DNS. By doing so, attackers can easily set up the Trojan to communicate\nback to them without any need for high-end servers. Other common functionalities include\nexecuting commands received from the attacker, taking screenshots of the victim's device,\nfetching locations, stealing SMS messages and most common features that every spyware\nmay poses.\n\nStealing Facebook credentials using fake Facebook activity is something we didn't observe\nin Spynote/Spymax versions but was seen in this spyware.\n\n\n-----\n\nThis framework allows anyone to develop a malicious app with the desired icon and\ncommunication address. Some of the icons used can be seen below. We found 280 such\n[apps in the past three months. A complete list of hashes can be found here.](https://pastebin.com/CZPJHJ96)\n\n_Figure 11: Icons used to pose as famous apps._\n\nAll of these apps are developed by the same framework and hence have the same package\nname and certificate information as seen in Figure 12.\n\n_Figure 12 : Package name and certificate information._\n\n**Conclusion**\n\nDue to the ubiquitous nature of mobile devices and the widespread use of Android, it is very\neasy for attackers to victimize Android users. In such situations, mobile users should always\ntake the utmost precautions while downloading any applications from the internet. It is very\neasy to trick victims to fall for such attacks.\n\nUsers looking forward to using the TikTok app amidst the ban might look for alternative\nmethods to download the app. In doing so, users can mistakenly install malicious apps,\nsuch as the spyware mentioned in this blog.\nThe precautions you take online have been covered extensively in almost all of our blogs;\neven so, we believe this information bears repeating. Please follow these basic precautions\nduring the current crisis—and at all times:\n\nInstall apps only from official stores, such as Google Play.\nNever click on unknown links received through ads, SMS messages, emails, or\nthe like.\n\n\n-----\n\nAlways keep the Unknown Sources option disabled in the Android device. This\ndisallows apps to be installed on your device from unknown sources.\n\nWe would also like to mention that if you come across an app hiding it's icon, always try to\nsearch for the app in your device settings (by going to  Settings -> Apps -> Search for icon\n_that was hidden). In the case of this spyware, search for app named TikTok Pro._\n\n**MITRE TAGS**\n\n**Action** **Tag ID**\n\nApp auto-start at device boot [T1402](https://attack.mitre.org/techniques/T1402)\n\nInput prompt [T1411](https://attack.mitre.org/techniques/T1411/)\n\nCapture SMS messages [T1412](https://attack.mitre.org/techniques/T1412/)\n\nApplication discovery [T1418](https://attack.mitre.org/techniques/T1418/)\n\nCapture audio [T1429](https://attack.mitre.org/techniques/T1429/)\n\nLocation tracking [T1430](https://attack.mitre.org/techniques/T1430)\n\nAccess contact list [T1432](https://attack.mitre.org/techniques/T1432)\n\nAccess call log [T1433](https://attack.mitre.org/techniques/T1433/)\n\nCommonly used port [T1436](https://attack.mitre.org/techniques/T1436)\n\nStandard application layer protocol [T1437](https://attack.mitre.org/techniques/T1437)\n\nMasquerage as legitimate application [T1444](https://attack.mitre.org/techniques/T1444/)\n\nSuppress application icon [T1508](https://attack.mitre.org/techniques/T1508/)\n\nCapture camera [T1512](https://attack.mitre.org/techniques/T1512)\n\nScreen capture [T1513](https://attack.mitre.org/techniques/T1513/)\n\nForeground persistence [T1541](https://attack.mitre.org/techniques/T1541/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-08 - TikTok Spyware- A detailed analysis of spyware masquerading as TikTok.pdf"
    ],
    "report_names": [
        "2020-09-08 - TikTok Spyware- A detailed analysis of spyware masquerading as TikTok.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535529,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653693490,
    "ts_modification_date": 1653693490,
    "files": {
        "pdf": "https://archive.orkl.eu/46845afb26e9599447e934af8b00e79ccb2144f9.pdf",
        "text": "https://archive.orkl.eu/46845afb26e9599447e934af8b00e79ccb2144f9.txt",
        "img": "https://archive.orkl.eu/46845afb26e9599447e934af8b00e79ccb2144f9.jpg"
    }
}