{
    "id": "66e8e910-964e-4677-89e8-d6e4b8724852",
    "created_at": "2023-01-12T15:02:35.91016Z",
    "updated_at": "2025-03-27T02:16:26.544882Z",
    "deleted_at": null,
    "sha1_hash": "c0af2eb708887686a89f47db7b8ad4ff6ac38864",
    "title": "2021-04-28 - The Rage of Android Banking Trojans",
    "authors": "",
    "file_creation_date": "2022-05-28T23:39:36Z",
    "file_modification_date": "2022-05-28T23:39:36Z",
    "file_size": 4925470,
    "plain_text": "# The Rage of Android Banking Trojans\n\n**[threatfabric.com/blogs/the-rage-of-android-banking-trojans.html](https://www.threatfabric.com/blogs/the-rage-of-android-banking-trojans.html)**\n\nApril 2021\n\n\n-----\n\n## Introduction\n\nIn Greek mythology Achilles was quite simply invincible during the Trojan War; he was also\nrather proud and bad-tempered for his own good and his rage would cost both his\ncountrymen and the enemy dearly. In the past 7 years, ThreatFabric has discovered many\nnew Android banking trojans, all with one common trait: an insatiable rage against Android\nbanking apps. In this blog we will discuss what have been the underlying catalysts behind\nthis rage and what new weapons are currently filling the virtual Trojan Horses. The second\npart of the blog is focused on new on-device fraud capabilities utilised by malware families to\nperform fraud in an automated way using the victims own Android banking app.\n\n## Catalysts\n\n\n-----\n\nOne of the most obvious catalysts that played an important role in The Rage we are\nexperiencing are the source code leaks of two very effective bots, namely Anubis 2.5 and\nCerberus: these leaks resulted in multiple private trojan versions actively targeting regions\nsuch as Poland, Spain, Turkey, and Italy (local actors).\n\nWe also noticed a very clear new trend adopted by Android banking families in the way they\nadvertise themselves. From 2018 to mid 2020 Android banking trojans from families like Red\nAlert or Cerberus, had all adopted the Malware as a Service (MaaS) model: actors would\nrent their malware services on a subscription basis and would aggressively advertise their\nservice on multiple dark web forums. What’s noticeable is that the MaaS strategy for most\nadversaries has resulted in financial gain on short term but has not been very sustainable\nover time (Maza-in’s Anubis and Red Alert as MaaS are good examples). However, recent\nmalware families, including Alien or Medusa among others, adopted a more reserved\napproach, limiting their exposure on public forums and using side-channels for the customers\nto communicate directly with the vendor.\n\nLooking at the current successful infections rates of the Trojans families we are tracking, we\ncan only conclude that the new private strategy is paying out and seems to be a more\nsustainable business model.\n\nThe last catalyst that endorses The Rage is the professionalization in malware distribution\ncampaigns. Within the Android banking trojans ecosystem, we observed an increase in the\nnumber of advisories providing so-called dedicated trojan distribution services (DaaS). These\nservices usually consist of dropper/loader Android apps (masquerading as legitimate apps)\nin different app stores, including the Google Play Store. The Rage does not stop at abusing\n\n\n-----\n\ntrusted apps stores. Recently we have seen a considerable number of distribution\ncampaigns utilizing GitHub, Discord and other social media channels as main storage and\nspreading tactic.\n\n## Statistics\n\nOur Mobile Threat Intel (MTI) platform, responsible for classifying Android banking malware\nsamples, cataloguing their technical malware capabilities and extracting the so-called overlay\ntargets, has observed a 129% increase in the list of apps targeted with overlays attacks\nsince 2019. The largest increase has taken place the past year and The Rage is continuing\nin 2021.\n\n\n-----\n\nThe most targeted apps are related to crypto currency, but the top 20 also includes many\napps from banks.\n\nWith many different crypto-currencies hitting their highest market value in 2021, populating\nnewsfeeds all over the world and now more than ever being discussed extensively in\nmainstream media, it is not a surprise that crypto-currency wallets are the most common\ntargets for this new wave of banking trojans. Another important fact to consider is that, while\n\n\n-----\n\nbanking apps tend to have different versions of their APK based on the country they serve,\ncrypto-wallets tend to have one unique APK, making it easier for malicious actors to target\nthem.\n\n## New capabilities & trends\n\nA clear new trend in Android banking trojans families is the focus on developing malware\ncapabilities that allow actors to perform fraud on a victims in an automated way using the\nvictims own banking or Bitcoin wallet apps, overview:\n\nScaling on-device fraud attempts by developing Automated Transfer System modules\npowered by AccessibilityService.\nNew ways to start a Remote Access sessions (RAT) relaying on Android native code to\navoid additional installations (VNC/Teamvier)\nLogging all (secret) content inside apps, including OTP apps like Authenticator\n(Google/Microsoft).\nManipulating the beneficiary input fields of Android banking apps while the victim is in\nthe flow of performing payments (very successful attack).\n\nEntering a new ERA shifting focus from credential stealing capabilities to on-device fraud\nautomation.\n\nFor the past 5 years the main way to steal mobile banking login credentials and verification\ncodes (OTP) has been the use of so-called overlay attacks. With this attack pattern (MITRE\nTTP: T1411) attackers harvest login credentials with a fake login window on top of the\noriginal banking app. In the past year malicious actors mainly used these stolen credentials\n\n\n-----\n\nto register a new device to perform fraud or steal the currency in a crypto wallet using a\ndifferent channel, for example through the web interface. This attack is also known as device\nregistrations fraud, which results in financial loss on a separate device or channel.\n\n[However, as covered in our 2020 blog “Year of the RAT”, actors moved to execute financial](https://www.threatfabric.com/blogs/2020_year_of_the_rat.html)\nfraud scenarios directly on the victim’s device by installing additional services such as a\nback-connect proxy and remote access software, such as VNC or TeamViewer, to control the\nvictim’s device remotely.\n\nThis year actors have taken the so called on-device fraud strategy to the next level by\nperforming actions in the targeted banking app on behalf of the victim and even automating\nfraudulent transfers.\n\n### Automated Transfer System (ATS)\n\nAndroid’s Accessibility Service’s main purpose is to assist users with disabilities. However,\nwhen a victim is lured by Android banking trojans into enabling this service with enticing and\nrepeating fake messages, the (malicious) AccessibilityService can read anything a normal\nuser can see and recreate any action an user can do on an Android device.\n\nLet’s dig a bit deeper on how this works by analyzing the trojans that have mastered this\nattack vector this year: Gustuff and Medusa. Let’s take a transfer activity from a demo\nbanking app as an example: from an Accessibility perspective, all the input fields have a so\ncalled @Android:id label which can be read and controlled by any AccessiblityService\nrunning on the victim’s device. In this example, by providing the bot command\n```\nsetText(TEXT), an attacker can, in a fully automated way, change the beneficiary account\n\n```\n\n-----\n\nnumber to anything he/she wants in order to transfer funds to a money mule. In general, the\nmalware’s Accessibility script first reads the balance information of a victim (also through an\nautomated process) before they perform this attack.\n\nTo provide a bit more context, the Accessibility script below is used by the Android Banking\ntrojan Gustuff for the St.George Android banking app: it performs a login on behalf of the\nvictim to start a session in a timely fashion (by using some sleep cycles to look more\nlegitimate) and uses this active apps session to script against the transfer screen of the\nmobile banking app to perform a payment to a mule on behalf of the victim, successfully\ncompleting a full ATS attack.\n\n\n-----\n\n```\nfunction stgeorge(info) {\n  let actions = [{\"type\":\"open\",\"open\":\"launch\",\"value\": \"org.stgeorge.bank\"},\n{\"type\": \"delay\", \"time\": 1000}, {\"type\":\"windows\",\"root\":true},\n    {\"type\": \"interactive\", \"viewId\": \"org.stgeorge.bank:id/continue_button\",\n\"click\": true}, {\"type\": \"delay\", \"time\": 1000},\n    {\"type\": \"interactive\", \"viewId\": \"org.stgeorge.bank:id/btn_logon\", \"click\":\ntrue}, {\"type\": \"delay\", \"time\": 1000},\n    {\"type\": \"interactive\", \"viewId\": \"org.stgeorge.bank:id/logon_button\",\n\"click\": true}, {\"type\": \"delay\", \"time\": 8000}\n  ];\n  if (info.securityNum) {\n    actions = actions.concat([{\n      \"type\": \"interactive\",\n      \"viewId\": \"org.stgeorge.bank:id/pin_editor\",\n      \"setText\": info.securityNum\n    }]);\n  } else if (info.pass) {\n    actions = actions.concat([\n      {\"type\": \"interactive\", \"viewId\":\n\"org.stgeorge.bank:id/internet_password_ET\", \"setText\": info.pass }, {\"type\":\n\"delay\", \"time\": 500},\n      {\"type\": \"interactive\", \"viewId\": \"org.stgeorge.bank:id/login_Button\",\n\"click\": true }\n    ]);\n  }\n  return utils.buildCommand(\"array\", {\"actions\": actions});\n}\n\n```\nThis capability adds a new layer of danger to the Android banking malware ecosystem, by\nmaking large scale campaigns more automated and easier to manage for threat actors. To\nsummarize the on-device fraud MO:\n\n\n-----\n\n### Accessibility Event Logging\n\nAnother incredibly powerful feature of multiple families, including Medusa and Gustuff, is\nevent logging. If the bot receives the command from the C2, it starts to recursively collect the\ninformation about the active window starting from the root node, which means it is able to\ncollect information about everything that is displayed on the screen. Information of interest\nincludes, but is not limited to, the following:\n\nNode bounds in screen coordinates (position of elements in the UI)\nText of the node (the text inside an element)\nWhether this node is password (if the element is a field of type “password”)\n\nThe following snippet from Anatsa shows the code that collects the information of active\nNode and all its children that are matching a specific string:\n```\npublic static List getAllNodes(AccessibilityNodeInfo arg6, String arg7) {\n  String v0 = arg7.toLowerCase();\n  ArrayList v1 = new ArrayList();\n  if(arg6 == null) {\n    return v1;\n  }\n  int v2 = arg6.getChildCount();\n  int v3;\n  for(v3 = 0; v3 < v2; ++v3) {\n    AccessibilityNodeInfo v4 = arg6.getChild(v3);\n    if(v4 != null) {\n      if(v4.getClassName() != null &&\nv4.getClassName().toString().toLowerCase().contains(v0))) {\n        v1.add(v4);\n      }\n      else {\n        v1.addAll(Utils.getAllNodes(v4, arg7));\n      }\n    }\n  }\n  return v1;\n}\n\n```\nBy collecting all this data, the actor can get a better understanding of the interface of different\napplications and therefore implement relevant scenarios for accessibility scripting feature.\nMoreover, it allows actors to have deeper insights on the applications the victim uses, its\ntypical usage and it allows actors to intercept some of its data.\n\n### Replacing account number in input fields\n\nAnother Accessibility trick has been introduced by Medusa Android banking trojan, and it is\ntriggered by the command `fillfocus . This feature allows the actor to change the content`\nof the focused input field with some text specified by the attacker. This feature can be used\n\n\n-----\n\nto invisibly substitute the victim s input with the one set by the actor(s). This is done by\nabusing the AccessibilityService. The following snippet shows the code that sets the focused\ninput field with text received from the C2:\n```\npublic void fillfocus(int cmdId, String t_text) {\n  if (WorkerAccessibilityService.accessibilityService != null) {\n    Bundle bundle = new Bundle();\n    bundle.putCharSequence(\"ACTION_ARGUMENT_SET_TEXT_CHARSEQUENCE\", t_text);\n//find FOCUS_INPUT field\n    AccessibilityNodeInfo accessNodeInfo =\nWorkerAccessibilityService.accessibilityService.findFocus(1);\n    if (accessNodeInfo != null) { //perform ACTION_SET_TEXT\n      accessNodeInfo.performAction(0x200000, bundle); \n    }\n    this.sendCmdExecuted(cmdId);\n    return;\n  }\n  throw null;\n}\n\n```\nWith this feature, actors can for example modify the bank account number that the victim\nselected with one controlled by the attacker, effectively tricking the victim into transferring\nmoney to a money mule.\n\n### Clipper\n\nAnother newly introduced feature is the capability to change the clipboard content to some\ntext specified by the actor(s). The Medusa Trojan can receive the command “copyclip” with\nas parameter text to be set. This is a common MO for so called “clippers”, a type of malware\nthat steals or substitutes the clipboard data. Similar in concept to the previous technique, it is\nusually used in order to invisibly substitute some sensitive data such as, IBAN or\ncryptocurrency wallet address, tricking the victim into performing an operation, such as a\ntransaction, to a beneficiary which was not the original one. The following snippet shows the\ncode that sets the clipboard data with text received from the C2:\n```\nprivate void copyclip(int cmdId, String textFromC2) { \n  Context ctx = this.mContext.getApplicationContext(); \n  try { \n    ((ClipboardManager)ctx.getSystemService(\"clipboard\"))\n      .setPrimaryClip(ClipData.newPlainText(\"Copied Text\", textFromC2));\n  }\n  catch(Exception unused_ex) {}\n  this.sendCmdExecuted(cmdId);\n}\n\n### Screen casting using integrated solutions\n\n```\nIn the past 2 years Android banking trojans actors have focused on adding so called Remote\nAccess Trojan (RAT) capabilities by installing and configuring an additional VNC and Team\nservices on the victims This is a very loud activity from malware detection perspective It\n\n\n-----\n\nseems that new actors behind trojans such as Medusa, have figured out that the Android OS\nitself can natively support the hidden RAT objective. Many new families are using\nAccessibility services to perform actions on the victims’ behalf in combination with audio and\nvideo streaming using RTSP (Real Time Streaming Protocol) giving an incredibly powerful\nfeature to the RAT without the need to install additional apps such as VNC/TeamViewer:\n```\npublic static String lA(int arg3, String arg4, String arg5, String arg6) {\n  StringBuilder v0 = new StringBuilder().insert(0, \"m=video 0 RTP/AVP\n96\\r\\na=rtpmap:96 H265/90000\\r\\na=fmtp:96 sprop-sps=\");\n  v0.append(arg4);\n  v0.append(\"; sprop-pps=\");\n  v0.append(arg5);\n  v0.append(\"; sprop-vps=\");\n  v0.append(arg6);\n  v0.append(\";\\r\\na=control:trackID=\");\n  v0.append(arg3);\n  v0.append(\"\\r\\n\");\n  return v0.toString();\n}\n\n## Distribution\n\n### New Google Play Store banking malware campaign\n\n```\nThreatFabric has been tracking a strong group that has been very successful in spreading\ntrojans on the Google Play Store using apps masquerading as “QR Scanners”. The main\npurpose of these so-called malware dropper apps is to spread a private/customized version\nof the Anubis Banking Trojan targeting over 1200 banking and cryptocurrency wallet apps.\n\n\n-----\n\nThe dropper apps have been successfully reappearing in the Google Play Store over a\nperiod of 13 months, regardless of our strong efforts in reporting these apps as malicious to\nGoogle.\n\nThe first Google Play dropper app masquerading as “QR Scanner” appeared in February\n2020 (com.tasklog.qrcodescanner) and one of the latest (com.quar.qrscanner) was uploaded\nto the Play Store on March 2021. This malware distribution campaign has resulted in at least\n30.000 infected devices, and the actors behind them are preparing a new dropper app at the\ntime of writing.\n\nThe dropper apps are only active for a short time with long-time pauses between active\nperiods. To stay under the radar, it also implements several evasion techniques to bypass\nstatic and dynamic analysis during the Google Play Store evaluation period, as well as to\nmake further analysis by security researchers and AV products more complicated. For\nexample, the string decryption routine will be performed correctly only if a datetime check will\nbe passed: if the date is earlier then stated in the code, the decryption will be performed in a\nwrong way, which will prevent the decryption, and therefore the launch of the malicious\ndropper code.\n```\npublic static byte[] decrypt_string(byte[] arg1) {\n  return qk.is_later_then_05_03_2021() ?\n    ra.xor_int(arg1, rq.int_52) : ra.xor_int(arg1, 0);\n}\n\n```\nAfter the deadline passed, the malicious dropper is decrypted and launched. Nevertheless,\nthis stage will also perform several checks to define if the device is suitable to download the\nactual payload. The dropper will collect the information about the device and send it to the\n\n\n-----\n\nC2: hardware information, list of all system and third-party packages installed on the device,\nis device being used to debug applications via USB, etc. On the C2 side the actor(s) will\ndecide whether to continue with downloading the payload or not.\n\nThe C2 will respond, whether the dropper should download a payload or kill itself. If “kill”\ncommand is received, the malicious code launched earlier will be deleted from the device\nand never be launched again.\n\nThe whole process is highly manually maintained by the actor(s), making it difficult to detect\nfrom an automated perspective.\n\nThe actual payload seen by ThreatFabric analysts is a private and customized variant of the\nAnubis Trojan that is packed with a commercial tool (Dexprotector). This campaign shows\nthat actor(s) behind banking Trojans are highly skilled and inventive to stay under the radar\nand deliver the malicious applications on users’ devices.\n\n## Conclusion\n\nThere has been a 129% increase in targeted banking apps in the span of only one year. A\nnoticeable addition are cryptocurrency wallets apps, that are now part of every new Android\nbanking trojan family.\n\nExisting families like Gustuff and new Android Banking Trojans like Medusa have fully\nadapted to performing on-device fraud attacks by automating the login sequence, checking\nbalance of the victim, and creating payments to money mules using ATS (Automated\nTransfer System) modules. This attack vector is achieved by abusing Accessibility features\n\n\n-----\n\nof the Android operating system. To continue fortifying the on-device fraud strategy,\nadversaries also discovered that they can use native Android code (instead of\nTeamViewer/VNC) to achieve screen streaming capabilities (using RTSP), making the attack\nless noticeable on the victim’s device. Chaining this native screen streaming feature of\nAndroid with Accessibility controls, such as performing actions (clicks) on the victims’ behalf,\nresults in a full hidden Remote Access Trojan (RAT). We can consider these developments a\nsignificant threat to mobile payments on the Android platform.\n\nThis overview shows a brief recap of the main ATS capabilities from different families:\n\nThe success rate of one Gustuff botnet (4 active botnets at the time of writing) in only one\nweek time consisted in 757 harvested credentials and ATS fraud attempts in countries such\nas the UK, Canada and Australia.\n\nThe Rage does not end here, adversaries have also proven to continuously bypass Google\nPlay Store malware protection controls with apps masquerading as “QR-Reader/Scanner”\nover a year time resulting in a strong private botnet of at least 30.000 infections targeting\nover 200 banking apps with a private version of Anubis that is obfuscated with a commercial\ntool (DexProtector).\n\nMost of the new strains of these malware families are now raging as privately run projects,\nswitching from the very loud MaaS (Malware as a Service) trend that we observed last year.\nThis could also be a result of the increasing success/attempts of law enforcement efforts to\ncatch and punish the people behind these threats and boldly disturbing underground forms.\n\n\n-----\n\nMore than ever, a clear overview and understanding of the mobile banking threat landscape\nis crucial for mobile payments, and tools to detect the attack behavior such as ATS from\nAndroid banking malware on devices have become invaluable to avoid fraud.\n\n## Appendix\n\n### IOCs\n\n**Name** **SHA256 Hash**\n\n\nAnubis\nQRcode\nDropper\n\n```\n998ba967bb23e6324c8f689ca0e1b5f28434d1ffdd52eac751f0649f037328c1\n\n```\n\nAnubis.C `617f3969267477d9c50e089139ea7627f1916259fc9b8c5028e2257a7ab7077a`\n\nAnatsa.A `a20f6c19ef20213df5b8e277d21dd70fe1cf99215ab42c39d69cce2396e72972`\n\nMedusa.B `05c8fc94e6f08bb0600fe7d8177a17ad65f01ec34fe749ea4981994dd890b1c8`\n\nGustuff.C `3d196d954a2ea68c5ea65901fb7905b4773ead3fdb6967400beb370580e6f4a5`\n\n### Capabilities\n\n**Medusa.B**\n\n**Name** **Description**\n\n\nClipboard\ninteraction\n\nApp autostart at\ndevice boot\n\nApp\ntermination\n\nPreventing\nremoval\n\nHiding the\napp icon\n\nScreen\nstreaming\n\n\nThe malware can extract data from or insert data into the device’s clipboard\n\nThe malware starts automatically when the device is turned on or restarted\n\nThe malware can terminate apps\n\nThe malware can prevent it’s removal\n\nThe malware can hide it’s icon from the application drawer\n\nThe malware can stream what is displayed on the device’s screen\n\n\nAlerts The malware can issue Android alerts with arbitrary text\n\n\n-----\n\n**Name** **Description**\n\n\nPush\nnotifications\n\nScreen\nlocking\n\n(Partial)\nAutomated\nTransfer\nSystem\n\n\nThe malware can show push notifications\n\nThe malware can lock the screen of the infected device\n\nThe malware uses a AccessibilityService to control the infected device and\nperform automated payments using the targeted banking apps (still\nrequires interaction from the C2 to initiate the process)\n\n\nWeb pages The malware can show arbitrary web pages on the infected device\n\nApp removal The malware can remove applications\n\nApp starting The malware can start applications\n\n\nApp\ninstalling\n\nSMS\nspamming\n\nSMS\nsending\n\nTarget list\nupdate\n\nApplication\nlisting\n\nContact list\ncollection\n\nDevice info\ncollection\n\nAccessibility\nevent\nlogging\n\nSMS\nforwarding\n\n\nThe malware can install applications\n\nThe malware can perform SMS spam campaigns\n\nThe malware can send SMS messages\n\nActors can configure targets for overlay phishing attack dynamically\n\nThe malware can access list of all installed applications and send it to the\nC2\n\nThe malware can read the contact list of the infected device and send it to\nthe C2\n\nThe malware can access device related information(SIM, build info,\nsettings) and send it to the C2\n\nThe malware uses a AccessibilityService to get a stream of events\nhappening on the device and send it to the C2\n\nThe malware can forward all incoming SMS messages to a phone number\ncontrolled by actors\n\n\nSMS listing The malware can access the content of SMS messages and send it to the\nC2\n\nKeylogging The malware can log victim’s keystrokes and send them to the C2\n\n\n-----\n\n**Name** **Description**\n\n\nDynamic\noverlaying\n\n**Anatsa.A**\n\n\nThe malware can show phishing screens to steal information. Phishing\nscreens are retrieved from the C2\n\n\n**Name** **Description**\n\n\nClipboard\ninteraction\n\nApp autostart at\ndevice boot\n\nApp\ntermination\n\nPreventing\nremoval\n\nHiding the\napp icon\n\nFiles/pictures\ncollection\n\n\nThe malware can extract data from or insert data into the device’s\nclipboard\n\nThe malware starts automatically when the device is turned on or restarted\n\nThe malware can terminate apps\n\nThe malware can prevent it’s removal\n\nThe malware can hide it’s icon from the application drawer\n\nThe malware can access the file system of the infected device and upload\nit’s content to the C2\n\n\nAlerts The malware can issue Android alerts with arbitrary text\n\n\nPush\nnotifications\n\nScreen\nlocking\n\n(Partial)\nAutomated\nTransfer\nSystem\n\n\nThe malware can show push notifications\n\nThe malware can lock the screen of the infected device\n\nThe malware uses a AccessibilityService to control the infected device and\nperform automated payments using the targeted banking apps (still\nrequires interaction from the C2 to initiate the process)\n\n\nWeb pages The malware can show arbitrary web pages on the infected device\n\nApp removal The malware can remove applications\n\nApp starting The malware can start applications\n\n\nApp\ninstalling\n\n\nThe malware can install applications\n\n\n-----\n\n**Name** **Description**\n\n\nSMS\nspamming\n\nSMS\nsending\n\nTarget list\nupdate\n\nApplication\nlisting\n\nContact list\ncollection\n\nDevice info\ncollection\n\nAccessibility\nevent\nlogging\n\nSMS\nforwarding\n\n\nThe malware can perform SMS spam campaigns\n\nThe malware can send SMS messages\n\nActors can configure targets for overlay phishing attack dynamically\n\nThe malware can access list of all installed applications and send it to the\nC2\n\nThe malware can read the contact list of the infected device and send it to\nthe C2\n\nThe malware can access device related information(SIM, build info,\nsettings) and send it to the C2\n\nThe malware uses a AccessibilityService to get a stream of events\nhappening on the device and send it to the C2\n\nThe malware can forward all incoming SMS messages to a phone number\ncontrolled by actors\n\n\nSMS listing The malware can access the content of SMS messages and send it to the\nC2\n\nKeylogging The malware can log victim’s keystrokes and send them to the C2\n\n\nDynamic\noverlaying\n\n**Gustuff.C**\n\n\nThe malware can show phishing screens to steal information. Phishing\nscreens are retrieved from the C2\n\n\n**Name** **Description**\n\n\nClipboard\ninteraction\n\nApp auto-start\nat device boot\n\n\nThe malware can extract data from or insert data into the device’s\nclipboard\n\nThe malware starts automatically when the device is turned on or\nrestarted\n\n\nUpdatable The malware can update itself\n\n\nEmulation\ndetection\n\n\nThe malware can detect whether or not it is running on the real device\n\n\n-----\n\n**Name** **Description**\n\n\nApp\ntermination\n\nPreventing\nremoval\n\nHiding the app\nicon\n\n\nThe malware can terminate apps\n\nThe malware can prevent it’s removal\n\nThe malware can hide it’s icon from the application drawer\n\n\nSMS C2 The malware is able to receive commands using incoming text messages\n\n\nC2 update\nprimarychannel\n\n\nThe malware can update the C2 using a new value/list of values received\nfrom the original C2\n\n\nAlerts The malware can issue Android alerts with arbitrary text\n\n\nPush\nnotifications\n\nScreen\nlocking\n\nAutomated\nTransfer\nSystem\n\n\nThe malware can show push notifications\n\nThe malware can lock the screen of the infected device\n\nThe malware uses a AccessibilityService to control the infected device\nand perform automated payments using the targeted banking apps\n\n\nWeb pages The malware can show arbitrary web pages on the infected device\n\nApp removal The malware can remove applications\n\nApp starting The malware can start applications\n\nApp installing The malware can install applications\n\n\nSMS\nspamming\n\n\nThe malware can perform SMS spam campaigns\n\n\nSMS sending The malware can send SMS messages\n\n\nTarget list\nupdate\n\nFiles/pictures\ncollection\n\nApplication\nlisting\n\n\nActors can configure targets for overlay phishing attack dynamically\n\nThe malware can access the file system of the infected device and\nupload it’s content to the C2\n\nThe malware can access list of all installed applications and send it to the\nC2\n\n\n-----\n\n**Name** **Description**\n\n\nContact list\ncollection\n\nDevice info\ncollection\n\nAccessibility\nevent logging\n\nSMS\nforwarding\n\n\nThe malware can read the contact list of the infected device and send it\nto the C2\n\nThe malware can access device related information(SIM, build info,\nsettings) and send it to the C2\n\nThe malware uses a AccessibilityService to get a stream of events\nhappening on the device and send it to the C2\n\nThe malware can forward all incoming SMS messages to a phone\nnumber controlled by actors\n\n\nSMS listing The malware can access the content of SMS messages and send it to\nthe C2\n\nKeylogging The malware can log victim’s keystrokes and send them to the C2\n\n\nDynamic\noverlaying\n\n### Targets\n\n**Anatsa.A**\n\n**Package name**\n\n\nThe malware can show phishing screens to steal information. Phishing\nscreens are retrieved from the C2\n\n\ncom.db.pwcc.dbmobile\n\ncom.db.pbc.miabanca\n\nde.fiducia.smartphone.android.banking.vr\n\nes.ibercaja.ibercajaapp\n\ncom.bbva.bbvacontigo\n\ncom.mobileloft.alpha.droid\n\nde.commerzbanking.mobil\n\ncom.cajasur.android\n\nnet.inverline.bancosabadell.officelocator.android\n\nes.lacaixa.mobile.android.newwapicon\n\ncom.rsi\n\n\n-----\n\n**Package name**\n\neu.unicreditgroup.hvbapptan\n\ncom.binance.dev\n\nes.bancosantander.apps\n\nde.sdvrz.ihb.mobile.secureapp.sparda.produktion\n\npiuk.blockchain.android\n\nde.postbank.finanzassistent\n\nes.openbank.mobile\n\nes.cm.android\n\nes.liberbank.cajasturapp\n\nde.ingdiba.bankingapp\n\nes.univia.unicajamovil\n\ncom.grupocajamar.wefferent\n\nde.santander.presentation\n\nde.comdirect.android\n\napp.wizink.es\n\ncom.coinbase.android\n\ncom.starfinanz.smob.android.sfinanzstatus\n\ncom.kutxabank.android\n\nvivid.money\n\nde.traktorpool\n\nwww.ingdirect.nativeframe\n\n**Gustuff.C**\n\n**Package name**\n\nau.com.bankwest.mobile\n\nau.com.ingdirect.android\n\n\n-----\n\n**Package name**\n\nau.com.nab.mobile\n\nau.com.suncorp.SuncorpBank\n\nau.com.ubank.internetbanking\n\nbcc.org.freewallet.app\n\nbcn.org.freewallet.app\n\nbtc.org.freewallet.app\n\nbtg.org.freewallet.app\n\no.edgesecure.app\n\ncom.airbitz\n\ncom.android.vending\n\ncom.anz.android\n\ncom.anz.android.gomoney\n\ncom.arcbit.arcbit\n\ncom.barclays.android.barclaysmobilebanking\n\ncom.barclays.bca\n\ncom.bitcoin.mwallet\n\ncom.bitcoin.wallet\n\ncom.bitpay.copay\n\ncom.bitpay.wallet\n\ncom.bitpie\n\ncom.btcontract.wallet\n\ncom.circle.android\n\ncom.citibank.mobile.au\n\ncom.coinbase.android\n\ncom.coincorner.app.crypt\n\n\n-----\n\n**Package name**\n\ncom.coinspace.app\n\ncom.commbank.netbank\n\ncom.cooperativebank.bank\n\ncom.grppl.android.shell.BOS\n\ncom.grppl.android.shell.CMBlloydsTSB73\n\ncom.grppl.android.shell.halifax\n\ncom.hashengineering.bitcoincash.wallet\n\ncom.kibou.bitcoin\n\ncom.kryptokit.jaxx\n\ncom.lloydsbank.businessmobile\n\nсom.moneybookers.skrillpayments\n\ncom.monitise.client.android.yorkshire\n\ncom.nearform.ptsb\n\ncom.plutus.wallet\n\ncom.qcan.mobile.bitcoin.wallet\n\ncom.rbs.mobile.android.natwest\n\ncom.rbs.mobile.android.rbs\n\ncom.westernunion.android.mtapp\n\ncom.wirex\n\ncom.xapo\n\nde.schildbach.wallet_test\n\ndistributedlab.wallet\n\neth.org.freewallet.app\n\nlt.spectrofinance.spectrocoin.android.wallet\n\nme.cryptopay.android\n\n\n-----\n\n**Package name**\n\nnet.bither\n\norg.banksa.bankß\n\norg.bom.bank\n\norg.electrum.electrum\n\norg.stgeorge.bank\n\norg.vikulin.etherwallet\n\norg.westpac.bank\n\npiuk.blockchain.android\n\ntsb.mobilebanking\n\nuk.co.hsbc.hsbcukbusinessbanking\n\nuk.co.hsbc.hsbcukmobilebanking\n\nuk.co.mbna.cardservices.android\n\nuk.co.metrobankonline.mobile.android.production\n\nuk.co.santander.businessUK.bb\n\nuk.co.santander.santanderUK\n\nuk.co.tescomobile.android\n\nuk.co.tsb.newmobilebank\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-28 - The Rage of Android Banking Trojans.pdf"
    ],
    "report_names": [
        "2021-04-28 - The Rage of Android Banking Trojans.pdf"
    ],
    "threat_actors": [
        {
            "id": "f276b8a6-73c9-494a-8ab2-13e2f1da4c53",
            "created_at": "2022-10-25T16:07:24.441133Z",
            "updated_at": "2025-03-27T02:02:10.231958Z",
            "deleted_at": null,
            "main_name": "Achilles",
            "aliases": [],
            "source_name": "ETDA:Achilles",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535755,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653781176,
    "ts_modification_date": 1653781176,
    "files": {
        "pdf": "https://archive.orkl.eu/c0af2eb708887686a89f47db7b8ad4ff6ac38864.pdf",
        "text": "https://archive.orkl.eu/c0af2eb708887686a89f47db7b8ad4ff6ac38864.txt",
        "img": "https://archive.orkl.eu/c0af2eb708887686a89f47db7b8ad4ff6ac38864.jpg"
    }
}