{
    "id": "6731044e-cf92-427c-82f5-55d8b2e56524",
    "created_at": "2023-01-12T15:05:28.018256Z",
    "updated_at": "2025-03-27T02:09:30.220697Z",
    "deleted_at": null,
    "sha1_hash": "3777fd6f1ccba2d852f1c42c1bc877e2dcb2770c",
    "title": "2022-05-09 - Examining the Black Basta Ransomware’s Infection Routine",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:02Z",
    "file_modification_date": "2022-05-28T01:56:02Z",
    "file_size": 3331690,
    "plain_text": "# Examining the Black Basta Ransomware’s Infection Routine\n\n**[trendmicro.com/en_us/research/22/e/examining-the-black-basta-ransomwares-infection-routine.html](https://www.trendmicro.com/en_us/research/22/e/examining-the-black-basta-ransomwares-infection-routine.html)**\n\nRansomware\n\nWe analyze the Black Basta ransomware and examine the malicious actor’s familiar infection tactics.\n\n\nMay 9, 2022\n\n\nBy: Ieriz Nicolle Gonzalez, Ivan Nicole Chavez, Katherine Casona, Nathaniel Morales, Don Ovid Ladores May 09, 2022\nRead time: ( words)\n\n[Black Basta, a new ransomware gang, has swiftly risen to prominence in recent weeks after it caused massive breaches to](https://www.trendmicro.com/vinfo/us/security/definition/ransomware)\norganizations in a short span of time.\n\nOn April 20, 2022, a user named Black Basta posted on underground forums known as XSS.IS and EXPLOIT.IN to advertise\nthat it intends to buy and monetize corporate network access credentials for a share of the profits. The advertisement also\nspecified that it was looking for organizations based in the United States, Canada, United Kingdom, Australia, and New\n[Zealand, which are all English-speaking countries. A report noted that malicious actors acquired stolen credentials from](https://blog.minerva-labs.com/new-black-basta-ransomware-hijacks-windows-fax-service)\nsome darknet websites that peddle an enormous amount of exfiltrated data to the underground market.\n\nOn April 26, Twitter user PCrisk [tweeted about the new Black Basta ransomware that appends the extension .basta and](https://twitter.com/pcrisk/status/1518881420910936065)\nchanges the desktop wallpaper.\n\nThis blog entry takes a closer look at the Black Basta ransomware and analyzes this newcomer’s familiar infection\ntechniques.\n\nThe infection routine\n\nBlack Basta ransomware needs administrator rights to run. It otherwise displays a command prompt message as shown on\nFigure 1.\n\nFigure 1. A\n\ncommand prompt is displayed if Black Basta ransomware is not run with administrator rights.\n\n\n-----\n\nAfter running the ransomware as administrator, it removes shadow copies, disables Windows recovery and repair, and boots\nthe PC in safe mode.\n\nC:\\Windows\\SysNative\\vssadmin.exe delete shadows /all /quiet\nC:\\Windows\\SysNative\\bcdedit.exe /deletevalue safeboot\nC:\\Windows\\SysNative\\bcdedit /set safeboot networkChanges\n\nFigure 2.\n\nCommands such as \"C:\\Windows\\SysNative\\bcedit /set safeboot networkChanges\" are embedded in the binary and can be\nviewed easily.\nIt also drops the following files, which will be used later when changing the desktop wallpaper and icons for encrypted files:\n\n%Temp%\\fkdjsadasd.ico\n%Temp%\\dlaksjdoiwq.jpg\n\nBefore booting the infected device into safe mode, it changes the desktop wallpaper by dropping the .jpg file into the\n%temp% folder and creating the following registry entry:\n\nKey: HKCU\\Control Panel\\Desktop; Value: Wallpaper; Data:%Temp%\\dlaksjdoiwq.jpg;\n\nFigure 3. The registry entry created after\n\nBlack Basta ransomware changes the wallpaper on the infected machine\n\n\n-----\n\nFigure 4. The desktop wallpaper created by the ransomware from the .jpg file dropped in the %temp% folder\nAfter changing the desktop wallpaper, it then adds the following registry keys to change the icon of the encrypted files with\nthe .basta extension:\n\nHKLM\\SOFTWARE\\Classes\\.basta\nHKLM\\SOFTWARE\\Classes\\.basta\\DefaultIcon data: %TEMP%\\fkdjsadasd.ico\n\nFigure 5. The registry keys added by the ransomware to\n\nchange the icon of the files with the .basta extension\nThe ransomware proceeds to encrypt files while the device is in safe mode, appending all encrypted files with the .basta\nextension. The ransom note is found in all the folders the ransomware has affected.\n\nFigure 6. The infected files shown with the\n\n.basta extension\n\n\n-----\n\nThe ransom note indicates the malicious actor s onion site and a company ID. Despite running the same ransomware\n(SHA256 hash: 5d2204f3a20e163120f52a2e3595db19890050b2faa96c6cba6b094b0a52b0aa) on different virtual machines,\nthe company ID the gang provides is the same across all devices.\n\nFigure 7. The ransom note dropped by Black Basta\nUsing another binary (SHA256 hash: 7883f01096db9bcf090c2317749b6873036c27ba92451b212b8645770e1f0b8a), a\ndifferent company ID is shown on the ransom note. The files are likewise appended with the .basta extension.\n\nFigure 8. A different company ID is given when another binary is used.\nAnalyzing the infection routine\n\nBlack Basta’s recent entry to the cybercrime world suggests that information about their operations is still limited. According\nto a [report, the gang has neither started marketing its operations nor has it begun recruitment of affiliates in underground](https://www.bleepingcomputer.com/news/security/new-black-basta-ransomware-springs-into-action-with-a-dozen-breaches/)\nforums. Based on advertisements they posted before the attacks, the malicious actor likely uses stolen credentials —\npurchased in darknet websites or underground forums — to get into an organization’s system.\n\nWe probed further and found that the company ID written in the ransom note is hardcoded in the binary file.\n\n\n-----\n\nFigure 9. The company ID in the ransom note is hardcoded in the binary file.\nBlack Basta attempts to delete shadow copies using vssadmin.exe and boots the device in safe mode using bcdexit.exe\nfrom different paths, specifically, %SysNative% and %System32%.\n\nFigure 10. Black Basta’s attempts to\n\ndelete shadow copies using vssadmin.exe\n\nFigure 11. Black Basta boots the device in\n\nsafe mode using bcdexit.exe from different paths, specifically, %SysNative% and %System32%.\nAt this stage, the ransomware deletes the service named Fax, and creates a new one with the same name using the\nmalware’s path and adds it to the registry for persistence.\n\n\n-----\n\nFigure 12. Pop-up notification when the Fax service is\n\ndeleted\n\nFigure 13. Functions used in creating a new service, also named “Fax,” that uses the file path of the malware as its binary\npath name\n\nFigure 14. Functions used when creating\n\na registry key\n\nFigure 15. New registry key created for the new “Fax” service that replaces the deleted service\nIt then uses ShellExecuteA to shut down and restart the victim’s machine.\n\nFigure 16. Function ShellExecuteA used\n\nto shut down and restart the victim’s machine\n\n\n-----\n\nExtortion phase\n\nFor a newcomer in the field, Black Basta is quite prolific for having compromised at least a dozen organizations in just a few\nweeks. The group’s [first known attack using the Black Basta ransomware occurred in the second week of April 2022. But an](https://www.bleepingcomputer.com/news/security/new-black-basta-ransomware-springs-into-action-with-a-dozen-breaches/)\n[earlier sample was also spotted back in February 2022 with the ransomware name “no_name_software,” which appends the](https://twitter.com/Arkbird_SOLG/status/1519452352763281408?s=20&t=D9hGjGpXFgAVNxxok5S-lw)\n[extension “encrypted” to encrypted files. According to some threat researchers, it appears that Black Basta has been in](https://twitter.com/Arkbird_SOLG/status/1519452352763281408?s=20&t=D9hGjGpXFgAVNxxok5S-lw)\ndevelopment since early February 2022.\n\nFigure 17. Ransom note used in an\n\nearlier sample\n[Like other enterprise-focused ransomware operations, Black Basta employs a double extortion scheme that involves](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-double-extortion-and-beyond-revil-clop-and-conti)\nexfiltrating confidential data before encryption to threaten victims with public release of the stolen data.\n\nThe gang carries out the extortion phase of its attacks on its Tor site, Basta News, which contains a list of all the victims who\nhave not paid the ransom.\n\nFigure 18. Black Basta’s leak site,\n\nretrieved from https://twitter.com/MarceloRivero/status/1519398885193654273\nPossible relation to an APT\n\n[Security researchers exchanged speculations on Twitter that Black Basta is possibly a rebranding of the Conti ransomware](https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-conti)\n[operation. MalwareHunterTeam pointed out many similarities in its leak site, payment site, and negotiation style to those of](https://twitter.com/malwrhunterteam/status/1519301421958578177)\n[Conti’s. Twitter user Arkbird echoed the same observation.Lawrence Abrams of BleepingComputer also mentioned that the](https://twitter.com/malwrhunterteam/status/1519301421958578177)\nmalicious actors behind Black Basta seem like they are exerting a lot of effort to avoid any resemblance to their previous\nidentity.\n\n\n-----\n\nWe have also noticed some similarities between the Black Basta and Black Matter payment sites. Like Black Matter, Black\nBasta implements user verification on its Tor site. However, the leak site does not implement a session key.\n\nFigure 19. The Black Matter payment site\n\nFigure 20. The Black Basta payment site\nNew findings: QAKBOT possibly related to Black Basta\n\nBased on our analysis of another set of samples monitored within a 72-hour timeframe, we discovered a possible correlation\n[between QAKBOT and Black Basta ransomware. We observed the following:](https://www.trendmicro.com/en_us/research/21/k/qakbot-loader-returns-with-new-techniques-and-tools.html)\n\nAs with QAKBOT, the malware is downloaded and executed from a malicious Excel file. Similar to the typical routine of\nthe QAKBOT binary, it then executes certain PowerShell commands as part of its staging phase.\nFrom information gathered in our telemetry, we found the presence of the Black Basta ransomware within the 72-hour\nperiod in which it encrypted files on victims’ machine. Trend Micro detects this as\nRansom.Win32.BASTACRYPT.YACEDT.\nOther [researchers pointed out that QAKBOT deploys its version of the exploit PRINTNIGHTMARE (aka](https://www.cynet.com/attack-techniques-hands-on/quakbot-strikes-with-quaknightmare-exploitation/)\nQUAKNIGHTMARE) during the same timeframe. We also observed the presence of the weaponized exploit. This, in\nturn, executes another binary with escalated privilege. Unfortunately, we were unable to find the presence of the file\npointed by the hardcoded path. string to complete the attack chain. Trend Micro detects this as\nTrojan.Win64.QUAKNIGHTMARE.YACEJT.\n\nMalicious actors also use certain tools as seen through our sensors, but we were unable to obtain the complete kit. We have\nso far gathered paths related to the tools themselves that include the following:\n\nAdwareCleaner (C:\\AdwCleaner\\*)\n\n\n-----\n\nEither PC Cleaner or Pervasive PSQL/SQL (C:\\pvsw\\ )\n\nThe structure of the ransomware loader is also different from the external article. In this case, instead of dropping and\nexecuting the ransomware itself, the loader downloads to the device’s memory then uses reflective loading to launch the\nransomware.\n\nThe information we have collected so far indicates that the malicious actor behind Black Basta possibly used QAKBOT as a\nnew means to deliver the ransomware.\n\n**Insights**\n\nThe malicious actors could be using a unique binary for each organization that they target. This can be seen from the\nransom note that they drop, which is hardcoded in the malware itself. A ransomware typically creates a unique ID for each\nvictim despite being infected by the same executable. Their choice of target organizations also suggests this to be the case.\nThey buy corporate network access credentials in underground markets, which could mean that they do not distribute their\nmalware sporadically. Instead, they use a certain kind of binary or variant for a specific organization.\n\nRecommendations\n\nThreat researchers suggest that the recent attacks by Black Basta can be seen as early manifestations of Conti’s rebranding\nefforts. True or not, organizations should keep a watchful eye against ransomware threats. An organization’s thorough\nassessment of its security posture and its implementation of solid cybersecurity defenses give it a better fighting chance\nagainst such threats.\n\nTo protect systems against similar attacks, organizations can establish security frameworks that allocate resources\nsystematically for establishing a strong defense strategy against ransomware. Here are some best practices that\norganizations can consider:\n\nAudit and inventory\n\nTake an inventory of assets and data\nIdentify authorized and unauthorized devices and software\nAudit event and incident logs\n\nConfigure and monitor\n\nManage hardware and software configurations\nGrant admin privileges and access only when necessary to an employee’s role\nMonitor network ports, protocols, and services\nActivate security configurations on network infrastructure devices such as firewalls and routers\nEstablish a software allowlist that only executes legitimate applications\n\nPatch and update\n\nConduct regular vulnerability assessments\nPerform patching or virtual patching for operating systems and applications\nUpdate software and applications to their latest versions\n\nProtect and recover\n\nImplement data protection, backup, and recovery measures\nEnable multifactor authentication (MFA)\n\nSecure and defend\n\nEmploy sandbox analysis to block malicious emails\nDeploy the latest versions of security solutions to all layers of the system, including email, endpoint, web, and network\nDetect early signs of an attack such as the presence of suspicious tools in the system\nUse advanced detection technologies such as those powered by AI and machine learning\n\nTrain and test\n\n\n-----\n\nRegularly train and assess employees in security skills\nConduct red-team exercises and penetration tests\n\nA multilayered approach can help organizations guard possible entry points into their system (endpoint, email, web, and\nnetwork). Security solutions can detect malicious components and suspicious behavior, which can help protect enterprises.\n\n[Trend Micro Vision One™ provides multilayered protection and behavior detection, which helps block questionable](https://www.trendmicro.com/en_us/business/products/detection-response.html)\nbehavior and tools before the ransomware can do any damage.\n[Trend Micro Cloud One™ – Workload Security protects systems against both known and unknown threats that exploit](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-workload-security.html)\nvulnerabilities. This protection is made possible through techniques such as virtual patching and machine learning.\n[Trend Micro™ Deep Discovery™ Email Inspector employs custom sandboxing and advanced analysis techniques to](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-inspector.html)\neffectively block malicious emails, including phishing emails that can serve as entry points for ransomware.\n[Trend Micro Apex One™ offers next-level automated threat detection and response against advanced concerns such](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\nas fileless threats and ransomware, ensuring the protection of endpoints.\n\n**Indicators of compromise (IOCs)**\n\n**SHA256** **Trend Micro Detection**\n\n5d2204f3a20e163120f52a2e3595db19890050b2faa96c6cba6b094b0a52b0aa Ransom.Win32.BASTACRYPT.THDBGBB\n\n7883f01096db9bcf090c2317749b6873036c27ba92451b212b8645770e1f0b8a Ransom.Win32.BASTACRYPT.YXCD2\n\nae7c868713e1d02b4db60128c651eb1e3f6a33c02544cc4cb57c3aa6c6581b6e Ransom.Win32.BASTACRYPT.THDBIBB\n\n17205c43189c22dfcb278f5cc45c2562f622b0b6280dcd43cc1d3c274095eb90 Ransom.Win32.BASTACRYPT.YXCD2\n\na54fef5fe2af58f5bd75c3af44f1fba22b721f34406c5963b19c5376ab278cd1 Ransom.Win32.BASTACRYPT.THDBGBB\n\n1d040540c3c2ed8f73e04c578e7fb96d0b47d858bbb67e9b39ec2f4674b04250 Ransom.Win32.BASTACRYPT.YXCD2\n\n2967e1d97d32605fc5ace49a10828800fbbefcc1e010f6004a9c88ef3ecdad88 Ransom.Win32.BASTACRYPT.YXCD2.note\n\nf088e6944b2632bb7c93fa3c7ba1707914c05c00f9491e033f78a709d65d7cff Ransom.Win32.BASTACRYPT.YXCD2.note\n\n**For QAKBOT-related samples:**\n\n**SHA256** **Trend Micro Detections**\n\na48ac26aa9cdd3bc7f219a84f49201a58d545fcebf0646ae1d676c7e43c6ac3e TrojanSpy.Win32.QAKBOT.YACEDT\n\n82c73538322c8b90c25a99a7afc2fafcd7e7e03fe920a3331ef0003300ac10b8 TrojanSpy.Win32.QAKBOT.YACEDT\n\n82c73538322c8b90c25a99a7afc2fafcd7e7e03fe920a3331ef0003300ac10b8 TrojanSpy.Win32.QAKBOT.YACEDT\n\n2083e4c80ade0ac39365365d55b243dbac2a1b5c3a700aad383c110db073f2d9 TrojanSpy.Win32.QAKBOT.YACEDT\n\n2e890fd02c3e0d85d69c698853494c1bab381c38d5272baa2a3c2bc0387684c1 TrojanSpy.Win32.QAKBOT.YACEDT\n\n2d906ed670b24ebc3f6c54e7be5a32096058388886737b1541d793ff5d134ccb TrojanSpy.Win32.QAKBOT.YACEDT\n\n72fde47d3895b134784b19d664897b36ea6b9b8e19a602a0aaff5183c4ec7d24 TrojanSpy.Win32.QAKBOT.YACEDT\n\nffa7f0e7a2bb0edf4b7785b99aa39c96d1fe891eb6f89a65d76a57ff04ef17ab TrojanSpy.Win32.QAKBOT.YACEDT\n\n1e7174f3d815c12562c5c1978af6abbf2d81df16a8724d2a1cf596065f3f15a2 TrojanSpy.Win32.QAKBOT.YACEDT\n\n130af6a91aa9ecbf70456a0bee87f947bf4ddc2d2775459e3feac563007e1aed Trojan.Win64.QUAKNIGHTMARE.YACEJT\n\n81a6c44682b981172cd85ee4a150ac49f838a65c3a0ed822cb07a1c19dab4af5 Ransom.Win32.BASTACRYPT.YACEDT\n\n94428d7620fff816cb3f65595978c6abb812589861c38052d30fa3c566e32256 Ransom.Win32.BASTACRYPT.YACEDT\n\nc9df12fbfcae3ac0894c1234e376945bc8268acdc20de72c8dd16bf1fab6bb70 Ransom.Win32.BASTACRYPT.YACEJT\n\n0d3af630c03350935a902d0cce4dc64c5cfff8012b2ffc2f4ce5040fdec524ed Trojan.Win32.BLACKBASTA.YXCEJ\n\n\n-----\n\n3fe73707c2042fefe56d0f277a3c91b5c943393cf42c2a4c683867d6866116fc Trojan.Win32.BLACKBASTA.YXCEJ\n\n3fe73707c2042fefe56d0f277a3c91b5c943393cf42c2a4c683867d6866116fc Trojan.Win32.BLACKBASTA.YXCEJ\n\n0e2b951ae07183c44416ff6fa8d7b8924348701efa75dd3cb14c708537471d27 Trojan.Win32.BLACKBASTA.YXCEJ\n\n8882186bace198be59147bcabae6643d2a7a490ad08298a4428a8e64e24907ad Trojan.Win32.BLACKBASTA.YXCEJ\n\ndf35b45ed34eaca32cda6089acbfe638d2d1a3593d74019b6717afed90dbd5f8 Trojan.Win32.BLACKBASTA.YXCEJ\n\nb8aa8abac2933471e4e6d91cb23e4b2b5a577a3bb9e7b88f95a4ddc91e22b2cb TrojanSpy.VBS.KEYLOAD.A\n\nfb3340d734c50ce77a9f463121cd3b7f70203493aa9aff304a19a8de83a2d3c9 TrojanSpy.VBS.KEYLOAD.A\n\n5ab605b1047e098638d36a5976b00379353d84bd7e330f5778ebb71719c36878 TrojanSpy.VBS.KEYLOAD.A\n\n9707067b4f53caf43df5759fe40e9121f832e24da5fe5236256ad0e258277d88 TrojanSpy.VBS.KEYLOAD.A\n\n9707067b4f53caf43df5759fe40e9121f832e24da5fe5236256ad0e258277d88 TrojanSpy.VBS.KEYLOAD.A\n\nd7580fd8cc7243b7e16fd97b7c5dea2d54bcba08c298dc2d82613bdc2bd0b4bf TrojanSpy.VBS.KEYLOAD.A\n\n919d1e712f4b343856cb920e4d6f5d20a7ac18d7386673ded6968c945017f5fd TrojanSpy.VBS.KEYLOAD.A\n\n012826db8d41ff4d28e3f312c1e6256f0647bf34249a5a6de7ecac452d32d917 TrojanSpy.VBS.KEYLOAD.A\n\nd36a9f3005c5c24649f80722e43535e57fd96729e827cdd2c080d17c6a53a893 TrojanSpy.VBS.KEYLOAD.A\n\n580ce8b7f5a373d5d7fbfbfef5204d18b8f9407b0c2cbf3bcae808f4d642076a Backdoor.Win32.COROXY.YACEKT\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-09 - Examining the Black Basta Ransomware’s Infection Routine.pdf"
    ],
    "report_names": [
        "2022-05-09 - Examining the Black Basta Ransomware’s Infection Routine.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535928,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653702962,
    "ts_modification_date": 1653702962,
    "files": {
        "pdf": "https://archive.orkl.eu/3777fd6f1ccba2d852f1c42c1bc877e2dcb2770c.pdf",
        "text": "https://archive.orkl.eu/3777fd6f1ccba2d852f1c42c1bc877e2dcb2770c.txt",
        "img": "https://archive.orkl.eu/3777fd6f1ccba2d852f1c42c1bc877e2dcb2770c.jpg"
    }
}