{
    "id": "6753e7a7-1b7a-47c2-bc71-7698c1ed70b2",
    "created_at": "2023-01-12T15:04:22.777639Z",
    "updated_at": "2025-03-27T02:08:41.494244Z",
    "deleted_at": null,
    "sha1_hash": "50cfe634ba662226c153bf3560de322ad972d273",
    "title": "2021-08-09 - Synology warns of malware infecting NAS devices with ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T01:25:40Z",
    "file_modification_date": "2022-05-28T01:25:40Z",
    "file_size": 269740,
    "plain_text": "# Synology warns of malware infecting NAS devices with ransomware\n\n**[bleepingcomputer.com/news/security/synology-warns-of-malware-infecting-nas-devices-with-ransomware/](https://www.bleepingcomputer.com/news/security/synology-warns-of-malware-infecting-nas-devices-with-ransomware/)**\n\nSergiu Gatlan\n\nBy\n[Sergiu Gatlan](https://www.bleepingcomputer.com/author/sergiu-gatlan/)\n\nAugust 9, 2021\n09:12 AM\n0\n\nTaiwan-based NAS maker Synology has warned customers that the StealthWorker botnet is\ntargeting their network-attached storage devices in ongoing brute-force attacks that lead to\nransomware infections.\n\nAccording to Synology's PSIRT (Product Security Incident Response Team), Synology NAS\ndevices compromised in these attacks are later used in further attempts to breach more\nLinux systems.\n\n\"These attacks leverage a number of already infected devices to try and guess common\nadministrative credentials, and if successful, will access the system to install its malicious\n[payload, which may include ransomware,\" Synology said in a security advisory.](https://www.synology.com/en-global/company/news/article/BruteForce/Synology%C2%AE%20Investigates%20Ongoing%20Brute-Force%20Attacks%20From%20Botnet)\n\n\n-----\n\nDevices infected may carry out additional attacks on other Linux based devices, including\nSynology NAS.\"\n\nThe company is coordinating with multiple CERT organizations worldwide to take down the\nbotnet's infrastructure by shutting down all detected command-and-control (C2) servers.\n\nSynology is working on notifying all potentially impacted customers of these ongoing attacks\ntargeting their NAS devices.\n\n## How to defend against these attacks\n\nThe NAS maker urges all system admins and customers to change weak administrative\ncredentials on their systems, to enable account protection and auto block, and to set up\nmulti-factor authentication where possible.\n\nSynology rarely issues security advisories warning of active attacks against its customers.\nThe [last alert regarding ransomware infections following successful large-scale brute-force](https://www.synology.com/en-global/company/news/article/2019JulyRansomware/Synology%C2%AE%20Urges%20All%20Users%20to%20Take%20Immediate%20Action%20to%20Protect%20Data%20from%20Ransomware%20Attack)\nattacks was published in July 2019.\n\nThe company advised users to go through the following checklist to defend their NAS\ndevices against attacks:\n\nUse a complex and strong password, and Apply password strength rules to all\nusers.\nCreate a new account in the administrator group and disable the system default\n\"admin\" account.\nEnable Auto Block in Control Panel to block IP addresses with too many failed login\nattempts.\nRun Security Advisor to make sure there is no weak password in the system.\n\n\"To ensure the security of your Synology NAS, we strongly recommend you enable Firewall\nin Control Panel and only allow public ports for services when necessary, and enable 2-step\nverification to prevent unauthorized login attempts,\" the company added.\n\n\"You may also want to enable Snapshot to keep your NAS immune to encryption-based\nransomware.\"\n\nSynology provides more information on defending your NAS device against ransomware\ninfections [here.](https://www.synology.com/solution/ransomware)\n\n## Brute-force malware targeting Windows and Linux machines\n\nWhile Synology did not share more information regarding the malware using in this\ncampaign, the shared details line up with a Golang-based brute forcer discovered\nby Malwarebytes at the end of February 2019 and dubbed StealthWorker.\n\n\n-----\n\nTwo years ago, StealthWorker was used to compromise e-commerce websites by exploiting\nMagento, phpMyAdmin, and cPanel vulnerabilities to deploy skimmers designed to\nexfiltrate payment and personal information.\n\nHowever, as Malwarebytes noted at the time, the malware also has brute force capabilities\nthat enable it to log into Internet-exposed devices using passwords generated on the spot or\nfrom lists of previously compromised credentials.\n\nStarting with March 2019, StealthWorker operators switched to a brute force-only\napproach scanning the Internet for vulnerable hosts with weak or default credentials.\n\nOnce deployed on a compromised machine, the malware creates scheduled tasks on both\nWindows and Linux to gain persistence and, as Synology, warned deploys second-stage\nmalware payloads, including ransomware.\n\nWhile the NAS maker didn't issue a security advisory, customers reported in January that\n[they had their devices infected with Dovecat Bitcoin cryptojacking malware [1,](https://community.synology.com/enu/forum/1/post/139611) [2] starting with](https://www.synology-forum.de/threads/bitcoin-miner-dovecat-webstation-malware.110837/)\n[November 2020, in a campaign that also targeted QNAP NAS devices.](https://www.bleepingcomputer.com/news/security/qnap-warns-users-to-secure-nas-devices-against-dovecat-malware/)\n\n_Update August 10:A Synology spokesperson sent BleepingComputer the following_\nstatement:\n\nWe originally became aware of this attack at the end of July. Over the 2-3 weeks since\nthen we've received under 50 reports from our customers. Considering the amount of\nSynology devices out there (over 8 million active deployments) we feel the number of\ndevices exposed to this attack is very low. Our team has also noticed a slowdown in\nthese attacks over the last few days.\n\nAt this point, we're still actively investigating this malware attack and the scripts\nused. Currently, we believe the botnet engages in brute-forcing the \"admin\" account\nusing common password combinations. At this time we have not seen the malware try\nto target any other user accounts.\n\nAs mentioned previously our customers first reported this attack at the end of July.\nWe've since sent a notice to affected customers and sent an additional notice to all\nSynology users advising them of our best practices and tips on how to secure their\nNAS.\n\n### Related Articles:\n\n[QNAP warns of ransomware targeting Internet-exposed NAS devices](https://www.bleepingcomputer.com/news/security/qnap-warns-of-ransomware-targeting-internet-exposed-nas-devices/)\n\n[Microsoft detects massive surge in Linux XorDDoS malware activity](https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/)\n\n[QNAP alerts NAS customers of new DeadBolt ransomware attacks](https://www.bleepingcomputer.com/news/security/qnap-alerts-nas-customers-of-new-deadbolt-ransomware-attacks/)\n\n\n-----\n\n[Microsoft: Sysrv botnet targets Windows, Linux servers with new exploits](https://www.bleepingcomputer.com/news/security/microsoft-sysrv-botnet-targets-windows-linux-servers-with-new-exploits/)\n\n[New cryptomining malware builds an army of Windows, Linux bots](https://www.bleepingcomputer.com/news/security/new-cryptomining-malware-builds-an-army-of-windows-linux-bots/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-09 - Synology warns of malware infecting NAS devices with ransomware.pdf"
    ],
    "report_names": [
        "2021-08-09 - Synology warns of malware infecting NAS devices with ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535862,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653701140,
    "ts_modification_date": 1653701140,
    "files": {
        "pdf": "https://archive.orkl.eu/50cfe634ba662226c153bf3560de322ad972d273.pdf",
        "text": "https://archive.orkl.eu/50cfe634ba662226c153bf3560de322ad972d273.txt",
        "img": "https://archive.orkl.eu/50cfe634ba662226c153bf3560de322ad972d273.jpg"
    }
}