{
    "id": "67711fa1-5e8a-4edb-89a4-21ed1a090de6",
    "created_at": "2023-01-12T14:58:49.658162Z",
    "updated_at": "2025-03-27T02:09:18.080254Z",
    "deleted_at": null,
    "sha1_hash": "b458cd180a28c291c67679b635dd798ca1a83804",
    "title": "2020-06-23 - Sodinokibi- Ransomware Attackers also Scanning for PoS Software, Leveraging Cobalt Strike",
    "authors": "",
    "file_creation_date": "2022-05-28T22:05:11Z",
    "file_modification_date": "2022-05-28T22:05:11Z",
    "file_size": 300323,
    "plain_text": "# Sodinokibi: Ransomware Attackers also Scanning for PoS Software, Leveraging Cobalt Strike\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/sodinokibi-ransomware-cobalt-strike-pos](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/sodinokibi-ransomware-cobalt-strike-pos)**\n\nThreat Hunter TeamSymantec\n\nResearchers at Symantec, a division of Broadcom (NASDAQ: AVGO), have spotted a\nSodinokibi targeted ransomware campaign in which the attackers are also scanning the\nnetworks of some victims for credit card or point of sale (PoS) software.\n\nIt is not clear if the attackers are targeting this software for encryption or because they want\nto scrape this information as a way to make even more money from this attack.\n\nThe attackers are using the Cobalt Strike commodity malware to deliver the Sodinokibi\ntargeted ransomware to victims. Eight organizations had the Cobalt Strike commodity\nmalware on their systems, with three of the victims subsequently infected with the Sodinokibi\nransomware. The victims infected with Sodinokibi were in the services, food, and healthcare\n\n\n-----\n\nsectors. The companies targeted in this campaign were primarily large, even multinational,\ncompanies, which were likely targeted because the attackers believed they would be willing\nto pay a large ransom to recover access to their systems.\n\nThe attackers are aiming to make a lot of money - for victims infected with Sodinokibi the\nransom requested is $50,000 in the Monero cryptocurrency if paid within the first three hours,\nand $100,000 after that.\n\n## Tactics, tools, and procedures\n\nThe attackers leverage legitimate tools in these attacks, and at one point we observed a\nlegitimate remote admin client tool by NetSupport Ltd being used to install components\nduring these attacks. In April, Symantec threat researchers found evidence of Sodinokibi\nattackers using similar tactics, when they spotted them using a copy of the AnyDesk remote\naccess tool to deliver malware and other tools in at least two attacks.\n\nThe attackers in this campaign also use ‘legitimate’ infrastructure to store their payload and\nfor their command and control (C&C) server. The attackers are using code-hosting service\nPastebin to host their payload (the Cobalt Strike malware and Sodinokibi) and are using\nAmazon’s CloudFront service for their C&C infrastructure, to communicate with victim\nmachines.\n\nPastebin and CloudFront are both legitimate services but have been observed being\nexploited by bad actors for similar malicious activity in the past. The advantage for malicious\nactors of using legitimate services to host payloads and for their C&C infrastructure is that\ntraffic to and from a legitimate service is more likely to blend in with an organization’s\nlegitimate traffic, and so is less likely to be flagged as suspicious and blocked.\n\nCobalt Strike is an off-the-shelf tool that can be used to load shellcode onto victim machines;\nit has legitimate uses as a penetration testing tool but is frequently exploited by malicious\nactors. The tactics used in this series of attacks are similar to tactics seen used in other\n[targeted ransomware attacks before. Microsoft released research in April into attacks by six](https://www.microsoft.com/security/blog/2020/04/28/ransomware-groups-continue-to-target-healthcare-critical-services-heres-how-to-reduce-risk/)\nransomware gangs, including Sodinokibi, and said that many of the groups employ similar\ntactics. The vector for most attacks observed by Microsoft was either the exploitation of\nvulnerable network devices or brute-force attacks on Remote Desktop Protocol (RDP)\nservers, and initial intrusion was followed by the use of living-off-the-land and commodity\ntools to perform credential theft and lateral movement before deploying the ransomware\npayload on multiple computers. So the tactics employed in this attack campaign are tactics\ncommonly used by targeted ransomware gangs.\n\nOnce on a network, the attackers take various steps to reduce the chance they will be\ndetected and to increase the chances of their attack working. The attackers attempt to\ndisable any security software on the machine so their activity can’t be detected. They also\nenable remote desktop connections so they can use them to launch malicious commands.\n\n\n-----\n\nThe attackers also appear to be interested in stealing credentials on victim machines, and\nare observed adding user accounts, presumably in an attempt to maintain persistence on\nvictim machines and also in a further attempt to keep a low profile on victim networks.\n\nWe see the attackers using encoded PowerShell commands in some of these attacks.\nPowerShell is a Windows command line tool that has many legitimate purposes but is also\nfrequently abused for nefarious purposes by malicious actors using living-off-the-land tactics.\n\nWe see the Sodinokibi ransomware deployed on three of the victims that were infected with\nCobalt Strike.\n\n## Sodinokibi\n\nSodinokibi is a targeted ransomware - we saw targeted ransomware attacks increase by 62\npercent in 2019, and targeted ransomware is one of the biggest threats on the cyber security\nlandscape currently.\n\nSodinokibi (aka REvil) first appeared in April 2019, but the actors behind it are widely\nbelieved to be the same actors who operated the GandCrab ransomware. GandCrab was a\nhighly active targeted ransomware that first appeared in 2018. However, in June 2019 its\noperators [announced that they were ‘retiring’, claiming that they had made more than $2](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/)\nbillion from the ransomware. However, it’s widely thought that they simply turned their focus\nto the Sodinokibi ransomware instead.\n\nSodinokibi was originally believed to be operated by one group but it is now thought to\noperate as a ransomware-as-a-service (RaaS), where one group maintains the code and\nrents it out to other groups, known as affiliates, who carry out attacks and spread the\nransomware. Any profits made are then split between the affiliates and the original gang.\n\nSince it appeared on the scene, Sodinokibi has been one of the most prolific targeted\nransomware strains and has been seen in numerous high-profile incidents. Actors using\n[Sodinokibi were apparently responsible for the hack of foreign exchange service Travelex on](https://www.reuters.com/article/us-britain-travelex/travelex-says-uk-money-transfer-and-wire-services-back-online-after-hack-idUSKBN1ZR1S5)\nNew Year’s Eve. The attack left the company offline for almost a month and caused huge\ndisruption to its business, according to public reports. The attackers were said to have\ndemanded a ransom of $6 million in that incident, with Travelex reportedly eventually paying\n$2.3 million to regain access to its systems. In January, it was reported that Sodinokibi’s\n[average ransom demand was $260,000, so this was a huge ransom.](https://www.zdnet.com/article/the-average-ransom-demand-for-a-revil-ransomware-infection-is-a-whopping-260000/)\n\nSodinokibi hit several other high-profile companies in the last year and, similar to the Maze\nransomware group, announced in December 2019 that it would release data stolen from\nvictims if its ransom demands weren’t met. Since that announcement, the gang has been\nobserved offering the data of victims for sale on hacking forums, and at the beginning of\n[June an auction site was launched where the group said it will sell off stolen data to the](https://www.zdnet.com/article/revil-ransomware-gang-launches-auction-site-to-sell-stolen-data/)\nhighest bidder.\n\n\n-----\n\n## Victims\n\nThe three victims that were infected with Sodinokibi in this campaign were in the services,\nfood, and healthcare sectors. The food and the services companies that were infected were\nboth large, multi-site organizations that were likely capable of paying a large ransom - the\ntype of company that would typically be targeted with Sodinokibi. However, the healthcare\norganization appears to have been a smaller operation. Interestingly, this victim’s systems\nwere also scanned by the attackers for PoS software. It may be that the attackers realized\nthis business might not be in a position to pay the large ransoms usually demanded in a\nSodinokibi attack, and so scanned for PoS software to determine if they could profit from the\ncompromise in another way, or they may have been scanning for this kind of software simply\nto encrypt it too.\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to\ninvestigate targeted attacks, drive enhanced protection in Symantec products, and offer\nanalysis that helps customers respond to attacks.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-23 - Sodinokibi- Ransomware Attackers also Scanning for PoS Software, Leveraging Cobalt Strike.pdf"
    ],
    "report_names": [
        "2020-06-23 - Sodinokibi- Ransomware Attackers also Scanning for PoS Software, Leveraging Cobalt Strike.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535529,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653775511,
    "ts_modification_date": 1653775511,
    "files": {
        "pdf": "https://archive.orkl.eu/b458cd180a28c291c67679b635dd798ca1a83804.pdf",
        "text": "https://archive.orkl.eu/b458cd180a28c291c67679b635dd798ca1a83804.txt",
        "img": "https://archive.orkl.eu/b458cd180a28c291c67679b635dd798ca1a83804.jpg"
    }
}