{
    "id": "67cfabe8-7098-465b-8f5d-95191d848d14",
    "created_at": "2024-10-25T02:06:06.52831Z",
    "updated_at": "2025-03-27T02:13:34.802772Z",
    "deleted_at": null,
    "sha1_hash": "1a5cfc3b33cbc2fe561bae4f41e5b6eb21e33cbc",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-09-18T08:35:13Z",
    "file_modification_date": "2024-09-18T08:35:13Z",
    "file_size": 542831,
    "plain_text": "_Co-Authored by:_ Product ID: JCSA-20240918-001\n\n\nSeptember 18, 2024\n\n# People’s Republic of China-Linked Actors Compromise Routers and IoT Devices for Botnet Operations\n\n## Summary\n\nThe Federal Bureau of Investigation (FBI), Cyber National Mission Force (CNMF), and National Security\nAgency (NSA) assess that People’s Republic of China (PRC)-linked cyber actors have compromised\nthousands of Internet-connected devices, including small office/home office (SOHO) routers, firewalls,\nnetwork-attached storage (NAS) and Internet of Things (IoT) devices with the goal of creating a network of\ncompromised nodes (a “botnet”) positioned for malicious activity. The actors may then use the botnet as a\nproxy to conceal their identities while deploying distributed denial of service (DDoS) attacks or\ncompromising targeted U.S. networks.\n\nIntegrity Technology Group (Integrity Tech), a PRC-based company, has controlled and managed a botnet\nactive since mid-2021. The botnet has regularly maintained between tens to hundreds of thousands of\ncompromised devices. As of June 2024, the botnet consisted of over 260,000 devices. Victim devices\nwhich are part of the botnet have been observed in North America, South America, Europe, Africa,\nSoutheast Asia and Australia.\n\nWhile devices aged beyond their end-of-life dates are known to be more vulnerable to intrusion, many of the\ncompromised devices in the Integrity Tech-controlled botnet are likely still supported by their respective vendors.\n\nFBI, CNMF, NSA, and allied partners are releasing this Joint Cyber Security Advisory to highlight the threat\nposed by these actors and their botnet activity and to encourage exposed device vendors, owners, and\noperators to update and secure their devices from being compromised and joining the botnet. Network\ndefenders are advised to follow the guidance in the mitigations section to protect against the PRC-linked\ncyber actors’ botnet activity. Cyber security companies can also leverage the information in this advisory to\nassist with identifying malicious activity and reducing the number of devices present in botnets worldwide.\n\nFor additional information, see U.S. Department of Justice (DOJ) press release.\n\n_To report suspicious or criminal activity related to information found in this joint Cybersecurity Advisory, contact_\n_[your local FBI field office. When available, please include the following information regarding the incident: date,](https://www.fbi.gov/contact-us/field-offices)_\n_time, and location of the incident; type of activity; number of people affected; type of equipment used for the_\n_activity; the name of the submitting company or organization; and a designated point of contact._\n\n_This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information_\n_carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public_\n_release. Subject to standard copyright rules, TLP:CLEAR information may be distributed without restriction. For_\n\n\n-----\n\n**TLP:CLEAR**\n\n## Technical Details\n\n### Attribution\n\nIntegrity Tech is a company based in the PRC with links to the PRC government. Integrity Tech has used\nChina Unicom Beijing Province Network IP addresses to control and manage the botnet described in this\nadvisory.\n\nIn addition to managing the botnet, these same China Unicom Beijing Province Network IP addresses were\nused to access other operational infrastructure employed in computer intrusion activities against U.S.\nvictims. FBI has engaged with multiple U.S. victims of these computer intrusions and found activity\nconsistent with the tactics, techniques, and infrastructure associated with the cyber threat group known\npublicly as Flax Typhoon, RedJuliett, and Ethereal Panda.\n\nNote: Cybersecurity companies have different methods of tracking and attributing cyber actors, and these\nmay not be a 1:1 correlation to the U.S. Government’s methodology and understanding for all activity\nrelated to these groupings.\n\n### Botnet Command and Control\n\nAs with similar botnets, this botnet infrastructure is comprised of a network of devices, known as “bots,”\nwhich are infected with a type of malware that provides threat actors with unauthorized remote access. A\nfunctioning botnet can be used for a variety of purposes, including malware delivery, distributed denial of\nservice (DDoS) attacks, or routing nefarious Internet traffic.\n\nThe botnet uses the Mirai family of malware, designed to hijack IoT devices such as webcams, DVRs, IP\ncameras, and routers running Linux-based operating systems. The Mirai source code was posted publicly\non the Internet in 2016, resulting in other hackers creating their own botnets based on the malware. Since\nthat time, various Mirai botnets have been used to conduct DDoS and other malicious activities against\nvictim entities within the U.S.\n\nThe investigated botnet’s customized Mirai malware is a component of a system that automates the\ncompromise of a variety of devices. To recruit a new “bot,” the botnet system first compromises an\nInternet-connected device using one of a variety of known vulnerability exploits (see Appendix B: Observed\nCVEs). Post-compromise, the victim device executes a Mirai-based malware payload from a remote server.\nOnce executed, the payload starts processes on the device to establish a connection with a command-andcontrol (C2) server using Transport Layer Security (TLS) on port 443. The processes gather system\ninformation from the infected device, including but not limited to the operating system version and\nprocessor, memory and bandwidth details to send to the C2 server for enumeration purposes. The malware\nalso makes requests to “c.speedtest.net,” likely to gather additional Internet connection details. Some\nmalware payloads were self-deleting to evade detection.\n\nA variety of subdomains of “w8510.com” were linked to the botnet’s C2 servers. As of September 2024,\ninvestigators identified over 80 subdomains associated with w8510.com (see Appendix A: Indicators of\nCompromise).\n\n\n-----\n\n**TLP:CLEAR**\n\n### Botnet Management\n\nA tier of upstream management servers using TCP port 34125 manage the botnet’s C2 servers. These\nmanagement servers host a MySQL database which stored information used for the control of the botnet.\nAs of June 2024, this database contained over 1.2 million records of compromised devices, including over\n385,000 unique U.S. victim devices, both previously and actively exploited.\n\nThe management servers hosted an application known as “Sparrow,” which allows users to interact with\nthe botnet. The actors used specific IP addresses registered to China Unicom Beijing Province Network to\naccess this application, including the same IP addresses previously used by Flax Typhoon to access the\nsystems used in computer intrusion activities against U.S.-based victims.\n\nThe code for the Sparrow application, stored within a Git repository, defines functions that allow registered\nusers to manage and control the botnet and C2 servers, sending tasks to victim devices including DDoS\nand exploitation commands to grow the botnet. Sparrow also contains functionality providing device\nvulnerability information to users. A subcomponent called “vulnerability arsenal” also allows users to\nexploit traditional computer networks through the victim devices in the botnet.\n\n### Compromised Device Distribution\n\nThe following tables approximate the count of devices compromised by the botnet system as of June 2024,\nby location and by processor architecture. There were at least 50 different Linux operating system versions\nfound among botnet nodes. Based on the operating system versions of the nodes, infected systems\ninclude devices that ceased receiving support as early as 2016 to devices that are currently supported.\nAffected devices were running Linux kernel versions 2.6 through 5.4.\n\n\n-----\n\n**TLP:CLEAR**\n\n\n_Table 1: Botnet devices per country_\n\nNode Count Percentage\n126,000 47.9%\n21,100 8.0%\n18,900 7.2%\n9,600 3.7%\n9,400 3.6%\n9,200 3.5%\n9,000 3.4%\nUnited Kingdom 8,500 3.2%\n5,800 2.2%\n5,600 2.1%\n4,100 1.6%\n4,000 1.5%\n3,300 1.3%\n2,800 1.1%\n2,700 1.0%\n2,600 1.0%\n2,400 0.9%\n2,100 0.8%\n2,000 0.8%\n\n_Table 2: Botnet devices per continent_\n\nNode Count Percentage\n135,300 51.3%\n65,600 24.9%\n50,400 19.1%\n9,200 3.5%\n2,400 0.9%\n800 0.3%\n\n_Table 3: Botnet devices by processor architecture_\n\n|Country|Node Count|Percentage|\n|---|---|---|\n|United States|126,000|47.9%|\n|Vietnam|21,100|8.0%|\n|Germany|18,900|7.2%|\n|Romania|9,600|3.7%|\n|Hong Kong|9,400|3.6%|\n|Canada|9,200|3.5%|\n|South Africa|9,000|3.4%|\n|United Kingdom|8,500|3.2%|\n|India|5,800|2.2%|\n|France|5,600|2.1%|\n|Bangladesh|4,100|1.6%|\n|Italy|4,000|1.5%|\n|Lithuania|3,300|1.3%|\n|Albania|2,800|1.1%|\n|Netherlands|2,700|1.0%|\n|China|2,600|1.0%|\n|Australia|2,400|0.9%|\n|Poland|2,100|0.8%|\n|Spain|2,000|0.8%|\n\n|Continent|Node Count|Percentage|\n|---|---|---|\n|North America|135,300|51.3%|\n|Europe|65,600|24.9%|\n|Asia|50,400|19.1%|\n|Africa|9,200|3.5%|\n|Oceania|2,400|0.9%|\n|South America|800|0.3%|\n\n|Processor Architecture|Node Count|Percentage|\n|---|---|---|\n|x86|236,000|89.2%|\n|MIPS|21,400|8.1%|\n|ARM|3,900|1.5%|\n|x86_64|1,900|0.7%|\n|MIPSEL|1,400|0.5%|\n\n\n-----\n\n_Figure 1: Exploited processor architectures chart_\n\n## Recommended Mitigations\n\nThe FBI recommends network defenders take the following actions to mitigate threats posed by\nadversaries attempting to use botnets for malicious cyber activity. The following guidance applies both to\npreventing IoT devices from becoming part of a botnet, as well as to defending networks from botnets\nalready in operation.\n\n  - Disable unused services and ports such as automatic configuration, remote access or file sharing\nprotocols. Routers and IoT devices may provide features such as Universal Plug and Play (UPnP),\nremote management options, and file sharing services, which threat actors may abuse to gain\ninitial access or to spread malware to other networked devices. Disable these features if not\nneeded.\n\n  - Implement network segmentation to ensure IoT devices within a larger network pose known,\nlimited, and tolerable risks. Use the principle of least privilege to provide devices with just enough\nconnectivity needed to perform their intended function.\n\n  - Monitor for high network traffic volume. Since DDoS attacks originating from botnets may at first\nappear similar to normal traffic, it is critical for organizations to define, monitor and prepare for\nabnormal traffic volumes. Monitoring is possible via firewalls or intrusion detection systems. Some\nnetwork solutions such as proxies may mitigate DDoS incidents.\n\n  - Apply patches and updates, including software and firmware updates. Regular patching mitigates\nmany high-risk security vulnerabilities. If available, take advantage of automatic update channels\nfrom trusted network locations. Do not trust email messages claiming to provide software updates\nas attachments or via links to untrusted websites.\n\n  - Replace default passwords with strong passwords. Many IoT products implement a device\nadministration password in addition to other account passwords. Ensure all passwords are\nchanged from their defaults, using a strong password policy. If possible, disable password hints.\n\n  - Plan for device reboots. Rebooting a device terminates all running processes, which may remove\n\n\n-----\n\n**TLP:CLEAR**\n\nspecific types of malware, such as “fileless” malware that runs in the host’s memory. As a reboot\nmay disrupt legitimate activity, users may need to prepare for service interruptions. Some devices\nprovide scheduled reboot features, enabling reboots to occur at preferred times. If a compromised\ndevice fails to respond to reboot commands issued remotely, reboot physically.\n\n   - Replace end-of-life equipment with devices that remain in respective vendor support plans.\n\n## Disclaimer\n\nThe information in this report is being provided “as is” for informational purposes only. The authoring\norganizations do not endorse any commercial entity, product, company, or service, including any entities,\nproducts, or services linked within this document. Any reference to specific commercial entities, products,\nprocesses, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or\nimply endorsement, recommendation, or favoring by the authoring organizations.\n\n## Version History\n\nSeptember 18, 2024: Initial version.\n\n\n-----\n\n**TLP:CLEAR**\n\n## Appendix A: Indicators of Compromise\n\n#### The following listed domain names were observed subdomains of “w8510.com,” the observed command and control system domain.\n\n_Table 4: List of w8510.com subdomains_\n\n|Domain|IP Address|Last Seen|\n|---|---|---|\n|acqv.w8510.com|208.85.16.100|8/29/2024|\n|aewreiuicajo.w8510.com|45.77.231.209|9/1/2024|\n|apdfhhjcxcb.w8510.com|139.180.137.219|8/31/2024|\n|asdvxzzxvza.w8510.com|45.135.117.131|9/3/2024|\n|awbpxtpi.w8510.com|155.138.151.225|9/3/2024|\n|bzbatflwb.w8510.com|45.77.231.209|9/3/2024|\n|cansqra.w8510.com|222.186.48.201|8/22/2023|\n|canwtrow.w8510.com|222.186.48.204|10/7/2023|\n|cccasdqawer.w8510.com|92.38.185.45|9/3/2024|\n|ccccasdasdq.w8510.com|85.90.216.115|9/3/2024|\n|cccvbsdfsdf.w8510.com|195.234.62.197|9/3/2024|\n|ccmmkmnkna.w8510.com|85.90.216.69|9/3/2024|\n|cpooooim.w8510.com|85.90.216.110|9/3/2024|\n|dftiscasdwe.w8510.com|207.148.122.69|9/2/2024|\n|dvasrdftqgqg.w8510.com|45.10.58.129|9/3/2024|\n|iiiiopasdfcasd.w8510.com|92.38.185.46|9/3/2024|\n|iikljhg.w8510.com|85.90.216.116|9/3/2024|\n|iuyrdfvv.w8510.com|45.10.58.133|9/3/2024|\n|iyasdasfda.w8510.com|195.234.62.184|9/1/2024|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|\n|---|---|---|\n|kliscjaisdjhi.w8510.com|149.248.51.22|9/4/2024|\n|lkljjhidjaiwd.w8510.com|37.61.229.15|9/3/2024|\n|lkopiyut.w8510.com|5.181.27.219|9/3/2024|\n|lyblqwesfawe.w8510.com|78.141.238.97|8/28/2024|\n|mjiudwajhkf.w8510.com|45.77.231.209|9/3/2024|\n|mmjkjiu.w8510.com|92.38.185.43|9/3/2024|\n|mmnajsdh.w8510.com|37.9.35.91|9/1/2024|\n|mnbghjj.w8510.com|45.92.70.71|9/2/2024|\n|ocmnusdjdik.w8510.com|139.180.137.219|9/2/2024|\n|oiuiasdads.w8510.com|195.234.62.188|9/3/2024|\n|plllkkoasdko.w8510.com|195.234.62.198|9/3/2024|\n|poiaqqrjk.w8510.com|195.234.62.192|9/3/2024|\n|pojkkaka.w8510.com|45.10.58.130|9/3/2024|\n|poooooiioasd.w8510.com|37.61.229.17|9/3/2024|\n|ppppoiiua.w8510.com|92.38.185.44|9/3/2024|\n|qacassdfawemp.w8510.com|155.138.133.56|9/4/2024|\n|qmmklou.w8510.com|45.92.70.68|9/3/2024|\n|qwertdvvaaz.w8510.com|45.135.117.136|9/3/2024|\n|ssacawfafwa.w8510.com|45.10.58.132|9/3/2024|\n|testate.w8510.com|207.148.68.131|8/30/2024|\n|testateone.w8510.com|108.61.177.81|9/3/2024|\n|tuisasdcxzd.w8510.com|78.141.238.97|8/29/2024|\n|uqooapp.w8510.com|85.90.216.112|9/3/2024|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|\n|---|---|---|\n|uuiyiyasd.w8510.com|92.38.185.47|9/3/2024|\n|wmllxwkg.w8510.com|45.77.231.209|9/3/2024|\n|zasdfgasd.w8510.com|65.20.97.251|9/3/2024|\n|zda4g4.w8510.com|91.216.190.154|9/3/2024|\n|zda896.w8510.com|45.13.199.152|9/3/2024|\n|zda9ol.w8510.com|91.216.190.247|9/3/2024|\n|zdaaac.w8510.com|5.181.27.6|9/1/2024|\n|zdaasdafq.w8510.com|45.80.215.156|9/3/2024|\n|zdabnv.w8510.com|23.236.68.161|9/3/2024|\n|zdacasc.w8510.com|45.80.215.150|9/2/2024|\n|zdacasdc.w8510.com|195.234.62.19|9/3/2024|\n|zdacawca.w8510.com|45.13.199.84|8/28/2024|\n|zdacccz.w8510.com|5.181.27.21|8/23/2024|\n|zdacppao.w8510.com|45.13.199.140|9/2/2024|\n|zdacscswc.w8510.com|89.44.198.195|8/30/2024|\n|zdacvb.w8510.com|23.236.69.110|9/3/2024|\n|zdacvbzzs.w8510.com|45.13.199.104|9/3/2024|\n|zdacwaca.w8510.com|45.80.215.153|9/2/2024|\n|zdacwrf.w8510.com|45.92.70.111|9/1/2024|\n|zdacx46.w8510.com|23.236.68.213|8/24/2024|\n|zdacxdawdas.w8510.com|45.13.199.45|8/28/2024|\n|zdacxzd.w8510.com|89.44.198.200|9/2/2024|\n|zdaczcaaw.w8510.com|45.80.215.151|8/30/2024|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|\n|---|---|---|\n|zdaczcvs1.w8510.com|92.38.176.156|7/22/2024|\n|zdaczsc.w8510.com|45.92.70.113|8/13/2024|\n|zdaczvs.w8510.com|45.80.215.149|9/2/2024|\n|zdaczxc1.w8510.com|23.236.68.193|9/4/2024|\n|zdafaa.w8510.com|91.216.190.74|9/3/2024|\n|zdamkl.w8510.com|5.181.27.19|9/2/2024|\n|zdaplm.w8510.com|45.92.70.115|8/28/2024|\n|zdapoi.w8510.com|45.80.215.152|9/2/2024|\n|zdapoq.w8510.com|45.13.199.96|9/2/2024|\n|zdaqggh.w8510.com|23.236.69.82|9/1/2024|\n|zdaqwfasf.w8510.com|45.92.70.112|8/31/2024|\n|zdavva.w8510.com|195.234.62.18|8/27/2024|\n|zdaxcxzc.w8510.com|91.216.190.80|9/2/2024|\n|zdazzz.w8510.com|45.13.199.207|8/29/2024|\n|zdcacaw.w8510.com|45.80.215.155|8/31/2024|\n|zdcawca.w8510.com|45.80.215.154|8/25/2024|\n|zdpoa.w8510.com|89.44.198.254|9/3/2024|\n|zdpog.w8510.com|45.80.215.47|9/3/2024|\n|zdqqqqwe.w8510.com|91.216.190.2|9/2/2024|\n|zdzvbs.w8510.com|23.236.68.229|9/3/2024|\n|zzxnjiq.w8510.com|85.90.216.111|9/3/2024|\n|zzzcmsq.w8510.com|5.45.184.68|9/2/2024|\n\n\n-----\n\n**TLP:CLEAR**\n\n## Appendix B: Observed CVEs\n\nIntegrity Tech relied on the following vulnerabilities to acquire new botnet victims and allow botnet users to\nexploit further victims through the compromised botnet devices.\n\n_Table 5: CVEs exploited to add devices to botnet and exploit further victims_\n\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|---|---|---|---|---|\n|CVE-2024- 5217|ServiceNow|Now Platform|Washington DC, Vancouver, and earlier Now Platform releases|RCE|\n|CVE-2024- 4577|PHP Group|PHP|PHP versions 8.1.* before 8.1.29, 8.2.* before 8.2.20, 8.3.* before 8.3.8, when using Apache and PHP-CGI on Windows|OS command injection|\n|CVE-2024- 29973|Zyxel|NAS326 NAS542|NAS326 firmware versions before V5.21(AAZF.17)C0 and NAS542 firmware versions before V5.21(ABAG.14)C0|OS command injection|\n|CVE-2024- 29269|Telesquare|TLR-2005Ksh|1.0.0 and 1.1.4|Arbitrary system commands|\n|CVE-2024- 21762|Fortinet|FortiOS|FortiOS 7.4.0 through 7.4.2, 7.2.0 through 7.2.6, 7.0.0 through 7.0.13, 6.4.0 through 6.4.14, 6.2.0 through 6.2.15, 6.0.0 through 6.0.17,|RCE|\n|||FortiProxy|FortiProxy versions 7.4.0 through 7.4.2, 7.2.0 through 7.2.8, 7.0.0 through 7.0.14, 2.0.0 through 2.0.13, 1.2.0 through 1.2.13, 1.1.0 through 1.1.6, 1.0.0 through 1.0.7||\n|CVE-2023- 50386|Apache|Solr|6.0.0 through 8.11.2, 9.0.0 before 9.4.1|Unrestricted file upload|\n|CVE-2023- 47218|QNAP|QTS QuTS hero QuTScloud|QTS 5.1.x before 5.1.5.2645 build 20240116, QuTS hero h5.1.x before h5.1.5.2647 build 20240118, QuTScloud c5.x before c5.1.5.2651|OS command injection|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2023- 46747|F5|F5 Big-IP|Big-IP (all modules) 17.1.0- 17.1., 16.1.0-16.1.4, 15.1.0- 15.1.10, 14.1.0- 14.1.5,13.1.0-13.1.5|Authentication bypass|\n|CVE-2023- 46604|Apache|Apache ActiveMQ|Before 5.15.16, 5.16.7, 5.17.6, or 5.18.3|RCE|\n|CVE-2023- 43478|Telstra|Smart Modem Gen 2|Firmware versions before 0.18.15r|Code execution as root|\n|CVE-2023- 4166|Tongda OA|Tongda2000|11.10|SQL injection|\n|CVE-2023- 38646|Metabase|Metabase and Metabase Enterprise|Metabase before 0.46.6.1, Metabase Enterprise before 1.46.6.1|Arbitrary command execution|\n|CVE-2023- 3852|OpenRapid|Yuque RapidCMS|Up to version 1.3.1|Arbitrary file upload|\n|CVE-2023- 38035|Ivanti|MobileIron Sentry (MICS Admin Portal)|9.18.0 and below|Authentication bypass|\n|CVE-2023- 37582|Apache|RocketMQ|5.1.1|Remote command execution|\n|CVE-2023- 36844|Juniper|Juniper Junos|20.4, 21.1, 21.2, 21.3, 21.4, 22.1, 22.2, 22.3, 22.4|PHP external variable modification|\n|CVE-2023- 36542|Apache|Apache NiFi|0.0.2 through 1.22.0|Code injection|\n|CVE-2023- 35885|CloudPanel|CloudPanel 2|Before 2.3.1|Insecure file-manager cookie authentication|\n|CVE-2023- 35843|NocoDB|NocoDB|Through 0.106.0 (or 0.109.1)|Path traversal|\n|CVE-2023- 3519|Citrix|Netscaler Gateway, Application Delivery Controller (ADC)|12.1-NDcPP before 55.297, 12.1-FIPS before 55.297, 13.1-FIPS before 37.159, 13.0 before 91.13, 13.1 before 49.13|Unauthenticated remote code execution|\n|CVE-2023- 35081|Ivanti|Endpoint Manager Mobile (EPMM)|11.10x<11.10.0.3, 11.9x<11.91.2, and 11.8<11.8.12|Path traversal|\n|CVE-2023- 34960|Chamilo|Chamilo|v1.11.* up to v1.11.18|Command injection|\n|CVE-2023- 34598|Gibbonedu|Gibbon|25.0.00|Local File Inclusion (LFI) vulnerability|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2023- 3368|Chamilo|Chamilo LMS|<= v1.11.20|Command injection leading to remote code execution (RCE) Bypass of CVE-2023- 34960|\n|CVE-2023- 33510|WordPress|Jeecg P3 Bix Chat|Jeecg P3 Biz Chat Project Jeecg P3 Biz Chat 1.0.5|Allows remote attackers to read arbitrary files|\n|CVE-2023- 30799|MikroTik|MikroTik RouterOS|Stable before 6.49.7 and long-term through 6.48.6|Privilege escalation|\n|CVE-2023- 28771|Zyxel|ZyWALL/USG series|ZyWALL/USG ZLD 4.60 to 4.73, VPN ZLD 4.60 to 5.35, USG FLEX ZLD 4.60 to 5.35, ATP ZLD 4.60 to 5.35|OS command injection|\n|CVE-2023- 28365|Ubiquiti|UI UniFi|7.3.83 and earlier|Backup file vulnerability|\n|CVE-2023- 27997|Fortinet|FortiOS|FortiOS version 7.2.4 and below, version 7.0.11 and below, version 6.4.12 and below, version 6.0.16 and below|Buffer overflow|\n|||FortiProxy|FortiProxy 7.2.3 and below, 7.0.9 and below, 2.0.12 and below, 1.2 all versions, 1.1 all versions||\n|CVE-2023- 27524|Apache|Apache Superset|Versions up to and including 2.0.1.|Authenticate and access unauthorized resources|\n|CVE-2023- 26469|Jorani|Jorani|1.0.0|Path traversal to RCE|\n|CVE-2023- 25690|Apache|Apache HTTP Server|2.4.0 through 2.4.55|HTTP request smuggling|\n|CVE-2023- 24229|DrayTek|Vigor2960|Firmware v1.5.1.4 No longer supported by maintainer|Command injection|\n|CVE-2023- 23333|Contec|SolarView Compact|Firmware through 6.00|Command injection|\n|CVE-2023- 22527|Confluence|Data Center and Server|< 8.5.5 (LTS) < 8.7.2 (Data Center Only)|Template injection leading to RCE|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2023- 22515|Confluence|Data Center and Server|>=8.0.0, >= 8.1.0, >=8.2.0, >=8.30 to <8.3.3, >=8.4.0 to <8.4.3, >=8.5.0 to <8.5.2|Privilege escalation|\n|CVE-2022- 42475|Fortinet|FortiOS|FortiOS SSL-VPN 7.2.0 through 7.22, 7.00 through 7.0.8, 6.4.0 through 6.4.10, 6.2.0 through 6.211, 6.0.15 and earlier|Buffer overflow|\n|||FortiProxy|FortiProxy SSL VPN 7.2.0 through 7.2.1, 7.0.7 and earlier.||\n|CVE-2022- 40881|Contec|SolarView Compact|Firmware 6.00|Command injection|\n|CVE-2022- 3590|WordPress|WordPress|WordPress 4.1|Unauthenticated blind SSRF in the pingback feature|\n|CVE-2022- 31814|Netgate|pfSense pfBlockerNG|Through 2.1.4_26|OS command injection|\n|CVE-2022- 30525|Zyxel|USG FLEX, ATP, and VPN series firmware|USG FLEX 100(W)/200/500/700 ZLD 5.00 through 5.21 Patch 1, USG FLEX 50(W)/USG20(W)- VPN ZLD 5.10 through 5.21 Patch 1, ATP series ZLD 5.10 through 5.21 Patch 1, VPN series ZLD 4.60 through 5.21 Patch 1|OS command injection|\n|CVE-2022- 26134|Atlassian|Confluence Data Center|7.18.0|OGNL Injection|\n|||Confluence server|||\n|CVE-2022- 20707|Cisco|Small Business Series Routers|RV160, RV260, RV340, and RV345|RCE|\n\n\n-----\n\n**TLP:CLEAR**\n\n\nAuthentication bypass\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2022- 1388|F5|BIG-IP|16.1.x versions prior to 16.1.2.2, 15.1.x versions prior to 15.1.5.1, 14.1.x versions prior to 14.1.4.6, 13.1.x versions prior to 13.1.5, all 12.1.x and 11.6.x versions|Authentication bypass|\n|CVE-2021- 46422|Telesquare|SDT-CW3B1|1.1.0|OS command injection|\n|CVE-2021- 45511|NETGEAR|NETGEAR|AC2100 before 2021-08-27, AC2400 before 2021-08-27, AC2600 before 2021-08-27, D7000 before 2021-08-27, R6220 before 2021-08-27, R6230 before 2021-08-27, R6260 before 2021-08-27, R6330 before 2021-08-27, R6350 before 2021-08-27, R6700v2 before 2021-08-27, R6800 before 2021-08-27, R6850 before 2021-08-27, R6900v2 before 2021-08-27, R7200 before 2021-08-27, R7350 before 2021-08-27, R7400 before 2021-08-27, R7450 before 2021-08-27|Authentication bypass|\n|CVE-2021- 44228|Apache|Log4j2|2.0-beta9 through 2.15.0 (excluding security releases 2.12.2, 2.12.3, and 2.3.1)|Input validation code execution|\n|CVE-2021- 36260|Hikvision|Web servers firmware|Various DS-2CD, DS-2X, DS- 2DY, PTZ-N, DS-2DF, DS-2TD, IDS, DS-76, DS-71|Command injection|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2021- 28799|QNAP Systems Inc.|Hybrid Backup Sync (HBS) 3|versions prior to v16.0.0415 on QTS 4.5.2; versions prior to v3.0.210412 on QTS 4.3.6; versions prior to v3.0.210411 on QTS 4.3.4; versions prior to v3.0.210411 on QTS 4.3.3; versions prior to v16.0.0419 on QuTS hero h4.5.1; versions prior to v16.0.0419 on QuTScloud c4.5.1~c4.5.4|Improper authorization|\n|CVE-2021- 20090|Buffalo Arcadyan|Buffalo WSR Arcadyan firmware|WSR-2533DHPL2 firmware version <= 1.02, WSR-2533DHP3 firmware version <= 1.24|Path traversal|\n|CVE-2021- 1473|Cisco|Small Business RV Series Routers|RV340/RV340W, RV345/RV345P before 1.0.03.21|OS command injection|\n|CVE-2021- 1472|Cisco|Small Business Series Routers firmware|RV160, RV160W, RV260, RV260P, RV260W, RV340, RV340W, RV345, RV345P|Arbitrary code execution|\n|CVE-2020- 8515|DrayTek|Vigor|Vigor2960 1.3.1_Beta, Vigor3900 1.4.4_Beta, Vigor300B 1.3.3_Beta, 1.4.2.1_Beta, 1.4.4_Beta|RCE|\n|CVE-2020- 4450|IBM|WebSphere Application Server|8.5 and 9.0 traditional|Arbitrary code execution|\n|CVE-2020- 35391|Tenda|Tenda F3 Firmware|Tenda F3 Firmware 12.01.01.48|Forced browsing|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2020- 3452|Cisco|Adaptive Security Appliance (ASA) and Firepower Threat Defense (FTD) Software|ASA <9.6.4.42, <9.8.4.20, <9.9.2.74, <9.10.1.42, <9.12.3.12, <9.13.1.10, <9.14.1.10 FTD <6.2.3.16, <6.3.0.6, <6.4.0.10, <6.5.05, <6.6.0.1|Path traversal|\n|CVE-2020- 3451|Cisco|Small Business Series Routers Firmware|RV340W, RV340, RV345, RV345P|Multiple Security Vulnerabilities – like Buffer overflow via environment variables, server side include (SSI) injection|\n|CVE-2020- 15415|DrayTek|Vigor Firmware|3900, 2960, and 300b|Command injection|\n|CVE-2019- 7256|Linear eMerge|E3-Series|Nortekcontrol Linear Emerge Essential Firmware Nortekcontrol Linear Emerge Elite Firmware|Command injection|\n|CVE-2019- 19824|TOTOLINK Realtek|SDK based routers|A3002Ru through 2.0.0, A702R through 2.1.3, N301Rt through 2.16, N302R through 3.4.0, N300Rt through 3.4.0, N200Re through 4.0.0, N150Rt through 3.4.0, N100Re through 3.4.0, N302RE through 2.0.2|OS command injection|\n\n\n-----\n\n**TLP:CLEAR**\n\n|TLP:CLEAR|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|CVE|Vendor|Product|Versions affected|Vulnerability type|\n|CVE-2019- 17621|D-Link|DIR-859 Wi-Fi router 1.05 and 1.06B01 Beta01|DIR-818Lx Bx <=v2.05b03_Beta08, DIR- 822 Bx <=v2.03b01, DIR-822 Cx <=v3.12b04, DIR-823 Ax <=v1.00b06_Beta, DIR-859 Ax <=v1.06b01Beta01, DIR- 868L Ax <=v1.12b04, DIR- 868L Bx <=v2.05b02, DIR- 869 Ax <=v1.03b02Beta02, DIR-880L Ax <=v1.08b04, DIR-890L/R Ax <=v1.11b01_Beta01, DIR- 885L/R Ax <=v1.12b05, DIR- 895L/R Ax <=v1.12b10|OS command injection related to UPnP service|\n|CVE-2019- 12168|Four-Faith|Four-Faith Wireless Mobile Router F3x24|Firmware 1.0|RCE via command shell|\n|CVE-2019- 11829|Microsoft|Windows 10 Server 2016|Server 2016 1607 1703|OS command injection|\n|CVE-2018- 18852|Cerio|Cerio Dt-300N Firmware Cerio Dt-300n|DT-300N 1.1.6 through 1.1.12 devices|OS command injection|\n|CVE-2017- 7876|QNAP|QTS|QTS 4.2.6 before build 20170517, QTS 4.3.3.0174 before build 20170503|Command injection|\n|CVE-2015- 7450|IBM|Tivoli Common Reporting|3.1.0.2, 3.1, 3.1.2, 3.1.2.1, 2.1, 2.1.1.2, 3.1.0.1, 2.1.1,|Code injection|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/CSA/2024/240918.pdf"
    ],
    "report_names": [
        "240918.pdf"
    ],
    "threat_actors": [
        {
            "id": "09031838-56db-4676-a2b2-4bc50d8b7b0b",
            "created_at": "2024-01-23T13:22:35.078612Z",
            "updated_at": "2025-03-27T02:00:03.285024Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "Storm-0919"
            ],
            "source_name": "MISPGALAXY:Flax Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "86c7abc2-1b71-4665-b9e3-1594d6d15a4a",
            "created_at": "2023-09-07T02:02:47.367254Z",
            "updated_at": "2025-03-27T02:02:09.903407Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "RedJuliett"
            ],
            "source_name": "ETDA:Flax Typhoon",
            "tools": [
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "JuicyPotato",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Metasploit",
                "Mimikatz",
                "SinoChopper",
                "SoftEther VPN"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "fc3a00d5-40df-4a7b-a2da-a24004fb0cac",
            "created_at": "2024-06-25T02:00:05.042784Z",
            "updated_at": "2025-03-27T02:00:03.389495Z",
            "deleted_at": null,
            "main_name": "RedJuliett",
            "aliases": [],
            "source_name": "MISPGALAXY:RedJuliett",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1729821966,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1726648513,
    "ts_modification_date": 1726648513,
    "files": {
        "pdf": "https://archive.orkl.eu/1a5cfc3b33cbc2fe561bae4f41e5b6eb21e33cbc.pdf",
        "text": "https://archive.orkl.eu/1a5cfc3b33cbc2fe561bae4f41e5b6eb21e33cbc.txt",
        "img": "https://archive.orkl.eu/1a5cfc3b33cbc2fe561bae4f41e5b6eb21e33cbc.jpg"
    }
}