{
    "id": "67e110ec-5116-429f-a179-5121a2b39e3c",
    "created_at": "2022-10-25T16:48:24.233283Z",
    "updated_at": "2025-03-27T02:16:11.498108Z",
    "deleted_at": null,
    "sha1_hash": "e939cfd78126bc61e1f84d71ec84bce6b8798040",
    "title": "Quarterly Adversarial Threat Report #1 (Q1'2022)",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 281204,
    "plain_text": "APRIL 2022\n\n\n###### DETAILED REPORT\n\n## Adversarial Threat Report\n\n###### Ben Nimmo, Global Threat Intelligence Lead for Influence Operations\n\n David Agranovich, Director, Threat Disruption\n\n Nathaniel Gleicher, Head of Security Policy\n\n\n-----\n\n##### TABLE OF CONTENTS\n\nPurpose of this report 3\n\nSummary of our findings 3\n\n**01** **Removing three cyber-espionage networks from Iran and Azerbaijan** **5**\n\n**02** **Ukraine security update** **9**\n\n**03** **Removing four networks for coordinated inauthentic behavior** **12**\n\n**04** **Removing a mass reporting network in Russia** **17**\n\n**05** **Removing a coordinated violating network in the Philippines** **18**\n\n**06** **Removing inauthentic behavior** **20**\n\nAppendix: Threat indicators 24\n\n\n-----\n\n**PURPOSE OF THIS REPORT**\n\nOur public security reporting began over four years ago when we first shared our findings about\n\n[coordinated inauthentic behavior (CIB) by the Russian Internet Research Agency. Since then,](https://about.fb.com/news/tag/coordinated-inauthentic-behavior/)\n\nglobal threats have significantly evolved, and we have expanded our ability to respond to a wider\n\nrange of adversarial behaviors. To provide a more comprehensive view into the risks we see,\n\nwe’re expanding our regular reporting to include cyber espionage, inauthentic behavior, and\n\nother emerging harms, all in one place, as part of the quarterly reporting we’re testing. We’re\n\nalso sharing threat indicators at the end of this report to contribute to the efforts by the security\n\ncommunity to detect and counter malicious activity elsewhere on the internet (See Appendix).\n\nWe welcome ideas from the security community to help us make these reports more informative\n\nand we’ll adjust as we learn from feedback.\n\n**SUMMARY OF OUR FINDINGS**\n\n- Our pilot quarterly threat report provides a comprehensive view into the risks we see across\n\nmultiple policy violations including Coordinated Inauthentic Behavior (CIB), cyber espionage,\n\nand other emerging harms, like mass reporting.\n\n- We took action against two cyber espionage operations from Iran. The first network was\n\nlinked to a group of hackers known in the security industry as [UNC788. The second was a](https://vblocalhost.com/conference/presentations/unc788-irans-decade-of-credential-harvesting-and-surveillance-operations/)\n\nseparate, previously unreported group that targeted industries like energy,\n\ntelecommunications, maritime logistics, information technology, and others. More here.\n\n- We removed a hybrid network operated by the Ministry of Internal Affairs of Azerbaijan that\n\n**combined cyber espionage with Coordinated Inauthentic Behavior (CIB) to target civil**\n\nsociety in Azerbaijan by compromising accounts and websites to post on their behalf.\n\nMore here.\n\n- Our findings also include an update on our enforcements in Ukraine, including attempts by\n\npreviously disrupted state and non-state actors to come back on the platform, in addition to\n\nspam networks using deceptive tactics to monetize public attention to the ongoing war.\n\nMore here.\n\n- We removed Coordinated Inauthentic Behavior operations from Brazil, Costa Rica and\n\nEl Salvador, and previously reported networks from Russia and Ukraine. The Brazilian\n\nnetwork is the first operation we’ve disrupted that primarily focused on environmental\n\nissues. More here.\n\n\n-----\n\n- As part of disrupting new and emerging threats, we removed a coordinated violating\n\nnetwork in the Philippines that claimed credit for bringing websites down and defacing them,\n\nprimarily those of news entities. More here.\n\n- Under our Inauthentic Behavior policy against mass reporting, we removed a network in\n\nRussia for abusing our reporting tools by repeatedly reporting people in Ukraine for fictitious\n\nviolations of Facebook policy, in an attempt to silence them. More here.\n\n- Also under our Inauthentic Behavior policies, we took down tens of thousands of accounts,\n\nPages and Groups around the world for inauthentically inflating the distribution of their\n\n**content and abusively building an audience. We did so through large-scale automated**\n\ndetection, complemented by manual investigations. More here.\n\n\n-----\n\n# 01\n\n### Removing three cyber-espionage networks from Iran and Azerbaijan\n\n**Cyber espionage actors typically target people across the internet to collect intelligence,**\n\nmanipulate them into revealing information, and compromise their devices and accounts.\n\nWhen we disrupt these operations, we take down their accounts, block their domains from\n\nbeing shared on our platform, and notify people who we believe were targeted by these\n\nmalicious groups. We also share information with security researchers, governments, and\n\nour industry peers so they too can take action to stop this activity. We have included threat\n\nindicators in the Appendix to this report.\n\n#### 1. UNC788\n\n[We took action against a group of hackers from Iran, known in the security industry as UNC788,](https://vblocalhost.com/conference/presentations/unc788-irans-decade-of-credential-harvesting-and-surveillance-operations/)\n\nthat targeted people in the Middle East, including Saudi military, dissidents and human rights\n\nactivists from Israel and Iran, politicians in the US, and Iran-focused academics, activists and\n\njournalists around the world. Their malicious activity had the hallmarks of a well-resourced and\n\npersistent operation while obfuscating who’s behind it. We’ve been tracking and blocking this\n\n[group’s efforts for a number of years, similar to our peers at other platforms. This latest cyber](https://blog.google/threat-analysis-group/countering-threats-iran/)\n\nespionage campaign was active across the broader internet and focused on phishing its\n\ntargets to steal credentials to their online accounts and sharing links to malicious websites\n\nhosting malware.\n\nWe identified the following tactics, techniques, and procedures (TTPs) used by this threat actor\n\nacross the internet:\n\n\n-----\n\n  - **Social engineering: This group used a combination of low-sophistication fake accounts**\n\nand more elaborate fictitious personas, which they likely used to build trust with potential\n\ntargets and trick them into clicking on phishing links or downloading malicious\n\napplications. Some of these personas posed as human rights activists or academics.\n\n  - **Phishing: This campaign also relied on a network of phishing websites that hosted event**\n\nlanding pages or files where people were asked to login with their Google credentials\n\nto register.\n\n  - **Malware: To compromise people’s accounts and devices, this group copied and modified**\n\na legitimate Android application — a birthday calendar app — so it could extract contact\n\ninformation and send it to the attacker’s remote server. They also developed remote\n\naccess-capable malware for Android that disguised as a Quran, a chat app to retrieve\n\npeople’s contacts list, text messages, files, location information, and activate camera and\n\nmicrophone. We named this previously unreported malware strain HilalRAT (remote\n\naccess trojan), after seeing “hilal'' in several of the malware samples we analyzed. In the\n\nAppendix, we’re also sharing a Yara rule to help the security community identify it.\n\n#### 2. Previously unreported hacking group from Iran\n\nWe took action against a previously unreported hacking group from Iran that targeted or\n\nspoofed companies in multiple industries around the world. This included energy companies in\n\nSaudi Arabia, Canada, Italy, and Russia; the information technology industry in India and United\n\nArab Emirates; the maritime logistics industry in UAE, Iceland, Norway, Saudi Arabia, US, Israel,\n\nand India; telecommunications companies in Saudi Arabia and UAE; and the semiconductor\n\nindustry in Israel, US, and Germany. This activity had the hallmarks of a well-resourced and\n\npersistent operation while obfuscating who’s behind it.\n\n[This group used similar TTPs to another threat actor dubbed Tortoiseshell that we reported on](https://about.fb.com/news/2021/07/taking-action-against-hackers-in-iran/)\n\nlast year, but in this case we saw different targeting, technical infrastructure, and distinct\n\nmalware. We identified the following TTPs used by this group across the internet:\n\n  - **Social engineering: This campaign ran elaborate fictitious personas across social media**\n\nplatforms, including Instagram, LinkedIn, Facebook, and Twitter, to make them appear\n\nmore credible and help withstand scrutiny. They often posed as recruiters for real and\n\nfake companies in the industry or region that each persona targeted, as part of what\n\n\n-----\n\nappeared to be a social engineering scheme to trick people into clicking on malicious links\n\nor installing malware.\n\n  - **Fake and spoofed legitimate corporate websites: This operation included a network of**\n\nfictitious corporate recruiting websites, as well as spoofed domains of legitimate\n\ncompanies. It also relied heavily on email phishing to social engineer people to download\n\nmalware, likely in an attempt to gain information and access to corporate systems.\n\n  - **Interactive targeting and exploit protection: This group took steps to conceal their**\n\nactivity and protect their malicious tools by embedding interactive features in them that\n\nwould only send the malicious payload after the targets interacted with the attacker in\n\nreal time. For example, an interview app would launch a built-in chat function for an\n\nattacker to supply a password to start an interview. When the target entered the\n\npassword, it activated the delivery of the malware. A chess app also required a passcode,\n\nsupplied by the hackers, to launch the game and the malware delivery.\n\n  - **Malware: This group built unique malicious applications disguised as a VPN app, a salary**\n\ncalculator, an audio book reader, or a chat app. They developed malware on the VMWare\n\nThinApp virtualization platform, which allowed them to run it on many different systems\n\nand hold malicious payload back until the last minute, making malware detection more\n\nchallenging. The final payload included full-featured remote-access trojans, capable of\n\nrunning commands on the target’s device, access and send files, take screenshots, and\n\ndownload and execute additional malware.\n\n#### 3. A hybrid operation from Azerbaijan\n\nWe disrupted a complex network in Azerbaijan that engaged in both cyber espionage and\n\ncoordinated inauthentic behavior. It primarily targeted people from Azerbaijan, including\n\ndemocracy activists, opposition, journalists, and government critics abroad. This campaign\n\nwas prolific but low in sophistication, and was run by the Azeri Ministry of Internal Affairs. It\n\ncombined a range of tactics — from phishing, social engineering, and hacking to coordinated\n\ninauthentic behavior.\n\nThis operation targeted websites and the online accounts of democracy activists, opposition,\n\nand journalists in Azerbaijan in pursuit of what appears to be two goals: obtain personal\n\ninformation about the targets and promote particular narratives about them or on their behalf.\n\nThey focused on news websites and a number of internet services, including Facebook, Twitter,\n\n\n-----\n\nLinkedIn, YouTube, and Russian VK and OK. It is another example of a hybrid espionage and CIB\n\ncampaign, similar to the unconnected and separate activity by Ghostwriter, a threat actor that\n\nmost recently targeted Ukraine.\n\nWe identified the following tactics, techniques, and procedures (TTPs) used by this threat actor\n\nacross the internet:\n\n  - **Compromised and spoofed websites: This group operated across the internet, with over**\n\n70 websites and domains that they either ran themselves or compromised. They targeted\n\nsites in Azerbaijan and, to a lesser extent, Armenia; a small number of sites had Russian or\n\nTurkish domains. Once they compromised these websites, the group harvested\n\ndatabases containing usernames and passwords, likely to further compromise online\n\naccounts of their targets who might have reused the same credentials across the\n\ninternet. They also, at times, hosted credential phishing content on these websites.\n\n  - **Malware and other malicious tools: This group scanned websites in the region for**\n\n“low-hanging fruit” web vulnerabilities, using tools like Burpsuite and Netsparker. They\n\nthen used publicly known techniques to compromise vulnerable sites before uploading\n\none of numerous web shells in order to maintain persistent access. Similarly, to crack\n\nhashes obtained from compromised sites, they used publicly available hash-cracking\n\ntools. In its targeting of people, this threat actor is known to use both Windows and\n\ncommodity surveillanceware for Android.\n\n  - **Credential phishing: In its phishing activity, this group relied on compromised and**\n\nspoofed websites where they asked people to enter their social media credentials so\n\nthey could cast their vote in political polls. Through it, an attacker would obtain people’s\n\ncredentials to take over their online accounts. This operation also attempted to drive\n\npeople to their phishing web pages by sharing links to them on social media, including\n\nthrough compromised accounts of public figures or accounts posing as members\n\nof Facebook’s security team, many of which were detected and disabled by our\n\nautomated systems.\n\n  - **Industry reporting: Our findings corroborate previous public reporting about some of this**\n\nactivity by [OC-Media and](https://oc-media.org/hackers-target-prominent-azerbaijani-feminist-with-pornography/) [Qurium.](https://www.qurium.org/alerts/phishing-attack-against-azerbaijani-political-and-human-right-activities/)\n\n  - **Coordinated Inauthentic Behavior: The individuals behind this activity used fake and**\n\ncompromised accounts to run Pages and post as if they were the legitimate owners\n\nof these Pages and accounts. They typically posted in Azeri, including critical or\n\ncompromising commentary about the government opposition, activists, journalists,\n\nand other members of civil society in Azerbaijan.\n\n\n-----\n\n# 02\n\n### Ukraine security update\n\nSince the start of the Russian invasion of Ukraine, our teams have been on high alert to detect\n\nand disrupt threats and platform abuse, including attempts to come back by networks we\n\nremoved before. We’ve shared our findings with our peers at tech companies, independent\n\nresearchers, governments, law enforcement and targeted individuals, when possible. You can\n\nfind our previous security update on Ukraine [here.](https://about.fb.com/news/2022/02/security-updates-ukraine/)\n\n#### Our Key Findings\n\n###### Nation state actors\n\nGovernment-linked actors from Russia and Belarus engaged in cyber espionage and covert\n\ninfluence operations online. This activity included interest in the Ukrainian telecom industry;\n\nboth global and Ukrainian defense and energy sectors; tech platforms; and journalists and\n\nactivists in Ukraine, Russia, and abroad.\n\nThese operations appear to have intensified shortly before the Russian invasion. For example, we\n\ndetected and disrupted [recidivist CIB activity linked to the Belarusian KGB who suddenly began](https://about.fb.com/wp-content/uploads/2021/12/November-2021-CIB-Report.pdf)\n\nposting in Polish and English about Ukrainian troops surrendering without a fight and the\n\nnation’s leaders fleeing the country on February 24, the day Russia began the war. Prior to that,\n\nthis particular threat actor primarily focused on accusing Poland of mistreating migrants from\n\nthe Middle East. On March 14, they pivoted back to Poland and created an event in Warsaw\n\ncalling for a protest against the Polish government. We disabled the account and event that\n\nsame day.\n\n\n-----\n\n###### Known persistent threat actors\n\nFirst, following our last security update on Ukraine, we’ve seen a further spike in compromise\n\nattempts aimed at members of the Ukrainian military by Ghostwriter, a threat actor [tracked by](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\n\n[the security community. As we’ve](https://l.workplace.com/l.php?u=https%3A%2F%2Fabout.fb.com%2Fnews%2F2022%2F02%2Fsecurity-updates-ukraine%2F&h=AT3QpeRlSCo-tw9OfsiFlSVJSD2Q2Sjugi1kpMDSGAkjgNX-PYOqDDB_MUnBPlMjzSUAlg8yHbXsT9j5Wfxsb56eI1oWaY2W37YHoPgY2y4Y-5FrcdGxRlAaBf7ffjTrHzryMYL2T7ksTVBIm7GJJg) [shared before, Ghostwriter typically targets people through](https://about.fb.com/news/2022/02/security-updates-ukraine/)\n\nemail compromise and then uses that to gain access to their social media accounts across the\n\n[internet. Since our last public update, this group has attempted to hack into the Facebook](https://about.fb.com/news/2022/02/security-updates-ukraine/)\n\naccounts of dozens of Ukrainian military personnel. In a handful of cases, they posted videos\n\ncalling on the Army to surrender as if these posts were coming from the legitimate account\n\nowners. We blocked these videos from being shared.\n\nSecond, we detected and took down an attempt to come back by a network we removed in\n\n[December 2020 and linked to individuals associated with past activity by the Russian Internet](https://about.fb.com/news/2020/12/removing-coordinated-inauthentic-behavior-france-russia/)\n\nResearch Agency (IRA). Their off-platform activity appears to have begun last year and centered\n\naround a website, posing as an NGO focused on civil rights in the West. They unsuccessfully\n\nattempted to create Facebook accounts in late 2021 and January 2022. Throughout January\n\nand February of this year, the website published about police violence in the West, but since the\n\ninvasion, their articles blamed Russia’s attack on NATO and the West and accused Ukrainian\n\nforces of targeting civilians.\n\n###### Politically-aligned non-state actors\n\n[We detected and took down an attempt to come back by the network we removed in December](https://about.fb.com/wp-content/uploads/2021/01/December-2020-CIB-Report-.pdf)\n\n[2020 and linked to people in the Luhansk region of Ukraine. This activity centered around two](https://about.fb.com/wp-content/uploads/2021/01/December-2020-CIB-Report-.pdf)\n\nwebsites promoting pro-Russian commentary in the Caucasus and Ukraine, and a small number\n\nof accounts on Facebook, Telegram, VK, and OK. In early March, the Ukraine-focused site\n\nappeared to have been taken over to direct its audience towards a Telegram channel showing\n\nphotos of Russian casualties.\n\nWe also removed a network in Russia for violating our Inauthentic Behavior policy against mass\n\nreporting. The network coordinated to falsely report people in Ukraine and also in Russia for\n\nvarious violations, including hate speech, in an attempt to have them and their posts removed\n\nfrom Facebook. More details on this network can be found here.\n\n\n-----\n\n###### Financially motivated actors\n\nAs is typical for major world events and critical societal issues, we’re seeing scammers around\n\nthe world turn to the war in Ukraine to amass an audience and monetize everyone’s attention\n\nto this humanitarian crisis. We know that at first glance, these activities can be mistaken for\n\nstate-backed influence operations, when in fact they come from scammers who use\n\nsocio-political themes as a form of spam or clickbait lures.\n\nSince the war began, we’ve investigated and removed tens of thousands of accounts, Pages\n\nand Groups using both automated and manual systems. We’ve seen spammers from around\n\nthe world use inauthentic behavior tactics including streaming live-gaming videos and reposting\n\npopular content including other people’s videos from Ukraine as a way to pose as sharing live\n\n[updates. Some of the spammers switched names repeatedly to trick people into following](https://www.inputmag.com/culture/ukraine-russia-war-pages-instagram-meme-scams)\n\nthem so they can try making money by either driving people to off-platform ad-filled websites\n\nor selling them merchandise. We also took down multiple clusters of long-abandoned\n\ncompromised accounts that suddenly shifted to being run from Russia. Many of them shared\n\nidentical pro-separatist videos and amplified accounts in their own clusters, likely as part of\n\npaid inauthentic engagement.\n\n###### Account security\n\nWe strongly encourage people in Ukraine and Russia to strengthen the security of their online\n\naccounts, including email and social media. To help keep your online accounts safe and protect\n\naccess to social media and other websites blocked in your country:\n\n  - [Download a VPN app on your devices to ensure access to blocked sites, like social media,](https://ssd.eff.org/en/module/choosing-vpn-thats-right-you)\n\nthrough an encrypted connection.\n\n  - [Enable two-factor authentication using a third-party authentication app](https://www.facebook.com/help/358336074294704/) [like Google](https://support.google.com/accounts/answer/1066447?hl=en&co=GENIE.Platform%3DiOS)\n\n[Authenticator or Duo.](https://support.google.com/accounts/answer/1066447?hl=en&co=GENIE.Platform%3DiOS)\n\n  - [Do not reuse your password. Passwords should be strong](https://www.facebook.com/help/124904560921566) and unique for each of\n\nyour accounts.\n\n\n-----\n\n# 03\n\n### Removing four networks for coordinated inauthentic behavior\n\n**We view CIB as coordinated efforts to manipulate public debate for a strategic goal where fake**\n\naccounts are central to the operation. In each case, people coordinate with one another and use\n\nfake accounts to mislead others about who they are and what they are doing. When we\n\ninvestigate and remove these operations, we focus on behavior rather than content —\n\nno matter who’s behind them, what they post, or whether they’re foreign or domestic.\n\n**Continuous CIB enforcement: We monitor for efforts to re-establish a presence on our**\n\nplatforms by networks we previously removed. Using both automated and manual detection,\n\nwe continuously remove accounts and Pages connected to networks we took down in the past.\n\n#### 1. Brazil\n\n**We removed a network of 14 Facebook accounts, nine Pages, and 39 Instagram accounts for**\n\n**[violating our policy against coordinated inauthentic behavior. This network originated in Brazil](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**and targeted domestic audiences in that country.**\n\nThe people behind this activity relied on fake accounts— some of which were detected and\n\ndisabled by our automated systems —targeting people across multiple social media platforms,\n\nincluding Facebook, Instagram, and Twitter. This activity ran in what appears to be two phases.\n\nFirst, in 2020, the operation posted memes about social and political issues, including land\n\nreform and the COVID-19 pandemic. They abandoned this activity after a couple of months,\n\nhaving gained almost no engagement. In 2021, they created Pages that posed as fictitious NGOs\n\nand activists focused on environmental issues in the Amazonas region of Brazil. They posted\n\nabout deforestation, including arguing that not all of it is harmful, and criticizing legitimate\n\nenvironmental NGOs who spoke out against deforestation in the Amazon.\n\n\n-----\n\nIn addition to posting original memes, they also shared mainstream media content and posts by\n\nGreenpeace and nature photographers, likely in an attempt to make these accounts look more\n\ncredible. In one instance, we saw this operation use a profile picture, likely generated using\n\nartificial intelligence techniques like generative adversarial networks (GAN).\n\nWe found this network as a result of our investigation into suspected coordinated inauthentic\n\nbehavior in the region. Although the people behind it attempted to conceal their identities and\n\ncoordination, our investigation found links to individuals associated with the Brazilian Military[1].\n\n  - Presence on Facebook and Instagram: 14 Facebook accounts, nine Pages, and\n\n39 accounts on Instagram.\n\n  - Followers: About 1,170 accounts followed one or more of these Pages and about 23,600\n\naccounts followed one or more of these Instagram accounts.\n\n  - Advertising: Around $34 in spending for ads on Facebook and Instagram, paid for in\n\nBrazilian real.\n\n#### 2. Costa Rica and El Salvador\n\n**We removed 233 Facebook accounts, 84 Pages, two Groups, and 27 Instagram accounts for**\n\n**[violating our policy against coordinated inauthentic behavior. This network originated in Costa](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**Rica and El Salvador and targeted primarily Costa Rica and El Salvador.**\n\nThe people behind this activity used fake accounts — some of which were already detected and\n\ndisabled by our automated systems — to run Pages posing as news outlets, post memes,\n\ncomment on their own and other people's content, and drive people to off-platform domains.\n\nThis network also amplified content from the Pages of local politicians and businesses.\n\nThey would typically post on both sides of the political spectrum, including in support of\n\ncompeting political candidates running against each other. Some of these accounts had profile\n\npictures likely generated using artificial intelligence techniques like generative adversarial\n\nnetworks (GAN).\n\n1 The process of attributing violating activity to particular threat actors has been long debated by the security\n[community. Meta’s approach](https://about.fb.com/news/2018/07/removing-bad-actors-on-facebook/) to attribution relies on the available technical and investigative signals at our disposal.\nWhen, based on the available evidence, our expert investigative teams do not see clear evidence of command and\ncontrol, but do see a number of individuals associated with the entity behind the operation, Meta will attribute the\nactivity to “individuals linked to the entity.”\n\n\n-----\n\nThe individuals behind this operation posted primarily in Spanish about news and current events\n\nin Central America. They also posted supportive commentary about one telecom company in\n\nCosta Rica and criticism of its competitors.\n\nWe found this network after reviewing public reporting about an off-platform portion of this\n\nactivity and took action ahead of the election in Costa Rica. Although the people behind it\n\nattempted to conceal their identity and coordination, our investigation found links to Noelix\n\nMedia, a PR firm with offices in Costa Rica and El Salvador. Noelix is now banned from\n\nour platform.\n\n  - Presence on Facebook and Instagram: 233 Facebook accounts, 84 Pages, two Groups,\n\nand 27 accounts on Instagram.\n\n  - Followers: About 212,000 accounts followed one or more of these Pages, around 10\n\naccounts joined one or more of these Groups, and about 2,000 accounts followed one\n\nor more of these Instagram accounts.\n\n  - Advertising: Around $128,000 in spending for ads on Facebook and Instagram paid for\n\nprimarily in US dollars and Costa Rican colón.\n\n#### 3. Russia and Ukraine\n\n[We reportedthis enforcement as part of our security update on February 27, 2022.](https://about.fb.com/news/2022/02/security-updates-ukraine/)\n\n**We removed a small network of 27 Facebook accounts, two Pages, three Groups, and four**\n\n**[Instagram accounts for violating our policy against coordinated inauthentic behavior. This](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**network operated from Russia and Ukraine and targeted primarily Ukraine.**\n\nWe uncovered a relatively small network of 27 Facebook accounts, two Pages, three Groups, and\n\nfour Instagram accounts targeting people in Ukraine across multiple social media platforms and\n\nthrough their own websites. This network used fake accounts and operated fictitious personas\n\nand brands across the internet — including on Facebook, Instagram, Twitter, YouTube, Telegram,\n\nOdnoklassniki, and VK — to appear more authentic in an apparent attempt to withstand scrutiny\n\nby platforms and researchers. These fictitious personas used profile pictures likely generated\n\nusing artificial intelligence techniques like generative adversarial networks (GAN). We took down\n\nthis operation, blocked their domains from being shared on our platform, and shared information\n\nwith other tech platforms, researchers, and governments.\n\n\n-----\n\nThe fake accounts claimed to be based in Kyiv and posed as news editors, a former aviation\n\nengineer, and an author of a scientific publication on hydrography — the science of mapping\n\nwater. This operation ran a handful of websites masquerading as independent news outlets,\n\npublishing claims about the West betraying Ukraine and Ukraine being a failed state.\n\n[Our investigation found links between this network and another operation we removed in April](https://about.fb.com/wp-content/uploads/2020/05/April-2020-CIB-Report.pdf)\n\n[2020 and connected to individuals in Russia, the Donbas region in Ukraine, and two media](https://about.fb.com/wp-content/uploads/2020/05/April-2020-CIB-Report.pdf)\n\norganizations in Crimea — NewsFront and SouthFront, now [sanctioned](https://home.treasury.gov/news/press-releases/jy0126) by the US government.\n\n  - Presence on Facebook and Instagram: 27 Facebook accounts, two Pages, three Groups,\n\nand four accounts on Instagram.\n\n  - [Followers: About 3,450 accounts followed one or more of these Pages and about 415](https://fburl.com/daiquery/1l5p5g2x)\n\naccounts followed one or more of these Instagram accounts.\n\n  - Advertising: Around $200 in spending for ads on Facebook and Instagram paid for\n\nprimarily in Russian ruble and US dollars.\n\n#### 4. Russia\n\n[We reportedthis enforcement as part of our CIB update on February 16, 2022.](https://about.fb.com/wp-content/uploads/2022/02/January-2022-Coordinated-Inauthentic-Behavior-Report.pdf)\n\n**We removed a small network of three Facebook accounts for violating our policy against**\n\n**[coordinated inauthentic behavior. This network originated in Saint Petersburg, Russia and](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**targeted primarily Nigeria, Cameroon, Gambia, Zimbabwe, and Congo.**\n\nThe people behind this activity used fake accounts to create fictitious personas, posing as a\n\nmedia editor or as a Europe-based Arab-speaking executive at a PR agency. These accounts had\n\nprofile pictures, likely generated using artificial intelligence techniques like generative\n\nadversarial networks (GAN). We saw two short periods of activity — both largely unsuccessful.\n\nFirst, this operation tried to solicit freelance help to write articles about Syria through the\n\nArabic-language journalist Groups. After a period of inactivity, they appear to focus on Africa in\n\nan attempt to co-opt media outlets into publishing stories on their behalf about African politics,\n\nincluding criticism of French influence in Africa. We’re notifying people who we believe have\n\nbeen contacted by this network.\n\n\n-----\n\nWe found this activity as part of our internal investigation into suspected coordinated\n\ninauthentic behavior with links to the activity we had [disrupted in August 2020. Although the](https://about.fb.com/news/2020/09/august-2020-cib-report/)\n\npeople behind it attempted to conceal their identities and coordination, our investigation found\n\nlinks to individuals associated with the past activity by the Russian Internet Research Agency.\n\n  - Presence on Facebook: three Facebook accounts.\n\n\n-----\n\n# 04\n\n### Removing a mass reporting network in Russia\n\n**[Under our Inauthentic Behavior policies, we remove mass reporting activity when we find](https://transparency.fb.com/policies/community-standards/inauthentic-behavior/)**\n\nadversarial networks that coordinate to abuse our reporting systems to get accounts or content\n\nincorrectly taken down from our platform, typically with the intention of silencing others.\n\n#### Russia\n\nWe removed a network of about 200 accounts operated from Russia. The individuals behind it\n\ncoordinated to falsely report people for various violations, including hate speech, bullying, and\n\ninauthenticity, in an attempt to have them and their posts removed from Facebook. The majority\n\nof these fictitious reports focused on people in Ukraine and Russia, but the network also\n\nreported users in Israel, the United States, and Poland.\n\nThe people behind this activity relied on fake, authentic, and duplicate accounts to submit\n\nhundreds — in some cases, thousands — of complaints against their targets through our abuse\n\nreporting tools. Many of this network’s accounts were detected and disabled by our automated\n\nsystems. Their coordinated reporting increased in mid-February, just before the invasion of\n\nUkraine. Likely in an effort to evade detection, the people behind this activity coordinated\n\ntargeting of mass reporting in their cooking-themed Group, which had about 50 members\n\nwhen we took it down.\n\nWe found this network as a result of our internal investigation into suspected inauthentic\n\nbehavior in the region. Our review identified limited links between this activity and a network\n\nfrom Russia that we [took down](https://about.fb.com/news/2019/03/cib-iran-russia-macedonia-kosovo/) for CIB in 2019.\n\n\n-----\n\n# 05\n\n### Removing a coordinated violating network in the Philippines\n\n**We remove coordinated violating networks when we find people — whether they use authentic**\n\n[or fake accounts — working together to violate or evade our Community Standards.](https://transparency.fb.com/policies/community-standards/account-integrity-and-authentic-identity/)\n\nThis primarily behavior-based enforcement complements our existing content policies, under\n\nwhich we already remove violating content and accounts violating our [Community Standards,](https://transparency.fb.com/policies/community-standards/)\n\nincluding incitement to violence, bullying and harassment or harmful health misinformation. We\n\nrecognize that, in some cases, these content violations are perpetrated by a tightly organized\n\ngroup, working together to amplify their members’ harmful behavior and repeatedly violate our\n\ncontent policies. In these cases, the potential for harm caused by the totality of the network’s\n\nactivity exceeds the impact of each individual post or account. To address these organized\n\nefforts more effectively, we’ve built enforcement protocols that enable us to take action against\n\nthe core network of accounts, Pages, and Groups engaged in this behavior. As part of this\n\nframework, we may take a range of actions, including reducing content reach and disabling\n\naccounts, Pages, and Groups.\n\n#### Philippines\n\nWe removed a network of over 400 accounts, Pages, and Groups in the Philippines that worked\n\ntogether to systematically violate multiple policies against coordinated harm, bullying and\n\nharassment, hate speech, misinformation, and incitement to violence, and evade enforcement.\n\nThe people behind this activity claimed to be hacktivists and relied primarily on authentic and\n\nduplicate accounts to post and amplify content about Distributed Denial of Service (DDoS)\n\nattacks, account recovery and defacing and compromising of websites in the Philippines. They\n\ncommented about a DDoS attack against the sites of the Nobel Prize in December 2021 which\n\n\n-----\n\nwas [confirmed](https://www.nobelprize.org/press-english/) to be unsuccessful, and accused public figures in the Philippines of being\n\nCommunists (a tactic known as “red-tagging”).\n\nThis network claimed credit for bringing websites down and defacing them, primarily those of\n\nnews entities. They also offered cyber security services to protect websites from attacks, like\n\nthe ones they themselves claimed to have perpetrated. Finally, this group publicly invited new\n\nmembers to join and carry out DDoS attacks.\n\n\n-----\n\n# 06\n\n### Removing inauthentic behavior\n\n**What is Inauthentic Behavior? While CIB is typically designed to mislead people about who is**\n\nbehind an operation to manipulate public debate for a strategic goal, Inauthentic Behavior (IB) is\n\nprimarily centered around amplifying and increasing the distribution of content. It is often (but\n\nnot exclusively) financially motivated, and shares many tactics with spam and scam activity.\n\n#### How do we enforce against IB?\n\nThis year, we took down tens of thousands of accounts, Pages, and Groups around the world for\n\nengaging in inauthentic inflation of content distribution and abusive audience building. We rely\n\non a range of enforcement levers against IB — from warnings, to reducing the distribution of\n\ncontent, to removing IB actors and clusters of activity from our platform (more in our\n\nInauthentic Behavior report [here).](https://about.fb.com/wp-content/uploads/2020/10/Inauthentic-Behavior-Report-October-2020.pdf)\n\nIB operators typically focus on quantity, rather than the quality of engagement. For example,\n\nthey may use large numbers of low-sophistication fake accounts to mass-post their content or\n\nto like it. They may also try to monetize people’s attention by either driving them to off-platform\n\nwebsites filled with ads or selling t-shirts and other goods. In response to detection and\n\nremovals, they typically try to aggressively reconstitute their activity. Because they so often\n\nwork at scale, we counter IB through large-volume automated detection and enforcement,\n\ncomplemented by manual investigations to help us identify new tactics or gaps in detection.\n\nThis approach allows us to learn and improve our defenses in response to adversarial adaptation,\n\nwhile removing these clusters of activity at scale, no matter whether they aim to promote\n\ncelebrity gossip or socio-political clickbait with an aim to amass an audience.\n\nHere are some of the deceptive strategies we’ve seen IB operators use to artificially boost\n\ntheir engagement:\n\n\n-----\n\n###### Context switching\n\nIB operators often seek to mislead and grow their audience by claiming to be dedicated to one\n\npopular topic, then switching to another unrelated one when it becomes viral. They are\n\nwell-attuned to their target audiences and will quickly pivot to post about the latest news or\n\nscandals to deceive people into clicking links to their sites. Unsurprisingly, politics has also\n\nbecome a common spammy lure. These activities can be and are often mistaken for\n\npolitically-motivated influence operations at first glance, when in fact they are using political\n\nthemes as another form of clickbait, similarly to celeb-bait or puppy memes.\n\n[For example, in the early stages of the war in Ukraine, we investigated a tip from a journalist and](https://www.inputmag.com/culture/ukraine-russia-war-pages-instagram-meme-scams)\n\ntook down a network of Instagram accounts run from the US, some of which claimed to be\n\nreporting live from the front lines in Ukraine. They attempted to monetize, including by selling\n\nthematic merchandise through their website. After the Russian invasion began, this cluster\n\nquickly switched from posting about “scary driving” and “Airsoft videos'' to military themes. In\n\nanother case, we took down a Page run from Vietnam that shifted from posting videos about\n\n“life hacks” and jewelry to posting about military hardware and the Ukraine conflict — all to drive\n\npeople towards an off-platform website.\n\n###### Posing as authentic communities in different countries\n\nIB networks also often pretend to be based in one country, when in fact they’re operated out of a\n\ncompletely different one. This tactic often goes hand in hand with the “context switching” we\n\ndescribed above. It includes foreign spammers and scammers flocking to any hot-button issue\n\nrelevant in a particular country or region — like an election or socio-political crisis or natural\n\ndisaster — to amass an audience and monetize their attention.\n\nFor example, multiple Vietnam- and Bangladesh-based spam clusters posed as supporters of\n\nthe Canadian Trucker Convoy to cash in on people’s interest in this protest. In one case, they\n\ncreated Groups for convoy supporters or Facebook Pages designed to look like they were\n\nproviding updates on the convoy, and then posted links to e-commerce websites or links to\n\nthird-party affiliate marketing sites.\n\n\n-----\n\n###### Mass posting, liking, and sharing content to make it appear more popular\n\nTypically, IB actors rely on basic fake accounts to like, comment, or share content in an effort to\n\ncreate the false perception that the content is organically popular. In one case we investigated\n\nlast quarter, a cluster of fake accounts created in Bangladesh appeared to have changed hands\n\nand been used as part of fake engagement efforts to comment on, like, and share content by the\n\nPage of a former US Senate candidate from Arizona.\n\nThis behavior may increase the number of likes and shares on the target posts, but our\n\ninvestigations over the years have found that it rarely, if ever, leads to actual engagement among\n\nreal people. These amplification clusters often manifest as an engagement “bubble” or “click\n\nclique”, where only its own members like and comment on each other’s posts instead of real\n\npeople outside that bubble.\n\n\n#### In focus: Philippines election\n\nAs with any major civic event, we’ve seen IB operators from various countries,\n\nincluding the Philippines, Vietnam, US, and Thailand, become active on the margins\n\nof the upcoming Philippines elections in May, using the common IB tactics we described\n\nabove. They appeared to focus on growing their audiences for either eventual\n\nmonetization or to make their clients’ content appear more popular than it really is.\n\n###### Context switching\n\nWe’ve removed several clusters of activity that switched the focus of their Pages and\n\nGroups to the elections as they attempted to increase their following. In one case, a\n\nnetwork included a series of Pages that shifted from non-political to political themes and,\n\nin some cases, shifted back to other unrelated topics. One Page that mainly shared\n\nnon-political dance videos renamed itself to become “Bongbong Marcos news,” while\n\nanother Page that started off as supporting a politician later changed its name to “Your\n\nFinancial Answer” and began posting loan advice. Among these clusters, we saw\n\nadversarial attempts to evade our automated name-change detection, including one\n\nPage that changed its name eight times over eight years, gradually shifting it from\n\n“History and Trivia Philippines” to focusing on particular political candidates.\n\n\n-----\n\n###### Deceptive efforts to pose as authentic communities in different countries\n\nWe removed multiple clusters of activity from Vietnam, Thailand, and the US that posed\n\nas members of local communities in the Philippines in an apparent attempt to monetize\n\npeople’s attention on the election. In February, we identified a cluster of Pages operated\n\nby spammers in Vietnam who used VPNs to make it look like they are based in the\n\nPhilippines. They posed as supporters of political campaigns or local news entities and\n\nused names like Philippines Trending News, Duterte Live, Related to Francis Leo Marcos,\n\nand Pinas News. They claimed to share live footage while purporting to be local news\n\nsources on the ground in an attempt to drive people to their clickbait websites filled\n\nwith ads.\n\n###### Inauthentic engagement\n\nWe identified several efforts to post at high, spam-like rates to drive people to particular\n\nPages or off-platform websites. In one case, we found a social media management\n\nagency that used fake accounts and duplicate Pages to inauthentically amplify both\n\npolitical and entertainment content. The agency used a network of over 700 accounts\n\nto post, share, and comment on posts and share content through large Groups.\n\nIn other cases, we found and removed inauthentic engagement activity run by the\n\nsame people in support of multiple candidates in the same election at once. In the\n\nlead-up to the elections, we’ve taken down about a dozen clusters of activity focused\n\non fake engagement.\n\n**We’re continuing to closely monitor the situation in the lead-up to the May election in**\n\n**the Philippines and will take action if we find violating activity attempting to leverage**\n\n**people’s interest in the election using IB tactics.**\n\n\n-----\n\n### Appendix: Threat indicators\n\n#### 1. UNC788, Iran\n\n##### Domains & C2s\n\n- bnt2[.]live\n\n- archery.dedyn[.]io\n\n- market.vinam[.]me\n\n- signin.dedyn[.]io\n\n- Market.dedyn[.]io\n\n##### Hashes\n\n- 43535540e94b39279af925e9548dce7f\n\n- 9b91427d195b8b7e75fbbc29a798bede\n\n- aaa55f1e48aba8856661fedc0074e81a\n\n- 6e0ec6bd0bef489c83c2dce4876de5c8\n\n- 70875705e8bc3887cec4ef1873cdb152\n\n- aa7330d2d360cac61394843d8af730bb\n\n- ab533be4ff9c99e8a03bc4cd413badb6\n\n##### Yara rule\n```\nrule hilal_rat_dex: {\n meta:\n  source = \"Facebook\"\n  date = \"2022-04-07\"\n  description = \"Detects custom android rat impersonating various\napplications that siphons phone details to a C2.\"\n strings:\n  $class0 = \"Lcom/hilal/SysUpdater/MainActivity;\"\n  $class1 = \"Lcom/hilal/adm/R;\"\n  $file0 = \"cacaca.dat\"\n  $file1 = \"ccc.dat\"\n  $file2 = \"fifi.dat\"\n  $file3 = \"smr.dat\"\n  $file4 = \"smse.dat\"\n\n```\n\n-----\n\n```\n  $typo0 = \"Erron in Decryption\"\n  $typo1 = \"GetDevcie\"\n  $sec1 = \"6123cc12ef9bd0bf1592c69bf769853fb0a00084\" // AES key\n  $cmd0 = \"/Aud\"\n  $cmd1 = \"/Cam\"\n  $cmd2 = \"/Upd\"\n  $cmd3 = \"/Con\"\n  $func1 = \"CamStart\"\n  $func2 = \"AudStop\"\n  $func3 = \"AudStart\"\n  $func4 = \"DownFi\"\n  $func5 = \"ScrSht\"\n  $func6 = \"CamList\"\n  $func7 = \"CamStop\"\n  $func8 = \"ListExplore\"\n  $interesting_string0 = \"isMyServiceRunning?\"\n  $interesting_string1 = \"Checking new version... Please wait...\"\n  $notification_service0 = \"********** onNotificationPosted\"\n  $notification_service1 = \"********** onNOtificationRemoved\"\n  $phnum = \"PhNumber\"\n condition:\n  filetype_dex and\n  10 of them\n  or all of ($file*)\n  or all of ($func*)\n  or all of ($interesting_*) and all of ($notification_*)\n}\n\n```\n\n-----\n\n#### 2. Previously unreported group (Iran)\n\n##### Domains & C2s\n\n\n\n- alharbitelecom[.]co\n\n- apply-jobs[.]com\n\n- applytalents[.]com\n\n- appslocallogin[.]online\n\n- careers-finder[.]com\n\n- cloudgoogle[.]co\n\n- cortanaservice[.]com\n\n- cortanaupdate[.]co\n\n- defenderupdate[.]ddns[.]net\n\n- edge-cloudservices[.]com\n\n- elecresearch[.]org\n\n- enerflex[.]ddns[.]net\n\n- enerflex[.]org\n\n- etisalatonline[.]com\n\n- exprogroup[.]org\n\n- freechess[.]live\n\n- funnychess[.]online\n\n- getadobe[.]ddns[.]net\n\n- getadobe[.]net\n\n- globaltalent[.]in\n\n- googleservices[.]co\n\n- googleupdate[.]co\n\n- helpdesk-product[.]com\n\n- khaleejtimes[.]co\n\n- librarycollection[.]org\n\n- linkedinz[.]me\n\n- listen-books[.]com\n\n\n\n- lukoil[.]in\n\n- mastergatevpn[.]com\n\n- microsoftcdn[.]co\n\n- microsoftdefender[.]info\n\n- microsoftedgesh[.]info\n\n- mideasthiring[.]com\n\n- office-shop[.]me\n\n- onedrivelive[.]me\n\n- onedriveupdate[.]net\n\n- online-audible[.]com\n\n- online-chess[.]live\n\n- outlookde[.]live\n\n- outlookdelivery[.]com\n\n- remgrogroup[.]com\n\n- saipem[.]org\n\n- sauditourismguide[.]com\n\n- savemoneytrick[.]com\n\n- sharepointnotify[.]com\n\n- sparrowsgroup[.]org\n\n- supportskype[.]com\n\n- talent-recruitment[.]org\n\n- talktalky[.]azurewebsites[.]net\n\n- thefreemovies[.]net\n\n- updateddns[.]ddns[.]net\n\n- updatedefender[.]net\n\n- updatedns[.]ddns[.]net\n\n- updateservices[.]co\n\n\n-----\n\n#### 3. Azerbaijan\n\n##### Domains\n\n- localadmin[.]online\n\n- localadmin[.]ru\n\n- analyzeryandex[.]000webhostapp[.]com\n\n- vote2021[.]w3spaces[.]com\n\n##### Credential phishing URLs\n\n- localadmin[.]online/votes/security\n\n- localadmin[.]online/vote\n\n- localadmin[.]online/vote/fb/login.html\n\n#### 4. CIB: Costa Rica, El Salvador\n\n##### Domains\n\n- latinoamericareporta[.]com\n\n- revistadcr[.]com\n\n#### 5. CIB: Russia, Ukraine\n\n##### Domains\n\n- kavkazru[.]press\n\n- politica[.]in[.]ua\n\n#### 6. CIB: Russia, Ukraine\n\n##### Domains\n\n- monitor-ua[.]com\n\n- ukraine2day[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://about.fb.com/wp-content/uploads/2022/04/Meta-Quarterly-Adversarial-Threat-Report_Q1-2022.pdf"
    ],
    "report_names": [
        "Meta-Quarterly-Adversarial-Threat-Report_Q1-2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d0e8337e-16a7-48f2-90cf-8fd09a7198d1",
            "created_at": "2023-03-04T02:01:54.091301Z",
            "updated_at": "2025-03-27T02:00:03.119447Z",
            "deleted_at": null,
            "main_name": "APT42",
            "aliases": [
                "UNC788",
                "CALANQUE"
            ],
            "source_name": "MISPGALAXY:APT42",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3ce91297-e4c0-4957-8dd7-9047a3e23dc7",
            "created_at": "2023-01-06T13:46:39.054248Z",
            "updated_at": "2025-03-27T02:00:02.985963Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "IMPERIAL KITTEN",
                "Yellow Liderc",
                "Imperial Kitten",
                "TA456",
                "DUSTYCAVE",
                "Crimson Sandstorm"
            ],
            "source_name": "MISPGALAXY:Tortoiseshell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "47fa514e-15a8-4adb-a782-e2ffb12944d8",
            "created_at": "2024-04-24T02:00:49.644637Z",
            "updated_at": "2025-03-27T02:00:55.560836Z",
            "deleted_at": null,
            "main_name": "UNC788",
            "aliases": [
                "UNC788"
            ],
            "source_name": "MITRE:UNC788",
            "tools": [
                "HilalRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "583cdac5-eb9d-46e9-a0f9-7594c4b18281",
            "created_at": "2024-05-01T02:03:08.017491Z",
            "updated_at": "2025-03-27T02:05:17.30797Z",
            "deleted_at": null,
            "main_name": "COBALT FIRESIDE",
            "aliases": [
                "CURIUM ",
                "DEV-0228 ",
                "HIVE0095 ",
                "Imperial Kitten ",
                "TA456 ",
                "Tortoiseshell ",
                "UNC3890 ",
                "Yellow Liderc ",
                "Crimson Sandstorm "
            ],
            "source_name": "Secureworks:COBALT FIRESIDE",
            "tools": [
                " LEMPO",
                " LiderBird",
                "FireBAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b5b24083-7ba6-44cc-9d11-a6274e2eee00",
            "created_at": "2022-10-25T16:07:24.337332Z",
            "updated_at": "2025-03-27T02:02:10.177597Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "Crimson Sandstorm",
                "Curium",
                "Houseblend",
                "Imperial Kitten",
                "Marcella Flores",
                "Operation Fata Morgana",
                "TA456",
                "Yellow Liderc"
            ],
            "source_name": "ETDA:Tortoiseshell",
            "tools": [
                "IMAPLoader",
                "Infostealer",
                "IvizTech",
                "LEMPO",
                "MANGOPUNCH",
                "SysKit",
                "get-logon-history.ps1",
                "liderc",
                "stereoversioncontrol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/e939cfd78126bc61e1f84d71ec84bce6b8798040.pdf",
        "text": "https://archive.orkl.eu/e939cfd78126bc61e1f84d71ec84bce6b8798040.txt",
        "img": "https://archive.orkl.eu/e939cfd78126bc61e1f84d71ec84bce6b8798040.jpg"
    }
}