{
    "id": "67e5a306-4355-47d6-a1e3-4a40a579a819",
    "created_at": "2023-01-12T15:00:44.999718Z",
    "updated_at": "2025-03-27T02:16:37.14705Z",
    "deleted_at": null,
    "sha1_hash": "e38efbf4fd50857057aefa939734a6752a96e5fa",
    "title": "2017-12-11 - BrickerBot Author Retires Claiming to Have Bricked over 10 Million IoT Devices",
    "authors": "",
    "file_creation_date": "2022-05-27T22:39:05Z",
    "file_modification_date": "2022-05-27T22:39:05Z",
    "file_size": 322531,
    "plain_text": "# BrickerBot Author Retires Claiming to Have Bricked over 10 Million IoT Devices\n\n**[bleepingcomputer.com/news/security/brickerbot-author-retires-claiming-to-have-bricked-over-10-million-iot-devices/](https://www.bleepingcomputer.com/news/security/brickerbot-author-retires-claiming-to-have-bricked-over-10-million-iot-devices/)**\n\nCatalin Cimpanu\n\nBy\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nDecember 11, 2017\n07:35 PM\n1\n\nThe author of the BrickerBot malware has announced his retirement in an email to Bleeping\nComputer, also claiming to have bricked over 10 million devices since he started the\n\"Internet Chemotherapy\" project in November 2016.\n\nKnown as The Doctor (self-given name) and The Janit0r (HackForums nickname), this\n[individual (or group) is the author of BrickerBot, a malware strain that was purposely](https://archive.is/PQAnU#selection-13.5156-13.5200)\ncreated to brick IoT devices.\n\nFirst spotted in April this year, BrickerBot operates by scanning the Internet for vulnerable\ndevices and then using exploit code to gain a foothold on the exposed equipment to rewrite\nthe device's flash storage with random data.\n\nDevices infected with BrickerBot often need to be reinstalled, or in some cases, replaced\naltogether, as the malware sometimes rewrites their firmware.\n\n## BrickerBot is a controversial project\n\n\n-----\n\nFollowing BrickerBot s public disclosure, The Janit0r reached out to Bleeping Computer and\n[explained why he created BrickerBot. In an interview this spring, the Janitor explained that](https://www.bleepingcomputer.com/news/security/brickerbot-author-claims-he-bricked-two-million-devices/)\nhe refers internally to BrickerBot as \"Internet Chemotherapy\" and that he created the\nmalware as a way to sabotage vulnerable devices before they were infected with the Mirai\nmalware, which a hacker had used in the autumn of 2016 to launch some of the biggest\nDDoS attacks known to date.\n\nThat Mirai author also leaked the malware's source code online, in an attempt to hide his\ntracks by allowing other crooks to set up their very own Mirai botnet variations. His plan\nsucceeded, and a free-for-all ensued with several Mirai botnets popping up everywhere\n[online, powering on-demand DDoS cannons.](https://www.bleepingcomputer.com/news/security/you-can-now-rent-a-mirai-botnet-of-400-000-bots/)\n\nThe Janit0r said this onslaught on the IoT scene determined him to create BrickerBot as a\nway to take vulnerable devices offline, force owners to install updated firmware, and take\nthem out of the reach of Mirai botnets.\n\nIn all conversations, the Janit0r seemed an individual who believed he was fighting the\ngood fight, albeit many users and experts have not seen his actions as neither \"good\" or\neven \"legal.\"\n\n## BrickerBot continued to operate all year\n\nDespite criticism, BrickerBot did not stop and Bleeping Computer reported on other attacks\n[over the summer, such as the ones against a US ISP and](https://www.bleepingcomputer.com/news/security/us-isp-goes-down-as-two-malware-families-go-to-war-over-its-modems/) [several Indian Internet providers.](https://www.bleepingcomputer.com/news/security/brickerbot-dev-claims-cyber-attack-that-affected-over-60-000-indian-modems/)\n\nThese were only the documented cases, and the BrickerBot author claimed in many emails\nto have been behind many other attacks and downtimes all over the world.\n\n\n-----\n\n## BrickerBot explains why he retired\n\nIn an email sent today to Bleeping Computer, The Janit0r announced his sudden retirement\nand explained why he reached this decision.\n\nI believe that the project has been a technical success, but I am now starting to worry that it\nis also having a deleterious effect on the public's perception of the overall IoT threat.\nResearchers keep issuing high profile warnings about genuinely dangerous new botnets,\nand a few weeks or even days later they are all but gone. Sooner or later people are going\nto start questioning the credibility of the research and the seriousness of the situation.\n\nThe Janit0r cites the cases of Persirai, Hajime, or Reaper botnets that have been\nadvertised as \"the next big thing\" in terms of IoT botnets, but have never lived up to the\nhype.\n\nHe now fears that because of his work in the shadows, people are not taking IoT devices to\nbe a credible threat anymore. He believes that he needs to stop, so people truly understand\nhow many vulnerable devices are out there.\n\nIt was rational to take action in an attempt to buy everyone time to get their affairs in order\nand there has been some progress over the past year in the form of new security standard\nproposals and so on. I however believe that people, organizations and goverments aren't\ndoing enough nor moving quickly enough and we're running out of time. Because of this I've\ndecided to make a public appeal regarding the severity of the situation. Taking credit for all\nthe carnage of the past year has serious downsides for me and my mission. [...] However I\n\n\n-----\n\nalso recognize that if I keep doing what I m doing then people of influence may simply\nperceive the IoT security disaster as less urgent when in reality they should consider it an\nemergency requiring immediate action.\n\nThe Janit0r then adds that once his efforts became public, the operators of IoT DDoS\nbotnets also started taking precautions against BrickerBot, making his work even harder.\n\nBut Janit0r is also afraid of legal repercussions from authorities. The malware dev is fully\naware that what he's been doing is highly illegal, as it might have caused financial losses to\ncompanies around the world. The DHS surely noticed his actions, because it issued an\n[official alert after BrickerBot's public disclosure.](https://ics-cert.us-cert.gov/alerts/ICS-ALERT-17-102-01A)\n\nThere's also only so long that I can keep doing something like this before the government\ntypes are able to correlate my likely network routes (I have already been active for far too\nlong to remain safe). For a while now my worst-case scenario hasn't been going to jail, but\nsimply vanishing in the middle of the night as soon as some unpleasant government figures\nout who I am.\n\n## Janit0r dumps some of BrickerBot's source code\n\nThese are the reasons the BrickerBot author invoked in the email Bleeping Computer\nreceived earlier today. Besides the email, Janit0r also published a manifesto on several\ncompromised devices.\n\nBleeping Computer is not going to link to this manifesto since it also contains the source\ncode for some of BrickerBot's attack (bricking) modules. We are also not publishing\nsnippets from this manifesto, since a basic Google search could reveal copies of this file\nonline.\n\nWe are doing this as a favor for industry experts who said the leaked code contains at least\none zero-day that could be abused by other malware authors.\n\n\n-----\n\nBut Janit0r did not publish all his code.\n\nMy ssh crawler is too dangerous to publish. It contains various levels of automation for the\npurpose of moving laterally through poorly designed ISP networks and taking them over\nthrough only a single breached router. My ability to commandeer and secure hundreds of\nthousands of ISP routers was the foundation of my anti-IoT botnet project as it gave me\ngreat visibility of what was happening on the Internet and it gave me an endless supply of\nnodes for hacking back.\n\n## Janit0r behind long list of security incidents\n\nAll in all, the Janit0r quitting announcement focuses on trying to raise awareness to the fact\nthat ISPs and device vendors play a major role in today's sad state of IoT security.\n\nThe BrickerBot author goes on to detail a case where he breached an ISP's network,\ndisrupted devices for months, yet ISP employees failed to understand what was happening,\nlet alone take precautionary actions.\n\nHe also lists a long list of incidents he claimed to have been behind, from events affecting\nDeutsche Telekom in Germany to Rogers in Canada, and various countries across Africa,\nAsia, and South America.\n\nBy far the most interesting incident is the one that has been previously classified as a\n\"ransomware\" attack, albeit it did not make any sense now or at the time.\n\n\n-----\n\n[The incident refers to a ransomware infection reported by the Washington Post that affected](https://www.washingtonpost.com/local/public-safety/hackers-hit-dc-police-closed-circuit-camera-network-city-officials-disclose/2017/01/27/d285a4a4-e4f5-11e6-ba11-63c4b4fb5a63_story.html?utm_term=.cb15323dcff6)\n70% of storage devices that record data from Washington DC's police surveillance\ncameras. The incident took place eight days before President Trump's inauguration, and\ncaused some panic at the time.\n\nAccording to the Janit0r, the incident can be attributed to BrickerBot running amok in some\nDC police-owned DVRs, which are typically the place where you find IoT malware and not\nransomware.\n\n## The Janit0r preaches IoT security before going in the shadows\n\nJanit0r's farewell message also includes some advice. For starters, he recommends that\nISPs use basic tools like Shodan to audit their own networks and isolate ports and services\nthat do not need to be exposed online.\n\nSecond, he advises users to sanction IoT vendors that do not deliver security updates in a\ntimeline manner and refuse to purchase devices from a known offender.\n\nThird, lobbying politicians about IoT security standards is also a good way to push IoT\nsecurity forward.\n\nFourth, Janit0r advises security researchers to volunteer their free time to organizations\nsuch as GDI Foundation or the Shadowserver Foundation, which have been working to\nsecure some of these vulnerable devices.\n\nLast but not least, he advises that some of us that have too much time and money on our\nhands to start legal actions against the owners of some of these vulnerable devices. Janit0r\nbelieves that a constant legal threat could force companies and ISPs to install security\nupdates and isolate equipment on private networks in a timely manner.\n\nWe'll end this article with a message from The Janit0r —original text preserved.\n\nYOU SHOULD WAKE UP TO THE FACT THAT THE INTERNET IS ONLY ONE OR\nTWO SERIOUS IOT EXPLOITS AWAY FROM BEING SEVERELY DISRUPTED.\n\n### Related Articles:\n\n[Microsoft detects massive surge in Linux XorDDoS malware activity](https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/)\n\n[Microsoft: Sysrv botnet targets Windows, Linux servers with new exploits](https://www.bleepingcomputer.com/news/security/microsoft-sysrv-botnet-targets-windows-linux-servers-with-new-exploits/)\n\n[New cryptomining malware builds an army of Windows, Linux bots](https://www.bleepingcomputer.com/news/security/new-cryptomining-malware-builds-an-army-of-windows-linux-bots/)\n\n[Ukrainian imprisoned for selling access to thousands of PCs](https://www.bleepingcomputer.com/news/security/ukrainian-imprisoned-for-selling-access-to-thousands-of-pcs/)\n\n[Access:7 vulnerabilities impact medical and IoT devices](https://www.bleepingcomputer.com/news/security/access-7-vulnerabilities-impact-medical-and-iot-devices/)\n\n\n-----\n\n[Botnet](https://www.bleepingcomputer.com/tag/botnet/)\n[BrickerBot](https://www.bleepingcomputer.com/tag/brickerbot/)\n[Internet of Things](https://www.bleepingcomputer.com/tag/internet-of-things/)\n[IoT](https://www.bleepingcomputer.com/tag/iot/)\n\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nCatalin Cimpanu is the Security News Editor for Bleeping Computer, where he covers topics\nsuch as malware, breaches, vulnerabilities, exploits, hacking news, the Dark Web, and a\nfew more. Catalin previously covered Web & Security news for Softpedia between May\n2015 and October 2016. The easiest way to reach Catalin is via his XMPP/Jabber address\nat campuscodi@xmpp.is. For other contact methods, please visit Catalin's author page.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/how-to-check-your-hp-laptop-for-the-synaptic-keylogger-and-remove-it/)\n[Next Article](https://www.bleepingcomputer.com/news/security/file-spider-ransomware-targeting-the-balkans-with-malspam/)\n\n### Comments\n\n[Occasional - 4 years ago](https://www.bleepingcomputer.com/forums/u/1059255/occasional/)\n\nThanks for this story, CC. It's one of those where you can find yourself, arguing with\nyourself - as to whether, on balance, the actor/group's activities make things better or\nworse.\n\nCriticisms of IoT hype, promotion and implementation are, if anything, not strong\nenough - but it's also troubling when individuals or groups take it on themselves to\npolice the behavior of others though force. While actions speak loader than words;\nyou can't have a debate, or find reasoned solutions to emerging problems, with sides\nimposing their will by force.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-11 - BrickerBot Author Retires Claiming to Have Bricked over 10 Million IoT Devices.pdf"
    ],
    "report_names": [
        "2017-12-11 - BrickerBot Author Retires Claiming to Have Bricked over 10 Million IoT Devices.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535644,
    "ts_updated_at": 1743041797,
    "ts_creation_date": 1653691145,
    "ts_modification_date": 1653691145,
    "files": {
        "pdf": "https://archive.orkl.eu/e38efbf4fd50857057aefa939734a6752a96e5fa.pdf",
        "text": "https://archive.orkl.eu/e38efbf4fd50857057aefa939734a6752a96e5fa.txt",
        "img": "https://archive.orkl.eu/e38efbf4fd50857057aefa939734a6752a96e5fa.jpg"
    }
}