{
    "id": "67f60806-d208-4ffa-a433-5758db85c57c",
    "created_at": "2023-01-12T15:07:46.022388Z",
    "updated_at": "2025-03-27T02:05:52.942757Z",
    "deleted_at": null,
    "sha1_hash": "c173a1698d7de81e2c81cafd7fad062ec7a9959b",
    "title": "2022-05-26 - Grandoreiro Banking Malware Resurfaces for Tax Season",
    "authors": "",
    "file_creation_date": "2022-09-01T10:07:17Z",
    "file_modification_date": "2022-09-01T10:07:17Z",
    "file_size": 992950,
    "plain_text": "# Grandoreiro Banking Malware Resurfaces for Tax Season\n\n**[trustwave.com/en-us/resources/blogs/spiderlabs-blog/grandoreiro-banking-malware-resurfaces-for-tax-season](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/grandoreiro-banking-malware-resurfaces-for-tax-season)**\n\nTrustwave SpiderLabs in early April observed a Grandoreiro malware campaign targeting bank\nusers from Brazil, Spain, and Mexico. The campaign exploits the tax season in target countries by\nsending out tax-themed phishing emails.\n\n[Grandoreiro was first detected in 2016 is one of the largest banking trojan families developed to](https://attack.mitre.org/software/S0531/)\nstrike targets Latin America. The malware can log keystrokes, capture clipboard data, steal\ncookies and other user information using malicious browser extensions, and monitor online\nbanking activity.\n\n## Spam Delivery\n\nAn attack begins with threat actor distributing email spam in Portuguese. The email pretends to be\na memo coming from “Serviço de Administração Fiscal” or “Tax Administration Service” as\ntranslated. It has a link that downloads a malicious PDF document hosted on a compromised\nwebsite.\n\n\n-----\n\n_Figure 1. Email spam in Portuguese_\n\nThe PDF purports to come from DocuSign and tricks the user into clicking the link leading to a ZIP\narchive containing an MSI installer. The same compromised website as the PDF document also\nhosts the ZIP archive.\n\n\n-----\n\n_Figure 2. DocuSign-themed PDF file_\n\n## The MSI Installer\n\nDigging deeper into the MSI installer using the Orca MSI Editor, we observed a suspicious code\n[embedded in the CustomAction table. The CustomAction enables the author of an installation](https://docs.microsoft.com/en-us/windows/win32/msi/about-custom-actions)\npackage to extend the capabilities of standard actions by including executables, dynamic-link\nlibraries, and scripts.\n\n_Figure 3. CustomAction table view in Orca MSI Editor_\n\nThe block of the custom code written in JScript serves as a downloader of the final payload. The\ncode will perform host and IP address location checks before it downloads, extracts, and executes\nthe final payload.\n\nThe JScript code avoids infecting a host with “dx” as the network username. It uses the\ngeolocation service http[://]ip-api[.]com/json to gather the target’s IP address location data.\nDistribution of the final payload is only limited to IP addresses located in Brazil, Spain, and Mexico.\nAfter passing the checks, the final payload will be downloaded from\nhxxp[://]167[.]114[.]43[.]27:4433/mrrrpx2503[.]zip and extracted at\n%AppData%\\Roaming\\RIPIOSDS in the background.\n\n\n-----\n\n_Figure 4. Code snippet of the JScript custom action_\n\n_Figure 5. JScript block that checks for IP address location_\n\nThe downloader retrieves a ZIP package with an executable and multiple DLL components. The\nexecutable (kitbootnetsuuui.exe) appears to be legitimate software called the Advanced Installer\nIntune Tool used in the deployment of software packages and signed with a valid signature.\n\nThe executable is bundled with three DLLs. Two of these are uires.dll, the resource module of the\nAdvanced Installer tool, and the Zlib data compression library – zlibai.dll, both of which are\nlegitimate libraries. The third DLL masqueraded as a debug help library, dbghelp.dll, is the\nGrandoreiro banking trojan.\n\nTable 1. Filenames and hashes of zip package\n\n**Filename** **SHA1**\n\n\nkitbootnetsuuui.exe (Advanced Installer\nIntune Tool)\n\nuires.dll (Resource module for Advanced\nInstaller)\n\n\n5dd0b062dda3991c09e439f0688ba94004573d6e\n\nbe3bebab8db0087d92316b5f54b5aaf5f51fbf46\n\n\nzlibai.dll (Zlib data compression library) aadc8a089d1288e91e6ba9e095d37d30de3bbb18\n\ndbghelp.dll (Grandoreiro banking trojan) ff908727cc1b5335e541fbcd80a327565f308bc7\n\n\n-----\n\n_Figure 6. Extracted files of the final payload_\n\n## Grandoreiro banking trojan\n\n[We have seen several common characteristics of Grandoreiro in this variant, as documented here.](https://attack.mitre.org/software/S0531/)\nWritten in Delphi, the threat actor inflated the DLL to 300MB by adding bitmap images to the\nresource section. This technique is known as binary padding and is used to evade detection. Other\nLatin American banking trojans like Javali have implemented a similar technique.\n\nAfter running the signed executable, it will load the malicious DLL payload and perform the\nmalicious routines. Grandoreiro leverages the DLL side-loading technique to conceal malicious\nactions under a legitimate software process. This method will likely evade detection by AV\nscanners since the benign executable used to side-load the DLL may not raise alerts during\nexecution.\n\nThe trojan sets up persistence using the registry run key to enable automatic execution at every\nstartup:\n\n_Key: HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run_\n\n_Value: HYNCDLXKKIO={SAMPLE_PATH}\\kitbootnetsuuui.exe_\n\nGrandoreiro may gather host information such as operating system version, hostname, display\nmonitor information, keyboard layout, and mouse type. Moreover, it is capable of enumerating\ninstalled security programs and web browsers. It can execute shell commands like pinging a\ndomain or an IP address and kill running processes. Keylogging, monitoring users’ browsing\nactivity, capturing clipboards, and stealing session cookies are part of its backdoor capabilities.\n\nTarget bank names, executable names, installation locations, and other internal strings are\nencrypted with the key \"F5454DNBVXCCEFD3EFMNBVDCMNXCEVXD3CMBKJHGFM\" using\nXOR-based encryption. Grandoreiro resolves these strings and API calls during execution to\nevade detection.\n\nTable 2. List of several encrypted strings with equivalent plaintext\n\n**Encrypted String** **Plaintext**\n\n\n-----\n\n34C116B01045F71235F1 Santander\n\n7B89EE046F849392A4BF8747CA789F40964FF429 TRAVASITE |Bradesco\n\nC34B8C35AF16C0689EE8739745F519C3187DF90509 Internet Banking BNB\n\n3FC6025AF66E8B4EF53AF177AA49EB15BB5A8FF018D26E AplicativoBradesco.exe\n\n102A4B89CB0B3BEE16DE ~\\Trusteer\n\n4DD31260968283B86B9AD475 HSBC España\n\n9BB814B217B052CE76B846 chrome.exe\n\nA5A022B71EA6BD7A9F9B5992B4 AvastSvc.exe\n\n[We wrote a string decryptor and created a list of decrypted notable strings available at this link.](https://github.com/SpiderLabs/Grandoreiro-decryptor/blob/main/grandoreiro_string_decryptor.py)\n\n## Domain Generation Algorithm (DGA)\n\nGrandoreiro's DGA implementation relies on the current date as a seed variable. It queries an NTP\nserver, e.g., time.nist.gov, to retrieve the current date and time. The day combined with the letter\ncorresponding to the month in Table 3 and the rightmost digit of the current year as a suffix will act\nas the initial value. For instance, the date 13/04/2022 will yield \"13W2\".\n\nTable 3. Monthly key\n\n1 2 3 4 5 6 7 8 9 10 11 12\n\nN S L W B K Z O D E P V\n\nThe initial value is XORed with the current date's key; refer to Table 4 below. The hex equivalent of\nthe product of the XOR operation, all characters should be upper case, will be concatenated to the\nstatic string, nuu, serving as a prefix. The output is base64-encoded using the custom alphabet\nset, \"g-yA-Za-fz0-9+/=\", with the padding removed, generating the subdomain name.\n\nTable 4. Daily XOR keys for each month\n\n\nDate Jan\n(1)\n\n\nFeb\n(2)\n\n\nMar\n(3)\n\n\nApr\n(4)\n\n\nMay\n(5)\n\n\nJun\n(6)\n\n\nJul\n(7)\n\n\nAug\n(8)\n\n\nSep\n(9)\n\n\nOct\n(10)\n\n\nNov\n(11)\n\n\nDec\n(12)\n\n\n-----\n\n1 iota fxcj vdjq dinu wcmt qbgo pdha xejr ewdj tyio hzel wbmt\n\n2 bcmp egxa oruz eglo ikpu wyej gjmr txak behm ehkp gvzf vzcm\n\n3 jorh ndgy nthy mrdw orwi uxci insh fwbh takp ehyd lotz ptyk\n\n4 adgn duze clqd lqtv fknu vyin qthy xafk ejmt knsg loty ckpd\n\n5 nqta orwb loty ckpd zehn adgn orev seva zdgm knsx ails ruzj\n\n6 lqty hmpu mpty cgkp pswc waej fvyd cfin lqty nqva svyk mpsz\n\n7 hwbg aejo jmrw quyi qehz nsfw vybg adin hlqu adgl gjnt hkou\n\n8 ilqe fuze cglp vyin mpsx nrdu hwze dhkp gjmr vybg vybi sfwa\n\n9 orub knsg fuxc qvyi swak nrfv qtfw vycg rduz knqe bjot uxcm\n\n10 fuze mpsx ckod vycn uxam aimr yblq ptgx loth orva vybn dhkq\n\n11 rwzj dhmq zcmr osxc fimr uxak orwb ailq swbk wzdi gjot afin\n\n12 jmpw euxc knsx loty uxch dhkp cgjo gjns knrw mqev wzdj qdgx\n\n13 kpsx knqg aehn ilot xakp xadi mptg vybg gvze ptyi rduz bfin\n\n14 aein qdgx zehm adgl mpdu gvaf zcmr ilot zckp gjot pthy nqth\n\n15 uxch ailq xadi wbej ails lpsg ruzj ilot impu hwbg jmpd ilot\n\n16 mrdu vyin xadk sehy svyk yblq vzcm bjnt nqua bjmr psxc nqev\n\n17 akns jnsx seva jnrf adin twak impu mquz mrfx swbk swzk ruyi\n\n18 nqva dglq imqe zjnr nqth rvyi knqv ehlp ilqe fjmr chkp ybel\n\n19 mrdv ydgl txcl ruyj jnsg qtyi mpsx hwze psgx mpsx vaej jorf\n\n\n-----\n\n20 rwam hwbg bfio hlqu mrva orvb adhl tfwb cfip ruxc xaek aeho\n\n21 qthy rehz xadi ybel ejmr bejo ychl jmpd fils mpuz nrfv fuxc\n\n22 yblq bjot tgwb dhwb mqeu reuz xafk korf nqva psxc ckpd ruxc\n\n23 ilqe uybm sehy jmpd zjmr wzcm dgva jmpf qvyi ruxc svak uxch\n\n24 rehy gjmt knsg xbjo orwb rtyc ilpt wzjo xain svzj fkns nqdv\n\n25 qtfw zehm psxc pswb bejo gjmr ilqe wzjo losy uxcm ilqv lpsy\n\n26 lorf xcgl knsx zehm dgwc behm ilqe mpsx loty zcmr psxc hxbg\n\n27 jmqv clqd mpdu dgxc twbl zcmr loty uxch dglq nrva lpdu ybfk\n\n28 hlou lorh qduz orfw hkou lorf vybl sfuz xadi ruzj psgx nqev\n\n29 zcgl zclr xaip psgx uxch uxbk jnqv rdgx ehxb svzk nqev orvb\n\n30 tfuz uxbl qvyi uxaf rdgx uxbm jmpd nrdu loth quxc ilqe fwze\n\n31 jmpd orwb kosx aehm vzjn pswb pthx aimr seva puxc bkpt blot\n\n32 orub kpsx losy ehmr bfjo zchm orfw uxak jnsf knqv twal oruz\n\nThe subdomain is prefixed to free Dynamic DNS providers such as freedynamicdns[.]org to serve\nas command-and-control infrastructure for data retrieval and exfiltration. We have precalculated\nthe domains and reported them to the DDNS service provider for a takedown action, but it has not\nyet responded to our request. Our Python code implementation of Grandoreiro’s DGA is available\n[here:](https://github.com/SpiderLabs/Grandoreiro-decryptor/blob/main/grandoreiro_dga_gen.py)\n\n\n-----\n\n_Figure 7. Process of Grandoreiro's domain generation algorithm_\n\n## Conclusion\n\nIn this recent campaign, Grandoreiro consistently exhibited a variety of tricks to evade detection,\nsuch as code obfuscation, binary padding, and the use of MSI's custom action to execute its\npayload, to name a few. The re-emergence of the Grandoreiro banking trojan indicates that it\nevolved and remains a threat in the Latin American and Portuguese/Spanish-speaking countries.\n\n## IoCs\n\n**URLs:**\n\nhxxp[://]belfaro[.]com[.]br/admin/PROCESSO-02028[.]82655[.]2019[.]550[.]pdf\n\nhxxps[://]belfaro[.]com[.]br/admin/nota[.]php?file=docprocesso27032022[.]zip\n\nhxxp[://]167[.]114[.]43[.]27:4433/mrrrpx2503[.]zip\n\n167[.]114[.]88[.]99 (C2 IP Address)\n\n\n-----\n\niuc1[\\da-z]{11}\\.freedynamicdns\\.org (C2 DGA)\n\n**Files:**\n\nSHA1: 1e81d73ff946560692a01c38649227897339dd5a\n\ndocprocesso27032022i512l3j0i271l2.3130j0j15&sourceid=chrome&ie=UTF-8.msi (downloader)\n\nSHA1: ff908727cc1b5335e541fbcd80a327565f308bc7\n\ndbghelp.dll (Grandoreiro banking trojan)\n\n## References\n\nGrandoreiro Decryptor: https://github.com/SpiderLabs/Grandoreirodecryptor/blob/main/grandoreiro_dga_gen.py\n\nGrandoreiro DGA code: https://github.com/SpiderLabs/Grandoreirodecryptor/blob/main/grandoreiro_string_decryptor.py\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-26 - Grandoreiro Banking Malware Resurfaces for Tax Season.pdf"
    ],
    "report_names": [
        "2022-05-26 - Grandoreiro Banking Malware Resurfaces for Tax Season.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536066,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1662026837,
    "ts_modification_date": 1662026837,
    "files": {
        "pdf": "https://archive.orkl.eu/c173a1698d7de81e2c81cafd7fad062ec7a9959b.pdf",
        "text": "https://archive.orkl.eu/c173a1698d7de81e2c81cafd7fad062ec7a9959b.txt",
        "img": "https://archive.orkl.eu/c173a1698d7de81e2c81cafd7fad062ec7a9959b.jpg"
    }
}