{
    "id": "68151104-aa72-4e54-9686-b2a716fe3ecd",
    "created_at": "2023-01-12T15:10:54.563984Z",
    "updated_at": "2025-03-27T02:17:05.815374Z",
    "deleted_at": null,
    "sha1_hash": "a275883d2d6c35ae2f702ea87ff0f52a5244e3e3",
    "title": "2020-11-11 - Extrapolating Adversary Intent Through Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T19:39:15Z",
    "file_modification_date": "2022-05-28T19:39:15Z",
    "file_size": 499642,
    "plain_text": "# Extrapolating Adversary Intent Through Infrastructure\n\n**[domaintools.com/resources/blog/extrapolating-adversary-intent-through-infrastructure](https://www.domaintools.com/resources/blog/extrapolating-adversary-intent-through-infrastructure)**\n\n## Introduction\n\nAdversary cyber operations require communication to victim networks in order to deliver\neffects on objectives. When performed over public networks, competent adversaries rarely\n(if ever) communicate directly from their “home” locations but use various proxied\ninfrastructure: servers denoted by IP addresses, or identified via domain names. While\nthere are many instances of adversaries using either pseudo-random or meaningless\nstrings for domains, or eschewing these items altogether and simply communicating directly\nto an IP address, instances of deliberate adversary name choice can be revealing.\n\n\n-----\n\nLooking at domain names as composite objects - consisting of multiple components such\nas the domain registrar or where a domain resolves - allows us to track adversary activity\nand infrastructure creation through tendencies and patterns. Just as with items such as\nauthoritative name servers or registration information, the very name chosen for a domain\nhas significance, and can identify fundamental adversary behaviors.\n\nAdversaries typically leverage themes in domain creation that can indicate aspects of\nattacker operations. This could include:\n\nBlending in with likely “normal” traffic within targeted environments.\nMirroring services or functions targeted for operations, such as logon portals.\nMatching target characteristics to facilitate interaction or lower suspicion when\nidentified.\n\nBy studying adversary naming choices, we can begin identifying various aspects of attacker\noperations - from how initial access operations may take place through likely victimology\nbased on observations. In the following three examples, we will explore relatively recent\ncampaigns to identify how adversary naming choice and patterns can be used to gain\ngreater understanding of attacker goals and operations.\n\n## Sandworm and the 2018 Olympics\n\n[Reviewing the recent US Department of Justice (DOJ) indictment against six members of](https://www.justice.gov/opa/press-release/file/1328521/download)\n[Russian military intelligence (GRU) Unit 74455, commonly referred to as “Sandworm”,](https://attack.mitre.org/groups/G0034/)\nshows several infrastructure items related to attacks on the 2018 Pyeongchang Winter\nOlympics:\n\nMsrole[.]com\nJeojang[.]ga\n\n\n-----\n\nThe items were used to spoof Microsoft services and the Korean Ministry of Agriculture,\nFood, and Rural Affairs, respectively. As supported in the indictment and other technical\nanalysis, these items were leveraged as themes for infrastructure used to support phishing\nactivity and credential theft.\n\nMore interesting still, further analysis using DomainTools Iris indicates a wider campaign\nwith additional themes. For example, viewing Passive DNS (pDNS) information for\nmsrole[.]com identifies a series of IP addresses used during the run-up to the Olympics:\n\nMost significant, and highlighted above, is the 27.102.102.30 address. Hosted in The\nRepublic of Korea (ROK, or South Korea), this address hosted msrole[.]com during the\n[period of action prior to the Olympic Destroyer incident during the Pyeongchang opening](https://www.virusbulletin.com/virusbulletin/2018/10/vb2018-paper-who-wasnt-responsible-olympic-destroyer/)\nceremonies in February 2018. Analyzing this IP address and its history during the time prior\nto the Olympic Destroyer incident reveals additional details:\n\n\n-----\n\nIn addition to mapping the movement of msrole[.]com over time, Passive DNS monitoring\nvia DomainTools Iris reveals additional items neither noted in the US DOJ indictment nor\npreviously disclosed as part of the OlympicDestroyer event:\n\nCulturecommunication[.]ga\nStarcraft2[.]cf\nSwisstiming[.]cf\n\nWhile “Culture Communication” is somewhat ambiguous, the other items seem\nappropriately themed for the target event and country: Swiss Timing is the official\ntimekeeper of the Olympic Games (including the 2018 Winter Games) through 2032; while\n[StarCraft (both the original and its sequel) remains one of the most popular games (and](https://esportsobserver.com/starcraft-ii-esports-essentials/)\nesport events) in ROK.\n\nIrrespective of other observables (some of which are now unavailable over two years after\nthe events in question), the names used by the GRU operators in creating infrastructure\nreveal degrees of intentionality. As already stated (without details) in the DOJ indictment,\nactions included operations linked to the official Olympics timekeeper organization unearthing the specific domain confirms this observation. But the StarCraft spoof indicates\npotentially wider targeting of ROK persons, leveraging the popularity of the game to create\na mechanism (whose precise functionality is indeterminate now) to further operations\nagainst the ROK-hosted games.\n\n\n-----\n\nWhile we have unearthed additional indicators of compromise (IOCs), more importantly\nthrough analysis of infrastructure we identified a pattern in domain creation centered on a\ncombination of technology (Microsoft spoofing), culture (the StarCraft item), and event (the\n2018 Olympics).\n\n### Sandworm IOCs\n```\nMsrole[.]com           Jeonjang[.]ga\nCulturecommunication[.]ga    Templates-library[.]ml\nStarcraft2[.]cf         appmicrosoft[.]net\nSwisstiming[.]cf\n27.102.102[.]30         141.8.224[.]221\n200.122.181[.]63         107.167.92[.]196\n195.20.51[.]47\n\n## Energetic Bear and Airports\n\n```\nIn October 2020, the US Federal Bureau of Investigation (FBI) and Cybersecurity and\n[Infrastructure Security Agency (CISA) released a joint report on malicious actor targeting of](https://us-cert.cisa.gov/ncas/alerts/aa20-296a)\nlocal government and related critical infrastructure entities in the United States (US). Linked\nto an entity assessed by US government sources to be Russian state sponsored and called\n[variously Energetic Bear,](https://www.crowdstrike.com/blog/adversaries-set-their-sites-on-oil-and-gas-sector/) [Dragonfly, Crouching Yeti, or](https://attack.mitre.org/groups/G0035/) [ALLANITE, the operations focused](https://www.dragos.com/threat/allanite/)\non spoofing legitimate websites as a mechanism for gathering credentials to enable followon intrusions.\n\n[First emerging in Spring 2020 with a compromise at San Francisco International Airport, this](https://www.zdnet.com/article/russian-state-hackers-behind-san-francisco-airport-hack/)\nspecific campaign appears to have expanded significantly to include a number of other\nlocations and regions within the United States - often focused on airports.\n\n\n-----\n\nOf interest in the Energetic Bear campaign though is the shift from credential theft via\nstrategic website compromise - seen in the code snippet found in the SFO website in\n[ESET’s Tweet - to more direct credential phishing. As listed in CISA Alert AA20-269A, the](https://twitter.com/ESETresearch/status/1249981751138627585)\nattacker shifted operations from indirect credential capture to more direct forms through\nwebsite spoofing.\n\nThis behavior is reflected in domains observed in the campaign:\n\nemail.microsoftonline[.]services\ncolumbusairports.microsoftonline[.]host\n\n\n-----\n\nAdditionally, CISA notes a pattern of infrastructure using the following domain name pattern\nassociated with Microsoft Azure cloud services:\n\n[City Name].westus2.cloudapp.azure[.]com\n\nReviewing pDNS data via DomainTools Iris shows that these items all link back to similar\ninfrastructure during their time of weaponization:\n\nPrimary domain themes - spoofing Microsoft - reflect the shift in adversary behavior. When\n[paired with exploit chaining as documented in a related CISA alert, overall the collection of](https://us-cert.cisa.gov/ncas/alerts/aa20-283a)\nobserved behaviors including domain themes demonstrate a significant overall change in\nEnergetic Bear tactics, techniques, and procedures. Identifying such developments as they\nemerge allows defenders to appropriately adapt security measures and analysis of potential\nincidents.\n\n### Energetic Bear IOCs\n\n\n-----\n\n```\nMicrosoftonline[.]host\nMicrosoftonline[.]services\n213.74.101[.]65       138.201.186[.]43\n213.74.139[.]196       5.45.119[.]124\n212.252.30[.]170       193.37.212[.]43\n5.196.167[.]184       146.0.77[.]60\n37.139.7[.]16        51.159.28[.]101\n149.56.20[.]55        108.177.235[.]92\n91.227.68[.]97\n\n## Kimsuky Infrastructure and Themes\n\n```\n[On 27 October 2020, CISA released an extensive report covering activity associated with](https://us-cert.cisa.gov/ncas/alerts/aa20-301a)\nthe [Kimsuky actor. Linked to the Democratic People’s Republic of Korea (DPRK, or North](https://attack.mitre.org/groups/G0094/)\nKorea), Kimsuky is responsible for multiple campaigns against ROK critical infrastructure\nentities, Korean peninsula nuclear negotiation entities, and various targets in ROK, Japan,\nand the United States.\n\nIn addition to coverage of Kimsuky intrusion techniques and behaviors, the CISA report\ncontains nearly one hundred network indicators in the form of domains and subdomains.\nReviewing the naming conventions used identifies three broad themes:\n\nFirst, spoofing popular services, especially in ROK, for infrastructure creation. For example,\n[Kimsuky targets ROK web portal and search engine Naver in multiple instances, such as:](https://www.naver.com/)\n```\nHelp-navers[.]com      naver.com[.]se\nHelpnaver[.]com       naver.hol[.]es\nnaver.co[.]in        naver.koreagov[.]com\nnaver.com[.]cm        naver.onegov[.]com\nnaver.com[.]de        naver.unibok[.]kr\nnaver.com[.]ec        naver[.]cx\nnaver.com[.]mx        naver[.]pw\nnaver.com[.]pl        naverdns[.]co\n\n```\n[Similar activity surrounds Korean webportal Daum:](https://www.daum.net/)\n```\ndaum.net[.]pl        login.daum.kcrct[.]ml\nDaurn.pe[.]hu        login.daum.net-accounts[.]info\ndaurn[.]org         login.daum.unikortv[.]com\n\n```\nService spoofing such as the above can be used to either mimic pages for exploitation or\ncredential harvesting, or as a means to hide command and control (C2) communications.\nHowever, geographic specificity in these particular cases indicate the domains in question\nare almost certainly limited in application to Korean-language audiences. As such, while\nthese items are interesting in learning about Kimsuky activity, they are likely less significant\nfrom a defensive action standpoint for non-Korean entities.\n\n\n-----\n\nSecond, and as observed in some of the domains above, Kimsuky features a pattern of\npersistent service spoofing especially centered around webmail or cloud storage logon\npages. This is expressed through a pattern of subdomain creation reflected across multiple\ndomains, all hosted on the same infrastructure during use. As shown in DomainTools Iris\npDNS results, a familiar pattern emerges with mail-themed subdomains linked to generic,\nIT-themed primary domains:\n\n\n-----\n\nReviewing items active in Kimsuky-related operations shows a persistent pattern. First, a\n“generic” technical domain is used as a root item (e.g., “com-ssl[.]work” or “comvps[.]work”), followed by a common sequence of webmail or related subdomains:\n\nMail\nMail2\nDrive\nOnedrive\nLogin\n\nThe thematic basis behind these items (“e.g., “onedrive.sslport[.]work”) implies intentionality\nas a mechanism for serving a spoofed logon page (in this specific example, for the\nMicrosoft OneDrive service) for credential gathering.\n\nThird, and observed in the subdomains examined above, we can also glimpse potential\nspecific targets of Kimsuky campaigns as reflected in naming patterns and conventions. For\nexample, the following items appear to indicate targeted institutions:\n\nIntranet.ohchr.account-protect[.]work\n\n\n-----\n\nSmt.docomo.ne.jp-ssl[.]work\nRfanews.sslport[.]work\nmail.rfa.sslport[.]work\n\nThe above items appear to mimic the legitimate domain naming patterns of the Office of the\nUnited Nations High Commissioner for Human Rights (ohchr.org), Japanese\n[telecommunication company NTT Docomo (nttdocomo.co.jp), and](https://www.nttdocomo.co.jp/english/) [Radio Free Asia](https://www.rfa.org/english/)\n(rfa.org). Along with domains which reference subjects such as Korean unification, these\nitems allow us to expand our view of Kimsuky activities to include “soft” targets in consumer\ncommunications, human rights causes, and similar entities beyond classic espionage goals.\n\nAnalyzing Kimsuky infrastructure activity allows defenders to glimpse not only attacker\nmethodologies but also potential targets - in terms of both targeted services and targeted\norganizations. With this relatively minimal amount of information, defenders can better\nunderstand Kimsuky motivations and appropriately vector resources for defensive and\nmonitoring purposes.\n\n### Kimsuky IOCs\n\n\n-----\n\n```\naccount.daum.unikftc[.]kr        hogy.desk top[.]work\naccount.daurn.pe[.]hu          intemet[.]work\namberalexander.ghtdev[.]com       intranet.ohchr.account-protect[.]work\nbeyondparallel.sslport[.]work      jonga[.]ml\nBigfile.pe[.]hu             jp-ssl[.]work\nbignaver[.]com             kooo[.]gq\nCdaum.pe[.]hu              loadmanager07[.]com\ncloudmail[.]cloud            login.daum.kcrct[.]ml\ncloudnaver[.]com            login.daum.net-accounts[.]info\ncoinone.co[.]in             login.daum.unikortv[.]com\ncom-download[.]work           login.outlook.kcrct[.]ml\ncom-option[.]work            mail.unifsc[[.]com\ncom-ssl[.]work             mailsnaver[.]com\ncom-sslnet[.]work            member-authorize[.]com\ncom-vps[.]work             myaccount.nkaac[.]net\ncomment.poulsen[.]work         myaccounts.gmail.kr-infos[.]com\ncooper[.]center             myetherwallet.co[.]in\ncsnaver[.]com              myetherwallet.com[.]mx\ndaum.net[.]pl              naver.co[.]in\nDaurn.pe[.]hu              naver.com[.]cm\ndaurn[.]org               naver.com[.]de\ndept-dr.lab.hol[.]es          naver.com[.]ec\ndesk-top[.]work             naver.com[.]mx\ndownloadman06[.]com           naver.com[.]pl\ndubai-1[.]com              naver.com[.]se\neastsea.or[.]kr             naver.hol[.]es\ngloole[.]net              naver.koreagov[.]com\nhelp-navers[.]com            naver.onegov[.]com\nhelp.unikoreas[.]kr           naver.unibok[.]kr\nhelpnaver[.]com             naver[.]cx\nnaver[.]pw               securetymail[.]com\nnaverdns[.]co              servicenidnaver[.]com\nnet.tm[.]ro               smtper[.]cz\nnid.naver.com[.]se           smtper[.]org\nnid.naver.corper[.]be          sslport[.]work\nnid.naver.unibok[.]kr          sslserver[.]work\nnidlogin.naver.corper[.]be       ssltop[.]work\nnidnaver[.]email            sts.desk-top[.]work\nnidnaver[.]net             taplist[.]work\nns.onekorea[.]me            tiosuaking[.]com\norg-vip[.]work             top.naver.onekda[.]com\npreview.manage.org-view[.]work     usernaver[.]com\npro-navor[.]com             view-hanmail[.]net\nread-hanmail[.]net           view-naver[.]com\nread-naver[.]com            vilene.desk-top[.]work\nread.tongilmoney[.]com         vpstop[.]work\nresetprofile[.]com           webmain[.]work\nresultview[.]com            webuserinfo[.]com\nriaver[.]site              ww-naver[.]com\nsankei.sslport[.]work\n108.62.141[.]33             203.249.64[.]219\n146.112.61[.]107            211.38.228[.]101\n150.95.219[.]213            27.102.107[.]221\n\n```\n\n-----\n\n```\n162.244.253[.]107            27.102.127[.]46\n173.234.155[.]126            27.255.77[.]110\n192.185.94[.]206            44.227.65[.]245\n192.203.145[.]170\n\n## Conclusion\n\n```\nExamining the three separate campaigns above, as defenders we are able to infer\nadversary intentionality and purpose based on little more than analysis of domain naming\nschema. When combined with further research, such as additional pivots in DomainTools\nIris into SSL/TLS certificates, hosting infrastructure, and registration patterns, defenders\ncan leverage this knowledge to gain even greater understanding of attacker operations.\n\nYet even without significant additional information, minimal pivoting unearths items of\nsignificance:\n\nSandworm activity targeting multiple areas of South Korean society and the 2018\nOlympics in the run-up to Olympic Destroyer.\nEnergetic Bear shifting operations from passive credential collection via strategic\nwebsite compromise to more active credential phishing through spoofed domains.\nKimsuky operations targeting prominent commercial and non-government\norganizations beyond traditional espionage targets via likely credential capture\nresources.\n\nArmed with this information, defenders can make nuanced, informed decisions about\nadversary development. With such understanding in hand, defenders can appropriately\nadjust security controls and visibility to match observed behaviors. While more robust\nmechanisms for research and analysis exist to allow us to dig even deeper, simple\nrecognition of naming patterns and their implications can prove quite powerful in furthering\nsecurity operations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-11 - Extrapolating Adversary Intent Through Infrastructure.pdf"
    ],
    "report_names": [
        "2020-11-11 - Extrapolating Adversary Intent Through Infrastructure.pdf"
    ],
    "threat_actors": [
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a792743d-78a4-40c9-9d9a-a12c52880297",
            "created_at": "2023-01-06T13:46:38.75457Z",
            "updated_at": "2025-03-27T02:00:02.909884Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "Palmetto Fusion",
                "Allanite"
            ],
            "source_name": "MISPGALAXY:ALLANITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "0a0132a3-526d-4698-be49-5e75530c1417",
            "created_at": "2022-10-25T15:50:23.856139Z",
            "updated_at": "2025-03-27T02:00:55.559398Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "ALLANITE",
                "Palmetto Fusion"
            ],
            "source_name": "MITRE:ALLANITE",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1c4281e9-0a4c-4f20-94a2-25ed3661cc98",
            "created_at": "2022-10-25T16:07:23.301826Z",
            "updated_at": "2025-03-27T02:02:09.72625Z",
            "deleted_at": null,
            "main_name": "Allanite",
            "aliases": [
                "Palmetto Fusion"
            ],
            "source_name": "ETDA:Allanite",
            "tools": [
                "PsExec",
                "SecreetsDump",
                "THC Hydra"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536254,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653766755,
    "ts_modification_date": 1653766755,
    "files": {
        "pdf": "https://archive.orkl.eu/a275883d2d6c35ae2f702ea87ff0f52a5244e3e3.pdf",
        "text": "https://archive.orkl.eu/a275883d2d6c35ae2f702ea87ff0f52a5244e3e3.txt",
        "img": "https://archive.orkl.eu/a275883d2d6c35ae2f702ea87ff0f52a5244e3e3.jpg"
    }
}