{
    "id": "6819f90b-081b-4dca-bdcc-a27093b7505e",
    "created_at": "2023-01-12T15:08:38.703544Z",
    "updated_at": "2025-03-27T02:06:06.393326Z",
    "deleted_at": null,
    "sha1_hash": "1d28287a1f4a50be6cff2b79eace481c6069d72f",
    "title": "2013-09-25 - Win32-Napolar – A new bot on the block",
    "authors": "",
    "file_creation_date": "2022-05-27T22:04:56Z",
    "file_modification_date": "2022-05-27T22:04:56Z",
    "file_size": 333083,
    "plain_text": "# Win32/Napolar – A new bot on the block\n\n**[welivesecurity.com/2013/09/25/win32napolar-a-new-bot-on-the-block/](https://www.welivesecurity.com/2013/09/25/win32napolar-a-new-bot-on-the-block/)**\n\nSeptember 25, 2013\n\nThere is a new bot on the block. ESET identifies it as Win32/Napolar while its author calls it\nsolarbot. This piece of malware came to our attention mid-August because of its interesting\nanti-debugging and code injection techniques.\n\n25 Sep 2013 - 06:46PM\n\nThere is a new bot on the block. ESET identifies it as Win32/Napolar while its author calls it\nsolarbot. This piece of malware came to our attention mid-August because of its interesting\nanti-debugging and code injection techniques.\n\n[There is a new bot on the block. ESET identifies it as Win32/Napolar while its author calls it](http://www.virusradar.com/en/Win32_Napolar/detail)\nsolarbot. This piece of malware came to our attention mid-August because of its interesting\nanti-debugging and code injection techniques. It recently attracted general attention when it\nwas discussed on various reverse engineering forums.\n\nThis malware can serve multiple purposes. The three main ones are to conduct Denial of\nService attacks, to act as a SOCKS proxy server, and to steal information from infected\nsystems. The malware is able to hook into various browsers to steal information that is\nsubmitted in web forms.\n\nWe have uncovered many details about this bot since it became active at the end of July,\nwith in-the-wild infections starting mid-August. There have been reports of thousands of\ninfections, many of them in South America. The countries with the most infections are Peru,\nEcuador, and Columbia. More information on the geographical distribution for this threat can\n[be found on virusradar.](http://virusradar.com/en/Win32_Napolar/detail)\n\nThe author of Win32/Napolar uses a website to promote it. The website looks very\nprofessional and contains detailed information about the bot, including the cost ($200 USD\nfor each build) and even a complete change-log of the evolution of the code.\n\nAlthough we have not yet directly seen Win32/Napolar being distributed in the wild, it seems\nlikely that this threat has been spread through Facebook. Since malware has the ability to\nsteal Facebook credentials, its operator can reuse those credentials to send messages from\ncompromised accounts and try to infect the victim’s friends. Below is a list of filenames we\nhave seen used by this malware family:\n\n_Photo_032.JPG_www.facebook.com.exe_\n_Photo 012-WWW.FACEBOOK.COM.exe_\n\n\n-----\n\n_Photo_014-WWW.FACEBOOK.COM.exe_\n\nInterestingly enough, the use of doubled file extensions (*.JPG.EXE, *.TXT.EXE and so\nforth) to obfuscate a file’s true extension is an old trick, dating back to Windows 95, but\napparently still in use. What is funny about the usage in this particular instance is that the\nauthor of Win32/Napolar does not seem to realize that .COM is a valid, if somewhat old,\nextension for executable files and that these filenames would have allowed their execution\n[without the added .EXE extension. A very recent blog by our colleagues at AVAST confirms](https://blog.avast.com/2013/09/25/win3264napolar-new-trojan-shines-on-the-cyber-crime-scene/)\nthey have also seen similar infection vectors.\n\nIn this blog post, we will show some of the anti-debugging tricks used by Win32/Napolar.\nThese tricks were seen in early versions of this malware family. Most recent variants also\nuse third party packers to evade antivirus detection and slow down manual reverse\nengineering.\n\nWe will then explain the Win32/Napolar command and control (C&C) protocol. Finally, we\nwill show some of the information that was retrieved from the promotional website before it\nwas taken offline.\n\n## Anti-debugging Techniques\n\nWhen analyzing Win32/Napolar binaries, the first thing to notice is that there is no valid\nentry point in the PE header, as shown in the figure below.\n\n\n-----\n\nThe first instructions that are executed when the binary is started are saved in the Thread\nLocal Storage (TLS) functions. There are two TLS functions registered. The first TLS\nfunction does not do anything. The second function decrypts more code using the RC4\nencryption algorithm and the key 0xDEADBEEF. The decrypted code is registered as a third\nTLS function before the second function returns, as shown in the code extract below.\n\nThe third TLS function decrypts the rest of the code before calling the main body of the\nmalware. The malware uses other tricks to make itself harder to analyze:\n\nAll imports are resolved at runtime using hashes instead of the import names.\nInteractions with the operating system are mostly done by directly calling\n[undocumented functions of the NTDLL library instead of using the standard APIs.](https://en.wikipedia.org/wiki/Microsoft_Windows_library_files#NTDLL.DLL)\nAll the code is position-independent.\n\nTo find the offset of its own code that will be decrypted, Win32/Napolar searches through its\nmemory for the opcode 0x55. This opcode represents “push ebp”, the first instruction of the\ncurrent function in assembly language. If this instruction is replaced by 0xCC, the opcode\nfor a software breakpoint, the decryption of the code will not work. This is a clever way of\naltering the behavior of the malware if it is being analyzed with a debugger and if a software\nbreakpoint is put on the first instruction of the TLS.\n\nWin32/Napolar has more anti-debugging tricks. To make dynamic analysis harder,\nWin32/Napolar will create a sub process of itself and will debug this new instance. The\nscreenshot below shows the call to CreateProcess.\n\n[The software protection technique of self-debugging has been seen before but in the case](https://blog.avast.com/2013/05/29/analysis-of-a-self-debugging-sirefef-cryptor/)\nof Win32/Napolar, the trick happens in the main body of the malware, not in the packer.\n\n\n-----\n\nOnce the debugged process is started, Win32/Napolar will enter a loop that handles\ndebugging events returned by the function WaitForDebugEvent. Pseudocode for the loop\nhandling debugging events is presented below.\n\nThe first event handled by this code is CREATE_PROCESS_DEBUG_EVENT. This event\ntakes place when the debugged process is started. In this case, the main process will parse\nthe MZ and PE header of the debugged process in order to retrieve the offset and size of\nthe position-independent code. It will then allocate another area of memory in the debugged\nprocess in which to inject the code. This creates two copies of the same code in the same\nprocess.\n\nThe next event is EXCEPTION_DEBUG_EVENT. In this second event, the main process\noverwrites the first TLS function of the binary so as to redirect execution at the beginning of\nthe executable, using a push – ret instruction. This, once again, decrypts the main body of\nthe malware and lets it execute within the child process. It is the code of the child process\nthat then proceeds to inject itself into all the processes running sub-processes and hooking\nvarious functions to hide its presence on the system and capture desired information.\n\n\n-----\n\nFinally, the main process receives the EXIT_PROCESS_DEBUG_EVENT event; it stops\ndebugging by calling the function DebugActiveProcessStop and terminates its own process\nusing NtTerminateProcess.\n\nOne of the main characteristics of Win32/Napolar is its ability to steal information when a\nuser fills a web form in a web browser. Trusteer’s browser protection probably stops the\nmalware from capturing this information. This is why the malware has specific checks for\nTrusteer products. It will iterate through all the running processes and specifically kill any\nprocess that has the string “trusteer” in it. We did not perform any test to confirm whether or\nnot this attempt at disabling Trusteer’s product is successful or not.\n\n## Network behavior\n\nWhen communicating with its command and control server, Win32/Napolar uses the HTTP\nprotocol. The first query sent by the bot to the command and control server contains the\nfollowing information:\n\nVersion of the bot\nCurrent windows username of the infected user\nComputer name\nA unique bot identifier\nVersion of the operating system\nSystem type, which can be 32 or 64 bit. Indeed, this bot supports both types of\narchitecture.\n\nThe server then responds with commands the bot needs to execute. These commands are\nencrypted using RC4, The bot unique identifier is used as the encryption key. The bot\nsupports a variety of commands, from information stealing and SOCKS proxying, to denial\nof service, download, execution and update. Each command has a unique identifier stored\n\n\n-----\n\nas a single byte and the information following this byte contains the command parameters.\nThe following figure shows a traffic dump of the communication between a host infected by\nWin32/Napolar and its command and control server.\n\nThe following figure shows the decryption of this command using the proper key. The first\nbyte of the received content is 0xC, and this instructs the bot to sleep. The parameter is a\nstring, “600”, which represents the number of seconds that the bot needs to sleep.\n\nWe have seen at least seven different command and control servers used by\nWin32/Napolar. Most of them only stayed online for a couple of days before the operator\nmoved them to a new network. This might indicate that this bot is being actively used in the\nwild. Below is a list of domain names where we have recently observed command and\ncontrol servers:\n\n_dabakhost.be_\n_terra-araucania.cl_\n_xyz25.com_\n_yandafia.com_\n_elzbthfntr.com_\n_alfadente.com.br_\n\n\n-----\n\nThere are some references to TOR in the malware code. Most precisely, some configuration\nlines and references to the configuration file for TOR. During our analysis of the malware, it\ndidn’t seem to make any usage of this data. This could be some dormant feature that has\nnot been activated in the samples we have analyzed.\n\n## Promotional website\n\nThe author of Win32/Napolar seems very frank about wanting to sell his new malware. He\nhas put together a very professional-looking website where he boasts that his bot is a\n“professional shellcode based bot”, referring to the fact the malware is positionindependent.\n\nThe website also provides information for potential customers. For example, the complete\ncode for the command and control server can be found there, a php script running with an\nSQL database backend. The code of the command and control server confirms of our\nanalysis of the network protocol used by the Win32/Napolar malware.\n\nThe promotional website also provides multiple examples of plugins that can be used by\n[malware operators. The plugins must be written using the Delphi programming language.](https://www.welivesecurity.com/category/delphi/)\nThe example plugins show how one can display a message on an infected victim system,\nfind which version of the antivirus is installed on the victim system, and even how to steal\n[Bitcoin wallets.](https://www.welivesecurity.com/search/?s=Bitcoin&x=0&y=0)\n\nFinally, the website even presented a complete log of the changes made to the bot’s source\ncode, including information on new features and bug fixes. The website shows the first\nchangelog entry made on July 14th. This fits our timeline since we saw the first instances of\nthis bot in the wild in the beginning of August. The registration date for the domain name\nwhere the content is hosted is the first day of August, another indication that the beginning\nof the promotion is recent.\n\n\n-----\n\n## Conclusions\n\nWin32/Napolar is a new bot that surfaced in July and started to be observed in the wild in\nAugust. It has interesting techniques for countering reverse engineering. The most notable\npoint about this malware is how openly it is being promoted on the web by its creator. The\n[advertisement is probably the same that was identified by Dancho Danchev at webroot in](http://www.webroot.com/blog/2013/07/02/cybercriminals-experiment-with-tor-based-cc-ring-3-rootkit-empowered-spdy-form-grabbing-malware-bot/)\nJuly. We have seen many messages on different forums promoting this bot, in addition to\nthe existence of a publicly-accessible website. As it was previously discussed in the Foxxy\ncase, this is another good example of the specialization of cybercrime operations where we\nnow clearly have authors that create malware and sell it to other gangs who will operate it.\n\n[Although this bot has functionalities similar to other families like Zeus or](https://www.welivesecurity.com/search/?s=Zeus&x=0&y=0) [SpyEye, it might](https://www.welivesecurity.com/search/?s=SpyEye&x=0&y=0)\ngain in popularity because its author is actively maintaining it, and because of its ease of\nuse and the simplicity with which plugins can be created.\n\n## Analyzed files\n\nThe following are MD5 hashes of the analyzed files:\n\n85e5a0951182de95827f1135721f73ad0828b6bc\n\n\n-----\n\n9c159f00292a22b7b609e1e8b1cf960e8a4fa795\na86e4bd51c15b17f89544f94105c397d64a060bb\nce24ae6d55c008e7a75fb78cfe033576d8416940\ndacfa9d0c4b37f1966441075b6ef34ec8adc1aa6\n\n## Acknowledgments\n\nThanks to Lubomir Trebula and Joan Calvet for their help while analyzing this malware.\n\n**Pierre-Marc Bureau**\n\n**Security Intelligence Program Manager**\n\n25 Sep 2013 - 06:46PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-09-25 - Win32-Napolar – A new bot on the block.pdf"
    ],
    "report_names": [
        "2013-09-25 - Win32-Napolar – A new bot on the block.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536118,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653689096,
    "ts_modification_date": 1653689096,
    "files": {
        "pdf": "https://archive.orkl.eu/1d28287a1f4a50be6cff2b79eace481c6069d72f.pdf",
        "text": "https://archive.orkl.eu/1d28287a1f4a50be6cff2b79eace481c6069d72f.txt",
        "img": "https://archive.orkl.eu/1d28287a1f4a50be6cff2b79eace481c6069d72f.jpg"
    }
}