{
    "id": "6838dba5-f601-4c8b-8317-b760dff1b839",
    "created_at": "2023-01-12T15:09:57.768971Z",
    "updated_at": "2025-03-27T02:11:51.177457Z",
    "deleted_at": null,
    "sha1_hash": "63a9334f24b8c64fb9d6f68d1963de1d58664935",
    "title": "2021-10-26 - Mercenary APTs – An Exploration",
    "authors": "",
    "file_creation_date": "2022-05-28T23:37:24Z",
    "file_modification_date": "2022-05-28T23:37:24Z",
    "file_size": 3710135,
    "plain_text": "# Mercenary APTs – An Exploration\n\n**cyjax.com/2021/10/26/mercenary-apts-an-exploration/**\n\nBlog\n\nBy [William Thomas 26th October 2021](https://www.cyjax.com/author/will/)\n\n\nOctober 26, 2021\n\n\nMercenary advanced persistent threat (APT) groups, sometimes called “hackers-for-hire” –\nand dubbed private-sector offensive actors (PSOAs) by Microsoft – have become a\nsignificant part of the threat landscape in recent years. These cyber-soldiers of fortune have\nbeen executing increasing numbers of attack campaigns for their clients, usually nationstates, that are looking for surveillance capabilities. Not all countries have the technical\ncapability to launch their own attacks: many, however, have the financial resources to pay\nsomeone who does.\n\n\n-----\n\nOver the last decade, more than a dozen mercenary APT campaigns have been disclosed.\nMany of these have been both highly sophisticated and highly persistent. Victims often\ninclude politicians, human rights activists, journalists, academics, embassy workers, and\ndissidents from around the world. They frequently target end-to-end encrypted (E2EE)\napplications, such as Signal, WhatsApp, and Telegram, that are used to thwart traditional\ngovernment surveillance tactics. A growing number of these mercenary APT campaigns are\nnow also actively infiltrating and stealing intellectual property and other sensitive information\nfrom enterprises.\n\nThese campaigns are supported by a significant market for 0day exploits and malware\ndevelopers. As such, nation-states that want to begin hacking campaigns no longer need the\ntechnical expertise of years gone by: they just need to be well-resourced. Furthermore, even\nthough these APTs have existed for decades, the capabilities previously associated uniquely\nwith them are more accessible than ever before. And, in the case of nation-state APTs, it has\nbecome easier to predict which companies and sectors are most likely to be attacked,\nmeaning defence has also been made, marginally, easier.\n\nIf the threat landscape is evolving in the way these mercenary groups suggest, however,\nwhere anyone can hire mercenaries for a broad spectrum of intrusion campaigns, even this\nminor advantage may have been lost.\n\n## Hackers For Hire – A Line-Up\n\nIn the following section, we will outline the pre-eminent mercenary APT groups that have\nengaged in malicious activity over the past few years: CostaRicto, Bahamut, DarkBasin, and\nDeathStalker. First, we explore the intriguing case of the DarkMatter espionage unit.\n\nIn September 2021, the US Department of Justice revealed that three former US intelligence\nagency employees had been fined $1.69 million and barred from ever again receiving\nsecurity clearance. The employees violated US computer abuse laws by spying for the\ngovernment of the UAE. The three men admitted to selling sensitive military technology while\nworking for Project Raven: the codename for a secretive company, DarkMatter, that acted as\na clandestine spying unit for the UAE.\n\nProject Raven leveraged computer network exploitation (CNE) to compromise the accounts\nof human rights activists, journalists, and rival governments. Whilst engaged in Project\nRaven, the three men reportedly targeted the US and exported spying software to a foreign\ngovernment without gaining the required permission from the US State Department’s\nDirectorate of Defense Trade Controls (DDTC). As noted in a Reuters investigation, the three\nmen are former US National Security Agency (NSA) employees and worked for DarkMatter\nin the UAE between January 2016 and November 2019. While working for DarkMatter, the\nex-NSA employees helped develop and deploy two iOS zero-click exploits called Karma and\nKarma 2. These were reportedly used against iPhones belonging to dissidents, reporters,\nand government opposition leaders. The US Department of Justice also noted that this\n\n\n-----\n\nagreement was the first resolution of its kind for two types of criminal activity: providing\nunlicensed export-controlled services in support of hacking campaigns; and a commercial\ncompany supporting a foreign government to access networks and devices of computers\n[worldwide, including in Qatar, Yemen, and the US. [1,](https://www.justice.gov/opa/pr/three-former-us-intelligence-community-and-military-personnel-agree-pay-more-168-million) [2]](https://www.justice.gov/opa/press-release/file/1432611/download)\n\nIn November 2020, BlackBerry researchers disclosed a new mercenary APT, dubbed\nCostaRicto. This group was targeting organisations around the world but predominantly in\nSouth Asia – India, Bangladesh, and Singapore – Africa, Europe, and the Americas. The\nvictims were spread across several verticals, with many in the financial sector. It is unclear\nwhere these hackers-for-hire are located. However, as they mainly focused on South Asian\ntargets, the researchers believe they are most likely to be based there. For many of its\ncampaigns, CostaRicto uses spear-phishing attacks to drop a custom backdoor, dubbed\nSombRAT, that has rarely been seen in the wild. The code suggests there are multiple\nversions, indicating the backdoor can be flexibly adapted for different attacks. The earliest\ncompilation timestamps for SombRAT date back to 2017. The group has also compromised\n[its targets via stolen credentials, reportedly purchased on the darknet. [1,](https://blogs.blackberry.com/en/2020/11/the-costaricto-campaign-cyber-espionage-outsourced) [2]](https://blogs.blackberry.com/en/2021/05/threat-thursday-sombrat-always-leave-yourself-a-backdoor)\n\nActive since 2016, a mercenary APT known as Bahamut (connected to WindShift) has\nlaunched multiple highly targeted ongoing campaigns against Android users in the Middle\nEast. Individuals targeted by the group have usually been human rights activists, military\nofficers, members of royal families, diplomats, religious leaders, and business executives.\nBahamut’s targets have also been located in other parts of the globe, such as the US. The\ngroup usually uses malicious mobile applications distributed via legitimate application stores,\nmasquerading as fitness trackers or password managers. Once downloaded by a victim, an\narray of personal information is extracted which can then be used for a wide spectrum of\n[malicious activities, with potentially serious implications. [1,](https://www.anomali.com/blog/bahamut-possibly-responsible-for-multi-stage-infection-chain-campaign) [2,](https://blog.cyble.com/2021/08/10/bahamut-threat-group-targeting-users-through-phishing-campaign/) [3]](https://blogs.blackberry.com/en/2020/10/blackberry-uncovers-massive-hack-for-hire-group-targeting-governments-businesses-human-rights-groups-and-influential-individuals.html)\n\nIn June 2020, researchers from Citizen Lab disclosed that thousands of individuals and\nhundreds of institutions had been targeted by a mercenary group known as DarkBasin.\nTargets included advocacy groups, journalists, and senior government officials, as well as\nhedge funds and other organisations from various sectors. The group mainly targeted\nAmerican non-profits, especially those working on a campaign operating under the hashtag\n#ExxonKnew, which claims ExxonMobil hid information concerning climate change for\ndecades. DarkBasin was also linked to phishing campaigns targeting net-neutrality\nadvocates. Further investigation into the group uncovered several ties to an Indian\ncybersecurity company, called BellTroX InfoTech Services, which subsequently disappeared\nonce the investigation was made public. Analysis of DarkBasin’s phishing infrastructure,\nwhich used a custom URL shortener, revealed 28,000 additional URLs containing emails of\n[targets. [1,](https://citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation/) [2]](https://www.theguardian.com/technology/2020/jun/11/exxon-hack-for-hire-climate-activists-campaign)\n\nIn August 2020, Kaspersky researchers disclosed an unusual Russian-speaking mercenary\nAPT group called DeathStalker (originally named Deceptikons). Unlike the other groups\nmentioned above, DeathStalker primarily focuses on law firms and financial institutions.\nThese threat actors are reportedly tasked with gathering sensitive business information in\n\n\n-----\n\nwhat are believed to be corporate espionage campaigns. DeathStalker uses custom malware\ndistributed in highly targeted spear-phishing emails. For C&C communication, the malware\nuses “dead drop” resolvers: using safe websites, such as GitHub, Facebook, YouTube,\nReddit, and Twitter, to host the locations of C&C servers. This means the communication is\ncamouflaged amongst legitimate traffic, in much the same way as spies use a dead drop to\npass messages undercover. DeathStalker’s victims are spread around the world in countries\nsuch as the UK, Switzerland, the UAE, India, China, Taiwan, Israel, Lebanon, Jordan,\n[Cyprus, Argentina, and Turkey. [1,](https://securelist.com/deathstalker-mercenary-triumvirate/98177/) [2]](https://securelist.com/what-did-deathstalker-hide-between-two-ferns/99616/)\n\n_Fig. 1 – Geographic targeting of known Mercenary APTs_\n\n## Hacking-as-a-Service\n\nWhile Mercenary APTs carry out their criminal activity with no action needed on their clients’\nbehalf, there are also a growing number of licensed companies selling offensive software\nthat can be bought and deployed by anyone with malicious intent. Intelligence agencies, law\nenforcement, and military units around the world are increasingly acquiring these off-theshelf hacking software, buying exploits for 0day vulnerabilities, and paying others to develop\nspying tools.\n\n\n-----\n\nThe standard defence of ethically dubious products is that their software is used to fight\nterrorism and organised crime. More often than not, however, their products end up being\nused to target human rights defenders, journalists, lawyers, activists, and dissidents.\nFinFisher, also known as FinSpy, is a surveillance software created and distributed by\nGamma International. The company was breached in 2014 by an individual working under\nthe moniker Phineas Fisher, who stole and leaked an archive containing 40GB of data from\nGamma International servers. This information included price lists, source code, invoices,\nand other private data able to link the purchase of spyware to specific clients.\n\nAnother company that was hacked by Phineas Fisher was Hacking Team, which suffered a\nmuch more serious attack than Gamma International and went out of business. The attack\non HackingTeam left a gap in the market, from mid-2015 onwards, for surveillance tools. This\nwas filled by Gamma International with its FinFisher spyware suite. Although Gamma\nInternational was breached by the same individual, the incident was not as serious and the\nspyware firm was able to recover, operating in the vacuum left by HackingTeam. The\nPhineas Fisher leaks unveiled what many suspected about these commercial spyware\ndevelopers: they were knowingly selling surveillance tools to authoritarian regimes who used\n[them to spy on civilians. [1,](https://www.rapid7.com/blog/post/2012/08/08/finfisher/) [2,](https://securelist.com/new-finspy-ios-and-android-implants-revealed-itw/91685/) [3]](https://citizenlab.ca/2015/08/hacking-team-leak-highlights-citizen-lab-research/)\n\n_Fig. 2 – Graphical User Interface of FinSpy (circa 2011)_\n\n\n-----\n\nIn July, Microsoft released new information regarding a private-sector offensive actor (PSOA)\nit tracks as Sourgum, which reportedly belongs to an Israel-based company called Candiru.\nThe organisation has targeted over 100 victims around the world, including politicians,\nhuman rights activists, journalists, academics, embassy workers, and political dissidents with\na malware family called DevilsTongue. Approximately half of the victims were found in the\nPalestinian Authority, with others in Israel, Iran, Lebanon, Yemen, Spain (specifically\nCatalonia), the UK, Turkey, Armenia, and Singapore. It should be noted that the identification\nof victims of the malware in a country is not indicative that an agency in that country is a\nCandiru customer, as international targeting is common. Nonetheless, this is not proof that\nthe country in question is not a Candiru customer, either.\n\nCandiru uses a chain of vulnerabilities in web browsers and Windows to install its\nDevilsTongue modular multi-threaded backdoor. This custom malware is written and can\nsteal credentials from web browsers, such as Chrome or Firefox. It also decrypts and\nexfiltrates conversations from Signal, the E2EE messaging app. The attacks begin with a\nsingle-use URL that is sent via messaging applications, such as WhatsApp. These threat\nactors have also weaponised Windows 0day vulnerabilities, tracked as CVE-2021-31979 and\nCVE-2021-33771, to support delivery. Successful exploitation led to privilege escalation,\ngiving an attacker the ability to escape browser sandboxes and gain kernel code execution.\nSpy agencies in Uzbekistan, the UAE, and Saudi Arabia are among the list of Candiru’s\n[alleged previous customers. [1,](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/) [2]](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\n\nIn August, CitizenLab revealed that the infamous NSO Group, an Israeli spyware developer,\nhad once again been implicated in an unethical surveillance campaign. The latest Pegasus\nspyware campaign targeted at least nine Bahraini activists, a French Lawyer, and an Indian\njournalist via a new iOS exploit, dubbed FORCEDENTRY. This was a highly sophisticated\nzero-click, 0day vulnerability in iMessage, meaning it could be triggered without the intended\nvictim either viewing the message sent by the threat actors or clicking the link contained in\nthe message.\n\nThe NSO Group, however, allegedly does not carry out hacking itself: the most recent\ncampaign having been orchestrated by a Pegasus customer and operator, dubbed LULU,\nlinked to the government of Bahrain. The technically impressive part of the FORCEDENTRY\nexploit is that it could bypass BlastDoor, which Apple recently developed to protect from such\nattacks. It places parts of iMessage inside a sandbox to isolate malicious code from\ninteracting with the underlying operating system (OS). Interestingly, four of the victims’ phone\nnumbers were present in the list of 50,000 potential Pegasus targets obtained by Forbidden\nStories and Amnesty International in July. The leaked phone numbers belong to hundreds of\nbusiness executives, religious figures, academics, NGO employees, union officials, and\ngovernment officials. Also shown in the leak are NSO Group clients from at least 11\ncountries, including Azerbaijan, Bahrain, Hungary, India, Kazakhstan, Mexico, Morocco,\n[Rwanda, Saudi Arabia, Togo, and the UAE. [1,](https://citizenlab.ca/2021/08/bahrain-hacks-activists-with-nso-group-zero-click-iphone-exploits/) [2]](https://www.amnesty.org/en/latest/press-release/2021/07/the-pegasus-project/)\n\n\n-----\n\n_Fig. 3 – Graphical User Interface of Pegasus spyware (circa 2012)_\n\n## A Mercenary Future\n\nMercenary APTs, malicious software developers, and 0day brokers significantly lower the\nbarrier to entry for launching advanced hacking campaigns. Technical expertise and a small\narmy of highly skilled individuals are no longer required to perform such attacks. Now, all that\nis needed, are resources: of which many nation-states have a lot. The previously technically\n\n\n-----\n\nimpossible is made available through 0day exploits worth millions of dollars on underground\nmarkets. Mercenary APTs develop bespoke malware tooling, manage their own\ninfrastructure, perform their own reconnaissance, and execute all phases of the intrusion.\nThis is the effective outsourcing of many of the most nefarious parts of the playbook for\ndespotic regimes.\n\nA mercenary APT’s tactics, techniques, and procedures (TTPs) often resemble highly\nsophisticated state-sponsored campaigns, but the profiles and geography of their victims are\nfar too diverse to be aligned with one state’s interests. Therefore, these cybercriminals must\ncarefully choose their targets to avoid the risk of being exposed and having their operations\nshut down: consequently, many go undetected for several years. Even notorious\nadversaries, experienced in cyber-espionage, can benefit from adding a layer of obfuscation\nto their campaigns. By using a mercenary group as a proxy, therefore, the real attacker can\nbetter protect their identity and frustrate attempts at attribution by the cybersecurity\ncommunity.\n\nDefending against these powerful and disaggregated threats, however, can lead to a sort of\n“security nihilism”, wherein it seems that nothing can be done to prevent these sophisticated\nattacks. We content that this conclusion, however, is incorrect. The majority of these attacks\nrely on victims making simple mistakes, such as clicking on a link, opening a document, or\nleaving devices unpatched. As such, by practising proper security awareness, using\npassword managers and multi-factor authentication, keeping devices and applications\nupdated, and investing in security software, attackers’ campaigns will be frustrated to the\npoint that they will eventually move on to softer targets.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-26 - Mercenary APTs – An Exploration.pdf"
    ],
    "report_names": [
        "2021-10-26 - Mercenary APTs – An Exploration.pdf"
    ],
    "threat_actors": [
        {
            "id": "c72c09b8-81ba-4e6e-9094-cd84ee4bda79",
            "created_at": "2022-10-25T15:50:23.667393Z",
            "updated_at": "2025-03-27T02:00:55.517974Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [
                "CostaRicto"
            ],
            "source_name": "MITRE:CostaRicto",
            "tools": [
                "PowerSploit",
                "SombRAT",
                "PsExec",
                "PS1",
                "CostaBricks"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "732bfd4b-8c15-42a5-ac4b-14a9a4b902e9",
            "created_at": "2022-10-25T16:07:23.38079Z",
            "updated_at": "2025-03-27T02:02:09.771357Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "ETDA:Bahamut",
            "tools": [
                "Bahamut",
                "DownPaper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b77f9b40-dca7-449d-819e-115cd2295b41",
            "created_at": "2022-10-25T16:07:23.502671Z",
            "updated_at": "2025-03-27T02:02:09.834738Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "ETDA:CostaRicto",
            "tools": [
                "CostaBricks",
                "PowerSploit",
                "PsExec",
                "SombRAT",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f7aa6029-2b01-4eee-8fe6-287330e087c9",
            "created_at": "2022-10-25T16:07:23.536763Z",
            "updated_at": "2025-03-27T02:02:09.85219Z",
            "deleted_at": null,
            "main_name": "Deceptikons",
            "aliases": [
                "DeathStalker",
                "Deceptikons"
            ],
            "source_name": "ETDA:Deceptikons",
            "tools": [
                "EVILNUM",
                "Evilnum",
                "Janicab",
                "PowerPepper",
                "Powersing",
                "VileRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0f47a6f3-a181-4e15-9261-50eef5f03a3a",
            "created_at": "2022-10-25T16:07:24.228663Z",
            "updated_at": "2025-03-27T02:02:10.145238Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "Project Raven",
                "Stealth Falcon"
            ],
            "source_name": "ETDA:Stealth Falcon",
            "tools": [
                "Deadglyph",
                "StealthFalcon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "60b64223-652b-4177-a678-3d675b79cff4",
            "created_at": "2022-10-25T16:07:24.478235Z",
            "updated_at": "2025-03-27T02:02:10.246897Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [
                "Mercenary.Amanda"
            ],
            "source_name": "ETDA:Dark Basin",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1a933813-3deb-4d6f-8e0f-33b9187970f9",
            "created_at": "2023-01-06T13:46:39.147547Z",
            "updated_at": "2025-03-27T02:00:03.007913Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [],
            "source_name": "MISPGALAXY:Dark Basin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "115cf618-02a8-42b8-8d25-305292eafedb",
            "created_at": "2023-11-21T02:00:07.396534Z",
            "updated_at": "2025-03-27T02:00:03.251048Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "MISPGALAXY:CostaRicto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f99641e0-2688-47b0-97bc-7410659d49a0",
            "created_at": "2023-01-06T13:46:38.802141Z",
            "updated_at": "2025-03-27T02:00:02.922907Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "MISPGALAXY:Bahamut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6bd4ed50-e116-494c-bb70-9587876663f1",
            "created_at": "2023-01-06T13:46:39.004062Z",
            "updated_at": "2025-03-27T02:00:02.974882Z",
            "deleted_at": null,
            "main_name": "WindShift",
            "aliases": [
                "Windy Phoenix"
            ],
            "source_name": "MISPGALAXY:WindShift",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ada9e5d3-1cb2-4b70-a3c8-96808c304ac8",
            "created_at": "2022-10-25T15:50:23.6515Z",
            "updated_at": "2025-03-27T02:00:55.513513Z",
            "deleted_at": null,
            "main_name": "Windshift",
            "aliases": [
                "Windshift",
                "Bahamut"
            ],
            "source_name": "MITRE:Windshift",
            "tools": [
                "WindTail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "68f12936-2361-4720-87e1-b79a4fdbf1a0",
            "created_at": "2022-10-25T16:07:24.409855Z",
            "updated_at": "2025-03-27T02:02:10.21199Z",
            "deleted_at": null,
            "main_name": "WindShift",
            "aliases": [
                "Windy Phoenix"
            ],
            "source_name": "ETDA:WindShift",
            "tools": [
                "WindTail"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536197,
    "ts_updated_at": 1743041511,
    "ts_creation_date": 1653781044,
    "ts_modification_date": 1653781044,
    "files": {
        "pdf": "https://archive.orkl.eu/63a9334f24b8c64fb9d6f68d1963de1d58664935.pdf",
        "text": "https://archive.orkl.eu/63a9334f24b8c64fb9d6f68d1963de1d58664935.txt",
        "img": "https://archive.orkl.eu/63a9334f24b8c64fb9d6f68d1963de1d58664935.jpg"
    }
}