{
    "id": "68649fc7-8519-4474-b32a-93a4c290906f",
    "created_at": "2023-01-12T15:00:39.873603Z",
    "updated_at": "2025-03-27T02:09:17.780265Z",
    "deleted_at": null,
    "sha1_hash": "50c76db54e83173bd003805fd278e33375a2ebbe",
    "title": "2021-06-04 - Colonial Pipeline Ransomware Hack Unleashes Flood of Related Phishing Attempts",
    "authors": "",
    "file_creation_date": "2022-05-28T03:48:13Z",
    "file_modification_date": "2022-05-28T03:48:13Z",
    "file_size": 4929002,
    "plain_text": "# Fresh Phish: Colonial Pipeline Ransomware Hack Unleashes Flood of Related Phishing Attempts\n\n**[inky.com/blog/colonial-pipeline-ransomware-hack-unleashes-flood-of-related-phishing-attempts](https://www.inky.com/blog/colonial-pipeline-ransomware-hack-unleashes-flood-of-related-phishing-attempts)**\n\nPosted by Roger Kay\n\n[Tweet](https://twitter.com/share)\n\nAmong other things, phishers are avid newshounds. They read the press diligently looking\nfor topics that might help them more successfully fool targets, land malware, and extract\n[value. The highly visible ransomware attack recently executed by Eastern Europe-based](https://en.wikipedia.org/wiki/Colonial_Pipeline_cyberattack)\nhacker group DarkSide against Colonial Pipeline, a Houston-based oil pipeline operator,\ndrew a lot of phisher interest, and, voila! Within a couple of weeks, new phishing attempts\nwere unleashed on a world suddenly aware of Colonial and the exploitation of its\nvulnerabilities.\n\nThese new attempts tried to leverage the Colonial attack with clever pitches. INKY, the\nforemost anti-phishing technology on the market today, started seeing these attempted\nattacks almost immediately following the public humiliation of Colonial, which ended up\npaying $5 million to DarkSide to unlock its data.\n\n## Quick Takes: Attack Flow Overview\n\n**Type: phishing**\n**Vector: email, malware download from abused free site**\n\n\n-----\n\n**Payload: abused legitimate penetration-testing tool that launches ransomware,**\nsurveillance, or data exfiltration campaign\n**Techniques: targeted phishing email tries to trick the recipient into downloading an**\n\"update,” which is supposedly related to the Colonial Pipeline vulnerability but is really\nmalware\n**Platform: Office365**\n**Target: Corporate-wide surveillance, data exfiltration, ransomware shutdown**\n\n## The Attack\n\nSeveral INKY users received \"helpdesk” emails like the one below with instructions to\ndownload a “ransomware system update” from an external site.\n\nThe malicious emails were sent from newly created domains (ms-sysupdate.com and\nselectivepatch.com) controlled by cybercriminals. The domain names, sufficiently plausible to\nappear legitimate, were nonetheless different enough so that garden variety anti-phishing\nsoftware would not be able to use regular expression matching to detect their perfidy. INKY,\nof course, caught the phish using other techniques, which is why they're on display here.\n\n\n-----\n\nBoth domains were registered with NameCheap, a registrar popular with bad actors. Its\ndomains are inexpensive, and the company accepts Bitcoin as payment for hosting services\n(handy for those trying to remain anonymous). The malicious links in the emails belonged to\n— surprise! — the same domain that sent the emails. Convenient, right?\n\n\n-----\n\nIn this highly customized attack, the malicious site used the target company’s logo and\nimagery. The innocuous “Download” button was set to download a malware file called\n“Ransomware_Update.exe”. What could possibly go wrong?\n\nThe malware was, in fact, “Cobalt Strike,” a legitimate penetration-testing tool that has been\ndeeply abused by bad actors since its source code was leaked in late 2020. This abuse has\n[been linked to ransomware, surveillance, and data exfiltration campaigns. According to Talos](https://blog.talosintelligence.com/2020/09/CTIR-quarterly-trends-Q4-2020.html)\n\n\n-----\n\n[Intelligence, 66% of ransomware attacks in 4Q20 involved Cobalt Strike. This serious](https://blog.talosintelligence.com/2020/09/CTIR-quarterly-trends-Q4-2020.html)\npayload is designed for maximum impact.\n\n## Techniques\n\nColonial-Pipeline-follow-on attacks were based on the confluence of two factors, the Colonial\nransomware attack itself and the recent public availability of a highly effective remote-access\ntool. The Colonial Pipeline ransomware attack raised the visibility of ransomware in general.\nWhether they operate in infrastructure or are dependent on it (which includes practically\neveryone), people were primed by the news cycle to be thinking about ransomware issues.\nIn this environment, phishers tried to exploit people’s anxiety, offering them a software\nupdate that would “fix” the problem via a highly targeted email that used design language\nthat could plausibly be the recipient’s company’s own. All the recipient had to do was click\nthe big blue button, and the malware would be injected.\n\n## Recap of Techniques:\n\nDynamic Phish — uses elements of the target’s company’s brand elements to look\nlegitimate if not internal\nAbused Free Website — evades URL analysis by traditional email security products\nMalware Injection — A recipient click initiates the injection of a legitimate but abused\nremote access tool that allows the abuser to control the target’s system\nTrusted Logo Imagery — gains the confidence of target recipient, furthering the\nlikelihood of a successful exploit\n\n## Best Practices: Guidance and Recommendations\n\nPhishers are getting better at camouflage.  They try to make their emails look as if they\ncome from the target’s employer, lending them an air of greater legitimacy. By using newly\ncreated domains, the email can evade traditional phishing analysis, which looks only at\ncommonly accepted email tags DKIM and SPF and sees nothing suspicious. The important\nanalysis to be done here is not whether the email comes from a legitimate host but whether it\ncomes from where it appears to come. If it looks as if it was sent by the company itself (e.g.,\nfrom HR, IT or Finance), does it in fact originate from an email server under the company’s\ncontrol? If it looks like the HR or IT Departments but deviates from the norm, that should be a\nflag.\n\nIn addition to using better camouflage, phishers excel at leveraging current events and other\ncyber-attacks to create urgency in their communications. In this case, no doubt many\nrecipients wanted to “do the right thing and help out the IT team” by clicking on the bad link.\nAttackers use these emotions to trick users into doing things they might not otherwise do. An\nIT policy stating that employees will not be asked to download certain file types might be a\ngood start to combat attacks like this. A standard and formalized communications protocol\nthat is widely shared, and frequently reinforced, would help as well.\n\n\n-----\n\nAnd of course, an anti-phishing software like INKY that performs this sort of analysis, can\nalert recipients of inaccurate email sources and potential harm, and direct appropriate\nactions via a banner in the email.\n\n_____\n\n_INKY is the most effective hero in the war against phishing. An award-winning cloud-based®_\n_email security solution, INKY prevents the most complex phishing threats from disrupting or®_\n_even immobilizing your company’s day-to-day business operations. Using computer vision,_\n_artificial intelligence, and machine learning, INKY is the smartest investment you can make®_\n_in the security of your organization. INKY is a proud winner of the NYCx Cybersecurity®_\n_Moonshot Challenge and finalist in the 2020 RSAC Innovation Sandbox Competition. Learn_\n_[more about INKY or request an online demonstration today.®](https://www.inky.com/get-inky)_\n\n\n## Topics:\n\n[Phishing,](https://www.inky.com/en/blog/tag/phishing)\n[Fresh Phish](https://www.inky.com/en/blog/tag/fresh-phish)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-04 - Colonial Pipeline Ransomware Hack Unleashes Flood of Related Phishing Attempts.pdf"
    ],
    "report_names": [
        "2021-06-04 - Colonial Pipeline Ransomware Hack Unleashes Flood of Related Phishing Attempts.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535639,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653709693,
    "ts_modification_date": 1653709693,
    "files": {
        "pdf": "https://archive.orkl.eu/50c76db54e83173bd003805fd278e33375a2ebbe.pdf",
        "text": "https://archive.orkl.eu/50c76db54e83173bd003805fd278e33375a2ebbe.txt",
        "img": "https://archive.orkl.eu/50c76db54e83173bd003805fd278e33375a2ebbe.jpg"
    }
}