{
    "id": "68899300-0a29-4cd8-bf93-317810b690a6",
    "created_at": "2023-01-12T15:09:03.729703Z",
    "updated_at": "2025-03-27T02:06:10.119009Z",
    "deleted_at": null,
    "sha1_hash": "3f35a8038eded2d277058f3cd5b7ac6dd7d825b2",
    "title": "2022-01-19 - Campaigns abusing corporate trusted infrastructure hunt for corporate credentials on ICS networks",
    "authors": "",
    "file_creation_date": "2022-05-28T04:47:08Z",
    "file_modification_date": "2022-05-28T04:47:08Z",
    "file_size": 2556673,
    "plain_text": "## Campaigns abusing corporate trusted infrastructure hunt for corporate credentials on ICS networks\n\n**ics-cert.kaspersky.com/publications/reports/2022/1/19/campaigns-abusing-corporate-trusted-infrastructure-hunt-for-**\ncorporate-credentials-on-ics-networks\n\nJanuary 19, 2022\n\n19 January 2022\n\nIn 2021, Kaspersky ICS CERT experts noticed a growing number of anomalous spyware\nattacks infecting ICS computers across the globe.\n\nAlthough the malware used in these attacks belongs to well-known commodity spyware\nfamilies, these attacks stand out from the mainstream due to a very limited number of targets\nin each attack and a very short lifetime of each malicious sample.\n\nBy the time the anomaly was detected, this had become a trend: around 21.2% of all\nspyware samples blocked on ICS computers worldwide in H1 2021 were part of this new\nlimited-scope short-lifetime attack series and, at the same time, and, depending on the\nregion, up to one-sixth of all computers attacked with spyware were hit using this tactic.\n\n\n-----\n\nIn the process of researching the anomaly, we noticed a large set of campaigns that spread\nfrom one industrial enterprise to another via hard-to-detect phishing emails disguised as the\nvictim organizations’ correspondence and abusing their corporate email systems to attack\nthrough the contact lists of compromised mailboxes.\n\nOverall, we have identified over 2,000 corporate email accounts belonging to industrial\ncompanies abused as next-attack C2 servers as a result of successful malicious operations\nof this type. Many more (over 7,000 in our estimation) have been stolen and sold on the web\nor abused in other ways.\n\n[The full report is available on the Kaspersky Threat Intelligence portal.](https://www.kaspersky.com/enterprise-security/threat-intelligence)\n[For more information please contact: ics-cert@kaspersky.com.](http://10.10.0.46/mailto:ics-cert@kaspersky.com)\n\n### “Anomalous” spyware attacks\n\nIn 2021, we noticed a curious anomaly in statistics on spyware threats blocked on ICS\ncomputers. An analysis of 58,586 samples blocked in H1 2021 revealed that 12,420 (around\n21.2%) of these samples had a sufficiently limited scope (i.e., the total number of machines\non which a sample was blocked, including non-ICS related computers) and short lifespan\n(i.e., the number of days between the first and last sample detection dates), as shown in the\nred rectangle on the chart below. It can be seen that the lifespan of the selected “anomalous”\nattacks is limited to about 25 days. And at the same time, the number of attacked computers\nis less than 100, of which 40-45% are ICS machines, while the rest are part of the same\norganizations’ IT infrastructure.\n\n\n-----\n\nSpyware samples blocked on ICS computers in H1 2021, by number of machines (targets)\nand number of days passed since first seen\nAlthough each of these “anomalous” spyware samples is very short-lived and is not widely\ndistributed, they account for a disproportionately large share of all spyware attacks.\n\nIn Asia, for example, every sixth computer attacked with spyware was hit with one of the\n“anomalous” spyware samples (2.1% out of 11.9%, as shown on the graph below).\n\nIn Africa (2% out of 15.4%), the Middle East (1.3% out of 10.1%), Europe (0.7% out of 6.3%),\nRussia (0.7% out of 6.8%), Australia and New Zealand (0.6% out of 5.6%), and North\nAmerica (0.5% out of 3.3%), about one spyware attack in ten involved one of the\n“anomalous” spyware samples.\n\nIt seems that the ecosystem of commercial spyware attacks has launched a new and rapidly\nevolving series of campaigns, shrinking the size of each attack and limiting the use of each\nmalware sample by quickly enforcing its replacement with a fresh-built one.\n\n\n-----\n\nPercentage of ICS computers on which spyware was blocked in H1 2021,\n\nall spyware threats vs. “anomalous” samples\nNotably, the majority of ICS computers on which “anomalous” spyware samples were\nblocked in H1 2021 were from the manufacturing and ICS engineering & integration\nindustries. We believe this skew in data was due to the nature of these “anomalous” attacks,\nwhich is described in the “C2 infrastructure” section of this report.\n\nDistribution of ICS computers on which “anomalous” spyware was blocked\n\nin H1 2021 by industry\n\n### Spyware analysis\n\n\n-----\n\nAs regards the spyware samples used in anomalous attacks on ICS computers in H1 2021,\nthese are all the same breeds of commodity spyware such as Agent Tesla/Origin Logger,\nHawkEye, Noon/Formbook, Masslogger, Snake Keylogger, Azorult, Lokibot, etc.\n\nAs normal, most of the spyware samples blocked had multiple layers of obfuscation folded\none into another. The technique is essentially based on hiding binary code into the resources\nof an application. For example, one of the popular implementations involved encoding a\nbinary into an image using RGBA (Red, Green, Blue, and Alpha channels) to store bytes.\n\nAs we discovered, the only significant difference between generic and anomalous spyware\nsamples was the types of C2 infrastructure used.\n\n### C2 infrastructure\n\nUnlike generic spyware, the majority of “anomalous” samples were configured to use SMTPbased (rather than FTP or HTTP(s)) C2s as a one-way communication channel, which\nmeans that was planned solely for theft.\n\nDistribution of spyware samples by C2 type, ”anomalous” vs. generic\nAbout 18.9% of all “anomalous” spyware was configured to connect to a server owned by\nsome victim industrial enterprise.\n\n\n-----\n\nDistribution of “anomalous” spyware samples by hosting types of SMTP-based C2\ninfrastructure\nAlmost all (99.8%) of the C2 servers found in the configuration of “anomalous” spyware\nsamples were deployed in just three regions – Asia, Europe, and North America.\n\nDistribution of “anomalous” spyware samples by region and by hosting type of SMTP-based\nC2 infrastructure, TOP 3 regions\nWe also noticed that the majority of C2s, including those deployed on abused infrastructure\nowned by industrial companies, were deployed on servers in North America.\n\nThat was an unexpected finding since 34.6% of attacked ICS computers belong to Asian\ncompanies. But the analysis revealed that a surprisingly large number of mid-size industrial\ncompanies in Asia have their public-access infrastructure, such as DNS, corporate web and\nemail servers, hosted on North American rather than Asian servers (rented directly from\nNorth American providers or from various Asian providers that in fact “provide” infrastructure\nmade available to them by North American providers).\n\n\n-----\n\n### Tactics, techniques, and procedures\n\nWe believe that initially stolen data is used by threat operators primarily to spread the attack\ninside the local network of the attacked organization (via phishing emails) and to attack other\norganizations in order to collect more credentials.\n\nAn analysis of source and destination addresses in phishing emails sent by threat operators\nand of newly discovered C2s (i.e., the conversion of exfiltrated credentials to new C2s)\nreveals the tactics used to spread the attack from a compromised industrial enterprise to its\nbusiness and operational partner organizations. These tactics are shown in the diagram\nbelow.\n\n\n-----\n\nCredential collection and abuse by threat actors\nAn example of a phishing email sent by a threat operator as a result of abusing stolen\ncredentials (email account) of a victim user is shown below. The email was sent via the\ncompromised organization’s email server from the compromised user’s account to targets\ntaken from the compromised user’s contact list. The targets included 28 email accounts from\n7 industrial companies.\n\n\n-----\n\nOverall, as part of this research, we identified over 2,000 abused (i.e., used as C2s by\nspyware) email accounts owned by industrial companies. We estimate the total number of\ncorporate email accounts whose credentials were stolen as a result of these attacks to be\nover 7,000.\n\nEmail sent as part of an attack propagated by abusing a victim’s contact list\nFor some actors, the next-stage activity involved attacking their victims using the business\nemail compromise technique, which is designed to enable the attackers to commit fraud (by\nanalyzing business correspondence and hijacking selected banking transactions). An\nexample of emails used in such attacks is shown below.\n\n\n-----\n\nFraudulent email sent as part of a business email compromise attack\nOther actors focus on stealing credentials for sale, including:\n\nCredentials for personal financial services such as online banking accounts, wallets,\ncrypto exchanges, etc.;\nCredentials for social networks and other public internet services;\nCredentials for corporate network access services (SMTP, SSH, RDP, VPN, etc.).\n\n\n-----\n\nEmail with RDP credentials sent by spyware reporting back to the attackers\nBased on screenshots collected by spyware and other indirect evidence we have found, we\ncan state that some malware operators have a particular interest in industrial companies and\ntheir infrastructure. This interest can be explained by significant differences in the prices of\ndifferent account types in web marketplaces (see below).\n\n\n-----\n\nScreenshot captured by spyware\nAt this stage in our research, the “anomaly” discovered early on makes perfect sense: the\n“anomalous” samples we discovered are so limited in scope and have such a short lifespan\nbecause threat actors generate unique samples (with a specific C2 configuration) for each\nphishing email, which is usually limited to a subset of addresses from the previous-stage\nvictim’s contact list.\n\nWhen a compromised email account is abused as a C2, the C2 traffic is normally detected by\nan antispam solution and moved to the spam folder, where in most cases it remains\nunnoticed until the folder is cleaned. Evading antispam detection is not in the interests of the\nmalicious actors, as this would bring victims’ attention to C2 traffic, signaling compromise.\nThat’s how malicious actors use cybersecurity-related technology to their advantage.\n\nThe Recommendations section of this report contains some patterns which could be used to\nidentify the compromise of an email account.\n\n### Malware operators\n\nAn analysis of data on some malware operators covered by our research on “anomalous”\nspyware attacks has shed some light on the bigger picture of credential gathering campaigns\nrun by hundreds of independent operators.\n\n\n-----\n\nVarious spyware builders have a feature for testing the availability and accessibility of a C2\nat the configuration phase. In the case of an SMTP C2, they simply send and retrieve a test\nmessage.\n\nScreenshot of the OriginLogger builder tool after successfully testing the availability of an\nSMTP C2 configuration\nIt can be seen in the screenshot of a C2 test message below that such messages can\nprovide useful information about the infrastructure used by malware operators: the subject\nfield of the test email contains the user name, the computer name, and the IP address of the\nmachine from which the email was sent.\n\n\n-----\n\nC2 test message used as a verification email\nIt has been shown by other researchers that builder features can include sending certain\ndata to the malware developer, which means that malware developers can use them to spy\non their customers. Other builders that send a greeting email to the spyware operator, such\nas HawkEye, don’t include much information about the malware operator.\n\nC2 test message with a greeting to a HawkEye operator\nAn analysis of some information on malware operators (most probably leaked when they\nwere testing their malware on the PCs they use for their other day-to-day activities) allowed\nus to learn more about the TTPs of malware operators, the backend infrastructure they used\nto prepair their attacks, and the various services they used over the internet as part of their\n“work routine”, e.g., to rent the infrastructure, communicate with other cybergangsters or sell\nthe loot.\n\nThe analysis has also revealed that many of these operators may be connected with African\ncountries.\n\nTelegram account owned by a malware operator,\n\nwho is also found in many groups of similar actors\n\n\n-----\n\nScreenshot of a chat where\n\nmalware operators discuss business email compromise\nThe IP addresses of host machines used by malware operators as their backend\ninfrastructure are listed in “Appendix I – Indicators of compromise”.\n\n### Malware developers and Spyware-as-a-Service providers\n\nIn the past 5 years, since the source code of some popular spyware programs was made\npublic, it has become highly available in online shops in the form of a service – developers\nsell a license for a malware builder rather than for malware as a product.\n\nScreenshot of a website\n\nwhere Origin logger (aka Agensla) is being sold.\nIn some cases, what malware developers sell is not a malware builder but access to\ninfrastructure preconfigured to build the malware, at the same time advertising some\nadditional services on top of it.\n\n\n-----\n\ntelegram chat with an advert from a spyware seller\n\n\nScreenshot of a\n\nScreenshot of\n\n\na telegram chat with an advert from a spyware selle\nMany spyware developers advertise their products on social networks, forums, and chats;\nthey even make video tutorials. We have analyzed all available sources of information\npublished by many malware developers (those who are selling the spyware builders detected\non ICS computers in 2021). As part of this research, we were able to track “anomalous”\nspyware attacks through their operators down to the specific MaaS infrastructure, its\nproviders and developers. Further analysis of social networks, chats, and forums where\nthese operators and developers communicate revealed that a significant proportion of these\nindependent malware developers and service providers are likely to speak Russian (i.e., they\nmay potentially be connected with post-Soviet states) and Turkish.\n\nThis observation is based on various facts:\n\n\n-----\n\nProbable time zone based on the time of day when the malware developers are active\nin chats/forums;\nProbable locale based on screenshots, videos, and messages shared by the malware\ndevelopers.\n\nExample of time zone analysis based on chat activity of a malware developer\nAnother example is a video tutorial created by an OriginLogger seller. The interface of his\nYandex mail account (seen on his video) is set to the Turkish locale. Moreover, the author did\nnot use the blur effect in the video properly to hide the data collected by the spyware he was\ndemonstrating. An analysis of URLs collected by the spyware from the demonstrators’ web\nbrowser shows he has accounts on some Turkish forums and even an account with a Turkish\nuniversity.\n\n\n-----\n\nScreenshot of a video tutorial created by an OriginLogger seller\n\nScreenshot of a\n\nvideo tutorial created by an OriginLogger seller where the blur effect is misused\n\nScreenshot of a\n\nvideo tutorial created by an OriginLogger seller where the blur effect is misused\n\n### Marketplaces\n\nAlong with some insights about the malware services used by threat operators (as well as\nmalware developers and service providers), data on malware operators allows us to identify\none of the routines used to monetize credential harvesting attacks (aside from business\nemail compromise) – selling the stolen credentials in various marketplaces.\n\nOur analysis of services and marketplaces used by the malware operators showed that\ncredential harvesting campaigns are a building block of a huge pipeline of various malicious\nservices, from the development of malware and its infrastructure to commerce platforms\n\n\n-----\n\ntrading a wide variety of access to corporate networks of any choice.\n\nIn this research, we identified over 25 different marketplaces where data stolen in the\ncredential gathering campaigns targeting industrial companies that we investigated was\nbeing sold. At these markets, various sellers offer thousands of RDP, SMTP, SSH, cPanel,\nand email accounts, as well as malware, fraud schemes, and samples of emails and\nwebpages for social engineering.\n\nWeb page of a\n\nmarketplace that sells over 8,000 RDPs\nAn analysis of offers and prices has revealed a trend: access to corporate networks of\nindustrial enterprises (via RDP, SSH, SMTP, etc.) is priced 8-10 times higher than access to\ncloud hosting infrastructures such as AWS, DigitalOcean, Azure, etc.\n\nA marketplace normally provides no information on sellers except their seller IDs. An\nanalysis of the entire portfolio of accounts offered by a seller could show that seller’s focus\non some particular types of accounts – some mainly offer accounts for corporate networks\n(e.g., networks of industrial companies).\n\nOffers of RDP access to networks of some industrial companies\nA statistical analysis of metadata for over 50,000 compromised RDP accounts sold in\nmarketplaces shows that 1 954 accounts (3 9%) belong to industrial companies\n\n\n-----\n\nCompromised RDP accounts sold in marketplaces by types\nStatistics on compromised industrial enterprise accounts by country show that over 46% of\naccounts sold in marketplaces are owned by companies in the US, while owners of the rest\nare located in Asia, Europe, and Latin America.\n\nCompromised RDP accounts offered in marketplaces by country, TOP 10\n\n### Conclusion\n\nThe implementation of security measures and controls in IT and OT infrastructures\nworldwide forces the cybercriminal ecosystem to evolve. One of the changes in the\napproaches of malicious actors that we have seen is moving away from mass-scale attacks\ntowards small-scale and very short-lived (in terms of both the C2 infrastructure and the\nmalware samples) series of attacks. Another tactic was to propagate the attacks from inside\nthe victim’s infrastructure, thereby “legitimizing” the phishing email traffic. Abusing legitimate\nmailboxes (compromised at a previous attack stage) enables the actors to rapidly change\n\n\n-----\n\ntheir C2s and limit detection by network security solutions. What makes this possible for\nthreat actors is the ubiquitous use of antispam technologies in the modern mail systems of\ntheir victims.\n\nThis tactic has proved so effective that, depending on the region, it was used to attack up to\none-sixth of all ICS computers we saw attacked with spyware during H1 2021.\n\nAccording to our telemetry, more than 2,000 industrial organizations worldwide have been\nincorporated into the malicious infrastructure and used by cyber gangs to spread the attack\nto their contact organizations and business partners. According to our estimate, the C2\nconversion rate is roughly 1/4, which gives us at least 7,000 corporate accounts\ncompromised during the research period. The amount of data stolen from these accounts is\nhard to estimate.\n\nThere are many ways in which this data can be abused, including by the more devastating\nactors, such as ransomware gangs and APT groups. As an analysis of web marketplaces\nshows, the demand is highest for credentials that provide access to internal systems of\nenterprises. And the supply seems to be meeting the demand, as we counted almost 2,000\nRDP accounts for industrial enterprises being sold in marketplaces during the analysis\nperiod.\n\n### Recommendations\n\nWe recommend taking the following measures to ensure adequate protection of an industrial\nenterprise, its partner network operations, and business:\n\nConsider implementing two-factor authentication for corporate email access and other\ninternet-facing services (including RDP, VPN-SSL gateways, etc.) that could be used\nby an attacker to gain access to your company’s internal infrastructure and businesscritical data.\nMake sure that all the endpoints, both on IT and OT networks, are protected with a\nmodern endpoint security solution that is properly configured and is kept up-to-date.\nRegularly train your personnel to handle their incoming emails securely and to protect\ntheir systems from malware that email attachments may contain\nRegularly check spam folders instead of just emptying them\nMonitor the exposure of your organization’s accounts to the web\nConsider using sandbox solutions designed to automatically test attachments in\ninbound email traffic; make sure your sandbox solution is configured not to skip emails\nfrom “trusted” sources, including partner and contact organizations. No one is 100%\nprotected from a compromise.\nTest attachments in outbound emails, as well. This could give you a chance to realize\nyou’re compromised.\n\n### Appendix I – Indicators of compromise\n\n\n-----\n\n**Infrastructure IPs**\n```\n105.112.101.7\n105.112.102.213\n105.112.107.100\n105.112.109.252\n105.112.113.164\n105.112.113.250\n105.112.114.120\n105.112.115.230\n105.112.115.4\n105.112.117.199\n105.112.121.59\n105.112.144.173\n105.112.144.56\n105.112.144.77\n105.112.145.6\n105.112.147.156\n105.112.147.20\n105.112.148.252\n105.112.148.60\n105.112.150.35\n105.112.178.164\n105.112.26.202\n105.112.32.44\n105.112.33.155\n105.112.33.233\n105.112.33.40\n105.112.35.117\n105.112.37.192\n105.112.37.193\n105.112.37.222\n105.112.38.173\n105.112.38.201\n105.112.38.218\n105.112.38.249\n105.112.39.130\n105.112.39.167\n105.112.41.0\n105.112.41.149\n105.112.46.233\n105.112.46.38\n105.112.50.73\n105.112.50.80\n\n# Authors\n\n```\n\n-----\n\nKirill Kruglov\n\nSenior Research Developer, Kaspersky ICS CERT\n\n[Download PDF](https://ics-cert.kaspersky.com/media/Kaspersky-ICS-Cert-Campaigns-abusing-corporate-trusted-infrastructure-hunt-for-corporate-credentials-on-ics-networks-En.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-19 - Campaigns abusing corporate trusted infrastructure hunt for corporate credentials on ICS networks.pdf"
    ],
    "report_names": [
        "2022-01-19 - Campaigns abusing corporate trusted infrastructure hunt for corporate credentials on ICS networks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536143,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653713228,
    "ts_modification_date": 1653713228,
    "files": {
        "pdf": "https://archive.orkl.eu/3f35a8038eded2d277058f3cd5b7ac6dd7d825b2.pdf",
        "text": "https://archive.orkl.eu/3f35a8038eded2d277058f3cd5b7ac6dd7d825b2.txt",
        "img": "https://archive.orkl.eu/3f35a8038eded2d277058f3cd5b7ac6dd7d825b2.jpg"
    }
}