{
    "id": "689d9a20-e0f2-4b84-bfbd-597cb5719ed9",
    "created_at": "2022-10-25T16:48:14.431289Z",
    "updated_at": "2025-03-27T02:08:42.175416Z",
    "deleted_at": null,
    "sha1_hash": "cd02ced2b0c1a7ed91e9d631ad45f001fa71a837",
    "title": "",
    "authors": "",
    "file_creation_date": "2015-12-17T18:17:24Z",
    "file_modification_date": "2015-12-17T18:17:24Z",
    "file_size": 1205584,
    "plain_text": "# Operation Black Atlas\n\n## How Modular Botnets are Used in PoS Attacks\n\n##### TrendLabs Security Intelligence Blog\n\n Jay Yaneza and Erika Mendoza Trend Micro Cyber Safety Solutions Team\n\n December 2015\n\n\n-----\n\n## Contents\n\n#### Introduction ............................................................................................................ 3\n\n Technical Details ................................................................................................... 3\n\n Probing and Penetrating the Environment ......................................................... 3\n\n Point-of-Sale Threats ......................................................................................... 5\n\n New Items in NewPosThings ............................................................................. 7\n\n Use of Known PoS Malware Threats ............................................................... 10\n\n Gorynych or Diamond Fox ............................................................................... 13\n\n Spy Net RAT .................................................................................................... 20\n\n Victimology .......................................................................................................... 21\n\n Attribution ............................................................................................................ 23\n\n Conclusion ........................................................................................................... 25\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information and educational purposes only. It is not intended and should not be construed to constitute legal advice.\nThe information contained herein may not be applicable to all situations and may not reflect the most current situation. Nothing contained herein should be relied\non or acted upon without the benefit of legal advice based on the particular facts and circumstances presented and nothing herein should be construed otherwise.\nTrend Micro reserves the right to modify the contents of this document at any time without prior notice.\n\nTranslations of any material into other languages are intended solely as a convenience. Translation accuracy is not guaranteed nor implied. If any questions arise\nrelated to the accuracy of a translation, please refer to the original language official version of the document. Any discrepancies or differences created in the\ntranslation are not binding and have no legal effect for compliance or enforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include accurate and up-to-date information herein, Trend Micro makes no warranties or representations of any\nkind as to its accuracy, currency, or completeness. You agree that access to and use of and reliance on this document and the content thereof is at your own risk.\nTrend Micro disclaims all warranties of any kind, express or implied. Neither Trend Micro nor any party involved in creating, producing, or delivering this document\nshall be liable for any consequence, loss, or damage, including direct, indirect, special, consequential, loss of business profits, or special damages, whatsoever\narising out of access to, use of, or inability to use, or in connection with the use of this document, or any errors or omissions in the content thereof. Use of this\ninformation constitutes acceptance for use in an “as is” condition.\n\n\n-----\n\n## Introduction\n\nOur analysis of Black Atlas has given us a lot of information on the tools used by cybercriminals their operations, as\nwell as how they utilize these tools in targeting PoS systems. We learned about their methods of initial compromise\nas well as how they use pen-testing tools to gain further access into the network. We also found Gorynych—a modular\nbotnet client that was retrofitted to use BlackPOS and target PoS systems, as well as a variety of other tools that the\nBlack Atlas operators used to penetrate networks.\n\nIn this report, we will look further into these tools and techniques, how they work, and what network administrators\ncan do to protect their networks against these threats.\n\n## Technical Details\n\n### Probing and Penetrating the Environment\n\nThrough the use of the Trend Micro™ Smart Protection Network™, we have been able to determine that the attackers\nused several tools to probe and compromise an IP address list:\n\nTool Name Why and when is it used?\n\nMedusa Parallel Enumerates services and tries to authenticate via brute force method. Supports multiple\nNetwork Login Auditor protocols.\n\nSimple SMTP Scanner Used to fingerprint a remote SMTP server and guess which mail software is used on a\nremote server. Though most environments are firewalled, the name of the service that\nanswers on a known port may provide more context of the underlying network infrastructure\nhidden behind the firewall.\n\nFast SYN Scanner Scans port on a given range of hosts, using a specified interface, to see which host would\nrespond back from a TCP SYN packet.\n\nnVNC Scanner Can take a combination of IPs, and try a list of passwords to authenticate on a VNC port.\npackage\n\nnCrack High-speed network authentication cracking tool. Supports multiple protocols.\n\nnPCA Bruter Scans port on a given range of hosts.\n\n3\n\n|Tool Name|Why and when is it used?|\n|---|---|\n|Medusa Parallel Network Login Auditor|Enumerates services and tries to authenticate via brute force method. Supports multiple protocols.|\n|Simple SMTP Scanner|Used to fingerprint a remote SMTP server and guess which mail software is used on a remote server. Though most environments are firewalled, the name of the service that answers on a known port may provide more context of the underlying network infrastructure hidden behind the firewall.|\n|Fast SYN Scanner|Scans port on a given range of hosts, using a specified interface, to see which host would respond back from a TCP SYN packet.|\n|nVNC Scanner package|Can take a combination of IPs, and try a list of passwords to authenticate on a VNC port.|\n|nCrack|High-speed network authentication cracking tool. Supports multiple protocols.|\n|nPCA Bruter|Scans port on a given range of hosts.|\n\n\n-----\n\n|Fast RDP Brute GUI v2.0 package|Scans for a list of IP addresses and uses a user name/password combination for authentication.|\n|---|---|\n|Sentry MBA Universal Crack/bruteforce|Universal HTTP dictionary brtueforcer/cracking tool. Highly configurable.|\n|RealVNC viewer 5.2.3|One a VNC is exposed, simple use VNC Viewer to attempt to connect to the port.|\n|Cain and Abel|Password recovery tool for the Microsoft Operating System. Allows recovery of various passwords by sniffing the network, cracking encrypted passwords using dictionary, brute- force, etc.|\n|RDP Scanner X|Scans for a list of IP addresses and uses a username/password combination for authentication.|\n\n\nAfter gaining access to the initial host, the attacker now uses these tools to move further within the network:\n\n|Tool name|Why and when is it used?|\n|---|---|\n|Advanced IP Scanner|Free, fast and easy to use IP scanner, used to identify internal hosts.|\n|Radmin|A popular remote control software alternative to the default Remote Desktop. Can be planted on other hosts to further penetrate within the network.|\n|PushVNC package|Once inside a network, can be used to remotely push and start the VNC service.|\n|Fgdump|Newer version of pwdump tool for extracting NTLM and LanMan password hashes from Windows.|\n|Dameware|Dameware, like Radmin, is a popular remote control software alternative to the default Remote Desktop. Can be planted on other hosts to further penetrate within the network.|\n|VNC Password Recovery Tool|A small utility that can recover passwords stored by the VNC application.|\n\n\n4\n\n\n-----\n\n|xDedic RDP Patch|RDP Patcher Can create a new local account that can be used if the initially compromised account has changed passwords|\n|---|---|\n\n\n### Point-of-Sale Threats\n\nApparently, the website we wrote about earlier wasn't the only one that distributed CenterPOS and Katrina. Activity\non that cybercriminals’ toolbox had slowed down around the time we wrote about it, and they have set up shop\nsomewhere else. Here are other contents that we found:\n\n|Original Name|SHA1|Size|TM Detection|Notes|\n|---|---|---|---|---|\n|32.exe|007c82ee41939459e1bc84 3097e1a56287cd86bd|169984|TSPY_POSNEWT.SMA|32-bit NewPOSThings|\n|64.exe|27e99e527914eca78b851b b9f2a4d0441d26e7e3|194048|TSPY64_POSNEWT.SM|64-bit NewPOSThings|\n|AutoExe.bat|2c8d4804c3d5c9458b81df 5575ad11357c6727b6|335|BAT_NEUTRINO.B|Downloads and installs b+.exe|\n|AutoExe1.bat|cb98f62327cb998edacbd93 c471494346d6ffdb2|423|BAT_NEUTRINO.BA|Downloads and installs 32.exe and 64.exe|\n|bt.exe|bc7618bfc3a80ea89f52362 baa230ee87a24ca3f|87040|BKDR_NEUTRINO.SM|Neutrino/KASIDE T (w/POS)|\n|b+.exe|60b679361db8413060cce8 ad901006d5ecdf0d21|84664|TROJ_GEN.R047C0DIN15|Neutrino/KASIDE T (w/POS)|\n|CenterPoint.ex e|f9b4451988f4dfbaf918a5a3 2c7976da89377fd2|71168|BKDR_CENTERPOS.A|CenterPOS|\n|klg.exe|81672ade63280796b8848 350fd819f3b63d3d975|101888|TSPY_KEYLOGR.U|Key logger -- saves logs to %userprofile%\\w|\n\n\n5\n\n\n-----\n\n|Col1|Col2|Col3|Col4|lnsys.inf|\n|---|---|---|---|---|\n|KTNC.exe|a8cca3c64065961d3f8f47f 1e40553a525590450|159232|BKDR_ALINA.POSKAT|Alina (Katrina)|\n|recon.exe|c2974699bfc215501614bf8 8379da446d84baeb2|4852488|SPYW_CCVIEW|Cardholder Data Discovery Tool (legitimate file; scans files on server, workstation, storage devices for credit card data).|\n|start.exe|150cd61abaf54de3ba768f0 14cb4b3e9b9b954fa|47616|TROJ_POSLOAD.A|Downloader, downloads and installs CenterPOS|\n|X.bat|08882799c720b54d44108 dd095baa9457d342da5|738|BAT_CENTERPOS.B|Downloads and installs centerpoint.exe|\n\n\nComparing the files that were found previously, this is definitely an upgrade from their previous approach. Let's start\nwith the one of the batch files in use, AutoExe1.bat:\n\n6\n\n\n-----\n\nSome observations from AutoExe1.bat:\n\n1. It uses bitsadmin.exe to download the files that would load NewPOSThings. Background Intelligent Transfer\n\nSystem (BITS) usually comes into play when the operating system downloads updates from Microsoft of the\nlocal WSUS server. But it can be used to download files such as the malware shown above. The method of\ndownloading malware through BITSADMIN has been talked about since as early as 2013.\n\n2. It now clears the system events to cover tracks.\n\n3. It also has one call to delete AutoExe.bat. This last instruction appears to be a typo, since it deleted\n\nAutoExe1.bat instead.\n\nThere is an AutoExe.bat, but it loaded the Neutrino/Kasidet variant that had PoS functionality.\n\nThe batch file has a very similar approach for loading this particular Neutrino/Kasidet variant. Both batch files\ncombined two batch files from the previous approach that they had—namely Setup.bat and ClearEventN.bat.\n\nThere are some files that seem to be reused in this toolbox though, like recon.exe, X.bat (though they removed the\nDropbox download location), as well as the binaries of CenterPOS and NewPoSThings.\n\nThe differences, however, do not stop there.\n\n### New Items in NewPosThings\n\n[There weren’t many changes done to the NewPoSThings malware from a technical standpoint. With the discovery of](http://blog.trendmicro.com/trendlabs-security-intelligence/newposthings-has-new-pos-things/)\n[the 64-bit variants and the usage of v3.0 last April, version 3.0 and 64-bit malware types became more](http://blog.trendmicro.com/trendlabs-security-intelligence/newposthings-has-new-pos-things/)\ncommonplace to the point that we rarely see the version 2.x anymore.\n\nSHA1 TM Detection C&C Version\n\nc3732c425d41b68150e0eb37 TSPY_POSNWT.SMA hxxp://chiproses[.]net/connect/ 3.0\n2d860a6ce1398973 3\n\nf96bacd550e8f113134980cde3 TSPY_POSNEWT.SMA hxxp://46.161.30[.]200/b/con 3.0\n3eecfa6da3ebe5 nect/2\n\n7\n\n|SHA1|TM Detection|C&C|Version|\n|---|---|---|---|\n|c3732c425d41b68150e0eb37 2d860a6ce1398973|TSPY_POSNWT.SMA|hxxp://chiproses[.]net/connect/ 3|3.0|\n|f96bacd550e8f113134980cde3 3eecfa6da3ebe5|TSPY_POSNEWT.SMA|hxxp://46.161.30[.]200/b/con nect/2|3.0|\n\n\n-----\n\n|cfe25d6e4b994b8f07fdfc197c8 f0b2081df4d5b|TSPY_POSNEWT.SMA|hxxp://chiproses[.]net/connect/ 4|3.0|\n|---|---|---|---|\n|29051ca6c3e0c21065f2cbce8b fa2926f6d95fbd|TSPY_POSNEWT.SMA|hxxp://chiproses[.]net/connect/ 5|3.0|\n|13f1f2b2eac06d0ac9a499d4a1 8e55e7ae931434|TSPY_POSNEWT.SMA|hxxp://corner- update[.]net/connect/6|3.0|\n|56fe558916e51a0f81dfb20718 3be465199accbc|TSPY64_POSNEWT.ZSS|hxxp://corner- update[.]net/connect/6|3.0|\n|77dc1389835f48454ef5d83d3 aa3a424eac54a8e|TSPY_POSNEWT.SMA|hxxp://178.32.130[.]54/connec t/3|3.0|\n|0868af41f7279a8cee499bdbb1 00084564e1aaff|TSPY_POSNEWT.SMA|hxxp://179.43.128[.]69/connec t/3|3.0|\n|4ee213576bf936e8df31c725ab 13ab9fa5dbea72|TSPY64_POSNEWT.B|hxxp://46.161.30[.]200/b/con nect/2|3.0|\n|22a01b064b3c173163ace331 38ef243fbf7ef6af|TSPY_POSNEWT.SMA|hxxp://jtrho[.]net/connect/9|3.0|\n|007c82ee41939459e1bc8430 97e1a56287cd86bd|TSPY_POSNEWT.SMA|hxxp://damcodes777[.]cc/b/co nnect/2|3.0|\n|02cb522137f370355de9c2e3c ae7ca9a168b95ec|TSPY64_POSNEWT.SM|||\n\n\nAside from just using NewPOSThings and variants of Alina and Kasidet/Neutrino, we’ve also seen an old PoS threat\ncalled Project Hook and an installation of PwnPOS all of which have the same installation method used.\n\nWith these new items, on the following page is a graph to illustrate:\n\n\n8\n\n\n-----\n\n9\n\n\n-----\n\nSifting through the latest samples of NewPOSThings, Project Hook, PwnPOS, Alina, and Kasidet/Neutrino, they all\nindicate that the latest infections are all related: the file characteristics, the method of distribution as well as the\nsource.\n\n### Use of Known PoS Malware Threats\n\nCase Study: Healthcare\n\nThe most interesting observed infections affected organizations in the healthcare industry. These seem to be the\nunlikely target for PoS malware, but nowadays, it doesn’t really matter to cybercriminals as long as there is money to\nsteal. In fact, they have recently become more likely to infiltrate other businesses apart from retailers.\n\nTo start, let’s look at samples.\n\nSet 1: Pediatric Dentistry Clinic\n\nSHA1 TM Detection Description\n\n4a88a3696251b7079857eb98455621b9ca632f42 BKDR_GORYNYCH.SM Gorynych / Diamond\nFox\n\n80aedf2eddc9e2f39306cbaa63e59c7a08468699 TSPY_POCARDL.AI BlackPOS\n\n1efa8798d819147300a6aa27d0cc54f4b929badf TSPY_ALINAOS.DEX Alina (Spark)\n\n[Take note that BKDR_GORYNYCH.SM was found in Temporary Internet Files as loader[1].exe, which indicates that it](http://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/BKDR_GORYNYCH.SM)\nwas downloaded directly from the browser. It wouldn’t make sense if the user actually just tried to download it, unless\nthere is someone else in control of the system. We mentioned earlier that the attacker makes use of several tools\nsuch as RDP scanners and password brute forcers as its initial step to find its targets and gain access to the system.\nThis possibility is something to consider, and it is most likely the point of entry in this case since one of the endpoints\nin this network had an open RDP port. If a brute force attack is successful, the attacker will be in full control and will\nbe ready to plant malware through direct download.\n\n10\n\n|SHA1|TM Detection|Description|\n|---|---|---|\n|4a88a3696251b7079857eb98455621b9ca632f42|BKDR_GORYNYCH.SM|Gorynych / Diamond Fox|\n|80aedf2eddc9e2f39306cbaa63e59c7a08468699|TSPY_POCARDL.AI|BlackPOS|\n|1efa8798d819147300a6aa27d0cc54f4b929badf|TSPY_ALINAOS.DEX|Alina (Spark)|\n\n\n-----\n\nSet 2: Assisted Living Facility\n\nSHA1\n\n68a14979c9a589eb1dd6f232895737e5bfaf07cd\n\na8cca3c64065961d3f8f47f1e40553a525590450\n\n007c82ee41939459e1bc843097e1a56287cd86bd\n\nf74b17ca7a542323534a7c7766a8dfe821c6bcce\n\na913dc86f9217a9c5163f2508d86a085013f9ef0\n\n37c0d892b38bbf9d8c6a8d35db5b32555cb758c8\n\nc76975a4b4606890a586b4914d2f624780c97627\n\n80aedf2eddc9e2f39306cbaa63e59c7a08468699\n\n**5bf0256876cee98e20c92c8771b98f3143b07d61\n\n27e99e527914eca78b851bb9f2a4d0441d26e7e3\n\n**22a01b064b3c173163ace33138ef243fbf7ef6af\n\nf6d548f245169b965671b279dff052d5d26f4ec7\n\n0868af41f7279a8cee499bdbb100084564e1aaff\n\n906c8cf51530ce2852257c966f4d4da7192b9991\n\n**Samples dropped via pcAnywhere\n\n\nGorynych / Diamond\nFox\n\nTermSrv Patch to\nEnable Concurrent\nRemote Desktop\nSessions\n\nProject Hook POS\n\nBlackPOS\n\nProject Hook POS\n\nNewPOSThings\n\nNewPOSThings\n\nNewPOSThings\n\nNewPOSThings\n\nCreates new RDP\nadministrator\naccount\n\n11\n\n|SHA1|TM Detection|Description|\n|---|---|---|\n|68a14979c9a589eb1dd6f232895737e5bfaf07cd|BKDR_SPYNET.E|Spy Net RAT|\n|a8cca3c64065961d3f8f47f1e40553a525590450|BKDR_ALINA.POSKAT|Alina (Katrina)|\n|007c82ee41939459e1bc843097e1a56287cd86bd|TSPY_POSNEWT.SMA|NewPOSThings|\n|f74b17ca7a542323534a7c7766a8dfe821c6bcce|TSPY_POCARDL.YL|BlackPOS|\n|a913dc86f9217a9c5163f2508d86a085013f9ef0|BKDR_GORYNYCH.B|Gorynych / Diamond Fox|\n|37c0d892b38bbf9d8c6a8d35db5b32555cb758c8|CRCK_PATCH|TermSrv Patch to Enable Concurrent Remote Desktop Sessions|\n|c76975a4b4606890a586b4914d2f624780c97627|TSPY_POSHOOK.C|Project Hook POS|\n|80aedf2eddc9e2f39306cbaa63e59c7a08468699|TSPY_POCARDL.AI|BlackPOS|\n|**5bf0256876cee98e20c92c8771b98f3143b07d61|TSPY_POSHOOK.B|Project Hook POS|\n|27e99e527914eca78b851bb9f2a4d0441d26e7e3|TSPY64_POSNEWT.SM|NewPOSThings|\n|**22a01b064b3c173163ace33138ef243fbf7ef6af|TSPY_POSNEWT.SMA|NewPOSThings|\n|f6d548f245169b965671b279dff052d5d26f4ec7|TSPY64_POSNEWT.SM|NewPOSThings|\n|0868af41f7279a8cee499bdbb100084564e1aaff|TSPY_POSNEWT.SMA|NewPOSThings|\n|906c8cf51530ce2852257c966f4d4da7192b9991|HKTL_RDPPatcher|Creates new RDP administrator account|\n\n\n-----\n\nThere are a few things worth noting here:\n\n- We know from the Smart Protection Network that some of these files were placed into the system using\npcAnywhere. This means that the initial compromise happened in another computer within the network.\n\nSome hacking tools related to Remote Desktop were found in the system, which includes CRCK_PATCH, a\nTermSrv patch that enables concurrent remote desktop sessions so that it is not limited to only one user\naccessing the computer at a time. Another hacking tool is HKTL_RDPPatcher, which allows the attacker to create\na new RDP administrator account so that he would still have access to the machine even after the password has\nbeen changed. Note that pcAnywhere and Remote Desktop were used here to blend with the usual administrative\nmethods used. It could be assumed that other methods would be applied by the threat actor should the\nenvironment be using other remote desktop utilities.\n\n- The use of RATs such as Spy Net enables a stealthier and more convenient approach for controlling the\ncompromised machine. Other functionalities like password grabbing and keylogging may also be used to easily\nexfiltrate information. The same can be said about Gorynych, which is also capable of information theft. These\ntwo will be discussed further in the next sections.\n\n- The final step in this attack is to install a PoS threat. The attacker evidently has a wide variety of POS malware in\nits toolset as seen in this infection.\n\nWe are already familiar with the listed PoS threats above – BlackPOS, Project Hook, Posnewt, Alina, Katrina. Spy\nNet has also been around for a few years now. But what’s BKDR_GORYNYCH? Upon analysis, we figured that\nwe’ve just discovered a new player in the game of credit card theft.\n\n12\n\n\n-----\n\n### Gorynych or Diamond Fox\n\nTechnically, Gorynych is not considered a PoS malware as it wasn’t designed to attack PoS systems. It can be likened\nto a bot and/or an information stealer that downloads BlackPOS to make use of its RAM scraping functionality. So is\nGorynych simply a downloader that delivers random malware to infected computers? Apparently not. In fact,\nGorynych complements BlackPOS so well that it even knows what its output file would be. The output is uploaded to\nits control panel to view all the dumped credit card numbers in memory.\n\nThe images used for Gorynych’s control panel login page are called “Kartoxa,” another name for BlackPOS.\n\nAside from the POS plugin, there are other modules that make up this malware’s entirety. These are usually\ndownloaded from a subdirectory in the C&C with fixed names.\n\n13\n\n\n-----\n\n|Location|Description|\n|---|---|\n|.\\plugins\\spam.p|Spam|\n|.\\plugins\\social.p|Social Media|\n|.\\plugins\\screenshot.p|Screenshot|\n|.\\plugins\\rdp.p|RDP|\n|.\\plugins\\POS.p|BlackPOS|\n|.\\plugins\\passwords.p|Password grabber (browser)|\n|.\\plugins\\mail.p|Mail Grabber|\n|.\\plugins\\ins.p|Instant Messaging|\n|.\\plugins\\homepage.p|Homepage|\n|.\\plugins\\ddos.p|DDOS|\n|.\\plugins\\keylogger.p|Keylogger|\n|.\\plugins\\ftp.p|FTP Password Grabber|\n\n\nMost of the time, these functionalities are not used altogether. The most frequently used ones have been highlighted\nto recognize the attacker’s intent in using this malware. We already have a clue from its toolset and we are not\nsurprised to see that the attacker is mainly concerned with passwords, key logs and credit card information.\n\nGorynych without the plugins can do only a few things which are mostly for installation and anti-analysis. Some of\nthese routines can be enabled or disabled depending on the builder options selected. Let’s examine that in the next\nsection.\n\nAnti-Analysis Information Theft Others\n\nAnti-AV Bitcoin Wallet UAC Forcer\n\nAnti-Sandbox Melt\n\nAnti-VM Update\n\nInstall\n\nUninstall\n\nDownload and Execute\n(in memory or on disk)\n\nUSB Spread\n\nGiven the fact that there is a Bitcoin Wallet option, this may not come into surprise as this topic of bitcoin payment to\neveryday establishments have been picking up wind as of late.\n\nDiamond Fox Builder and Configuration\n\n14\n\n|Anti-Analysis|Information Theft|Others|\n|---|---|---|\n|Anti-AV|Bitcoin Wallet|UAC Forcer|\n|Anti-Sandbox||Melt|\n|Anti-VM||Update|\n|||Install|\n|||Uninstall|\n|||Download and Execute (in memory or on disk)|\n|||USB Spread|\n\n\n-----\n\nWhen building Gorynych, the user is allowed to customize some things like the connection, security keys, installation\ndetails, and anti-analysis options.\n\nYou’ll notice on the installation tab that the keylogger and POS grabber are disabled by default. However, these are\nenabled in the infections that we see. This strengthens our theory that the target of the attacker(s) are mainly POS\nsystems.\n\nOnce done, the configuration is saved and encrypted in either the resource section or the end of the file. It is saved in\nthe resource by default.\n\nThese are the corresponding configuration options:\n\nPanel Command and Control Server\n\nFBP Fall Back Panel (Backup CnC)\n\n15\n\n|Panel|Command and Control Server|\n|---|---|\n|FBP|Fall Back Panel (Backup CnC)|\n\n\n-----\n\n|Time|Connection Time|\n|---|---|\n|MKey|Encryption key|\n|Xor|Encryption key|\n|UsA|User Agent|\n|BtcA|Bitcoin Address|\n|Asys|Anti-Sysanalyzer|\n|ABox|Anti-VirtualBox|\n|AVMW|Anti-VMWare|\n|Abis|Anti-Anubis|\n|Olly|Anti-OllyDbg|\n|Boxie|Anti-Sandboxie|\n|Malwr|Anti-Malwr.com|\n|Norman|Anti-Norman|\n|Wine|Anti-Wine|\n|Reg|Disable Regedit|\n|Task|Disable Taskmanager|\n|USB|USB Spread|\n|Inam|Install Name|\n|Ipat|Install Path|\n|HKML|HKCU/HKLM Startup Method|\n|WLOG|Winlogon Startup Method|\n|SFOL|Startup Folder Startup Method|\n|MELT|Melt / Self Delete|\n|Keyl|Keylogger|\n|PoS|POS RAM Scraping|\n\n\n16\n\n\n-----\n\n|Agra|Automatic Grabbers|\n|---|---|\n|Stpe|Startup Persistence|\n\n\nC&C Communication\n\nThe initial download of the keylogger and PoS plugins would have the user-agent similar to that of the browser of the\naffected endpoint.\n\nHowever, the other plugins (ftp, rdp, mail, ins, and passwords) are downloaded via the “vb wininet” user-agent.\n\nAfter downloading its plugins, Gorynych reports to its server via gate.php using HTTP POST. This time, it uses its own\nuser-agent that can be found in its configuration file. The parameters consist of system information used to profile the\nbot, mainly for identification in the Gorynych control panel.\n\n17\n\n\n-----\n\n[The posted information is encrypted, but as pointed out in a blog post by Cylance, instead of using the encryption key](http://blog.cylance.com/a-study-in-bots-diamondfox)\nitself, it XOR’ed the entire string with its key length.\n\nThis is how it looks like when decrypted:\n\nThe rest of the stolen information are also uploaded via HTTP POST with the markers \"--Xu02=$\" and \"--Xu02=$--\"\nat the beginning and end of data.\n\n18\n\n\n-----\n\nThe panel allows LOG, TXT, JPG, HTML and wallet files to be uploaded via post.php. These logs are stored in these\nsubdirectories:\n\n.\\logs\\dump\\ Credit card information\n\n.\\logs\\scr\\ Screenshots\n\n.\\logs\\pass\\ Browser passwords\n\n.\\logs\\ftp\\ FTP passwords\n\n.\\logs\\ins\\ Instant messaging passwords\n\n.\\logs\\rdp\\ RDP passwords\n\n.\\logs\\mail\\ Email passwords\n\n.\\logs\\kyl\\ Key logs\n\n.\\logs\\wallet\\ Bitcoin wallet\n\n[A few months earlier, a GitHub user named Xyl2k posted a file upload vulnerability on DiamondFox, which allowed a](https://gist.github.com/Xyl2k/584454b6796206832462)\nuser to upload a PHP reverse shell to the server instead of logs. This has been fixed in later versions.\n\n19\n\n|.\\logs\\dump\\|Credit card information|\n|---|---|\n|.\\logs\\scr\\|Screenshots|\n|.\\logs\\pass\\|Browser passwords|\n|.\\logs\\ftp\\|FTP passwords|\n|.\\logs\\ins\\|Instant messaging passwords|\n|.\\logs\\rdp\\|RDP passwords|\n|.\\logs\\mail\\|Email passwords|\n|.\\logs\\kyl\\|Key logs|\n|.\\logs\\wallet\\|Bitcoin wallet|\n\n\n-----\n\n### Spy Net RAT\n\nIt is clear that in this attack, Gorynych was used to steal sensitive information such as user credentials and key logs.\nBut in order to maintain full control, the attackers need a Remote Access Tool which in this case was Spy Net.\n\nBuilder\n\nThe Spy Net builder is pretty straightforward. There are a wide variety of options that can be configured for Spy Net,\nincluding the AutoRun, installation directory, error messages, mutex name, and process injection. The user can also\nchoose which anti-analysis or anti-debugging features will be enabled or disabled. Aside from the C&C server, the\nRAT can also send its logs to an FTP server if available.\n\n20\n\n\n-----\n\nMalicious Behavior\n\nThe result is similar to having your computer accessed via Remote Desktop Connection, plus more. Aside from the\nregular backdoor routines, it is also capable of automatically grabbing passwords, keylogging, looking at the\ncontents of your clipboard, and even spying on you using your own webcam and microphone.\n\nWe listed all its capabilities in the table below:\n\nRemote Control Surveillance Information Theft Miscellaneous\n\nFile Manager Capture Audio Keylogger Display Message Box\n\nRegistry Editor Capture Webcam Clipboard Shutdown\n\nGet MSN Messenger\nDOS Prompt Hibernate\nContact List\n\nDevice List Search Passwords Log-off\n\nActive Ports List Restart\n\nInstalled Programs Turn Monitor Off\n\nWindows List Hide Start Button\n\nService List Hide Desktop Icons\n\nProcesses List Hide Taskbar\n\nRemote Desktop Disable Mouse\n\nDownload and\nReverse Mouse Buttons\nExecute File\n\nOpen Web Page Hide System Tray Icons\n\nRun Command Send Chat Message\n\nSend File and Run Screen Capture\n\nHTTP Proxy\n\nUpdate Server\n\nUninstall\n\nRename Self\n\n## Victimology\n\n|Remote Control|Surveillance|Information Theft|Miscellaneous|\n|---|---|---|---|\n|File Manager|Capture Audio|Keylogger|Display Message Box|\n|Registry Editor|Capture Webcam|Clipboard|Shutdown|\n|DOS Prompt||Get MSN Messenger Contact List|Hibernate|\n|Device List||Search Passwords|Log-off|\n|Active Ports List|||Restart|\n|Installed Programs|||Turn Monitor Off|\n|Windows List|||Hide Start Button|\n|Service List|||Hide Desktop Icons|\n|Processes List|||Hide Taskbar|\n|Remote Desktop|||Disable Mouse|\n|Download and Execute File|||Reverse Mouse Buttons|\n|Open Web Page|||Hide System Tray Icons|\n|Run Command|||Send Chat Message|\n|Send File and Run|||Screen Capture|\n||||HTTP Proxy|\n||||Update Server|\n||||Uninstall|\n||||Rename Self|\n\n\n21\n\n\n-----\n\nAs mentioned, a big part of Operation Black Atlas started off by scanning an IP range, knocking on the doors to see\nwhich ports are open, and attempting to brute-force their way through remote desktop protocols. By identifying the\nenvironments that fall victim to this methodology, we found that a good majority were small-to-medium businesses\n(SMBs) that have opened these ports intentionally. Given the nature of the business, we can assume that the opened\nports were most likely for outsourced IT services or so that their in-house IT admins (if they exist) can get back in the\nnetwork from remote locations.\n\nSMBs have different challenges as they need to figure out how technology solutions can help grow their business, try\nto balance IT spending costs for upgrades or maintenance, or even just keep the business running. With this, it comes\nwith no surprise that there may be some quick fixes or misconfigurations here and there that may have lesser chance\nof happening in a larger environment with a dedicated IT staff.\n\nCertainly, there are regional peculiarities that we have observed. For example, there was a minor hit in Switzerland for\n[a PwnPOS sample that they tried to plant on a terminal that was using PaniPOS Terminal. The software, PaniPOS](http://www.panipro.ch/panipos-office-fern-verwaltung-verkaufsstellen-de230.html)\nTerminal, was created by a local Swiss company called Panipro AG. Therefore, we know that the threat actors would\nnot go seeking for the same kind of terminal in, say, Latin America. That being said, Operation Black Atlas had a wide\nvariety of PoS threats to choose from and, for the purpose of focusing on a specific region in this write-up, we would\nbe mentioning some observed data but most of the material would cover what we have observed within the United\nStates.\n\nThe two PoS threats that may have the most significant impact would be NewPOSThings and Gorynych. The\ndistribution of NewPOSThings concentrated within the United States, some in Europe and finally a few hits in Asia.\n\nWhile we were able to see infections in Asia (Australia, India, Taiwan), Europe (Germany, United Kingdom) and Latin\nAmerica (Chile) for Gorynych, infections within the United States looked quite interesting as there is a high possibility\n\n22\n\n\n-----\n\nof finding both Gorynych and NewPOSThings. We then looked into some of the affected establishments of Operation\nBlack Atlas where we have spotted both indicators of Gorynych and NewPOSThings:\n\n  - A multi-state healthcare provider and two dental clinics\n\n  - A machine manufacturer\n\n  - A technology company focusing on insurance services\n\n  - A gas station that has a multi-state presence\n\n  - A beauty supply shop\n\nNot so much can be said for finding both Gorynych and NewPOSThings in a gas station or a beauty supply shop, but\nfinding a bot that had information-stealing capability in the industries of insurance, manufacturing, and healthcare\ncertainly can raise alarm. For example, any individual who walks into a dental clinic or ask services from a healthcare\nprovider would be required to present proof of identification, fill out forms that may contain sensitive information like\nan individual’s Social Security number (SSN) or driver’s license ID number, and even present proof of insurance. If\npaper forms were initially used by patients to fill in their information, then there would be manual data input to the\nback-end healthcare system. All of these data that require keystrokes can be easily monitored by Gorynych’s\nkeylogger functionality.\n\nFinally, and though we have not seen this in action, the Bitcoin wallet information theft functionality presents\nsomething as a forward looking feature. As early as later 2013 and early 2014, there have been healthcare providers\n[who have supported payment through bitcoins to maintain significant anonymity protections for patients. Being able](http://www.healthcareitnews.com/news/physicians-now-taking-payment-bitcoin)\nto tap into that anonymous financial stream would be quite lucrative for cybercriminals.\n\n## Attribution\n\nNo strong attribution can be made at this time. However, the tools used for initial entry are seen, discussed and\ndistributed in multiple hacking and security forums sourced within the last two years.\n\nIn combination to the tools being used, we have observed some of the files packaged specifically for some affected\nenvironments are resemble languages spoken in Central Europe, like aiureala.zip (meaning “nonsense” in some\ntranslations), as well as a file named oricenume.exe (sometimes meaning “any name”). Aside from this, some of the\nuncovered log files have a time stamp format popularly used in Europe (dd/mm/yyyy).\n\nIt would also be worth noting that the link to the infrastructure being used in this operation and to PwnPOS is quite\n[strong. In our write-up of PwnPOS, the method being used for data exfiltration would be the use of email, as seen](http://blog.trendmicro.com/trendlabs-security-intelligence/pwnpos-old-undetected-pos-malware-still-causing-havoc/)\nbelow.\n\n23\n\n\n-----\n\nNotice that the email address of the recipient was also used as the administrative contact of a domain related to Spy\nNet.\n\nOne other domain used in the Spynet was registered by “Petrov Strong”. The same name was used to register an\naccount at a carding forum around September 2015.\n\n24\n\n\n-----\n\nThis does not, however, point us explicitly to anyone or any group in particular but it does highlight the following facts\nabout this threat actor/group:\n\n  - The toolset would be from security forums that discuss such tools. The group or the actors have been\nkeeping themselves updated with the recent tools, and may have a strong background in network\npenetration methodologies.\n\n  - The threat actor or group has a long history with point-of-sale-related threats, having access to different\nRAM scraper families.\n\n  - With the use of remote access Trojans to maintain control of the compromised environment, the group may\nbe interested in other aspects of the network.\n\nThe use of existing tools within the environment also paints a picture that the group, or the threat actors, has a big\npicture in mind – they are able to take the environment with the correct context, and use it for their own advantage. It\nalso shows that enough reconnaissance has been performed so that they can use effective methodologies against\nthe environment that they intend to compromise. However, unlike network penetration testers, they do not have\nrestricted goals, has tricks up their sleeve to prolong their access and seek out other forms of interesting data for\ntheir own benefit.\n\n## Conclusion \n\n25\n\n\n-----\n\nOur research indicates there is a high possibility of the threat actors having direct remote-access to the compromised\nnetwork at one point or another.\n\n[As early as 2012 Data Breach Investigations Report by Verizon, Remote Access services already suffered high-volume](http://www.verizonenterprise.com/about/events/2012dbir/)\nautomated attacks -to quote:\n\n“Remote access services (e.g., VNC, RDP) continue their rise in prevalence, accounting for 88% of all\nbreaches leveraging hacking techniques—more than any other vector. Remote services accessible from the\nentire Internet, combined with default, weak, or stolen credentials continue to plague smaller retail and\nhospitality organizations.”\n\nEven though this has been said and acknowledged for the past three years, we cannot be 100% sure of the attackers'\nmethodology. It does not, however, hurt to be extra vigilant, and make sure that we do not forget what history and\npast reporting have taught us in allowing remote access services. And even though we may create sufficiently strong\npassword combinations, we should make sure that our credentials do not get compromised, as well as have good\npassword policies in place. While a good antimalware solution may provide protection, a compromised account that\nthreat actors can use to reintroduce themselves within the environment renders those technology investments near\nuseless.\n\nWe have also seen threat actors persistently try to introduce PoS threats through creative means – such as commandline FTP. It is usually a given nowadays that we screen and limit items coming in through the publicly interfacing\nfirewall, or filter out items that traverse through web/HTTP and even apply filtering. However, we seldom inspect other\nprotocols that may be used to transfer files. A threat actor having direct remote-access to a terminal may simply\nlaunch a command-line FTP and pull down other threats, efficiently evading the web/HTTP filtering. As efficient as\ngetting in through remote-desktop utilities is, the same entry vector like the native Microsoft Remote Desktop and\nSymantec PCAnywhere application would have efficient means to transfer files from one host to another. This\ncompletes not only the initial entry point but assists with lateral movement as well.\n\nSomething specific to Gorynych is the bot’s ability to get bitcoin wallet information - passwords stored in either RDP\nsessions, browsers or FTP clients, as well as key strokes (with its use of a keylogger). These types of information\nstealers, as well as cracking utilities and hack tools, should be given serious attention once discovered. The existence\nof such malicious software within the network should be tracked, endpoints where these utilities have landed should\nbe triaged, and a process should be in place to handle this kind of incident does occur. For example, finding a\nkeylogger on a terminal that processes insurance claims or data entry for patient information should be immediately\ndealt with as this could be close to a serious data breach as the attacker can now access the patient portal and take\nhold of patient information data.\n\nWe know that Black Atlas’ current operations are somewhat successful as they have been able to compromise some\ninteresting victims that, for them, are low-hanging fruits and are easy prey. Furthermore, we believe that this method\nof operation would continue, improve and may still be utilized in the future by other threat actor groups.\n\n## Recommendations\n\n[The following items have been mentioned in the 2012 Data Breach Investigations Report by Verizon, and we will re-](http://www.verizonenterprise.com/about/events/2012dbir/)\nstate them here as they still hold true:\n\nFor smaller organizations:\n\n26\n\n\n-----\n\n  - Implement a firewall or ACL on remote access services.\n\n  - Change default credentials of POS systems and other internet-facing devices.\n\n  - If a third party vendor is handling the two items above, make sure they’ve actually done them.\n\nFor large organizations:\n\n  - Eliminate unnecessary data; keep tabs on what’s left.\n\n  - Ensure essential controls are met; regularly check that they remain so.\n\n  - Monitor and mine event logs.\n\n  - Evaluate your threat landscape to prioritize your treatment strategy.\n\n\n27\n\n\n-----\n\nWe would like to add that small organizations may want to look into consider implementing some items for large\norganizations – essential controls on passwords and network/system security, as well as monitor and mine event\n[logs would be very beneficial any size of an organization. We’d like to also note that network segmentation and](http://blog.trendmicro.com/trendlabs-security-intelligence/identifying-and-dividing-networks-and-users/)\n[isolation of the cardholder data environment from other networks, and should be a standard practice not only for big](http://blog.trendmicro.com/trendlabs-security-intelligence/identifying-and-dividing-networks-and-users/)\nretailers and stores.\n\nTrend Micro is monitoring this ongoing activity, and would make follow-up reports on this if necessary. To read up on\n[how to enhance your security posture on your point-of-sale systems, please read Defending Against PoS RAM](http://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/defending-against-pos-ram-scrapers-strategies-and-technologies)\n[Scrapers: Current Strategies and Next-Gen Technologies as well as our write-up on Protecting Point of Sales Systems](http://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/defending-against-pos-ram-scrapers-strategies-and-technologies)\n[from PoS Malware. To detect, analyze, and respond to advanced malware and other attack techniques, the Custom](http://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/protecting-point-of-sales-systems)\n[Defense™ by Trend Micro™ may prove invaluable to your organizations security needs.](http://www.trendmicro.com/us/business/cyber-security/index.html)\n\n28\n\n\n-----\n\nTrend Micro Incorporated, a global leader in security software, strives to make the\nworld safe for exchanging digital information. Our innovative solutions for consumers,\nbusinesses and governments provide layered content security to protect information\non mobile devices, endpoints, gateways, servers and the cloud. All of our solutions\nare powered by cloud-based global threat intelligence, the Trend Micro™ Smart\nProtection Network™, and are supported by over 1,200 threat experts around the\nglobe. For more information, visit www.trendmicro.com.\n\n©2015 by Trend Micro, Incorporated. All rights reserved. Trend Micro and the Trend\nMicro t-ball logo are trademarks or registered trademarks of Trend Micro,\nIncorporated. All other product or company names may be trademarks or registered\ntrademarks of their owners.\n\n\n10101 N. De Anza Blvd.\nCupertino, CA 95014\n\nU.S. toll free: 1 +800.228.5651\nPhone: 1 +408.257.1500\nFax: 1 +408.257.2003\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.12.16.Operation_Black_Atlas/Operation_Black%20Atlas_Technical_Brief.pdf",
        "http://documents.trendmicro.com/assets/Operation_Black%20Atlas_Technical_Brief.pdf"
    ],
    "report_names": [
        "Operation_Black Atlas_Technical_Brief",
        "Operation_Black%20Atlas_Technical_Brief.pdf"
    ],
    "threat_actors": [
        {
            "id": "5c457d56-6078-4a86-ac5c-e3e91fa278e7",
            "created_at": "2022-10-25T16:07:23.934665Z",
            "updated_at": "2025-03-27T02:02:10.036117Z",
            "deleted_at": null,
            "main_name": "Operation Black Atlas",
            "aliases": [],
            "source_name": "ETDA:Operation Black Atlas",
            "tools": [
                "Alina POS",
                "BlackPOS",
                "Diamond Fox",
                "DiamondFox",
                "FrameworkPOS",
                "Gorynch",
                "Gorynych",
                "Kaptoxa",
                "MMon",
                "ModPOS",
                "NewPosThings",
                "POSWDS",
                "Reedum",
                "alina_eagle",
                "alina_spark",
                "aline_joker",
                "katrina",
                "straxbot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041322,
    "ts_creation_date": 1450376244,
    "ts_modification_date": 1450376244,
    "files": {
        "pdf": "https://archive.orkl.eu/cd02ced2b0c1a7ed91e9d631ad45f001fa71a837.pdf",
        "text": "https://archive.orkl.eu/cd02ced2b0c1a7ed91e9d631ad45f001fa71a837.txt",
        "img": "https://archive.orkl.eu/cd02ced2b0c1a7ed91e9d631ad45f001fa71a837.jpg"
    }
}