{
    "id": "68bf9d81-abcd-4adb-ad6a-9716aaec0cfa",
    "created_at": "2023-01-12T15:02:44.459655Z",
    "updated_at": "2025-03-27T02:06:02.061142Z",
    "deleted_at": null,
    "sha1_hash": "eabe00c40f3f4928aeb0d6af6b8cb934e88ad85e",
    "title": "2020-06-09 - Kingminer escalates attack complexity for cryptomining",
    "authors": "",
    "file_creation_date": "2022-05-28T21:41:46Z",
    "file_modification_date": "2022-05-28T21:41:46Z",
    "file_size": 703752,
    "plain_text": "# Kingminer escalates attack complexity for cryptomining\n\n**news.sophos.com/en-us/2020/06/09/kingminer-report/**\n\nJune 9, 2020\n\nAn opportunistic botnet that tries (not always successfully) to fly under the radar, Kingminer\nis nevertheless a persistent nuisance that delivers cryptocurrency miners as a payload. The\nbotnet’s operators may be ambitious and capable, but they don’t appear to have endless\nresources, so they take advantage of any freely available solution to the problem of infecting\nmachines and spreading, getting inspiration from public domain tools as well as techniques\nused by APT groups.\n\nThis morning, SophosLabs is releasing our report, An insider view into the increasingly\n_complex Kingminer botnet. In this report, we perform an in-depth teardown of the botnet’s_\ntactics, techniques, and procedures, with an eye to giving analysts and incident responders a\nroadmap for closing off the loopholes this threat uses to its advantage.\n\nThe main findings of our research are:\n\nKingminer spreads by brute-forcing username/password combinations of SQL servers,\nand has recently started to experiment with the EternalBlue exploit.\nThe infection process may use a privilege elevation exploit (CVE-2017-0213 or CVE2019-0803) in an attempt to prevent software (or admins) from blocking the attackers’\nactivity.\nThe botnet’s operators prefer to use open source or public domain software (like\n_PowerSploit or Mimikatz ) and exhibit evidence they’re skilled enough to customize_\ntheir own enhancements.\n\n\n-----\n\n[They employ tricks like DLL side-loading, a method traditionally used by Chinese APT](https://nakedsecurity.sophos.com/2013/02/27/targeted-attack-nvidia-digital-signature)\ngroups that’s gaining momentum broadly in cybercriminal activity\nThe botnet uses a domain generator algorithm (DGA) to potentially change the\ndomains it uses for command and control or payload delivery automatically every week\nIf the infected computer is not patched against the Bluekeep vulnerability, Kingminer\ndisables the vulnerable RDP service in order to lock out competing botnets\n\n### Download servers\n\nThe Kingminer botnet uses two main approaches in hosting the delivered content. The first\none relies on servers that the criminals registered and manage themselves, usually using a\nsimple time-coded domain name generation algorithm (DGA). These servers deliver the\ncomponents with clearly malicious content.\n\nFor the not-so-obviously malicious things, the operators use public repositories provided by\nGithub. This is where they store files like the xmrig miner payloads, reflective loader scripts,\nor the Mimikatz password stealer. These components are not necessarily malicious by\nthemselves, but the context in which they are used (installed without user consent, by\ninfecting the target computers) was clearly malicious.\n\n### Time coded DGA\n\nThe attackers have embedded an algorithm into the bots that generates domain names\nusing the value of the current date and time. This method has the advantage that the\nmalware doesn’t have to store hardcoded addresses for command and control. Instead, the\nbots dynamically generated and keep changing with time. This way, if one of the download\nservers is shut down, the operators don’t have to release new versions of the downloader\nwith the updated download location. Instead, they just register the next domain name, and\nwhen the time comes, the botnet will automatically switch over to the new download servers.\n\nThe generated domain names have the following structure:\n\nThe yellow part is the core of the domain name. In the observed cases it was either fdae.tk,\n**fdae.com or fghh.com, but strings found in the side-loading DLLs suggest that additionally**\nthe attackers could potentially use fdae.ga or fdae.cf in the domain cores.\n\nThe domain core is completed with the green prefix, combined from the current\nyear/month/week value (week=day/7 in this case, rounded down), using only the last two\ndigits of the year in the form: yymmwwyy. The resulting number is converted to a\nhexadecimal number.\n\n\n-----\n\nIn the example shown above, the date part of the domain is 0x30713, which when converted\nto decimal form gives 198419, making the date values to be yy=19, m=8, w=4. This domain\nname would have been used during the 5 week in August, 2019.th\n\nThe red subdomain part is created from the minutes and seconds value of the current time.\n\nEven though this mechanism makes it possible to use a different server very week, the\nbotnet operators never use this opportunity to its full potential – the vast majority of the\npotential server names are never used and never registered and many components use\nhardcoded locations.\n\n### Github repositories\n\nWe have found over 20 Github user accounts that were used to deliver the contents of the\nKingminer botnet.\n\nThese repositories are not very active, in the sense that only one or two commits are ever\nmade to them. The first commit usually is an upload of the actual malicious components,\nthen optionally an update was made, likely to avoid detections that were added in the\nmeantime by security products.\n\nThe typical content of a repository consists of the following files:\n\n_txt: 32-bit miner, XOR encrypted_\n_cab: 32-bit miner side-loader CAB package stored in XML_\n_txt: 32-bit miner, XOR encrypted_\n_cab: 32-bit miner side-loader CAB package stored in XML_\n_txt: 32-bit control panel applet, BASE64 encoded_\n_txt: 64-bit control panel applet, BASE64 encoded_\n_txt: 32-bit Mimikatz, XOR encrypted_\n\n\n-----\n\n_txt: 64-bit Mimikatz, XOR encrypted_\n_txt: reflective loader, BASE64 encoded_\n\n### Infection process\n\nSo far, the only confirmed infection method that we could identify was the attack in which\nSQL servers experience brute-force probing with username/password combinations; When\nsuccessful, the attackers insert SQL command scripts that load the rest of the components.\n\nRecently we have seen signs that the operators of the Kingminer botnet started\nexperimenting with an EternalBlue spreader. We have witnessed this script being delivered\nto the infected systems but have not observed a successful infection as a result of the\nexploitation.\n\nThe EternalBlue script is very much the same as the implementation found in another miner\n[botnet, Powerghost/Wannaminer (which, itself, is based more or less on PowerShell Empire).](https://raw.githubusercontent.com/EmpireProject/Empire/master/data/module_source/exploitation/Exploit-EternalBlue.ps1)\n\n### Downloader script\n\nWhichever infection method is used, the first step is the execution of the downloader script,\nresponsible for fetching and installing the rest of the botnet components.\n\nThe attackers have crafted custom payloads to the target operating system, deploying\ndifferent version for 32-bit and 64-bit Windows systems.\n\nThe downloaded payload is not a plain executable file. Rather, it is packaged into an XML\nfile. The XML file contains either a ZIP or a CAB archive, that, in turn, contains the necessary\ncomponents.\n\n\n-----\n\n### Payload loading\n\nOnce the downloader script fetches the payload from the attacker’s server, it executes the\npayload, usually by utilizing the DLL side-loading technique, which has been popular with\nChinese APT groups [1] for a long time. This method makes use of the peculiarities of the\nWindows operating system related to directory search order.\n\nThe payload that is downloaded from the remote server is originally packaged in an XML\nenvelope:\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<root xmlns:dt=\"urn:schemas-microsoft-com:datatypes\" dt:dt=\"bin.base64\">\nTVNDRgAAAABsiQwAAAAAACwAAAAAAAAAAwEBAAMAAAAiCQAAdgAAAE4AAxUAhgAAAAAAAAAA\n7jriTCAAZHdtZXIuZXhlAAAkAgAAhgAAAABLUJKSIABkdXNlci5kbGwAABwkAACqAgAAAEtQ\n5IggAHgudHh0AG/LdHIEOwCAW4CAjQUgt8VxEwCwUwAkIgAAAADvXqnrvqa+UOVR0mSSIhLQ\n\n```\nWhen unpacked, the content of a typical 64-bit package looks like this:\n\nThe main components in the packages are:\n\nA clean, and digitally signed, trusted executable (exe in the example above)\nA malicious loader DLL\nThe encrypted payload (txt)\n\nThe purpose of the clean executable is to have an external dependency on a Windows DLL\nlibrary, which is a roundabout way to trigger the operating system to execute the malware,\nwithout directly calling the malware DLL.\n\nWhen the downloader script executes the (benign) .exe, the operating system tries to resolve\nthe DLL dependency, which it does by trying to find the DLL.\n\nThe first location it searches is the directory that contains the executable – ironically not the\n_system32 directory, where Windows houses (and protects) all its legitimate DLL files. So, it_\nautomatically loads the malicious DLL, and executes the entrypoint function, which in turn\nloads the encrypted payload into memory, then decrypts it.\n\nThen the malicious loader DLL uses an in-memory PE loader to convert the decrypted block\nof memory into a proper executable image, similar to how the operating system would do it\n(i.e. allocate the memory for the sections, set the section attributes, resolve the imports,\nlocate the entry point). Finally, it loads the payload at the entry point of the executable.\n\n\n-----\n\nIf the loading is successful, the loader will enter an infinite waiting loop. This is done because\nthe payload started in a separate thread, the main thread can never stop, and the miner can\nrun indefinitely—an important consideration, because the DLL itself doesn’t create any\nmethods to ensure its own persistence.\n\n### Malware fixes BlueKeep to block other infections\n\nOne of the more interesting components is a simple VBScript code that checks the Windows\ninternal version number, searching for versions 5.0 (Windows 2000), 5.1 (Windows XP), 5.2\n(Windows XP 64 or Windows Server 2003), 6.0 (Windows Vista or Windows Server 2008), or\n6.1 (Windows 7 or Windows Server 2008 R2) – all of which are no longer supported by\nMicrosoft, and potentially vulnerable to the BlueKeep exploit.\n\nIf the malware identifies that it is running on any of the vulnerable systems, the code goes on\nto list the installed hotfixes with the command and searches for the ones related to Bluekeep:\n```\nkb4499175: Windows 7 SP1\nkb4500331: Windows XP, Windows Server 2003 SP2\nKB4499149: Windows Server 2008 SP1\nKB4499180: Windows Server 2008 SP1\nKB4499164: Windows 7 SP1\n\n```\nIf it finds none of the hotfixes (and thus the system is vulnerable to a Bluekeep attack), the\nscript disables further Remote Desktop (RDP) .\n\nThe intent is likely to disable a possible infection vector that other cryptomining botnets could\n[use to infect the computer. Although this exploit is not widely used, a couple of botnets were](https://www.kryptoslogic.com/blog/2019/11/bluekeep-cve-2019-0708-exploitation-spotted-in-the-wild/)\n[reported to have used it.](https://thehackernews.com/2019/07/linux-malware-windows-bluekeep.html)\n\n### Xmrig miners\n\nThe primary payload and the most important component of the botnet is obviously the\ncryptominer program. In all of the identified cases, this was a variant of the public domain\n**xmrig miner.**\n\nThe miners are compiled into DLLs, the loader code locates the export named a and\nexecutes it. This is an unusual design; In other attacks of this type, the miners are compiled\ninto standalone executables.\n\n\n-----\n\nInterestingly, in addition to this main export, the miners also have the same\n_SetDesktopMonitorHook and ClearDesktopMonitorHook as the side-loader DLLs, and both_\nfunctions call the main exported function a.\n\nThis means, that in theory, the miner itself can serve as a side-loaded DLL, loaded by the\nclean application. So far, we have not seen scenarios that make use of this design.\n\nThe miners have two pool addresses configured (95.179.131.54 and w1.homewrt.com in\nthe example above) to which they connect and upload the results of mining Monero.\n\n## Conclusion\n\nKingminer is one of the many medium-sized criminal enterprises who are more creative than\nthe groups who simply use builders purchased from underground marketplaces. The threat\nactors behind Kingminer build their own solutions. In that, they are cost-effective, adopting\nopen source solutions available in public code repositories.\n\nAs long as the sources of new tools and exploits are published, groups like Kingminer can\nand will continue to implement them into their arsenal, accelerating the adoption of the\nexploits and exploit techniques in the lower level tiers of criminality.\n\n### IoCs\n\n[Indicators of compromise for this article have been posted to the SophosLabs Github.](https://github.com/sophoslabs/IoCs/blob/master/Troj-Kingmine)\nMalware related to this threat will be detected as Troj/Kingmine-B.\n\nUsers of Sophos endpoint products with EDR can perform proactive threat hunts for\nKingminer on their own network using the Kingminer non-deterministic queries posted to the\nEarly Access Program’s community forum.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-09 - Kingminer escalates attack complexity for cryptomining.pdf"
    ],
    "report_names": [
        "2020-06-09 - Kingminer escalates attack complexity for cryptomining.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535764,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653774106,
    "ts_modification_date": 1653774106,
    "files": {
        "pdf": "https://archive.orkl.eu/eabe00c40f3f4928aeb0d6af6b8cb934e88ad85e.pdf",
        "text": "https://archive.orkl.eu/eabe00c40f3f4928aeb0d6af6b8cb934e88ad85e.txt",
        "img": "https://archive.orkl.eu/eabe00c40f3f4928aeb0d6af6b8cb934e88ad85e.jpg"
    }
}