{
    "id": "68f4e901-f30c-4990-bc8a-86e859370eb4",
    "created_at": "2023-01-12T15:07:40.927882Z",
    "updated_at": "2025-03-27T02:05:28.283239Z",
    "deleted_at": null,
    "sha1_hash": "baebb6828471ed1686093676984c689f91af799d",
    "title": "2016-10-10 - Remsec driver analysis - Part 2",
    "authors": "",
    "file_creation_date": "2019-10-16T12:12:20Z",
    "file_modification_date": "2019-10-16T12:12:22Z",
    "file_size": 3504025,
    "plain_text": "#### Highlights from the\n\n##### Highlights from the\n\n# 2020 GLOBAL\n IoT/ICS RISK\n REPORT\n\n##### A data-driven analysis of vulnerabilities in our Internet of\n Things (IoT) and industrial control system (ICS) infrastructure\n\nBased on analysis of data collected from 1,821 real-world\nIoT/ICS networks using passive, non-invasive monitoring with\npatented deep packet inspection (DPI) and Network Traffic\nAnalysis (NTA) algorithms.\n\nBATTLE-TESTED CYBERSECURITY\n\n\n-----\n\n###### Detailed in the CyberX Global 2020 IoT/ICS Risk Report, this\n analysis of real-world vulnerabilities from IoT/ICS network\n threats and unmanaged devices remains the only one of its kind.\n\nGaining visibility into IoT/ICS risk and mitigating these \"hidden\" vulnerabilities is critical to\nprotecting organizations from costly production downtime, safety and environmental incidents,\nand theft of sensitive intellectual property.\n\nSpanning diverse IoT/ICS systems — including robotics, refrigeration, chemical and\npharmaceutical production, power generation and distribution, oil production,and building\nmanagement systems (HVAC, CCTV, etc.) — the 2020 report is based on network data collected\nglobally during the 12-month period spanning October 2018 to October 2019.\n\n**BROKEN WINDOWS: OUTDATED OPERATING SYSTEMS**\n\n**of sites have outdated and unsupported Microsoft Windows**\n**boxes such as Windows XP and Windows 2000**\n\n### 62%\nUnsupported Windows boxes no longer receive regular security patches from Microsoft. The figure jumps to 71%\nif we include Windows 7, which reaches end-of-support status in January 2020.\n\n**HIDING IN PLAIN SIGHT: UNENCRYPTED PASSWORDS**\n\n**of sites have unencrypted (cleartext)**\n**passwords traversing their networks**\n\n### 64%\nThe reason cleartext is dangerous is because it makes gaining access to restricted systems easy — since these\npasswords are transmitted “in the clear” and can easily be sniffed. Legacy devices that don’t support modern\nprotocols such as SNMP v3 or SFTP are usually the culprits for leaving passwords in cleartext.\n\n**EXCESSIVE ACCESS: REMOTELY ACCESSIBLE DEVICES**\n\n**of sites have devices that can be remotely accessed**\n**using standard protocols such as RDP, SSH, and VN**\n\n### 54%\nOne of the primary attack vectors for ransomware is remote access protocols, which enable attackers to move\nlaterally and expand their presence throughout networks.\n\n**CLEAR AND PRESENT DANGER: INDICATORS OF THREATS**\n\n**of sites exhibited**\n**indicators of threats**\n\n## 22%\nCyberX’s network traffic analysis flags suspicious activity such as scan traffic, malicious DNS queries, abnormal\nHTTP headers, excessive number of connections between devices, and known malware such as LockerGoga\nand EternalBlue.\n\n\n**NOT MINDING THE GAP: DIRECT INTERNET CONNECTIONS**\n\n**of sites analyzed have direct**\n**connections to the internet**\n\n### 27%\nSecurity professionals and bad actors alike know that it takes only one internet-connected device to provide\na gateway into IoT/ICS networks for malware and targeted attacks, enabling the subsequent compromise of\nmany more systems across the enterprise.\n\n**STALE SIGNATURES: NO AUTOMATIC AV UPDATES**\n\n**of sites are not automatically updating their Windows**\n**systems with the latest antivirus definitions**\n\n### 66%\nAntivirus is the very first layer of defense against known malware — and the lack of antivirus is one reason why\nCyberX still finds older malware such as WannaCry and Conficker in IoT/ICS networks.\n\n###### Median Security Score Across All Industries: 69\n\nWe recommend a minimum score of 80 to our clients. The scores across industries remained\nmostly consistent with our findings last year, with regulated industries such as energy utilities\nmaintaining a slightly higher score than other industries.\n\n###### 74 70\n 63 Oil & Gas Energy & Utilities Manufacturing\n\n\n###### 62 Pharmaceuticals\n & Chemicals\n\n\n###### 62 Other\n\n\n“Other” includes transportation, mining, data centers, and universities.\n\n###### To download the full report, visit cyberX.io/risk-report-2020\n\n_CyberX performed this analysis on anonymized and aggregated metadata, with all customer-identifying information removed._\n_Rigorous attention is paid to preserving the confidentiality of the customer information._\n\n\n-----\n\n##### ABOUT CYBERX\n\n###### We know what it takes.\n\nCyberX delivers the only cybersecurity platform built by\nblue-team experts with a track record defending critical national\ninfrastructure. That difference is the foundation for the most widely\ndeployed platform for continuously reducing IoT/ICS risk and\npreventing costly production outages, safety failures, environmental\nincidents, and theft of sensitive intellectual property.\n\nFounded in 2013, CyberX is the only IoT/ICS security firm with a\npatent for M2M-aware threat analytics and machine learning\ntechnology. CyberX also delivers the only IoT/ICS security platform\naddressing all five requirements of the NIST CSF and all four\nrequirements of Gartner’s Adaptive Security Architecture.\n\nNotable CyberX customers include 2 of the top 5 US energy providers;\na top 5 US chemical company; a top 5 global pharmaceutical\ncompany; and national electric and gas utilities across Europe and\nAsia-Pacific. Partners include industry leaders such as IBM Security,\nSplunk, Palo Alto Networks, McAfee, Optiv Security, DXC Technology,\nToshiba, and Deutsche-Telekom/T-Systems.\n\nCustomers choose CyberX because it’s the simplest, most mature,\nand most interoperable solution for auto-discovering their assets,\nidentifying critical vulnerabilities and attack vectors, and continuously\nmonitoring their IoT/ICS networks for malware and targeted attacks.\nWhat’s more, CyberX provides the most seamless integration with\nexisting SOC workflows for unified IT/OT security governance.\n\nFor more information, visit CyberX.io or follow @CyberX_Labs.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/CyberX - Global IoT-ICS Risk Report - 2020 - Highlights Booklet.pdf"
    ],
    "report_names": [
        "CyberX - Global IoT-ICS Risk Report - 2020 - Highlights Booklet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536060,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1571227940,
    "ts_modification_date": 1571227942,
    "files": {
        "pdf": "https://archive.orkl.eu/baebb6828471ed1686093676984c689f91af799d.pdf",
        "text": "https://archive.orkl.eu/baebb6828471ed1686093676984c689f91af799d.txt",
        "img": "https://archive.orkl.eu/baebb6828471ed1686093676984c689f91af799d.jpg"
    }
}