{
    "id": "690a9466-4f55-4c45-8993-16bcfd5b3163",
    "created_at": "2023-01-12T15:04:52.877288Z",
    "updated_at": "2025-03-27T02:09:17.837887Z",
    "deleted_at": null,
    "sha1_hash": "675d7cd4d820542ebcf22461899b40a6e4d51cb1",
    "title": "2019-12-23 - FBI Issues Alert For LockerGoga and MegaCortex Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T01:59:02Z",
    "file_modification_date": "2022-05-27T01:59:02Z",
    "file_size": 347661,
    "plain_text": "# FBI Issues Alert For LockerGoga and MegaCortex Ransomware\n\n**[bleepingcomputer.com/news/security/fbi-issues-alert-for-lockergoga-and-megacortex-ransomware/](https://www.bleepingcomputer.com/news/security/fbi-issues-alert-for-lockergoga-and-megacortex-ransomware/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nDecember 23, 2019\n11:10 AM\n2\n\nThe FBI has issued a warning to private industry recipients to provide information and\nguidance on the LockerGoga and MegaCortex Ransomware.\n\nBoth LockerGoga and MegaCortex are ransomware infections that target the enterprise by\ncompromising the network and then attempting to encrypt all its devices.\n\nIn an FBI Flash Alert marked as TLP:Amber and seen by BleepingComputer, the FBI is\nwarning the private industry regarding the two ransomware infections and how they attack a\nnetwork.\n\n\"Since January 2019, LockerGoga ransomware has targeted large corporations and\norganizations in the United States, United Kingdom, France, Norway, and the Netherlands.\nThe MegaCortex ransomware, first identified in May 2019, exhibits Indicators of\nCompromise (IOCs), command and control (C2) infrastructure, and targeting similar to\nLockerGoga.\"\n\n\n-----\n\nAccording to the alert, the actors behind LockerGoga and MegaCortex will gain a foothold\non a corporate network using exploits, phishing attacks, SQL injections, and stolen login\ncredentials.\n\nOnce a network is compromised, the threat actors will install the penetration testing tool\ncalled Cobalt Strike. This tool allows the attackers to deploy \"beacons\" on a compromised\ndevice to \"create shells, execute PowerShell scripts, perform privilege escalation, or spawn\na new session to create a listener on the victim system.\"\n\nWhen a network is compromised, the actors will be resident on the network for months\nbefore they deploy the LockerGoga or MegaCortex ransomware infections.\n\nWhile the FBI had not said what these attackers are doing during this period, the actors are\nprobably exfiltrating data, deploying information-stealing trojans, and further compromising\nworkstations and servers.\n\nOnce the network has been harvested of anything of value, the attackers will deploy the\nLockerGoga or MegaCortex infections so that they begin to encrypt the devices on the\nnetwork. This will generate a final revenue source for the attackers.\n\nDuring the ransomware deployment, the FBI states the actors will execute a kill.bat or\nstop.bat batch file that terminates processes and services related to security programs,\ndisables Windows Defender scanning features, and disable security-related services.\n\nThe threat actors will also use a variety of LOLBins and legitimate software such as 7-Zip,\nPowerShell scripts, wmic, nslookup, adfind.exe, mstds.exe, Mimikatz, Ntsdutil.exe, and\nmassscan.exe.\n\nUnfortunately, both of these ransomware infections use a secure encryption algorithm,\nwhich means it is not possible to decrypt them for free.\n\n## FBI's recommended mitigations\n\nThe FBI offers guidance and mitigation advise that business owners should utilize to\nminimize their risk to the LockerGoga and MegaCortex ransomware.\n\nThe most important mitigation provided by the FBI is to make sure you \"backup data\nregularly, keep offline backups, and verify integrity of backup process.\"\n\nBy having a working and verified backups, especially offline backups, ransomware is not a\nthreat as you can always restore your data.\n\nOther mitigations suggested by the FBI include:\n\nMake sure all installed software and operating systems are kept updated. This helps\nto prevent vulnerabilities from being exploited by the attackers\n\n\n-----\n\nEnable two-factor authentication and strong passwords to block phishing attacks,\nstolen credentials, or other login compromises.\nAs publicly exposed remote desktop servers are a common way for attackers to first\ngain access to a network, businesses should audit logs for all remote connection\nprotocols\nAudit the creation of new accounts.\nScan for open or listening ports on the network and block them from being accessible.\nDisable SMBv1 as numerous vulnerabilities and weaknesses exist in the protocol.\nMonitor the organization's Active Directory and administrator group changes for\nunauthorized users.\nMake sure you are using the most up-to-date PowerShell and uninstall any older\nversions.\n\"Enable PowerShell logging and monitor for unusual commands, especially execution\nof Base64 encoded PowerShell\"\n\nThis guidance is general enough that it applies to all ransomware infections and should be\nfollowed by all organizations and even consumers.\n\n### Related Articles:\n\n[FBI: BlackCat ransomware breached at least 60 entities worldwide](https://www.bleepingcomputer.com/news/security/fbi-blackcat-ransomware-breached-at-least-60-entities-worldwide/)\n\n[FBI warns of ransomware attacks targeting US agriculture sector](https://www.bleepingcomputer.com/news/security/fbi-warns-of-ransomware-attacks-targeting-us-agriculture-sector/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[FBI](https://www.bleepingcomputer.com/tag/fbi/)\n[LockerGoga](https://www.bleepingcomputer.com/tag/lockergoga/)\n[MegaCortex](https://www.bleepingcomputer.com/tag/megacortex/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/uptick-seen-in-iso-email-attachments-delivering-malware/)\n[Next Article](https://www.bleepingcomputer.com/news/security/critical-citrix-flaw-may-expose-thousands-of-firms-to-attacks/)\n\n### Comments\n\n\n-----\n\n[unrealJiminy - 2 years ago](https://www.bleepingcomputer.com/forums/u/1151183/unrealjiminy/)\n\nWas the original alert inaccurate? The beacon, mimikatz, and massscan references\nseem inaccurate. Appreciate BC's content and hope this is helpful.\n\n[Lawrence Abrams - 2 years ago](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nWhen you say \"seem inaccurate\", what do you mean? Not what your seeing on a\nvictim?\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-23 - FBI Issues Alert For LockerGoga and MegaCortex Ransomware.pdf"
    ],
    "report_names": [
        "2019-12-23 - FBI Issues Alert For LockerGoga and MegaCortex Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535892,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653616742,
    "ts_modification_date": 1653616742,
    "files": {
        "pdf": "https://archive.orkl.eu/675d7cd4d820542ebcf22461899b40a6e4d51cb1.pdf",
        "text": "https://archive.orkl.eu/675d7cd4d820542ebcf22461899b40a6e4d51cb1.txt",
        "img": "https://archive.orkl.eu/675d7cd4d820542ebcf22461899b40a6e4d51cb1.jpg"
    }
}