{
    "id": "690f6646-c2a1-447f-8098-193e139cbfb2",
    "created_at": "2023-01-12T15:10:19.0878Z",
    "updated_at": "2025-03-27T02:06:06.770503Z",
    "deleted_at": null,
    "sha1_hash": "b7e02f60013e83c53217b39494342ba8ad54b368",
    "title": "2020-12-16 - Hiding in Plain Sight- Remediating “Hidden” Malware with Real Time Response",
    "authors": "",
    "file_creation_date": "2022-05-28T18:26:14Z",
    "file_modification_date": "2022-05-28T18:26:14Z",
    "file_size": 1050237,
    "plain_text": "# Remediate “Hidden” Malware with RTR\n\n**[crowdstrike.com/blog/how-to-remediate-hidden-malware-real-time-response/](https://www.crowdstrike.com/blog/how-to-remediate-hidden-malware-real-time-response/)**\n\nDavid Rojas and Mark Robinson December 16, 2020\n\nMalware remediation is not always clear-cut. In this blog post, the CrowdStrike® Falcon\nComplete™ and [Endpoint Recovery Services teams take you behind the scenes to highlight](https://www.crowdstrike.com/services/am-i-breached/endpoint-recovery/)\njust one of numerous challenges we face on a regular basis while remediating obfuscated or\n[hidden malware. The steps outlined below provide Falcon analysts with guidance on solving](https://www.crowdstrike.com/epp-101/malware/)\nsimilar problems in their own environments.\n\nFor the most part, our remediation efforts utilize Microsoft PowerShell via the Falcon Real\nTime Response (RTR) console or the RTR API. On occasion, we discover malware\nobfuscating file names using unique characters or language encodings in order to evade\ndetection or complicate recovery efforts. In order to remediate files and folders like this with\nPowerShell, it sometimes requires a little more effort than simply invoking the `Remove-Item`\nPowerShell cmdlet or using the built-in RTR command, `rm .`\n\nOne example where this can be seen is with an old and familiar trojan, Andromeda, which\nuses a _[non-breaking space (NBSP) character in its USB spreader plugin.](https://en.wikipedia.org/wiki/Non-breaking_space)_\n\n## Threat Background and Context\n\n\n-----\n\nAndromeda is a modular trojan that was used primarily as a downloader to deliver additional\n[malware payloads including banking Trojans. It is often bundled and sold with plugins that](https://www.crowdstrike.com/cybersecurity-101/malware/trojan-malware/)\n[extend its functionality, including a rootkit, HTML formgrabber, keylogger and a SOCKS](https://www.crowdstrike.com/cybersecurity-101/malware/rootkit-malware/)\nproxy .1\n\nPrior to its [takedown on November 29th, 2017, Andromeda was one of the most popular](https://www.europol.europa.eu/newsroom/news/andromeda-botnet-dismantled-in-international-cyber-operation)\ntrojans used by Russian and Eastern European cybercriminals. One variation of the malware\nwas found to include a USB spreader plugin that used a command-and-control (C2) protocol\nconstituting a Domain Generation Algorithm (DGA) to complicate takedown efforts.\n\nDespite the takedown, we continue to see detections in customer environments on a daily\nbasis for infected USB drives. Remediation of these drives helps reduce alert fatigue and\nprevent the spread of this malware to other hosts that do not have the CrowdStrike Falcon®\nsensor installed.\n\nIn this blog, our focus is on an obfuscation technique that Andromeda’s USB spreader plugin\nuses to make sure its payload gets executed by the user.\n\n## Hiding in Plain Sight\n\nOnce the malware has infected the host, its goal is to move laterally and continue to worm its\nway to additional hosts. To accomplish this mission, a USB spreader plugin is used in\nconjunction with a social engineering tactic, where it presents the user with a malicious\nshortcut (.LNK file) to a hidden folder on the root of the infected USB drive. This hidden\nfolder contains the user’s data, which has been (unknowingly) moved by the malware. This\nforces the user to click through the malicious shortcut executing the hidden DLL dropper\nwhile at the same time presenting the user an Explorer session with their requested folder of\ndata. The user is none the wiser, and the payload has been executed successfully,\n[completing the lateral movement and infection onto additional hosts.](https://www.crowdstrike.com/epp-101/lateral-movement/)\n\n\n-----\n\n2Figure 1. Malicious shortcut and hidden directory (click image to enlarge)\n\nAs previously mentioned, Andromeda’s USB spreader plugin uses a non-printable, ASCII,\nnon-breaking space character ( 0xA0 – Unicode decimal value is `160 ; see Figure 1.2) to`\ncreate the obfuscated folder on the root of the USB drive, setting both hidden and system\nattributes (see Figure 1). It then moves all files and directories on the drive into this folder\nand creates three additional files with the following names:\n```\n   desktop.ini (sets folder icon to appear as USB drive)\n\n```\n`<algorithmically generated filename>` (DLL)\n\n`IndexerVolumeGuid` (contains second-stage payload)\n\n\n-----\n\nFigure 1.2. Identifying the Unicode decimal for the directory name (click image to enlarge)\n\nThe general purpose of the NBSP character is to prevent words from separating on separate\nlines as you type text in your word-processing software. While you type, if a word does not fit\non the current line, it drops down to the next line. To prevent this from happening while you\nwrite for example, “100 km” — you can use a non-breaking space character to keep them\ntogether as one “word.”\n\nTo the user, the character simply looks like a normal “space” character. Consequently,\nparsing the file path becomes a little more complicated via PowerShell’s command line\ninterface.\n\nFigure 2. Contents of an Andromeda USB spreader .LNK file (NOTE: “SAMSUNG” is the name of the\n\ndrive used in this example and not otherwise involved with the botnet)\n\nIf we look closely at Figure 2, we can see the character “ ÿ ” which is replacing the NBSP\ncharacter in the path (a byproduct of PowerShell attempting to interpret the character into\nsomething printable via the RTR API). The Arguments property for the shortcut file is\nformatted in the following manner:\n\n```\nHiddenFolder\\EncryptedDropperDLL,EntryPointFunction\n\n```\n\n-----\n\nWithin the Falcon Detections app, we would likely observe the `explorer.exe process`\nspawning `rundll32.exe when the user clicks on the shortcut to access their data.`\nReviewing the command line in the screenshot from Figure 2.1, we see the DLL filename\nand entry point called in the `COMMAND LINE field:`\n```\n--_-_-_--_-_____-_--_-_-_----____--_---_-_--__-_-_-__.{1D5906E3-DAB2-42A691B0-0EEF01E691AE}\n\n```\nThe entry point function is displayed as:\n\n```\nFPR8puhjQK463G0E\n\n```\n\nIn this specific example, we also see the malware was blocked by the Falcon sensor when\nthe `rundll32.exe command was executed, effectively neutralizing the threat.`\n\nFigure 2.1. Example Andromeda USB spreader detection in the Falcon UI (click image to enlarge)\n\nWe can confirm the detection is a result of an infected USB device being connected to the\ndrive by pivoting to the Event Search app from the detection and performing a search for\nUSB device information (Figure 2.2) using the built-in Splunk Query Language.\n\nComparing the blocked process start time with the\n```\nDcUsbDeviceConnected/RemoveableMediaVolumeMounted event timestamps, we want to\n\n```\ndetermine whether the drive was connected just prior to the blocked process start time. This\nusually indicates the malware attempted to run just after the drive was connected to the\ncomputer.\n\n\n-----\n\nFigure 2.2 USB device information query via Event Search App (click image to enlarge)\n\nNext, Figure 3 shows the output of listing files and folders on the root of the infected drive.\nWe can see the “Name” object appears blank.\n\n_NOTE: The RTR-native “ ls ” command reveals hidden and System files by default. This is_\n_why the Andromeda-created, obfuscated directory is shown._\n\nFigure 3. Directory listing at the root of the USB drive (click image to enlarge)\n\nOur next screenshot (Figure 4) demonstrates an attempt to list the contents of the\nobfuscated directory using A) a regular space as the name, resulting in an error, and B) the\nNBSP character itself passed through by typing option+space on macOS OR\n```\nCtrl+Alt+Space/Ctrl+Space on Windows — resulting in a list of all of the files in the\n\n```\nfolder, including the Andromeda malware. This is done using the native “ ls ” command in\nRTR.\n\n\n-----\n\nFigure 4. A) List files using a “space,” and B) list files using the “NBSP” character (click image to enlarge)\n\nWe can achieve the same results using the NBSP character via the Edit & Run Scripts\nconsole by using the following command (Figure 5):\n\n```\nGet-ChildItem ‘E:\\ \\’ -Force | Out-String\n\n```\n\n_NOTE: Due to the way the Edit & Run Scripts console works (and the RTR API), we need to_\n_pipe the cmdlet to_ `Out-String for readability in the console or API output.`\n\n\n-----\n\nFigure 5. List files in obfuscated directory via Edit & Run Scripts (click image to enlarge)\n\nAlthough using the keyboard shortcut to input the interpreted NBSP character will work in the\nRTR console, our preferred method is to use the UTF-8 encoded character equivalent along\nwith the `-LiteralPath parameter to force PowerShell to interpret our input properly. This`\nreduces the risk of the NBSP character dropping from the command during copying and\npasting of code or other similar actions.\n\n```\nGet-ChildItem -LiteralPath E:\\$([char]0xA0)\\ -Force | Out-String\n\n```\n\n_NOTE: The trailing backslash in the path is necessary, otherwise the command will return the_\n_directory listing from the root of the drive._\n\n## Remediation\n\nSo far we’ve covered a couple of different methods of getting around Andromeda’s attempts\nto obfuscate the malware in a hidden directory. Empowered with this knowledge, we’ll\ndemonstrate how to easily remove the malware and recover the user’s data back to the root\nof the drive.\n\n\n-----\n\nFigure 6. Remove malware artifacts from the drive (click to enlarge)\n\nUsing PowerShell’s `Remove-Item cmdlet (Figure 6), we can now delete each of the`\nmalicious artifacts. Using the `-Force parameter, we override any Read Only attribute that`\nmay be present.\n\nLine 1 removes the malicious shortcut that points to the DLL binary with all of the\ndashes and underscores in the filename (on Line 2).\nLine 2 removes the DLL payload.\nLine 3 removes the .ini file that configured the folder icon to display as a USB drive.\nLine 4 removes the second-stage payload.\n\n## Recovery\n\nAlthough removing each of the aforementioned artifacts leaves us with a clean USB drive\n(Figure 7), to the end user, it may look like the drive no longer contains any data due to the\nhidden and obfuscated directory.\n\nTo recover the user’s data back to the root of the drive, we can now use the following\ncommand:\n```\nGet-ChildItem -LiteralPath E:\\$([char]0xA0)\\ -Force -Recurse | Move-Item Destination E:\\\n\n```\nAnd the final step is to remove the hidden folder:\n\n```\nRemove-Item -LiteralPath E:\\$([char]0xA0)\\ -Force\n\n```\n\n-----\n\nFigure 7. Remediated and recovered USB drive (click image to enlarge)\n\nWith those final steps completed, we can look again at the directory listing for the USB drive\nand see that only the original data remains (Figure 7).\n\nThe user can now safely continue to use the USB device without spreading the Andromeda\nmalware to any other computer system.\n\n## Conclusion\n\nThe CrowdStrike Falcon Complete and Endpoint Recovery Services teams take remediation\naction on malware of all types and complexities on a daily basis. In this blog post, we\ndemonstrated an example of identifying an obfuscation technique used by Andromeda’s USB\nspreader plugin, and how we use PowerShell via the Real Time Response platform to\nremove the malware without having to escalate and have the drive formatted — all while not\nimpacting the user’s operations at any point.\n\nBy scripting these steps, malware can be removed very quickly when a user connects an\ninfected drive to a computer system. The Falcon sensor will block the malware (provided\nPreventions are enabled), and the analyst can remove it completely.\n\nThis kind of automation effectively reduces future alert fatigue for the Falcon analyst and\nhelps prevent the spread of malware from computer to computer and from network to\nnetwork.\n\nFinally, this raises awareness that USB infections are a valid entry point into your\nenvironment, and such devices should be tracked and monitored. You can utilize\n[CrowdStrike Falcon Device Control to help minimize the risk of unauthorized USB devices](https://www.crowdstrike.com/endpoint-security-products/falcon-endpoint-device-control/)\nbeing used and therefore reduce your attack surface.\n\n1. CrowdStrike Intel Subscribers: CrowdStrike Tipper CSIT-1605 Andromeda Trojan with\nDGA-Based USB Spreader Plugin (pg. 1)\n\n2. “SAMSUNG” is the name of the drive used in this example. Samsung is not in any way\n\n\n-----\n\ninvolved with the botnet.\n\n**Additional Resources**\n\n_Learn how any size organization can achieve optimal security with Falcon Complete by_\n_visiting the product webpage._\n_Find out how CrowdStrike can help your organization answer its most important_\n_[security questions: Visit the CrowdStrike Services webpage.](https://www.crowdstrike.com/services/)_\n_[Learn more about Falcon X™ threat intelligence by visiting the webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)_\n_Learn about CrowdStrike’s comprehensive next-gen endpoint protection platform by_\n_visiting_ _[the Falcon products webpage.](https://www.crowdstrike.com/endpoint-security-products/)_\n_Test CrowdStrike next-gen AV for yourself:_ _[Start your free trial of Falcon Prevent™.](https://go.crowdstrike.com/try-falcon-prevent.html)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-16 - Hiding in Plain Sight- Remediating “Hidden” Malware with Real Time Response.pdf"
    ],
    "report_names": [
        "2020-12-16 - Hiding in Plain Sight- Remediating “Hidden” Malware with Real Time Response.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536219,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653762374,
    "ts_modification_date": 1653762374,
    "files": {
        "pdf": "https://archive.orkl.eu/b7e02f60013e83c53217b39494342ba8ad54b368.pdf",
        "text": "https://archive.orkl.eu/b7e02f60013e83c53217b39494342ba8ad54b368.txt",
        "img": "https://archive.orkl.eu/b7e02f60013e83c53217b39494342ba8ad54b368.jpg"
    }
}