{
    "id": "694f14dc-9cb1-4ef0-9717-ab1f47f5691f",
    "created_at": "2023-01-12T14:59:11.368572Z",
    "updated_at": "2025-03-27T02:05:38.472923Z",
    "deleted_at": null,
    "sha1_hash": "b114c8860b4789e98abb7042d0a306a121e61950",
    "title": "2018-07-31 - Sophos releases SamSam ransomware report",
    "authors": "",
    "file_creation_date": "2022-05-27T21:50:52Z",
    "file_modification_date": "2022-05-27T21:50:52Z",
    "file_size": 1251809,
    "plain_text": "# SophosLabs releases SamSam ransomware report\n\n**[news.sophos.com/en-us/2018/07/31/sophoslabs-releases-samsam-ransomware-report/](https://news.sophos.com/en-us/2018/07/31/sophoslabs-releases-samsam-ransomware-report/)**\n\nAndrew Brandt July 31, 2018\n\n**By Andrew Brandt**\n\nIt strikes in the dead of night, timing the moment when it begins to encrypt every hard drive it\ncan reach to when the fewest IT administrators or SOC staff are likely to be on duty. Victims\nfind few, if any, traces of the infection, other than a ransom note that demands payments\nexceeding $60,000 in Bitcoin, and links to a Dark Web customer support chat system that\ngives the victim an opportunity to trade text messages with the attacker.\n\n\n-----\n\nWhen SamSam appeared at the end of 2015, ransomware had really hit its stride, with a\nwidely distributed variant of CryptoWall and new ransomware-as-a-service business models\nappearing. But this ransomware was different.\n\nFor one thing, SamSam’s attack vector set it immediately apart from other ransomware. The\nperson, or people, behind the attack employ a combination of old fashioned brute force\nattacks and exploits aimed at taking control of a single machine on the network of a targeted\nvictim, before eventually taking control of a domain administrator machine. No malicious\nspam email or exploit kits delivered SamSam’s payload. The attacker pushes it out to every\nworkstation on a LAN domain and executes it simultaneously.\n\n\n-----\n\nFor another, SamSam seems designed to maximize its own likelihood of success. A multitiered priority system ensures that the ransomware encrypts the most valuable data first, but\neventually it also encrypts everything else that isn’t in a very short list of Windows systemrelated files. Communication and payment involve Tor and Bitcoin for security and\nuntraceability. The attacker personally launches the attacks using a combination of free,\nopen source, and commercial network administrator tools.\n\nThe attacker actively evades security controls throughout the attack, deploying customcompiled malware payloads and shutting down security measures as needed. It has been a\nparticularly pernicious and heinous ransomware campaign, attacking hospitals, schools,\nmunicipal government, and even a homeless charity.\n\nMany of the victims, by our analysis, have never publicly disclosed or acknowledged that an\nattack has even taken place, even though the Bitcoin transaction record irrefutably shows\nthat a victim has paid the ransom, and each bitcoin address used by the SamSam attacker is\nunique to its victim organization.\n\n\n-----\n\nThe SamSam attacker has taken in nearly $6 million in ransom revenue since the malware\nappeared on the scene about 32 months ago, demanding a premium ransom in order to sell\nthe victims a key that will decrypt every affected machine on the network. About one in four\nvictims, according to our research, have paid the ransom rather than trying to recover from\nbackups. We find out about new victims almost every week.\n\n[Our newly-released report, SamSam: The (Almost) Six Million Dollar Malware, is the result of](https://www.sophos.com/en-us/medialibrary/PDFs/technical-papers/SamSam-The-Almost-Six-Million-Dollar-Ransomware.pdf)\nmore than six months’ work by a team of SophosLabs malware analysts, reverse engineers,\nand Sophos senior support staff. These are just a few of the details that we cover in this indepth analyis of both the malware and the tactics employed by this particularly challenged\nand paranoid threat actor.\n\nWe’ll cover some of the side stories relating to the investigation in the coming days here on\nUncut, but it’s also worth mentioning: In the days leading up to the release of the report, the\nSamSam attacker has launched a new offensive targeting the reputation of Sophos itself.\nThe latest version of the malware uses the file suffix .sophos on its encrypted payload.\n\n\n-----\n\nYeah, it s a cute distraction, but it also says something important: We must be giving the right\nperson or people a particularly hard time if they’re so irritated by us that they feel compelled\nto call us out by name. Giving bad guys a bad day makes me feel warm and fuzzy inside.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-31 - Sophos releases SamSam ransomware report.pdf"
    ],
    "report_names": [
        "2018-07-31 - Sophos releases SamSam ransomware report.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535551,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653688252,
    "ts_modification_date": 1653688252,
    "files": {
        "pdf": "https://archive.orkl.eu/b114c8860b4789e98abb7042d0a306a121e61950.pdf",
        "text": "https://archive.orkl.eu/b114c8860b4789e98abb7042d0a306a121e61950.txt",
        "img": "https://archive.orkl.eu/b114c8860b4789e98abb7042d0a306a121e61950.jpg"
    }
}