{
    "id": "69805e52-d758-45b6-936f-32b78e75bd68",
    "created_at": "2022-10-25T16:48:19.903399Z",
    "updated_at": "2025-03-27T02:12:37.673052Z",
    "deleted_at": null,
    "sha1_hash": "85447c9971470c2e679bb3d87d2244d1e75bf208",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-03-07T09:32:28Z",
    "file_modification_date": "2019-03-07T09:32:28Z",
    "file_size": 182818,
    "plain_text": "# Whitefly: Espionage Group has Singapore in Its Sights\n\n**[symantec.com/blogs/threat-intelligence/whitefly-espionage-singapore](https://www.symantec.com/blogs/threat-intelligence/whitefly-espionage-singapore)**\n\n## Group behind the SingHealth breach is also responsible for a string of other attacks in the region.\n\nIn July 2018, an attack on Singapore’s largest public health organization, SingHealth,\nresulted in a reported 1.5 million patient records being stolen. Until now, nothing was known\nabout who was responsible for this attack. Symantec researchers have discovered that this\nattack group, which we call Whitefly, has been operating since at least 2017, has targeted\norganizations based mostly in Singapore across a wide variety of sectors, and is primarily\ninterested in stealing large amounts of sensitive information.\n\nWhitefly compromises its victims using custom malware alongside open-source hacking\ntools and living off the land tactics, such as malicious PowerShell scripts.\n\n\"#Whitefly, the group behind the SingHealth breach, is also responsible for a string of other\nattacks in Singapore https://symc.ly/2X1RALf\"\n\n## Whitefly’s targets\n\nFrom mid-2017 to mid-2018, Whitefly launched targeted attacks against multiple\norganizations. While most of these organizations were based in Singapore, some were\nmultinational organizations with a presence in Singapore.\n\nTo date, Whitefly has attacked organizations in the healthcare, media, telecommunications,\nand engineering sectors.\n\n## How Whitefly compromises its victims\n\n\n-----\n\nis disguised as a document or image. These files frequently purport to offer information on\njob openings or appear to be documents sent from another organization operating in the\nsame industry as the victim. Given the nature of disguise, it’s highly likely that they are sent\nto the victim using spear-phishing emails.\n\nIf opened, the dropper runs a loader known as [Trojan.Vcrodat on the computer. Whitefly](https://www.symantec.com/security-center/writeup/2019-013008-4820-99)\nhas consistently used a technique known as search order hijacking to run Vcrodat. This\ntechnique takes advantage of the fact that Windows does not require an application to\nprovide a specific path for a DLL that it wishes to load. If no path is provided, Windows\nsearches for the DLL in specific locations on the computer in a pre-defined order. Attackers\ncan therefore give a malicious DLL the same name as a legitimate DLL but place it ahead\nof the legitimate version in the search order so that it will be loaded when Windows\nsearches for it. Whitefly frequently delivers Vcrodat as a malicious DLL that has the same\nname as DLLs belonging to legitimate software from various security vendors. The group\nleverages search order hijacking to assure that its malicious DLLs will be executed.\nTargeting security applications could allow the attackers to gain higher privileges for the\nmalware, since the vendor’s component may be run with elevated privileges.\n\nOnce executed, Vcrodat loads an encrypted payload on to the victim’s computer. The\npayload contacts a command and control (C&C) domain. Whitefly configures multiple C&C\ndomains for each target. The payload sends system information about the infected\ncomputer to the C&C server and downloads additional tools.\n\nWhitefly usually attempts to remain within a targeted organization for long periods of time—\noften months—in order to steal large volumes of information.\n\nOnce the initial computer on the targeted organization’s network is infected with Vcrodat,\nWhitefly begins mapping the network and infecting further computers. In order to carry out\n[this operation, it uses publicly available tools, including Mimikatz (Hacktool.Mimikatz) and](https://www.symantec.com/security-center/writeup/2012-042615-3731-99)\nan open-source tool (SHA2:\n263dc5a8121d20403beeeea452b6f33d51d41c6842d9d19919def1f1cb13226c) that exploits\n[a known Windows privilege escalation vulnerability (CVE-2016-0051) on unpatched](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0051)\ncomputers. The attackers rely heavily on tools such as Mimikatz to obtain credentials.\nUsing these credentials, the attackers are able to compromise more machines on the\nnetwork and, from those machines, again obtain more credentials. They perform this tactic\nrepeatedly until they gain access to the desired data.\n\nWhitefly usually attempts to remain within a targeted organization for long periods of time—\noften months—in order to steal large volumes of information. It keeps the compromise alive\nby deploying a number of tools that facilitate communication between the attackers and\ninfected computers. These tools include a simple remote shell tool that will call back to the\nC&C server and wait for commands, and an open-source hacking tool called Termite\n[(Hacktool.Rootkit), which allows Whitefly to perform more complex actions such as](https://www.symantec.com/security-center/writeup/2002-011710-0057-99)\ncontrolling multiple compromised machines at a time.\n\n## Additional malware used in selected attacks\n\nIn some attacks, Whitefly has used a second piece of custom malware, [Trojan.Nibatad.](https://www.symantec.com/security-center/writeup/2018-080818-0255-99)\nLike Vcrodat, Nibatad is also a loader that leverages search order hijacking, and downloads\nan encrypted payload to the infected computer And similar to Vcrodat the Nibatad payload\n\n\n-----\n\nis delivered to the infected computer. Why Whitefly uses these two different loaders in\nsome of its attacks remains unknown. And while we have found both Vcrodat and Nibatad\ninside individual victim organizations, we have not found any evidence of them being used\nsimultaneously on a single computer.\n\n## Links to other attacks\n\nSome of the tools that Whitefly has used in its attacks have also been deployed in other\ntargeted attacks outside Singapore.\n\nBetween May 2017 and December 2018, a multi-purpose command tool (SHA2:\n7de8b8b314f2d2fb54f8f8ad4bba435e8fc58b894b1680e5028c90c0a524ccd9) that has\nbeen used by Whitefly was also used in attacks against defense, telecoms, and energy\ntargets in Southeast Asia and Russia. The tool appears to be custom-built and, aside from\nits use by Whitefly, these were the only other attacks where Symantec has observed its\nuse.\n\nIn another case, Vcrodat was also used in an attack on a UK-based organization in the\nhospitality sector.\n\nIt's possible Whitefly itself performed these attacks but it’s more likely that they were carried\nout by one or more other groups with access to the same tools.\n\n## Adept attackers with a large toolset\n\nIt now appears that the SingHealth breach was not a one-off attack and was instead part of\na wider pattern of attacks against organizations in the region. Whitefly is a highly adept\ngroup with a large arsenal of tools at its disposal, capable of penetrating targeted\norganizations and maintaining a long-term presence on their networks. Links with attacks in\nother regions also present the possibility that it may be part of a broader intelligence\ngathering operation.\n\n## Protection/Mitigation\n\nSymantec has the following protection in place to protect customers against these attacks:\n\n**File-based protection**\n\n## Indicators of Compromise\n\n\n**MD5** **SHA2**\n\n\neab0a521aa7cac62d98d78e‐\nf845a8319\n\n79be‐\nf92272c7d1c6236a03c26a0804cc\n\n394df628b3c8977661c8be‐\nbea593e148\n\n\na196dfe4ef7d422aad‐\nf1709b12511ae82cb96aad030422b00a9c91fb60a12f17\n\nd784a12fec628860433c28caa353b‐\nb52923f39d072437393629039fa4b2ec8ad\n\n6e874ac92c7061300b402dc616a1095‐\nfa7d13c8a18c8a3ea5b30ffa832a7372c\n\n\n**Descrip‐**\n**tion**\n\nTro‐\njan.Vcro‐\ndat\n\nTro‐\njan.Vcro‐\ndat\n\nTro‐\njan.Ni‐\n\n\n-----\n\n**MD5** **SHA2** **tion**\n\n\n51862c3615e2f8a807b1d59f3ae‐\nf3507\n\nb4a7049b90503534d494970851b‐\ndda62\n\n\ned3cd71eaca603a00e4c0804dc34d84d‐\nc38c6c1e1c1f43af0568fb162c44c995\n\n9d9a6337c486738edf4e5d1790c023ba172ce9b039d‐\nf1b7b9720ed4c4c9ade90\n\n93c9310f3984d96f53f226f5177918c4‐\nca78b2070d5843f08d2cf351e8c239d5\n\n263d‐\nc5a8121d20403beeeea452b6f33d51d41c6842d9d19919de‐\nf1f1cb13226c\n\nb2b2e900aa2e96f‐\nf44610032063012aa0435a47a5b416c384b‐\nd6e4e58a048ac9\n\ndda22de8ad7d807cdac8c269b7e3b35a3021dcbf‐\nf722b3d333f2a12d45d9908d\n\nf562e9270098851dc716e3f17dbac‐\nc7f9e2f98f03ec5f1242b341baf1f7d544c\n\n7de8b8b314f2d2fb54f8f8ad4b‐\nba435e8fc58b894b1680e5028c90c0a524ccd9\n\n\nDLL\nShell‐\ncode\nLoader\n\nDLL\nShell‐\ncode\nLoader\n\nMimikatz\n\nCVE20160051\nprivilege\nescala‐\ntion\n\nTermite\n\nSimple\ncom‐\nmand\nline re‐\nmote ac‐\ncess tool\n\nSimple\ncom‐\nmand\nline re‐\nmote ac‐\ncess tool\n\nMultipurpose\ncom‐\nmand\ntool\n\n\nThe Attack Investigation Team is a group of security experts within Symantec Security\nResponse whose mission is to investigate targeted attacks, drive enhanced protection in\nSymantec products, and offer analysis which helps customers respond to attacks.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.03.06.Whitefly/Whitefly_%20Espionage%20Group%20has%20Singapore%20in%20Its%20Sights.pdf"
    ],
    "report_names": [
        "Whitefly_ Espionage Group has Singapore in Its Sights"
    ],
    "threat_actors": [
        {
            "id": "ad5c6ff2-0646-4b29-88bb-d88c75e4866d",
            "created_at": "2022-10-25T15:50:23.662882Z",
            "updated_at": "2025-03-27T02:00:55.515808Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [
                "Whitefly"
            ],
            "source_name": "MITRE:Whitefly",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cd9f8d91-c55c-4086-a1a0-23e78d194d46",
            "created_at": "2023-01-06T13:46:38.943454Z",
            "updated_at": "2025-03-27T02:00:02.958535Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [],
            "source_name": "MISPGALAXY:Whitefly",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "df9bfbf1-bb9d-492f-b381-95b9e1482267",
            "created_at": "2022-10-25T16:07:24.394491Z",
            "updated_at": "2025-03-27T02:02:10.207352Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [
                "ATK 83",
                "Bronze Walker",
                "Mofang",
                "SectorM04",
                "TEMP.Mimic"
            ],
            "source_name": "ETDA:Whitefly",
            "tools": [
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Nibatad",
                "Shim RAT",
                "ShimRAT",
                "Vcrodat"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041557,
    "ts_creation_date": 1551951148,
    "ts_modification_date": 1551951148,
    "files": {
        "pdf": "https://archive.orkl.eu/85447c9971470c2e679bb3d87d2244d1e75bf208.pdf",
        "text": "https://archive.orkl.eu/85447c9971470c2e679bb3d87d2244d1e75bf208.txt",
        "img": "https://archive.orkl.eu/85447c9971470c2e679bb3d87d2244d1e75bf208.jpg"
    }
}