{
    "id": "69d57e13-2c8c-493e-a2fb-01582d8812ab",
    "created_at": "2022-10-25T16:48:20.283012Z",
    "updated_at": "2025-03-27T02:17:22.935077Z",
    "deleted_at": null,
    "sha1_hash": "ba53d83392b274a987dc1e2684a4615a0514bd97",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-06-18T15:14:33Z",
    "file_modification_date": "2020-06-18T15:14:35Z",
    "file_size": 2063354,
    "plain_text": "# OPERATION\n IN(TER)CEPTION:\n## TARGETED ATTACKS AGAINST EUROPEAN AEROSPACE AND MILITARY COMPANIES\n\n##### Authors: Dominik Breitenbacher\n Kaspars Osis\n\n\n-----\n\n### CONTENTS\n\n1 INTRODUCTION .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  2\n\n2 THE ATTACKS .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  2\n\n2.1 Initial compromise .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  2\n\n2.2 Reconnaissance .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  5\n\n2.3 Attacker tools and techniques  .   .   .   .   .   .   .   .   .   .   .   .  5\n\n2.3.1 Delivered malware and tools  .  .  .  .  .  .  .  .  .  .  .  . 5\n\n2.3.2 Encryption methods  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 6\n\n2.3.3 Masquerading  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  6\n\n2.3.4 Code signing  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 7\n\n2.4 Data gathering and exfiltration  .   .   .   .   .   .   .   .   .   .   .   . 7\n\n2.5 Lateral movement  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  8\n\n2.6 Business email compromise .   .   .   .   .   .   .   .   .   .   .   .   .  8\n\n3 TECHNICAL ANALYSIS OF DELIVERED MALWARE AND TOOLS .   .   .  9\n\n3.1 Stage 1: Custom downloader  .   .   .   .   .   .   .   .   .   .   .   .   . 9\n\n3.2 Stage 2: Custom backdoor .   .   .   .   .   .   .   .   .   .   .   .   .  10\n\n3.2.1 Bootstrap  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  11\n\n3.2.2 Configuration  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  11\n\n3.2.3 Modules  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  11\n\n3.2.4 Network protocol  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  13\n\n3.2.5 Supported commands  .  .  .  .  .  .  .  .  .  .  .  .  .  .  18\n\n3.2.6 Anti-analysis techniques  .  .  .  .  .  .  .  .  .  .  .  .  .  18\n\n3.3 PowerShell DLL .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  19\n\n3.4 Custom DLL loaders .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  20\n\n3.5 Beacon DLL  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  20\n\n3.6 Infrastructure  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  20\n\n4 ATTRIBUTION HINTS  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 20\n\n5 CONCLUSION .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 21\n\n6 ACKNOWLEDGEMENTS  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  21\n\n7 INDICATORS OF COMPROMISE (IOCS) .   .   .   .   .   .   .   .   .   .   .  21\n\n7.1 ESET detection names .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 21\n\n7.2 Hashes  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 22\n\n7.3 Filenames  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 22\n\n7.4 URLs .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 23\n\n8 MITRE ATT&CK TECHNIQUES  .   .   .   .   .   .   .   .   .   .   .   .   .   .  24\n\n9 APPENDIX .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 25\n\n##### Authors: Dominik Breitenbacher\n Kaspars Osis\n\n June 2020\n\n\n-----\n\n### 1 INTRODUCTION\n\nAt the end of last year, we discovered targeted attacks against aerospace and military companies in\n\nEurope and the Middle East. Following our discovery, we carried out a collaborative investigation with\n\ntwo of the affected European companies.\n\nThe attacks, which we dubbed Operation In(ter)ception based on a related malware sample named\n\n“Inception.dll”, took place from September to December 2019. They were highly targeted and relied\n\non social engineering over LinkedIn and custom, multistage malware. To operate under the radar, the\n\nattackers frequently recompiled their malware, abused native Windows utilities and impersonated\n\nlegitimate software and companies. To our knowledge, the custom malware used in Operation\n\nIn(ter)ception hasn’t been previously documented.\n\nAccording to our investigation, the primary goal of the operation was espionage. However, in one of\n\nthe cases we investigated, the attackers tried to monetize access to a victim’s email account through a\n\nbusiness email compromise (BEC) attack as the final stage of the operation.\n\nWhile we did not find strong evidence connecting the attacks to a known threat actor, we did\n\n[discover several hints suggesting a possible link to the Lazarus group, including similarities in targeting,](https://attack.mitre.org/groups/G0032/)\n\ndevelopment environment, and anti-analysis techniques used.\n\nIn this white paper, we will offer insight into the modus operandi of the attackers and provide a\n\ntechnical analysis of the malware used in the attacks.\n\n### 2 THE ATTACKS\n\nOperation In(ter)ception attacks we investigated progressed through several phases, described below.\n\n#### 2.1 Initial compromise\n\nThe attackers used LinkedIn to target employees within the chosen companies. To initiate contact, they\n\napproached the targets with fictitious job offers using LinkedIn’s messaging feature. In order to appear\n\ncredible, the attackers posed as representatives of well-known, existing companies in the aerospace and\n\ndefense industry.\n\nFor each of the targeted companies we investigated, the attackers had created a separate fake LinkedIn\n\naccount: one impersonating an HR manager from Collins Aerospace (formerly Rockwell Collins), a major\n\nUS supplier of aerospace and defense products; the other posing as an HR representative of General\n\nDynamics, another large US-based corporation with a similar focus. (Note: These LinkedIn accounts no\n\nlonger exist.)\n\nFigure 1 shows a fake job offer message sent under the Collins Aerospace ruse.\n\n\n-----\n\nFigure 1 // A fake job offer sent via LinkedIn to employees at one of the targeted companies\n\nOnce the contact was established, the attackers snuck malicious files into the communication,\n\ndisguising them as documents related to the advertised job offer. Figure 2 shows an example of such\n\ncommunication, in which the attackers impersonated General Dynamics.\n\nFigure 2 // Communication between the attackers and an employee of one of the targeted companies\n\n\n-----\n\nThe files were sent directly via LinkedIn messaging, or via email containing a OneDrive link. For\n\nthe latter option, the attackers created fake email accounts corresponding with their fake LinkedIn\n\npersonas, as seen in Figure 3.\n\nThe shared file was a password-protected RAR archive containing a LNK file. Upon opening the LNK file,\n\nthe Command Prompt utility was executed, opening a remote PDF file in the target’s default browser.\n\nThe PDF appeared to contain salary information for the reputed job positions, as seen in Figure 4.\n\nFigure 3 // Email linking to a malicious file sent to one of the targeted companies (partially redacted)\n\nFigure 4 // The contents of the decoy PDF file\n\n\n-----\n\nHowever, the PDF only served as a decoy. In the background, the Command Prompt created a new\n\nfolder (e.g. C:\\NVIDIA), copied the WMI Commandline Utility (WMIC.exe) to this folder while renaming\n\nthe utility in the process (e.g. to nvc.exe; more on the deceptive naming of files and folders in the\n\nsection Masquerading). Finally, it created a scheduled task, set to periodically execute a remote XSL script\n\nvia the copied WMIC.exe. This enabled the attackers to get their initial foothold inside the targeted\n\ncompany and ensure persistence on the compromised computer.\n\nAfterwards, the attackers deleted the fake LinkedIn profiles.\n\nFigure 5 summarizes the steps of the initial compromise stage.\n\nOpens Contains Contains Executes **C:\\_** Opens\n\n**RAR** **LNK** **PDF**\n\nTarget LinkedIn message or RAR archive _job.offer.lnk_ cmd.exe Decoy\nemail with OneDrive link\n\nCopies to Creates via\nCreates created folder schtasks\n\nFolder in C:\\ WMIC Scheduled task\n\n|Col1|Col2|\n|---|---|\n||Contains|\n\n|RAR|Col2|\n|---|---|\n||Contains|\n\n|LNK|Col2|\n|---|---|\n||Executes|\n\n|ffer.lnk cmd|Dec d.exe|\n|---|---|\n|Copi|es to Creates via|\n|Creates create|d folder schtasks|\n\n\nFigure 5 // Attack scenario from initial contact to compromise\n\n#### 2.2 Reconnaissance\n\nHaving established their initial foothold, the attackers explored the environment using PowerShell\n\ncommands.\n\nSince the logging of executed PowerShell commands is disabled by default, we couldn’t retrieve the\n\ncommands used. However, we found that the attackers queried the AD (Active Directory) server to\n\nobtain the list of employees including administrator accounts, and subsequently performed password\n\nbrute-force attacks on the administrator accounts.\n\n#### 2.3 Attacker tools and techniques\n\nApart from deploying their custom malware, the Operation In(ter)ception operators utilized a number\n\nof legitimate tools and OS functions as well. We describe the more interesting of these in this section.\n\n##### 2.3.1 Delivered malware and tools\n\nAfter the initial compromise, the attackers employed a number of malicious tools, including custom,\n\nmultistage malware, and modified versions of open-source tools. Namely, we have seen the following\n\ncomponents:\n\n- Custom downloader (Stage 1)\n\n- Custom backdoor (Stage 2)\n\n- [Modified PowerShdll – a tool to run PowerShell code without the use of powershell.exe](https://github.com/p3nt4/PowerShdll)\n\n- Custom DLL loaders used for executing the custom malware\n\n- Beacon DLL likely used for verifying connections to remote servers\n\n- _[dbxcli – open-source command-line client for Dropbox](https://github.com/dropbox/dbxcli)_\n\nOne of the malware samples we found during the investigation was named Inception.dll, which\n\ninspired our naming of the operation.\n\nFigure 6 depicts the malware’s execution flow, as observed during the investigation.\n\n\n-----\n\nScheduled task\n\nExecutes\n\nWMIC Compromised or\nattacker’s server\n\n|X|SL|\n|---|---|\n\n\nRemote\nXSL script\n\nDownloads\n\nExecutes\n\nExecutes\n\n##### 2.3.2 Encryption methods\n\n\nrundll32\n\n\nStage 2\n\n\nPowerShell\nDLL\n\n\nFigure 6 // Malware execution flow\n\n\nBesides malware, the adversaries used “living off the land” tactics, abusing preinstalled Windows utilities\n\nto download, decode, and execute their tools, in an effort to hide malicious activity among legitimate\n\nprocesses. Our investigation revealed the following techniques:\n\n- Use of WMIC to interpret remote XSL scripts\n\n- Use of certutil to decode base64-encoded downloaded payloads\n\n- Use of rundll32 and regsvr32 to run custom malware\n\n##### 2.3.3 Masquerading\n\nBesides malware, the adversaries used “living off the land” tactics, abusing preinstalled Windows utilities\n\nto download, decode, and execute their tools, in an effort to hide malicious activity among legitimate\n\nprocess\n\n- C:\\ProgramData\\DellTPad\\DellTPadRepair.exe\n\n- C:\\Intel\\IntelV.cgi\n\nInterestingly, as previously mentioned in the Initial compromise section, the attackers also used this\n\ntechnique for the misused Windows utilities. The utilities were copied to a folder created by the\n\nattackers (e.g. C:\\NVIDIA) and renamed (e.g. regsvr32.exe was renamed to NvDaemon.exe)\n\n\n-----\n\n##### 2.3.4 Code signing\n\nLater in the operation, the attackers digitally signed their malware (both observed stages) and the dbxcli\n\nutility, as seen in Figure 7. The certificate was issued in October 2019 – at the time of the attacks – to\n\n16:20 Software, LLC. According to our research, 16:20 Software, LLC is an existing company based in\n\nPennsylvania, USA, incorporated in May 2010.\n\nFigure 7 // Certificate used to sign the malware and dbxcli tool used in this operation\n\n#### 2.4 Data gathering and exfiltration\n\nBased on the job titles of the employees initially targeted via LinkedIn, it appears that Operation\n\nIn(ter)ception targeted technical and business-related information. Neither the malware analysis nor\n\nthe investigation allowed us to gain insight into what exact file types the attackers were aiming for.\n\n[For exfiltration, the attackers archived the data into a RAR file and used a custom build of dbxcli, an](https://github.com/dropbox/dbxcli)\n\nopen-source command-line client for Dropbox.\n\nOn GitHub, the source code of dbxcli is provided along with pre-built binaries for 64-bit architecture.\n\nInterestingly, the version of dbxcli used in Operation In(ter)ception was built for 32-bit architecture,\n\nwhich suggests the attackers built the tool from the source code themselves, to ensure the client ran on\n\nboth 32-bit and 64-bit systems. Another indication that the dbxcli utility was custom-built is that this\n\ntool was signed using the same 16:20 Software, LLC certificate as the custom malware.\n\n\n-----\n\n#### 2.5 Lateral movement\n\nWhile we do not have much information about how the attackers moved through the victims’ networks,\n\nwe assume that WMI commands were used. When moving on to another computer, the attackers\n\nremoved all the previously delivered files from the compromised computer.\n\n#### 2.6 Business email compromise\n\nIn our investigation of one of the victims, we found evidence that the attackers attempted to use the\n\ncompromised accounts to lure money from other companies.\n\nAmong the victim’s emails, the attackers found communication between the victim and a customer\n\nregarding an unresolved invoice. They followed up the conversation and urged the customer to pay\n\nthe invoice, however, to a different bank account than previously agreed (see Figure 8), to which the\n\ncustomer responded with some inquires.\n\nAs part of this ruse, the attackers registered an identical domain name to that of the compromised\n\ncompany, but on a different top-level domain, and used an email associated with this fake domain for\n\nfurther communication with the targeted customer.\n\nThe attackers did not respond to the customer’s inquiries and continued to urge them to pay. Instead\n\nof paying the invoice, however, the targeted customer reached out to the correct email address of the\n\nvictim for assistance, thwarting the attackers’ attempt.\n\nThe victim recognized something was amiss and reported the communication as an incident.\n\nMeanwhile, the attackers changed the DNS A record of the fake domain.\n\nFigure 8 // BEC email message sent from a victim’s compromised email account\n\n\n-----\n\n### 3 TECHNICAL ANALYSIS OF DELIVERED MALWARE AND TOOLS\n\nAs mentioned in the Attacker tools and techniques section, the attackers used a number of malicious tools,\n\nincluding Stages 1 and 2 of their custom malware, and modified versions of open-source tools.\n\nThe custom malware is technically advanced, with heavy obfuscation used and several anti-analysis\n\ntechniques implemented. To our knowledge, this malware has not been previously documented.\n\nIn the following sections, we provide a technical analysis of the malicious tools found during the\n\ninvestigation, with special focus on the custom backdoor used as Stage 2 in the attacks.\n\n#### 3.1 Stage 1: Custom downloader\n\nAs mentioned in the Initial compromise section, the attackers tricked the targets into opening malicious\n\nfiles, which led to the creation of a scheduled task. Once the task was triggered, a remote XSL script was\n\nexecuted via WMIC that downloaded the Stage 1 DLL – the custom downloader – in a base64-encoded\n\nform and decoded it using the certutil utility. In a later stage of the attack, we noticed the malware\n\nwas registered as a service to ensure persistence on the system, thus not relying on being executed by\n\nthe remote XSL script anymore.\n\nTypically, the Stage 1 malware was executed using the rundll32 utility; however, we also saw instances\n\nwhere the attackers used a custom DLL loader to run the malware.\n\nThe main purpose of the Stage 1 malware is to download the Stage 2 payload and directly execute it in\n\nmemory only. This downloader has the following functionality:\n\n- Contact one of the hardcoded servers\n\n - Communicate over HTTPS using hardcoded URLs\n\n - Use of hardcoded HTTP headers\n\n- Download the encrypted Stage 2 payload to its own memory space\n\n- Decrypt the Stage 2 payload, which results in a DLL\n\n- Load the Stage 2 malware\n\n- Execute the Stage 2 malware\n\nThe downloaded Stage 2 payload is TEA or (in later versions) AES-ECB encrypted. Stage 1 malware\n\ncontains a hardcoded AES/TEA key necessary for decrypting the Stage 2 payload. Since the keys were\n\nchanged multiple times during the operation, each Stage 2 payload can only be decrypted by a key\n\nhardcoded in the matching Stage 1 malware.\n\nAs previously mentioned, the attackers modified the Stage 1 malware multiple times over the course of\n\nthe operation. We identified the following changes:\n\n- Switch from TEA to AES-ECB\n\n- Addition of a local proxy IP\n\n- Implementation of raw sockets TCP communication\n\n- Hardcoding of specific paths containing a victim’s username\n\nThe attackers have employed a number of anti-analysis techniques in their custom malware.\n\n_[Control-flow flattening, a type of compiler-level obfuscation (depicted in Figure 9), is used in both Stage](https://github.com/obfuscator-llvm/obfuscator/wiki/Control-Flow-Flattening)_\n\n[1 and 2. A similar use of this technique was previously seen for example in malware attributed to APT10](https://www.virusbulletin.com/virusbulletin/2020/03/vb2019-paper-defeating-apt10-compiler-level-obfuscations/)\n\nand the Lazarus group (see the Attribution hints section).\n\n\n-----\n\nFigure 9 // Example of the control-flow flattening obfuscation used in Stage 1 malware:\n\nroutine that receives the next-stage payload\n\nThe malware authors also used dynamic API loading to thwart analysis, in both Stage 1 and 2. Figure 10\n\nshows an example of this technique as used in the Stage 1 malware. For a detailed explanation of\n\n[dynamic API loading, please refer to the 2016 Novetta report Operation Blockbuster, page 34.](https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-Report.pdf)\n\nFigure 10 // Example of dynamic API loading in Stage 1 malware: part of the routine that receives the next-stage payload\n\n#### 3.2 Stage 2: Custom backdoor\n\nThe malware executed in-memory by the Stage 1 malware is a modular backdoor in the form of a DLL\n\nwritten in C++. It periodically sends requests to the server and performs defined actions based on the\n\nreceived commands, such as make a host fingerprint, load a module, or change the configuration.\n\nDuring our investigation, we did not find any modules received by the Stage 2 malware from its C&C\n\nserver. However, our telemetry shows that the Stage 2 malware downloaded a DLL based on a publicly\n\navailable tool modified to only interpret PowerShell commands (see the PowerShell DLL section). Based\n\non the format of this DLL, we know it’s not a module for the Stage 2 malware but rather an additional\n\nstandalone component. Since the Stage 2 malware does not possess any downloading functionality\n\n(with the exception of configuration files and encrypted modules), we believe a module was used to\n\ndownload this DLL.\n\n\n-----\n\n##### 3.2.1 Bootstrap\n\nUpon its execution, the backdoor first creates instances of a set of classes. This part is interesting,\n\nbecause each class in this set is represented by an ID and provides a particular functionality such as\n\nencryption/decryption, HTTP communication, configuration processing, or module processing. Thus, this\n\nset defines the base capability of the backdoor. As we later describe in the section Supported commands,\n\nthe C&C server can instruct the backdoor to enlist all the instantiated classes and loaded modules,\n\npresumably to determine the current capabilities of the backdoor.\n\nAfter instantiating the class objects, the backdoor checks whether a configuration file already exists\n\nin a predetermined path. If it does, the config is loaded; otherwise, hardcoded values are used and\n\nsubsequently, the config is written to disk. Also, the backdoor checks whether there are any stored\n\nmodules. If so, the backdoor decrypts them and loads them. Finally, the backdoor attempts to contact\n\nthe C&C server and requests commands.\n\n##### 3.2.2 Configuration\n\nIn the Bootstrap section, we mentioned the backdoor attempts to load the configuration file from a\n\nhardcoded path (e.g. C:\\Users\\<USER>\\AppData\\Local\\NTUSER45F7.POL) on its startup. The\n\nconfiguration file is encrypted by a modified RC4 (see the Appendix), using a hardcoded key, and has the\n\nformat shown in Table 1.\n\nOffset Size (bytes) Content\n\n0 4 Value 0x77 or 0x78\n\n4 16 [Time in SYSTEMTIME format](https://docs.microsoft.com/windows/desktop/api/minwinbase/ns-minwinbase-systemtime)\n\n20 1000 Configuration entry\n\n… … (optional) Other configuration entries\n\nTable 1 // Format of a configuration file\n\nEven though the size of the configuration entry is 1000 bytes, it contains only the domain of a C&C\n\nserver. The rest consists of uninitialized data that is not used during the configuration file loading.\n\nFurther, the configuration file may contain multiple configuration entries, where each entry holds the\n\ndomain of a different C&C server.\n\n##### 3.2.3 Modules\n\nAfter loading the configuration, the backdoor proceeds to load all stored modules. The path to the folder\n\ncontaining the modules is hardcoded (e.g. C:\\Users\\<USER>\\AppData\\Local\\Temp) and the name of\n\na module file has a defined prefix (e.g. ~DF4B) and extension (e.g. .cav). The data contained in a module\n\nfile has the format shown in Table 2.\n\nOffset Size (bytes) Content\n\nModule storage type;\n0 1\nValue 0x1 or 0x2\n\nAES key material;\n1 64\nOnly if module storage type == 0x2\n\n1 or 65 X AES-CBC-encrypted data\n\nTable 2 // Module file format\n\n\n-----\n\nAs one can observe, there are two types of storage. In the case where the first byte of the module file is\n\n0x2, the following 64 bytes contains the key material (in hexadecimal) that is used for AES session key\n\n[generation using the MakeKey() method. The rest of the data is AES-CBC encrypted and contains the](https://github.com/jxjgssylsg/AES/blob/master/Rijndael.cpp#L1163)\n\nmodule.\n\nHowever, when the first byte of the module file is 0x1, the key material is missing. In this case, the\n\nbackdoor uses key material stored in its memory to generate the session key. It is worth noting that on\n\nthe startup of the backdoor, there is no key material present in the memory and the backdoor may later\n\nobtain it as a part of a received command (see the section Supported commands).\n\nNevertheless, once the session key is generated, the module data is decrypted using a specific\n\n[implementation of AES that can be found on GitHub. After the decryption, the module data has the](https://github.com/jxjgssylsg/AES/blob/master/Rijndael.cpp)\n\nformat described in Table 3.\n\nOffset Size (bytes) Content\n\n0 4 Module ID\n\n4 4 Length of the first export name\n\n8 4 Length of the second export name\n\n12 4 Length of the third export name\n\n16 4 Length of the fourth export name\n\n20 4 DLL Size\n\n24 Length of the first export name First export name (must be NULL- terminated)\n\nE1 = 24 + length of Export 1 Name Length of the second export name Second export name (must be NULL- terminated)\n\nE2 = E1 + length of Export 2 Name Length of the third export name Third export name (must be NULL- terminated)\n\nE3 = E2 + length of Export 3 Name Length of the fourth export name Fourth export name (must be NULL- terminated)\n\nE3 + length of Export 4 Name DLL size DLL\n\nTable 3 // Format of stored module data\n\nAs can be seen from the table, every module is a DLL consisting of at most four export functions. Once\n\nthe module data is decrypted, the backdoor loads the module and invokes the first, third, and fourth\n\nexport respectively. After that, the backdoor stores the necessary module data along with the module\n\nID into a list dedicated to hold the information about loaded modules. This process is repeated for each\n\nmodule file.\n\n\n-----\n\n##### 3.2.4 Network protocol\n\nWhen the configuration and the modules are loaded, the backdoor contacts the server over HTTPS using\n\none of the domain names in the configuration and concatenates it with a path to one of the ASP files\n\nfrom a hardcoded list.\n\nThe referred ASP filenames contain innocuous-looking strings with various names, topics, and events,\n\npresumably to deceive anyone monitoring the traffic. Examples of hardcoded ASP filenames:\n\n- politicia.asp\n\n- taxing-churc.asp\n\n- exports-to-Turkey.asp\n\n- Climate.asp\n\n- discoveries.asp\n\n- pay-talks-fai.asp\n\n- Nouvelles.asp\n\n- News.asp\n\n- Noticias.asp\n\n- EU-nominee.asp\n\n- Business.asp\n\n- Culture.asp\n\n- Life-Work.asp\n\n- Comercio.asp\n\n- Links.asp\n\n- churc.asp\n\n- products.asp\n\n- exports.asp\n\nFurther, similarly to the Stage 1 malware, hardcoded HTTP headers are used in the communication. In\n\nthis case, however, there are multiple hardcoded headers and one of them is randomly selected upon\n\nrequest (see an example of such a header in Figure 11).\n\nIn the HTTPS communication, the backdoor (henceforth referred to as the “client” in this section) uses\n\na custom communication protocol based on HTTP GET requests, where the messages are placed in the\n\nHTTP request body. This is an unusual approach, but the HTTP specification does not explicitly prohibit\n\nthe inclusion of a message body in a GET request. Figure 11 depicts an example of such a request.\n\n```\nGET https://chuta[.]jp/jtool/politicia.asp HTTP/1.1\nCache-Control: max-age=0\nUpgrade-Insecure-Requests: 1\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/\napng,*/*;q=0.8\n\n```\nAccept-Encoding: gzip, deflate\n```\nAccept-Language: en-US,en;q=0.9\nUser-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; Trident/4.0; SLCC2;\n.NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; Media Center PC 6.0;\n.NET4.0C; .NET4.0E)\nHost: chuta.jp\nContent-Length: 16\nConnection: Keep-Alive\n0BF4BE00001CE23D\n\n```\n\nFigure 11 // Example of GET request containing a message (bolded) in its body\n\n\n-----\n\nTable 4 defines the format of the messages passed in the message body.\n\nOffset Size Content\n\n0 1 Random value in range [0…254]\n\n1 1 Hardcoded value 0xF4\n\n2 1 Random value in range [0…254]\n\n3 1 Message ID [0…3]\n\n4 4 Client ID\n\n8 Variable (Optional) Additional data\n\nTable 4 // Format of the messages sent to the C&C server\n\nSo, if we look at the request example (see Figure 11), the message in this case would be decoded as in\n\nTable 5.\n\nOffset Size Content\n\n0 1 Random value: 0x0B\n\n1 1 0xF4\n\n2 1 Random value: 0xBE\n\n3 1 Message ID: 0x00\n\n4 4 Client ID: 0x001CE23D\n\n8 0 No additional data\n\nTable 5 // Example of a message sent to a server\n\nIf the message contains additional data, the data is always base64 encoded. After decoding, the format\n\nis as described in Table 6.\n\nOffset Size Content\n\n0 4 Size of data\n\n4 Variable Encrypted data\n\nTable 6 // Format of additional data in a message\n\n[The decoded data is further encrypted either by a modified RC4 algorithm or ChaCha20, depending on](https://tools.ietf.org/html/rfc7539)\n\nthe stage of the communication (see section Session).\n\n\n-----\n\n3.2.4.1 Client ID\n\nBefore sending the first message to the C&C server, the client generates a pseudorandom ID (e.g.\n\n0x001CE23D as in the example in Figure 11). This Client ID will be used for all requests that the client\n\nsends to the server in an established session. This means that for every session, a new Client ID is\n\ngenerated.\n\n3.2.4.2 Session\n\nThe session is composed of two stages: ChaCha20 nonce exchange, and commands execution. Figure 12\n\nand Figure 14 represent the complete communication in a session.\n\n3.2.4.2.1 Stage 1 – Exchange ChaCha20 nonce\n\nIn the first stage, the goal is to establish ChaCha20 contexts, which are then used in the second stage of\n\nthe communication. The flow of this stage is depicted in Figure 12.\n\n#### Client Server\n\n0 Initial check-in\n\nAdditional data                 \nc3VjY2V2cyE=\n\n1 Obtain ChaCha20 nonce\n\nAdditional data                 \nServer’s nonce\n24-digit hex string\n\n2 Send client’s nonce\n\nAdditional data Client’s nonce\n\nArbitrary data\n\nFigure 12 // Session first stage: successful exchange of ChaCha20 nonces\n\n3.2.4.2.1.1 Message ID 0 – Initial check-in\n\nThis is the first message the client sends to the server. The expected response from the server is either\n```\nc3VjY2V2cyE= (indicating success) or ZmFpbGVKlQ== (indicating an error on the server). On an error,\n\n```\nthe client tries to contact another server. Although these “success” and “error” strings appear to be\n\nbase64-encoded strings, the malware does not decode them, but rather just checks for these literal\n\nvalues.\n\n3.2.4.2.1.2 Message ID 1 – Obtain server’s ChaCha20 nonce\n\nOnce the initial check-in is successfully passed, the client sends a message with ID 1. The server response\n\ncontains base64-encoded data of the “additional data” format described above. After the base64\n\ndecoding, the data is further encrypted by a modified RC4 (see the Appendix). To decrypt the encrypted\n\ndata from the received message, the client uses a hardcoded key.\n\n\n-----\n\nThe decrypted data is expected to be a string consisting of 24 hexadecimal digits. The client will parse\n\nthe string using scanf(..,”%02X”...) and use the result as a nonce in the ChaCha20 context\n\ninitialization, which comes immediately afterward. This context will be later used for encryption of\n\nevery data stream sent to the server. The key, which is necessary along with the nonce for creating the\n\nChaCha20 context, is derived by the algorithm presented in Figure 13.\n\n```\nUInt32 v3 = clientID + 0x11111111;\nbyte[] chachaKey = new byte[32];\nchachaKey[0] = 0;\nfor (int i = 1; i < 32; i++)\n  chachaKey[i] = (byte)(chachaKey[i - 1] + ((UInt32)(v3 * i) >> i));\n\n```\n\nFigure 13 // ChaCha20 key derivation algorithm\n\n3.2.4.2.1.3 Message ID 2 – Send client’s ChaCha20 nonce\n\nNext, the client will generate 12 pseudorandom bytes, which are used as a nonce for the second\n\nChaCha20 context. This context will be used for decryption of every data stream received from the\n\nserver. Note that the key used for this context initialization is the same as in the first case. This means\n\nthe contexts are created using the same key; however, the nonce differs.\n\nThe generated nonce is then formatted as a hex string and subsequently encrypted by the modified\n\nRC4 algorithm, using the same key as in the previous case. Next, the result is sent as additional data in\n\na message with ID 2 to the server. The response from the server can be arbitrary – the client discards it\n\nupon receipt. After discarding the response, the context is initialized, and the backdoor proceeds to the\n\nsecond stage of communication.\n\n3.2.4.2.1.4 Message ID 3 – Error occurred\n\nIf anything goes wrong in this stage, the client sends a message of ID 3 to indicate to the server that an\n\nerror occurred. The additional data in the message contains a string ZnNrbGNz (fsklcs when base64\ndecoded). The client does not expect any response from the server and sleeps for a certain amount of\n\ntime. When the time is up, it contacts the server again.\n\n3.2.4.2.2 Stage 2 – Request and execute commands\n\nOnce the ChaCha20 nonces are exchanged and the contexts are established, the communication moves\n\nto the second stage, which is dedicated to receiving commands and performing actions based on them.\n\nThe command requests are sent to the server until the server responds with a specific command to\n\nterminate the communication. The flow of this stage is depicted in Figure 14.\n\n\n-----\n\n#### Client\n\n\n#### Server\n\n|1 Request command|Col2|\n|---|---|\n|Additional data -||\n|Command data 2 Command result||\n|Additional data Response||\n|Arbitrary data ... 1 Request command||\n|Additional data - Command data||\n|Terminate communication 3 Terminate communication||\n|Additional data|ZnNrbGNz|\n\n\nFigure 14 // Session second stage: the client requests commands until the server instructs it to terminate the communication\n\n3.2.4.2.2.1 Message ID 1 – Request command\n\nThe client sends message with ID 1 to request a command from the server. The expected response from\n\nthe server contains data in the “additional data” format encrypted by ChaCha20 under base64 encoding.\n\nAfter the decryption, the data holds the command ID and other data necessary to successfully execute\n\nthe command. In the section Supported commands, one can observe the commands supported by the\n\nbackdoor.\n\n3.2.4.2.2.2 Message ID 2 – Command result\n\nWhen the command is performed, the result is sent back to the server in a message with ID 2 as\n\nadditional data. Also, as in the first stage, the client does not expect any particular response from the\n\nserver; the response is discarded upon receipt.\n\n3.2.4.2.2.3 Message ID 3 – Communication termination upon request / Error occurred\n\nThe client keeps sending command requests to the server until a specific command is received indicating\n\nthe server wishes to stop the communication. Once this command is received, the client sends a\n\nmessage of ID 3, instead of a message of ID 2, as a confirmation.\n\nAlternatively, the client sends a message of ID 3 in the cases where an error occurred.\n\nIn both cases, the additional data in the message contains the string ZnNrbGNz. After sending the\n\nmessage, the client sleeps for a certain amount of time, and then contacts the server again.\n\n\n-----\n\n##### 3.2.5 Supported commands\n\nTable 7 presents the commands supported by the analyzed sample.\n\nOffset Content\n\n0x00000001 Receive AES key string for module file encryption/decryption, and list initialized classes and modules\n\n0x00000002 Receive and load module\n\n0x00000005 Unknown\n\n0x00000006 Delete all stored module files\n\n0x00000030 Create host fingerprint\n\n0x01000001 Execute a routine from a specified class instance\n\n0x01000002 Execute a routine from a specified class instance\n\n0x01000003 Execute a routine from a specified class instance\n\n0x01000004 Execute a routine from a specified class instance\n\n0x10000001 Set sleep period\n\n0x10000002 Set received time in configuration and write the current configuration to a file\n\n0x10000003 Reload configuration from file and send it to the server\n\n0x10000004 Receive configuration and write it to a file\n\n0x10000006 Terminate communication\n\n0x11111111 No operation\n\nOther Execute particular export function of a specified module\n\nTable 7 // List of supported commands\n\n##### 3.2.6 Anti-analysis techniques\n\nAs for anti-analysis techniques, similar to the custom downloader (Stage 1), the custom backdoor also\n\nfeatures control-flow flattening and dynamic API loading (see the section Stage 1: Custom downloader).\n\nFor the backdoor, however, the attackers used a different method for resolving the APIs. The necessary\n\nAPIs are resolved on bootstrap and the pointers are stored in an array for later use, as seen in Figure\n\n15. More precisely, for every class that has an assigned ID (we mentioned these classes in the section\n\n_Bootstrap), there exists a function that resolves the APIs used by such a class. As one can see from_\n\nFigure 15, this leads to redundancy (e.g. CloseHandle_3, GetFileSize_2). On the other hand, it may\n\n[indicate the backdoor is composed of several modules (in the sense of modular programming) that are](https://en.wikipedia.org/wiki/Modular_programming)\n\nindependent to each other. This is further supported by the existence of the command 0x01, which is\n\ndescribed in the section Supported commands.\n\n\n-----\n\nFigure 15 // Example of the custom backdoor’s dynamic API loading\n\n#### 3.3 PowerShell DLL\n\n[Another component we discovered in our investigation is a modified version of PowerShdll, a publicly](https://github.com/p3nt4/PowerShdll)\n\navailable tool for running PowerShell code that does not require access to powershell.exe, thanks to\n\nusing PowerShell automation DLLs.\n\nThe attackers customized the tool to have only one export routine that accepts one string as a\n\nparameter and passes it to the PowerShell DLLs for interpretation. The result given by PowerShell is\n\nthen returned. All other functionality implemented in the original source code has been stripped.\n\nAs mentioned in the previous section, this DLL was delivered and utilized by the custom backdoor.\n\n\n-----\n\n#### 3.4 Custom DLL loaders\n\nAs previously mentioned, besides the rundll32 utility, the attackers also used custom DLL loaders to\n\nexecute their malware. We found two versions of such loaders.\n\nOne version simply loads the DLL and executes it using its export DllRegisterServer as the main\n\nroutine. The second version is more complicated – it either uses the same method as the first one, or\n\nperforms the following sequence:\n\n- Execute regsvr32 utility with the path to the malicious DLL as a parameter\n\n- Execute rundll32 utility with the same DLL, using the DllRegisterServer export\n\n- Copy regsvr32 to C:\\NVidia\\NvDaemon.exe, run it with the DLL as a parameter, and delete the\n\ncopied C:\\NVidia\\NvDaemon.exe\n\n- Copy rundll32 to C:\\ProgramData\\Skype\\Skype.exe, run it with the DLL and its\n```\n DllRegisterServer export as parameters, and delete the copied C:\\ProgramData\\Skype\\\n\n Skype.exe\n\n```\nWe are unsure about the reason for using these custom loaders, but we assume the attackers were\n\neither testing the environment or resolving some issues.\n\n#### 3.5 Beacon DLL\n\nAnother component found during the investigation is a DLL with very simple functionality – after\n\nexecution, the DLL connects to a specific hardcoded IP address, makes an HTTP request, and then\n\nterminates. We suspect that the attackers used this DLL to verify that the connection is, for example,\n\nnot blocked by a corporate firewall.\n\n#### 3.6 Infrastructure\n\nThe malicious tools were always hosted on multiple servers. The attackers sometimes used\n\ncompromised, but otherwise legitimate, servers, but other times used their own servers. The hardcoded\n\ndomains and IP addresses varied between the different malicious tools used, and often changed when\n\nthe malware was recompiled and delivered again.\n\nIt is worth noting that both the legitimate servers and the servers managed by the attackers used\n\nWindows operating systems and Microsoft’s IIS as a web server. Determining how the attackers\n\nmanaged to compromise the legitimate servers was out of scope of our investigation.\n\n### 4 ATTRIBUTION HINTS\n\nOur investigation of Operation In(ter)ception did not reveal strong evidence of a connection to any\n\nknown APT group.\n\nHowever, we found several hints that might suggest a possible link to the Lazarus group:\n\n- We have seen a variant of the Stage 1 malware that carried a Win32/NukeSped.FX sample[1]; a malware\n\n[family attributed by ESET with high confidence to the Lazarus group (see our previous blogpost,](https://www.welivesecurity.com/2018/04/03/lazarus-killdisk-central-american-casino/)\n\nspecifically the section Lazarus tools in casino attack).\n\n- Development environment\n\n[Most PE Rich Headers are very similar to Lazarus samples such as Win32/NukeSped.FX and Win32/](https://www.virusbulletin.com/uploads/pdf/magazine/2019/VB2019-Kalnai-Poslusny.pdf)\n\nNukeSped.FZ[2]\n\n1 717622361D0C96B753FCDE57334119341A1E7691\n2 A01FBC61448EA1368B276BB34E4DE32445CA2076, 1F8CF1746AE7CF7A840FD22E638E51697C336CC8\n\n\n-----\n\n- **Host fingerprinting (e.g. Windows product name, CPU name, Disk info, Adapters info, etc.)**\n\nExample: Win32/NukeSped.FZ[3]\n\n- **Compiler-level code-flattening technique (see Figure 9)**\n\nExample: Win32/NukeSped.FX[4]\n\nHowever, this technique is also known to be used by other APT groups like APT10[5] and can also be found\n\nin some videogame hacks.\n\n- **Dynamic API loading (examples in Figure 10 and Figure 15)**\n\nExample: Win32/NukeSped.FX[6]\n\n- The Lazarus group is known to target defense companies and use fake LinkedIn accounts. One such\n\n[case is described in the FBI’s indictment (p. 95) against of one of the group’s members.](https://www.justice.gov/opa/press-release/file/1092091/download)\n\n- The Lazarus group uses spearphishing attacks via fake job offers as a part of their Tactics, Techniques,\n\n[and Procedures (TTPs). One such case was reported by ESTSecurity and Cisco Talos.](https://blog.alyac.co.kr/2105)\n\n- The Lazarus group is also known to use both rented and compromised web servers to host their\n\n[malware. This was reported, for example, by Kaspersky.](https://securelist.com/cryptocurrency-businesses-still-being-targeted-by-lazarus/90019/)\n\n[ESET researchers previously analyzed the links between the Lazarus group’s major campaigns.](https://www.virusbulletin.com/uploads/pdf/magazine/2018/VB2018-Kalnai-Poslusny.pdf)\n\n### 5 CONCLUSION\n\nOur research into Operation In(ter)ception shows again how effective spearphishing can be for\n\ncompromising a target of interest. In the investigated cases, the adversaries used LinkedIn to select\n\nemployees of the targeted military and defense companies and subsequently approached them with\n\nfake job offers. Unafraid of direct contact, the attackers chatted with the victims to convince them to\n\nopen malicious files. Once they succeeded, they had their initial foothold inside the victim companies.\n\nInside the target’s network, the attackers tried to stay under the radar by frequently recompiling their\n\ncustom malware, abusing native Windows utilities and hiding under names of legitimate software\n\nand companies. The apparent goal was to steal company data, and as the final stage of the attack, the\n\nadversaries tried to monetize the access to a victim’s email account through a BEC attack.\n\n### 6 ACKNOWLEDGEMENTS\n\nSpecial thanks to Michal Cebák for his work on this investigation.\n\n### 7 INDICATORS OF COMPROMISE (IOCS)\n\n#### 7.1 ESET detection names\n\nWin32/Interception.A\n\n3 1F8CF1746AE7CF7A840FD22E638E51697C336CC8\n4 A01FBC61448EA1368B276BB34E4DE32445CA2076\n5 40BD2000D545FC1F7EEB6EA4C31A3D0FD39B452E\n6 68DA304DAC7F713F7707E6CC849DD5ED587BFCF9\n\n\n-----\n\n#### 7.2 Hashes\n```\nB1199EE7AFB1F348D42BEF1CAED7E405A7631B1B\n286C01EAB255DA32B7F36CE9814DA3999E17F40D\n0C63F318EDEAEDC7D7AF28304A61A0DF71699F89\n373EC71B31F803298F06B7EDED059BC1E7C6D70B\nAE130A678D76C44171799C0750FEFD5DB43A9DE4\nFB38C71DD02C3926F9A1C146A13A66579D3F88D2\n8690930299D83FE65A9C3C5CD1D7F509A79D8E71\nD07B19373293369C55CC6E7E0D4CF6CFE32542DF\n\n 7.3 Filenames\nC:\\Intel\\IntelR.lor\nC:\\Intel\\IntelV.cgi\nC:\\Intel\\crtutl.exe\nC:\\NVIDIA\\nvc.exe\nC:\\NVIDIA\\nve.exe\nC:\\NVIDIA\\nvd.exe\nC:\\NVIDIA\\nve.cgr\nC:\\NVIDIA\\nve.lom\nC:\\NVIDIA\\nve.cgt\nC:\\NVIDIA\\nve.loe\nC:\\NVIDIA\\nve.cgy\nC:\\NVIDIA\\nve.lop\nC:\\NVIDIA\\nve.cgb\nC:\\NVIDIA\\ctutl.exe\nC:\\NVIDIA\\ctrutl.exe\nC:\\NVidia\\NvDaemon.exe\nC:\\ProgramData\\Skype\\Skype.exe\nC:\\ProgramData\\Mozilla\\fx.rmb\nC:\\ProgramData\\DellTPad\\ApMsgApp.exe\nC:\\ProgramData\\DellTPad\\DellTPadRepair.exe\nC:\\ProgramData\\DellTPad\\DellTPadMobile.exe\nC:\\ProgramData\\DVDStudio\\DVDTools.exe\nC:\\ProgramData\\DVDStudio\\DVDStudioSync.exe\nC:\\Users\\<USER>\\AppData\\Local\\Temp\\~pwshld3.dat\nC:\\Users\\<USER>\\AppData\\Local\\Microsoft\\OneDrive\\OneDrive.exe\nC:\\Users\\<USER>\\AppData\\Local\\Microsoft\\oneDrive\\oneDriveSync.exe\nC:\\Users\\<USER>\\AppData\\Local\\IconCache.db7\nC:\\Users\\<USER>\\AppData\\Local\\NTUSER45F7.POL\n\n```\n\n-----\n\n#### 7.4 URLs\n\n\n-----\n\n### 8 MITRE ATT&CK TECHNIQUES\n\nTactic ID Name Description\n\nInitial Access _[T1194](https://attack.mitre.org/techniques/T1194)_ Spearphishing via Service LinkedIn is used to contact the target and provide a malicious attachment.\n```\n                              cmd.exe used to create a scheduled task to interpret a malicious XSL script\n\n```\n_[T1059](https://attack.mitre.org/techniques/T1059)_ Command-Line Interface\nvia WMIC.\n\n_[T1106](https://attack.mitre.org/techniques/T1106)_ Execution through API Malware uses CreateProcessA API to run another executable.\n\n_[T1086](https://attack.mitre.org/techniques/T1086)_ PowerShell A customized .NET DLL is used to interpret PowerShell commands.\n\n_[T1117](https://attack.mitre.org/techniques/T1117)_ Regsvr32 The regsvr32 utility is used to execute malware components.\n\n_[T1085](https://attack.mitre.org/techniques/T1085)_ Rundll32 The rundll32 utility is used to execute malware components.\n\nExecution\n\n_[T1053](https://attack.mitre.org/techniques/T1053)_ Scheduled Task `WMIC is scheduled to interpret remote XSL scripts.`\n\nWindows Management\n_[T1047](https://attack.mitre.org/techniques/T1047/)_ `WMIC utility is abused to interpret remote XSL scripts.`\nInstrumentation\n\n_[T1035](https://attack.mitre.org/techniques/T1035)_ Service Execution A service is created to execute the malware.\n\nThe attacker relies on the victim to extract and execute a LNK file from a\n_[T1204](https://attack.mitre.org/techniques/T1204)_ User Execution\nRAR archive received in an email attachment.\n\n_[T1220](https://attack.mitre.org/techniques/T1220)_ XSL Script Processing `WMIC is used to interpret remote XSL scripts.`\n\n_[T1050](https://attack.mitre.org/techniques/T1050)_ New Service A service is created to ensure persistence for the malware.\n\nPersistence\n\nUpon execution of the LNK file, a scheduled task is created that periodically\n_[T1053](https://attack.mitre.org/techniques/T1053)_ Scheduled Task\nexecutes WMIC.\n\n_[T1116](https://attack.mitre.org/techniques/T1116)_ Code Signing Malware signed with a certificate issued for “16:20 Software, LLC”.\n\nDeobfuscate/Decode Files or\n_[T1140](https://attack.mitre.org/techniques/T1140)_ `certutil.exe is used to decode base64-encoded malware binaries.`\nInformation\n\n_[T1070](https://attack.mitre.org/techniques/T1070)_ Indicator Removal on Host Attackers attempt to remove generated artifacts.\n\n\nDefense\nEvasion\n\n\nMalware directories and files are named as, or similar to, legitimate software\n_[T1036](https://attack.mitre.org/techniques/T1036)_ Masquerading\nor companies.\n\n_[T1117](https://attack.mitre.org/techniques/T1117)_ Obfuscated Files or Information Malware is heavily obfuscated and delivered in base64-encoded form.\n\n_[T1085](https://attack.mitre.org/techniques/T1085)_ Regsvr32 The regsvr32 utility is used to execute malware components.\n\n_[T1078](https://attack.mitre.org/techniques/T1078)_ Valid Accounts Adversary uses compromised credentials to log into other systems.\n\n_[T1220](https://attack.mitre.org/techniques/T1220)_ XSL Script Processing `WMIC is used to interpret remote XSL scripts.`\n\n\n-----\n\nTactic ID Name Description\n\nCredential\n_[T1110](https://attack.mitre.org/techniques/T1110)_ Brute Force Adversary attempts to brute-force system accounts.\nAccess\n\n_[T1087](https://attack.mitre.org/techniques/T1087)_ Account Discovery Adversary queries AD server to obtain system accounts.\n\nMalware has ability to query registry to obtain information such as Windows\n_[T1012](https://attack.mitre.org/techniques/T1012)_ Query Registry\nproduct name and CPU name.\n\nDiscovery\n\n_[T1018](https://attack.mitre.org/techniques/T1018)_ Remote System Discovery Adversary scans IP subnets to obtain list of other machines.\n\nMalware has ability to gather information such as Windows product name,\n_[T1082](https://attack.mitre.org/techniques/T1082)_ System Information Discovery\nCPU name, username, etc.\n\nAdversary collects sensitive data and attempts to upload it using the\n_[T1005](https://attack.mitre.org/techniques/T1005)_ Data from Local System\nDropbox CLI client.\n\nCollection\n\nAdversary has access to a victim’s email and may utilize it for a business\n_[T1114](https://attack.mitre.org/techniques/T1114)_ Email Collection\nemail compromise attack\n\nCommand\n_[T1071](https://attack.mitre.org/techniques/T1071)_ Standard Application Layer Protocol Malware uses HTTPS protocol.\nand Control\n\n_[T1002](https://attack.mitre.org/techniques/T1002)_ Data Compressed Exfiltrated data is compressed by RAR.\n\n\nExfiltration\n\n\n_[T1048](https://attack.mitre.org/techniques/T1048)_ Exfiltration Over Alternative Protocol Exfiltrated data is uploaded to Dropbox using its CLI client.\n\n_[T1537](https://attack.mitre.org/techniques/T1537)_ Transfer Data to Cloud Account Exfiltrated data is uploaded to Dropbox.\n\n\n### 9 APPENDIX\n\nBelow we present the modified version of the RC4 cipher used in the Stage 2 backdoor (see the sections\n\n_Configuration and Message ID 1 – Obtain server’s ChaCha20 nonce). We have added comments to highlight_\n\nthe differences between this algorithm and standard RC4. Despite these “errors” however, if data is\n\nencrypted and decrypted by this particular implementation, it will work.\n\n\n-----\n\n```\npublic static byte[] RC4Crypt(byte[] data, byte[] key)\n{\n  int a, i, j, k;\n  int[] S;\n  byte[] result;\n  S = new int[256];\n  result = new byte[data.Length];\n  for (i = 0; i < 256; i++)\n    S[i] = i;\n  for (i = j = 0; i < 256; i++)\n  {\n    j = (j + S[i] + key[i % key.Length] + i) & 0xFF; // nonstandard: +i\n    S[i] = S[i] ^ S[j]; // Bug in the swap implementation\n    S[j] = S[j] ^ S[i]; // If i==j, the value will be 0 instead\n    S[i] = S[i] ^ S[j]; // of the original value.\n  }\n  for (a = i = j = 0; i < data.Length; i++)\n  {\n    a = (a + 1) & 0xFF;\n    j = (j + S[a] + a) & 0xFF; // nonstandard: +a\n    S[a] = S[a] ^ S[j]; // Bug in the swap implementation\n    S[j] = S[j] ^ S[a];\n    S[a] = S[a] ^ S[j];\n    k = S[(S[a] + S[j]) & 0xFF];\n    result[i] = (byte)(data[i] ^ k);\n  }\n  return result;\n}\n\n```\n\nFigure 16 // Modified RC4 cipher used in the Stage 2 backdoor (rewritten in C#)\n\n\n-----\n\n### ABOUT ESET\n\n[For 30 years, ESET® has been developing industry-leading IT security software and services for](http://www.eset.com/int/)\n\nbusinesses and consumers worldwide. With solutions ranging from endpoint and mobile security,\n\nto encryption and two-factor authentication, ESET’s high-performing, easy-to-use products give\n\nconsumers and businesses the peace of mind to enjoy the full potential of their technology. ESET\n\nunobtrusively protects and monitors 24/7, updating defenses in real time to keep users safe and\n\nbusinesses running without interruption. Evolving threats require an evolving IT security company.\n\n[Backed by R&D centers worldwide, ESET becomes the first IT security company to earn 100 Virus](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)\n\n_[Bulletin VB100 awards, identifying every single “in-the-wild” malware without interruption since 2003.](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)_\n\n[For more information, visit www.eset.com or follow us on LinkedIn, Facebook and Twitter.](https://www.linkedin.com/company/28967?trk=tyah&trkInfo=tarId%3A1402921556545%2Ctas%3AESET%2Cidx%3A2-1-4)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2020/06/ESET_Operation_Interception.pdf"
    ],
    "report_names": [
        "ESET_Operation_Interception.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1592493273,
    "ts_modification_date": 1592493275,
    "files": {
        "pdf": "https://archive.orkl.eu/ba53d83392b274a987dc1e2684a4615a0514bd97.pdf",
        "text": "https://archive.orkl.eu/ba53d83392b274a987dc1e2684a4615a0514bd97.txt",
        "img": "https://archive.orkl.eu/ba53d83392b274a987dc1e2684a4615a0514bd97.jpg"
    }
}