{
    "id": "69f063c9-5ca2-497a-a7e8-8d5eb74abce2",
    "created_at": "2023-01-12T15:08:34.787382Z",
    "updated_at": "2025-03-27T02:16:28.845289Z",
    "deleted_at": null,
    "sha1_hash": "e3dbd3c172440c49bdabb7381a7fdfe04a1c6b60",
    "title": "2021-02-02 - How Vietnam-based hacking operation OceanLotus targets journalists",
    "authors": "",
    "file_creation_date": "2022-05-28T00:24:52Z",
    "file_modification_date": "2022-05-28T00:24:52Z",
    "file_size": 633182,
    "plain_text": "# How Vietnam-based hacking operation OceanLotus targets journalists\n\n**[cpj.org/2021/02/vietnam-based-hacking-oceanlotus-targets-journalists](https://cpj.org/2021/02/vietnam-based-hacking-oceanlotus-targets-journalists)**\n\nFebruary 1, 2021\n\nA woman is pictured using a computer at a conference in Berlin, Germany on December 27,\n2010. Vietnam-based hacking operation OceanLotus has targeted journalists in Germany.\n(Reuters/Thomas Peter)\n[Features & Analysis](https://cpj.org/features-and-analysis/)\nBy [Madeline Earp/Consultant Technology Editor on February 1, 2021 4:52 PM EST](https://cpj.org/author/madeline-earp-consultant-technology-editor/)\n\nIn early 2020, Vietnamese writer Bui Thanh Hieu told Marina Mai, a freelancer based in\nBerlin, that he was closing his blog to protect his family. In 2009, Hieu was detained for a\n[week for his critical writing on Vietnam’s territorial disputes with China, as CPJ documented.](https://cpj.org/2009/09/blogger-still-detained-in-vietnam-three-released/)\nIn 2013, he fled to Germany, but continued writing about Vietnamese politics on his popular\nblog Nguoi Buon Gio (The Wind Trader) and on Facebook, he told Mai in an interview for\n[the Berlin-based daily taz. He went on to face hacking attacks, repeated attempts to have](https://taz.de/Pressefreiheit-in-Vietnam/!5667357/)\nFacebook disable his account, and even sought protection from German police following\nthreats related to his work, according to the interview. Eventually, he felt he had no choice\nbut to shut the site.\n\n\n-----\n\nWhat Mai didn t know at the time was that her subject had fallen victim to a massive\nhacking and surveillance operation known as OceanLotus, which experts say targets\npeople who have criticized the Vietnamese state – and which would come to target her as\nwell. Mai, who has not been back to her home country in several years, still writes about\nVietnam, as well as the Vietnamese diaspora in Germany, and local issues in Berlin.\nShe told CPJ in an email in late 2020 that she learned she was a target when German\njournalists informed her of an attempt to install spyware on her computer.\n\n“I didn’t think I’d be an interesting person for the Vietnamese secret service, because I only\nwrite in German,” she told CPJ. “I had to correct this opinion.”\n\nSteven Adair, president and co-founder of Volexity, a U.S.-based cybersecurity company\nthat has studied OceanLotus, spoke to CPJ by phone in late 2020 about how the group\nidentifies and targets journalists.The method used in the separateattacks on Mai and Hieu,\n[known as spear phishing, is familiar to many journalists. Mai told CPJ she was targeted via](https://cpj.org/2019/07/digital-safety-kit-journalists/#phishing)\nan email that appeared to be legitimate but contained malware; German\n[journalists reported that the same method was used against Hieu in an October 2020 article](https://web.br.de/interaktiv/ocean-lotus/en/)\npublished by Die Zeit newspaper and public service broadcaster BR. (Hieu initially agreed\nto an interview when CPJ reached him via messaging app in late 2020, but later said he\nwas too busy to respond.)\n\nOceanLotus also creates fictitious news websites and social media profiles to lure its target\n[audience, according to Adair; in December, Facebook said it had traced malicious activity](https://about.fb.com/news/2020/12/taking-action-against-hackers-in-bangladesh-and-vietnam/)\nby the same actors to an IT company in Vietnam. Adair shared more insights into the group\nwith CPJ below. His answers have been edited for length and clarity.\n\n**Tell us about your work on OceanLotus so far.**\n\n[In 2017, we released research about a large digital surveillance campaign called](https://www.volexity.com/blog/tag/oceanlotus/)\nOceanLotus or APT32, a cyber-threat actor or group of hackers. There was no attribution to\n[a country, but [Silicon Valley-headquartered cybersecurity firm] FireEye and the](https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html) [EFF [U.S.](https://www.eff.org/sv/deeplinks/2017/12/2017-year-nation-state-hacking)\ndigital rights group the Electronic Frontier Foundation] had some reporting that clearly\nshowed OceanLotus was out of Vietnam, and was spear phishing dissidents.\n\nThen we happened to come across some weird code on Cambodian government websites\nthat had been compromised. It was profiling visitors, collecting information about them. We\neventually uncovered that in over 100 different websites for the Philippine military, Laotian\nwebsites, Cambodian media websites – all countries surrounding Vietnam.\n\nWe uncovered this huge set of stuff going on, including phishing attacks, and some of the\nmalware we could clearly tie back to OceanLotus. Once they have access to your inbox,\nthey can pretend to be you or anyone that’s ever emailed you.\n\n\n-----\n\nThey also [create] fake sites – a lot of them are news websites. None of them are going to\nleapfrog CNN with millions of views a day, but they have news constantly updating, or they\nadvertise somewhere. Some of the pages never really caught on, but one had over 20,000\n\n[social media] followers. That’s a decent number for a completely fraudulent website whose\npurpose is inarguably to track and target visitors.\n\nThe majority [of targets] ended up being human rights defenders like the [Germany-based]\nVETO! Human Rights Defenders Network, media organizations in the United States, and\nVietnamese Catholicism related websites…groups whose mission is offensive to the\nVietnamese government. A lot of them were media websites or blogs that expose\ncorruption.\n\n**Is it possible to say whether state actors are behind OceanLotus?**\n\nWe definitely believe it’s out of Vietnam, but whether it’s a government agency, a contractor\nworking for them, or something else, we don’t claim that we know that.\n\nWe look at the immense level of effort and resources to maintain all the infrastructure and\nidentify the victims. It’s not something anyone’s going to do in their spare time.\n\nWhen you look at the 2017 campaign, they’re hacking 120 sites and 90 of them are media\nand human rights organizations— from our perspective, there’s no other explanation.\n\n_[Editor’s note: CPJ requested comment from the Vietnamese embassy in Berlin via an_\n_email address listed on its website, but did not receive a reply. Phone calls to a number on_\n_Hanoi’s Ministry of Public Security website rang unanswered.]_\n\n**What are the risks of visiting a malicious website set up by hackers?**\n\nThese websites have real news on them, and one or two pages out of maybe 5,000 would\ndeliver malware. Theoretically, someone could end up on that [by mistake], but we surmise\nthat they probably deliver links in a targeted fashion through direct messages or email.\n\nOr, if they had designated you as a target and had identified your IP address, then the\nwebsite would behave differently, either present malware to download or redirect you to a\nlogin page to steal your password or the Google OAuth credentials that you use to\nauthorize an application.\n\nThere’s no vulnerability in a browser that means you could visit a website [from your home]\nand they would know who you are. But if you’re in a corporate office, it may be possible to\nidentify that you’re tied to an organization on the target list. With one organization that we\nworked with, we could visit a site and nothing much happened. But from an IP address tied\nto that organization, the same website would behave differently.\n\n\n-----\n\nThe main way they can profile you is by looking at what you do. The system can tell that\nyou’re Person A who visited this blog. Maybe you visit a second time, maybe you also start\nshowing up on this other news website dedicated to dissidents. They can track language\nsettings, where you came from, enough to say, “That’s probably an activist or someone who\nis interested in activists.” It’s quite an operation.\n\nOne of the websites that we found was compromised related to the Taiwanese steel plant\nthat spilled a bunch of chemicals in the river. The site had been running for several years,\nsaying, “Get this company out of Vietnam.” It was actually run by OceanLotus.\n\n_[Editor’s note: In 2016, a Taiwanese firm that operated a steel plant in Vietnam agreed to_\n_[pay millions of dollars in damages for a toxic waste spill, according to The Guardian. The](https://www.theguardian.com/environment/2016/jul/01/vietnam-blames-toxic-waste-water-fom-steel-plant-for-mass-fish-deaths)_\n_incident became a flashpoint for protests and the government cracked down on news_\n_coverage,_ _[imprisoning at least one journalist as a result, according to CPJ research.]](https://cpj.org/data/people/nguyen-van-hoa/)_\n\n**_Die Zeit and BR reported that the hackers used a tool called_** **[Cobalt Strike. What is](https://www.cobaltstrike.com/)**\n**that?**\n\nCobalt Strike is a penetration testing tool. I don’t know who their customers are, but it’s sold\nto a lot of companies that use it legitimately. They hire someone to break in and test their\nsecurity, and that’s a toolkit they can use.\n\nI don’t suspect that OceanLotus is a customer of Cobalt Strike. We don’t know how it\nhappens, but cracked versions get out there. Maybe someone stole it through hacking or\nafter signing up as a customer, but it means multiple people can use an unsupported,\nillegitimate version without paying for it, and it gives them the capability to take control of a\nsystem. That’s not because of an irresponsible action from the company, as far as we know\n— it’s not in the same category as companies that are purveying malware to governments.\n\nThere’s not a specific solution – hackers must be having success with it, or they wouldn’t\nkeep using it. But if it’s not that tool, it’s going to be another. Anti-virus [software] is more\nlikely to pick up something like that, which is a known, older technology and not being\nupdated – though we don’t know how many of the kinds of people being targeted have antivirus.\n\nIn the case of OceanLotus, it’s interesting that they use it at all. They also have a significant\namount of malware developed in-house and a pretty strong capability to attack across\ndifferent platforms. But they continue to use it, they’ve been using it for years.\n\n**CPJ’s** **[Digital Safety Kit, in six languages, has more information on](https://cpj.org/2019/07/digital-safety-kit-journalists/)** **[phishing.](https://cpj.org/2019/07/digital-safety-kit-journalists/#phishing)**\n\n_Attila Mong, CPJ’s EU correspondent, contributed reporting from Berlin._\n\n\n-----\n\nMadeline Earp is a consultant technology editor for CPJ. She has edited digital security and\nrights research for projects including five editions of Freedom House’s Freedom on the Net\nreport, and is a former CPJ Asia researcher.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-02 - How Vietnam-based hacking operation OceanLotus targets journalists.pdf"
    ],
    "report_names": [
        "2021-02-02 - How Vietnam-based hacking operation OceanLotus targets journalists.pdf"
    ],
    "threat_actors": [
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536114,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1653697492,
    "ts_modification_date": 1653697492,
    "files": {
        "pdf": "https://archive.orkl.eu/e3dbd3c172440c49bdabb7381a7fdfe04a1c6b60.pdf",
        "text": "https://archive.orkl.eu/e3dbd3c172440c49bdabb7381a7fdfe04a1c6b60.txt",
        "img": "https://archive.orkl.eu/e3dbd3c172440c49bdabb7381a7fdfe04a1c6b60.jpg"
    }
}