{
    "id": "6a10f7a9-3d85-456f-94a3-1a360c996da7",
    "created_at": "2023-01-12T14:59:32.359673Z",
    "updated_at": "2025-03-27T02:09:17.945699Z",
    "deleted_at": null,
    "sha1_hash": "2a5bcfae4377679dd4283b4d02897128dfefeb79",
    "title": "2021-06-21 - An Encounter With Ransomware-as-a-Service- MEGAsync Analysis",
    "authors": "",
    "file_creation_date": "2022-05-27T22:58:33Z",
    "file_modification_date": "2022-05-27T22:58:33Z",
    "file_size": 4599654,
    "plain_text": "# An Encounter with Ransomeware-as-a-Service: MEGAsync Analysis\n\n**blog.reconinfosec.com/megasync-analysis/**\n\nRecon's SOC recently responded to an attempted ransomware and extortion attack. It had all the\nmarkings of a nightmare scenario: malicious access through the VPN, an external server in the same IP\nblock as the Colonial Pipeline incident, Cobalt Strike flying across the environment, and a system running\nan unauthorized copy of MEGAsync. We attributed the attack to a Ransomware-as-a-Service (RaaS)\nthreat group, likely DarkSide, REvil, or their affiliates.\n\nThrough our initial response, we quickly identified and remediated compromised systems and accounts\nto contain the malicious activity. No files were encrypted. Our attention then turned toward an important\nquestion: what, if any, data was stolen? To answer this question, we turned to the MEGAsync logs. In this\npost, we'll outline our analysis of these logs so you know what to look for if you find yourself on the wrong\nside of an extortion attempt.\n\nUh oh, MEGAsync does not belong here\n\n**What is MEGA?**\n\nMEGA is a legitimate cloud backup service that has become a favorite for RaaS threat groups. Their\nMEGAsync software works how you would expect it: you point it at folders and shared drives and it\nuploads those files up to the cloud. It installs like any other Windows application. Look for it installed in\nplaces like `C:\\Users\\`\n```\n<username>\\AppData\\Local\\MEGAsync\\MEGAsync.exe and C:\\ProgramData\\MEGAsync\\MEGAsync.exe .\n\n```\n**MEGA Log Analysis - Compression**\n\nMEGAsync's logs are stored in a \"logs\" folder in the same location as the MEGAsync.exe binary. With\nthe exception of the most recent active log file, the older logs are compressed using gzip. You can\ndecompress the logs using gunzip ( gunzip -S .log * ) or search them as-is using `zcat -`\n```\nf and zgrep .\n\n```\n\n-----\n\n**MEGA Log Analysis - Identifying Stolen Files**\n\nMEGA keeps track of the file successfully uploaded and logs the entries as \"Upload complete:\" We can\nsearch for these files using zgrep ( zgrep 'Upload complete' * ):\n\nTo count the number of uploaded files, pipe the zgrep results to wc and note the first number ( zgrep\n```\n'Upload complete' * | wc ):\n\n```\n\n-----\n\nHowever, this only gives us the filenames, not the full folder path and drives that those files came from.\nWe can identify the full file locations by reading the \"Async open finished\" events. We believe these\nevents are recorded as the files are queued but are not yet uploaded. These entries are important\nbecause they show the specific systems, folders, and files that the attacker targeted.\n\n**MEGA Log Analysis - Identifying Failed File Uploads**\n\nJust because a file was queued, does not mean the upload was successful. In our case, many files failed\nto upload after we severed the system's network connection. We can identify these failed uploads by\nsearching the logs for \"(UPLOAD) finished with error\"\n\n**MEGA Log Analysis - Identifying the Attacker's Account**\n\nAn interesting entry appears if you search for \"email\" or \"emails.\" Though we could not confirm it, the\nentry appears to reveal the yandex.ru email account that the attacker used to authenticate with MEGA.\n\n**Conclusion**\n\nExamining the MEGA logs is a useful for investigating data theft and and extortion incidents. If your\norganization does not have a legitimate business case for MEGA software, consider blocking it.\nConfigure EDR tools to detect or prevent its use. Set up network controls to block connections to its\nassociated domains, such as mega.co.nz, mega.io, and mega.nz.\n\nTags: [Security,](https://blog.reconinfosec.com/topic/security) [MEGAsync](https://blog.reconinfosec.com/topic/megasync)\n\n**Written by** **[Andrew Cook](https://blog.reconinfosec.com/author/andrew-cook)**\n\nDirector of Security Operations\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-21 - An Encounter With Ransomware-as-a-Service- MEGAsync Analysis.pdf"
    ],
    "report_names": [
        "2021-06-21 - An Encounter With Ransomware-as-a-Service- MEGAsync Analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535572,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653692313,
    "ts_modification_date": 1653692313,
    "files": {
        "pdf": "https://archive.orkl.eu/2a5bcfae4377679dd4283b4d02897128dfefeb79.pdf",
        "text": "https://archive.orkl.eu/2a5bcfae4377679dd4283b4d02897128dfefeb79.txt",
        "img": "https://archive.orkl.eu/2a5bcfae4377679dd4283b4d02897128dfefeb79.jpg"
    }
}