{
    "id": "6a1d5ca5-c07c-435d-82c5-fc81dd8ab215",
    "created_at": "2023-01-12T15:04:47.752325Z",
    "updated_at": "2025-03-27T02:05:46.488056Z",
    "deleted_at": null,
    "sha1_hash": "278827e9ddc37014baec8c83f6a12f543366a4bc",
    "title": "2020-10-29 - Egregor- Sekhmet’s Cousin",
    "authors": "",
    "file_creation_date": "2022-05-28T15:58:47Z",
    "file_modification_date": "2022-05-28T15:58:47Z",
    "file_size": 415410,
    "plain_text": "# Egregor: Sekhmet’s Cousin\n\n**[securityboulevard.com/2020/10/egregor-sekhmets-cousin/](https://securityboulevard.com/2020/10/egregor-sekhmets-cousin/)**\n\n[by Tomas Meskauskas on October 29, 2020](https://securityboulevard.com/author/tomas-meskauskas/)\n\n\nOctober 29, 2020\n\n\nThe year 2020 will be remembered none too fondly for several reasons. For much of the\nworld, the global pandemic that resulted in many countries going into lockdowns resulting in\nmassive disruptions to daily life will feature prominently in humankind’s shared memory for\nsome time. For the InfoSec community, it will be the unabashed use of the pandemic by\nhackers to further their goals. Moreso, the community will remember the year ransomware\ngangs became even more ruthless and began leaking data of those victims who refuse to\npay the ransom.\n\nIn a year that has already seen several new families cropping up, a new ransomware strain\nhas joined the ranks of those looking to apply increased pressure on victims by leaking\nsensitive and confidential data.\n\n\n-----\n\n## Egregor, Occult in Name\n\nThe name of the new ransomware strain, Egregor, is derived from Western Occult traditions\n[and is seen as the collective energy of a group of people, especially when aligned to a](https://occult-world.com/egregor/)\ncommon goal. The name is appropriate on some level, as ransomware gangs tend to be\naligned for the purpose of extorting funds from victims. This is certainly not a purpose for the\ncommon good, but nonetheless a purpose is a purpose and, as with practitioners of magic,\nno rule says they must be good. This rule most certainly applies to those behind Egregor.\n\nNot too much is known about the ransomware and the tactics employed by the gang, as\n[researchers are looking to reverse-engineer samples they have acquired. The first mention](https://twitter.com/demonslay335/status/1307056098596335628)\n[of the ransomware on a public forum occurred Sept. 18. Since then, researchers have begun](https://www.appgate.com/news-press/appgate-labs-analyzes-new-family-of-ransomware-egregor)\nto uncover the ransomware’s mysteries. What is currently agreed upon is that Egregor does\n[seem to be closely related to Sekhmet, which,](https://www.pcrisk.com/removal-guides/17443-sekhmet-ransomware) [being discovered in March, is older than its](https://twitter.com/fbgwls245)\ncousin by only a couple of months. According to researchers, the similarities between the\ntwo variants include similar tactics, obfuscation, API calls and ransom notes, to name a few.\n[Regarding Egregor technical details, researchers noted,](https://www.appgate.com/news-press/appgate-labs-analyzes-new-family-of-ransomware-egregor)\n\n“The sample we analyzed has many anti-analysis techniques in place, such as code\nobfuscation and packed payloads. Also, in one of the execution stages, the Egregor\npayload can only be decrypted if the correct key is provided in the process’ command\nline, which means that the file cannot be analyzed, either manually or using a sandbox,\nif the exact same command line that the attackers used to run the ransomware isn’t\nprovided. Furthermore, our team found the “Egregor news” website, hosted on the\ndeep web, which the criminal group uses to leak stolen data.”\n\n\n-----\n\nThe InfoSec community at large must be eagerly awaiting a technical writeup to better\ndefend networks against the threat posed by Egregor. However, this may be delayed—while\nthe ransomware employs the same level of sophisticated code and functionality as many of\nits rivals, it seems to have an ace in the hole preventing analysis. The ransomware boasts a\nhigh number of anti-analysis techniques including code obfuscation and payload encryption,\nmaking the reverse engineering process harder than what researchers wished. What is not\nshrouded in mystery is the tactic of threatening to release stolen data if ransomware\ndemands are not met within three days.\n\n## Victim Numbers Increasing\n\nAccording to the website used by Egregor to announce what data the group has stolen and\nproviding a small amount to prove the data’s origin, the gang has amassed 13 victims so far,\nthree of which have managed to make news headlines. It is important to note that two of the\nthree cases still need to be confirmed by the victims that they suffered a ransomware attack;\nhowever, there is a sufficient amount of evidence to suggest they have and Egregor may\nhave been the culprit.\n\nThe latest of these victims to make headlines was U.S. brick-and-mortar bookstore giant\n[Barnes and Noble. While the InfoSec community is still awaiting confirmation by the affected](https://www.zdnet.com/article/barnes-noble-confirms-cyberattack-customer-data-breach/)\ncompany, Barnes and Noble did make a statement to the public confirming a cyber incident\n[that may have compromised customer data. That being said, several researchers believe the](https://www.bleepingcomputer.com/news/security/barnes-and-noble-hit-by-cyberattack-that-exposed-customer-data/)\ncompany may have suffered a ransomware incident—in particular, Egregor. The assumption\nis based on several things, including how the company networks were affected, resulting in\nincreased periods of downtime preventing customers from accessing certain services.\n\nEgregor ransom-demanding message:\n\n\n-----\n\nFiles encrypted by this ransomware:\n\n\n-----\n\nTor website of Egregor ransomware:\n\n\n-----\n\n[The most convincing evidence, although rather strange, is the data released by the gang via](https://www.bleepingcomputer.com/news/security/barnes-and-noble-hit-by-egregor-ransomware-strange-data-leaked/)\ntheir leak site. As is often the case, ransomware gangs release data that can be easily\ntraceable to the victim as proof they indeed have done what they said they have. This\ninvariably means the leak of documents; however, the Egregor gang released two Windows\nRegistry hives supposedly taken from Barnes and Noble’s servers. The ransomware gang\ncontends that it successfully stole financial data about audits from the company; however,\nwhile the leak of the data indicates they in all likelihood may have been behind the attack,\nthe evidence is far from conclusive.\n\n[The other two victims to make headlines were games industry giants Crytek and Ubisoft. The](https://www.bleepingcomputer.com/news/security/crytek-hit-by-egregor-ransomware-ubisoft-data-leaked/)\nformer confirmed that it had been hit by a ransomware attack and nearly 400MB of data\nbelonging to the game’s developer have been released by the Egregor gang. The data\npertained to the company’s popular “Warface” first-person shooter and the now-canceled\n“Arena of Fate MOBA” game as well as some of the company’s network operations. The\ngang also claimed that it stole the source code for Ubisoft’s upcoming title “Watchdogs:\nLegion”; to prove the claim, the gang released 20MB of data it said is in-game assets for the\n\n\n-----\n\ngame. The assets themselves don t prove beyond a shadow of a doubt that they belong to\nUbisoft and could have been stolen from elsewhere. Ubisoft has not confirmed whether an\nincident did indeed take place; however, it is believed that Ubisoft employees have suffered\nfrom phishing attacks in the past. This, too, is speculation, as the company refuses to\nrespond to questions posed by both journalists and security researchers.\n\n## Egregor’s Cousin Sekhmet\n\nGiven how little the public knows about Egregor, it is wise to look at its cousin Sekhmet. The\n[name given to the ransomware is from Ancient Egyptian mythology, which says Sekhmet](https://en.wikipedia.org/wiki/Sekhmet)\nwas the warrior goddess of healing. Ancient Egyptian mythology has strong links to many\nWestern occult traditions, so at the very least the gang behind both appears to have a\nnaming convention in place. Sekhmet is older by a few months, but both share tactics such\nas leaking data from victims via a dedicated website. Unfortunately, as with Egregor,\ntechnical details about the ransomware strain are thin. At the time of writing, no information\nis available regarding how the malware is distributed, the infection chain or attack vectors.\n[Researchers believe that Sekhmet may be dropped by other malware or downloaded via](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom.win32.sekhmet.c/)\nmalicious websites, but little else about the ransomware is public knowledge.\n\nIn June, news emerged that two companies had suffered a Sekhmet infection. The first, IT\nfirm [Excis, was announced at the end of May by those operating the ransomware, who](https://www.databreaches.net/sekhmet-ransomware-team-claims-to-have-hit-international-it-firm-very-hard/)\nsubsequently released data supposedly belonging to the IT firm on its leak site called “leaks,\nleaks, leaks.” The operators released the data in response to the company director saying\nthat no important data was stolen. The second victim, SilPac, a gas handling solutions\ncompany based in Santa Clara, California, appeared to have been affected later in June; the\n[gang attacked the company twice in short succession. Again, the attacks were announced](https://www.itwire.com/security/criminals-use-sekhmet-ransomware-to-hit-gas-company-silpac-twice.html)\nvia Sekhmet’s leak site. It is believed that the attackers managed to retain a presence on the\nvictim’s network even after encryption occurred.\n\n## The Age of the Leak Site\n\nMany high-profile ransomware gangs that seemingly only target large corporate networks\noperate leak sites. The list seems to grow unabated from month to month. The flood of bad\nnews can leave individuals feeling helpless but, importantly, these attacks are preventable. In\nrecent months ransomware operators have targeted known vulnerabilities with VPN servers,\nand although these attacks have been well-publicized, some corporate networks are still\nvulnerable. Gaining access to a corporate network is now a big business, as “initial access\nbrokers” look to sell access to networks they have compromised. Ransomware operators are\npotential clients, with some even looking to bring in talent as affiliates who can compromise\nnetworks and then drop the ransomware payload.\n\n\n-----\n\nGiven the high number of high-profile victims that have emerged this year alone, this trend of\nnew ransomware strains creating leak sites is expected to continue for some time. Although\nthese attacks are preventable, some security researchers are suggesting that ransom\npayments be made illegal to try and curb the current threat posed by ransomware. The hope\nis that such laws would dissuade payments and dry up the profits generated by ransomware\ngangs. The call to make ransom payments may be extreme and seen as punishing the victim\nof the crime rather than the perpetrator, but measures to prevent these attacks seem to be\nfailing.\n\nRecent Articles By Author\n\n[More from Tomas Meskauskas](https://securityboulevard.com/author/tomas-meskauskas/)\n\n[October 28, 2020](https://securityboulevard.com/2020/10/egregor-sekhmets-cousin/) [Tomas Meskauskas](https://securityboulevard.com/author/tomas-meskauskas/) [Egregor,](https://securityboulevard.com/tag/egregor/) [Malware,](https://securityboulevard.com/tag/malware/) [Sekhmet](https://securityboulevard.com/tag/sekhmet/)\nFeatured eBook\n\n**Tomas Meskauskas**\n\nTomas Meskauskas - Internet security expert, editor of pcrisk.com website, co-founder of\nMac anti-malware application Combo Cleaner.\n\n[tomas-meskauskas has 22 posts and counting.See all posts by tomas-meskauskas](https://securityboulevard.com/author/tomas-meskauskas/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-29 - Egregor- Sekhmet’s Cousin.pdf"
    ],
    "report_names": [
        "2020-10-29 - Egregor- Sekhmet’s Cousin.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535887,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653753527,
    "ts_modification_date": 1653753527,
    "files": {
        "pdf": "https://archive.orkl.eu/278827e9ddc37014baec8c83f6a12f543366a4bc.pdf",
        "text": "https://archive.orkl.eu/278827e9ddc37014baec8c83f6a12f543366a4bc.txt",
        "img": "https://archive.orkl.eu/278827e9ddc37014baec8c83f6a12f543366a4bc.jpg"
    }
}