{
    "id": "6a372dea-6dad-48cf-b6c1-1743ef8fe3fc",
    "created_at": "2023-01-12T15:00:32.705023Z",
    "updated_at": "2025-03-27T02:11:39.859413Z",
    "deleted_at": null,
    "sha1_hash": "7a22331a988cdc12df7da73327548702cfeeb36a",
    "title": "2016-11-07 - Little Trickbot Growing Up- New Campaign",
    "authors": "",
    "file_creation_date": "2018-10-23T14:01:19Z",
    "file_modification_date": "2018-10-23T14:01:22Z",
    "file_size": 1982193,
    "plain_text": "_I am artificial intelligence._\n\n_The driving force behind the hunt for cyberattackers._\n\n_I am Cognito._\n\n# The hidden threat of cyberattacks in the energy and utilities industry\n\n## 2018 Spotlight Report\n\n\n-----\n\n#### TABLE OF CONTENTS\n\n##### Analysis and lifecycle of an attack on critical infrastructure.. . . . . . . . . . . . . . . . . 3\n\nCommand and control.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n\nInternal reconnaissance.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n\nLateral movement.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n\nTargeting the ICS and SCADA Infrastructure. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n\n##### Analysis of cyberattacker behaviors in the energy and utilities industry.. . . . . 4\n\n A chilling reminder to monitor the network for attacker behaviors.. . . . . . . . . . . 9\n\n About the Cognito platform from Vectra. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 9\n\n\n-----\n\n[Since at least March 2016, Russian government cyber](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\n[actors targeted government entities and multiple U.S. critical](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\n[infrastructure sectors, including the energy, nuclear, commercial](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\nfacilities, water, aviation, and critical manufacturing sectors.\n\nAn analysis by the U.S. Department of Homeland Security (DHS)\n\nand FBI provides insight into the attacker behaviors related to this\n\n[malicious activity. The report, Dragonfly: Western energy sector](https://www.symantec.com/blogs/threat-intelligence/dragonfly-energy-sector-cyber-attacks)\n\n_[targeted by sophisticated attack group, released by Symantec on](https://www.symantec.com/blogs/threat-intelligence/dragonfly-energy-sector-cyber-attacks)_\n\nSept. 6, 2017, provides additional information about this ongoing\n\ncyber campaign.\n\nUnfortunately, this is not new. But it highlights an important\n\ndistinction in attacks that target the energy and utilities industry.\n\nThere is a difference between attacks that probe IT networks for\n\ninformation and access about critical infrastructure versus attacks\n\nagainst the industrial control system (ICS) on which the critical\n\ninfrastructure operates. The two are interconnected, but the\n\ntargeted assets are different.\n\nCybercriminals have been testing and mapping-out attacks\n\nagainst energy and utilities networks for years. These slow, quiet\n\nreconnaissance missions involve observing operator behaviors and\n\nbuilding a unique plan of attack. The attack that shut down the\n\nUkraine power grid in 2015 was reportedly planned many months\n\nin advance by highly skilled and sophisticated cybercriminals.\n\nAlthough the ICS is in the crosshairs, most attacks against\n\nthe energy and utilities industry occur and succeed inside the\n\nenterprise IT network – not in the critical infrastructure.\n\nThis underscores the importance of identifying hidden attackers\n\ninside IT networks before they cause damage to the ICS and steal\n\ncritical infrastructure blueprints. This spotlight report focuses on\n\nthose specific cyberattacker behaviors as they relate to the latest\n\nattack campaigns used to steal vital ICS information.\n\n#### Analysis and lifecycle of an attack on critical infrastructure\n\n[A U.S. government alert known as TA18-074A, released by the](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\nDHS computer emergency readiness team in March 2018, outlines\n\nRussian government cyber activity targeting energy and other\n\ncritical infrastructure sectors.\n\nThe attack campaign detailed in TA18-074A involves two\n\ncategories of victims: Staging and intended targets. The initial\n\nvictims are peripheral organizations such as trusted third-party\n\nsuppliers with less secure networks. Threat actors used the\n\nstaging targets’ networks as pivot points and malware repositories\n\nwhen targeting their final intended victims.\n\n\nThe National Cybersecurity & Communications Integration\n\nCenter (NCCIC), which is part of the DHS, and the FBI\n\ndetermined that the objective of this attack was to compromise\n\norganizational networks.\n\n##### Command and control\n\nTo carry out this attack, threat actors created web shells on the\n\nintended targets’ publicly accessible email and web servers.\n\nThey used three different file names – global.aspx, autodiscover.\n\naspx and index.aspx – for two different web shells. The difference\n\nbetween the two groups was the public-string password field.\n\nThe DHS and FBI determined that threat actors leveraged\n\nremote access services and infrastructure such as VPN, Remote\n\nDesktop Protocol (RDP) and Outlook Web Access (OWA). Threat\n\nactors used the infrastructure of staging targets to connect to\n\nseveral intended targets. This command-and-control behavior is\n\n_known as external remote access._\n\n##### Internal reconnaissance\n\nUpon gaining access to the intended victims, the threat actors\n\nlaunched reconnaissance operations inside the network. DHS\n\nobserved the threat actors identifying and browsing file servers\n\nwithin the intended victim’s network. These reconnaissance\n\n_behaviors are known as file-share enumeration and RDP recon._\n\n##### Lateral movement\n\nOnce inside the targeted network, threat actors used privileged\n\ncredentials to access the victim’s domain controller, typically using\n\nRDP. Once on the domain controller, threat actors used dc.bat\n\nand dit.bat batch scripts to enumerate host devices, users and\n\nadditional information about the environment. This type of lateral\n\n_movement behavior is known as suspicious admin._\n\nIn at least two instances, threat actors used batch scripts\n\nlabeled pss.bat and psc.bat to run the PsExec tool. In addition,\n\nthreat actors changed the name of the PsExec tool to ps.exe.\n\n_This type of lateral movement behavior is known as suspicious_\n\n_remote execution._\n\n##### Targeting the ICS and SCADA Infrastructure\n\nIn multiple instances, threat actors accessed workstations and\n\nservers on a corporate network that contained data output from\n\nthe ICS inside energy generation facilities. This involved suspicious\n\n_admin and suspicious Kerberos account behaviors._\n\n\n-----\n\nThe threat actors accessed files pertaining to ICS or supervisory\n\ncontrol and data acquisition (SCADA) systems. Based on a DHS\n\nanalysis of existing compromises, these file names included ICS\n\nvendor labels and ICS reference documents pertaining to the\n\norganization, such as SCADA WIRING DIAGRAM.pdf and SCADA\n\n_PANEL LAYOUTS.xlsx. These types of actions are known as data_\n\n_smuggler behaviors._\n\n[Figure 1: In the federal alert known as TA18-074A, the DHS reconstructed samples of data](https://www.us-cert.gov/ncas/alerts/TA18-074A)\nextracted from energy and utilities organizations by attackers\n\n\n#### Analysis of cyberattacker behaviors in the energy and utilities industry\n\nThe information in this spotlight report is based on observations\n\n[and data from the 2018 Black Hat Edition of the Attacker Behavior](https://info.vectra.ai/abir-2018-blackhat-edition)\n\n[Industry Report from Vectra[®]. The report reveals attacker behaviors](https://info.vectra.ai/abir-2018-blackhat-edition)\n\nand trends in networks from over 250 opt-in customers in\n\nmanufacturing and eight other industries.\n\nFrom January-June 2018, the Cognito™ cyberattack-detection\n\nand threat-hunting platform from Vectra monitored network\n\ntraffic and collected rich metadata from more than 4 million\n\ndevices and workloads from customer cloud, data center and\n\nenterprise environments.\n\nThe analysis of this metadata provides a better understanding\n\nabout attacker behaviors and trends as well as business\n\nrisks, enabling Vectra energy and utilities customers to avoid\n\ncatastrophic data breaches.\n\n|Col1|Col2|\n|---|---|\n|Command and Control||\n|||\n|External Remote Access (194 detections) Attackers installed tools to carry out operations against intended victims including VPN, RDP, and OWA||\n\n|Col1|Col2|\n|---|---|\n|Reconnaissance||\n|||\n|File Share Enumeration (93 detections) RDP Recon (54 detections) Attackers identified file servers within the network; enumerated hosts, users, and additional environmental data||\n\n|Col1|Col2|\n|---|---|\n|Lateral Movement||\n|||\n|Suspicious Remote Execution (314 detections) Suspiciuos Admin (37 detections) Suspiciuos Kerberos Account (2 detections) Attackers used priviledged credentials to access domain controllers via RDP, accessed workstations and servers containing data output from control systems||\n\n|Col1|Col2|\n|---|---|\n|Exfiltration||\n|||\n|Data Smuggler (293 detections) Attackers accessed files pertaining to ICS or SCADA||\n\n\nFigure 2: Monthly number of attacker behaviors in the energy and utilities industry per 10,000 devices and workloads\n\nThe Cognito platform observed that cyberattackers used the same types of threat behaviors to spy, spread, and steal data from energy\n\nand utilities enterprise networks. Every industry has a profile of network and user behaviors specific to their industry because of their\n\nbusiness model, applications and processes. These behavior profiles allow attackers to hide, making it difficult for anomaly detection to\n\nsucceed because their behaviors blend in with traffic from legitimate users.\n\n\n-----\n\n### Command-and-control attacker behaviors\n\n600\n\n500\n\n400 18\n\n29\n\n300 108\n\n200 66\n\n100\n\n\n0\n\n\nAll Industries\n\n\nEnergy and Utilities\n\n\nExternal Remote Access Hidden DNS CnC Tunnel Hidden HTTP CnC Tunnel\n\nHidden HTTPS CnC Tunnel Malware Update Peer-to-Peer Pulling Instructions\n\nStealth HTTP Post Suspicious Relay Threat Intelligence Match CnC TOR Activity\n\nFigure 3: Command-and-control attacker behaviors in the energy and utilities industry per 10,000 host devices\n\nEvery cyberattack begins with some form of command and control, and one of the most dangerous forms is external remote access. The\n\nCognito platform detected 194 command-and-control attack behaviors for every 10,000 host devices inside energy and utilities networks, as\n\nshown in Figure 3.\n\nWith external remote access, attackers directly control host devices rather than using an automated form of command and control. External\n\nremote access behaviors can involve internal host devices connecting to an external server. In this case, the traffic pattern is inverse from\n\nnormal client-to-server traffic. Clients receive instructions from the server and a human on the outside controls the exchange.\n\nEnergy and utilities organizations use forms of remote access technology to improve productivity and it can be a legitimate command-and\ncontrol behavior. However, the presence of remote network access traffic introduces a risk because it enables attackers to blend in while\n\nperforming the same types of external remote access for nefarious deeds. This is especially true when attackers leverage commonly-used\n\nremote access tools like FortiClient VPN.\n\n\n-----\n\n### Internal reconnaissance attacker behaviors\n\n1000\n\n800\n\n57\n\n600\n\n192\n\n400\n\n140\n\n54\n\n200\n\n\n0\n\n\nAll Industries\n\n\nEnergy and Utilities\n\n\nFile Share Enumeration Internal Darknet Scan Kerberos Account Scan Port Scan\n\nPort Sweep RDP Recon SMB Account Scan Suspicious LDAP Query\n\nFigure 4: Reconnaissance attacker behaviors in the energy and utilities industry per 10,000 host devices\n\nReconnaissance inside a network is a precursor to the more risky and damaging stages of active attacks that ultimately exposes an\n\norganization to the substantial risk of data acquisition and exfiltration.\n\nThe two most prevalent reconnaissance behaviors in the DHS report are file-share enumeration and RDP recon activity. As shown in Figure\n\n4, the Cognito platform detected 93 file-share enumeration attempts in energy and utilities per 10,000 host devices and workloads. RDP\n\nrecon activity occurred 54 times per 10,000 host devices and workloads.\n\nFile-share enumeration behaviors occur when a host device accesses inordinately more file-shares than normal. Enumeration might\n\nindicate a host device is accessing many file-shares as a user attempts to find a file or directory. However, enumerating file-shares on a\n\nnetwork is also an effective way for attackers to find data to exfiltrate or data that helps further the attack.\n\nIn conjunction with file-share enumeration, a scan via RDP is an effective way for an attacker to determine the accounts available within\n\nan organization’s network and the RDP servers that accept logins via the accounts. File-share enumeration and RDP reconnaissance are\n\nquiet, less noticeable forms of reconnaissance behavior than port sweeps or port scans. As a result, attackers often feel they can use\n\nthese tools with relatively low risk of detection.\n\n\n-----\n\n### Lateral movement attacker behaviors\n\n1200\n\n1000\n\n800\n\n113\n\n600\n\n139\n\n400 48\n\n152\n\n200\n\n\n0\n\n\nAll Industries\n\n\nEnergy and Utilities\n\n\nAutomated Replication Brute-Force Attack (internal) Kerberos Brute Force Kerberos Server Access\n\nShell Knocker Client Shell Knocker Server SMB Brute-Force Attack\n\nSQL Injection Activity Suspicious Admin Suspicious Kerberos Account\n\nSuspicious Kerberos Client Suspicious Remote Execution Threat Intelligence Match Lateral\n\nFigure 5: Lateral movement attacker behaviors in the energy and utilities industry per 10,000 host devices\n\nLateral movement inside a network exposes a larger attack surface to cybercriminals and substantially increases the risk of data acquisition\n\nand data exfiltration.\n\nUnexplained and unusual patterns of use of host devices, domain controllers and services are involved in almost all major breaches.\n\nAttacks carried out by insiders will often exhibit unusual patterns of use as well.\n\nThe compromised host devices and services accessed provide perspective on the potential business impact. As reported by the\n\n[TA18-074A alert issued by the DHS, the most common lateral movement behaviors inside energy and utilities companies were suspicious](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\nremote execution.\n\nAs shown in Figure 5, the Cognito platform detected 314 suspicious remote execution behaviors per 10,000 workloads and devices. The\n\nsuspicious use of Kerberos accounts was detected two times per 10,000 host devices and workloads, while suspicious administrative\n\nactivity was observed 37 times per 10,000 host devices and workloads.\n\nLateral movement via remote execution is a key element of many different attacks and the server message block (SMB) channel allows the\n\ncopying of executables and executing them via remote procedure call (RPC). Systems that are authorized to perform remote execution\n\nshould be monitored because they enable attackers to hide in plain sight.\n\n\n-----\n\nA Kerberos account is suspicious when it is used differently than expected in one or more ways. This includes connecting to unusual\n\ndomain controllers, using unusual host devices and accessing unusual services, or generating unusual volumes of Kerberos requests using\n\nnormal domain controllers, usual host devices and usual services.\n\nMore importantly, administrative protocols are a favorite tool of attackers because they allow cybercriminals to move laterally inside\n\nnetworks where they have already established a durable foothold.\n\nBecause administrative connections are typically used in conjunction with administrative credentials, attackers often have unconstrained\n\naccess to systems and data that are critical to energy and utilities organizations. Unexpected and unexplained administrative connections\n\nrepresent a huge potential risk in the lifecycle of a major breach.\n\n### Data exfiltration attacker behaviors\n\n450\n\n22\n\n400\n\n37\n\n350\n\n105 65\n\n300\n\n250\n\n92\n\n200\n\n150 293\n\n100\n\n173\n\n50\n\n0\n\nAll Industries Energy and Utilities\n\nData Smuggler Hidden DNS Exfil Tunnel Hidden HTTP Exfil Tunnel\n\nHidden HTTPS Exfil Tunnel Smash and Grab\n\nFigure 6: Exfiltration attacker behaviors in the energy and utilities industry per 10,000 host devices\n\nEnergy and utilities networks exhibit significant behaviors in which internal host devices acquire large amounts of data from one or more\n\ninternal servers and send large amounts of data to an external system.\n\nThese behaviors alone do not necessarily indicate an attack. An attack is likely when exfiltration behaviors correlate with other attacker\n\nbehaviors in different phases of the attack lifecycle, such as command and control, reconnaissance or lateral movement. It is also critical to\n\nensure that systems communicate only to approved locations.\n\nAs shown in Figure 6, these exfiltration behaviors, described as data smuggler, were detected by the Cognito platform inside energy and\n\nutilities networks 293 times per 10,000 host devices and workloads.\n\n\n-----\n\nTo understand if these potential threat behaviors are of concern,\n\nthe internal servers from which the data was retrieved can provide\n\nsome indication of the type of data that was acquired. If those\n\nservers contain valuable information and the external service to\n\nwhich data was uploaded is not an IT-authorized service, the\n\npotential business risk is exceptionally high.\n\n#### A chilling reminder to monitor the network for attacker behaviors\n\nMonitoring the network for attacker behaviors may provide the only\n\nclues to tracking their steps since the attacker may have erased\n\nevidence on endpoints as well as logs.\n\n[Based on the TA18-074A alert released by the DHS about the](https://www.us-cert.gov/ncas/alerts/TA18-074A)\n\nRussian government attack campaign against energy and other critical\n\ninfrastructure sectors, threat actors in multiple instances created new\n\naccounts on staging targets to perform cleanup operations.\n\nThe accounts were used to clear the following Windows event logs:\n\nSystem, security, terminal services, remote services, and audit. The\n\nthreat actors also removed applications they installed while they were\n\nin the network along with any logs produced.\n\nFor example, the Fortinet client installed at one commercial facility was\n\ndeleted along with the logs that were produced from its use. Finally,\n\ndata generated by other accounts used on the accessed systems\n\nwere deleted.\n\nThreat actors cleaned up the target networks by deleting created\n\nscreenshots and specific registry keys. Through forensic analysis,\n\nthe DHS determined that threat actors deleted the registry key\n\nassociated with a terminal server client that tracks connections\n\nmade to remote systems. Threat actors also deleted all batch scripts,\n\noutput text documents and tools they brought into the environment,\n\nsuch as scr.exe.\n\n\n#### About the Cognito platform from Vectra\n\nTo combat attacks in the energy and utilities industry, the Cognito\n\nplatform from Vectra inspects rich metadata from all network\n\ntraffic to identify attacker behaviors in real time, even when\n\ncybercriminals try to cover their tracks.\n\nThe Cognito platform uses AI – including supervised and\n\nunsupervised machine learning techniques – to perform non-stop,\n\nautomated threat detection. Always-learning behavioral models\n\nare driven by AI to quickly and efficiently find hidden and unknown\n\nattackers before they do damage. Cognito provides full visibility\n\ninto attacker behaviors, from cloud and data center workloads to\n\nuser and internet-of-things devices, leaving attackers with nowhere\n\nto hide.\n\nCognito Detect™ and its AI counterpart, Cognito Recall™, are the\n\ncornerstones of the Cognito platform. Cognito Detect automates\n\nthe real-time detection of hidden attackers while giving Cognito\n\nRecall a logical starting point to perform AI-assisted threat hunting\n\nand conclusive incident investigations.\n\nTo learn more about other cyberattacker behaviors seen in real\nworld cloud, data center and enterprise environments, get the\n\n[2018 Black Hat Edition of the Attacker Behavior Industry Report](https://info.vectra.ai/abir-2018-blackhat-edition)\n\nfrom Vectra.\n\n\n-----\n\n_I am artificial intelligence._\n\n_The driving force behind the hunt for cyberattackers._\n\n_I am Cognito._\n\n**Email info@vectra.ai  Phone +1 408-326-2020**\n[vectra.ai](http://vectra.ai)\n\n© 2018 Vectra Networks, Inc. All rights reserved. Vectra, the Vectra Networks logo, Security that thinks and Cognito are registered trademarks and Cognito Detect, Cognito Recall, the Vectra Threat\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Vectra - Hidden Threat of Cyberattacks in the Energy and Utilities Industry - 2018.pdf"
    ],
    "report_names": [
        "Vectra - Hidden Threat of Cyberattacks in the Energy and Utilities Industry - 2018.pdf"
    ],
    "threat_actors": [
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535632,
    "ts_updated_at": 1743041499,
    "ts_creation_date": 1540303279,
    "ts_modification_date": 1540303282,
    "files": {
        "pdf": "https://archive.orkl.eu/7a22331a988cdc12df7da73327548702cfeeb36a.pdf",
        "text": "https://archive.orkl.eu/7a22331a988cdc12df7da73327548702cfeeb36a.txt",
        "img": "https://archive.orkl.eu/7a22331a988cdc12df7da73327548702cfeeb36a.jpg"
    }
}