{
    "id": "6a75c5f4-5b92-4ecc-aa2c-66206a42643c",
    "created_at": "2023-01-12T14:58:54.508887Z",
    "updated_at": "2025-03-27T02:08:41.095293Z",
    "deleted_at": null,
    "sha1_hash": "f616ab7a9db9a7de22fdeb7a567f865dfa747c52",
    "title": "2019-10-02 - Malware Tales- FTCODE",
    "authors": "",
    "file_creation_date": "2022-05-28T15:18:34Z",
    "file_modification_date": "2022-05-28T15:18:34Z",
    "file_size": 2112421,
    "plain_text": "# Malware Tales: FTCODE\n\n**certego.net/en/news/malware-tales-ftcode/**\n\n**Date:**\n2 October 2019\n\nHi everyone! Today we are talking about a new ransomware we spotted being distributed in\nthe wild dubbed as FTCODE.\n\n## Summary\n\n 1. The Threat\n\nMalicious actors are evolving and trying new ways to infect computers.\n\nAt the start of this year, a specific actor started to leverage a legitimate certified mail service,\nmainly used in Italy, called PEC [(Wikipedia). This service is particularly trusted by its users](https://en.wikipedia.org/wiki/Certified_email)\nand is commonly used to deliver electronic invoices. Therefore, it’s of special interest\nbecause it’s easier to lure potential victims with malicious emails that refer to fake invoices.\n\nUntil the last week, the Gootkit banker was delivered as the final payload of the infection\n[chain. (Certego Gootkit analysis)](https://www.certego.net/en/news/malware-tales-gootkit/)\n\n\n-----\n\nDuring this year, the way to deliver this threat changed: they started to leverage a new\nsimple but effective downloader dubbed as JasperLoader to deliver upgrades and additional\n[modules when needed. (Talos research).](https://blog.talosintelligence.com/2019/04/JasperLoader-targets-italy.html)\n\nHowever, even if sophisticated, Gootkit is old malware. Also, it does not monetize fast and\ndoes require special interaction by the user. So, they have started experimenting with\nransomware, maybe to understand if they can get more from this kind of infection.\n\nWe are talking about a raw ransomware fully written in Powershell code, called FTCODE.\n\nEven if the name could seem new, the first appearance of this threat was in 2013, as stated\nby [Sophos. Then, almost nothing was seen for about 6 years. Strange, but we have to](https://nakedsecurity.sophos.com/2013/03/05/russian-ransomware-windows-powershell/)\nremember that technology changes. Windows XP was widespread at that time and, by\ndefault, Powershell is installed only from Windows 7 on. That can be a problem because\nactors need to install powershell itself before running ransomware. Also, cyber security was\nnot mature as it is nowadays so, for instance, classic Zeus-like bankers were more effective.\n\nIndeed, last year we saw the arrival of a new downloader and backdoor written in Powershell\n[that was called sLoad and it’s still being actively distributed (Certego sLoad analysis).](https://www.certego.net/en/news/sload-hits-italy-unveil-the-power-of-powershell-as-a-downloader/)\n\n_KISS (“keep it simple and stupid”) they teach you during software engineering courses. So,_\nwhy strive with sophisticated malware when with a bunch of code written in Powershell you\ncan perform every kind of wickedness?\n\nSo let’s dive in more technical details to understand how FTCODE works.\n\nMainly we analyzed two samples from two different campaigns:\n\nversion 930.5, md5: a5af9f4b875be92a79085bb03c46fe5c, day: 01/10/2019\nversion 1001.7, md5: 8d4c81e06b54436160886d78a1fb5c38, day 02/10/2019\n\n## 2.Payload Delivery\n\nAs stated before, the user receives an email that refers to a fake invoice with an attached\ndocument called \"Fattura-2019-951692.doc\". The threat actor leverages a commonly used\n[template to trick the user to disable the “Protected View” mode and to trigger the execution of](https://en.wikipedia.org/wiki/Microsoft_Office_2010#Protected_View)\nthe malicious macro.\n\n\n-----\n\nOnce enabled, the macro runs and spawns the following Powershell process:\n\nThe result is the download of a piece of Powershell code that is run using the \"Invoke_Expression\" command (“iex”). Note that the function “DownloadString” saves the result of the_\nrequest only in memory, in an attempt to avoid antivirus detection.\n\nThe new Powershell code is FTCODE itself. On execution, it performs the following GET\nrequest:\n\nto download a Visual Basic Script file and save it in\n_\"C:\\Users\\Public\\Libraries\\WindowsIndexingService.vbs\"._\n\nThis is a variant of JasperLoader, a simple backdoor that is able to download further\npayloads.\n\nThen, it tries to create a shortcut file called \"WindowsIndexingService.lnk\" in the user's\nstartup folder that runs the JasperLoader. Finally, to achieve persistence after reboot, it\ncreates a scheduled task called \"WindowsApplicationService\" pointing to the shortcut file.\n\n## 3. Environment Preparation\n\nAfter having installed the JasperLoader backdoor, FTCODE starts to prepare the\nenvironment for the ransomware attack.\n\n\n-----\n\nIt verifies if the file C:\\Users\\Public\\OracleKit\\w00log03.tmp exists. If yes, it would check the\npresence of some files with the extension \".FTCODE\" in all the drives with at least a free\nspace of 50 KB. If there are some, it means that the machine was already attacked by the\nransomware, maybe by a previous version: therefore, it would exit.\n\nDe facto, this indicator can be used to “vaccinate” the endpoints from this threat. It’s enough\nto create the mentioned file with any kind of content to let FTCODE believe that the computer\nwas already infected.\n\nAfterwards it generates a random globally unique identifier (GUID) and a password\nconsisting of 50 characters with at least 4 non-alphanumeric characters.\n\nThen we found a hardcoded RSA public key that is used to encrypt the password. In this way\nthe password cannot be deciphered without the proper private key controlled by the\nmalicious actor and can be sent, in a secure way, to the attacker’s server.\n\nSurprisingly, the encrypted password, after being generated, is never used elsewhere in the\ncode and, instead, is just sent the basic base64-encoded password to the attacker’s server.\n\nThe consequence is that, if the traffic against the attacker’s server is being monitored,\n**it’s possible to retrieve the key that will be used to decipher the files, without paying**\n**any ransom.**\n\nWe believe that this mistake will be corrected in future versions.\n\nAfter that error, FTCODE performs a POST request to the following URL:\n\nwith the following parameters:\n\n\n-----\n\n**ver=930.5, version number**\n**vid=dpec2, probably to identify the campaign**\n**psver=Powershell Major Version, probably to understand if FTCODE needs an update**\nfrom JasperLoader\n**guid=the GUID generated previously, to identify the victim**\n**ek=the previously generated password encoded in base64**\n\nif the server response is \"ok\", it creates the file \"C:\\Users\\Public\\OracleKit\\w00log03.tmp\"\ncontaining the GUID. If the server response is different, it would exit. This is another\nprotection mechanism to evade execution in simulated environments.\n\nAfterwards, it tries to run the following commands that are commonly used by almost every\nransomware to avoid the chance that the victim can recover the encrypted files without\npaying:\n\n[Similar behaviour is performed by Sodinokibi: Certego blog](https://www.certego.net/en/news/malware-tales-sodinokibi/#preparation)\n\n## 4. Ransomware Attack\n\nAt this moment, everything is ready to perform the real attack phase.\n\n**FTCODE checks for all the drives with at least 50 KB of free space and it looks for all the**\nfiles with the following extensions:\n```\n.sql,.mp4,.7z,.rar,.m4a,.wma,.avi,.wmv,.csv,.d3dbsp,.zip,.sie,.sum,.ibank,.t13,.t12,.q\n\n```\nThen, it encrypts the first 40960 bytes of each of them using the “Rijndael symmetric key\nencryption”. The key is created based on the previous generated key and the hardcoded\nstring “BXCODE hack your system”. The initialization vector is also based on another\nhardcoded string (\"BXCODE INIT\").\n\nFinally it appends the extension \".FTCODE\" and creates the file \"READ_ME_NOW.htm\" in\nthe folders that contain the encrypted files. We are talking about the classic ransom note with\ninstructions on how to recover the encrypted file.\n\n\n-----\n\n## 5.Version changes\n\nWe believe that this ransomware is in active development. Just one day after the delivery of\nthe version 930.5, we saw another version distributed (1001.7). Malware authors noticed\nthat, in the first version, there was no mechanism to tell the threat actors if the file encryption\nwas successful or not. So, they added other 2 lines of code that trigger other 2 C&C POST\nrequests with the following new parameters:\n\n**status=”start” or “done”**\n**res=number of successfully encrypted files**\n\n## Conclusion\n\nActors change their tactics faster and faster. But we understood that they could be lazy and\nthey can make mistakes too. They are humans after all.\n\nSome of them are starting to prefer ransomware like FTCODE over classic infostealers and\n_bankers._\n\nAlso, we found that, monitoring the network traffic, it’s possible to retrieve they key\n**used to encrypt the files.**\n\nSo, it’s important to continuously monitor your own assets, both on a network and an\nendpoint level, to fight against these kind of threats.\n\n**Certego Threat Intelligence Team has been studying upcoming cyber threats for years in**\norder to provide the best protection to their customers.\n\n**Suricata IDS signatures**\n\n\n-----\n\n```\nalert http $EXTERNAL_NET any > $HOME_NET any (msg: CERTEGO TROJAN FTCODE Payload\nRequest\"; flow:to_client; content:\"FTCODE\"; http_server_body; nocase;\ncontent:\"vssadmin\"; http_server_body; nocase;\nreference:url,www.certego.net/it/news/malware-tales-ftcode/; classtype:trojanactivity; sid:9000999; rev:1;)\nalert http $HOME_NET any -> $EXTERNAL_NET any (msg:\"CERTEGO TROJAN FTCODE\nRegistration Request\"; flow:to_server; content:\"POST\"; http_method; content:\"vid=\";\nhttp_client_body; content:\"psver=\"; http_client_body; content:\"guid=\";\nhttp_client_body; content:\"ek=\"; http_client_body;\nreference:url,www.certego.net/it/news/malware-tales-ftcode/; classtype:trojanactivity; sid:9000998; rev:1;)\n\n```\n**IoC**\n```\nC:\\Users\\Public\\OracleKit\\w00log03.tmp\nC:\\Users\\Public\\OracleKit\\AFX50058.tmp\nhome.southerntransitions[.]net\nconnect.southerntransitions[.]com\nhome.selltokengarff[.]com\nhome.ktxhome[.]com\nconnect.simplebutmatters[.]com\nqvo5sd7p5yazwbrgioky7rdu4vslxrcaeruhjr7ztn3t2pihp56ewlqd[.]onion\n\n```\n**About the authors**\n\n**[Matteo Lodi, Threat Intelligence Lead Engineer (Twitter)](https://twitter.com/matte_lodi)**\n\n**[Marco Bompani, Security Analyst (Twitter)](https://twitter.com/BompaniMarco)**\n\nLicense:\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives\n4.0 International License.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-02 - Malware Tales- FTCODE.pdf"
    ],
    "report_names": [
        "2019-10-02 - Malware Tales- FTCODE.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535534,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653751114,
    "ts_modification_date": 1653751114,
    "files": {
        "pdf": "https://archive.orkl.eu/f616ab7a9db9a7de22fdeb7a567f865dfa747c52.pdf",
        "text": "https://archive.orkl.eu/f616ab7a9db9a7de22fdeb7a567f865dfa747c52.txt",
        "img": "https://archive.orkl.eu/f616ab7a9db9a7de22fdeb7a567f865dfa747c52.jpg"
    }
}