{
    "id": "6ac959c2-4755-4e53-adad-b4b8720402e1",
    "created_at": "2023-01-12T15:00:41.536907Z",
    "updated_at": "2025-03-27T02:05:37.702665Z",
    "deleted_at": null,
    "sha1_hash": "9316826bc775299890f4956dcb92224b09d5bcad",
    "title": "2021-12-23 - Snip3, an investigation into malware",
    "authors": "",
    "file_creation_date": "2022-05-28T03:37:28Z",
    "file_modification_date": "2022-05-28T03:37:28Z",
    "file_size": 3416153,
    "plain_text": "# Snip3, una investigación sobre malware\n\n**[empresas.blogthinkbig.com/snip3-investigacion-malware/](https://empresas.blogthinkbig.com/snip3-investigacion-malware/)**\n\nDecember 23, 2021\n\n**Snip3 es considerado como un loader de Remote Access Tool o comúnmente conocido**\ncomo RAT, el cual, es un tipo de malware muy utilizado que tiene el potencial de ganar\npersistencia en un sistema y mantener una comunicación con un host atacante que tendrá\nacceso total a nuestro equipo y, por ende, a nuestra red para realizar cualquier tipo de\nactividad, desde robo de credenciales, hasta movimientos laterales o ejecuciones de\n_malwares más peligrosos. Hizo su aparición en el primer trimestre del año 2021, el cual, ha_\natacado a importantes compañías de viajes y transportes en los últimos meses.\n\nDefinido como Crypter-as-a-Service, el cual, nos indica que es un malware que estará en\n**continua actualización y de la cual, podremos encontrar muchas versiones durante el**\npaso de los meses. Está caracterizado por diferentes técnicas de evasión y técnicas AntiAnálisis. Contiene un gran potencial para escapar de los sistemas y ejecutar diferentes\ntipos de RAT, estando entre los más comunes Revenge RAT, Agent Tesla o AsyncRAT.\n\nLas características más importantes que caracterizan al Snip3 son:\n\nLa evasión de técnicas de análisis o de herramientas para analizar el malware\nLa conexión con dominios maliciosos utilizados como Command and Control\nLa ejecución de código malicioso en otros procesos con técnicas como el Process\nHollowing.\n\n\n-----\n\n## Vector de entrada\n\nEl Snip3 es un malware cuyo origen puede ser diverso, desde la descarga hecha a través\nde un dominio malicioso, phishing o ser lanzado por otro malware.\n\nEn este caso, fue introducido en disco a través del correo, en el cual, se intentaba\ninvitar de manera fraudulenta a la víctima, en los datos adjuntos, podremos encontrar un\n_link que parece que nos llevará al documento, el cual, es un Visual Basic Script (vbs), que_\nserá el que realice las acciones iniciales.\n\nTras la apertura del supuesto pdf, nos llevará a una dirección en la cual se descargará de\nmanera automática el fichero y se ejecutará, una vez el vbs se encuentre en el disco, el\n**Snip3 creará otros archivos y generará persistencia para que el vector de entrada**\n**sea un éxito y poder mantenerse el mayor tiempo posible en nuestro equipo para ejecutar**\nun RAT en el que el atacante podrá acceder al equipo.\n\n## Snip3\n\n\n-----\n\nEste malware está divido en varias partes, el resumen de como funcionaría es el siguiente:\n\n**Tras la descarga del script obtenido normalmente por phishing o por un dominio**\nmalicioso, se obtendrá un Visual Basic Script (vbs).\nTras esto, se ejecutará el VBS, el fichero creará un Powershell y lo iniciará.\nPosteriormente, este Powershell (PS | PS1) cargará los binarios e introducirá en\nstartup ganando persistencia el siguiente vbs.\nTras esto, el vbs cargado, ya podrá lanzar el ps1, y se ejecutará el RAT, el cual es\ninyectado en un proceso, en nuestro caso lo hará en RegAsm.exe.\nTras la ejecución del RAT, tratará de evitar ser analizado con diferentes técnicas\nAnti-debug, Anti-VirtualMachine y/o Anti-Sandbox, generará otros ficheros,\npersistencia y realizará tareas de red intentando acceder a dominios y que el\natacante acceda.\n\n## Primer Stage: VBS\n\n\n-----\n\nTras la entrada de este script al equipo, será el encargado de crear el Powershell, que,\nejecutará cambios de formato, pero son operaciones para posteriormente tratar la cadena\nDA, en la cual veremos que los caracteres utilizados se reemplazaran por binario, que\ncontiene el fichero que posteriormente ejecutará.\n\nTras esto, vemos que generará un objeto con un CLSID que más tarde lanzará, además,\ncreará el ps1 que veremos posteriormente y, hará el cambio a binario, para la variable DA,\nque hemos visto. Cabe destacar, que una de las características de este malware es la\nutilización del parámetro RemoteSigned, el cual, es usado para permitir la ejecución de\nficheros que no están firmados digitalmente utilizando Powershell.\n\nEl CLSID {72C24DD5-D70A-438B-8A42-98424B88AFB8},pertenece al identificador de\n_Windows Script Host Shell Object, es, una forma más de ejecutar algo sin que genere_\nmucho ruido en el sistema de detección que tengamos.\n\n## Segundo stage: Powershell\n\nUna vez el malware tiene preparado el PS1, lo ejecutará, vemos que contiene los PE\n(Portable Ejecutable) que usará después, en un primer momento, cargará los binarios, las\nrutas usando RegAsm y el startup.vbs\n\n\n-----\n\nVeremos que la ruta será la de startup, por lo que ha ganado persistencia con este\nmovimiento y siempre que encendamos el ordenador, se reiniciará la ejecución del vbs.\n\nTras esto, ejecutará un load de uno de los PE que ha definido anteriormente. El valor que\nlanzará después no es otro que RegAsm, el cual, previamente habrá inyectado en este\nproceso, lo que hará es introducir bytes que pertenecen al malware en un proceso legítimo,\nde este modo, solo veremos un proceso utilizado por .NET ejecutándose.\n\nCuando miremos en RegAsm.exe los módulos que tiene cargados, podemos discernir un\n_AsyncClientKuso, que será, el .NET que le da nombre a nuestro RAT._\n\nEl fichero que introduce en startup, es otro vbs, cuyo contenido es únicamente que ejecute\nel Powershell en cada inicio del sistema, de nuevo, utilizando RemoteSigned.\n\n## Tercer stage: RAT\n\n\n-----\n\nDependiendo de la versión, podríamos contener o inyectar un RAT diferente, en nuestro\ncaso es AsyncRat.\n\nUna vez ya tiene los loaders cargados, ha ganado persistencia en el equipo, por lo que el\nRAT tendrá una ejecución que podrá perdurar en el tiempo, ejecutará el fichero File.bin o\nAsyncClientKuso dentro de procesos legítimos.\n\n## Creación del Mutex\n\nEn primer lugar, encontraremos las comprobaciones del Mutex habituales, para evitar\nreinfección, si el sistema, todavía no ha sido infectado con este RAT, lo creará.\n\nAdemás, el Mutex es creado por RegAsm, lo cual es lógico sabiendo que el RAT, en esta\nversión, va a ser ejecutado estando inyectado en este proceso, con el nombre\nAsyncMutex_6SI8OkPnk.\n\nTras esto, habrán varias técnicas relacionadas con el Anti-Análisis, las cuales son muy\nútiles, puesto que pueden evitar ser lanzado en sandbox o que ciertas funciones se\nanalicen y así mantener una campaña por más tiempo.\n\n## Técnicas Anti-VM\n\n**Detección de componentes del equipo, usando como objetivo el Manufacturer.**\n\n\n-----\n\n**Detección basada en disco, cuyo objetivo es comparar su tamaño.**\n\n**Detección basada en Sistema Operativo (OS), centrada en obtener la versión,**\ncomúnmente utilizada Windows XP.\n\n## Técnicas Anti-Sandbox\n\n**Detección mediante la librería sbieDll.dll, cuyo objetivo es detectar si ha sido cargada.**\n\n\n-----\n\n## Técnicas Anti-Debugger\n\n**Detección mediante la función CheckRemoteDebuggerPresent, cuyo objetivo es**\nobtener el proceso principal y detectar si es un debugger.\n\n## Función Install\n\nEn la última función, realizará diferentes procedimientos, desde matar procesos, generar\nmás persistencia, recordamos que la parte inicial podría ser cambiada ya que este es un\n_malware independiente al Snip3 y podrían utilizar otro RAT o malware._\n\nPodemos ver como principalmente realizará un GetProcess para obtener procesos no\ndeseados que puedan entorpecer el malware, esta práctica es habitual y se realiza con una\nbúsqueda en orden de cada uno de los procesos en ejecución y mediante un bucle realizar\n\n\n-----\n\nun Kill a aquellos procesos que se quiera evitar.\n\nPosteriormente, veremos que realizará la comprobación de permisos y si el usuario que\nestá ejecutando el RAT es Administrador creará persistencia en el equipo de una manera,\nsino lo realizará de otra. Comprobará si contiene un SID cuyo valor contenga en el 544 que\nrepresenta al Administrador.\n\nEn el caso distinto al nuestro y el usuario no sea Administrador, podremos ver como\nprocederá a obtener una RegKey, que, como podemos ver, se encuentra al revés, realizará\nun reverse de la cadena para devolverla a su formato original.\n\nRealiza la persistencia a través de la ejecución del siguiente comando, en el cual está\nrealizando la creación de la tarea de forma forzosa (/f) para que su lanzamiento siempre\nsea en inicio del sistema (/sc onlogon) con el nivel de prioridad alta (/rl highest), además no\npermitirá que haya en su ejecución ninguna aparición de ventanas\n(ProcessWindowStyle.Hidden).\n```\ncmd /c schtasks /create /f /sc onlogon /rl highest /tn \"\"Roaming\"\" /tr '\"\"C:\\Users\\\n<user>\\AppData\\Roaming\"\"' & exit\"\n\n```\n\n-----\n\nTras otras comprobaciones, llegamos a la creación de un .bat en el cual podemos ver que\nes un script que contendrá la ejecución de la tarea programada anteriormente que después\nborrará realizando un movimiento a la carpeta y realizando un delete.\n\nTras esto realiza comprobaciones y modificaciones en el hilo de ejecución para evitar que\nel dispositivo/monitor caiga en suspensión o se apague.\n\n\n-----\n\nPosteriormente, realiza un bucle en el cual obtenemos las funciones de red que utilizará\npara comprobar si está conectado al host y una reconexión si no lo está.\n\nVemos que intenta conectar a un dominio (e29rava[.]ddns[.]net), no será extraño ver\ndiferentes dominios sobre los que intentar la conexión, ya que es habitual que estos sean\ndenunciados de manera temprana y necesiten alternativas durante la ejecución.\n\n\n-----\n\nPor último, el atacante recibirá una petición al servidor y podrá acceder remotamente a\nnuestro equipo y controlarlo con total libertad, por lo que nuestro ordenador y red quedarán\nexpuestos.\n\n## MITRE\n\n¿Qué contiene el “curso en ciberseguridad” que deben seguir los atacantes afiliados de\n[Conti, el ransomware de éxito?Boletín semanal ciberseguridad 18-27 de diciembre](https://empresas.blogthinkbig.com/boletin-semanal-ciberseguridad-18-27-diciembre/)\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-23 - Snip3, an investigation into malware.pdf"
    ],
    "report_names": [
        "2021-12-23 - Snip3, an investigation into malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535641,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653709048,
    "ts_modification_date": 1653709048,
    "files": {
        "pdf": "https://archive.orkl.eu/9316826bc775299890f4956dcb92224b09d5bcad.pdf",
        "text": "https://archive.orkl.eu/9316826bc775299890f4956dcb92224b09d5bcad.txt",
        "img": "https://archive.orkl.eu/9316826bc775299890f4956dcb92224b09d5bcad.jpg"
    }
}