{
    "id": "6ae73c44-6b73-4892-a983-19191335110b",
    "created_at": "2022-10-25T16:48:22.409627Z",
    "updated_at": "2025-03-27T02:16:21.023807Z",
    "deleted_at": null,
    "sha1_hash": "fc7f3b5e0274380f2dcbf1314e416156782749b2",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-03-04T08:07:35Z",
    "file_modification_date": "2020-03-04T08:07:35Z",
    "file_size": 2885922,
    "plain_text": "# Unraveling the Lamberts Toolkit\n\n**securelist.com/unraveling-the-lamberts-toolkit/77990**\n\nBy GReAT\n\n[Yesterday, our colleagues from Symantec published their analysis of Longhorn, an advanced](https://www.symantec.com/connect/blogs/longhorn-tools-used-cyberespionage-group-linked-vault-7)\nthreat actor that can be easily compared with Regin, ProjectSauron, Equation or Duqu2 in terms\nof its complexity.\n\nLonghorn, which we internally refer to as “The Lamberts”, first came to the attention of the ITSec\ncommunity in 2014, when our colleagues from FireEye discovered an attack using a zero day\nvulnerability (CVE-2014-4148). The attack leveraged malware we called ‘BlackLambert’, which\nwas used to target a high profile organization in Europe.\n\nSince at least 2008, The Lamberts have used multiple sophisticated attack tools against highprofile victims. Their arsenal includes network-driven backdoors, several generations of modular\nbackdoors, harvesting tools, and wipers. Versions for both Windows and OSX are known at this\ntime, with the latest samples created in 2016.\n\nAlthough the operational security displayed by actors using the Lamberts toolkit is very good, one\nsample includes a PDB path that points to a project named “Archan~1” (perhaps ‘Archangel’).\nThe root folder on the PDB path is named “Hudson”. This is one of the very few mistakes we’ve\nseen with this threat actor.\n\nWhile in most cases the infection vector remains unknown, the high profile attack from 2014 used\na very complex Windows TTF zero-day exploit (CVE-2014-4148).\n\nKaspersky Lab products successfully detect and eradicate all the known malware from the\n[Lamberts family. For more information please contact: intelreports@kasperskycom](mailto:intelreports@kaspersky.com)\n\n## An Overview of the Lamberts\n\n_Figure 1. Lamberts discovery timeline_\n\nThe first time the Lambert family malware was uncovered publicly was in October 2014, when\n[FireEye posted a blog about a zero day exploit (CVE-2014-4148) used in the wild. The](https://www.fireeye.com/blog/threat-research/2014/10/two-targeted-attacks-two-new-zero-days.html)\nvulnerability was patched by Microsoft at the same time. We named the malware involved ‘Black\nLambert’ and described it thoroughly in a private report, available to Kaspersky APT Intel Reports\nsubscribers.\n\nThe authors of Black Lambert included a couple of very interesting details in the sample, which\nread as the following: toolType=wl, build=132914, versionName = 2.0.0. Looking for similar\nsamples, we were able to identify another generation of related tools which we called White\n\n\n-----\n\nLambert. While Black Lambert connects directly to its C&C for instructions, White Lambert is a\nfully passive, network-driven backdoor.\n\n#### Black Lambert White Lambert\n\n Implant type Active Passive\n\n toolType wl aa (“ArchAngel”)\n\n build 132914 113140\n\n versionName 2.0.0 5.0.2\n\n_Internal configuration similarities in Black and White Lambert_\n\nWhite Lambert runs in kernel mode and intercepts network traffic on infected machines. It\ndecrypts packets crafted in a special format to extract instructions. We named these passive\nbackdoors ‘White Lambert’ to contrast with the active “Black Lambert” implants.\n\nLooking further for any other malware related to White Lambert and Black Lambert, we came by\nanother generation of malware that we called Blue Lambert.\n\nOne of the Blue Lambert samples is interesting because it appears to have been used as second\nstage malware in a high profile attack, which involved the Black Lambert malware.\n\nLooking further for malware similar to Blue Lambert, we came by another family of malware we\ncalled Green Lambert. Green Lambert is a lighter, more reliable, but older version of Blue\nLambert. Interestingly, while most Blue Lambert variants have version numbers in the range of\n2.x, Green Lambert is mostly in 3.x versions. This stands in opposition to the data gathered from\nexport timestamps and C&C domain activity that points to Green Lambert being considerably\nolder than the Blue variant. Perhaps both Blue and Green Lamberts have been developed in\nparallel by two different teams working under the same umbrella, as normal software version\niterations, with one seeing earlier deployment than the other.\n\nSignatures created for Green Lambert (Windows) have also triggered on an OS X variant of\nGreen Lambert, with a very low version number: 1.2.0. This was uploaded to a multiscanner\nservice in September 2014. The OS X variant of Green Lambert is in many regards functionally\nidentical to the Windows version, however it misses certain functionality such as running plugins\ndirectly in memory.\n\nKaspersky Lab detections for Blue, Black, and Green Lamberts have been triggered by a\nrelatively small set of victims from around the world. While investigating one of these infections\ninvolving White Lambert (network-driven implant) and Blue Lambert (active implant), we found yet\nanother family of tools that appear to be related. We called this new family Pink Lambert.\n\nThe Pink Lambert toolset includes a beaconing implant, a USB-harvesting module and a multiplatform orchestrator framework which can be used to create OS-independent malware. Versions\nof this particular orchestrator were found on other victims, together with White Lambert samples,\nindicating a close relationship between the White and Pink Lambert malware families.\n\n\n-----\n\nBy looking further for other undetected malware on victims of White Lambert, we found yet\nanother apparently related family. The new family, which we called Gray Lambert is the latest\niteration of the passive network tools from the Lamberts’ arsenal. The coding style of Gray\nLambert is similar to the Pink Lambert USB-harvesting module, however, the functionality mirrors\nthat of White Lambert. Compared to White Lambert, Gray Lambert runs in user mode, without the\nneed for exploiting a vulnerable signed driver to load arbitrary code on 64-bit Windows variants.\n\nConnecting all these different families by shared code, data formats, C&C servers, and victims,\nwe have arrived at the following overarching picture:\n\n_Figure 2. An overview of connections between the Lambert families_\n\n## The Lamberts in Brief – from Black to Gray\n\nBelow, we provide a small summary of all the Lamberts. A full description of all variants is\n[available to subscribers of Kaspersky APT Reports. Contact intelreports@kaspersky.com](mailto:intelreports@kaspersky.com)\n\n### Black Lambert\n\n\n-----\n\nThe only known sample of Black Lambert was dropped by a TTF-exploit zero day (CVE-20144148). Its internal configuration included a proxy server which suggests the malware was created\nto work in a very specific network configuration, inside the victim’s network.\n\nAn internal description of Black Lambert indicates what appears to be a set of markers used by\nthe attackers to denote this particular branch: toolType=wl, build=132914, versionName =\n**2.0.0.**\n\n#### Hash Description\n\n 683afdef710bf3c96d42e6d9e7275130 generic loader (hdmsvc.exe)\n\n 79e263f78e69110c09642bbb30f09ace winlib.dll, final payload (toolType=wl)\n\n### Blue Lambert\n\nThe Blue Lambert implants contain what appear to be version numbers in the 2.x range, together\nwith project/operation codename sets, which may also indicate codenames for the victims or\ncampaigns.\n\n_Figure 4. Blue Lambert configuration in decrypted form, highlighting internal codenames_\n\nKnown codenames include TRUE CRIME (2.2.0.2), CERVELO YARDBIRD (2.6.1.1), GAI SHU\n(2.2.0.5), DOUBLESIDED SCOOBYSNACK (2.3.0.2), FUNNELCAKE CARNIVAL (2.5.0.2),\nPROSPER SPOCK (2.0.0.2), RINGTOSS CARNIVAL (2.4.2.2), COD FISH (2.2.0.0), and\nINVERTED SHOT (2.6.2.3).\n\n### Green Lambert\n\nGreen Lambert is a family of tools deeply related to Blue Lambert. The functionality is very similar,\nboth Blue and Green are active implants. The configuration data shares the same style of\ncodenames for victims, operations, or projects.\n\n\n-----\n\n_Figure 5. Green Lambert configuration block (decrypted) highlighting internal codenames_\n\nThe Green Lambert family is the only one where non-Windows variants have been found. An old\nversion of Green Lambert, compiled for OS X was uploaded from Russia to a multiscanner\nservice in 2014. Its internal codename is HO BO (1.2.0).\n\nThe Windows versions of Green Lambert have the following code names: BEARD BLUE (2.7.1),\nGORDON FLASH (3.0), APE ESCAPE (3.0.2), SPOCK LOGICAL (3.0.2), PIZZA ASSAULT\n(3.0.5), and SNOW BLOWER (3.0.5).\n\nInterestingly, one of the droppers of Green Lambert abused an ICS software package named\n“Subway Environmental Simulation Program” or “SES”, which has been available on certain\nforums visited by engineers working with industrial software. Similar techniques have been\nobserved in the past from other threat groups, for instance, trojanized Oracle installers by the\nEquation group.\n\n### White Lambert\n\nWhite Lambert is a family of tools that share the same internal description as Black Lambert.\nKnown tool types, builds, and version names include:\n\nToolType “aa”, protocol 3, version 7, versionName 5.0.2, build 113140\nToolType “aa”, protocol 3, version 7, versionName 5.0.0, build 113140\nToolType “aa”, protocol 3, version 6, versionName 4.2.0, build 110836M\nToolType “aa”, protocol 3, version 5, versionName 3.2.0\n\nOne of the White Lambert samples is interesting because it has a forgotten PDB path inside,\nwhich points to “Archan~1l” and “Hudson”. Hudson could point to a project name, if the authors\nname their projects by rivers in the US, or, it could also be the developer’s first name. The\ntruncated (8.3) path “archan~1” most likely means “Archangel”. The tool type “aa” could also\nsuggest “ArchAngel”. By comparison, the Black Lambert tool type “wl” has no known meaning.\n\n\n-----\n\nWhite Lambert samples run in kernel mode and sniff network traffic looking for special packets\ncontaining instructions to execute. To run unsigned code in kernel mode on 64-bit Windows,\nWhite Lambert uses an exploit against a signed, legitimate SiSoftware Sandra driver. The same\nmethod was used before by Turla, ProjectSauron, and Equation’s Grayfish, with other known,\nlegitimate drivers.\n\n### Pink Lambert\n\nPink Lambert is a suite of tools initially discovered on a White Lambert victim. It includes a\nbeaconing implant, partially based on publicly available source code. The source code on top of\nwhich Pink Lambert’s beaconing implant was created is “A Fully Featured Windows HTTP\nWrapper in C++”.\n\n_Figure 6. “A Fully Featured Windows HTTP Wrapper” by shicheng_\n\nOther tools in the Pink Lambert suite include USB stealer modules and a very complex multiplatform orchestrator.\n\nIn a second incident, a Pink Lambert orchestrator was found on another White Lambert victim,\nsubstantiating the connection between the Pink and White Lamberts.\n\n### Gray Lambert\n\nGray Lambert is the most recent tool in the Lamberts’ arsenal. It is a network-driven backdoor,\nsimilar in functionality to White Lambert. Unlike White Lambert, which runs in kernel mode, Gray\nLambert is a user-mode implant. The compilation and coding style of Gray Lambert is similar to\n\n\n-----\n\nthe Pink Lambert USB stealers. Gray Lambert initially appeared on the computers of victims\ninfected by White Lambert, which could suggest the authors were upgrading White Lambert\ninfections to Gray. This migration activity was last observed in October 2016.\n\nSome of the known filenames for Gray Lambert are mwapi32.dll and poolstr.dll – it should be\npointed though that the filenames used by the Lamberts are generally unique and have never\nbeen used twice.\n\n## Timeline\n\nMost of the Blue and Green Lambert samples have two C&C servers hardcoded in their\nconfiguration block: a hostname and an IP address. Using our own pDNS as well as DomainTools\nIP history, we plotted the times when the C&C servers were active and pointing to the same IP\naddress as the one from the configuration block.\n\nUnfortunately, this method doesn’t work for all samples, since some of them don’t have a domain\nfor C&C. Additionally, in some cases we couldn’t find any pDNS information for the hostname\nconfigured in the malware.\n\nLuckily, the attackers have made a few mistakes, which allow us to identify the activity times for\nmost of the other samples. For instance, in case when no pDNS information was available for a\nsubdomain on top of the main C&C domain, the domain registration dates were sufficient to point\nout when the activity began. Additionally, in some cases the top domain pointed to the same IP\naddress as the one from the configuration file, allowing us to identify the activity times.\n\nAnother worthwhile analysis method focuses on the set of Blue Lambert samples that have\nexports. Although most compilation timestamps in the PE header appear to have been tampered\n(to reflect a 2003-2004 range), the authors forgot to alter the timestamps in the export section.\nThis allowed us to identify not just the activity / compilation timestamps, but also the method used\nfor faking the compilation timestamps in the PE header.\n\nIt seems the algorithm used to tamper with the samples was the following: subtract 0x10 from the\nhighest byte of timestamp (which amounts to about 8 and half years) and then randomize the\nlowest 3 bytes. This way we conclude that for Blue Lamberts, that original compilation time of\nsamples was in the range of 2012-2015.\n\nPutting together all the various families, with recovered activity times, we come to the following\npicture:\n\n\n-----\n\n_Figure 8. A timeline of activity for known Lamberts_\n\nAs it can be seen from the chart above, Green Lambert is the oldest and longest-running in the\nfamily, while Gray is the newest. White, Blue and Pink somehow overlap in deployment, with Blue\nreplacing Green Lambert. Black Lambert was seen only briefly and we assume it was “retired”\nfrom the arsenal after being discovered by FireEye in 2014.\n\n### Codenames and Popular Culture Referenced in Lamberts\n\nThe threat group(s) behind the Lambert toolkits have used a large number of codenames\nextensively throughout their projects. Some of these codenames are references to old computer\ngames, Star Trek, and cartoons, which is very unusual for high profile APT groups. We really\nenjoyed going through the backstories of these codenames and wanted to provide them below for\nothers to enjoy as well.\n\nFor instance, one of the Green Lambert versions has the internal codename “GORDON FLASH”,\nwhich can also be read as “FLASH GORDON”. Flash Gordon is the hero of a space opera\nadventure comic strip created by and originally drawn by Alex Raymond. It was first published in\n1934 and subsequently turned into a popular film in 1980.\n\n_Flash Gordon poster_\n\nA ‘Funnel cake’ is a regional food popular in North America\nat carnivals, fairs, sporting events, and seaside resorts.\nThis explains the codename “FUNNELCAKE CARNIVAL”:\n\n_Figure 9. A typical funnel cake_\n\nSpock and Prosper obviously refers to Star Trek, the wellknown science fiction television series created by Gene\nRoddenberry. Cdr. Spock is a half-Vulcan, half-human\ncharacter, portrayed by Leonard Nimoy. “Live long and\nprosper” is the traditional Vulcan greeting in the series.\n\n_Leonard Nimoy as “Spock” displaying the traditional Vulcan_\n_greeting “Live long and prosper”_\n\n\n-----\n\nRingtoss is a game that is very popular at carnivals in North\nAmerica.\n\n\n-----\n\nDOUBLESIDED SCOOBYSNACK is likely a reference to an NFL Lip Reading video featuring\n[Adrian Peterson that went viral in mid-2013. According to the urban dictionary, it is also used to](https://youtu.be/qe_324wnNQU?t=6s)\ndenote a sexual game in which the participants are dressed as Scooby-Doo and his master.\n\n[Ape Escape (also known as Saru Get You (サルゲッチュ Saru Getchu) in Japan) is a series of](https://en.wikipedia.org/wiki/Ape_Escape)\nvideo games made by SCE Japan Studio, starting with Ape Escape for PlayStation in 1999. The\nseries often incorporates ape-related humor, unique gameplay, and a wide variety of pop culture\nreferences; it is also notable for being the first game to make the DualShock or Dual Analog\ncontroller mandatory.\n\n_Ape Escape_\n\nINVERTED SHOT is likely a reference to a mixed martial arts move also known as an ‘Imanari roll\ntakedown’, named after Masakazu Imanari who popularized the grappling technique. It consists of\na modified Brazilian jiu-jitsu granby roll that places the fighter in inverted guard position while\ntaking the opponent down to the mat.\n\nGAI and SHU (as used in Green Lambert OS X) are characters from the Guilty Crown anime\nseries. Gai Tsutsugami (恙神 涯 Tsutsugami Gai) is the 17-year-old resourceful and charismatic\nleader of the “Funeral Parlor” resistance group, while Shu Ouma (桜満 集 Ōma Shū) is the 17year-old main protagonist of Guilty Crown.\n\n\n-----\n\n_Figure 10. Main characters of Guilty Crown with Shu Ouma in the middle._\n\n## Conclusions\n\nThe Lamberts toolkit spans across several years, with most activity occurring in 2013 and 2014.\nOverall, the toolkit includes highly sophisticated malware, which relies on high-level techniques to\nsniff network traffic, run plugins in memory without touching the disk, and leverages exploits\nagainst signed drivers to run unsigned code on 64-bit Windows.\n\nTo further exemplify the proficiency of the attackers leveraging the Lamberts toolkit, deployment\nof Black Lambert included a rather sophisticated TTF zero day exploit, CVE-2014-4148. Taking\nthat into account, we classify the Lamberts as the same level of complexity as Regin,\nProjectSauron, Equation and Duqu2, which makes them one of the most sophisticated cyber\nespionage toolkits we have ever analysed.\n\nConsidering the complexity of these projects and the existence of an implant for OS X, we\nassume that it is highly possible that other Lamberts also exist for other platforms, such as Linux.\nThe fact that in the vast majority of cases the infection method is unknown probably means there\nare still a lot of unknown details about these attacks and the group(s) leveraging them.\n\n\n-----\n\nAs usual, defense against attacks such as those from the Lamberts/Longhorn should include a\nmulti-layered approach. Kaspersky products include special mitigation strategies against the\nmalware used by this group, as well as the many other APT groups we track. If you are interested\nin reading more about effective mitigation strategies in general, we recommend the following\narticles:\n\nWe will continue tracking the Lamberts and sharing new findings with our intel report subscribers,\nas well as with the general public. If you would like to be the first to hear our news, we suggest\nyou subscribe to our intel reports.\n\nKaspersky Lab products successfully detect and eradicate all the known malware from the\nLamberts family.\n\nFor more information about the Lamberts, please contact: intelreports@kaspersky.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.04.11.Lamberts_Toolkit/Unraveling%20the%20Lamberts%20Toolkit.pdf"
    ],
    "report_names": [
        "Unraveling the Lamberts Toolkit"
    ],
    "threat_actors": [
        {
            "id": "a0d369c1-f0b7-4c70-a3a5-77aabbd17979",
            "created_at": "2022-10-25T15:50:23.311311Z",
            "updated_at": "2025-03-27T02:00:55.438117Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "MITRE:Strider",
            "tools": [
                "Remsec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "99845f58-2c39-46f7-8369-bb621ebb7002",
            "created_at": "2022-10-25T16:07:24.238844Z",
            "updated_at": "2025-03-27T02:02:10.14785Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "ETDA:Strider",
            "tools": [
                "Backdoor.Remsec",
                "ProjectSauron",
                "Remsec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c1ac2a5e-0225-47a4-8ac5-5fa898c96bde",
            "created_at": "2023-01-06T13:46:38.472883Z",
            "updated_at": "2025-03-27T02:00:02.84253Z",
            "deleted_at": null,
            "main_name": "ProjectSauron",
            "aliases": [
                "Sauron",
                "Project Sauron",
                "G0041"
            ],
            "source_name": "MISPGALAXY:ProjectSauron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e993faab-f941-4561-bd87-7c33d609a4fc",
            "created_at": "2022-10-25T16:07:23.460301Z",
            "updated_at": "2025-03-27T02:02:09.814816Z",
            "deleted_at": null,
            "main_name": "Longhorn",
            "aliases": [
                "APT-C-39",
                "Platinum Terminal",
                "The Lamberts"
            ],
            "source_name": "ETDA:Longhorn",
            "tools": [
                "Black Lambert",
                "Blue Lambert",
                "Corentry",
                "Cyan Lambert",
                "Fluxwire",
                "Gray Lambert",
                "Green Lambert",
                "Magenta Lambert",
                "Pink Lambert",
                "Plexor",
                "Purple Lambert",
                "Silver Lambert",
                "Violet Lambert",
                "White Lambert"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70db80bd-31b7-4581-accb-914cd8252913",
            "created_at": "2023-01-06T13:46:38.57727Z",
            "updated_at": "2025-03-27T02:00:02.865012Z",
            "deleted_at": null,
            "main_name": "Longhorn",
            "aliases": [
                "the Lamberts",
                "APT-C-39",
                "PLATINUM TERMINAL"
            ],
            "source_name": "MISPGALAXY:Longhorn",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041781,
    "ts_creation_date": 1583309255,
    "ts_modification_date": 1583309255,
    "files": {
        "pdf": "https://archive.orkl.eu/fc7f3b5e0274380f2dcbf1314e416156782749b2.pdf",
        "text": "https://archive.orkl.eu/fc7f3b5e0274380f2dcbf1314e416156782749b2.txt",
        "img": "https://archive.orkl.eu/fc7f3b5e0274380f2dcbf1314e416156782749b2.jpg"
    }
}