{
    "id": "6b38bf13-d525-4ac3-91e7-1040c8d9a949",
    "created_at": "2023-01-12T15:03:51.364059Z",
    "updated_at": "2025-03-27T02:05:20.120841Z",
    "deleted_at": null,
    "sha1_hash": "f61297b5dd34778d320d53bdd500633340341b3a",
    "title": "2022-04-12 - March 2022’s Most Wanted Malware- Easter Phishing Scams Help Emotet Assert its Dominance",
    "authors": "",
    "file_creation_date": "2022-05-28T18:16:02Z",
    "file_modification_date": "2022-05-28T18:16:02Z",
    "file_size": 113954,
    "plain_text": "# March 2022’s Most Wanted Malware: Easter Phishing Scams Help Emotet Assert its Dominance\n\n**checkpoint.com/press/2022/march-2022s-most-wanted-malware-easter-phishing-scams-help-emotet-assert-its-**\ndominance/\n\n**San Carlos, CA — Tue, 12 Apr 2022**\n[Check Point Research (CPR), the Threat Intelligence arm of Check Point® Software](https://research.checkpoint.com/)\nTechnologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally\nhas published its latest Global Threat Index for March 2022. Researchers report that Emotet\nis continuing its reign as the most popular malware, impacting 10% of organizations\nworldwide, double that of February.\n\n[Emotet is an advanced, self-propagating and modular trojan that uses multiple methods for](https://threatpoint.checkpoint.com/ThreatPortal/threat?threatType=malwarefamily&threatId=4726)\nmaintaining persistence and evasion techniques to avoid detection. Since its return in\nNovember last year and the recent [news that Trickbot has shut down, Emotet has been](https://thehackernews.com/2022/02/notorious-trickbot-malware-gang-shuts.html)\nstrengthening its position as the most prevalent malware. This was solidified even further this\nmonth as many aggressive email campaigns have been distributing the botnet, including\nvarious Easter-themed phishing scams exploiting the buzz of the festivities. These emails\nwere sent to victims all over the world with one such example using the subject “Buona\nPasqua, happy easter” yet attached to the email was a malicious XLS file to deliver Emotet.\n\nThis month, Agent Tesla, the advanced RAT functioning as a keylogger and information\nstealer, is the second most prevalent malware, after appearing fourth in last month’s index.\nAgent Tesla’s rise is due to several new mal-spam campaigns delivering the RAT via\nmalicious xlsx/pdf files worldwide. Some of these campaigns have leveraged the\nRussia/Ukraine war to lure victims.\n\n“Technology has advanced in recent years to such a point where cybercriminals are\nincreasingly having to rely on human trust in order to get through to a corporate network. By\ntheming their phishing emails around seasonal holidays such as Easter, they are able to\nexploit the buzz of the festivities and lure victims into downloading malicious attachments\nthat contain malware such as Emotet. In the run up to the Easter weekend, we expect to see\nmore of these scams and urge users to pay close attention, even if the email looks like it’s\nfrom a reputable source. Easter isn’t the only public holiday and cybercriminals will continue\nto deploy the same tactics to inflict harm,” said Maya Horowitz, VP of Research at Check\nPoint Software. “This month we also observed Apache Log4j becoming the number one most\nexploited vulnerability again. Even after all the talk about this vulnerability at the end of last\nyear, it is still causing harm months after the initial detection. Organizations need to take\nimmediate action to prevent attacks from happening.”\n\n\n-----\n\nCPR also revealed this month that Education/Research is still the number one most attacked\nindustry globally, followed by Government/Military and Internet Service Providers/Managed\nService Providers (ISP/MSP). “Web Server Exposed Git Repository Information Disclosure”\nis now the second most commonly exploited vulnerability, impacting 26% of organizations\nworldwide, while “Apache Log4j Remote Code Execution” takes the top spot, impacting 33%\nof organizations. “HTTP Headers Remote Code Execution (CVE-2020-10826, CVE-202010827, CVE-2020-10828, CVE-2020-13756)” keeps hold of third place with a global impact\nof 26%.\n\n**Examples of Easter-themed phishing emails**\n\nFigure 1 Example of Easter Phishing Email\n\n\n-----\n\nFigure 2 Example of an Easter Phishing Email sent to various countries\n\n**Top Malware Families**\n\n_*The arrows relate to the change in rank compared to the previous month._\n\nThis month, Emotet is still the most popular malware with a global impact of 10% of\norganizations worldwide, followed by Agent Tesla and XMRig both impacting 2% of\norganizations each.\n\n1. ↔ Emotet – Emotet is an advanced, self-propagate, and modular Trojan. Emotet was\n\nonce used to employ as a banking Trojan, and recently is used as a distributor to other\nmalware or malicious campaigns. It uses multiple methods for maintaining persistence\nand evasion techniques to avoid detection. In addition, it can be spread through\nphishing spam emails containing malicious attachments or links.\n\n\n-----\n\n2. ↑ Agent Tesla – Agent Tesla is an advanced RAT functioning as a keylogger and\n\ninformation stealer, which is capable of monitoring and collecting the victim’s keyboard\ninput, system keyboard, taking screenshots, and exfiltrating credentials to a variety of\nsoftware installed on a victim’s machine (including Google Chrome, Mozilla Firefox and\nthe Microsoft Outlook email client).\n3. ↑ XMRig – XMRig is an open-source CPU mining software used for the mining process\n\nof the Monero cryptocurrency and was first seen in-the-wild May 2017.\n\n**Top Attacked Industries Globally**\nThis month Education/Research is the number one most attacked industry globally, followed\nby Government/Military and ISP/MSP.\n\n1. Education/Research\n2. Government/Military\n3. ISP/MSP\n\n**Top Exploited Vulnerabilities**\nThis month “Apache Log4j Remote Code Execution” is the most commonly exploited\nvulnerability, impacting 33% of organizations globally, followed by “Web Server Exposed Git\n**Repository Information Disclosure” which dropped from first place to second place and**\nimpacts 26% of organizations worldwide. “HTTP Headers Remote Code Execution” is still\nin third place in the top exploited vulnerabilities list, with a global impact of 26%.\n\n1. ↑ Apache Log4j Remote Code Execution (CVE-2021-44228) – A remote code\n\nexecution vulnerability exists in Apache Log4j. Successful exploitation of this\nvulnerability could allow a remote attacker to execute arbitrary code on the affected\nsystem.\n2. ↓ Web Server Exposed Git Repository Information Disclosure – An information\n\ndisclosure vulnerability has been reported in Git Repository. Successful exploitation of\nthis vulnerability could allow an unintentional disclosure of account information.\n3. ↔ HTTP Headers Remote Code Execution (CVE-2020-10826,CVE-2020\n**10827,CVE-2020-10828,CVE-2020-13756) – HTTP headers let the client and the**\nserver pass additional information with an HTTP request. A remote attacker may use a\nvulnerable HTTP Header to run arbitrary code on the victim machine.\n\n**Top Mobile Malware**\nThis month AlienBot is the most prevalent mobile malware, followed by xHelper and FluBot.\n\n1. AlienBot – AlienBot malware family is a Malware-as-a-Service (MaaS) for Android\n\ndevices that allows a remote attacker, at a first step, to inject malicious code into\nlegitimate financial applications. The attacker obtains access to victims’ accounts, and\neventually completely controls their device.\n\n\n-----\n\n2. xHelper – A malicious application seen in the wild since March 2019, used for\n\ndownloading other malicious apps and display advertisement. The application is\ncapable of hiding itself from the user and reinstalling itself if uninstalled.\n3. FluBot– FluBot is an Android malware distributed via phishing SMS messages\n\n(Smishing), most often impersonating logistics delivery brands. Once the user clicks\nthe link inside the message, they are redirected to the download of a fake application\ncontaining FluBot. Once installed the malware has various capabilities to harvest\ncredentials and support the Smishing operation itself, including uploading contact lists,\nas well as sending SMS messages to other phone numbers.\n\nCheck Point’s Global Threat Impact Index and its ThreatCloud Map is powered by Check\nPoint’s ThreatCloud intelligence. ThreatCloud provides real-time threat intelligence derived\nfrom hundreds of millions of sensors worldwide, over networks, endpoints and mobiles. The\nintelligence is enriched with AI-based engines and exclusive research data from Check Point\nResearch, The Intelligence & Research Arm of Check Point Software Technologies.\n\nThe complete list of the top 10 malware families in February can be found on the Check\nPoint [blog.](https://blog.checkpoint.com/)\n\n**Follow Check Point Research via:**\nBlog: [https://research.checkpoint.com/](https://research.checkpoint.com/)\nTwitter: [https://twitter.com/_cpresearch_](https://twitter.com/_cpresearch_)\n\n**About Check Point Research**\nCheck Point Research (CPR) provides leading cyber threat intelligence to Check Point\nSoftware customers and the greater intelligence community. The research team collects and\nanalyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while\nensuring all Check Point solutions are updated with the latest protections. The research team\nconsists of over 100 analysts and researchers cooperating with other security vendors, law\nenforcement and various CERTs.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-12 - March 2022’s Most Wanted Malware- Easter Phishing Scams Help Emotet Assert its Dominance.pdf"
    ],
    "report_names": [
        "2022-04-12 - March 2022’s Most Wanted Malware- Easter Phishing Scams Help Emotet Assert its Dominance.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535831,
    "ts_updated_at": 1743041120,
    "ts_creation_date": 1653761762,
    "ts_modification_date": 1653761762,
    "files": {
        "pdf": "https://archive.orkl.eu/f61297b5dd34778d320d53bdd500633340341b3a.pdf",
        "text": "https://archive.orkl.eu/f61297b5dd34778d320d53bdd500633340341b3a.txt",
        "img": "https://archive.orkl.eu/f61297b5dd34778d320d53bdd500633340341b3a.jpg"
    }
}