{
    "id": "6baf8b80-df47-42e4-9a8e-285308bf2ec8",
    "created_at": "2023-01-12T15:06:42.49612Z",
    "updated_at": "2025-03-27T02:16:58.184884Z",
    "deleted_at": null,
    "sha1_hash": "d686d9d7596d3bb1697aee1841d770f90f7df982",
    "title": "2019-04-22 - CARBANAK Week Part One- A Rare Occurrence",
    "authors": "",
    "file_creation_date": "2022-05-27T21:09:06Z",
    "file_modification_date": "2022-05-27T21:09:06Z",
    "file_size": 104277,
    "plain_text": "# CARBANAK Week Part One: A Rare Occurrence\n\n**[fireeye.com/blog/threat-research/2019/04/carbanak-week-part-one-a-rare-occurrence.html](https://www.fireeye.com/blog/threat-research/2019/04/carbanak-week-part-one-a-rare-occurrence.html)**\n\nThreat Research\n\nMichael Bailey, James T. Bennett\n\nApr 22, 2019\n\n10 mins read\n\nThreat Research\n\nMalware\n\n\n-----\n\ncarbanak-week-banner\n\n\nIt is very unusual for FLARE to analyze a prolifically-used, privately-developed backdoor only to\nlater have the source code and operator tools fall into our laps. Yet this is the extraordinary\ncircumstance that sets the stage for CARBANAK Week, a four-part blog series that commences\nwith this post.\n\nCARBANAK is one of the most full-featured backdoors around. It was used to perpetrate\n[millions of dollars in financial crimes, largely by the group we track as FIN7. In 2017, Tom](https://www.fireeye.com/resources?f%5B0%5D=layout:article_blog)\n[Bennett and Barry Vengerik published Behind the CARBANAK Backdoor, which was the](https://www.fireeye.com/resources/behind-the-carbanak-backdoor)\nproduct of a deep and broad analysis of CARBANAK samples and FIN7 activity across several\n\n\n-----\n\nyears. On the heels of that publication, our colleague Nick Carr uncovered a pair of RAR\narchives containing CARBANAK source code, builders, and other tools (both available in\nVirusTotal: [kb3r1p and](https://www.virustotal.com/#/file/783b2eefdb90eb78cfda475073422ee86476aca65d67ff2c9cf6a6f9067ba5fa/detection) [apwmie).](https://www.virustotal.com/#/file/4116ec1eb75cf336a3fdde253c28f712668d0a325a74c41445c7fa87c4e9b7a5/detection)\n\nFLARE malware analysis requests are typically limited to a few dozen files at most. But the\nCARBANAK source code was 20MB comprising 755 files, with 39 binaries and 100,000 lines of\ncode. Our goal was to find threat intelligence we missed in our previous analyses. How does an\nanalyst respond to a request with such breadth and open-ended scope? And what did we find?\n\nMy friend Tom Bennett and I spoke about this briefly in our 2018 FireEye Cyber Defense\nSummit talk, [Hello, Carbanak! In this blog series, we will expound at length and share a written](https://www.fireeye.com/learn/tracks.html%23technical-3)\nretrospective on the inferences drawn in our previous public analysis based on binary code\nreverse engineering. In this first part, I’ll discuss Russian language concerns, translated\ngraphical user interfaces of CARBANAK tools, and anti-analysis tactics as seen from a source\ncode perspective. We will also explain an interesting twist where analyzing the source code\nsurprisingly proved to be just as difficult as analyzing the binary, if not more. There’s a lot here;\nbuckle up!\n\n**File Encoding and Language Considerations**\n\nThe objective of this analysis was to discover threat intelligence gaps and better protect our\ncustomers. To begin, I wanted to assemble a cross-reference of source code files and concepts\nof specific interest.\n\nReading the source code entailed two steps: displaying the files in the correct encoding, and\nlearning enough Russian to be dangerous. Figure 1 shows CARBANAK source code in a text\neditor that is unaware of the correct encoding.\n\n\n-----\n\nFile without proper decoding\n\n\nFigure\n\n1: File without proper decoding\nTwo good file encoding guesses are UTF-8 and code page 1251 (Cyrillic). The files were mostly\ncode page 1251 as shown in Figure 2.\n\n\n-----\n\nCode Page 1251 (Cyrillic) source code\n\n\nFigure\n\n2: Code Page 1251 (Cyrillic) source code\nFigure 2 is a C++ header file defining error values involved in backdoor command execution.\nMost identifiers were in English, but some were not particularly descriptive. Ergo, the second\nand more difficult step was learning some Russian to benefit from the context offered by the\nsource code comments.\n\nFLARE has fluent Russian speakers, but I took it upon myself to minimize my use of other\nanalysts’ time. To this end, I wrote a script to tear through files and create a prioritized\n[vocabulary list. The script, which is available in the Mandiant vocab_scraper GitHub repository,](https://github.com/mandiant/vocab_scraper)\nwalks source directories finding all character sequences outside the printable lower ASCII\nrange: decimal values 32 (the space character) through 126 (the tilde character “~”) inclusive.\nThe script adds each word to a Python defaultdict_ and increments its count. Finally, the script\norders this dictionary by frequency of occurrence and dumps it to a file.\n\nThe result was a 3,400+ word vocabulary list, partially shown in Figure 3.\n\n\n-----\n\nTop 19 Cyrillic character sequences from the\nCARBANAK source code\n\nFigure 3: Top 19 Cyrillic character sequences\n\nfrom the CARBANAK source code\nI spent several hours on Russian language learning websites to study the pronunciation of\nCyrillic characters and Russian words. Then, I looked up the top 600+ words and created a\nsmall dictionary. I added Russian language input to an analysis VM and used Microsoft’s onscreen keyboard (osk.exe) to navigate the Cyrillic keyboard layout and look up definitions.\n\nOne helpful effect of learning to pronounce Cyrillic characters was my newfound recognition of\nEnglish loan words (words that are borrowed from English and transliterated to Cyrillic). My\nsmall vocabulary allowed me to read many comments without looking anything up. Table 1\nshows a short sampling of some of the English loan words I encountered.\n\n**Cyrillic** **English Phonetic** **English** **Occurrences** **Rank**\n\nФайл f ah y L file 224 5\n\nсервер s e r v e r server 145 13\n\nадрес a d r e s address 52 134\n\nкоманд k o m a n d command 110+ 27\n\nбота b o t a bot 130 32\n\nплагин p l ah g ee n plugin 116 39\n\n\n-----\n\nсервис s e r v ee s service 70 46\n\nпроцесс p r o ts e s s process 130ish 63\n\nTable 1: Sampling of English loan words in the CARBANAK source code\n\nAside from source code comments, understanding how to read and type in Cyrillic came in\nhandy for translating the CARBANAK graphical user interfaces I found in the source code\ndump. Figure 4 shows a Command and Control (C2) user interface for CARBANAK that I\ntranslated.\n\n\nTranslated C2 graphical user interface\n\n\nFigure\n\n4: Translated C2 graphical user interface\nThese user interfaces included video management and playback applications as shown in\nFigure 5 and Figure 6 respectively. Tom will share some interesting work he did with these in a\nsubsequent part of this blog series\n\n\n-----\n\nTranslated video management application user interface\n\n\nFigure\n\n\n5: Translated video management application user interface\n\n\n-----\n\nTranslated video playback application user interface\n\n\nFigure\n\n6: Translated video playback application user interface\nFigure 7 shows the backdoor builder that was contained within the RAR archive of operator\ntools.\n\n\n-----\n\nTranslated backdoor builder application user interface\n\n\nFigure\n\n7: Translated backdoor builder application user interface\nThe operator RAR archive also contained an operator’s manual explaining the semantics of all\nthe backdoor commands. Figure 8 shows the first few commands in this manual, both in\nRussian and English (translated).\n\n\n-----\n\nOperator manual (left: original Russian; right: translated to English)\n\n\nFigure\n\n8: Operator manual (left: original Russian; right: translated to English)\n\n**Down the Rabbit Hole: When Having Source Code Does Not Help**\n\nIn simpler backdoors, a single function evaluates the command ID received from the C2 server\nand dispatches control to the correct function to carry out the command. For example, a\nbackdoor might ask its C2 server for a command and receive a response bearing the command\nID 0x67. The dispatch function in the backdoor will check the command ID against several\ndifferent values, including 0x67, which as an example might call a function to shovel a reverse\nshell to the C2 server. Figure 9 shows a control flow graph of such a function as viewed in IDA\nPro. Each block of code checks against a command ID and either passes control to the\nappropriate command handling code, or moves on to check for the next command ID.\n\n\n-----\n\nA control flow graph of a simple command handling function\n\n\nFigure\n\n9: A control flow graph of a simple command handling function\nIn this regard, CARBANAK is an entirely different beast. It utilizes a Windows mechanism called\n[named pipes as a means of communication and coordination across all the threads, processes,](https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes)\nand plugins under the backdoor’s control. When the CARBANAK tasking component receives a\ncommand, it forwards the command over a named pipe where it travels through several\ndifferent functions that process the message, possibly writing it to one or more additional named\npipes, until it arrives at its destination where the specified command is finally handled.\nCommand handlers may even specify their own named pipe to request more data from the C2\nserver. When the C2 server returns the data, CARBANAK writes the result to this auxiliary\nnamed pipe and a callback function is triggered to handle the response data asynchronously.\nCARBANAK’s named pipe-based tasking component is flexible enough to control both inherent\ncommand handlers and plugins. It also allows for the possibility of a local client to dispatch\ncommands to CARBANAK without the use of a network. In fact, not only did we write such a\nclient to aid in analysis and testing, but such a client, named botcmd.exe, was also present in\nthe source dump.\n\n\n-----\n\n**Tom s Perspective**\n\nAnalyzing this command-handling mechanism within CARBANAK from a binary perspective\nwas certainly challenging. It required maintaining tabs for many different views into the\ndisassembly, and a sort of textual map of command ids and named pipe names to describe the\njourney of an inbound command through the various pipes and functions before arriving at its\ndestination. Figure 10 shows the control flow graphs for seven of the named pipe message\nhandling functions. While it was difficult to analyze this from a binary reverse engineering\nperspective, having compiled code combined with the features that a good disassembler such\nas IDA Pro provides made it less harrowing than Mike’s experience. The binary perspective\nsaved me from having to search across several source files and deal with ambiguous function\nnames. The disassembler features allowed me to easily follow cross-references for functions\nand global variables and to open multiple, related views into the code.\n\n\nControl flow graphs for the named pipe message handling functions\n\n\nFigure\n\n\n10: Control flow graphs for the named pipe message handling functions\n\n**Mike’s Perspective**\n\n\n-----\n\nHaving source code sounds like cheat-mode for malware analysis. Indeed, source code\ncontains much information that is lost through the compilation and linking process. Even so,\nCARBANAK’s tasking component (for handling commands sent by the C2 server) serves as a\ncounter-example. Depending on the C2 protocol used and the command being processed,\ncontrol flow may take divergent paths through different functions only to converge again later\nand accomplish the same command. Analysis required bouncing around between almost 20\nfunctions in 5 files, often backtracking to recover information about function pointers and\nparameters that were passed in from as many as 18 layers back. Analysis also entailed\nresolving matters of C++ class inheritance, scope ambiguity, overloaded functions, and control\nflow termination upon named pipe usage. The overall effect was that this was difficult to\nanalyze, even in source code.\n\nI only embarked on this top-to-bottom journey once, to search for any surprises. The effort gave\nme an appreciation for the baroque machinery the authors constructed either for the sake of\nobfuscation or flexibility. I felt like this was done at least in part to obscure relationships and\nhinder timely analysis.\n\n**Anti-Analysis Mechanisms in Source Code**\n\nCARBANAK’s executable code is filled with logic that pushes hexadecimal numbers to the\nsame function, followed by an indirect call against the returned value. This is easily\nrecognizable as obfuscated function import resolution, wherein CARBANAK uses a simple\nstring hash known as PJW (named after its author, P.J. Weinberger) to locate Windows API\nfunctions without disclosing their names. A Python implementation of the PJW hash is shown in\nFigure 11 for reference.\n\ndef pjw_hash(s):\n\nctr = 0\n\nfor i in range(len(s)):\n\nctr = 0xffffffff & ((ctr << 4) + ord(s[i]))\n\nif ctr & 0xf0000000:\n\nctr = (((ctr & 0xf0000000) >> 24) ^ ctr) & 0x0fffffff\n\nreturn ctr\n\nFigure 11: PJW hash\n\nThis is used several hundred times in CARBANAK samples and impedes understanding of the\n[malware’s functionality. Fortunately, reversers can use the flare-ida scripts to annotate the](https://www.mandiant.com/resources/precalculated-string-hashes-reverse-engineering-shellcode)\nobfuscated imports, as shown in Figure 12.\n\n\n-----\n\nObfuscated import resolution annotated with FLARE s shellcode hash search\n\n\nFigure\n\n12: Obfuscated import resolution annotated with FLARE's shellcode hash search\nThe CARBANAK authors achieved this obfuscated import resolution throughout their backdoor\nwith relative ease using C preprocessor macros and a pre-compilation source code scanning\nstep to calculate function hashes. Figure 13 shows the definition of the relevant API macro and\nassociated machinery.\n\n\n-----\n\nAPI macro for import resolution\n\n\nFigure\n\n13: API macro for import resolution\nThe API macro allows the author to type API(SHLWAPI, PathFindFileNameA)(…) and have it\nreplaced with GetApiAddrFunc(SHLWAPI, hashPathFindFileNameA)(…). SHLWAPI is a\nsymbolic macro defined to be the constant 3, and hashPathFindFileNameA is the string hash\nvalue 0xE3685D1 as observed in the disassembly. But how was the hash defined?\n\nThe CARBANAK source code has a utility (unimaginatively named tool) that scans source code\nfor invocations of the API macro to build a header file defining string hashes for all the Windows\nAPI function names encountered in the entire codebase. Figure 14 shows the source code for\nthis utility along with its output file, api_funcs_hash.h.\n\n\n-----\n\nSource code and output from string hash utility\n\n\nFigure\n\n14: Source code and output from string hash utility\nWhen I reverse engineer obfuscated malware, I can’t help but try to theorize about how authors\nimplement their obfuscations. The CARBANAK source code gives another data point into how\nmalware authors wield the powerful C preprocessor along with custom code scanning and code\ngeneration tools to obfuscate without imposing an undue burden on developers. This might\nprovide future perspective in terms of what to expect from malware authors in the future and\nmay help identify units of potential code reuse in future projects as well as rate their\nsignificance. It would be trivial to apply this to new projects, but with the source code being on\nVirusTotal, this level of code sharing may not represent shared authorship. Also, the source\ncode is accessibly instructive in why malware would push an integer as well as a hash to\nresolve functions: because the integer is an index into an array of module handles that are\nopened in advance and associated with these pre-defined integers.\n\n**Conclusion**\n\n\n-----\n\nThe CARBANAK source code is illustrative of how these malware authors addressed some of\nthe practical concerns of obfuscation. Both the tasking code and the Windows API resolution\nsystem represent significant investments in throwing malware analysts off the scent of this\nbackdoor. Check out [Part Two of this series for a round-up of antivirus evasions, exploits,](https://www.fireeye.com/resources/carbanak-week-part-two-continuing-carbanak-source-code-analysis)\n[secrets, key material, authorship artifacts, and network-based indicators. Part Three and](https://www.mandiant.com/resources/carbanak-week-part-three-behind-the-backdoor) Part\nFour are available now as well!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-22 - CARBANAK Week Part One- A Rare Occurrence.pdf"
    ],
    "report_names": [
        "2019-04-22 - CARBANAK Week Part One- A Rare Occurrence.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536002,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1653685746,
    "ts_modification_date": 1653685746,
    "files": {
        "pdf": "https://archive.orkl.eu/d686d9d7596d3bb1697aee1841d770f90f7df982.pdf",
        "text": "https://archive.orkl.eu/d686d9d7596d3bb1697aee1841d770f90f7df982.txt",
        "img": "https://archive.orkl.eu/d686d9d7596d3bb1697aee1841d770f90f7df982.jpg"
    }
}