{
    "id": "6bb0eb41-72d7-4f35-9ccf-33d525c788d1",
    "created_at": "2023-01-12T15:09:28.287758Z",
    "updated_at": "2025-03-27T02:05:40.629668Z",
    "deleted_at": null,
    "sha1_hash": "3e7dfd30ea26567663113a0df7697243c1773c29",
    "title": "2014-07-11 - The Father of Zeus- Kronos Malware Discovered",
    "authors": "",
    "file_creation_date": "2022-05-28T15:39:12Z",
    "file_modification_date": "2022-05-28T15:39:12Z",
    "file_size": 1610756,
    "plain_text": "# The Father of Zeus: Kronos Malware Discovered\n\n**[securityintelligence.com/the-father-of-zeus-kronos-malware-discovered/](https://securityintelligence.com/the-father-of-zeus-kronos-malware-discovered/)**\n\n[Banking & Finance July 11, 2014](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\n\n\nJuly 11, 2014\n\n\n-----\n\nBy [Etay Maor 3 min read](https://securityintelligence.com/author/etay-maor/)\n\n## New Trojan from the Russian Underground\n\nWhile major players like Zeus, Gozi, Citadel and other advanced financial malware dominate\nthe malware threat landscape, newcomers and challengers always try to get a share of the\ncyber crime market. One such new malware that was recently made available for purchase\nin a Russian underground forum is the Kronos malware. With a $7,000 price tag, this\nmalware offers multiple modules for evading detection and analysis as well as an option to\ntest the malware for a week prior to buying it.\n\n_Note that the following descriptions of Kronos are based solely on entries in the underground_\n_forum; Trusteer, an IBM company, has not yet analyzed a malware sample in order to_\n_validate the seller’s claims._\n\n### Kronos Malware: Like Father, Like Son?\n\nWe recently found a cyber criminal offering the Kronos malware to members of a major\nRussian underground forum. The forum post details several of the malware’s technical\ncapabilities and concludes with information on business and purchase options. From the\nmalware’s description, several elements are worth noting:\n\nCommon credential-stealing techniques such as form grabbing and HTML injection\ncompatible with the major browsers (Internet Explorer, Firefox and Chrome);\n32- and 64-bit ring3 (user-mode) rootkit capable of also “defending from other Trojans”;\nAntivirus bypassing;\nMalware-to-C&C communication encryption;\nSandbox bypassing.\n\n[Consistent with other financial malware developments, it seems that significant time and](https://securityintelligence.com/zeus-maple-variant-targets-canadian-online-banking-customers/)\neffort were given to evading security tools used both by end users and security white hats. In\naddition, the HTML injection mechanism is compatible with Zeus. Because Zeus is the most\nwidely deployed malware, and it is likely that potential clients have used or still use Zeus\nvariants, the authors of Kronos made sure that the HTML injection files used by Zeus\noperators can be easily implemented with Kronos. Coincidence or not, it is also worth noting\nthat in Greek mythology, Kronos is Zeus’ father.\n\nThe business side of this offer is interesting as well. Most malware today is sold in the low\nhundreds of dollars, sometimes even offered for free due to several malware source code\nleaks. Comparatively, the Kronos malware carries a hefty cost of $7,000. This price,\nhowever, is not the first time a new malware seller has demanded a premium. Approximately\nfour years ago, Carberp was released and priced at $10,000 (and $15,000 for the addition of\n\n\n-----\n\nthe VNC module, which is almost a standard capability of today s financial malware). The\nKronos seller also offers a one-week testing server for $1,000, during which time a potential\nclient will have access to the malware’s control panel and all the bot’s capabilities.\n\nThe authors promise to develop new modules for the malware (which will be charged\nseparately), along with updates and bug fixes (free of charge). The preferred payment\nmethods for this deal are various forms of e-currency such as Perfect Money and Bitcoin. As\nan incentive, early buyers are promised a discounted price.\n\nIt remains to be seen how popular Kronos will be within the cybercrime community.\n[Trusteer’s security team continues to monitor underground forums for new threats as well as](https://www-03.ibm.com/software/products/en/trusteer-fraud-protection-suite)\nanalyze, reverse engineer and study new malware files.\n\n## I present you a new banking Trojan\n\nCompatible with 64 and 32bit rootkit Trojan is equipped with the tools to give you successful\nbanking actions.Formgrabber: Works on Chrome, IE, FF in latest versions. Works on the\nmajority of older versions as well. Steals logs from each website Webinjects: Works on latest\nChrome, IE, FF, latest and majority of older versions. Injections are in Zeus config format, so\nit’s easy to transfer the config from one another.32 and 64bit Ring3 rootkit: The Trojan also\nhas a ring 3 rootkit that defends it from other Trojans.\n\nProactive Bypass: The Trojan uses an undetected injection method to work in a secure\nprocess and bypass proactive anti-virus protections. Encrypted Communication: Connection\nbetween bot and panel is encrypted to protect against sniffers. Usermode Sandbox and\nrootkit bypass: The Trojan is able to bypass any hook in usermode functions which bypasses\nrootkits or sandboxes which use these hooks.\n\n1000$ a week of testing. The server will be hosted only for you. You need just a domain or a\npayment including the domain fee. You’ll have full access to the C&C, without any limits or\nrestrictions during test mode.7000$ Lifetime product license, free updates and bug removals.\nNew modules will not be free, and you will need to pay additionally. We accept Perfect\nMoney, Bitcoin, WMZ, BTC-E.comCurrently the Trojan is written in its fullest. Next week we\nwill have tests and bug fixing, then release. Pre-ordering the Trojan will give you a discount.\n\n[Etay Maor](https://securityintelligence.com/author/etay-maor/)\nExecutive Security Advisor, IBM Security\n\nEtay Maor is an Executive Security Advisor at IBM Security, where he leads security and\nfraud fighting awareness and research. A security evangelist, Etay re...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-07-11 - The Father of Zeus- Kronos Malware Discovered.pdf"
    ],
    "report_names": [
        "2014-07-11 - The Father of Zeus- Kronos Malware Discovered.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536168,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653752352,
    "ts_modification_date": 1653752352,
    "files": {
        "pdf": "https://archive.orkl.eu/3e7dfd30ea26567663113a0df7697243c1773c29.pdf",
        "text": "https://archive.orkl.eu/3e7dfd30ea26567663113a0df7697243c1773c29.txt",
        "img": "https://archive.orkl.eu/3e7dfd30ea26567663113a0df7697243c1773c29.jpg"
    }
}