{
    "id": "6bb10e77-6d54-49fe-9700-100e60dc9888",
    "created_at": "2023-01-12T14:59:42.539221Z",
    "updated_at": "2025-03-27T02:16:26.183701Z",
    "deleted_at": null,
    "sha1_hash": "e16804426d95bfb0f9b6f197dc295e0d4edbbde4",
    "title": "2021-02-23 - A Cyber Threat Intelligence Self-Study Plan- Part 1",
    "authors": "",
    "file_creation_date": "2022-05-28T16:57:03Z",
    "file_modification_date": "2022-05-28T16:57:03Z",
    "file_size": 81243,
    "plain_text": "# A Cyber Threat Intelligence Self-Study Plan: Part 1\n\n**[medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-1-968b5a8daf9a](https://medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-1-968b5a8daf9a)**\n\nKatie Nickels February 23, 2021\n\nKati\ne\n\n\n[Katie Nickels](https://medium.com/@likethecoins?source=post_page-----968b5a8daf9a--------------------------------)\n\nFeb 23, 2021\n\n\n9 min read\n\nThere are many ways to learn. While some people prefer to have a live instructor in a course,\nothers are great at doing self-study. I teach [SANS FOR578: Cyber Threat Intelligence, which is](https://www.sans.org/cyber-security-courses/cyber-threat-intelligence/)\na great course if you want to learn about cyber threat intelligence (CTI), but I realize not\neveryone can afford it.\n\nHere’s the good news: if you are committed, you can learn a lot of the same concepts that paid\ncourses teach, but on your own. It won’t be the same, but you can still learn a ton if this learning\nstyle works for you. I wanted to share a self-study plan to help out anyone who wants to take\nthe initiative to learn about CTI. There are lots of great resources out there, but I realize as\nyou’re starting out that someone saying “go look at all the things!” isn’t that helpful because\nyou’re not sure where to look. My goal is to bring together free resources I’d recommend\nstudying and provide a minimal framework and question to help tackle them.\n\n\n-----\n\nMy bookshelf! (in part…)\n\n## How to use this plan\n\nHonestly, however it helps you! :) I wrote this with the idea that someone wanting to learn about\nCTI could work through it section-by-section, since some concepts build on each other. Be\nforewarned, if you do this entire thing, it’s going to take a lot of time and effort! I’ve included\nresources to read and watch, things to do, and questions to think about, as well as a few\noptional paid resources if you want more. (Please note that some of the links directly download\na PDF.) Maybe you work through this in order, but maybe you just need to learn more on\nspecific sections. I highly recommend taking notes as you go as a way to reinforce the material\nand hold yourself accountable for thinking through and answering the questions—the critical\n\n\n-----\n\nthinking is key to all of this. To be a good CTI analyst, you can t just consume something, you\nhave to think about what you think of it and how you can apply it. Consider how you want to\norganize your notes before you start (a notebook, a binder with dividers, Google Docs,\nOneNote, or whatever else works for you).\n\nIf you’re new to this industry, I recommend finding someone to help you out as you have\nquestions. As much as I wish I could, I don’t have the energy to do this myself, BUT here’s my\noffer — if you tag me in a tweet (@likethecoins) that explains why you want to go through this\nself-study and why you need a mentor, I would be happy to re-tweet that for you to try to\nconnect you with someone in the community who can help. I’m lucky to have many CTI friends\nwho are passionate about helping newer people in this industry.\n\nI’ll be breaking this plan up as I have time to write each section. I haven’t completely decided on\ntopics for future sections, but here are a couple I plan to include: tools/TIPs, pivoting, open\nsource research, evaluating reports, clustering, indicators/TTPs, threat modeling,\nassessments/uncertainty, and dissemination/writing.\n\nPart 1 topics include:\n\nIntelligence\nCyber Threat Intelligence\nRequirements\nThe CTI Community\nFrameworks and Models\n\n## Intelligence\n\nCTI represents the convergence of two communities: intelligence and cybersecurity. Good CTI\nanalysts will understand fundamentals about intelligence and bring those principles to their\nwork. Sometimes I’ve seen analysts struggle to bring together “traditional intelligence” and\ncybersecurity concepts, so I recommend doing this section first, and being relentless about\nconsidering how it applies to everything that follows.\n\n## Read and watch\n\nRead about the 9 principles of, starting with “1. Focus on Policymaker Concerns” on page\n9 (you can skim the rest). Sherman Kent is a figure you should know about, and these\nprinciples of his analytic doctrine are core to what I think an intelligence analyst should be.\nRead Richards Heuer’s . This is a great intro to several important principles about how we\nthink as intel analysts — including cognitive biases and structured analytic techniques.\nRead about the .\n\n## Things to do\n\n\n-----\n\nGo research Sherman Kent and Richards Heuer — why were they considered important\nin this field (especially in Western intelligence)? Who are other figures that are important\nin intelligence, especially from a -Western perspective? (go research and find at least\none)\nScroll around and go research cognitive biases to find a few that weren’t in Heuer’s book.\nIdentify your own cognitive biases in everyday life. This is HARD, but you can do it if\nyou’re honest with yourself. Tip: anything that makes you angry is a great place to look for\nbiases. Write down your cognitive biases when you find them.\n\n## Questions to think about\n\nWhy do intelligence analysts consider Sherman Kent’s analytic doctrine to be so\nimportant? What would happen in situations where analysts did not follow these\nprinciples? Think of examples for each principle. Can you think of situations you’ve seen\n— whether in intelligence or elsewhere — where people have not followed these\nprinciples? What happened?\nAs you go through the rest of this self-study, when do you see analysts adhering to Kent’s\nanalytic doctrine? When do you see them NOT adhering to it? What is the result?\nWhy does the intelligence cycle exist? What makes intelligence different from raw data?\n\n## Optional paid resource\n\nIf you’re looking to learn more about the US Intelligence Community, I recommend Mark\nLowenthal’s “Intelligence: From Secrets to Policy”. Older editions are almost as good and\nare much cheaper. This is the book I was assigned in my intelligence class in grad school\nand it’s widely used in higher education.\n\n## Cyber Threat Intelligence\n\nThis section is meant to introduce you to some fundamental concepts in CTI and learn a little\nabout its history.\n\n## Read and watch\n\nWatch I did.\nRead from Sergio Caltagirone. Don’t get hung up on the ICS-specific terms (you can skim\nthose parts if you want); think of them as examples of CTI…the point of you reading this\nisn’t to become an ICS expert, it’s to learn some fundamental principles of CTI.\nWatch of Chris Sanders’ free Cuckoo’s Egg course. (At some point, I recommend working\nthrough the whole thing because it’s an amazing free resource from Chris, but for CTI,\nweek 6 is key.) This course covers a lot of the topics below too.\nIf you’re setting up a team/CTI program, watch this I did with Jackie Abrams of\nDomainTools. You need a (free) SANS account to log in, then register so you can view the\nrecording. I also recommend reading, especially if you’re setting up a team.\n\n\n-----\n\nRead a key report in CTI history: the from 2013.\n\n## Things to do\n\nGo find a few different definitions of CTI. How are the definitions different? Which one\nresonates most with you? What is the earliest date you can find the term “cyber threat\nintelligence” used?\nResearch where the term “Advanced Persistent Threat” came from. Go research news\naround the APT1 report — why was that so important?\nResearch and take a few notes on at least one major CTI event or intrusion you can find\nprior to 2013 (when the APT1 report came out). (If you need a place to get started check\nout ) What was noteworthy about the event/intrusion you chose? Can you find any similar\nevents/intrusions (for example, involving similar actors or TTPs) that occurred after it?\n\n## Questions to think about\n\nWhat principles do you see from the intelligence section that you see also apply to CTI?\nHow do you think CTI is the same or different from traditional intelligence?\nHow long has CTI been around as a discipline? As you go through this curriculum, think\nabout who you see as key people and organizations who have driven the development of\nCTI.\nHow does the traditional intelligence cycle translate to CTI?\n\n## Optional paid resources\n\nIf you’re looking for a good book on CTI, I highly recommend Rebekah Brown and Scott\nRoberts’ .\nIf you’re looking for paid CTI courses, I recommend (full disclosure: I teach it!), Joe\nSlowik’s, or any of . is more forensics-based, but the principles he teaches are key to\nthose you should develop as a CTI analyst.\n\n## Requirements\n\nThese are so important that they get their own section, though some of this content is covered\nin the above CTI section.\n\n## Read and watch\n\nRead Scott Roberts’ on requirements.\nWatch Andreas Sfakianakis’ .\nRead Pasquale Stirparo’s .\n\n## Things to do\n\n\n-----\n\nChoose a CTI team at an organization— you can imagine one or use a real one you know\nof (if you’re trying to get a CTI job at a company, choosing that org would be great for this\nexercise). Write down strategic, operational, and tactical intelligence requirements you\nthink that they might have based on your research (or made-up information) about that\ncompany.\n\n## Questions to think about\n\nWhy are requirements so important in CTI? What do you think would happen if a team did\nnot have requirements?\n\n## The CTI Community\n\nIf you want to get involved in CTI, it’s important to get to know the community, including key\npeople and stakeholders. Like anything in life, everyone has different perspectives,\nbackgrounds, and motivations. You should get to know people in the community, while also\nrealizing that we all have our own cognitive biases (see how this builds on earlier material?), so\nyou should always think critically about the perspectives someone presents — and whether you\nagree or disagree (always doing so respectfully without resorting to ad hominem attacks).\n\n## Things to do\n\nCreate a Twitter account (it doesn’t have to be in your real name) and go find people to\nfind in CTI to follow. If you’re not sure who to follow, check out me (@likethecoins) and\nsee who I re-tweet and interact with, or follow some people I mention in this post. From\nyour Twitter research, figure out what hash tags the CTI community uses. Follow these\nhash tags — you might find it easier to use to do this.\nCreate an RSS feed of some resources you see those Twitter accounts share. You could\nuse Feedly’s free offerings to do this, or many . Building a good RSS feed is essential for\nmany CTI roles, as it will allow you to stay up to date with new blog posts and reports.\nRemember that your RSS feed will grow and change over time based on new sources you\nfind and your needs (requirements!!!), so don’t worry about getting it “perfect” to start.\n\n## Questions to think about\n\nWhat people and companies make up the “CTI community”? (For example, vendors are\none group— what are others?) How does the “CTI community” overlap with other parts of\nthe cybersecurity community like DFIR?\nWhat roles do CTI analysts and CTI companies play in the community? What are their\nbackgrounds and what do they do? Do they have a specific angle or agenda? What role\ndoes media play in the CTI community?\nWhat are analysts discussing about CTI on Twitter? Who seems to represent what\nperspectives? What in their background might lead them to have those perspectives?\n\n\n-----\n\nWhat are key events and conferences that happen in the CTI community? Which are free\nand how much do they cost? What approach/angle do different events take?\n\n## Frameworks and Models\n\nThe “big three” frameworks and models I recommend you know about are the Cyber Kill Chain,\nthe Diamond Model, and MITRE ATT&CK(R), though there are several others as well. It’s\nimportant for CTI analysts to understand what these are and how they can be applied, as well\nas what to be cautious of when applying them. Concepts from these frameworks and models\nwill also be sprinkled throughout this self-study plan.\n\n## Read and watch\n\nRead Chris Sanders’ .\nRead the Lockheed Martin Cyber Kill Chain(R) .\nIf you’re a Star Wars fan, read this on applying Star Wars to the Diamond Model. (If you’re\nnot a fan, you can obviously still read it, it just might not make as much sense to you!)\nRead the . It’s dense, but it’s awesome, so break it up into parts if you need to.\nClick around the and skim various sections — maybe the “Quick Start” section or\nwhatever section helps you learn what VERIS is and why you might use it.\n\n## Things to do\n\nTake the I created with my former teammate Adam Pennington, designed to take about\nfour hours. (Note that it’s based on a previous version of ATT&CK, but you’ll still get the\nkey points.)\nFind at least one example of a team (perhaps a cybersecurity vendor) applying each of\nthe frameworks or models you learned about above. Think about your opinion of the pros\nand cons of how they applied it.\nGo look for examples of combining two or more of these frameworks. (Hint: Palo Alto’s\nUnit 42 team has a good one, though there are others!)\n\n## Questions to think about\n\nWhy do CTI analysts use frameworks and models? When would each of these\nframeworks or models be useful?\nWhat are the limitations of frameworks and models? What are the risks of using them?\n\n## The end\n\nI hope you found this first part of the self-study plan useful! If you have requests for topics you’d\nlike to see most, let me know and I can use that to help prioritize what I work on next.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-23 - A Cyber Threat Intelligence Self-Study Plan- Part 1.pdf"
    ],
    "report_names": [
        "2021-02-23 - A Cyber Threat Intelligence Self-Study Plan- Part 1.pdf"
    ],
    "threat_actors": [
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535582,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653757023,
    "ts_modification_date": 1653757023,
    "files": {
        "pdf": "https://archive.orkl.eu/e16804426d95bfb0f9b6f197dc295e0d4edbbde4.pdf",
        "text": "https://archive.orkl.eu/e16804426d95bfb0f9b6f197dc295e0d4edbbde4.txt",
        "img": "https://archive.orkl.eu/e16804426d95bfb0f9b6f197dc295e0d4edbbde4.jpg"
    }
}