{
    "id": "6bc37954-797e-4bb0-90dc-7406ed713fa5",
    "created_at": "2023-01-12T15:08:33.494256Z",
    "updated_at": "2025-03-27T02:17:05.610284Z",
    "deleted_at": null,
    "sha1_hash": "b4c6fff216a7b6a6ed0eaf443b6180266600281f",
    "title": "2018-10-11 - New TeleBots backdoor- First evidence linking Industroyer to NotPetya",
    "authors": "",
    "file_creation_date": "2022-05-27T22:35:53Z",
    "file_modification_date": "2022-05-27T22:35:53Z",
    "file_size": 463635,
    "plain_text": "# New TeleBots backdoor: First evidence linking Industroyer to NotPetya\n\n**[welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/](https://www.welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/)**\n\nOctober 11, 2018\n\nESET’s analysis of a recent backdoor used by TeleBots – the group behind the massive\nNotPetya ransomware outbreak – uncovers strong code similarities to the Industroyer main\nbackdoor, revealing a rumored connection that was not previously proven\n\nESET’s analysis of a recent backdoor used by TeleBots – the group behind the massive\nNotPetya ransomware outbreak – uncovers strong code similarities to the Industroyer main\nbackdoor, revealing a rumored connection that was not previously proven\n\nAmong the most significant malware-induced cybersecurity incidents in recent years were\nthe [attacks against the Ukrainian power grid – which resulted in unprecedented blackouts](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\n[two years in a row – and the devastating NotPetya ransomware outbreak. Let’s take a look](https://www.welivesecurity.com/2017/06/27/new-ransomware-attack-hits-ukraine/)\nat the links between these major incidents.\n\nThe first ever malware-enabled blackout in history, which happened in December 2015, was\n[facilitated by the BlackEnergy malware toolkit. ESET researchers have been following the](https://www.welivesecurity.com/2016/01/04/blackenergy-trojan-strikes-again-attacks-ukrainian-electric-power-industry/)\nactivity of the APT group utilizing BlackEnergy both before and after this milestone event.\n\n\n-----\n\nAfter the 2015 blackout, the group seemed to have ceased actively using BlackEnergy, and\n[evolved into what we call TeleBots.](https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/)\n\nIt is important to note that when we describe ‘APT groups’, we’re drawing connections\nbased on technical indicators such as code similarities, shared C&C infrastructure, malware\nexecution chains, and so on. We’re typically not directly involved in the investigation and\nidentification of the individuals writing the malware and/or deploying it, and the interpersonal\nrelations between them. Furthermore, the term ‘APT group’ is very loosely defined, and\noften used simply to cluster the abovementioned malware indicators. This is also one of the\nreasons why we refrain from speculations with regard to attributing attacks to nation states\nand such.\n\nThat said, we have observed and documented ties between the BlackEnergy attacks – not\nonly those against the Ukrainian power grid but against various sectors and high-value\ntargets – and a series of campaigns (mostly) against the Ukrainian financial sector by the\nTeleBots group. In June 2017, when many large corporations worldwide were hit by the\nDiskcoder.C ransomware (aka Petya and NotPetya) – most probably as unintended\ncollateral damage – we discovered that the outbreak started spreading from companies\nafflicted with a [TeleBots backdoor, resulting from the](https://www.welivesecurity.com/2017/07/04/analysis-of-telebots-cunning-backdoor/) compromise of the financial software\nM.E.Doc, popular in Ukraine.\n\nSo how does Industroyer, the sophisticated malware framework used to cause the blackout\n[of December 2016, fit into all of this? Right after we publicly reported our discovery, some](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\nsecurity companies and news media outlets started to speculate that Industroyer was also\narchitected by the BlackEnergy/Telebots group (sometimes also referred to as Sandworm).\nYet, no concrete evidence has been publicly disclosed until now.\n\nIn April 2018, we discovered new activity from the TeleBots group: an attempt to deploy a\nnew backdoor, which ESET detects as Win32/Exaramel. Our analysis suggests that this\n[TeleBots’ backdoor is an improved version of the main Industroyer backdoor – the first](https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf)\npiece of evidence that was missing.\n\n\n-----\n\n## Analysis of the Win32/Exaramel backdoor\n\nThe Win32/Exaramel backdoor is initially deployed by a dropper. Metadata in this dropper\nsuggest that the backdoor is compiled using Microsoft Visual Studio just before deployment\non a particular, victimized computer.\n\nFigure 1. PE timestamp in the dropper of Win32/Exaramel backdoor\n\nOnce executed, the dropper deploys the Win32/Exaramel backdoor binary in the Windows\nsystem directory and creates and starts a Windows service named wsmprovav with the\ndescription “Windows Check AV”. The filename and the Windows service description are\nhardcoded into the dropper.\n\n\n-----\n\nFigure 2. Registry settings of the Windows service created by the Win32/Exaramel backdoor\n\nIn addition, the dropper writes the backdoor’s configuration into the Windows registry, in\nXML format.\n\nFigure 3. Win32/Exaramel backdoor XML configuration\n\nThe configuration contains several blocks:\n\nInterval – time in milliseconds used for Sleep function\n\nServers – list of command and control (C&C) servers\n\nCheck – website used to determine whether the host has an internet connection available\n\nProxy – proxy server on the host network\n\nStorage – path used for storing files scheduled for exfiltration\n\nAs can be seen from the first line of the configuration, the attackers are grouping their\ntargets based on the security solutions in use. Similar behavior can be found in the\nIndustroyer toolset – specifically some of the Industroyer backdoors were also disguised as\nan AV-related service (deployed under the name avtask.exe) and used the same grouping.\n\nAnother interesting fact is that the backdoor uses C&C servers with domain names that\nmimic domains belonging to ESET. In addition to esetsmart[.]org from the above mentioned\nconfiguration, we found another similar domain: um10eset[.]net, which was used by\n\n\n-----\n\nrecently-discovered Linux version of Telebots malware. It is important to note that these\nattacker-controlled servers are in no way related to ESET’s [legitimate server infrastructure.](https://support.eset.com/kb332/?locale=en_US&viewlocale=en_US)\nCurrently, we haven’t seen Exaramel use domains that mimic other security companies.\n\nOnce the backdoor is running, it connects to a C&C server and receives commands to be\nexecuted. Here is a list of all available commands:\n\nLaunch process\nLaunch process under specified Windows user\nWrite data to a file in specified path\nCopy file into storage sub-directory (Upload file)\nExecute shell command\nExecute shell command as specified Windows user\nExecute VBS code using MSScriptControl.ScriptControl.1\n\nThe code of the command loop and implementations of the first six commands are very\nsimilar to those found in a backdoor used in the Industroyer toolset.\n\nFigure 4. Comparison between decompiled code of the Win32/Exaramel backdoor (on the left) and\n\nthe Win32/Industroyer backdoor (on the right)\n\nBoth malware families use a report file for storing the resulting output of executed shell\ncommands and launched processes. In case of the Win32/Industroyer backdoor, the report\nfile is stored in a temporary folder under a random filename; in case of the Win32/Exaramel\nbackdoor, the report file is named report.txt and its storage path is defined in the backdoor’s\nconfiguration file.\n\n\n-----\n\nIn order to redirect standard output (stdout) and standard error (stderr) to the report file,\nboth backdoors set the hStdOutput and hStdError parameters to a handle of the report file.\nThis is another design similarity between these malware families.\n\nFigure 5. Comparison between decompiled code of the Win32/Exaramel backdoor (on the top) and\n\nthe Win32/Industroyer backdoor (on the bottom)\n\nIf the malware operators want to exfiltrate files from the victim’s computer, they just need to\ncopy those files into the data sub-directory of the storage path defined in the configuration.\nOnce the backdoor is about to make a new connection to the C&C server it will\n\n\n-----\n\nautomatically compress and encrypt all these files before sending them.\n\nThe main difference between the backdoor from the Industroyer toolset and this new\nTeleBots backdoor is that the latter uses XML format for communication and configuration\ninstead of a custom binary format.\n\n## Password stealing malicious tools\n\nAlong with the Exaramel backdoor, Telebots group uses some of their old tools, including a\npassword stealer (internally referred as CredRaptor or PAI by the attackers) and a slightlymodified Mimikatz.\n\nThe CredRaptor custom password-stealer tool, exclusively used by this group since 2016,\nhas been slightly improved. Unlike previous versions, it collects saved passwords not only\nfrom browsers, but also from Outlook and many FTP clients. Here is a list of supported\napplications:\n\nBitKinex FTP\nBulletProof FTP Client\nClassic FTP\nCoffeeCup\nCore FTP\nCryer WebSitePublisher\nCuteFTP\nFAR Manager\nFileZilla\nFlashFXP\nFrigate3\nFTP Commander\nFTP Explorer\nFTP Navigator\nGoogle Chrome\nInternet Explorer 7 – 11\nMozilla Firefox\nOpera\nOutlook 2010, 2013, 2016\nSmartFTP\nSoftX FTP Client\nTotal Commander\nTurboFTP\nWindows Vault\nWinSCP\nWS_FTP Client\n\n\n-----\n\nThis improvement allows attackers to collect webmaster s credentials for websites and\ncredentials for servers in internal infrastructure. Once access to such servers is obtained,\nattackers could plant additional backdoors there. Quite often these servers are operated by\nOSes other than Windows, so attackers have to adapt their backdoors.\n\nIn fact, during our incident response, we discovered a Linux backdoor used by TeleBots.\nWe named this backdoor Linux/Exaramel.A.\n\n## Analysis of the Linux/Exaramel backdoor\n\nThe backdoor is written in the Go programming language and compiled as a 64-bit ELF\nbinary. Attackers can deploy the backdoor in a chosen directory under any name.\n\nIf the backdoor is executed by attackers with the string ‘none’ as a command line argument,\nthen it attempts to use persistence mechanisms in order to be started automatically after\nreboot. If the backdoor is not executed under the root account, then it uses the crontab file.\nHowever, if running as root, it supports different Linux init systems. It determines which init\nsystem is currently in use by executing the command:\n\nstrings /sbin/init | awk ‘match($0, /(upstart|systemd|sysvinit)/){ print substr($0, RSTART,\nRLENGTH);exit; }’\n\nBased on the result of this command, it uses the following hardcoded locations for its\npersistence:\n\n**Init system** **Location**\n\nsysvinit /etc/init.d/syslogd\n\nupstart /etc/init/syslogd.conf\n\nsystemd /etc/systemd/system/syslogd.service\n\nDuring startup, the backdoor attempts to open a configuration file named config.json, which\nis stored in the same directory as the backdoor. If this configuration file does not exist, then\na new file is created. The configuration is encrypted using the key s0m3t3rr0r via the RC4\nalgorithm.\n\nFigure 6. Decrypted JSON configuration of the Linux/Exaramel backdoor\n\n\n-----\n\nThe backdoor connects to the hardcoded C&C server (by default 176.31.225[.]204 in the\nsample we have seen to date) or to the C&C server listed in the configuration files Hosts\nvalue. The communication is sent over HTTPS. The backdoor supports the following\ncommands:\n\n**Command** **Purpose**\n\nApp.Update Updates itself to a newer version\n\nApp.Delete Deletes itself from the system\n\nApp.SetProxy Sets proxy in configuration\n\nApp.SetServer Updates C&C server in configuration\n\nApp.SetTimeout Sets timeout value (time between connections to C&C server)\n\nIO.WriteFile Downloads a file from a remote server\n\nIO.ReadFile Uploads a file from local disk to C&C server\n\nOS.ShellExecute Executes a shell command\n\n## Conclusion\n\nThe discovery of Exaramel shows that the TeleBots group is still active in 2018 and the\nattackers keep improving their tools and tactics.\n\nThe strong code similarity between the Win32/Exaramel backdoor and the Industroyer main\nbackdoor is the first publicly-presented evidence linking Industroyer to TeleBots, and hence\nto NotPetya and BlackEnergy. While the possibility of false flags – or a coincidental code\nsharing by another threat actor – should always be kept in mind when attempting attribution,\nin this case we consider it unlikely.\n\nOf particular interest is the fact that the attackers started to use ESET-themed domain\nnames in their operations. It should be noted that these domains were used by\ncybercriminals in order to hide their malicious network activity from defenders and are in no\nway related to ESET’s server infrastructure. The list of legitimate domains used by ESET\n[products can be found here.](https://support.eset.com/kb332/?locale=en_US&viewlocale=en_US)\n\nIt should also be noted that these Win32 and Linux Exaramel backdoors were detected at\nan organization that is not an industrial facility. ESET shared its findings ahead of time with\nUkrainian investigation authorities and thanks to this cooperation the attack was\nsuccessfully localized and prevented.\n\nESET researchers will continue to monitor the activity of this group.\n\n\n-----\n\n## Indicators of Compromise (IoCs)\n\n**ESET detection names**\n\nWin32/Exaramel trojan\n\nWin32/Agent.TCD trojan\n\nLinux/Agent.EJ trojan\n\nLinux/Exaramel.A trojan\n\nWin32/PSW.Agent.OEP trojan\n\nWin32/RiskWare.Mimikatz.Z application\n\nWin64/Riskware.Mimikatz.AI application\n\n**SHA-1 HASHES**\n\n**TeleBots Win32/Exaramel backdoor**\n\n65BC0FF4D4F2E20507874F59127A899C26294BC7\n\n3120C94285D3F86A953685C189BADE7CB575091D\n\n**Password Stealer**\n\nF4C4123849FDA08D1268D45974C42DEB2AAE3377\n\n970E8ACC97CE5A8140EE5F6304A1E7CB56FA3FB8\n\nDDDF96F25B12143C7292899F9D5F42BB1D27CB20\n\n64319D93B69145398F9866DA6DF55C00ED2F593E\n\n1CF8277EE8BF255BB097D53B338FC18EF0CD0B42\n\n488111E3EB62AF237C68479730B62DD3F52F8614\n\n**Mimikatz**\n\n458A6917300526CC73E510389770CFF6F51D53FC\n\nCB8912227505EF8B8ECCF870656ED7B8CA1EB475\n\n**Linux/Exaramel**\n\nF74EA45AD360C8EF8DB13F8E975A5E0D42E58732\n\n\n-----\n\nWarning! All of the servers with these IP addresses were part of the Tor network, which\nmeans that the use of these indicators could result in a false positive match.\n\n**C&C servers**\n\num10eset[.]net (IP: 176.31.225.204)\n\nesetsmart[.]org (IP: 5.133.8.46)\n\n11 Oct 2018 - 01:57PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-10-11 - New TeleBots backdoor- First evidence linking Industroyer to NotPetya.pdf"
    ],
    "report_names": [
        "2018-10-11 - New TeleBots backdoor- First evidence linking Industroyer to NotPetya.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536113,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653690953,
    "ts_modification_date": 1653690953,
    "files": {
        "pdf": "https://archive.orkl.eu/b4c6fff216a7b6a6ed0eaf443b6180266600281f.pdf",
        "text": "https://archive.orkl.eu/b4c6fff216a7b6a6ed0eaf443b6180266600281f.txt",
        "img": "https://archive.orkl.eu/b4c6fff216a7b6a6ed0eaf443b6180266600281f.jpg"
    }
}