{
    "id": "6be0acca-0d70-4e70-8371-e55460584168",
    "created_at": "2023-01-12T15:06:06.815788Z",
    "updated_at": "2025-03-27T02:08:36.152667Z",
    "deleted_at": null,
    "sha1_hash": "3e0601770e6e3a18b564583d0c6619514d7abfc6",
    "title": "2020-12-11 - MountLocker Ransomware-as-a-Service Offers Double Extortion Capabilities to Affiliates",
    "authors": "",
    "file_creation_date": "2022-05-28T22:09:47Z",
    "file_modification_date": "2022-05-28T22:09:47Z",
    "file_size": 1421639,
    "plain_text": "# MountLocker Ransomware-as-a-Service Offers Double Extortion Capabilities to Affiliates\n\n**[blogs.blackberry.com/en/2020/12/mountlocker-ransomware-as-a-service-offers-double-extortion-capabilities-to-affiliates](https://blogs.blackberry.com/en/2020/12/mountlocker-ransomware-as-a-service-offers-double-extortion-capabilities-to-affiliates)**\n\nThe BlackBerry Research & Intelligence Team\n\n[1. BlackBerry ThreatVector Blog](https://blogs.blackberry.com/en.html)\n2. MountLocker Ransomware-as-a-Service Offers Double Extortion Capabilities to Affiliates\n\n[Since mid-October 2020, the BlackBerry Incident Response Team have been actively tracking MountLocker affiliate campaigns as part of](https://www.blackberry.com/us/en/services/blackberry-cybersecurity-consulting#how-can-i-handle-a-breach)\nongoing investigations. The affiliates are typically responsible for the initial compromise, distribution of MountLocker ransomware, and\nexfiltration of sensitive client data during a breach.\n\n[In coordination with the BlackBerry Research and Intelligence Team, our researchers and investigators have produced the following wide-](https://blogs.blackberry.com/en/author/the-blackberry-research-and-intelligence-team)\nranging report on MountLocker. It covers this threat’s operators, affiliates, ransomware, decryptor, and associated tactics, techniques, and\nprocedures (TTPs).\n\n**Key Findings**\n\nMountLocker is a Ransomware-as-a-Service (RaaS), active since July 2020.\nThe MountLocker ransomware was updated during early November 2020 to broaden the targeting of file types and evade security\nsoftware.\nVictim’s files are encrypted using ChaCha20, and file encryption keys are encrypted using RSA-2048.\nThe ransomware appears to be somewhat secure; there are no trivial weaknesses allowing for easy key recovery and decryption of\ndata. MountLocker does however use a cryptographically insecure method for key generation that may be prone to attack.\nMountLocker affiliates were observed:\n\nUsing commercial-off-the-shelf tools such as CobaltStrike Beacon to deploy MountLocker ransomware.\nExfiltrating sensitive client data via FTP prior to encryption.\nEngaging in blackmail and extortion tactics (alongside the operators) to coerce victims into making hefty payments to recover and\nprevent the public disclosure of stolen data.\nOwing to the RaaS and affiliate program, targeting is geographically diverse and becoming more prominent.\n\n**Operators and Affiliates**\n\nOur investigations into MountLocker-related affiliate campaigns suggests that threat actors often used remote desktop (RDP) with\ncompromised credentials to gain access to a victim’s environment. In one instance, after establishing a foothold in an organisation, there was\na delay of several days before activity resumed. It is likely that the threat actors were negotiating with the MountLocker operators to join their\n\n\n-----\n\na ate p og a a d obta t e a so a e du g t s pause Upo obta g t e ou t oc e a so a e, t e t eat acto s e e\nobserved returning with several “public” tools, including CobaltStrike Beacon and AdFind from Joeware. Over a period of approximately 24\nhours:\n\nAdFind is used to perform network reconnaissance.\nA custom batch file is used to exfiltrate sensitive documents from key systems via FTP.\n\nCobaltStrike Beacon is leveraged to spread laterally and deploy the MountLocker ransomware.\n\n_Figure 1. MountLocker kill-chain_\n\nThe following crude batch script (sanitized for confidentiality reasons) was used by the attackers to perform exfiltration of sensitive data. The\nscript starts by uploading a “desktop.ini” file to the sever using curl, then enumerates a hardcoded root directory (localdir) and all\nsubdirectories. Each file is uploaded to the FTP server as it goes:\n\n\n-----\n\n_Figure 2. MountLocker FTP exfiltration batch script_\n\nSuccessful MountLocker affiliates have been known to seek multi-million-dollar payments for decryption services and to prevent public\ndisclosure of stolen data. The MountLocker operators are currently hosting a site on the dark web where they announce their recent targets\nand supply links to leaked data. The site is currently listing five victims; we believe the actual number to be far greater:\n\n\n-----\n\nFigure 3. MountLocker site, announcing targets and leaks\n\n\n-----\n\n_Figure 4. MountLocker full data dump_\n\n**Ransomware**\n\nThe MountLocker ransomware, at less than 100Kb in size, is lightweight and simple in construction. It is typically deployed as either an x86 or\nx64 Windows portable executable (PE) file, although occasionally as a Microsoft Installer (MSI) package:\n\n[Figure 5. Composition of a x64 MountLocker PE file](https://github.com/blackberry/pe_tree)\n\n\n-----\n\n**eatu es**\n\nSimple, lightweight, and efficient ransomware\nSemi-unique file extension per victim organization\nUses ChaCha20 for file encryption and RSA-2048 for key encryption\nWeak key generation using GetTickCount\n\n**Behavior**\n\nUpon execution, MountLocker will process any command-line arguments supplied by the operators:\n\n**Argument** **Description**\n\n/log:[C|F] C = Log to console\n\nF = Log to file (.log extension)\n\n/scan:[L|N|S] L = Local drives\n\nN = Network drives\n\nS = Network shares (currently unimplemented)\n\n\n/marker:[a-zA-Z0-9_-.]\n{32}\n\n\nCreate a marker file with the specified filename in each volume's root directory before volume encryption\nbegins\n\n\n/nodel Prevent MountLocker from deleting itself after execution (typically used when launched as an MSI)\n\n_Figure 6. Command-line arguments_\n\nNext, MountLocker initializes debug logging and creates a run-once mutex. The mutex is based on the serial number of the volume containing\nthe Windows directory, and yields a 32-character uppercase hexadecimal string:\n\n_Figure 7. Run-once mutex_\n\nThe ransomware then proceeds to initialize the encryption keys and create the ransom note. MountLocker contains an embedded 2048-bit\nRSA public key supplied by the attackers. It is imported and used to encrypt a random session key generated using the cryptographically\ninsecure GetTickCount API. This offers the slim possibility that knowing the timestamp counter value during ransomware execution could lead\nto the session key being brute-forced.\n\nAfter initializing the encryption keys, MountLocker will create the ransom note from a template and add the ransomware file extension to the\nregistry. When a user double clicks an encrypted file, the ransom note is opened via Explorer. The file extension is a hex encoded 4-byte (or 8\ncharacter) “Client ID”, which is unique per victim organization:\n\n\n-----\n\nFigure 8. Encryption key and ransom note setup\n\n_Figure 9. Attackers' RSA public key embedded in MountLocker_\n\nThe ransom note can vary slightly between samples, and in some cases incorrectly states that AES encryption was used. It contains a Tor\n.onion URL to contact the MountLocker operators via a “dark web” chat service to discuss a price for decryption software:\n\n\n-----\n\n_Figure 10. Typical Mountlocker ransom note_\n\nAfter initialization is complete, prior to encryption, MountLocker will attempt to terminate a range of processes belonging to security software,\noffice applications, browsers, and databases:\n\nagntsvc firefox outlook tbirdconfig\n\nbengine infopath OWSTIMER thebat\n\nbenetns isqlplussvc postgres thunderbird\n\nberemote msaccess powerpnt veeam\n\nbeserver mspub pvlsvr visio\n\ndbeng50 mydesktopservice SAVAdminService VxLockdownServer\n\ndbsnmp mydesktopqos SavService winword\n\ndfssvc mysql sql wordpad\n\ndfsrs ocautoupds sqbcoreservice wsstracing\n\nEduLink2SIMS ocomm sophos WSSADMIN\n\n\n-----\n\nencsvc ocssd steam xfssvccon\n\nexcel onenote swc_service\n\nfdhost oracle synctime\n\nMountLocker then proceeds to enumerate first local and then remote volumes looking for files to encrypt. For each volume found, it takes the\nfollowing steps:\n\n1.   If specified via command-line (using /marker:) create a marker file on the root of the volume.\n\n2.   Recursively iterate over all files/folders:\n\na.   If the FindFirstFile function returns ERROR_ACCESS_DENIED, try to change permissions of the root directory by setting the owner and\nDACL (discretionary access control list) values in its security descriptor to the same ones as the parent process.\n\n3.   For each file found:\n\na.   Check whether the parent folder path is one of the following, and therefore excluded from encryption:\n\nSystem Volume Information WINNT\n\n$RECYCLE.BIN NVIDIA\n\nWindows SYSTEM.SAV\n\n$WINDOWS.~BT PerfLog\n\nWindows.old Intel\n\nProgram Files Games\n\nProgram Files (x86) Temp\n\nWINNT Tmp\n\nb.    Check if the file extension is allowed. MountLocker contains a huge list of over 2600 file extensions that it will target for encryption,\nincluding known file extensions for databases, documents, archives, images, accounting software, security software, source code, games,\nbackups and various custom data formats. Common file extensions for executable files (.exe, .dll, .sys) are not targeted.\n\nc.    Ensure the filename is not “RecoveryManual.html”.\n\nd.   Memory map the file.\n\ne.   Generate a random encryption key for the file, again using the cryptographically insecure GetTickCount API (via rdtsc, and without the\nuse of a Sleep API call!):\n\n\n-----\n\n_Figure 11. Create ChaCha20 file key_\n\na.   Encrypt the file key with the session key using ChaCha20, and write both the encrypted file key (32-bytes) and encrypted session key\n(256-bytes) to the file:\n\n_Figure 12. Encrypt the file key with the session key and write the file header_\n\na.   Memory map the input file and ChaCha20; encrypt it using the file key in 64MB chunks:\n\n_Figure 13. Encrypt file contents_\n\na.   Move the file and restore the owner and DACL:\n\n\n-----\n\n_Figure 14. Move file after encryption and optionally set named security information_\n\nPost encryption, the composition of a MountLocker encrypted file is as follows, where:\n\nThe red highlighted region is the 32-byte ChaCha20 file key, encrypted using ChaCha20 with the session key.\nThe green region is the ChaCha20 session key, encrypted using RSA with the attackers’ 2048-bit public key.\n\nThe blue highlighted region is the original file contents, encrypted using ChaCha20 with the randomly generated file key.\n\n_Figure 15. MountLocker file composition_\n\nAfter the encryption process is completed, MountLocker will delete volume shadow copies to prevent the restoration of the encrypted files:\n\n\n-----\n\n_Figure 16. Delete volume shadow copies_\n\nFinally, in the absence of the /nodel command-line argument, MountLocker will drop the following batch file to remove itself from disk:\n\n_Figure 17. MountLocker cleanup batch file_\n\n_Figure 18. Execute cleanup batch file_\n\n**Version 2**\n\nMountLocker version 2 first surfaced in the wild during late November 2020, with a compilation timestamp from earlier in the month\n(November 6th). It is considerably smaller in size than the previous versions (approximately 50% smaller, at 46Kb for the x64 build) owing to\nthe removal of the vast file extension “include” list. Instead, MountLocker version 2 turns this process on its head, and targets a far smaller list\nof file extensions to explicitly exclude from encryption:\n\n.exe, .dll, .sys, .msi, .mui, .inf, .cat, .bat, .cmd, .ps1, .vbs, .ttf, .fon, .lnk\n\nOverall, the code bears approximately 70% similarity to the initial MountLocker release, with no apparent changes to:\n\nCryptographic initialization and ransom note creation\nClient ID calculations\nVolume traversal\nDACL modifications\nChaCha20/RSA encryption\n\nAs for updates, the most obvious initial differences are the reworded debug messages:\n\n\n-----\n\n_Figure 19. Updated debug messages in MountLocker version 2_\n\nThe biggest change is in the process termination code and deletion of volume shadow copies. This is now implemented using a PowerShell\nscript that gets written to a temporary directory and executed via a PowerShell one-liner prior to encryption:\n\n_Figure 20. Drop and launch PowerShell script from MountLocker version 2_\n\nThe script itself will simply Base64 decode and gzip decompress a further PowerShell script, which is then invoked using iex:\n\n_Figure 21. MountLocker PowerShell decoder_\n\nOnce decoded, the underlying PowerShell script deletes volume shadow copies then attempts to terminate all services and processes\nrunning outside of the Windows directory. The script will avoid terminating processes belonging to itself, Tor, PowerShell, several browsers,\nand a long list of security software (allowing the victim to still use Tor to contact the MountLocker operators to negotiate payment):\n\n\n-----\n\n_Figure 22. Process termination script in MountLocker version 2_\n\nMountLocker aims to evade security software that is not configured to terminate the entire process tree when handling alerts. It does this\nthrough the deletion of volume shadow copies and termination of processes in a separate process (powershell.exe).\n\nFinally, in addition to removing the large file extensions list, MountLocker version 2 has an updated list of folders that are excluded from file\nencryption:\n\n:\\\\Windows\\\\ :\\\\ProgramData\\\\Microsoft\\\\\n\n:\\\\System Volume Information\\\\ \\\\Local\\\\Packages\\\\\n\n:\\\\$RECYCLE.BIN\\\\ :\\\\ProgramData\\\\Packages\\\\\n\n:\\\\SYSTEM.SAV \\\\Windows Defender\\\\\n\n:\\\\WINNT \\\\microsoft shared\\\\\n\n:\\\\$WINDOWS.~BT\\\\ \\\\Google\\\\Chrome\\\\\n\n:\\\\Windows.old\\\\ \\\\Mozilla Firefox\\\\\n\n:\\\\PerfLog\\\\ \\\\Mozilla\\\\Firefox\\\\\n\n\\\\WindowsApps\\\\ \\\\Internet Explorer\\\\\n\n\\\\Microsoft\\\\Windows\\\\ \\\\MicrosoftEdge\\\\\n\n\\\\Roaming\\\\Microsoft\\\\ \\\\Tor Browser\\\\\n\n\\\\Local\\\\Microsoft\\\\ \\\\AppData\\\\Local\\\\Temp\\\\\n\n\\\\LocalLow\\\\Microsoft\\\\\n\n_Figure 23. Updated exclude folders in MountLocker version 2_\n\n**Decryptor**\n\nThe only MountLocker decryptor we’ve observed in the public domain is heavily based on the first x86 MountLocker ransomware codebase. It\nshares about 70% of the original functionality, including the run-once mutex, process termination and volume traversal.\n\n\n-----\n\nu g t e dec ypt o p ocess, t e p og a sea c a oca a d et o o u es, as e as apped s a es, oo g o e c ypted es\nThe encrypted file and session keys are read from each file, and a checksum of the session key is computed. If the checksum doesn’t match\na global session key checksum then the attackers RSA private key will be imported and used to decrypt the session key. The decrypted\nsession key is then used to decrypt the file key using ChaCha20:\n\n_Figure 24. Read and decrypt the file key using the session key_\n\nFigure 25. Load the attacker’s RSA private and decrypt the session key\n\n_Figure 26. Attacker's RSA private key embedded in the decryptor_\n\nFinally, the file key is used to ChaCha20 decrypt the file in 64MB chunks:\n\n\n-----\n\n_Figure 27. ChaCha20 file decryption_\n\n**Conclusions**\n\nThe MountLocker Operators are clearly just warming up. After a slow start in July they are rapidly gaining ground, as the high-profile nature of\nextortion and data leaks drive ransom demands ever higher. MountLocker affiliates are typically fast operators, rapidly exfiltrating sensitive\ndocuments and encrypting them across key targets in a matter of hours.\n\nSince its inception, the MountLocker group have been seen to both expand and improve their services and malware. While their current\ncapabilities are not particularly advanced, we expect this group to continue developing and growing in prominence over the short term.\n\n[Our AI-based endpoint security solution BlackBerry® Protect® has thwarted several MountLocker attacks in customer’s environments,](https://www.blackberry.com/us/en/products/blackberry-protect)\npreventing the ransomware from ever being deployed. BlackBerry Protect uses machine learning to provide an automated safeguard against\nboth simple and sophisticated threats. It does this without the need for signatures, heuristics, sandboxes, cloud connections, or extensive\nhuman intervention.\n\n**Appendix**\n\n**Indicators of Compromise (IoCs)**\n\n**Indicator** **Type** **Description**\n\n4b917b60f4df6d6d08e895d179a22dcb7c38c6a6a6f39c96c3ded10368d86273 SHA256 MountLocker (x86) v1\n\nf570d5b17671e6f3e56eae6ad87be3a6bbfac46c677e478618afd9f59bf35963 SHA256 MountLocker (x64) v1\n\n964170baffd8f88e6c7fc189d43dfaa32c8dbcee02d7afa573058f9af16dac3b SHA256 MountLocker (x86) v1\n\n30050b3673c720729cd6a61803059b16dd3aa526683e7342aae0261e4c78fa83 SHA256 MountLocker (MSI) v1\n\n31630d16f4564c7a214a206a58f60b7623cd1b3abb823d10ed50aa077ca33585 SHA256 MountLocker (x86) v1\n\n0aa8099c5a65062ba4baec8274e1a0650ff36e757a91312e1755fded50a79d47 SHA256 MountLocker (x64) v1\n\n5eae13527d4e39059025c3e56dad966cf67476fe7830090e40c14d0a4046adf0 SHA256 MountLocker (x64) v1\n\n\n-----\n\n96056182d93b582b3d56bd82a560bafd5cde413c4ca216f4f62ab446c61c9b6a SHA256 MountLocker (x86) v1\n\n2d2d2e39ccae1ff764e6618b5d7636d41ac6e752ce56d69a9acbb9cb1c8183d0 SHA256 MountLocker (x64) v2\n\nc0aa74bc157788d0329b81ff87fc4d4b764d4823159bccd1f538cc0301a625f4 SHA256 MountLocker decryptor for 3005…\nand 3163…\n\nqiludmxlqqotacf62iycexcohbka4ezresf5jmwdoh7iyk3tgguzaaqd.onion Domain MountLocker contact URL\n\nzsa3wxvbb7gv65wnl7lerslee3c7i27ndqghqm6jt2priva2qcdponad.onion Domain MountLocker contact URL\n\nbr3o5we2252csfnhotfbsfx7ch5csivuuidhdefbhmg2zmbqebs6znad.onion Domain MountLocker contact URL\n\n55ltvpboyvhg7ezmefe72jgioukb52t6nkdiuis5yishczlbtadmr2qd.onion Domain MountLocker contact URL\n\nfzl2tjt7hoyf4oeynma57wjk4w5cyi37o7ihzlkvfsjtxmk7elzp7iqd.onion Domain MountLocker contact URL\n\n6mlzahkc7vejytppbqhqjou4ipftgs3gizof2x4zklblliayhsqb3wad.onion Domain MountLocker contact URL\n\n.ReadManual.[0-9]{8}$ Filename MountLocker file extension\n\n\nvssadmin.exe delete shadows /all /Quiet Commandline\n\n\nHKCU\\Software\\Classes\\.<CLIENT_ID>\\shell\\Open\\command\\ @=\"explorer.exe\nRecoveryManual.html\"\n\npowershell.exe -windowstyle hidden -c $mypid='%u';\n\n[System.IO.File]::ReadAllText('%s')|iex\n\n\nRegistry\nvalue\n\nCommandline\n\n\nMountLocker - Delete volume shadow\ncopies\n\nMountLocker – Register file extension\nto\nopen readme with explorer.\n\nMountLocker v2 – Used to execute\nprocess termination script\n\nUsed to invoke encoded PowerShell\n(containing CobaltStrike beacon)\n\n\npowershell -nop -w hidden -encodedcommand Commandline\n\n**MITRE ATT&CK**\n\n\n**Tactic** **ID** **Name** **Description**\n\n\nInitial\nAccess\n\n\n[T1078](https://attack.mitre.org/techniques/T1078/) Valid Accounts Suspected initial compromise using stolen\ncredentials\n\n\n[T1133](https://attack.mitre.org/techniques/T1133/) External Remote\nServices\n\n\nRDP used to leverage a foothold\n\n\nExecution [T1059.001](https://attack.mitre.org/techniques/T1059/001/) Command and Scripting Interpreter: PowerShell PowerShell wrapped CobaltStrike Beacon\n\n[T1569](https://attack.mitre.org/techniques/T1569/) System Services PowerShell wrapped CobaltStrike Beacon\n\n\nPersistence [T1546.001](https://attack.mitre.org/techniques/T1546/001/) Event Triggered Execution: Change Default File\nAssociation\n\n\nMountLocker registers its file extension\n(.ReadManual.[0-9]{8}$) to open with\nexplorer.exe\n\nMountLocker modifies file DACL\n\n\nDefense\nEvasion\n\n\n[T1222.001](https://attack.mitre.org/techniques/T1222/001/) File and Directory Permissions Modification:\nWindows File and Directory Permissions\nModification\n\n\n[T1070.004](https://attack.mitre.org/techniques/T1070/004/) Indicator Removal on\nHost: File Deletion\n\n\nMountLocker deletes itself post execution\n\n\n-----\n\nDiscovery [T1069.002](https://attack.mitre.org/techniques/T1069/002/) Permission Groups Discovery: Domain Groups AdFind used for reconnaissance\n\nExfiltration [T1020](https://attack.mitre.org/techniques/T1020/) Automated Exfiltration Uploads sensitive documents via FTP\n\n\nCommand\nand Control\n\n\n[T1071](https://attack.mitre.org/techniques/T1071/) Application Layer Protocol CobaltStrike Beacon (SMB/named pipe)\n\n\n[T1071.001](https://attack.mitre.org/techniques/T1071/001/) Application Layer\nProtocol: Web\nProtocols\n\n\nCobaltStrike Beacon (HTTP)\n\n\nImpact [T1486](https://attack.mitre.org/techniques/T1486/) Data Encrypted for Impact Files encrypted for ransom\n\n\n[T1490](https://attack.mitre.org/techniques/T1490/) Inhibit System\nRecovery\n\n\nMountLocker uses vssadmin.exe to delete all\nvolume shadow copies\n\n\n[T1489](https://attack.mitre.org/techniques/T1489/) Service Stop MountLocker stops various system services prior to\nencryption\n\nSoftware [S0154](https://attack.mitre.org/software/S0154/) Cobalt Strike CobaltStrike Beacon (HTTP/SMB)\n\n**Hunting**\n\nThe following VirusTotal query uses a simple content search to find related samples:\n\n[https://www.virustotal.com/gui/search/content%253A%2522Crypt%2520Avg%253A%2522/files](https://www.virustotal.com/gui/search/content%253A%2522Crypt%2520Avg%253A%2522/files)\n\nThe following VirusTotal query uses a behaviour search to find related samples:\n\n[https://www.virustotal.com/gui/search/behaviour_files%253A%2522.readmanual.%2522/files](https://www.virustotal.com/gui/search/behaviour_files%253A%2522.readmanual.%2522/files)\n\n**YARA**\n\nThe following YARA rule looks for common MountLocker ransomware strings in the .rdata section of a PE file:\n\n\n-----\n\nimport pe\n\nrule Ransomware_MountLocker\n{\nmeta:\ndescription = \"Rule to detect MountLocker ransomware\"\nauthor = \"BlackBerry Research and Intelligence Team\"\ndate = \"2020-11-24\"\n\nstrings:\n$a0 = \"cid=%CLIENT_ID%\"\n$a1 = \"<h1>Your ClientId:</h1>\"\n$a2 = \"<title>RECOVERY MANUAL</title>\"\n$a3 = \".ReadManual.%0.8X\" wide\n$a4 = \"RecoveryManual.html\" wide\n$a5 = \"Crypt Avg:\" wide ascii\n$a6 = \"[I] Check double run...\"\n$a7 = \"[W] SKIP FOLDER BL: %ws\"\n$a8 = \"[W] SKIP FILE RP(%0.8X): %ws\"\n$a9 = \"[E] ERROR: malloc(LOCK_CONTEXT)=%u\"\n$aA = \"[I] SCAN VOLUME: %ws\"\n$aB = \"[E] ERROR: RSA(MasterKey)=%u\"\n$aC = \"locker.check.dbl_run\" wide\n$aD = \"locker.file > crypt\" wide\n\ncondition:\nuint16(0) == 0x5a4d and\nfilesize < 1MB and\n// Check for unique strings common across known samples in .rdata section\nfor any of ($a*) : ( $ in\n(pe.sections[pe.section_index(\".rdata\")].raw_data_offset..pe.sections[pe.section_index(\".rdata\")].raw_data_offset+pe.sections[pe.section_index\n(\".rdata\")].raw_data_size) )\n}\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats, providing intelligence analysis for the benefit of\ndefenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-11 - MountLocker Ransomware-as-a-Service Offers Double Extortion Capabilities to Affiliates.pdf"
    ],
    "report_names": [
        "2020-12-11 - MountLocker Ransomware-as-a-Service Offers Double Extortion Capabilities to Affiliates.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535966,
    "ts_updated_at": 1743041316,
    "ts_creation_date": 1653775787,
    "ts_modification_date": 1653775787,
    "files": {
        "pdf": "https://archive.orkl.eu/3e0601770e6e3a18b564583d0c6619514d7abfc6.pdf",
        "text": "https://archive.orkl.eu/3e0601770e6e3a18b564583d0c6619514d7abfc6.txt",
        "img": "https://archive.orkl.eu/3e0601770e6e3a18b564583d0c6619514d7abfc6.jpg"
    }
}