{
    "id": "6c9893c1-edea-479c-a2af-5b8bbf7a5dae",
    "created_at": "2023-01-12T14:59:51.530729Z",
    "updated_at": "2025-03-27T02:14:13.697795Z",
    "deleted_at": null,
    "sha1_hash": "24098399b8860cce800f5cdcc005ad783d7269d0",
    "title": "2021-11-30 - ProxyShell exploitation leads to BlackByte ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:23:03Z",
    "file_modification_date": "2022-05-28T18:23:03Z",
    "file_size": 465178,
    "plain_text": "# See what it's like to have a partner in the fight.\n\n**redcanary.com/blog/blackbyte-ransomware/**\n\n[As law enforcement arrests continue to put a dent in the plague of ransomware, new variants continue to pop up week after week. BlackByte](https://www.europol.europa.eu/newsroom/news/ransomware-gang-arrested-in-ukraine-europol%E2%80%99s-support)\n[ransomware was first publicly identified in a July 2021 BleepingComputer forum post from a user seeking help decrypting their encrypted](https://www.bleepingcomputer.com/forums/t/755181/blackbyte-ransomware-blackbyte-support-topic/)\nfiles. Since then, there’s been a slow trickle of information regarding this new variant, with interest in it peaking in early October when\noperators [attacked an Iowa grain cooperative.](https://www.desmoinesregister.com/story/money/agriculture/2021/10/06/iowa-grain-cooperative-recovering-cyberattack-remains-mum-ransom/6007123001/)\n\n[Red Canary came across BlackByte working a short-term incident response engagement in conjunction with our partners at Kroll. Trustwave](https://redcanary.com/products/red-canary-for-consultants/)\n[SpiderLabs released two excellent blogs analyzing a BlackByte sample they observed, and we wanted to take a look at the operation more](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/)\nbroadly by analyzing the initial access, post-exploitation, and exfiltration phases prior to BlackByte encryption. While we don’t have all of the\nanswers, we wanted to provide the community with our analysis with hopes we can continue the BlackByte discussion.\n\n## Initial access\n\nIn the campaign we observed, BlackByte operators gained initial access by exploiting the ProxyShell vulnerabilities (CVE-2021-34473, CVE[2021-34523, CVE-2021-31207) present on the customer’s Microsoft Exchange server (T1190 Exploit Public-Facing Application). Widely](https://attack.mitre.org/techniques/T1190/)\n[reported and acknowledged by Microsoft in August 2021, ProxyShell exploitation allows an adversary to gain pre-authentication remote code](https://techcommunity.microsoft.com/t5/exchange-team-blog/proxyshell-vulnerabilities-and-your-exchange-server/ba-p/2684705)\nexecution. Here’s a quick primer on the ProxyShell exploitation process that we observed:\n\n1. An adversary remotely created a draft email with an attachment saved in the user’s Drafts folder. The attachment contained the\n\nencoded web shell.\n2. The adversary exported the entire mailbox (malicious draft email included) to a PST file format, with an ASPX extension.\n\nFrom an endpoint perspective, we observed the service `MSExchangeMailboxReplication.exe writing an ASPX file to the folder`\n\n`\\\\127.0.0.1\\c$\\program files\\microsoft\\exchange server\\v15\\frontend\\httpproxy\\owa\\auth\\current\\themes` (T1505.003\nServer Software Component: Web Shell):\n\n\n-----\n\nSince this service should not normally write ASPX files, this presents a detection opportunity.\n\n### Detection opportunity: Microsoft Exchange Mailbox Replication service writing Active Server Pages\n\nprocess == `msexchangemailboxreplication.exe`\n\n&&\ncreate_filename_extension == `.aspx`\n\n||\n\nmodify_filename_extension == `.aspx`\n\nThough we don’t know the adversary’s source IP address from log sources, we observed `185.93.6[.]31 making a network connection in a`\nlater stage of execution. We assess that it likely conducted the initial ProxyShell exploitation in this incident. Security researcher Kevin\nBeaumont [observed the same IP address exploiting the ProxyShell vulnerabilities to drop web shells on vulnerable servers in early](https://twitter.com/gossithedog/status/1433143088285954049)\nSeptember 2021, one month prior to this intrusion. We also directly observed several inbound connections to customer Exchange servers,\n[which we assess was likely vulnerability scanning (T1595.002 Active Scanning: Vulnerability Scanning).](https://attack.mitre.org/techniques/T1595/002/)\n\n## Post-exploitation\n\n[Operators used their web shell to drop a Cobalt Strike beacon ( c84d4ead6c5a2afa9e844806de549dcf ) on the compromised Exchange](https://redcanary.com/threat-detection-report/threats/cobalt-strike/)\n[server to allow more functionality directly on the compromised system (T1105 Ingress Tool Transfer). Based on the beacon’s](https://redcanary.com/threat-detection-report/techniques/ingress-tool-transfer/) configuration\nfile, Cobalt Strike injected into the `wuauclt.exe (Windows Update Agent) process. We detected this process launching with no command-`\nline parameters. This is somewhat unusual (and presents a detection opportunity), as `wuauclt.exe (Windows Update Agent) typically`\n[launches with a parameter (T1055 Process Injection).](https://redcanary.com/threat-detection-report/techniques/process-injection/)\n\n### Detection opportunity: Wuauclt.exe executing with no command line argument\n\nprocess == `wuauclt.exe`\n\n&&\nprocess_command_line_contains != `“”`\n\n_Note: Double quotes (“”) within the command line means null._\n\n[Operators then used Cobalt Strike to dump credentials for a service account on the compromised system (T1003 OS Credential Dumping).](https://redcanary.com/threat-detection-report/techniques/os-credential-dumping/)\n[After gaining access to a service account, the adversaries installed the remote desktop application AnyDesk to access multiple systems](https://redcanary.com/blog/misbehaving-rats/)\n[(T1105 Ingress Tool Transfer). In addition to lateral movement through AnyDesk, the operators created additional Cobalt Strike beacons](https://redcanary.com/threat-detection-report/techniques/ingress-tool-transfer/)\nwithin the `Admin$ share folders on compromised domain controllers (T1021.002 Remote Services: SMB/Windows Admin Shares).`\n\n## BlackByte execution\n\n\n-----\n\nCoba t St e t oduced a d e ecuted ac yte ( 93 `a c63 53cd5e ee0` `9aed 3dc56 )` t e e o e t ac yte au c ed t a\ncommand-line parameter of `-single with a SHA-256 hash. We assess this parameter may be a unique identifier for the infected system,`\nbut it’s still unclear exactly what this parameter does. As a precaution, we have redacted this value from our screenshots. If anyone in the\n[community has insight into this, please email intel@redcanary.com.](http://10.10.0.46/mailto:intel@redcanary.com)\n\n_BlackByte (which had a file name of_ `complex.exe ) executing with a SHA-256 command line argument (which we have redacted in this`\n_screenshot)_\n\n[Once executed, BlackByte deletes Task Manager ( taskmgr ) and Resource Monitor ( resmon ), and issues an obfuscated PowerShell](https://redcanary.com/threat-detection-report/techniques/powershell/)\n[command to stop the Windows Defender service ( WinDefend ) (T1562.001 Impair Defenses: Disable or Modify Tools). This is likely done to](https://attack.mitre.org/techniques/T1562/001/)\navoid detection and keep Windows Defender at bay while BlackByte continues execution. BlackByte also creates a TMP copy of itself, which\nwe assess may have been used during its worming phase.\n\n_Base-64-encoded PowerShell command to disable the WinDefend service_\n\nNext, BlackByte injected into the `regedit.exe process, which executed with the same` `-single command line parameter as the original`\nBlackByte binary. Regedit initiated a connection to the same IP address mentioned previously, `185.93.6[.]31 . BlackByte was possibly`\ncommunicating back to the adversary’s command and control (C2) server via this Regedit connection, though this remains an intelligence\ngap.\n\n### Preparing to worm\n\nTypically, we would expect Cobalt Strike to be the main driver behind privilege escalation and lateral movement within a compromised\nenvironment. However, BlackByte handles both of those on its own. In the sample we observed, BlackByte set three different registry values\n[to escalate privileges and begin setting the stage for lateral movement and encryption (special thanks to Trustwave’s Spiderlabs for filling in](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/)\n[this intelligence gap in their breakdown of BlackByte) (T1112 Modify Registry):](https://attack.mitre.org/techniques/T1112/)\n\nElevate local privileges: `HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v`\n```\n   LocalAccountTokenFilterPolicy /t REG_DWORD /d 1 /f\n\n```\nEnable OS to share network connections between different privilege levels:\n```\n   HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v EnableLinkedConnections /t REG_DWORD /d 1 /f\n\n```\n**[Enable long path values for file paths, names, and namespaces to ensure encryption of all file names and paths:](https://docs.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=cmd)**\n\n```\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\FileSystem /v LongPathsEnabled /t REG DWORD /d 1 /f\n\n```\n\n-----\n\n### Detection opportunity: Privilege escalation and encryption preparation via registry modifications\n\nProcess == `regedit.exe`\n\n&&\nReg_key == ( “HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System” ||\n```\n“HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System” ||\n“HKLM\\SYSTEM\\CurrentControlSet\\Control\\FileSystem /v LongPathsEnabled” )\n\n```\n&&\ncommand_line_contains == ( REG_DWORD && `1 )`\n\nBlackByte then conducted network reconnaissance and system preparation prior to lateral movement within the environment.\n\n1. BlackByte executed two `netsh advfirewall firewall commands to enable the “ Network Discovery ” and “ File and Printer`\n```\n   Sharing ” rule groups (T1562.004 Impair Defenses: Disable or Modify System Firewall).\n\n```\n2. BlackByte executed a PowerShell command to query Active Directory for all of the computer hostnames and installed the Remote\n\n[Server Admin Tools package (T1059.001 Command and Scripting Interpreter: PowerShell).](https://redcanary.com/threat-detection-report/techniques/powershell/)\n3. BlackByte executed hundreds of reconnaissance and system discovery commands including `net view and` `arp -a` (T1018 Remote\n\nSystem Discovery, T1016 System Network Configuration Discovery).\n4. BlackByte created a temporary copy of itself before deleting the original complex.exe binary (T1070.004 Indicator Removal on Host: File\n\nDeletion). We assess this temporary file, rather than the original complex.exe file, was used to propagate to the next system.\n5. BlackByte then made a connection to the `185.93.6[.]31 address mentioned above.`\n\n### Preparing for ransom\n\nBlackByte issued several precursor commands prior to conducting the encryption cycle. The `vssadmin resize shadowstorage command`\nwas used to resize shadow copy storage in two different ways, setting the /MaxSize parameter to either “ unbounded ” or “ 401MB .”\n[Additionally, BlackByte issued an obfuscated PowerShell command to delete shadow copies directly through WMI objects (T1490 Inhibit](https://redcanary.com/blog/its-all-fun-and-games-until-ransomware-deletes-the-shadow-copies/)\nSystem Recovery).\n\n### Detection opportunity: Vssadmin Resizing shadowstorage\n\nprocess == `vssadmin.exe`\n\n&&\nprocess_command_line_contains == `resize shadowstorage && ( unbounded ||` `401MB )`\n\n[Next, BlackByte issued commands to delete the scheduled task “ Raccine Rules Updater ” disable the](https://redcanary.com/threat-detection-report/techniques/scheduled-task/) `SQLTELEMETRY service`\n[(T1562.001 Impair Defenses: Disable or Modify Tools).](https://attack.mitre.org/techniques/T1562/001/) [Raccine is a so-called “ransomware vaccine” created by security researcher Florian](https://github.com/Neo23x0/Raccine)\nRoth, designed to intercept and prevent precursors and active ransomware behavior.\n\n### Detection opportunity: Raccine scheduled task deletion\n\nProcess_name == `schtasks.exe`\n\n&&\ncommand_line_contains == ( delete && `Raccine )`\n\n_Deletion of the Raccine Rules Updater scheduled task_\n\n\n-----\n\n### t at o\n\nUsing WinRAR, the adversary compressed local data from compromised endpoints and uploaded the archives to the anonymous file-sharing\n[sites anonymfiles[.]com and file[.]io (T1560.001 Archive Collected Data: Archive via Utility,](https://attack.mitre.org/techniques/T1560/001/) T1567.002 Exfiltration Over Web Service:\nExfiltration to Cloud Storage). The operators then attempt to further extort the customer by threatening to release this data publicly through\nthe BlackByte Tor leak site, an all too common tactic among ransomware operators.\n\n### Encryption\n\nWe observed the use of print bombing to deploy physical ransom notes. BlackByte has the typical text-based note titled\n```\nBlackByte_restoremyfiles.hta . However, it also sets a scheduled task to perform a print bombing technique, which causes all\n\n```\n[connected printers to physically print ransom notes upon execution of the task (T1053.005 Scheduled Task/Job: Scheduled Task). At the top](https://redcanary.com/threat-detection-report/techniques/scheduled-task/)\nof every hour following an initial scheduled task setting, a note would be printed that says “Your[sic] HACKED by BlackByte team. Connect us\nto restore your system.”\n\n_Execution of the print bombing scheduled task_\n\n### Detection opportunity: Print bombing technique\n\nProcess == `cmd.exe`\n\n&&\nCommand_line_contains ==( wordpad || ( notepad )&& `/p`\n\nSeveral other ransomware variants use the print bombing technique, such as Egregor and LockBit, but it’s another reminder that the intent of\nransomware is to cause fear and disruption among users.\n\n[For more detailed information about the encryption process, read Trustwave’s blog, which breaks down this routine in great detail (T1486](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/)\nData Encrypted for Impact). Interestingly, it relies on a downloaded file ( forest.png, in Trustwave’s case) that contains the encryption key.\nWithout this, the encryption will fail. Additionally, Trustwave developed a decryptor based on this key, which can also be found in their blog.\n\n## Malware analysis notes\n\nBlackByte has extensive obfuscation and some anti-debugging features that made analyzing the sample difficult. The sample was UPXpacked, and initially, we observed several Golang strings making us think this could be a Go version of BlackByte (T1027.002 Obfuscated\nFiles or Information: Software Packing). However, after further analysis, the sample appears to be written in a combination of C and Go.\nAdditionally, we noted the sample dynamically loaded API components, increasing the difficulty of analysis. Our sample also differed slightly\nfrom Trustwave’s analysis, potentially indicating multiple variants of BlackByte in the wild, though we could not confirm this. We continue to\nanalyze our sample and will provide updates if we find anything noteworthy.\n\n## Conclusion\n\nNot that anyone needs to be reminded of the prevalence of both Cobalt Strike and ransomware, but hopefully this intrusion gives some insight\n[into an ever-evolving ransomware threat landscape. As we stated in our October Intelligence Insights blog, the best way to prevent a](https://redcanary.com/blog/intelligence-insights-october-2021/)\nwidespread ransomware infection after an adversary has already entered your environment is to identify precursor activity, such as shadow\ncopy deletion, suspicious registry modification, or unusual process behavior.\n\n**_[Note: If you’ve been impacted by BlackByte, Trustwave has released a decryption tool. The tool relies on an encryption key found within a](https://github.com/SpiderLabs/BlackByteDecryptor)_**\n_[downloaded PNG (or other) file during the intrusion. Following Trustwave’s publication, BlackByte operators called out the decryptor and](https://www.bleepingcomputer.com/news/security/blackbyte-ransomware-decryptor-released-to-recover-files-for-free/)_\n_questioned its capability. As such, the group’s tactics may change and the tool may become unreliable._\n\n\n-----\n\nIOCs\n\n:\nCobalt Strike\nbeacon\n\n:\nBlackByte\nransomware\n\n:\nPrint bombing\nransom note DLL\n\n:\nCobalt Strike\nserver\n\nObservables\n\n\n:\nc84d4ead6c5a2afa9e844806de549dcf\n\n:\n9344afc63753cd5e2ee0ff9aed43dc56\n\n:\ne2eb5b57a8765856be897b4f6dadca18\n\n:\n185.93.6.31\n\n\n:\n829751cfdc2376e916244f94baf839ce4491ccb75f0a89778c092bde79bd8643\n\n:\n1df11bc19aa52b623bdf15380e3fded56d8eb6fb7b53a2240779864b1a6474ad\n\n:\n91f8592c7e8a3091273f0ccbfe34b2586c5998f7de63130050cb8ed36b4eec3e\n\n:\n\n\n**Technique** **Description** **Observable**\n\n\nTechnique: Description:\nBlackByte\nexecution\n\nTechnique: Description:\nPrint bombing\ncommand line\n\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nT1027\nObfuscated\nFiles of\nInformation\n\nT1562.001\nImpair\nDefenses:\nDisable or\nModify\nTools\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nT1562.001\nImpair\nDefenses:\nDisable or\nModify\nTools\n\n\nDescription:\nEXE deletion\nand encoded\nPowerShell\ncommand to\ndisable\nWindows\nDefender\n\nDescription:\nDecoded\nPowerShell for\ndisabling\nWindows\nDefender\n\n\nObservable:\nC:\\Users\\Public\\complex.exe -single\n\nObservable:\nC:\\Windows\\System32\\cmd.exe /c for /l %x in (1,1,75) do start wordpad.exe /p C:\\Users\\tree.dll\n\nObservable:\ncmd /c del C:\\Windows\\System32\\Taskmgr.exe /f /q & del C:\\Windows\\System32\\resmon.exe /f /q & powershell\n\n[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(‘Vw’+’BpA’+’G4ARAB’+’lAGYA\nService -Name $x;Set-Service -StartupType Disabled $x”\n\nObservable:\ncmd /c del C:\\Windows\\System32\\Taskmgr.exe /f /q & del C:\\Windows\\System32\\resmon.exe /f /q & powershell\n\n[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(WinDefend));\n\nStop-Service -Name $x;Set-Service -StartupType Disabled $x”\n\n\n-----\n\n**Technique** **Description** **Observable**\n\n\nTechnique:\nT1490\nInhibit\nSystem\nRecovery\n\nTechnique:\nT1490\nInhibit\nSystem\nRecovery\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nTechnique:\nT1562.001\nImpair\nDefenses:\nDisable or\nModify\nTools\n\n\nDescription:\nShadowStorage\nresize to\nunbounded\n\nDescription:\nShadowStorage\nresize to\n401MB\n\nDescription:\nPowerShell\ncommand to\ninstall Remote\nServer Admin\nTools package\n\nDescription:\nPowerShell\ncommand to\nquery Active\nDirectory for\ncomputer\nnames\n\nDescription:\nScheduled task\ndeletion\n\n\nObservable:\ncmd.exe /c vssadmin resize shadowstorage /for=e: /on=e: /maxsize=unbounded\n\nObservable:\ncmd.exe /c vssadmin resize shadowstorage /for=h: /on=h: /maxsize=401MB\n\nObservable:\nC:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe Install-WindowsFeature -Name\n\n\\”RSAT-AD-PowerShell\\” –IncludeAllSubFeature\n\nObservable:\npowershell -command “Import-Module ActiveDirectory;Get-ADComputer -Filter * -Properties * | FT Name”\n\nObservable:\nschtasks.exe /DELETE /TN “\\”Raccine Rules Updater\\”” /F\n\nObservable:\n\\\\127.0.0.1\\c$\\program files\\microsoft\\exchange server\\v15\\frontend\\httpproxy\\owa\\auth\\current\\themes\\ukbse.a\n\nObservable:\nC:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -command “$x =\n\n[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(‘RwBlAHQALQBXAG0AaQBP\n‘AFcAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkAIAB8AC’+\n\n‘AARgBvAHIARQBhAGMAaAAtAE8AYgBqAGUAYwB0ACAAewAkA’+\n\n‘F8ALgBEAGUAbABlAHQAZQAoACkAOwB9AA==’));Invoke-Expression $x”\n\nObservable:\nC:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -command “$x =\n\n[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(Get-WmiObject Win32_Shado\nForEach-Object {$_.Delete();}));Invoke-Expression $x”\n\n\nTechnique: Description:\nWeb shell\nlocation\n\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nT1027\nObfuscated\nFiles of\nInformation\n\nTechnique:\nT1059.001\nCommand\nand\nScripting\nInterpreter:\nPowerShell\n\nT1490\nInhibit\nSystem\nRecovery\n\n\nDescription:\nEncoded\nPowerShell for\ndeleting\nshadow copies\nvia GetWmiObject\n\nDescription:\nDecoded\nPowerShell for\ndeleting\nshadow copies\nvia GetWmiObject\n\n\n-----\n\n**Technique** **Description** **Observable**\n\n\nTechnique:\nT1112\n[Modify](https://attack.mitre.org/techniques/T1112/)\nRegistry\n\nTechnique:\nT1562.004\nImpair\nDefenses:\n[Disable or](https://attack.mitre.org/techniques/T1562/004/)\nModify\nSystem\nFirewall\n\n\nDescription:\nCommands to\nadd registry\nvalues\n\nDescription:\nNetsh firewall\nrule additions\n\n\nObservable:\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v EnableLinkedConnections /t\n\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v LocalAccountTokenFilterPolic\n\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Control\\FileSystem /v LongPathsEnabled /t REG_DWORD /d 1 /f\n\nObservable:\nnetsh advfirewall firewall set rule group=”Network Discovery” new enable=Yes\n\nnetsh advfirewall firewall set rule group=”File and Printer Sharing” new enable=Yes\n\n\n## References\n\n[https://www.bleepingcomputer.com/forums/t/755181/blackbyte-ransomware-blackbyte-support-topic/](https://www.bleepingcomputer.com/forums/t/755181/blackbyte-ransomware-blackbyte-support-topic/)\n[https://www.linkedin.com/pulse/english-blackbyte-ransomware-misterious-dropper-encoder-fasolo](https://www.linkedin.com/pulse/english-blackbyte-ransomware-misterious-dropper-encoder-fasolo)\nhttps://www.desmoinesregister.com/story/money/agriculture/2021/10/06/iowa-grain-cooperative-recovering-cyberattack-remains-mumransom/6007123001/\n[https://www.sentinelone.com/blog/the-good-the-bad-and-the-ugly-in-cybersecurity-week-40-3/](https://www.sentinelone.com/blog/the-good-the-bad-and-the-ugly-in-cybersecurity-week-40-3/)\n[https://mcit.gov.ws/2021/08/06/cs-advisory-ca003-blackbyte-ransomware/](https://mcit.gov.ws/2021/08/06/cs-advisory-ca003-blackbyte-ransomware/)\n[https://www.reddit.com/r/sysadmin/comments/q0b8ra/blackbyte_ransomware/](https://www.reddit.com/r/sysadmin/comments/q0b8ra/blackbyte_ransomware/)\n[https://community.spiceworks.com/topic/2330823-suspicious-draft-email](https://community.spiceworks.com/topic/2330823-suspicious-draft-email)\n[https://www.mandiant.com/resources/pst-want-shell-proxyshell-exploiting-microsoft-exchange-servers](https://www.mandiant.com/resources/pst-want-shell-proxyshell-exploiting-microsoft-exchange-servers)\n[https://docs.microsoft.com/en-us/answers/questions/545608/unexpected-spam-email-in-outlook-draft-folder.html](https://docs.microsoft.com/en-us/answers/questions/545608/unexpected-spam-email-in-outlook-draft-folder.html)\n[https://www.reddit.com/r/sysadmin/comments/ppk6di/mysterious_email_in_exchange_users_drafts/](https://www.reddit.com/r/sysadmin/comments/ppk6di/mysterious_email_in_exchange_users_drafts/)\n[https://twitter.com/cyb3rops/status/1448209631331954693?s=20](https://twitter.com/cyb3rops/status/1448209631331954693?s=20)\n[https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/)\n[https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-2-code-obfuscation-analysis/](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-2-code-obfuscation-analysis/)\n[https://docs.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=cmd](https://docs.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=cmd)\n\nRelated Articles\n\nDetection and response\n\n### ChromeLoader: a pushy malvertiser\n\nDetection and response\n\n### Intelligence Insights: May 2022\n\nDetection and response\n\n### The Goot cause: Detecting Gootloader and its follow-on activity\n\nDetection and response\n\n### Marshmallows & Kerberoasting\n\n**Subscribe to our blog**\n\n[Our website uses cookies to provide you with a better browsing experience. More information can be found in our Privacy Policy.](https://redcanary.com/privacy-policy)\n\nX\n\n**Privacy Overview**\n\n\n-----\n\ns ebs te uses coo es to p o e you e pe e ce e you a gate t oug t e ebs te Out o t ese coo es, t e coo es t at a e\ncategorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use\nthird-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your\nconsent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing\nexperience.\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic\nfunctionalities and security features of the website. These cookies do not store any personal information.\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via\nanalytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these\ncookies on your website.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-30 - ProxyShell exploitation leads to BlackByte ransomware.pdf"
    ],
    "report_names": [
        "2021-11-30 - ProxyShell exploitation leads to BlackByte ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535591,
    "ts_updated_at": 1743041653,
    "ts_creation_date": 1653762183,
    "ts_modification_date": 1653762183,
    "files": {
        "pdf": "https://archive.orkl.eu/24098399b8860cce800f5cdcc005ad783d7269d0.pdf",
        "text": "https://archive.orkl.eu/24098399b8860cce800f5cdcc005ad783d7269d0.txt",
        "img": "https://archive.orkl.eu/24098399b8860cce800f5cdcc005ad783d7269d0.jpg"
    }
}