{
    "id": "6c9bfc46-8ac4-4944-9e2d-2beef3ff7759",
    "created_at": "2022-10-25T16:48:15.02503Z",
    "updated_at": "2025-03-27T02:12:03.899159Z",
    "deleted_at": null,
    "sha1_hash": "32c237176c43b1fe92187a58a6e09b657be7c742",
    "title": "Babuk: Moving to VM and *nix Systems Before Stepping Away",
    "authors": "",
    "file_creation_date": "2021-07-19T22:44:03Z",
    "file_modification_date": "2021-07-21T09:21:28Z",
    "file_size": 1668864,
    "plain_text": "# B a b u k :\n\n M o v i n g t o\n\n V M a n d * n i x\n\n S y s t e m s B e f o r e\n\n S t e p p i n g A w a y\n\n\n-----\n\n### Table of Contents\n\n##### 5 The Babuk Threat Actor\n\n 6 Phases of a Ransomware Attack 6 Ransomware-as-a-Service Supply Chain\n\n 7 A Typical Attack by a Babuk Threat Actor\n\n 7 IN 7 THROUGH 8 OUT\n\n 9 Recent Developments Surrounding the Babuk Threat Actor\n\n 9 From Ransomware Developers to Data Leak Managers?\n\n 10 Technical Analysis\n\n 13 Memory Alloc: 15 Encryption\n\n 17 Key Findings\n\n 17 Conclusion\n\n 18 YARA Rule\n\n 18 IOCs: Babuk NAS Locker\n\n 19 About McAfee\n\n 19 McAfee ATR\n\n\n-----\n\n### Introduction\n\n#### For a long time, ransomware gangs were mostly focused on Microsoft Windows operating systems. Yes, we observed the occasional dedicated Unix or Linux based ransomware, but cross-platform ransomware was not happening yet. However, cybercriminals never sleep and in recent months we noticed that several ransomware gangs were experimenting with writing their binaries in the cross-platform language Golang (Go).\n\n Our worst fears were confirmed when Babuk announced on an underground forum that it was developing a cross-platform binary aimed at Linux/UNIX and ESXi or VMware systems. Many core backend systems in companies are running on these *nix operating systems or, in the case of virtualization, think about the ESXi hosting several servers or the virtual desktop environment.\n\n We touched upon this briefly in our previous blog, together with the many coding mistakes the Babuk team is making.\n\n Even though Babuk is relatively new to the scene, its affiliates have been aggressively infecting high-profile victims despite numerous problems with the binary.\n\n In our first Babuk blog McAfee Advanced Threat Research (ATR), and our industry peers, discussed some of the Windows binary issues. It seems that Babuk has adopted live beta testing on its victims when it comes to its Golang binary and decryptor development. We have seen several victims’ machines encrypted beyond repair due to either a faulty binary or a faulty decryptor.\n\n\nAuthors\n\nThis report was researched\n\nand written by:\n\n- Thibault Seret\n\n- [Noël Keijzer, Northwave](https://northwave-security.com/)\n\n[Subscribe to receive threat](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n[information.](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n\nConnect With Us\n\n\n-----\n\n#### Even if a victim gave in to the demands and was forced to pay the ransom, they still could not get their files back. We strongly hope that the bad coding also affects Babuk’s relationship with its affiliates. The affiliates are the ones performing the actual compromise and are now faced with a victim that cannot get their data back even if they pay. This essentially changes the crime dynamic from extortion to destruction which, from a criminal’s point of view, is much less profitable.\n\nFigure 1. Post from Babuk about the Linux version of the ransomware\n\n\nConnect With Us\n\n\n-----\n\n## Babuk: Moving to VM and *nix Systems Before Stepping Away\n\n##### The Babuk Threat Actor\n\nBefore giving an overview of the methodology used by the\nBabuk threat actor, some general background knowledge\nof how ransomware attacks occur and what groups are\nbehind the attacks is necessary.\n\nFollowing, we will first describe the typical phases of\na ransomware attack, as well as the Ransomware-asa-Service model that is used by Babuk ransomware.\nSubsequently we will show what a typical Babuk\nransomware attack looks like, and what specific Threats,\nTactics, and Procedures are used by the Babuk threat\nactor. Finally, a technical analysis of the ransomware\nemployed by the threat actor will show that there are\nmany flaws found within the code that result in the\ndestruction of victim’s data.\n\n\nAuthors\n\nThis report was researched\nand written by:\n\n- Thibault Seret\n\n- [Noël Keijzer, Northwave](https://northwave-security.com/)\n\n[Subscribe to receive threat](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n[information.](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n\nConnect With Us\n\n\n-----\n\n##### Phases of a Ransomware Attack\n\nDuring a cyberattack the different steps an attacker performs can be\ncategorised in three main categories, which we will use to describe a\ntypical attack of a Babuk threat actor:\n\n- Initial access (IN)\n\n- Network propagation (THROUGH)\n\n- Action on objectives (OUT)\n\n\nIN THROUGH OUT\n\n\nExploiting a vulnerability from an\ninternet-connected server.\nVarious tools are often available\nfor known vulnerabilities.\n\n\nLateral movement.\nReconnaissance of the network\n(through vulnerable systems or\ninsufficient access control).\nIn this stage, the attacker hops\nfrom computer to computer.\n\n\nEncrypt files and demand\nransom.\nThe attacker applies a\ncryptographic function on the\nfiles - the attacker demands the\npurchase of this key which is\nneeded to revert the encryption.\n\n\nPhishing email.\nAn email with a rogue attachment\nor link. These emails can be\ntailor-made and are hard to\ndistinguish from legitimate emails.\n\n\nPrivilege escalation.\nBecoming an admin through\npassword guessing, unsafe user\nrights, or vulnerabilities.\nThe attacker tries to get more\nrights on a computer and thus\nmore possibilities. An attacker\nuses lateral movement and\nprivilege escalation often\nalternately.\n\n\nDownloading sensitive data threatening to publish.\nStealing business-sensitive data\nor personal data from the server.\nThe victim must pay to avoid\npublication which integrates\nseamlessly with encryption.\n\n\nRANSOMWARE\nAFFILIATES\n\n\nDATA MANAGERS\n\n\nDestroying or corrupting\nbackups.\n\n\n##### Ransomware-as-a-Service Supply Chain\n\nLately, there is an increasing trend observed in the cybercriminal industry\ncalled “Ransomware-as-a-Service (RaaS).” RaaS is a business model\nthat is increasing in popularity among ransomware authors.[1] RaaS is a\nservice, offered by ransomware developers that allows cybercriminals to\nrent ransomware. RaaS aims to simplify ransomware attacks for criminals\nthat lack the technical skills to build their own ransomware in exchange\nfor a part of the ransom acquired by the criminals. This business model\nallows many ransomware developers to collaborate with other seasoned\ncybercriminals that can distribute ransomware in large networks to which\nthey already have access. Babuk ransomware made use of such a model\nbefore shutting down its ransomware operations at the end of April 2021.\n\nRaaS is transforming the way a ransomware attacks works, involving\nseveral distinct actors. Generally, we can divide the supply chain for such\nattacks in to four stages, as shown below.\n\nINITIAL ACCESS RANSOMWARE RANSOMWARE DATA MANAGERS\nBROKER AFFILIATES OPERATORS/DEVELOPERS\n\n - Obtain initial access to  - Pivotting and Lateral  - Supply the ransomware  - Manage stolen data\norganizations Movement infrastructure and  - Prepare data samples\n\n - Perform reconnaissance, - Exfiltration of data software - Publish data if not paid\nescalate privileges, or  - Monetize networks by  - Negotiate with victim\ninstall further tooling locking them, threaten to organizations\n\n - Monetize networks by publish stolen data, and - € 10.000–20.000.000\nselling them to any actor demanding ransom\n\n - € 500–20.000 - € 10.000–20.000.000\n\n2 days – 3 months\n\nFigure 3. Supply Chain schema\n\n\nRANSOMWARE\nOPERATORS/DEVELOPERS\n\n\nRemote access software vulnerable password.\nAttackers can try to guess the\npassword if they can log in from\nthe Internet.\n\n\nINITIAL ACCESS\nBROKER\n\n\nFigure 2. Ransomware attack phases\n\n\n-----\n\n**Technique** **Tactic** **Observable**\n\n\nExploit public-facing\napplication (T1190)\n\n\nInitial access Exploitation of Exchange server using\nCVE-2021-27065\n\n\nValid accounts (T1078) Persistence Group makes use of legitimate domain\nadministrator credentials for most of\ntheir activity\n\nCreate account (T1136) Persistence Creates domain account named Petr\n\n\nExploitation for privilege\nescalation (T1068)\n\n\nPrivilege escalation Zerologon exploit to obtain domain\nadmin account,\nMimikatz to obtain additional account\ncredentials\n\n\nImpair Defenses (T1562) Defense Evasion Usage of GMER rootkit remover to\ndisable anti-virus solutions\n\nAccount discovery (T1087) Discovery Usage of ADFind to list all accounts in the\ndomain\n\n\nRemote System Discovery\n(T1018)\n\nRemote System Discovery\n(T1018)\n\nFile and Directory Discovery\n(T1083)\n\n\nDiscovery Usage of ADFind to list all systems in the\ndomain\n\nDiscovery Usage of NetScan to identify systems on\nthe network\n\nDiscovery Usage of LAN Search Pro to find files\nlocated on network shares\n\n\nRemote Services (T1021) Lateral Movement Usage of RDP and SSH to move between\nsystems\n\n\nLateral Tool Transfer\n(T1570)\n\nMulti-Stage Channels\n(T1104)\n\nArchive Collected Data\n(T1560)\n\nExfiltration Over Web\nService, Transfer Data to\nCloud Storage (T1567.002)\n\nData Encrypted for Impact\n(T1486)\n\nFigure 4. Mitre Matrix\n\n\nLateral movement Usage of WinSCP to transfer files to linux\nsystems\n\n\nCommand and\nControl\n\n\nUsage of Cobalt strike to obtain\npersistence within the environment\n\n\nCollection Usage of WinRAR to archive data prior to\nexfiltration\n\nExfiltration Data exfiltration to MEGA using the\nMegaSync application as well as data\nexfiltration to Google Drive using Google\nChrome\n\nImpact Encrypt systems using ransomware\n\n\n##### A Typical Attack by a Babuk Threat Actor\n\n IN\n\n[During a Babuk attack that Northwave investigated, the threat actor gained](https://northwave-security.com/)\naccess to the victim’s network by exploiting a vulnerability on an internet[facing server, in this case CVE-2021-27065. This vulnerability was one](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-27065)\nthat was actively being exploited by the HAFNIUM threat actor before\nbeing patched by Microsoft. After a patch was issued, the vulnerability\nwas picked up by several threat groups and Northwave has seen this\nvulnerability being abused by different ransomware threat actors in several\ninvestigations.\n\nUpon gaining entry to the victim’s network, the attacker remained dormant\nfor over a week. We suspect this was because the party that gained access\nto the network was an initial access broker, selling access to ransomware\naffiliates.\n\n##### THROUGH\n\nAs mentioned above, the attacker did not start reconnaissance and\nlateral movement on the victim’s systems until a week after the initial\ncompromise. In the paragraphs below we will describe the methodology\nthat the threat actor used to gain complete control of the environment.\n\nAfter gaining access, the threat actor placed a Cobalt Strike backdoor on\nthe system. Cobalt Strike is frequently employed by attackers to obtain\npersistence on their victim’s networks. Northwave found that the threat\nactor placed Cobalt Strike backdoors on several key systems within the\nnetwork. Furthermore, Northwave found that the attacker made use of\nGMER, which is a rootkit removal tool. This tool was likely used to remove\nor disable anti-virus solutions on the victim’s system. The threat actor was\nalso found to have downloaded Metasploit, though they did not actually use\nit during the attack on this victim.\n\n\n-----\n\nThe threat actor used a custom version of zer0dump[2] to obtain domain\nadministrator credentials. This tool uses the Zerologon[3] exploit to elevate\nprivileges by compromising the domain controller. The threat actor did\nnot create a new domain account, neither did they change the credentials\nof any existing accounts. Instead, the threat actor opted to use already\nexisting domain admin accounts, with their original credentials. The threat\nactor used Mimikatz to obtain access to credentials of other domains\npresent on the victim’s network. During later stages of the attack, the\nthreat actor opted to create a new local administrator account on some of\nthe systems as a means of additional persistence.\n\nLateral movement between Windows systems was achieved using RDP. For\nconnections to Linux systems, the attacker made use of SSH (using Putty).\nMoving files to Linux systems was done using WinSCP from Windows\nsystems, while tools used on Windows systems were downloaded from the\ninternet. The threat actor made use of the “temp.sh” and “wdfiles.ru” file\nhosting websites to host most of his tools. Other tools were downloaded\ndirectly from GitHub or the websites of their respective developers.\nThe attacker downloaded a tool to scan for systems vulnerable to the\nEternalBlue exploit, however, the attacker did not seem to use it during the\nattack.\n\nReconnaissance of the environment was done using ADFind, NetScan, and\nLAN Search Pro. ADFind is a tool we frequently see in investigations that\nenables the threat actor to dump a list of all systems and users in a domain.\nNetScan is an administrative tool that can perform a scan to map out a\nnetwork, including logged-on users, installed software, and various other\ninformation about remote machines. LAN Search Pro is a utility that allows\na user to search for files on network shares of the local network.\n\n\n##### OUT\n\nBefore starting to roll out ransomware on the victim’s network, the threat\nactor exfiltrated data. The threat actor used WinRAR to compress data and\nstaged the exfiltrated data on the fileserver that the data originated from.\nThe threat actor then exfiltrated this data to both Mega and Google Drive.\nData exfiltration to Mega was done using the MegaSync application whilst\nexfiltration to Google Drive was done through the Chrome browser.\n\nAfter obtaining full control of the environment and exfiltrating data from the\nvictim, the threat actor proceeded to destroy the victim’s backups by first\ndeleting any backup related files and then deploying ransomware on their\nbackup systems.\n\nFinally, after the threat actor had ensured that there was no way for the\nvictim to recover from the attack using backups, they moved to the\nvictim’s ESXi hosts and deployed a precompiled ransomware binary.\n[The ransomware binary would proceed to encrypt all the victim’s virtual](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/are-virtual-machines-the-new-gold-for-cyber-criminals/)\n[machines. Unfortunately, this ransomware binary turned out to be very](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/are-virtual-machines-the-new-gold-for-cyber-criminals/)\npoorly implemented and contained several different design flaws that\nresulted in the irreversible corruption of data. This binary is analysed in the\nsections below.\n\n\n-----\n\n##### Recent Developments Surrounding the Babuk Threat Actor\n\nAt the end of April, Babuk announced that it would cease operations and\nswitch to a different business model. The group would no longer encrypt\nsystems but would instead focus exclusively on data exfiltration.[4,5,6]\nFurthermore, the group stated that it would publish the code to its\nransomware as an open-source project. The threat actor indicated that it\nwould focus on publishing data from victims that were unresponsive to its\nransom demands. Furthermore, the threat actor indicated that it would\nhost and publish data for other groups. As such, the Babuk threat actor\nseems to be moving towards a data management position.\n\nFigure 5. Post on Babuk’s site\n\nGiven the poor design of its ransomware, a fair number of victims should\nbe saved from completely losing their data when being attacked by Babuk.\nAs mentioned in the previous sections, Northwave has seen threat actors\nslowly move from a scheme extorting victims by encrypting their data\ntowards a double-extortion scheme where the threat actors both encrypt\nthe victim’s data and exfiltrate it as well. It is interesting to see threat actors\nnow moving towards a scheme where their sole source of pressure to extort\nvictims is the exfiltration of sensitive data.\n\n\n##### From Ransomware Developers to Data Leak Managers?\n\nAs mentioned previously on its website, the Babuk team has moved from\nthe ransomware environment to becoming a data leak discloser:\n\nFigure 6. Babuk’s new website -> Payload.bin\n\nFirstly, it released the source code for highly anticipated game Cyberpunk\n2077 at the end of May 2021. The team behind the game, CD ProjektRed, is\na polish video game developer, publisher, and distributer. The leak contains\nthe source code for Cyberpunk 2077 on various video game platforms\nincluding PS5, PC, etc:\n\nFigure 7. All leaked CyberPunk 2077 source code\n\nSince this first leak, we have not seen any new activity from the actor.\n\n\n-----\n\n##### Technical Analysis\n\nThe malware is written in the open-source programming language Golang,\nmost likely because it allows developers to have a single codebase to\nbe compiled into all major operating systems. This means that, thanks\nto static linking, code written in Golang on a Linux system can run on a\nWindows or Mac system. This presents a large advantage to ransomware\ngangs looking to encrypt a whole infrastructure comprised of different\nsystems architecture.\n\nBabuk sample:\n\nFilename Babuk_nas.bin\n\nFile Type ELF 32-bit LSB executable\n\nFile Size 2MB\n\nSHA256 e43462670c467d4899ce61e2d202d93049499b10fcaaf05d98d53616567a4276\n\nSections 23\n\nFigure 8. Babuk sample summary\n\n\nAs we know, for Windows, Babuk replaced Chacha encryption with the HC128 algorithm in mid-January, but for the Linux version it still uses Chacha\nand Curve25519 algorithms:\n\nFigure 9. Main Go files used by Babuk\n\nBefore starting the encryption process, the sample will check if the\nprocessor is allowing MMX instructions because Go requires MMX support\nfor it to compile properly:\n\nFigure 10. Babuk checks for MMX instructions support\n\n\n-----\n\nMMX instructions allow a single instruction to execute against multiple\nitems of data concurrently, providing the program can be expressed in that\nform.\n\nIt also continues to map the CPU by looking for virtual processors by using\n“getproccount” and “sched_getaffinity” system calls, to avoid multiple\ncalls and touching the filesystem:\n\n\nFigure 11. CPU Checking Flow and Mapping\n\nAfter the processor recognition, the sample will set the environment to run\ncorrectly (set GCC (GNU Compiler Collection), increase the default stack\nsize of goroutine, implement synchronization algorithms with atomics, etc).\n\nBabuk manipulates the buffers a lot from the victim computer, notably with\nthe garbage collector (GC) process to free memory while other goroutines\nmodify it. For example, if GC is freeing memory, goroutines report all\ntheir memory writes to it. The goal is to prevent concurrent memory\nmodifications being missed by the current freeing phase. To do it, Golang\nuses a “write barrier” which performs the write and informs GC.\n\n\n-----\n\nIn this sample, before writing to memory, the code checks some variables:\n\n- If the “write barrier” is activated and calls “runtime.gcWriteBarrier”:\n\nFigure 12. Write Barrier checks\n\n\n\n- If that pointer writes, follow the CGO (a tool used by Go) rules, used to\n\nimport a pseudo-package “C.” The Go code can then refer to types\nsuch as C.size_t, variables such as C.stdout, etc. If the import of “C”\nis immediately preceded by a comment, that comment (called the\npreamble), is used as a header when compiling the C parts of the\npackage:\n\nFigure 13. Pseudo C package import\n\n\n-----\n\nAll the checks for CGO are made using atomic.\n\nThe sample implements a “write barrier” slow path. The write barrier\nhas what we call a fast path that enqueues to a per-P write barrier buffer,\nwhich is written in assembly and does not clobber any general-purpose\nregisters, so it does not have the usual overheads of a Go call. The slow\npath is used when the buffer fills up; the write barrier invokes the slow path\n“wbBufFlush” to flush the buffer to the GC work queues: this path spills all\nregisters and disallows any GC safe points that could observe the stack\nframe.\n\nOne point of note is that the samples check for the HugePages size, a\nmechanism that enables memory pages that are greater than their default\nsize, to optimize operations. To do it, it checks the path “/sys/kernel/\nmm/transparent_hugepage/hpage_pmd_size” by using the variable\n“sysTHPSizePath”, declared as:\n\n```\nvar sysTHPSizePath =[]byte(“/sys/kernel/mm/transparent _ hugepage/\nhpage _ pmd _ size\\x00”)\n\n```\n\n##### Memory Alloc:\n\nNext, the sample starts to initiate the memory allocation process by using\nseveral Golang functions. First, it uses “runtime.mallocinit” and checks the\nphysical page size by using “physPageSize” a couple of times for mapping\nand unmapping operations:\n\n\nFigure 14. Memory Allocation + “physPageSize” check\n\n\n-----\n\nHere is a code example:\n\n```\n// Check physPageSize.\n     if physPageSize == 0 {\n         // The OS init code failed to fetch the physical page\nsize.\n         throw(“failed to get system page size”)\n     }\n     if physPageSize > maxPhysPageSize {\n         print(“system page size (“, physPageSize, “) is larger\nthan maximum page size (“, maxPhysPageSize, “)\\n”)\n         throw(“bad system page size”)\n     }\n     if physPageSize < minPhysPageSize {\n         print(“system page size (“, physPageSize, “) is small­\ner than minimum page size (“, minPhysPageSize, “)\\n”)\n         throw(“bad system page size”)\n     }\n     if physPageSize&(physPageSize-1) != 0 {\n         print(“system page size (“, physPageSize, “) must be a\npower of 2\\n”)\n         throw(“bad system page size”)\n     }\n     if physHugePageSize&(physHugePageSize-1) != 0 {\n         print(“system huge page size (“, physHugePageSize, “)\nmust be a power of 2\\n”)\n         throw(“bad system huge page size”)\n\n```\n\nThen “mallocinit” is used to reserve virtual memory for future allocations\nand initializes the “mheap” global variable used as central storage for all\nmemory-related objects.\n\nAs expected, the heap is used to allocate memory by initializing an\nallocator and calls the “fixAlloc_Alloc” function each time the sample\nwants to allocate new mcache, mspan, etc. It allocates memory but,\ninstead of allocating the actual size of the structure (f.size bytes), it sets\n“_FixAllocChunk” bytes. The rest of the available space is stored in the\nallocator.\n\nFinally, the cache is initialized as:\n\n```\n_ g _ := getg()\n_ g _ .m.mcache = allocmcache()\n\n```\n\nThe “allocmcache” function calls “fixAlloc_Alloc” to initialize a new\nmcache struct. The mcache field is initialized only for those threads that\nare currently executed and it is relocated to another thread whenever a\nprocess switch occurs.\n\nA lot of settings are made by the sample to prepare the system before\nencryption; we are not going deeper on this here as it is not the most\ninteresting part for this sample.\n\n\n-----\n\n##### Encryption\n\nDirectories and files are listed by using the package “filepath.”\nStrangely, the sample reads only the first 250 bytes of each file using the\n“ReadAtLeast” function, which is unusual and not documented by the\nBabuk team.\n\nInitially, “io.ReadAtLeast()” will read as many bytes as byteSlice can hold.\nHere is an example:\n\n```\nbyteSlice := make([]byte, 512)\n  minBytes := 8\n\n```\nnumBytesRead, err := io.ReadAtLeast(file, byteSlice, minBytes)\n```\n  if err != nil {\n    log.Fatal(err)\n\n```\n\nSo, theoretically, an implementation issue is present in this sample.\n\nThen, Babuk instantiates Curve25519 for the key generation and exchange\nalgorithm to protect the key and encrypt files.\n\n\nFigure 15. Curve25519 instantiated\n\n\n-----\n\nThen it uses the Chacha algorithm for the encryption part, by using the\nkeys generated from the Curve25519 algorithm and SHA256 hash:\n\nFigure 16. SHA256 used with the key generated\n\n\nFigure 17. Babuk encryption example\n\n\n-----\n\n##### Key Findings\n\nThe encrypted files that we received do not belong to this sample as this\none encrypts more than 512 bytes (0x200 in hex; other versions seem to\nencrypt only 0x250 bytes, and this sample does not add the text “chu...” to\nthe end of the files, we received).\n\nThe decryptor seems to belong to the same sample but, as we saw earlier,\nwe have a limit in the maximum number of bytes that will decrypt, which is\nstrange.\n\nOverall, the decryptor is poor as it only checks for the extension “.babyk”\nwhich will miss any files the victim may have renamed in an attempt to\nrecover them. Also, the decryptor checks if the file is more than 32 bytes in\nlength, as the last 32 bytes are combined later with other hardcoded values\nto get the final key. This is bad design as those 32 bytes could be trash,\ninstead of the key, as the customer could make things, etc. It does not\noperate efficiently by checking the paths that are checked in the malware,\ninstead it analyzes everything. Another error we noticed was that the\ndecryptor tries to remove a ransom note name that IS NOT the same that\nthe malware creates in each folder. This does not make any sense unless,\nperhaps, the Babuk developers/operators are delivering a decryptor that\nworks for a different version and/or sample.\n\n\nAnother important thing is this sample is designed to be launched manually\nor with some script with an argument as the path to encrypt; with this path\nthe malware calls to the OS function of “/path/filepath.Walk” that needs\none argument that is a callback function executed per file/folder found as\na new g thread (a Golang mechanism to speed the process). In the case\nthat there is no argument, the malware finishes reporting the usage in the\nterminal. This callback function checks that the file/folder does not exist in\nsome paths of the operating system, the name of the ransom note, creates\nthe ransom note if it is needed, and launches a new g thread to encrypt the\nfile. This procedure of using g threads makes the ransomware very quick to\nencrypt. They control the synchronization with a mutex mechanism (lock\nand unlock) and additionally, for some critical parts, they use the Go library\n“wait” command to control all g threads. Each encrypted file will display\ninformation in the terminal.\n\n##### Conclusion\n\nThe Babuk threat actor, albeit having been active for only a short time,\ncaused a lot of damage by operating with faulty ransomware. This blog\nhas shown the modus operandi of the threat actor and analyzed the\nransomware used by it. Several flaws were identified that showed how\nthe decryption process fails in certain instances, causing irrecoverable\ndamage. We suspect that this poor design of the ransomware was the\nreason that the threat actor decided to move towards a data management\nposition.\n\n\n-----\n\n##### YARA Rule\n\n\n##### IOCs: Babuk NAS Locker\n\n```\nrule RANSOM _ BabukLocker _ NAS _ Apr2021 {\nmeta:\ndescription = “Rule to detect BabuLocker Linux edition”\nauthor = “TS @ McAfee ATR”\ndate = “04-27-2021”\nhash = “a564da1ed886756e375de5f56241699e”\nmalware _ type = “Ransom”\nstrings:\n$s1 = “BABUK _ LOCK _ curve25519” wide ascii\n$s2 = “crypto/chacha20” wide ascii\n\n```\n$s3 = “filepath.Walk” wide ascii\n```\n$s4 = “/sys/kernel/mm/transparent _ hugepage/hpage _ pmd _ size” wide\nascii\ncondition:\n\n```\nfilesize >= 1MB and filesize <= 3MB and\n```\n4 of ($s*)\n}\n\n```\n```\n8c6f768c90103857c59f031fb043d314db6a7371908a1f45bc2e86cf2ad68268\n8daf429bb21285cfcf24dcc4797501ee3d4daf73364055ee5b002492ad55a3e1\ne505b24de50b14aed35cf40725dc0185cab06fed90269d445ec7a4b36de124b6\ne8cee8eab4020e1aadd4631ed626ab54d8733f8b14d683ca943cd4e124eeef55\n\n```\n\nEndnotes\n1 \u0007http://essay.utwente.nl/81595/1/Keijzer_MA_EEMCS.pdf\n2 \u0007https://github.com/bb00/zer0dump\n3 \u0007https://www.secura.com/blog/zero-logon\n4 \u0007https://www.databreaches.net/babuk-closes-one-shop-switches-to-raas/\n5 \u0007https://heimdalsecurity.com/blog/babuk-ransomware-leaks-personal-data-of-metropolitan\npolice-officers/\n6 \u0007https://www.bleepingcomputer.com/news/security/babuk-ransomware-readies-shut-down-post\nl t l /\n\n\n-----\n\n##### About McAfee\n\nMcAfee is the device-to-cloud cybersecurity\ncompany. Inspired by the power of working\ntogether, McAfee creates business and\nconsumer solutions that make our world a safer\nplace. By building solutions that work with other\ncompanies’ products, McAfee helps businesses\norchestrate cyber environments that are truly\nintegrated, where protection, detection, and\ncorrection of threats happen simultaneously\nand collaboratively. By protecting consumers\nacross all their devices, McAfee secures their\ndigital lifestyle at home and away. By working\nwith other security players, McAfee is leading\nthe effort to unite against cybercriminals for the\nbenefit of all.\n\n[www.mcafee.com](http://www.mcafee.com)\n\n6220 America Center Drive\nSan Jose, CA 95002\n888 847 8766\n\n\n##### McAfee ATR\n\nThe McAfee® Advanced Threat Research\nOperational Intelligence team operates globally\naround the clock, keeping watch of the latest\ncyber campaigns and actively tracking the\nmost impactful cyber threats. Several McAfee\nproducts and reports, such as MVISION Insights\nand APG ATLAS, are fueled with the team’s\nintelligence work. In addition to providing the\nlatest Threat Intelligence to our customers, the\nteam also performs unique quality checks and\nenriches the incoming data from all of McAfee’s\nsensors in a way that allows customers to hit the\nground running and focus on the threats that\nmatter.\n\n[Subscribe to receive our Threat Information.](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n\nMcAfee and the McAfee logo are trademarks or registered trademarks of McAfee, LLC or its subsidiaries in the US and other countries.\nOther marks and brands may be claimed as the property of others. Copyright © 2021 McAfee, LLC. 4779_0721\nJULY 2021\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.mcafee.com/enterprise/en-us/assets/reports/rp-babuk-moving-to-vm-nix-systems.pdf"
    ],
    "report_names": [
        "rp-babuk-moving-to-vm-nix-systems.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1626734643,
    "ts_modification_date": 1626859288,
    "files": {
        "pdf": "https://archive.orkl.eu/32c237176c43b1fe92187a58a6e09b657be7c742.pdf",
        "text": "https://archive.orkl.eu/32c237176c43b1fe92187a58a6e09b657be7c742.txt",
        "img": "https://archive.orkl.eu/32c237176c43b1fe92187a58a6e09b657be7c742.jpg"
    }
}