{
    "id": "6cc96c22-a368-4a87-b4af-b9e70604ea86",
    "created_at": "2023-05-06T02:09:55.803536Z",
    "updated_at": "2025-03-27T02:05:46.611022Z",
    "deleted_at": null,
    "sha1_hash": "1fc07c12f9f10adc33f12d2b220915d5c68ce404",
    "title": "2023-04-11 - Guidance for investigating attacks using CVE-2022-21894- The BlackLotus campaign",
    "authors": "",
    "file_creation_date": "2023-05-05T01:58:49Z",
    "file_modification_date": "2023-05-05T01:58:49Z",
    "file_size": 1151218,
    "plain_text": "# Guidance for investigating attacks using CVE-2022-21894: The BlackLotus campaign\n\n**microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-**\ncampaign/\n\nApril 11, 2023\n\nThis guide provides steps that organizations can take to assess whether users have been targeted\n[or compromised by threat actors exploiting CVE-2022-21894 via a Unified Extensible Firmware](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2022-21894)\nInterface (UEFI) bootkit called BlackLotus. UEFI bootkits are particularly dangerous as they run at\ncomputer startup, prior to the operating system loading, and therefore can interfere with or\ndeactivate various operating system (OS) security mechanisms such as BitLocker, hypervisorprotected code integrity (HVCI), and Microsoft Defender Antivirus. Though this could impede\ninvestigations and threat hunting efforts, several artifacts can still be leveraged to identify affected\ndevices. This document covers:\n\nTechniques to determine if devices in an organization are infected\nRecovery and prevention strategies to protect your environment\n\nIt is critical to note that a threat actor’s use of this bootkit is primarily a persistence and defense\nevasion mechanism. It is not a first-stage payload or an initial access vector and can only be\ndeployed to a device to which a threat actor has already gained either privileged access or\n[physical access. The malware uses CVE-2022-21894 (also known as Baton Drop) to bypass](https://github.com/Wack0/CVE-2022-21894)\nWindows Secure Boot and subsequently deploy malicious files to the EFI System Partition (ESP)\nthat are launched by the UEFI firmware. This allows the bootkit to:\n\nAchieve persistence by enrolling the threat actor’s Machine Owner Key (MOK)\nTurn off HVCI to allow deployment of a malicious kernel driver\nLeverage the kernel driver to deploy the user-mode HTTP downloader for command and\ncontrol (C2)\nTurn off Bitlocker to avoid tamper protection strategies on Windows\nTurn off Microsoft Defender Antivirus to avoid further detection\n\nFor a comprehensive analysis of the BlackLotus installation process and follow-on actions, read\n[this blog by ESET.](https://www.welivesecurity.com/2023/03/01/blacklotus-uefi-bootkit-myth-confirmed/)\n\n## Detection opportunities\n\nMicrosoft Incident Response (previously known as Microsoft Detection and Response Team –\nDART), through forensic analysis of devices infected with BlackLotus, has identified multiple\nopportunities for detection along several steps in its installation and execution processes. The\nartifacts analyzed include:\n\nRecently written bootloader files\nStaging directory artifacts created\n\n\n-----\n\nRegistry key modified\nWindows Event logs entries generated\nNetwork behavior\nBoot Configuration log entries generated\n\nAs threat hunters begin examining environments, it is crucial to adopt a comprehensive hunting\nstrategy across these artifacts to down-filter false positives and surface true positives. Many of\nthese artifacts, when observed in isolation, are low fidelity. Observing them in tandem with others,\nhowever, increases their significance in determining if a device has been infected.\n\n### Recently created and locked bootloader files\n\nBlackLotus writes malicious bootloader files to the EFI system partition (ESP) and subsequently\nlocks them to protect them from deletion or tampering. If recently modified and locked files are\nidentified in the ESP on a device, especially those matching known BlackLotus bootloader\nfilenames, these should be considered highly suspect and the devices should be removed from the\nnetwork to be examined for further evidence of BlackLotus or follow-on activity.\n\nTo determine if such files exist in the ESP, threat hunters can mount the boot partition (with the\n_mountvol command-line utility, for example) to examine the creation dates of the files within. Files_\nwith mismatched creation times, as well as those with names matching those protected by the\nBlackLotus kernel driver, should be considered suspicious (Figure 1). The LastModified\ntimestamps of the files in the ESP should be compared to each other; the timestamps and\nfilenames can also be compared against those in the OS partition under C:\\Windows\\Boot\\EFI.\n\nThe files protected by the driver include, as originally listed by ESET:\n\n_ESP:\\EFI\\Microsoft\\Boot\\winload.efi_\n_ESP:\\EFI\\Microsoft\\Boot\\bootmgfw.efi_\n_ESP:\\EFI\\Microsoft\\Boot\\grubx64.efi_\n\nFigure 1:\n\nEvidence of recent modification dates and matching filenames of BlackLotus-associated files on a\nBlackLotus infected device.\nTo further confirm if any files with matching filenames or mismatched modification times are\nsuspect, threat hunters can leverage the local CertUtil command-line utility to attempt to calculate\nthe hash of a suspected bootloader file in the ESP. In Figure 1, winload.efi does NOT have a\nmismatched modified time yet matches the filename protected by the BlackLotus kernel driver\n\n\n-----\n\nSince these protected bootloader files are locked by BlackLotus, any attempt to access these files\ngenerates an ERROR_SHARING_VIOLATION error with the message “The process cannot\n_access the file because it is being used by another process”. Figure 2 depicts this error being_\ngenerated when attempting to hash winload.efi on the infected device from Figure 1, further\nconfirming that it is BlackLotus-related in this scenario.\n\nFigure 2:\n\nCertUtil reporting an ERROR_SHARING_VIOLATION message upon attempting to hash\nwinload.efi in the ESP of a BlackLotus infected device.\nIf the malware is active, CertUtil reports the sharing violation error as in Figure 2; if not, CertUtil\nreports the hash of the file. Files in the ESP that return this error should be considered highly\nsuspicious, especially those matching the protected filenames listed above.\n\n### BlackLotus staging directory presence\n\nDuring the installation process, BlackLotus creates a custom directory under ESP:/system32/.\nThough the files within are deleted following successful installation, the directory itself is not\ndeleted. Additionally, forensic analysis of the ESP may reveal the historical presence of the files\npreviously contained in this directory (Figure 3).\n\nFigure 3: Evidence of deleted files in ESP:\\system32\\ associated with BlackLotus, in a custom\nstaging directory still present post-installation.\n\n### Registry modification\n\nTo turn off HVCI, the installer modifies the registry key\n_HKLM:\\SYSTEM\\CurrentControlSet\\Control\\DeviceGuard\\Scenarios\\HypervisorEnforcedCodeIntegrity_\nby setting the value Enabled to “0” – but only if the key already exists. Threat hunters should\nexamine their environment for this registry key modification (Figure 4).\n\nFigure 4:\n\nRegEdit depiction of the modified registry key to disable HVCI\n\n\n-----\n\n### Event logs entries\n\nBlackLotus disables Microsoft Defender Antivirus as a defense evasion method by patching its\ndrivers and stripping the main process’s privileges.\n\nThis behavior may produce entries in the Microsoft-Windows-Windows Defender/Operational log in\nWindows Event Logs. Relevant log entries will indicate that Antimalware security intelligence has\n_stopped functioning for an unknown reason (see Figure 5)._\n\nFigure 5: Event Log\n\nindicating Microsoft Defender Antivirus real-time protection has stopped functioning\nThe disabling of Microsoft Defender Antivirus may also result in the service stopping unexpectedly,\nproducing an Event ID 7023 in the System event log (with Service Control Manager as the\nProvider Name). Relevant log entries will name the Microsoft Defender Antivirus Service as the\naffected service (Figure 6).\n\n\n-----\n\nFigure 6: System\n\nevent log entry indicating the Microsoft Defender Antivirus service has been terminated with an\nerror\n\n### Network logging\n\nOutbound network connections from winlogon.exe, particularly to port 80, should be considered\nhighly suspicious. This is the result of the injected HTTP downloader function of BlackLotus\nconnecting to the C2 server or performing network configuration discovery. Microsoft Incident\nResponse observed this connection with Sysmon monitoring on an infected device. Figure 7\ndepicts winlogon.exe attempting to communicate to the api.ipify.org service to determine the public\nIP address of the compromised device.\n\n\n-----\n\nFigure 7: Sysmon event entry indicating winlogon.exe attempting to communicate outbound on\nport 80\n[This entry was captured with a simple modification to the SwiftOnSecurity Sysmon configuration](https://github.com/SwiftOnSecurity/sysmon-config)\n(see Figure 8).\n\nFigure 8:\n\nModified Sysmon configuration to detect winlogon.exe network connection behavior\n\n\n-----\n\nAnalysis of netstat output on an affected device may also reveal winlogon.exe maintaining a\nnetwork connection on port 80. Given the configuration capabilities of the implant, the connection\nmay be intermittent.\n\n### Boot configuration log analysis\n\nTrusted Computing Group (TCG) logs, also known as MeasuredBoot logs, are Windows Boot\n[Configuration Logs that contain information about the Windows OS boot process. To retrieve these](https://learn.microsoft.com/en-us/windows/security/information-protection/tpm/how-windows-uses-the-tpm)\nlogs, the device must be running at least Windows 8 and have the Trusted Platform Module (TPM)\nenabled.\n\nFrom [How Windows uses the Trusted Platform Module: “Windows 8 introduced Measured Boot as](https://learn.microsoft.com/en-us/windows/security/information-protection/tpm/how-windows-uses-the-tpm)\na way for the operating system to record the chain of measurements of software components and\nconfiguration information in the TPM through the initialization of the Windows operating system.”\n“For software, Measured Boot records measurements of the Windows kernel, Early-Launch AntiMalware drivers, and boot drivers in the TPM.”\n\nThe BlackLotus bootkit has boot drivers that are loaded in the boot cycle. MeasuredBoot logs list\nthe BlackLotus components as EV_EFI_Boot_Services_Application.\n\nThese logs are in the C:\\Windows\\Logs\\MeasuredBoot directory, which contains multiple files with\nthe extension .log – one for each reboot of the system. These logs can be compared to one\nanother to identify deltas in components added or removed from each boot.\n\nIn the case of BlackLotus installation, two components are added when BlackLotus becomes\nactive on a system: the grubx64.efi driver and winload.efi driver (see Figure 9).\n\nFigure 9: BlackLotus components visible in MeasuredBoot logs after parsing to XML\nThe MeasuredBoot log files cannot be accessed normally on a running system; they must be\nacquired either through a forensic image or raw NTFS reader. The log files must then be decoded\nand converted to XML/JSON. A sample script to extract and parse these logs is presented here,\nbased on GitHub – mattifestation/TCGLogTools: A set of tools to retrieve and parse TCG\nmeasured boot logs.\n\n\n-----\n\n```\n$TCGLogBytes Get TCGLogContent LogType SRTMCurrent\n\n$TCGLog = ConvertTo-TCGEventLog -LogBytes $TCGLogBytes\n\n$PCR4 = $TCGLog.Events.PCR4\n\nforeach ($Event in $PCR4) {\n\n  if ($Event.EventType -eq \"EV_EFI_BOOT_SERVICES_APPLICATION\") {\n\n    $DevicePath = $Event.Event.DevicePath\n\n    if ($DevicePath -is [array]) {\n\n      foreach ($Device in $DevicePath) {\n\n        if (($Device.Type -eq \"MEDIA_DEVICE_PATH\") -and ($Device.SubType -eq\n\"MEDIA_FILEPATH_DP\")) {\n\n           Write-Host \"Boot application:\", $Device.DeviceInfo.PathName\n        }\n\n      }\n\n    } else {\n\n      $PathName = $DevicePath.DeviceInfo.PathName\n\n      Write-Host \"Boot application:\", $PathName\n\n    }\n\n  }\n\n}\n\n```\nExample output of this script from an infected device can be seen in Figure 10.\n\nFigure 10:\n\nExample output of the TCG parsing script to enumerate boot components\n\n## Detection details\n\nMicrosoft Defender Antivirus detects threat components as the following malware (note that these\nsignatures trigger on hashes of known BlackLotus samples):\n\n[Trojan:Win32/BlackLotus](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/BlackLotus&threatId=-2147125304&ocid=magicti_ta_ency)\n[Trojan:Win64/BlackLotus](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win64/BlackLotus!MSR&threatId=-2147125210&ocid=magicti_ta_ency)\n\nMicrosoft Defender for Endpoint alerts on known BlackLotus activity and/or post-exploitation\nactivity. The following alert title can indicate threat activity on your network:\n\nPossible vulnerable EFI bootloader\n\n\n-----\n\nNetwork protection in Microsoft Defender for Endpoint blocks connections to known indicators\nassociated with BlackLotus C2 servers.\n\n## Recovery and prevention guidance\n\nIf a device is determined to have been infected with BlackLotus, the device should be removed\nfrom the network and reformatted (both the OS partition and EFI partition) or restored from a\nknown clean backup that includes the EFI partition.\n\nTo prevent infection via BlackLotus or other variants abusing CVE-2022-21894, organizations\nshould:\n\nPractice the principle of least privilege and maintain credential hygiene. Avoid the use of\ndomain-wide, admin-level service accounts. Restricting local administrative privileges can\nhelp limit installation of remote access trojans (RATs) and other unwanted applications.\n\nThis is key to preventing threat actors looking to deploy BlackLotus, which requires either remote\nadministrative privileges on a target machine or physical access to the device. Organizations\nshould implement defense-in-depth strategies to minimize the risk of threat actors gaining access\nand an administrative foothold in the environment. This can include detection and/or prevention at\nmultiple stages prior to deployment of BlackLotus:\n\nA threat actor gaining initial access via phishing, perimeter device compromise, or other\nvectors\nA threat actor compromising user or service account credentials on the network\nA threat actor moving laterally through the network using unusual or unauthorized\naccounts, abusing remote access software, or other mechanisms\nA threat actor escalating and gaining domain or local administrative privileges\nA threat actor creating malicious files on disk, including the BlackLotus installers or EFI\nfiles\n\nCustomers should keep antimalware products up to date. Customers utilizing automatic\nupdates for Microsoft Defender Antivirus do not need to take additional action. Enterprise\ncustomers managing updates should select the detection build 383.1029.0 or newer and\ndeploy it across their environments.\n\nRemove the Microsoft 3rd Party UEFI CA from your system’s UEFI Secure boot configuration\nif this is not required for your system to boot. Performing this step blocks BlackLotus from\nworking but does not eliminate the vulnerability.\n\n## References\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-11 - Guidance for investigating attacks using CVE-2022-21894- The BlackLotus campaign.pdf"
    ],
    "report_names": [
        "2023-04-11 - Guidance for investigating attacks using CVE-2022-21894- The BlackLotus campaign.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338995,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1683251929,
    "ts_modification_date": 1683251929,
    "files": {
        "pdf": "https://archive.orkl.eu/1fc07c12f9f10adc33f12d2b220915d5c68ce404.pdf",
        "text": "https://archive.orkl.eu/1fc07c12f9f10adc33f12d2b220915d5c68ce404.txt",
        "img": "https://archive.orkl.eu/1fc07c12f9f10adc33f12d2b220915d5c68ce404.jpg"
    }
}