{
    "id": "6cdac605-2adf-4a02-9800-95ea79258e29",
    "created_at": "2023-01-12T14:59:41.724264Z",
    "updated_at": "2025-03-27T02:16:20.815238Z",
    "deleted_at": null,
    "sha1_hash": "1c54cc3bf9b0cd1e2d1bb63b9ccb0d99fd8e4251",
    "title": "2016-10-28 - zxshell repository",
    "authors": "",
    "file_creation_date": "2016-08-19T14:22:03Z",
    "file_modification_date": "2016-08-19T17:55:16Z",
    "file_size": 2370973,
    "plain_text": "# THREAT INTELLIGENCE REPORT FOR THE TELECOMMUNICATIONS INDUSTRY\n\n\n# THREAT INTELLIGENCE\n\n\n-----\n\n#### Table of Contents\n\nIntroduction ........................................................................................................................... 3\n\nExecutive Summary .............................................................................................................. 4\n\nTypical Threats Targeting Telecoms ..................................................................................... 5\n\nOverview ........................................................................................................................... 5\n\nThreats Directed at Telecoms Companies ......................................................................... 5\n\nTargeted Attacks ............................................................................................................ 6\n\nUnaddressed Software Vulnerabilities ............................................................................ 6\n\nThe Impact of Service Misconfiguration .......................................................................... 7\n\nVulnerabilities in Network Devices .................................................................................. 9\n\nMalicious Insiders ......................................................................................................... 11\n\nThreats Targeting CSP/ISP Subscribers ......................................................................... 12\n\nOverview ...................................................................................................................... 12\n\nSocial engineering, Phishing and Other Ways In .......................................................... 13\n\nVulnerable Kit ............................................................................................................... 13\n\nThe Risk of Local Cells ................................................................................................. 15\n\nUSIM Card Vulnerabilities ............................................................................................. 16\n\nConclusion .......................................................................................................................... 17\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 2 of 17\n\n\n-----\n\n## Introduction\n\nThe telecommunications industry keeps the world connected. Telecoms providers build,\noperate and manage the complex network infrastructures used for voice and data\ntransmission – and they communicate and store vast amounts of sensitive data. This makes\nthem a top target for cyber-attack.\n\n[According to PwC’s Global State of Information Security, 2016, IT security incidents in the](http://www.pwc.com/gx/en/issues/cyber-security/information-security-survey.html)\ntelecoms sector increased 45% in 2015 compared to the year before. Telecoms providers\nneed to arm themselves against this growing risk.\n\nIn this intelligence report, we cover the main IT security threats facing the\ntelecommunications industry and illustrate these with recent examples.\n\nOur insight draws on a range of sources. These include:\n\nThe latest telecoms security research by Kaspersky Lab experts.\n\nKaspersky Lab monitoring systems, such as the cloud antivirus platform, Kaspersky\n\nSecurity Network (KSN), our botnet tracking system and multiple other internal\nsystems including those used to detect and track sophisticated targeted (advanced\npersistent threat, APT) attacks and the corresponding malware.\n\nUnderground forums and communities.\n\nCentralized, specialized security monitoring systems (such as Shodan).\n\nThreat bulletins and attack reports.\n\nNewsfeed aggregation and analysis tools.\n\nThreat intelligence is now a vital weapon in the fight against cyber-attack. We hope this\nreport will help telecoms providers to better understand the cyber-risk landscape so that they\ncan develop their security strategies accordingly.\n\nWe can provide more detailed sector and company-specific intelligence on these and other\nthreats. For more information on our Threat Intelligence Reporting services please email\nintelligence@kaspersky.com.\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 3 of 17\n\n\n-----\n\n## Executive Summary\n\nTelecommunications providers are under fire from two sides: they face direct attacks from\ncybercriminals intent on breaching their organization and network operations, and indirect\nattacks from those in pursuit of their subscribers. The top threats currently targeting each of\nthese frontlines feature many classic attack vectors, but with a new twist in terms of\ncomplexity or scale that place new demands on telecoms companies.\n\nThese threats include:\n\n**Distributed Denial of Service (DDoS) attacks.  DDoS attacks continue to increase**\n\n[in power and scale and, according to the 2016 Data Breach Investigations Report,](http://www.verizonenterprise.com/verizon-insights-lab/dbir/2016/)\nthe telecommunications sector is hit harder than any other. Kaspersky Lab’s\n[research reveals that in Q2, 2016,](https://securelist.com/analysis/quarterly-malware-reports/75513/kaspersky-ddos-intelligence-report-for-q2-2016/) the longest DDoS attack lasted for 291 hours (or\n12.1 days) – significantly longer than the previous quarter’s maximum (8.2 days),\nwith vulnerable IoT devices increasingly used in botnets. Direct DDoS attacks can\nreduce network capacity, degrade performance, increase traffic exchange costs,\ndisrupt service availability and even bring down Internet access if ISPs are hit. They\ncan be a cover for a deeper, more damaging secondary attack, or a route into a key\nenterprise subscriber or large-scale ransomeware attack.\n\n**The exploitation of vulnerabilities in network and consumer devices. Our**\n\nintelligence shows that vulnerabilities in network devices, consumer or business\nfemtocells, USBs and routers, as well as root exploits for Android phones, all provide\nnew channels for attacks – involving malware and technologies that individuals,\norganisations and even basic antivirus solutions cannot always easily remove.\n\n**Compromising subscribers with social engineering, phishing or malware.**\n\nThese classic techniques remain popular and can easily be mastered by entry-level\ncybercriminals, although 2016 sees changes in how more sophisticated attackers\nconduct their campaigns. Growing numbers of cyber-attackers now combine data\nsets from different sources, including open sources, to build up detailed pictures of\npotential targets for blackmail and social engineering purposes.\n\n**Insider threat is growing. Detailed profiles of targets are also used to recruit**\n\ninsiders to help perpetrate cybercrime. Some insiders help voluntarily, others are\ncooerced through blackmail. Insiders from cellular service providers are recruited\nmainly to provide access to data, while staff working for Internet service providers are\nchosen to support network mapping and man-in-the-middle attacks.\n\nOther threats facing telecommunications companies include targeted attacks; poorly\nconfigured access controls, particularly where interfaces are publicly available to any\nInternet user; inadequate security for 2G/3G communications; and the risk of telecoms\nproviders being drawn into unrelated attacks that exploit telecoms resources, and suffering\ncollateral damage as a result.\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 4 of 17\n\n\n-----\n\n## Typical Threats Targeting Telecoms\n\n### Overview\n\nWe can divide the main threats facing the telecommunications industry into two, interrelated,\ncategories:\n\n**Threats targeting telecommunication companies directly. These include DDoS**\n\nattacks, targeted attacks (APT campaigns), network device vulnerabilities and\nhuman-related threats like insider access, social engineering and the risk of allowing\nthird parties to access information.\n\n**Threats targeting subscribers of telecoms services – particularly the**\n\n**customers of cellular service providers (CSPs) and Internet service providers**\n**(ISPs). These include malware for mobile devices, subscriber data harvesting, end-**\nuser device vulnerabilities, and more.\n\n### Threats Directed at Telecoms Companies\n\n#### DDoS\n\nDDoS (distributed denial of service) attacks remain a serious threat to telecoms providers\naround the world as attackers discover ever more ways of boosting the power and scale of\n[attacks. Kaspersky Lab’s DDoS intelligence report for Q2, 2016 notes that websites in 70](https://securelist.com/analysis/quarterly-malware-reports/75513/kaspersky-ddos-intelligence-report-for-q2-2016/)\ncountries were targeted with attacks. By far the most affected country was China, with South\nKorea and the US also among the leaders. 70.2% of all detected attacks were launched\nfrom Linux botnets, with cybercriminals paying close attention to financial institutions working\nwith cryptocurrency. Another trend observed in Q2 was the use of vulnerable IoT devices in\nbotnets to launch DDoS attacks.\n\nThe telecommunications sector is particularly vulernable to DDoS attacks. According to the\n2016 Data Breach Investigations Report, the telecommunications sector was hit around\ntwice as hard as the second placed sector (financial exchanges), with a median DDoS\n[packet count of 4.61 million packets per second (compared to 2.4 Mpps for exchanges.)](http://www.verizonenterprise.com/verizon-insights-lab/dbir/2016/)\n\nThe impact of a DDoS attack should not be underestimated. Direct attacks can reduce\nnetwork capacity, degrade performance, increase traffic exchange costs, disrupt service\navailability and even bring down Internet access if ISPs are affected. With a growing number\nof connected devices and systems supporting mission-critical applications in areas such as\nhealthcare and transport, unexpected downtime could be life threatening.\n\n**Further, DDoS attacks can be a cover for a deeper, more damaging secondary attack,**\n**or a route into a key enterprise subscriber or large-scale ransomeware attack.**\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 5 of 17\n\n\n-----\n\n[A good example of the first is the 2015 cyber-attack on the UK telecoms company, TalkTalk.](http://www.bbc.co.uk/news/business-34743185)\nThe hack, alledgedly perpetrated by a couple of teenagers, resulted in the loss of around 1.2\nmillion customers' email addresses, names and phone numbers, as well as many thousands\nof customer dates of birth and financial information – all ideal for use in financially-motivated\n[social engineering campaigns. The forensic investigation revealed](http://www.theregister.co.uk/2015/11/03/talktalk_incident_management_review/) that the hackers had used\na smokescreen DDoS attack to conceal their main activities.\n\n**DDoS attacks are also evolving. 2015 saw attackers amplify the power of DDoS attacks by**\nturning them into DrDoS (Distributed reflection Denial of Service) attacks through the use of\nstandard network protocols like NTP, RIPv1, NetBIOS (Network Basic Input/Output System)\nand BGP (Border Gateway Patrol). Another approach that is becoming more commonplace\nis the compromise of end-user routers via network-scanning malware and firmware\nvulnerabilities. Today’s faster mobile data transfer speeds and the growing adoption of 4G\nare also making smartphone-based botnets more useful for implementing DDoS attacks.\n\nThe worrying thing is that even inexperienced attackers can organize quite an effective\nDDoS campaign using such techniques.\n\n#### Targeted Attacks\n\nThe core infrastructure of a telecommunications company is a highly desirable target for\ncybercriminals, but gaining access is extremely difficult. Breaking into the core requires a\ndeep knowledge of GSM architecture, rarely seen except among the most skilled and\nresourced cybercriminals. Such individuals can generally be found working for advanced,\ninternational APT groups and nation-state attackers, entities that have a powerful interest in\nobtaining access to the inner networks of telecommunication companies. This is because\ncompromised network devices are harder to detect by security systems and they offer more\nways to control internal operations than can be achieved through simple server/workstation\ninfiltration.\n\nOnce inside the core infrastructure, attackers can easily intercept calls and data, and control,\ntrack and impersonate subscibers.\n\n**Other APTs with telecommunications on their radar**\n\n[The Regin APT campaign, discovered in 2014, remains of the most sophisticated ever seen](https://securelist.com/blog/research/67741/regin-nation-state-ownage-of-gsm-networks/)\nand has [the ability to infiltrate GSM networks, while the](https://securelist.com/blog/research/67741/regin-nation-state-ownage-of-gsm-networks/) [Turla group, has developed the](https://securelist.com/blog/research/72081/satellite-turla-apt-command-and-control-in-the-sky/)\nability to hijack satellite-based Internet links as part of it’s Command & Control process,\nsuccessfully obscuring its actual location.\n\n[Others, such as Dark Hotel and a new cyber-espionage threat actor likely to be of Chinese](https://securelist.com/blog/research/71713/darkhotels-attacks-in-2015/)\norigin, exploit telecoms networks in their targeted campaigns. In these cases, the telecoms\nproviders often suffer collateral damage even though they are not directly related to the\n[attack. Further details on these can be found on Kaspersky Lab’s expert Securelist blog](https://securelist.com/blog/research/71713/darkhotels-attacks-in-2015/) or\nthrough a subscription to the Kaspersky APT Threat Intelligence Reporting service.\n\n#### Unaddressed Software Vulnerabilities \n\nDespite all the high profile hacks and embarrassing data leaks of the last 12 months,\nattackers are still breaching telecoms defenses and making off with vast quantities of\nvaluable, personal data. In many cases, attackers are exploiting new or under-protected\nvulnerabilities.\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 6 of 17\n\n\n-----\n\nFor example, in 2015, two members of the hacker group, Linker Squad gained access to\nOrange Spain through a company website vulnerable to a simple SQL injection, and stole 10\n[million items of customer and employee data.](http://www.zataz.com/10-millions-de-donnees-volees-a-orange-espagne/)\n\nFigure 1. SQL injection vulnerability on Orange Spain web site\n\n#### The Impact of Service Misconfiguration\n\nIn many cases, the hardware used by by the telecommunications industry carries\nconfiguration interfaces that can be accessed openly via HTTP, SSH, FTP or telnet. This\nmeans that if the firewall is not configured correctly, the hardware in question becomes an\neasy target for unauthorized access.\n\nThe risk presented by publicly exposed GTP/GRX (GPRS Tunneling Protocol/GPRS\nRoaming Exchange) ports on devices provides a good example of this.\n\nAs CSPs encrypt the GPRS traffic between the devices and the Serving GPRS Support\nNode (SGSN), it is difficult to intercept and decrypt the transferred data. However, an\nattacker can bypass this restriction by searching on Shodan.io for devices with open GTP\nports, connecting to them and then encapsulating GTP control packets into the created\ntunnel.\n\nTable 1. Top 10 countries with GTP/GRX ports exposed to Internet access\n\n|#|Country|Col3|Number of GTP/GRX|\n|---|---|---|---|\n|1|China||52.698|\n|2|Turkey||8.591|\n|3|United States of America||6.403|\n\n\n-----\n\n|#|Country|Col3|Number of GTP/GRX|\n|---|---|---|---|\n|4|Canada||5.807|\n|5|Belgium||5.129|\n|6|Colombia||2.939|\n|7|Poland||2.842|\n|8|Morocco||1.585|\n|9|Jamaica||862|\n|10|United Arab Emirates||808|\n\n\nThe Border Gateway Protocol (BGP) is the routing protocol used to make decisions on\nrouting between autonomous systems. Acceptance and propagation of routing information\ncoming from other peers can allow an attacker to implement man-in-the-middle (MITM)\nattacks or cause denial of service. Any route that is advertised by a neighboring BGP\nspeaker is merged in the routing database and propagated to all the other BGP peers.\n\nTable 2. Top five countries with BGP protocol exposed to Internet access\n\n|#|Country|Col3|Number of devices (end of 2015)|\n|---|---|---|---|\n|1|Republic of Korea||16.209|\n|2|India||8.693|\n|3|United States of America||8.111|\n|4|Italy||2.909|\n|5|Russian Federation||2.050|\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 8 of 17\n\n\n-----\n\n[An example of such an attack took place in March 2015, when Internet traffic for 167](http://research.dyn.com/2015/03/uk-traffic-diverted-ukraine/)\nimportant British Telecom customers, including a UK defense contractor that helps to deliver\nthe country's nuclear warhead program, was illegally diverted to servers in Ukraine before\nbeing passed along to its final destinations.\n\nTo avoid probable attacks against BGP from unauthorized remote malefactors, we\nrecommend that companies provide network filtering, allowing only a limited number of\nauthorized peers to connect to BGP services. To protect against malicious re-routing and\nhijacking initiated through authorized autonomous systems we recommend that they monitor\nanomalies in BGP communications (this can be done through specialized software solutions\nor by subscribing to alerts from vendors providing this kind of monitoring.)\n\n#### Vulnerabilities in Network Devices\n\nRouters and other network devices are also primary targets for attacks against\ntelecommunications companies.\n\n[In September 2015, FireEye researchers revealed the router malware “SYNful knock”, a](https://www.fireeye.com/blog/threat-research/2015/09/synful_knock_-_acis.html)\ncombination of leaked privilege (root) credentials and a way of replacing device firmware\n[that targets Cisco 1841, 2811 and 3825 routers (see Cisco advisory here).](http://www.cisco.com/web/about/security/intelligence/ERP_SYNfulKnock.html)\n\nPut simply, SYNful knock is a modified device firmware image with backdoor access that\ncan replace the original operating system if the attacker has managed to obtain privileged\naccess to the device or can physically connect to it.\n\nSYNful is not a pure software vulnerability, but a combination of leaked privileged credentials\ncombined with a certain way of replacing device firmware. Still, it is a dangerous way of\ncompromising an organization’s IT infrastructure.\n\nFigure 2. SYNful knock backdoor sign-in credentials request\n\n\n-----\n\nFigure 3. Worldwide distribution of devices with the SYNful knock backdoor\n\nThe latest information on the number of potentially compromised devices is available\n[through the link https://synfulscan.shadowserver.org/stats/.](https://synfulscan.shadowserver.org/stats/)\n\nA second Cisco vulnerability, CVE-2015-6389 enables attackers to access some sensitive\ndata, such as the password file, system logs, and Cisco PCA database information, and to\nmodify data, run internal executables and potentially make the system unstable or\ninaccessible. Cisco Prime Collaboration Assurance Software releases prior to 11.0 are\n[vulnerable. Follow this Cisco bulletin](http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20151209-pca) for remediation actions.\n\n[For further information on Cisco fixes for its devices see https://threatpost.com/cisco-](https://threatpost.com/cisco-warning-of-vulnerabilities-in-routers-data-center-platforms/115609)\n[warning-of-vulnerabilities-in-routers-data-center-platforms/115609.](https://threatpost.com/cisco-warning-of-vulnerabilities-in-routers-data-center-platforms/115609)\n\nJuniper, another network device manufacturer has been found to carry vulnerabilities in its\noperating system for its NetScreen VPN appliances, enabling third-party access to network\n[traffic. The issue was reported by the vendor in the security advisory JSA10713 on](https://kb.juniper.net/InfoCenter/index?page=content&id=JSA10713&cat=SIRT_1&actp=LIST)\nDecember 18[th], 2015, along with the release of the patch.\n\nIt appears that the additional code with hardcoded password was planted in the source code\nin late 2013. The backdoor allows any user to log in with administrator privileges using hard[coded password “<<< %s(un='%s') = %u”.This vulnerability has been identified as CVE-](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-7755)\n[2015-7755](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-7755) and is considered highly critical.\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 10 of 17\n\n\n-----\n\nTop countries where ScreenOS devices are used are the Netherlands, the United States,\nChina, Italy and Mexico.\n\nFigure 4. Juniper ScreenOS-powered devices worldwide\n\nAnother Juniper backdoor, CVE-2015-7756, affects ScreenOS 6.2.0r15 through 6.2.0r18\nand 6.3.0r12 through 6.3.0r20 and allows a third party to monitor traffic inside VPN\nconnections due to security flaws in the Dual_EC PRNG algorithm for random number\ngeneration.\n\nTo protect the organization from misconfiguration and network device vulnerabilitiy,\nKaspresky Lab recommendats that companies pay close attention to vulnerabilities in the\nnetwork services of telecommunication equipment, establish effective vulnerability and\nconfiguration management processes, and regularly perform security assessments,\nincluding penetration testing for different types of attackers (a remote intruder, a subscriber,\na contractor, etc.).\n\n#### Malicious Insiders\n\nEven if you consider your critical systems and devices protected and safe, it is difficult to\nfully control some attack vectors. People rank at the very top of this list. Their motivations\nare often hard to predict and anticipate, ranging from a desire for financial gain to\ndisaffection, coercion and simple carelessness.\n\nWhile insider-assisted attacks are uncommon, the impact of such attacks can be devastating\nas they provide a direct route to the most valuable information.\n\n\n-----\n\nExamples of insider attacks in recent years include:\n\n   - [A rogue telecoms employee leaking 70 million prison inmate calls, many breaching](http://www.ibtimes.com/securus-technologies-rogue-employee-not-hacker-exposed-70-million-inmate-calls-2181819)\n[client-attorney privilege.](https://theintercept.com/2015/11/11/securus-hack-prison-phone-company-exposes-thousands-of-calls-lawyers-and-clients/)\n\n   - An SMS center support engineer who had intercepted messages containing OTP\n(One-Time Passwords) for the two-step authentication required to login to customer\naccounts at a popular fintech company. The engineer was found to be freely offering\nhis services on a popular DarkNet forum.\n\nFor attackers, infiltrating the networks of ISPs and CSPs requires a certain level of\nexperience – and it is often cheaper and easier to stroll across the perimeter with the help of\na hired or blackmailed insider. Cybercriminals generally recruit insiders through two\napproaches: enticing or coercing individual employees with relevant skills, or trawling\naround underground message boards looking for an appropriate employee or former\nemployee.\n\nEmployees of cellular service providers are in demand for fast track access to subscriber\nand company data or SIM card duplication/illegal reissuing, while staff working for Internet\nservice providers are needed for network mapping and man-in-the-middle attacks.\n\nA particularly promising and successful attack vector for recruiting an insider for malicious\nintrusion is blackmail.\n\nData breaches, such as the 2015 Ashley Madison leak reveal information that attackers can\ncompare with other publically available information to track down where people work and\ncompromise them accordingly. Very often, these leaked databases contain corporate email\naddresses, including those of telecommunication companies.\n\nFurther information on the emerging attack vectors based on the harvesting of Open Source\n[Intelligence (OSINT) can be obtained using Kaspersky Lab’s customer-specific Intelligence](http://media.kaspersky.com/en/business-security/enterprise/Kaspersky_Security_Intelligence_Services_Threat_Intelligence_Services.pdf)\n[Reporting services.](http://media.kaspersky.com/en/business-security/enterprise/Kaspersky_Security_Intelligence_Services_Threat_Intelligence_Services.pdf)\n\n### Threats Targeting CSP/ISP Subscribers\n\n#### Overview\n\nAttacks targeting the customers of cloud and Internet service providers remain a key area of\ninterest for cybercriminals. We’ve revealed a number of malware activities and attack\ntechniques based on internal information and incidents that were caught in our scope. As a\nresult of analyzing this data the following main threats were identified:\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 12 of 17\n\n\n-----\n\n**Obtaining subscribers’ credentials. This is growing in appeal as consumers and**\n\nbusinesses undertake ever more activity online and particularly on mobile. Further,\nsecurity levels are often intentionally lowered on mobile devices in favor of usability,\nmaking mobile attacks even more attractive to criminals.\n\n**Compromising subscribers’ devices. The number of mobile malware infections is**\n\non the rise, as is the sophistication and functionality of the malware. Experienced\nand skilled programmers are now focusing much of their attention on mobile –\nlooking to exploit payment services as well as low-valued assets like compromised\nInstagram or Uber accounts, collecting every piece of data from the infected devices.\n\n**Compromising small-scale telecoms cells used by consumers and businesses.**\n\nVulnerabilities in CSP-provided femtocells allow criminals to compromise the cells\nand even gain access to the entire cloud provider’s network.\n\n**Successful Proof-Of-Concept attacks on USIM cards. Recent research shows**\n\nthat the cryptography of 3G/4G USIM cards is no longer unbreakable. Successful\nattacks allow SIM card cloning, call spoofing and the interception of SMS.\n\n#### Social engineering, Phishing and Other Ways In\n\nSocial engineering and phishing remain popular activities and they continues to evolve and\nimprove, targeting unaware or poorly aware subscribers and telecoms employees.\n\n[The attackers exploit trust and naiivity. In 2015, the TeamHans](http://www.databreaches.net/ca-rogers-hacked-by-teamhans-customer-contracts-and-sensitive-corporate-e-mails-dumped/) hacker group penetrated one\nof Canada’s biggest communications groups, Rogers, simply by repeatedly contacting IT\nsupport and impersonating mid-ranking employees, in order to build up enough personal\ninformation to gain access to the employee’s desktop. The attack provided hackers with\naccess to contracts with corporate customers, sensitive corporate e-mails, corporate\nemployee IDs, documents, and more.\n\nBoth social engineering and phishing approaches are worryingly successful. The Data\nBreach Investigations Report 2016 [found](http://www.verizonenterprise.com/verizon-insights-lab/dbir/2016/) that 30% of phishing emails were opened, and that\n12% clicked on the malicious attachment – with the entire process taking, on average, just 1\nminute and 40 seconds.\n\nSocial engineers and phishers also use multiple ways for increasing the likeness of\nauthenticity in their attacks, enriching their data with leaked profiles, or successfully\nimpersonating employees or contractors. Recently criminals have successfully stolen tens of\nthousands of euros from dozens of people across Germany after finding a way around\nsystems that text a code to confirm transactions to online banking users. After infecting their\nvictims with banking malware and obtaining their phone numbers, they called the CSP’s\nsupport and, impersonating a retail shop, asked for a new SIM card to be activated, thus\ngaining access to OTP (One Time Passwords) or “mTan’s” used for two-factor\nauthentication in online banking.\n\nKaspersky Lab recommends that telecommunications providers implement notification\nservices for financial organizations that alert them when a subscriber’s SIM card has been\nchanged or when personal data is modified.\n\nSome CSPs have also implemented a threat exchange service to inform financial industry\nmembers when a subscriber’s phone is likely to have been infected with malware.\n\n#### Vulnerable Kit\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 13 of 17\n\n\n-----\n\nUSBs, modems and portable Wi-Fi routers remain high-risk assets for subscribers, and we\ncontinue to discover [multiple vulnerabilities in their firmware and user interfaces. These](https://threatpost.com/using-usb-modems-to-phish-and-send-malicious-sms-messages/103939/)\ninclude:\n\nVulnerabilities in web interfaces designed to help consumers configure their devices.\n\nThese can be modified to trick a user into visiting a specially crafted page.\n\nVulnerabilities that result from insufficient authentication. These can allow for the\n\nmodification of device settings (like DNS server addresses), and the interception,\nsending and receiving of SMS messages, or USSD requests, by exploiting different\nXSS and CSRF vulnerabilities.\n\n[RCE (Remote Code Execution) vulnerabilities based on different variants of](http://www.slideshare.net/DC7499/defcon-moscow-0x0a-mikhail-firstov-hacking-routers-as-web-hacker)\n\nembedded Linux that can enable firmware modification and even a complete remote\ncompromise.\n\nFigure 5. Built-in “service” backdoor allowing no-authentication access to device settings\n\nExamples of these kind of vulnerabilities were demonstrated in research by Timur Yunusov\nfrom the SCADAStrangeLove team. The author assessed a number of 3G/4G routers from\nZTE, Huawei, Gemtek and Quanta. He has reported a number of serious vulnerabilities:\n\nRemote Code Execution from web scripts.\n\nArbitrary device firmware modification due to insufficient consistency checks.\n\nCross Site Request Forgert and Cross Site Scripting attacks.\n\n\n-----\n\nAll these vectors can be used by an external attacker for the following scenarios:\n\n[Infecting a subscriber’s computer via PowerShell code or badUSB attack.](https://srlabs.de/badusb/)\n\nTraffic modification and interception.\n\nSubscriber account access and device settings modification.\n\nRevealing subscriber location.\n\nUsing device firmware modification for APT attack persistence.\n\nMost of these issues exist due to web interface vulnerabilities (like insufficient input\nvalidation or CSRF) or modifications made by the vendor during the process of branding its\ndevices for a specific telecommunications company.\n\n#### The Risk of Local Cells\n\nFemtocells, which are essentially a personal NodeB with an IP network connection, are\ngrowing in popularity as an easy way to improve signal coverage inside buildings. Small\nbusiness customers often receive them from their CSPs. However, unlike core systems, they\nare not always submitted to suitably thorough security audits.\n\nFigure 6. Femtocell connection map\n\n[Over the last year, our researchers have found a number of serious vulnerabilities in such](http://www.slideshare.net/arbitrarycode/adventures-in-femtoland-350-yuan-for-invaluable-fun)\n[devices](http://www.slideshare.net/arbitrarycode/adventures-in-femtoland-350-yuan-for-invaluable-fun) that could allow an attacker to gain complete control over them. Compromising a\n[femtocell can lead to call interception, service abuse and even illegal access to the CSP’s](https://media.defcon.org/DEF%20CON%2023/DEF%20CON%2023%20presentations/DEFCON-23-Yuwei-Zheng-Haoqi-Shan-Build-a-Free-Cellular-Traffic-Capture-Tool-with-a-VxWorks-Based-Femto.pdf)\n[internal network.](https://media.defcon.org/DEF%20CON%2023/DEF%20CON%2023%20presentations/DEFCON-23-Yuwei-Zheng-Haoqi-Shan-Build-a-Free-Cellular-Traffic-Capture-Tool-with-a-VxWorks-Based-Femto.pdf)\n\nAt the moment, a successful attack on a femtocell requires a certain level of engineering\nexperience, so risks remain low – but this is likely to change in the future.\n\n\n-----\n\n#### USIM Card Vulnerabilities\n\n[Research presented at BlackHat USA in 2015](https://www.blackhat.com/docs/us-15/materials/us-15-Yu-Cloning-3G-4G-SIM-Cards-With-A-PC-And-An-Oscilloscope-Lessons-Learned-In-Physical-Security-wp.pdf) revealed successful attacks on USIM card\nsecurity. USIMs had previously been considered unbreakable thanks to the AES-based\nMILENAGE algorithm used for authentication. The reseachers conducted differential power\nanalysis for the encryption key and secrets extraction that allowed them to clone the new\ngeneration of 3G/4G SIM cards from different manufacturers.\n\nFigure 7. Right byte guess peak on differential power analysis graph\n\n\n-----\n\n## Conclusion\n\nTelecommunications is a critical infrastructure and needs to be protected accordingly. The\nthreat landscape shows that vulnerabilities exist on many levels: hardware, software and\nhuman, and that attacks can come from many directions. Telecoms providers need to start\nregarding security as a process – one that encompasses threat prediction, prevention,\ndetection, response and investigation.\n\nA comprehensive, multi-layered security solution is a key component of this, but it is not\nenough on its own. It needs to be complemented by collaboration, employee education and\nshared intelligence. Many telecommunications companies already have agreements in place\nto share network capability and capacity in the case of disruption, and now is the time to\nstart reaping the benefit of shared intelligence.\n\nOur Threat Intelligence Reporting services can provide customer-specific insight into the\nthreats facing your organization. If you’ve ever wondered what your business looks like to an\nattacker, now’s the time to find out. Contact us at intelligence@kaspersky.com\n\n\nThreat Intelligence Report for the Telecommunications Industry | page 17 of 17\n\n\n-----\n\n##### Contact us at: intelligence@kaspersky.com (Kaspersky Security Intelligence Service)\n\n\n##### Securelist, the resource for Kaspersky Lab experts’ technical research,\n analysis, and thoughts.\n\n\n##### Follow us\n\n\n##### Kaspersky Lab global Website Eugene Kaspersky Blog\n\n Kaspersky Lab B2C Blog Kaspersky Lab B2B Blog\n\n Kaspersky Lab security news service Kaspersky Lab Academy\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Kaspersky - Threat Intelligence Report for Telecomms - 2016.pdf"
    ],
    "report_names": [
        "Kaspersky - Threat Intelligence Report for Telecomms - 2016.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535581,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1471616523,
    "ts_modification_date": 1471629316,
    "files": {
        "pdf": "https://archive.orkl.eu/1c54cc3bf9b0cd1e2d1bb63b9ccb0d99fd8e4251.pdf",
        "text": "https://archive.orkl.eu/1c54cc3bf9b0cd1e2d1bb63b9ccb0d99fd8e4251.txt",
        "img": "https://archive.orkl.eu/1c54cc3bf9b0cd1e2d1bb63b9ccb0d99fd8e4251.jpg"
    }
}