{
    "id": "6d291c76-dd8e-483b-b86e-c61aa7c30ffc",
    "created_at": "2023-01-12T15:04:20.062952Z",
    "updated_at": "2025-03-27T02:05:22.66645Z",
    "deleted_at": null,
    "sha1_hash": "1d80d5cd530a81df5c9f6af43d0a2633e90d3b11",
    "title": "2021-07-14 - How cybercriminals create turbulence for the transportation industry",
    "authors": "",
    "file_creation_date": "2022-05-25T12:19:22Z",
    "file_modification_date": "2022-05-25T12:19:22Z",
    "file_size": 68056,
    "plain_text": "# How cybercriminals create turbulence for the transportation industry\n\n**[intel471.com/blog/how-cybercriminals-create-turbulence-for-the-transportation-industry](https://intel471.com/blog/how-cybercriminals-create-turbulence-for-the-transportation-industry)**\n\nTransportation companies are so reliant on the internet, they present a juicy target for the\ncybercrime underground.\n\nJul 14, 2021\n\nWhen you break down how transportation companies actually work, you can find yourself\nlooking at nothing but supply chains. From moving people or goods from one place to\nanother, keeping track of the vehicles that are transporting those people or goods, the third\nparties that are responsible for the maintenance and operations of those vehicles, along with\na list of other business-critical functions, it’s easy to see how these companies would need to\nlean heavily on internet-connected technology in order to be successful.\n\nHowever, since these companies are so reliant on the internet, they present a juicy target for\nthe cybercrime underground. Transportation companies are constantly in the discussions on\ncriminal forums, with nefarious actors attempting (and some succeeding) to attack\ncompanies’ infrastructure along their supply chains for their own illegal gains.\n\nBelow are just some of the examples Intel 471 has observed when it comes to criminals going\nafter transportation companies.\n\n## Access to Networks\n\n[Intel 471 has long tracked criminals who specialize in selling access to compromised systems](https://intel471.com/blog/ransomware-attack-access-merchants-infostealer-escrow-service)\nor stolen information. Some of those we have tracked have used their ability to target\ntransportation companies as a way to stand out in the cybercrime underground. Here are\nsome of the instances we have observed:\n\nIn November 2020, an Iranian-based actor advertised unauthorized access to a system\nbelonging to an Iranian-based airline. The actor shared a demonstration video which\nlooked to be from an internal employee portal, which allowed people to access\nemployee account numbers, national codes, passwords, payments, phone numbers,\nusernames and more. The advertisement was shared on a popular Telegram channel\ndedicated to cybercrime, with over 19,000 members.\n\n\n-----\n\nIn January 2021, Intel 471 observed a well-known cybercriminal selling network access\nto a number of companies they allegedly pulled from malware logs. Among the\nadvertised access was a Citrix Gateway believed to be associated with a large,\nmultinational aviation company. The platform detailed access to another aviation\ncompany based in Scandinavia, mainly showcasing programs designed for training. The\nactor is well-known for selling access to Citrix Gateways on various cybercriminal\nforums.\n\nAlso in January 2021, an actor offered to sell information on a remote code execution\n[(RCE) vulnerability allegedly impacting a European-based cargo airline. The actor](https://intel471.com/glossary/vulnerability)\nsought US $150 for the information about the vulnerability that allegedly could be\nexploited to exfiltrate several internal documents and access login credentials. The\nactor further claimed they also uploaded a web shell to the impacted server.\n\n## Gift Cards\n\nGift cards have long been a staple of the cybercrime underground, utilized by criminals as a\nway to move money. Whether it be physical cards or solely online credits, numerous\ntransportation companies use gift cards as a way from customers to buy flights. There are\nactors that have leveraged that ability for their own crimes.\n\nOne actor Intel 471 has tracked has been in the gift card fraud business since at least\n2017. The actor, who was previously engaged in selling compromised remote desktop\nprotocol (RDP) credentials, bought ready-to-use gift cards from other actors, derived\nthem from compromised accounts and sourced access from malware logs. The\ncompanies the actor expressed interest in included three well-known airlines based in\nthe United States, along with one multinational hotel chain. The actor bought gift cards\nfor half or a quarter of their value.\nAnother actor Intel 471 has tracked allegedly claimed to have a large number of digital\ngift cards issued by three well-known airlines based in the United States for sale each\nday. The gift cards were not carded using compromised payment cards, but purchased\nwith points from compromised accounts with rewards programs or cash-back services.\nThe actor primarily obtained credentials for such accounts from malware logs\npurchased on forums.\n\n## Ransomware\n\nRansomware is a top threat for all internet-connected businesses. The transportation sector\nis no different.\n\nIntel 471 has observed numerous attacks on transportation-based organizations, including\nentities in both the public and private sector. These incidents have all the hallmarks of a\nransomware-as-a-service attack, with crews “renting” software to launch the attack,\nhundreds of gigabytes in data stolen, and calls for million-dollar ransom payments.\n\n\n-----\n\nIn March 2021, the operator or operators behind the NEFILIM ransomware-as-aservice affiliate program claimed the compromise of U.S.-based commercial airline\nSpirit Airlines, leaking 40GB of data with over 33,000 files. According to open source\nreporting, Financial data and other personal information of customers who purchased\ntickets to fly with the airline between 2006 and 2021 were posted on a name-andshame blog.\nIn April 2021, a group using the Mount Locker ransomware attacked the Santa Clara\nValley Transportation Authority, stealing about 130 GB of corporate data. The\nresponsible parties are likely an offshoot of those who developed the ransomware, as\nthe organization’s data was posted on a name-and-shame blog operated by a different\ncriminal group. Intel 471 also observed that the criminal crew applied a “double\nextortion” tactic by calling and threatening the victim’s employees.\n\n## Conclusion\n\nTransportation companies are as dependent on technology as any other company. With that\ntrend likely to keep growing, is it imperative that these companies understand where their\nweak spots are when it comes to cybersecurity and how the cybercrime underground will\nexploit them if those weaknesses are left unchecked. Keys to a successful business often rely\non the internet, just as cybercriminals rely on it to carry out their crimes. By being proactive\nin assessing risk and closing vulnerabilities, transportation companies will prevent their\ntechnology stacks from being a target for the cybercrime underground.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-14 - How cybercriminals create turbulence for the transportation industry.pdf"
    ],
    "report_names": [
        "2021-07-14 - How cybercriminals create turbulence for the transportation industry.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535860,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653481162,
    "ts_modification_date": 1653481162,
    "files": {
        "pdf": "https://archive.orkl.eu/1d80d5cd530a81df5c9f6af43d0a2633e90d3b11.pdf",
        "text": "https://archive.orkl.eu/1d80d5cd530a81df5c9f6af43d0a2633e90d3b11.txt",
        "img": "https://archive.orkl.eu/1d80d5cd530a81df5c9f6af43d0a2633e90d3b11.jpg"
    }
}