{
    "id": "6d4dfe55-1538-472b-afec-b3139a5a95c9",
    "created_at": "2023-01-12T15:10:05.255496Z",
    "updated_at": "2025-03-27T02:05:25.859966Z",
    "deleted_at": null,
    "sha1_hash": "0629158a5dc5d8a6edd9d0148df4784c4cba69b9",
    "title": "2021-10-25 - WebAssembly Is Abused by eCriminals to Hide Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:26:42Z",
    "file_modification_date": "2022-05-28T15:26:42Z",
    "file_size": 529648,
    "plain_text": "# WebAssembly Is Abused by eCriminals to Hide Malware\n\n**[crowdstrike.com/blog/ecriminals-increasingly-use-webassembly-to-hide-malware/](https://www.crowdstrike.com/blog/ecriminals-increasingly-use-webassembly-to-hide-malware/)**\n\nBy Mihai Maganu October 25, 2021\n\nCrowdStrike research finds that 75% of the WebAssembly modules are malicious\nWebAssembly is an open standard that allows browsers to execute compiled programs\nCryptocurrency miners boost efficiency by abusing WebAssembly to achieve nearnative execution performance\n[eCriminals turn to WebAssembly to hide web-based malware](https://www.crowdstrike.com/cybersecurity-101/malware/)\n\nCrowdStrike researchers analyzed 12,291 unique WebAssembly (Wasm) samples from May\n2018 to June 2021 and found that 75% of Wasm modules are malicious. WebAssembly is an\nopen standard that allows browsers to execute resource-intensive compiled programs, such\nas games or image manipulation apps, directly in the browser with greater ease and\nperformance.\n\nAnalysis revealed that malicious Wasm modules are used for two threat-related activities:\nmining cryptocurrency and hiding malicious scripts. Some cryptocurrency miners abuse\nWasm to achieve near-native execution performance on the targeted machine, potentially\nenabling more efficient abuse of CPU computing power. Threat actors also use Wasm for\nobfuscation purposes. How? By tampering with specific WebAssembly sections to embed\nmalicious JavaScript or JScript code and trick browsers into executing it\n\n\n-----\n\nSince eCrime activities dominate the threat landscape, according to the recently published\n[CrowdStrike Falcon OverWatch 2021 Threat Hunting Report, abusing Wasm modules for](https://www.crowdstrike.com/resources/reports/threat-hunting-report-2021/)\nbuilding more efficient cryptocurrency miners falls in line with threat actors’ financial\nmotivation.\n\n## What Is WebAssembly?\n\n[WebAssembly started as asm.js, a subset of JavaScript enabling developers to write C and](https://en.wikipedia.org/wiki/Asm.js)\nother CPU-intensive applications for web browsers. Users would need only browsers to\n[perform a wide range of activities. W3C saw the potential in this use case and started](https://en.wikipedia.org/wiki/World_Wide_Web_Consortium)\n[working on the next masterpiece of an open standard, which became WebAssembly.](https://en.wikipedia.org/wiki/WebAssembly)\n\nOne of the defining characteristics of WebAssembly is that it was built for speed and\nperformance, especially when compared to JavaScript. It enables browsers to execute CPUintensive tasks faster and more efficiently without freezing up, something JavaScript could\nnever achieve.\n\nWebAssembly has a binary format made to run in the browser’s Virtual Machine (VM) and a\ntext format that is its assembly representation.\n\nPrevious attempts to achieve this failed — one of the most popular and worst examples is\nAdobe’s [Flash platform. It’s highly likely that WebAssembly also has many vulnerabilities, but](https://en.wikipedia.org/wiki/Adobe_Flash)\nbeing relatively new, it’s difficult to compare the two technologies head-to-head.\n\n## A WebAssembly Format Primer\n\nWebAssembly is structured in modules that can be distributed, instantiated and executed\nindividually. What follows is the basic high-level structure of a module.\n\n### Preamble\n\nEach module has the following preamble:\n```\nmagic = 0x00 0x61 0x73 0x6D (4-byte magic number, the string '\\0asm')\nversion = 0x01 0x00 0x00 0x00 (The current version of the binary format)\n\n### Encoding\n\n```\nApart from the preamble, integer types in the Wasm format, either Signed and Unsigned, use\nthe [Leb128 encoding, which shows the hard work put into by W3C to make sure the format is](https://en.wikipedia.org/wiki/LEB128)\nas compact as possible. There are other primitive types encoded differently, but we only\nneed to mention integers for the purpose of this blog post. To see the rest of the encodings,\n[please see the specification.](https://webassembly.github.io/spec/core/binary/values.html)\n\n**Sections**\n\n\n-----\n\nThe preamble is followed by a sequence of sections, and each section has the following\nstructure:\n```\nid: u8 (A one byte section id)\nsize: u32 (Size of the contents, in bytes)\ncontents: [size] (The actual content whose structure depends on the section id)\n\n```\nEvery section is optional, but an omitted section is equivalent to having a section present\nwith empty contents.\n\nThe following section ids are recognized:\n\n**Id** **Section**\n\n0 [custom section](https://webassembly.github.io/spec/core/binary/modules.html#binary-customsec)\n\n1 [type section](https://webassembly.github.io/spec/core/binary/modules.html#binary-typesec)\n\n2 [import section](https://webassembly.github.io/spec/core/binary/modules.html#binary-importsec)\n\n3 [function section](https://webassembly.github.io/spec/core/binary/modules.html#binary-funcsec)\n\n4 [table section](https://webassembly.github.io/spec/core/binary/modules.html#binary-tablesec)\n\n5 [memory section](https://webassembly.github.io/spec/core/binary/modules.html#binary-memsec)\n\n6 [global section](https://webassembly.github.io/spec/core/binary/modules.html#binary-globalsec)\n\n7 [export section](https://webassembly.github.io/spec/core/binary/modules.html#binary-exportsec)\n\n8 [start section](https://webassembly.github.io/spec/core/binary/modules.html#binary-startsec)\n\n9 [element section](https://webassembly.github.io/spec/core/binary/modules.html#binary-elemsec)\n\n10 [code section](https://webassembly.github.io/spec/core/binary/modules.html#binary-codesec)\n\n11 [data section](https://webassembly.github.io/spec/core/binary/modules.html#binary-datasec)\n\n12 [data count section](https://webassembly.github.io/spec/core/binary/modules.html#binary-datacountsec)\n\nThe above is a high-level overview of the Wasm format. Each section is then parsed for\ncontents to know what, where and how something should be loaded and executed.\n\n## WebAssembly’s Popular Hat Trick\n\nLike any well-established programming language, WebAssembly speaks a lot of “dialects.”\nOne of those dialects is hashing and the ability to use cryptographic functions.\n\n\n-----\n\nWe can look at WebAssembly as a frequent flier. Although it uses the cheap, economyclass web browser, it is actually traveling first class because it can reach anyone, anytime, as\nlong as there’s an internet connection. Wasm even has a membership to all of the major\n“airlines”: Firefox, Chrome, Safari and even Edge.\n\nCombining the two capabilities — compatibility with major browsers and an internet\nconnection as a minimum necessary requirement — provides the perfect mix for\n“clandestine” cryptocurrency mining operations.\n\nHowever, Wasm takes cryptomining to an entirely new level, especially when backed publicly\n[by open source repositories on GitHub, such as](https://github.co/) [CryptoNight and](https://github.com/cm/cryptonight) [Monero.](https://github.com/jtgrassie/xmr-wasm)\n\nA [previous study analyzed how cryptocurrency mining is achieved in the wild using](https://www.sec.cs.tu-bs.de/pubs/2019a-dimva.pdf)\nWebAssembly and revealed that eCrime operators have been abusing Wasm since at least\n2019 for financial gain. The study also looked into the distribution of execution time spent by\nWebAssembly miners compared to other usages, as seen below.\n\nFigure 1. CPU time spent by WebAssembly miners vs. other uses of WebAssembly (Source: Technische\n\nUniversität Braunschweig)\n\n## CrowdStrike’s Findings\n\nSince WebAssembly has been gaining in popularity for the past two years, as more websites\nembed resource-intensive apps such as games or image and audio manipulation apps,\nCrowdStrike researchers started diving deeper into how eCrime adversaries might be\nabusing Wasm and for what purposes, apart from financial motivation. They collected and\nanalyzed 12,291 unique WebAssembly samples from May 2018 to June 2021.\n\nCrypto Mining Efficacy\n\nSome of the analyzed Wasm samples were identified as cryptocurrency miners. For\nexample, two samples:\n\n\n-----\n\n```\n09c72015592622dd874c544dec7ed8ea21b4ff2ea30716dc670645d71ac42b5a and\ne1aa80619c71857310574e4de6ba583a1dc7ed51f3dafca3cfca0d4c49af6f81\n\n```\ncontain artifacts of the Cryptonight mining algorithm, while further research showed that they\nare genuine mining modules.\n\n### A Clever Hide-and-Seek Trick\n\nOf the 12,291 unique files collected and analyzed, 9,308 were malicious — more than 75%\nof the entire corpus.\n\nThe majority of the malicious files use a relatively efficient trick to hide malicious scripts,\nembedding JavaScript or JScript code in the Data section of the WebAssembly module. This\nbehavior could indicate a new trend that WebAssembly malware could be heading toward.\nWasm acts as an enclosing capsule for the already-known JavaScript and JScript malware\npresent in the wild.\n\n\n-----\n\nBelow, we have the disassembled WebAssembly ( text version, it s called) of two malicious\nsamples:\n```\n0033aae4043665c6210eb7d143733238da67060655969b18e449f7be4fd6f743 and\n006cd8d1d784f26ad8ee209a0a995d73d4f9c9b15185a499f180ae196c7091b3\n\n```\nthat use this tactic.\n\nEach file starts with the keyword module, and after that, each line starts with a keyword\ncorresponding to the WebAssembly sections mentioned above.\n\nWhat is interesting is the `data section located at code line 9 on both samples. The first`\nsample contains an html document inside the section, which embeds a malicious JScript.\nThe second sample also contains a malicious JavaScript inside its `data section.`\n\nHash: 0033aae4043665c6210eb7d143733238da67060655969b18e449f7be4fd6f743\n\nAt run time, the sample above drops the respective script or document, which is then\nexecuted by the browser. This method abuses the intended functionality of browsers that\nexecute them and is a practical and efficient tactic for threat actors to hide malicious scripts\nwithin Wasm.\n\n\n-----\n\nThis method can be seen as a new type of obfuscation or even packing on top of the\nalready-existing obfuscated malware state, adding another evasion tactic to the pool of\ntechniques that adversaries can use.\n\nHash: 006cd8d1d784f26ad8ee209a0a995d73d4f9c9b15185a499f180ae196c7091b3\n\n## Final Thoughts\n\nMalicious WebAssembly modules are not new, but their increase in popularity suggests that\nadversaries can abuse Wasm versatility and efficiency to hide additional malicious scripts for\nfinancial and obfuscation purposes. Previous [research discovered 150 unique WebAssembly](https://www.sec.cs.tu-bs.de/pubs/2019a-dimva.pdf)\nmodules by crawling the top 1 million sites, and now we’ve found that of over 12,000 unique\nWebAssembly samples gathered, more than 75% contained an embedded malicious\nbehavior.\n\nThe increased adoption of WebAssembly over the past couple of years suggests we can\nexpect adversaries and eCrime groups to continue abusing this browser’s built-in standard\nfor their illicit gains.\n\n## Bibliography\n\n\n-----\n\n[1. WebAssembly Reference Manual](https://github.com/sunfishcode/wasm-reference-manual/blob/master/WebAssembly.md#call)\n[2. WebAssembly Specification](https://webassembly.github.io/spec/core/index.html)\n[3. Understanding WebAssembly text format](https://developer.mozilla.org/en-US/docs/WebAssembly/Understanding_the_text_format)\n[4. LEB128](https://en.wikipedia.org/wiki/LEB128)\n[5. https://en.wikipedia.org/wiki/WebAssembly](https://en.wikipedia.org/wiki/WebAssembly)\n[6. https://en.wikipedia.org/wiki/Asm.js](https://en.wikipedia.org/wiki/Asm.js)\n[7. https://en.wikipedia.org/wiki/Adobe_Flash](https://en.wikipedia.org/wiki/Adobe_Flash)\n[8. https://dl.acm.org/doi/10.1145/3243734.3243858](https://dl.acm.org/doi/10.1145/3243734.3243858)\n9. https://www.first.org/resources/papers/conf2019/FIRST2019_wasm_cryptominer_full_P\n\natrick-Ventuzelo.pdf\n[10. https://github.com/cm/cryptonight](https://github.com/cm/cryptonight)\n\n[11. https://github.com/jtgrassie/xmr-wasm](https://github.com/jtgrassie/xmr-wasm)\n[12. https://www.sec.cs.tu-bs.de/pubs/2019a-dimva.pdf](https://www.sec.cs.tu-bs.de/pubs/2019a-dimva.pdf)\n\n**Addition Resources**\n\n_[Learn more about the CrowdStrike Falcon® platform by visiting the product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_[Test CrowdStrike® next-gen AV for yourself. Start your free trial of Falcon Prevent™](https://go.crowdstrike.com/try-falcon-prevent.html?_ga=2.43337191.374654640.1605200599-1373389249.1604608970&_gac=1.162348366.1605374598.Cj0KCQiAnb79BRDgARIsAOVbhRoS7UWN-kcmzRNnY6j_6YRuyTeNfoP6SIuc3FwFkxcuF1_WoeaGKPMaAp2REALw_wcB)_\n_today._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-25 - WebAssembly Is Abused by eCriminals to Hide Malware.pdf"
    ],
    "report_names": [
        "2021-10-25 - WebAssembly Is Abused by eCriminals to Hide Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536205,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653751602,
    "ts_modification_date": 1653751602,
    "files": {
        "pdf": "https://archive.orkl.eu/0629158a5dc5d8a6edd9d0148df4784c4cba69b9.pdf",
        "text": "https://archive.orkl.eu/0629158a5dc5d8a6edd9d0148df4784c4cba69b9.txt",
        "img": "https://archive.orkl.eu/0629158a5dc5d8a6edd9d0148df4784c4cba69b9.jpg"
    }
}