{
    "id": "6d722c91-0a52-4bf4-b623-0e563c4a9968",
    "created_at": "2023-01-12T15:04:50.623673Z",
    "updated_at": "2025-03-27T02:16:14.164502Z",
    "deleted_at": null,
    "sha1_hash": "c4d9d91ad656e483d82407e5f25ab4ac8f4b7d67",
    "title": "2021-01-13 - Reviving MuddyC3 Used by MuddyWater (IRAN) APT",
    "authors": "",
    "file_creation_date": "2022-05-28T03:53:21Z",
    "file_modification_date": "2022-05-28T03:53:21Z",
    "file_size": 5476390,
    "plain_text": "# Reviving MuddyC3 Used by MuddyWater (IRAN) APT\n\n**[shells.systems/reviving-leaked-muddyc3-used-by-muddywater-apt/](https://shells.systems/reviving-leaked-muddyc3-used-by-muddywater-apt/)**\n\nAhmed Khlief 2020-01-13\n\nEstimated Reading Time: 10 minutes\n**Note : This article contain two parts one for Blue Teams and the other for red teams.**\n**go to the part you interested in or read both if you are purple team guy 😀 .**\n\nMuddyWater is a well-known threat actor group founded by Iran. “that has been active since\n2017. They target groups across Middle East and Central Asia, primarily using spear\nphishing emails with malicious attachments. Most recently they were connected to a\n[campaign in March that targeted” organizations in Turkey, Pakistan, and Tajikistan.[0]](https://blog.trendmicro.com/trendlabs-security-intelligence/campaign-possibly-connected-muddywater-surfaces-middle-east-central-asia/)\n\nMuddyWater attacks are characterized by the use of a slowly evolving PowerShell-based first\nstage backdoor we call “POWERSTATS”. Despite broad scrutiny and reports on MuddyWater\nattacks, the activity continues with only incremental changes to the tools and techniques. [1]\n\nIn June 26 2019 a group called “Green Leakers” on telegram published screenshots of the\nC2 admin panel as you can see below along with screenshot of the muddyc3 c2 source code\n. they announced that they are selling all the leaked tools for 0.5BTC.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\nAt that time i got the source code from [github, so i tried the code to find that the core of the](https://github.com/0xffff0800/MuddyC3v1.0.1-)\nc2 which is powershell payload is messing ( the leaker didn’t include the payload in order to\nby all the tools ). so i didn’t have time to reverse engineer the source code and i left it. last\nweek i got 3 days off from my work ( working in SOC will keep you for ever busy ) so i started\nanalyzing the code which will be discussed below and i was able to understand how it works\nin order to create the messing powershell payload and make the c2 come to life. I didn’t just\nrevive the C2 but also added more advanced functionality which will be released as separate\ntool soon.\n\n\n-----\n\nLets start by giving a summary about the muddyc3 tool :\n\nCoded with python2.7\nworks as C2 server that serve a powershell agent script when requested\ni didn’t find any function to encrypt the traffic between the the agent and the C2 but\nthere are variables with name private_key, public_key so i suspect the functions\nremoved.\nevery function has its own url : modules, commands, result…\nits make use of HTA and bas64 encoded powershell code to bypass the AV ( right now\nAV can catch HTA )\nIt use threading so many agent can connect and controlled at the same time.\nthe agent must collect information about the system when it first start then report it to\nthe C2\nthere is template for agent which will be filled with ip and port when the C2 run.\ninclude functions but not all implemented in the initial POC : upload, download, load\nmodules, get screenshot\nThe initial powershell agent POC i created can bypass the AV including Kaspersky,\nTrendmicro\n\n**Analysis Part ( Blue Team ):**\n\nNow we dig deep in the C2 to explain how it work and how i created the agent based on the\nfunction available in the C2 :\n\n**C2 interface : simple CLI interface that ask when started for IP,Port and proxy configuration**\nto generate the initial payloads.\n\nAsk for IP and Port to generate the payload\n\n\n-----\n\nPayloads generated based on the IP:Port\n\nsimple Command menu which include the basic commands needed to run the C2\nthe source code for the interface is in the muddyc3.py which is clear and doesn’t need\nexplanation :\n\n\n-----\n\nwill generate the initial payloads then add them to array and finally print them to the user\n\nthis part of the code will check if the pointer in Main or an agent and get the command from\nthe user then check if the command in the list of menu command, it will run the menu\ncommand function defined in the cmd.py . if the command does not match the menu\ncommands and the pointer in main then it will not do anything . if the pointer in agent menu\nthen it will add the command to agent command queue in order to be requested and\nexecuted by the agent.\n\n\n-----\n\nthis screenshot from the cmd.py which shows the list of commands and the function it should\nrun\n**Webserver.py Functions : the web server has a list of urls for each module some of the**\nURLs will work with GET and other with POST depending how the function configured. below\nis a summary of the functions i created an agent for it :\n\nits start by defining the web server listener and urls variable that include the url with its\n\n\n-----\n\nmodule\n\nfor example in the urls variable /get url will run the function payload so if we tried to access\nthis link on the muddyc2 server we will get the payload\n\n\n-----\n\naccessing the server with url /get provided us with payload\n\nthe same with /getc we got the payload encoded with base52\n\n\n-----\n\n/hjf and /hjfs will run these function that include powershell code that run as powershell job in\nthe background\n\n/hta will run mshta function to generate payload from mshta.exe\nNow i will explain the core the URLs along with their code in the agent :\n\n\n-----\n\n**/info/(.*) URL will run the function info which is register function for new agents, it expect**\nagent id name to be in the URL along with machine information in the body of the POST\nrequest. the body must contain below information separated by ** :\n\n1) OS\n\n2) Machine IP\n\n3) system architecture\n\n4) hostname\n\n5) domain name\n\n6) username\n\nthe C2 will get the information along with agent ID and save it in array to be used to server\ncommands and other implemented function cause each agent has its own commands queue\n.\n\nThis code from the powershell POC agent which collect the information requried by the C2\nfrom windows machine then generate random name for the agent. finally it will do post\nrequest to URL /info/<agent id> with post request including the required information\nseparated by **\n\n\n-----\n\nThis URL ( /cm/(.*) ) will accept GET request with agent ID in order to serve the commands\nfor this agent ( from command queue ), if the agent is not registered or if the C2 goes down\nthen up and old agent reconnected, it will send REGISTER as response which will force the\nagent to register by sending request to /info/ URL as you will see below in agent code.\n\nalso it will get the current time when the agent ask for command to determine when the last\ntime agent probed to give information if the agent died or still alive.\n\nthis part of\n\ncode from powershell POC agent which will run in loop and keep probing the C2 for new\ncommands using URL /cm/<agent id>\n\nNow if the command is REGISTER then it will contact URL /info/<agent id > to register and\nget the commands ( this is very important in order to not lose the agent when the C2 is down\n).\n\nif the command is empty it will wait 2 seconds before probing again for command.\n\n\n-----\n\nat last the command\n\nwill be executed using Invoke-Expression and the output data will be encoded in base64\nthen uploaded to URL /re/<agent id> which will be explained below\n\nURL /re/(.*) will run result function which will wait for the result of the executed commands in\nbase64 then decode it and present it to the user\n\nURL /md/(.*) will wait for a POST request that include agent ID in the URL and in the request\nbody the name of the module requested then it will use the name of module to load from\nModule/ folder in the C2 directory\n\n\n-----\n\nthis code from the\n\npowershell POC agent which will check if the command got from the C2 is load then it will\nget the second argument splited by space to request and download the required module. the\nrequest will be handled by the function load which will be explained below. the output of load\nfunction will include the module which will be executed by Invoke-Expression\n\nthis code from the powershell POC agent will request the module by POST request to URL\n/md/<agent id> with request body contain module name.\nNow after we finished the analysis part of this article i will walk you through using muddyc3\nwith POC powershell agent. please note that this just POC and the full tool written on top of\nmuddyc3 will be released soon. i finished implementing many cool features but i will wait until\ni add more and to be fully tested before the release.\n\n**Using MuddyC3 to get domain admin ( Red Team ) :**\n\ni will use simple scenario to show the usage of muddyc3 powershell agent POC.\n\n\n-----\n\nrun the muddyc3 using python2.7, it will ask you for the IP and Port will be used to create\nthe payloads ( this will be your public IP or the IP reachable by the devices you want to hack\n)\n\nyou can use any of the printed payloads but the last 3 undetectable from AVs the others is\ndetectable by kaspersky\n\n\n-----\n\nas you can see am testing on kaspersky free with no detection but this also applicable for the\ntotal security and enterprise edition. also i tested it on trendmicro maximum security.\n\nwhen the user click enable content you will get connection on the C2 using macro\n\n\n-----\n\nyou can also use macros to spread the agent which used by muddywater in their\noperations\n\nas you can see we got a connection from the agent\n\nusing list command we can see the list of agents we have and the last time the contacted the\n\nC2\n\nusing ” use ” command we move the agent prompt and we can issue command like pwd and\nget result .\n\n\n-----\n\nlets see the the users in this domain to find the domain admin by using : net user /DOMAIN\ncommand\n\nOk so we checked the user ahmedkl and he is domain admin, now we will check if he had\nlogged in to this machine\n\n\n-----\n\nyou can load powershell modules by copying the modules to Modules/ folder in C2 directory\nthen use ” load <module name.ps1> ” command to load it directly into the agent session. but\nyou can see it didn’t work here because kaspersky intercepted the data as its clear text ( this\nsolved by encrypting the data in my upcoming tool )\n\nthis picture shows kaspersky blocking /md/ url because mimikatz detected by AV so we will\npause to complete the demo\n\nnow that mimikatz loaded\n\n\n-----\n\nalso we got user hamzag credentials\n\n\n-----\n\nnow we have domain admin credentials\n\nNow we load Invoke-WMIExec.ps1 to do pass the hash attack using wmi\n\nNow in order to use Invoke-WMIExec we need to encode our payload so we don’t have issue\nwith characters escaping so we use python ( make user to utf-8 encode )\n\n\n-----\n\nas you can see the payload executed and the agent connected\n\nnow we are in the DC\n\nThank you for reading my article . you can find the muddyc3 with payload.ps1 ( powershell\nagent POC ) here : [Muddyc3-Revived](https://github.com/ahmedkhlief/muddyc3-Revived)\n\ni will release my tool which built on top of muddyc3 soon. right now it include below features\nand there is more am working on :\n\nfull encryption of modules and command channel\nget encryption key on the fly ( not hard coded )\ntake screenshots and send it encrypted to C2\nupload files from C2\ndownload files from the victim\nstaged payloads to bypass detection\nbypasses AVs ( tested on kaspersky and trendmicro )\nset the beacon interval dynamically even after the agent connected\ndynamic URLs\nset the configuration one time ( will not ask for IP:port each time )\nbug fixes and stable version\nglobal kill switch to end campaigns\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-13 - Reviving MuddyC3 Used by MuddyWater (IRAN) APT.pdf"
    ],
    "report_names": [
        "2021-01-13 - Reviving MuddyC3 Used by MuddyWater (IRAN) APT.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535890,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1653710001,
    "ts_modification_date": 1653710001,
    "files": {
        "pdf": "https://archive.orkl.eu/c4d9d91ad656e483d82407e5f25ab4ac8f4b7d67.pdf",
        "text": "https://archive.orkl.eu/c4d9d91ad656e483d82407e5f25ab4ac8f4b7d67.txt",
        "img": "https://archive.orkl.eu/c4d9d91ad656e483d82407e5f25ab4ac8f4b7d67.jpg"
    }
}