{
    "id": "6dde555c-a598-4d80-b249-88ebd75e40e5",
    "created_at": "2023-01-12T15:02:20.885366Z",
    "updated_at": "2025-03-27T02:05:33.11476Z",
    "deleted_at": null,
    "sha1_hash": "140855b845e9cc6d5a87681f44b1f1fc1a7cd9ce",
    "title": "2021-08-18 - China Propaganda Network Targets BBC Media, UK in Large-Scale Influence Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T02:09:37Z",
    "file_modification_date": "2022-05-28T02:09:37Z",
    "file_size": 96639,
    "plain_text": "# China Propaganda Network Targets BBC Media, UK in Influence Campaign\n\n**recordedfuture.com/china-propaganda-targets-bbc-uk/**\n\nInsikt Group\nRecorded Future’s Insikt Group has discovered a large-scale, likely state-sponsored\ninfluence operation against the British Broadcasting Company (BBC) and the United\nKingdom (UK). The campaign involves hundreds of websites and social media accounts and\nthousands of comments across state-affiliated news sources, fake news websites, and\nChinese and Western social media platforms. China’s state-affiliated media and Communist\nParty of China (CCP) officials have recently increased their criticism of the UK and the BBC\n[in response to a recent BBC report revealing that Beijing’s top propaganda outlets are](https://www.bbc.com/news/world-asia-china-57780023)\nincentivizing foreigners, called “stringers”, to create pro-China social media influence. To\ncounter the BBC’s allegations, these propaganda accounts have taken to social media to\ncriticize BBC’s journalistic integrity, accusing them of using an “underworld filter” or “gloom\nfilter” (阴间滤镜) on photos and video of China to make the country look lifeless, dull, and\n[sad to foreign audiences. The BBC adamantly denies these accusations.](https://www.bbc.com/news/world-asia-china-56030340)\n\nThere have been over 11,000 references of the Mandarin-language term for “gloom filter”\nacross open sources in the past 6 months, with over half of them occurring in the last 30\ndays. English-language mentions of “BBC underworld filter” have also spiked over the past\nseveral weeks, totaling over 56,300 in 6 weeks. Since the “stringers” have started spreading\nChinese propaganda, English-language references to the “gloom filter” have increased\ndramatically, as shown in Figure 1. We are confident that this uptick results from recent proChina influencers amplifying the “gloom filter” theory.\n\n**_Figure 1: Timeline of references to “gloom filter” in social media, by language (Source:_**\n_Recorded Future)_\n[Insikt Group has observed these influencers, or “stringers”, on various English and](https://www.bbc.com/news/world-asia-china-57780023)\nMandarin-language sources defending China against accusations of human rights abuses,\nauthoritarian control, and Western reporting on China that contains negative sentiment.\n\nOn July 19, 2021, China’s Ministry of Foreign Affairs spokesperson Zhao Lijian asserted\nacross social media that BBC edited the color out of a photo of a popular British pro-China\nsocial media “influencer” named Jason Lightfoot, who also goes by the moniker “Living In\nChina”. One post stated, “#GloomFilter comes again! It could be accounted as one of BBC's\nfamiliar supernatural skills, to turn a green and prosperous city into a grey desolation”. On his\n[YouTube channel, which has over 157,000 followers, Lightfoot shared a before and after](https://www.youtube.com/user/JasonLightfoot)\nphoto of himself from the July BBC report that he claims had a “gloom filter” applied to make\nChina look dull and colorless in the background\n\n\n-----\n\n**_Figure 2: Disputed photo of Jason Lightfoot, as presented by Chinese news company_**\n_CGTN_\nThis claim is often accompanied by other criticisms of the BBC network and its reporters,\naccusing them of trying to make China look bad to the rest of the world through biased\nreporting and photo editing. This accusation was amplified across multiple English-language\nand Mandarin-language social media accounts and then shared by hundreds of PRC stateaffiliated media, fringe media sites, and other pro-China “stringers” or influencers.\nAdditionally, the so-called BBC “underworld filter” has been criticized in hundreds of videos\nthroughout 2021 on popular video sites such as bilibili[.]com, CCTV, TikTok, and YouTube,\nwith recent notable spikes in negative sentiment throughout July 2021.\n\n## China Attempts to Discredit the BBC and the UK\n\nOn December 10, 2020, BBC released a video titled “Covid-19: How everyday life has\nchanged in Wuhan”, depicting how life for citizens of Wuhan, China, has changed since the\noutbreak of COVID-19 in late 2019. On January 18, 2021, the BBC also produced a\n[documentary titled “COVID-19: The Road Back to Wuhan”, which documented how Wuhan](https://www.bbc.com/news/av/world-asia-55681744)\nhas since recovered, socially and economically. Both of these videos were criticized by\nChina’s top spokespersons, state-affiliated media, and subsequently China’s social media\nfollowing, as being digitally altered as “a deliberate attempt to misguide viewers and discredit\nChina”. By February 2021, the narrative had spread throughout all aspects of Chinese\nmedia: BBC is anti-China. The accusations are sourced only to “netizens” of China, with no\nevidence of the source for before and after photos represented in the media. Reports from\n[state-affiliated media outlets such as Global Times state that an anonymous citizen made an](https://www.globaltimes.cn/page/202102/1215710.shtml)\nobservation, \"Is it just me or are you using some kind of filter to make the colors in this video\nlook old and give us a sense of the city looking poor?\" The comment received hundreds of\n“likes” and sparked a large-scale social media campaign spreading the message of the\n“gloom filter”.\n[On February 10, 2021, China banned BBC World News from broadcasting within the country.](https://www.bbc.com/news/world-asia-china-56030340)\nChina's National Radio and Television Administration (NRTA) based the decision on internal\nfindings that BBC World News reports about China \"seriously violated\" broadcast guidelines,\nincluding \"the requirement that news should be truthful and fair\" and not \"harm China's\nnational interests\". However, BBC World News is largely unavailable to the common Chinese\naudience, appearing only in international hotels and some diplomatic compounds. British\nForeign Secretary Dominic Raab responded publicly to the move, calling it “an unacceptable\ncurtailing of media freedom”, noting that “China has some of the most severe restrictions on\nmedia & internet freedoms across the globe, & this latest step will only damage China’s\nreputation in the eyes of the world”. The United States (US) State Department also\ncommented on the situation, calling it part of a wider campaign to suppress free media in\nChina.\n\n**_Figure 3: China state-affiliated media accusation of BBC “gloom filter” (Source: Global_**\n_Times)_\n\n\n-----\n\nThroughout June and July 2021, China s foreign ministry spokesperson Hua Chunying\nshared images on social media that criticize the US, the UK, and Canada for alleged human\nrights abuses of the past. The image (Figure 3), created by Global Times and sourced from\n“media reports”, shows the name of the nation on the top, accompanied by the\ncorresponding flag, and listed statistics of “discrimination of ethnic groups” (allegedly\nconducted by Clear View Research), “incompetence in handling COVID-19”, and “violent\ntreatment of civilians”. The image was accompanied by a strong message shaming Western\nnations for interfering in China’s affairs, almost certainly referring to the implementation of\n[sanctions on China for human rights violations in Xinjiang: “The #US, #Canada &the #UK](https://www.bbc.com/news/world-europe-56487162)\nshould feel ashamed for their blind eyes to their own shocking #humanrights records and\nsheer lies &evil-purposed interference in China's internal affairs. Justice will prevail”.\n\n**_Figure 4: China amplifying anti-UK message in state-affiliated social media and news_**\nHua Chunying’s original social media post received nearly 1,200 likes and 350 shares. The\npost was also shared by the account of the Chinese embassy in the UK, which received\nmuch less traction: 6 likes, 6 comments, and only 3 shares.\n\nDuring a daily press conference on June 23, 2021, Zhao Lijian addressed the UK in a\nstatement in response to criticism of Beijing’s handling of Uyghur Muslims in Xinjiang. In his\nstatement, he deflects blame back on the UK: “The UK is by no means a ‘model student’ &\nhas no authority to lecture others on human rights. It should earnestly reflect upon its own\ngrave human rights violations instead of smearing China to divert attention & deflect\nresponsibility”. The tweet received over 100 likes, 27 shares, and very few comments,\nindicating it did not get much traction in English-language social media. However, the theme\nis consistent with how China’s Ministry of Foreign Affairs is handling criticism at this time:\ndeflecting blame and revisiting the past mistakes or perceived reputational weaknesses of its\naccusers.\n\nInsikt Group judges with high confidence that this activity is a CCP-sponsored influence\noperation targeting the BBC and the UK government. The volume of activity paired with a\nclearly identifiable narrative, coordination across the Chinese state-sponsored media\napparatus, use of both Mandarin and foreign-language content, use of dozens of fringe\nmedia outlets, and the campaign’s alignment with the CCP’s objectives create a clear picture\nof how the CCP is conducting large-scale information operations to counter criticism and\n[censor foreign media. Similar recent campaigns, including against Canada and the US, have](https://medium.com/dfrlab/china-weaponizes-discovery-of-graves-at-canadian-residential-schools-to-avoid-xinjiang-criticism-6bf618a6e954)\nbeen observed by fellow disinformation researchers and further confirm the tactics,\ntechniques, and procedures used in this particular campaign targeting the BBC and the UK.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-18 - China Propaganda Network Targets BBC Media, UK in Large-Scale Influence Campaign.pdf"
    ],
    "report_names": [
        "2021-08-18 - China Propaganda Network Targets BBC Media, UK in Large-Scale Influence Campaign.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535740,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653703777,
    "ts_modification_date": 1653703777,
    "files": {
        "pdf": "https://archive.orkl.eu/140855b845e9cc6d5a87681f44b1f1fc1a7cd9ce.pdf",
        "text": "https://archive.orkl.eu/140855b845e9cc6d5a87681f44b1f1fc1a7cd9ce.txt",
        "img": "https://archive.orkl.eu/140855b845e9cc6d5a87681f44b1f1fc1a7cd9ce.jpg"
    }
}