{
    "id": "6e2b2978-a10d-4d13-81fb-1884ea9074c3",
    "created_at": "2022-10-25T16:48:19.978441Z",
    "updated_at": "2025-03-27T02:14:42.859278Z",
    "deleted_at": null,
    "sha1_hash": "2be29c83661be962010cd1b651bc30358270d37f",
    "title": "Macintosh HD:Users:Shared:dd:4work:Bitdefender-PR-Whitepaper-APTHackers-creat4740-en_EN:Bitdefender-PR-Whitepaper-APTHackers-creat4740-en_EN.indd",
    "authors": "",
    "file_creation_date": "2020-08-19T15:04:30Z",
    "file_modification_date": "2020-08-19T15:04:33Z",
    "file_size": 5026595,
    "plain_text": "#### Security\n# More Evidence of APT  Hackers-for-Hire Used for Industrial Espionage\n\nwww.bitdefender.com\n\n\n-----\n\n## Contents\n\nExecutive Summary:...................................................................................................................................3\nKey Findings:...............................................................................................................................................3\nForensic Analysis........................................................................................................................................4\nToolset Analysis..........................................................................................................................................5\n\nHdCrawler.................................................................................................................................................................5\nInfoStealer................................................................................................................................................................6\nObservations............................................................................................................................................................6\nCommand and Control Server....................................................................................................................7\nAppendix A..................................................................................................................................................7\nAppendix B – IOCs......................................................................................................................................7\n\n## Contents\n\n**Authors:**\n\nVictor Vrabie- Security Researcher, Cyber Threat Intelligence Lab\n\nBogdan Rusu - Security Researcher, Cyber Threat Intelligence Lab\n\nAlexandru Maximciuc -Team Lead, Cyber Threat Intelligence Lab\n**Co-author:**\n\n\nCristina Vatamanu - Senior Team Lead, Cyber Threat Intelligence Lab\n\n\n-----\n\nMore Evidence of APT Hackers-for-Hire Used for Industrial Espionage\n\n\n## Key Findings:\n\n- Potential APT mercenary group used for industrial cyberespionage\n\n- Industrial espionage for competitiveness in real-estate industry\n\n- Malicious payload posing as a plugin for a popular 3D computer graphics software (Autodesk 3ds Max)\n\n- Payload tested against the company’s security solution to avoid detection upon delivery\n\n- C2 infrastructure based in South Korea\n\nWhile this is not the first incident in which APT mercenary groups have been potentially used to conduct espionage or\ncoordinate with alleged military operations, these events have intensified during the past couple of years. The recently\ninvestigated StrongPity APT group has all the characteristics of a mercenary cybercriminal group, known to serve both\nfinancial and potentially military objectives. Other groups, such as “Dark Basin” and “Deceptikons,” are only a few recent\nexamples in which APT groups for hire have allegedly acted on behalf of customers seeking to discredit or infiltrate\n\n\n-----\n\nMore Evidence of APT Hackers-for-Hire Used for Industrial Espionage\n\nThis is likely to become the new normal in terms of the commoditization of APT groups -- not just state-sponsored\nactors, but by anyone seeking their services for personal gain, across all industries.\n\n## Forensic Analysis\n\nThe threat forensic analysis started from a suspicious sample named PhysXPluginStl.mse (hash:\n```\nd6ad1e0b11a620ed4df39255ffff11a483687d7038d6c76b938d15add54345fa) which triggered suspicious\n\n```\nbehavior.\n\n**Attack overview**\n\n[In a recent advisory published by Autodesk, users are warned of a third-party MAXScript exploit, “PhysXPluginMfx”](https://www.autodesk.com/trust/security-advisories/adsk-sa-2020-0005?_ga=2.195054248.546884189.1597408951-950846007.1597408951)\n(variant of ALC2, ALC, CRP and ADLS), that can corrupt 3ds Max to run malicious code and even propagate to other\n[MAX files. Instructions on how to identify and remove the malware have also been published. However, as our](https://knowledge.autodesk.com/support/3ds-max/troubleshooting/caas/sfdcarticles/sfdcarticles/PhysXPluginMfx-MAXScript-based-malware-may-corrupt-3ds-Max-installation-and-files.html)\ninvestigation revealed, it’s likely that more victims were affected long before this unknown threat was identified.\n\nThe file is a Max Script Encrypted script (encryption specific to Autodesk 3dsMax Solution software) and contains an\nembedded DLL file (hash: 2d934a705638acd3fcb44f66a9a1633c27231550113f20df6061c10b1aa6e9f6).\nFurther analysis of this file lead us to a maxscript that starts with some http post requests, whose responses are\nexecuted directly from memory, after some delays. Those two requests are the following:\n\n- POST, hxxp://175[.]197.40.61:3445/FRNuzqJIZyb, using a token in body:\n“t785EyDk/6s4VXZZ6Sb7TFl7vepBKQrgX8LmGURaPLM=”, without any additional information; the execution is\npostponed 10 seconds\n\n- POST, hxxp://175[.]197.40.61:3445/TYEHVSjn2Ny, using a token in body:\n“RhUzq3wdz8xpCIzZVoqrTDr0FXpOmsgjAnyTy6xh/+w=”, without any additional information; the execution is\npostponed 4 seconds\n\nMoving further, a periodic job is created to clean up some well-known ALC/CRP 3rd party maxscripts, which are\nknown to lead to some issues (see the Appendix A for more information about these issues). This part may look\nunsuspicious, but, after cleanup, some code is downloaded from the C&C and executed. The download is performed\nfrom the following URLs:\n\nh //175[ ]197 40 61 3445/P bli /Fi d Al\n\n\n-----\n\nMore Evidence of APT Hackers-for-Hire Used for Industrial Espionage\n\nThe last part of the script takes care of the persistence. A downloaded file (from hxxp://175[.]197.40.61:3445/\n```\ngrhL1wCYAhf) is stored in “AppData\\Local\\Autodesk\\3dsMax\\*\\ENU\\scripts\\startup\\\nPhysXPluginStl.mse” (in the startup folder of 3ds max software) and the hidden file attribute is set.\n\n```\nInvestigating the C&C, we managed to reproduce part of the communication protocol and to download buffers\nof code whose content is executed. Responses from the C&C were valid, indicating that, at the time of the\nwriting, it was still up. The response for the route hxxp://175[.]197.40.61:3445/FRNuzqJIZyb, lead us\nto two new files (a32f5e65051eb95d0ccdcc899d45f56369659a6edea068da5e59951f4c903f7b and\n```\nc75fcb34a5b35b6b73191de3f342806d3cce5a446c64f55fb3423f0cd5dbe248), which are .net binaries. Both\n\n```\nof them will download and execute other maxscripts whose content is very similar.\n\nThe new script is meant to collect some information about the victim (computer name, username), encrypt it with a\ncustom algorithm and mask the result so that it appears to be base64 content. Moving further, the obtained data is\nused in a request sent to the C&C (at hxxp://175[.]197.40.61:3445/TYEHVSjn2Ny), to obtain a new piece\nof code to be executed. After this, for each 3ds max release, installed on the machine, in scripts\\startup\\max\nfolder a file named “default.mse” is downloaded from hxxp://175[.]197.40.61:3445/YkSxBJVz using\nthe aforementioned user information, and then, detection evasion techniques are applied (file creation timestamp is\nmodified, the hidden attribute is set on the max folder and the default.mse file. In this case also, a cleanup action is\nperformed, similar to the one mentioned above, which cleans up some well-known ALC/CRP third-party maxscripts.\n\nThe response for the hxxp://175[.]197.40.61:3445/TYEHVSjn2Ny request, leads us to a .net\nassembly (04715dd5b4e4e4e452d86f2c874ea9e6ad916f17838f116c8ab4ccfc7b9b6657) whose\nresource section contains a downloader, which obtains from the C&C (hxxp://175[.]197.40.61:3445/b\n```\nroute), other binaries. We were unable to obtain the responses directly from the C&C, but, based\n\n```\non some quite unique method names invoked by the downloader we managed to obtain a binary\n(1c2f754045bc442cf5147dadccd1ff3c8e58205362e1940c3f1f87ab303006a5). This malicious file is capable\nof making screenshots, collecting passwords and history from a Chrome browser database. This information is\nuploaded to the C&C, the same as in our case, strengthening the idea of being the one requested by the downloader.\n\nIt is not uncommon in targeted attacks for the threat actors to test malicious files against the security solutions used\nby their victims, so that they can change them until the files are no longer detected.\n\nWe have also identified a toolset that is described in section below. We have chosen a representative file for each\ncategory, all the indicators of compromise being listed in the Appendix B section.\n\n## Toolset Analysis\n\nLooking through the telemetry of the C&C, we noticed that there are reports, which include some of the discovered .net\nassembly internal names found initially on the victims’ machine or downloaded from the C&C. After analysis, we have\nmanaged to gather more tools, based on direct usage or based on common portions of code. Beside this, we have also\nnoticed that all of them share the C&C address from the victim (address + port).\n\n### HdCrawler\n\nRepresentative binary: a16b2c6a60975e4def1f799c69f7f38064653b5a99bc577fc008f0a808c7bc62\n\nThe binary’s role is to list, compress (if needed) and upload a list of specific files (searched by extension). Caution has\nbeen taken not to apply useless compression – if the file to be copied has the extension in this list:\n\n“.zip”, “.rar”, “.alz”, “.7z”, “.mp4”, “.flv”, “.webm”, “.webp”, “.jpg”, “.jpeg”,\n“.png”, “.avi”, “.mkv”, “.mp3”, “.mpeg”, “.mpg”, “.apk”, “.obb”, “.pur”, “.uasset”\n\nthen the file is skipped from compression.\n\nThere is an interesting aspect to this component – the list of files to be uploaded to the server is built into the binary,\nwhich means that, on the other side, the attackers look at the file listings from each of their victims and then compile a\n\n\n-----\n\nMore Evidence of APT Hackers-for-Hire Used for Industrial Espionage\n\nWhile searching for more related samples and information, we found two “tools” that should be on the C&C side, used\nto control and manage the victims and the stolen information by processing the output of the HDCrawler:\n\n- LogViewer – a tool with a GUI that seems to be the one that shows the victims and the file listings from them\n\n- HddUnpacker - is used by LogViewer to decrypt and decompress the files uploaded by HdCrawler, the screenshots\ntaken during the attack, the file listings, and the credentials stored in the Chrome browser\n\n### InfoStealer\n\nRepresentative binary: 2b394c330949c85097f13eded38f08b358d399b7615bbe3659dd9d82ec82675c\n```\nPhysXPluginStl.mse,2d934a705638acd3fcb44f66a9a1633c27231550113f20df6061c10b1aa6e9f6 file\n\n```\nmentioned before has the OriginalFilename set to B4E6HVVnCvY.dll. In our file repositories we have found a file\n(2b394c330949c85097f13eded38f08b358d399b7615bbe3659dd9d82ec82675c) with OriginalFilename set to\nB4E6HVVnCvY.exe. There is high confidence that this sample is related, also because of the use of the same C&C.\n\nThis binary has the following capabilities:\n\n**•** **Rate-limiting - uses %LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\MSWINSIG.DAT (in which it writes**\na timestamp) as a rate-limiting mechanism, to run at most once every three hours\n\n**•** **Screen capture – makes whole screen capture and uploads it to the C&C server**\n\n**•** **Information collection – collects the username, computername, the IP addresses of network adapters, Windows**\nProductName, version of the .NET Framework, information about the processors (number of cores, the speed and\nother information), total and free RAM, information about the storage, the listing of files set to start automatically\nwhen Windows starts up, process listing and recent files; all this information is uploaded to the C&C server.\n\n**•** **Tied to a specific user on the computer - uses %LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\**\n```\n MSWINTAP.DAT – the first four bytes of it contain a hash on the computername and username; that hash is\n\n```\nchecked before the content gets loaded; the remaining bytes are received from the C&C and are appended to the\nfollowing http request messages to the C&C;\n\n**•** It makes use of another file “tied” to the user (same hash as in the case of MSWINTAP.DAT) in %PROGRAMDATA%\\\nMicrosoft\\Windows\\Ringtones; we know it writes 11 characters in it, but its exact intention is yet to be discovered\n\n**•** `%LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\ie4uRidd.dat – it’s a .NET class (named internally`\nTaskClass), serialized and encrypted, which represents a task for file listings; it contains a list of disk drives and\nspecific directories that will be recursively listed from now on. This mechanism lets the attackers skip specific\ndirectories and disk drives completely and get back only information about the files they are most interested in. If\nthis ie4uRidd.dat file is not present, then a directory listing of all files from B:, C:, D:, K: is sent to the C&C server\n(we couldn’t find out why these specific drives were chosen).\n\n### Observations\n\nThe authors took an interesting approach to avoid attracting attention. If Task Manager\nor Performance Monitor applications are running and their respective window is visible,\nthen a flag is set, depending on how much of the area is visible to the user; this flag\ninstructs the binary to sleep more and more often (reducing this way the consumption\nof CPU).\n\nAn interesting library we could link to this whole toolkit is LibCredentials.\n\nWe did not see it used anywhere in our telemetry. According to the class names, it’s\nresponsible for collecting credentials from the current machine: browsers (Internet\nExplorer, Firefox, Chrome), Outlook, WLan credentials and everything stored in Windows\nVault.\n\n\n-----\n\nMore Evidence of APT Hackers-for-Hire Used for Industrial Espionage\n\n## Command and Control Server\n\nThe C&C belongs to AS4766 Korea Telekom, South Korea. Although Shodan (hxxps://beta.shodan.io/\n```\nhost/175.197.40.61 ) suggests that there are many different ports on the C&C server (and most of those ports can\n\n```\nbe seen on other IPs too), we have only seen components that communicate to port 3445 and port 6711. (the latter is\nused by a FTP server, as can be seen in the HdCrawler binaries we found).\n\n## Appendix A\n\nDetails about ALC/CRP 3rd party maxscripts:\n\n[https://3dground.net/article/attention-alc-and-crp-viruses-in-3ds-max-](https://3dground.net/article/attention-alc-and-crp-viruses-in-3ds-max-)\n\n## Appendix B – IOCs\n\n**File Hashes:**\n\n- `04715dd5b4e4e4e452d86f2c874ea9e6ad916f17838f116c8ab4ccfc7b9b6657`\n\n- `1c2f754045bc442cf5147dadccd1ff3c8e58205362e1940c3f1f87ab303006a5`\n\n- `A32f5e65051eb95d0ccdcc899d45f56369659a6edea068da5e59951f4c903f7b`\n\n- `C75fcb34a5b35b6b73191de3f342806d3cce5a446c64f55fb3423f0cd5dbe248`\n\n- `2d934a705638acd3fcb44f66a9a1633c27231550113f20df6061c10b1aa6e9f6`\n\n- `d6ad1e0b11a620ed4df39255ffff11a483687d7038d6c76b938d15add54345fa`\n```\n  2b394c330949c85097f13eded38f08b358d399b7615bbe3659dd9d82ec82675c\n\n```\n- `A16b2c6a60975e4def1f799c69f7f38064653b5a99bc577fc008f0a808c7bc62`\n\n- `E16a5847ac62bb4d5a661863fd5dba5201d27784e280aeee25a34702ed4c1528`\n\n- `C2f51b2c116bcc9c95dbf567a90ec4fe0f5fbddb066a6d3cdf814295838e00f8`\n\n- `D3a38047c207dee4b09d607a568390306f76025cd6986ec3e7c3fbd21a231d0e`\n\n- `37ea55d1dceb467c595299f0f19a68d5530015b6d9c7ed5cc16324f52773e536`\n\n- `711d45ff150aa734771fec1c08e394118a7bcd015dacac8889c965aeabfc7c9d`\n\n- `07cebf1d377b9d28e53b7139a56e632e19c8f53e07546298f180322d462512e3`\n\n- `536ef8065ded253465d6a5a967dafdcb2d158a7ea3157f0b265788745ed38409`\n\n- `9e4ba32d42f26b7b3bb24ec786992ed017318a4074b2e141ad0f4a05435f4862`\n**File Names:**\n\n- `PhysXPluginStl.mse`\n\n- fixAll.mse\n\n- `default.mse`\n\n- `%LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\MSWINTAP.DAT`\n\n- `%LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\MSWINSIG.DAT`\n\n- `%LOCALAPPDATA%\\ Microsoft\\Internet Explorer\\ie4uRidd.dat`\n**URLs:**\n\n- `hxxp://175.197.40[.]61:3445/eYOMAHg`\n\n- `hxxp://175.197.40[.]61:3445/YkSxBJVz`\n\n- `hxxp://175.197.40[.]61:3445/n`\n\n- `hxxp://175.197.40[.]61:3445/r`\n\n- `hxxp://175.197.40[.]61:3445/l`\n\n- `hxxp://175.197.40[.]61:3445/b`\n\n- `hxxp://175.197.40[.]61:3445/TYEHVSjn2Ny`\n\n- `hxxp://175.197.40[.]61:3445/grhL1wCYAhf`\n\n- `hxxp://175.197.40[.]61:3445/Public/Find_Alc`\n\n- `hxxp://175.197.40[.]61:3445//Public/Find_Crp`\n\n- `hxxp://175.197.40[.]61:3445/FRNuzqJIZyb`\n\n- hxxp://175.197.40[.]61:3445/Public/fixAll\n\n- `hxxp://175.197.40[.]61:3445/Public/NlWuLNUDzqM`\n\n**C&C IP addresses:**\n\n- `175[ ]197[ ]40[ ]61`\n\n\n-----\n\n##### Proudly Serving Our Customers Dedicated To Our +20.000 Worldwide Partners\nBitdefender provides solutions and services for small business and A channel-exclusive vendor, Bitdefender is proud to share success with tens of\nmedium enterprises, service providers and technology integrators. We take thousands of resellers and distributors worldwide.\npride in the trust that enterprises such as Mentor, Honeywell, Yamaha, _CRN 5-Star Partner, 4th Year in a Row. Recognized on CRN’s Security 100 List. CRN Cloud_\n**Speedway, Esurance or Safe Systems place in us.** _Partner, 2nd year in a Row_\n_Leader in Forrester’s inaugural Wave™ for Cloud Workload Security_ _More MSP-integrated solutions than any other security vendor_\n_NSS Labs “Recommended” Rating in the NSS Labs AEP Group Test_ _3 Bitdefender Partner Programs - to enable all our partners – resellers, service providers_\n_SC Media Industry Innovator Award for Hypervisor Introspection, 2nd Year in_ _and hybrid partners – to focus on selling Bitdefender solutions that match their own_\n_a Row_ _specializations_\n_Gartner® Representative Vendor of Cloud-Workload Protection Platforms_\n\n##### Trusted Security Authority\nBitdefender is a proud technology alliance partner to major virtualization vendors, directly contributing to the development of secure ecosystems with\n**VMware, Nutanix, Citrix, Linux Foundation, Microsoft, AWS, and Pivotal.**\nThrough its leading forensics team, Bitdefender is also actively engaged in countering international cybercrime together with major law enforcement agencies\nsuch as FBI and Europol, in initiatives such as NoMoreRansom and TechAccord, as well as the takedown of black markets such as Hansa. Starting in 2019,\nBitdefender is also a proudly appointed CVE Numbering Authority in MITRE Partnership.\n\n**RECOGNIZED BY LEADING ANALYSTS AND INDEPENDENT TESTING ORGANIZATIONS** **TECHNOLOGY ALLIANCES**\n\n##### UNDER THE SIGN OF THE WOLF\n\n**Founded 2001, Romania** A trade of brilliance, data security is an industry where only the clearest view, sharpest mind and deepest insight can\n**Number of employees 1800+** win — a game with zero margin of error. Our job is to win every single time, one thousand times out of one thousand,\n\nand one million times out of one million.\n\n**Headquarters**\nEnterprise HQ – Santa Clara, CA, United States And we do. We outsmart the industry not only by having the clearest view, the sharpest mind and the deepest insight,\nTechnology HQ – Bucharest, Romania but by staying one step ahead of everybody else, be they black hats or fellow security experts. The brilliance of our\n\ncollective mind is like a luminous Dragon-Wolf on your side, powered by engineered intuition, created to guard against\n\n**WORLDWIDE OFFICES** all dangers hidden in the arcane intricacies of the digital realm.\n**USA & Canada: Ft. Lauderdale, FL | Santa Clara, CA | San Antonio, TX |**\nToronto, CA This brilliance is our superpower and we put it at the core of all our game-changing products and solutions.\n**Europe: Copenhagen, DENMARK | Paris, FRANCE | München, GERMANY**\n| Milan, ITALY | Bucharest, Iasi, Cluj, Timisoara, ROMANIA | Barcelona,\nSPAIN | Dubai, UAE | London, UK | Hague, NETHERLANDS\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.08.20_APT_Hackers_for_Hire/Bitdefender-PR-Whitepaper-APTHackers-creat4740-en-EN-GenericUse.pdf",
        "https://www.bitdefender.com/files/News/CaseStudies/study/365/Bitdefender-PR-Whitepaper-APTHackers-creat4740-en-EN-GenericUse.pdf"
    ],
    "report_names": [
        "Bitdefender-PR-Whitepaper-APTHackers-creat4740-en-EN-GenericUse",
        "Bitdefender-PR-Whitepaper-APTHackers-creat4740-en-EN-GenericUse.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f7aa6029-2b01-4eee-8fe6-287330e087c9",
            "created_at": "2022-10-25T16:07:23.536763Z",
            "updated_at": "2025-03-27T02:02:09.85219Z",
            "deleted_at": null,
            "main_name": "Deceptikons",
            "aliases": [
                "DeathStalker",
                "Deceptikons"
            ],
            "source_name": "ETDA:Deceptikons",
            "tools": [
                "EVILNUM",
                "Evilnum",
                "Janicab",
                "PowerPepper",
                "Powersing",
                "VileRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "60b64223-652b-4177-a678-3d675b79cff4",
            "created_at": "2022-10-25T16:07:24.478235Z",
            "updated_at": "2025-03-27T02:02:10.246897Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [
                "Mercenary.Amanda"
            ],
            "source_name": "ETDA:Dark Basin",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1a933813-3deb-4d6f-8e0f-33b9187970f9",
            "created_at": "2023-01-06T13:46:39.147547Z",
            "updated_at": "2025-03-27T02:00:03.007913Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [],
            "source_name": "MISPGALAXY:Dark Basin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041682,
    "ts_creation_date": 1597849470,
    "ts_modification_date": 1597849473,
    "files": {
        "pdf": "https://archive.orkl.eu/2be29c83661be962010cd1b651bc30358270d37f.pdf",
        "text": "https://archive.orkl.eu/2be29c83661be962010cd1b651bc30358270d37f.txt",
        "img": "https://archive.orkl.eu/2be29c83661be962010cd1b651bc30358270d37f.jpg"
    }
}