{
    "id": "6e6b2823-d36e-4da3-88eb-a3e335a8f22d",
    "created_at": "2023-01-12T15:02:56.995681Z",
    "updated_at": "2025-03-27T02:16:26.526303Z",
    "deleted_at": null,
    "sha1_hash": "bb45d64361416f42fe748376ce2407f76e646e5a",
    "title": "2022-10-28 - Malware wars- the attack of the droppers",
    "authors": "",
    "file_creation_date": "2022-11-28T18:56:58Z",
    "file_modification_date": "2022-11-28T18:56:58Z",
    "file_size": 4799328,
    "plain_text": "# Malware wars: the attack of the droppers\n\n**threatfabric.com/blogs/the-attack-of-the-droppers.html**\n\nBlog\n\n28 October 2022\n\n## Another 130.000+ installations of malicious droppers from official store\n\n[A year ago, we highlighted a trend of malicious droppers in Google Play store used to distribute banking Trojans. We also](https://www.threatfabric.com/blogs/deceive-the-heavens-to-cross-the-sea.html)\npredicted further efforts of cybercriminals to reduce the malicious footprint of their malware in order to stay undetected.\nDistribution through droppers on official stores remains one of the most efficient ways for threat actors to reach a wide and\nunsuspecting audience. Although other distribution methods are also used depending on cybercriminals targets, resources,\nand motivation, droppers remain one of the best option on price-efforts-quality ratio, competing with SMiShing.\n\n\n-----\n\nThe history of competition between malware authors and seсurity mechanisms knows several twists when new measures\nare introduced. Droppers on Google Play went from using AccessibilityService to auto-allow installation from unknown\nsources to using legitimate sources to control them and store malicious payloads. Following the updates to the “Developer\nProgram Policy” and system updates, actors immediately introduce new ways to sneak to the official store, overcoming\nlimitations or adjusting droppers to follow the guidelines and not arouse suspicion. A brief story of that battle is presented\non the graph below.\n\nIn this blog we uncover additional tactics cybercriminals use in new Google Play droppers discovered by ThreatFabric\nanalysts. These droppers have cumulative number of 130k+ installations distributing Sharkbot and Vultur banking Trojans.\n\n\n-----\n\n## Sharkbot: the less you see, the more they get\n\nIn the beginning of October 2022 ThreatFabric analysts spotted a new campaign of banking Trojan Sharkbot, targeting\nItalian banking users. This campaign involved Sharkbot version 2.29 – 2.32. Following the research path, our analysts\nwere able to identify the dropper app located on Google Play with 10k+ installations and disguised as an app to calculate\ntax code in Italy (“Codice Fiscale”) targeting Italian users.\n\nThis is not the first time that a Sharkbot dropper sneaks into the official Google store, but this time authors did their best to\nhide the malicious intents of the dropper. Previous versions of Sharkbot droppers as well as other droppers (including those\nwe highlight below in this blog) include ability to download, install and launch the malicious payload. Obviously, such\n[behaviour is quite suspicious and already made Google to introduce changes to the Developer Program Policy where](https://support.google.com/googleplay/android-developer/answer/12766072?hl=en&ref_topic=9877065)\nusage of REQUEST_INSTALL_PACKAGES permission was limited to apps that have it as core functionality.\n\nHowever, in this new iteration, Sharkbot dropper authors tried their best to not include suspicious permissions at all, thus\nmaintaining an extremely low profile. The new dropper has only 3 permissions that are quite common.\n\n\n-----\n\nTo ensure that the dropper is launched on a real targeted device, the app obtains the SIM coutry and compares it to “it”\n(Italy): if not matched, no malicious activity will be performed. Besides, additional checks are made on the C2 side to\nensure that the dropper is running on the targeted device: if C2 is reached from a non-Italian IP address, the C2 will\nrespond with a default “exit” message. Otherwise, it will receive a configuration data with the URL containing the payload.\n\nHere the interesting part starts: in order to avoid using REQUEST_INSTALL_PACKAGES permission, the dropper opens a\nfake Google Play store page impersonating Codice Fiscale app page. It contains fake information about the number of\ninstallations and reviews, and urges the victim to perform an update. Shortly after the page is opened, the automatic\n\n\n-----\n\ndownload starts. Thus, the dropper outsources the download and installation procedure to the browser, avoiding suspicious\npermissions.\n\nObviously, such approach requires more actions from the victim, as the browser will show several messages about the\ndownloaded file. However, since victims are sure about the origin of the application, they will highly likely install and run the\ndownloaded Sharkbot payload.\n\nDuring our investigation, we also found another Sharkbot dropper available on Google Play. It had zero installations at the\ntime of discovery and was quickly removed from the website. The interesting detail about this dropper was that it had the\nREQUEST_INSTALL_PACKAGES permission in place and operated more in line with usual dropper’s behaviour. Actors\nwere also following the updated policy of Google, as this dropper was masqueraded as file manager, a category that is\nallowed to have this permission due to it being a core functionality.\n\n\n-----\n\nSimilarities in code, C2 communication, and encryption used lead us to the same author behind the older versions of\nSharkbot dropper, trying to reduce footprints and stay undetected.\n\n### Targets\n\nThe new “Codice Fiscale” dropper discovered by ThreatFabric is configured to distribute Sharkbot payload to Italian users\nonly, while the other “File Manager” dropper has Italy and UK in its configuration. At the same time, the payload delivered\nstill has banks from Italy, UK, Germany, Spain, Poland, Austria, US, and Australia in its target list. Please, find the full target\nlist in Appendix.\n\n## Vultur: Brunhilda is back\n\nAnother malware family that has been very active in the last year has been Vultur. First discovered by ThreatFabric in July\n2021, Vultur is an Android banking trojan which specializes in stealing PII from infected devices using its screen-streaming\ncapabilities. It is also able to create a remote session on the device using VNC technology to perform actions on the\nvictim’s device, effectively leading to On-Device Fraud (ODF).\n\nUpon discovery, ThreatFabric first reported the strong connection between this malware family, and the “Brunhilda\n**Project” crew. This Threat Actor was known for its central role in the distribution sector of the Android Banking malware**\nlandscape thanks to its dropper applications, which managed often to pass Google security checks and be approved on the\nGoogle Play Store. Initially, the Brunhilda droppers were deploying a variety of Android malware applications, like for\nexample samples of the malware family Alien. However, after the first discovery of Vultur, every dropper found on the\nGoogle Play Store only installed samples belonging to the Vultur malware family.\n\nRecently, ThreatFabric discovered 3 new Droppers on the Google Play store, ranging from 1.000 to 100.000 installations\nreported by Google. As previous campaigns observed throughout 2022, these droppers pose as applications like security\nauthenticators, or file recovery tools.\n\n\n-----\n\n### The Dropper\n\nThe dropper applications are consistent with the droppers that we reported in our first blog about Vultur, and the modus\noperandi has not changed much with respect to older variants. As usual, the dropper is made of a trojanized application,\nwhich provides the advertised functionality, as well as the hidden dropper functionality. As previously reported, the dropper\ninitially sends a registration message to its C2 server. As a response, the server sends back an appToken, which is then\nused in the following requests to identify the device. At this point, the dropper prompts the victim with a screen asking to\ndownload an update for the current application. If the user accepts the displayed request, the dropper proceeds to install\nVultur.\n\n\n-----\n\nIn terms of execution of the installation, there are no real updates from previous versions of Brunhilda. However, the\ndropper currently implements a few obfuscation techniques which were not present in initial versions of the dropper.\nFirstly,\nin these new version, the installation logic is not contained in the main DEX file, but in a additional dex file which is loaded\ndynamically. This additional step can complicate the life of researchers, making it harder to identify the code responsible for\nmalicious activity.\n\nThe latest version of Brunhilda also implemented a new layer of obfuscation, which encrypts strings by using AES with a\nvarying key, which is included in the byte array that is given as input to the decryption method, as explained in the picture\nbelow:\n\nOnce the payload is installed, the Brunhilda dropper launches the malware, and then continues existing on the device,\nacting as the application it is posing as.\n\n### Vultur\n\nThese Brunhilda droppers all deploy samples belonging to a novel variant of Vultur Android Banking malware family.\n\nThis new variant maintains the Modus Operandi that characterized the original samples from 2021: once installed, the\nmalware initiates a connection with its C2, and after registering it obtains its configuration containing its targets.\nVultur\nfeatures two separate target lists: one for screen-streaming targets and one for keylogging targets. Similarly to its older\nvariant, the keylogging targets are social and messaging applications, while the screen-streaming targets are applications\nfor online banking and cryptocurrency exchange. However, in this new variant, this second set of targets is also the list of\napplications for which extensive accessibility logging is performed.\n\n\n-----\n\nBy accessibility logging we mean the extensive logging of all UI elements and all the events associated with them (like for\nexample clicks, gestures, etc). This is not a novel technique, but it is the first time we see it implemented in Vultur. This\nmight be a solution to the issue created by a security flag often used in these banking applications: Android offers a way to\ntag the content of the window as secure, by using the “FLAG_SECURE”, which prevents it “from appearing in screenshots\nor from being viewed on non-secure displays”.\nThreatFabric tested this and is able to confirm that windows with this flag\nenabled only show a black screen during screen-streaming. However, if the keyboard is opened during interaction with\nthe secured app, it will be visible on the recording as well as all the keys pressed by victim leading to potential theft of\ninput data.\nIn this case, it is possible to obtain enough information to steal credentials even with a black screen, when all\nthe UI events are logged and sent to the C2.\n\n\n-----\n\nIn our previous blog we documented through our research why we believe that Vultur, the malware downladed by these\ndroppers, is a malware family that is not only distributed, but also created by the criminals behind the Brunhilda Project. In\naddition to the reasons discussed in our previous blog, which focus on the networking protocol used, new variants of Vultur\nalso adopted the very same string obfuscation algorithm discussed in the previous section about the Brunhilda Dropper,\nfurther confirming our beliefs about the connection between these two malware families.\n\n### Targets\n\nThese new Brunhilda-Vultur campaigns have been very active and successful in the last few months, reaching more than\n100.000 potential fraud victims.\nBased on our research and investigation, in addition to cryptowallets which have always\nbeen in the target list, the largest campaign we observed focused on UK and Netherlands, while the two smaller and more\nrecent ones switched to Germany, France, and Italy. Full target list of Vultur is provided in Appendix.\n\n## Conclusion\n\nAnother trend predicted by ThreatFabric’s experts comes true and looks like it is here to stay. Malicious dropper\napplications still find their way to sneak in the official store despite the changes made to the policy and security\nmechanisms. Distibution through droppers on Google Play still remains the most “affordable” and scalable way of reaching\n[victims for most of the actors of different level. While sophisticated tactics like telephone-oriented attack delivery require](https://www.threatfabric.com/blogs/toad-fraud.html)\nmore resources and are hard to scale, droppers on official and third-party stores allow threat actors to reach wide\nunsuspecting audience with reasonable efforts.\nSuch way of distribution of Android banking Trojans is very dangerous as\nvictims may stay unsuspecting for a long time and may not alert their bank about suspicious transactions made without\nthem knowlege. Thus it is very important to take actions on the organisation side to detect such malicous apps and their\npayloads as well as suspicious behaviour happenning on customer’s device.\n\nWe at ThreatFabric always report malicous droppers we indentified to remove it from official stores and limit its further\ndistribution. Financial organisations are welcome to contact us: if you suspect some app be involved in malicious activity,\nfeel free to reach our Mobile Threat Intelligence team which will provide additional details and help with reporting the\n[malicous app if identified: mti@threatfabric.com.](mailto://mti@threatfabric.com)\n\n## Fraud Risk Suite\n\nThreatFabric’s Fraud Risk Suite enables safe & frictionless online customer journeys by integrating industry-leading mobile\nthreat intel, behavioural analytics, advanced device fingerprinting and over 10.000 adaptive fraud indicators. This will give\nyou and your customers peace of mind in an age of ever-changing fraud.\n\n## Appendix\n\n### Sharkbot Droppers\n\n**App name** **Package name** **SHA-256**\n\n\nCodice\nFiscale\n2022\n\nFile\nManager\nSmall, Lite\n\n\ncom.iatalytaxcode.app 5649fb11661e059a6fa276127be2ea688471fec7cd3b1f4b2745a7d2b048cc26\n\ncom.paskevicss752.usurf 84cad5780bb72075a9904040811e82fae39243d0a28c51f6095bc8b841c55356\n\n\n### Sharkbot Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\n\n_Codice\nFiscale\n\n\ncom.hzpwksdljgeibc.gmzjwdule 0cbd727b7fa8d9938746475e91fb22a46b75cdcca2778db78073e3c3da70ad31\n\n\n-----\n\n**App**\n**name** **Package name** **SHA-256**\n\n\n_Codice\nFiscale\n\n\ncom.gxulzkj.atuqczml 008338b39c0abf3aa75e92e845c34ac60e049a480eb1e0ab8d3147085a7bb745\n\n\n### Brunhilda Droppers\n\n**App name** **Package name** **SHA-256**\n\n\nMy Finances\nTracker\n\n\ncom.all.finance.plus 0626e98f9988c63684e575d7a0df839240f7963aed38f82010e63b1b85a9ef61\n\n\nRecoverFiles com.umac.recoverallfilepro e94a6f7dcdddd4b8c18110993f118f86d3cbfe1faf330f9968aaa7095dd189a4\n\n\nZetter\nAuthenticator\n\n\ncom.zetter.fastchecking 54139e2e008ed2ebcb4fc71d8aa2470727a724c8607464d9c3688e9506952529\n\n\n### Vultur Samples\n\n**App name** **Package name** **SHA-256**\n\nRecoverFiles com.accessible.recoverypro cae3a48013fcea931f6b84e196f625e27017a1cdc97c1d86c8077db431abd508\n\n\nZetter\nAuthenticator\n\n\ncom.zforce.setupex 8584d43067535dc97d12c4565e1636e3a1963421fe811ff6e58b4dbd7e5b947d\n\n\n### Sharkbot Targets\n\n**Package name** **App name**\n\nau.com.nab.mobile NAB Mobile Banking\n\nat.erstebank.george George Österreich\n\ncom.grppl.android.shell.BOS Bank of Scotland Mobile Banking: secure on the go\n\nde.number26.android N26 — The Mobile Bank\n\nco.bitx.android.wallet Luno: Buy Bitcoin, Ethereum and Cryptocurrency\n\ncom.fineco.it Fineco\n\ncom.paypal.android.p2pmobile PayPal Mobile Cash: Send and Request Money Fast\n\nes.lacaixa.mobile.android.newwapicon CaixaBank\n\ncom.targo_prod.bad TARGOBANK Mobile Banking\n\ncom.grppl.android.shell.halifax Halifax: the banking app that gives you extra\n\npl.pkobp.iko IKO\n\norg.stgeorge.bank St.George Mobile Banking\n\nit.bnl.apps.banking BNL\n\ncom.vipera.chebanca CheBanca!\n\nuk.co.santander.santanderUK Santander Mobile Banking\n\ncom.wf.wellsfargomobile Wells Fargo Mobile\n\ncom.starfinanz.smob.android.* Sparkasse\n\n\n-----\n\n**Package name** **App name**\n\npiuk.blockchain.android Blockchain Wallet. Bitcoin, Bitcoin Cash, Ethereum\n\ncom.commbank.netbank CommBank\n\nes.unicajabanco.app Unicaja Banco\n\nuk.co.mbna.cardservices.android MBNA - Card Services App\n\nde.postbank.finanzassistent Postbank Finanzassistent\n\ncom.barclays.android.barclaysmobilebanking Barclays\n\ncom.konylabs.capitalone Capital One® Mobile\n\ncom.advanzia.mobile Advanzia\n\nuk.co.tsb.newmobilebank TSB Mobile Banking\n\ncom.latuabancaperandroid Intesa Sanpaolo Mobile\n\ncom.citi.citimobile Citi Mobile®\n\ncom.virginmoney.uk.mobile.android Virgin Money Mobile Banking\n\ncom.grppl.android.shell.CMBlloydsTSB73 Lloyds Bank Mobile Banking: by your side\n\nposteitaliane.posteapp.appbpol BancoPosta\n\ncom.lynxspa.bancopopolare YouApp\n\nde.commerzbanking.mobil Commerzbank Banking - The app at your side\n\nuk.co.hsbc.hsbcukmobilebanking HSBC UK Mobile Banking\n\ncom.CredemMobile Credem\n\ncom.starlingbank.android Starling Bank - Better Mobile Banking\n\ncom.binance.dev Binance - Buy & Sell Bitcoin Securely\n\ncom.cooperativebank.bank The Co-operative Bank\n\ncom.transferwise.android TransferWise Money Transfer\n\ncom.usbank.mobilebanking U.S. Bank - Inspired by customers\n\n### Vultur Targets\n\n**Package name** **Application name**\n\nasia.coins.mobile Coins.ph Wallet\n\nbe.aion.android.app Aion Bank\n\nbtc.org.freewallet.app Bitcoin Wallet. Buy & Exchange BTC coin－Freewallet\n\nbvm.bvmapp Knab Bankieren\n\ncash.klever.blockchain.wallet Klever Wallet: Buy Bitcoin, Ethereum, Tron, Crypto\n\ncedacri.mobile.bank.crbolzano isi-mobile Cassa di Risparmio\n\ncedacri.mobile.bank.esperia Mediobanca Private Banking\n\nco.bitx.android.wallet Luno: Buy Bitcoin, Ethereum and Cryptocurrency\n\n\n-----\n\n**Package name** **Application name**\n\nco.clabs.valora Valora - Crypto Wallet\n\nco.edgesecure.app Edge - Bitcoin, Ethereum, Monero, Ripple Wallet\n\nco.mona.android Crypto.com - Buy Bitcoin Now\n\nco.uk.Nationwide.Mobile Nationwide Banking App\n\ncom.CredemMobile Credem\n\ncom.IngDirectAndroid ING France\n\ncom.VBSmartPhoneApp BankUp Mobile\n\ncom.abnamro.nl.mobile.payments ABN AMRO Mobiel Bankieren\n\ncom.americanexpress.android.acctsvcs.it Amex Italia\n\ncom.americanexpress.android.acctsvcs.uk Amex United Kingdom\n\ncom.arkea.android.application.cmb Crédit Mutuel de Bretagne\n\ncom.bankid.bus BankID säkerhetsapp\n\ncom.banknorwegian Bank Norwegian\n\ncom.barclays.android.barclaysmobilebanking Barclays\n\ncom.barclays.bca Barclaycard\n\ncom.bbva.italy BBVA Italia Banca Online\n\ncom.binance.dev Binance - Buy & Sell Bitcoin Securely\n\ncom.bitcoin.mwallet Bitcoin Wallet\n\ncom.bitfinex.mobileapp Bitfinex\n\ncom.bitpanda.bitpanda Bitpanda - Buy Bitcoin in minutes\n\ncom.bittrex.trade Bittrex Global\n\ncom.bituniverse.portfolio BitUniverse:Crypto Trading Bot\n\ncom.boursorama.android.clients Boursorama Banque\n\ncom.breadwallet BRD Bitcoin Wallet. Buy BTC Bitcoin Cash, Ethereum\n\ncom.bunq.android bunq - bank of The Free\n\ncom.bybit.app Bybit: Crypto Trading Exchange\n\ncom.caisseepargne.android.mobilebanking Banque\n\ncom.cic_prod.bad CIC\n\ncom.cm_prod.bad Crédit Mutuel\n\ncom.coinbase.android Coinbase – Buy & Sell Bitcoin. Crypto Wallet\n\ncom.coinbase.pro Coinbase Pro – Bitcoin & Crypto Trading\n\ncom.coinbase.wallite Coinbase Wallet Lite\n\ncom.coinomi.wallet Coinomi Wallet :: Bitcoin Ethereum Altcoins Tokens\n\ncom.coinspot.app CoinSpot - Buy & Sell Bitcoin\n\n\n-----\n\n**Package name** **Application name**\n\ncom.comeco.teo TEO - Das neue Multibanking\n\ncom.cooperativebank.bank The Co-operative Bank\n\ncom.crypterium Crypterium Bitcoin Wallet\n\ncom.crypto.multiwallet Guarda Crypto Bitcoin Wallet\n\ncom.cryptonator.android Cryptonator cryptocurrency wallet\n\ncom.db.pbc.miabanca La Mia Banca\n\ncom.db.pwcc.dbmobile Deutsche Bank Mobile\n\ncom.defi.wallet Crypto.com l DeFi Wallet\n\ncom.digifinex.app DigiFinex - Buy & Sell Bitcoin, Crypto Trading\n\ncom.enjin.mobile.wallet Enjin: Bitcoin, Ethereum, Blockchain Crypto Wallet\n\ncom.etoro.openbook eToro - Smart Crypto Trading Made Easy\n\ncom.etoro.wallet eToro Money\n\ncom.fideuram.alfabetobanking Alfabeto Banking\n\ncom.fidor.fsw Fidor Smart Banking\n\ncom.fineco.it Fineco\n\ncom.firstdirect.bankingonthego first direct\n\ncom.gemini.android.app Gemini: Buy Bitcoin Instantly\n\ncom.getpenta.app Penta – Business Banking App\n\ncom.grppl.android.shell.BOS Bank of Scotland Mobile Banking: secure on the go\n\ncom.grppl.android.shell.CMBlloydsTSB73 Lloyds Bank Mobile Banking: by your side\n\ncom.grppl.android.shell.halifax Halifax: the banking app that gives you extra\n\ncom.hanseaticbank.banking Hanseatic Bank Mobile\n\ncom.hittechsexpertlimited.hitbtc HitBTC – Bitcoin Trading and Crypto Exchange\n\ncom.ie.capitalone.uk Capital One UK\n\ncom.ing.mobile ING Bankieren\n\ncom.kontist Kontist Tax Service\n\ncom.kraken.invest.app Kraken - Buy Bitcoin & Crypto\n\ncom.kraken.trade Pro: Advanced Bitcoin & Crypto Trading\n\ncom.krakenfutures Kraken Futures: Bitcoin & Crypto Futures Trading\n\ncom.kubi.kucoin KuCoin: Bitcoin Exchange & Crypto Wallet\n\ncom.latuabancaperandroid Intesa Sanpaolo Mobile\n\ncom.latuabancaperandroid.pg Intesa Sanpaolo Business\n\ncom.liberty.jaxx Jaxx Liberty: Blockchain Wallet\n\ncom.lumiwallet.android Lumi Crypto and Bitcoin Wallet\n\n\n-----\n\n**Package name** **Application name**\n\ncom.lynxspa.bancopopolare YouApp\n\ncom.mediolanum.android.fullbanca Mediolanum\n\ncom.mercuryo.app Mercuryo Bitcoin Cryptowallet\n\ncom.mycelium.wallet Mycelium Bitcoin Wallet\n\ncom.ocito.cdn.activity.banquesmc SMC pour Mobile\n\ncom.ocito.cdn.activity.creditdunord Crédit du Nord pour Mobile\n\ncom.okinc.okex.gp OKEx - Bitcoin/Crypto Trading Platform\n\ncom.opentecheng.android.webank Webank\n\ncom.orangebank.android Orange Bank\n\ncom.paxful.wallet Paxful Bitcoin Wallet\n\ncom.paysend.app Money Transfer App Paysend\n\ncom.phemex.app Phemex: Buy Crypto & Bitcoin\n\ncom.pionex.client Pionex - Crypto Trading Bot\n\ncom.plunien.poloniex Poloniex Crypto Exchange\n\ncom.plutus.wallet Abra: Bitcoin, XRP, LTC\n\ncom.rbs.mobile.android.natwest NatWest Mobile Banking\n\ncom.rbs.mobile.android.rbs Royal Bank of Scotland Mobile Banking\n\ncom.rbs.mobile.android.ubn Ulster Bank NI Mobile Banking\n\ncom.revolut.revolut Revolut - Get more from your money\n\ncom.robinhood.android Robinhood - Investment & Trading, Commission-free\n\ncom.satispay.customer Satispay\n\ncom.scrignosa SCRIGNOIdentiTel\n\ncom.sella.BancaSella Banca Sella\n\ncom.sisal.sisalpay Mooney App: pagamenti digitali\n\ncom.squareup.cash Cash App\n\ncom.starfinanz.smob.android.bwmobilbanking BW-Mobilbanking mit Smartphone und Tablet\n\ncom.starfinanz.smob.android.sfinanzstatus Sparkasse Ihre mobile Filiale\n\ncom.starlingbank.android Starling Bank - Better Mobile Banking\n\ncom.stoegerit.outbank.android Outbank - 360° Banking\n\ncom.stormgain.mobile StormGain: Bitcoin Wallet & Crypto Exchange App\n\ncom.superchain.lbankgoogle LBank - Buy Bitcoin & Crypto\n\ncom.tabtrader.android TabTrader Buy Bitcoin and Ethereum on exchanges\n\ncom.targo_prod.bad TARGOBANK Mobile Banking\n\ncom.tescobank.mobile Tesco Bank Mobile Banking\n\n\n-----\n\n**Package name** **Application name**\n\ncom.transferwise.android TransferWise Money Transfer\n\ncom.triodos.bankingnl Triodos Bankieren NL\n\ncom.unicredit Mobile Banking UniCredit\n\ncom.uphold.wallet Uphold - Trade, Invest, Send Money For Zero Fees\n\ncom.vipera.chebanca CheBanca!\n\ncom.virginmoney.uk.mobile.android Virgin Money Mobile Banking\n\ncom.wallet.crypto.trustapp Trust: Crypto & Bitcoin Wallet\n\ncom.youhodler.youhodler YouHodler - Crypto and Bitcoin Wallet\n\ncom.zengo.wallet ZenGo Crypto & Bitcoin Wallet: Buy, Earn & Trade\n\nde.bbbank.banking.privat BBBank-Banking classic\n\nde.bs.ibanking OLB Banking\n\nde.comdirect.app comdirect\n\nde.commerzbanking.mobil Commerzbank Banking - The app at your side\n\nde.fiducia.smartphone.android.banking.vr VR Banking Classic\n\nde.fiduciagad.banking.vr VR Banking - einfach sicher\n\nde.ingdiba.bankingapp ING Banking to go\n\nde.number26.android N26 — The Mobile Bank\n\nde.postbank.bestsign Postbank BestSign\n\nde.postbank.finanzassistent Postbank Finanzassistent\n\nde.psd.banking.app PSD Banking\n\nde.psd.banking.privat PSD Banking Classic\n\nde.santander.presentation Santander Banking\n\nde.schildbach.wallet Bitcoin Wallet\n\nde.sdvrz.ihb.mobile.secureapp.sparda.produktion SpardaSecureApp\n\nde.sparda.banking.privat SpardaBanking+\n\nde.spardab.banking.privat Sparda Berlin\n\neth.org.freewallet.app Ethereum Wallet. Buy & Exchange ETH — Freewallet\n\neu.qonto.qonto Qonto • Easy Business Banking\n\neu.unicreditgroup.hvbapptan HVB Mobile Banking\n\nexodusmovement.exodus Exodus: Crypto Bitcoin Wallet\n\nfr.bnpp.digitalbanking Hello bank! par BNP Paribas\n\nfr.creditagricole.androidapp Ma Banque\n\nfr.hsbc.hsbcfrance HSBC France\n\nfr.lcl.android.customerarea Mes Comptes - LCL\n\n\n-----\n\n**Package name** **Application name**\n\nfr.mafrenchbank Ma French Bank\n\nio.atomicwallet Bitcoin Wallet & Ethereum Ripple ZIL DOT\n\nio.bluewallet.bluewallet BlueWallet Bitcoin Wallet\n\nio.cex.app.prod CEX.IO Cryptocurrency Exchange\n\nio.metamask MetaMask - Buy, Send and Swap Crypto\n\nio.safepal.wallet SafePal-Crypto wallet BTC NFTs\n\nit.bcc.iccrea.mycartabcc myCartaBCC\n\nit.bnl.apps.banking BNL\n\nit.bnl.apps.banking.privatebnl My Private Banking\n\nit.bper.mobile.mymoney Smart My Money\n\nit.caitalia.apphub Crédit Agricole Italia\n\nit.carige Carige Mobile\n\nit.cedacri.hb2.bpbari Mi@\n\nit.cedacri.hb3.desio.brianza D-Mobile\n\nit.copergmps.rt.pf.android.sp.bmps Banca MPS\n\nit.creval.bancaperta Bancaperta\n\nit.gruppobper.ams.android.bper Smart Mobile Banking\n\nit.gruppobper.smartbpercard Smart BPER Card\n\nit.gruppocariparma.nowbanking Nowbanking\n\nit.hype.app Hype\n\nit.icbpi.mobile Nexi Pay\n\nit.ingdirect.app ING Italia\n\nit.nogood.container UBI Banca\n\nit.phoenixspa.inbank Inbank\n\nit.popso.SCRIGNOapp SCRIGNOapp\n\nit.relaxbanking RelaxBanking Mobile\n\nmobi.societegenerale.mobile.lappli L’Appli Société Générale\n\nmobi.societegenerale.mobile.lapplipro L’Appli Pro Société Générale\n\nmw.org.freewallet.app Bitcoin & Crypto Blockchain Wallet: Freewallet\n\nnet.bitstamp.app Bitstamp – Buy & Sell Bitcoin at Crypto Exchange\n\nnet.bnpparibas.mescomptes Mes Comptes BNP Paribas\n\nnet.safemoon.androidwallet SafeMoon\n\nnl.asnbank.asnbankieren ASN Mobiel Bankieren\n\nnl.rabomobiel Rabo Bankieren\n\n\n-----\n\n**Package name** **Application name**\n\nnl.regiobank.regiobankieren RegioBank - Mobiel Bankieren\n\nnl.snsbank.snsbankieren SNS Mobiel Bankieren\n\none.tomorrow.app Tomorrow: Mobile Banking\n\norg.electrum.electrum Electrum Bitcoin Wallet\n\norg.toshi Coinbase Wallet — Crypto Wallet & DApp Browser\n\npiuk.blockchain.android Blockchain Wallet. Bitcoin, Bitcoin Cash, Ethereum\n\nposteitaliane.posteapp.appbpol BancoPosta\n\nse.bankgirot.swish Swish payments\n\nuk.co.hsbc.hsbcukmobilebanking HSBC UK Mobile Banking\n\nuk.co.mbna.cardservices.android MBNA - Card Services App\n\nuk.co.metrobankonline.mobile.android.production Metro Bank\n\nuk.co.santander.santanderUK Santander Mobile Banking\n\nuk.co.tsb.newmobilebank TSB Mobile Banking\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-28 - Malware wars- the attack of the droppers.pdf"
    ],
    "report_names": [
        "2022-10-28 - Malware wars- the attack of the droppers.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535776,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1669661818,
    "ts_modification_date": 1669661818,
    "files": {
        "pdf": "https://archive.orkl.eu/bb45d64361416f42fe748376ce2407f76e646e5a.pdf",
        "text": "https://archive.orkl.eu/bb45d64361416f42fe748376ce2407f76e646e5a.txt",
        "img": "https://archive.orkl.eu/bb45d64361416f42fe748376ce2407f76e646e5a.jpg"
    }
}