{
    "id": "6e731e61-00c3-4495-90d5-f19af2a86bcb",
    "created_at": "2023-01-12T15:08:23.342773Z",
    "updated_at": "2025-03-27T02:05:49.836416Z",
    "deleted_at": null,
    "sha1_hash": "2d4bd44a48bdabce08cd8852d9e4e91e58e6aaa3",
    "title": "2012-11-28 - Shylock’s New Trick- Evading Malware Researchers",
    "authors": "",
    "file_creation_date": "2022-05-28T21:44:24Z",
    "file_modification_date": "2022-05-28T21:44:24Z",
    "file_size": 3493262,
    "plain_text": "# Shylock's New Trick: Evading Malware Researchers\n\n**[securityintelligence.com/shylocks-new-trick-evading-malware-researchers/](https://securityintelligence.com/shylocks-new-trick-evading-malware-researchers/)**\n\nNovember 28, 2012\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nShylock’s New Trick: Evading Malware Researchers\n\n\n-----\n\n[Banking & Finance November 28, 2012](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Dana Tamir 2 min read](https://securityintelligence.com/author/dana-tamir/)\nShylock is a financial malware platform discovered by IBM Security in 2011. Like most\nmalware strains, it continues to evolve in order to bypass new defensive technologies put in\nplace by financial institutions and enterprises. While analyzing a recent Shylock dropper, we\nnoticed a new trick it uses to evade detection. Namely, it can identify and avoid remote\ndesktop environments, a setup commonly used by researchers when analyzing malware.\n\n## Exploiting the Lab\n\nResearchers collect suspected malware samples for analysis and often place them onto\nmachines that are isolated in an operations center, also known as a lab. Rather than sit in\nfront of a rack of physical machines in a cold basement lab, researchers use remote desktop\nconnections to study malware from the convenience and coziness of their offices. It is this\nhuman weakness that Shylock exploits. We have discovered advanced malware that is now\ncapable of detecting remote desktop environments to evade researchers.\n\nThe Shylock dropper we discovered detects a remote desktop environment by feeding\ninvalid data into a certain routine and then observing the error code returned. It uses this\nreturn code to differentiate between normal desktops and other lab environments. In\nparticular, when executed from a remote desktop session, the return code will be different\nand Shylock won’t install. It is possible to use this method to identify other known or\nproprietary virtual/sandbox environments, as well.\n\nFor those more technically oriented, here is a bit more detail. The dropper dynamically loads\n[Winscard.dll and calls the function SCardForgetReaderGroupA(0, 0). The malware proceeds](https://msdn.microsoft.com/en-us/library/windows/desktop/aa379486%28v=vs.85%29.aspx)\nas expected only if the return value is either 0x80100011 (SCARD_E_INVALID_VALUE) or\n\n\n-----\n\n0x2 (ERROR_FILE_NOT_FOUND).\n\nWe noticed that when the dropper is executed locally, the return value is 0x80100011, but\nwhen it is executed from a remote desktop session the return value is 0x80100004\n(SCARD_E_INVALID_PARAMETER). The assembly language source code is shown below.\nWe have found a number of malware strains that utilize different approaches to identify\nspecific execution environments in order to take appropriate evasive actions. The assembly\nlanguage source code is shown below.\n\nIBM vs. Shylock\n\nIBM Security solutions are not affected by anti-VM/anti-research techniques employed by\nmalware. This is because we use real-time application protection to monitor for suspected\nmalware behavior in the endpoint device’s memory. This approach prevents malware from\n[compromising applications, including the browser, and stealing data like user credentials. It is](https://www-03.ibm.com/security/xforce/)\n[also immune to malware evasion techniques designed to identify remote desktop and virtual](https://securityintelligence.com/underestimating-your-security-tactics-attackers-wont/#.U9J1ao1dXgI)\nmachine environments.\n\n[Financial Malware |](https://securityintelligence.com/tag/financial-malware/) [Malware |](https://securityintelligence.com/tag/malware/) [Sandbox |](https://securityintelligence.com/tag/sandbox/) [Shylock](https://securityintelligence.com/tag/shylock/)\n\n\n-----\n\n[Dana Tamir](https://securityintelligence.com/author/dana-tamir/)\nDirector of Enterprise Security at Trusteer, an IBM Company\n\nDana Tamir is Director of Enterprise Security at Trusteer, an IBM Company. In her role she\nleads activities related to enterprise advanced threat protection ...\n\n\n-----\n\n### more from Banking & Finance\n\n[Banking & Finance May 10, 2022](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\n\n## What Do Financial Institutions Need to Know About the SEC’s Proposed Cybersecurity Rules?\n\n\n-----\n\nOn March 9, the U.S. Securities and Exchange Commission (SEC) announced a new set of\nproposed rules for cybersecurity risk management, strategy and incident disclosure for public\n[companies. One intent of the rule changes is to provide “consistent, comparable and](https://securityintelligence.com/articles/financial-institutions-know-sec-proposed-cybersecurity-rules/)\ndecision-useful” information to investors. Not yet adopted, these new rules – published in the\nFederal […]\n\n[Advanced Threats May 9, 2022](https://securityintelligence.com/category/x-force/threats/)\n\n## New DOJ Team Focuses on Ransomware and Cryptocurrency Crime\n\nWhile no security officer would rely on this alone, it’s good to know the U.S. Department of\nJustice is increasing efforts to fight cyber crime. According to a recent address in Munich by\nDeputy Attorney General Lisa Monaco, new efforts will focus on ransomware and\ncryptocurrency incidents. This makes sense since the X-Force Threat Intelligence […]\n\n\n-----\n\n[Banking & Finance May 3, 2022](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\n\n## SEC Proposes New Cybersecurity Rules for Financial Services\n\nProposed new policies from the Securities and Exchange Commission (SEC) could spell\n[changes for how financial services firms handle cybersecurity. On Feb. 9, the SEC voted to](https://securityintelligence.com/articles/sec-proposes-new-cybersecurity-rules-financial-services/)\npropose cybersecurity risk management policies for registered investment advisers,\nregistered investment companies and business development companies (funds). Next, the\nproposal will go through a public comment period until […]\n\n[Banking & Finance April 19, 2022](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\n\n\n-----\n\n## Top Security Concerns When Accepting Crypto Payment\n\nFrom Microsoft to AT&T to Home Depot, more companies are accepting cryptocurrency as a\nway to pay for products and services. This makes perfect sense as crypto coins are a viable\nrevenue source. Perhaps the time is ripe for businesses to learn how to receive, process and\nconvert crypto payments into fiat currency. Still, many […]\n\nAnalysis and insights from hundreds of the brightest minds in the cybersecurity industry to\nhelp you prove compliance, grow business and stop threats.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2012/2012-11-28 - Shylock’s New Trick- Evading Malware Researchers.pdf"
    ],
    "report_names": [
        "2012-11-28 - Shylock’s New Trick- Evading Malware Researchers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536103,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653774264,
    "ts_modification_date": 1653774264,
    "files": {
        "pdf": "https://archive.orkl.eu/2d4bd44a48bdabce08cd8852d9e4e91e58e6aaa3.pdf",
        "text": "https://archive.orkl.eu/2d4bd44a48bdabce08cd8852d9e4e91e58e6aaa3.txt",
        "img": "https://archive.orkl.eu/2d4bd44a48bdabce08cd8852d9e4e91e58e6aaa3.jpg"
    }
}