{
    "id": "6e881539-fc13-453b-9d38-a83b56a53b0d",
    "created_at": "2023-01-12T15:10:39.600627Z",
    "updated_at": "2025-03-27T02:09:01.41081Z",
    "deleted_at": null,
    "sha1_hash": "9cd7cfff9db2d8a49d21523716fe595d45d665a0",
    "title": "2022-03-22 - Hunters Become The Hunted- Clipper Malware Disguised As AvD Crypto Stealer",
    "authors": "",
    "file_creation_date": "2022-05-27T23:06:38Z",
    "file_modification_date": "2022-05-27T23:06:38Z",
    "file_size": 1231694,
    "plain_text": "# Hunters become the Hunted\n\n**blog.cyble.com/2022/03/22/hunters-become-the-hunted/**\n\n## Clipper Malware disguised as AvD Crypto Stealer\n\n\nMarch 22, 2022\n\n\nInformation stealing malware is on the rise. Cyble Research Labs recently discovered a new malware\ndubbed “AvD crypto stealer” on a cybercrime forum. Upon further investigation, however, we observed\nthat this does not function as a Crypto Stealer. This is, in fact, a disguised variant of well-known Clipper\nmalware that can read and edit any text copied by the victim i.e. crypto wallet information.\n\nThe TA is providing one month of free access to entice more individuals to use it. Anyone can become a\nvictim of this malware – though the primary target appears to be other TAs.\n\nThe Threat Actor (TA) claims that the stealer supports six cryptocurrency chains, including Ethereum,\nBinance Smart Chain, Fantom, Polygon, Avalanche, and Arbitrum.\n\nThe TA targets victims by changing the crypto addresses present in the clipboard. As for crypto\ntransactions, individuals typically copy the crypto addresses, and the malware takes advantage of this by\nreplacing the copied crypto wallet address with the one specified by TA.\n\n\n-----\n\nIf the victim does not validate the copied and the pasted values, then the transaction might end up in the\naccount specified by TA. This clipper malware can also identify the crypto addresses present amongst\nmultiple strings, expanding this malware’s capabilities.\n\nFigure 1: Post shared on a cybercrime forum\n\n## Technical Analysis\n\nThe execution of malware starts from an installation file, which is Self-Extracting. Self-extracting\narchives, also known as SFX files, are Windows executable files that, upon execution, extract the\ncompressed content. Figure 2 showcases the installation wizard.\n\nFigure 2: Installation Wizard\nThe installation file drops the files shown in Figure 3 and executes the payload named ‘Payload.exe.’\nThe dropped files also contain manuals for using the builder and the binaries\n\n\n-----\n\nFigure 3:\n\nExtracted files\nThe payload file\n(SHA256:b6135c446093a19544dbb36018adb7139aa810a3f3eaa45663dc54448fe30e39) is a .NET\nbased binary. Figure 4 shows the payload details.\n\nFigure 4: File information\nFigure 5 shows the process flow for the clipper malware. The malware extracts the data from the\nclipboard and then uses a regular expression to find the crypto addresses. If there’s a match, the\nmalware replaces the address with one specified by TA.\n\n\n-----\n\nFigure 5: Clipper malware process flow\n\n### Clipper malware has the following class names:\n\n**Program:**\n\nThis class contains the main function which executes the clipper functionalities. Upon execution, the\nmain program creates a random mutex named “XWj1iK27ngY68XUB” to ensure that only one instance\nof the malware process runs at any given time. If it fails to create a mutex, the malware terminates its\nexecution.\n\n\n-----\n\nFigure 6: Main function\nAfter creating the mutex, the malware copies itself into the startup location to establish its persistence\nand executes ClipboardNotification.NotificationForm() function. Through this, the malware monitors the\nuser’s clipboard activity, identifies crypto address, and replaces it with the attacker’s address details.\n\n**Clipboard Notification:**\n\nThis class monitors the user’s clipboard activity and notify when the user copies something into the\nclipboard.\n\n**Addresses:**\n\nThis class contains the config details, including crypto addresses, mutex name, and the targeted\ncryptocurrencies, as shown in Figure 7. The clipper targets Bitcoin (BTC), Ethereum, and Monero (XMR)\ncrypto addresses.\n\nFigure 7: Addresses class\n\n**Clipboard:**\n\nThe class contains two function names, GetText() and SetText().\n\n\n-----\n\nThese functions get the clipboard text from the user. If there is a crypto wallet in the copied text, these\nfunctions will then set it to the attacker’s wallet address by replacing the copied user’s wallet address.\nClipboard is also responsible for sending the data for logging purposes to the URL present in the\nAddresses class.\n\nFigure 8: Clipboard class\n\n**PatternRegex:**\n\nThis class contains the regex pattern to identify the crypto addresses copied to the clipboard.\n\nFigure 9:\n\nPattern Regex\nOn further investigation into one of the hardcoded crypto addresses in the payload, we found the\nfollowing transaction details, as shown below.\n\n\n-----\n\nFigure 10: Transaction details\n\n## Conclusion:\n\nThreat Actors continue to exploit the human element for executing their attacks, as they see it as a\nvulnerability – this malware works on a similar attack vector. However, we can reduce the impact of this\nmalware by being more cautious while making crypto transactions.\n\nThere are multiple possibilities in which this attack can escalate. In one of the scenarios, the malware\ncreator can target other TA’s who use the builder for customizing the crypto stealer and their victims. This\nclipper can do financial theft at a great level, so it becomes necessary to take preventive measures.\n\n## Our Recommendations:\n\nAvoid downloading pirated software from warez/torrent websites. The “Hack Tool” present on sites\nsuch as YouTube, torrent sites, etc., primarily contains such malware.\nUse a reputed anti-virus and internet security software package on your connected devices,\nincluding PC, laptop, and mobile.\nRefrain from opening untrusted links and email attachments without first verifying their\nauthenticity.\nIn the case of businesses, educate employees in terms of protecting themselves from threats like\nphishing’s/untrusted URLs.\nMonitor the beacon on the network level to block data exfiltration by malware or TAs.\n\n## MITRE ATT&CK® Techniques \n\n**Tactic** **Technique ID** **Technique Name**\n\n**Initial Access** [T1566](https://attack.mitre.org/techniques/T1566/) Phishing\n\n**Execution** [T1204](https://attack.mitre.org/techniques/T1204/) User Execution\n\n**Persistence** [T1547](https://attack.mitre.org/techniques/T1547/) Boot or Logon AutoStart Execution\n\n\n-----\n\n**Collection** [T1115](https://attack.mitre.org/techniques/T1115/) Clipboard Data\n\n**Exfiltration** [T1567](https://attack.mitre.org/techniques/T1567/) Exfiltration Over Web Service\n\n## Indicators of Compromise (IoCs):\n\n**Indicators** **Indicator**\n**type**\n\n\n**Description**\n\n**Installation**\n**file**\n\n**Payload**\n**File**\n\n\n_012fca9cf0ac3e9a1c2c1499dfdb4eaf_\n_47480d9b4df34ea1826cd2fafc05230eb195c0c2_\n_deaad208c6805381b6b6b1960f0ee149a88cdae2579a328502139ffc5814c039_\n\n_fea27906be670ddbf5a5ef6639374c07_\n_20f7554280e5e6d0709aa1e850f01e816d2674f2_\n_b6135c446093a19544dbb36018adb7139aa810a3f3eaa45663dc54448fe30e39_\n\n\n**Md5**\n\n**SHA-1**\n\n**SHA-**\n**256**\n\n**Md5**\n\n**SHA-1**\n\n**SHA-**\n**256**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-22 - Hunters Become The Hunted- Clipper Malware Disguised As AvD Crypto Stealer.pdf"
    ],
    "report_names": [
        "2022-03-22 - Hunters Become The Hunted- Clipper Malware Disguised As AvD Crypto Stealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536239,
    "ts_updated_at": 1743041341,
    "ts_creation_date": 1653692798,
    "ts_modification_date": 1653692798,
    "files": {
        "pdf": "https://archive.orkl.eu/9cd7cfff9db2d8a49d21523716fe595d45d665a0.pdf",
        "text": "https://archive.orkl.eu/9cd7cfff9db2d8a49d21523716fe595d45d665a0.txt",
        "img": "https://archive.orkl.eu/9cd7cfff9db2d8a49d21523716fe595d45d665a0.jpg"
    }
}