{
    "id": "6e908202-de96-449f-8ef8-14040b391397",
    "created_at": "2022-10-25T16:48:20.229605Z",
    "updated_at": "2025-03-27T02:16:26.223691Z",
    "deleted_at": null,
    "sha1_hash": "acaa2b2f8b267a32b568a2a36141c17bcd4045ad",
    "title": "[TITULO DEL DOCUMENTO]",
    "authors": "",
    "file_creation_date": "2015-05-05T10:23:32Z",
    "file_modification_date": "2015-05-05T10:23:32Z",
    "file_size": 2224038,
    "plain_text": "# CPL Malware in Brazil: Somewhere Between Banking Trojans and Malicious Emails\n\n## Matías Porolli - Malware Analyst Pablo Ramos - Head of LATAM Research Lab\n\n\n-----\n\nContents\nIntroduction ................................................................................................................................................................................................... 3\n\nDescription of CPL Files ................................................................................................................................................................................. 4\n\nStructure of the CPlApplet ......................................................................................................................................................................... 4\n\nPropagation Campaign .................................................................................................................................................................................. 5\n\nLife Cycle of an Attack ............................................................................................................................................................................... 6\n\nTechnical Analysis of Malicious CPL Files ....................................................................................................................................................... 7\n\nCPlApplet ................................................................................................................................................................................................... 7\n\nMalicious Payload ...................................................................................................................................................................................... 9\n\nString Encryption Algorithm .................................................................................................................................................................... 12\n\nVariant with a Dynamically Loaded Key ................................................................................................................................................... 16\n\nCode in DllMain and Anti-VM tricks......................................................................................................................................................... 16\n\nBanking Trojans ....................................................................................................................................................................................... 21\n\nThe Reach of CPL Malware in Brazil............................................................................................................................................................. 22\n\nDetections, Threats and Functions .......................................................................................................................................................... 23\n\nURLs and Domains ................................................................................................................................................................................... 25\n\nPackers and Protectors ............................................................................................................................................................................ 27\n\nDetections and Malware Families ........................................................................................................................................................... 28\n\nConclusion ................................................................................................................................................................................................... 29\n\nReferences ................................................................................................................................................................................................... 30\n\nAppendix A .................................................................................................................................................................................................. 31\n\nString Decryption Routine in Python ....................................................................................................................................................... 31\n\nAppendix B .................................................................................................................................................................................................. 32\n\nList of URLs Obtained Through Static Analysis......................................................................................................................................... 32\n\nList of Incomplete URLs ........................................................................................................................................................................... 35\n\nList of curious URLs .................................................................................................................................................................................. 36\n\nAppendix C................................................................................................................................................................................................... 37\n\nPropagation Emails of Malicious CPL Files ............................................................................................................................................... 37\n\n\n-----\n\n# CPL Malware in Brazil: Somewhere Between Banking Trojans and Malicious Emails\n\n### Introduction\n\nIn different countries and regions around the world, the malware detections trends vary depending on the particular habits of the\nusers or the region. In the Latin American region, ESET Latin America's Research Lab noticed one country differs from the rest in\nLATAM in terms of detections. That country is Brazil, which has not only the largest population in the region but also speaks a\ndifferent language, Portuguese.\n\nWhen discussing the threats detected in Brazil, a special reference is usually made to the malware families known as\n**_[Win32/TrojanDownloader.Banload and Win32/Spy.Banker. The fact that banking Trojans are the most frequently detected](http://www.virusradar.com/en/Win32_TrojanDownloader.Banload/detail)_**\nthreats in Brazil is not surprising; however, we will tell you how cybercriminals in this country have used a special type of\nexecutable–CPL (Control Panel Application) files – to spread their threats, and we will discuss the evolution of this trend in the\nlast few years.\n\nFirst of all, we will define what a CPL file is, how it works and how cybercriminals use it. We will analyze the methods used to\ncompromise a system and the purpose of the infection, providing details about their ability to obfuscate, to hide information and\nto hinder protection of virtual environments.\n\nNext, we will review their propagation methods. We will provide examples of emails, institutions and names of the files employed\nto deceive the users by making use of Social Engineering techniques, so that the victims can be persuaded to download and\nexecute diverse threats in their systems, making it possible for the attackers to compromise their information.\n\nFinally, we will share with you the scope, statistics and impact of these attacks, detailing how, over the years, the use of CPL files\nby cybercriminals in Brazil has ceased to be a novel or an isolated event, and has become a trend in itself. Cybercriminals used the\nmost diverse filenames to get the victims' attention: in particular, names related to Boletos Bancarios, a very popular payment\nmethod in Brazil.\n\nAmong the main reasons cybercriminals choose to use banking Trojans in Brazil – as opposed to the rest of Latin America – is that\nBrazilian users have one of the highest rates of adoption of online banking services. According to data from comScore, in 2013\nBrazil was the third Latin American country to use online banking services (measured by percentage of unique visitors in banking\n[sites)[1], but it also has the largest population in the region. Moreover, according to the data shared through social networks and](http://www.comscore.com/Insights/Presentations-and-Whitepapers/2013/2013-Latin-America-Digital-Future-in-Focus)\n[different reports, more than half the users in Brazil made an online banking transaction during 2013[2], as reported by the](http://www.latinpost.com/articles/9959/20140402/online-banking-growing-brazil-more-half-made-digital-transactions.htm)\nBrazilian Federation of Banks FEBRABAN (Federação Brasileira de Bancos).\n\nBy the end of this article, you will understand the use of CPL files as a threat to Brazilian users and the propagation methodology\nchosen by the cybercriminals to this end.\n\n\n-----\n\n### Description of CPL Files\n\nEvery CPL file is a type of dynamic link library, or DLL. DLL files store program code that is ready to be used by other executables –\nit is said that the DLLs export functions that are then imported by any program in the system that calls them.\n\nHowever, the DLLs cannot be executed by themselves. Indeed, when double-clicking a DLL file, the code will not be automatically\nloaded – it needs to be called by another program in order for its code to be run.\n\nHere we need to mention an exception of CPL files, which makes them different from their DLL counterparts – double-clicking on\na CPL file will trigger the automatic execution of the code contained in the file. But how is it possible when a CPL file is in fact a\nDLL file? The answer is that, technically speaking, the code in a CPL file does not have autorun behavior, but when double-clicking\non it, control.exe starts to run, i.e. the Microsoft Windows Control Panel application, and that calls the CPL code.\n\nFor this mechanism to work properly, the CPL file must fulfil some requirements. The main prerequisite is that it contains an\n[export known as CPlApplet. At the same time, this routine must conform to a predefined prototype and structure[3].](http://msdn.microsoft.com/en-us/library/windows/desktop/cc144185%28v=vs.85%29.aspx)\n\n### Structure of the CPlApplet\n\nFor a DLL to be run automatically by the Control Panel, defining a routine called CPlApplet is not enough. The routine also needs\nto match the function prototype as seen in Figure 1 (the programming language is independent of the mechanism: in this\nexample, the language used is Delphi).\n```\n               function CPlApplet(\n                   hwndCPl: Windows.THandle;\n                   uMsg: Windows.DWORD;\n                   lParam1, lParam2: System.Longint\n               ) : System.Longint;\n\n```\n_Figure 1 – CPlApplet prototype in Delphi_\n\nAs can be seen, CPIApplet uses four parameters: hwndCPl is the identifier of the application's main window; uMsg specifies the\nmessage being sent to CPIApplet each time it is called; and both lParam1 and lParam2 are used to send message-specific\ninformation.\n\nFrom all this, we should highlight the importance of messages for the mechanism of CPIApplet. A message is a number that\nidentifies an action to be performed at a particular time. Thus, communication between the Control Panel and the CPL is provided\nby means of successive calls to CPIApplet with different messages. The CPIApplet code must consider the various execution\nscenarios for each possible message. Figure 2 shows an example of a basic implementation of CPlApplet to handle the\n[messages[4][5].](http://users.atw.hu/delphicikk/listaz.php?id=1283&oldal=7)\n```\n function CPlApplet(hwndCPl: Windows.THandle; uMsg: Windows.DWORD; lParam1, \n            lParam2: System.Longint) : System.Longint; stdcall;\n const\n     nonZero := 1;\n     nApplets := 1;\n begin\n     case uMsg of\n        // Initialization. First call, after the CPL is loaded into memory\n        CPL.CPL_INIT:\n            Result := nonZero;\n        // Returns the number of applets contained in the CPL\n        CPL.CPL_GETCOUNT:\n            Result := nApplets;\n\n```\n\n-----\n\n```\n        // Returns info about the applet as specified in lParam1\n        CPL.CPL_INQUIRE:\n            case lParam1 of\n                0:\n                    begin\n                        // Instructions to assign icon,\n                        // name of the applet and info to lParam2\n                        // ...\n                        Result := 0;\n                    end;\n            else\n            end;\n        // Triggers the execution\n        CPL.CPL_DBLCLK:\n            begin\n                // The main functionality of the CPL\n                // is executed here\n                // ...\n                Result := 0;\n            end;\n        // It releases the resources required to execute an applet\n        CPL.CPL_STOP:\n            Result := 0;\n        // Last call, before the CPL is freed from memory\n        CPL.CPL_EXIT:\n            Result := 0;\n     end;\n end;\n\n```\n_Figure 2 – Structure and main messages of CPlApplet_\n\nNow we could ask ourselves, why are CPL files executed by the Control Panel? What is the role of the Control Panel? The answer\nhas to do with the fact that most of the icons or options present in the Windows Control Panel include a physical file with a\n\".cpl\" extension. Consequently, all the CPL files that fit the required structure and are placed within the\n\"%WINDIR%\\System32\" folder will automatically appear in the Control Panel.\n\nNonetheless, it is worth mentioning that cybercriminals do not want their files to be noticed on the system. But this is not a\nproblem, since the CPL files that are not registered in the Control Panel can also be executed. With all this information, we can\nnow imagine why it is so attractive for cybercriminals to use CPL files. The CPIApplet routine is quite simple to implement,\nallowing the malicious code to be included in the corresponding section of the CPL_DBLCLK message.\n\n### Propagation Campaign\n\nTo persuade their victims to execute the malicious CPL files and become infected, cybercriminals send fake emails, which is their\nmain means of propagating the malware. Therefore, they make use of social Engineering techniques to mislead users into\nbelieving that the CPL file attached to the message is a document containing useful information.\n\nEven though the different emails used to propagate malware through CPL files are far-ranging in the topic used and the entities\nthey pretend to come from, below we list the most used types of those bait messages:\n\n  - A document with a quotation, invoice or receipt.\n\n  - A document with information on a debt or a banking situation.\n\n  - Digital payment instruments used in Brazil, such as the Boleto Bancário or the Nota Fiscal Eletrônica.\n\n  - Files passed off as photographs, videos or other kinds of media files.\n\nWe can expect most of the propagated emails to include payment instruments to entice the potential victims to compromise\ntheir machines, since those are the cases where the banking Trojan is most likely to succeed. The emails with presumed media\ncontent are much less prevalent but have also been seen in some cases, so it is worth mentioning them. In Appendix C, you will\n\n\n-----\n\nfind several samples of the emails used for propagation.\n\nHowever, we believe we should briefly explain the document mentioned under the second entry – the Boleto Bancário. This\npayment instrument, digitally issued and supported by a banking institution, contains a bar code and allows anyone to pay a\nreceiving party, usually by printing the document and paying at one of the places specially authorized for that purpose. Likewise,\nthe Brazilian electronic invoice called Nota Fiscal Eletrônica is another digital document that makes it easier to purchase goods\nfrom a supplier, and that relies on the digital signature of the issuer and the receiver and requires validation from a Brazilian\npublic organization.\n\n### Life Cycle of an Attack\n\n**Figure 3 shows the general scheme of an attack using CPL files in Brazil. It all starts with the propagation of the malicious files**\nspread with email messages. The emails contain attached files, or links via which to download files from compromised servers. In\neither of these two cases, the downloaded file has gradually changed as cybercriminals adapted their modus operandi: at first,\nthe CPL file was attached or directly downloaded; then, the CPL was compressed in a \".ZIP\" archive; and finally, the emails had an\nattached HTML file, which was made up of a single line of code with a \"refresh\" element that downloaded the ZIP file to the\n[system – this last technique is detected by ESET as a variant of HTML/Refresh. In any case, the success of the attack relies on the](http://www.virusradar.com/en/HTML_Refresh/detail)\nability to persuade victims to execute the CPL files, by making them believe that they are actually documents or other types of\nlegitimate files.\n\nOnce the CPL is run in the system, it downloads a banking Trojan from a server; the URL is included in the CPL, either as plain text\nor encrypted. When the Trojan is executed, it will first look for a way to make itself persistent in the infected system, and then it\nwill start to gather banking data from the victim. If there are login credentials, screenshots or any other kind of banking\ninformation available, they will be sent to the cybercriminal.\n\n_Figure 3 – Life cycle of an attack using CPL files_\n\n\n-----\n\n### Technical Analysis of Malicious CPL Files\n\nEven though there are some differences among the many files we analyzed, in this section we will describe the general structure\nand the main actions performed by the payload of the most representative files. It is important to mention that almost all of the\nsamples that make up our pool were written in Delphi, with the exception of those with custom-made packers, which were\ndeveloped in languages such as Microsoft Visual C.\n\n### CPlApplet\n\nThis might not be new, but the structure of CPIApplet closely follows what we have described in the previous sections. The code\nis clearly structured in such a way that allows incoming messages to be managed through a big conditional switch construction.\n**Figure 4 shows a CPlApplet snippet.**\n\n_Figure 4 – Reversing CPlApplet_\n\nIf we pay attention to the small graphic in the upper right corner, we will get an overview of CPlApplet. In particular, we can see\nhow the different cases of the conditional switch are next to each other, aligned at the bottom. We know that messages are\nspecified by a number and, based on that number, the CPlApplet routine determines the code to execute. So, the previous figure\nshows the code that handles four of those messages.\n\n\n-----\n\nBased on the above, we see that CPIApplet may receive multiple calls, according to the flow of messages we can find in the life\ncycle of a CPL in memory. This flow of messages is illustrated in Figure 5 (the numbers shown there are the constants defined for\neach message).\n\n_Figure 5 – Flow of calls and messages sent to CPlApplet._\n\nFirst, we see that the CPL Entry Point is in its DllMain routine, which performs generic initialization tasks. As is the case with DLL\nfiles, DllMain is executed in the CPL when the CPL is loaded into memory (after a call to LoadLibrary in shell32.dll), as well as\n[before exiting memory[6]. We might ask ourselves, then, whether malicious code can be dropped into DllMain, an issue that will](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682583%28v=vs.85%29.aspx)\nbe discussed later in this paper.\n\nFollowing initialization, the CPIApplet routine is called successively with the messages seen in the image, in order from top to\nbottom. Although we are not going to provide specific details about each one of the messages, we need to highlight CPL_DBLCLK,\nsince that is the location of the main code to be executed – in our case, the place where we will find the payload of the malicious\nCPL files. If we take a look at Figure 4, we can see that the code that handles each message in fact is calling the same routine,\nwhich determines the actions to be taken. In the case of CPL_DBLCLK, this routine resolves and then calls the routine with the\npayload.\n\n\n-----\n\n### Malicious Payload\n\nThe efforts malware developers have put into the CPL files are concentrated in the code triggered by the CPL_DBLCLK message.\nMany of the analyzed files contain all of their malicious code in this part, making its analysis easier.\n\nSo what is the purpose of this malware? What actions does it perform and what information is it trying to steal? To answer these\nquestions, we can say that a large percentage of the CPL files analyzed in our Lab (the figures are shown in the Statistics section)\nbehave as Trojan Downloaders. These are malicious programs whose sole purpose is to download other malicious files onto an\ninfected system and execute them.\n\nThe structure of the payload that prevails in most of the CPLs analyzed can be described as having the following parts:\n\n    - Initialization.\n    - Construction of URLs and file download.\n    - Execution of downloaded files.\n\n_Figure 6 – Malicious payload snippet with initializations_\n\nAs the inset in Figure 6 shows, the flow of the whole routine is fairly linear, and we can see the initialization actions in particular.\nFirst, a space allocated on the stack is initialized to zero – the different strings used by the CPL will then be stored there.\nAfterwards, the execution does not perform any action (it sleeps) for 30 seconds. At last, it recovers and stores the path to the\n\"%APPDATA%\" folder in the system. It is worth mentioning that not all the analyzed files carry out the same actions: some do not\nsleep for 30 seconds, others retrieve different system folders or perform some other actions; nonetheless, this is the general\nscheme that best fits most of the analyzed cases. Figure 7 shows the next code snippet, where the URLs are defined (either\nencrypted or in plain text) and the files are downloaded.\n\n\n-----\n\n_Figure 7 – Payload snippet with encrypted strings_\n\nOur analysis shows that the payload always calls decipher_str after the appearance of each encrypted string. Then, based on\nthese strings, the download URL is retrieved and the path where the downloaded file will be stored is created. In the example\nshown above, the file to be downloaded – which seems to be an image – is stored in \"%APPDATA%\\Desk.exe\". The\n_download_URL routine is commonplace, based on standard Windows API functions. As for the decryption routine used, we will_\ndescribe it in detail in the next section.\n\nIt is worth noting that not all the analyzed CPL files use encrypted strings; in fact, many of them have strings in plain text. These\nCPL files do not make calls to decipher_str subroutine, as we can see in Figure 8.\n\n\n-----\n\n_Figure 8 – Example of malicious CPL with strings in plain text_\n\nThe last snippet of the malicious payload is the part responsible for executing the downloaded files through ShellExecute, as can\nbe seen in Figure 9. Our analysis shows that the actions performed by these malicious CPLs are simple and effective. The CPL file\ndoes not persist in the system but downloads and runs other threats instead, and intends to go unnoticed. Thus, we will not find\nchanges in the registry nor other indicators telling us that the malicious CPL is present in our system.\n\n_Figure 9 – Execution of the downloaded threats_\n\n\n-----\n\n[Many of the CPL files that we have analyzed are variants of the malware family Win32/TrojanDownloader.Banload[7]. These are](http://virusradar.com/en/Win32_TrojanDownloader.Banload/detail)\nTrojan Downloaders that install banking Trojans. Now, given the relevance of online banking in Brazil, we can understand why\nthe downloaded threats are such.\n\n### String Encryption Algorithm\n\nMost of the encrypted samples use a decryption method that is based on subtractions and XOR operations. The key used to\ndecrypt the strings is hard-coded in the decryption routine itself. The syntax of the encrypted strings and key expressed in EBNF\nnotation is shown below:\n```\n   digit = \"0\" | \"1\" | \"2\" | \"3\" | \"4\" | \"5\" | \"6\" | \"7\" | \"8\" | \"9\" ;\n   hex_alpha = \"A\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" ;\n   alpha = hex_alpha | \"G\" | \"H\" | \"I\" | \"J\" | \"K\" | \"L\" | \"M\" | \"N\" | \"O\" |\n   \"P\" | \"Q\" | \"R\" | \"S\" | \"T\" | \"U\" | \"V\" | \"W\" | \"X\" | \"Y\" | \"Z\" ;\n   hex_pair = (digit | hex_alpha), (digit | hex_alpha)\n   alphanum = digit | alpha\n   cipher_string = hex_pair, hex_pair, {hex_pair}\n   key = alphanum, {alphanum}\n\n```\nOr, as a regular expression:\n```\n   cipher_string = [A-F0-9]{4}([A-F0-9]{2})*\n   key = [A-Z0-9]+\n\n```\nTherefore, we can see that the encrypted strings consist of at least two pairs of hexadecimal characters (in uppercase); anyway,\nthere will always be an even number of characters. The key is composed of at least one alphanumeric character in uppercase.\nWhile we have seen a few cases of keys with other characters (such as the \"@\" or \"!\" symbols), we did not include it in the\nregular expression for simplicity.\n\n**Figure 10 shows an example of the decryption algorithm. In the first step the characters of the encrypted string are taken two at**\na time, while in the case of the key, they are taken singly. This is because those two characters in the encrypted string are taken\nas a two-digit hexadecimal number. Each character in turn in the key also gets its representation in ASCII code, in hexadecimal.\nTherefore, it is possible to perform a XOR operation between the two numbers.\n\n\n-----\n\n_Figure 10 – String decryption algorithm_\n\nYou probably have noticed that Step 1 of the algorithm skips the first pair of characters in the encrypted string and starts with the\nsecond pair. In the second step the preceding pair of characters of the encrypted string is used, subtracting that number from the\nresult obtained in the previous step. At this point, the result of the subtraction is taken as the representation of an ASCII\ncharacter. In our example, the result is the ASCII code for the letter \"h\".\n\nIt is worth noting that, in the event that the subtraction operation result give a negative number (which happens if the minuend is\nless than the subtrahend), the value 0xFF is added to the minuend before the subtraction is made. Figure 11 illustrates how the\nprocess continues for the first 7 characters of the encrypted string.\n\n\n-----\n\n_Figure 11 – Decryption of the first 7 characters of an encrypted string_\n\n**Figure 12 shows the main part of the decryption routine in IDA Pro. It reads and stores the first two characters of the encrypted**\ntext and then begins with the decryption itself. Afterwards, the next couple of characters of the encrypted text (and its\ncorresponding key) are read and the XOR operation is carried out. Then, the SUB operation is done using the pair of characters\nthat had been read at the very beginning and the result is concatenated to the buffer of the decrypted text. Finally, the last step\nis to copy the pair of characters used in the XOR encryption so that they become the second SUB operand in the next iteration. It\nis worth noting that if the key reaches the last character, and there are still characters to decrypt, the key is run one more time\nfrom the beginning. Appendix A shows the implementation of the decryption routine in Python.\n\n\n-----\n\n_Figure 12 – String decryption routine_\n\n\n-----\n\n### Variant with a Dynamically Loaded Key\n\nThe fact that in most cases URLs are in plain text or use a hardcoded key in the decryption routine allowed us to extract URLs\nfrom hundreds of malicious samples automatically, using a custom script. If the URL is in plain text, then you just need to parse\nthe CPL file. On the other hand, if the URL is encrypted, you have to parse the binary to look for encrypted strings and its key, and\nthen apply the decryption routine. Appendix B shows a list of the URLs that have been obtained statically.\n\nSomething that caught our attention was that some files were classified by our scripts as having strings encrypted with the\ndescribed algorithm, but the automatic decryption process was not successful. When trying to find out more about this kind of\nsample, we found that the decryption routine was identical to the one described above, except that the key was not available in\nits static form.\n\nFrom the analysis of these particular samples, we saw that one of the first actions taken by the payload consists of loading the\nkey into memory. To do this, it calls a routine that opens a resource contained in the CPL file. This is completed by a series of calls\nto FindResource, LoadResource, SizeofResource and LockResource, after which a resource of the RT_RCDATA type (raw data) is\nloaded into memory. The name of the resource is random; an example is shown in Figure 13.\n\n_Figure 13 – Binary resource with the decryption key for the strings_\n\nNote that this resource is encrypted, so that certain operations have to be applied to obtain the decryption key.\n\n\n-----\n\n### Code in DllMain and Anti-VM tricks\n\nAs we already mentioned above, since DllMain is executed before CPlApplet: when a CPL is loaded into memory, there is no\nreason why DllMain could not contain malicious code. While the majority of samples do not present any additional type of code\nin DllMain, we have found some cases in which they used detection techniques for virtualized environments. Figure 14 shows the\noverall structure of this detection routine.\n\n_Figure 14 – Detection of virtualized environments_\n\nWe observed checks for three different environments: Wine, VMware, and Virtual PC. If any of these verifications turns out to be\nsuccessful, the save_str routine is called, by means of which a string (indicating the type of virtualization detected) is stored in\na stack variable. Then, when CPlApplet is called for the first time, the value of this variable is checked. If any kind of virtualization\nwas detected, its execution stops right there, without reaching the part of the CPlApplet code for CPL_DBLCLK.\n\n**Figure 15 shows part of the verification code for Wine. The mechanism employed is to check whether GetProcAddress resolves**\n[valid addresses for wine_get_version and wine_nt_to_unix_file_name[8]. Since these two routines do not exist natively in](http://ruminatedrumblings.blogspot.com.ar/2008/04/detecting-virtualized-environment.html)\nntdll.dll, but do in Wine, any address in memory different from zero will indicate that the routines have been implemented, and\ntherefore the execution is not taking place in a native system.\n\n\n-----\n\n_Figure 15 – Verification for Wine_\n\n**Figure 16 shows the technique used for VMware. In this case, the malware writers have used a well-known mechanism –**\nretrieving the VMWare version by communicating with I/O ports. This is possible because VMware monitors and intercepts the\nuse of the \"in\" instruction, an action that is necessary to ensure communication between the virtual machine and its host. In\nparticular, if this instruction is executed with the registers as specified in the image and with the operation code 0x0A in ECX,\n[and the result obtained is the magic value \"VMXh\" in EBX, the application is known to be running in VMware[9].](http://www.symantec.com/avcenter/reference/Virtual_Machine_Threats.pdf)\n\n\n-----\n\n_Figure 16 – Verification for VMware_\n\nFinally, Figure 17 shows the verification process for Virtual PC, where the detection is based on the execution of an undefined\ninstruction. In any environment other than Virtual PC, that instruction will generate an exception. Therefore, in the figure we can\nsee that IDA has interpreted this code for a nonexistent operation as if it were a vpcext instruction, but with other tools – like\n**_OllyDbg –_** [we shall see that those 4 bytes cannot be interpreted as instructions[9]. We can also see that the handling routine for](http://www.symantec.com/avcenter/reference/Virtual_Machine_Threats.pdf)\nthe generated exception is in loc_4ABB76. In short, if the execution of these bytes does not generate an exception that can be\ncaught by the application, then it means we are in a Virtual PC environment.\n\n\n-----\n\n_Figure 17 – Verification for Virtual PC_\n\n\n-----\n\n### Banking Trojans\n\nFor what purpose are CPL files used as downloaders? In theory, the possibilities are limitless and the malicious payload could be\nof any type. However, as shown by the statistics, an overwhelming percentage of these CPL executables installed on systems are\nbanking Trojans.\n\nWhile there is no great similarity among all the bankers downloaded by the CPL files, we have found some characteristics that are\nworth highlighting. Take as an example the banking Trojan whose SHA-1 is\n```\n3C73CA6A3914A6DF29F01A895C4495B19E71A234. The executable is not packed and from the analysis of the strings we\n\n```\nnote the following:\n\n  - Mouse events, and keys and keyboard layouts. Examples: \"[enter]\", \"[esp]\" (spacebar), \"[cima]\" (up arrow), \"[baixo]\" (down).\n\n  - Functions for socket handling.\n\n  - Routines for communication encryption with SSL.\n\n  - Messages in Portuguese related to banking transactions, such as \"Utilize o teclado virtual.\"\n\n  - Different protocols. For example: \"ftpTransfer\", \"mailto:\", \"://\", \"HTTP/1.0 200 OK\".\n\n  - _Username, password._\n\n  - Several strings encrypted with the same algorithm as seen in CPL files. Figure 17 shows this part of the strings.\n\n_Figure 18 – Encrypted strings that are also present in banking Trojans._\n\nThese encrypted strings include:\n\n  - Names of Brazilian banking institutions: Sicredi, Banco Itaú, Santander, Bradesco, bb.com.br (Banco do Brasil), Caixa\nFederal\n\n  - Browsers: Chrome, Opera, Firefox, IE, Safari\n\n  - URLs: “hxxp://www.sonucilaclama.com.tr/plugins/editors-xtd/pagebreak/oi/html/h/lg.php”,\n“hxxp://www.cvicak-polanka.cz/b/notify.php”, “hxxp://64.31.51.19/oi.txt”.\n\n  - More keys such as “[Backspace]”, “[Page Up]” or “[Page Down]”\n\n  - Data files and temporary files\n\n  - User agents\n\n  - Commands such as “cmd /c taskkill /f /im dwm.exe /t”\n\n\n-----\n\nMerely by examining these strings, we immediately get an overall idea about the capabilities of this banking Trojan. Generally\nspeaking, the analyzed bankers include: code injection into specific processes, mainly browsers; replacement of forms in\nbrowsers (by means of images embedded in the banker) and injection of additional fields; keylogging capabilities, as well as\nhooking routines to capture mouse and screen events; and encrypted communications with the server where the stolen\ncredentials are stored. However, bankers are not limited to these possibilities.\n\n### The Reach of CPL Malware in Brazil\n\nIn the previous sections of this article, we have discussed the different techniques and threats used by cybercriminals in Brazil to\nspread CPL files. In this section, we will analyze the evolution over time of the activity involving these kinds of files within the\nregion.\n\nOne of the most important points regarding CPL files is related to the impact and growth they have had in the last few years. In\nChart 1, we can see the increased relevance of CPL malware in the region:\n\n_Chart 1 – Growing number of CPL files_\n\nThe chart above shows the relationship between the types of executables sent by Latin American users to the ESET LATAM Lab\nsince 2009 up to the first months of 2015. When we analyze the relationship between files reported in the region, we notice a\nmajor change. The biggest leap, maybe predicting this trend, is between 2012 and 2013. At the beginning of 2012, only 5% of the\nfiles sent by users to the ESET LATAM Lab corresponded to CPL malware. However, in 2013 this figure increased to 20%,\nquadrupling its number as compared with the previous year.\n\nThe second most important change can be seen throughout 2014 and early 2015, where the percentage of samples the users\nreceived increased by 50%. During the first quarter of 2015, three out of every ten samples that users sent to the ESET LATAM\nLab were CPL files.\n\n\n-----\n\nThe samples sent by users to the Lab also helped us analyze the frequency with which they reached the Lab:\n\n_Chart 2 – Malicious CPL-file reports sent by users_\n\nThe two years that clearly saw more malicious activity were 2013 and 2014, when 90% of the CPL malware samples were\nreported. Although we know that this activity began before 2013, analyzing the users' reports sent to our Lab allows us to assess\nthe moment at which they identified a file as suspicious, regardless of the file extension.\n\n### Detections, Threats and Functions\n\nOut of the more than 1500 samples we took for our analysis, 82% of the detections are variants of\n_Win32/TrojanDownloader.Banload, a malware family that has prevailed for years in Brazil as the main form of malware. Among_\n[the most distinctive characteristics of this family we found, according to the ESET LiveGrid](http://www.virusradar.com/) telemetric data, are that Brazil is the\ncountry they affect most and the difference is significant when compared to the rest of the world:\n\n\n-----\n\n_[Figure 19 – Detections of Win32/TrojanDownloader.Banload](http://virusradar.com/en/Win32_TrojanDownloader.Banload/map/month)_ _in the world._\n\nWhen we compare the data from the rest of the world and list the top ten countries most affected by this family of Trojan\nDownloaders, we find that 76% of the detections in 2014 come from Brazil. This very clearly demonstrates that this malware\nfamily is specifically targeting users in that country – the second place, occupied by Spain, has almost eleven times fewer\ndetections and the gap extends further with other countries like Argentina, Colombia and even Portugal.\n\n_Chart 3 – Countries with the largest number of Win32/TrojanDownloader.Banload detections_\n\n\n-----\n\nAlmost one out of every ten threats detected in Brazil belongs to this family of banking Trojans. The ranking of threats for this\ncountry in March 2015 is as follows:\n\n_Chart 4 – Top 10 threat propagation in Brazil_\n\nAs explained in a previous section, the goal of a Trojan Downloader is to evade system protection and to download another\nthreat from a website in order to install it and execute it. By means of this technique, attackers try to ensure that the real payload\nof the attack will not be detected by security software, and thus it will not reveal its true intentions.\n\n### URLs and Domains\n\nThroughout the multiple campaigns that involved these banking Trojans, we have identified a total of 419 URLs corresponding to\nnearly 300 domains in various countries that hosted the threats to be downloaded.\n\nOf the 298 domains we have seen that propagated different threats from 2013 to early 2015, 76 belonged to compromised\ndomains in Brazil that hosted different threats. Some of the links contained in the executable files were shortened through\nsystems like bit.ly. Based on the information gathered by these systems, it is possible to confirm the number of clicks made by\nusers on these links and the extent of an attack. In contrast, cybercriminals use URL shortening services as part of their Social\nEngineering techniques to hide the real domain users are actually visiting. However, in the cases we will discuss below, the\nshortened URLs were taken from the strings of the malware variants we have analyzed; it is not clear why they used shortened\nURLs in the executable files.\n\nAs an example, if we take one of the links used by cybercriminals at the beginning of 2014 that was spread by shortening its URL,\nwe can see the number of clicks made on the link and throughout its lifetime:\n\n\n-----\n\n_Chart 5 – Clicks on links propagated by making use of URL shorteners_\n\nIn the picture above we can see that the link (hxxps://bitly.com/KZwqH0) was active during the first months of 2014. Moreover,\nthe same data show that the total number of clicks were more than 9500:\n\n_Figure 20 – Detailed number of clicks_\n\nIn total, there were 10 thousand clicks on the link to this threat and, according to the same statistics provided by the website,\n88% of them came from Brazil. This emphasizes that cybercriminals in Brazil are mainly targeting people in the same country,\ndoing so very effectively. In the next table we can see other figures for different shortened links that were also used:\n\n_Table 1 – Details of the links used_\n\nAll shortened links that were found in the Win32/TrojanDownloader.Banload variants have a very high percentage of clicks in\nBrazil, which further clarifies who the intended targets of these threats were.\n\n\n-----\n\n### Packers and Protectors\n\nAnother aspect we can highlight regarding these campaigns is the software cybercriminals used to protect their threats and even\nto avoid detection by security solutions. As expected, the most-widely used protection packer – seen in 27% of the cases – was\nUPX, followed by PECompact with 8%:\n\n_Chart 6 – Malicious-CPL-file packers and protectors_\n\nMoreover, we have seen a number of threats with uncommon or custom protection packers, including URL encryption, as\ndescribed in previous sections. Attackers usually employ these tools to reduce the size of their malware and also to avoid\ndetection.\n\n\n-----\n\n### Detections and Malware Families\n\nThe last point we will discuss in this section has to do with the malware families that predominate in the CPL files sent by users to\nthe ESET LATAM Lab.\n\n82% of the reports corresponded to Win32/TrojanDownloader.Banload variants, whose behavior and activities we have\nanalyzed in this article, detailing some characteristic features noted in the Lab. On the other hand, bearing this trend in mind, the\n[family with the second largest detection number is Win32/Spy.Banker[10]](http://virusradar.com/en/Win32_Spy.Banker/detail) – a malware family that steals information from the\nvictims' computers through various techniques and then sends it to the attackers.\n\nThe distribution of all the malware families with CPL files that we have seen in Latin America is shown below:\n\n_Chart 7 – CPL malware in Latin America_\n\n[Another family we should mention is Win32/Spy.Banbra. Malware from this family has been active in Brazil for years [11]](http://www.virusradar.com/en/Win32_Spy.Banbra/detail) and\nnowadays we still find cases in which cybercriminals are taking advantage of the users' computers to send thousands of spam\nemails to keep on infecting victims. In Brazil, Banbra is one of the families used to that end.\n\nFurthermore, we would like to highlight that we have noticed the growth of another banking Trojan family in Brazil, detected by\nESET as MSIL/TrojanDownloader.Banload. This new generation of bankers is developed in .NET, as opposed to the threats we\nhave discussed here, which were written in Delphi, Visual C++ and/or Visual Basic. Though we will not analyze these Trojans here,\nwe would like to emphasize that in the medium term they could certainly become one of the most important malware families in\nBrazil.\n\n\n-----\n\n### Conclusion\n\nDuring the period in which this research was conducted, we observed how the cybercriminal ecosystem in Brazil differs from the\nrest of the region. The manner in which threats are developed and distributed denotes a greater commitment from\ncybercriminals, who perform their attacks in a customized fashion, by taking into account the different modes of operation in the\nBrazilian electronic banking. As we have seen, this country is one of the top three users of online banking in Latin America, and\nhalf of its social network users made at least one online transaction during 2013. Therefore, we believe this has an impact on\ncybercriminals, who are investing more effort into these attack campaigns.\n\nTo be more specific, in the rest of Latin America we have seen the propagation of different bots, written in various programming\nlanguages and making use of different social engineering techniques. These threats, in most cases, come from different\ncrimepacks, either those whose code has leaked or the ones sold in some underground forums. In Brazil, the threats present a\nmore homogeneous structure. As we have already mentioned in this paper, we can see banking Trojans prevailing over other\nforms of malware in this country.\n\nFrom the analysis of thousands of samples, we were able to find some answers by looking at certain relationships among them.\nThe similarities found not only in the CPL downloaders but also in the banking Trojans are numerous. In the first place, we see\nthat Delphi is the programming language used in almost all of the samples – except those with custom packers written in other\nlanguages, but which still use Delphi in their unpacked code. They also use the same encryption algorithm, which we have not\nseen with any other threat in the region. Finally, we can say that the propagation campaigns used are similar and that they keep\nrecurring.\n\nAll these similarities tell us that these attacks are being carried out by the same cybercriminal group or by many groups that are\nin contact with each other and who share information. These attackers differ from their peers in the region because they do not\nuse generic crimepacks – although the CPL files containing malicious code did not originate in Brazil, we could ascertain that\nmany of the elements present in the current campaign were made in Brazil. Due to the strings in Portuguese present in the\nexecutables, as well as the consistent use of the Delphi language, it is reasonable to believe that quite a lot of local work went\ninto developing the threats, rather than merely adapting those that already exist.\n\nAnother point for consideration has to do with the use of Downloaders. It is very common when detecting binaries of this kind\nnot to raise further questions about them. In this case, by doing so we would miss the opportunity to find a malicious campaign in\nits early stage if we fail to analyze the kinds of threats that are downloaded and executed in a compromised system. It is really\nworthwhile to investigate where these Downloaders go, so we can detect patterns by country or region.\n\nWe can conclude that the CPL files have been recycled by cybercriminals in Brazil and have been the most popular means to\npropagate banking Trojans in the country recently. Although the functionality of these malware families is specific, the study of\npayloads and the changes in technology will lead cybercriminals to use new techniques and technologies to propagate their\nthreats.\n\nHere lies the challenge for security companies – to analyze, study and detect the new threats issued by attackers to compromise\ntheir future victim’s systems’.\n\n\n-----\n\n### References\n\n[[1] 2013-05-29, comScore, 2013 Latin America Digital Future in Focus, http://www.comscore.com/Insights/Presentations-and-](http://www.comscore.com/Insights/Presentations-and-Whitepapers/2013/2013-Latin-America-Digital-Future-in-Focus)\n[Whitepapers/2013/2013-Latin-America-Digital-Future-in-Focus](http://www.comscore.com/Insights/Presentations-and-Whitepapers/2013/2013-Latin-America-Digital-Future-in-Focus)\n\n[2] 2014-04-02, Michael Oleaga, Online Banking Growing in Brazil: More Than Half Made Digital Transactions in 2013,\n[http://www.latinpost.com/articles/9959/20140402/online-banking-growing-brazil-more-half-made-digital-transactions.htm](http://www.latinpost.com/articles/9959/20140402/online-banking-growing-brazil-more-half-made-digital-transactions.htm)\n\n[3] MSDN, Implementing Control Panel Items, http://msdn.microsoft.com/en[us/library/windows/desktop/cc144185%28v=vs.85%29.aspx](http://msdn.microsoft.com/en-us/library/windows/desktop/cc144185%28v=vs.85%29.aspx)\n\n[4] 2004-11-15, Delphi Knowledge Base, How to develop control panel applets,\n[http://users.atw.hu/delphicikk/listaz.php?id=1283&oldal=7](http://users.atw.hu/delphicikk/listaz.php?id=1283&oldal=7)\n\n[[5] 2005-03-03, Alex Gusev, An Ancient Story of Control Panel Applets, http://www.codeguru.com/cpp/w-](http://www.codeguru.com/cpp/w-p/ce/pocketpc/article.php/c9345/An-Ancient-Story-of-Control-Panel-Applets.htm)\n[p/ce/pocketpc/article.php/c9345/An-Ancient-Story-of-Control-Panel-Applets.htm](http://www.codeguru.com/cpp/w-p/ce/pocketpc/article.php/c9345/An-Ancient-Story-of-Control-Panel-Applets.htm)\n\n[[6] MSDN, DllMain entry point, https://msdn.microsoft.com/en-us/library/windows/desktop/ms682583%28v=vs.85%29.aspx](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682583%28v=vs.85%29.aspx)\n\n[[7] ESET Virus Radar, Win32/TrojanDownloader.Banload, http://virusradar.com/en/Win32_TrojanDownloader.Banload/detail](http://virusradar.com/en/Win32_TrojanDownloader.Banload/detail)\n\n[[8] 2008-04-21, Marshall Fryman, Detecting a virtualized environment, http://ruminatedrumblings.blogspot.com/2008/04/detecting-](http://ruminatedrumblings.blogspot.com/2008/04/detecting-virtualized-environment.html)\n[virtualized-environment.html](http://ruminatedrumblings.blogspot.com/2008/04/detecting-virtualized-environment.html)\n\n[[9] Peter Ferrie, Attacks on Virtual Machine Emulators, http://www.symantec.com/avcenter/reference/Virtual_Machine_Threats.pdf](http://www.symantec.com/avcenter/reference/Virtual_Machine_Threats.pdf)\n\n[[10] ESET Virus Radar, Win32/Spy.Banker, http://virusradar.com/en/Win32_Spy.Banker/detail](http://virusradar.com/en/Win32_Spy.Banker/detail)\n\n[[11] 2009-02-20, Sebastián Bortnik, Infección por archivos ¿ejecutables?, http://www.welivesecurity.com/la-es/2009/02/20/infeccion-](http://www.welivesecurity.com/la-es/2009/02/20/infeccion-archivos-no-ejecutables/)\n[archivos-no-ejecutables/](http://www.welivesecurity.com/la-es/2009/02/20/infeccion-archivos-no-ejecutables/)\n\n\n-----\n\n### Appendix A\n\n String Decryption Routine in Python\n```\n   def isHexCapitalized(string):\n       val = True\n       for c in string:\n          char = ord(c)\n          if (char < 48 or char > 57) and (char < 65 or char > 70):\n              val = False\n              break\n       return val\n   def descifrar(key, ciphertext):\n       llave = key\n       cifrada = ciphertext\n       descifrada = ''\n       if not isHexCapitalized(cifrada):\n          return descifrada\n       sub = int(cifrada[:2], 16)\n       cifrada = cifrada[2:]\n       while cifrada != '':\n          xor2 = int(cifrada[:2], 16)\n          xor1 = ord(llave[:1])\n          llave = llave[1:]\n          if llave == '':\n              llave = key\n          char = xor1 ^ xor2\n          if char < sub:\n              char = char + 255\n          char = char - sub\n          if char < 32 and char > 126:\n              descifrada = ''\n              break\n          descifrada = descifrada + chr(char)\n          sub = int(cifrada[:2], 16)\n          cifrada = cifrada[2:]\n       return descifrada\n\n```\n\n-----\n\n### Appendix B\n\n List of URLs Obtained Through Static Analysis\n\n  - hxxp://137.116.185.18/wararbr/wrar32br.zip\n\n  - hxxp://184.173.216.25/~fotosins/Dados/Arquivo_Audio.exe\n\n  - hxxp://184.173.216.28/~fotosint/Comentario/Win2102.exe\n\n  - hxxp://184.173.225.223/~promoc/Flash_Play.exe\n\n  - hxxp://186.202.139.190/ler/bily.mpg?C2C818AEA0D6287d\n\n  - hxxp://186.202.179.110/18-07-homer.exe\n\n  - hxxp://200.206.76.67/ilusiones/linexs/teste.zip\n\n  - hxxp://200.98.200.93/Componente-Certificador.exe\n\n  - hxxp://37.187.65.198/bambam.cpl\n\n  - hxxp://37.187.65.198/Chrome_Update_2014.exe\n\n  - hxxp://50.97.101.7/~subzi845/bck.zip\n\n  - hxxp://65.181.122.39/~facebook/carregandoimagens00112299988mmxcvsVCLJKENAytftfvbwei5463425634363.mp3\n\n  - hxxp://67.23.255.34/~comentar/Face/Facebook_Comentario.exe\n\n  - hxxp://69.162.72.158/img_log.zip\n\n  - hxxp://academiebeaute.hu/img/vanessa.mp3?32984329492365353\n\n  - hxxp://acmeco.com.br/hydraa.mp3\n\n  - hxxp://acompanha-noite.p.ht/notify.php\n\n  - hxxp://adobeboleto.googlecode.com/svn/svrc.exe\n\n  - hxxp://amentoladofreexxxpoly.com/saidas/polys.pac\n\n  - hxxp://anexodocx.zz.vc/image/orasco/vilagepark.rar\n\n  - hxxp://aruralsm.com.br/sysviewer/1.zip\n\n  - hxxp://asiacongress.com/backendz/fckeditor/editor/plugins/tablecommands/mshtasoft.zip\n\n  - hxxp://aslong.googlecode.com/svn/Soft.exe\n\n  - hxxp://autoparts.co.nz/Editor/core/barao01/setup.xml\n\n  - hxxp://babirossi.com.br/musicas/Like.mp3?B174B272B088BD78B2\n\n  - hxxp://bataco.net/shop/cp/001/print.exe\n\n  - hxxp://bellathornebrasil.fanzoom.net/galeria/images/messenger.gif\n\n  - hxxp://besinciyildiz.av.tr/images/resimler/wappbraweb.zip\n\n  - hxxp://bit.ly/15ZkZVq\n\n  - hxxp://bit.ly/19ZHA8D\n\n  - hxxp://bit.ly/1DbPA0z\n\n  - hxxp://bit.ly/KZwqH0\n\n  - hxxp://bitly.com/1bRPamp\n\n  - hxxp://bitly.com/1eC2YQC\n\n  - hxxp://bitly.com/1mzhuM7\n\n  - hxxp://bitly.com/1nbf4cS\n\n  - hxxp://blogconfianca.institucional.ws/smart.exe\n\n  - hxxp://bruslimpo.com.br/images/confi.zip\n\n  - hxxp://bussineysday.com/avisos/verifica.php\n\n  - hxxp://buyersindex.com/images/spacerx.gif\n\n  - hxxp://camoluksu.com/images/tmp.zip\n\n  - hxxp://canoasfacil.com.br/site/libraries/iex.exe\n\n  - hxxp://capricafe.com.au/images/infect.php\n\n  - hxxp://casasbrotinmg.com.br/932849384.zip\n\n  - hxxp://cdl2014.hol.es/12072013.zip\n\n  - hxxp://cdl2014.hol.es/23082013.zip\n\n  - hxxp://cdl2014.hol.es/27082013.jpg\n\n  - hxxp://cdl2015.hol.es/27082013.jpg\n\n  - hxxp://centraldeinformacao.info/13/setup.xml\n\n  - hxxp://centrecomparis.com/images/smile.gif\n\n  - hxxp://churrascodorei.com.br/imagens/cobertura/yvenilper.zip\n\n  - hxxp://cl.ly/2E131q3s2x0i/download/verdinhas.rar\n\n\n-----\n\n- hxxp://clientexclusivo.com/htaccess.cpl\n\n- hxxp://commondatastorage.googleapis.com/loadr%2Fbambam.cpl\n\n- hxxp://commondatastorage.googleapis.com/modulos%2FRetBol.dll\n\n- hxxp://commondatastorage.googleapis.com/private2%2Fchromeld.cpl\n\n- hxxp://cpro20222.publiccloud.com.br/dmswinupdate.dll\n\n- hxxp://cpro20222.publiccloud.com.br/Process_windows_system32DHSDISIFSjs.cpl\n\n- hxxp://dekafotos01.url.ph/index.php\n\n- hxxp://disistemas.com.br/font/win.exe\n\n- hxxp://dl.dropboxusercontent.com/s/2czkzhlyz3tikae/conf.html\n\n- hxxp://dl.dropboxusercontent.com/s/khzzta6vscm46su/dig.html\n\n- hxxp://dowinformativo.net/smal/01/html.zip\n\n- hxxp://dtimbiras.megatronicnet.com/kastplay/messenger1.gif\n\n- hxxp://eiainteriors.com/wp-content/plugins/jetpack/08-07-homer.exe\n\n- hxxp://elblocdecomerc.pimec.org/wp-content/plugins/08-07-homer.exe\n\n- hxxp://empresapeixarialtda.com.br/project/gbweb.zip\n\n- hxxp://enmetec.com.br/protec_resp/catalogos/inclussives/nac_iiiiiimporttttesde/ooorxmens/truuullllles.gif\n\n- hxxp://equiplus.com/autoplaza/img-23.mpg?874623846234\n\n- hxxp://expotrator.com.br/img/glyph/libmysql.jpg\n\n- hxxp://expotrator.com.br/img/icons/tabs/libmysql.gif\n\n- hxxp://farjad.de/templates/beez5/images/2013.cpl\n\n- hxxp://fart.bialystok.pl/images/banners/gbweb.zip\n\n- hxxp://flasheplayer.googlecode.com/svn/Song.exe\n\n- hxxp://flock.com.br/work/imagens/Inject.exe\n\n- hxxp://globovisivelmente.com/mac/mshtasoft.zip\n\n- hxxp://harshwhispers.com/img/dunptty.gif\n\n- hxxp://haspnegocios.com/webmaster/clientarea.pac\n\n- hxxp://integro.com.pl/media/smile.gif\n\n- hxxp://jarga3d.com/Armsvcsy.exe\n\n- hxxp://joseluis008.hospedagemdesites.ws/posto.pdf\n\n- hxxp://keyforbysmartprime.org.uk/02/setup.xml\n\n- hxxp://keyforbysmartprime.org.uk/04/setup.xml\n\n- hxxp://keyforbysmartprime.org.uk/07/setup.xml\n\n- hxxp://keyforbysmartprime.org.uk/10/setup.xml\n\n- hxxp://kitexploit.p.ht/notify.php\n\n- hxxp://klikideas.com/jocostop/modules/mod_breadcrumbs/tmpl/zepequeno.jpg\n\n- hxxp://logoscursos.com.br/img/hp/temp.rar\n\n- hxxp://magdamarconi.com.br/galeria/lorena/g1.gif\n\n- hxxp://mamaocomcacucar12.hol.es/novo/tmp.zip\n\n- hxxp://manoelvoraz.com/waidman/PC_Client1.rar\n\n- hxxp://mardelrosa.com.br/imagens/filme.zip\n\n- hxxp://maxmorto1.com/under/key.jpg\n\n- hxxp://mundogynfesta.com/page3/inf/loja1.html\n\n- hxxp://mundogynfesta.com/page4/copa01.html\n\n- hxxp://newcontoks.1gb.ru/Cont_Mod02/notify.php\n\n- hxxp://noithatliti.com/main/images/smile.gif\n\n- hxxp://noithatliti.com/main/modules/smile.gif\n\n- hxxp://oitv.1gb.ru/nq.jpm\n\n- hxxp://omegahar.com/element/gameover1.dat\n\n- hxxp://painelremoto.url.ph/libmysql.jpg\n\n- hxxp://pfa17.fr/chrrme.exe\n\n- hxxp://pfa17.fr/Java.exe\n\n- hxxp://pfa17.fr/Javar.exe\n\n- hxxp://pfa17.fr/mrs.exe\n\n- hxxp://pfa17.fr/msconfige.exe\n\n- hxxp://pfa17.fr/Mspro.exe\n\n- hxxp://pfa17.fr/mswconfi.exe\n\n- hxxp://pfa17.fr/sony.exe\n\n\n-----\n\n- hxxp://pfa17.fr/Top4.php\n\n- hxxp://ploff.net/wp-content/uploads/gbpsvs2.jpg\n\n- hxxp://portalurate.com/home/media/smile.gif\n\n- hxxp://promocao11.com/neo.jpg\n\n- hxxp://protect.org.br/protect/messenger.gif\n\n- hxxp://protect.org.br/protect/messenger1.gif\n\n- hxxp://protect.org.br/uploads/libmysql.dll\n\n- hxxp://rpwebdesigner.com/~sistemac/2012-01.cpl\n\n- hxxp://saintfiacre.groupe-antilopes.fr/css/fonts/print.exe\n\n- hxxp://server.company.com/scripts/httpsrvr.dll\n\n- hxxp://sixsevengrifes.com.br/snm/copafifa.txt\n\n- hxxp://stelc.net/download/Mendley.mp3\n\n- hxxp://stocco.com.br/admin/css/xquery.rar\n\n- hxxp://stocco.com.br/web/images/zyb_img.zip\n\n- hxxp://stocco.com.br/web/swf/wanil.rar\n\n- hxxp://stocco.com.br/web/wanil.rar\n\n- hxxp://stocco.com.br/web/yshdu_xxaso.zip\n\n- hxxp://sunshinegaragedoors.com/images/banners/images/bckup/bckimg.zip\n\n- hxxp://ta-zikra.com/images/gbweb.zip\n\n- hxxp://tiagopaiva.com/components/com_wrapper/sfognoUU023597320975LIAEUFGAWIU322.2.cpl\n\n- hxxp://topspaintopbrasil.com/caixa/verifica.php\n\n- hxxp://trabalhador.hol.es/fotos.zip\n\n- hxxp://trabalhadores.hol.es/26062013.zip\n\n- hxxp://tributaluci.com.br/vamos005/setup.xml\n\n- hxxp://trishaportbury.com/web/libraries/Xuru.zip\n\n- hxxp://tudobomnavida.com/Limpa.jpg\n\n- hxxp://tudobrasil.freetzi.com/contador.php\n\n- hxxp://uonder.googlecode.com/svn/svrc.exe\n\n- hxxp://vspeletro.com.br/Imagens/28746.mp4\n\n- hxxp://vulcanoempresasv1.hospedagemdesites.ws/java/conte.php\n\n- hxxp://webbrasild.com.br/seguro/diario04.rar\n\n- hxxp://windows2013.googlecode.com/svn/ASCTray.exe\n\n- hxxp://wskop.googlecode.com/svn/Sond.exe\n\n- hxxp://wskop.googlecode.com/svn/Songs.exe\n\n- hxxp://wsolucoes.com/imagens/vpr.mp4?824287642184\n\n- hxxp://www.3dpics.org/media/system/js/email.php\n\n- hxxp://www.4shared.com/download/hMaSoBz9/teste.zip\n\n- hxxp://www.advogadoscaxias.com.br/includes/js/jscalendar-1.0/lang/html/oi/Dlx_x_.png\n\n- hxxp://www.atrevitta.com.br/wp/wp-content/plugins/nextgen-gallery/lib/multisite.dll\n\n- hxxp://www.autokrupobiti.cz/modules/mod_ppc_simple_spotlight/elements/teste.zip\n\n- hxxp://www.brasilmotos.com/imagens/temp.rar\n\n- hxxp://www.calcadoskalliny.com/images/email.php\n\n- hxxp://www.casafavais.com/plugins/system/gbweb.zip\n\n- hxxp://www.cattlognore.com/catalogos/panfletos.pac\n\n- hxxp://www.cidra.com.ar/images/stories/1.pdf\n\n- hxxp://www.cifra.pt/teste/images/email.php\n\n- hxxp://www.clippinglook.com.br/img/icons/DSC00280.jpg\n\n- hxxp://www.confrariademulheresbrasil.com.br/plugins/user/Visualizar.exe\n\n- hxxp://www.contabilidadeattiva.com.br/wsb/w.gif\n\n- hxxp://www.coopibi.coop.br/js/lightbox/contador/scr.php\n\n- hxxp://www.crmpropertiesllc.com/infran.dll\n\n- hxxp://www.cylia.org/theatre/wp-includes/theme-compat/Errorsms.exe\n\n- hxxp://www.entrepreneuressacademy.com/blog/wp-content/plugins/wp-get-post-image/27-07-homer_original.exe\n\n- hxxp://www.eticket.hyrtechsolutions.com/avenger.exe\n\n- hxxp://www.guimaraesvaz.adv.br/img/slides/novo_horizonte/familylek.zip\n\n- hxxp://www.hostingop.kinghost.net/redir_pro.php\n\n- hxxp://www.icpr.ch/images/y2003.jpg\n\n\n-----\n\n  - hxxp://www.isdep.ru/templates/atomic/html/mod_menu/default/default_image.jpg\n\n  - hxxp://www.isdep.ru/templates/atomic/html/mod_menu/default/index2013/default.jpg\n\n  - hxxp://www.kolomonen.net/images/M_images/mail.exe\n\n  - hxxp://www.libanus.com.br/LuaBy/WinscpPor.nil\n\n  - hxxp://www.mac2hand.com/images/images/Mag7.zip\n\n  - hxxp://www.maisgasnasuavida.com.br/joomla/modules/00000/pClient.exe\n\n  - hxxp://www.nfepaulistana.biz/down/logs.exe\n\n  - hxxp://www.novo-site.p.ht/notify.php\n\n  - hxxp://www.pixelsav.com.br/old/apps/jquery_nivo/isertimagem.jpg\n\n  - hxxp://www.questera.com/images/img/smile.gif\n\n  - hxxp://www.questera.com/images/img/smilib.gif\n\n  - hxxp://www.redijr1.esy.es/Sem_Msg_Erro.exe\n\n  - hxxp://www.rjcc.com.br/site/application/modules/eventos/models/evento.dll\n\n  - hxxp://www.rmmrs.org/modules/mod_breadcrumbs/tmpl/libmysql.dll\n\n  - hxxp://www.schwarci.hu/atalanta/mazurekpeter/Joomla/templates/atomic/css/blueprint/plugins/buttons/icons/icon.png\n\n  - hxxp://www.sinfazerj.org.br/cms/skins/images/view_image.dll\n\n  - hxxp://www.ttumdreep.com.br/redir/fotos1/index1.php\n\n  - hxxp://www.varejaotropical.com.br/imagens/DSC00280.jpg\n\n  - hxxp://www.viewerspro.eu/redirs_pro/wrar32pt-br.zip\n\n  - hxxp://www.zugoszel.hu/files/smile.gif\n\n  - hxxp://zugoszel.hu/modules/smile.gif\n\n  - hxxps://dl.dropboxusercontent.com/s/4siuluy2o34q95u/neopzl.jpm\n\n  - hxxps://dl.dropboxusercontent.com/s/dnn2y25jrlzec4t/adober.exe\n\n  - hxxps://dl.dropboxusercontent.com/s/e03z93ard9hbvbz/meu.kmp\n\n  - hxxps://dl.dropboxusercontent.com/s/mqeygm95wr0pwfb/pux.gyn\n\n  - hxxps://dl.dropboxusercontent.com/s/q81bmro0sohas11/LO.jpm\n\n  - hxxps://dl.dropboxusercontent.com/s/qna1sym5exkucxp/bilau.cgc?83274628346\n\n  - hxxps://dl.dropboxusercontent.com/s/sgkwca4mmd4xbq0/837456478.gib?dl=1&token_hash=AAHjSABo4ug0iowbT3NFbK0Rsv\n\n_EncxfMyH6P4mlfzJ3kQ\n\n  - hxxps://docs.google.com/uc?id=0B809n5kKDcs1LUtVSVdnNllCNmM\n\n  - hxxps://docs.google.com/uc?id=0B809n5kKDcs1QjRISXZPUWNYa00\n\n  - hxxps://docs.google.com/uc?id=0BzHgGW5s4IVvVlRfd1d6d080ZW8\n\n  - hxxps://goiania.box.com/shared/static/l83h0c6crd82fvty24cg.nil\n\n  - hxxps://googledrive.com/host/0B2oh2Mq7JN6vbzY2VDJRTGxLNDg/beach.jpg\n\n  - hxxps://googledrive.com/host/0B8kG7jokIe4CTk5HQXU2WGtycHc/beta.jpg\n\n  - hxxps://googledrive.com/host/0B-MDNoRtYCSuNjVCZzl6blJwT00/vj/argentina.jpg\n\n  - hxxps://googledrive.com/host/0BygfTS0NjfziTEY0cUx1OVM5Ykk/litro.jpg\n\n  - hxxps://s3-sa-east-1.amazonaws.com/mats01/kick.rar\n\n### List of Incomplete URLs\n\n  - hxxp://138.91.88.144/000/CPL_qrweiguweuovhweuwehKUGFCYWQKFWQF87923589723587935287932.2\n\n  - hxxp://162.243.142.244/CPL__EARIUGERUGEROUERGBERUGEORU3059723952379057EIWUFHWEIFsdjgwer.2\n\n  - hxxp://177.153.6.67/modulos/\n\n  - hxxp://177.70.107.177/\n\n  - hxxp://178.32.35.134/CPL_asduasidnsajdkui1h298h9sand9as8hd89sadh912.2\n\n  - hxxp://186.202.178.32/002586/\n\n  - hxxp://192.210.195.50/3303/\n\n  - hxxp://198.20.101.77/diega/\n\n  - hxxp://198.23.250.211/1908/\n\n  - hxxp://198.23.250.211/sms/\n\n  - hxxp://200.98.145.220/panysyst/\n\n  - hxxp://200.98.200.194/03873tg8964634/\n\n  - hxxp://200.98.200.194/bxaki/tg0348753/\n\n  - hxxp://216.144.252.28/015/\n\n  - hxxp://37.187.65.198/1/new02948nffdd.2\n\nh //37 187 66 233/CPL dkjk Jd j DIJSDIOAJSD i ji1203123123 2\n\n\n-----\n\n  - hxxp://3eartmoveis.com.br/tmp/\n\n  - hxxp://46.105.17.127/CPL_ausdasduasydiusayd123871283127IOSDHIUAUSDYG.2\n\n  - hxxp://64.31.21.38/mods/\n\n  - hxxp://85.25.213.184/\n\n  - hxxp://asiapointx.com.br/chats/downloads/\n\n  - hxxp://ayurchem.com/23/\n\n  - hxxp://barraone.com.br/wp-content/upgrade/na/\n\n  - hxxp://carregando00.cu.cc/CARREGANDOX\n\n  - hxxp://consorcioeldorado.com.br/images/\n\n  - hxxp://controle2.dynamic-dns.net/\n\n  - hxxp://cpro17738.publiccloud.com.br/190813/ma50/\n\n  - hxxp://cpro19600.publiccloud.com.br/Module/0xh4KiraKlhxQfPq0lKC.LO\n\n  - hxxp://download.modulosweb2014.com.br/015/\n\n  - hxxp://easysign.com.br/novo/\n\n  - hxxp://favela-dafree.info/\n\n  - hxxp://fotos001.zapto.org\n\n  - hxxp://gabinetexpert.com.br/CAV/\n\n  - hxxp://gatol2012.no-ip.org\n\n  - hxxp://gruporainhadassete.hospedagemdesites.ws/assinaturas/\n\n  - hxxp://gruposiepierski.com.br/Nova pasta/conf/\n\n  - hxxp://isionip.com.br/cgf/\n\n  - hxxp://ivrempreiteira.com.br/old/\n\n  - hxxp://maisumavezconta.info/escrita/\n\n  - hxxp://novakl.servemp3.com\n\n  - hxxp://sofhia27022013.servehalflife.com\n\n  - hxxp://transitoaberto.com.br/zip/homernovo/\n\n  - hxxp://transitoaberto.com.br/zip/sumervile/\n\n  - hxxp://videospornocomfamosos.com.br/bic/saveinfect.php?idcli=\n\n  - hxxp://vinhosevinhos.com/bkp/\n\n  - hxxp://wrmarketing.com.br/xcvxcvxcvxcvxcv/\n\n  - hxxp://www.4shared.com/download/6vhuQ0E7ce/\n\n  - hxxp://www.celgogo.com.br/system/\n\n  - hxxp://www.girarrosto.com.br/cgf/\n\n  - hxxp://www.telhanobrers.com.br/uploads/default/files/zip/homer/\n\n  - hxxp://www.telhanobrers.com.br/uploads/default/files/zip/jk/\n\n  - hxxps://nsarquivosold.googlecode.com/svn/\n\n  - hxxps://nsprojet.googlecode.com/svn/\n\n### List of curious URLs \n\n  - hxxps://www.youtube.com/watch?NR=1&v=v_oOp9e_Ofw&feature=endscreen – Music video\n\n  - hxxp://www.devmedia.com.br/delphi-xe2-executando-automaticamente-privilegios-de-administrador/25125#ixzz2URS5ZlSY\n– Delphi tutorial\n\n  - hxxp://1.bp.blogspot.com/-V5oSoHaAwuU/Tk0GSWIQ6fI/AAAAAAAAA0k/7U4X_IWWBL4/s1600/MALANDRO.png – Image of\nTV character\n\n\n-----\n\n### Appendix C\n\n Propagation Emails of Malicious CPL Files\n\n##### Figure C.1 - Propagation email with attachment that leads to a CPL download\n\n\n-----\n\n##### Figure C.2 - Propagation email with link to download a ZIP file\n\n\n-----\n\n##### Figure C.3 – Propagation email with link to download a CPL file\n\n\n-----\n\n##### Figure C.4 – Propagation email with fake analysis from an antivirus product.\n\n\n-----\n\n##### Figure C.5 - Another propagation email\n\n\n-----\n\n##### Figure C.6 - Another propagation email\n\n\n-----\n\n##### Figure C.7 – Another propagation email\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2015/05/CPL-Malware-in-Brasil-zx02m.pdf"
    ],
    "report_names": [
        "CPL-Malware-in-Brasil-zx02m.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1430821412,
    "ts_modification_date": 1430821412,
    "files": {
        "pdf": "https://archive.orkl.eu/acaa2b2f8b267a32b568a2a36141c17bcd4045ad.pdf",
        "text": "https://archive.orkl.eu/acaa2b2f8b267a32b568a2a36141c17bcd4045ad.txt",
        "img": "https://archive.orkl.eu/acaa2b2f8b267a32b568a2a36141c17bcd4045ad.jpg"
    }
}