{
    "id": "6eb9afe2-3b3a-44ab-8928-725cea74d9bb",
    "created_at": "2023-01-12T14:58:48.703066Z",
    "updated_at": "2025-03-27T02:16:26.121181Z",
    "deleted_at": null,
    "sha1_hash": "8ea7512fbe7bd8d83f38f2e89492f6a6171a447c",
    "title": "2021-04-29 - The Story of FakeChat",
    "authors": "",
    "file_creation_date": "2022-05-29T01:18:53Z",
    "file_modification_date": "2022-05-29T01:18:53Z",
    "file_size": 3820476,
    "plain_text": "# The Story of a FakeChat\n\n**[securityintelligence.com/posts/story-of-fakechat-malware/](https://securityintelligence.com/posts/story-of-fakechat-malware/)**\n\n[Intelligence & Analytics April 29, 2021](https://securityintelligence.com/category/topics/security-intelligence-analytics/)\nBy [Ben Wagner 11 min read](https://securityintelligence.com/author/ben-wagner/)\nStarting late December 2020, IBM Trusteer’s mobile threat research lab discovered and\nbegan closely tracking a new Android banking malware that appeared to be mostly targeting\nusers in Spain. Per our analysis, the purpose of the malware is to steal credit card numbers,\n\n\n-----\n\nbank account credentials and other private information from its victims. Once a user is\ninfected, FakeChat operators can steal all the necessary data to successfully defraud the\nuser. IBM Trusteer customers received an early release of this report.\n\nThe code underpinning this new malware, which we dubbed FakeChat, does not rely on\npreviously released malware. It was written from scratch, and its authors appear to be part of\na well-established cyber crime group that probably migrated from distributing other financial\nmalware. Through the first quarter of 2021, as the malware began spreading more\naggressively, we noticed that other research teams also found and named it. Most notably, it\n[was blogged about as Cabassous and](https://as.com/meristation/2021/03/09/betech/1615321141_081119.html) [FluBot.](https://medium.com/csis-techblog/the-brief-glory-of-cabassous-flubot-a-private-android-banking-botnet-bc2ed7917027)\n\nThe group behind this new financial malware appears sophisticated. In addition to having the\ntechnical skills required to write malware for Android-based devices, they also have access\nto malware distribution channels in the targeted countries. In fact, this malware has been\ngrowing faster, in terms of infection numbers, than any other financial mobile malware that\nour lab analyzed in the past five years. In addition to having extremely successful malware\ndistribution channels, FakeChat operators have also tried to create a robust server-side\ninfrastructure by using a domain generation algorithm (DGA) to create new command and\ncontrol (C2) domains.\n\nReady for action from the very first FakeChat campaign we identified, the group worked to\nkeep the malware stealthy and ride the rising tides of online shopping that have been\n[booming during the COVID-19 pandemic. The first campaign we discovered distributed the](https://securityintelligence.com/articles/why-e-commerce-security-matters-now-more-than-ever/)\nmalware under the guise of an application named Correos, the state-owned company\n[responsible for providing postal service in Spain. It then tried to impersonate other apps,](https://en.wikipedia.org/wiki/Correos)\nsuch as DHL, FedEx and MRW in delivery-themed campaigns. Behind the branding, almost\nall infection package names use the Android package (APK) name that WeChat employs\n(com.tencent.mm or com.tencent.mobileqq), which is what made our team call this malware\nFakeChat.\n\nDuring our research, we were able to obtain both development and production versions of\nthe malware’s code, which enabled us to gain deeper insights into FakeChat’s operation and\ngenealogy.\n\n## FakeChat’s Infection Tactic\n\n[Most FakeChat victims are infected by a SMiShing campaign in which a phishing short](https://securityintelligence.com/articles/what-you-need-to-know-about-scam-text-messages-in-2020/)\nmessage service (SMS) text leads the victim to a hacked website or other infection zone,\nwhich presents a social engineering page. The page asks the victim to download an\napplication they supposedly need in order to track/receive their package, concealing the\nFakeChat infection package. After the victim clicks the download button, the malware is\ndownloaded to the device.\n\n\n-----\n\n_Figure 1: Instructions in Spanish on how to turn on Android’s ‘install from unknown’ feature,_\n_so that malware can be installed from any source_\n\n## Infection Campaign Stats\n\nIBM Trusteer researchers monitored FakeChat infection campaigns, all of which used postal\nservices or delivery as their main lure. Starting with the successful Correros-themed\ncampaign, the second campaign to occur was a smaller DHL-themed campaign. The third\ncampaign, FedEx, was the largest we have observed to date. The fourth and most recent\nfeatured MRW as the lure.\n\n_Figure 2: FakeChat campaign peaks between Dec.17-20 and April 5-21 in Spain indicating_\n_infections per million end-users (Source: IBM Trusteer)_\n\n\n-----\n\n_Figure 3: FakeChat campaign sizes in Spain Q1 2021 (Source: IBM Trusteer)_\n\n## FakeChat vs. Other Financial Android Malware in Spain\n\n_Figure 4: Financial malware campaigns targeting Spain in Q1 2021 (Source: IBM Trusteer)_\n\n## Accessibility Privilege Requested\n\nAfter the malware installs, the victim sees one of the following accessibility request screens\n(depending on the campaign) requesting them to grant accessibility privileges to the malware\napp.\n\n\n-----\n\n-----\n\n-----\n\n_Figure 5: FakeChat requires the victim to approve accessibility privileges on the device_\n\n## Automatically Grant Permissions With Accessibility Service\n\nAfter the victim grants accessibility privileges to the malware, FakeChat grants itself all the\nother permissions it needs to conduct malicious activity without the victim’s knowledge and\nwithout the victim needing to accept further permission requests.\n\n_Figure 6: FakeChat permissions_\n\nIf the malware is installed on a device with Android 10 or earlier, it hides its icon for stealth.\n\nAnother stealth method that was found in the malware is the ability to disable Play Protect\nand prevent uninstallation by the device’s owner.\n\n## FakeChat Set as Default SMS App\n\n\n-----\n\nAfter it is granted accessibility privileges by the victim, FakeChat also sets itself as the\ndefault SMS app, which enables it to hijack incoming SMS messages and forward them to\nthe attacker. In cases where an additional authentication or authorization code is required for\nthe attackers to finalize fraudulent activity and where the code is sent via SMS, the malware\ncan steal it from the infected device.\n\nBy grabbing the SMS code, FakeChat can compromise SMS-based two-factor\nauthentication. In addition, FakeChat can mute all SMS notifications to keep the victims\nunaware of the fraudulent activity taking place in their account.\n\n## FakeChat’s Fraud Method\n\nFakeChat is part of the overlay malware category. It aims to phish user credentials by\npresenting a fake overlay login screen on top of the legitimate app to trick the user into\nsubmitting their password on the wrong activity screen.\n\nTo know when a victim opens a targeted app, FakeChat keeps tabs on the user’s activities.\nThroughout its ongoing operations, FakeChat checks for installed applications and\ndynamically fetches a matching HTML overlay from its C2 server. It constantly monitors for\nthe launch of targeted banking applications on the infected device.\n\nFakeChat fetches the overlay screen in real time. To get the right overlay screen from the\nC2, the malware first sends a list of all applications installed on the victim’s device. The C2\nreplies with a list of applications for which it has a match. The malware retrieves the\nmatching HTML overlay for each ‘injectable’ application from the C2 and presents it to the\nuser once the targeted application is launched.\n\nThe overlay screen, hiding the original login page from the legitimate app, typically requests\nthe victim’s online banking credentials, credit card details or login details for other targeted\naccounts. The malware overlay closely resembles the legitimate application’s look and feel,\nmaking it less likely a user would suspect it. Once the malware app receives the user’s\ncredentials, it sends the details to the C2 server.\n\n\n-----\n\n-----\n\n_Figure 7: FakeChat phishing asking for payment card details_\n\n_Figure 8: FakeChat phishing asking for mobile banking credentials_\n\n## FakeChat’s C2 Commands\n\nOnce it is up and running on infected devices, FakeChat can handle various commands from\nthe attacker’s server. These commands allow the malware to run its operations, interact with\nthe device, run additional files and install apps, grab SMS content and exfiltrate data.\n\nA more complete list of commands appears below:\n\n0 – GET_CONTACTS — Upload all contacts to the C2.\n1 – SMS_INT_TOGGLE — If the SMS_INT_TOGGLE flag is turned on it sends every\nSMS to the C2.\n2 – NOTIF_INT_TOGGLE — If the NOTIF_INT_TOGGLE flag is turned on it sends\nevery notification to the C2.\n3 – OPEN_URL — Open an arbitrary URL with WebView.\n4 – DISABLE_PLAY_PROTECT — Disable Play Protect to prevent malware scanning\non the device.\n\n\n-----\n\n5 – CARD_BLOCK — Start the overlay card activity. (Figure 7.)\n6 – SEND_SMS — Send an arbitrary SMS from the victim’s device.\n7 – RELOAD_INJECTS — If the C2 got new overlays to a new bank it can update all\nthe overlays in the malware.\n8 – RETRY_INJECT — Clear flag value saved in shared preferences. Can be used to\nrequest to show card activity overlay again.\n9 – RUN_USSD—- Execute a USSD command by performing a call.\n10 – UNINSTALL_APP — Uninstall an arbitrary application.\n11 – BLOCK — Hide all notifications shown to the user.\n12 – SOCKS — Transform the infected device to a SOCKS proxy server.\n13 – UPLOAD_SMS — Upload all SMS from the device to the C2.\n\n## Command Evolution per FakeChat Bot Version\n\nIBM Trusteer researchers studied the progression and capabilities of FakeChat for each bot\nversion and compared it to the previous ones. The following table presents the features\nadded to FakeChat over time.\n\n_Table 1: FakeChat bot command evolution_\n\n## FakeChat’s Notable Malware Features\n\n**Bot Configuration and Versioning**\n\nAfter unpacking and string de-obfuscation, FakeChat’s malware configuration is saved\nalongside other data in a ProgConfig class. We can see the bot version, partial server path,\nshared preference keys, RSA key, FakeChat commands and some permissions all in the\nsame place.\n\n\n-----\n\n_Figure 9: Bot configuration_\n\n**Use of DGA to Communicate with C2**\n\nThe malware uses a DGA to generate new domain names for the C2 server. The domains\nare not fully random and are determined by a seed that is generated based on current year\nand month parameters. The code for the current DGA yields 5,000 new domains (versus\n2,000 in older versions) every month.\n\nIn earlier releases of FakeChat’s code version 3.4, the malware serially tried to communicate\nwith those pre-generated C2 domains. Our assumption is that due to security researchers\ndiscovering the method, the malware authors have decided to harden their infrastructure\nagainst sinkholing by attempting to communicate with the C2 domains in a random order\n(and also generate 5,000 domains instead of 2,000).\n\n\n-----\n\n_Figure 10: FakeChat’s DGA in version 3.8_\n\n_Figure 11: FakeChat’s DGA — Seed generation code_\n\n## FakeChat’s Impending Key Logger Capabilities\n\nIn more recent versions of FakeChat, the authors started to develop a new capability to steal\nuser credentials from other apps on the device. This capability is still not fully fleshed out. For\nnow, the malware abuses the accessibility privileges to grab text from different applications.\n\nWe believe that developing keylogging capabilities is evidence that the authors intend to\nkeep evolving the malware’s data exfiltration ability and that they may be searching for new\nways to steal bank credentials from the victim, even without having overlays for all banks and\nservices that users may enjoy on their smartphones.\n\n\n-----\n\n_Figure 12: Get front app text in MyAccessibility class_\n\n## OpSec: String Obfuscation and Packer Rotation\n\nMalware authors often attempt to hinder the efforts of outsiders to reverse-engineer their\ncode. FakeChat does not feature much in that area. It does use publicly available string\n[obfuscation, the Paranoid Gradle plugin (see Paranoid), to obfuscate strings in the APK. It](https://github.com/MichaelRocks/paranoid)\nalso uses different packers for different bot versions.\n\n## Bot Error Monitoring and Exception Handling\n\nMalware authors can monitor every crash that the malware has in order to improve the bot.\nEvery exception is sent automatically to the C2 server.\n\n_Figure 13: MyExceptionHandler class_\n\n## REQUEST_IGNORE_BATTERY_OPTIMIZATIONS\n\nStarting in Android 6, the operating system preserves battery life by limiting apps that can\nwork in the background. FakeChat abuses accessibility privileges to grant itself with\nREQUEST_IGNORE_BATTERY_OPTIMIZATIONS to keep the device alive even when the\nvictim is not actively using it.\n\n\n-----\n\n_Figure 14: FakeChat bypass of automatic battery optimization_\n\n## Blocking the Uninstall\n\nAny active window that includes the text FluBot and is not Play Protect is minimized by the\nmalware to prevent the user from uninstalling the malware.\n\n_Figure 15: FakeChat hides uninstall option from the user_\n\nA community tool that can remove the FakeChat app from infected devices is the application\n[malninstall. To that effect, FakeChat’s authors left the following message in Russian for those](https://github.com/linuxct/malninstall/releases/tag/202103272)\nwho wrote the removal tool.\n\n_Figure 16: Translates to “Keep another $25, boy :))”_\n\n## Do Not Operate on Post-Soviet Block Phones\n\n\n-----\n\nFakeChat is programmed to halt any malicious activity on devices that use the following\nlanguages: Belarusian, Armenian, Kazakh, Kirghiz, Romanian, Moldavian, Russian, Tajik,\nUkraine and Uzbekistani. When malware authors specify this sort of avoidance, it is typically\nindicative they are potentially located in these regions and would rather avoid local victims to\nprevent issues with local law enforcement.\n\n_Figure 17: FakeChat instruction to terminate when language code matches specific settings_\n\n## The End of FakeChat?\n\nOn March 5, 2021, some of the FakeChat local operators in Spain were arrested, hinting at\nthe possible end of the app’s development and spreading efforts.\n\n\n-----\n\n_[Figure 18: Notice quoting Catalonian police (obtained via Twitter)](https://twitter.com/mossos/status/1367797770522943489)_\n\nHowever, our telemetry continues to monitor this malware more than a month past the arrest,\nand it is apparent that FakeChat’s operation took a hit but has kept on going.\n\nIn early April, Trusteer researchers did detect new versions of the FakeChat spreading\noutside of Spain and infecting users in Poland, Germany and Hungary, to name a few\ncountries. We believe this malware will continue to evolve and spread further in the wild in\nthe second quarter of 2021.\n\n## Mapping to MITRE Mobile Attack Techniques\n\nID Name Use\n\n[T1432](https://attack.mitre.org/techniques/T1432) [Access Contact List](https://attack.mitre.org/techniques/T1432) FakeChat can obtain the device’s contact list\n\n\n[T1418](https://attack.mitre.org/techniques/T1418) Application\nDiscovery\n\n[T1412](https://attack.mitre.org/techniques/T1412) Capture SMS\nMessages\n\n\nFakeChat can obtain a list of installed applications\n\nFakeChat can collect SMS messages from a device\n\n\n[T1516](https://attack.mitre.org/techniques/T1516) [Input Injection](https://attack.mitre.org/techniques/T1516) FakeChat can inject input to grant itself extra permissions\nwithout user interaction and to prevent application removal\n\n\n-----\n\nID Name Use\n\n[T1411](https://attack.mitre.org/techniques/T1411) [Input Prompt](https://attack.mitre.org/techniques/T1411) FakeChat can generate fake notifications and launch\noverlay attacks against attacker-specified applications\n\n\n[T1478](https://attack.mitre.org/techniques/T1478) Install Insecure or\n[Malicious](https://attack.mitre.org/techniques/T1478)\nConfiguration\n\n[T1444](https://attack.mitre.org/techniques/T1444) Masquerade as\n[Legitimate](https://attack.mitre.org/techniques/T1444)\nApplication\n\n[T1406](https://attack.mitre.org/techniques/T1406) Obfuscated Files or\nInformation\n\n\nFakeChat disables Google Play Protect to prevent its\ndiscovery and deletion in the future\n\nFakeChat can pretend to be a post-service application\n\nFakeChat uses standard payload and string obfuscation\ntechniques\n\n\n[T1582](https://attack.mitre.org/techniques/T1582) [SMS Control](https://attack.mitre.org/techniques/T1582) FakeChat can send SMS messages from a device\n\n\n[T1437](https://attack.mitre.org/techniques/T1437) Standard\n[Application Layer](https://attack.mitre.org/techniques/T1437)\nProtocol\n\n[T1508](https://attack.mitre.org/techniques/T1508) Suppress\nApplication Icon\n\n[T1426](https://attack.mitre.org/techniques/T1426) System Information\nDiscovery\n\n[T1576](https://attack.mitre.org/techniques/T1576) Uninstall Malicious\nApplication\n\n\nFakeChat communicates with the C2 server using HTTP\n\nFakeChat hides its icon from the application drawer after\nbeing launched for the first time;\n(only for Android OS version<10)\n\nFakeChat can collect device information, such as the\ndefault SMS app and device locale\n\nFakeChat can uninstall itself from a device on command\n\n\n_Figure 19: FakeChat fraud-facilitating features_\n\n## IOCs\n\n**List of Related Package Names**\n\ncom.tencent.mm\ncom.tencent.mobileqq\ncom.example.myapplicationtest — developer versions\ncom.tencent.mn\ncom.eg.android.AlipayGphone\ncom.article.andreport\ncom.candy.sagagames\ncom.cany.withspice\ncom.chinamarkets.android\ncom.multiple.objectives\n\n\n-----\n\ncom.plasma.liquid\ncom.redtube.music\ncom.resouce.cloud\ncom.black.andwhite\ncom.flights.bookings\ncom.marriot.hotel\nnarrow.universe.attract\nsix.wonder.word\nstadium.network.purpose\ncom.serverless.ec\ncom.clubbing.photos\nthank.favorite.future\ncom.got.games\ncom.sugar.browns\ncom.purple.cream\ncom.invite.qq\ncom.pulse.operate\ncom.velocity.speed\n\n## SHA-256 Samples From This Research\n\n9d8b294cacbe9d5303585833b20860eb8da7095c5711c30293a3f56bbf6a9386\n\nversion 3.8\n\n139fca7c979e272ff720feffcaf686aeb1dd25a6347d34bbaa443031982d5f3e\n\nversion 3.7\n\n4d22c11a05db23129ec2e1b6929d1c8618a790c9feb210ba66c37a3e0cf93cdb\n\nversion 3.6\n\nc9ab1bce68498551a78c4c28cbbc36e4a827d81a51090d6ed4a5b9ca1fdfb698\n\nversion 3.4\n\n30937927e8891f8c0fd2c7b6be5fbc5a05011c34a7375e91aad384b82b9e6a67\n\nversion 3.1\n\n54ac754d804ae252f97f27944866702586ffc72c9411dcd1ed55dcd89072c1f6\n\nversion 2.9\n\n318e4d4421ce1470da7a23ece3db5e6e4fe9532e07751fc20b1e35d7d7a88ec7\n\n\n-----\n\nversion 2.2\n\nff3a604c3ae0df4a1826a75464974a57924d557b5d730d824d55d10e65f89271\n\nversion 2.1\n\ncf68a3c0435ba659a3800ca0a95e7b73b7aca8a897947a7ac2b9e9a5a3428417\n\nversion 1.7\n\n133e0d4ed98d998b999a0413c10ec408ebeca2c82121683dfb6ccb4d2bd42ece\n\nversion 1.3\n\n## Dev Versions\n\n7714a16a7092e8826134045d9c2dbe6e692dee660d637bd75881ed8e28149e44\n\nversion 3.0\n\nc322a23ff73d843a725174ad064c53c6d053b6788c8f441bbd42033f8bb9290c\n\nversion 1.2\n\n7bd47e6d52c04adf79255a792008038198196b2dc844b0859c1c8863b0a3ba7c\n\nversion 1.0\n\n7578fcde78444537997eaee398ea6df119cb80da3b72337192373325538b40d2\n\nversion 0.9\n\nc31c2c2d8749829380ec02afa133ec10a02bbf528e960c6ab944ec945135d7ed\n\nversion 0.7\n\ndf5735c6d78b33be53865ab324f3f7ea56622fb1766c590e812534a69cd2e99b\n\nversion 0.6\n\nd3af7d46d491ae625f66451258def5548ee2232d116f77757434dd41f28bac69\n\nversion 0.5\n\n9d5295c0f36fac45ecda49b6e4baab4ed1dcddcc3655519d07c4c1f2663f9441\n\nversion 0.4\n\ned7093465f195ab34de246c83ff772aefbe173a335aab0b13b6b03780594fb24\n\n\n-----\n\nversion 0.3\n\n496df860522dea6be1268517a3f30d24b6e8e6195cc3c2b49e82ab6c7b31c24e\n\nversion 0.2\n\n5e0311fb1d8dda6b5da28fa3348f108ffa403f3a3cf5a28fc38b12f3cab680a0\n\nversion 0.1\n\n[Ben Wagner](https://securityintelligence.com/author/ben-wagner/)\nMobile Security Researcher, IBM Security\n\nBen Wagner is a contributor for SecurityIntelligence.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - The Story of FakeChat.pdf"
    ],
    "report_names": [
        "2021-04-29 - The Story of FakeChat.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535528,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653787133,
    "ts_modification_date": 1653787133,
    "files": {
        "pdf": "https://archive.orkl.eu/8ea7512fbe7bd8d83f38f2e89492f6a6171a447c.pdf",
        "text": "https://archive.orkl.eu/8ea7512fbe7bd8d83f38f2e89492f6a6171a447c.txt",
        "img": "https://archive.orkl.eu/8ea7512fbe7bd8d83f38f2e89492f6a6171a447c.jpg"
    }
}