{
    "id": "6ecc5923-4a0a-40cb-912b-31786fa2cf28",
    "created_at": "2023-01-12T15:08:54.837497Z",
    "updated_at": "2025-03-27T02:05:59.474852Z",
    "deleted_at": null,
    "sha1_hash": "f66c0ea2bdb64249ddeda692f8b0fb33bdd00570",
    "title": "2020-10-15 - That was quick Trickbot is back after disruption attempts",
    "authors": "",
    "file_creation_date": "2022-05-25T12:13:00Z",
    "file_modification_date": "2022-05-25T12:13:00Z",
    "file_size": 61503,
    "plain_text": "# That was quick: Trickbot is back after disruption attempts\n\n**[intel471.com/blog/trickbot-online-emotet-microsoft-cyber-command-disruption-attempts](https://intel471.com/blog/trickbot-online-emotet-microsoft-cyber-command-disruption-attempts)**\n\nOct 15, 2020\n\nThe Trickbot botnet looks to be working once again, despite separate efforts in the past few\nweeks aimed at disrupting its operation.\n\nOn October 14, 2020, the Emotet spam botnet — which is often the precursor to TrickBot\nbeing loaded onto a system — began receiving spam templates intended for mass\ndistribution. These spam templates contained a Microsoft Word document attachment with\nmalicious macros that fetch and load a copy of Emotet onto the victim machine. The Emotet\nbots reached out to their controllers and received commands to download and execute\nTrickbot on victim machines.\n\nThe Trickbot group tag that Intel 471 identified is tied to a typical infection campaign that\ninformation security researchers have been observing for the past 6 months or more.\n\nAdditionally Intel 471 researchers saw an update to the Trickbot plugin server configuration\nfile. Fifteen server addresses were added, and two old servers were retained in the\nconfiguration, along with the server’s .onion address. This was likely done as a fix that would\nhelp operators maintain that their infrastructure remains operational.\n\nThe fix is another round in the back-and-forth between Trickbot’s operators and the separate\nparties that have attempted to disrupt the botnet’s actions. On Oct. 10, 2020, the Washington\nPost [reported that “four U.S. officials” claimed U.S. Cyber Command was conducting an](https://www.washingtonpost.com/national-security/cyber-command-trickbot-disrupt/2020/10/09/19587aae-0a32-11eb-a166-dc429b380d10_story.html)\n[operation to disrupt Trickbot. This action, first reported by Brian Krebs on Oct. 2, 2020, was](https://krebsonsecurity.com/2020/10/attacks-aimed-at-disrupting-the-trickbot-botnet/)\nidentified by Intel 471’s Malware Intelligence systems on Sept. 22, 2020.\n\n[Additionally, Microsoft issued a public statement on Oct. 12, 2020 that it had taken legal](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)\naction to “combat ransomware ahead of U.S. elections.” The legal action involved Microsoft\nattempting to disrupt a number of Trickbot command and control server IP addresses that\nare in the United States.\n\nThe fact that Trickbot has resumed normal operations despite the best efforts of U.S. Cyber\nCommand and Microsoft shows how resilient of an operation Trickbot is and how much more\neffort is needed to fully take the botnet offline for good. The botnet’s operators have all the IT\nsupport of legitimate enterprises — continuity planning, backups, automated deployment,\nand a dedicated workforce — that allow them to quickly react to disruptive measures.\n\n“About 10 years ago it was much easier to completely take over or significantly disrupt a\nbotnet, but cybercriminals are students of takedowns and have learned to make their\noperations more resilient to takedown efforts,” said Intel 471 COO Jason Passwaters. “That's\n\n\n-----\n\nwhy every takedown attempt has some potential of giving ground to the adversary. You re\nteaching them where the weaknesses in their armor are and they have a team of developers\nready to act on that information. So unless you strike a killing blow, you're not going to\nimpact them long term.”\n\nWhile the actions taken this past week let Trickbot’s operators know they are not operating\nfree of consequence, an multi-pronged effort needs to be made if the botnet is to be fully\nknocked offline:\n\nLaw enforcement efforts should be multinational and focus on arresting the core\noperators of the botnet.\nAny further efforts to disrupt infrastructure should focus on the main infrastructure,\nnot just that of countries where a court order is needed.\nGovernments and companies should work together on mass “de-infection” campaigns,\n[similar to those used to eliminate the Bredolab botnet in 2010 and Retadup botnet in](https://www.zdnet.com/article/dutch-police-take-down-bredolab-botnet/)\n2019.\n\nWhether this is a realistic endeavor in today’s world is another question altogether.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-15 - That was quick Trickbot is back after disruption attempts.pdf"
    ],
    "report_names": [
        "2020-10-15 - That was quick Trickbot is back after disruption attempts.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536134,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653480780,
    "ts_modification_date": 1653480780,
    "files": {
        "pdf": "https://archive.orkl.eu/f66c0ea2bdb64249ddeda692f8b0fb33bdd00570.pdf",
        "text": "https://archive.orkl.eu/f66c0ea2bdb64249ddeda692f8b0fb33bdd00570.txt",
        "img": "https://archive.orkl.eu/f66c0ea2bdb64249ddeda692f8b0fb33bdd00570.jpg"
    }
}