{
    "id": "6f0724b5-02f0-4cd3-884c-35b1008ad6de",
    "created_at": "2023-01-12T15:07:53.242704Z",
    "updated_at": "2025-03-27T02:06:04.268087Z",
    "deleted_at": null,
    "sha1_hash": "b0a9b96792226abab3f924f9cd37b4434a4618c0",
    "title": "2021-09-23 - RTL was victim ransomware attack, cyber criminals make 8500 euro loot",
    "authors": "",
    "file_creation_date": "2022-05-28T16:57:48Z",
    "file_modification_date": "2022-05-28T16:57:48Z",
    "file_size": 496818,
    "plain_text": "# RTL was slachtoffer ransomware-aanval, cybercriminelen maken 8500 euro buit\n\n**[rtlnieuws.nl/nieuws/nederland/artikel/5255983/rtl-nederland-ransomware-aanval-cybercriminelen-losgeld](https://www.rtlnieuws.nl/nieuws/nederland/artikel/5255983/rtl-nederland-ransomware-aanval-cybercriminelen-losgeld)**\n\nSeptember 23, 2021\n\nBestanden versleuteld\n23 september 2021 16:49 Aangepast: 23 september 2021 18:56\n\nHet kantoor van RTL in Hilversum. Beeld © ANP\n\nRTL Nederland is slachtoffer geworden van een ransomware-aanval. De cybercriminelen zijn\nde afgelopen tijd uit het netwerk gehaald en computers hersteld. RTL heeft uiteindelijk 8500\neuro aan de aanvallers betaald.\n\nOp donderdag 9 september ontdekte RTL een digitale aanval op zijn netwerk. Het bleek om\nransomware te gaan: een aantal computers, servers en systemen binnen het Hilversumse\nkantoor van RTL werd gegijzeld door cybercriminelen en deels ontoegankelijk gemaakt.\n\n## Bestanden werden versleuteld\n\nDe aanvallers hebben toegang tot het netwerk van RTL gekregen doordat de inloggegevens\nvan een medewerker van een externe beheerpartij zijn buitgemaakt. Deze partij beheert het\nnetwerk van RTL. Er was geen dubbele beveiliging zoals tweestapsverificatie aanwezig,\nwaardoor de aanvallers met de gestolen inloggegevens direct verregaande toegang op het\nnetwerk kregen\n\n\n-----\n\nDe aanvallers hebben toen de CryTOX-ransomware over het netwerk van RTL uitgerold.\nBestanden werden versleuteld en op sommige computers verscheen een scherm met daarin\nhet verzoek om losgeld te betalen. Ook een aantal belangrijke interne systemen, zoals het\nredactiesysteem van RTL Nieuws en het advertentieplanningssysteem, zijn door de\nransomware platgelegd.\n\nEen screenshot van de CryTOX-ransomware.\n\n## Direct aangifte gedaan\n\nRTL heeft het Hilversumse netwerk geïsoleerd en de geïnfecteerde computers afgesloten\nvan de rest, zodat de ransomware zich niet verder kon verspreiden. Daarna is gezocht naar\nde zogeheten patient zero: de plek waar de aanvallers binnen zijn gekomen. Dit gebeurde in\nsamenwerking met technische partners zoals cybersecuritybedrijf Fox-IT en Infradata. Ook is\ner direct aangifte gedaan en de politie ingeschakeld.\n\nDe backups waren niet aangetast, waardoor RTL na de aanval direct is begonnen met het\nherstellen van geïnfecteerde systemen, zo vertelt RTL Nederland-cto Giovanni Piccirilli: \"We\nhebben onmiddellijk besloten om onze systemen te isoleren om verdere aantasting te\nvoorkomen. We hebben alles kunnen herbouwen met eigen schone back-upsystemen.\" De\nsituatie was volgens Piccirilli binnen een 'aantal dagen' onder controle.\n\n\n-----\n\nLees ook:\n\n**RTL Nederland kampt met mogelijke ransomware-aanval**\n\nDe systemen zijn in beveiligde omgevingen opgestart en mondjesmaat weer beschikbaar\ngemaakt. RTL Nieuws heeft bijna een week zonder redactiesysteem de uitzendingen\ngemaakt. Ook de bezoekers van de websites en apps hebben er niets van gemerkt. RTL\nbenadrukt dat de consument geen last heeft gehad van de ransomware. Er is volgens RTL\ngeen data gelekt of verlies geleden.\n\n\"We hebben de afgelopen jaren veel geïnvesteerd in beveiliging en awareness\", zegt RTL\nNederland-ceo Sven Sauvé. \"Als een digitale aanval je dan toch overkomt, is het beste\ncrisisplan de juiste professionals op de juiste plek, zodat je snel kunt handelen. Daarmee is\nde schade beperkt gebleven. Ik ben heel trots op ons team.\"\n\nBekijk deze video op RTL XL\n\nHet is de nachtmerrie van elke ondernemer: hackers die je hele computersysteem platleggen\nmet ransomware en vervolgens losgeld eisen. Het gebeurde ook bij automaterialenbedrijf\nExcluparts. \"Ik denk dat dit voor veel bedrijven de doodsteek kan zijn.\"\n\n## 8500 euro betaald\n\nRTL was de backups aan het herstellen maar heeft wel contact opgenomen met de\ncybercriminelen om te weten wat hun eisen waren. Het gebeurt vaker dat bedrijven in\ngesprek gaan met de aanvallers om te onderhandelen of tijd te rekken. De criminelen\nvroegen aan RTL 10.000 dollar, omgerekend zo'n 8500 euro, in bitcoin.\n\n\n-----\n\nDat is een verrassend laag bedrag, stelt Dave Maasland van cybersecuritybedrijf ESET\nNederland: \"Normaal gesproken worden er tonnen of miljoenen euro's aan losgeld\ngevraagd.\" Er kunnen allerlei verklaringen voor het lage bedrag zijn: misschien zagen de\naanvallers dat de backups niet waren aangetast, proberen ze zo veel mogelijk geïnfecteerde\nbedrijven een klein bedrag te laten betalen, of waren de criminelen gewoonweg niet zo\nervaren.\n\n## Betaling kan spoor nalaten\n\nRTL heeft het bedrag betaald om eventuele opsporing mogelijk te maken, stelt het bedrijf.\nBronnen binnen de opsporing bevestigen dat een bitcoinbetaling een spoor kan zijn naar de\ndaders, omdat het geld op een gegeven moment moet worden opgenomen en uitgegeven.\nDe nationale politie heeft als standpunt dat je nooit moet betalen, want dat houdt het\nverdienmodel van ransomware in stand.\n\nLees ook:\n\n**Justitie denkt aan verbod op betalen losgeld na aanval met ransomware**\n\n**Altijd weten wat er speelt?**\n\n_Download de gratis RTL Nieuws-app en blijf op de hoogte._\n\n\n-----",
    "language": "NL",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-23 - RTL was victim ransomware attack, cyber criminals make 8500 euro loot.pdf"
    ],
    "report_names": [
        "2021-09-23 - RTL was victim ransomware attack, cyber criminals make 8500 euro loot.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536073,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653757068,
    "ts_modification_date": 1653757068,
    "files": {
        "pdf": "https://archive.orkl.eu/b0a9b96792226abab3f924f9cd37b4434a4618c0.pdf",
        "text": "https://archive.orkl.eu/b0a9b96792226abab3f924f9cd37b4434a4618c0.txt",
        "img": "https://archive.orkl.eu/b0a9b96792226abab3f924f9cd37b4434a4618c0.jpg"
    }
}