{
    "id": "702adbca-5aeb-45a5-a4a7-9c5188530284",
    "created_at": "2023-01-12T15:08:36.691734Z",
    "updated_at": "2025-03-27T02:16:26.005226Z",
    "deleted_at": null,
    "sha1_hash": "3088cbdce117edbe0cd073599e2cb2153740cd3b",
    "title": "2021-03-18 - Beware Android trojan posing as Clubhouse app",
    "authors": "",
    "file_creation_date": "2022-05-28T17:10:37Z",
    "file_modification_date": "2022-05-28T17:10:37Z",
    "file_size": 270541,
    "plain_text": "# Beware Android trojan posing as Clubhouse app\n\n**[welivesecurity.com/2021/03/18/beware-android-trojan-posing-clubhouse-app/](https://www.welivesecurity.com/2021/03/18/beware-android-trojan-posing-clubhouse-app/)**\n\nMarch 18, 2021\n\nThe malware can grab login credentials for more than 450 apps and bypass SMS-based\ntwo-factor authentication\n\n[Amer Owaida](https://www.welivesecurity.com/author/aowaida/)\n18 Mar 2021 - 03:47PM\n\n\n-----\n\nThe malware can grab login credentials for more than 450 apps and bypass SMS-based\ntwo-factor authentication\n\nCybercriminals are attempting to take advantage of the popularity of Clubhouse to deliver\nmalware that aims to steal users’ login information for a variety of online services, ESET\n[malware researcher Lukas Stefanko has found.](https://www.welivesecurity.com/author/lstefanko/)\n\nDisguised as the (as yet non-existent) Android version of the invitation-only audio chat app,\nthe malicious package is served from a website that has the look and feel of the genuine\n[Clubhouse website. The trojan – nicknamed “BlackRock” by ThreatFabric and detected by](https://www.threatfabric.com/blogs/blackrock_the_trojan_that_wanted_to_get_them_all.html)\nESET products as Android/TrojanDropper.Agent.HLR – can steal victims’ login data for no\nfewer than 458 online services.\n\nThe target list includes well-known financial and shopping apps, cryptocurrency exchanges,\nas well as social media and messaging platforms. For starters, Twitter, WhatsApp,\nFacebook, Amazon, Netflix, Outlook, eBay, Coinbase, Plus500, Cash App, BBVA and\nLloyds Bank are all on the list.\n\nMalicious web claiming to offer [#Clubhouse for Android spreads banking trojan](https://twitter.com/hashtag/Clubhouse?src=hash&ref_src=twsrc%5Etfw)\nBlackrock. It lures credentials from 458 apps – financial, cryptocurrency exchanges &\nwallets, social, IM and shopping apps. There is currently no official Clubhouse app for\nAndroid. [#ESETresearch 1/2](https://twitter.com/hashtag/ESETresearch?src=hash&ref_src=twsrc%5Etfw) [pic.twitter.com/azlxjvIgNO](https://t.co/azlxjvIgNO)\n\n— ESET research (@ESETresearch) [March 16, 2021](https://twitter.com/ESETresearch/status/1371829367068852226?ref_src=twsrc%5Etfw)\n\n“The website looks like the real deal. To be frank, it is a well-executed copy of the legitimate\nClubhouse website. However, once the user clicks on ‘Get it on Google Play’, the app will\nbe automatically downloaded onto the user’s device. By contrast, legitimate websites would\nalways redirect the user to Google Play, rather than directly download an Android Package\nKit, or APK for short,” said Stefanko.\n\nEven before tapping the button there are signs that something is amiss, such as the\nconnection not being secure (HTTP instead of HTTPS) or that the site uses the “.mobi” toplevel domain (TLD), rather than “.com” used by the legitimate app (see Figure 1). Another\nred flag should be that even though Clubhouse is indeed planning to launch the Android\nversion of its app soon, the platform is at present still available only for iPhones.\n\n\n-----\n\n-----\n\n-----\n\n_Figure 1. Notice the difference in the URLs between the fraudulent (left) and legitimate_\n_(right) website_\n\nOnce the victim is hoodwinked into downloading and installing BlackRock, the trojan tries to\npurloin their credentials using an overlay attack. In other words, whenever the user\nlaunches one of the targeted applications, the malware will create a data-stealing overlay of\nthe application and request the user to log in. Instead of logging in, the user unwittingly\nhands over their credentials to the cybercriminals.\n\n[Using SMS-based two-factor authentication (2FA) to help prevent anyone from infiltrating](https://www.welivesecurity.com/2019/12/13/2fa-double-down-your-security/)\nyour accounts wouldn’t necessarily help in this case, since the malware can also intercept\ntext messages. The malicious app also asks the victim to enable accessibility services,\neffectively allowing the criminals to take control of the device.\n\nTo be sure, there are other ways to spot the malicious decoy besides those shown in Figure\n1. Stefanko points out that the name of the downloaded app “Install”, instead of “Clubhouse”\nshould be an instant red flag. “While this demonstrates that the malware creator was\nprobably too lazy to disguise the downloaded app properly, it could also mean that we may\ndiscover even more sophisticated copycats in the future,” he warned.\n\n\n-----\n\n-----\n\n_Figure 2. The installation prompt_\n\nThis is perhaps also a good opportunity to brush up on mobile security best practices:\n\n\n-----\n\nUse only the official stores to download apps to your devices.\n[Be wary of what kinds of permissions you grant to applications.](https://www.welivesecurity.com/2019/10/02/do-apps-need-all-permissions/)\nKeep your device up to date, ideally by setting it to patch and update automatically.\nIf possible, use software-based or hardware token one-time password (OTP)\ngenerators instead of SMS.\nBefore downloading an app, do some research on the developer and the app’s ratings\nand user reviews.\nUse a reputable mobile security solution.\n\nFor a more thorough take on how to protect yourself against mobile security threats, head\nover to [this article.](https://www.welivesecurity.com/2019/12/31/20-tips-2020-be-smarter-your-smartphone/)\n\n18 Mar 2021 - 03:47PM\n\n## Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-18 - Beware Android trojan posing as Clubhouse app.pdf"
    ],
    "report_names": [
        "2021-03-18 - Beware Android trojan posing as Clubhouse app.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536116,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653757837,
    "ts_modification_date": 1653757837,
    "files": {
        "pdf": "https://archive.orkl.eu/3088cbdce117edbe0cd073599e2cb2153740cd3b.pdf",
        "text": "https://archive.orkl.eu/3088cbdce117edbe0cd073599e2cb2153740cd3b.txt",
        "img": "https://archive.orkl.eu/3088cbdce117edbe0cd073599e2cb2153740cd3b.jpg"
    }
}