{
    "id": "70525a62-511a-4950-8241-102b8e53c487",
    "created_at": "2023-01-12T15:09:45.143645Z",
    "updated_at": "2025-03-27T02:05:47.304232Z",
    "deleted_at": null,
    "sha1_hash": "cccee6e6e90c61cadc107aed2fd3362b11500783",
    "title": "2017-10-11 - TrickBot Takes to Latin America, Continues to Expand Its Global Reach",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:20Z",
    "file_modification_date": "2022-05-28T03:52:20Z",
    "file_size": 1689141,
    "plain_text": "# TrickBot Takes to Latin America, Continues to Expand Its Global Reach\n\n**[securityintelligence.com/trickbot-takes-to-latin-america-continues-to-expand-its-global-reach/](https://securityintelligence.com/trickbot-takes-to-latin-america-continues-to-expand-its-global-reach/)**\n\nOctober 11, 2017\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nTrickBot Takes to Latin America, Continues to Expand Its Global Reach\n\n\n-----\n\n[Banking & Finance October 11, 2017](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Limor Kessem 4 min read](https://securityintelligence.com/author/limor-kessem/)\nThe TrickBot Trojan, a banking malware believed to be operated by an organized cybercrime\ngroup, has been the most active financial Trojan in the wild all summer. For some\nperspective, while other malware operators were much less active in the summer months,\nTrickBot was three times more active than Dridex in terms of campaigns and code updates in\nQ3 and Q4 to date, according to [IBM X-Force Research. It continues to expand its reach,](https://www.ibm.com/security/xforce/)\nthis time setting foot in Latin America, with bank targets in Argentina, Chile, Colombia and\nPeru.\n\nAt this time, the number of targets in Latin America is still small, but this strategy is typical for\n[TrickBot’s operators, who test the waters before moving ahead to set up redirection attacks](https://securityintelligence.com/an-aggressive-launch-trickbot-trojan-rises-with-redirection-attacks-in-the-uk/)\nand add more banks to their target lists.\n\nRecent configuration files analyzed by IBM X-Force Research show that TrickBot’s operators\nare still using redirection attacks for many of their targets. The ratio in recent campaigns,\nwhere TrickBot targeted banks in no less than 40 countries, was 60 percent webinjection\nattacks to 40 percent redirection attacks. Those are already active in all four countries in\nLatin America where TrickBot targets major banks. In the current cybercrime arena,\naccording to X-Force research, the only other gangs to use redirection attacks are the\n[operators of the Dridex and](https://securityintelligence.com/dridex-launches-dyre-like-attacks-in-uk-intensifies-focus-on-business-accounts/) [GootKit Trojans.](https://securityintelligence.com/gootkit-malvertising-brings-redirection-attacks-to-italian-banks/)\n\nWatch the on-demand webinar: The Evolution of TrickBot Into the Next Global Banking\nThreat\n\n## Signed, Sealed, Delivered by Necurs\n\n\n-----\n\n[TrickBot is delivered to potential victims via email and pushed by the Necurs botnet. The](https://securityintelligence.com/the-necurs-botnet-a-pandoras-box-of-malicious-spam/)\nconnection with the Necurs gang has been ongoing since mid-2017, which has led to\nTrickBot being delivered as various file types to conceal its payloads. Most recently, the\nmalware switched to using an eFax ploy to trick users into opening malicious VBS\nextensions that harbor its payload.\n\nAn X-Force analysis of the amount of spam emitted by the Necurs botnet during August and\nSeptember showed that this cybercrime operation sent over 40 million emails carrying .7z\narchive file attachments per week in intermittent TrickBot and Locky ransomware campaigns.\n\nThis is not the only method by which TrickBot was delivered in Q3. The group has been\n[experimenting with other ideas, such as setting up fake websites and serving the malware](https://isc.sans.edu/forums/diary/Malspam+pushing+Trickbot+banking+Trojan/22720/)\nfrom there. In early August, TrickBot was spotted using the same infection zones as the\n[Emotet Trojan, which has been linked with the QakBot banking Trojan, which recently](https://securityintelligence.com/qakbot-banking-trojan-causes-massive-active-directory-lockouts/)\npropagated throughout corporate networks and caused massive Active Directory lockouts.\n\n## Evolving to Get More\n\nDelivery methods are not the only things TrickBot changes often; it has also been evolving its\ncode over the past year. Q3 was especially active for TrickBot, which added modules to its\nexisting hidden desktop and data theft capabilities.\n\nIn July, TrickBot’s developers added support for the EternalBlue exploit, a tool borrowed from\nattacks such as [WannaCry and](https://securityintelligence.com/wannacry-ransomware-spreads-across-the-globe-makes-organizations-wanna-cry-about-microsoft-vulnerability/) [NotPetya that allows it to spread through enterprise](https://securityintelligence.com/petya-werent-expecting-this-ransomware-takes-systems-hostage-across-the-globe/)\nnetworks, along with a new worm feature it adopted to fetch its payloads from malicious\nremote servers. TrickBot targets mostly business banking services, according to X-Force\nResearch, so this addition is not a surprise.\n\n[By August, TrickBot already had new modules designed to steal Outlook email and browsing](https://www.securityweek.com/trickbot-targets-outlook-browser-data)\ndata. These modules do not feature the same code sophistication the core malware and\nmodules present and were likely written by other developers. This could suggest that the\nTrickBot team recently took on new, less experienced members.\n\n[In early September, TrickBot’s operators added cryptocurrency targets to their configuration](https://www.bleepingcomputer.com/news/security/banking-trojan-now-targets-coinbase-users-not-just-banking-portals/)\n[files, aiming to steal user credentials for platforms such as the American-based Coinbase](https://www.coinbase.com/)\n[and the Luxembourg-based Blockchain. Both exchange different types of cryptocurrency](https://blockchain.info/)\ncoins. This addition enabled TrickBot’s operators to take over victims’ wallets and empty\nthem or use them as part of a network of wallets to move other coins and wipe their\nillegitimate traces.\n\n## Global Reach\n\n\n-----\n\nTrickBot has managed to spread to a large number of countries and language zones in\nrelatively little time. The malware operates redirection attacks in over 20 countries and\ntargets banks in over 40 countries spanning Asia, Europe, North America, South America,\nAustralia, New Zealand and the Nordics.\n\n_Figure 1: A timeline of Trickbot’s global spread (Source: IBM X-Force)_\n\nIn terms of the top geographies on TrickBot’s radar, the focus changes in different\nconfigurations, which are attributed to infection cycles destined for each country or region. In\nrecent attacks in which a large number of countries appears on the same list, X-Force data\nshowed the following distribution:\n\n_Figure 2: TrickBot’s current configuration and geodistribution of targets (Source: IBM X-_\n_Force)_\n\nUnlike most Trojans, which mainly target the larger parts of Europe such as the U.K.,\nGermany and France, TrickBot also targets banks in smaller unlikely countries, some of\nwhich were previously part of the Soviet bloc. Some examples include Bulgaria, Lithuania,\nLatvia, Slovenia and Slovakia. These countries, where the economy is not as strong and\npeople are less likely to have high residual incomes, are much less likely to be used as runof-the-mill targets and are more often exploited as cash-out routes for the TrickBot gang.\n\nTrickBot is currently the sixth most prevalent financial malware family in the global financial\ncybercrime arena, as show in Figure 3.\n\n_Figure 3: Most prevalent financial malware families, October 2017 YTD (Source: IBM_\n_Trusteer)_\n\n## Keeping Up With TrickBot\n\nThe [TrickBot Trojan is an evolving malware project that appears to have funding and](https://securityintelligence.com/trickbot-habla-espanol-trojan-widens-its-attack-scope-in-spain-brings-redirection-attacks-to-local-banks/)\nalliances in the cybercrime arena. According to X-Force Research, its targets are mostly\nbusiness banking, wealth management and private banking services, which simply means\nthat the malware’s operators are after corporate money and hefty illicit profits.\n\nThis gang is believed to be organized, international and unlikely to disappear anytime soon.\nX-Force Research expects to see TrickBot continue to target banks, organizations and\nconsumers in Q4 2017. To keep up to date about this malware, follow our ongoing X-Force\nExchange Collection on TrickBot.\n\n[Read the white paper to learn how digital banking is transforming fraud detection](https://www-01.ibm.com/marketing/iwm/dre/signup?source=urx-18586&S_PKG=ov60471)\n\n\n-----\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-11 - TrickBot Takes to Latin America, Continues to Expand Its Global Reach.pdf"
    ],
    "report_names": [
        "2017-10-11 - TrickBot Takes to Latin America, Continues to Expand Its Global Reach.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536185,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653709940,
    "ts_modification_date": 1653709940,
    "files": {
        "pdf": "https://archive.orkl.eu/cccee6e6e90c61cadc107aed2fd3362b11500783.pdf",
        "text": "https://archive.orkl.eu/cccee6e6e90c61cadc107aed2fd3362b11500783.txt",
        "img": "https://archive.orkl.eu/cccee6e6e90c61cadc107aed2fd3362b11500783.jpg"
    }
}