{
    "id": "707c2713-a7ed-47c2-9620-aa5d64735f80",
    "created_at": "2023-01-12T15:01:06.539218Z",
    "updated_at": "2025-03-27T02:08:40.745198Z",
    "deleted_at": null,
    "sha1_hash": "06bf07e5b822e4cd632f8e4f44d0a2cad2dab39a",
    "title": "2017-10-19 - A deeper look at Tofsee modules",
    "authors": "",
    "file_creation_date": "2022-05-28T03:33:13Z",
    "file_modification_date": "2022-05-28T03:33:13Z",
    "file_size": 306285,
    "plain_text": "# A deeper look at Tofsee modules\n\n**cert.pl/en/news/single/a-deeper-look-at-tofsee-modules/**\n\nTofsee is a multi-purpose malware with wide array of capabilities – it can mine bitcoins, send\nemails, steal credentials, perform DDoS attacks, and more. All of this is possible because of\nits modular nature.\n\nWe have already published about Tofsee/Gheg a few months ago –\n[https://www.cert.pl/en/news/single/tofsee-en. Reading or at least skimming it is probably](https://www.cert.pl/en/news/single/tofsee-en)\nrequired to fully understand this post. Note that it is meant as an extension of that research,\nfocusing on plugin functionality that we previously ignored. We will shortly summarize each\nplugin and highlight its most important features.\n\nThe post is rather long – for the impatient, list of hashes and table of contents in one:\n\n**Resource Id** **DLL name** **DLL MD5 hash**\n\n1 ddosR.dll fbc7eebe4a56114e55989e50d8d19b5b\n\n2 antibot.dll a3ba755086b75e1b654532d1d097c549\n\n3 snrpR.dll 385b09563350897f8c941b47fb199dcb\n\n4 proxyR.dll 4a174e770958be3eb5cc2c4a164038af\n\n5 webmR.dll 78ee41b097d402849474291214391d34\n\n\n-----\n\n**Resource Id** **DLL name** **DLL MD5 hash**\n\n6 protect.dll 624c5469ba44c7eda33a293638260544\n\n7 locsR.dll 2d28c116ca0783046732edf4d4079c77\n\n10 hostR.dll c90224a3f8b0ab83fafbac6708b9f834\n\n11 text.dll 48ace17c96ae8b30509efcb83a1218b4\n\n12 smtp.dll 761e654fb2f47a39b69340c1de181ce0\n\n13 blist.dll e77c0f921ef3ff1c4ef83ea6383b51b9\n\n14 miner.dll 47405b40ef8603f24b0e4e2b59b74a8c\n\n15 img.dll e0b0448dc095738ab8eaa89539b66e47\n\n16 spread.dll 227ec327fe7544f04ce07023ebe816d5\n\n17 spread2.dll 90a7f97c02d5f15801f7449cdf35cd2d\n\n18 sys.dll 70dbbaba56a58775658d74cdddc56d05\n\n19 webb.dll 8a3d2ae32b894624b090ff7a36da2db4\n\n20 p2p.dll e0061dce024cca457457d217c9905358\n\n## 1. ddosR.dll\n\nOriginal filename: p:\\cmf5\\small2\\plugins\\plg_ddos\\ddos.cpp\n\nThis plugin can perform DDOS attacks. Implemented attacks are not very complicated, for\nexample request spamming (HTTP Flood):\n\nOr plain old SYN flood (using PassThru driver, aka grabb module).\n\nWe haven’t observed any DDoS activity from Tofsee yet, so this plugin is probably not used\nby the botmaster.\n\nConfiguration from the C&C for this plugin is very simple:\n\nThe binary contains a lot of strings, what simplifies analysis greatly:\n\n## 2. antibot.dll\n\nOriginal filename: z:\\cmf5\\small2\\plugins\\plg_antibot\\plugin.cpp\n\nNow, this is an interesting plugin, because it removes other malware from victim’s computer.\n\n\n-----\n\nIt can:\n\nenumerate processes and kill ones that may be dangerous (search by configured\nnames)\nsearch SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Browser Helper\nObjects registry branch, and remove bad browser helper objects\nenumerate mutexes and kill processes that own them (search by mutex names).\n\nList of browser helper objects removed by this module (downloaded from C&C):\n\n## 3. snrpR.dll\n\nOriginal filename: p:\\\\cmf5\\\\small2\\\\plugins\\\\plg_sniff\\\\sniff.cpp\n\nRelated config section:\n\nCommunication is sniffed and replaced using PassThru driver (accessible through named\npipe “\\\\\\\\.\\\\PassThru”)\n\n**mail.sniff enables stealing mail addresses from incoming e-mails. Mail**\naddresses are stolen from “From” and “To” fields. It also looks for entities\n“%40″,”#64″,”#064” in content (looking for “@” char).\n\n**ftp.sniff and pop.sniff enables POP3 and FTP credentials stealing. The plugin is**\nlooking for “user” and “pass” protocol commands, gets authentication data and\nsends through Passthru driver.\n\n**mail.replace functionality replaces incoming e-mails using a specified template**\n(stored in ‘mailbody’ key of config)\n\nTemplate example that we received (despite this function being turned off right now):\n\nIt leaves original “From” and “To” headers (%FROM_LINE, %TO_LINE), has the ability to\nleave original subject (%SUBJ, %_SUBJ), and original timestamps (%DATE, %P5DATE,\n%M5DATE).\n\n## 4. proxyR.dll\n\nOriginal filename: p:\\\\cmf5\\\\small2\\\\plugins\\\\plg_proxy\\\\plugin.cpp\n\nThis plugin listens for TCP connections on 0.0.0.0:1080 and provides multithreaded SOCKS\nproxy server. The sample we analyzed identifies itself in Proxy-Agent HTTP header as\nWinRoute Pro/4.1.\n\nTraffic is redirected to addresses specified at a proxy_cfg section, separately for each region.\n\n\n-----\n\nAddresses are specified as a reference to a work_srv list or directly.\n\nIn proxy_cfg we can also find some defined timeouts for a socket.\n\nWhen any value is missing in configuration, binary has some sane defaults inside.\n\nPlugin also adds port mapping using UPNP, disguising itself as Skype:\n\nStrings from the binary give a little more insight about the purpose of this plugin:\n\n## 6. protect.dll\n\nOriginal filename: z:\\cmf5\\small2\\plugins\\plg_protect\\plugin.cpp\n\nThis plugin downloads and installs malicious service in system:\n\nMalicious service binary is obfuscated with “state-of-the-art encryption algorithm” – i.e.\nnegating every byte:\n\nMd5 of decrypted backdoor = 49642f1d1b1673a40f5fa6263a66d056. This file is protected by\npacker, and it’s the only packed binary that we observed during our analysis of Tofsee – it\nsuggests that the binary could’ve been created by another actor and reused in Tofsee.\n\n## 7. locsR.dll\n\nOriginal filename: z:\\cmf5\\cmf5\\small2\\plugins\\plg_locs\\plg.cpp\n\nThis plugin steals network credentials for Microsoft Outlook:\n\nAfter extracting them from the registry, they are decrypted and used to send more emails.\nAdditionally, it generates email in form [computer name]@mail.ru and attempts to send\nemails using it (with raw SMTP protocol).\n\nStrings from binary:\n\n## 10. hostR.dll\n\nThis is HTTP server plugin. It masquerades as Apache/2.2.15 (Win32). It can serve files,\nprobably for other bots.\n\nIt is able to blacklist some IPs – probably security analysts (for example Forcepoint and\nGoogle are banned).\n\nConfiguration for this module, fetched from the C&C:\n\n## 11. text.dll\n\n\n-----\n\nOriginal filename: p:\\cmf5\\small2\\plugins\\plg_text\\plg_text.cpp\n\nVery short plugin, it is able to process email templates downloaded from C&C.\n\n## 12. smtp.dll\n\nVery important module – it generates and sends emails. It’s probably biggest module and\ncode is rather complicated sometimes.\n\nMost interesting thing about it is the fact that it uses its own dedicated scripting language for\ngenerating messages. Script example, received from C&C:\n\nIf someone recognizes this as a real scripting language, we’d be grateful for the information.\nWe have never seen something like this, so we analyzed interpreter of this language.\n\nThe syntax is rather simple, but very assemblish and primitive. We hope that malware\nauthors are generating this scripts from a higher level language because writing something\nlike this must really hurt one’s sanity ;].\n\nA lot of opcodes are supported – take a look at this (simplified) parsing function for example:\n\nWe didn’t reverse all of them, but few most important ones are:\n\nC ip:port – Connect\nL lbl – Create Label lbl.\nJ lbl – Jump to label lbl.\nv name value – Create variable name and assign value value.\nW text – Write something to output – in this case to final email.\nI lbl condition – If condition is satisfied than jump to lbl\n\nAdditionally wrapping text in “”” allows for newlines and escape sequences in it, and\n__v(XX)__ is a variable interpolation.\n\nAgain, few from the most interesting strings from that binary:\n\nWe thought that IfYouAreReadingThisYouHaveTooMuchFreeTime is an easter egg for us,\nmalware analysts, but it turns out that it’s just a strange quirk related to hotmail\nauthentication.\n\nConfiguration for this module, fetched from C&C:\n\n## 13. blist.dll\n\nThis plugin checks if a bot is listed as a spambot and blacklisted. In the config we observed\nfollowing DNSBLs (DNS-based Blackhole Lists) were supplied:\n\n\n-----\n\nDNSBL is a service based on DNS used for publishing IP addresses of spam senders. If\nspam server uses DNSBL filters, it will do a DNS request to DNSBL domain with each\nincoming SMTP connection. Technical details are outside of the scope of this post, but any\n[interested reader can take a look at http://www.us.sorbs.net/using.shtml or](http://www.us.sorbs.net/using.shtml)\n[https://en.wikipedia.org/wiki/DNSBL.](https://en.wikipedia.org/wiki/DNSBL)\n\nChecking DNSBL is implemented with gethostbyname:\n\nConfiguration for this module, fetched from C&C:\n\n## 14. miner.dll\n\nThis is (as the name suggests) cryptocurrency miner. This plugin only coordinates the work,\nbut it has few accompanying binaries, that perform the dirty work.\n\nOne binary, called grabb, is distributed straight from the C&C. Other binaries are\ndownloadable through URLs specified in configs – in theory. In practice, servers distributing\nminers seem to be dead, so we were not able to download miners.\n\nMiner “verifies” that has really downloaded right binary, but hashing was probably too difficult\nfor malware creators to implement, so they settled on size verification – for example, they are\ncheck that cores_gt_1 binary has exactly 223744 bytes.\n\nWe didn’t analyze it in-depth because crypto miners are boring enough, and strings from\nbinary give enough information about inner workings anyway:\n\nAnd the rest can be read from the configuration, fetched from C&C:\n\n## 15. img.dll\n\nThis short plugin processes malicious attachments – encodes them with base64 and\nappends to emails.\n\nNothing interesting here, as can be seen in hardcoded strings:\n\nConfiguration for this module, fetched from the C&C:\n\n## 16. spread.dll\n\nFirst, it extracts xs, datr, c_user (and more) cookies.\n\nExact method depends on the browser, but generally plugin reads cookies stored on disk by\nthe browser – for example cookies.sqlite from \\Mozilla\\Firefox\\Profiles, for Firefox. Supported\nbrowsers are Chrome, IE, Firefox, Safari, and Opera.\n\nAfter that, plugin uses that cookies to impersonate user in facebook API:\n\n\n-----\n\nList of friends is downloaded through API and a message is sent to them. Format of\nmessage is stored in configuration, for example:\n\n‘fb.message1’: ‘%SPRD_TEXT1|%LANG_ID| %SPRD_URL1’\n\nTwitter is handled very similarly: cookies are stolen, followers are downloaded by API call to\nhttps://twitter.com/followers, and messages are sent.\n\nVKontakte also seems to be supported, but that functionality is optional and held in another\nplugin. This module only checks if VK is enabled in config and calls handler (that can be\ninitialized from another plugin), if it’s defined. Malware creators usually don’t like to attack\nRussia, so this function is disabled and VKontakte plugin is not distributed.\n\nPlugin can also spread itself through Skype, but reverse engineering Skype protocol was\nclearly too hard for malware authors, so plugin waits until Skype is started, and then sends\nwindows messages to Skype window:\n\nThe plugin has dozens of strings hardcoded, so analyzing it in disassembler is a breeze. Few\nmore interesting groups:\n\nReferences to the OCR plugin – to avoid captchas:\n\nFacebook cookies:\n\nStrings related to Facebook spread:\n\nStrings related to cookie stealing:\n\nStrings related to Skype hijacking:\n\nTwitter cookies:\n\nAnd Twitter spread:\n\nFinally, things needed to send stolen cookies somewhere:\n\nRich functionality means rich configuration from the C&C:\n\n## 17. spread2.dll\n\nThis plugin uses methods more than 15 years old, and tries to spread Tofsee through…\ninfected USB drives! This doesn’t sound like an effective idea for A.D. 2017, but despite that,\nthe plugin is still enabled.\n\nFirst it copies malicious binary into RECYCLER\\<random_gibberish>.exe file on the USB\ndrive, then sets READONLY and SYSTEM attributes on that file, and finally writes malicious\nautorun.inf file:\n\n\n-----\n\nThe malicious binary that will be spread is downloaded from the internet (see also sys.dll\nplugin and %FIREURL variable).\n\nNothing too interesting in hardcoded strings, except operation logs:\n\nConfiguration for this module, fetched from the C&C:\n\n## 18. sys.dll\n\nThis plugin seems to be a downloader or rather an updater. It sends requests, depending on\na value of the %FIREURL configuration variable.\n\nExample values of the %FIREURL variable (one per line):\n\nVariables are expanded recursively, and %SYS_RN means \\r\\n of course, so first possible\nvalue can be read as:\n\nIf we send this request to that IP address on port 80, we will get yet another malicious binary.\nDifferent requests lead to different binaries.\n\nIf a request is invalid, or not supported, following image is sent instead:\n\nWe appreciate the humor.\n\nNothing surprising in hardcoded strings:\n\n\n-----\n\nConfiguration for this module, fetched from the C&C:\n\nAdditionally the %FIREURL variable from config is used.\n\n## 19. webb.dll\n\nThis plugin tries to locate iexplore.exe process. If this succeeds, it injects DLL file called\nIEStub.dll to this process.\n\nIEStub.dll hooks a lot of functions from iexplorer. List of hooked functions:\n\nHooks intercept called functions and can change their parameters. We haven’t analyzed\nhooks in depth, but most of them seem to be loggers intercepting “interesting” data from\nparameters – We haven’t observed any web injects served by Tofsee.\n\nFor completeness, interesting hardcoded strings:\n\nConfiguration for this module, fetched from the C&C:\n\n## 20. P2P.dll\n\nOriginal filename: p:\\cmf5\\small2\\plugins\\plg_p2p\\plg_p2p.cpp\n\nThis plugin is rather short. Despite promising name, it’s rather boring – opening a port on a\nrouter and listening for connection is the most important thing it does. It doesn’t implement\nany commands, this is left for the main module to handle.\n\nLike almost every module, it logs to %TMP%\\log_%s.txt, and when this fails falls back to\nC:\\log.txt.\n\nAlso adds port mapping using UPnP, in the same way as plugin 4 (proxyR.dll).\n\nConfiguration for this module, fetched from the C&C:\n\nInteresting strings:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-19 - A deeper look at Tofsee modules.pdf"
    ],
    "report_names": [
        "2017-10-19 - A deeper look at Tofsee modules.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535666,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653708793,
    "ts_modification_date": 1653708793,
    "files": {
        "pdf": "https://archive.orkl.eu/06bf07e5b822e4cd632f8e4f44d0a2cad2dab39a.pdf",
        "text": "https://archive.orkl.eu/06bf07e5b822e4cd632f8e4f44d0a2cad2dab39a.txt",
        "img": "https://archive.orkl.eu/06bf07e5b822e4cd632f8e4f44d0a2cad2dab39a.jpg"
    }
}