{
    "id": "70f72e31-62ca-4331-b1db-092a3a142749",
    "created_at": "2023-01-12T15:01:31.885689Z",
    "updated_at": "2025-03-27T02:17:00.421011Z",
    "deleted_at": null,
    "sha1_hash": "5f83835ced4d6739ec6be35d24c830e9f242d7f0",
    "title": "2022-08-24 - The Dark Side of Bumblebee Malware Loader",
    "authors": "",
    "file_creation_date": "2022-09-12T12:01:07Z",
    "file_modification_date": "2022-09-12T12:01:07Z",
    "file_size": 1705595,
    "plain_text": "# The Dark Side of Bumblebee Malware Loader\n\n**[deepinstinct.com/blog/the-dark-side-of-bumblebee-malware-loader](https://www.deepinstinct.com/blog/the-dark-side-of-bumblebee-malware-loader)**\n\nAugust 24, 2022\n\n## Unit 221B Validates >99% Zero-Day and <0.1% False Positive Threat\n Prevention Accuracy\n\n[Learn more](https://www.deepinstinct.com/blog/qa-with-unit-221b-ceo-lance-james)\n\n## Summary\n\nDeep Instinct recently prevented a targeted Bumblebee malware attack in one of our clients’\nenvironments. The attack, which was detected and prevented before execution, involved an\nobfuscated PowerShell script, a .VHD file (a type of disk image file similar to .ISO), a DLL,\nand spear phishing correspondence.\n\nCurrently, the relevant IoCs (indicators of compromise) are not detected by most security\nvendors. This blog will provide a detailed review of these IoCs and provide technical details of\nthe stages of the full Bumblebee malware attack.\n\n\n-----\n\n## Spear Phishing and Delivery\n\nPhishing attacks have become threat actors’ tool of choice for malware delivery. The concept\nis quite simple: an attacker crafts a dropper and attaches it to an email with a compelling\nmessage meant to fool the target into opening the file. However, greater awareness and\ntraining on how to spot and avoid these attacks is leading threat actors to employ more\nsophisticated means to launch spear phishing attacks.\n\nThe most successful spear phishing campaigns rely on deception to gain a potential victim’s\ntrust – often including personal details about the recipient in the phishing note or sending the\nharmful email from a domain that is very similar to one that the recipient trusts. Threat actors\nalso commonly impersonate close friends and colleagues to trick their targets into opening\ncompromised messages.\n\nDeep Instinct prevented an infection that started with a clever spear phishing attack where the\nmalicious actor pretended to be someone from a well-known organization, using a domain\nwith an almost identical name, impersonating an employee, and using a highly relevant\nsubject line to trick the target into opening the note.\n\nTo further establish trust, the attacker did not include any attachments or requests to\ndownload files from a remote location in their first email – they only introduced themselves as\nthe person they were impersonating and used the promise of a new business opportunity to\nincrease their odds of getting a response.\n\nAfter the initial contact had been established and “trust” earned, the threat actor invited the\nrecipient to a meeting with them. Files were sent to be reviewed before the meeting, and the\nrecipient was informed that another email with a link to the file sharing platform “Smash”\nwould also be sent.\n\nFigure 1 – The second email.\nThe attacker used a domain “hognose1” registered with porkbun.com, with Postfix smtpd.\n\n\n-----\n\nThe Smash link was provided in a separate email leading to a .VHD file. The file contained\nan .LNK (shortcut file), which executes a hidden PowerShell script that resides in the disk\nimage file as well.\n\n## VHD container\n\nThe malicious VHD contains a shortcut file which runs a hidden PowerShell script when\nexecuted.\n\nFigure 2 - VHD container, as seen\n\nwhen mounted. Figure 3 – VHD\n\n\n-----\n\ncontainer, hidden files shown. Figure\n\n4 - Shortcut file runs hidden PowerShell script.\nFollowing Microsoft’s default disablement of Office Macro and requiring a few more steps to\nenable it, the combination of a disk image file (.ISO/.VHD, etc.) and shortcut file has been\ngaining in popularity as a “replacement” to Office Macros in the threat landscape.\n\n## Price Quote for PowerShell Loader\n\n**“quoutefile.ps1” - 1 Stage PowerShell loaderst**\n\nOnce executed by the .LNK file, “quoutefile.ps1” will hide the open PowerShell window and\ncontinue running. This is likely a measure to avoid using the “-windowstyle hidden”\nPowerShell command line parameter, which can lead to an increased chance of detection.\n\nFigure 5 - PowerShell code snippet to hide open window.\n\n\n-----\n\nAn interesting point of note: the code employs light, but effective, obfuscation intended to\nbreak up suspicious strings and evade static scanning.\n\nHaving hidden the active PowerShell window, the code continues to de-obfuscate a series of\nmore than 100 “elem” variables which contain Gzip compressed data streams by replacing\nthe first character in the stream with the character “H” and forming a Gzip stream header by\nusing “insert” and “remove” instead of the much more common “replace” method; the valid\nGzip stream is then appended to an array.\n\nThis is another example of how cybercriminals use simple and very effective measures to\nevade static scanning.\n\nFigure 6 - \"Obfuscated\" Gzip streams.\nThe code then iterates through the array of Gzip compressed streams, decompresses them,\nand forms the 2nd stage code block which will then be executed by “Invoke-Expression.”\n\n\n-----\n\nFigure 7 – 2nd stage is de-compressed and executed.\n\n## 2nd Stage PowerShell loader\n\n\nThe 2nd stage of the PowerShell loader is composed of a very large, very well written (even\ncommented) code block which loads an embedded 64-bit .DLL to memory.\n\nThis stage also continues the theme of simple, effective obfuscation intended to evade static\nanalysis.\n\nFigures 8-9 – Suspicious string “breakup.”\n\nThe loader validates the embedded file and performs multiple checks to ensure the file is\nloaded properly on the executing system.\n\n\n-----\n\nFigures 10-11 – file validation and check.\n\nFigure 12 – References to the payload .DLL exported functions.\nFinally, the loader sleeps for five seconds and calls its main function in order to load the\npayload .DLL to memory.\n\nNote the “replacement trick” used here to conceal the executable MZ header; similar in\nfashion to the Gzip stream “obfuscation” used in the 1 stage.st\n\nFigure 13 – Main function called to load payload .DLL\n\n## Link to Bumblebee Malware\n\nThe final DLL is a 64-bit Bumblebee payload.\n\nIt is protected by what appears to be a unique private crypter that is present in all Bumblebee\nbinaries. The crypter uses an export function named “setPath:”\n\n\n-----\n\nFigure 14 – Crypter export function “setPath.”\nEven before unpacking the sample (simply by looking at the strings of the file) it is clear that\nno major changes are made.\n\n[The “stolen” open-source code for the anti-vm is still present:](https://github.com/LordNoteworthy/al-khaser)\n\nFigure 15 – Strings associated with Anti-VM Code.\nThe code is a huge collection of various techniques used to identify if a program is executed\nin a virtual machine or using emulation and if debuggers and sandboxes indicators are\npresent in the running environment.\n\n\n-----\n\nFigure 16 – Open-source code used for Anti-VM.\nThere are checks for processes of known malware analysis and debugging tools as well as\nprocesses related to virtualization.\n\nSpecific registry keys are queried to identify whether the system is virtual. In addition, there\nare checks for DLL and SYS files and specific folders that will exist only in a virtual machine.\n\nThe MAC address is also checked as virtual network cards can be easily identified by the\nname of their virtualization vendor.\n\nVarious WMI queries are done for system information, such as fan information.\n\n\n-----\n\nFigure 17 –\n\nBumblebee hooking various Windows functions.\n[A full, detailed overview of Bumblebee malware can be found here.](https://elis531989.medium.com/the-chronicles-of-bumblebee-the-hook-the-bee-and-the-trickbot-connection-686379311056)\n\n## Link to the Threat Actor\n\n[The observed attack chain is consistent with EXOTIC LILY activity.](https://blog.google/threat-analysis-group/exposing-initial-access-broker-ties-conti/)\n\nThe attackers registered a visually similar domain, using a lowercase “L” instead of a\nlowercase “I” which spoofed a legitimate U.S.-based cybersecurity company.\n\nThe attackers created an email box impersonating an employee of the company and sent\nbusiness proposal leads.\n\nThe mails are written in proper English, including an email signature which looks very similar\nto the signature used by the company. The domain in the email signature is changed to the\nfake domain created by the attackers.\n\nAlthough it might be coincidental, the attackers chose to send the mails around the time of\nBlack Hat USA; this might be because many sales teams are out of office and attend the\nconference and we speculate that they may have less security measures outside the office\nand are constantly networking, making it more realistic that a business proposal email would\nbe sent, received, and read during the show.\n\n[One notable change in EXOTIC LILY’s activity is the addition of the “Smash” file transfer](https://bazaar.abuse.ch/browse/tag/Smash/)\nplatform to deliver Bumblebee.\n\n\n-----\n\nAs noted by Google s TAG, EXOTIC LILY seems to operate as a separate entity, focusing on\nacquiring initial access through email campaigns, with follow-up activities that include\ndeployment of Conti and Diavol ransomware, which are performed by a different set of\nactors.”\n\nIBM [found connections and code similarities between Bumblebee, Ramnit, and Trickbot](https://securityintelligence.com/posts/from-ramnit-to-bumblebee-via-neverquest/)\nmalware which seem to be developed by the same group that developed the Conti\nransomware.\n\nHowever, “Conti” [no longer exists, and as noted by IBM, Bumblebee has been linked to](https://www.advintel.io/post/discontinued-the-end-of-conti-s-brand-marks-new-chapter-for-cybercrime-landscape)\n[Quantum ransomware.](https://thedfirreport.com/2022/04/25/quantum-ransomware/)\n\n## Deep Instinct Prevention of Bumblebee Attack\n\nWhile Deep Instinct prevented the attack pre-execution the detection rate of the PowerShell\npayload was zero on VT when first seen, and even a few days after only three more generic\ndetections were added.\n\nFigure 18 –\n\nMalicious PowerShell zero detection on first seen in VT.\n\nFigure 19 – VirusTotal detection evolution for the malicious PowerShell.\nThe below prevention notification proves once again that a signature-based detection is not\neffective against new or modified attack flows.\n\n\n-----\n\nFigure 20 –\n\nPrevention by Deep Instinct.\n\nIf you’d like to learn more about our malware, ransomware, and zero-day prevention\ncapabilities – including our industry-best $3M no-ransomware guarantee – we’d be delighted\nto [give you a demo.](https://www.deepinstinct.com/request-a-demo)\n\n## IOCs\n\n\ncontainer.vhd\n(sha256)\n\nQuote.lnk\n(sha256)\n\nquotefile.ps1\n(sha256)\n\nstage2.ps1\n(sha256)\n\npayload.dll\n(sha256)\n\n\n91d29cfe549d8c7ade35f681ea60ce73a48e00c2f6d55a608f86b6f17f494d0d\n\n940182dd2eaf42327457d249f781274b07e7978b62dca0ae4077b438a8e13937\n\nd6cc3ac995484b99ed790b6f8ceb145492794eb5d01ec4a71123b9975e9bfd20\n\n5d000af554dcd96efa066301b234265892b8bf37bf134f21184096bdc3d7230b\n\n0b0a5f3592df7b538b8d8db4ba621b03896f27c9f112b88d56761972b03e6e58\n\n\n[https://www.youtube.com/watch?v=M93qXQWaBdE](https://www.youtube.com/watch?v=M93qXQWaBdE)\n\n[Back To Blog](https://www.deepinstinct.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-24 - The Dark Side of Bumblebee Malware Loader.pdf"
    ],
    "report_names": [
        "2022-08-24 - The Dark Side of Bumblebee Malware Loader.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4594f985-865e-4862-8047-2e80226e246a",
            "created_at": "2022-10-27T08:27:12.984825Z",
            "updated_at": "2025-03-27T02:00:55.424827Z",
            "deleted_at": null,
            "main_name": "EXOTIC LILY",
            "aliases": [
                "EXOTIC LILY"
            ],
            "source_name": "MITRE:EXOTIC LILY",
            "tools": [
                "Bazar"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "56384d06-abc2-4853-8440-db4d7b7d1b5f",
            "created_at": "2023-01-06T13:46:39.367122Z",
            "updated_at": "2025-03-27T02:00:03.064071Z",
            "deleted_at": null,
            "main_name": "EXOTIC LILY",
            "aliases": [
                "DEV-0413"
            ],
            "source_name": "MISPGALAXY:EXOTIC LILY",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535691,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1662984067,
    "ts_modification_date": 1662984067,
    "files": {
        "pdf": "https://archive.orkl.eu/5f83835ced4d6739ec6be35d24c830e9f242d7f0.pdf",
        "text": "https://archive.orkl.eu/5f83835ced4d6739ec6be35d24c830e9f242d7f0.txt",
        "img": "https://archive.orkl.eu/5f83835ced4d6739ec6be35d24c830e9f242d7f0.jpg"
    }
}