{
    "id": "7103af8c-f2ce-439b-866e-8ae56b535a77",
    "created_at": "2023-01-12T15:08:47.907599Z",
    "updated_at": "2025-03-27T02:05:44.701065Z",
    "deleted_at": null,
    "sha1_hash": "f0978023c8630e5c1603f11f0b309ad5984f87bb",
    "title": "2022-02-28 - New Chinese hacking tool found, spurring U.S. warning to allies",
    "authors": "",
    "file_creation_date": "2022-05-27T21:35:53Z",
    "file_modification_date": "2022-05-27T21:35:53Z",
    "file_size": 178141,
    "plain_text": "# New Chinese hacking tool found, spurring U.S. warning to allies\n\n**[reuters.com/technology/new-chinese-hacking-tool-found-spurring-us-warning-allies-2022-02-28/](https://www.reuters.com/technology/new-chinese-hacking-tool-found-spurring-us-warning-allies-2022-02-28/)**\n\nBy Christopher Bing\n\nA man holds a laptop computer as cyber code is projected on him in this illustration picture\ntaken on May 13, 2017. REUTERS/Kacper Pempel/Illustration/\n\nRegister now for FREE unlimited access to Reuters.com\n\nFeb 28 (Reuters) - Security researchers with U.S. cybersecurity firm Symantec said they\nhave discovered a “highly sophisticated” Chinese hacking tool that has been able to escape\npublic attention for more than a decade.\n\nThe discovery was shared with the U.S. government in recent months, who have shared the\ninformation with foreign partners, said a U.S. official. Symantec, a division of chipmaker\nBroadcom [(AVGO.O), published its research about the tool, which it calls Daxin, on Monday.](https://www.reuters.com/companies/AVGO.O)\n\n“It’s something we haven’t seen before,” said Clayton Romans, associate director with the\nU.S. Cybersecurity Infrastructure Security Agency (CISA). “This is the exact type of\ninformation we’re hoping to receive.”\n\nRegister now for FREE unlimited access to Reuters.com\n\nCISA highlighted Symantec’s membership in a joint public-private cybersecurity information\nsharing partnership, known as the JCDC, alongside the new research paper.\n\n\n-----\n\nThe JCDC, or Joint Cyber Defense Collaborative, is a collective of government defense\nagencies, including the FBI and National Security Agency, and 22 U.S. technology\ncompanies that share intelligence about active cyberattacks with one another.\n\nThe Chinese embassy in Washington did not respond to a request for comment. Chinese\nofficials have previously said China is also a victim of hacking and opposes all forms of cyber\nattacks.\n\n\"The capabilities of this malware are remarkable and would be extremely difficult to detect\nwithout this public research,\" said Neil Jenkins, chief analytics officer at the Cyber Threat\nAlliance, a non-profit group that brings together cybersecurity experts to share data.\n\nSymantec’s attribution to China is based on instances where components of Daxin were\ncombined with other known, Chinese-linked computer hacker infrastructure or cyberattacks,\nsaid Vikram Thakur, a technical director with Symantec.\n\nSymantec researchers said the discovery of Daxin was noteworthy because of the scale of\nthe intrusions and the advanced nature of the tool.\n\n\"The most recent known attacks involving Daxin occurred in November 2021,\" the research\nreport reads. \"Daxin’s capabilities suggest the attackers invested significant effort into\ndeveloping communication techniques that can blend in unseen with normal network traffic.\"\n\nDaxin’s victims included high-level, non-Western government agencies in Asia and Africa,\nincluding Ministries of Justice, Thakur added.\n\n“Daxin can be controlled from anywhere in the world once a computer is actually infected,”\nsaid Thakur. “That’s what raises the bar from malware that we see coming out of groups\noperating from China.”\n\nRomans said he did not know of affected organizations in the United States, but there were\ninfections all around the globe, which the U.S. government was helping to notify.\n\n“Clearly the actors have been successful in not only conducting campaigns but being able to\nkeep their creation under wraps for well over a decade,” said Thakur.\n\n(This story refiles to add missing word 'not' in paragraph 13)\n\nRegister now for FREE unlimited access to Reuters.com\n\nReporting by Christopher Bing; Editing by Nick Zieminski and Mark Porter\n\nOur Standards: [The Thomson Reuters Trust Principles.](https://www.thomsonreuters.com/en/about-us/trust-principles.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - New Chinese hacking tool found, spurring U.S. warning to allies.pdf"
    ],
    "report_names": [
        "2022-02-28 - New Chinese hacking tool found, spurring U.S. warning to allies.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536127,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653687353,
    "ts_modification_date": 1653687353,
    "files": {
        "pdf": "https://archive.orkl.eu/f0978023c8630e5c1603f11f0b309ad5984f87bb.pdf",
        "text": "https://archive.orkl.eu/f0978023c8630e5c1603f11f0b309ad5984f87bb.txt",
        "img": "https://archive.orkl.eu/f0978023c8630e5c1603f11f0b309ad5984f87bb.jpg"
    }
}