{
    "id": "71044062-718b-4999-b178-87b44d0da31f",
    "created_at": "2023-01-12T15:02:21.382923Z",
    "updated_at": "2025-03-27T02:17:02.411553Z",
    "deleted_at": null,
    "sha1_hash": "0c8c010200b60698bc8e3ddfe63234b85d0b156b",
    "title": "2020-05-05 - Tinker Telco Soldier Spy",
    "authors": "",
    "file_creation_date": "2022-05-28T03:29:49Z",
    "file_modification_date": "2022-05-28T03:29:49Z",
    "file_size": 50875,
    "plain_text": "# Tinker Telco Soldier Spy\n\n**troopers.de/troopers22/talks/7cv8pz**\n\n## Talk\n\nGo back\nChina-based threat actors have persistently targeted the telecommunications sector for\nmany years. In this talk, PwC Threat Intelligence (PwC TI) analysts will share their research\nand present on case studies for several China-based threats currently targeting telcos\nprolifically, including well-known threats such as GALLIUM, who PwC tracks as Red Dev 4,\nand lesser-known threat actors which have never been publicly disclosed before.\n\nSpecifically, Will and Ben will discuss some of the common tactics, techniques, and\nprocedures (TTPs) these adversaries are using to compromise telcos, including some of\ntheir vulnerability preferences, and the strategic backdrop and objectives motivating this\ntargeting.\n\nIntroduction\n\nWe’ll begin by briefly setting the scene, with a discussion of the China-based threat\nlandscape more broadly, particularly as it relates to telecommunications. This will include\ndiscussion of some of the wider targeting we’ve seen previously.\n\nRed Dev 4 / GALLIUM\n\nNext, we’ll discuss a specific example: Red Dev 4 (a.k.a. GALLIUM) is a China-based threat\nactor which has compromised telecommunications entities globally. There has been no\npublic reporting on GALLIUM since 2019, however, we assess that it remains active as of at\nleast March 2022.\n\nWe will discuss some of the recent techniques we’ve seen Red Dev 4 use to maintain\nfootholds within victim environments, such as the delivery of SoftEther VPN clients\nconfigured to connect to threat actor-owned infrastructure. This will allow us to demonstrate\ntechniques to track similar activity, and to discover victims in network telemetry. We will also\nreference SoftEther configuration files submitted to an online multi-antivirus scanner by\nvictims, the contained log files of which have assisted in identifying further malicious activity\nin victim networks.\n\nLastly, we will reference victimology and demonstrate how this reflects geopolitical activities\nand therefore suggests the targeting aligns with China’s strategic aims.\n\nRed Menshen\n\n\n-----\n\nNext, we ll introduce a threat actor we track as Red Menshen. We first discovered this actor\nin 2021, when we detected a sample of a Linux backdoor we track as BPFDoor. We will\nbriefly highlight some of the functionality of BPFDoor, and the ways in which Red Menshen\nuses it to maintain stealthy persistence and move laterally within victim environments..\nBased on this analysis, we were able to identify victims in the telecommunications,\ngovernment, and education sectors throughout Asia.\n\nBy analyzing network telemetry related to the victims we discovered, we were able to\ndiscover recent Red Menshen infrastructure, and to uncover the threat actor’s upstream\ninfrastructure. This led to the discovery of the suspected compromise of several hundred\nrouters in Taiwan, which are used as proxies in order to access threat actor infrastructure\nand browse to websites.\n\nConclusions\n\nWe will conclude by discussing the wider motivations of China’s ongoing exploitation of\ntelecommunications providers. This spans a wide range, from targeting information on\nspecific subscribers, to potentially developing access to core networks which can later be\nexploited for intelligence value. We assess that it is highly likely that telecommunications\norganisations will remain a key target for China-based threat actors. ***** ##### Attendee\ntakeaways 1. The talk will advance public knowledge of nation-state cyber threats against\nthe telecommunications industry worldwide.\n\n1. We will share in-depth threat intelligence about sophisticated nation state threat actors\n\nthat has not been publicly disclosed before, including their techniques and targeting.\n\n2. Attendees will leave with a better understanding of how to identify, and defend against,\n\nthese threat actors’ operations and how to better secure their environments against\ncompromise.\n\n## About the Speakers\n\n### Ben Jackson\n\nBen is a Senior Threat Intelligence Analyst and Reverse Engineer in PwC’s Global Threat\nIntelligence team. Ben’s day to day spans reverse engineering of custom and persistent\nmalware implants, as well as analysis of upstream communications and threat actors’ C2\nmanagement. He conducts technical research into threat actors with a variety of origins and\nmotivations, with particular focus on sophisticated, espionage-motivated threats based in\nRussia and China.\n\n### Will Bonner\n\n\n-----\n\nWill leads the APAC Research Team within PwC s Global Threat Intelligence team. He has 5\nyears experience working in the Threat Intelligence industry in the public sector, and brings\nexpertise in analysing malware and network communications, particularly malware\nbeaconing and victim identification. While Will has experience researching a broad range of\nthreat actors based in various parts of the world, he currently focuses on those attributed to\nthe APAC region.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-05 - Tinker Telco Soldier Spy.pdf"
    ],
    "report_names": [
        "2020-05-05 - Tinker Telco Soldier Spy.pdf"
    ],
    "threat_actors": [
        {
            "id": "9faf32b7-0221-46ac-a716-c330c1f10c95",
            "created_at": "2022-10-25T16:07:23.652281Z",
            "updated_at": "2025-03-27T02:02:09.908624Z",
            "deleted_at": null,
            "main_name": "Gallium",
            "aliases": [
                "Alloy Taurus",
                "Granite Typhoon",
                "Phantom Panda"
            ],
            "source_name": "ETDA:Gallium",
            "tools": [
                "Agentemis",
                "BlackMould",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "Gh0stCringe RAT",
                "HTran",
                "HUC Packet Transmit Tool",
                "LaZagne",
                "Mimikatz",
                "NBTscan",
                "PingPull",
                "Plink",
                "Poison Ivy",
                "PsExec",
                "PuTTY Link",
                "QuarkBandit",
                "Quasar RAT",
                "QuasarRAT",
                "Reshell",
                "SPIVY",
                "SinoChopper",
                "SoftEther VPN",
                "Sword2033",
                "WCE",
                "WinRAR",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Yggdrasil",
                "cobeacon",
                "nbtscan",
                "netcat",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2025-03-27T02:00:55.414817Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c87ee2df-e528-4fa0-bed6-6ed29e390688",
            "created_at": "2023-01-06T13:46:39.150432Z",
            "updated_at": "2025-03-27T02:00:03.008665Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "Red Dev 4",
                "Alloy Taurus",
                "Granite Typhoon"
            ],
            "source_name": "MISPGALAXY:GALLIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9c8a7541-1ce3-450a-9e41-494bc7af11a4",
            "created_at": "2023-01-06T13:46:39.358343Z",
            "updated_at": "2025-03-27T02:00:03.06082Z",
            "deleted_at": null,
            "main_name": "Red Menshen",
            "aliases": [
                "Red Dev 18"
            ],
            "source_name": "MISPGALAXY:Red Menshen",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535741,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1653708589,
    "ts_modification_date": 1653708589,
    "files": {
        "pdf": "https://archive.orkl.eu/0c8c010200b60698bc8e3ddfe63234b85d0b156b.pdf",
        "text": "https://archive.orkl.eu/0c8c010200b60698bc8e3ddfe63234b85d0b156b.txt",
        "img": "https://archive.orkl.eu/0c8c010200b60698bc8e3ddfe63234b85d0b156b.jpg"
    }
}