{
    "id": "7111422b-edb6-4bc7-8c8d-f926ef231897",
    "created_at": "2023-01-12T15:02:34.883491Z",
    "updated_at": "2025-03-27T02:08:40.456054Z",
    "deleted_at": null,
    "sha1_hash": "06d2f1593890dc9625ecce45d860dbfebadd3db7",
    "title": "2021-08-30 - ProxyToken- An Authentication Bypass in Microsoft Exchange Server",
    "authors": "",
    "file_creation_date": "2022-05-29T10:52:32Z",
    "file_modification_date": "2022-05-29T10:52:32Z",
    "file_size": 245180,
    "plain_text": "# ProxyToken: An Authentication Bypass in Microsoft Exchange Server\n\n**[zerodayinitiative.com/blog/2021/8/30/proxytoken-an-authentication-bypass-in-microsoft-exchange-server](https://www.zerodayinitiative.com/blog/2021/8/30/proxytoken-an-authentication-bypass-in-microsoft-exchange-server)**\n\nAugust 30, 2021\n\nAugust 30, 2021 | Simon Zuckerbraun\n[SUBSCRIBE](https://www.zerodayinitiative.com/rss/)\n\nContinuing with the theme of serious vulnerabilities that have recently come to light in Microsoft\nExchange Server, in this article we present a new vulnerability we call ProxyToken. It was reported to\nthe Zero Day Initiative in March 2021 by researcher Le Xuan Tuyen of VNPT ISC, and it was patched by\nMicrosoft in the July 2021 Exchange cumulative updates. Identifiers for this vulnerability are CVE-202133766 and [ZDI-CAN-13477.](https://www.zerodayinitiative.com/advisories/ZDI-21-798/)\n\nWith this vulnerability, an unauthenticated attacker can perform configuration actions on mailboxes\nbelonging to arbitrary users. As an illustration of the impact, this can be used to copy all emails\naddressed to a target and account and forward them to an account controlled by the attacker.\n\n**The Trigger**\n\nThe essential HTTP traffic needed to trigger the vulnerability is as follows:\n\n“SecurityToken=x”? What might this be, some secret backdoor access code?\n\n**Understanding the Root Cause**\n\nTo understand what has happened here, it is necessary to discuss a bit about the architecture of\n[Exchange Server. Recently, security researcher Orange Tsai has done excellent work in this area, and](https://www.twitter.com/orange_8361)\n[readers are encouraged to read his full findings here as well as the recent](https://devco.re/blog/2021/08/06/a-new-attack-surface-on-MS-exchange-part-1-ProxyLogon/) [guest blog he wrote on this](https://www.zerodayinitiative.com/blog/2021/8/17/from-pwn2own-2021-a-new-attack-surface-on-microsoft-exchange-proxyshell)\nsite. However, for the purposes of this particular vulnerability, the salient points will be summarized\nbelow.\n\nMicrosoft Exchange creates two sites in IIS. One is the default website, listening on ports 80 for HTTP\nand 443 for HTTPS. This is the site that all clients connect to for web access (OWA, ECP) and for\nexternally facing web services. It is known as the “front end”. The other site is named “Exchange Back\nEnd” and listens on ports 81 for HTTP and 444 for HTTPS.\n\nThe front-end website is mostly just a proxy to the back end. To allow access that requires forms\nauthentication, the front end serves pages such as `/owa/auth/logon.aspx . For all post-`\nauthentication requests, the front end’s main role is to repackage the requests and proxy them to\ncorresponding endpoints on the Exchange Back End site. It then collects the responses from the back\nend and forwards them to the client.\n\n\n-----\n\nExchange is a highly complex product, though, and this can lead to some wrinkles in the usual flow. In\nparticular, Exchange supports a feature called “Delegated Authentication” supporting cross-forest\ntopologies. In such deployments, the front end is not able to perform authentication decisions on its\nown. Instead, the front end passes requests directly to the back end, relying on the back end to\ndetermine whether the request is properly authenticated. These requests that are to be authenticated\nusing back-end logic are identified by the presence of a `SecurityToken cookie:`\n\nIn `Microsoft.Exchange.HttpProxy.ProxyModule.SelectHandlerForUnauthenticatedRequest :`\n\nThus, for requests within `/ecp, if the front end finds a non-empty cookie named` `SecurityToken, it`\ndelegates authentication to the back end.\n\nCode on the back end that examines and validates the `SecurityToken cookie is found in the class`\n```\nMicrosoft.Exchange.Configuration.DelegatedAuthentication.DelegatedAuthenticationModule .\n\n```\nWhat goes wrong on the validation side? To see the answer, have a look at `/ecp/web.config on the`\nback end:\n\nAs you can see, in a default configuration of the product, a `<remove> element appears, so that the`\nmodule `DelegatedAuthModule will not be loaded at all for the back-end ECP site.`\n\nIn summary, when the front end sees the `SecurityToken cookie, it knows that the back end alone is`\nresponsible for authenticating this request. Meanwhile, the back end is completely unaware that it needs\nto authenticate some incoming requests based upon the `SecurityToken cookie, since the`\n```\nDelegatedAuthModule is not loaded in installations that have not been configured to use the special\n\n```\ndelegated authentication feature. The net result is that requests can sail through, without being\nsubjected to authentication on either the front or back end.\n\n**Bagging a Canary**\n\nThere is one additional hurdle to clear before we can successfully issue an unauthenticated request, but\nit turns out to be a minor one. Each request to an `/ecp page is required to have a ticket known as the`\n“ECP canary”. Without a canary, the request will come back with an HTTP 500. However, the attacker is\nstill in luck, because the 500 error response is accompanied by a valid canary:\n\n\n-----\n\nAn example of the final request would then be as follows:\n\nThis particular exploit assumes that the attacker has an account on the same Exchange server as the\nvictim. It installs a forwarding rule that allows the attacker to read all the victim’s incoming mail. On\nsome Exchange installations, an administrator may have set a global configuration value that permits\nforwarding rules having arbitrary Internet destinations, and in that case, the attacker does not need any\nExchange credentials at all. Furthermore, since the entire `/ecp site is potentially affected, various`\nother means of exploitation may be available as well.\n\n**Conclusion**\n\nExchange Server continues to be an amazingly fertile area for vulnerability research. This can be\nattributed to the product’s enormous complexity, both in terms of feature set and architecture. We look\nforward to receiving additional vulnerability reports in the future from our talented researchers who are\n[working in this space. Until then, follow the team for the latest in exploit techniques and security](https://twitter.com/thezdi)\npatches.\n\n[Microsoft](http://10.10.0.46/blog?tag=Microsoft)\n[Exchange](http://10.10.0.46/blog?tag=Exchange)\n[Exploit](http://10.10.0.46/blog?tag=Exploit)\n\n[BACK TO THE BLOG](http://10.10.0.46/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-30 - ProxyToken- An Authentication Bypass in Microsoft Exchange Server.pdf"
    ],
    "report_names": [
        "2021-08-30 - ProxyToken- An Authentication Bypass in Microsoft Exchange Server.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535754,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653821552,
    "ts_modification_date": 1653821552,
    "files": {
        "pdf": "https://archive.orkl.eu/06d2f1593890dc9625ecce45d860dbfebadd3db7.pdf",
        "text": "https://archive.orkl.eu/06d2f1593890dc9625ecce45d860dbfebadd3db7.txt",
        "img": "https://archive.orkl.eu/06d2f1593890dc9625ecce45d860dbfebadd3db7.jpg"
    }
}