{
    "id": "715058b5-6bc5-4f50-a7a2-2c813bb29a51",
    "created_at": "2023-01-12T15:10:40.916238Z",
    "updated_at": "2025-03-27T02:09:18.800847Z",
    "deleted_at": null,
    "sha1_hash": "70757f3eec3c50baa9b4b83d58d48534fa6e9a9d",
    "title": "2020-06-22 - IndigoDrop spreads via military-themed lures to deliver Cobalt Strike",
    "authors": "",
    "file_creation_date": "2022-05-28T15:28:31Z",
    "file_modification_date": "2022-05-28T15:28:31Z",
    "file_size": 2413805,
    "plain_text": "# IndigoDrop spreads via military-themed lures to deliver Cobalt Strike\n\n**blog.talosintelligence.com/2020/06/indigodrop-maldocs-cobalt-strike.html**\n\nBy Asheer Malhotra.\n\nCisco Talos has observed a malware campaign that utilizes military-themed malicious Microsoft Office documents (maldocs) to spread\nCobalt Strike beacons containing full-fledged RAT capabilities.\nThese maldocs use malicious macros to deliver a multistage and highly modular infection.\nThis campaign appears to target military and government organizations in South Asia.\nNetwork-based detection, although important, should be combined with endpoint protections to combat this threat and provide multiple\nlayers of security.\n\n## What's new?\n\n\n-----\n\nCisco Talos has recently discovered a new campaign distributing a multistage attack used to infect target endpoints with customized Cobalt\nStrike beacons. Due to the theme of the malicious documents (maldocs) employed, it is highly likely that military and government\norganizations in South Asia were targeted by this attack.\n\n## How did it work?\n\nThe attack consists of a highly modular dropper executable we're calling \"IndigoDrop\" dropped to a victim's endpoint using maldocs.\nIndigoDrop is responsible for obtaining the final payload from a download URL for deployment. The final payloads currently observed by\nTalos are Cobalt Strike beacons.\n\nIn this post, we illustrate the core technical capabilities of the maldocs, IndigoDrop and the Cobalt strike beacons components including:\n\nThe maldocs-based infection chain.\nIndigoDrop's functionality.\nCommunication mechanisms and infrastructure used to download infection artifacts.\nDetailed configurations of the Cobalt Strike beacons.\n\n## So what?\n\nThis attack demonstrates how the adversary operates a targeted attack that:\n\nUses legitimate-looking lures to trick the target into infecting themselves.\nEmploys a highly modular infection chain (implemented in the IndigoDrop) to instrument the final payload.\nUses an existing offensive framework (Cobalt Strike) to establish control and persist in the target's network without having to develop a\nbespoke remote access trojan (RAT).\n\nAnalysis of recently discovered attack-chain variations provides insights into the evolution of this threat. These evolutions indicate the\nchanges in tactics and techniques of the attackers used to continue attacks while trying to bypass detections. This campaign also shows us\nthat while network-based detection is important, it should be complemented with system behavior analysis and endpoint protections for\nadditional layers of security.\n\n## Analysis of maldocs\n\nThis attack uses two techniques to deliver malicious macros to be executed on the target's endpoint:\n\nMalicious macros already embedded, ready to execute.\n[Malicious macro downloaded as part of an externally linked template that is then injected into the original lure maldoc.](https://blog.talosintelligence.com/2017/07/template-injection.html)\n\n**Maldoc lures**\n\nThis attack consisted of maldocs masquerading as internal government or military documents. For example, some of the maldocs discovered\nby Talos masquerade as Indian Air Publications (IAP) documents dictating safeguard procedures for the IT infrastructure of the Indian Air\nForce (IAF).\n\nThese documents are aptly named:\n\nIAP3903.doc - Contains embedded malicious macro.\nIAP39031.docx - Uses template injection.\n\nSample content of the maldoc lures:\n\n\n-----\n\n**Fake document or weaponized copy?**\n\nMany targeted attacks employing maldocs observed by Talos usually consist of utmost a couple of pages of decoy content to make them look\nlegitimate. The documents used in this attack, however, contain legitimate content (~64 pages, ~15k words), making them seem even more\n\n\n-----\n\nbonafide. Talos also found a benign copy of one of the maldocs indicating that it is highly likely that the attackers weaponized and distributed\nit to targets\n\n(Benign copy hash: 0d16b15972d3d0f8a1481db4e2413a2c519e8ac49cd2bf3fca02cfa3ff0be532).\n\n**Malicious VBA Analysis**\n\nThis section consists of an analysis of malicious macros used to carry out the attacks using:\n\nLocally embedded malicious macros and\nMalicious macros embedded in the injected templates downloaded from a remote location.\n\nThe malicious macros carry out the following malicious activities:\n\n1. Parse a Windows executable's hardcoded bytes into bytes that can be written to a file on disk.\n2. The parsed bytes are written to an EXE file in the currently logged in user's Startup directory: E.g.\n\n%userprofile%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\anything.exe\n3. Once the malicious EXE (second-stage payload — IndigoDrop ) has been written to the user's Startup directory the macro quits\n\nexecution without executing the actual second-stage payload.\n4. The attack relies on the user either logging in again or restarting the system to activate the second-stage payload on the infected\n\nendpoint.\n5. The second-stage payload in this attack is a custom dropper (IndigoDrop) that carries out a variety of tasks.\n\nMalicious macro code:\n\n**Maldoc distribution**\n\nOne of the maldocs disclosed here was referred to by a Bit.ly-shortened URL (created Jan. 23, 2020) — hxxp://bit[.]ly/iaf-guidelines — which\nredirects to hxxp://tecbeck[.]com/IAP39031[.]docx.\n\nIt is highly likely that the attackers hosted the maldocs on a public server and distributed the direct or Bit.ly links to the targets in the form of\nspear-phishing emails. This may be done to bypass detection systems that scan email attachments for malware.\n\n## Stage 2: Dropper binary — IndigoDrop\n\nThe second-stage binary dropped to disk by the maldocs is a malicious dropper/loader we're calling \"IndigoDrop\" designed to download and\nactivate a customized Cobalt Strike beacon (final payload DLL) from another remote location.\n\nBefore we delve into a detailed analysis, some of the key operational features of IndigoDrop are:\n\nHighly modular in nature: IndigoDrop usually consists of three hardcoded locations that can be used to download and activate the next\npayload.\n\n\n-----\n\nIn this attack, IndigoDrop utilizes both attacker operated remote locations and public data hosting platforms such as pastebin[.]com to\nhost the next stage payloads.It is highly likely that this dropper may download the final payload from these remote locations (likely done\nin other variants of the attack).\nHowever this instance of the attack downloads a Metasploit shellcode from the hardcoded remote locations. We will refer to this\nMetasploit shellcode as Stage 2A in this post (detailed later-on).The Metasploit shellcode (Stage 2A) is hosted in the form of a Base64\nencoded string on the download locations. This shellcode is base64 decoded, unhexlified and executed on the endpoint as part of\nIndigoDrop's execution.\n\nBase64-encoded Metasploit shellcode:\n\nBase64-decoded Metasploit shellcode:\n\n**IndigoDrop analysis**\n\nThis dropper performs the following actions on the endpoint:\n\nEstablish persistence using the registry Run key for itself in location:\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run | iexplorer = cmd /c <file_path_of_Dropper> /onboot -hide\n\nE.g.\n\nDownload and execute the Stage 2A Metasploit shellcode.\nAnti-Infection Checks: Check the current Username, Computername, parent folder name, MAC addresses, Public IP addresses against\na list of blocked values. If any of the values match, IndigoDrop quits (Blocked values listed in the IOC section).\n\n## Stage 2A: Metasploit (MSF) downloader shellcode\n\nThe Metasploit shellcode is a modified reverse HTTP stager meant to download a malicious file from the specified download location. This\nshellcode (stage 2A) is usually hosted on a public hosting site such as pastebin[.]com.\n\nThe malicious file downloaded is usually a copy of a trojanized jquery[.]min.js file. The malicious jQuery file consists of:\n\nLegitimate JavaScript (JS) code at the top and end of the file.\nAt a specific offset in the file is yet another shellcode (referred to as Stage 3A).\n\n\n-----\n\nThe Metasploit HTTP stager carries out the following actions in sequence:\n\n1. Connect to the malicious attacker-controlled IP address.\n2. Download the malicious jquery-3.3.0.min[.]js file to an executable memory location.\n3. Jump to the malicious shellcode embedded in the jquery file and start executing Stage 3A.\n\nMalicious jquery file:\n\nStage 2A Metasploit shellcode downloading the jQuery file to executable memory and jumping to the specified offset:\n\n## Stage 3A: Decoder shellcode\n\nThe malicious jQuery file contains the decoder shellcode (Stage 3A) and the final Cobalt Strike beacon DLL. The beacon DLL is, however,\nXOR-encoded. It is the responsibility of the decoder shellcode to decode and activate this final payload in the dropper process' memory.\n\nDecoder shellcode decoding the final RAT payload:\n\n\n-----\n\n## Stage 3B: Cobalt Strike beacon\n\nThe final RAT payload is actually a Cobalt Strike beacon. Once the beacon DLL has been decoded, the decoder shellcode (Stage 3A) jumps\nto the beginning of the MZ in memory instead of going to the DllEntryPoint. This is done to calculate and jump to the address to the loader\nroutine (usually also an exported subroutine) that will carry out reflective-DLL-loading of the Cobalt Strike beacon DLL in the dropper process'\nmemory.\n\nCode beginning at the beacon's base image calculating and jump to address of the reflective loader (via call ebx):\n\nAfter the loader routine has completed setting up the DLL in memory (re-building Imports, base relocations, etc.) it will then jump to the\nDllEntryPoint (or DllMain) of the beacon to activate the final and most important stage of the infection — the actual RAT components of the\nbeacon.\n\n**Configurations used**\n\n[Cobalt Strike beacons use configurations specified via \".profile\" files in the framework. These configurations describe various characteristics](https://www.cobaltstrike.com/help-malleable-c2)\nof the malicious payload (beacon binary) including:\n\nC2 configuration\nCommunication protocols\nProcess injection techniques, etc.\n\nThe profiles used in this attack by the beacon binaries attempt to mimic a legitimate jquery request. The most common configurations used in\nthis attack were:\n\nBeacon type = HTTP\nCnC URL resource location = /jquery-3.3.1.min.js\nHTTP Post location = /jquery-3.3.2.min.js\nUser Agent = Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.157\nSafari/537.36\n\n\n-----\n\nHTTP Get Metadata\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\nHost: code.jquery.com\nReferer: http://code.jquery.com/\nAccept-Encoding: gzip, deflate\n__cfduid=\nCookie\n\nHTTP Post Metadata =\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\nHost: code.jquery.com\nReferer: http://code.jquery.com/\nAccept-Encoding: gzip, deflate\n__cfduid\n\nIdle DNS IP = 74[.]125.196.113 (google[.]com)\nSpawn processes =\n\n%windir%\\syswow64\\dllhost.exe\n%windir%\\sysnative\\dllhost.exe\n\nProcess injection configuration =\n\nntdll:RtlUserThreadStart\nCreateThread\nNtQueueApcThread-s\nCreateRemoteThread\nRtlCreateUserThread\n\n**Capabilities**\n\nThe Cobalt Strike beacons used in this attack support a wide variety of capabilities (also known as commands) including:\n\nExecution of arbitrary code in target processes via injection.\nExecution of arbitrary commands on the infected endpoint.\nDownload and upload files.\nImpersonate users.\nEnumerate, copy, delete, timestomp files.\nModify, query the Windows registry.\nUse of malleable jquery CnC profiles to impersonate legitimate traffic.\n\nThe overall infection chain is illustrated as follows:\n\n\n-----\n\n## Pastebin usage:\n\nThis attack utilizes pastebin[.]com extensively to host the Metasploit downloader shellcode (Stage 2A). The shellcode hosted on pastebin is\neither created through a guest account or owned by five registered accounts, specifically:\n\nhxxps://pastebin[.]com/u/r_ajeevshikra\nhxxps://pastebin[.]com/u/ra_jeevshikra\nhxxps://pastebin[.]com/u/raj_eevshikra\nhxxps://pastebin[.]com/u/raje_evshikra\nhxxps://pastebin[.]com/u/rajeev_shikra\n\nPastebin account operated by the attacker:\n\nThe base64-encoded Metasploit downloader shellcode (Stage 2A) hosted on Pastebin.\n\n\n-----\n\n## Python components\n\nTalos also found Python-based modules related to this threat (pyinstaller EXEs). These modules may have been used in a different campaign\nor deployed by the Cobalt Strike beacons as part of this attack. Two python modules discovered served the following purposes:\n\nGather initial system information and send it to the C2 server.\nExtract credentials from the infected system and print to console.\n\nSysinfo gathering capabilities of the Python modules:\n\nCredentials stolen from the endpoint by the other python module were from:\n\nGoogle Chrome\nMicrosoft Edge\nOpera\n\n\n-----\n\nMozilla Firefox\nWiFi credentials\n\nCredential-stealing module of the attack (snip):\n\n## Evolution of attacks\n\nTalos discovered multiple variants of the attack instrumenting the Metasploit shellcode and ultimately activating the final payload (Cobalt\nStrike beacons).\n\nThis section shows the evolution of the attack and the introduction/modification of its features at different stages of the engineering process.\n\n**Apr 2018: No droppers**\n\n\n-----\n\nThis is the earliest discovered variant of the attack. The threat also begins with a maldoc containing a malicious macro. The payload dropped\nto disk is a \".crt\" file. This file is decoded by the malicious macro using 'certutil' to obtain the next stage payload binary (EXE) which is then\nexecuted on the target endpoint.\n\nThe payload activated by the macro is not a dropper. This early variant of the attack does not utilize an intermediate dropper to download and\nactivate the final beacon on the endpoint.\n\nInstead, the binary decoded and executed on the endpoint by the malicious macro is just an SMB-based Cobalt Strike beacon. This SMB\nbeacon continues to appear in maldocs created as late as September 2019.\n\n**May 2019: Cobalt Strike Macros**\n\nAround May 2019, the attackers tested the use of VBA macro based stagers generated by Cobalt Strike. This attack-chain consists of a\nmaldoc with an embedded macro. The macro consists of code that can inject the hardcoded MSF downloader shellcode (Stage 2A) into a\nbenign 32-bit process.\n\nThe macro code used to inject shellcode into rundll32.exe contacts the local team server 192[.]168.146.137/eKYS for infection tests:\n\n**Sept 2019: Test samples and embedded MSF shellcode**\n\nThe attackers started experimenting with and testing custom droppers in September 2019 to include a new module — the next stage (Stage\n2A) Metasploit downloader shellcode. The Metasploit downloader shellcode was embedded in the test samples and connected to a local IP\naddress to download the third-stage payloads (Stages 3x). The dropper seen here is the earliest discovered instance of IndigoDrop.\n\nMetasploit downloader connecting to a local IP in the dropper:\n\n\n-----\n\n**Sept. 2019: Productionized samples and embedded MSF shellcode**\n\nThe attackers finalized their attack structure in September 2019 and started distributing copies of IndigoDrop. These droppers were based on\nearlier test samples (also built in September 2019) and similarly contained embedded MSF downloader shellcode. These droppers now\nconnected to public IPs operated by the attackers to download the third-stage payloads.\n\n**September 2019: Python Downloaders; No MSF shellcode**\n\nAround the end of September 2019, the attackers started utilizing another infection tactic: The use of Python plus EXE-based\ndownloaders/droppers.\n\nThese droppers were multi-staged where:\n\nThe actual dropper was a malicious EXE file.\nThis dropper would extract an embedded DLL and drop it to disk.\nThe dropper then activates the DLL using rundll32.exe.\nThe DLL is responsible for downloading and executing the third-stage payload from an attacker operated server.\nThe DLL does this by executing minimal python code using the python27.dll library.\n\nThese droppers did not utilize the embedded MSF shellcode like their predecessors. Instead, the shellcode was hosted on an attackercontrolled and operated server.\n\nPython code executed by the Python library in the downloader:\n\nDecoded base64 Python code:\n\n\n-----\n\n**g** **g**\n\nThe attackers started using pastebin[.]com to host their MSF downloader shellcode (Stage 2A) in October 2019. The IndigoDrop samples\nbuilt during this time period now also included the capabilities to persist another component of the infection (usually located at\n\"%userprofile%\\AppData\\Local\\Microsoft\\svchost.exe\" ) via registry and the Windows Startup folder.\n\nIndigoDrop downloading the MSF shellcode from Pastebin:\n\n**Late October 2019 - Present: Multiple Pastebins and anti-Infection checks**\n\nHaving realized the utility of Pastebin, the attackers upgraded their IndigoDrop implementations to use multiple Pastebins to download the\nMSF shellcode. The multiple pastes were meant to be backups of each other if any of them were removed. The attackers used a combination\nof Pastebins and attacker-operated download servers, as backups if the pastes were removed.\n\nThese IndigoDrop instances also introduced the Anti-Infection checks (detailed earlier) to the infection chain.\n\nBase64-encoded Pastebin and attacker-downloaded URL in an IndigoDrop sample:\n\nThe evolution of attacks is illustrated here:\n\n## Conclusion\n\nThis investigation illustrates an attacker using multiple tools and techniques to implement their full attack chain. A variety of infection artifacts\nare utilized ranging from bespoke tools (IndigoDrop) to customizable adversarial tools (Cobalt Strike beacons). The attackers also use a\ncombination of public and private servers to host their malicious payloads with a growing trend towards the sole usage of public servers.\n\nThe use of military-themed maldocs (lures) indicates that government and military organizations in South Asia may be the targets of this\nthreat actor. The maldocs contain bonafide content and are most likely weaponized copies of benign documents known to peek the interests\nof their targets.\n\n\n-----\n\nThe attack variants discovered over time show us that the threat actor can evolve their TTPs in a short period of time. The earliest observable\ncampaigns of this actor date back to April 2018 and continue to operate today along with the most recent evolutions of the attacks. Evidence\nof rapid ideation, testing and production of new and diversified modules and IndigoDrop iterations indicates highly motivated and agile\nadversaries. The use of adversarial frameworks like Cobalt Strike suggests that the attackers are looking to expand their malicious arsenal at\na significant rate with self-authored and customizable artifacts.\n\nModern-day malware attack chains consist of multiple stages and operational entities. These artifacts and entities may be hosted locally or on\nremote servers. For example, this attack consists of multiple shellcodes hosted on remote locations downloaded by a local component\n(IndigoDrop) during runtime to instrument the attack chain. Thus, while network-based detection is important, it should be complemented with\nsystem behavior analysis and endpoint protections.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the malware detailed in this post. Below is a screenshot](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nshowing how AMP can protect customers from this threat. Try AMP for free [here.](https://cisco.com/go/tryamp)\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents access to malicious websites and detects](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nmalware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation Intrusion Prevention System (NGIPS), and](https://www.cisco.com/c/en/us/products/security/firewalls/index.html) Meraki\nMX can detect malicious activity associated with this threat.\n\n[Threat Grid helps identify malicious binaries and build protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs, and URLs, whether users are on or off](https://umbrella.cisco.com/)\nthe corporate network.\n\n[Additional protections with context to your specific environment and threat data are available from the Firepower Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available for purchase on\n[Snort.org.](https://www.snort.org/products)\n\nCisco AMP users can use Orbital Advanced Search to run complex OSqueries to see if their endpoints are infected with this specific threat.\nFor specific OSqueries on this threat, click below:\n\n[IndigoDrop](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_indigodrop_filepath.yaml)\n\n## Indicators Of Compromise (IOCs)\n\nThe following IOCs are related to this threat.\n\n**Maldoc Hashes**\n\n7a5b645a6ea07f1420758515661051cff71cdb34d2df25de6a62ceb15896a1b6\n\nb11dbaf0dd37dd4079bfdb0c6246e53bc75b25b3a260c380bb92fcaec30ec89b\n\naeb38a11ffc62ead9cdabba1e6aa5fce28502a361725f69586c70e16de70df2c\n\n71c88a59b16dbcf7f061d01ea2015658136a8d4af60beb01caa94eeb74c733cd\n\nab209db9694a3b69427fc5857a8a47d0822db4d8372434fc091dfc3e85510719\n\n\n-----\n\n4a6990be2d43f482fe2ab377b5e798da47ba7e02f23dfb6dba26b5011e222d25\n7deeb35d7e88b769d286cc7892ee5966a27c39f03c8ac12dec21733faeffa350\n\n**Dropper Hashes**\n\n3bb90869523233cf965cf4a171d255c891c0179afd6d28198aa2af4e934f0055\n\n570ef552b426f8337514ebdcb5935a132e5a8851a7252528c49d6d0d4aba34d9\n\n059606e707a90333528043bdefbc7a55a27205aabed0ccd46c3966c2a53eea4e\n\n1cda23e924ca606593a31ad54973266676c6540487a3baa29992c172d380bbd6\n\n23091a9383704d22468f6e54babd57e64ced344900e5d3d693daf8bf609c997b\na2bf84f96f8d616ea248ac8f7bbb9d31b22920be4b3991982be0a88326303470\n\n3cfbf274265860f176d6dbfad4df45a9c6953b71f9f439c87aeac36b38fde5b5\n\nc31afceaef91380c658e4d77a78689cafb0f4179f3b251200e969195cbf4cf7b\n\n1c3f185951b21d35f13b2a999a5d4d6b6db8f4b913e3b198fb2c86d4cd0b7781\n\n852d4c98a786cb2b0fb10b4513163e3934b66e4d95a66de8ddcc6abc066dc61d\n\n78ff0507cac9828fb94595d702cd2c22b8bec7a57c2159b78c924c0d0d5f8ccb\n\ne40bdd8ff9e6432008afd54d6d526049ac6bd925dadc2b5a38f78c96df950d1a\n\ncc0787025b297ed80e322d30b655d7c84c7c3a0d18c2089b4f545a03214b7557\n\ne2db20377e8cc65c4cf262df15e47fc21b9a9f83fb7931d44b8d28c6b9ffc0f1\n\na319395e6cf01edb4c6ca879f36a11f4cf33b58657de379123851c63da6a3ef4\n\nbec281baf1312fd059a315d5890ac3c959909047b3473103b069e5ca2ba2fdd1\n\ne9b00f6f47eb70b35713bf7afd345a197f6d290afb8d2684afd8345edc086b29\n\nc9ee415401566139237b14373f6a7a36013b6af693c729b9a5c21cc40e0ad5c6\n\nf9a344c251dc391c5d12e8011185fe033b5ae902c5a866ccd8d8b49881b17151\n\n3e196c77c006e299f26fb05df15644366433fceed73219e0ba6acef0b881531b\n\n5a1a9a6bfc422bd547536e340725328cb04fd72587d83f7e06682abdeddb69a7\n95bb65edc9e8e070680e0c85f72927a2bbb553f96fc1078d85e7df7a02c15165\n\n365af2ddad27701d9d17a069b21dc95d39a2d2c5f78bea655db9123ff05fe086\n\nb9c703dba1977fb34e9f6ac49ccdd0efb752ed010939d54f30f8d91358a9214d\n\n7b0494937fd5a2bedf94999553d37e6049e45b935732a594e833078ed483a5ed\n\nd6f62ce9696887693081373b87792fa53617f8412fa8e6b1a7de1a01070a9bae\n\nd3f3df7cf1ece2519829ee75d29ca054e8233896b7fe50b41eaafda497ff0498\n82155aaf86ba3555d5e809500c67da51e1586a6a97a9755870e22900c8790019\n\nb3650199d6713d669992eebb3c4f05c80a97c470596170b5be16257b73785957\n8f1abb122f35e66f20bd345323fb5eb8dbdbde785137c80c1e55fdaf525520bd\n\naa05a822f26a493efb27046f772790cc67cca29cd9f842b7bc6df2b391ce2ff8\n\n59fd696f95182be1a51011caec172c5461ddacd556a43c329d939842cf7e7d7f\n\n**Python module EXEs**\n\n3aa06700a22808978744aa83d9e084c358517f60525c89236f142b7aa2ce0bef\n\n85e69341f2fe9b97cf0bc81dc63917e62bb17072bcd20fc6125d241623e68660\n\n3066e859109397180c63797c4b779633569ac0c88b54c7cf73752f7895f39629\n\n4260de850b4003c9d4663afea00ba57ec02761f687dba1117ded0a8b20c6b5bb\n\na657bb83fe62e4b555d20463bf090f3349e55e1560507f2197a42c2c3f152667\n\nce438b0d30dd1c221e3c7ab99585acb4254deaf68bdfb8fc73eb206d8fd04771\n\n**Cobalt Strike Beacon Hashes**\n\n482858b70888acf67a5c2d30ddee61ca7b57ff856feaad9a2fa2b5d4bc0bbd7d\n689f7d3f0def72248c4ff4b30da5022ec808a20e99b139e097c2a0d0ba5bab66\n\ndbb5bba499e0ab07e545055d46acf3f78b5ed35fff83d9c88ce57c6455c02091\n\ne37a0b4145f22ce7f7478918320c019a6014060cb033aafec18a8d130c4c426b\n\n4b0c2f790c7b9c84517648bb36964c859629736dab1fa5466d91bd23f69c9b55\n\nc2d9bbd5163a8e733483bf5d0d4959f053a2307d275b81eb38e69d87f1f5df7e\n\na0cfec815cb74a7671265fd5e0790a2a79c05fe0ef16d2d0c87584049d06658b\n\n**Malicious JQuery Files containing the beacons**\n\n1ea22d132c1d478347d7e4e72d79bae29f18df9bec5a3016a5a9971f702a8095\nb9efca96d451c0b4028b6081456c1ddd3035ab39e6a60bdd831bcf4a472a31ae\n\nb081b818e5fbd5d2741822c9e161e536a8497764fab5ac79143614bbce8308f6\n\nd2fd448a386416fdad0059be1bb61f49e99fc76e7efbd5f5e377dbbf6e7e3599\n\nbdbc9dc2f2812a9808357aafe908e7206c9168bc7fea761dec871926de23eec0\n\n**Maldoc distribution URLs**\n\n\n-----\n\nhxxp://bit[.]ly/iaf guidelines\nhxxp://tecbeck[.]com/IAP39031[.]docx\nhxxp://bitly[.]com/38A5BEO\n\n**Cobalt Strike beacon CnC URLs**\n\nhxxp://134[.]209.196.51/jquery-3.3.1.min.js\n\nhxxp://134[.]209.196.51/jquery-3.3.2.min.js\n\nhxxp://139[.]59.1.154/ca\n\nhxxp://139[.]59.1.154/submit.php\n\nhxxp://139[.]59.79.105/jquery-3.3.1.min.js\n\nhxxp://139[.]59.79.105/jquery-3.3.2.min.js\n\nhxxp://188[.]166.14.73/jquery-3.3.1.min.js\n\nhxxp://188[.]166.14.73/jquery-3.3.2.min.js\n\n**IP Addresses**\n\n134[.]209.196.51\n\n134[.]209.200.91\n\n139[.]59.1.154\n\n139[.]59.79.105\n\n139[.]59.81.167\n\n157[.]245.78.153\n\n165[.]22.201.190\n\n178[.]62.210.85\n\n188[.]166.14.73\n\n188[.]166.25.156\n\n202[.]59.79.131\n\n**MSF shellcode URLs**\n\nhxxp://139[.]59.1.154:8201/cmelkmkl.txt\n\nhxxp://157[.]245.78.153/11.txt\n\nhxxp://157[.]245.78.153/12.txt\n\nhxxp://157[.]245.78.153/21.txt\n\nhxxp://157[.]245.78.153/22.txt\n\nhxxp://157[.]245.78.153/31.txt\n\nhxxp://157[.]245.78.153/32.txt\n\nhxxp://157[.]245.78.153/41.txt\n\nhxxp://157[.]245.78.153/42.txt\n\nhxxp://157[.]245.78.153/51.txt\n\nhxxp://157[.]245.78.153/52.txt\n\nhxxp://202[.]59.79.131/7XyT\n\nhxxp://202[.]59.79.131/o2Q7NGUwpFfDzcLMnkuMyAy-IGt8KERPl-6lrRhxcbPJkZwAr33\n\nhxxp://202[.]59.79.131:8080/8g-QvDrvM4hSI0c3D6iC8Aib6wZbs\n\n**jQuery/Decoder shellcode URLs**\n\nhxxp://134[.]209.196.51/jquery-3.3.0.min.js\n\nhxxp://134[.]209.200.91/jquery-3.3.0.min.js\n\nhxxp://139[.]59.1.154/ToKN\n\nhxxp://139[.]59.79.105/jquery-3.3.0.min.js\n\nhxxp://139[.]59.81.167/jquery-3.3.0.min.js\n\nhxxp://165[.]22.201.190/jquery-3.3.0.min.js\n\nhxxp://188[.]166.14.73/jquery-3.3.0.min.js\n\nhxxp://188[.]166.25.156/jquery-3.3.0.min.js\n\nhxxp://202[.]59.79.131/YZn_pcfLiUILewp6Vuku9gvUqfMFnPLBP5Aju9QS709n4zRAd-3e4IuPF5kv0uhXSAiJqurq5yPJB9zSZ5rHig07RcWcQPIPD04YZhq1JCGWwYIAfFFHI0qj4LRDhsuaBdQEihGmxzZ8obxUbv5RUfaxm7XwOkWJK8D9xK5gibPGGBiNs41hYB0Kar325FCcCJAIFIzWOw9WLOt6EfrWaEO69aHp\n\n**MSF shellcode Pastebin URLs**\n\nhxxps://pastebin[.]com/raw/zT57Pkzj\n\nhxxps://pastebin[.]com/raw/kf3y5uzt\n\nhxxps://pastebin[.]com/raw/ftfSHyPz\n\nhxxps://pastebin[.]com/raw/hAKzruWe\n\nhxxps://hastebin[ ]com/raw/ufaxamogav\n\n\n-----\n\nhxxps://pastebin[.]com/raw/KzmUrrnB\nhxxps://pastebin[.]com/raw/aMfFtqjq\nhxxps://pastebin[.]com/raw/Q6bMcduX\nhxxps://pastebin[.]com/raw/7VmV7jXA\nhxxps://pastebin[.]com/raw/8E8YCryu\nhxxps://pastebin[.]com/raw/1tKX0v5U\nhxxps://pastebin[.]com/raw/kpn2k1jc\nhxxps://pastebin[.]com/raw/xiV89Xa9\nhxxps://pastebin[.]com/raw/ZMTjGJUn\nhxxps://pastebin[.]com/raw/CRuQvJk1\nhxxps://pastebin[.]com/raw/zbL0w8sm\nhxxps://pastebin[.]com/raw/yP7eQKsv\nhxxps://pastebin[.]com/raw/1Q7jYDmz\nhxxps://pastebin[.]com/raw/vc8TUZPN\nhxxps://pastebin[.]com/raw/R0HzuGWE\nhxxps://pastebin[.]com/raw/ehQyY1YX\nhxxps://pastebin[.]com/raw/LRztjgkq\nhxxps://pastebin[.]com/raw/QyDZhfer\nhxxps://pastebin[.]com/raw/MQUG0Q07\nhxxps://pastebin[.]com/raw/LtVteHbz\nhxxps://pastebin[.]com/raw/k2PQZqzF\nhxxps://pastebin[.]com/raw/azzHZ11B\nhxxps://pastebin[.]com/raw/4u1ScSn7\nhxxps://pastebin[.]com/raw/5tSnVWcn\nhxxps://pastebin[.]com/raw/a0kPq7bq\nhxxps://pastebin[.]com/raw/cK8nhTYw\nhxxps://pastebin[.]com/raw/p34D4vbL\nhxxps://pastebin[.]com/raw/YVvG43bi\nhxxps://pastebin[.]com/raw/iyKjw7jR\nhxxps://pastebin[.]com/raw/0hAzfmrR\nhxxps://pastebin[.]com/raw/aGSg1f3Y\nhxxps://pastebin[.]com/raw/i5JkU138\nhxxps://pastebin[.]com/raw/LQjs18Cy\nhxxps://pastebin[.]com/raw/rHeWv7t0\nhxxps://pastebin[.]com/raw/bqL6CSp3\nhxxps://pastebin[.]com/raw/WJFvRHXv\n\n## IndigoDrop's anti-infection checks\n\n**Usernames blocked**\n\nadmin\n\n8a3YwFo8xYlc\n\niBqxaDRj5T\n\ndPNNfpR\n\nfnIcszErnay\n\ny9NzUJ\n\n0sNBuzz63Nl8\n\nZJsji0QShXfiM\n\n3ALPeOppOKOEk\n\nC4EZdigYE64r\n\n0M7vKY\n\n6oVAnp\n\nA0T6Z0j1NFrrQ\n\nJohnson\n\nOlivia\n\nVh2ij\n\n5Li9Ls\n\nyMBCh9wwy\n\nFWpuxsyMQZZNW\n\nAdmin\nLisa\nQYbRCr\n\nTyLbns\n\n\n-----\n\nH0USlDC58dVLE\nRmJCA\nAdministrator_\n\n**Computer names blocked**\n\nuser-pc\n8a3YwFo8xYlc-PC\n\niBqxaDRj5T-PC\n\ndPNNfpR-PC\n\nfnIcszErnay-PC\n\ny9NzUJ-PC\n\n0sNBuzz63Nl8-PC\n\nAVN671124898447\n\nGXKKQO724201067\n\nart-PC\n\nC4EZdigYE64r-PC\n\n0M7vKY-PC\n\n6oVAnp-PC\n\nTFT153265618011\n\nAXWF10479288957\n\nJohnson-PC\n\nDesktop-HRW10\n\nVh2ij-PC\n\n5Li9Ls-PC\n\nyMBCh9wwy-PC\n\nPGHFTIGN5920348\n\nCPCTBGSA2018901\n\nADMINIS-HJ9SRP3\n\nLisa-PC\n\nQYbRCr-PC\n\nTyLbns-PC\n\nSESW54921970303\n\nRmJCA-PC\n\n**Immediate parent folder names blocked**\n\nDownloads\n\nmydownload\n\nDesktop\n\nsystem32\n\nTemp\n\n**MAC addresses blocked**\n\n00[:]07:e9:e4:ce:4d\n\n60[:]02:92:e5:2f:30\n\n60[:]02:92:77:fc:94\n\n52[:]54:00:12:34:56\n\n08[:]00:27:55:12:e3\n\n60[:]02:92:89:76:36\n\n00[:]00:00:00:00:00:00:e0\n\n**IP Addresses blocked**\n\n51[.]68.93.185\n\n79[.]104.209.156\n\n89[.]208.29.214\n\n95[.]25.130.162\n\n51[.]15.76.60\n\n62[.]102.148.68\n\n207[.]102.138.40\n\n51[.]83.15.56\n\n109[.]70.100.24\n\n109[.]70.100.29\n\n128[.]90.148.185\n\n\n-----\n\n78[.]142.19.43\n46[.]165.254.166\n221[.]191.21.11\n153[.]201.39.205\n92[.]211.106.185\n51[.]68.91.152\n89[.]208.29.215\n185[.]220.101.35\n95[.]26.100.11\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-22 - IndigoDrop spreads via military-themed lures to deliver Cobalt Strike.pdf"
    ],
    "report_names": [
        "2020-06-22 - IndigoDrop spreads via military-themed lures to deliver Cobalt Strike.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536240,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653751711,
    "ts_modification_date": 1653751711,
    "files": {
        "pdf": "https://archive.orkl.eu/70757f3eec3c50baa9b4b83d58d48534fa6e9a9d.pdf",
        "text": "https://archive.orkl.eu/70757f3eec3c50baa9b4b83d58d48534fa6e9a9d.txt",
        "img": "https://archive.orkl.eu/70757f3eec3c50baa9b4b83d58d48534fa6e9a9d.jpg"
    }
}