{
    "id": "7174ea01-6802-4d2f-b4c2-34f0229e7b7c",
    "created_at": "2022-12-27T17:06:08.677275Z",
    "updated_at": "2025-03-18T19:58:07.488021Z",
    "deleted_at": null,
    "sha1_hash": "60809073547e7bcce787522a197b6f3113c54cc8",
    "title": "#StopRansomware: Hive Ransomware",
    "authors": "CISA, FBI, HHS",
    "file_creation_date": "2022-11-25T10:52:52Z",
    "file_modification_date": "2022-11-25T10:52:52Z",
    "file_size": 901086,
    "plain_text": "Co-Authored by:\n\nTLP: CLEAR\n\nProduct ID: AA22-321A\nNovember 17, 2022\n\n#StopRansomware: Hive Ransomware\nSUMMARY\nNote: This joint Cybersecurity Advisory (CSA) is part of\nan ongoing #StopRansomware effort to publish\nadvisories for network defenders that detail various\nransomware variants and ransomware threat actors.\nThese #StopRansomware advisories include recently\nand historically observed tactics, techniques, and\nprocedures (TTPs) and indicators of compromise (IOCs)\nto help organizations protect against ransomware. Visit\nstopransomware.gov to see all #StopRansomware\nadvisories and to learn more about other ransomware\nthreats and no-cost resources.\n\nActions to Take Today to Mitigate\nCyber Threats from Ransomware:\n Prioritize remediating known\nexploited vulnerabilities.\n Enable and enforce multifactor\nauthentication with strong\npasswords.\n Close unused ports and remove\nany application not deemed\nnecessary for day-to-day\noperations.\n\nThe Federal Bureau of Investigation (FBI), the\nCybersecurity and Infrastructure Security Agency (CISA), and the Department of Health and Human\nServices (HHS) are releasing this joint CSA to disseminate known Hive IOCs and TTPs identified\nthrough FBI investigations as recently as November 2022.\nFBI, CISA, and HHS encourage organizations to implement the recommendations in the Mitigations\nsection of this CSA to reduce the likelihood and impact of ransomware incidents. Victims of\nransomware operations should report the incident to their local FBI field office or CISA. For a\ndownloadable copy of IOCs, see AA22-321A.stix (STIX, 43.6 kb).\n\nTECHNICAL DETAILS\nNote: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 12. See MITRE\nATT&CK for Enterprise for all referenced tactics and techniques.\nAs of November 2022, Hive ransomware actors have victimized over 1,300 companies worldwide,\nreceiving approximately US$100 million in ransom payments, according to FBI information. Hive\nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact\nyour local FBI field office at fbi.gov/contact-us/field-offices. When available, please include the following\ninformation regarding the incident: date, time, and location of the incident; type of activity; number of people\naffected; type of equipment used for the activity; the name of the submitting company or organization; and a\ndesignated point of contact. To request incident response resources or technical assistance related to these\nthreats, contact CISA at Report@cisa.dhs.gov.\nThis document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information\ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public\nrelease. Subject to standard copyright rules, TLP:CLEAR information may be distributed without restriction. For\nmore information on the Traffic Light Protocol, see cisa.gov/tlp/.\n\nTLP: CLEAR\n\nTLP:CLEAR\nransomware follows the ransomware-as-a-service (RaaS) model in which developers create,\nmaintain, and update the malware, and affiliates conduct the ransomware attacks. From June 2021\nthrough at least November 2022, threat actors have used Hive ransomware to target a wide range of\nbusinesses and critical infrastructure sectors, including Government Facilities, Communications,\nCritical Manufacturing, Information Technology, and especially Healthcare and Public Health (HPH).\nThe method of initial intrusion will depend on which affiliate targets the network. Hive actors have\ngained initial access to victim networks by using single factor logins via Remote Desktop Protocol\n(RDP), virtual private networks (VPNs), and other remote network connection protocols [T1133]. In\nsome cases, Hive actors have bypassed multifactor authentication (MFA) and gained access to\nFortiOS servers by exploiting Common Vulnerabilities and Exposures (CVE) CVE-2020-12812. This\nvulnerability enables a malicious cyber actor to log in without a prompt for the user’s second\nauthentication factor (FortiToken) when the actor changes the case of the username.\nHive actors have also gained initial access to victim networks by distributing phishing emails with\nmalicious attachments [T1566.001] and by exploiting the following vulnerabilities against Microsoft\nExchange servers [T1190]:\n•\n•\n•\n\nCVE-2021-31207 - Microsoft Exchange Server Security Feature Bypass Vulnerability\nCVE-2021-34473 - Microsoft Exchange Server Remote Code Execution Vulnerability\nCVE-2021-34523 - Microsoft Exchange Server Privilege Escalation Vulnerability\n\nAfter gaining access, Hive ransomware attempts to evade detention by executing processes to:\n•\n•\n•\n\nIdentify processes related to backups, antivirus/anti-spyware, and file copying and then\nterminating those processes to facilitate file encryption [T1562].\nStop the volume shadow copy services and remove all existing shadow copies via vssadmin\non command line or via PowerShell [T1059] [T1490].\nDelete Windows event logs, specifically the System, Security and Application logs [T1070].\n\nPrior to encryption, Hive ransomware removes virus definitions and disables all portions of Windows\nDefender and other common antivirus programs in the system registry [T1112].\nHive actors exfiltrate data likely using a combination of Rclone and the cloud storage service Mega.nz\n[T1537]. In addition to its capabilities against the Microsoft Windows operating system, Hive\nransomware has known variants for Linux, VMware ESXi, and FreeBSD.\nDuring the encryption process, a file named *.key (previously *.key.*) is created in the root\ndirectory (C:\\ or /root/). Required for decryption, this key file only exists on the machine where it\nwas created and cannot be reproduced. The ransom note, HOW_TO_DECRYPT.txt is dropped into\neach affected directory and states the *.key file cannot be modified, renamed, or deleted, otherwise\nthe encrypted files cannot be recovered [T1486]. The ransom note contains a “sales department”\n.onion link accessible through a TOR browser, enabling victim organizations to contact the actors\nthrough a live chat panel to discuss payment for their files. However, some victims reported receiving\nphone calls or emails from Hive actors directly to discuss payment.\n\nPage 2 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\nThe ransom note also threatens victims that a public disclosure or leak site accessible on the TOR\nsite, “HiveLeaks”, contains data exfiltrated from victim organizations who do not pay the ransom\ndemand (see figure 1 below). Additionally, Hive actors have used anonymous file sharing sites to\ndisclose exfiltrated data (see table 1 below).\n\nFigure 1: Sample Hive Ransom Note\nTable 2: Anonymous File Sharing Sites Used to Disclose Data\nhttps://anonfiles[.]com\nhttps://mega[.]nz\nhttps://send.exploit[.]in\nhttps://ufile[.]io\nhttps://www.sendspace[.]com\n\nPage 3 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n\nhttps://privatlab[.]net\nhttps://privatlab[.]com\n\nOnce the victim organization contacts Hive actors on the live chat panel, Hive actors communicate\nthe ransom amount and the payment deadline. Hive actors negotiate ransom demands in U.S.\ndollars, with initial amounts ranging from several thousand to millions of dollars. Hive actors demand\npayment in Bitcoin.\nHive actors have been known to reinfect—with either Hive ransomware or another ransomware\nvariant—the networks of victim organizations who have restored their network without making a\nransom payment.\n\nIndicators of Compromise\nThreat actors have leveraged the following IOCs during Hive ransomware compromises. Note: Some\nof these indicators are legitimate applications that Hive threat actors used to aid in further malicious\nexploitation. FBI, CISA, and HHS recommend removing any application not deemed necessary for\nday-to-day operations. See tables 2−3 below for IOCs obtained from FBI threat response\ninvestigations as recently as November 2022.\nTable 2: Known IOCs as of November 2022\nKnown IOCs - Files\nHOW_TO_DECRYPT.txt typically in directories with encrypted files\n*.key typically in the root directory, i.e., C:\\ or /root\nhive.bat\nshadow.bat\nasq.r77vh0[.]pw - Server hosted malicious HTA file\nasq.d6shiiwz[.]pw - Server referenced in malicious regsvr32 execution\nasq.swhw71un[.]pw - Server hosted malicious HTA file\nasd.s7610rir[.]pw - Server hosted malicious HTA file\nWindows_x64_encrypt.dll\nWindows_x64_encrypt.exe\nWindows_x32_encrypt.dll\nWindows_x32_encrypt.exe\nLinux_encrypt\nEsxi_encrypt\n\nPage 4 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\nKnown IOCs – Events\nSystem, Security and Application Windows event logs wiped\nMicrosoft Windows Defender AntiSpyware Protection disabled\nMicrosoft Windows Defender AntiVirus Protection disabled\nVolume shadow copies deleted\nNormal boot process prevented\nKnown IOCs – Logged Processes\nwevtutil.exe cl system\nwevtutil.exe cl security\nwevtutil.exe cl application\nvssadmin.exe delete shadows /all /quiet\nwmic.exe SHADOWCOPY /nointeractive\nwmic.exe shadowcopy delete\nbcdedit.exe /set {default} bootstatuspolicy ignoreallfailures\nbcdedit.exe /set {default} recoveryenabled no\nTable 3: Potential IOC IP Addresses as of November 2022\nNote: Some of these observed IP addresses are more than a year old. FBI and CISA recommend\nvetting or investigating these IP addresses prior to taking forward-looking action like blocking.\nPotential IOC IP Addresses for Compromise or Exfil:\n84.32.188[.]57\n\n84.32.188[.]238\n\n93.115.26[.]251\n\n185.8.105[.]67\n\n181.231.81[.]239\n\n185.8.105[.]112\n\n186.111.136[.]37\n\n192.53.123[.]202\n\n158.69.36[.]149\n\n46.166.161[.]123\n\n108.62.118[.]190\n\n46.166.161[.]93\n\n185.247.71[.]106\n\n46.166.162[.]125\n\n5.61.37[.]207\n\n46.166.162[.]96\n\n185.8.105[.]103\n\n46.166.169[.]34\n\n5.199.162[.]220\n\n93.115.25[.]139\n\nPage 5 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n\n5.199.162[.]229\n\n93.115.27[.]148\n\n89.147.109[.]208\n\n83.97.20[.]81\n\n5.61.37[.]207\n\n5.199.162[.]220\n\n5.199.162[.]229\n\n46.166.161[.]93\n\n46.166.161[.]123\n\n46.166.162[.]96\n\n46.166.162[.]125\n\n46.166.169[.]34\n\n83.97.20[.]81\n\n84.32.188[.]238\n\n84.32.188[.]57\n\n89.147.109[.]208\n\n93.115.25[.]139\n\n93.115.26[.]251\n\n93.115.27[.]148\n\n108.62.118[.]190\n\n158.69.36[.]149\n\n181.231.81[.]239\n\n185.8.105[.]67\n\n185.8.105[.]103\n\n185.8.105[.]112\n\n185.247.71[.]106\n\n186.111.136[.]37\n\n192.53.123[.]202\n\nMITRE ATT&CK TECHNIQUES\nSee table 4 for all referenced threat actor tactics and techniques listed in this advisory.\nTable 4: Hive Actors ATT&CK Techniques for Enterprise\nInitial Access\nTechnique Title\n\nID\n\nUse\n\nExternal Remote Services\n\nT1133\n\nHive actors gain access to victim networks\nby using single factor logins via RDP,\nVPN, and other remote network\nconnection protocols.\n\nExploit Public-Facing Application\n\nT1190\n\nHive actors gain access to victim network\nby exploiting the following Microsoft\nExchange vulnerabilities: CVE-202134473, CVE-2021-34523, CVE-202131207, CVE-2021-42321.\n\nPage 6 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\nPhishing\n\nT1566.001\n\nHive actors gain access to victim networks\nby distributing phishing emails with\nmalicious attachments.\n\nExecution\nTechnique Title\nCommand and Scripting\nInterpreter\n\nID\n\nUse\n\nT1059\n\nHive actors looks to stop the volume\nshadow copy services and remove all\nexisting shadow copies via vssadmin on\ncommand line or PowerShell.\n\nDefense Evasion\nTechnique Title\n\nID\n\nUse\n\nIndicator Removal on Host\n\nT1070\n\nHive actors delete Windows event logs,\nspecifically, the System, Security and\nApplication logs.\n\nModify Registry\n\nT1112\n\nHive actors set registry values for\nDisableAntiSpyware and\nDisableAntiVirus to 1.\n\nImpair Defenses\n\nT1562\n\nHive actors seek processes related to\nbackups, antivirus/anti-spyware, and file\ncopying and terminates those processes\nto facilitate file encryption.\n\nExfiltration\nTechnique Title\n\nID\n\nTransfer Data to Cloud Account\n\nT1537\n\nUse\nHive actors exfiltrate data from victims,\nusing a possible combination of Rclone\nand the cloud storage service Mega.nz.\n\nImpact\nTechnique Title\nData Encrypted for Impact\n\nID\n\nUse\n\nT1486\n\nHive actors deploy a ransom note\nHOW_TO_DECRYPT.txt into each affected\ndirectory which states the *.key file\n\nPage 7 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n\ncannot be modified, renamed, or deleted,\notherwise the encrypted files cannot be\nrecovered.\n\nInhibit System Recovery\n\nT1490\n\nHive actors looks to stop the volume\nshadow copy services and remove all\nexisting shadow copies via vssadmin via\ncommand line or PowerShell.\n\nMITIGATIONS\nFBI, CISA, and HHS recommend organizations, particularly in the HPH sector, implement the\nfollowing to limit potential adversarial use of common system and network discovery techniques and\nto reduce the risk of compromise by Hive ransomware:\n•\n•\n\n•\n•\n\n•\n\n•\n•\n\nVerify Hive actors no longer have access to the network.\nInstall updates for operating systems, software, and firmware as soon as they are\nreleased. Prioritize patching VPN servers, remote access software, virtual machine software,\nand known exploited vulnerabilities. Consider leveraging a centralized patch management\nsystem to automate and expedite the process.\nRequire phishing-resistant MFA for as many services as possible—particularly for webmail,\nVPNs, accounts that access critical systems, and privileged accounts that manage backups.\nIf used, secure and monitor RDP.\no Limit access to resources over internal networks, especially by restricting RDP and\nusing virtual desktop infrastructure.\no After assessing risks, if you deem RDP operationally necessary, restrict the originating\nsources and require MFA to mitigate credential theft and reuse.\no If RDP must be available externally, use a VPN, virtual desktop infrastructure, or other\nmeans to authenticate and secure the connection before allowing RDP to connect to\ninternal devices.\no Monitor remote access/RDP logs, enforce account lockouts after a specified number of\nattempts to block brute force campaigns, log RDP login attempts, and disable unused\nremote access/RDP ports.\no Be sure to properly configure devices and enable security features.\no Disable ports and protocols not used for business purposes, such as RDP Port\n3389/TCP.\nMaintain offline backups of data, and regularly maintain backup and restoration. By instituting\nthis practice, the organization ensures they will not be severely interrupted, and/or only have\nirretrievable data.\nEnsure all backup data is encrypted, immutable (i.e., cannot be altered or deleted), and covers\nthe entire organization’s data infrastructure. Ensure your backup data is not already infected.\nMonitor cyber threat reporting regarding the publication of compromised VPN login credentials\nand change passwords/settings if applicable.\n\nPage 8 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n• Install and regularly update anti-virus or anti-malware software on all hosts.\n• Enable PowerShell Logging including module logging, script block logging and transcription.\n• Install an enhanced monitoring tool such as Sysmon from Microsoft for increased logging.\n• Review the following additional resources.\no The joint advisory from Australia, Canada, New Zealand, the United Kingdom, and the\nUnited States on Technical Approaches to Uncovering and Remediating Malicious\nActivity provides additional guidance when hunting or investigating a network and\ncommon mistakes to avoid in incident handling.\no The Cybersecurity and Infrastructure Security Agency-Multi-State Information Sharing\n& Analysis Center Joint Ransomware Guide covers additional best practices and ways\nto prevent, protect, and respond to a ransomware attack.\no StopRansomware.gov is the U.S. Government’s official one-stop location for resources\nto tackle ransomware more effectively.\nIf your organization is impacted by a ransomware incident, FBI, CISA, and HHS recommend the\nfollowing actions.\n•\n\n•\n\n•\n\nIsolate the infected system. Remove the infected system from all networks, and disable the\ncomputer’s wireless, Bluetooth, and any other potential networking capabilities. Ensure all\nshared and networked drives are disconnected.\nTurn off other computers and devices. Power-off and segregate (i.e., remove from the\nnetwork) the infected computer(s). Power-off and segregate any other computers or devices\nthat share a network with the infected computer(s) that have not been fully encrypted by\nransomware. If possible, collect and secure all infected and potentially infected computers and\ndevices in a central location, making sure to clearly label any computers that have been\nencrypted. Powering-off and segregating infected computers and computers that have not\nbeen fully encrypted may allow for the recovery of partially encrypted files by specialists.\nSecure your backups. Ensure that your backup data is offline and secure. If possible, scan\nyour backup data with an antivirus program to check that it is free of malware.\n\nIn addition, FBI, CISA, and HHS urge all organizations to apply the following recommendations to\nprepare for, mitigate/prevent, and respond to ransomware incidents.\n\nPreparing for Cyber Incidents\n•\n\n•\n•\n\nReview the security posture of third-party vendors and those interconnected with your\norganization. Ensure all connections between third-party vendors and outside software or\nhardware are monitored and reviewed for suspicious activity.\nImplement listing policies for applications and remote access that only allow systems to\nexecute known and permitted programs under an established security policy.\nDocument and monitor external remote connections. Organizations should document\napproved solutions for remote management and maintenance, and immediately investigate if\nan unapproved solution is installed on a workstation.\n\nPage 9 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n• Implement a recovery plan to maintain and retain multiple copies of sensitive or proprietary\ndata and servers in a physically separate, segmented, and secure location (i.e., hard drive,\nstorage device, the cloud).\n\nIdentity and Access Management\n•\n\nRequire all accounts with password logins (e.g., service account, admin accounts, and\ndomain admin accounts) to comply with National Institute of Standards and Technology\n(NIST) standards for developing and managing password policies.\no Use longer passwords consisting of at least 8 characters and no more than 64\ncharacters in length.\no Store passwords in hashed format using industry-recognized password managers.\no Add password user “salts” to shared login credentials.\no Avoid reusing passwords.\no Implement multiple failed login attempt account lockouts.\no Disable password “hints.”\no Refrain from requiring password changes more frequently than once per year unless a\npassword is known or suspected to be compromised.\nNote: NIST guidance suggests favoring longer passwords instead of requiring regular\nand frequent password resets. Frequent password resets are more likely to result in\nusers developing password “patterns” cyber criminals can easily decipher.\no Require administrator credentials to install software.\n\n•\n\nRequire phishing-resistant multifactor authentication for all services to the extent\npossible, particularly for webmail, virtual private networks, and accounts that access critical\nsystems.\nReview domain controllers, servers, workstations, and active directories for new and/or\nunrecognized accounts.\nAudit user accounts with administrative privileges and configure access controls according\nto the principle of least privilege.\nImplement time-based access for accounts set at the admin level and higher. For\nexample, the Just-in-Time (JIT) access method provisions privileged access when needed\nand can support enforcement of the principle of least privilege (as well as the Zero Trust\nmodel). This is a process where a network-wide policy is set in place to automatically disable\nadmin accounts at the Active Directory level when the account is not in direct need. Individual\nusers may submit their requests through an automated process that grants them access to a\nspecified system for a set timeframe when they need to support the completion of a certain\ntask.\n\n•\n•\n•\n\nProtective Controls and Architecture\n•\n\nSegment networks to prevent the spread of ransomware. Network segmentation can help\nprevent the spread of ransomware by controlling traffic flows between—and access to—\nvarious subnetworks and by restricting adversary lateral movement.\n\nPage 10 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n• Identify, detect, and investigate abnormal activity and potential traversal of the\nindicated ransomware with a networking monitoring tool. To aid in detecting the\nransomware, implement a tool that logs and reports all network traffic, including lateral\nmovement activity on a network. Endpoint detection and response (EDR) tools are particularly\nuseful for detecting lateral connections as they have insight into common and uncommon\nnetwork connections for each host.\n• Install, regularly update, and enable real time detection for antivirus software on all\nhosts.\n\nVulnerability and Configuration Management\n•\n•\n\n•\n•\n\nConsider adding an email banner to emails received from outside your organization.\nDisable command-line and scripting activities and permissions. Privilege escalation and\nlateral movement often depend on software utilities running from the command line. If threat\nactors are not able to run these tools, they will have difficulty escalating privileges and/or\nmoving laterally.\nEnsure devices are properly configured and that security features are enabled.\nRestrict Server Message Block (SMB) Protocol within the network to only access\nnecessary servers and remove or disable outdated versions of SMB (i.e., SMB version\n1). Threat actors use SMB to propagate malware across organizations.\n\nREFERENCES\n•\n•\n•\n\nStopransomware.gov is a whole-of-government approach that gives one central location for\nransomware resources and alerts.\nResource to mitigate a ransomware attack: CISA-Multi-State Information Sharing and Analysis\nCenter (MS-ISAC) Joint Ransomware Guide.\nNo-cost cyber hygiene services: Cyber Hygiene Services and Ransomware Readiness\nAssessment.\n\nINFORMATION REQUESTED\nThe FBI, CISA, and HHS do not encourage paying a ransom to criminal actors. Paying a ransom may\nembolden adversaries to target additional organizations, encourage other criminal actors to engage in\nthe distribution of ransomware, and/or fund illicit activities. Paying the ransom also does not\nguarantee that a victim’s files will be recovered. However, the FBI, CISA, and HHS understand that\nwhen businesses are faced with an inability to function, executives will evaluate all options to protect\ntheir shareholders, employees, and customers. Regardless of whether you or your organization\ndecide to pay the ransom, the FBI, CISA, and HHS urge you to promptly report ransomware incidents\nto your local FBI field office, or to CISA at report@cisa.gov or (888) 282-0870. Doing so provides\ninvestigators with the critical information they need to track ransomware attackers, hold them\naccountable under US law, and prevent future attacks.\nThe FBI may seek the following information that you determine you can legally share, including:\n•\n\nRecovered executable files\n\nPage 11 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR\n\nTLP:CLEAR\n• Live random access memory (RAM) capture\n• Images of infected systems\n• Malware samples\n• IP addresses identified as malicious or suspicious\n• Email addresses of the attackers\n• A copy of the ransom note\n• Ransom amount\n• Bitcoin wallets used by the attackers\n• Bitcoin wallets used to pay the ransom\n• Post-incident forensic reports\n\nDISCLAIMER\nThe information in this report is being provided “as is” for informational purposes only. FBI, CISA, and\nHHS do not endorse any commercial product or service, including any subjects of analysis. Any\nreference to specific commercial products, processes, or services by service mark, trademark,\nmanufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring\nby FBI, CISA, or HHS.\n\nPage 12 of 12 | Product ID: AA22-321A\n\nTLP: CLEAR",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/uscert/ncas/alerts/aa22-321a",
        "https://www.cisa.gov/uscert/sites/default/files/publications/aa22-321a_joint_csa_stopransomware_hive.pdf"
    ],
    "report_names": [
        "aa22-321a_joint_csa_stopransomware_hive.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1672160768,
    "ts_updated_at": 1742327887,
    "ts_creation_date": 1669373572,
    "ts_modification_date": 1669373572,
    "files": {
        "pdf": "https://archive.orkl.eu/60809073547e7bcce787522a197b6f3113c54cc8.pdf",
        "text": "https://archive.orkl.eu/60809073547e7bcce787522a197b6f3113c54cc8.txt",
        "img": "https://archive.orkl.eu/60809073547e7bcce787522a197b6f3113c54cc8.jpg"
    }
}