{
    "id": "717fcec8-aec8-41d9-82ef-dd96d3e0c768",
    "created_at": "2023-01-12T14:59:01.862129Z",
    "updated_at": "2025-03-27T02:05:47.774574Z",
    "deleted_at": null,
    "sha1_hash": "455936cd0e1316ba71e94a73b14b3f2022a3df9b",
    "title": "2022-08-10 - “Pegasus”, the spyware for smartphones. How does it work and how can you protect yourself-",
    "authors": "",
    "file_creation_date": "2022-08-18T03:58:07Z",
    "file_modification_date": "2022-08-18T03:58:07Z",
    "file_size": 600402,
    "plain_text": "# “Pegasus”, lo spyware per smartphone. Come funziona e come ci si può proteggere?\n\n**[cybertrends.it/pegasus-lo-spyware-per-smartphone-come-funziona-e-come-ci-si-puo-proteggere/](https://www.cybertrends.it/pegasus-lo-spyware-per-smartphone-come-funziona-e-come-ci-si-puo-proteggere/)**\n\nSandra Gagliardi 8 agosto 2022\n\nUno degli eventi più importanti nel mondo cibernetico nel 2021 è rappresentato dai risultati di\nun’indagine condotta dal Guardian e da altre 16 organizzazioni mediatiche, che ha rilevato\nche più di 30.000 attivisti per i diritti umani, giornalisti e avvocati in tutto il mondo potrebbero\nessere stati presi di mira con lo spyware Pegasus (Pegasus è un cosiddetto “software di\nsorveglianza legale” sviluppato dalla società israeliana NSO).\n\nIl rapporto pubblicato nel luglio 2021, intitolato “Pegasus Project” (1), sostiene che il malware\nè stato distribuito su larga scala attraverso vari exploit, tra cui diversi zero-days che hanno\npreso di mira i sistemi iOS. Sulla base di analisi forensi di numerosi dispositivi mobili, il\nlaboratorio di sicurezza di Amnesty International ha effettivamente scoperto che il software è\nstato ripetutamente utilizzato in modo improprio per scopi di sorveglianza.\n\nL’elenco delle persone prese di mira comprende 14 leader mondiali e un gran numero di\nattivisti, difensori dei diritti umani, dissidenti ed esponenti dell’opposizione. Più tardi nello\nstesso mese, quando è stato pubblicato il rapporto del Guardian e di Amnesty, funzionari del\ngoverno israeliano hanno visitato gli uffici della NSO nell’ambito di un’indagine sulle accuse\n(2). Nell’ottobre 2021, la Corte Suprema indiana ha nominato un comitato tecnico per\nindagare sull’uso di Pegasus per spiare i cittadini (3). A novembre, Apple ha annunciato\nl’avvio di un’azione legale contro NSO Group per aver sviluppato un software che colpisce i\nsuoi utenti con “malware e spyware”(4). Infine, nel dicembre 2021, Reuters ha pubblicato\nche i telefoni del Dipartimento di Stato americano, allertati da Apple, sono stati violati con il\nmalware Pegasus di NSO (5).\n\n\n-----\n\nNel 2022, le rivelazioni sono continuate: il 2 maggio 2022, il governo spagnolo ha annunciato\nche il primo ministro Pedro Sánchez e il ministro della Difesa Margarita Robles erano\nentrambi monitorati da Pegasus (6). In seguito a queste rivelazioni, il governo spagnolo ha\nimmediatamente licenziato il capo dei servizi segreti del Paese, Paz Esteban. Rilevare le\ntracce di Pegasus e di altre infezioni malware avanzate per dispositivi mobili è molto difficile\ned è ulteriormente complicato dalle caratteristiche di sicurezza dei moderni sistemi operativi\ncome iOS e Android. Secondo le nostre osservazioni, la loro analisi è resa ancora più difficile\ndal fatto che si tratta di distribuzioni di malware non persistenti, che non lasciano quasi\nalcuna traccia dopo il riavvio del dispositivo infetto.\n\nPoiché molti strumenti forensi richiedono un jailbreak (completo, in questo caso, di intrusione\nconsenziente) del dispositivo, il malware viene rimosso dalla memoria durante il riavvio,\nnecessario per questa operazione. Fortunatamente, ad oggi, è possibile utilizzare diversi\nmetodi per rilevare Pegasus e altri malware mobili. Ad esempio, il Mobile Verification Toolkit\n(MVT) di Amnesty International è gratuito (7), open source e consente a tecnici e\ninvestigatori di ispezionare i telefoni cellulari alla ricerca di segni di infezione. L’MVT è\nsupportato da un elenco di IoC (indicatori di compromissione) compilato da casi di alto profilo\ndi abuso dei diritti umani, reso disponibile anche da Amnesty International.\n\nIn questi tempi di incertezza, molti utenti preoccupati in tutto il mondo si chiedono come\nproteggere i propri dispositivi mobili da Pegasus e da altri strumenti e malware simili.\n\nAllo stesso modo, i governi stanno cercando di valutare le proprie debolezze e di sviluppare\nstrategie per identificare tali vulnerabilità, o almeno per evitare che si verifichino in futuro. In\nquesto articolo esamineremo le più recenti tecniche di attacco utilizzate per distribuire\n\n\n-----\n\nmalware sui telefoni cellulari e come\ndifendersi da esse, tenendo presente che un\nelenco di tecniche di difesa non è esaustivo.\nInoltre, poiché gli aggressori cambiano il loro\nmodus operandi, anche le tecniche di difesa\nesistenti devono essere adattate molto\nfrequentemente.\n\n**Come si fa a stare al sicuro dalle minacce**\n**informatiche mobili più sofisticate?**\n\nInnanzitutto, va detto che Pegasus è un kit di\nstrumenti dal prezzo relativamente alto. Il costo di un’implementazione completa può\nraggiungere facilmente i milioni di dollari. Allo stesso modo, altre minacce informatiche mobili\npossono essere distribuite attraverso exploit 0-click 0-day.\n\nQuesti sono estremamente costosi: ad esempio, Zerodium, una società di intermediazione di\n“exploit”, richiede fino a 2,5 milioni di dollari per una catena di infezioni Android 0-click con\npersistenza avanzata:\n\nSi può trarre subito una conclusione importante: lo spionaggio informatico sofisticato è\nun’attività che richiede molte risorse. Quando uno sponsor può permettersi di spendere\nmilioni, o addirittura decine di milioni o centinaia di milioni di dollari USA in programmi\noffensivi, è altamente improbabile che un obiettivo possa evitare di essere infettato. In\n\n\n-----\n\npratica, più prosaicamente, non si tratta di se si può essere infettati, ma quando e come: è,\ninfatti, solo una questione di tempo e del prima che voi siate infettati, grazie alle risorse\ncorrispondenti ai vostri strumenti e al loro livello di sicurezza.\n\nLa buona notizia è che lo sviluppo di exploit e la guerra informatica offensiva sono spesso\npiù un’arte che una scienza esatta. Gli exploit devono essere adattati a versioni specifiche\ndel sistema operativo e dell’hardware e possono essere facilmente vanificati da nuovi sistemi\noperativi, nuove tecniche di mitigazione o persino da piccole cose come eventi casuali.\n\nDa questo punto di vista, l’infezione e il bersaglio sono anche una questione di costi e\ndifficoltà per gli aggressori. Sebbene non sia sempre possibile impedire lo sfruttamento e\nl’infezione di un dispositivo mobile, possiamo cercare di renderlo il più difficile possibile per\ngli aggressori.\n\nCome lo facciamo nella pratica? Ecco una semplice lista di controllo:\n\n**Su iOS:**\n\na) Riavviare ogni giorno.\n\nSecondo le ricerche di Amnesty e CitizenLab,\nla catena di infezione di Pegasus si basa\nspesso su clic quotidiani senza persistenza,\nper cui un riavvio regolare ripulisce il\ndispositivo.\n\nSe il dispositivo viene riavviato\nquotidianamente, gli aggressori dovranno reinfettarlo più volte. A lungo andare, questo\naumenta le possibilità di rilevamento; potrebbe verificarsi un arresto anomalo o l’installazione\ndi semplici app che rivelano un’infezione di natura stealth.\n\nIn realtà, non si tratta solo di teoria, ma di pratica: abbiamo analizzato un caso in cui un\ndispositivo mobile è stato preso di mira da un exploit 0-click (probabilmente\nFORCEDENTRY). Il proprietario del dispositivo lo ha riavviato regolarmente e lo ha fatto\nentro 24 ore dall’attacco. Gli aggressori hanno cercato di colpirlo più volte, ma alla fine\nhanno rinunciato dopo essere stati colpiti più volte durante i riavvii.\n\nb) Disattivare iMessage.\n\niMessage è integrato in iOS ed è abilitato per impostazione predefinita, il che lo rende un\ninteressante vettore di sfruttamento. Essendo abilitato per impostazione predefinita, è un\nmeccanismo di consegna privilegiato per le stringhe da 0 clic.\n\nPer molti anni gli exploit di iMessage sono stati molto richiesti, con guadagni significativi per\nle società di intermediazione di “exploit”. “Negli ultimi mesi abbiamo assistito a un aumento\ndel numero di exploit per iOS, soprattutto per Safari e iMessage, sviluppati e venduti da\nhacker di tutto il mondo. Il mercato degli zero-day è talmente inondato di exploit per iOS che\nrecentemente abbiamo iniziato a rifiutarne alcuni”, ha scritto il fondatore di Zerodium\n\n\n-----\n\nChaouki Bekrar nel 2019 a WIRED (8).\nCi rendiamo conto che questo potrebbe essere molto difficile per alcuni (in seguito), ma se\nPegasus e altri malware APT mobili di fascia alta sono tra i modelli di minaccia che vi\npreoccupano, questo è un compromesso che vale la pena fare.\n\nc) Disattivare Facetime.\n\nCome sopra.\n\nd) Mantenere aggiornato il dispositivo mobile; installare le ultime patch di iOS non appena\ndisponibili.\n\nNon tutti possono permettersi di utilizzare le vulnerabilità 0-day. In effetti, la maggior parte\ndei kit di exploit per iOS di cui siamo a conoscenza mira a vulnerabilità che sono già state\ncorrette. Tuttavia, molte persone utilizzano telefoni più vecchi e rimandano gli aggiornamenti\nper vari motivi.\n\nSe volete stare al passo con (alcuni) hacker sponsorizzati dallo Stato, aggiornate il vostro\nsistema operativo il prima possibile e imparate a non avere bisogno di emoji per installare le\npatch (9).\n\ne) Non cliccate mai sui link ricevuti nei messaggi SMS.\n\nÈ un consiglio semplice ma efficace. Non tutti i clienti di Pegasus possono permettersi di\nacquistare catene di 0-day da milioni di dollari, quindi si affidano a exploit da 1 clic.\n\nQueste arrivano sotto forma di messaggio, a volte via SMS, ma anche tramite altri servizi di\nmessaggistica o persino via e-mail. Se ricevete un SMS interessante (o un messaggio\ntramite qualsiasi altro servizio di chat) con un link, apritelo su un computer desktop,\npreferibilmente utilizzando TOR Browser o un sistema operativo sicuro non persistente come\nTails.\n\n\n-----\n\n_f ) Navigare in Internet con un browser non nativo, come Firefox Focus, invece di Safari o_\n_Chrome. Sebbene tutti i browser su iOS utilizzino praticamente lo stesso motore di ricerca,_\nWebkit, alcuni exploit non funzionano bene (vedi il caso APT LightRighter / TwoSailJunk\n(10)) su alcuni browser alternativi:\n\n_Il sistema operativo LightRiver verifica la presenza di “Safari” nella stringa dell’agente utente._\n\n\n-----\n\n**Stringhe dell agente utente su iOS da Chrome (sinistra) /Firefox (destra):**\n\n_g) Utilizzate sempre una VPN che mascheri il vostro indirizzo IP e il traffico dati._\n\nAlcuni exploit vengono trasmessi da attacchi MitM tramite l’operatore GSM, durante la\nnavigazione di siti HTTP o tramite DNS hijacking. Utilizzando una VPN per mascherare il\nvostro indirizzo IP e il vostro traffico dati, è difficile per il vostro operatore di telefonia mobile\nindividuarvi direttamente su Internet.\n\nComplica inoltre il processo di targeting se gli aggressori hanno il controllo del flusso di dati,\nad esempio durante il roaming.\n\nTenete presente che non tutte le VPN sono uguali e non tutte le VPN sono buone da usare.\nSenza individuare una VPN in particolare, ecco alcune cose da considerare quando si\nacquista un abbonamento VPN: Acquistare significa esattamente questo: niente VPN\n“gratuite”.\n\nCercate servizi che accettino pagamenti in criptovalute.\nCercate servizi che accettino pagamenti in criptovalute.\nCercate servizi che non richiedano di fornire informazioni di registrazione.\nCercate di evitare le applicazioni VPN: utilizzate invece strumenti open source come\nWireGuard e OpenVPN e profili VPN.\nEvitate i nuovi servizi VPN e cercate quelli ben noti che esistono da tempo.\n\n_h) Installare un’applicazione di sicurezza che controlli e avverta se il dispositivo è jailbroken._\n\nFrustrati dal fatto di essere presi a calci nel sedere più e più volte, gli aggressori finiranno per\nimplementare un meccanismo di persistenza e “jailbreakare” il vostro dispositivo (accedere\nillegalmente a tutti i suoi contenuti). In questo caso le possibilità di catturare i malintenzionati\nsi decuplicano e possiamo sfruttare il fatto che il dispositivo è stato jailbroken.\n\n_i) Eseguire il backup di iTunes una volta al mese._\n\nCiò consente di diagnosticare e individuare le infezioni in un secondo momento, utilizzando il\nmeraviglioso pacchetto MVT di Amnesty.\n\n_j) Attivare spesso i sysdiag e salvarli in backup esterni._\n\nGli strumenti forensi possono aiutarvi a determinare in seguito se siete stati presi di mira.\nL’attivazione di un sysdiag (un’applicazione che consente una diagnosi completa del sistema\ne dei contenuti) dipende dal modello di telefono.\n\nAd esempio, su alcuni iPhone è sufficiente premere contemporaneamente i tasti VOL Su +\n\n\n-----\n\nGiù + Accensione. È possibile che si debba\ngiocare più volte con questi tasti finché il\ntelefono non emette un segnale acustico. Una\nvolta creato, il sysdiag apparirà nella\ndiagnostica nella sezione “dati analitici”.\n\n**2. Su Android**\n\n_a) Riavviare ogni giorno._\n\nLa persistenza sulle ultime versioni di Android\nè difficile, molti APT e fornitori di exploit\nevitano la persistenza!\n\nb) Mantenere il telefono aggiornato; installare\n_le ultime patch._\n\nc) Non cliccate mai sui link ricevuti nei\n_messaggi SMS._\n\nd) Navigare in Internet con un altro browser\n_come Firefox Focus invece di Chrome._\n\ne) Utilizzate sempre una VPN che mascheri il\n_vostro indirizzo IT e il traffico dati._\n\nAlcuni exploit si diffondono tramite attacchi MitM agli operatori GSM, durante la navigazione\ndi siti HTTP o tramite DNS hijacking.\n\nf ) Installare una suite di sicurezza che esegua la scansione del malware e controlli e avvisi\n_se il dispositivo è jailbroken._\n\nA un livello più sofisticato, verificate sempre il traffico di rete utilizzando gli IOC dal vivo. Una\nbuona configurazione potrebbe includere una VPN Wireguard sempre attiva verso un server\nsotto il vostro controllo, che utilizza pihole per filtrare le cose negative e registra tutto il\ntraffico per una successiva ispezione (11).\n\n**Una partita a punteggio zero?**\n\nRyan Naraine, un noto commentatore di sicurezza, ha dichiarato: “iMessage e FaceTime –\n_questi sono i motivi per cui la gente usa gli iPhone!“ E ha ragione: iMessage e FaceTime_\nsono due delle migliori aggiunte che Apple abbia fatto al suo ecosistema.\n\nFortunatamente, Apple ha migliorato notevolmente la sandbox di sicurezza che protegge\niMessage con BlastDoor in iOS 14 (12). Tuttavia, l’exploit FORCEDENTRY utilizzato da NSO\nper distribuire Pegasus ha aggirato BlastDoor e, naturalmente, nessuna funzione di\nsicurezza è mai a prova di hacker al 100% (13).\n\n\n-----\n\nBlastDoor in iOS 14 (12). Tuttavia, l exploit\nFORCEDENTRY utilizzato da NSO per\ndistribuire Pegasus ha aggirato BlastDoor\ne, naturalmente, nessuna funzione di\nsicurezza è mai a prova di hacker al 100%\n(13).\n\n**Allora, cosa c’è di meglio in entrambi i**\n**mondi, vi chiederete?**\n\nAlcune persone, me compreso, hanno più\ntelefoni: uno con iMessage disattivato e un\niPhone “honeypot” con iMessage attivato.\nEntrambi sono ovviamente associati allo\nstesso ID Apple e allo stesso numero di\ntelefono. Se qualcuno decide di prendermi\ndi mira in questo modo, è probabile che\nfinisca nel telefono honeypot.\n\n**Non tacete se siete osservati…**\n\nNaturalmente, è possibile seguire alla lettera queste raccomandazioni ed essere comunque\ninfettati. Purtroppo, questa è la realtà in cui viviamo oggi. Quando qualcuno ci dice di essere\nstato preso di mira da uno spyware mobile, gli diciamo di riflettere su queste domande:\n\nChi vi ha preso di mira e perché?\nCercate di capire cosa vi ha portato all’attenzione dei grandi.\nPotete evitarlo in futuro comportandovi in modo più discreto?\nPuò parlarne?\n\nQuesto ha finito per far crollare molte società di sorveglianza, grazie alla cattiva pubblicità\nche tali casi hanno creato per loro, come quando molti reporter e giornalisti riportano gli\nabusi e smascherano le bugie e i misfatti generati da un operatore del settore.\n\nSe siete stati presi di mira, cercate di trovare un giornalista e raccontate la vostra storia.\n\n**Cambiare il dispositivo**\n\nSe si utilizzava iOS, provare a passare ad Android per un po’. Se eravate su Android,\npassate a iOS. Questo può confondere gli aggressori per un po’; ad esempio, è noto che\nalcuni attori delle minacce acquistano sistemi operativi che funzionano solo su una\ndeterminata marca di telefono e di sistema operativo.\n\n\n-----\n\nAcquistare un dispositivo secondario, preferibilmente con GrapheneOS, per comunicazioni\nsicure. Utilizzatelo con una carta prepagata o collegatevi solo tramite Wifi e TOR in modalità\naereo.\n\nEvitate i messaggi in cui dovete fornire il vostro numero di telefono ai vostri contatti. Una\nvolta che un aggressore è in possesso del vostro numero di telefono, può facilmente\nprendervi di mira attraverso molti messenger diversi: iMessage, WhatsApp, Signal,\nTelegram, poiché sono tutti collegati al vostro numero di telefono.\n\nUn’interessante novità è Session, che instrada automaticamente i messaggi attraverso una\nrete simile a Onion e non dipende dai numeri di telefono.\n\nCercate di entrare in contatto con un ricercatore di sicurezza della vostra zona e discutete\ncostantemente delle migliori pratiche. Condividete con loro dati, messaggi sospetti o accessi\nnon appena ritenete che ci sia qualcosa di strano.\n\nLa sicurezza non è mai un’unica soluzione istantanea che offra una garanzia al 100%;\nconsideratela come un fiume, dove dovete adattare la vostra navigazione alla velocità, alle\ncorrenti e agli ostacoli.\n\nAlla fine di tutto questo, vorrei lasciarvi con un pensiero. Se siete presi di mira da attori al\nservizio di Stati nazionali, significa che siete importanti.\n\nRicordate: è bello essere importanti, ma è più importante essere gentili.\n\nDa soli siamo deboli, insieme siamo forti.\n\nIl mondo può essere distrutto, ma credo che stiamo vivendo un momento in cui possiamo\nancora fare la differenza.\n\nSecondo un rapporto del Committee to Protect Journalists (CPJ), nel 2021 sono stati\nimprigionati 293 giornalisti, il numero più alto mai registrato dal CPJ da quando ha iniziato a\nregistrarlo nel 1992 (14).\n\nSta a noi dare forma a quello che sarà il mondo per noi tra 10 anni, per i nostri figli e per i\nfigli dei nostri figli.\n\n\n-----\n\n**[Autore: Costin G. Raiu](https://www.cybertrends.it/costin-g-raiu/)**\n\n**Riferimenti**\n\n_[(1) https://www.amnesty.org/en/latest/news/2021/07/ the-pegasus-project/](https://www.amnesty.org/en/latest/news/2021/07/)_\n\n_(2) https://www.theguardian.com/news/2021/jul/29/ israeli-authorities-inspect-nso-group-_\n_offices-afterpegasus- revelations_\n\n_(3) https://www.theregister.com/2021/10/29/india_ nso_pegasus_probe/_\n\n_(4) https://www.theguardian.com/technology/2021/ nov/23/apple-sues-israeli-cyber-firm-nso-_\n_group_\n\n(5) https://www.reuters.com/technology/exclusiveus- state-department-phones-hacked-withisraelicompany- spyware-sources-2021-12-03/\n\n_(6) https://www.theguardian.com/world/2022/may/02/ spain-prime-minister-pedro-sanchez-_\n_phone-pegasusspyware_\n\n_[(7) https://github.com/mvt-project/mvt](https://github.com/mvt-project/mvt)_\n\n_[(8) https://www.wired.com/story/android-zero-daymore- than-ios-zerodium/](https://www.wired.com/story/android-zero-daymore-%20than-ios-zerodium/)_\n\n_(9) https://twitter.com/ryanaraine/ status/1324445133668974592_\n\n_(10)_ _[https://securelist.com/ios-exploit-chain-deployslightspy- malware/96407/](https://securelist.com/ios-exploit-chain-deploys-lightspy-malware/96407/)_\n\n_(11)_ _[https://pi-hole.net](https://pi-hole.net/)_\n_(12)_ _[https://googleprojectzero.blogspot.com/2021/01/ a-look-at-imessage-in-ios-14.html](https://googleprojectzero.blogspot.com/2021/01/)_\n\n_(13)_ _https://citizenlab.ca/2021/09/forcedentry-nsogroup- imessage-zero-click-exploit-_\n_captured-in-thewild/_\n\n_(14) https://edition.cnn.com/2021/12/09/media/ journalists-imprisoned-cpj-census/index.html_\n\nCopyright © 2022\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-10 - “Pegasus”, the spyware for smartphones. How does it work and how can you protect yourself-.pdf"
    ],
    "report_names": [
        "2022-08-10 - “Pegasus”, the spyware for smartphones. How does it work and how can you protect yourself-.pdf"
    ],
    "threat_actors": [
        {
            "id": "741d58a1-0fc0-41a8-9681-106a06c07e61",
            "created_at": "2022-10-25T16:07:23.983046Z",
            "updated_at": "2025-03-27T02:02:10.062384Z",
            "deleted_at": null,
            "main_name": "Operation Poisoned News",
            "aliases": [
                "Operation Poisoned News",
                "TwoSail Junk"
            ],
            "source_name": "ETDA:Operation Poisoned News",
            "tools": [
                "dmsSpy",
                "lightSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535541,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1660795087,
    "ts_modification_date": 1660795087,
    "files": {
        "pdf": "https://archive.orkl.eu/455936cd0e1316ba71e94a73b14b3f2022a3df9b.pdf",
        "text": "https://archive.orkl.eu/455936cd0e1316ba71e94a73b14b3f2022a3df9b.txt",
        "img": "https://archive.orkl.eu/455936cd0e1316ba71e94a73b14b3f2022a3df9b.jpg"
    }
}