{
    "id": "71d3e2d7-e67b-4df8-a133-6f9badd18dd7",
    "created_at": "2023-01-12T14:58:49.770848Z",
    "updated_at": "2025-03-27T02:15:39.218708Z",
    "deleted_at": null,
    "sha1_hash": "815f7073520ce0715a070075ee4df548ac45aaaf",
    "title": "2021-02-16 - Hard lessons learned- Threat intel takeaways from the community response to Solarigate",
    "authors": "",
    "file_creation_date": "2022-05-27T21:29:47Z",
    "file_modification_date": "2022-05-27T21:29:47Z",
    "file_size": 268215,
    "plain_text": "# Hard lessons learned: Threat intel takeaways from the community response to Solarigate\n\n**[accenture.com/us-en/blogs/cyber-defense/threat-intel-takeaways-solarigate](https://www.accenture.com/us-en/blogs/cyber-defense/threat-intel-takeaways-solarigate)**\n\nShare\n\n[Since the December 8 FireEye announcement of an internal breach, the cybersecurity](https://www.fireeye.com/blog/threat-research/2020/12/unauthorized-access-of-fireeye-red-team-tools.html)\nworld has been beset by breaking information providing new parts to the evolving story that\nhas affected many companies and government organizations. Today, it appears that the\nsupply chain breach of SolarWinds is perhaps one of the largest and most sophisticated\ncyber intrusions ever. As 2021 begins, we find ourselves already wanting to know how we,\nas cyber intelligence providers, can learn from this breach and better communicate about\ncyber threats to our customers?\n\nBackground\n\nAs has been widely reported, it appears that SolarWinds was the initial point of compromise\nfor FireEye and other organizations worldwide, including local and federal government\nagencies, information and communications technology companies, health-related and\npharmaceutical organizations, and educational entities worldwide. However, as new\ninformation continues to come to light, researchers have identified likely additional infection\nvectors used by the same actor.\n\n\n-----\n\nThis breach is remarkable for its complexity, its targeting of U.S. national security interests,\nand the breadth of potential targets. The malware used is highly advanced and welldisguised with defense evasion features. Although many suspect it to be of Russian origin,\nto date no cyber security vendor has definitively linked the malware to a known group or\npreviously identified malware family. Using a supply chain vendor to infect tertiary victims at\nscale is an increasingly popular tactic amongst advanced threat actors, with some of the\n[most high-profile supply chain attacks including the ASUS compromise,](https://securelist.com/operation-shadowhammer/89992/) CCleaner supply\nchain attack, [NotPetya attack, amongst others.](https://www.bbc.com/news/technology-44941875)\n\nWhat does this breach mean for cyber threat intelligence (CTI)?\n\nThe technological sophistication and the potentially enormous reach of the supply-chain\ntactic make the SolarWinds breach truly an industry-changing hack. Breaches this large can\nserve as a catalyst for change, and signs of change can already be seen in the way CTI\npractitioners communicate to stakeholders and customers. Specifically, this compromise\nhas brought more teamwork across the cyber threat intel field, more sharing of behavior\nanalytics, and a level of comfort with reporting even in the absence of definitive attribution.\n\n<<< Start >>>\n\nPerhaps the most overdue change is for CTI to move away from sharing solely\nindicators of compromise (IOCs) to sharing behavior analytics.\n\n<<< End >>>\n\nThese changes, some overdue, will help CTI analysts become more agile and effective at\ncommunicating intelligence with our customers in five ways:\n\n1. Ensure proactive threat hunting and integration with endpoint detection and\n\n**response (EDR) services to inform the analytic process and include threat hunting**\nbehavior analytics in the final product.\n2. Fuse intelligence into incident response procedures to advise and identify the\n\nmost damaging threats, vulnerabilities, and active compromises in victim networks\nand, conversely, feed incident response data into threat intelligence platforms to\ninform wider compromise implications.\n3. Increase timeliness in reporting so customers can stay ahead of the game.\n\nReducing the requirement to attribute threat activity, while also working more closely\nwith intelligence partners will shorten the analytic production timeline.\n4. Understand the full attacker lifecycle by ensuring that threat investigators place\n\nequal effort in pinpointing the initial attack vector as they place in malware\nidentification and remediation.\n\n\n-----\n\n5. Expand the CTI customer base by demonstrating that threat intelligence can benefit\n\ngovernance, risk, and compliance offices and acquisition units within organizations in\naddition to their IT departments. Companies can deter and quickly mitigate cyber\nthreats, particularly supply chain attacks, with a whole-of-business awareness of the\nthreats and required responses.\n\nBehavior analytic sharing\n\nPerhaps the most overdue change is for CTI to move away from sharing solely indicators of\ncompromise (IOCs) to sharing behavior analytics. As observed in some of the leading\nanalysis by [FireEye,](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html) [Microsoft, and others, intelligence vendors are sharing behavior](https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/)\ndetections. Monitoring for threat activity solely based on IOCs fails to detect novel\ncampaigns such as the SolarWinds supply chain breaches.\n\nBehavioral analytics speaks to the threat actor’s tactics, techniques, and procedures (TTPs)\nand is the most difficult for a threat actor to change from one victim to the next. Thus, they\nappear at the highest level of the Pyramid of Pain hierarchy conceptualized by David J.\nBianco. In contrast, threat actors can easily change the hash values of their malware and\ncan vary their C2 infrastructure making it difficult for defenders to stay ahead of their antics\nif only monitoring for IOCs. For example, within the SolarWinds investigation, Accenture CTI\nhas observed several different hash values of the TEARDROP malware where the malware\ncode was identical except some samples had null bytes added into the code, demonstrating\nhow easily threat actors can change these indicators.\n\nAt a level of abstraction above IOCs, threat actors can change their toolset, which is more\ndifficult to do but will stave off defenders looking for tool reuse. Despite this, there are often\nsimilar artifacts between tools that allow researchers to attribute it.\n\nPushing the CTI industry towards sharing actionable detection opportunities based on\nattacker TTPs is a more resilient approach to detecting advanced attackers.\n\n<<< Start >>>\n\n\n-----\n\n<<< End >>>\n\nT.E.A.M. (together everyone achieves more)\n\nThe SolarWinds breach exemplifies the benefit of intelligence sharing and building industry\npartnerships. Beginning with the initial announcement by FireEye and followed quickly by\nblogs by Microsoft and others, public and private entities were teaming together to identify\nand disrupt the breach.\n\nThese partnerships go beyond what has been publicly disclosed, with intelligence sharing\nconversations amongst stakeholders throughout the industry happening daily. Formal\npartnerships and informal partnerships have ensured customers are getting the latest\nintelligence and indicators of compromise. These partnerships are evident in the constant\nflow of security vendor blogs – each adding a piece to the puzzle. Intelligence partnering\nand transparent information sharing is demonstrating that the cyber defense industry is\ngreater than the sum of its parts.\n\nWithin organizations, teamwork across multiple teams – from CTI, to Incident Response, to\nendpoint detection and response (EDR) services – is enabling cyber threat analysts to\nprovide customers with timely and actionable intelligence. Building upon the behavior\nanalytics sharing, practitioners can recommend immediate actions that customers can take\nto mitigate and begin to remediate the risk. Within Accenture, we take a team approach to\nproviding mitigations – giving organizations short-, medium-, and long-term suggestions\naimed at benefitting our customers’ governance, risk, and compliance (GRC), IT, and\nacquisition departments.\n\n\n-----\n\nA change to attribution\n\nA final insight of the SolarWinds response is a move away from definitively attributing the\ncompromise to a known threat group prior to reporting on it. Eliminating the requirement to\nattribute threat activity allows intelligence analysts to get the vital information into\nstakeholders’ hands as quickly as possible. Analysts can focus on getting technical details\nwith concrete detection or mitigation recommendations out quickly while spending\ndedicated time after the initial publication on determining attribution.\n\nIn the past, CTI has largely focused on grouping threat activity and attributing it to a specific\nknown nation-state or defined espionage or criminal threat group. However, attribution to an\nidentifiable group is increasingly difficult.\n\nWith the commodification of tools, more and more groups are using the same tools whether open-source tools or utilities inherent to the operating system. Threat actors,\nparticularly advanced actors, are also more deftly removing signs of their custom malware\nand presence in a network. This makes it difficult to track a threat group by, for example,\nusing the same custom tool across campaigns. On the other hand, individual developers\nlikely take their tools with them as they change teams or may work as contractors to\nmultiple teams, so CTI researchers can find the same tool or code overlap across multiple\ngroups, making it difficult to distinguish the unique group attribution.\n\nThe cyber security vendor reporting related to the SolarWinds breach is proving that CTI\nteams can share quality threat intelligence without having direct attribution to a known,\nattributed threat group. Perhaps this breach will disrupt the way that CTI has adhered to\nattribution, instead moving intelligence past group attribution to a discussion of novel tactics\nand behaviors with attribution limited to the state level, rather than to specific groups.\n\nConclusion\n\nAs CTI teams change how they communicate intelligence to customers, the teams should\nalso change how they collect and monitor intelligence. Instead of building intelligence\nrequirements based on threat groups, we will define our requirements based on known\nmalicious behaviors -- looking for evidence of a compromise through defined malicious\nTTPs. Identifying attacker behavior patterns allow threat hunters to track cyber attackers\nregardless of whether they change their tooling or infrastructure.\n\nCTI teams monitor passive external sources as well as current triggering geopolitical events\nto preempt threat actor activities, fusing and contextualizing data to pass to customers to\nhelp protect their networks. Keeping a constant awareness of the most pressing issues and\niteratively adjusting our collection and priorities keeps CTI at the forefront of new threat\nactor developments.\n\nThe [Accenture Cyber Threat Intelligence (ACTI) team provides actionable and relevant](https://www.accenture.com/us-en/services/security/cyber-defense?src=curated+daily+content_twitter_100001148493693)\nthreat intelligence to support decision makers. The intelligence analysis and assessments in\nthis report are grounded in verified facts; more information on this activity is available to\n\n\n-----\n\nsubscription customers on ACTI IntelGraph. IntelGraph is a proprietary next generation\nsecurity intelligence platform that allows users to search, visualize, and contextualize the\nrelationships between malicious actors, their tools and the vulnerabilities they exploit.\n\n**Accenture Security**\n\nAccenture Security helps organizations build resilience from the inside out, so they can\nconfidently focus on innovation and growth. Leveraging its global network of cybersecurity\nlabs, deep industry understanding across client value chains and services that span the\nsecurity lifecycle, Accenture help organizations protect their valuable assets, end-to-end.\nWith services that include strategy and risk management, cyber defense, digital identity,\napplication security and managed security, Accenture enables businesses around the world\nto defend against known sophisticated threats, and the unknown. Follow us\n@AccentureSecure on Twitter or visit us at [www.accenture.com/security.](http://www.accenture.com/security)\n\nAccenture, the Accenture logo, and other trademarks, service marks, and designs are\nregistered or unregistered trademarks of Accenture and its subsidiaries in the United States\nand in foreign countries. All trademarks are properties of their respective owners. All\nmaterials are intended for the original recipient only. The reproduction and distribution of\nthis material is forbidden without express written permission from Accenture. The opinions,\nstatements, and assessments in this report are solely those of the individual author(s) and\ndo not constitute legal advice, nor do they necessarily reflect the views of Accenture, its\nsubsidiaries, or affiliates. Given the inherent nature of threat intelligence, the content\ncontained in this report is based on information gathered and understood at the time of its\ncreation. It is subject to change. Accenture provides the information on an “as-is” basis\nwithout representation or warranty and accepts no liability for any action or failure to act\ntaken in response to the information contained or referenced in this report.\n\nThis document makes descriptive reference to trademarks that may be owned by others.\nThe use of such trademarks herein is not an assertion of ownership of such trademarks by\nAccenture and is not intended to represent or imply the existence of an association between\nAccenture and the lawful owners of such trademark.\n\nCopyright © 2021 Accenture. All rights reserved.\n\nAlexandrea Berninger\n\nSecurity Delivery Associate Manager\n\n\n-----\n\nAlexandrea is an intelligence analyst for Accenture s Cyber Threat Intelligence team.\n\nFollow me:\n\nSubscribe to Accenture's Cyber Defense Blog Subscribe to Accenture's Cyber Defense Blog\n\nSubscribe\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-16 - Hard lessons learned- Threat intel takeaways from the community response to Solarigate.pdf"
    ],
    "report_names": [
        "2021-02-16 - Hard lessons learned- Threat intel takeaways from the community response to Solarigate.pdf"
    ],
    "threat_actors": [
        {
            "id": "1c97ccfd-1888-492c-b7b9-bb52c4c3809b",
            "created_at": "2023-01-06T13:46:38.940529Z",
            "updated_at": "2025-03-27T02:00:02.957652Z",
            "deleted_at": null,
            "main_name": "Operation ShadowHammer",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation ShadowHammer",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535529,
    "ts_updated_at": 1743041739,
    "ts_creation_date": 1653686987,
    "ts_modification_date": 1653686987,
    "files": {
        "pdf": "https://archive.orkl.eu/815f7073520ce0715a070075ee4df548ac45aaaf.pdf",
        "text": "https://archive.orkl.eu/815f7073520ce0715a070075ee4df548ac45aaaf.txt",
        "img": "https://archive.orkl.eu/815f7073520ce0715a070075ee4df548ac45aaaf.jpg"
    }
}