{
    "id": "71f39ac8-1772-4f35-8b00-22648952913d",
    "created_at": "2022-10-25T16:48:10.854312Z",
    "updated_at": "2025-03-27T02:16:57.922376Z",
    "deleted_at": null,
    "sha1_hash": "abac715cbc6d033fdb588a36f3e9eaa9535d102b",
    "title": "Без названия",
    "authors": "",
    "file_creation_date": "2015-11-16T13:33:54Z",
    "file_modification_date": "2015-11-17T17:09:45Z",
    "file_size": 4075270,
    "plain_text": "# RUSSIAN FINANCIAL CYBERCRIME: HOW IT WORKS.\n\n### Ruslan Stoyanov, Head of Computer Incidents Investigation\n\n\n-----\n\n### Contents\n\nIntroduction ........................................................................................................................... 2\n\nSituation overview ................................................................................................................. 2\n\nThe structure of the Russian-language cybercriminal market .............................................. 5\n\n\"A Range of products and services\" .................................................................................. 5\n\nThe “labor market\" of financial cybercrime ........................................................................ 6\n\nOptions for organizing a criminal group ............................................................................ 9\n\nDistribution of roles in a large cybercriminal group ............................................................. 13\n\nVirus writer/Programmer ................................................................................................. 13\n\nTesters ............................................................................................................................ 14\n\nWeb designers and Web programmers .......................................................................... 14\n\nDistributors ...................................................................................................................... 14\n\nHackers ........................................................................................................................... 15\n\nSystem administrators ..................................................................................................... 15\n\nCall services .................................................................................................................... 16\n\nMoney flow managers ..................................................................................................... 16\n\nHead of Mules (Mule “project” leader) ............................................................................. 17\n\nMule “projects”................................................................................................................. 17\n\nStuffers ............................................................................................................................ 19\n\nOrganizer ........................................................................................................................ 19\n\nStages of the attacks .......................................................................................................... 19\n\nConclusion .......................................................................................................................... 20\n\nReference. What is Kaspersky Lab Computer Incidents Investigation? ............................. 22\n\n#### 1\nKaspersky Lab\n\n\n-----\n\n## Introduction\n\nThe Russian-language cybercrime market is known all over the world. By ‘Russian-language\nmarket’ we mean cybercriminals who are citizens of the Russian Federation and some\nformer USSR countries, predominantly Ukraine and the Baltic states. Why is this market\nknown worldwide? There are two main factors: the first of these is frequent global media\ncoverage of the activity of Russian-language cybercriminals. The second is the open\naccessibility of online platforms used by the cybercriminal community for communications,\npromoting a variety of \"services\" and \"products\" and discussing their quality and methods of\napplication, if not for making actual deals.\n\nOver time, the range of \"products\" and \"services\" available through this underground market\nhas evolved, becoming more focused on financial attacks, and with an ever-increasing level\nof sophistication. One of the most common types of cybercrime was (and still is) the turnover\nof stolen payment card data. With the emergence of online stores and other services\ninvolving e-payment transactions, DDoS-attacks and financial cybercrime have become\nespecially popular with the fraudsters whose main targets are users’ payment data or the\ntheft of money directly from user accounts or companies.\n\nAttacks on users’ and companies’ e-wallets were initiated by the Trojan ibank in 2006; then\ncame ZeuS (2007) and SpyEye (2009) followed by the groups Carberp (2010) and Carbanak\n(2013). And this list is incomplete; there are more Trojans out there, used by criminals to\nsteal users’ money and data.\n\nWith online financial transactions becoming more common, the organizations supporting\nsuch operations are becoming more attractive to cybercriminals. Over the last few years,\ncybercriminals have been increasingly attacking not just the customers of banks and online\nstores, but the enabling banks and payments systems directly. The story of the Carbanak\ncybergroup which specializes in attacking banks and was exposed earlier this year by\nKaspersky Lab is a clear confirmation of this trend.\n\nKaspersky Lab experts have been monitoring the Russian hacker underground since it first\nemerged. Kaspersky Lab regularly issues reports on financial cyber-threats which track\nchanges in the number of financial malware attacks carried out over time. Information on the\nnumber of attacks may indicate the extent of the problem but does not reveal anything about\nwho creates them and how. We hope that our review will help to shed light on this aspect of\nfinancial cybercrime.\n\nThe data presented in this article is compiled from dozens of investigations that Kaspersky\nLab experts have participated in over the last few years, as well as their many years’\nexperience observing the Russian cybercrime market.\n\n## Situation overview \n\nAccording to Kaspersky Lab, between 2012 and 2015, law enforcement agencies from a\nnumber of different countries, including the United States, Russia, Belarus, Ukraine and the\nEU arrested over 160 Russian-speaking cybercriminals who were members of small,\n\n#### 2\nKaspersky Lab\n\n\n-----\n\nmedium-sized and large criminal groups. They were all suspected of being engaged in\nstealing money using malware. The total damage resulting from their worldwide activity\nexceeded $790 million dollars. (This estimate is based both on the analysis of public\ninformation about the arrests of people suspected of committing financial cybercrime in the\nperiod between 2012 and 2015 and on Kaspersky Lab’s own data.) Of this sum, about $509\nmillion dollars was stolen outside the borders of the former USSR. Of course, this figure only\nincludes confirmed losses, the details of which were obtained by law enforcement authorities\nduring the investigation. In reality, cybercriminals could have stolen a much larger amount.\n\n70\n\n62\n\n60\n\n53\n\n50\n\n40\n\n30 30\n\n20\n\n14\n\n10\n\n0\n\n2012 2013 2014 2015\n\n_The number of arrests of Russian-speaking cybercriminals as officially announced during the period 2012 to 2015_\n\nSince 2013, Kaspersky Lab’s Computer Incidents Investigation team has participated in the\ninvestigation of more than 330 cybersecurity incidents. More than 95% of these were\nconnected with the theft of money or financial information.\n\nAlthough the number of arrests of Russian-language criminals suspected of financial\ncybercrime increased significantly in 2015 compared with the previous year, the\ncybercriminal market is still \"crowded.\" According to Kaspersky Lab experts, over the last\nthree years Russian-language cybercrime has recruited up to a thousand people. These\ninclude people involved in the creation of infrastructure, and writing and distributing malware\ncode to steal money, as well as those who either stole or cashed the stolen money. Most of\nthose arrested are still not in prison.\n\nWe can calculate fairly precisely the number of people who make up the core structure of an\nactive criminal group: the organizers, the money flow managers involved in withdrawing\nmoney from compromised accounts and the professional hackers. Across the cybercriminal\n\n#### 3\nKaspersky Lab\n\n\n-----\n\nunderground, there are only around 20 of these core professionals. They are regular visitors\nof underground forums, and Kaspersky Lab experts have collected a considerable amount of\ninformation that suggests that these 20 people play leading roles in criminal activities that\ninvolve the online theft of money and information.\n\nThe exact number of groups operating across Russia and its neighboring countries is\nunknown: many of those involved in criminal activities participate in several thefts and then,\nfor various reasons cease their activity. Some participants of known but apparently\ndisbanded groups continue their criminal activities as part of new groups.\n\nKaspersky Lab’s Computer Incidents Investigation Department can now confirm the activity\nof at least five major cybercriminal groups specializing in financial crimes. These are the\ngroups whose activities have been monitored by the company's experts over the last few\nyears.\n\nAll five groups came to the attention of the company’s experts in 2012-2013, and are still\nactive. They each number between ten and 40 people. At least two of them are actively\nattacking targets not only in Russia but also in the USA, the UK, Australia, France, Italy and\nGermany.\n\nSince the investigation into these groups has not been completed, it is not possible to publish\nmore detailed information on the activities of these groups. Kaspersky Lab continues to\ninvestigate their activity and is cooperating with the law enforcement agencies of Russia and\nother countries in order to curb their cybercriminal business.\n\nInvestigation into the activities of these groups has allowed Kaspersky Lab experts to form\nan idea about their methods of operation and the structure of the cybercriminal market.\n\n#### 4\nKaspersky Lab\n\n\n-----\n\n## The structure of the Russian-language cybercriminal market\n\n#### \"A Range of products and services\"\n\nThe cybercriminal market usually comprises a set of \"services\" and \"products\", used for\nvarious illegal actions in cyberspace. These \"products\" and \"services\" are offered to users of\ndedicated online communities, most of which are closed to outsiders.\n\nThe “products” include:\n\n      - Software designed to gain unauthorized access to a computer or a mobile device, in\norder to steal data from an infected device or money from a victim’s account (the\nTrojans);\n\n      - Software designed to take advantage of vulnerabilities in the software installed on a\nvictim's computer (exploits);\n\n      - Databases of stolen credit card data and other valuable information;\n\n      - Internet traffic (a certain number of visits to a customer-selected site by users with a\nspecific profile.)\n\nThe “services” include:\n\n      - Spam distribution;\n\n      - Organization of DDoS attacks (overloading sites with requests in order to make them\nunavailable to legitimate users);\n\n      - Testing malware for antivirus detection;\n\n      - “Packing” of malware (changing malicious software with the help of special software\n(packers) so that it is not detected by antivirus software);\n\n      - Renting out exploit packs;\n\n      - Renting out dedicated servers;\n\n      - VPN (providing anonymous access to web resources, protection of the data\nexchange);\n\n      - Renting out abuse-resistant hosting (hosting that does not respond to complaints\nabout malicious content, and therefore does not disable the server);\n\n      - Renting out botnets;\n\n      - Evaluation of the stolen credit card data;\n\n      - Services to validate the data (fake calls, fake document scans);\n\n      - Promotion of malicious and advertising sites in search results (Black SEO);\n\n      - Mediation of transactions for the acquisition of \"products\" and \"services\";\n\n      - Withdrawal of money and cashing.\n\nPayments for such \"products\" and \"services\" on the cybercriminal market are generally made\nvia an e-payment system such as WebMoney, Perfect Money, Bitcoin and others.\n\n#### 5\nKaspersky Lab\n\n\n-----\n\nAll of these \"products\" and \"services\" are bought and sold in various combinations in order to\nenable four main types of crime. These types can also be combined in various ways\ndepending on the criminal group:\n\n      - DDoS attacks (ordered or carried out for the purpose of extortion);\n\n      - Theft of personal information and data to access e-money (for the purpose of resale\nor money theft);\n\n      - Theft of money from the accounts of banks or other organizations;\n\n      - Domestic or corporate espionage;\n\n      - Blocking access to data on the infected computer for the purpose of extortion;\n\nAccording to Kaspersky Lab experts, the theft of money is currently the most widespread\ntype of crime. The rest of this report therefore focuses on this segment of the Russianlanguage cybercrime market.\n\n#### The “labor market\" of financial cybercrime\n\nThe variety of skills required for the creation of \"products\" and the provision of \"services\" has\ngiven rise to a unique labor market of professionals involved in financial cybercrime.\n\nThe list of key roles is almost exactly the same as that seen in any IT-related company:\n\n      - Programmers / encoders / virus writers (for the creation of new malicious software\nand modification of existing malware);\n\n      - Web designers (for the creation of phishing pages, emails, etc.);\n\n      - System administrators (for the construction and support of the IT infrastructure);\n\n      - Testers (to test the malicious software);\n\n      - “Cryptors” (responsible for the packing of malicious code to bypass antivirus\ndetection).\n\nThe list does not include the heads of the criminal groups, the money flow managers\nengaged in withdrawing money from compromised accounts, and the heads of money mules\nsupervising the process of cashing the stolen money. This is because the relationship\nbetween these elements of the criminal groups is not an employer-employee one, but more\nof a partnership.\n\nDepending on the type and extent of the criminal enterprise, the heads of the groups either\nemploy \"staff\" and pay them a fixed salary or work with them on a freelance basis paying for\na particular project.\n\n#### 6\nKaspersky Lab\n\n\n-----\n\n_An offer of employment posted on a semi-closed forum inviting a programmer to join a cybercriminal group. The job_\n\n_requirements include experience in writing complex bots._\n\n\"Employees\" are recruited either via sites where those involved in criminal activity\ntraditionally gather or via resources for those interested in non-standard ways of making\nmoney online. In some cases, the ads are placed on mainstream job search sites or on the\nlabor exchanges for remote employees.\n\nIn general, employees involved in cybercrime can be divided into two types: those who are\naware of the illegality of the project or the work they are offered, and those who (at least in\nthe beginning) know nothing about it. In the latter case, these are usually people performing\nrelatively simple operations such as copying the interface of banking systems and sites.\n\nBy advertising \"real\" job vacancies, cybercriminals often expect to find employees from the\nremote regions of Russia and neighboring countries (mostly Ukraine) where problems with\nemployment opportunities and salaries for IT specialists are quite severe.\n\n#### 7\nKaspersky Lab\n\n\n-----\n\n_A fraudster has advertised a job vacancy for java / flash specialists on a popular Ukrainian website. The job requirements_\n_include a good level of programming skills in Java, Flash, knowledge of JVM / AVM specifications, and others. The organizer_\n_offers remote work and full employment with a salary of $2,500._\n\nThe idea of searching for \"employees\" in these regions is simple – they carry a saving\nbecause staff can be paid less than employees based in large cities. Criminals also often\ngive preference to candidates who have not previously been involved in cybercrime activity.\n\nOften, such job offers are presented as legitimate work, with the true purpose of the work\nonly becoming clear once the task is received.\n\n#### 8\nKaspersky Lab\n\n\n#### 8\n\n\n-----\n\n_In this example, the organizer of the criminal group offers a job to a javascript programmer, masking it under a vacancy at a_\n_\"Web-innovation studio specializing in the development of highly sophisticated Internet applications.\"_\n\nIn the case of illegal job search sites, less-experienced candidates are expected.\n\n_This vacancy invites a C ++ developer to develop \"custom\" software. In this context \"custom\" software means malicious_\n_software._\n\nThe second reason in favor of remote \"personnel\" is the organizer’s aim of making the\nactivity of the group as anonymous as possible, and to ensure that no single contractor\npossesses complete information about the group.\n\n#### Options for organizing a criminal group\n\nCriminal groups involved in stealing money or financial information that will enable them to\nget access to money, differ in the number of participants and scope of activities. There are\nthree main types of involvement:\n\n      - Affiliate programs\n\n      - Single dealers, small and middle-sized groups (up to ten members)\n\n      - Large organized groups (ten or more participants)\n\nThis division is nominal. The scale of the group’s activity depends on the skillfulness of its\nparticipants, their ambition and the overall level of organizational abilities. In some cases,\nKaspersky Lab experts came across relatively small criminal groups performing tasks that\nusually require a greater number of participants.\n\n#### 9\nKaspersky Lab\n\n\n#### 9\n\n\n-----\n\n_Affiliate programs_\nAffiliate programs are the easiest and least expensive method of getting involved in\ncybercrime activities. The idea behind an affiliate program is that the organizers provide their\n\"affiliates\" with almost all the tools they need to commit a crime. The task of the \"affiliates\" is\nto generate as many successful malware infections as possible. In return, the owner or\nowners of the affiliate program share the income received as a result of these infections with\nthe affiliates. Depending on the type of fraudulent scheme this could be a share of:\n\n       - The sums stolen from the accounts of Internet banking users;\n\n       - The money paid by the user as a ransom when cybercriminals use ransomware\nTrojans;\n\n       - The money stolen from the \"prepaid\" accounts of mobile device users by sending out\nSMS messages to premium mobile numbers with the help of a malicious program.\n\nCreating and supporting an affiliate program for the purpose of stealing money is a\ncybercrime committed, as a rule, by a group of users. However, such projects are often\ncarried out by large organized groups whose activity is analyzed later in this document.\n\n_This advertisement announces the launch of the beta testing of an affiliate program used to distribute encrypting ransomware._\n_Judging by its characteristics, the group's activity is focused on companies located in the US and the UK. This is indicated by_\n_the comment saying that the malware distributed via the partner network is able to encrypt files with 80 different extensions,_\n_many of which are files of applications used in companies. The text on requirements for candidates to participate in testing_\n_includes a demonstration of the presence of traffic or downloads from the United States and the United Kingdom._\n\nAccording to Kaspersky Lab experts, affiliate programs are becoming less popular with\nRussian-language cybercriminals. The main driver of their popularity had been fraudulent\nschemes used to infect users’ mobile devices with malicious programs which then sent out\nSMS messages to premium numbers. However, in the spring of 2014, the Russian regulator\nintroduced new requirements for the organization of such services, which included a need to\nsecure additional confirmation of subscription to a particular paid mobile service. This change\n\n#### 10\nKaspersky Lab\n\n\n#### 10\n\n\n-----\n\nwas instrumental in reducing the number of malicious mobile partner programs to practically\nzero. Nevertheless, this type of joint cybercriminal activity is still used by groups specializing\nin the distribution of encrypting ransomware.\n\n_Small Groups_\nWhat distinguishes this form of cybercriminal activity from an affiliate program is that in this\ninstance the criminal or criminals organize their own fraudulent scheme. Most of the\ncomponents needed for the attack, such as malware and its modifications (\"re-packed\"\nmalware), the traffic, the servers, etc., are bought on the black market. Often, members of\nsuch groups are not experts in the field of computer and network technologies; they learn\nabout the components and organization of financial attacks from public sources, usually\nforums. The abilities of such groups can be restricted by a number of factors. Specifically, the\nuse of widely-available malware results in rapid detection by security solutions. This, in turn,\nmakes cybercriminals invest more money in the distribution of malware and in its \"repacking\" to bypass detection. The end result is a significant drop in profits for the attacker.\n\nMistakes made by this type of cybercriminal often result in their identification and arrest.\nHowever, as a relatively low cost entry into the world of cybercriminal activity (from $ 200),\nthis \"amateur\" format continues to attract new dealers.\n\nAn example of such an \"amateur\" criminal organization is the group that in 2012 was\nconvicted by the Russian court for stealing more than 13 million rubles (then worth about\n$422,000) from a Russian bank’s online customers. During a comprehensive investigation\nKaspersky Lab experts were able to collect the information that allowed law enforcement\nauthorities to identify those behind the theft.\n\nThe court sentenced two members of the criminal group, giving each a suspended sentence\nof four and a half years. However, this verdict did not stop the criminals, and they continued\nto commit crimes, stealing almost as much again over the next two and a half years. They\nwere re-arrested in May 2015.\n\n_Large organized criminal groups_\nLarge criminal groups differ from the other players, both through a larger scale of activity and\nthrough a more thorough approach to the organization and operation of criminal schemes.\nSuch groups can comprise up to several dozen people (not including money mules used for\ncashing and \"laundering\" money.) The targets of their attacks are not limited to individual\nonline banking customers: they also attack small and medium-sized companies, while the\nlargest and most sophisticated of them, such as Carbanak focus mostly on banks and epayment systems.\n\nThe operational structure of large groups differs significantly from smaller groups. To a\ncertain extent, the structure reflects that of an ordinary, average-sized company engaged in\nsoftware development.\n\nIn particular, large groups have some form of regular staff - a group of associates who\nperform organizational tasks in return for a regular, fixed payment. However, even in these\nlarge, professional groups some of the tasks are passed to third-party contractors. For\nexample, the \"re-packing\" of malware can be performed by the staff or hired virus writers or\n\n#### 11\nKaspersky Lab\n\n\n-----\n\nvia third-party services where the process is automated with the help of special software. The\nsame is true for many other elements of the IT infrastructure required for committing crime.\n\nExamples of large, organized criminal groups are Carberp, whose members were arrested in\nRussia and Ukraine in 2012 and 2013 respectively, and Carbanak, unmasked by Kaspersky\nLab in early 2015.\n\nAlthough the damage from the activity of partner programs and small groups can run into\nhundreds of thousands of dollars, the large criminal groups are the most dangerous and\ndestructive. The estimated damage caused by Carberp reaches several hundred million\ndollars (up to a billion). In this regard, studying how these groups function and the tactics\nthey use is extremely important, as it strengthens our ability to effectively investigate their\nactivity and - ultimately - to suppress it.\n\n#### 12\nKaspersky Lab\n\n\n-----\n\n## Distribution of roles in a large cybercriminal group\n\nA major financial cybercrime undertaken by criminal “experts” in security and the finance\nsector can result in multi-million dollar losses for attacked organizations. As a rule, such\ncrimes are preceded by many months of preparation. This preparation includes constructing\ncomplex infrastructure, and selecting and developing malicious software, as well as a\nthorough study of the target organization in order to clarify the details of its internal\noperations and security vulnerabilities. Each member of the criminal group has their own\nresponsibilities.\n\n_The composition of middle-sized and large criminal groups_\n\nThe following role distribution is typical for a criminal group involved in stealing money. The\ndistribution of roles in groups that specialize in other types of cybercrime may be different.\n\n#### Virus writer/Programmer\nA virus writer or programmer is responsible for creating malicious programs, i.e. the\nprograms that allow the attackers to gain a foothold in the corporate network of the target\norganization, download additional malware that will help to obtain the necessary information,\nand ultimately steal money.\n\n#### 13\nKaspersky Lab\n\n\n#### 13\n\n\n-----\n\nThe significance of this group member and the nature of their relationship with the organizers\nmay vary from group to group. For example, if the group uses ready-made malware taken\nfrom open sources or bought from other virus writers, their functions may be limited to setting\nand modifying malicious programs to work in the infrastructure created specifically for a\ncertain cybercrime, or to adapt it for attacks on specific institutions. The most advanced\ngroups, however, tend to rely on their own \"developments\" since it makes a malicious\nprogram less visible to most security solutions and provides more opportunities for malware\nmodification. Where this is the case, the virus writer’s role becomes more important as they\nare responsible for the architecture and feature set of a malicious program.\n\nA virus writer can also take on responsibility for malware \"re-packing\". But this happens only\nwhen the organizer wants to keep the maximum number of tasks within the group, and where\noriginal software is used for malware \"re-packing\". In most cases, however, this procedure is\nshifted to third-party contractors or packing-services.\n\n#### Testers\nThe function of testers in a criminal group is not that different from testers working in legal IT\ncompanies. In both cases, testers receive from their managers the specifications for testing\nprograms in different environments (different versions of operating systems, different sets of\ninstalled applications, etc.) and execute them. If a fraudulent scheme involves fake interfaces\nof remote banking or e-payment systems, the task of testers also includes monitoring the\ncorrect operation of these fakes.\n\n#### Web designers and Web programmers\nTypically, web designers and web programmers are remote employees, whose tasks include\ncreating phishing pages and websites, fake application interfaces and web injects, all of\nwhich are used to steal data to get access to e-payment and e-banking system.\n\n#### Distributors\nDistributors aim to ensure the download of malicious software on as many devices as\npossible. The result is achieved by using several tools. Generally, the group organizer\ndetermines the profile of the users to be infected and buys the required type of traffic from\nthe so-called traffic providers (services to attract users with certain characteristics to a\nparticular website).\n\n#### 14\nKaspersky Lab\n\n\n-----\n\n_An advert offering to buy traffic. Cybercriminals are willing to pay only for the successful installation of malicious software at $_\n_140 per 1000 \"call-backs\" (a message that is sent by the malware to the command server after a successful infection)._\n\nThe organizer can choose and order a spam mailing that will contain either an infected\nattached file or a link taking a victim to a malicious website. The organizers can also choose\nthe site with the necessary target audience; involve hackers in breaking into it and placing\nthe exploit pack on it. Of course, all these tools can be used in combination with each other.\n\n#### Hackers\nOften, in the course of an attack, the exploits and other malicious software the organizer has\nto hand is not enough to infect all the computers necessary for the attack and to anchor in\nthem. It may become necessary to hack into a specific computer or site. In such cases, the\norganizers involve hackers, people who have considerable skills in information security and\nare able to perform non-standard tasks. In many of the cases examined by Kaspersky Lab\nexperts, hackers were occasionally involved and were paid on a fee-for-service basis.\nHowever, if hacking is required regularly (e.g., for targeted attacks on financial institutions), a\nhacker becomes a “team member” and is often one of the cybercriminal group’s key\nparticipants, along with the organizers and money flow managers.\n\n#### System administrators\nSystem administrators in cybercriminal groups perform near-identical tasks to their\ncounterparts in legitimate businesses: they implement the IT infrastructure and maintain it in\nworking condition. Cybercriminal system administrators configure management servers, buy\nabuse-resistant hostings for servers, ensure the availability of tools for anonymous\nconnection to the servers (VPN) and resolve other technical challenges, including the\ninteraction with remote system administrators hired to perform small tasks.\n\n#### 15\nKaspersky Lab\n\n\n-----\n\n#### Call services\n\nSocial engineering is important for the success of the cybercriminal business. Especially\nwhen it comes to attacks on organizations that result in the theft of huge sums of money. In\nmost cases, even if the attackers are able to establish control over the computer from which\nthe transaction could be performed, confirmation of its legitimacy is required to successfully\ncomplete the operation. This is what the \"call service\" is for. At the specified time, its\n\"employees\" play the role of an employee of the attacked organization or a bank with which\nthe organization works, and confirm the legitimacy of the transaction.\n\n\"Call services\" can participate in a particular cybercrime both as a subdivision of the criminal\ngroup, or as a third-party organization, performing a specific task on a fee-for-service basis.\nThe forums that users involved in cybercrime use to communicate with each carry plenty of\nads offering such services.\n\n_This advertisement offers “call services\" in English, German, Dutch and French. The group specializes in calls to Internet stores_\n_and banks, as well to duped mules. Also, the group offers the quick creation of local toll-free numbers used to imitate support_\n_services in fraudulent schemes, receiving SMS messages, and receiving and sending faxes. The criminals ask from $10 to $12_\n_for one call, $ 10 for receiving SMS and from $ 15 for creating toll-free numbers._\n\nAccording to Kaspersky Lab, large cybercriminal groups prefer to have their own “call\nservices” so they hardly ever turn to third-party providers.\n\n#### Money flow managers\nMoney flow managers are members of the cybercriminal group who come into play when all\nthe technical tasks for organizing the attack (choosing and infecting the target and anchoring\nin its infrastructure) are fulfilled, and everything is ready to commit the theft. Money flow\nmanagers are the people who withdraw money from compromised accounts. However, their\nparticipation is not limited to pressing the keys; they play a key role in the whole process.\n\nMoney flow managers usually thoroughly understand the internal rules of the attacked\norganization (they even know the lunch hours of the employee from whose computer the\nfraudulent transaction will be made). They know how the automated anti-fraud systems\noperate and how to bypass them. In other words, in addition to their criminal role of thieves,\n\n#### 16\nKaspersky Lab\n\n\n#### 16\n\n\n-----\n\nmoney flow managers perform \"expert\" tasks that are difficult or impossible to automate.\nPerhaps because of this special status, money flow managers are one of the few members\nof the criminal group who receive a percentage of the stolen money rather than a fixed\n\"salary\".\n\nMoney flow managers often perform as botnet operators. i.e. members of the criminal group\nwho analyze and classify the information obtained from infected computers (the access to\nthe remote banking services, availability of money on the accounts which could be accessed,\nthe organization where the infected computer is located, etc.).\n\nBesides money loaders, these “working conditions” are only shared by the leaders of mule\nprojects.\n\n#### Head of Mules (Mule “project” leader)\nHead of mules is a representative of the criminal group working closely with the people\ninvolved in the process of stealing money. The function of the mules is to get the stolen\nmoney, cash it and transfer to the criminal group its due share. To do this, the head of mules\nbuilds their own infrastructure, which consists of legal entities and individuals with their own\nbank accounts, to which the stolen money is transferred and from which it is later withdrawn\nand moved into the pockets of the fraudsters. The mule project leader cooperates with the\norganizer of the criminal group, and provides them with the numbers of the accounts to which\nthe money loader sends the stolen money. Both mule project leaders and money flow\nmanagers work on commission which, according to the information obtained by Kaspersky\nLab during the course of investigation, can amount to half the sum stolen.\n\n#### Mule “projects”\nMule projects are a vital component of any financial cybercrime. Such groups comprise one\nor more organizers and up to several dozen individual mules.\n\nA mule (or drop) is a holder of a means of payment who, on command from the money mules\nmanager, cashes the money received into their/an account, or transfers it to another account\nas specified by the money mules manager.\n\nMules can be divided into two types: duped and non-duped. Duped mules are people who, at\nleast at the beginning of their cooperation with the money mules manager, do not realize\nthey are involved in a criminal scheme. As a rule, the task of getting and transferring money\nis presented to them under some plausible pretext. For example, the money mules manager\ncan establish a legal entity and appoint to an executive position (the general or financial\ndirector, for example) a person who will perform the functions of the duped mule: such as\nsigning corporate documents which will, in fact serve as a legal screen for withdrawing stolen\nmoney.\n\nNon-duped mules are well aware of the real purpose of the money mules manager’s tasks.\n\nThe options used by the mule projects to withdraw money are manifold. Depending on the\namount of money stolen, they may include individual credit card holders ready to cash\nmoney and give it to the representative of the money mules manager for a small fee, or\n\n#### 17\nKaspersky Lab\n\n\n-----\n\nspecially created legal entities, whose representatives open \"salary projects\" (credit cards for\ntransferring the salaries of company employees) at their corporate bank.\n\nYet another common method for constructing a mule scheme is for non-duped mules to open\ndozens of accounts at different banks.\n\n_This advert offers sets of payment cards (the card, the documents based on which the card was authorized, the SIM card with_\n_which the bank account of the card is associated) that can be used for cashing stolen money. For sale is the card issued by_\n_Russian banks and banks from neighboring countries, as well as banks from the countries of Europe, Asia and the United_\n_States. The Momentum-type set is costs 3000 rubles (less than $50), the set with the Platinum card - eight thousand rubles_\n_(about $120)._\n\nWhen the theft occurs outside of Russia, the role of the non-duped mules is performed by a\ncitizen or group of citizens of an Eastern Europe country, who within a short period of time\nvisit several countries on the continent and in each of them open accounts in their names.\nThen the non-dupe mules provide the money mules manager with the data to access all\nthese accounts. These accounts are used later to withdraw the stolen money.\n\n#### 18\nKaspersky Lab\n\n\n#### 18\n\n\n-----\n\n_An example of an ad offering for sale a list of companies registered in the Russian Federation and in the offshore zone. The_\n_services of cybercriminals cost from $560 to $750._\n\n#### Stuffers\nThe word \"stuffer\" comes from the word “stuff” (a colloquial word for \"goods\"). One way to\nwithdraw stolen money is by buying goods in e-stores with the stolen money, reselling them\nand returning to the fraudsters their due percent. This is done by the stuffers, members of the\ncybercriminal groups engaged in spending money from compromised accounts on\npurchasing goods in online stores.\n\nIn fact, a stuffer is a variation of the money flow manager. Withdrawing money by purchasing\ngoods is generally practiced if the stolen sums are relatively small. As a rule, the stuffers\nwork in a team with the fences. Working \"in tandem\" often involves purchasing a certain type\nof goods, sometimes from a specific manufacturer or a clearly-defined model.\n\n#### Organizer\nIf we consider cybercrime as a project, the organizer of the criminal group is its general\nmanager. Their duties usually include financing the preparatory phase of the attack,\nallocating tasks to executors, monitoring their performance and interacting with third-party\nagents such as mule projects and call services (if the group does not have its own). The\norganizer determines the targets for attacks, selects the necessary \"specialists\" and\nnegotiates with them.\n\n## Stages of the attacks\n\nIt should be noted that the above classifications are not set in stone. In some cases, a single\nmember of the criminal group can combine several roles. Nevertheless, regardless of how\nmany people execute them, each of the roles described can be found when investigating\nalmost every money-related cybercriminal incident. Here's how they work in \"real time.\"\n\n**1. Exploration. When it comes to targeted attacks on a specific company, the organizer first**\ninstructs the contractors to collect information about the company, which will help to develop\na plausible social engineering scheme for the first stage of attack. If we are talking about an\n\n#### 19\nKaspersky Lab\n\n\n-----\n\nattack on individual users, the preliminary exploration stage is skipped or limited to choosing\na \"target audience\" for the attack (for example, the users of the online banking service of a\nspecific bank) and creating phishing emails and phishing sites with relevant content.\n\n**2. Infection. Penetration of the corporate network is performed by spear-phishing or a**\nphishing mass-mailing that contains an attachment with the special document or a malicious\nweb-link. Opening the attachment or following the link leads to malware infection. Often,\ninfection occurs automatically without the user’s awareness or participation - after clicking on\nthe link, a malicious program is automatically downloaded on the user’s computer (drive-by\ndownload) and runs on it.\n\nIn other cases, infection is carried out via compromised popular sites on which a tool is\nplaced that invisibly redirects users to a third-party site containing a set of exploits. Once on\nthis site, the user will be infected with malware.\n\nOnce inside the system cybercriminals use a number of malicious tools to consolidate their\npresence. For example, to ensure that internal sites of compromised organizations have the\nmalware reinstalled when the organization’s security software deletes the previous version.\nIn addition, attackers are often set up within the infrastructure software of the attacked\norganization, enabling easy access to the internal corporate network from outside.\n\n**3. Exploration and implementation. The programs for remote, hidden administration and**\nmanagement are downloaded onto compromised computers. They are used by\ncybercriminals to gain system administrators’ credentials. Legal programs for remote\nmanagement and administration whose functionality is known to many users are often used\nfor this.\n\n**4. Money theft. In the final stage, cybercriminals access the financial systems of the**\ntargeted organization and transfer money from its accounts to the accounts of the mule\nprojects or withdraw money directly at ATMs.\n\n## Conclusion\n\nFinancial cybercrime backed by Russian-speaking criminals has become widespread in\nrecent years and this growth is due to a number of causes. The main ones are:\n\n       - Not enough qualified staff in law enforcement agencies;\n\n       - Inadequate legislation allowing criminals in many cases to avoid responsibility or to\nreceive a lighter sentence;\n\n       - A lack of established procedures for international cooperation between law\nenforcement agencies and expert organizations in different countries.\n\nUnlike the real world, a robbery in cyberspace usually goes unnoticed and there is a very\nsmall window for collecting digital evidence after the crime. Further, criminals have no need\nto stay in the country where the crime is committed.\n\nUnfortunately, for Russian-speaking cybercriminals current conditions are more than\nfavorable: the risk of prosecution is low while the potential rewards are high. As a result, the\n\n#### 20\nKaspersky Lab\n\n\n-----\n\nnumber of crimes and the damage caused by them is growing, and the market for\ncybercriminal services is increasing momentum.\n\nThe lack of established mechanisms for international cooperation also plays into the hands of\ncriminals: for example, Kaspersky Lab experts know that the members of some criminal\ngroups permanently reside and work in Russia's neighbors, while the citizens of the\nneighboring states involved in criminal activity often live and operate in the territory of the\nRussian Federation.\n\nKaspersky Lab is doing everything possible to terminate the activity of cybercriminal groups\nand encourages other companies and law enforcement agencies in all countries to\ncooperate.\n\nThe international investigation of Carbanak’s activity, initiated by Kaspersky Lab, is the first\nexample of successful international cooperation. If the world is to see a serious and positive\nchange there should be more such cases.\n\n#### 21\nKaspersky Lab\n\n\n-----\n\n## Reference. What is Kaspersky Lab Computer Incidents Investigation?\n\nKaspersky Lab is a well-known developer of anti-malware security solutions. But the\ncompany provides comprehensive protection, and this also includes services for computer\nincidents investigation.\n\nEvidence of an incident, mainly presented in the form of digital data, needs to be collected\nand recorded so that there are no grounds for doubt in the investigation and trial when a\nvictim makes a court application.\n\nKaspersky Lab Computer Incidents Investigation is responsible for:\n\n       - Responding to IT security incidents and providing a quick analysis of the situation;\n\n       - Collecting digital evidence and determining the circumstances of IT security incidents\nin accordance with established procedures;\n\n       - Analyzing the evidence collected, searching the information related to the\ncircumstances of the incident on the Internet and fixing them;\n\n       - Preparing materials for the victim’s application to law enforcement agencies;\n\n       - Providing expert support to investigative operations.\n\nA huge amount of data is processed when responding to IT security incidents and supporting\ninvestigative operations. The analysis of this data, in combination with statistics on malicious\nobjects detected identifies the trends of criminal behavior in cyberspace.\n\nThe Kaspersky Lab Computer Incidents Investigation Department was established in 2011\nand involves six forensic experts.\n\n#### 22\nKaspersky Lab\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.11.18.Russian_financial_cybercrime_how_it_works/Kaspersky_Lab_cybercrime_underground_report_eng_v1_0.pdf"
    ],
    "report_names": [
        "Kaspersky_Lab_cybercrime_underground_report_eng_v1_0"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "33f527a5-a5da-496a-a48c-7807cc858c3e",
            "created_at": "2022-10-25T15:50:23.803657Z",
            "updated_at": "2025-03-27T02:00:55.550132Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "PLATINUM"
            ],
            "source_name": "MITRE:PLATINUM",
            "tools": [
                "JPIN",
                "Dipsind",
                "adbupd"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7d8ef10e-1d7b-49a0-ab6e-f1dae465a1a4",
            "created_at": "2023-01-06T13:46:38.595679Z",
            "updated_at": "2025-03-27T02:00:02.869216Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "TwoForOne",
                "G0068",
                "ATK33"
            ],
            "source_name": "MISPGALAXY:PLATINUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e61c46f7-88a1-421a-9fed-0cfe2eeb820a",
            "created_at": "2022-10-25T16:07:24.061767Z",
            "updated_at": "2025-03-27T02:02:10.094583Z",
            "deleted_at": null,
            "main_name": "Platinum",
            "aliases": [
                "ATK 33",
                "Operation EasternRoppels",
                "TwoForOne"
            ],
            "source_name": "ETDA:Platinum",
            "tools": [
                "AMTsol",
                "Adupib",
                "Adupihan",
                "Dipsind",
                "DvDupdate.dll",
                "JPIN",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "RedPepper",
                "RedSalt",
                "Titanium",
                "adbupd",
                "psinstrc.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1447680834,
    "ts_modification_date": 1447780185,
    "files": {
        "pdf": "https://archive.orkl.eu/abac715cbc6d033fdb588a36f3e9eaa9535d102b.pdf",
        "text": "https://archive.orkl.eu/abac715cbc6d033fdb588a36f3e9eaa9535d102b.txt",
        "img": "https://archive.orkl.eu/abac715cbc6d033fdb588a36f3e9eaa9535d102b.jpg"
    }
}