{
    "id": "722bb6e6-aa88-487c-8666-627855e5eb45",
    "created_at": "2023-06-05T02:07:10.890292Z",
    "updated_at": "2025-03-27T02:06:09.616335Z",
    "deleted_at": null,
    "sha1_hash": "fb839e0f159b183b2cd8cdcea37217270c63c625",
    "title": "2013-02-25 - Caphaw attacking major European banks using webinject plugin",
    "authors": "",
    "file_creation_date": "2023-06-04T12:54:25Z",
    "file_modification_date": "2023-06-04T12:54:25Z",
    "file_size": 389837,
    "plain_text": "# Caphaw attacking major European banks using webinject plugin\n\n**[welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/](https://www.welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/)**\n\nFebruary 25, 2013\n\nAnalysis of malicious code dubbed Win32/Caphaw (a.k.a. Shylock) attacking major\nEuropean banks, with ability to automatically steal money when the user is actively\naccessing his banking account.\n\n25 Feb 2013 - 01:13AM\n\nAnalysis of malicious code dubbed Win32/Caphaw (a.k.a. Shylock) attacking major\nEuropean banks, with ability to automatically steal money when the user is actively\naccessing his banking account.\n\nMalicious code dubbed Win32/Caphaw (also known as Shylock) has been attacking major\nEuropean banks for more than a year (it started to spread in the fall of 2011). Caphaw\ncaught my attention at the beginning of 2013 and I started tracking this threat closely. In this\nblog post I’ve collected the more interesting observations made over this time period,\nincluding the fact that this is one of the few pieces of malware that can automatically steal\nmoney when the user is actively accessing his banking account. (Earlier I published\n[detailed analysis regarding attacks on Russian banks and cybercrime group activity in the](https://www.welivesecurity.com/search/?s=russian+banks+matrosov&x=0&y=0)\nRussian region:Carberp, Ranbyus, Hodprot, and others.)\n\nThe most common regions for detecting Caphaw are the United Kingdom, Italy, Denmark\nand Turkey. According to ESET detection statistics, the period when it was most actively\n[spreading was during the last months of 2012. ESET Virus Radar statistics show the](http://www.virusradar.com/en/Win32_Caphaw/map)\nregions most affected by Caphaw infection during the last week.\n\n\n-----\n\n## The Bot\n\n[Win32/Caphaw has functionality typical of banking malware and in this part of the blog I](http://www.virusradar.com/en/Win32_Caphaw.K/description)\ndescribe only its more interesting traits. This threat has many techniques for bypassing\nsecurity software and evading automated malware samples processing. Caphaw injects its\nbody into all running processes and has multithreading event based architecture for the\nexecution of C&C tasks. Injected malicious code can use inter-process communication\n(IPC) mechanisms via a named pipe.\n\nCaphaw sets many hooks for system functions and one of the most interesting intercepted\n[functions is InitiateSystemShutdownEx(). This hook makes it possible to control the](http://msdn.microsoft.com/en-us/library/windows/desktop/aa376874(v=vs.85).aspx)\nreboot/shutdown process and makes it possible for the malware to restore itself after some\nantivirus cleaning procedures have been carried out.\n\n\n-----\n\nAll string constants in the Caphaw body are encrypted by a simple custom algorithm:\n\nCaphaw provides indirect checks for execution under popular virtual machine environments\n(VMware, VirtualBox and VirtualPC). Caphaw detects virtual machines based on names of\nactive processes and drivers. All those names are stored in the custom hash values by\nfollowing algorithm:\n\n\n-----\n\nThis is what some example code for VMware detection looks like:\n\nThese tricks make it possible for Capshaw to bypass automated sandbox analysis. And\nevery few hours dropper files on the C&C server are repacked by a custom polymorphic\ncryptor service in order to bypass static detection by antivirus signature. Drive-by URLs with\nrepacked droppers look like this list:\n\n\n-----\n\nThe URLs have the following format:\n\nhttps://[random subdomain].[domain]/[DIR]/[DIR-random string]/[dropper file]?r=[random\nnumber]\n\nAt first glance this may look as if random numbers in URL are created by a special\ngeneration algorithm. But this is not the case, and it’s possible for the malware to use any\nrandom numbers. In Caphaw’s body the random number generation algorithm looks like\nthis:\n\nThe URLs for requesting additional modules, webinjects, configuration files and transfer of\ndata to the C&C are in the following format:\n\nHere’s an illustration of how a bot configuration file request from C&C is built according to a\nspecial pattern:\n\nhttp://[URL format]/[key]&id=[bot id]&inst=[master or slave]&net[botnet id] &cmd=cfg\n\nA response from the C&C side looks like this:\n\n\n-----\n\nSuch responses have the following structure:\n\nhttp:// [random subdomain].[domain]/[DIR]/[file_name.jpg]?r=[random number]\n\nThe bot configuration file is encrypted by an RC4 stream cypher. The encryption scheme\nhas following structure: Base64(RC4(cfg_data)). After decryption the configuration file has\nXML code like this:\n\nInside configuration file we find the name of the botnet, C&C addresses and request format\nfor downloadable plugins.\n\n## Plugins\n\nWin32/Caphaw has functionality for downloading and executing additional plugins. All the\ndownloaded plugins for the whole period where we’ve been tracking this botnet are\ndescribed in the following table:\n\n**plugin name** **detection name** **Description**\n\nBackSocks Win32/Caphaw.N back-connect proxy based on SOCKS5\n\nftpgrabber Win32/Caphaw.N collecting FTP passwords and search\ninformation in MS Outlook email’s\nformat (.pst files)\n\nVNC Win32/Caphaw.N standard VNC functionality like plugin\nfrom Zeus\n\nDiskSpread Win32/AutoRun.Caphaw.A worm functionality that spreads via\nshared folders and removable media\n\n\n-----\n\nMessengerSpread Win32/Caphaw.M worm functionality that spreads via\nSkype messages\n\n\nRootkit Win32/Wolcape.A\n(driver)Win32/Wolcape.B\n(dropper)\n\n\nMBR bootkit component replacing usermode trojan by request\n\n\nVideoGrabber Win32/Caphaw embedded plugin in main bot body for\nrecording stream video and send to\nC&C in rar archive\n\nA plugin that distributes Win32/Caphaw through Skype for the first time was tracked in\n[January 2013 by Yurii Khvyl and Peter Kruse from CSIS (Shylock calling Skype). The next](http://www.csis.dk/en/csis/blog/3811/)\n[interesting plugin is an MBR-bootkit module (detected by ESET as Win32/Wolcape.A)](http://www.virusradar.com/en/Win32_Wolcape.A/description)\nwhich is downloaded to infected machines by special request from C&C. This bootkit is\nbased on MBR modification and provides manual loading for an unsigned driver. The\nmalicious int13 handler (this interrupt reads sectors from the hard drive) in the infected MBR\nlooks like this:\n\n\n-----\n\nThe malicious driver is stored in the NTFS file system in the following directory:\n\nThe driver module is encrypted by RC4 cipher with a key length 256 bytes, but originally the\nentropy of the key is 4 bytes due to expansion of 4-byte constant “KuKu” (this constant fills\nthe range with 256 bytes). Here’s the call graph for the routine that loads the malicious\ndriver :\n\n\n-----\n\nThe malicious driver hooks typical system functions for hiding files and processes. The\nmost interesting hooks are implemented to intercept \\\\Driver\\nsiproxy and \\\\Device\\Tcp\nobjects in order to monitor/modify network traffic on an infected machine. The bootkit\nmodule configuration file has the same encryption scheme as user-mode Win32/Caphaw.\nThe decrypted configuration file has the same XML structure as Win32/Caphaw, as\npresented here:\n\n## Webinjects and money stealing scheme\n\nDownloaded webinjects take the same form as configuration data, but the encryption\nalgorithm is different. This first compresses with zlib in deflate mode and subsequently\nencrypts with the same algorithm with string encryption. Decrypted webinjects look like this:\n\n\n-----\n\nHere is a list of attacked banks from the latest configuration files with webinjects:\n\n**region** **attacked banks**\n\nUnited Kingdom hsbc.co.uk\n\nbarclays.co.uk\n\nsantander.co.uk\n\nbankofscotland.co.uk\n\nfirstdirect.co.uk\n\nnatwest.co.uk\n\nrbs.co.uk\n\nItaly poste.it\n\nunicredit.it\n\ncedacri.it\n\nfineco.it\n\nOne of the interesting details in the code injected into a bank’s web page is the substitution\nof all phone numbers with fake numbers owned by the attacker (Merchant of Malice:\nTrojan.Shylock Injects Phone Numbers into Online Banking Websites). This substitution is\nbased on a special configuration of webinjects and has a unique structure for the web page\nof each bank attacked.\n\n\n-----\n\nWin32/Caphaw is an interesting financial malware family: one of the few that has autoload\nfunctionality for automatically stealing money when the user is actively accessing his\nbanking account. An infected user can’t recognize that his money is being stolen, because\nhe sees fake data on the banking web page based on the webinjects’ rules. (Autoloads\nbypass one-time password security checks.) The same functionality was tracked in the\n[Carberp (Carberp Gang Evolution), Gataka (Win32/Gataka banking Trojan – Detailed](https://www.welivesecurity.com/2012/05/24/carberp-gang-evolution-at-caro-2012/)\nanalysis), Win32/Spy.Ranbyus (Win32/Spy.Ranbyus modifying Java code in RBS Ukraine\nsystems) and Tinba malware families. Just for the record, ESET antimalware does detect all\nof these threats.\n\n_Special thanks to my colleagues Anton Cherepanov and Yurii Khvyl (CSIS)_\n\n**Aleksandr Matrosov, Security Intelligence Team Lead**\n\n**SHA1 hashes for analyzed samples:**\n\n1 Win32/Wolcape.A (driver)      766da148d74f7ea9aca692246a945bd70da6cf18\n\n1 Win32/Wolcape.B (bootkit dropper)  f8da98763e345f42c62db02e51bf5d80342cd4d2\n\n\n-----\n\n1 Win32/Caphaw.N (VNC)        b408c56af46237d04e23f77b40c0c6367f3adee7\n\n1 Win32/Caphaw.N (ftpgrabber)     1cc0ce07950f5b8589344977f15e2409a819efb9\n\n1 Win32/Caphaw.N (BackSocks)     43a6ff8c6e17e188e4650316d0627ebb110073d5\n\n1 Win32/Caphaw.M\n(MessengerSpread)  aef115814e5b6af49187d07f3068130c5c910d84\n\n1 Win32/AutoRun.Caphaw.A\n(DiskSpread) 5da3dc57836c351d80653fb09a78a8a8dad87317\n\n25 Feb 2013 - 01:13AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-02-25 - Caphaw attacking major European banks using webinject plugin.pdf"
    ],
    "report_names": [
        "2013-02-25 - Caphaw attacking major European banks using webinject plugin.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930830,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1685883265,
    "ts_modification_date": 1685883265,
    "files": {
        "pdf": "https://archive.orkl.eu/fb839e0f159b183b2cd8cdcea37217270c63c625.pdf",
        "text": "https://archive.orkl.eu/fb839e0f159b183b2cd8cdcea37217270c63c625.txt",
        "img": "https://archive.orkl.eu/fb839e0f159b183b2cd8cdcea37217270c63c625.jpg"
    }
}