{
    "id": "726c0140-1528-4850-92ae-445df6428497",
    "created_at": "2023-01-12T15:10:29.033496Z",
    "updated_at": "2025-03-27T02:16:20.827814Z",
    "deleted_at": null,
    "sha1_hash": "6db7da54bc443ea2d1dbe3055879d8499c74614d",
    "title": "2019-10-03 - COMpfun successor Reductor infects files on the fly to compromise TLS traffic",
    "authors": "",
    "file_creation_date": "2022-05-28T02:04:25Z",
    "file_modification_date": "2022-05-28T02:04:25Z",
    "file_size": 332810,
    "plain_text": "# COMpfun successor Reductor infects files on the fly to compromise TLS traffic\n\n**securelist.com/compfun-successor-reductor/93633/**\n\nAuthors\n\nGReAT\n\nIn April 2019, we discovered new malware that compromises encrypted web\ncommunications in an impressive way. Analysis of the malware allowed us to confirm that the\noperators have some control over the target’s network channel and could replace legitimate\ninstallers with infected ones on the fly. That places the actor in a very exclusive club, with\ncapabilities that few other actors in the world have.\n\nWe called these new modules ‘Reductor’ after a .pdb path left in some samples. Besides\ntypical RAT functions such as uploading, downloading and executing files, Reductor’s\nauthors put a lot of effort into manipulating digital certificates and marking outbound TLS\ntraffic with unique host-related identifiers.\n\nThe Kaspersky Attribution Engine shows strong code similarities between this family and the\nCOMPfun Trojan. Moreover, further research showed that the original COMpfun Trojan most\nprobably is used as a downloader in one of the distribution schemes. Based on these\n\n\n-----\n\nsimilarities, we re quite sure the new malware was developed by the COMPfun authors.\n\n[The COMpfun malware was initially documented by G-DATA in 2014. Although G-DATA](https://www.gdatasoftware.com/blog/2014/10/23941-com-object-hijacking-the-discreet-way-of-persistence)\ndidn’t identify which actor was using this malware, Kaspersky tentatively linked it to the Turla\nAPT, based on the victimology. Our telemetry indicates that the current campaign using\nReductor started at the end of April 2019 and remained active at the time of writing (August\n2019). We identified targets in Russia and Belarus.\n\nWe registered two initial infection schemes: Reductor spreads by either infecting popular\nsoftware distributions (Internet Downloader Manager, WinRAR, etc. and, for at least one\nvictim, through a popular warez website over HTTP); or its decryptor/dropper is spread using\nCOMpfun’s ability to download files on already infected hosts.\n\n## How to mark the TLS handshake without even touching the traffic\n\nThe malware adds digital certificates from its data section to the target host and allows the\noperators to add additional certificates remotely through a named pipe. The solution that\nReductor’s developers found to mark TLS traffic is the most ingenious part. They don’t touch\nthe network packets at all; instead developers analyzed the Firefox source code and Chrome\nbinary code to patch the corresponding pseudo random number generation (PRNG)\nfunctions in the process’s memory.\n\nBrowsers use PRNG to generate the ‘client random’ sequence for the network packet at the\nvery beginning of the TLS handshake. Reductor adds encrypted unique hardware- and\nsoftware-based identifiers for the victims to this ‘client random’ field. In order to patch the\nsystem’s PRNG functions, the developers used a small embedded Intel instruction length\ndisassembler.\n\n\n-----\n\n_In order to patch browser PRNG memory functions and add unique user IDs into the TLS handshake,_\n\n_the developers of Reductor had to analyze Firefox and Chrome code_\n\n## Why we believe on-the-fly infection took place\n\nAs we don’t know what happens on the ‘server’ side, we can only rely on ‘client’ analysis. In\norder to distinguish handshakes of interest from all the TLS traffic, the campaign operators\nfirstly have to decrypt this ‘client hello’ field. This means the campaign operators somehow\nneed to have access to the target’s traffic.\n\nThe Reductor malware does not carry out a man-in-the-middle (MitM) attack itself. However,\nour initial thought was that the installed certificates may facilitate MitM attacks on TLS traffic;\nand the ‘client random’ field, with the unique ID in the handshake, would identify the traffic of\ninterest. Later analysis provided even more basis for this idea.\n\nWe initially observed that infected installers were downloaded from HTTPS warez websites;\nbut, as often happens, the files themselves were downloaded through unencrypted HTTP.\nThis makes it technically possible to replace the files with malicious ones during the\ndownload process. Interestingly, the configuration data of some samples contained very\npopular legitimate websites. We really don’t think they were compromised to serve as control\nservers.\n\nIn any case, we didn´t initially know how the installers were infected, because the original\ndownloaded files were no longer available for analysis on the warez websites. And there was\nalways the possibility that the installers were infected on the website from which they were\noriginally downloaded.\n\nThen more recent Reductor telemetry gave us a clue. This time samples were again being\ndownloaded from warez websites, but we were able to confirm that in this new case the\noriginal installers were not infected. This allowed us to confirm that Reductor’s operators\n\n\n-----\n\nhave some control over the target s network channel and could replace legitimate installers\nwith infected ones on the fly.\n\n## Reductor features\n\nThe malware authors are creative and sometimes even seem to be having a bit of fun. For\ninstance, one of the web domains they use for COMpfun (the publicly known name) is\ncompfun[.]net. The domain-user-password triad hardcoded into the decryptor-dropper was\n“uac is useless”. Here’s a summary of the different types of campaign artifacts found:\n\n\n**Initial infection** **Escalation, detection**\n**avoidance**\n\n**Malware** COMpfun Trojan Reductor dropperdecryptor\n\n\n**Main payload**\n\nReductor Trojan\n\n\n**Process** One of the browsers Same browser lsass.exe\n\n**Persistence** COM CLSID hijacking Auxiliary module, N/A LSA notification package\n\n\n**Net**\n**encryption**\n\n**Host**\n**encryption**\n\n\nAES 128 Local module, N/A AES 128\n\n\nConfiguration data\nencrypted with one\nbyte XOR and\ncompressed with\nLZNT1\n\n\nReductor in resources\nencrypted with one\nbyte XOR and\ncompressed with\nLZNT1\n\n\nVictims’ unique IDs in\nTLS ‘client hello’\nencrypted using XOR\nwith changing round key\n\n\nAs we have already mentioned, there are two different methods used by the attackers to\nspread Reductor. In the first scenario, the attackers use infected software installers with 32and 64-bit versions of Reductor included. These installers may be for popular Internet\nDownload Manager, Office Activator, etc.\n\nIn the second scenario, the targets are already infected with the COMpfun Trojan, which\nuses COM CLSID for persistence. After getting into the browser’s address space, the Trojan\ncan receive the command to download additional modules from the C2. As a result, the\ntarget’s browser downloaded Reductor’s custom dropper-decryptor.\n\nThe coding style is quite distinctive throughout the modules. Take a look at them in the\nfollowing table:\n\n**Feature** **Description**\n\n\nStrings\nstorage\n\n\nAll the strings in use, such as function names for resolving dynamic\naddresses, are returned by the small functions. The developers probably\nimplemented them using the C preprocessor #define directive.\n\n\n-----\n\nFunction\naddress\ndynamic\nresolution\n\nExtensive\nuse of\ncustom\nstructures\n\n\nFor every dynamic linked library in use, the developers implemented a\nstandalone function and a custom structure to store the addresses of its\nfunctions for further use.\n\nThe developers used custom structures for every task: C2 communication,\nthread synchronization, resolving of system function addresses, etc.\n\n\n## System fingerprinting hashes inside TLS ‘client random’\n\nAs mentioned above, Reductor adds its own ‘victim id’ inside TLS packets. The first four-byte\nhash (cert_hash) is built using all of Reductor’s digital certificates. For each of them, the\nhash’s initial value is the X509 version number. Then they are sequentially XORed with all\nfour-byte values from the serial number. All the counted hashes are XOR-ed with each other\nto build the final one. The operators know this value for every victim, because it’s built using\ntheir digital certificates.\n\nThe second four-byte hash (hwid_hash) is based on the target’s hardware properties:\nSMBIOS date and version, Video BIOS date and version and hard drive volume ID. The\noperators know this value for every victim because it’s used for the C2 communication\nprotocol. The resulting custom 16-byte structure to spoof the originally PRNG-generated\nvalues looks like this:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n\nstruct client_hello_system_fingerprint {\n\nDWORD initial_xor_key; // First four bytes generated by original system PRNG function\n\nDWORD predefined_const; // Set to 0x45F2837D\n\nDWORD cert_hash; // Reductor's digital certificates hash\n\nDWORD hwid_hash // Target's hardware hash\n\n};\n\n\nThe latter three fields are encrypted using the first four bytes – initial PRN XOR key. At every\nround, the XOR key changes with the MUL 0x48C27395 MOD 0x7FFFFFFF algorithm. As a\nresult, the bytes remain pseudo random, but with the unique host ID encrypted inside.\n\n## PRNG patching\n\nThe table below enumerates the patched auxiliary and PRNG system functions.\n\n\n-----\n\n**Library** **Patched function** **Features**\n\n**Auxiliary**\n**functions**\n\n“ntdll.dll” RtlReleaseResource() Save auxiliary data like current thread ID\nand current tick count;\n\nmemcpy() If “client hello” has to be copied, then\ncount cert_hash and hwid_hash, change\nsource bytes to encrypted\nclient_hello_system_fingerprint structure\nand call original memcpy();\n\n\nOne of the C\nruntime\nlibraries\n\n“kernel32.dll”\nor\n“kernelbase.dll”\n\n**PRNG**\n**functions**\n\n\ntime64() Save time passed since 1 January 1970;\n\nGetSystemTimeAsFileTime()\n\n\n“nss3.dll” PK11_GenerateRandom() Call original PRNG function and generate\ninitial XOR key from its result. Change\nPRNG result: set seventh byte to 1, then\nsave 0x45F2837D, hwid and cert hashes.\nEncrypt the result and return it instead of\nthe original PRN. It will affect calls to\nssl3_SendClientHello() ->\nssl3_GetNewRandom(ss>ssl3.hs.client_random);\n\n“advapi32.dll” CryptGenRandom() Spoof these system PRNG function\nresults in similar way with some minor\nchanges;\n\n“bcrypt.dll” BCryptGenRandom()\n\n“chrome.dll” PRNG function Find PRNG function by its binary code\ntemplate and patch it like all the\naforementioned.\n\n## Firefox nss3.dll PK11_GenerateRandom() patching\n\nReductor patches nss3.dll for Firefox. This library’s source code is publicly available.\nPK11_GenerateRandom() is used in the /security/nss/lib/ssl/ssl3con.c in the\nssl3_GetNewRandom() function. The SSL3_RANDOM_LENGTH constant is 32 bytes, so\n\n\n-----\n\nReductor s code changes all the results and the functions, which call to\nssl3_GetNewRandom() will receive the modified random data with the encrypted target\nfingerprinting inside.\n\nIn this case, the caller function to ssl3_GetNewRandom(ss->ssl3.hs.client_random) is\nssl3_SendClientHello() in order to generate the client random data for the initial\ncommunication handshake.\n\n_To affect the TLS handshake malware authors patched PK11_GenerateRandom() inside the Firefox_\n\n_process memory_\n\nPatching PK11_GenerateRandom() would also affect the generation of any 256-bit (32 bytes)\ninitialization vector (IV) generation, for example, for AES 256 in ssl_SelfEncryptProtect() or\nother crypto functions in NSS libraries used by Firefox. From our point of view, this would be\na side effect of Reductor with no additional purpose.\n\n## Installed digital certificates\n\n\n-----\n\nReductor samples hold DER-encoded root X509v3 certificates in the .data section to add on\nthe target hosts. The malware is also able to get additional certificates from the operators\nthrough a named pipe.\n\n\n**Certificate SHA1 fingerprint** **CA for root**\n**cert**\n\n\n**Valid till (GMT)**\n\n\n119B2BE9C17D8C7C5AB0FA1A17AAF69082BAB21D ie-paypal 2031.11.17\n22:56:10\n\n\n546F7A565920AEB0021A1D05525FF0B3DF51D020 GeoTrust Rsa\nCA\n\n959EB6C7F45B7C5C761D5B758E65D9EF7EA20CF3 GeoTrust Rsa\nCA\n\n\n2031.11.17\n22:56:10\n\n2031.11.17\n22:56:10\n\n\n992BACE0BC815E43626D59D790CEF50907C6EA9B VeriSign, Inc. 2031.11.17\n22:56:10\n\n_One of the decoded CA X509v3 certificates inside the Reductor malware_\n\n## C2 communication\n\nAll C2 communications are handled in a standalone malware thread. Reductor sends HTTP\nPOST queries to the /query.php scripts on the C2s listed in its configuration. The POST\nquery contains the target’s unique hardware ID encrypted with AES 128. The C2 returns one\nof the following encrypted commands.\n\n\n-----\n\n**C2**\n**command**\n\n\n**Features**\n\n\nhostinfo Get the host name\n\ngettimeout Get the timeout value from the corresponding registry value\n\noptions Parse strings and set corresponding values in the system registries. So far\nonly one option is supported – timeout\n\ndomainlist Transmit the current C2 domains used by target\n\ndownfile Download the file of interest\n\nupfile Upload the file of interest\n\nexecfile Create the process that executes mentioned file\n\nnop Do nothing. Possibly used to check the connection with the host\n\nkill Delete installed digital certificates, files, cookies and system registry values\nincluding those related to COM CLSID or LSA notification package\npersistence\n\ndeletefile Delete file at a specified path\n\ncertlist Renew the digital certificates installed on target\n\n## Conclusions\n\nTurla has in the past shown many innovative ways to accomplish its goals, such as using\n[hijacked satellite infrastructure[2]. This time, if we’re right that Turla is the actor behind this](https://securelist.com/compfun-successor-reductor/93633/)\nnew wave of attacks, then with Reductor it has implemented a very interesting way to mark a\nhost’s encrypted TLS traffic by patching the browser without parsing network packets. The\nvictimology for this new campaign aligns with previous Turla interests.\n\nWe didn’t observe any MitM functionality in the analyzed malware samples. However,\nReductor is able to install digital certificates and mark the targets’ TLS traffic. It uses infected\ninstallers for initial infection through HTTP downloads from warez websites. The fact the\noriginal files on these sites are not infected also points to evidence of subsequent traffic\nmanipulation.\n\n**File Hashes**\n\n27CE434AD1E240075C48A51722F8E87F\n4E02B1B1D32E23975F496D1D1E0EB7A6\n518AB503808E747C5D0DDE6BFB54B95A\n7911F8D717DC9D7A78D99E687A12D7AD\n\n\n-----\n\n9C7E50E7CE36C1B7D8CA2AF2082F4CD5\nA0387665FE7E006B5233C66F6BD5BB9D\nF6CAA1BFCCA872F0CBE2E7346B006AB4\n\n**Domains and IPs**\n\nadstat.pw\nbill-tat.pw\n\n[Browser](https://securelist.com/tag/browser/)\n[Digital Certificates](https://securelist.com/tag/digital-certificates/)\n[Encryption](https://securelist.com/tag/encryption/)\n[HTTPS](https://securelist.com/tag/https/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[RAT Trojan](https://securelist.com/tag/rat-trojan/)\n[Trojan-Dropper](https://securelist.com/tag/trojan-dropper/)\n[Turla](https://securelist.com/tag/turla/)\n\nAuthors\n\nGReAT\n\nCOMpfun successor Reductor infects files on the fly to compromise TLS traffic\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-03 - COMpfun successor Reductor infects files on the fly to compromise TLS traffic.pdf"
    ],
    "report_names": [
        "2019-10-03 - COMpfun successor Reductor infects files on the fly to compromise TLS traffic.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536229,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653703465,
    "ts_modification_date": 1653703465,
    "files": {
        "pdf": "https://archive.orkl.eu/6db7da54bc443ea2d1dbe3055879d8499c74614d.pdf",
        "text": "https://archive.orkl.eu/6db7da54bc443ea2d1dbe3055879d8499c74614d.txt",
        "img": "https://archive.orkl.eu/6db7da54bc443ea2d1dbe3055879d8499c74614d.jpg"
    }
}