{
    "id": "72b60305-6a5f-4e29-b535-8a8720202007",
    "created_at": "2022-10-25T16:48:16.359144Z",
    "updated_at": "2025-03-27T02:16:26.217963Z",
    "deleted_at": null,
    "sha1_hash": "5d55be36c0b595e3334fbe7bba5de4d62e3456d6",
    "title": "Macintosh HD:Users:Shared:dd:4work:Bitdefender-DT-Whitepaper-IPStorm-WebUseOnly-creat4861-en_EN:Bitdefender-DT-Whitepaper-IPStorm-WebUseOnly-creat4861-en_EN.indd",
    "authors": "",
    "file_creation_date": "2020-10-15T13:08:58Z",
    "file_modification_date": "2020-10-15T13:09:02Z",
    "file_size": 5048664,
    "plain_text": "web use only\n\n# Looking Into the Eye of the Interplanetary Storm\n\n\n-----\n\n#### Contents\n\n##### Executive Summary_______________________________________________________________ 3\n\n Key findings______________________________________________________________________ 4\n\n Introduction_______________________________________________________________________ 4\n\n Overview__________________________________________________________________________ 4\n\n Timeline__________________________________________________________________________ 5\n\n Bot Lifecycle______________________________________________________________________ 5\n\n P2P Communication______________________________________________________________ 7\nTopics________________________________________________________________________________ 7\nProtocols_ ____________________________________________________________________________ 7\nNode Discovery________________________________________________________________________ 8\nRelays_ _______________________________________________________________________________ 8\n\n##### Modules__________________________________________________________________________ 9\nMalware Guard_______________________________________________________________________ 10\nBackshell_ ___________________________________________________________________________ 10\nDDB__________________________________________________________________________________ 10\nVPNGate_____________________________________________________________________________ 11\nReque________________________________________________________________________________ 12\nProxy_ _______________________________________________________________________________ 13\nFiletransfer___________________________________________________________________________ 14\nWebAPI______________________________________________________________________________ 15\n\n##### Mapping the Botnet______________________________________________________________ 16\n\n Infrastructure____________________________________________________________________ 18\n\n Attribution_______________________________________________________________________ 19\nThe Developer________________________________________________________________________ 21\n\n##### Conclusions_____________________________________________________________________ 23\n\n Indicators of Compromise (IoCs)_________________________________________________ 24\n\n**Author:**\n\nSilvia Pripoae - Security Researcher, Bitdefender\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n\n## Executive Summary\n\n\nBitdefender researchers have found clues that the\nInterplanetary Storm Golang botnet could be used as\nhighly anonymous proxy-network-as-a-service and\npotentially rented using a subscription-based model.\n\n\nMapping the Interplanetary Storm botnet, we estimate\nthe size of the botnet at around 9,000 devices.\nThe overwhelming majority have Android as their\noperating system and about 1% Linux. However, a\nvery small number of devices have Windows as their\nOS, but they seem to be running older versions of the\nmalware. In its new iteration, IPStorm propagates by\nattacking Unix-based systems (Linux, Android and\nDarwin) that run Internet-facing SSH servers with\nweak credentials or unsecured ADB servers. We have\nalso seen Darwin only in a few entries that seem\nto represent the same machine, the one used for\ndevelopment of IPStorm.\n\n\n[While the botnet has been under previous scrutiny](https://labs.bitdefender.com/2020/06/ssh-targeting-golang-bots-becoming-the-new-norm/)\nfrom Bitdefender researchers, constant monitoring\nof the development lifecycle of Interplanetary Storm\nhas revealed that threat actors are both proficient in\nusing Golang and development best practices, and\nwell-versed at concealment of management nodes.\nWhile previous research from security researchers\nhas focused on analyzing some of the capabilities\nof the malware and its network traffic, Bitdefender\nresearchers have provided the full picture as well\nas focused on finding leads regarding the malware\ndevelopers’ identity and the potential purpose of the\ninfrastructure.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n## Key findings\n\n- Botnet potentially rented as an anonymous proxy network\n\n- Built to use compromised devices as proxies\n\n- Botnet mapping reveals global presence\n\n- Rented using multi-tier subscription-based pricing model\n\n- More than 100 code revisions to date\n\n- Detailed analysis of the infrastructure behind the Interplanetary Storm botnet\n\n## Introduction\n\nThis article offers a glimpse into the inner workings of the Interplanetary Storm botnet, provides an exhaustive\ntechnical analysis of the Golang-written binaries along with an overview of the protocol internals and finally, some\nattribution information.\n\n[Interplanetary Storm (IPStorm) was first reported by researchers from Anomali in June 2019. In May 2020, we](https://www.anomali.com/blog/the-interplanetary-storm-new-malware-in-wild-using-interplanetary-file-systems-ipfs-p2p-network)\ndiscovered a new campaign of this botnet when it attacked our SSH honeypots. The malware has been in continuous\ndevelopment since then, integrating new features and seeking to blend in with innocuous traffic.\n\nIn its new iteration, IPStorm propagates by attacking Unix-based systems (Linux, Android and Darwin) that run Internetfacing SSH servers with weak credentials or unsecured ADB servers.\n\nIts capabilities include backdooring the device (running shell commands) and generating malicious traffic (scanning\nthe Internet and infecting other devices). We have determined that the main purpose of the botnet is turning infected\ndevices into proxies as part of a for-profit scheme.\n\n[Botnets with this goal have turned up in the past (for instance: dark_nexus, Ngioweb, Gwmndy) and the assumption](https://labs.bitdefender.com/2020/04/new-dark_nexus-iot-botnet-puts-others-to-shame/)\nwas that cybercriminals were selling illegitimate access to devices on underground forums or the Dark Web. This time,\nhowever, we have found evidence that the bot herders are posing as a legitimate proxy service on the Clearnet.\n\n## Overview\n\nThe last two years have seen an increase in malware written in Golang, and Linux botnets make no exception.\n[Emptiness, Liquorbot, Kaiji and Fritzfrog are all examples of Golang bots that target Linux machines using SSH as](https://blog.netlab.360.com/emptiness-a-new-evolving-botnet/)\nan attack vector. Multiple features of this language make it desirable for malware authors: portability and the rich\ncodebase being the foremost.\n\nSome of these malware families follow the model of “traditional” Linux botnets, rewriting them in Go, while others\nhave original design. IPStorm belongs in the latter category, as its core functionality is written from scratch. It\n[integrates open-source implementations of various protocols, such as NTP, UPNP and SOCKS5, and bases its peer-](https://github.com/beevik/ntp)\n[to-peer protocol on libp2p. The libp2p library contains a networking stack through which users can interact with the](https://github.com/libp2p/go-libp2p)\n[Interplanetary Filesystem (IPFS).](https://ipfs.io/)\n\nCompared to other Golang malware we have analyzed in the past IPStorm is remarkable in its complex design due\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nthe botnet is proficient in Golang; one consequence of the malware author’s good coding practices, namely their\nthoroughness in error handling, is that it makes the reverse engineering process easier, as many code sequences are\naccompanied by relevant logging strings.\n\n[The entire functionality of the bot is bundled into a statically linked binary that is packed with UPX. The large size of the](https://upx.github.io/)\nbinaries - about 7.7M packed and 18M unpacked - is due to the inclusion of the Golang runtime. Although the binaries\nhave been stripped, the debugging information persists in the .gopclntab section of the binaries. This allows us to\nrecover the name of the functions and packages and structure of types.\n\nEach IPStorm version is cross-compiled for multiple CPU architectures and platforms, encompassing the following:\n```\nstorm_android-386\nstorm_android-amd64\nstorm_android-arm7\nstorm_android-arm64\nstorm_linux-386\nstorm_linux-amd64\nstorm_linux-arm7\nstorm_linux-arm64\nstorm_darwin-amd64\n\n## Timeline\n\n```\n[The evolution of IPStorm can be tracked precisely, as all binaries are versioned using Semantic Versioning. It can be](https://semver.org/)\nsplit into three phases:\n\n- Major 0, Minor 0: reported by Anomali last year; targeted Windows exclusively\n\n- Major 0, Minor 1: emerged this year (in May 2020); targeted Unix-derived systems\n\n- Major 0, Minor 2: latest evolution (September 2020); transitioned away from the publish-subscribe model\nAs of the writing of this article, the most recent version is 0.2.05a.\n\n## Bot Lifecycle\n\nThe startup code of the bot initializes an IPFS node and launches the goroutines (lightweight threads) dedicated to\neach of the bot’s sub-modules. It sets the oom_adj score for the malware process to -17, ensuring that it will not be\nkilled if the system runs out of available memory. Then, it ensures that only a single instance of the malware runs on\nthe device by periodically scanning the list of processes for the name storm. Any matching process is killed and its\nexecutable removed.\n\nA 2048-bit RSA key pair is generated and stored in a writable path on the filesystem. This key belongs to the IPFS node\nand uniquely identifies it. The node is instantiated and the bootstrap process is started, making it reachable by other\nnodes in the IPFS network. The connection to other peers in the botnet is ensured by periodically “announcing” itself\nd l ki f h b d h ( b hi i h “P2 i i ” i )\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nAn info ticker collects information about the system and publishes this fingerprint on an IPFS pubsub topic. An\nexample of such an entry we retrieved from the info topic is the following (with some information redacted for privacy):\n```\n{\n  “T” : 1592892637,\n  “HostID” : “Qmf4[________________redacted________________]”,\n  “Version” : “0.1.81a”,\n  “Platform” : “linux-arm7”,\n  “SystemInfo” : {\n    “GoOS” : “linux”,\n    “Kernel” : “Linux”,\n    “Core” : “4.19.97-v7+”,\n    “Platform” : “unknown”,\n    “OS” : “GNU/Linux”,\n    “Hostname” : “raspbx”,\n    “CPUs” : 4\n  },\n  “Uid” : “0”,\n  “Gid” : “0”,\n  “UserName” : “root”,\n  “UserDisplayName” : “root”,\n  “UserHomeDir” : “/root”,\n  “IsAdmin” : true,\n  “ExecutablePath” : “/usr/bin/storm”,\n  “InstallationPath” : “/usr/bin/storm”,\n  “ComputerID” : “”,\n  “LocalIPs” : null,\n  “ExternalIP” : “[redacted]”,\n  “Processes” : null\n}\n\n```\nAs information about other peers is not used by bots themselves, we believe that it is collected only for the interest of\nthe bot herders. Fortunately for our research, prior to version 0.1.92a it was also public for anyone knowing the topic\nID.\n\nAnother periodic goroutine is tasked with performing an update if a new version of the bot is available. In this case,\nthe updated file is written to the filesystem, the persistence of the malware is re-established and the process is relaunched.\n\nThe persistence is handled depending on OS.\n\n- [On Linux it uses the open-source daemon package to create a service named storm.](https://github.com/takama/daemon)\n\n- On Android it remounts the filesystem as read-write and overwrites the /system/bin/install-recovery.sh\nfile.\n\n- On Darwin, no persistence method is implemented.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n## P2P Communication\n\nWhen it comes to communication between peers, IPStorm makes use of multiple mechanisms provided by libp2p over\nIPFS:\n\n- topics\n\n- content routing (node discovery)\n\n- libp2p protocols\nDifferent approaches are used for messages intended for all nodes (version updates, file checksums, IDs of nodes with\nspecial roles) and for messages intended for certain nodes (scanning targets, proxy requests, shell commands).\n\nIn the first approach, messages are published on a topic and all nodes subscribe to that topic and process the\nmessages. In the case of the DDB (distributed database), messages published on the topic serve to sync the DB among\nall nodes. Although the messages may come out of order due to the way they are propagated through the network, the\ninclusion of a timestamp enables each node to keep only the most recent value for a given key. To ensure that peers\ncan properly coordinate using timestamps, the bot updates its time by querying a random entry from a list of public\nNTP servers.\n\nThe second method applies for example to the scanning module: a central entity issues scanning commands,\ndistributing the targets to bots. This is achieved by connecting to each bot using a protocol particular to IPStorm.\n\n### Topics\n\n[Topics are part of libp2p’s implementation of the Publish-Subscribe pattern. The following topics are used by IPStorm:](https://docs.libp2p.io/concepts/publish-subscribe/)\n\n\n**Description** **Purpose** **ID**\n\n\ninformation about\ninfo topic the infected\nsystem\n\n\nC0FAh40EtzpBb145aYUcluKo1UJZ-1bRUGg1WJo3OFzWFEKzbShsWFO-wt95L\nog1eP0gp22hX3PQ2iU5w83a8uoPw-C3WngMgFD1\n\n\ncommands 6szrvCIvhS8QSTs6nq0I28i77MNO1DVh4pCVBvRYxm-5dGHPsOa8sNCMypcP\ncmd topic\n(version 0.0.*) oMFTe5BeXWPnNILo3I6G6Ev1gQLeqz54RoMwW9pPFD1\n\nVPNGate information about HyD9c7ZrNrXZqG-M7lVVdOHH5DjmHFz-PBHGk1OdqEpVR-Nn7MXoscraper topic VPNGate servers bDjX7nMdAnqq-SNSyd6WCYgnu-19uT0rvsK3V7bPN-RSrNkITviS\n\n\nsynchronization\nDDB topic messages for the\nDDB\n\n\nM7lVVdOHH5DjmHFzPBHGk1OdqEpVR-HyD9c7ZrNrXZqGNn7MXobDjX7nMdAnqq19uT0rvsK3V7bPN-SNSyd6WCYgnuRSrNkITviS\n\n\nSince version 0.2.*, IPStorm has abandoned these topics in favor of a centralized design using the web API module.\n\n### Protocols\n\n[libp2p protocols come into play when a peer wants to open a direct connection to another peer. The source dials the](https://docs.libp2p.io/concepts/protocols/)\n[destination peer specifying a multiaddress and protocol. The protocol is used to identify which handler is invoked in the](https://docs.libp2p.io/concepts/addressing/)\ndestination node, which only accepts connections for the protocols it supports.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nIPStorm defines a set of its own protocols:\n\n\n**Protocol** **Module** **Purpose**\n\n\n/sreque/1.0.0 storm.reque.client receiving commands from the reque server and sending responses\n\n/shsk/1.0.0 storm.handshake (obsolete) authenticating other peers\n\n/sfst/1.0.0 storm.filetransfer sending samples\n\n/sbst/1.0.0 storm.backshell executing shell commands on the victim’s machine\n\n/sbpcp/1.0.0 storm.proxy communicating with the proxy backend\n\n/sbptp/1.0.0 storm.proxy receiving proxy connections\n\n/strelayp/1.0.0 storm.node authenticating peers used as relays\n\n\n### Node Discovery\n\nThe content routing interface that libp2p offers can be used for peer discovery. Nodes advertise themselves as\nproviders for certain CIDs (content IDs) and likewise search for providers, locating peer nodes.\n\n[This is achieved by working directly with CIDs through the interface offered by go-libp2p-kad-dht (routing.](https://github.com/libp2p/go-libp2p-kad-dht)\n```\nFindProviders). go-libp2p-discovery offers an alternative way, using namespaces which can be converted to CIDs\n\n```\n(routing.FindPeers, routing.Advertise). For each type of discovery used by IPStorm, we list both:\n\n- general peer discovery (provided by all IPStorm nodes):\nNamespace: fmi4kYtTp9789G3sCRgMZVG7D3uKalwtCuWw1j8LSPHQEGVBU5hfbNd\n```\n  nHvt3kyR1fYUlGNAO0zactmIMIZodsOha9tnfe25Xef1\n\n```\nCID: bafkreidcr6e6zr5zs4rqgzbsl5ewsrm4wfgb3jydpk7ad2gcznudglcdqa\n\n- relay discovery:\nNamespace: relay:8LSPHQEGVBU5hfbNdnHvt3kyR1fYU1\nCID: bafkreigrhwwcynbhu4swhhkd6y6dudznk2wouxilm6sq53u6icinlwyi7q\n\n- backend discovery:\nNamespace: proxybackendH0DHVADBCIKQ4S7YOX4X\nCID: bafkreidu4wapxwcecwvwhov2wb53d7mzmyivzmj5raobuegule4syo3bti\n\n- reque discovery:\nNamespace: requeBOHCHIY2XRMYXI0HCSZA\nCID: bafkreifapjcai3rznlq3we4docfeism3kryfwuyxod7ggzksbyekdhd7f4\n\n- web API discovery\nNamespace: web-api:kYVhV8KQ0mA0rs9pHXoWpD\nCID: bafkreibzlbmu7weuqzkt4dwfwdqlfu2spnrsg3t3qvveilllbhqv4qowzq\n\n- seeder discovery\nNamespace: stfadv: + checksum\n\n### Relays\n\nAt some point between 0.1.43a and 0.1.51a, IPStorm introduced support for circuit relays. This may have been\nimplemented to improve reachability for nodes that are behind NAT or as an attempt to conceal the management\nnodes. Shortly after the feature was implemented, most of the management nodes no longer published their IP\naddresses, using relay circuits instead. As an example, Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2\nlisted the following address (among others):\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n“/ip4/78.x.x.120/tcp/52202/p2p/QmVoDwmbfwSUPT3ds5ytWRwhoWZkzgE9qFHiYHfJQ5cAnm/p2p```\ncircuit/p2p/Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2”\n\n```\nThis means that the node at 78.x.x.120:52202 (storm node with ID\n```\nQmVoDwmbfwSUPT3ds5ytWRwhoWZkzgE9qFHiYHfJQ5cAnm) is used as a relay when establishing a connection to\nQmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2.\n\n```\nThe use of this feature has diminished since version 0.1.85a and most nodes list their external IPs. However, some of\nthe nodes remain hidden behind relays and, in some cases, the relays do not belong to the botnet.\n\nOn a related note, another short-lived attempt at concealing the management nodes involved using domains instead\n[of IP addresses. The domains were generated with DNSPod - a domain registration service - and were used for](http://www.dnspod.com/docs/domains.html)\nmultiaddresses advertised as proxy backends on the DDB topic:\n```\n/dns4/splendidobed.site/tcp/443/ipfs/QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV\n/dns4/spenso.me/tcp/443/ipfs/QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV\n\n```\nThrough their configuration, IPStorm nodes enable both the use of relays for outbound connections\n(EnableAutoRelay()) and for the node to act as a relay hop (EnableRelay(circuit.OptHop)). However, peers\nthat want to use an IPStorm node as a hop have to complete a handshake:\n\n- connect to the relay using the /strelayp/1.0.0 protocol\n\n- send the string “HSR”\n\n- the relay should respond with “+\\n”\nNodes that have this feature enabled (this is not true for all versions) advertise themselves on the DDB or using a\nspecific discovery namespace (see “Node Discovery”).\n\n## Modules\n\nThe packages included in IPStorm’s version 0.2.05a are:\n```\nPackages:\nmain\nstorm/backshell\nstorm/ddb\n\n```\nstorm/filetransfer\n```\nstorm/logging\nstorm/malware-guard\nstorm/node\nstorm/powershell\nstorm/proxy\nstorm/reque_client\nstorm/starter\nstorm/statik\nstorm/util\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nOther packages were included in the past but have been replaced or discontinued:\n```\nstorm/avbypass\nstorm/bootstrap\nstorm/handshake\nstorm/identity\nstorm/peers_cache\nstorm/storm_runtime\nstorm/vpngate\n\n```\nIn this section, we provide a technical analysis of the modules that encompass its core functionality.\n\n### Malware Guard\n\nThis task executes periodically, looking for competing malware. Processes are deemed suspicious if their name,\nexecutable path or command line arguments contain any of the strings from a blacklist. The processes are killed and\ntheir executables are removed. The blacklisted strings are:\n```\n/data/local/tmp\nrig\nxig\ndebug\ntrinity\nxchecker\nzpyinstall\nstartio\nstartapp\nsynctool\nioservice\nstart_\ncom.ufo.miner\n\n### Backshell\n\n```\nThis module is used for running shell commands on the infected device. The shell is accessed through a libp2p\nconnection with /sbst/1.0.0 as its protocol ID. The module lacks any authentication or authorization.\n\n### DDB\n\nThe distributed database (DDB) is used by bots to store and share configuration data. For synchronization, each bot\nperiodically publishes the entries in their local database on an IPFS topic. They also subscribe to this topic and process\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nauthorized to update certain keys. libp2p (pubsub) implements message signing; the bot checks that the public key\nused to sign the message belongs to a hardcoded list of trusted public keys;\n\nAn example of a DDB entry retrieved from the associated topic is:\n```\n{\n  “Command” : “SetWithTTL”,\n\n```\n“Key” : “file-checksum/storm_android-amd64”,\n```\n  “Value” : “12c3368e17c04f49cfea139148b63fd1ab1a41e26c113991c2bb0835dd02495b”,\n  “TTL” : 3600000000000,\n  “T” : 1598897109\n}\n\n```\nThe `Command` refers to the operation that should be performed on the database; in this case, the entry has a time-tolive (TTL), which means that it should be discarded after a time interval (the TTL value) has elapsed since its publishing\n(the T timestamp). Key and Value correspond to the actual data stored in the database.\n\nBased on the key, values hold the following meanings:\n\n- “/5aYUcluKo1U1/QrnStmHQXqVcHf8DcWUf1FtIObfCoT3dnmYPWM8gTKmXGhOXu-fdekgniT8VwrgMK4kEWCdBs\nvI2qy0pVygmu-lJtu96t0nroXaN1”\nthe most recent version\n\n- “file-checksum/” + filename\nthe checksum for the latest bot sample for a specific architecture and OS\n\n- “seeders:” + checksum\na peer ID of a bot hosting a sample with a specific checksum\n\n- “seeders-http:” + checksum\nthe IP and port of an HTTP server hosting a sample with a specific checksum\n\n- “relays”\na peer ID of a bot that can act as a relay\n\n- “proxy:backend”\na peer ID of a management node for the proxy module\n\n- “reque:manager”\na peer ID of a management node for the reque module\n\nThe database is an associative array, but there is a distinction to be made from the (key, value) pairs published on\nthe topic. The Set and SetWithTTL commands store the value associated to the key, replacing the previous one. In\nthe case of the SAdd command, the value associated to the key in the database is a list, to which the value from the\nmessage is appended.\n\nAlthough the module is still in use for local storage in the newest sample, the synchronization mechanism has been\nreplaced with queries to management nodes using a web API.\n\n### VPNGate\n\nThis module is used for scraping the API of the public VPN service VPNGate.\n\n[The bot performs a request to “http://www.vpngate.net/api/iphone/” and parses the CSV response. The information](http://www.vpngate.net/api/iphone/)\nobtained about these VPN servers is then published on one of IPStorm’s topics.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nThe reason for the inclusion of this module in the botnet is probably to overcome certain limitations imposed by\nVPNGate that restrict the list of servers returned for a request. By scraping in a distributed manner through the botnet,\nthe bot herders can discover a wider selection of VPN servers. The ulterior use of this data is uncertain. However, in\nlight of other discoveries concerning the motivations of the bot herders (see the Attribution section), we hypothesize\nthat these servers may have been (ab)used in the threat actors’ proxy-for-hire infrastructure.\n\n### Reque\n\nThe reque package (standing perhaps for “requests from command-and-control”) is used for functionalities related to\ncoordinated scanning for SSH and ADB servers and worm-style infection. The bot connects to an IPFS node referred to\nas a reque server through the /sreque/1.0.0 protocol. The commands from this server are distributed among\na queue of workers. The module is designed to be easily extended to handle new commands. Currently, there are two\ncommand handlers, for the tcp-scan and brute-ssh commands.\n\nThe tcp-scan command is used to scan an IP range on a set of ports. If the list of targeted ports contains ports 22 or\n5555, the module follows the SSH and ADB protocols respectively.\n\nThe brute-ssh command has as its parameters a list of IP addresses, a port and credentials. If the bot succeeds in\nobtaining a shell on one of the targeted device, it executes the infection payload, turning the victim into an IPStorm bot.\nAs a honeypot evasion technique, the prompt of the shell is validated using a regular expression before the infection\n[step. The regex matches the “svr04” string, which is the hostname of a Cowrie honeypot.](https://github.com/cowrie/cowrie)\n\nWhile in the case of SSH the bot exhibits worm behavior, for ADB the infection phase is not carried out by bots, which\nonly relay the information about the device found back to the reque manager. The actual infection is carried out by one\nof the bot herder-controlled nodes, which connects to the victim by ADB and issues the infection payload. Based on the\ndata collected from our ADB honeypot, the attackers’ script is equivalent to:\n```\nadb connect $IP:5555\nadb root && adb wait-for-device\nadb remount && adb wait-for-device\nadb shell mount -o rw,remount /data; mount -o rw,remount /system; mount -o rw,remount /\nadb shell echo “{\n \\”user\\”:\\”$(whoami 2>/dev/null)\\”,\n \\”id\\”:\\”$(id 2>/dev/null)\\”,\n \\”root_access\\”:\\”$(getprop persist.sys.root_access 2>/dev/null)\\”,\n \\”machine\\”:\\”$(uname -m 2>/dev/null)\\”,\n \\”curl\\”:\\”$(which curl 2>/dev/null)\\”,\n \\”wget\\”:\\”$(which wget 2>/dev/null)\\”,\n \\”adb\\”:\\”$(which adb 2>/dev/null)\\”,\n \\”iptables\\”:\\”$(which iptables 2>/dev/null)\\”,\n \\”ipset\\”:\\”$(which ipset 2>/dev/null)\\”,\n \\”abi\\”:\\”$(getprop ro.product.cpu.abi 2>/dev/null)\\”,\n \\”abi2\\”:\\”$(getprop ro.product.cpu.abi2 2>/dev/null)\\”,\n \\”abilist\\”:\\”$(getprop ro.product.cpu.abilist 2>/dev/null)\\”,\n \\”abilist32\\”:\\”$(getprop ro.product.cpu.abilist32 2>/dev/null)\\”,\n \\”abilist64\\”:\\”$(getprop ro.product.cpu.abilist64 2>/dev/null)\\”,\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n```\n}”\nadb push install-recovery.sh /system/bin/install-recovery.sh\nadb push storm-install.sh /system/bin/storm-install.sh\nadb push sldrgo /system/bin/sldrgo\n\n```\nThe fingerprinting information gathered through the echo command serves to adapt the rest of the payload. The last\nfile, sldrgo, is an UPX-packed binary compiled for the CPU architecture of the victim. Its purpose is to download the\nmain bot payload.\n\n### Proxy\n\nIPStorm proxies function by tunneling the SOCKS5 protocol through libp2p traffic.\n\nThe module performs two tasks concurrently: maintaining the connection to a backend and handling incoming\nstreams.\n\nThe proxy backend is located using either the DDB (older versions) or the node discovery mechanism. The bot then\nconnects to the backend using the /sbpcp/1.0.0 protocol and periodically pings with its external IP address and\nlatency.\n\n[In the initialization phase, it starts a local SOCKS5 proxy on a randomized port using an open source SOCKS5](https://github.com/armon/go-socks5)\n[implementation. A stream handler for the /sbptp/1.0.0 protocol is instantiated. This allows the node to decapsulate the](https://github.com/armon/go-socks5)\nSOCKS5 proxy traffic from the libp2p stream and forward it to the local proxy. The responses are likewise relayed back\nto the peer through the libp2p stream. In older versions, this is done using an ad-hoc implementation of bidirectional\npipes:\n```\ntype proxy.BidirectionalPipe struct{\n    ctx context.Context\n    lrw io.ReadWriter\n    rrw io.ReadWriter\n    pipe1 *proxy.Pipe\n    pipe2 *proxy.Pipe\n}\ntype proxy.Pipe struct{\n    src io.ReadWriter\n    dst io.ReadWriter\n}\n\n```\n[In newer versions, this is abstracted through the use of the gostream package.](https://github.com/libp2p/go-libp2p-gostream)\n\nThe peer for the incoming connections need not be the same in the logic of the module, but they are both referred to\n(and tagged in the DDB) as proxy backend. As per our observations on our instrumented IPStorm bot, the proxy\nmodule receives connection requests shortly after it starts. The source of the connections is the same node that poses\nas the proxy backend (Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2). We assume that these are due\nto the proxy checker mechanism and have not investigated whether the proxy eventually receives real traffic.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n### Filetransfer\n\nIPStorm hosts the malware binaries in a distributed manner, with each bot “seeding” for one or more samples. This\nfunctionality is implemented in the filetransfer package.\n\nThe bot regularly checks for updates: it retrieves the latest version number, either from the DDB or through the web API.\nIf a new version is available, it is downloaded and the bot is killed and respawned using the new binary. This process\ngenerates a new key pair and therefore a new peer ID.\n\nWhile the sample matching the native architecture and OS is stored in the filesystem, additional samples are stored in\nRAM. Depending on available RAM, a number of other samples are downloaded and served on a local HTTP server.\n\nThis server is opened on a random port at bot startup and is advertised in the DDB. For each hosted sample, the entries\n“seeder:” + checksum and “seeder-http:” + checksum are formatted with the bot’s peer ID or its external IP and port\nof the HTTP service, respectively. In newer versions, this is replaced with POSTing the equivalent data to 2 web API\nendpoints.\n\nThe process of downloading the sample has several steps:\n\n1. retrieving the checksum of the latest sample for a specific CPU architecture and OS\n2. looking for seeders for the file with that checksum\n3. connecting to the peer, either through HTTP or IPFS (protocol /sfst/1.0.0) and downloading the sample\n4. validating the checksum\n[The statik module is used to store a zip file into memory from which files may be retrieved individually. The archive](https://github.com/rakyll/statik)\ncontains:\n```\n Length   Date  Time  Name\n--------- ---------- -----  ---   1764 2020-06-05 13:37  linux/install.sh\n   397 2020-05-12 09:17  storm_android/install-recovery.sh\n   2796 2020-05-12 14:18  storm_android/storm-install.sh\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n```\n   190 2020-05-11 12:24  storm_android/storm.rc\n---------           ------\n```\n5517           5 files\n\nThe first script, linux/install.sh, is used as a downloader/dropper for the main payload in SSH infections. The\nscript is customized by the bot ad-hoc, adding a variable containing recent “seeders” for the payload. The scripts in\n```\nstorm_android are used for re-configuring persistence on Android devices when the bot is updated.\n\n### WebAPI\n\n```\nSince version 0.1.92a IPStorm started transitioning away from the PubSub model to a more centralized design. Bots\nwould no longer coordinate using messages posted by other bots. Instead, all information is aggregated by one or\nmore C2 nodes which expose a Web API.\n\n[The HTTP protocol is layered on top of libp2p connections using the go-libp2p-http package. The services referred to in](https://github.com/libp2p/go-libp2p-http)\nthe IPStorm code as “web API backends” are addressed by their peer IDs and are discovered using the peer discovery\nmechanism.\n\nThe reason for this transition is not clear. Some possible explanations are that the developer(s) have realized that other\nparties can read and potentially interfere with the topics and desired more control, or that the synchronization was\nunreliable. The latter would explain the paradox of why we are seeing multiple bots stuck using old malware versions\nalthough the code is designed to automatically update to the latest available version.\n\nIn addition to ensuring that p2p synchronization is overseen by the bot herder-controlled nodes, the messages remain\nauthenticated and authorization is enforced using the same set of trusted keys as in the case of the DDB.\n\nThe API exposes the following endpoints:\n\n- POST /nodes\nParameters:\n`o` i: fingerprint of the infected system equivalent to the info topic\n\n- GET /version\n\n- GET /files/checksum\nParameters:\n`o` f: filename\n\n- GET /files/seeders-http\nParameters:\n`o` c: checksum\n\n- POST /files/seeders-http\nParameters:\n`o` c: checksum\n`o` s: seeder IP and port\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n## Mapping the Botnet\n\nIn our efforts to monitor the botnet we have used data from multiple sources:\n\n- publicly available “peer info” (ID, public key, addresses and versioning information)\n\n- messages published on topics: the DDB topic, the info topic\n\n- querying the DHT for peers that are part of the botnet\n\nIn the first approach, we used the database of peer information collected by our IPFS crawler. The nodes that belong to\nthe botnet are easily identified by their AgentVersion, which is analogous to the User-Agent from the HTTP protocol.\nFor applications built using go-libp2p, the AgentVersion is set by default to the name of the main package.\nIPStorm nodes have the AgentVersion set to storm. This property enabled us to find nodes that don’t announce\nthemselves on other channels, such as the info topic.\n\nSecondly, we used the same mechanism that enables IPStorm bots to find peers: querying the DHT for specific content\nIDs provided by different classes of nodes within the botnet (regular nodes or ones with special roles).\n\nInformation about the IDs of bots is also available in the info topic and the DDB topic. We used the data in the DDB\ntopic for tracking the versions and the roles of the peers controlled by the threat actors. The data from the info topic\ngave insight into the distribution of victims by country, device type and OS.\n\nIn estimating the size of the botnet, we faced the problem that there is no clear way of discerning whether two node IDs\nrepresent the same infected device. The ID can be changed through version updates or reinfection. The external IP is\nnot a good identifier either, because it can change over time or because multiple nodes can be behind NAT.\n\nBased on the number of different IDs seen in a week, averaged over several weeks, we estimate the size of the botnet\nat around 9,000 devices. The overwhelming majority have Android as their operating system and about 1% use Linux.\nWe have seen Darwin only in a few entries on the info topic which clearly represent the same machine, the one used for\ndevelopment of IPStorm.\n\nThere are still a number of devices that, according to the messages they post on the info topic, run versions of\nIPStorm prior to 0.1.* and have Windows as their OS. Since the new campaign focuses solely on Unix systems, it is\nremarkable that the bots have persisted on these devices since the 2019 campaign.\n\nAlthough the fingerprint contains no specific information about the model of the device, clues can be gathered from the\nOS, kernel version and, sometimes, the hostname and user names. Based on this, we have identified various models of\nrouters, NAS devices, UHD receivers and multi-purpose boards and microcontrollers (such as Raspberry Pi), which may\nbelong to IoT devices.\n\nThe following figures refer to the geographic distribution of victims, as identified by external IPs. Most are in Asia.\nAffecting 98 countries in total, the botnet appears powerful in terms of its capacity for scanning the Internet, but\nthrough its choice of attack vectors targets classes of devices that are more prevalent in certain countries. Our\nhoneypots saw on average 3,500 attacks/day from this botnet, which amounted to a large share of the traffic.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n\n**Country** **# of victims**\n\n\nHong Kong 2901\n\nRepublic of Korea 2125\n\nTaiwan 1018\n\nBrazil 743\n\nUkraine 524\n\nUnited States 380\n\nChina 353\n\nSweden 351\n\nRussia 336\n\nVenezuela 242\n\nPanama 217\n\n\nCanada 159\n\nDistribution of IPStorm victims by country:\n\nDistribution of IPStorm victims by precise location:\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n## Infrastructure\n\nAlthough we didn’t manage to get ahold of binaries from the management infrastructure, they are likely developed in\nthe same project, and we can find some clues related to them in the bot binaries. The fact that the management nodes\nuse the same AgentVersion, which is set based on the path of the main package, supports this assumption.\n\nThe package tree contains some additional packages from which no code (besides some initialization functions) is\nused by the bots:\n```\nstorm/commander/web_app/router\nstorm/proxy/checker\nstorm/util/storm_runtime\n\n```\nThese are perhaps the packages corresponding to a web interface for managing the victims and an automated checker\nfor the availability of the proxies.\n\nThe special roles assigned to nodes from the management infrastructure - that we know of - are:\n\n- proxy backend; the bot’s proxy module pings these nodes to prove its availability\n\n- proxy checker; a node that connects to a bot proxy\n\n- reque manager; a node that issues scanning and brute-forcing commands (see the reque module)\n\n- web API backend; a node that hosts a web API (used in newer versions)\n\n- trusted node; a node whose public keys is included in a trust list (can sign authorized messages)\n\n- development node; used by the threat actors for development purposes\n\nThe following nodes have been observed:\n\n- ID: QmW1ptn27xSAgZqBvJwhaGWmJunjzqAGt1oAj4LdVAm9vM\nRoles: trusted, web API backend\nAddresses: /ip4/212.x.x.100/tcp/444, /ip4/212.x.x.100/tcp/5554, /ip4/88.x.x.34/tcp/444\n\n- ID: QmddMf2PfNXu6KVKp63rcLhWpNqQdaQdPZzP649dRXS6et\nRoles: unknown\nAddresses: /ip4/212.x.x.100/tcp/443\n\n- ID: Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2\nRoles: trusted, web API backend, reque manager, proxy backend, proxy checker\nAddresses: /ip4/54.x.x.216/tcp/444, /ip4/54.x.x.216/tcp/5554, /ip4/101.x.x.240/tcp/443, /ip4/101.x.x.222/\ntcp/443, /ip4/111.x.x.85/tcp/443\n\n- ID: QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV\nRoles: proxy backend, reque manager\nAddresses: /ip4/54.x.x.216/tcp/443, /ip4/54.x.x.216/tcp/5555\n\n- ID: QmShLAfGGVDD32Gsx5Q2YbuhdDm1uHAmV8aozV6uRKAZdW\nRoles: trusted\nAddresses: unknown\n\n- ID: QmNWL3UTHbfCxhKA8Lu9aL2XpPGGYQmN4dihXsaCapiyNx\nRoles: trusted\nAddresses: unknown\n\n- ID: QmV7UYLoDmUv3XViiN1GqrsC6t8WLPGmCKTMAJ544x2pbA\nRoles: proxy backend\nAdd /i 4/45 194/ /443\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n- ID: QmdACwNe1JdkD2N45LRbcFthPpEVQVtfBvuHFHQ4cFMcAz\nRoles: development\nAddresses: unknown (External IP: 163.172.x.x)\n\n- ID: QmNoV8qAgLTEo1nQN8wmusi9U9kmArUjVNsKY4TdYS1wvT\nRoles: development\nAddresses: unknown\n\nSome of these nodes have changed their addresses and roles over time. The listed information is sourced from\npublicly available peer information, collected over recent months. We have only included multiaddresses which contain\nan external IP and port. For some nodes, our data only contains relay circuit addresses and their address is therefore\nlisted as unknown.\n\nAn interesting side-development is that a group of seven nodes appeared on 17 September 2020, announcing\nthemselves as providers for the web API CID:\n```\nQmNeV49LPkgQENkpSmg6q8nB1jypY74jhtWxP9rANUQubd\nQmRG9bwpWumxkNwGbceiMXmikAeNDw48kiTRaJSt8rSmzp\nQmXPUhUy4e2jg6dqjfsTnseC5m5KHgZvqMr6AwVutdcQGL\nQmYmDUkGJJ5K2BQ6JYuJeN2SJB3wfDg2N78th6tMEmHgSF\nQmbNwkGiHrK9XcP6n2vMZh9sZMoicvcrhaTbtXMzoC8rp1\nQmbcbZb8Jq8u44oCqna5h2ZBjSpRT42dNLDDNCyuSfGu3L\nQmek3KNuJY3eRbSGZ9zm2M8yYLb7bMeA28gMswQXarhbmW\n\n```\nThey are not reachable and therefore their origin and purpose cannot be ascertained. One theory is that they may\n[belong to an attempt to take down the botnet with a Sybil attack: the bots fruitlessly try to reach the false web](https://en.wikipedia.org/wiki/Sybil_attack)\nAPI nodes and the functionality that depends upon the module is impeded. Otherwise they may belong to fellow\nresearchers, in which case, Hello!\n\n## Attribution\n\nWhile some management nodes were a later addition to the botnet’s infrastructure, the nodes hosted on two particular\nIPs have played central roles since we started this investigation.\n\nAs a starting point, we searched for the nodes holding the trusted keys hardcoded in\nthe binary. We found Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2 and\n```\nQmW1ptn27xSAgZqBvJwhaGWmJunjzqAGt1oAj4LdVAm9vM, which had at that time the following peer infos:\n{\n ‘Addresses’: [‘/ip4/54.x.x.216/tcp/444’],\n ‘AgentVersion’: ‘storm’,\n ‘ID’: ‘Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2’,\n ‘ProtocolVersion’: ‘ipfs/0.1.0’,\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n```\n ‘PublicKey’: ‘CAASpgIwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCzR75b/L1QhliHV/yFZF\nLNQ6MC5JsbU3pvwBQN7yP82+vKNV6gu0bUozOUIVc2O/EZLbMyiS+cKrEWNue72/2FGnM84DfTWBYh\nUiYrhJVupHXGGEfBFBfy1LtswXoEaW584up1CQwdKlbKKw4Fqt2NUCEHlX8IWRZS4F34N53xqFBb1RNwgmfa\nxdagttsP+20jCI10sLkCk6OnMAasyQCkOB+xvH6t4nakztipe/xgpU6kv5CittTfKFnRq952TS0G6a4m7OruX\nTVIJEqiDV/E+avFI2JdJoe7NzKwrtbrfx01nSNCvDSqRNxd4S1HfGu6rpse+3YbmLoMwEDVPVvjAgMBAAE=’\n}\n{\n ‘Addresses’: [‘/ip4/10.12.128.139/tcp/444’, ‘/ip4/212.x.x.100/tcp/444’],\n ‘AgentVersion’: ‘storm’,\n ‘ID’: ‘QmW1ptn27xSAgZqBvJwhaGWmJunjzqAGt1oAj4LdVAm9vM’,\n ‘ProtocolVersion’: ‘ipfs/0.1.0’,\n ‘PublicKey’: ‘CAASpgIwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCw4JxaWchBO9fGmyjNI\nOwA/LlG3P6zz3QrsJmbwJV0o3GDYjyLG7RzTeqi1NySvwpUW7mE7IP/XIGrDgbXodNGr+/o5bcHXosJwCccS\nEJvxcqL9+ePBO4uwcOIUhxDtWiOjEdPwQ5jTua4S2oeJgNwsPIn3SEz2A5UqdstFB6SJBqth8OT4MGqkXKoWE\nuBtA6Qc5pUYnhgUSznQH77rqbygiudM9d9BFg6jlvMoUrBqXj83tC3lOZK45AzY2cEH3Lz2UzCgO36DUmUH\nBB7qR01Up6v9QNGW9pBQkDolFxrJputv+zavthxcrkyhCbdHvrlBC0kw+1uSRaPD4A/FE/zAgMBAAE=’\n}\n\n```\nStarting from their public IPs, 54.x.x.216 and 212.x.x.100, we have located two other nodes hosted\non each of these IPs on port 443 (QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV and\n```\nQmddMf2PfNXu6KVKp63rcLhWpNqQdaQdPZzP649dRXS6et). The IPs and port hosting each node has varied as\n\n```\ndepicted in the following table, but their association with the botnet (and management nodes in particular) has been\nconstant.\n\n\n**IP** **Port** **ID** **Last seen**\n\n\n54.x.x.216 444 Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2 7th September 2020\n\n54.x.x.216 443 Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2 29th September 2020\n\n54.x.x.216 443 QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV 5th September 2020\n\n212.x.x.100 443 QmddMf2PfNXu6KVKp63rcLhWpNqQdaQdPZzP649dRXS6et 6th September 2020\n\n212.x.x.100 443 QmViHGaXaG5JzbvH2Xs1Ro19fvoKG1KqpPGMYWLc4ckEAV 5th September 2020\n\n212.x.x.100 443 QmW1ptn27xSAgZqBvJwhaGWmJunjzqAGt1oAj4LdVAm9vM 29th September 2020\n\n212.x.x.100 444 QmW1ptn27xSAgZqBvJwhaGWmJunjzqAGt1oAj4LdVAm9vM 6th September 2020\n\n\n212.x.x.100 444 Qmeb3X55MaoKhZfYsUHFgkZWAz3ZFtQCQz6qiaEqamo7a2 7th September 2020\n\nWe assert that these two IPs are unquestionably in the ownership of the bot herders. The fact that the management\nnodes -with the exception of the “development” nodes- have never posted on the info topic proves that they do not run\nthe same bot as the victims. Two of the nodes hosted here possess “trusted” keys and have played privileged roles in\nthe p2p botnet (issued scanning commands, managed proxies or hosted the web API). Another argument is that the\nnodes hosted on these two IPs have been operational for several months, while regular bots change their IDs when\nthey update.\n\nFurthermore, 54.x.x.216 is the source IP of the attacks over ADB seen in our honeypots.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nDNS records from RiskIQ show that these IPs have been linked with two subdomains of a domain that we will refer as\n“the domain”.\n\nDNS A record of the first sub-domain links with IP 212.x.x.100 (seen from 2019-07-24\n```\n14:25:41 to 2020-09-09 10:51:24)\nDNS A record of the second sub-domain links with IP 54.x.x.216 (seen from 2020-05-04\n23:09:57 to 2020-09-09 05:40:33)\n\n```\nWhois records confirm that the ownership of these IPs has remained constant in this period.\n\nThe domain is a paid SOCKS5 proxy service. They advertise over 7,000 proxies from all over the world and claim to be\n“highly anonymous.” An interesting thing mentioned in their FAQ is that:\n\n**“Every hour we have about 3-10% of new IPs.”**\n\nThe website of the proxy service seems to be offering four standard pricing packages on a monthly subscription that\nranges from $74 to $259, depending on the number of concurrent TCP connections – from 150 for the lowest tier\noffering to 3,000 for the highest tier. However, pricing seems flexible, as the website also offers tier plans that are either\ngeolocation-specific, such as proxies from Europe or North America, world mixed, or even for developers.\n\nThe pricing diagram covers anything from hourly tariffs that start from $2 and peak at $14, to daily, weekly or monthly.\nThe highest monthly tier pricing involves a monthly Premium package for $499 and offers mixed proxies from all over\nthe world, including Europe, CIS, and Noth America, and seems to involve access to the entire live victim infrastructure.\n\nWe claim that whoever is behind the domain is also behind IPStorm and uses the infected devices to back their proxy\nservice for financial gain. And the evidence goes further.\n\n**More information about these particular IPs and domains can** **be freely provided to law enforcement agencies by**\n**[reaching out to draco@bitdefender.com.](mailto:draco@bitdefender.com)**\n\n### The Developer\n\nWe have noticed some artifacts in binaries from versions versions 0.0.* and 0.1.* respectively:\n```\n/Users/[redacted]/go/src/storm\n/Users/dummy/Documents/GoLandProjects/storm\n\n```\nThese are the paths of the IPStorm Go project that was stored on the machines where the malware was developed\nand compiled. While the username “dummy” is common, the other username (which has been redacted) is distinctive\nenough to investigate further. It is plausible that the developer took note of the fact that their username was mentioned\nin the Anomali article and sought to be more “anonymous”.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nSimilar paths are present in the binary loaders used for infection over ADB:\n```\n/Users/dummy/Documents/CppProjects/loader\n\n```\nWe found several related entries on the info topic. For example:\n```\n{\n  “T” : 1597849326,\n  “HostID” : “QmdACwNe1JdkD2N45LRbcFthPpEVQVtfBvuHFHQ4cFMcAz”,\n  “Version” : “0.1.90a”,\n  “Platform” : “darwin-amd64”,\n  “SystemInfo” : {\n    “GoOS” : “darwin”,\n    “Kernel” : “Darwin”,\n    “Core” : “19.5.0”,\n    “Platform” : “x86_64”,\n    “OS” : “Darwin”,\n    “Hostname” : “MacBook-Pro-16.local”,\n    “CPUs” : 16\n  },\n  “Uid” : “501”,\n  “Gid” : “20”,\n  “UserName” : “dummy”,\n  “UserDisplayName” : [redacted],\n  “UserHomeDir” : “/Users/dummy”,\n  “IsAdmin” : false,\n  “ExecutablePath” : “/Users/dummy/Documents/GoLandProjects/storm/storm”,\n  “InstallationPath” : “/Users/dummy/Documents/GoLandProjects/storm/storm”,\n  “ComputerID” : “”,\n  “LocalIPs” : null,\n  “ExternalIP” : “163.172.x.x”,\n  “Processes” : null\n}\n\n```\nThese matched what we knew so far about the development environment: the path of the main project and the\nusername [redacted]. The presence of these entries on the info topic, while the management nodes lack the feature,\nindicates that these nodes are used for development and testing. Although we have not managed to link the IP\n```\n163.172.x.x to any subdomain, we noticed that it is from the same hosting provider as other IPs linked with them\n\n```\nand may be part of their cloud infrastructure. The interesting association is that it is in the same ASN (AS12876) as the\nIP of the subdomain that hosts a Gitlab instance (163.172.x.y).\n\nThe projects on this Gitlab are hidden, but other information is publicly available. The screen capture, taken in August\n2020, shows the existence of a group which contains the same username.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\nGroups on the Gitlab instance:\n\nUsername has been redacted\n\nThe user’s profile on Gitlab:\n\nUsername has been redacted\n\nAll this evidence indicates that the threat actors behind the Interplanetary Storm malware are the same people behind\nthe SOCKS5 proxy-as-a-service infrastructure that’s rented in exchange for virtual currency.\n\n**More information about this threat actor can be freely provided to law enforcement agencies by reaching out to**\n[draco@bitdefender.com.](mailto: draco@bitdefender.com)\n\n## Conclusions\n\nIt is because of this thorough investigation that we believe the Interplanetary Storm botnet not only has the capabilities\nto act as an anonymization proxy-for-hire infrastructure, but the malware has a highly active development cycle. The\nmain purpose of the botnet seems to be financial, as the code went through a considerable number of revisions to\ncreate a reliable and stable proxy infrastructure.\n\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n## Indicators of Compromise (IoCs)\n\n**Bot samples (version 0.2.05a):**\n```\n71e7bb56899c7860729119734053409b6e8502f9 “/storm_linux-amd64”\nf7b008c30f5555f892211aeaa054d00ba8c093b7 “/storm_linux-386”\ndc917a8aa6e8061623163967629db945099062a9 “/storm_linux-arm64”\nc442c0a74ec5eddd713e80ea1cb07c8863a4816b “/storm_linux-arm7”\n98c80465c1caf0b59462013875a99b23a43ce73f “/storm_darwin-amd64”\nea665844b69815d6543cf4c8e6351d0129d7c669 “/storm_android-arm7”\n7ae71c05a3dea0165b88ed1a8caa8666b74c03e3 “/storm_android-arm64”\nf74c6e810450a31184503e211484f944dda005b3 “/storm_android-amd64”\n90d0ecb2489b4d958d1480e9e7d527f0c659c004 “/storm_android-386”\n\n```\n**Downloaders and persistence:**\n```\n9cc0273d83f0c950c5adfb5e374a55d7503679a5\naee0848450b28bbe1f24ee0287e83c3329955a40\ndb2d7d829e305feea947073973335a914117ec2a\n0546c9b436a87e029480687d6df7b63a19fa87de\n\n```\n**File names:**\n```\nstorm.key\n\n```\n**Bot samples (older versions):**\n\n```\n7ae71c05a3dea0165b88ed1a8caa8666b74c03e3\nb61b77c87ed5b0b3d95c975daf5e4ec85632a638\n0db8496f0c8a8664c5ab645600a4e11da788ffa3\nf0f995fb273d6a7e3fd15aa3797a63790cbfe460\ne7d41e75a7faca4669860dd5d38fddda2e4f8c1d\nff872f75d00008444282c18ec91fde0b63196dc4\n05be2d82e8a98da991699f88bda9d1160525c957\n7afac23e95b4f83769f7ff7df462988d997b964a\nb47c25a3e34efb40023eeeaddcefa2ead2a71ba8\nd6674f5563f07a4ef2db7e37967cffe78b98e85e\n3ccdbd4044623f9639277baa9f3dbec42c66fcf0\nd331447e55a99692b196147750132770daf28e5b\na79933eb5fd08745c2742dff4b852d57d4b681e4\nc9a570eef414a2511955d704643455ddbfe5d930\nd39a2f63dc953c0c1c67cd7a9bec3c5aab9d3628\nfcbc3eb70cc8b1bd19b7d990ba360f1ea2a359c3\n007dd1362ca43d06b0ca633aa6099493063df7ca\n3be8947a898d0539666c98c00b53ebe84c006fcf\n\n```\n```\n086ce30530db7a1b72b9b0b270cd4a1dcc2fa9e6\ndcdd9b4f3fb5a713e5e6ac81f5eb0f1f283ee7ea\n7fdec673db4fdf3391995cc6adc3895794f8ff02\n92b02a4987b360a50f96f86ef3b78a8df2a4d1a8\n9d51af0e3602702d5096d108aea2fff620031cd2\n88aa38f5c03ffdf7f6c3770f6349fbbc86bd9ab4\n161dd2e5634e9f5f85632500ea701886ce49a155\n2d522ba28f929922fc80d6e4a3a16c2f1273effe\nd32cf21edad6c196ebded79081a8316e84411ad2\n1ac42f0bdf5e338c3586be914d9268239e427d14\nbe3cc9c380cc1aecd562602c7c41183f5865085f\n6ec780aecad007d739b0ef90f30e228166a83173\n6f9f5d06ea1a34b8022c8314fc38b67e2effae80\n4bcff0d3bd6997be6896aedd81211e161c89fad3\n9e63567f7e670ea358af584eea6bbc9a68513c9d\nb9d2816405979fc528a4eae71b8955242ef251af\n5a0f8d0607e20aea0157a5572039ff255c0ae88b\n5d1aa62b6c67b5678a3697153afbcdf45932f4af\n\n```\n\n-----\n\n```\n6278fa0cf6c5c1f98f242702ea95ce38a40b79cf\nd282272b1eec3aab3956e690e56582792109e822\n1c62dfc839e694fd6517dfd736ee8d312ca0ff21\n98b540cfb43f1cbfc9ab558bbf55ca8806942d87\n2a1e03b568b4e86f36083adf249966aaca610550\n3dc474b7f4779e4dce565d7c863e0a01fd17a059\n0296faedf44c3c376794b09fa59ead1512712a68\n70a010d97e9d4cc64aff0daeefcd2ca44d22b7f4\ne266f3ca2ad74a3398d3c0996da1c11c631554cb\nbaf322bc7a837cd37b0cd132221b8ef2cbfda4f3\nbfd425f2af8ab662cc28ad53ca0bd5f0e44f0600\ncae869da63ceb8997e140f14fa2ffccec55ac8a6\ndbbe855f86059b19bb91b8c78dd2770c9565b733\n9454754c054fa94715121062a553d9aac3331065\n56534152c27b991b2bf54635027d11cd8287d227\na8415ff9d6b50c8f64034bc433e052a791f61e09\nbfd374c09e13fa6623de0b1e00e13b6a1994a7fb\n3b4fdb372b5a038b6a3ba71bb123bd651c9b6ea4\nb0ce3a6bdc4289302dd2cf781844b5e01c37ddc8\nbea2e3a72556c7bf1015f78a77650b03a0953430\n7eeff5f162b3280194d630d8dd60aad8ef4d151c\na1bfd79b3ee83a94af1933183b10b849bc047a62\nda729079f51ce6082a9e9b370cb651fa6c565e77\nd09935c31dd62dfc33e9685719f61b1ed24ecfbc\nb45760a4c03f64ee16de794f8ddd601fb3afafcc\n0ca0bbafdc2d23a77d3f33aa808bd0a6a4abc551\n5f725fcbd9246f15d51dc777d59734654142bcde\nfc6a9e873c5f8fd3f2d56eb46143aa92facb987b\nbe5ba8c384080f251bf204cc4257b98abca5beb7\n0b2319d0ee4e231228012df7be2d2a0b4fd23383\neea645610fd4b3d95c543ea69eed84d87a0faafc\n98270eb99d3f5d4c49ab447ecffa64da82c38d1a\n5a63cdbfd9feed62c7cecc6f075bd01fd4a134b2\nb280647aa1d942559d81ba56be33dc3853fcdffc\n533711e615d90b012784938433108f7cf962cef7\na427ca3e1dfd683fb4a56eb9958cf893fa9e7512\nd5c27609dc21cafc1b44b4692f84aa27c9e2aff6\n1fc3ded2cbf7e181f1dec0d75ee077d54274c4ff\ne11dea2894fb28a10db837b021c20eff9c6d7539\n51dbbcc4e6f9c3815dc2758decb0750b6db51558\n02d6ac68de883c7fdc25b471ba84859ef826571c\n1b275bfe61d0b4ddf7c1366e168d5065a82f9a76\n\n```\n\nLooking Into the Eye of the Interplanetary Storm\n```\n8e646769b515c011a0a746ee61f11e68f1f0445c\ndc37278e3122ef7e721445d94b50024c847f0183\nd2976d17c69000b1a81b38550e96a209e1c3a917\n34c6d6646f0e80e31764c523695f00c872dac3ea\nd737d7eb1aed496bfd76b552114d27921c92f1dd\n45ab3734abfca90006278995270b996a2be9ef5e\nfdddfae458e513ab5457340451293fc55c932fdc\n274b913133345ec718591efd83526b3d7d265f6d\n46672c46a535d788de8016a93f40a8ecaa1b98cb\n2662e117dd69e9614f171fa2f17a214875638585\n2154a52282b357ccd82837130dc4196bb40b3a23\n1445aa3ca578aff92b2939ddd2df4b99b9348687\n95debaaf3488667a2c89def803b3cfd6fb79a66d\n9ab0a141a3f5ecba411ec4e32b2305834c4615ee\n3e7b844c1a765a4e81fe22e1fabbaa96174181ca\n7fd7ce92968eb86a6bfa6bfbeacf1815ac1159e9\n4d871c0ef41349a63b435779871d4bf14fa513c5\n199e506e646ae49f4cb723b1d9d39d555008124b\n119c4a83b4263364e924967c2704c63ef420dc3e\nf3a9bd2d22414628bdd9279c62f424e6f2b2dc73\n3db7f1d52970791bb52baa8563447590b811e1e2\n4a171325f32e659db92e894df7dc8e53c097158f\n61da7e22c378da8339bee44514a77419e3f0b7e0\nf0b5db87fe8af473a51d83a3f355224525ec00b8\na1b20819fc93ab2d15762a283f5a27d0758c4ec6\n90f700f8e31d92d44dca00ca7114e4344df168fc\n2d7d1f4f5deb93d03a02dc3ee3ccec7f8932b40a\n581dfb3449bc31ffa87252a51c72447bc6db427e\n537f9b03bb1b4d7c2ef940fbaab5bf4bf0403668\nb35d2338697864d0d0b5127111ef90ef71362398\nda0ada6c49cb4e4bf556e8d5f16cb836de171c5b\n38281afadd91013b3ace2ebe796555f41f843915\nbae9b4770a4b146a1216ad6147b3f3fed1e1de11\n737b3613910c7db0b4a3e245f459163cfe89ba9a\n71779adf9e82d9eb3ef5933f9ad1bdcc35ffa299\n2d610af2b55cf5392575027bdd0b012dcba18449\ne642a07e26492026a26470c5322e6ce75548dbc7\na132a710972f3cb4a501eaedc952d2453225ab92\nfc3d9518b01e9e6f98c9d7f2d281c76601b3c981\ne1bc68243abf498e68db74f5a5dd9ac73da1da41\nf0cbbddcc89471c024af63f6a8d9117c4f864312\nb5251072d5bc267801c31c62a1bf6176a1bde738\nb ff 4 73d 782d961734d11 0 db3046b5101\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n```\n09fa327389241b6174a4f77d445df98d791d7d97\nb11b3eeb75a5352f2e99a87e11a113fc284e2ea9\n92b77fb0c1292f2a23189cb43ef885d2d59bc51d\nd7d4b21f5fb15a2ff2e17319611f5d99455841d2\n2d5eab261879563742a7f748081649de57139bbb\nfb68a62e671504f8b075a1c0015a89ef11ef02c1\n8e6db1b0cc5fc00099e8f53769bb5504d46d09b3\n3bc08cee63773c7fd14488c0e2d8861580c182a9\n973d73363aafec06846c96e43b278bfc5dffab3b\n4f4ba789965da2915ffbd3431c2c92e1e1a39127\n4e224f4ec06c9aef7cb2aa2650a9bb2c90b1a1d3\n0fb75afbda64d0f924b2da65eeb13a11162f9694\nc001d30c0d8c58925a37fdcbe0166425d7989939\n4af5c4031dc8b0d1809e9b5ed0d81fe20eaeaf4c\n26de1e314e6090f35f2fc167b5eb35be82078a99\n3c667347c4a4bf3e568356ff3236727ab1205e1b\n4bb4494d2a58e15a5a537f55840136e85ac985fc\na5add423db3629cae38a246b06ea5889f1a78da2\nea144f019eda5a1d83b9d247ddd80747e69c2702\na3551e1f4b53d4f97080f7f442954a253cc57a53\n29f9bab64c3667f2fc87f2b7554168157b7d7260\n9492bfa56f21829ba929b4b8fea3ac74831ed4be\n5a5cc088238c91b03e65d3d39383adbb4cf65b8c\nf070e4efc5ca80d956d2cab6298940a795b5a621\n8375020321b46d02774c02b8e19c8ef46de60d4c\n10eab9950e39b85b201c4d4bf5ccda5c82c99df1\neeb8fb7f2c7b5ca510c791d883a791ed431646c3\n9d2dfa28ff352705cb525281ce18585bbf48a207\nda594340da5de25b11187565c4aed6266150466c\nc9ba9b7f8dbd90dc08e14539dee59817500108d9\n8399d8e11f5af9bfa3965ffc0d1dabb0b27eefd6\n564564027b395ab155a9d0e5c4d9728fc95c68b5\n4ae5083464b3baf0214cd27a7c147edeb830f36a\n96dafffc9fab010c5bcd7f6f375799a6b53fbade\nb361aa83de65bff5f55de1e0f564662d3a53a11b\n93411047fbc6404ff4e9e469f72be8c4fcbcd8b5\na5e177cecd2afd4b055bb0fcf8527dca0fb160da\nf550f3901a2a3c0345f288164596a94e6a5c5cfd\nf3a680de2e4226995cbadba109be04bb495a2b73\n8b12011f3ba8bd36315b9980e50481ce724c7c90\nf353c88ea2eaac2157db38351fe25dcd30fc1607\n5bf446b78c71e609ad9350e0925ec1d36a51b128\n\n```\n```\nae55e5701e5560028c525d4c57211a0b824cdba5\n598593c6c88006e4d7379f5cb5a805ababbe9f48\n92846e00539fe9654e54cc0ca28ac7b96dc3a2f5\n622ec1444499a3f76cb1baf26cae53cc6b0c5657\nd0ec9e9404f9dc59bb136c5311cf94bc51b52700\nc17faff79b8e6f80afb114969af2ffbe50b88e07\n83e019501ee62cdaae04bab82f60e0945612233a\ncddfdc1ef0bceb5b9d9bcb34308f58293e32312e\n4ef95e9e8d5dab734eeeea238e7800ca82e3e59d\n35c03de7a669391f68f4c42f323bb42c82cf815e\n2c16ca05dabae9422bbf89a21d07517527610293\nf90ae87f035346ecff239915f3623966553200b4\neb971068c496d8cc29400e718be156df7df965fc\na0aeb67dec68d7eb310f93b5ff9cab1d7fb39d0d\ndf95ff6b2f359ed1860299fa9301e6c4fe32a06e\n52d70a9b81236b7eb5d4380452366a1d2de9a891\n0e9e5c3e292228959a7253f2ff52b82417e3ff0f\n15f73933637f7c2d67163b980261b88f93ad42cf\n008f3585aa8e3719a8ed7273f4ba5648f4c4f31d\n4312f491e117d1fb5ae0945fedaca3e56ce65cde\n663965a84ede49e1970d7845b7bf5bceae5dbac2\n2e425ed8b5c8322670fe385dcb1680694bee0409\n91b98df50e7d646a137208f6883af942b88b7ce2\n2da48a7180f939c357ef26f180bebdddb28c11c0\nbfa3f622796397c03bf7583d9bfc684cf73231e8\nfc727dd4035f8a19a73843ec9522bc8cd57d7888\ncc94e961753baffbae344c20c42bf04168db3b6e\n17980530ec77921ff2492df0d6057375feff7751\nfa0ddb6cb2172ed86ff145a87ab44e1c06c4555d\n322812970a13dfa07fb9779804c604a705a22f69\n78f92b825337b9660d6067b3fc4fd31454eb39f2\ne7915be0a297c14a72c7e30ff0cd231311a5967f\n39a275a7e4707223b3702dbe4402b2fc0ebd6692\n66867d86b08a07b8395c5715093dfbdb015b1b01\n79682ed288592a8ff15aa5f9daede791296dec95\n304fbc3c16db599cedec6bbbb083daa6adc9b91d\n36a47234b5be77efb887029967b344758a7647a9\n\n```\n\n-----\n\nLooking Into the Eye of the Interplanetary Storm\n\n\n-----\n\n**UNDISPUTED INNOVATION LEADER.** **WORLD’S FIRST END-TO-END BREACH AVOIDANCE**\n38% of all cybersecurity vendors worldwide integrated The first security solution to unify hardening, prevention,\nat least one Bitdefender technology. Present in 150 detection and response across endpoint, network and\ncountries. cloud.\n\n**#1 RANKED SECURITY. AWARDED ACROSS THE BOARD.**\n\n##### UNDER THE SIGN OF THE WOLF\n\n**Founded 2001, Romania** A trade of brilliance, data security is an industry where only the clearest view, sharpest mind and deepest insight can\n**Number of employees 1800+** win — a game with zero margin of error. Our job is to win every single time, one thousand times out of one thousand,\n\nand one million times out of one million.\n\n**Headquarters**\nEnterprise HQ – Santa Clara, CA, United States And we do. We outsmart the industry not only by having the clearest view, the sharpest mind and the deepest insight,\nTechnology HQ – Bucharest, Romania but by staying one step ahead of everybody else, be they black hats or fellow security experts. The brilliance of our\n\ncollective mind is like a luminous Dragon-Wolf on your side, powered by engineered intuition, created to guard against\n\n**WORLDWIDE OFFICES** all dangers hidden in the arcane intricacies of the digital realm.\n**USA & Canada: Ft. Lauderdale, FL | Santa Clara, CA | San Antonio, TX |**\nToronto, CA This brilliance is our superpower and we put it at the core of all our game-changing products and solutions.\n**Europe: Copenhagen, DENMARK | Paris, FRANCE | München, GERMANY**\n| Milan, ITALY | Bucharest, Iasi, Cluj, Timisoara, ROMANIA | Barcelona,\nSPAIN | Dubai, UAE | London, UK | Hague, NETHERLANDS\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.bitdefender.com/files/News/CaseStudies/study/376/Bitdefender-Whitepaper-IPStorm.pdf"
    ],
    "report_names": [
        "Bitdefender-Whitepaper-IPStorm.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1602767338,
    "ts_modification_date": 1602767342,
    "files": {
        "pdf": "https://archive.orkl.eu/5d55be36c0b595e3334fbe7bba5de4d62e3456d6.pdf",
        "text": "https://archive.orkl.eu/5d55be36c0b595e3334fbe7bba5de4d62e3456d6.txt",
        "img": "https://archive.orkl.eu/5d55be36c0b595e3334fbe7bba5de4d62e3456d6.jpg"
    }
}