{
    "id": "72e252d2-ce9c-45c4-b7ae-515384a71dde",
    "created_at": "2022-10-25T16:48:22.458438Z",
    "updated_at": "2025-03-27T02:05:41.724863Z",
    "deleted_at": null,
    "sha1_hash": "a7f5de87d424731b59fd86a48da158f9e3013f0d",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-04-03T12:59:41Z",
    "file_modification_date": "2017-04-03T12:59:41Z",
    "file_size": 2275777,
    "plain_text": "# Pegasus for Android\n\n## Technical Analysis and Findings of Chrysaor\n\n#### April 2017\n\n\n-----\n\n## CONTENTS\n\n**CONTENTS** **1**\n\n**Executive Summary** **2**\n\n**Background** **3**\n\nThreat Hunting and Joint Investigation 4\n\n**Pegasus for Android Overview** **6**\n\nAndroid vs. iOS Pegasus Sample Comparison 6\nTable 1: Comparison of Pegasus for iOS vs. Pegasus for Android 6\nFeature comparison of Android vs. iOS Pegasus 7\n\n**Pegasus for Android Detailed Analysis** **8**\n\nSample 1 - Package Information 8\n\nSample 2 - Package Information 8\nInitial Launch and Configuration 9\nCommunication Methods 11\nHTTP Communication 11\nRequest Format 11\nResponse Format 13\nSMS/MMS/WAP 15\nInbound SMS 15\nOutbound SMS 17\nWAP Push Messages 18\nMessage Queue Telemetry Transport (MQTT) 18\nPhone Calls 19\n\n**Data Gathering and Surveillance Functionality** **20**\n\nTargeted Applications 20\nLive Audio Surveillance 22\nScreenshot and Camera Capability 22\nKeylogging 24\n\n**Persistence, Evasion, and Suicide Functionality** **26**\n\nSuicide Functionality 26\nMCC Subscriber ID Suicide 26\nExistence of Antidote File 26\nMaximum Check In Time Exceeded 27\nDevice Updates Disabled for Persistence 27\nNative Components 28\nUpgrade Process 28\n\n**Second Pegasus Sample** **29**\n\n**Conclusion** **31**\n\n**Acknowledgements** **32**\n\n**Appendix** **33**\n\n1\n\n\n-----\n\n## Executive Summary\n\nFor the past several months, the Lookout Security Intelligence team has been closely tracking\nthe features and tradecraft of targeted nation-state level malware attacks against mobile users.\nIn the initial investigation into the software developed by lawful intercept vendor NSO Group, we\nexamined the common features and methodologies that are frequently used to perform\nespionage using the mobile platform.\n\nBuilding on our initial technical analysis of NSO’s Pegasus software after the August 2016\ndiscovery of [Pegasus, the security intelligence teams at Google and Lookout collaborated to](https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-technical-analysis.pdf)\n​ ​\ndiscover and track Pegasus as it exists on the Android platform (aka [Chrysaor) in order to roll](http://android-developers.googleblog.com/2017/04/an-investigation-of-chrysaor-malware-on.html)\n​ ​\nout protection for Android users. This investigation originated with the Lookout August report\nand led to all Android, users being protected against this threat.\n\nOn the Android platform, the Pegasus software has many of the same features that we\ndescribed in the original Lookout report. The samples that Google acquired, and we analyzed\nfor this report, existed as an Android application (APK) that compromised the device to install its\nmalicious payload. These samples are dated, but given the recent Pegasus activity on devices\nobserved by both Google and Lookout, the analysis represents important new insight into this\nspyware.\n\nPegasus for Android has similar capabilities to its iOS counterpart including:\n\n  - Exfiltrate targeted data from common apps including:\n\n    - WhatsApp\n\n    - Skype\n\n    - Facebook\n\n    - Viber\n\n    - Kakao\n\n    - Twitter\n\n    - Gmail\n\n    - Android’s Native Browser and Chrome\n\n    - Android’s Native Email\n\n  - Remote control of the device using SMS\n\n  - Surveillance of:\n\n    - Audio via the microphone\n\n    - Imagery via the camera (front and rear)\n\n  - Keylogging\n\n  - Screenshot capture\n\n  - Disabling of system updates\n\nPegasus for Android is an example of the common feature-set that we see from nation states\nand nation state-like groups. These groups produce advanced persistent threats (APT) for\nmobile with the specific goal of tracking a target not only in the physical world, but also the\nvirtual world. As nation states continue to expand their mobile capabilities, it is important to\nprovide detailed analysis of the capabilities that threat actors are deploying on the mobile\n\n2\n\n\n-----\n\np p y g y p g yp\nthreat globally.\n\n## Background\n\nIn August 2016, Lookout published a technical analysis of Pegasus for iOS, a sophisticated,\ntargeted lawful-intercept attack that was actively targeting a number of mobile users globally.\nWe published our findings in the [Technical Analysis of Pegasus Spyware report upon the](https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-technical-analysis.pdf)\n​ ​\nrelease of Apple’s iOS 9.3.5 patch. The patch closed the attack vector — Trident, an exploit of\nthree related zero-day vulnerabilities in iOS — which Pegasus used to exploit the target device.\nLookout protected its customers against Pegasus for iOS at that point.\n\nPegasus is highly advanced in its stealth, its use of exploits, its code obfuscation, and its\nencryption. It has a broad surveillanceware feature set that takes advantage of functionality\navailable on mobile, such as:\n\n  - Always-on communications over Wi-Fi, 3G, or 4G\n\n  - Phone\n\n  - Messaging and email apps such as WhatsApp, Facebook, and Viber\n\n  - Camera\n\n  - Contact list\n\n  - Keystroke logging.\n\nThe original report shed light on the presence of advanced “lawful intercept” technologies.\nLookout, along with [Citizen Lab, established that the Pegasus surveillanceware software](https://citizenlab.org/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/)\n​ ​\nproduct is developed by NSO Group. According to news reports, NSO Group sells weaponized\nsoftware that targets mobile phones to governments. News reports indicate that the Pegasus\nspyware is sold for use on high-value targets for multiple purposes, including sophisticated\nespionage on [iOS, Blackberry, and Android.](https://www.forbes.com/sites/thomasbrewster/2016/08/25/everything-we-know-about-nso-group-the-professional-spies-who-hacked-iphones-with-a-single-text/#355371b83997)\n​ ​\n\nOur research into Pegasus for Android began in late 2016, at which point we shared the initial\nfindings and began our collaboration with Google. Our team set out to discover and ultimately\nenable detection of the Android version of NSO’s Pegasus software.\n\n### Threat Hunting and Joint Investigation\n\nImmediately upon discovery of the iOS version of Pegasus, Lookout’s team of intelligence\nanalysts and data scientists began hunting down Pegasus for Android via a combination of\nautomated and manual analysis of the telemetry from the Lookout Security Cloud. Using\nanomalies identified from our large anonymized corpus of data, we were able to focus on a\nnumber of unique indicators of compromise (IOCs) that acted as signals to flag specific outliers\nwithin our sensor network. Combining several layers of signal intelligence, including detections\n​\nof Pegasus for iOS, allowed the team to identify these indicators for deeper analysis.\n\n3\n\n\n-----\n\ng, y\nfindings were anomalous. Our Security Intelligence analysts were able to pinpoint a suspect set\nof apps which did not exist anywhere else in the world, including in public app stores or on\npublic sources like VirusTotal. These apps contained metadata such as package names and\n​\nsigner information that only appeared in very limited cases which correlated with\nPegasus-specific IOCs. This type of big data set is invaluable for both preserving user privacy\nand engaging in threat hunting and threat intelligence.\n\nLookout shared the findings with the Google Android Security Team after the Pegasus for iOS\nstory broke. Over the next several months we jointly engaged in an investigation to track down\n\n4\n\n\n-----\n\np g\nand the best course of action to protect Android users.\n\nWhen Google and Lookout announced the discovery, Google named this family of spyware\n[Chrysaor. Lookout references the Chrysaor naming as part of the Pegasus for Android variant](http://android-developers.googleblog.com/2017/04/an-investigation-of-chrysaor-malware-on.html)\n​\nof the Pegasus family first discovered on iOS.\n\nThe samples included in this research vary from debug/test/proof-of-concept application code to\nthe more engineered, production-quality samples that affected target users in the real world.\n\n## Pegasus for Android Overview\n\nThe version of Pegasus for Android, known as Chrysaor, exists primarily as an app, of which\nthere are several variants. These variants carry with them different file hashes, signers, package\nnames, and content. The samples discussed here carry with them an APK that can be broken\nup into a Java component and native code component.\n\nThe Java layer — what most Android developers are familiar with when creating apps — is\nresponsible for controlling, installing, and orchestrating the surveillance functions of Pegasus.\nThe native code layer is responsible for a variety of tasks including the exploiting of the device,\ngaining elevated privileges (root access), and hooking the processes of other apps.\n\n### Android vs. iOS Pegasus Sample Comparison\n\nThe Android and iOS Pegasus samples share a lot of common functionality, including: process\nhooking, the ability to update and be controlled via SMS, audio surveillance, and self-destruct\nfunctionality to hide its tracks.\n\nThe table below highlights some of the similarities and differences between the two platforms\nbased on the samples our analysts have reviewed. From these samples, we determined\nPegasus uses known Android exploits to compromise an Android device. In this case it used a\nknown root technique called Framaroot, which uses exploits named after Lord of the Rings\n​\ncharacters. Other Android samples may use zero-days as was the case with Pegasus for iOS,\nbut for the samples described here, the exploits are already known to the security research\ncommunity.\n\nTable 1: Comparison of Pegasus for iOS vs. Pegasus for Android\n\n**iOS** **Android**\n\n**Process Hooking** Yes Yes\n\n**SMS Command and** Yes Yes\n**Control**\n\n**Zero-Day Exploits** Yes No (Not these samples)\n\n5\n\n|Col1|iOS|Android|\n|---|---|---|\n|Process Hooking|Yes|Yes|\n|SMS Command and Control|Yes|Yes|\n|Zero-Day Exploits|Yes|No (Not these samples)|\n\n\n-----\n\n|Messaging Protocol MQTT|Yes|Yes|\n|---|---|---|\n|Audio Surveillance|Yes|Yes|\n|Functionality without device compromise|No|Yes|\n|Method of Infection|Phishing|Unknown*|\n|Exfiltrates Personal Information|Yes|Yes|\n|Standalone App|No|Yes|\n|Suicide Functionality|Yes|Yes|\n|Targets Popular Apps and built-in Device Features|Yes|Yes|\n|Disables System Updates|Yes|Yes|\n|Screenshot Capture|No|Yes|\n|Code Obfuscation|Yes|Yes|\n\n\n\n- - It is suspected that infections occur via a phishing attack\n\n#### Feature comparison of Android vs. iOS Pegasus \n\nWe analyzed the samples, along with the data we found in our threat network for family and\nvariant distinctions across platforms, to reveal many similarities with Pegasus for iOS such as:\n\n  - Capturing and exfiltration of data from popular messaging apps\n\n  - Similarities in its ability to maintain stealth and persistence on device\n\n  - String references to Pegasus\n\n  - Use of MQTT for lightweight messaging on both platforms\n\n  - C2 commands are delivered by SMS, and they use “verification code” style messages:\n\n  - Similarities in Suicide functionality\n\n\n6\n\n\n-----\n\n## Pegasus for Android Detailed Analysis\n\nThis section contains an in-depth technical analysis around the primary pieces of two Pegasus\nfor Android samples. The majority of the findings listed here are based on analysis of the first\nsample. The second one, discussed in more detail towards the end of the paper, is much\nsmaller and contains limited functionality.\n\nThis investigation was conducted by the Lookout Security Intelligence team using a combination\nof static and dynamic analysis, including reproducing a Pegasus for Android C2 server to\nexercise functions of the application.\n\nNote that in some code samples the name “JigglyPuff1 ” is present. We believe this is the internal\n​\n\ncode name used by the developers for these variants of Pegasus for Android.\n\n##### Sample 1 - Package Information\n\n**Package Name** com.network.android\n\n**SHA-256** ade8bef0ac29fa363fc9afd958af0074478aef650adeb0318517b48bd996d5d5\n\n**Signer** Owner: CN=Android, OU=Android, O=Android, L=Unknown, ST=Unknown, C=UK\nIssuer: CN=Android, OU=Android, O=Android, L=Unknown, ST=Unknown, C=UK\nSerial number: 51234025\nValid from: Tue Feb 19 01:04:37 PST 2013 until: Sat Jul 07 02:04:37 PDT 2040\nCertificate fingerprints:\n\nMD5: F9:6F:15:4D:34:74:82:12:E3:CB:1E:6A:5B:5D:79:58\nSHA1: 44:F6:D1:CA:A2:57:79:9E:57:F0:EC:AF:4E:2E:21:61:78:F4:CB:3D\nSHA256:\nD9:52:90:6E:21:86:E0:05:47:80:25:1D:29:3D:3A:40:FC:34:B0:CA:9E:1A:1A:24:DE:BA:29:\n62:AE:17:A4:5B\n\nSignature algorithm name: SHA1withRSA\nVersion: 3\n\n##### Sample 2 - Package Information\n\n**Package Name** com.network.android\n\n**SHA-256** 3474625e63d0893fc8f83034e835472d95195254e1e4bdf99153b7c74eb44d86\n\n**Signer** Owner: CN=Android Debug, O=Android, C=US\nIssuer: CN=Android Debug, O=Android, C=US\nSerial number: 176eae91\nValid from: Sat Mar 01 11:34:57 PST 2014 until: Mon Feb 22 11:34:57 PST 2044\n\n1 JigglyPuff is the name of a prominent character from the Pokemon series of games\n\n7\n\n|Package Name|com.network.android|\n|---|---|\n|SHA-256|ade8bef0ac29fa363fc9afd958af0074478aef650adeb0318517b48bd996d5d5|\n|Signer|Owner: CN=Android, OU=Android, O=Android, L=Unknown, ST=Unknown, C=UK Issuer: CN=Android, OU=Android, O=Android, L=Unknown, ST=Unknown, C=UK Serial number: 51234025 Valid from: Tue Feb 19 01:04:37 PST 2013 until: Sat Jul 07 02:04:37 PDT 2040 Certificate fingerprints: MD5: F9:6F:15:4D:34:74:82:12:E3:CB:1E:6A:5B:5D:79:58 SHA1: 44:F6:D1:CA:A2:57:79:9E:57:F0:EC:AF:4E:2E:21:61:78:F4:CB:3D SHA256: D9:52:90:6E:21:86:E0:05:47:80:25:1D:29:3D:3A:40:FC:34:B0:CA:9E:1A:1A:24:DE:BA:29: 62:AE:17:A4:5B Signature algorithm name: SHA1withRSA Version: 3|\n\n|Package Name|com.network.android|\n|---|---|\n|SHA-256|3474625e63d0893fc8f83034e835472d95195254e1e4bdf99153b7c74eb44d86|\n|Signer|Owner: CN=Android Debug, O=Android, C=US Issuer: CN=Android Debug, O=Android, C=US Serial number: 176eae91 Valid from: Sat Mar 01 11:34:57 PST 2014 until: Mon Feb 22 11:34:57 PST 2044|\n\n\n-----\n\nCertificate fingerprints:\n\nMD5: 02:35:59:D1:6F:A9:6D:25:FC:C7:5E:D0:E6:A5:87:37\nSHA1: 51:6F:8F:51:6C:C0:FD:8D:B5:37:85:A4:8C:0A:86:55:4F:75:C3:BA\nSHA256:\nC0:D7:77:23:FA:46:05:AE:C7:61:54:05:45:B6:71:E5:7F:32:26:55:CF:B6:AC:3F:77:AE:50:4\n6:93:DB:FC:95\n\nSignature algorithm name: SHA256withRSA\nVersion: 3\n\n### Initial Launch and Configuration\n\nThe application remains dormant on the device until it is rebooted and a\nandroid.intent.action.BOOT_COMPLETED intent is broadcast (this is broadcast by all ​\ndevices after the device has booted and been unlocked by the user).\n\nOn first launch, the application must obtain an initial set of configuration options or it will\nimmediately remove itself from the device. This configuration is obtained by parsing query string\nparameter values from a URL in the browser history or by reading data from a local file present\non the device.\n\nBrowser history is accessed via the Android browser history and bookmarks content provider.\n\nIf a URL in the browser history is found containing the string “rU8IPXbn”​, configuration ​\ninformation is parsed from the query string parameters in the URL.\n\n**Parameter** **Description**\n\nt The token used to generate signatures for commands and identify the\nclient.\n\nc A Base64 encoded command and signature, in the same format as\ncommands sent via SMS.\n\nd Sets the userNetwork ​ ​configuration option which contains an ITU-T E.212\nmobile country code (MCC).\n\nb Sets the boolean installation​ configuration option. ​\n\n8\n\n|Parameter|Description|\n|---|---|\n|t|The token used to generate signatures for commands and identify the client.|\n|c|A Base64 encoded command and signature, in the same format as commands sent via SMS.|\n|d|Sets the ​userNetwork ​configuration option which contains an ITU-T E.212 mobile country code (MCC).|\n|b|Sets the boolean ​installation​ configuration option.|\n\n\n-----\n\nr Sets the boolean windowYuliyus​ configuration option.​\n\nAfter a configuration is loaded, an attempt is made by the malware to clean up its tracks by\nremoving the URL containing the configuration information from the browser history.\n\nAdditionally, the following files, if present on the device, can also be used to obtain the initial\nconfiguration:\n\n  - /data/myappinfo\n\n  - /system/ttg\n\nWhen using the file based configuration, each option that is passed as a query string parameter\nvalue is expected to be on a separate line in the configuration file. After a configuration file is\n​ ​\nread, it is removed from the system. Subsequent to first launch, this configuration data is\naccessed through the Android SharedPreferences APIs from a preference file named\n“NetworkPreferences”. ​\n\n9\n\n\n-----\n\n### Communication Methods\n\nSimilar to the iOS version of Pegasus, its Android equivalent is capable of communicating to\nattacker-controlled infrastructure via a number of different mechanisms and protocols. This\nincludes via SMS, over HTTP, and through the Message Queue Telemetry Transport (MQTT)\nprotocol. The following sections detail how the Android version of Pegasus utilizes each of these\nmechanisms and protocols.\n\n#### HTTP Communication\n\nThe application beacons out to a web server at a configurable time interval. The IP address and\nport of the server can be set through:\n\n1. A command included in the initial configuration.\n2. A command sent via SMS.\n3. A command sent in an HTTP response from an existing C2 server.\n\nThe scheme and path used in constructing the C2 URL are hard coded within the application.\n\nIf the server is not successfully contacted within a configurable period of time, the application\nwill uninstall itself.\n\n##### Request Format\n\nRequests from the application include two HTTP headers which contain keys used for\nencryption of the request and response:\n\n**Field** **Description**\n\nSessionId1 The token stored on the client.\n\nThe token value is used by the server to generate encrypted\nresponses and most likely to identify the client device.\n\nThis value is AES encrypted and Base64 encoded.\n\nSessionId2 A randomly generated byte array.\n\nThis is the AES key which is used to encrypt the files\nuploaded in the response body.\n\n10\n\n|Field|Description|\n|---|---|\n|SessionId1|The token stored on the client. The token value is used by the server to generate encrypted responses and most likely to identify the client device. This value is AES encrypted and Base64 encoded.|\n|SessionId2|A randomly generated byte array. This is the AES key which is used to encrypt the files uploaded in the response body.|\n\n\n-----\n\nThis value is AES encrypted and Base64 encoded.\n\nBoth fields are encrypted using a hardcoded key and initialization vector.\n\nEach request body contains fields encoded as multipart/form-data. These are gzip compressed\nand then AES encrypted using the SessionId2​ key. ​\n\nThe header field, when decrypted, contains an XML document with device information, a list of\ndata collection files which are included with the request, and the AES key to be used to decrypt\neach file.\n\n11\n\n\n-----\n\nThe data collection file format will vary depending on the data being transmitted but the files are\nXML documents which contain data exfiltrated from the device, in response to a command\nissued to the application.\n\n##### Response Format\n\nResponses are also AES encrypted XML documents. The encryption key is generated with the\nfollowing algorithm:\n\nMD5({0xB6, 0x27, 0xDB, 0x21, 0x5C, 0x7D, 0x35, 0xE4, token​ }) truncated to 16 bytes ​ **append ​**\nMD5({0xB6, 0x27, 0xDB, 0x21, 0x5C, 0x7D, 0x35, 0xE4, token​ }) truncated to 16 bytes ​\n\nThe minimal response the application expects to receive is an XML document containing a\nresponse element with message and code attributes.\n\n12\n\n\n-----\n\nXML response parsing is performed within the application by overriding the startElement(),\nendElement(), and characters() methods of the org.xml.sax.helpers.DefaultHandler class from\nthe SAX2 library and tracking the start/end of various elements.\n\nThis parsing method allows the client to accept more than one possible response structure so\nit’s not possible to determine with certainty how the server side portion of the application\nstructures all of its commands. It is only possible to determine which commands the application\nwill respond to.\n\nBelow is a listing of commands relevant to the application’s core functionality:\n\n**Command** **Purpose**\n\ndump Requests the client send back a configurable list of data which\nmay include:\n\n             - SMS messages\n\n             - Phone call logs\n\n             - Contacts stored on the SIM card and device\n\n             - WhatsApp messages\n\n             - Facebook messages\n\n             - Twitter messages\n\n             - Browser history\n\n             - List of installed and running applications on the device\n\n             - Kako messages\n\n13\n\n|Command|Purpose|\n|---|---|\n|dump|Requests the client send back a configurable list of data which may include: ● SMS messages ● Phone call logs ● Contacts stored on the SIM card and device ● WhatsApp messages ● Facebook messages ● Twitter messages ● Browser history ● List of installed and running applications on the device ● Kako messages|\n\n\n-----\n\n|Col1|● VIber messages ● Skype chat logs ● Calendar entries ● Email stored on the device|\n|---|---|\n|upgrade|Requests the application to download and install an upgrade package from a specified URL.|\n|camCmd|Requests the application take a screenshot or photo with the front or rear facing camera on the device.|\n|emailAttCmd|Causes the application to retrieve a particular email attachment.|\n\n\nAdditional commands are available to set most of the configurable options within the application.\nEach command includes an ack ID which the client will transmit back to the C2 server to\nacknowledge receipt of the command.\n\n#### SMS/MMS/WAP\n\n##### Inbound SMS\n\nSimilar to the methodology used by Pegasus for iOS, the Android package can receive\ncommands contained in SMS message bodies which appear to be disguised as Google\nauthentication codes. The command parser used by the Android version of the application\nappears compatible with messages that have been observed being sent to iOS devices.\n\nThe application registers a content observer for the Android SMS content provider which\nperforms a case insensitive search of the SMS message bodies for the string “your google\nverification code” on incoming SMS messages.\n\nSMS commands can include a command number, an ack ID, command arguments, and a\nsignature. The basic command structure is:\n\ntext:[Six Digits][Command Number]​ a=[​ _Ack ID]​_ &[​ _Command ​_\n_Arguments]&s=[​_ _Message Signature​_ ] ​\n\nThe message signature is an MD5 hash of the token configured on initial application launch and\nthe contents command message. The signature included in the message is checked against a\nsignature generated on the device. This ensures that the application will only respond to\ncommands which are issued from a sender who knows the device’s token.\n\n14\n\n\n-----\n\ng\n\n**Command** **Description**\n\n0 This “kill” command causes the application to attempt to\nremove itself from the device.\n\n1 Causes an outbound beaconing message to be sent either\nthrough HTTP or SMS.\n\n2 Sets the adlocation and ad rate configuration options and\n​ ​ ​ ​\ntoggles location monitoring functionality.\n\n3 Configures the following configuration options (typically used for\ninitial configuration):\n\n_1._ _WindowTargetSms_\n_2._ _Skypi_\n_3._ _NetworkWindowAddresess_\n\n4 Takes a photo with the device’s rear facing camera.\n\n5 Requests upload of an arbitrary file from the file system or\nupload of a directory listing.\n\n6 This readies the device to receive an audio surveillance call as\ndescribed under “Live Audio Surveillance.”\n\n7 Toggles the call recording features by setting the window canda\n​\n_configuration option._\n​\n\n8 Triggers an immediate request to one of the configured C2\nservers to fetch new commands over HTTP.\n\nCommand arguments for each command vary but are structured to look like query string\nparameters in the fake URL.\n\nFor all commands except 0, the application will acknowledge that a command was received by\nsending a request to the configured HTTP C2 server. The ack ID sent with the SMS command\nwill be included in the data within the header field of the HTTP request.\n\n15\n\n|Command|Description|\n|---|---|\n|0|This “kill” command causes the application to attempt to remove itself from the device.|\n|1|Causes an outbound beaconing message to be sent either through HTTP or SMS.|\n|2|Sets the adlocation and ad rate configuration options and ​ ​ ​ ​ toggles location monitoring functionality.|\n|3|Configures the following configuration options (typically used for initial configuration): 1. WindowTargetSms 2. Skypi 3. NetworkWindowAddresess|\n|4|Takes a photo with the device’s rear facing camera.|\n|5|Requests upload of an arbitrary file from the file system or upload of a directory listing.|\n|6|This readies the device to receive an audio surveillance call as described under “Live Audio Surveillance.”|\n|7|Toggles the call recording features by setting the window canda ​ configuration option. ​|\n|8|Triggers an immediate request to one of the configured C2 servers to fetch new commands over HTTP.|\n\n\n-----\n\n##### Outbound SMS\n\nThe application will send outbound SMS messages to the configured WindowTargetSms​\nnumber. This behavior can occur on demand, via a command issued to the application, or under\nother circumstances such as if no internet access is available or the device’s SIM card has been\nchanged.\n\nThese messages include a subset of the information available in the header fields sent in HTTP\ncommunication, though the data is formatted as colon separated key/value pairs or is newline\nseparated rather than XML.\n\nSMS messages sent to or received from the WindowTargetSms​ number are hidden from the ​\nend user.\n\n16\n\n\n-----\n\n##### WAP Push Messages\n\nThe malware will change the device’s WAP Settings to enable push messages.\n\nWAP push messages are SMS messages containing specially encoded data which can, under\ncertain circumstances, cause a device to automatically open a link in a browser on a device.\nThis can be used as another vector to autoload content on the device without user interaction, if\nthe device and cellular provider supports it.\n\nThis technique may also be employed for deployment on Android as the application makes an\neffort to delete WAP messages on startup if the device is rooted:\n\n#### Message Queue Telemetry Transport (MQTT)\n\nIn addition to being able to communicate via HTTP and SMS, Pegasus for Android is also\ncapable of establishing a connection to command and control infrastructure via the MQTT\nprotocol. There are however several attacker-specified restrictions that can be applied to when\nand if MQTT is utilized. With this in mind, Pegasus checks if the device is on Wi-Fi, a cellular\nnetwork, and/or is roaming, and whether it is configured to use MQTT in these scenarios. If\nPegasus has been explicitly configured to not use MQTT over the current network, then a\nconnection via MQTT will not occur.\n\nAssuming it is allowed to use MQTT over the current network, Pegasus will attempt to establish\na connection in the format tcp://<mqtt_remote_host>:<mqtt_port>.​ The remote host ​\nand port variables are populated based on configuration information retrieved from the\napplication’s shared preferences. As expected, if these fields are not present an MQTT\nconnection will fail to be successfully established. Several additional fields are also mandatory,\n\n17\n\n\n-----\n\ng, p, y g p\nsubscribe to a particular MQTT topic so that the operator can issue device specific commands\nthat are then executed by that client.\n\nThe processing of these remotely issued commands is handled in the same fashion as\ninstructions received via HTTP and SMS, previously detailed in this report. Each command\nincludes a signature that is used to verify the authenticity of the command and ensure it is not\nonly created by the attackers, but that it is intended for the device that is currently processing it.\nA separate thread is then responsible for handling the execution of these instructions.\n\nGiven that certain device criteria need to be met before certain commands are executed, it is\npossible that received commands are not immediately executed. To handle this, Pegasus for\nAndroid has a linked hash set that is used to store pending instructions. At most, 60 pending\ninstructions can be stored. When full, the receipt of further instructions results in the deletion of\nthe next instruction to be deleted and the addition of the most recently received one.\n\n#### Phone Calls\n\nThe application has special handling for calls associated with the numbers *762646466 and\n*7626464633. These phone numbers, respectively, toggle on and off the romingSetted​\nconfiguration option which controls whether normal C2 communication is used when the device\nis roaming. This feature is likely implemented because when a device is roaming and\n_romingSetted​_ is disabled, the application will not accept commands from the normal HTTP, ​\nSMS, or MQTT communications channels.\n\n18\n\n\n-----\n\n## Data Gathering and Surveillance Functionality \n\n### Targeted Applications\n\nAs was the case with Pegasus for iOS, the Android counterpart also targets numerous\nmessaging and communication applications. The apps we observed as targets included:\n\n    - WhatsApp\n\n    - Skype\n\n    - Facebook\n\n    - Viber\n\n    - Kakao\n\n    - Twitter\n\n    - Gmail\n\n    - Android’s Native Browser or Chrome\n\n    - Android’s Native Email\n\n    - Calendar\n\nAnalysis showed that in order to achieve this, Pegasus for Android first checked whether certain\nmessaging app databases were present before using its super user access to query them and\nretrieve user content. This included email messages, chat conversations, sent attachments, and\ncached content. We observed Pegasus for Android modifying the read, write, and execute\npermissions of the databases it targets to be accessible by all users. Interestingly, after it had\nretrieved information of value from some of these databases it would change the permissions\n​ ​\nback to their original values.\n\nThe overall method that Pegasus for Android uses to query these databases is the same. We\ncan see this in the table below where Pegasus for Android is attempting to retrieve a victim’s\nemail messages. Below we provide the code that Pegasus uses to first check whether the Gmail\nor native email application is used, then set the permissions of relevant files to be world\naccessible, before then reverting these permissions back to the original. This approach is\nutilized by most of the Pegasus information gathering modules. The exception to this includes\ndata retrieved via certain content providers; for example for bookmarks and calendar\ninformation.\n\nmessage_id_to_target = db_msg_to_target[0];\ndatabase_name_to_target = db_msg_to_target[1];\ngmail_db_location = this.gmail_db_loc == 1 ?\n\n\"/data/data/com.google.android.gm/databases\" :\n\"/data/data/com.android.email/databases\";\ndatabase_path = this.gmail_db_loc == 1 ?\n\ngmail_db_location + \"/\" +\ndatabase_name_to_target : gmail_db_location +\n\"/\" + database_name_to_target;\n…\n…\n\n19\n\n\n-----\n\nall_files_plus_perms_bitmask =\nFileSystemHelper.get_hashmap_files_perms_bitmask(gmail_db_location,\ndirectory_files);\n…\nFileSystemHelper.make_all_readable(\"0777\", gmail_db_location,\ndirectory_files);\n…\nif(all_files_plus_perms_bitmask != null && directory_files != null)\n{\n\nFileSystemHelper.reset_perms_to_orig_values(all_files_plus_per\nms_bitmask, gmail_db_location, directory_files);\n}\n\nListed below are the various directory paths and databases that it looks for when gathering\nsocial media and messaging data.\n\n**Target Application** **Databases / Files / Providers Accessed**\n\nGmail /data/data/com.google.android.gm/database/mailstore.<user-em\nail>@gmail.com.db\n\nFacebook /data/data/com.facebook.katana/databases/threads_db2\n/data/data/com.facebook.katana/databases/threads_db2-journal\n\nWhatsApp /data/data/com.whatsapp/databases/msgstore.db\n/data/data/com.whatsapp/databases/wa.db\n/data/data/com.whatsapp/shared_prefs/com.whatsapp_preferen\nces.xml\n\nSkype /data/data/com.skype.raider/files/main.db\n\nViber /data/data/com.viber.voip/databases/viber_messages\n/data/data/com.viber.voip/databases/viber_messages-journal\n\nKakao /data/data/com.kakao.talk/databases/KakaoTalk.db\n/data/data/com.kakao.talk/databases/KakaoTalk.db-journal\n\nTwitter /data/data/com.twitter.android/databases/*.db\n\nAndroid’s Native Browser /data/data/com.android.browser/databases/webview.db\n(contains stored user credentials)\nThe following content providers:\n\n                       - Bookmarks (history projection)\n                       - Searches\n\nAndroid’s Native Email /data/data/com.android.email/databases/<user-email>.db\n\n20\n\n|Target Application|Databases / Files / Providers Accessed|\n|---|---|\n|Gmail|/data/data/com.google.android.gm/database/mailstore.<user-em ail>@gmail.com.db|\n|Facebook|/data/data/com.facebook.katana/databases/threads_db2 /data/data/com.facebook.katana/databases/threads_db2-journal|\n|WhatsApp|/data/data/com.whatsapp/databases/msgstore.db /data/data/com.whatsapp/databases/wa.db /data/data/com.whatsapp/shared_prefs/com.whatsapp_preferen ces.xml|\n|Skype|/data/data/com.skype.raider/files/main.db|\n|Viber|/data/data/com.viber.voip/databases/viber_messages /data/data/com.viber.voip/databases/viber_messages-journal|\n|Kakao|/data/data/com.kakao.talk/databases/KakaoTalk.db /data/data/com.kakao.talk/databases/KakaoTalk.db-journal|\n|Twitter|/data/data/com.twitter.android/databases/*.db|\n|Android’s Native Browser|/data/data/com.android.browser/databases/webview.db (contains stored user credentials) The following content providers: - Bookmarks (history projection) - Searches|\n|Android’s Native Email|/data/data/com.android.email/databases/<user-email>.db|\n\n\n-----\n\nDefault Calendar content://com.android.calendar/events\ncontent://calendar/events\n\n### Live Audio Surveillance\n\nPegasus for Android supports live audio surveillance. This functionality is triggered when a call\nis received from an attacker’s specified number and results in an adversary being able to silently\nlisten and capture surrounding audio received by the device’s microphone. Live audio\nsurveillance functionality can only be activated in specific situations that require the following\nconditions to be met:\n\n  - The screen is locked\n\n  - The screen is off\n\n  - Call forwarding is not enabled\n\n  - A user did not interrupt a previous live surveillance operation\n\n  - There is no approved live surveillance endpoint to accept calls from\n\n  - The calling number must match the decrypted value stored in shared preferences under\nthe key “Skypi​ ” ​\n\n  - The telephony state is not idle\n\n  - The microphone is not already in use\n\n  - If certain battery charging conditions are not met\n\n  - A wired headset is not connected\n\n  - A bluetooth A2DP audio peripheral is not connected\n\n  - Communication is not currently using bluetooth\n\n  - Music is not active\n\n  - The device is either not roaming or Pegasus has been configured to perform this\nfunctionality even if a device is roaming\n\n### Screenshot and Camera Capability\n\nPegasus for Android contains the functionality to capture visual content via screenshots or by\nusing a device’s front or back camera.\n\nIn order to successfully function regardless of a device’s operating environment, analysis\nshowed that screen capture capability was implemented twice. The first approach that Pegasus\nfor Android uses relies on the screencap​ binary which exists on some installations under the ​\n/system/bin/ path. If present, Pegasus for Android instructs it to take a screenshot and save ​\nit in the PNG file format to /data/data/com.network.android/bqul4.dat​ . This ​\nfunctionality can be seen in the following screenshot.\n\n21\n\n\n-----\n\nOn devices where the screencap​ binary is not present, Pegasus falls back to a native screen ​\ncapture implementation that is provided by the take_screen_shot​ binary, located in the ​\napplications res/raw​ directory. In the figures below we can see Pegasus for Android first ​\ncalling this binary from its Java component followed by a snippet of native functionality\nresponsible for reading in the /dev/graphics/fb0​ framebuffer and saving it temporarily as a ​\nPNG file to /data/data/com.network.android/tss64.dat​ . The native ​\ntake_screen_shot binary makes use of the input/output control system call ioctl as well as ​\nlibpng.\n\nSuccessfully captured images that are stored in the PNG file format are then compressed to the\nJPG format and saved with a filename in the format\nScreenShot-res<single_integer>-<current_system_time_in_seconds>.jpg.\n\nSimilar to capturing screenshots, the spyware’s capability to take pictures using the camera of a\ncompromised device first saves these images in the PNG file format before compressing them\nas JPGs. The resulting JPG files are named in the following format depending on whether they\nwere acquired using either the front or back camera on a device:\n\nFront-res<single_integer>-<current_sysyem_time_in_seconds>.jpg\n\nBack-res<single_integer>-<current_sysyem_time_in_seconds>.jpg\n\nThis functionality to take pictures using the device’s various cameras is implemented purely in\njava code, a snippet of which is shown below.\n\n22\n\n\n-----\n\nCamera$Parameters v1 = selected_camera.getParameters();\nCamera$Size v4 = v1.getPreviewSize();\nYuvImage v0_1 = new YuvImage(arg11, v1.getPreviewFormat(),\nv4.width, v4.height, null);\nByteArrayOutputStream v1_1 = new ByteArrayOutputStream();\nv0_1.compressToJpeg(new Rect(0, 0, v0_1.getWidth(),\nv0_1.getHeight()), 50, ((OutputStream)v1_1));\nbyte[] v0_2 = v1_1.toByteArray();\nBitmapFactory$Options v1_2 = new BitmapFactory$Options();\n…\n...\nBitmap v0_3 = BitmapFactory.decodeByteArray(v0_2, 0, v0_2.length,\n\nv1_2);\nv1_1 = new ByteArrayOutputStream();\nv0_3.compress(Bitmap$CompressFormat.JPEG, 50,\n((OutputStream)v1_1));\nbyte[] v1_3 = v1_1.toByteArray();\nString current_sys_time_in_sec =\ne.get_current_system_time_seconds();\nString v3 = this.a == 1 ? \"Front-res\" + this.b + \"-\" +\n\ncurrent_sys_time_in_sec + \".jpg\" : \"Back-res\" + this.b +\n\"-\" + current_sys_time_in_sec + \".jpg\";\n\n### Keylogging\n\nPegasus for Android is capable of injecting itself into the keyboard process of a device and in\ndoing so logging the content that a victim enters. This functionality is provided by the libk​\nbinary that is stored in res/raw/​ directory. During execution Pegasus writes the ​ libk​ ELF file ​\nout to /data/local/tmp/libuml.so​, where it is immediately executed and injected into the ​\nprocess id of the keyboard before being deleted. Keylogged data is initially written to\n/data/local/tmp/ktmu/ulmndd.tmp before being moved into a timestamped file at ​\n/data/local/tmp/ktmu/finidk.<current_time>. ​\n\n23\n\n\n-----\n\nThe component of libk​ that is responsible for temporarily keylogging input to ​\n/data/local/tmp/ktmu/ulmdd.tmp. Log files contain the bitwise not, or complement, of ​\n\nthe input so are not stored in plaintext.\n\nEach input event is eventually moved from its temporary ulmdd.tmp​ file to a timestamped file ​\n\nlocated at /data/local/tmp/ktmu/finidk.<timestamp>​ . ​\n\nInjection and keyboard hooking is achieved by getting the process id of the current input method\nwhich is then passed into the init entry point of libk​ via the ​ addk​ binary which during ​\nexecution is copied to /data/local/tmp/inulmn​ . ​\n\nThe libk​ binary contains many similar references in its logging statements that appear ​\nelsewhere in the Pegasus application. This suggests it was created by the same authors\nresponsible for the overall application, as opposed to being created by a third party.\n\n24\n\n\n-----\n\n## Persistence, Evasion, and Suicide Functionality\n\n### Suicide Functionality\n\nAs seen in the iOS version of Pegasus, the Android counterpart also includes suicide\nfunctionality to remove itself under a variety of different circumstances. Our analysis identified\nthe following four cases where this functionality would be triggered:\n\n1. The MCC subscribe ID does not exist or is invalid\n2. An antidote file exists at /sdcard/MemosNoteNotes ​\n3. Pegasus for Android has not checked in with the servers for more than 60 days\n4. Pegasus for Android receives a remote command to remove itself\n\n#### MCC Subscriber ID Suicide\n\nIt appears that Pegasus for Android will kill itself if it is unable to detect the MCC subscriber ID\nor finds it to be invalid. This is likely to prevent it from being run on test devices and emulator\nenvironments which may not be connected to a cellular network. The analyzed sample\nappeared to contain (what is presumably) test code that allows it to run regardless of whether it\ndetects the device is connected to a cellular network or not.\n\n#### Existence of Antidote File\n\nIf a file is present at /sdcard/MemosForNotes​ then Pegasus for Android will clean up and ​\nremove itself from the device.\n\n25\n\n\n-----\n\n#### Maximum Check In Time Exceeded \n\nSuicide functionality is also triggered if no contact has been made with the command and\ncontrol servers for 60 days.\n\n### Device Updates Disabled for Persistence\n\nAnalysis showed that if Pegasus for Android was running on a Samsung device and was able to\ngain superuser access it would remove the system updater\ncom.sec.android.fotaclient. This would prevent future device updates from occurring ​\nand allow its various components to persist on the /system​ partition of a compromised device. ​\nPegasus for Android also disables automatic updates by setting\nSettings.System.SOFTWARE_UPDATE_AUTO_UPDATE​ to 0.​\n\n26\n\n\n-----\n\n### Native Components\n\nAs discussed earlier, the Android app contains both Android Java code as well as native\ncomponents in the form of binary ELF executables. These binaries are run by the Android app.\n\n**Filename** **Description**\n\naddk Used for process injection\n\ncmdshell Takes a supplied argument, attempts to set the user id to be the\nroot user, and then executes the provided argument.\n\nlibk Keylogging component that is injected into the process ID of the\nkeyboard in order to capture user input. Addk is used to injected\nthis.\n\noutput.mp3\n\nsucopier The publicly available framaroot exploit binary . 2\n\ntake_screen_shot Binary used to take screenshots of the device.\n\n### Upgrade Process\n\nUpgrades are initiated when a command is received from a C2 server. The upgrade command\nspecifies a URL used to download the upgrade package. The upgrade package is downloaded\nto /data/data/com.network.android/upgrade/uglmt.dat.\n\nAn upgrade package contains an MD5 hash, truncated to 16 bytes, followed by Dalvik bytecode.\nThe input used to generate the hash is the device token followed by the bytecode included in\nthe file.\n\nThe MD5 included in the file is validated by the client using its designated token. If the token\nconfigured on the client is different from the one used by the server and the hashes don’t match,\nthe upgrade process will abort.\n\n2\n\n[https://github.com/hackedteam/core-android/blob/888e51b4ef778ee7f1ef63e22f622ddffb358b39/RCSAnd](https://github.com/hackedteam/core-android/blob/888e51b4ef778ee7f1ef63e22f622ddffb358b39/RCSAndroid/jni/exploit_list.c)\n[roid/jni/exploit_list.c](https://github.com/hackedteam/core-android/blob/888e51b4ef778ee7f1ef63e22f622ddffb358b39/RCSAndroid/jni/exploit_list.c)\n\n27\n\n|Filename|Description|\n|---|---|\n|addk|Used for process injection|\n|cmdshell|Takes a supplied argument, attempts to set the user id to be the root user, and then executes the provided argument.|\n|libk|Keylogging component that is injected into the process ID of the keyboard in order to capture user input. Addk is used to injected this.|\n|output.mp3||\n|sucopier|The publicly available framaroot exploit binary2 .|\n|take_screen_shot|Binary used to take screenshots of the device.|\n\n\n-----\n\nIf the hashes do match, the remaining contents of uglmt.dat​ is loaded as a dex file and the ​\nstatic method com.media.provapp.DrivenObjClass.PerfU​ is invoked, through ​\nreflection, with the argument\n/data/data/com.network.android/upgrade/intro.mp3. ​\n\nAfter a successful upgrade has been performed, the following files are cleaned up:\n\n- /data/data/com.network.android/upgrade/uglmt.dat ​\n\n- /data/data/com.network.android/upgrade/cuvmnr.dat ​\n\n- /data/data/com.network.android/upgrade/zero.mp3 ​\n\n- /data/data/com.network.android/upgrade/*com.media.sync* ​\n\n## Second Pegasus Sample\n\nThis sample differs significantly from the first sample analyzed above. It has a considerably\nsmaller code base and is clearly intended to be installed on a device that was previously rooted\nand already contains the /system/csk​ superuser binary. ​\n\nAnalysis of this sample showed that its sole purpose is to initiate a connection to a remote\naddress, download an additional payload, save this data to the file\n/data/data/com.network.android/.coldboot_init, before copying it to ​\n/mnt/obb/.coldboot_init and changing the permissions on this file to 0711. The ​\nfunctionality to perform this download is located in the sample’s only native binary, libsgn.so​ . ​\nThe portion of the sample written in java is extremely minimal and exists just to load\nlibsgn.so. Below is a section of code from the ​ libsgn.so​ file that attempts to write the ​\nretrieved payload to various paths.\n\n28\n\n\n-----\n\nFurthermore the libsgn.so​ binary contains a single hardcoded IP address from where to ​\nreceive the payload that eventually gets written out to the .coldboot_init​ file. This IP ​\naddress, 130.195.234.251​, can be seen below in the following screenshot taken during ​\nanalysis.\n\nRequests to this IP address are made in the following format /adinfo?gi=%s&bf=%s​ where ​\nthe values of the gi and bf parameters are populated using a combination of the\nrandom_hexlified_md5() and ​ get_mac_address()​ functions. ​\n\n29\n\n\n-----\n\n## Conclusion\n\nIn the analysis of Pegasus for iOS, we described NSO’s commitment to ensuring that their\nproducts remained undetected. While the samples described here were packaged in 2014, they\nwere undetected by the security community. Both Lookout and Google found evidence\nindicating that this spyware was currently live on victims’ devices. We are publishing this\ninformation to underscore the campaign’s novel ability to combine and integrate a series of\nmalicious techniques to spy on victims while remaining hidden, both to the victim and to the\nsecurity community at large. Where multiple security controls otherwise prohibit unauthorized\nremote data access, this attack gains access to a device, escalates privilege, utilizes root\naccess, and gains residence in /system. It then accesses and exfiltrates data from other apps’\nunderlying secure data-stores, all controlled by commands from a C2 server. Pegasus will likely\nalways be a targeted threat, highly damaging to its victims’ privacy, as well as to any personaland business-data accessed on (or discussed near) the device.\n\nSince the discovery of Pegasus for iOS in August 2016, the world has seen new evidence of\nadvanced persistent threats. While the security community and members of the general public\nwere aware (based on NSO’s marketing) that there was likely to be an Android version of this\nadvanced spyware, it required significant threat hunting, research, and information-sharing to\nultimately disrupt the attack. This suggests that further investment in mobile security research\nand development is required to continually stay ahead of threat actors funding their own\nresearch and development to thwart the next advances.\n\nSophisticated threat actors are targeting mobile for the same reasons these devices have\nbecome ubiquitous in our personal and professional lives. The communication and data-access\nfeatures, the trust users put in their devices, and the prevalence of these devices mean they\nalso have become an effective espionage tool that well-funded attackers will continue to target.\n\n30\n\n\n-----\n\n## Acknowledgements\n\nAndrew Blaich\nAdam Bauer\nMichael Flossman\nJeremy Richards\nChristoph Hebeisen\nKristy Edwards\nChristina Olson\nMichael Murray\nDanielle Kingsley\nStephen Edwards\n\nAdditional credit goes to the Android Security Team at Google for their collaboration and\nanalysis throughout this investigation.\n\n\n31\n\n\n-----\n\n## Appendix\n\n#### Sample Digests\n\n**Pegasus for Android Samples**\n\n**Package Name** **SHA256 Digest** **SHA1 certificate**\n\ncom.network.android ade8bef0ac29fa363fc9afd958af007447 44f6d1caa257799e57f0ecaf4e2e21617\n8aef650adeb0318517b48bd996d5d5 8f4cb3d\n\ncom.network.android 3474625e63d0893fc8f83034e835472d9 516f8f516cc0fd8db53785a48c0a86554f\n5195254e1e4bdf99153b7c74eb44d86 75c3ba\n\n**Additional related digests**\n\n**Package Name** **SHA256 Digest** **SHA1 certificate**\n\ncom.network.android 98ca5f94638768e7b58889bb5df4584bf 516f8f516cc0fd8db53785a48c0a86554f\n5b6af56b188da48c10a02648791b30c 75c3ba\n\ncom.network.android 5353212b70aa096d918e4eb6b49eb5ax 44f6d1caa257799e57f0ecaf4e2e21617\n8f59d9bec02d089e88802c01e707c3a1 8f4cb3d\n\ncom.binary.sms.receiver 9fae5d148b89001555132c896879652fe 7771af1ad3a3d9c0b4d9b55260bb47c2\n\n1ca633d35271db34622248e048c78ae 692722cf\n\ncom.android.copy e384694d3d17cd88ec3a66c740c6398e 7771af1ad3a3d9c0b4d9b55260bb47c2\n07b8ee401320ca61e26bdf96c20485b4 692722cf\n\ncom.android.copy 12e085ab85db887438655feebd249127 7771af1ad3a3d9c0b4d9b55260bb47c2\nd813e31df766f8c7b009f9519916e389 692722cf\n\ncom.android.copy 6348104f8ef22eba5ac8ee737b1928876 31a8633c2cd67ae965524d0b2192e9f1\n29de987badbb1642e347d0dd01420f8 4d04d016\n\n#### Configuration and Behavioral Settings\n\nPegasus uses the Android shared preferences functionality to store configuration and\nbehavioural values. This contains a wealth of information from MQTT settings, call recording\nparameters, command and control details to self destruction timer values, original vibrate and\nringer settings in the event Pegasus modifies these, and a vulnerability indicator for the device.\nA complete list of these with a brief description is provided in the table below.\n\n**Shared Preference Value** **Description**\n\nNetworkWindowResizer A token used during the upgrade process to\nverify that a received dex file is legitimate. See\n\n32\n\n|Pegasus for Android Samples|Col2|Col3|\n|---|---|---|\n|Package Name|SHA256 Digest|SHA1 certificate|\n|com.network.android|ade8bef0ac29fa363fc9afd958af007447 8aef650adeb0318517b48bd996d5d5|44f6d1caa257799e57f0ecaf4e2e21617 8f4cb3d|\n|com.network.android|3474625e63d0893fc8f83034e835472d9 5195254e1e4bdf99153b7c74eb44d86|516f8f516cc0fd8db53785a48c0a86554f 75c3ba|\n\n|Additional related digests|Col2|Col3|\n|---|---|---|\n|Package Name|SHA256 Digest|SHA1 certificate|\n|com.network.android|98ca5f94638768e7b58889bb5df4584bf 5b6af56b188da48c10a02648791b30c|516f8f516cc0fd8db53785a48c0a86554f 75c3ba|\n|com.network.android|5353212b70aa096d918e4eb6b49eb5ax 8f59d9bec02d089e88802c01e707c3a1|44f6d1caa257799e57f0ecaf4e2e21617 8f4cb3d|\n|com.binary.sms.receiver|9fae5d148b89001555132c896879652fe 1ca633d35271db34622248e048c78ae|7771af1ad3a3d9c0b4d9b55260bb47c2 692722cf|\n|com.android.copy|e384694d3d17cd88ec3a66c740c6398e 07b8ee401320ca61e26bdf96c20485b4|7771af1ad3a3d9c0b4d9b55260bb47c2 692722cf|\n|com.android.copy|12e085ab85db887438655feebd249127 d813e31df766f8c7b009f9519916e389|7771af1ad3a3d9c0b4d9b55260bb47c2 692722cf|\n|com.android.copy|6348104f8ef22eba5ac8ee737b1928876 29de987badbb1642e347d0dd01420f8|31a8633c2cd67ae965524d0b2192e9f1 4d04d016|\n\n|Shared Preference Value|Description|\n|---|---|\n|NetworkWindowResizer|A token used during the upgrade process to verify that a received dex file is legitimate. See|\n\n\n-----\n\n|Col1|the upgrade process section for more details.|\n|---|---|\n|WindowTargetSms|The SMS number used for outbound SMS communication.|\n|Skypi|Contains an attacker specified number. When calls are received from this number they trigger the live audio surveillance capability of Pegasus. See live audio surveillance section for more details.|\n|url address|A specific URL that is to be removed from a victim’s browsing history.|\n|lastComunication|Time in seconds when the last command was received.|\n|lastSend|Time in seconds when Pegasus last communicated out.|\n|lastReceive|Time in seconds when last command was processed.|\n|send|A counter containing the number of text messages sent by Pegasus.|\n|receive|A counter containing the number of command messages that have been received via SMS.|\n|sesseions||\n|wasPhoneWasUnmutedAfterTapNicly|Variable used to track the original state of the device’s call settings and whether the vibrator or ringer was successfully reenabled after silently receiving a command.|\n|originalVibrateValue|Used to store the original vibrator setting of the device.|\n|originalRingerValue|Used to store the original ringer setting of the device.|\n|errorCode|A Pegasus specific error code that is used to indicate a certain issue or scenario was encountered during execution.|\n|maxTimeWithNoComunication|The maximum time allowed without receiving communications from an attacker. If this time is exceeded Pegasus will remove itself. More information on this is detailed under the suicide functionality section. By default this is set to 5184000, 60 days.|\n\n\n33\n\n\n-----\n\n|failureCount|A counter containing the number of times Pegasus failed to send data via SMS.|\n|---|---|\n|grace|Unclear. Always set to false and never retrieved.|\n|packageVersion|The version of the currently installed agent.|\n|vulnarbilityIndicator|A value provided when requesting an update package from a command and control server. Presumably used to retrieve an environment specific payload that can be used to further exploit a target device.|\n|commandTimeStamp|System time in seconds when the last command was received.|\n|adlocation|The time period used to monitor the location of a target device.|\n|adrate|The frequency at which to consistently poll a device for its location while location monitoring is active.|\n|userNetwork|The mobile country code of a victim’s device.|\n|installation|A value populated at run time from either /system/ttg or /system/myappinfo.|\n|windowYuliyus|A boolean that if set to true will cause Pegasus to restrict its functionality if a target device is found to be roaming.|\n|window canada|A boolean value indicating whether call recording should be enabled or not.|\n|graceTime|Unclear. Always set to 0 and never retrieved.|\n|finish|A boolean value that is set to true if a command has finished execution or false if it’s still running.|\n|callWindow|A boolean value indicating whether call log data is to be retrieved.|\n|smsWindow|A boolean value indicating whether SMS data is to be retrieved.|\n|dumpContacts|Used to determine whether contact details should be retrieved.|\n|dumpBrowserData|Used to determine whether browser history should be retrieved.|\n\n\n34\n\n\n-----\n\n|dumpCalander|Used to determine whether calendar information should be retrieved.|\n|---|---|\n|firstRun|Used to determine whether whatsapp content should be retrieved.|\n|dumpMails|Used to determine whether emails should be retrieved.|\n|forwarding|Indicates whether call forwarding is enabled.|\n|allowRomingType|Used in conjunction with windowYuliyus to specify whether Pegasus should communicate to C2 infrastructure while a device is roaming.|\n|logNetwork|Name of temporary log file which is initially set to ‘ltmp.dat’ and resides under ‘/data/data/com.network.android/logs/’.|\n|ScreenTimeout|The amount of time in milliseconds before the device goes to sleep or begins to dream after a period of inactivity.|\n|wanted_debug_level|Controls if logging to files under /data/data/com.network.android/logs/ occurs.|\n|screenProximtySensor|The original value of the proximity sensor.|\n|romingSetted|Used in conjunction with windowYuliyus and allowRomingType to determine whether Pegasus should communicate to C2 infrastructure while a device is roaming.|\n|mqttPassword|The password used during authentication to an MQTT server.|\n|did_we_restart_after_upgrade_already|A boolean value indicating that the device was rebooted post installation of Pegasus.|\n|mqttAllowedConnectionType|Indicates whether communicating via MQTT is allowed when a device is connected to wifi, only using cellular data, and / or roaming.|\n|should_use_mqtt|Controls whether MQTT is used by Pegasus for communication.|\n|mqttRecCount|The maximum number of reconnection attempts that should occur.|\n|mqttUsername|The username provided during authentication to an MQTT server.|\n\n\n35\n\n\n-----\n\n|mqttIdPref|The MQTT value that is used to identify a client in combination with their username.|\n|---|---|\n|mqttQos|Quality of service value for MQTT connections.|\n|mqttKaTimer|The MQTT keep alive timer which indicates the maximum period that a compromised device and MQTT server can maintain a connection for without communicating.|\n|mqttPort|A port on a specific host that it is expected will have the MQTT service running.|\n|mqttHost|A specific host on which the MQTT service is running.|\n|mqttRecInt|Unclear. Doesn’t appear to impact functionality in the version analyzed.|\n|networkKill||\n|pollingInterval|The frequency at which to beacon to attacker infrastructure.|\n|local|A boolean value that reflects how Pegasus views its installation environment and whether it is likely on a legitimate device.|\n\n\n403171255\n\n\n36\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-android-technical-analysis.pdf"
    ],
    "report_names": [
        "lookout-pegasus-android-technical-analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1491224381,
    "ts_modification_date": 1491224381,
    "files": {
        "pdf": "https://archive.orkl.eu/a7f5de87d424731b59fd86a48da158f9e3013f0d.pdf",
        "text": "https://archive.orkl.eu/a7f5de87d424731b59fd86a48da158f9e3013f0d.txt",
        "img": "https://archive.orkl.eu/a7f5de87d424731b59fd86a48da158f9e3013f0d.jpg"
    }
}