{
    "id": "72f9f23b-c8ff-4d04-bdca-4f5ad2dfcc74",
    "created_at": "2023-01-12T15:01:42.334556Z",
    "updated_at": "2025-03-27T02:06:12.238716Z",
    "deleted_at": null,
    "sha1_hash": "a283098e8bbba54add888e714a3712d41f7c12f0",
    "title": "2021-12-06 - Mirai-based Botnet - Moobot Targets Hikvision Vulnerability",
    "authors": "",
    "file_creation_date": "2022-05-28T15:14:40Z",
    "file_modification_date": "2022-05-28T15:14:40Z",
    "file_size": 164479,
    "plain_text": "# Mirai-based Botnet - Moobot Targets Hikvision Vulnerability\n\n**[fortinet.com/blog/threat-research/mirai-based-botnet-moobot-targets-hikvision-vulnerability](https://www.fortinet.com/blog/threat-research/mirai-based-botnet-moobot-targets-hikvision-vulnerability)**\n\nThreat Research\n\nBy [Cara Lin | December 06, 2021](https://www.fortinet.com/blog/search?author=Cara+Lin)\n\n\nDecember 6, 2021\n\n\n[Last September 18th, a threat researcher released a write-up about a remote code execution](https://watchfulip.github.io/2021/09/18/Hikvision-IP-Camera-Unauthenticated-RCE.html)\nvulnerability that affects various products from Hikvision, one of the largest video surveillance\nbrands in the world. Hikvision is a CVE CNA and quickly assigned the CVE number, CVE2021-36260 and released a patch for the vulnerability on the same day as the threat\nresearcher’s disclosure. Shortly after, FortiGuard Labs developed an IPS signature to\naddress it.\n\n\n-----\n\nDuring our analysis, we observed numerous payloads attempting to leverage this\nvulnerability to probing the status of devices or extracting sensitive data from victims. One\npayload in particular caught our attention. It tries to drop a downloader that exhibits infection\nbehavior and that also executes Moobot, which is a DDoS botnet based on Mirai. In this blog\nwe explain how an attacker delivers this payload through the Hikvision vulnerability, along\nwith details of the botnet.\n\n**Affected platforms: Hikvision Product**\n**Impact parties: IP Cam/NVR**\n**Impact: Attacker can exploit the vulnerability to launch a command injection attack by**\nsending some messages with malicious commands in the web server\n**Severity: Critical**\n\n## Stage 0 – Exploitation and Propagation\n\nCVE-2021-36260 results from insufficient input validation, allowing unauthenticated users to\ninject malicious content into a <language> tag to trigger a command injection attack on a\nHikvision product. Below is an example of a request leveraging this exploit:\n\nFigure 1. Exploit traffic of CVE-2021-36260\n\nWe collected a number of payloads leveraging this vulnerability, and eventually found a\ndownloader. After tracing the traffic capture, the complete payload is shown in the following\nfigure:\n\nFigure 2. Payload from CVE-2021-36260\n\nFirst, because the final Moobot will be saved as “macHelper,” it first tries to remove any file\nalready named “macHelper.” It then echoes code into “downloader,” which is a small ELF 32bit LSB ARM file. After downloader completes downloading, it executes Moobot with the\nparameter “hikivision”. Finally, it changes commonly used commands, such as “reboot,” to\nprevent an administrator from invoking reboot on the affected device.\n\n## Stage 1 - Downloader\n\nThe attacker leverages this vulnerability to drop a downloader (SHA256:\n1DCE6F3BA4A8D355DF21A17584C514697EE0C37B51AB5657BC5B3A297B65955F). It\nhas only one job: download the main botnet. It downloads the malware with “/arm5” URI form\nserver 199.195.250[.]233:80 and prints “RAY” if the downloading process was successful.\nThe following image shows the disassembled code:\n\nFigure 3. Downloader\n\nFrom the IP address we not only get the moobot variants for different architectures, we also\nget the historic malware from directory “/h/“.\n\n\n-----\n\nFigure 4. Sample list from downloader s IP\n\n## Stage 2 - Moobot\n\n[Based on our analysis, the malware (SHA256:](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\n38414BB5850A7076F4B33BF81BAC9DB0376A4DF188355FAC39D80193D7C7F557)\ndownloaded in the previous stage is Moobot, which is Mirai-based. Its most obvious feature\nis that it contains the data string “w5q6he3dbrsgmclkiu4to18npavj702f”, which is used in the\n“rand_alphastr” function. It is used to create random alphanumeric strings with different\npurposes, such as for a setup process name or to generate data for attacking.\n\nFigure 5. Alphanumeric string function from Moobot\n\nIt also has some elements from Satori, which is another Mirai variant botnet. It contains a\n“downloader” that targets a victim’s IoT devices, and it prints a “9xsspnvgc8aj5pi7m28p”\nstring after execution. This variant also forks itself with the process name “/usr/sbin*” to try to\nlook like a normal process while wiping out the original file, “macHelper”.\n\nFigure 6. Code snippet from Moobot\n\nSince it is based on Mirai, the botnet also contains a data section to store its configuration.\nThe plaintext configuration can be decoded after XOR with 0x22:\n\nFigure 7. Decoded data containing configuration\n\nAfter getting the C2 server (life.zerobytes[.]cc) from its configuration, it starts sending\nheartbeat (\\x00\\x00) packets and then waits for the next control command from the C2\nserver. Once the victim system receives the command, it starts a [DDoS attack to a specific](https://www.fortinet.com/products/ddos/fortiddos.html?utm_source=blog&utm_campaign=ddos)\nIP address and port number. One example of the DDoS attack traffic is shown below:\n\nFigure 8. SYN flood\n\nThe DDoS attack command is 24 bytes and can be seen in the Data section in Figure 8. This\ndetail is illustrated in the following figure, which includes the flood method and the target\nIP/Port. Except for SYN flood, the C2 server has other attacking commands, such as 0x06\nfor UDP flood, 0x04 for ACK flood, and 0x05 for ACK+PUSH flood.\n\nFigure 9. Command\n\nThe complete attack scenario from trying to infect Hikvision product to deploying Moobot\nis shown in figure 10:\n\nFigure 10. Attack scenario\n\n\n-----\n\nWe also noticed that a DDoS service provider based the packet capture from our machine in\nFigure 11. We tracked down a telegram channel named “tianrian,” which provides a DDoS\nservice. They use a specific string, “openmeokbye”, in their login interface, shown in Figure\n12. This channel was created on June 11, 2021, and started its service in August. From the\nchatting channel we can see that the service is still updating. Users should always look out\nfor DDoS attacks and apply patches to vulnerable devices.\n\nFigure 11. Traffic capture from infected machine\n\nFigure 12. Telegram channel\n\n## Conclusion\n\nHikvision is one the biggest provider of IP cam/NVR products in the global market. CVE2021-36260 is a critical vulnerability that makes Hikvision products a target for Moobot. In\nthis blog we showed how an attacker can leverage CVE-2021-36260 and elaborated in detail\neach stage of the process.\n\n[Although a patch has been released to address this vulnerability, this IoT botnet will never](https://www.hikvision.com/en/support/cybersecurity/security-advisory/security-notification-command-injection-vulnerability-in-some-hikvision-products/)\nstop looking for a vulnerable end point. Because of this, users should upgrade affected\ndevices immediately as well as apply FortiGuard protection.\n\n## Fortinet Protections\n\n[Fortinet released IPS signature](https://www.fortinet.com/products/data-center-ips.html?utm_source=blog&utm_campaign=ips-page)\nHikvision.Product.SDK.WebLanguage.Tag.Command.Injection for CVE-2021-36260 to\nproactively protect our customers. The signature is officially released in IPS definition version\n18.192.\n\nThe downloader and all related malware from that site are detected and blocked by\nFortiGuard AntiVirus:\n\nELF/Mirai.AE!tr\n\nELF/Mirai.BO!tr\n\nELF/Mirai.D!tr\n\nELF/Mirai.AYU!tr\n\nELF/Mirai.WJ!tr\n\nLinux/Mirai.WJ!tr\n\nBoth the downloading URL and C2 server have been rated as \"Malicious Websites\" by the\nFortiGuard [Web Filtering service.](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering)\n\n\n-----\n\n### IOCs\n\nSHA256:\n\n1DCE6F3BA4A8D355DF21A17584C514697EE0C37B51AB5657BC5B3A297B65955F\n\n38414BB5850A7076F4B33BF81BAC9DB0376A4DF188355FAC39D80193D7C7F557\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n### Related Posts\n\nCopyright © 2022 Fortinet, Inc. All Rights Reserved\n\n[Terms of ServicesPrivacy Policy](https://www.fortinet.com/corporate/about-us/legal.html)\n| Cookie Settings\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-06 - Mirai-based Botnet - Moobot Targets Hikvision Vulnerability.pdf"
    ],
    "report_names": [
        "2021-12-06 - Mirai-based Botnet - Moobot Targets Hikvision Vulnerability.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535702,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653750880,
    "ts_modification_date": 1653750880,
    "files": {
        "pdf": "https://archive.orkl.eu/a283098e8bbba54add888e714a3712d41f7c12f0.pdf",
        "text": "https://archive.orkl.eu/a283098e8bbba54add888e714a3712d41f7c12f0.txt",
        "img": "https://archive.orkl.eu/a283098e8bbba54add888e714a3712d41f7c12f0.jpg"
    }
}