{
    "id": "73260a23-a2b2-443f-887d-10b7b736a1ab",
    "created_at": "2023-01-12T14:59:21.440131Z",
    "updated_at": "2025-03-27T02:05:57.210891Z",
    "deleted_at": null,
    "sha1_hash": "8cfcab1fc8ea9ecf2d46da0b139ffd5d906f6543",
    "title": "2019-04-09 - Cybercrime market selling full digital fingerprints of over 60,000 users",
    "authors": "",
    "file_creation_date": "2022-05-27T22:39:56Z",
    "file_modification_date": "2022-05-27T22:39:56Z",
    "file_size": 415296,
    "plain_text": "# Cybercrime market selling full digital fingerprints of over 60,000 users\n\n**zdnet.com/article/cybercrime-market-selling-full-digital-fingerprints-of-over-60000-users/**\n\n[Home Innovation Security](https://www.zdnet.com/)\nGenesis service is selling users' personal data, complete with digital fingerprints, such as account credentials, cookies, browser user-agent\ndetails, and more.\n\nWritten by Catalin Cimpanu, Contributor on April 9, 2019\n\nToday, at the Kaspersky Security Analyst Summit conference taking place in Singapore, security researchers from Kaspersky Lab have\nrevealed the existence of a new cybercrime marketplace where crooks are selling full digital fingerprints for over 60,000 users.\n\nThis new marketplace is like nothing that has ever been seen on the hacking scene until now.\n\nNamed Genesis, the service launched in the fall of 2018, when its creators began advertising it as a \"secondary/related service\" on several\ncarding forums (forums where cyber-criminals sell stolen payment card details).\n\n\n-----\n\nGenesis ad\n\n\nImage: ZDNet\nGenesis' main product is users' full digital profiles.\n\nUsers who in the past have been infected with malware or who have installed rogue browser extensions have unknowingly had their account\npasswords and full browser details recorded, and then sent to Genesis operators.\n\nEach user profile includes login credentials for accounts on online payment portals, e-banking services, file-sharing or social networking\nservices, but also the cookies associated with those accounts, browser user-agent details, WebGL signatures, HTML5 canvas fingerints, and\nother browser and PC details.\n\nGenesis operators make their profits by selling this information on their marketplace to other cyber-criminal groups. The marketplace's main\nclientele are cyber-criminal engaged in online fraud, identity theft, and money mule operations.\n\nGenesis buyers can acquire a user's digital identity for prices ranging from $5 to $200 and then log into that user's account to steal funds,\npersonal photos, sensitive or proprietary documents, or submit official papers on his behalf (to government-related agencies).\n\n\n-----\n\nGenesis marketplace\n\n\nImage: ZDNet\nTo use any of the user identities crooks buy from Genesis, buyers will have to install a Chrome extension that has been created by the Genesis\nteam.\n\nThis extension, provided free of charge to any buyer, automatically imports and applies a Genesis-bought identity, transforming the buyer's\nbrowser into a near-identical clone of the real user's browser.\n\n\n-----\n\nGenesis extension\n\n\nImage: ZDNet\nThe reason why a marketplace like Genesis has come to exist today is because in recent years, online services have improved their anti-fraud\nsystems, and are now capable of detecting abnormal account login activity by looking at more details, rather than only a user's username and\npassword.\n\nGenesis identities (also called masks or fingerprints) will allow a crook to look as close to the real account owner as possible, fooling some of\nthese modern anti-fraud systems, often deployed with online payment and e-banking services.\n\nIn an online ad found by ZDNet, Genesis' creators claim they \"reviewed top 47 analytical systems and 283 major banks and payment systems\"\nin order to determine what tracking and detection systems their cloned fingerprints needed to bypass.\n\n\n-----\n\nGenesis details\n\n\nImage: ZDNet\nKaspersky said today that Genesis has already entered the arsenal of some cyber-criminal gangs, and they are \"actively using such digital\ndoppelgangers to bypass advanced anti-fraud measures.\"\n\nExperts recommend that users enable multing-factor authentication for every online account that supports it, but also recommend that\ncompanies add support for additional user identification mechanisms, such as biometrics.\n\n**A basic guide to diving in to the dark web**\n\n## Related malware and cybercrime coverage:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-09 - Cybercrime market selling full digital fingerprints of over 60,000 users.pdf"
    ],
    "report_names": [
        "2019-04-09 - Cybercrime market selling full digital fingerprints of over 60,000 users.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535561,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1653691196,
    "ts_modification_date": 1653691196,
    "files": {
        "pdf": "https://archive.orkl.eu/8cfcab1fc8ea9ecf2d46da0b139ffd5d906f6543.pdf",
        "text": "https://archive.orkl.eu/8cfcab1fc8ea9ecf2d46da0b139ffd5d906f6543.txt",
        "img": "https://archive.orkl.eu/8cfcab1fc8ea9ecf2d46da0b139ffd5d906f6543.jpg"
    }
}