{
    "id": "737ea46b-f191-4264-976c-a7242b0c02fa",
    "created_at": "2023-01-12T15:00:10.346038Z",
    "updated_at": "2025-03-27T02:16:03.256113Z",
    "deleted_at": null,
    "sha1_hash": "e6b6d56413facc5e86dc3f8886310bdb69783f4d",
    "title": "2020-08-20 - Transparent Tribe- Evolution analysis, part 1",
    "authors": "",
    "file_creation_date": "2022-05-27T23:15:43Z",
    "file_modification_date": "2022-05-27T23:15:43Z",
    "file_size": 1371087,
    "plain_text": "# Transparent Tribe: Evolution analysis, part 1\n\n**securelist.com/transparent-tribe-part-1/98127/**\n\nAuthors\n\n[Giampaolo Dedola](https://securelist.com/author/giampaolodedola/)\n\n## Background and key findings\n\nTransparent Tribe, also known as PROJECTM and MYTHIC LEOPARD, is a highly prolific\ngroup whose activities can be traced as far back as 2013. Proofpoint published a very good\narticle about them in 2016, and since that day, we have kept an eye on the group. We have\nperiodically reported their activities through our APT threat intelligence reports, and\nsubscribers of that service already know that in the last four years, this APT group has never\ntaken time off. They continue to hit their targets, which typically are Indian military and\ngovernment personnel.\n\nThe TTPs have remained consistent over the years, and the group has constantly used\ncertain tools and created new programs for specific campaigns. Their favorite infection vector\nis malicious documents with an embedded macro, which seem to be generated with a\ncustom builder.\n\nTheir main malware is a custom .NET RAT publicly known as Crimson RAT, but over the\nyears, we also have observed the use of other custom .NET malware and a Python-based\nRAT known as Peppy.\n\n\n-----\n\nOver the past year, we have seen this group undergo an evolution, stepping up its activities,\nstarting massive infection campaigns, developing new tools and strengthening their focus on\nAfghanistan.\n\nThe summary of our recent investigations will be described in two blogposts. This first\npublication will cover the following key points:\n\nWe discovered the Crimson Server component, the C2 used by Transparent Tribe for\nmanaging infected machines and conducting espionage. This tool confirmed most of\nour observations on Crimson RAT and helped us to understand the attackers’\nperspective.\nTransparent Tribe continues to spread Crimson RAT, infecting a large number of\nvictims in multiple countries, mainly India and Afghanistan.\nThe USBWorm component is real, and it has been detected on hundreds of systems.\nThis is malware whose existence was already speculated about years ago, but as far\nas we know, it has never been publicly described.\n\nI will be talking more about the TransparentTribe and its tools on GReAT Ideas. Powered by\n[SAS webinar on August 26, you can register for it here: https://kas.pr/1gk9](https://kas.pr/1gk9)\n\n## Crimson Server\n\nCrimson is the main tool used by Transparent Tribe for their espionage activities. The tool is\ncomposed of various components, which are used by the attacker for performing multiple\nactivities on infected machines:\n\nmanage remote filesystems\nupload or download files\ncapture screenshots\nperform audio surveillance using microphones\nrecord video streams from webcam devices\ncapture screenshots\nsteal files from removable media\nexecute arbitrary commands\nrecord keystrokes\nsteal passwords saved in browsers\nspread across systems by infecting removable media\n\nIn the course of our analysis, we spotted a .NET file, identified by our products as Crimson\nRAT, but a closer look revealed that it was something different: a server-side implant used by\nthe attackers to manage the client components.\n\n\n-----\n\nWe found two different server versions, the one being a version that we named A, compiled\nin 2017, 2018 and 2019, and including a feature for installing the USBWorm component and\nexecuting commands on remote machines. The version that we named “B” was compiled in\n2018 and again at the end of 2019. The existence of two versions confirms that this software\nis still under development and the APT group is working to enhance it.\n\nBy analysing the .NET binary, we were able to set up a working environment and\ncommunicate with samples previously detected on victims’ machines.\n\n### Crimson Server version “A”\n\n**Main panel**\n\nThe first window is the main panel, which provides a list of infected machines and shows\nbasic information about the victims’ systems.\n\n**_Server main panel_**\n\nGeolocation information is retrieved from a legitimate website using a remote IP address as\nthe input. The URL used by the server is:\n\n_http://ip-api.com/xml/<ip>_\n\nAt the top, there is a toolbar that can be used for managing the server or starting some\nactions on the selected bot. At the bottom, there is an output console with a list of actions\nperformed by the server in the background. It will display, for example, information about\nreceived and sent commands.\n\nThe server uses an embedded configuration specified inside a class named “settings”.\n\n\n-----\n\n**_Example of embedded configuration_**\n\nThe class contains TCP port values, default file names and installation paths used by each\nmalware component. The server does not include any features to build the other\ncomponents; they need to be manually placed in specific predefined folders. For example,\nbased on the configuration displayed in the picture above, the “msclient” must be placed in\n“.\\tmps\\rfaiwaus.exe”.\n\nThis leads us to conclude that the resulting server file was generated by another builder,\nwhich created the executable files, directories and the other files used by the application.\n\n**Bot panel**\n\nThe main features are accessible from the “bot panel”, an interface with twelve tabs, which\ncan be used to manage a remote system and collect information.\n\n**Update module**\n\nThe first tab is used for checking the client configuration, uploading Crimson components\nand executing these on remote system.\n\n\n-----\n\n**_Update modules tab_**\n\nThe Crimson framework is composed of seven client components:\n\n**Thin Client -> a tiny version of the RAT used for recognizing the victim. The “thin” client is**\nthe most common one; it is usually dropped during the infection process by which\nTransparent Tribe is distributed and is most commonly found on OSINT resources. It\ncontains a limited number of features and can typically be used to:\n\ncollect information about infected system\ncollect screenshots\nmanage the remote filesystem\ndownload and upload files\nget a process list\nkill a process\nexecute a file\n\n**Main Client -> the full-featured RAT. It can handle all “Thin Client” features, but it can also be**\nused to:\n\ninstall the other malware components\ncapture webcam images\neavesdrop using a computer microphone\nsend messages to the victim\nexecute commands with COMSPEC and receive the output.\n\n**USB Driver -> a USB module component designed for stealing files from removable drives**\nattached to infected systems.\n\n\n-----\n\n**USB Worm -> this is the USBWorm component developed for stealing files from removable**\ndrives, spread across systems by infecting removable media, and download and execute the\n“Thin Client” component from a remote Crimson server.\n\n**Pass Logger -> a credential stealer, used for stealing credentials stored in the Chrome,**\nFirefox and Opera browsers.\n\n**KeyLogger -> this is simple malware used for recording keystrokes.**\n\n**Remover -> this cannot be pushed using the “Update module tab”, but it can be uploaded to**\nan infected machine automatically using the “Delete User” button. Unfortunately, we did not\nacquire that component and we cannot provide a description of it.\n\nInterestingly, Transparent Tribe tries to circumvent certain vendors’ security tools by\nconfiguring the Server to prevent installation of some of the malware components,\nspecifically the “USB Driver” and the “Pass Logger”, on systems protected with Kaspersky\nproducts. They also prevent installation of the “Pass Logger” on systems protected by ESET.\n\n**_Snippet of code that prevents installation of certain components on systems_**\n**_protected by Kaspersky products_**\n\n**File Manager & Auto Download tabs**\n\nThe file manager allows the attacker to explore the remote file system, execute programs,\ndownload, upload and delete files.\n\n\n-----\n\n**_File manager tab_**\n\nMost of the buttons are self-explanatory. The most interesting ones are “USB Drive” and\n“Delete USB”, used for accessing data stolen by the USB Driver and USB Worm components\nand the “Auto File Download” feature. This feature opens another window, which can also be\naccessed via the second last tab. It allows the attacker to configure the bot to search files,\nfilter results and upload multiple files.\n\n**_Auto download tab_**\n\n**Screen and Webcam monitoring tabs**\n\n**_Screen monitoring tab_** **_Webcam monitoring tab_**\n\n\n-----\n\nThese tabs are used for managing two simple and powerful features. The first one is\ndesigned for monitoring the remote screen and checking what the user is doing on their\nsystem. The second one can be used for spying on a remote webcam and performing video\nsurveillance. The attacker can retrieve a single screenshot or start a loop that forces the bot\nto continuously send screenshots to the server, generating a live stream of sorts. The\nattacker can also configure the RAT component to record the images on the remote system.\n\n**Other tabs**\n\nThe other tabs are used for managing the following features:\n\n_Audio surveillance: The malware uses the NAudio library to interact with the_\nmicrophone and manage the audio stream. The library is stored server-side and\npushed to the victim’s machine using a special command.\n_Send message: The attacker can send messages to victims. The bot will display the_\nmessages using a standard message box.\n_Keylogger: Collects keyboard data. The log includes the process name used by the_\nvictim, and keystrokes. The attacker can save the data or clear the remote cache.\n_Password Logger: The malware includes a feature to steal browser credentials. The_\ntheft is performed by a specific component that enumerates credentials saved in\nvarious browsers. For each entry, it saves the website URL, the username and the\npassword.\n_Process manager: The attacker can obtain a list of running processes and terminate_\nthese by using a specific button.\n_Command execution: This tab allows the attacker to execute arbitrary commands on_\nthe remote machine.\n\n### Crimson Server version “B”\n\nThe other version is quite similar to the previous one. Most noticeably, in this “B” version, the\ngraphical user interface is different.\n\n**_Main toolbar version B_**\n\n“Update USB Worm” is missing from the Update Bot tab, which means that the USB Worm\nfeature is not available in these versions.\n\n\n-----\n\n**_Update modules tab, version B_**\n\nThis version does not include the check that prevents installation of certain components on\nsystems protected with Kaspersky products, and the Command execution tab is missing. At\nthe same position, we find a different tab, used for saving comments about the infected\nmachine.\n\n**_Notes_**\n\n## USBWorm\n\nLast January, we started investigating an ongoing campaign launched by Transparent Tribe\nto distribute the Crimson malware. The attacks started with malicious Microsoft Office\ndocuments, which were sent to victims using spear-phishing emails.\n\n\n-----\n\n**_Decoy document used in an attack against Indian entities_**\n\nThe documents typically have malicious VBA code embedded, and sometimes protected\nwith a password, configured to drop an encoded ZIP file which contains a malicious payload.\n\n\n-----\n\n**_User form with encoded payloads_**\n\nThe macro drops the ZIP file into a new directory created under %ALLUSERPROFILE% and\nextracts the archive contents at the same location. The directory name can be different,\ndepending on the sample:\n\n%ALLUSERSPROFILE%\\Media-List\\tbvrarthsa.zip\n%ALLUSERSPROFILE%\\Media-List\\tbvrarthsa.exe\n\n\n-----\n\n**_Snippet of VBA code_**\n\nThe executable file is the Crimson “Thin Client”, which allows the attacker to gain basic\ninformation about the infected machine, collect screenshots, manipulate the file system and\ndownload or upload arbitrary files.\n\nDuring our analysis, we noticed an interesting sample connected to a Crimson C2 server.\nThis sample was related to multiple detections, all of these having different file names and\nmost of them generated from removable devices.\n\nOne of the file path name combinations observed was ‘C:\\ProgramData\\Dacr\\macrse.exe’,\nalso configured in a Crimson “Main Client” sample and used for saving the payload received\nfrom the C2 when invoking the usbwrm command.\n\n\n-----\n\n**_USBWorm file construction function_**\n\nWe concluded that this sample was the USBWorm component mentioned by Proofpoint in its\nanalysis of the malware.\n\nBased on previous research, we knew that this RAT was able to deploy a module to infect\nUSB devices, but as far as we know, it had never been publicly described.\n\n### USB Worm description\n\nOur analysis has revealed that USBWorm is much more than a USB infector. In fact, it can\nbe used by the attacker to:\n\ndownload and execute the Crimson “Thin Client”\ninfect removable devices with a copy of USBWorm itself\nsteal files of interest from removable devices (i.e. USB Stealer)\n\nBy default, the program behaves as a downloader, infector and USB stealer. Usually, the\ncomponent is installed by the Crimson “Main Client”, and when started, it checks if its\nexecution path is the one specified in the embedded configuration and if the system is\nalready infected with a Crimson client component. If these conditions are met, it will start to\nmonitor removable media, and for each of these, the malware will try to infect the device and\nsteal files of interest.\n\nThe infection procedure lists all directories. Then, for each directory, it creates a copy of itself\nin the drive root directory using the same directory name and changing the directory attribute\nto “hidden”. This results in all the actual directories being hidden and replaced with a copy of\nthe malware using the same directory name\n\n\n-----\n\nMoreover, USBWorm uses an icon that mimics a Windows directory, tricking the user into\nexecuting the malware when trying to access a directory.\n\n**_USBWorm icon_**\n\nThis simple trick works very well on default Microsoft Windows installations, where file\nextensions are hidden and hidden files are not visible. The victim will execute the worm\nevery time he tries to access a directory. Moreover, the malware does not delete the real\ndirectories and executes “explorer.exe” when started, providing the hidden directory path as\nargument. The command will open the Explorer window as expected by the user.\n\n\n**_View of infected removable media_**\n**_with default Windows settings_**\n\n\n**_View of infected removable media with_**\n**_visible hidden files and file extensions_**\n\n\nThe data theft procedure lists all files stored on the device and copies those with an\nextension matching a predefined list:\n\n_File extensions of interest: .pdf, .doc, .docx, .xls, .xlsx, .ppt, .pptx, .pps, .ppsx, .txt_\n\nIf the file is of interest, i.e. if the file extension is on the predefined list, the procedure checks\nif a file with the same name already has been stolen. The malware has a text file with a list of\nstolen files, which is stored in the malware directory under a name specified in the\nembedded configuration.\n\nOf course, this approach is a little buggy, because if the worm finds two different files with the\nsame name, it will steal only the first one. Anyway, if the file is of interest and is not on the list\nof stolen files, it will be copied from the USB to a local directory usually named “data” or\n“udata” although the name could be different\n\n\n-----\n\nIf the worm is executed from removable media, the behavior is different. In this case, it will\ncheck if the “Thin Client” or the “Main Client” is running on the system. If the system is not\ninfected, it will connect to a remote Crimson Server and try to use a specific “USBW”\ncommand to download and execute the “Thin Client” component.\n\n**_Snippet of code used to build USBW request_**\n\nThe persistence is guaranteed by a method that is called when the program is closing. It\nchecks if the malware directory exists as specified in an embedded configuration and then\ncopies the malware executable inside it. It also creates a registry key under\n“HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run” to execute the worm\nautomatically.\n\n### USB Worm distribution\n\nDuring our investigation, we found around two hundred distinct samples related to\nTransparent Tribe Crimson components. We used the Kaspersky Security Network (KSN) to\ncollect some statistics about the victims.\n\nConsidering all components detected between June 2019 and June 2020, we found more\nthan one thousand distinct victims distributed across twenty-seven countries.\n\n\n-----\n\n**_Crimson distribution map_**\n\nMost of the detections were related to the USB Worm components; and in most of the\ncountries, the number of events was very low.\n\n**_Crimson detections – USBWorm vs other components_**\n\nIf we check victims compromised with the other client components, we can find the real\ntargets.\n\n\n-----\n\n**_Top five infected countries from June 2019 to June 2020 – USBWorm excluded_**\n\nThe graph includes the highest number of distinct victims, and it shows that Transparent\nTribe maintained a strong focus on Afghanistan during the final part of 2019 and then started\nto focus again on Indian users during 2020.\n\nWe may speculate that detections in other countries may be related to entities related to\nmain targets, such as personnel of embassies.\n\n## Conclusions\n\nTransparent Tribe continues to show high activity against multiple targets. In the last twelve\nmonths, we observed a broad campaign against military and diplomatic targets, using\nextensive infrastructure to support their operations and continuous improvements in their\narsenal. The group continue to invest in their main RAT, Crimson, to perform intelligence\nactivities and spy on sensitive targets. We do not expect any slowdown from this group in the\nnear future and we will continue to monitor their activities.\n\n## IoC\n\nThe followings IOC list is not complete. If you want more information about the APT\ndiscussed here, as well as a full IOC list, and YARA rules are available to customers of\n[Kaspersky Threat Intelligence Reports. Contact: intelreports@kaspersky.com](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n\n5158C5C17862225A86C8A4F36F054AE2 – Excel document – NHQ_Notice_File.xls\nD2C407C07CB5DC103CD112804455C0DE – Zip archive – tbvrarthsa.zip\n76CA942050A9AA7E676A8D553AEB1F37 – Zip archive – ulhtagnias.zip\n\n\n-----\n\n08745568FE3BC42564A9FABD2A9D189F – Crimson Server Version A\n03DCD4A7B5FC1BAEE75F9421DC8D876F – Crimson Server Version “B”\n075A74BA1D3A5A693EE5E3DD931E1B56 – Crimson Keylogger\n1CD5C260ED50F402646F88C1414ADB16 – Crimson Keylogger\nCAC1FFC1A967CD428859BB8BE2E73C22 – Crimson Thin Client\nE7B32B1145EC9E2D55FDB1113F7EEE87 – Crimson Thin Client\nF5375CBC0E6E8BF10E1B8012E943FED5 – Crimson Main Client\n4B733E7A78EBD2F7E5306F39704A86FD – Crimson Main Client\n140D0169E302F5B5FB4BB3633D09B48F – Crimson USB Driver\n9DD4A62FE9513E925EF6B6D795B85806 – Crimson USB Driver\n1ED98F70F618097B06E6714269E2A76F – Crimson USB Worm\nF219B1CDE498F0A02315F69587960A18 – Crimson USB Worm\n\n64.188.25.206 – Crimson C2\n173.212.192.229 – Crimson C2\n45.77.246.69 – Crimson C2\nnewsbizupdates.net – Crimson C2\n173.249.22.30 – Crimson C2\nuronlinestores.net – Crimson C2\n\n[APT](https://securelist.com/tag/apt/)\n[Keyloggers](https://securelist.com/tag/keyloggers/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Statistics](https://securelist.com/tag/malware-statistics/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[RAT Trojan](https://securelist.com/tag/rat-trojan/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Transparent Tribe](https://securelist.com/tag/transparent-tribe/)\n[Worm](https://securelist.com/tag/worm/)\n\nAuthors\n\n[Giampaolo Dedola](https://securelist.com/author/giampaolodedola/)\n\nTransparent Tribe: Evolution analysis, part 1\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-20 - Transparent Tribe- Evolution analysis, part 1.pdf"
    ],
    "report_names": [
        "2020-08-20 - Transparent Tribe- Evolution analysis, part 1.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535610,
    "ts_updated_at": 1743041763,
    "ts_creation_date": 1653693343,
    "ts_modification_date": 1653693343,
    "files": {
        "pdf": "https://archive.orkl.eu/e6b6d56413facc5e86dc3f8886310bdb69783f4d.pdf",
        "text": "https://archive.orkl.eu/e6b6d56413facc5e86dc3f8886310bdb69783f4d.txt",
        "img": "https://archive.orkl.eu/e6b6d56413facc5e86dc3f8886310bdb69783f4d.jpg"
    }
}