{
    "id": "73a4edcd-17d4-4f30-b342-37ad6cbff960",
    "created_at": "2023-01-12T15:09:37.283618Z",
    "updated_at": "2025-03-27T02:05:43.252316Z",
    "deleted_at": null,
    "sha1_hash": "077ec18a7fe2381563259e27c1c7a5540bb268db",
    "title": "2016-10-25 - Houdini’s Magic Reappearance",
    "authors": "",
    "file_creation_date": "2022-05-28T03:45:45Z",
    "file_modification_date": "2022-05-28T03:45:45Z",
    "file_size": 2027936,
    "plain_text": "# Houdini’s Magic Reappearance\n\n**[researchcenter.paloaltonetworks.com/2016/10/unit42-houdinis-magic-reappearance/](http://researchcenter.paloaltonetworks.com/2016/10/unit42-houdinis-magic-reappearance/?adbsc=social67221546&adbid=790972447373668352&adbpl=tw&adbpr=4487645412)**\n\nAnthony Kasza October 25, 2016\n\nBy [Anthony Kasza](https://unit42.paloaltonetworks.com/author/anthony-kasza/)\n\nOctober 25, 2016 at 9:29 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Houdini,](https://unit42.paloaltonetworks.com/tag/houdini/) [Hworm,](https://unit42.paloaltonetworks.com/tag/hworm/) [Malcode,](https://unit42.paloaltonetworks.com/tag/malcode/) [Middle East,](https://unit42.paloaltonetworks.com/tag/middle-east/) [threat research](https://unit42.paloaltonetworks.com/tag/threat-research/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-houdinis-magic-reappearance/)\n\nUnit 42 has observed a new version of Hworm (or Houdini) being used within multiple\nattacks. This blog outlines technical details of this new Hworm version and documents an\nattack campaign making use of the backdoor. Of the samples used in this attack, the first we\nobserved were June 2016, while as-of publication we were still seeing attacks as recently as\nmid-October, suggesting that this is likely an active, ongoing campaign.\n\n## Deconstructing the Threats:\n\n[The investigation into this malware began while searching through WildFire execution reports](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/wildfire)\nwithin [AutoFocus. Looking for newly submitted malicious samples with no family label, a](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/autofocus)\nunique mutex surfaced, “RCSTEST”. Pivoting around the creation of this mutex, as well as\n\n\n-----\n\nother dynamic behaviors, a group of samples slowly began to emerge. The group of samples\nhas common delivery mechanisms, lures and decoy file themes, payloads (Hworm), as well\nas control infrastructure.\n\nSamples from this attack came in the form of SFX files. The original filenames of these\ndelivery files are related to political figures and groups in the Middle East and the\nMediterranean. They include:\n\nMohamed Dahlan Abu Dhabi Meeting.exe\nﻓﻀﯿﺤﺔ ﻣﻦ اﻟﻌﯿﺎر اﻟﺜﻘﯿﻞ اردوﻏﺎن ﯾﺸﺮب اﻟﺨﻤﺮ.exe\nﺻﺮاﻋﺎت داﺧﻠﯿﺔ ﻓﻲ ﺻﻔﻮف اﻻﺧﻮان اﻟﻤﺴﻠﻤﯿﻦ.exe\nﻋﻤﻠﯿﺔ اﻏﺘﯿﺎل اﻟﺪﻛﺘﻮر ﻣﺤﻤﺪ ﻛﻤﺎل.scr\nاﻟﻤﻠﻚ ﻋﺒﺪ اﷲ ﯾﻬﺪد دول اﻟﺨﻠﯿﺞ وﯾﺘﻮﻋﺪ دﺣﻼن.exe\nﺑﺎﻟﻔﯿﺪﯾﻮ اﻣﯿﺮ ﺳﻌﻮدي ﯾﻬﯿﻦ ﻣﻮاﻃﻨﯿﻦ ﻋﻠﻰ اﻟﻬﻮاء.scr\n\nWhen executed each SFX file opens a decoy document, video, or URL, and eventually\nexecutes an Hworm payload in the background. The decoy files are similarly themed when\ncompared to the above delivery file names. Figure 1 shows a screenshot from a video one\nsample opens as a decoy.\n\n\n-----\n\n_Figure 1 Decoy video_\n\nAnother sample displays a YouTube video by dropping a .url shortcut and opening it using\nthe system’s default web browser. Figure 2 illustrates the .url file contents:\n\n_Figure 2 .url file_\n\n\n-----\n\nWhen the .url file is opened, the above YouTube video is displayed as a decoy. It is unclear\nat this time if the uploader of this video has any relation to this particular attack\n\nBesides decoys, the samples also execute Hworm payloads, all of which are packed. Each\nHworm payload created a unique mutex (while some SFX files delivered the same Hworm\npayload). All of the samples beaconed to one of three network locations as shown in Figure\n3:\n\n\n-----\n\n_Figure 3 C2 Infrastructure_\n\n[While prior reports on Hworm have been published, we were unable to identify any report](https://www.fireeye.com/blog/threat-research/2013/09/now-you-see-me-h-worm-by-houdini.html)\ndetailing this particular version of Hworm. Some previous versions would embed AutoIT\nscripts in resource sections of PE files while others would execute obfuscated VBS scripts.\nSome previous versions of the Hworm implant would embed data in the headers of HTTP\nrequests or POST bodies as a method of command and control. Beacons of that HTTP\nprotocol example are easily recognized by the use of ‘<|>’ as a delimiter and the URI of the\nrequest. This new version of Hworm uses a mixed binary and ASCII protocol over TCP.\nFigure 4 is a packet capture of the protocol used by Hworm samples in this attack. It includes\nthe string “new_houdini”, the mutex used by the implant, the name of the user, the operating\nsystem version, the version of the implant, and the name of the foreground process:\n\n\n-----\n\n_Figure 4 Packet capture of new communications protocol_\n\nDuring the investigation of this malware a forum post on dev-point[.]com, an Arabic speaking\ntechnology and security forum, by a user with the handle “Houdini”, outlined plans for a\nrewrite of a backdoor in Delphi. This post occurred around July 2015.\n\nAround October 2015, a password protected beta version of the builder used to create\nDelphi Hworm implants\n(a4c71f862757e3535b305a14ff9f268e6cf196b2e54b426f25fa65bf658a9242) was uploaded\nto VirusTotal. Unfortunately, the builder used to create the samples outlined in the above\nattack was not located. Unit 42 believes the samples used in the above attack are a version\nwhich were released after the beta.\n\n## Analyzing the Hworm Malcode:\n\nUpon configuring and building a server, the builder prompts the user to save a VBS file and\nmodifies a stub file to create the implant. The VBS file is used to load and inject the implant.\nIt appears that the operators behind the above attack either chose to not use the VBS loader\nor the newer versions of the builder no longer produce a VBS script.\n\n**The VBS Loader:**\n\n\n-----\n\n[The script contains three files encoded in base64. The first file is DynamicWrapperX](http://www.script-coding.com/dynwrapx_eng.html)\n(DCOM_DATA), the second file is the RunPE shellcode (LOADER_DATA), and the third file\nis the file which gets injected into host process (FILE_DATA). DynamicWrapperX provides\naccess to all Windows APIs from a Visual Basic Script providing a wide range of functionality\nto this VBS script.\n\nThe configuration of the script is at the beginning of the file (Figure 5).\n\n_Figure 5 Script configuration section_\n\nIn the above example, the script will use the registry as a startup method, it will drop itself\ninto the system’s %appdata% directory using the filename myhworm.exe and it will inject\nitself into svchost.exe.\n\nAs the script executes it first adds one of three startup methods which will execute the script\non Windows startup:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n\nRegistry Run in HKCU\n\nPath: HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\nEntryData Wscript.exe //b //e:vbscript <filepath>\n/b Specifies batch mode, which does not display alerts, scripting errors, or\ninput prompts.\n/e Specifies the engine that is used to run the script.\nDefine startup directory\nStartup task (not implemented yet)\n\n\n-----\n\nFollowing the installation of persistence, the script checks if the current environment is\nWOW64. If so, the script will execute:\n\n1 %windir%\\syswow64\\wscript.exe /b /e:vbscript <filepath>\n\nThe script then drops DynamicWrapperX in the configured installation directory with file\nextension “.bin”.\n\n1 <installdir>\\<filename>.bin\n\nIt will then register DynamicWrapperX:\n\n1 regsvr32.exe /I /S <filename_dynamic_wrapperx>\n\nNext, the script will load the registered object:\n\n1 “set DCOM = CreateObject(\"DYNAMICWRAPPERX\")”\n\nIt registers /load VirtualAlloc and CallWindowProcW as functions which can be directly called\nin the script using “dcom.VirtualAlloc <arguments>”.\n\nUsing VirtualAlloc it will allocate new memory and copy RunPE shellcode (LOADER_DATA,\nloader.hex) and the to-be-injected binary (FILE_DATA) into memory.\n\nUsing CallWindowProcW the script will jump to the RunPE shellcode and the shellcode will\ninject the file (FILE_DATA) into the host process. The host process is by default svchost.exe\nbut for .NET files injection can occur into the file:\n\n1 %windir%\\Microsoft.Net\\Framework\\v2.0.50727\\msbuild.exe\n\nFigure 6 shows the main routine of the script:\n\n\n-----\n\n_Figure 6 Main routine_\n\nFigure 7shows a hex dump of LOADER_DATA (RunPE shellcode):\n\n\n-----\n\n_Figure 7 Hex dump of LOADER_DATA_\n\nSimilarities in comments and coding styles between previous versions of the Hworm VBS\nscript and the VBS script provided in this beta builder can be seen in Figure 1. Top is the\nVBS file from the HTTP version of Hworm, compared with the VBS script produced by the\nbeta builder of Hworm (below).\n\n\n-----\n\n-----\n\n_Figure 8 Similarities between HWorm versions_\n\n**The Beta Server:**\n\nThe main server which the builder produces is developed in Delphi and is not encrypted. Unit\n42 has seen variants packed with VMProtect and ASPack. In some versions of the Delphi\nHworm implants discovered (unpacked beta versions) the settings are stored in the resource\nsection RCData\\“CONFIG” and are in clear text (Figure 9).\n\n\n-----\n\n_Figure 9 Settings_\n\nSome versions also have an unfinished PE spreader in the resource section\n(a65fd78951590833904bd27783b1032b7cc575220a12c6d6f44cb09061999af3). The\nspreader will terminate all running processes named “sm?rtp.exe” and execute a VBS file\nusing wscript.exe:\n\n1 “wscript.exe /e:vbscript <current directory>\\$RECYCLE.BIN\\u vbs name here”.\n\n_Figure 10 Spreader_\n\n\n-----\n\nThe server exports some unused functions (they all just have RET instruction). We have\nseen “wrom.exe” and “server.exe” used as the name in the export table (Figure 11).\n\n_Figure 11 Export table_\n\nThe author used the open source library Indy Components for network communication. They\nalso used BTMemoryModule to load DLLs from memory (without saving it on the disc).\n\nThe Hworm implants use a connect-back communication. This means the server (implant)\nconnects back to the client (remotely controlling system). It also has some modules\nimplemented in the server and each module uses its own socket for communication (on the\nsame port defined in the configuration).\n\nThe following modules provide features of this malware:\n\n**Screenshot: Provides the ability to capture screenshots in JPEG/BMP formats**\n**Keylogger: Provides the ability to log key strokes**\n**Internet IO: Provides the ability to download and execute files from the internet. It also**\nprovides the ability to load the executables via the RunPE technique\n**File Manager: Provides the ability to list files and directories, delete, rename, and**\nexecute files, and upload or download files via TCP or HTTP\n**Password: Provides the ability to steal passwords from Firefox, Opera, and Chrome**\nbrowsers\n**Misc: Provides the ability to list processes or modules and kill running processes**\n**USB Notifier: Provides the ability to notify the controller when a USB device is**\nattached\n\n\n-----\n\n**Houdini Client: Provides the main client, which contains the server s configuration.**\n\n## Final Thoughts:\n\nThe similarities in coding styles and features of the server, as well as languages and handles\nused by the author of the malware, lead us to believe the beta builder is a version of Hworm\nwhich was created somewhere between the HTTP version and the version used in the above\noutlined attack.\n\nAs this RAT can be found online in semi-public locations it is possible the malware is used by\nboth surgical threat actors as well as within casual compromises. The above attack is only\none such campaign Unit 42 has discovered using the Delphi versions of Hworm.\n\nPalo Alto Networks customers can use AutoFocus to find all versions of Hworm samples\nusing the “Hworm” tag.\n\n## Indicators:\n\n**Delphi Hworm Beta Builder**\n\na4c71f862757e3535b305a14ff9f268e6cf196b2e54b426f25fa65bf658a9242\n\n**Delivery Files**\n\n70c55fef53fd4bdeb135ed68a7eead45e8d4ba7d17e0fd907e9770b2793b60ed\n\n9af85e46344dadf1467c71d66865c7af98a23151025e7d8993bd9afc5150ad7d\n\n773716bc2d313e17326471289a0b552f90086a2687fa958ef8cdb611cbc9a8c9\n\ne0db0982c437c40ceb67970e0a776e9448f428e919200b5f7a0566c58680070c\n\n1f45e5eca8f8882481b13fd4a67ffa88a1aa4d6e875a9c2e1fbf0b80e92d9588\n\n5e42e61340942fc0c46a6668a7f54adbbb4792b01c819bcd3047e855116ae16f\n\nfec925721b6563fec32d7a4cf8df777c647f0e24454fa783569f65cdadff9e03\n\n106934ff7f6f93a371a4561fff23d69e6783512c38126fbd427ed4a886ca6e65\n\nba739f3f415efe005fbed6fcfcb1e6d3b3ae64e9a8d2b0566ab913f73530887c\n\n0672e47513aefcbc3f7a9bd50849acf507a5454bc8c36580304105479c58772a\n\n**Payloads**\n\n386057a265619c43ef245857b66241a66822061ce9bd047556c4f3f1d262ef36\n\n44b52baf2ecef2f928a13b17ba3a5552c32ca4a640e6421b8bc35ef5a113801b\n\n8428857b0c7dfe43cf2182dd585dfdfd845697a11c31e91d909dc400222b4f78\n\nd69e0456ddb11b979bf303b8bb9f87322bd2a9542dd9d9f716100c40bd6decd1\n\nbd5d64234e1ac87955f1d86ee1af34bd8fd11e8edf3a449181234bb62816acab\n\n774501f3c88ebdd409ec318d08af2350ec37fdbc11f32681f855e215e75440d7\n\nc66b9e8aaa2ac4ce5b53b45ebb661ba7946f5b82e75865ae9e98510caff911a7\n\n**Decoy files**\n\n7916ca6ae6fdbfb45448f6dcff374d072d988d11aa15247a88167bf973ee2c0d\n\n947d264a413f3353c43dafa0fd918bec75e8752a953b50843bc8134286d6f93f\n\n\n-----\n\n9ddf2f2e6ac7da61c04c03f3f27af12cb85e096746f120235724a4ed93fac5aa\n3d287cce7fe1caa5c033a4e6b94680c90a25cb3866837266130ba0fd8fab562c\n444b82caf3c17ea74034c984aeca0f5b2e6547af88a0fb15953f2d5b80e3b448\n3d3db84b6ad760540f638713e3f6a8daf8a226bd045351bcc72c6d22a7df8b3a\nfffda1e2d794a5645f973900083a88ef38c3d20a89c5e59ca21412806db28197\n\n**Command and Control Network Locations**\nstart.loginto[.]me\nsamah.sytes[.]net\n52.42.161[.]75\n78.47.96[.]17\n136.243.104[.]200\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-10-25 - Houdini’s Magic Reappearance.pdf"
    ],
    "report_names": [
        "2016-10-25 - Houdini’s Magic Reappearance.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536177,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653709545,
    "ts_modification_date": 1653709545,
    "files": {
        "pdf": "https://archive.orkl.eu/077ec18a7fe2381563259e27c1c7a5540bb268db.pdf",
        "text": "https://archive.orkl.eu/077ec18a7fe2381563259e27c1c7a5540bb268db.txt",
        "img": "https://archive.orkl.eu/077ec18a7fe2381563259e27c1c7a5540bb268db.jpg"
    }
}