{
    "id": "73e81fe1-516d-4e9a-a025-2c59d8389945",
    "created_at": "2023-01-12T15:02:48.161199Z",
    "updated_at": "2025-03-27T02:16:30.204803Z",
    "deleted_at": null,
    "sha1_hash": "451fb6f8eebabe10244732a506a36d3c538c6fb9",
    "title": "2020-06-18 - Inside Microsoft Threat Protection- Mapping attack chains from cloud to endpoint (APT33-HOLMIUM)",
    "authors": "",
    "file_creation_date": "2022-05-28T22:05:08Z",
    "file_modification_date": "2022-05-28T22:05:08Z",
    "file_size": 2329069,
    "plain_text": "# Inside Microsoft 365 Defender: Mapping attack chains from cloud to endpoint\n\n**microsoft.com/security/blog/2020/06/18/inside-microsoft-threat-protection-mapping-attack-chains-from-cloud-to-**\nendpoint/\n\nJune 18, 2020\n\nThe increasing pervasiveness of cloud services in today’s work environments, accelerated by\na crisis that forced companies around the globe to shift to remote work, is significantly\nchanging how defenders must monitor and protect organizations. Corporate data is spread\nacross multiple applications—on-premises and in the cloud—and accessed by users from\nanywhere using any device. With traditional surfaces expanding and network perimeters\ndisappearing, novel attack scenarios and techniques are introduced.\n\nEvery day, we see attackers mount an offensive against target organizations through the\ncloud and various other attack vectors with the goal of finding the path of least resistance,\nquickly expanding foothold, and gaining control of valuable information and assets. To help\norganizations fend off these advanced attacks, [Microsoft 365 Defender (previously Microsoft](https://www.microsoft.com/en-us/security/business/threat-protection/microsoft-365-defender)\nThreat Protection) leverages the Microsoft 365 security portfolio to automatically analyze\ncross-domain threat data, building a complete picture of each attack in a single dashboard.\nWith this breadth and depth of clarity, defenders can focus on critical threats and hunting for\nsophisticated breaches across endpoints, email, identities and applications.\n\nAmong the wide range of actors that Microsoft tracks—from digital crime groups to nationstate activity groups—HOLMIUM is one of the most proficient in using cloud-based attack\nvectors. Attributed to a Middle East-based group and active since at least 2015, HOLMIUM\n\n\n-----\n\nhas been performing espionage and destructive attacks targeting aerospace, defense,\nchemical, mining, and petrochemical-mining industries. HOLMIUM’s activities and techniques\noverlap with what other researchers and vendors refer to as APT33, StoneDrill, and Elfin.\n\nHOLMIUM has been observed using various vectors for initial access, including spear[phishing email, sometimes carrying archive attachments that exploit the CVE-2018-20250](https://nvd.nist.gov/vuln/detail/CVE-2018-20250)\nvulnerability in WinRAR, and password-spraying. Many of their recent attacks, however,\n[have involved the penetration testing tool Ruler used in tandem with compromised Exchange](https://github.com/sensepost/ruler)\ncredentials.\n\n[The group used Ruler to configure a specially crafted Outlook Home Page URL to exploit the](https://sensepost.com/blog/2017/outlook-home-page-another-ruler-vector/)\n[security bypass vulnerability CVE-2017-11774, which was fixed shortly after it was](https://nvd.nist.gov/vuln/detail/CVE-2017-11774)\ndiscovered. Successful exploitation automatically triggered remote code execution of a script\nwhen an Outlook client synced with a mailbox and rendered the profile Home Page URL.\nThese scripts, usually VBScript followed by PowerShell, in turn initiated the delivery of\nvarious payloads.\n\nIn this blog, the first in the Inside Microsoft 365 Defender series, we will show how Microsoft\n365 Defender provides unparalleled end-to-end visibility into the activities of nation-state\nlevel attacks like HOLMIUM. In succeeding blog posts in this series, we will shine a spotlight\non aspects of the coordinated defense delivered by Microsoft 365 Defender.\n\n## Tracing an end-to-end cloud-based HOLMIUM attack\n\nHOLMIUM has likely been running cloud-based attacks with Ruler since 2018, but a notable\nwave of such attacks was observed in the first half of 2019. These attacks combined the\noutcome of continuous password spray activities against multiple organizations, followed by\nsuccessful compromise of Office 365 accounts and the use of Ruler in short sequences to\ngain control of endpoints. This wave of attacks was the subject of a warning from US\nCybercom in July 2019.\n\nThese HOLMIUM attacks typically started with intensive password spray against exposed\n[Active Directory Federation Services (ADFS) infrastructure; organizations that were not using](https://docs.microsoft.com/windows-server/identity/active-directory-federation-services)\nmulti-factor authentication (MFA) for Office 365 accounts had a higher risk of having\naccounts compromised through password spray. After successfully identifying a few user and\npassword combinations via password spray, HOLMIUM used virtual private network (VPN)\nservices with IP addresses associated with multiple countries to validate that the\ncompromised accounts also had access to Office 365.\n\n\n-----\n\n_Figure 1. Password spray and compromised account sign-ins by HOLMIUM as detected in_\n_Microsoft Defender for Identity (previously Azure Advanced Threat Protection) and Microsoft_\n_Defender for Cloud Apps (previously Microsoft Cloud App Security)_\n\nArmed with a few compromised Office 365 accounts and not blocked by MFA defense, the\ngroup launched the next step with Ruler and configured a malicious Home Page URL which,\nonce rendered during a normal email session, resulted in the remote code execution of a\n[PowerShell backdoor through the exploitation of a vulnerability like CVE-2017-11774. The](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2017-11774)\ntwo domains abused by HOLMIUM and observed during this 2019 campaign were\n“topaudiobook.net” and “customermgmt.net”.\n\n_Figure 2. Exploitation of Outlook Home Page feature using Ruler-like tools_\n\n\n-----\n\n_Figure 3. Weaponized home page and initial PowerShell payload_\n\nThis initial foothold allowed HOLMIUM to run their custom PowerShell backdoor (known as\n[POWERTON) directly from an Outlook process and to perform the installation of additional](https://attack.mitre.org/software/S0371/)\npayloads on the endpoint with different persistence mechanisms, such as WMI subscription\n(T1084) or [registry autorun keys (T1060). Once the group has taken control of the endpoint](https://attack.mitre.org/techniques/T1060/)\n(in addition to the cloud identity), the next phase was hours of exploration of the victim’s\nnetwork, enumerating user accounts and machines for additional compromise, and lateral\nmovement within the perimeter. HOLMIUM attacks typically took less than a week from initial\naccess via the cloud to obtaining unhampered access and full domain compromise, which\nthen allowed the attackers to stay persistent for long periods of time, sometimes for months\non end.\n\n\n-----\n\n_Figure 4. Snippets of HOLMIUM PowerShell backdoor (POWERTON) implementing two_\n_different persistence mechanisms: WMI event subscription (T1084) and Registry run keys or_\n_Startup folder (T1060)_\n\n## HOLMIUM attacks as seen and acted upon by Microsoft 365 Defender\n\nHOLMIUM attacks demonstrate how hybrid attacks that span from cloud to endpoints require\na wide range of sensors for comprehensive visibility. Enabling organizations to detect attacks\nlike these by correlating events in multiple domains – cloud, identity, endpoints – is the\nreason why we build products like Microsoft 365 Defender. As we described in our analysis\n\n\n-----\n\nof HOLMIUM attacks, the group compromised identities in the cloud and leveraged cloud\nAPIs to gain code execution or persist. The attackers then used a cloud email configuration\nto run specially crafted PowerShell on endpoints every time the Outlook process is opened.\n\nDuring these attacks, many target organizations reacted too late in the attack chain—when\nthe malicious activities started manifesting on endpoints via the PowerShell commands and\nsubsequent lateral movement behavior. The earlier attack stages like cloud events and\npassword spray activities were oftentimes missed or sometimes not linked with activities\nobserved on the endpoint. This resulted in gaps in visibility and, subsequently, incomplete\nremediation.\n\nWhile it’s relatively easy to remediate and stop malicious processes and downloaded\nmalware on endpoints using endpoint security solutions, such a conventional approach\nwould mean that the attack is persistent in the cloud, so the endpoint could be immediately\ncompromised again. Remediating identities in the cloud is a different story.\n\n_Figure 5. The typical timeline of a HOLMIUM attack kill-chain_\n\nIn an organization utilizing Microsoft 365 Defender, multiple expert systems that monitor\nvarious aspects of the network would detect and raise alerts on HOLMIUM’s activities.\nMicrosoft 365 Defender sees the full attack chain across domains beyond simply blocking on\nendpoints or zapping emails, thus putting organizations in a superior position to fight the\nthreat.\n\n\n-----\n\n_Figure 6. Microsoft 365 Defender components able to prevent or detect HOLMIUM_\n_techniques across the kill chain._\n\nThese systems work in unison to prevent attacks or detect, block, and remediate malicious\nactivities. Across affected domains, Microsoft 365 Defender detects signs of HOLMIUM’s\nattacks:\n\nMicrosoft Defender for Identity (previously Azure Advanced Threat Protection) identifies\naccount enumeration and brute force attacks\nMicrosoft Defender for Cloud Apps (previously Microsoft Cloud App Security) detects\nanomalous Office 365 sign-ins that use potentially compromised credentials or from\nsuspicious locations or networks\nMicrosoft Defender for Endpoint (previously Microsoft Defender Advanced Threat\nProtection) exposes malicious PowerShell executions on endpoints triggered from\nOutlook Home Page exploitation\n\n\n-----\n\n_Figure 7. Activities detected across affected domains by different Microsoft 365 Defender_\n_expert systems_\n\nTraditionally, these detections would each be surfaced in its own portal, alerting on pieces of\nthe attack but requiring the security team to stitch together the full picture. With Microsoft 365\nDefender, the pieces of the puzzle are fused automatically through deep threat investigation.\n[Microsoft 365 Defender generates a combined incident view that shows the end-to-end](https://docs.microsoft.com/en-us/microsoft-365/security/mtp/incidents-overview?view=o365-worldwide)\nattack, with all related evidence and affected assets in one view.\n\n\n-----\n\n_Figure 8. The Microsoft 365 Defender incident brings together in one view the entire end-to-_\n_end attack across domain boundaries_\n\nUnderstanding the full attack chain enables Microsoft 365 Defender to automatically\nintervene to block the attack and remediate assets holistically across domains. In HOLMIUM\nattacks, Microsoft 365 Defender not only stops the PowerShell activity on endpoints but also\ncontains the impact of stolen user accounts by marking them as compromised in Azure AD.\nThis invokes [Conditional Access as configured in Azure AD and applies conditions like MFA](https://docs.microsoft.com/azure/active-directory/conditional-access/overview)\nor limitations on the user account’s permissions to access organizational resources until the\naccount is remediated fully.\n\n_Figure 9. Coordinated automatic containment and remediation across email, identity, and_\n_endpoints_\n\nSecurity teams can dig deep and expand their investigation into the incident in Microsoft 365\nSecurity Center, where all details and related activities are available in one place.\nFurthermore, security teams can hunt for more malicious activities and artifacts through\n[advanced hunting, which brings together all the raw data collected across product domains](https://docs.microsoft.com/microsoft-365/security/mtp/advanced-hunting-overview)\ninto one unified schema with powerful query constructs.\n\n\n-----\n\n_Figure 10. Hunting for activities across email, identity, endpoint and cloud applications_\n\nFinally, when the attack is blocked and all affected assets are remediated, Microsoft 365\nDefender helps organizations identify improvements to their security configuration that would\nprevent the attacker from returning. The Threat Analytics report provides an exposure view\nand recommends prevention measures relevant to the threat. For example, the Analytics\nReport for HOLMIUM recommended, among other things, applying the appropriate security\nupdates to prevent tools like Ruler from operating, as well as completely eliminating this\nattack vector in the organization.\n\n\n-----\n\n_Figure 11. Threat Analytics provides organizational exposure and recommended mitigations_\n_for HOLMIUM_\n\n## Microsoft 365 Defender: Stop attacks with automated cross-domain security\n\nMicrosoft 365 Defender harnesses the power of Microsoft 365 security products to deliver\nunparalleled coordinated defense that detects, correlates, blocks, remediates, and prevents\n[attacks across an organization’s Microsoft 365 environment. Existing Microsoft 365 licenses](https://docs.microsoft.com/en-us/microsoft-365/security/mtp/prerequisites?view=o365-worldwide)\nprovide access to Microsoft 365 Defender features in Microsoft 365 security center without\nadditional cost. To start using Microsoft 365 Defender, go to [security.microsoft.com.](https://security.microsoft.com/)\n\nLearn how Microsoft 365 Defender can help your organization to stop attacks with\ncoordinated defense. Read these blog posts in the Inside Microsoft 365 Defender series:\n\n## Talk to us\n\nQuestions, concerns, or insights on this story? Join discussions at the Microsoft 365\nDefender tech community.\n\n[Read all Microsoft security intelligence blog posts.](https://www.microsoft.com/security/blog/microsoft-security-intelligence/)\n\nFollow us on Twitter **[@MsftSecIntel.](https://twitter.com/MsftSecIntel)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-18 - Inside Microsoft Threat Protection- Mapping attack chains from cloud to endpoint (APT33-HOLMIUM).pdf"
    ],
    "report_names": [
        "2020-06-18 - Inside Microsoft Threat Protection- Mapping attack chains from cloud to endpoint (APT33-HOLMIUM).pdf"
    ],
    "threat_actors": [
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535768,
    "ts_updated_at": 1743041790,
    "ts_creation_date": 1653775508,
    "ts_modification_date": 1653775508,
    "files": {
        "pdf": "https://archive.orkl.eu/451fb6f8eebabe10244732a506a36d3c538c6fb9.pdf",
        "text": "https://archive.orkl.eu/451fb6f8eebabe10244732a506a36d3c538c6fb9.txt",
        "img": "https://archive.orkl.eu/451fb6f8eebabe10244732a506a36d3c538c6fb9.jpg"
    }
}