{
    "id": "745ae4ef-1d50-4a97-a77b-febfce75153b",
    "created_at": "2023-01-12T14:59:17.624797Z",
    "updated_at": "2025-03-27T02:05:23.613857Z",
    "deleted_at": null,
    "sha1_hash": "45c722856683042da7145203bd1febbd88c8f6b3",
    "title": "2020-02-10 - KBOT- sometimes they come back",
    "authors": "",
    "file_creation_date": "2022-05-28T15:29:25Z",
    "file_modification_date": "2022-05-28T15:29:25Z",
    "file_size": 1382114,
    "plain_text": "# KBOT: sometimes they come back\n\n**securelist.com/kbot-sometimes-they-come-back/96157/**\n\nAuthors\n\nAnna Malina\n\nAlthough by force of habit many still refer to any malware as a virus, this once extremely common\nclass of threats is gradually becoming a thing of the past. However, there are some interesting\nexceptions to this trend: we recently discovered malware that spread through injecting malicious\ncode into Windows executable files; in other words, a virus. It is the first “living” virus in recent\nyears that we have spotted in the wild.\n\nWe named it KBOT, and Kaspersky solutions detect the malware and its components as\nVirus.Win32.Kpot.a, Virus.Win64.Kpot.a, Virus.Win32.Kpot.b, Virus.Win64.Kpot.b, and TrojanPSW.Win32.Coins.nav.\n\n## What does KBOT do\n\nKBOT penetrates users’ computers via the Internet or a local network, or from infected external\nmedia. After the infected file is launched, the malware gains a foothold in the system, writing itself\nto Startup and the Task Scheduler, and then deploys web injects to try to steal the victim’s bank\nand personal data. For the same purpose, KBOT can download additional stealer modules that\nharvest and send to the C&C server almost full information about the user: passwords/logins,\n\n\n-----\n\ncryptowallet data, lists of files and installed applications, and so on. The malware stores all its files\nand collected data in a virtual file system encrypted using the RC6 algorithm, making it hard to\ndetect.\n\n_Number of Virus.Win32.Kpot detections, March — December 2019_\n\n## Infection methods\n\nKBOT infects all EXE files on connected logical drives (HDD partitions, external media, network\ndrives) and in shared network folders by adding polymorphic malicious code to the file body. To do\nso, the malware listens to the connection events of local and network logical drives using the\n**IID_IwbemObjectSink interface and a query of type SELECT * FROM __InstanceCreationEvent**\n**WITHIN 1 WHERE TargetInstance ISA ‘Win32_LogicalDisk, and overrides the Indicate function**\nof the IWbemObjectSink interface, where for each drive it performs recursive scanning of\ndirectories and infects EXE files.\n\nThe malware retrieves paths to shared network resources using the API functions\n**NetServerEnum and NetShareEnum, before scanning directories and infecting executable EXE**\nfiles:\n\n\n-----\n\nLike many other viruses, KBOT patches the entry point code, where the switch to the polymorphic\ncode added to the start of the code section is implemented. As a result, the original code of the\nentry point and the start of the code section are not saved. Consequently, the original functionality\nof the infected file is not retained.\n\n_Virus code at the entry point_\n\nThe jmp command makes the switch to the polymorphic code:\n\n\n-----\n\nThe virus also adds encrypted data to the end of one of the following sections: .rsrc, .data, .rdata.\nData located after the selected section is shifted. At the same time, the parameters of the\nrelocation table directory, resources directory, imports directory, parameters of sections, and other\nPE file parameters are modified accordingly. The encrypted data contains the body of the main\nmalware module (DLL library), as well as code for decrypting, loading into memory, and running\nthis library. The data is encrypted using the XOR method, plus the library is additionally encrypted\nwith the RC4 algorithm and compressed using Aplib.\n\n\n-----\n\n_Example of an infected file_\n\nAt the end of the polymorphic code is a classic piece of code for obtaining the kernel32.dll base:\n\n\n-----\n\nNext, the API address of the VirtualProtect function is retrieved and used to set permissions to\nwrite and execute encrypted virus data located at the end of the above-mentioned .rsrc, .data,\nand .rdata sections. The data is decrypted, and the switch to the relevant code is made:\n\n\n-----\n\nThe code decrypts the DLL library with basic bot functionality (encrypted using RC4 and\ncompressed using Aplib), maps the library headers and sections into memory, resolves the\nimports from the import directory, does manual relocations using information from the relocation\ntable directory, and executes the code at the library entry point.\n\n## KBOT functions\n\n### Injects\n\nTo conceal malicious activity in the system and its ability to operate in the context of system\napplications, KBOT attempts to inject code into running system processes.\n\nUsing the API functions OpenProcess/OpenProcessToken and GetTokenInformation, it\nretrieves the SID of the process into whose address space the main malware module is loaded. If\nthe SID of the process matches WinLocalSystemSid, KBOT uses the CreateProcess API with\nthe CREATE_SUSPENDED flag to create the new process svchost.exe, and then performs a\nclassic inject: using the API functions NtCreateSection/NtMapViewOfSection, it allocates\nmemory in the address space of the svchost.exe process, where it copies the header and sections\n\n\n-----\n\nof the main module, after which it resolves the imports from the import directory and does manual\nrelocations using information from the relocation table directory. Next, KBOT calls the\n**CreateRemoteThread/RtlCreateUserThread API with the address of the entry point. If the SID of**\nthe process does not match WinLocalSystemSid, the malware sets SeDebugPrivilege debug\nprivileges and tries to perform a similar inject in the running processes services.exe and\n_svchost.exe, whose SIDs match WinLocalSystemSid, as well as in the explorer.exe process._\n\nKBOT also injects the DLLs specified in the injects.ini file (located in the virtual file storage) into\nthe processes listed in the same INI file. Configuration files, including injects.ini, are encrypted in\none of the last sections of the main module of the bot, from where they are read, decrypted, and\nmoved to the virtual file storage. The sample first searches for the current version of the required\nfile in its storage (it might be that the current version was previously retrieved from the C&C); in\ncase of failure, it reads the file data from the original version, which is located in the body of the\nbot itself in encrypted form. A special bot module — JF (joined files) — handles the processing of\nsuch files. At the start of the encrypted data of every such file, there is a structure with a data\ndescription containing a JF signature.\n\n_Description of the data processing procedure of the configuration file_\n\n\n-----\n\nThe structure with the description of the encrypted file data corresponds to each encrypted file\nattached:\n\nExample of injects.ini:\n\nThe above-mentioned JUPITER.32 and JUPITER.64 are DLLs that perform web injects that help\nthe malware steal users’ personal data entered in browsers: passwords, credit card/wallet\nnumbers, etc.; such injects are carried out through spoofing web page content as a result of\ninjecting malicious code into the HTTP traffic. For this, it is necessary to modify the code of the\nbrowser and system functions responsible for the transmission and processing of traffic. To do so,\nafter performing an inject in the system and browser processes, the web-injects library patches the\ncode of functions in popular browsers (Chrome, Firefox, Opera, Yandex.Browser) and the code of\nsystem functions for transmitting traffic:\n\n\n-----\n\nThe list of injects from the configuration file is stored by the malware in a global array of inject\ndescriptors — a functionality analogous in many ways to the Rovnix bootkit.\n\nBelow we give an example of the configuration file kbot.ini, where Hosts is the C&C list and\n**ServerPub is the public key for data encryption:**\n\n\n-----\n\n### DLL hijacking\n\nSo as to operate in the address space of a legitimate system application when the system boots,\n[the malware performs a DLL hijacking attack by infecting the system libraries specified in the](https://encyclopedia.kaspersky.com/glossary/dll-hijacking/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\nimport directory of the system executable file and placing them next to the system file, which is\nthen written to Startup.\n\nIn the system folder C:\\Windows\\\\System32, the malware searches for executable EXE files\nsuitable for attack, excluding from consideration the following files:\n\n1. Containing the strings level=”requireAdministrator” and >true in the manifest. That is,\n\nexecutable files that need administrator rights to run. Calling such applications invokes a\nUAC dialog box.\n2. Containing in the import table library names starting with API-MS-WIN- and EXT-MS-WIN-.\n\nThat is, files that contain virtual library names in imports and use the API Set redirection\ntable in ApiSetSchema.dll. For such files, DLL hijacking is impossible to implement, because\nvirtual names are translated into system library names with full paths.\n3. The names of which are contained in the stop list:\n\nHaving found an executable file that meets all the criteria, KBOT creates a folder with an arbitrary\nname in the system directory, and copies the detected EXE file to it, as well as the system DLLs\nlocated in the import directory of the executable file. To perform these operations with\n[administrator privileges, the malware generates a shellcode (based on this code) using](https://github.com/rapid7/metasploit-framework/blob/master/external/source/exploits/bypassuac/Win7Elevate/Win7Elevate_Inject.cpp)\n**EIFOMoniker Elevation:Administrator!new:{3ad05575-8857-4850-9277-11b85bdb8e09}”.**\n\n\n-----\n\n_The above shellcode functionality_\n\nThis shellcode, along with the necessary parameters, is injected into the explorer.exe process\nusing the CreateRemoteThread API function.\n\nAfter copying, the virus creates an arbitrarily named file in the same folder, which is an encrypted\nfile storage; VFAT is used as the file system. Located in the storage is the current version of the\nmain bot module, configuration files received from the C&C, system information, and other service\ndata.\n\nAs a result, the directory containing the system application, DLLs from the import directory, and\nthe KBOT service data storage looks as follows (the file name of the malware’s encrypted virtual\nstorage is highlighted red):\n\nNext, KBOT infects the copied system libraries. The code of the DLLEntryPoint entry point is\noverwritten with the following code:\n\nAs when infecting the executable file, the virus adds polymorphic code to the code section and\nencrypted code at the end of one of the .rsrc, .data, or .rdata sections. Unlike the code added to\nthe EXE file, this code does not contain the encrypted main module of the bot, rather it reads and\ndecrypts it from the file storage. Functions imported by the system EXE file from the created folder\nhave their start overwritten with the code for performing the switch to the polymorphic code:\n\n\n-----\n\nThe further operating algorithm of the malicious code is analogous to that of the malicious code in\nthe infected EXE files, except that the main bot module is read from the encrypted storage. The\noriginal data of the infected DLLs is not saved.\n\nEncrypted code at the end of the last section of the DLL:\n\nIn this way, after the system EXE file is started, the imported DLLs located next to it are loaded\ninto the address space of the process. After calling the imported functions, the malicious code is\nexecuted.\n\n### Startup\n\n\n-----\n\nTo run at system startup, the malware uses the following methods:\n\n1. It writes itself to Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run.\n\nTo prevent a UAC window from appearing, it sets the value of the __compat_layer\nenvironment variable to RunAsInvoker. Using the CreateDesktop API, it creates a new\ndesktop. Within the framework of this desktop, it uses the CreateProcess API to launch the\nregedit.exe process. It injects into this process the shellcode, which uses API functions for\nworking with the registry to write the full path of the system EXE to the specified registry key.\n2. Using WMI tools, a task is created to run the system EXE file in Task Scheduler, next to\n\nwhich are the infected malicious DLLs (see DLL hijacking above).\n\nKBOT performs a preliminary check of the current tasks in Task Scheduler, reads the contents of\nDLLs imported from the tasks by the EXE files, and searches for the infection signature data:\n\nIf there are no tasks with infected files, it creates a new task on behalf of the local system account\n(S-1-5-18) without a user name:\n\n\n-----\n\nTask parameters:\n\nExample of XML with the created task:\n\n\n-----\n\n### Remote management\n\nTo remotely manage the victim’s computer, KBOT establishes reverse connections with the\nservers listed in the BC.ini file.\n\nTo create several simultaneous sessions using the RDP protocol, the malware configures the\nRemote Desktop Server settings:\n\n\n-----\n\n1. It finds processes that have the termserv.dll library loaded in their memory.\n\n2. It patches the memory section of the found process where termserv.dll is loaded. Different\n\npatching code is applied for different system versions.\n\n\n-----\n\n3. During the patching process, it searches the memory of the module for specific sets of bytes,\n\nand replaces them with those specified.\n\nNext, KBOT duly edits the values of the registry keys responsible for TermService settings (not all\neditable values are listed):\n\nHKLM\\SYSTEM\\ControlSet\\Control\\TerminalServer\\LicensingCore\\\nEnableConcurrentSessions\nHKLM\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\\EnableConcurrentSessions\nHKLM\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\\\nAllowMultipleTSSessions\nHKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsNT\\TerminalServices\\MaxInstanceCount\n\nIt then restarts TermService and creates a user in the system for remote connections with the SID\n**WinBuiltinRemoteDesktopUsersSid.**\n\n## C&C communication\n\nThe malware, according to a timer and in a separate thread, starts a process for receiving and\nprocessing commands from the server. The list of commands is sent in the form of a buffer. To\nreceive commands, the wininet.dll APIs for network connections are used. The domains for\nreceiving commands are located in the hosts.ini file, which the malware periodically updates. All\nconfiguration files with C&C data and connection parameters are stored in encrypted form in one\nof the last sections of the main bot module; newer versions are stored in an encrypted VFAT\nstorage, as previously mentioned. Files received from C&C are placed in an encrypted storage.\n\n\n-----\n\n_Example of hosts.ini configuration file_\n\nBot IDs and detailed information about the infected system (computer name, domain, system\nlanguage and version, list of local users, list of installed security software, etc.) are sent to C&C in\nadvance. Traffic is encrypted using the AES algorithm:\n\nThe malware can receive the following commands from the C&C server:\n\n**DeleteFile — delete the specified file from the file storage.**\n**UpdateFile — update the specified file in the file storage.**\n**UpdateInjects — update injects.ini.**\n**UpdateHosts — update hosts.ini.**\n**UpdateCore — update the main bot module and the configuration file kbot.ini.**\n**Uninstall — uninstall the malware.**\n**UpdateWormConfig — update worm.ini containing information about the location of EXE**\nfiles to be infected.\n\n_Example of worm.ini_\n\n\n-----\n\n**UpdateBackconnectConfig — update the configuration file with the list of servers for**\nreverse connections.\n\n_Example of bc.ini_\n\n\n-----\n\n**Load — load the file into the storage; it loads spyware programs for collecting user data, as**\nwell as DLLs for web injects (saved under the names JUPITER.32 and JUPITER.64), their\nconfiguration files, etc.\n\n_Example of part of the configuration file for a web inject_\n\n## Obfuscation\n\nTo complicate the analysis of its malicious activity, KBOT uses a set of obfuscation tools. When it\nloads, the main bot module checks whether the imported functions are patched for breakpoints; if\nso, it reloads the imported DLLs into memory, zeroes the names of the imported functions, and\nuses string obfuscation. The encrypted strings are stored in a special array of structures; to\n\n\n-----\n\naccess them, the decryption function is called with the number of the string structure in the array.\nThe strings are encrypted using the RC4 algorithm, and the decryption key is stored in the\nstructure.\n\n_Example of an array of structures with a description of the strings_\n\nAccess to the string:\n\n\n-----\n\nDecryption function:\n\n### Obfuscation of the DLL that performs the web injects\n\nThe malware suspends threads of the well-known vendor’s security solution (like the Carberp\nTrojan), and in the context of its process finds threads whose code was run from DLLs located at\nthe path mask *\\\\Trusteer\\\\Rapport\\\\*.dll\n\n\n-----\n\nNext, the malware scans the contents of the DLL for signatures of interest to it. If any are present,\nit suspends execution of the thread, patches the context so that it performs the Sleep function,\nand resumes the thread:\n\nKBOT then scans the code of the imported functions for patches. If the code is patched (for\nexample, a 0xcc breakpoint has been added), it reloads the imported libraries into memory and\nresolves imports.\n\n## Conclusion\n\nThe KBOT virus poses a serious threat, because it is able to spread quickly in the system and on\nthe local network by infecting executable files with no possibility of recovery. It significantly slows\ndown the system through injects into system processes, enables its handlers to control the\ncompromised system through remote desktop sessions, steals personal data, and performs web\ninjects for the purpose of stealing users’ bank data.\n\n\n-----\n\n## IOC\n\n**Executable files:**\nInfected EXEs:\nx86 — 2e3a7d4cf86025f5873ebddf3dcacf72\nx64 — 46b3c12b44f587ae25d6f38d2a8c4e0f\nInfected DLLs:\nx86 – 5f00df73bb6e84c49b9bf33ff1d552c3\nx64 – 1c15c98bc57c48140558d0e8d71b4ecd\nStealer:\nc37058752b2c055ff3a3b3eac50f1350\n\n**C&C**\n213.252.245.229\nmy-backup-club-911[.]xyz\n213.252.245.146/au.exe\nsync-time[.]info/au.exe\nsync-time[.]icu/au.exe\nsync-time[.]club/au.exe\n\n[DLL hijacking](https://securelist.com/tag/dll-hijacking/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Statistics](https://securelist.com/tag/malware-statistics/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Obfuscation](https://securelist.com/tag/obfuscation/)\n\nAuthors\n\nAnna Malina\n\nKBOT: sometimes they come back\n\n\n-----\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-10 - KBOT- sometimes they come back.pdf"
    ],
    "report_names": [
        "2020-02-10 - KBOT- sometimes they come back.pdf"
    ],
    "threat_actors": [
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535557,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653751765,
    "ts_modification_date": 1653751765,
    "files": {
        "pdf": "https://archive.orkl.eu/45c722856683042da7145203bd1febbd88c8f6b3.pdf",
        "text": "https://archive.orkl.eu/45c722856683042da7145203bd1febbd88c8f6b3.txt",
        "img": "https://archive.orkl.eu/45c722856683042da7145203bd1febbd88c8f6b3.jpg"
    }
}