{
    "id": "745d5f56-2e8b-4290-87d4-138380c915fb",
    "created_at": "2023-01-12T15:02:32.494905Z",
    "updated_at": "2025-03-27T02:17:05.721221Z",
    "deleted_at": null,
    "sha1_hash": "86386937e41bf38b9841e7283909aa36d152dc14",
    "title": "2022-04-12 - Industroyer2-  Industroyer reloaded ",
    "authors": "",
    "file_creation_date": "2022-05-26T01:54:27Z",
    "file_modification_date": "2022-05-26T01:54:27Z",
    "file_size": 1372222,
    "plain_text": "# Industroyer2: Industroyer reloaded\n\n**[blog.eset.ie/2022/04/12/industroyer2-industroyer-reloaded](https://blog.eset.ie/2022/04/12/industroyer2-industroyer-reloaded/)**\n\nESET Ireland April 12, 2022\n\n**_This ICS-capable malware targets a Ukrainian energy company._**\n\n## Executive summary\n\nThe blogpost presents the analysis of a cyberattack against a Ukrainian energy provider.\n\n**Key points:**\n\nESET researchers collaborated with CERT-UA to analyze the attack against the\nUkrainian energy company\nThe destructive actions were scheduled for 2022-04-08 but artefacts suggest that the\nattack had been planned for at least two weeks\nThe attack used an ICS-capable malware and regular disk wipers for Windows, Linux\nand Solaris operating systems\nWe assess with high confidence that the attackers used a new version of the\nIndustroyer malware, which was used in 2016 to cut power in Ukraine\nWe assess with high confidence that the APT group Sandworm is responsible for this\nnew attack\n\n\n-----\n\nESET researchers responded to a cyber-incident affecting an energy provider in Ukraine. We\n[worked closely with CERT-UA in order to remediate and protect their network.](https://cert.gov.ua/)\n\n[The collaboration resulted in the discovery of a new variant of Industroyer malware, which](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\n[we together with CERT-UA named Industroyer2 – see CERT-UA publication here.](https://cert.gov.ua/article/39518)\nIndustroyer is an infamous piece of malware that was used in 2016 by the Sandworm APT\ngroup to cut power in Ukraine.\n\nThe Sandworm attackers made an attempt to deploy the Industroyer2 malware against highvoltage electrical substations in Ukraine.\n\nIn addition to Industroyer2, Sandworm used several destructive malware families including\nCaddyWiper, ORCSHRED, SOLOSHRED and AWFULSHRED. We first discovered\nCaddyWiper on 2022-03-14 when it was used against a Ukrainian bank – see our Twitter\nthread about CaddyWiper. A variant of CaddyWiper was used again on 2022-04-08 14:58\nagainst the Ukrainian energy provider previously mentioned.\n\nAt this point, we don’t know how attackers compromised the victim nor how they moved\nfrom the IT network to the Industrial Control System (ICS) network. Figure 1 shows an\noverview of the different wipers used in this attack.\n\n\n-----\n\nFigure 1. Overview of the wiping components.\n\nFigure 2 summarizes the chain of events.\n\n2022-02-24: Beginning of the current Russian invasion in Ukraine\n\n2022-03-14: Deployment of CaddyWiper against a Ukrainian bank\n\n2022-04-01: Deployment of CaddyWiper against a Ukrainian governmental entity\n\n2022-04-08 14:58 UTC: Deployment of CaddyWiper on some Windows machines and of Linux\nand Solaris destructive malware at the energy provider\n\n2022-04-08 15:02:22 UTC: Sandworm operator creates the scheduled task to launch\nIndustroyer2\n\n2022-04-08 16:10 UTC: Execution of Industroyer2 to cut power in an Ukrainian region\n\n2022-04-08 16:20 UTC: Execution of CaddyWiper on the same machine to erase Industroyer2\ntraces\n\n\n-----\n\n_Figure 2. Timeline of events._\n\nIn 2017, ESET researchers revealed that a piece of malware called Industroyer was\n[responsible for the power blackout that impacted Ukraine’s capital Kiev in December 2016.](https://www.reuters.com/article/us-ukraine-cyber-attack-energy-idUSKBN1521BA)\n\nAs detailed in our detailed white paper Win32/Industroyer: A new threat for industrial\ncontrol systems, it is capable of interacting with industrial control systems typically found in\nelectric power systems. This includes IEC-101, IEC-104, IEC 61850 and OPC DA.\n\nAt that time, we said that “it seems very unlikely anyone could write and test such malware\nwithout access to the specialized equipment used in the specific, targeted industrial\nenvironment”. This was confirmed in 2020 by the United States government when six\nofficers of the Russian Military Unit 74455 of the Main Intelligence Directorate (GRU), were\n[indicted for their role in multiple cyberattacks including Industroyer and NotPetya – see the](https://www.welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/)\n[indictment on justice.gov and our historical overview of Sandworm’s operations.](https://www.justice.gov/opa/pr/six-russian-gru-officers-charged-connection-worldwide-deployment-destructive-malware-and)\n\nThe recently discovered malware is a new variant of Industroyer, hence the name\nIndustroyer2.\n\n## Industroyer2\n\nIndustroyer2 was deployed as a single Windows executable named 108_100.exe and\nexecuted using a scheduled task on 2022-04-08 at 16:10:00 UTC. It was compiled on 202203-23, according to the PE timestamp, suggesting that attackers had planned their attack for\nmore than two weeks.\n\n_Figure 3. Timestamp and compiler information._\n\n\n-----\n\n[Industroyer2 only implements the IEC-104 (aka IEC 60870-5-104) protocol to communicate](https://en.wikipedia.org/wiki/IEC_60870-5#IEC_60870-5-104)\nwith industrial equipment. This includes protection relays, used in electrical substations.\nThis is a slight change from the 2016 Industroyer that is a fully-modular platform with\npayloads for multiple ICS protocols.\n\nIndustroyer2 shares number of code similarities with the payload 104.dll of Industroyer. We\nassess with high confidence that the new variant was built using the same source code.\n\nIndustroyer2 is highly configurable. It contains a detailed configuration hardcoded in its\nbody, driving the malware actions. This is different from Industroyer that stores\nconfiguration in a separate .INI file. Thus, attackers need to recompile Industroyer2 for each\nnew victim or environment. However, given that the Industroyer* malware family was only\ndeployed twice, with a five year gap between each version, this is probably not a limitation\nfor Sandworm operators.\n\nThe new configuration format is stored as a string which is then supplied to the IEC-104\ncommunication routine of the malware. Industroyer2 is able to communicate with multiple\ndevices at once. Specifically, the analyzed sample contains 8 different IP addresses of devices\n– see Figure 4.\n\n_Figure 4 – Hardcoded configuration found in Industroyer2 sample_\n\nThe configuration contains values that are used during communication via IEC-104 protocol,\nsuch as ASDU (Application Service Data Unit) address, Information Object Addresses (IOA),\ntimeouts, etc.\n\nBefore connecting to the targeted devices, the malware terminates a legitimate process that is\nused in for standard daily operations. In addition to that, it renames this application by\nadding .MZ to the filename. It does so in order to prevent automatic re-start of this\nlegitimate process.\n\n\n-----\n\nThe analysis is still on-going in order to determine what are the exact actions taken for each\ndevice. We believe that this component is able to control specific ICS systems in order to cut\npower.\n\nIndustroyer2 can produce a log file or output its progress to the console window. However,\ninstead of meaningful text messages as in previous version the malware writes various error\ncodes – see Figure 5. We believe it is an obfuscation attempt by Sandworm developers to\nthwart analysis.\n\n_Figure 5. Output produced by Industroyer2 malware_\n\n## CaddyWiper\n\nIn coordination with the deployment of Industroyer2 in the ICS network, the attackers\ndeployed a new version of the CaddyWiper destructive malware. We believe it was intended\nto slow down the recovery process and prevent operators of the energy company from\nregaining control of the ICS consoles. It was also deployed on the machine where\nIndustroyer2 was executed, likely to cover their traces.\n\n[The first version of CaddyWiper was discovered by ESET researchers in Ukraine on 2022-03-](https://twitter.com/ESETresearch/status/1503436420886712321)\n14 when it was deployed in the network of a bank. It was deployed via Group Policy Object\n(GPO), indicating the attackers had prior control of the target’s network beforehand. The\nwiper erases user data and partition information from attached drives, making the system\ninoperable and unrecoverable.\n\n### New CaddyWiper loading chain\n\n\n-----\n\nIn the network of the energy provider, attackers deployed a new version of CaddyWiper that\nuses a new loader, named ARGUEPATCH by CERT-UA. ARGUEPATCH is a patched version\n[of a legitimate component of Hex-Rays IDA Pro software, specifically the remote IDA](https://hex-rays.com/)\ndebugger server win32_remote.exe. IDA Pro is not supposed to be used in an ICS\nenvironment as its main purpose is for software reverse-engineering including malware\nanalysis. We don’t know why attackers choose to trojanized this piece of software, it might be\na troll towards defenders.\n\nARGUEPATCH was executed by a scheduled task that was intended to be launched once on\n2022-04-08 14:58 UTC on one machine and at 16:20 UTC on the machine where\nIndustroyer2 was deployed.\n\nThe patched binary loads an encrypted shellcode from a file and decrypts it with a key, both\nare provided in command line. A single-byte XOR key is derived from the input key and used\nto decrypt the shellcode.\n\nThe decrypted shellcode is a slightly modified version of CaddyWiper. A comparison of their\nmain routines is provided in Figure 6 and Figure 7. Note that they do not wipe the domain\ncontroller, and they wipe C:\\Users\\ and disks from D:\\ to [:\\. The wiping routine is also\nalmost identical: it fills all files with 0.\n\n_Figure 6. Main routine of the first sample of CaddyWiper._\n\n\n-----\n\n_Figure 7. Main routine of the CaddyWiper sample deployed at the energy provider_\n\nFinally, CaddyWiper\ncalls DeviceIoControl with IOCTL_DISK_SET_DRIVE_LAYOUT_EX and a\nzeroed InputBuffer for all disks from \\\\PHYSICALDRIVE9 to \\\\PHYSICALDRIVE0. This\n[erases extended information of drive’s partitions: the Master boot record (MBR) or the GUID](https://docs.microsoft.com/en-us/windows/win32/api/winioctl/ns-winioctl-drive_layout_information_ex)\nPartition Table (GPT). The machine won’t be able to boot again.\n\n### Active directory enumeration\n\nAlongside CaddyWiper, a PowerShell script was found both in the energy provider network\nand in the bank that was compromised earlier.\n\nThis script enumerates Group Policies Objects (GPO) using the Active Directory Service\nInterface (ADSI). The script, shown in Figure 8, is almost identical to a snippet provided in a\nmedium blogpost.\n\nWe believe that attackers deployed CaddyWiper via a GPO and used the script to check the\nexistence of this GPO.\n\n_Figure 8. PowerShell script to enumerate GPO (beautified)_\n\n\n-----\n\n## Linux and Solaris destructive malware (ORCSHRED, SOLOSHRED, AWFULSHRED)\n\nOn the network of the targeted energy company was found additional destructive malware\nfor systems running Linux and Solaris. There are two main components to this attack: a\nworm and a wiper. The latter was found in two variants, one for each of the targeted\noperating system. All malware was implemented in Bash.\n\n## The worm\n\nThe first component launched by the attacker was a worm, having its file named sc.sh. This\nBash script starts by adding a scheduled task (cron job) to launch the wiper component at\n2:58pm UTC (assuming the system is in the local time zone, UTC+3), unless it was launched\nwith the “owner” argument. This is likely a way to avoid autodestructing the initial system\nused to launch the worm.\n\n_Figure 9 Setting up the crob job to launch the wiper at 5:58pm. The correct wiper is_\n\n_picked depending on the installed operating system._\n\nThe script then iterates over the networks accessible by the system by looking at the result\nof ip route or ifconfig -a. It always assumes a class C network (/24) is reachable for each IP\naddress it collects. It will try to connect to all hosts in those networks using SSH to TCP port\n22, 2468, 24687 and 522. Once it finds a reachable SSH server, it tries credentials from a list\nprovided with the malicious script. We believe the attacker had credentials prior to the attack\nto enable the spread of the wiper.\n\n\n-----\n\nIf the system is not already compromised, malware is copied to the new target, and the worm\nis launched. The worm is not launched with the “owner” argument, so the wiper is scheduled\nto launch at 2:58pm UTC and destroy all data. If those systems were set to the local time\nzone, the destruction must’ve started at the same time as the system compromised with\nCaddyWiper.\n\n## The Linux wiper\n\nThe Linux variant of the wiper is lightly obfuscated variables and function names were\nreplaced with meaningless 8-letter word. Most literal values were also replaced with\nvariables at the beginning of the file.\n\n_Figure 10 – Except from the obfuscated script (whitespace optimised)._\n\n\n-----\n\n_Figure 11 – Deobfuscation of the above obtained by renaming functions and_\n\n_variables and using literals_\n\nUltimately, the Linux wiper destroy the whole content of the disks attached to the system by\n[using shred if available or simply dd (with if=/dev/random) otherwise. If multiple disks are](https://www.gnu.org/software/coreutils/manual/html_node/shred-invocation.html)\nattached, data removal is done in parallel to speed up the process.\n\nDepending on the size, it may take hours for the full disk to be completely erased. To render\nthe system inoperable faster, it first tries to stop and disable HTTP and SSH services.\nServices are disabled both by using systemctl disable. To ensure service isn’t reenabled, the\nsystemd unit file responsible for loading the service is deleted from the disk.\n\nFiles from /boot, /home and /var/log are also removed before destroying the full drives. This\nmakes the system inoperable faster, deletes user data and perhaps removes incriminating\nlogs.\n\n[The malicious script’s last action is to forcibly initiate a reboot using SysRq. Since all drives](https://www.kernel.org/doc/html/latest/admin-guide/sysrq.html)\nare filled with random, no operating system will boot.\n\n## The Solaris wiper\n\nUnlike the Linux wiper, the Solaris variant is not obfuscated.\n\nLike the Linux variant, the malicious script iterates over all services to stop and disable them\nif they contain the keyword ssh, http, apache and additionally ora_ or oracle. Those services\nare very likely used by applications used to control ICS systems. Wiping them would prevent\nthe energy company’s operators from retaking control of the substations and roll back\nIndustroyer2 actions.\n\n\n-----\n\n[It uses either systemctl or svcadm depending on what’s available. The latter is most likely](https://docs.oracle.com/cd/E86824_01/html/E54764/svcadm-1m.html)\nsince Solaris is not running systemd.\n\nFile destruction begins by deleting databases. It removes, using shred then rm, all files and\ndirectories contained in environment variables starting with ORA. Oracle Database uses the\nfollowing variables to define location of database files and\n[software: ORACLE_BASE, ORACLE_HOME and ORACLE_PATH. Note that shred makes](https://www.gnu.org/software/coreutils/manual/html_node/shred-invocation.html#shred-invocation)\nsure data recevery (without a backup) isn’t possible.\n\nLike the Linux variant, files in /boot, /home and /var/log are deleted in priority.\n\nThen the script iterates over disks connected to the system, found in /dev/dsk/. It ignores\nslices (partitions) and work only on full disks. For each of them, the malicious script\noverwrites the full content using shred. To minimize the time required to perform the wipe,\nall disks are erased in parallel.\n\nLastly, the script self-destructs.\n\n## Conclusion\n\nUkraine is once again at the center of cyberattacks targeting their critical infrastructure. This\nnew Industroyer campaign follows multiple waves of wipers that have been targeting various\nsectors in Ukraine. ESET researchers will continue to monitor the threat landscape in order\nto better protect organizations from these types of destructive attacks.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-12 - Industroyer2-  Industroyer reloaded .pdf"
    ],
    "report_names": [
        "2022-04-12 - Industroyer2-  Industroyer reloaded .pdf"
    ],
    "threat_actors": [
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535752,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653530067,
    "ts_modification_date": 1653530067,
    "files": {
        "pdf": "https://archive.orkl.eu/86386937e41bf38b9841e7283909aa36d152dc14.pdf",
        "text": "https://archive.orkl.eu/86386937e41bf38b9841e7283909aa36d152dc14.txt",
        "img": "https://archive.orkl.eu/86386937e41bf38b9841e7283909aa36d152dc14.jpg"
    }
}