{
    "id": "74a1a44a-561d-4976-aa4d-5dd4f931dd36",
    "created_at": "2023-04-05T02:10:09.495563Z",
    "updated_at": "2025-03-27T02:09:18.721543Z",
    "deleted_at": null,
    "sha1_hash": "bc2cc3453286d5d556444b00719bf2a4641314f8",
    "title": "2023-03-01 - OneNote- A Growing Threat for Malware Distribution",
    "authors": "",
    "file_creation_date": "2023-04-03T08:26:05Z",
    "file_modification_date": "2023-04-03T08:26:05Z",
    "file_size": 6095104,
    "plain_text": "# OneNote: A Growing Threat for Malware Distribution\n\n**[zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution](https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution)**\n\nAttackers are increasingly using OneNote documents to distribute malware, due to the\nheightened security measures against macro-based attacks and the widespread adoption\nand popularity of the platform. Analyzing several related case studies, this article\nshowcases the obfuscation techniques used by threat actors to bypass threat detection\nmeasures and deceive users into executing malware on their systems via OneNote.\n\n## Key Takeaways:\n\nThreat actors are increasingly using Microsoft OneNote documents to deliver malware\nvia phishing emails.\nOneNote is installed by default in all Microsoft Office/365 installations, even if a\nWindows user does not use the application, it is still available to open the file format\nbecause it is easy to deceive a user to run a malicious OneNote Document.\nPreviously Threat actors target users with malicious macro enabled documents but, in\nJuly 2022, Microsoft disabled Macros by default on all Office applications, making this\napproach unreliable for distributing malware.\nThe advantage of OneNote documents is that they can embed similar malicious code\nas macro/VBA office documents with less detection.\nAlso MSHTA, WSCRIPT, and CSCRIPT can be executed from within OneNote and\nattackers can use multi-layer obfuscation with this script to bypass threat detection.\nOneNote Document can run the following types of scripts CHM, HTA, JS, WSF, and\nVBS.\nThreatLabz detected various types of malware distributed through OneNote\ndocuments including Bankers, Stealers and RAT (Remote-Access-Trojan).\n\n## Why OneNote?\n\nAttackers have shifted from using traditional macro-based attacks to using Microsoft\nOneNote as a delivery mechanism for malware. OneNote has become an increasingly\nattractive vector for attackers due to its popularity, wider reach, lack of awareness and\nsecurity measures, and ability to integrate with other Microsoft products. Attackers use\nOneNote to deliver malicious payloads by obfuscating the content and exploiting the trusted\napplication status of OneNote. Specific reasons for this shift include:\n\n\n-----\n\n1. Increased Security Measures: Due to the growing awareness of macro-based\n\nattacks, many organizations have been implementing security measures to prevent\nsuch attacks. As a result, it has become more challenging for attackers to deliver\nmalware through these attacks. Furthermore, in July 2022, Microsoft disabled Macros\nby default on all Office applications, rendering this approach unreliable for malware\ndistribution.\n2. OneNote's Popularity and Wider Reach: OneNote's popularity as a widely used\n\nnote-taking application and its ability to embed different types of content make it a\nuseful tool for attackers to distribute malware. It is pre-installed in all Microsoft\nOffice/365 installations, meaning that even if a Windows user does not use the\napplication, the file format is still available for malicious OneNote documents to\ndeceive a user into running them.\n3. Lack of Awareness and Security Measures: Exploits in Microsoft OneNote are not\n\nas well-known as macro-based attacks, which often leads to organizations not having\nsufficient security measures to prevent these types of attacks.\n4. Evasion Techniques: Although the \"Mark of the Web\" is a Windows security feature\n\nthat protects users from potentially harmful content downloaded from the internet,\nOneNote does not propagate this feature on its attachments. This allows attackers to\nembed unsigned executables or macro-enabled documents without triggering\nMicrosoft's recent security restrictions.\n5. Trusted Application and Microsoft Integrations: Due to OneNote being a trusted\n\napplication, users may be more inclined to interact with files from this application\ncompared to other types of attachments or links. Additionally, OneNote can be\nintegrated with other Microsoft products such as Office and OneDrive, which makes it\neasier for attackers to spread malware through these products as well.\n\nTo detect and mitigate these attacks, organizations must implement security measures to\ndetect malicious content and malicious payloads, as well as leverage tools like\nOneNoteAnalyzer, a valuable resource developed by ThreatLabz Researcher Niraj to\nstreamline and expedite the process of analyzing suspicious artifacts in OneNote\nDocuments.\n\n_Fig.1 - Open source OneNoteAnalyzer tool developed by a ThreatLabz researcher_\n\n## Case Study-1: RAT\n\n\n-----\n\nStarting in December 2022, attackers have been using OneNote files to distribute Remote\nAccess Trojans (RAT) such as AsyncRAT, Quasar RAT, NetWire, and Xworm. These RATs\nuse complex obfuscation techniques with OneNote files in order to evade detection by\nsecurity software.\n\nDuring the course of the investigation, researchers found the file containing the malicious\npayload disguised under the misleading name \"PaymentAdv.one\".\n\n_Fig.2 - OneNote phishing document_\n\nAfter analyzing the file with OneNoteAnalyzer, researchers uncovered that the attack was\ncarried out by dropping and executing a batch file called \"zoo1.bat\".\n\n\n-----\n\n_Fig.3 - Malicious files extracted from OneNote document_\n\nThe batch file was obfuscated and contained an encrypted blob at the start, followed by\nheavily obfuscated PowerShell code.\n\n_Fig.4 - Obfuscated batch file_\n\nBy removing the \"@echo off\" line and adding \"echo\" to the start of each line in the batch\nfile, researchers were able to decode the file's activities and log the output as shown in the\nscreenshot below.\n\n\n-----\n\n_Fig.5 - Commands executed by_ **_zoo1.bat.exe_**\n\nThe log indicated that the batch file had copied and disguised the malicious program as\n\"zoo1.bat.exe\" in an attempt to hide its activities.\n\nThe Powershell code associated with it was obfuscated and difficult to comprehend, so\nresearchers manually pretty print to deobfuscate and reformat the file, making it more\nreadable as demonstrated in the screenshot below.\n\n_Fig.6 - Obfuscated Powershell code in readable format_\n\nAfter deobfuscation, researchers discovered that the script used base64 encoding to split\nthe encrypted blob seen in the initial batch file into its actual data, AES key, and index using\nthe backslash character. With these values, the script was able to decrypt the data and\ndecode it using gzip encoding to reveal the final executable.\n\n_Fig.7 - AES Key and IV identified in the blob_\n\nNow lets the cook the above recipe using Cyberchef and check what does it results:\n\n\n-----\n\n_Fig.8 - Decrypted payload extracted using CyberChef_\n\nSimilarly we can decode the second blob which will also result in a Portable Executable\n(PE) file.\n\n_Fig.9 - AgileDotNet Packed AsyncRAT Payload_\n\nThe resulting file is a .NET File packed with AgileDotNet, which was revealed to contain a\nmalicious AsyncRAT payload after deobfuscating and unpacking with the .NET Kali Linux\ntool known as de4dot.\n\n## Case Study-2: Banker\n\nStarting in January 2023, Qakbot began experimenting with OneNote files as a vector to\ndeliver malware. Researchers subsequently observed IcedID doing the same, using\nOneNote files with embedded HTML applications (HTA files with .hta extension).\n\nThe following figure illustrates how IceID's OneNote Malspam (malware spam) is distributed\nand executed.\n\n\n-----\n\n_Fig.10 - IcedID Attack Chain & execution flow._\n\nThe phishing email from the attacker includes an attachment named \"unpaid_4178**February-03.one\", which is a OneNote file containing a fake Microsoft 365 page. The page**\nappears to contain a cloud attachment and deceives the user into double-clicking to view it,\nthereby initiating the IcedID infection process.\n\n_Fig.11- Fake MS 365 page._\n\nWhen the user clicks on the \"View\" button within the OneNote attachment, an .hta file is\nsilently dropped into the Temp directory of the compromised system without any type of\nnotification. This action triggers the download of both the IcedID malware payload and a\ndecoy PDF file called \"invoice.pdf\" that displays phony invoice information.\n\n\n-----\n\n_Fig.12 - Execution of HTA file._\n\n_Fig. 13 - Process tree of OneNote execution._\n\nUpon further observation, it was noted that the IcedID malware infection was followed by\nthe download and execution of a Powershell script, which in turn downloaded the Cobalt\nStrike DLL beacon. This behavior is similar to previous variants of IcedID and Qakbot,\nwhere they infect the system with Cobalt Strike approximately 45 minutes after the initial\ninfection.\n\n_Fig.14 - Powershell script to download CobaltStrike._\n\nContinued analysis of the increasing number of OneNote samples has uncovered an\nintriguing method employed by Qakbot to download and execute its payload. When the user\nclicks the \"Open\" button in the OneNote file, the HTA file is dropped into the Temp directory\nof the infected system. The HTA file utilizes JavaScript to deobfuscate the obfuscated data\nfrom the <div> element. Following this, VBScript creates a registry key and stores the\ndeobfuscated data in it. A separate JavaScript code creates a WshShell object and\nexecutes Curl to download the Qakbot payload.\n\n\n-----\n\n_Fig.15 - Qakbot OneNote obfuscation._\n\nIt has also been observed that the latest OneNote Qakbot samples have altered their\nexecution flow. Instead of using HTA files, they are now dropping CMD files to download\nand execute the final payload.\n\nOnenote -> cmd -> powershell -> rundll32 (final Qakbot payload).\n\n_Fig.16. - New Qakbot OneNote execution._\n\n## Case Study-3: Stealer\n\nNumerous RATs and banking malware have been observed spreading through OneNote\nsince the malware campaign began, with Qakbot malware being the most prevalent.\nHowever, only Redline has been identified as distributing through OneNote files in the\nstealer category. Recently, a suspicious OneNote sample was discovered due to its network\nactivity.\n\n\n-----\n\n_Fig.17 - Phishing document malicious content_\n\nAfter using the onedump.py tool by Didier Stevens to analyze the sample, multiple data\nblobs were discovered. Stream 2, 3, and 5 contained HTML files with hidden code. After\ndumping the files, it was discovered that two of them used URL encoding for obfuscation.\nCyberChef was used to decode the scripts, which were revealed to be VBScript files that\ndownload payloads from malicious URLs and execute them using the Start-Process\ncommand.\n\n_Fig.18 - Decoded text from encoded HTA files._\n\nThe third file underwent multiple layers of obfuscation before revealing the final binary. It\nwas first encoded with URL encoding and then subjected to several layers of base64\nencoding. Additionally, it used the gzip library to decode the final code. The output of the\ndecoded code was a PowerShell file path, presumably for use in later stages of execution.\n\n\n-----\n\n_Fig.19 - Decoded Script_\n\nAfter investigating the downloaded payloads from the scripts, we discovered one payload\nlocated at https://oiartzunirratia[.]eus/install/clean/Lcovlccdxd.exe. This file was found\nto be a .NET file encrypted with a pureCrypter. Through analyzing its configuration, we\nidentified this payload as Redline. The configuration of the final payload includes the\nfollowing details:\n\n_{_\n\n_\"C2 url\":[_\n\n_\"194.26.192.248:7053\"_\n\n_],_\n\n_\"Bot Id\":\"cheat\"_\n\n_}_\n\nDuring the analysis of this sample, it was discovered that it is distributed through the\nTelegram group \"NET_PA1N Reborn,\" which operates as a Malware-as-a-Service (MaaS)\nprovider. The group sells their own Crypter and Stealer named \"Youhacker Crypter\" and\n\"Youhacker Stealer\" as well as popular Remote-Access-Trojans (RATs) and Stealers.\n\n\n-----\n\n_Fig.20 - Telegram group mentioned in OneNote._\n\n\n-----\n\n_Fig.21 - YouHacker stealer and crypter._\n\n## Conclusion\n\nIn recent months, a OneNote malware campaign has been observed spreading RATs,\nBankers, and Stealer category malware. One of the most frequently seen malware in this\ncampaign is Qakbot. However, Redline has also been observed distributing through\nOneNote files. Threat actors are continuously experimenting with initial attack vectors to\nevade detection and deceive users into executing malware. They have adapted this new\ntechnique using OneNote to distribute their malware, as many antivirus engines have not\ncaught up with inspecting and detecting malicious OneNote files attached to email.\nZscaler's ThreatLabz team is continuously monitoring the campaign and sharing new\nfindings. During their investigations, Zscaler has discovered various samples of OneNote\nmalware with different payloads, encoding, and obfuscation techniques. They have\nanalyzed the behavior of these samples and identified their MITRE ATT&CK techniques.\nSome of the samples have been distributed through a Telegram group named \"NET_PA1N\nReborn,\" where they are working as a Malware-as-a-Service (Maas) and selling their own\ncrypter and stealer along with RATs and other Stealers.\n\n## Zscaler Sandbox Coverage\n\n\n-----\n\nThe behavior of various files was analyzed by Zscaler Sandbox, displaying threat scores\nand the number of MITRE ATT&CK techniques triggered, as shown in the screenshots\nbelow.\n\n_Fig.22 - Zscaler Sandbox report for AsyncRAT._\n\n_Fig.23 - Zscaler Sandbox report for IcedID._\n\n\n-----\n\n_Fig.24 - Zscaler Sandbox report for CobaltStrike._\n\n_Fig.25 - Zscaler Sandbox report for Redline_\n\nZscaler’s multilayered cloud security platform detects payloads with following threat names:\n\n\n-----\n\n## MITRE ATT&CK Techniques:\n\n**Tactic** **Technique ID** **Technique Name**\n\nInitial Access [T1566](https://attack.mitre.org/techniques/T1566/) Phishing\n\n\nExecution [T1204](https://attack.mitre.org/techniques/T1204/)\n\n[T1059](https://attack.mitre.org/techniques/T1059/)\n\n[T1047](https://attack.mitre.org/techniques/T1047)\n\nDefense Evasion [T1027](https://attack.mitre.org/techniques/T1027)\n\n[T1070.004](https://attack.mitre.org/techniques/T1070/004/)\n\n[T1112](https://attack.mitre.org/techniques/T1112)\n\n[T1218.011](https://attack.mitre.org/techniques/T1218/011/)\n\n[T1218.005](https://attack.mitre.org/techniques/T1218/005/)\n\nCommand and Control [T1071](https://attack.mitre.org/techniques/T1071)\n\n[T1095](https://attack.mitre.org/techniques/T1095)\n\n\nUser Execution\n\nCommand and Scripting Interpreter\n\nWindows Management Instrumentation\n\nObfuscated Files or Information\n\nFile Deletion\n\nModify Registry\n\nSystem Binary Proxy Execution: Rundll32\n\nSystem Binary Proxy Execution: Mshta\n\nApplication Layer Protocol\n\nNon-Application Layer Protocol\n\n\n## Indicators of Compromise (IOCs):\n\n### Case Study-1:\n\n[+] MD5:\n\ne9f0dbbd19ef972dd2fc163a4b34eae1   = AsyncRAT OneNote File\n19905a73840430e28c484b97546225c6  = Dropped Batch File\n146f4f1c9b29e7505f275772378bfec9    = AsyncRAT payload1\n1d9aa7c9aa3f8dc9dd58a38176ea36fe   = AsyncRAT payload2\n\n### Case Study-2:\n\n[+] MD5:\n\n5139af509129641b1d29edd19c436b54  = IcedID OneNote File\n6b1e64957316e65198e3a1f747402bd6  = IcedID DLL Payload\n6b500ad29c39f72cd77c150a47df64ea   = CobaltStrike DLL Payload\n\n\n-----\n\n4c6a40f40dcd0af8d5c41d0fcc8e4521   = Qakbot OneNote File (hta dropped)\n3c7c265f618912d81856bf460bf19f61    = Qakbot OneNote File (cmd dropped)\nfa49fd13fc49ab38b97d2d019cc04b39   = CMD file to download Qakbot\n\n[+] Network Indicators:\n\nhttp://helthbrotthersg[.]com/view.png       = IcedID Payload from OneNote File\nhttps://transfer[.]sh/get/vpiHmi/invoice.pdf   = Decoy PDF\nhttp://ehonlionetodo[.]com               = IcedID C2\nhttp://167[.]172[.]154[.]189/36.ps1         = Powershell for CobaltStrike\nhttp://167[.]172[.]154[.]189/360702.dll      = Cobalt Strike Payload\nhttps://thefirstupd[.]com                 = Cobalt Strike C2\nhttps://myvigyan[.]com/m1YPt/300123.gif    = Qakbot Payload (hta dropped)\nhttps://starcomputadoras[.]com/lt2eLM6/01.gif = Qakbot (cmd dropped)\n\n### Case Study-3:\n\n[+] MD5:\n\n973e87ec99502aac9a12f987748a812a      = Redline OneNote File\n39f3c510f46d605202844e35c07db84b      = Dropped Hta File 1\n558da264c83bfe58c1fc56171c90c093      = Dropped Hta File 1\nC6ba1a7b2b90e18b6c25382453370169     = Dropped Hta File 1\nd3713110654dc546bd5edc306a6e7efd      = Redline payload\n\n[+] Network Indicators:\n\nhttps://somosnutrisalud[.]cl/installs/clean/payroll.exe    = Payload1\nhttps://wi-protect[.]com/install/Eulsm.exe             = Payload2\nhttps://oiartzunirratia[.]eus/install/clean/Lcovlccdxd.exe  = Redline Payload\n194[.]26[.]192[.]248:7053                          =Redline C2 Url\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-01 - OneNote- A Growing Threat for Malware Distribution.pdf"
    ],
    "report_names": [
        "2023-03-01 - OneNote- A Growing Threat for Malware Distribution.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1680660609,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1680510365,
    "ts_modification_date": 1680510365,
    "files": {
        "pdf": "https://archive.orkl.eu/bc2cc3453286d5d556444b00719bf2a4641314f8.pdf",
        "text": "https://archive.orkl.eu/bc2cc3453286d5d556444b00719bf2a4641314f8.txt",
        "img": "https://archive.orkl.eu/bc2cc3453286d5d556444b00719bf2a4641314f8.jpg"
    }
}