{
    "id": "74abef54-7bd9-4ac6-b420-bc457fe63f96",
    "created_at": "2022-10-25T16:48:24.320344Z",
    "updated_at": "2025-03-27T02:17:05.682892Z",
    "deleted_at": null,
    "sha1_hash": "afd4c1685181d626ba8169f95ba50c655dd8d33d",
    "title": "HermeticWiper and PartyTicket Targeting Computers in Ukraine",
    "authors": "RecordedFuture",
    "file_creation_date": "2022-03-02T10:05:26Z",
    "file_modification_date": "2022-03-02T10:10:24Z",
    "file_size": 1460154,
    "plain_text": "### MALWARE/\n\n TOOLS\n\n PROFILE\n\n## By Insikt Group®\n\nMarch 2, 2022\n\n# HermeticWiper and PartyTicket Targeting\n\n\n-----\n\n#### Background\n\nHermeticWiper, also known as FoxBlade, is a data wiper found\ntargeting finance and government contractor organizations in\n[Ukraine, Latvia, and Lithuania, according to Symantec.](https://www.bleepingcomputer.com/news/security/new-data-wiping-malware-used-in-destructive-attacks-on-ukraine/)\n\n_This report is a technical overview of the HermeticWiper and_ [ESET first reported that their telemetry indicated the](https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/)\n_PartyTicket malware reported by ESET and Symantec on February 23,_\n_2022. The malware was primarily delivered to Ukrainian organizations_ malware was delivered to hundreds of systems in Ukraine, and\n_coincident with the Russian invasion of Ukraine. It is intended for those_ the malware was executed on February 23, 2022, following DDoS\n_looking for a high-level overview of the malware’s TTPs and mitigations._\n\nattacks on Ukrainian websites earlier that day.\n\n#### Executive Summary It was also reported by ESET that the malware was a signed\n\nexecutable, with a code-signing certificate issued to Hermetica\n\nInsikt Group analyzed the HermeticWiper malware\n\nDigital Ltd. Code-signing certificates allow malware to be\n\nand the associated ransomware component named\n\nmore effectively deployed by bypassing detection capabilities,\n\nPartyTicket that were first publicly reported targeting\n\nsuch as Microsoft Defender SmartScreen and built-in browser\n\nUkrainian organizations on February 23, 2022. We\n\nprotections. The developer who operates Hermetica Digital Ltd.\n\ndetermined that both components serve the purpose\n\n[has publicly denied any involvement in the development of the](https://www.reuters.com/world/europe/cyprus-games-writer-denies-links-malware-found-before-russian-invasion-2022-02-24/)\n\nof data destruction, with the “ransomware” component\n\nmalware, however.\n\ndiffering significantly in form and function from known\ncriminal ransomware threats.\n\n#### Key Judgments\n\n       - The use of a wiper malware with an associated\n\ndestructive ransomware component is similar\nin method to WhisperGate, NotPetya, and other\noperations credited to Sandworm.\n\n        - There is insufficient evidence at this time to\n\nattribute HermeticWiper to the Russian state,\nbut the timing of the mass deployment of\nHermeticWiper with kinetic attacks and other\ncyberattacks on Ukraine, and a methodology\nsimilar to past attacks by Russian government-\nassociated actors, lends credence to such an\nattribution.\n\n       - The PartyTicket ransomware attacks are unlikely\n\nto be a true ransomware campaign conducted\nfor financial gain. It is more likely that the\nransomware component is a ruse and the real\npurpose of the attacks are disruption and data\ndestruction.\n\n_Figure 1: The now-revoked Hermetica Digital Ltd. code signing certificate used to sign_\n_HermeticWiper (Source: Recorded Future)_\n\n\n-----\n\n[Microsoft reported that it identified the wiper attacks on](https://blogs.microsoft.com/on-the-issues/2022/02/28/ukraine-russia-digital-war-cyberattacks/)\nFebruary 24, 2022 and alerted the Ukrainian government.\n\nAlthough no direct attribution of HermeticWiper has been\nmade by security researchers at this time, the timing being\ncoincident with other cyberattacks and physical attacks\non Ukraine and a history of similar tactics by Russian stateassociated actors in their use of data wipers in the past, including\n[WhisperGate in January 2022 and NotPetya in 2017, suggest the](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)\ninvolvement of a Russian state operation.\n\n#### Technical Analysis\n\nMultiple infection vectors for the HermeticWiper malware\n[have been reported by Symantec.](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia)\n\nThe delivery of the malware to a Ukrainian organization\nfollowed a Server Message Block (SMB)-based attack on a\nMicrosoft Exchange server on December 23, 2021. The adversary\ninitially stole credentials, and a web shell was installed on January\n16, 2022. HermeticWiper was finally deployed on February 23,\n2022.\n\nA Lithuanian organization that received HermeticWiper was\ninitially compromised in November 2021. The delivery mechanism\nwas suspected by Symantec as being an Apache Tomcat exploit\nthat executed a malicious PowerShell command. This attack\nsimilarly included a credential harvesting component, followed\nquickly by the delivery and execution of the wiper malware as a\nscheduled task.\n\nIn several of the attacks, a ransomware executable was\ndelivered alongside HermeticWiper. The victims received\na ransomware notification providing 2 email addresses:\nvote2024forjb@protonmail[.]com and stephanie.jones2024@\nprotonmail[.]com. Symantec considers it likely that the\nransomware component was [used to distract the victims.](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia)\nWhisperGate attacks used a similar methodology, wherein\nthe attack was disguised as ransomware. Both WhisperGate\nand HermeticWiper used separate components to prevent a\nvictim’s system from booting and file corruption; however, the\ncomponent that played the role of ransomware changed between\nthe 2 attacks. With WhisperGate, the wiper itself masqueraded\nas ransomware; however, with the HermeticWiper attacks, it was\nthe file corrupter instead.\n\nESET reported that in one instance they observed, the\nmalware was dropped via default Group Policy Objects (GPO),\nindicating that the adversaries almost certainly had control of\nan Active Directory server on the network.\n\n\n##### HermeticWiper\n\nHermeticWiper’s primary purpose is to corrupt the NTFS\nand/or FAT file systems of a victim’s machine to prevent it from\nbooting correctly. It was written in Visual Studio 2008 and 2015\nin a combination of C and assembly and uses an included kernel\ndriver to implement much of its disk access functionality. The\nuse of a kernel driver instead of conventional Windows API calls\n[is thought to evade detections that may catch the higher-level](https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html)\nAPI calls being made. The compiler timestamps for 2 samples\nshow that they were compiled on December 28, 2021, and 1\nother sample shows February 23, 2022. Although timestamps\ncan be forged, the timestamp from December 28, 2021, could\nbe used to determine how far in advance this operation was\nplanned. Each sample is signed using what was, at the time,\na valid certificate issued to Hermetica Digital Ltd. Since the\nmalware’s discovery, the certificate has since been revoked by\nthe Certificate Authority, as shown in Figure 1 above.\n\nUpon execution, the wiper adjusts its process token privileges\nto acquire SeBackupPrivilege and SeShutdownPrivilege in order\nto obtain read privileges to any files and eventually shut down\nthe system before terminating. Next, it determines the Windows\nversion and bitness (x86 or x86_64) of the victim’s machine\nin order to determine which kernel driver, located in the PE’s\nresource section, to later load. The kernel drivers are legitimate,\nbenign software used by EaseUS’s Partition Master and are\nsigned with a certificate issued to EaseUS’s parent company,\nCHENGDU YIWO Tech Development Co., Ltd., shown in Figure 2\nbelow. Although the certificate has expired, newer versions of\n[Windows 10 allow exceptions for kernel drivers with certificates](https://docs.microsoft.com/en-us/windows-hardware/drivers/install/kernel-mode-code-signing-policy--windows-vista-and-later-)\nissued before July 29, 2015, to be loaded.\n\n\n-----\n\n_Figure 2: Certificate used to sign EaseUS Partition Master drivers (Source: Recorded Future)_\n\nThe kernel drivers are stored as RCDATA in the PE file’s\nresource section, as shown in Figure 3 below. Each driver is\ncompressed using Microsoft’s [SZDD file format, based on the](http://www.cabextract.org.uk/libmspack/doc/szdd_kwaj_format.html)\n[Lempel–Ziv–Storer–Szymanski (LZSS) algorithm.](https://go-compression.github.io/algorithms/lzss/)\n\nAfter locating the correct driver, the wiper then proceeds to\n[disable WoW64 File System Redirection if the victim is running](https://docs.microsoft.com/en-us/windows/win32/winprog64/file-system-redirector)\na 64-bit OS. This prevents 64-bit systems from loading 32-bit\nkernel drivers from the %windir%\\SysWOW64\\drivers directory\nand instead forces them to use %windir%\\system32\\drivers,\nwhere the malware will eventually place the kernel driver.\nNext, Crash Dumps are disabled by modifying the registry\nvalue “CrashDumpEnabled” to 0 for the key HKLM\\SYSTEM\\\nCurrentControlSet\\Control\\CrashControl. This is likely done to\navoid writing a crash dump to disk when the program terminates.\n\nThe compressed driver resource is then written to the\n%windir%\\system32\\drivers directory with a name consisting of\n2 pseudorandom lowercase characters followed by “dr”. Then\nthe driver is decompressed, and a service with the same name\nis temporarily created to load the driver.\n\n\nTo create the service, the process’s token privileges are\nadjusted again to add SeLoadDriverPrivilege. A service is then\ncreated, configured, and started. Once the driver is successfully\nloaded, the created service’s registry entry is removed from\nHKLM\\SYSTEM\\CurrentControlSet\\services\\. Next, the Volume\nShadow Service (VSS) is stopped and disabled, as shown in\nFigure 4, to make recovery more difficult.\n\nThe wiper then begins to iterate through all physical\ndrives on the system one at a time by attempting to access\n\\\\.\\PhysicalDrive<1-100>. For each drive, junk data is written to\nseemingly random locations of the disk in order to corrupt it.\nAdditionally, the partitions on each physical disk are enumerated\nand any identified as FAT or NTFS file systems are corrupted by\nwriting random data to the file system header. Although public\nreporting has stated that the MBR is “wiped”, which typically\nmeans the MBR is overwritten, in our analysis we have concluded\nthat only the file system is corrupted along with random locations\non the disk. The end result similarly results in a loss of the stored\ndata and inability of the victim machine to boot. Appendix A\n[provides the output from a tool, API Monitor, that captured the](http://www.rohitab.com/apimonitor)\nSetFilePointerEX and WriteFile API calls used to corrupt the hard\ndrives on the victim’s machine. There were no writes to the “0”\nindex, where the MBR would reside, however there are writes\nto the index, 1048576, which is the location of the NTFS file\nsystem header. The additional writes are to seemingly random\nlocations on disk.\n\nThe corruption of the file systems goes beyond a simple\nMBR overwrite and is more effective because it impacts a\nvictim’s ability to boot regardless of the disk partitioning scheme\n(i.e., MBR, GPT). This technique is more robust than the MBR\noverwrite used in the WhisperGate attacks, where [we showed](https://www.recordedfuture.com/whispergate-malware-corrupts-computers-ukraine/)\nthat GPT-style disks could recover from the MBR overwrite.\n\nAfter corrupting the file system the wiper disables the\nShowCompColor and ShowInfoTip values in the Software\\\nMicrosoft\\CurrentVersion\\Explorer\\Advanced registry key in\norder to prevent encrypted NTFS files from showing in color\nand showing pop-up descriptions for folders, respectively. Then\nit proceeds to corrupt logs and data on NTFS file systems.\n\nFinally, the wiper attempts to shut the system down with a\ncall to InitiateSystemShutdownExW. Once the victim machine is\nrebooted, the user is presented with an error message indicating\nthat their system cannot boot. In the case of MBR-style disks,\nthe victim is presented with a message similar to the one shown\nin Figure 5; or in the case of GPT-style disks, the one shown\nin Figure 6. In both cases, although the MBR is still intact,\nthe system is unable to boot due to the corrupted file system\npartition containing the Operating System.\n\n\n-----\n\n_Figure 3: SZDD compressed resources stored in the resource section of the wiper (Source: Recorded Future)_\n\n_Figure 4: Disabling and stopping the VSS service (Source: Recorded Future)_\n\n\n-----\n\n_Figure 5: Boot screen after infection on a MBR disk (Source: Recorded Future)_\n\n_Figure 6: Boot screen after infection on a GPT disk (Source: Recorded Future)_\n\n##### PartyTicket\n\nInsikt Group analyzed the ransomware associated with the\nHermeticWiper malware, dubbed PartyTicket. The ransomware\ncontained several path strings and function names that allude to\nthe White House, Joe Biden, and elections, among other topics,\nseen below in Figures 7 and 8.\n\n_Figure 7: Paths contained in the ransomware (Source: Recorded Future)_\n\n\n_Figure 8: Ransomware function names (Source: Recorded Future)_\n\nSimilarly, the ransom note dropped by the malware contained\nemail addresses on similar topics, and the encrypted files were\nrenamed with the suffix “[vote2024forjb@protonmail[.]com].\nencryptedJB”, as shown in Figure 10.\n\n_Figure 9: Example of encrypted file with extension (Source: Recorded Future)_\n\nFigure 10 below shows the ransomware note dropped by\nPartyTicket. While Insikt Group cannot currently attribute the\nransomware to any specific group, the note differs substantially\nfrom that of other ransomware groups we have seen.\n\n\n-----\n\n_Figure 10: Ransom note (Source: Recorded Future)_\n\nThere is no “branding” identifying a particular ransomware\ngroup responsible for the attack, and there are several\nmisspellings and grammatical errors throughout the note. As\na result, the ransomware component of the HermeticWiper\nmalware is unlikely to have been developed and distributed by a\ncriminal ransomware group. Further, the malware contains a list\nof files, shown in Figure 12 below, that it seeks to encrypt. Unlike\nall other recent, criminal-operated ransomware variants, this list\nincludes files that are key to the ability of the victim system to\noperate, including .dll and .exe files. This further suggests that\nthis is not legitimate ransomware but rather a destructive piece\nof malware.\n\n-inf .acl, .avi .bat .bmp .cab .cfg .chm .cmd .com .crt .css\n.dat .dip .dll .doc .dot .exe .gif .htm .ico .iso .jpg .mp3 .msi\n.odt .one .ova .pdf .png .ppt .pub .rar .rtf .sfx .sql .txt .url .vdi\n.vsd .wma .wmv .wtv .xls .xml .xps .zip\n\n_Figure 11: File extensions the “ransomware” seeks to encrypt (Source: Recorded Future)_\n\n\n-----\n\n#### Mitigations\n\nThe compromised systems leading to the delivery of the\nwiper have involved exploitation of vulnerable systems: a\nMicrosoft Exchange server, and an Apache Tomcat server.\nDefenders concerned specifically about HermeticWiper should\nensure that any such servers on their networks are fully updated\nand patched. Similarly, enterprises should prioritize detection of\nweb shells and exploitation on their perimeters. Detection of a\nwiper malware at the point of execution is often too late in the kill\nchain to ensure continued organizational operations. Focusing\non the initial stages is important to avoid such malware being\nexecuted.\n\nEndeavoring to prevent, detect and block early-stage activity\nobserved in the delivery of HermeticWiper, such as malicious\nPowerShell usage and SMB exploitation, is thus recommended.\nThe adversary, nimble enough to exploit more than one type of\nsystem to deliver HermeticWiper, is likely capable of delivering\nmalware to other vulnerable systems as well, and consistent\npatching and updating of all external-facing systems is therefore\ncritical.\n\n[On February 26, 2022, CISA issued an alert concerning the](https://www.cisa.gov/uscert/ncas/alerts/aa22-057a)\nuse of destructive malware, specifically HermeticWiper and\nWhisperGate, against Ukrainian organizations. General best\npractices and mitigations for wiper malware are provided in the\nalert. By keeping updated on the current situation in Ukraine, in\nparticular in the cyber realm, an organization can better prioritize\npatching and other mitigations based on what is currently known\nof potential threats.\n\nInsikt Group has provided 2 YARA rules to detect\nHermeticWiper and PartyTicket in Appendix B.\n\n\n#### Outlook\n\nThis is the second destructive malware that has emerged\nover the past month, coinciding with the timing of attacks on\nUkraine, and exhibiting a methodology similar to past attacks\nby Russian government-associated actors. We expect further\ncyberattacks or malicious tools to emerge and be used to\ndestroy data and cause other disruptions. While there is not\nenough evidence to tie either of these wipers to a specific threat\nactor or group, HermeticWiper’s similarities to previous Russian\nstate-linked malware variants, such as NotPetya, could suggest\nsome relationship.\n\n\n-----\n\n#### Appendix A: SetFilePointerEx and WriteFile Windows API Calls\n\nThe table below shows the output from the tool API Monitor and was specifically capturing the API calls SetFilePointerEx,\nWriteFile, and wnsprintfw. To get the drive index location that SetFilePointerEx is pointing to, you must combine the “HighPart”\nand “LowPart” values to get the full index. For example, the full index for the call, “SetFilePointerEx ( 0x0000026c, { u = { LowPart\n= 2539999232, HighPart = 17 }, QuadPart = 75554443264 }, NULL, FILE_BEGIN )” would be 172539999232.\n\n|Module|API|\n|---|---|\n|1bc44.exe|wnsprintfW ( \"\", 260, \"\\\\.\\EPMNTDRV\\%u\", ... )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2539999232, HighPart = 17 }, QuadPart = 75554443264 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540003328, HighPart = 17 }, QuadPart = 75554447360 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540007424, HighPart = 17 }, QuadPart = 75554451456 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540011520, HighPart = 17 }, QuadPart = 75554455552 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540015616, HighPart = 17 }, QuadPart = 75554459648 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540019712, HighPart = 17 }, QuadPart = 75554463744 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540023808, HighPart = 17 }, QuadPart = 75554467840 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540027904, HighPart = 17 }, QuadPart = 75554471936 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540032000, HighPart = 17 }, QuadPart = 75554476032 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540036096, HighPart = 17 }, QuadPart = 75554480128 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540040192, HighPart = 17 }, QuadPart = 75554484224 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n\n\nSetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540044288, HighPart = 17 }, QuadPart = 75554488320\n1bc44.exe\n}, NULL, FILE_BEGIN )\n\n\n-----\n\n|Module|API|\n|---|---|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540048384, HighPart = 17 }, QuadPart = 75554492416 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540052480, HighPart = 17 }, QuadPart = 75554496512 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540056576, HighPart = 17 }, QuadPart = 75554500608 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540060672, HighPart = 17 }, QuadPart = 75554504704 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540064768, HighPart = 17 }, QuadPart = 75554508800 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540068864, HighPart = 17 }, QuadPart = 75554512896 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540072960, HighPart = 17 }, QuadPart = 75554516992 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540077056, HighPart = 17 }, QuadPart = 75554521088 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540081152, HighPart = 17 }, QuadPart = 75554525184 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540085248, HighPart = 17 }, QuadPart = 75554529280 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540089344, HighPart = 17 }, QuadPart = 75554533376 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540093440, HighPart = 17 }, QuadPart = 75554537472 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540097536, HighPart = 17 }, QuadPart = 75554541568 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n\n\n-----\n\n|Module|API|\n|---|---|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540101632, HighPart = 17 }, QuadPart = 75554545664 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540105728, HighPart = 17 }, QuadPart = 75554549760 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540109824, HighPart = 17 }, QuadPart = 75554553856 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2540113920, HighPart = 17 }, QuadPart = 75554557952 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 393588736, HighPart = 0 }, QuadPart = 393588736 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 393592832, HighPart = 0 }, QuadPart = 393592832 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 393596928, HighPart = 0 }, QuadPart = 393596928 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 393601024, HighPart = 0 }, QuadPart = 393601024 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 393605120, HighPart = 0 }, QuadPart = 393605120 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2068054016, HighPart = 0 }, QuadPart = 2068054016 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2068058112, HighPart = 0 }, QuadPart = 2068058112 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x0000026c, { u = { LowPart = 2068062208, HighPart = 0 }, QuadPart = 2068062208 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x0000026c, 0x01587470, 4096, 0x044dfa68, NULL )|\n|1bc44.exe|wnsprintfW ( \"\", 260, \"\\\\.\\PhysicalDrive%u\", ... )|\n|1bc44.exe|wnsprintfW ( \"\", 260, \"\\\\.\\EPMNTDRV\\%u\", ... )|\n|1bc44.exe|SetFilePointerEx ( 0x00000204, { u = { LowPart = 1048576, HighPart = 0 }, QuadPart = 1048576 }, NULL, FILE_BEGIN )|\n\n\n-----\n\n|Module|API|\n|---|---|\n|1bc44.exe|WriteFile ( 0x00000204, 0x0158ef48, 4096, 0x06b2f630, NULL )|\n|1bc44.exe|wnsprintfW ( \"\", 260, \"\\\\.\\EPMNTDRV\\%u\", ... )|\n|1bc44.exe|SetFilePointerEx ( 0x00000214, { u = { LowPart = 3566206976, HighPart = 0 }, QuadPart = 3566206976 }, NULL, FILE_BEGIN )|\n|1bc44.exe|wnsprintfW ( \"\\\\.\\PhysicalDrive0\", 260, \"\\\\.\\PhysicalDrive%u\", ... )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429767680, HighPart = 2 }, QuadPart = 11019702272 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429769728, HighPart = 2 }, QuadPart = 11019704320 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429771776, HighPart = 2 }, QuadPart = 11019706368 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429773824, HighPart = 2 }, QuadPart = 11019708416 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429775872, HighPart = 2 }, QuadPart = 11019710464 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429777920, HighPart = 2 }, QuadPart = 11019712512 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429779968, HighPart = 2 }, QuadPart = 11019714560 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429782016, HighPart = 2 }, QuadPart = 11019716608 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429784064, HighPart = 2 }, QuadPart = 11019718656 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 2429786112, HighPart = 2 }, QuadPart = 11019720704 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 4098506752, HighPart = 2 }, QuadPart = 12688441344 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 4098508800, HighPart = 2 }, QuadPart = 12688443392 }, NULL, FILE_BEGIN )|\n\n\n-----\n\n|Module|API|\n|---|---|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 344981504, HighPart = 0 }, QuadPart = 344981504 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 344983552, HighPart = 0 }, QuadPart = 344983552 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n|1bc44.exe|SetFilePointerEx ( 0x00000248, { u = { LowPart = 1048576, HighPart = 0 }, QuadPart = 1048576 }, NULL, FILE_BEGIN )|\n|1bc44.exe|WriteFile ( 0x00000248, 0x0158e538, 2048, 0x06c6f820, NULL )|\n\n\n-----\n\n#### Appendix B: YARA Rules\n\n\nimport \"pe\"\nimport \"hash\"\n\nrule HermeticWiper{\nmeta:\nauthor = \"CNANCE, Insikt Group, Recorded Future\"\ndate = \"2022-02-24\"\ndescription = \"Rule to detect HermeticWiper malware\"\nversion = \"1.0\"\nhash = \"1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\"\nhash = \"0385eeab00e946a302b24a91dea4187c1210597b8e17cd9e2230450f5ece21da\"\nhash = \"2c10b2ec0b995b88c27d141d6f7b14d6b8177c52818687e4ff8e6ecf53adf5bf\"\nRF_MALWARE = \"HermeticWiper\"\n\nstrings:\n// paths\n$p1 = \"\\\\\\\\.\\\\EPMNTDRV\\\\%u\" fullword wide\n$p2 = \"\\\\\\\\.\\\\PhysicalDrive%u\" fullword wide\n\n// disable crash dumps\n$r1 = \"SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl\" fullword wide\n$r2 = \"CrashDumpEnabled\" fullword wide\n\n// privileges\n$s1 = \"SeLoadDriverPrivilege\" fullword wide\n$s2 = \"SeBackupPrivilege\" fullword wide\n// stack string: S.eS.hu.td.o..i.vi.le.ge\n$s3 = { c7 4? ?? 61 00 62 00 c7 4? ?? 63 00 64 00 c7 4? ?? 65 00 66 00 c7 4? ?? 67 00 68 00 c7 4? ?? 69 00 6a 00 c7\n4? ?? 6b 00 6c 00 c7 4? ?? 6d 00 6e 00 c7 4? ?? 6f 00 70 00 c7 4? ?? 71 00 72 00 c7 4? ?? 73 00 74 00 c7 4? ?? 75 00 76\n00 c7 4? ?? 77 00 78 00 c7 4? ?? 79 00 7a 00 }\n\ncondition:\nuint16(0) == 0x5a4d // PE file\nand filesize > 90KB\nand all of them\nand for any i in (0..pe.number_of_signatures): (\npe.signatures[i].thumbprint == \"1ae7556dfacd47d9efbe79be974661a5a6d6d923\" // Hermetica Digital Ltd certificate\n)\nand for 2 i in (0..pe.number_of_resources): (\npe.resources[i].type_string == \"R\\x00C\\x00D\\x00A\\x00T\\x00A\\x00\"\nand (\n// Check resource names\n(\npe.resources[i].name_string == \"D\\x00R\\x00V\\x00_\\x00X\\x006\\x004\\x00\"\nor pe.resources[i].name_string == \"D\\x00R\\x00V\\x00_\\x00X\\x008\\x006\\x00\"\nor pe.resources[i].name_string == \"D\\x00R\\x00V\\x00_\\x00X\\x00P\\x00_\\x00X\\x006\\x004\\x00\"\nor pe.resources[i].name_string == \"D\\x00R\\x00V\\x00_\\x00X\\x00P\\x00_\\x00X\\x008\\x006\\x00\"\n)\n\n\n-----\n\nor\n// Check hashes for EaseUS driver\n(\nhash.sha256(pe.resources[i].offset, pe.resources[i].length) ==\n\"e5f3ef69a534260e899a36cec459440dc572388defd8f1d98760d31c700f42d5\"\nor hash.sha256(pe.resources[i].offset, pe.resources[i].length) ==\n\"b01e0c6ac0b8bcde145ab7b68cf246deea9402fa7ea3aede7105f7051fe240c1\"\nor hash.sha256(pe.resources[i].offset, pe.resources[i].length) ==\n\"b6f2e008967c5527337448d768f2332d14b92de22a1279fd4d91000bb3d4a0fd\"\nor hash.sha256(pe.resources[i].offset, pe.resources[i].length) ==\n\"fd7eacc2f87aceac865b0aa97a50503d44b799f27737e009f91f3c281233c17d\"\n)\n)\n)\n}\n\nrule MAL_PartyTicket{\nmeta:\nauthor = \"LKAYE, Insikt Group, Recorded Future\"\ndate = \"2022-02-24\"\ndescription = \"Rule to detect pseudo-ransomware associated with HermeticWiper malware\"\nversion = \"1.0\"\nhash = \"4dc13bb83a16d4ff9865a51b3e4d24112327c526c1392e14d56f20d6f4eaf382\"\nRF_MALWARE = \"HermeticWiper\"\n\nstrings:\n$s1 = \"403forBiden\" ascii\n$s2 = \"wHiteHousE\" ascii\n$s3 = \".exe.gif.htm.ico.iso.jpg.mp3.msi.odt.\" ascii //this is fairly unusual for modern, professional ransomware to encrypt\nexes\n$s4 = \"main.voteFor403\" ascii\n$s5 = \"main.n1hk9\" ascii\n$s6 = \"Thank you for your vote!\" ascii //part of ransom note\n$s7 = \"photoes\" ascii //misspelling in ransom note\n\ncondition:\nuint16(0) == 0x5a4d and\nfilesize > 3000KB and\nall of them\n}\n\n\n-----\n\n#### Appendix C: IOCs\n\nHermeticWiper Sample (SHA256):\n\nRansomware Sample (SHA256):\n\n\n-----\n\nAbout Recorded Future\n\nRecorded Future is the world’s largest intelligence company. The Recorded\n\nFuture Intelligence Platform provides the most complete coverage across adversaries,\n\ninfrastructure, and targets. By combining persistent and pervasive automated data\n\ncollection and analytics with human analysis, Recorded Future provides real-time visibility\n\ninto the vast digital landscape and empowers clients to take proactive action to disrupt\n\nadversaries and keep their people, systems, and infrastructure safe. Headquartered in\n\nBoston with offices and employees around the world, Recorded Future works with more\n\nthan 1,300 businesses and government organizations across 60 countries.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/t5hdmw12wxi1vi0nwnvz4tv8zeh1quc8",
        "https://go.recordedfuture.com/hubfs/reports/mtp-2022-0302.pdf"
    ],
    "report_names": [
        "RecordedFuture_mtp-2022-0302(03-02-2022)",
        "mtp-2022-0302.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1646215526,
    "ts_modification_date": 1646215824,
    "files": {
        "pdf": "https://archive.orkl.eu/afd4c1685181d626ba8169f95ba50c655dd8d33d.pdf",
        "text": "https://archive.orkl.eu/afd4c1685181d626ba8169f95ba50c655dd8d33d.txt",
        "img": "https://archive.orkl.eu/afd4c1685181d626ba8169f95ba50c655dd8d33d.jpg"
    }
}